{"parent": "", "timestamp": "Dec 30, 2016", "title": "2017 KEY TO SMALL BUSINESS SOCIAL MEDIA MARKETING", "sentences": [{"8edf": "2017 KEY TO SMALL BUSINESS SOCIAL MEDIA MARKETING"}, {"ec91": "Here’s my 2017 New Year’s resolution to you: I want you to focus on your organic social media reach for the next year. As we wrap up 2016, I’ve been reviewing my core strategy for my personal brand and why it matters for all of my clients, small business friends, contemporaries, and others putting out branded content. Over the past year, I got really serious about putting out content on YouTube, Facebook, Snapchat, and, most recently, Instagram as they introduced new platform features."}, {"12a9": "Take a look at this Google Trends chart:"}, {"b14e": "This is what you see when you type in “Gary Vaynerchuk.”"}, {"39ed": "A lot happened this year with my personal brand. But, what’s most fascinating to me is the minimal amount of money I put behind paid advertising. Yes, I put money behind some YouTube pre-rolls and paid for the amplification of some Facebook video, but not to the levels of what the majority of you spend (or would spend) to see big results."}, {"0b6b": "When you start to really understanding what social media is today (in 2016) and where it’s going in 2017, you start realizing that social media is just the slang term for the current state of the internet."}, {"619f": "Here’s the key statement: In 2017, if you are a business or organization of any kind that wants to be heard in the world, refocusing on the content you put out on Facebook, Twitter, Instagram, Snapchat, YouTube, Linkedin, Medium, and whatever else has the market’s attention at the time, is a huge factor."}, {"5db2": "For the last two to three years, people have dismissed organic content because of the rise of paid advertising. And yes, paid social media has enormous upside and incredible and, in my opinion, is the best deal in all of advertising (aside from advertising during the Super Bowl). However, what has emerged in the paranoia of everyone thinking social media only works when you spend money, is a lack of hustle and a lack of understanding that great content, especially when amplified in subtle ways, can be unbelievably effective."}, {"6581": "What I mean by “amplified in subtle ways” is that, for example, if you just start using the proper hashtags on Instagram, you can easily start being discovered over time. Whether you’re a local pizza shop or a car dealership, or an artist, or rapper, or a Fortune 500 B2B company, using hashtags is an unbelievably organic way to hit discoverability and create amplification for your content. And if you have paid media dollars, even just spending $100–300 a week on the amplification of your YouTube and Facebook video content, it can make your content explode."}, {"2098": "Here’s the thing: no amount of paid media is going to turn bad creative into good content. It’s the same way that no amount of VC money is going to save a bad product. That’s why you need to invest in the long-game of improving your brand’s content (and you do that by creating a lot of it)."}, {"7373": "Basically, here’s my overall belief: if you’re a small business, you want to focus on spending your time, money, and effort on creating great content (and a lot of it). You should be spending $85,000 a year on creating quality content and only another $35,000 on paid amplification — not the other way around. It excites me to no end to think about the fact that most small business (and even A-list personalities) waste $250,000–500,000 a year on tactics like websites, PR, direct mail, or paid media when they could have just gone all in on organic social content and a small amplification budget to achieve more valuable results."}, {"f68d": "The biggest thing people don’t understand is that quality content is so important to marketing to anyone under the age of 40 right now. Anyone in that demographic discovers a business for the first time by either: (A) Google searching or (B) finding their content on social media. If you are not crushing it and focusing on the content that you put out on the most important social platforms, you’re going to become mute and obsolete in the modern day of doing business. That’s why organic reach is so important because the impression you get when someone comes directly to your page is a much more qualified lead and potentially a more valuable customer than someone you got through an ad buy."}, {"b976": "No amount of paid media is going to turn bad creative into good content."}, {"81e9": "There’s plenty of different paid tactics (Facebook Advertising, Instagram influencer marketing, YouTube pre-rolls, Snapchat new ad product, etc.) that will help grow your audience, but the opportunity to get very serious about the content that you put out in an organic way on social networks matter. Why? Because it is the most natural and current state of the internet. While the supply and demand shift for paid media becomes more saturated, it leaves an incredible opening for the brands that make great content to grow the right way."}, {"97d7": "Thanks for reading! :) If you enjoyed it, hit that heart button below."}, {"cc3a": "FYI: this article originally appeared on my website."}], "author": "Gary Vaynerchuk", "child": "1442_1\t1442_2\t1442_3\t1442_4\t1442_5\t1442_6\t1442_7\t1442_8\t1442_9\t1442_10\t1442_11\t1442_12\t1442_13\t1442_14\t1442_15\t1442_16\t1442_17\t1442_18\t1442_19\t1442_20\t1442_21\t1442_22\t1442_23\t1442_24", "name": "1442", "content": "2017 KEY TO SMALL BUSINESS SOCIAL MEDIA MARKETING Here’s my 2017 New Year’s resolution to you: I want you to focus on your organic social media reach for the next year. As we wrap up 2016, I’ve been reviewing my core strategy for my personal brand and why it matters for all of my clients, small business friends, contemporaries, and others putting out branded content. Over the past year, I got really serious about putting out content on YouTube, Facebook, Snapchat, and, most recently, Instagram as they introduced new platform features. Take a look at this Google Trends chart: This is what you see when you type in “Gary Vaynerchuk.” A lot happened this year with my personal brand. But, what’s most fascinating to me is the minimal amount of money I put behind paid advertising. Yes, I put money behind some YouTube pre-rolls and paid for the amplification of some Facebook video, but not to the levels of what the majority of you spend (or would spend) to see big results. When you start to really understanding what social media is today (in 2016) and where it’s going in 2017, you start realizing that social media is just the slang term for the current state of the internet. Here’s the key statement: In 2017, if you are a business or organization of any kind that wants to be heard in the world, refocusing on the content you put out on Facebook, Twitter, Instagram, Snapchat, YouTube, Linkedin, Medium, and whatever else has the market’s attention at the time, is a huge factor. For the last two to three years, people have dismissed organic content because of the rise of paid advertising. And yes, paid social media has enormous upside and incredible and, in my opinion, is the best deal in all of advertising (aside from advertising during the Super Bowl). However, what has emerged in the paranoia of everyone thinking social media only works when you spend money, is a lack of hustle and a lack of understanding that great content, especially when amplified in subtle ways, can be unbelievably effective. What I mean by “amplified in subtle ways” is that, for example, if you just start using the proper hashtags on Instagram, you can easily start being discovered over time. Whether you’re a local pizza shop or a car dealership, or an artist, or rapper, or a Fortune 500 B2B company, using hashtags is an unbelievably organic way to hit discoverability and create amplification for your content. And if you have paid media dollars, even just spending $100–300 a week on the amplification of your YouTube and Facebook video content, it can make your content explode. Here’s the thing: no amount of paid media is going to turn bad creative into good content. It’s the same way that no amount of VC money is going to save a bad product. That’s why you need to invest in the long-game of improving your brand’s content (and you do that by creating a lot of it). Basically, here’s my overall belief: if you’re a small business, you want to focus on spending your time, money, and effort on creating great content (and a lot of it). You should be spending $85,000 a year on creating quality content and only another $35,000 on paid amplification — not the other way around. It excites me to no end to think about the fact that most small business (and even A-list personalities) waste $250,000–500,000 a year on tactics like websites, PR, direct mail, or paid media when they could have just gone all in on organic social content and a small amplification budget to achieve more valuable results. The biggest thing people don’t understand is that quality content is so important to marketing to anyone under the age of 40 right now. Anyone in that demographic discovers a business for the first time by either: (A) Google searching or (B) finding their content on social media. If you are not crushing it and focusing on the content that you put out on the most important social platforms, you’re going to become mute and obsolete in the modern day of doing business. That’s why organic reach is so important because the impression you get when someone comes directly to your page is a much more qualified lead and potentially a more valuable customer than someone you got through an ad buy. No amount of paid media is going to turn bad creative into good content. There’s plenty of different paid tactics (Facebook Advertising, Instagram influencer marketing, YouTube pre-rolls, Snapchat new ad product, etc.) that will help grow your audience, but the opportunity to get very serious about the content that you put out in an organic way on social networks matter. Why? Because it is the most natural and current state of the internet. While the supply and demand shift for paid media becomes more saturated, it leaves an incredible opening for the brands that make great content to grow the right way. Thanks for reading! :) If you enjoyed it, hit that heart button below. FYI: this article originally appeared on my website. "}