{"parent": "", "timestamp": "Mar 31", "title": "Donald Trump is a better storyteller than Ernest Hemingway", "sentences": [{"e3d1": "Donald Trump is a better storyteller than Ernest Hemingway"}, {"2c6e": "Feelings vs. facts and how they apply to the universal story of the underdog."}, {"5cbf": "Ernest Hemingway, it’s said, once wrote the world’s shortest novel."}, {"b473": "While lunching with friends at The Algonquin, Hemingway wagers each friend that he can craft an entire story in six words. After the pot is assembled, Hemingway writes on a napkin and passes the napkin around the table. His friends take one look, acknowledge the story’s brilliance, and Hemingway collects his winnings. The six words on the napkin: “For sale: baby shoes, never worn.”"}, {"26d1": "So much sadness, so few words."}, {"c903": "Turns out, it likely wasn’t Hemingway who wrote this heartbreaking work of staggering brevity."}, {"aa60": "But the authorship is only a gilding anyway, a plausible pedigree that helps the story travel."}, {"aff6": "Rather, what’s notable is the extreme terseness of the form. Hemingway’s story is, quite literally, only a single image: that tragic “for sale” sign."}, {"13ae": "We don’t know what happened before this moment: the story begins after the beginning. We don’t know what will happen after this moment: the story ends before the end."}, {"6dbd": "Everything is implied at the edges. We’re invited to imagine the rest."}, {"0b50": "So we can graph this thing"}, {"926c": "If you’re given to reductive simplicity—or, if during a heated discussion at a bar, you were challenged by an incredulous friend to prove your absurd claim that Trump is a better storyteller than Hemingway—then you may find it useful to create a supporting exhibit by drawing the shapes of stories on a napkin."}, {"2ca3": "The world of every story looks like this:"}, {"d492": "Every story relates the facts of the past, the present, and the future. And every story evokes feelings about that past, that present, and that future."}, {"cd77": "You, the reader, are always in the present and having feelings about the present, the past, and the future."}, {"60e4": "Whatever you’re feeling, it’s probably a variation of the labels in these quadrants:"}, {"9e8e": "If we feel good about the past, we’re nostalgic. If we feel badly about the past, we’re sad. If the future looks bad, we’re fearful. And if the future looks good, we have hope."}, {"61d7": "This is a serviceable enough way to understand stories, specifically, and daily existence, generally. There is only the fact of now, how you feel about now, and how you feel about the past and the future."}, {"e78f": "Now the most common reading of “Baby shoes” is that we’ve been plopped down in the middle of a tragedy. There’s that sign: “For Sale: Baby shoes, never worn”."}, {"f0dc": "But the tragedy isn’t the sign; the tragedy is how we got to that sign."}, {"c9b4": "If you happen to be in a bar and you ask several patrons what happened before the “For Sale” sign was deployed, I have it on good authority that most people will say the baby died. If you ask what happened before the baby died, the kindly patrons who are humoring your questions about dead babies will suggest that the couple was happily married."}, {"d520": "In other words, the story has a nostalgic past."}, {"d4ab": "The open question is the future: after this low point of selling dead baby shoes, will we struggle towards a better future, or move to Mexico and drink ourselves under the volcano?"}, {"d4b9": "Let’s go ahead and assume a hopeful future. In which case, the story looks like this:"}, {"1d7f": "In which we bounce back from selling dead baby shoes."}, {"1c54": "Of course, there are infinite ways to imagine this story, and you are free, should you be in a similar argument in a bar, to suggest as much."}, {"45e3": "Maybe a millennial is selling unworn baby shoes because his kickstarted startup has disrupted the baby shoe market, but he’s afraid Facebook will copy his idea:"}, {"0b20": "The curve is small because nobody likes a millennial who disrupts the baby shoe market."}, {"d18b": "Or maybe it’s a rag to riches story about an enterprising homeless man who stole a truck full of baby shoes as a stepping stone to becoming a toddler wares baron:"}, {"2673": "The curve is large because everybody loves a rags-to-riches toddler wares baron."}, {"f05f": "These are both dystopias, by the way."}, {"462b": "But regardless of how you imagine “Baby shoes”, there are two powerful lessons here."}, {"335e": "One, the power of the story isn’t the sign that says “For Sale”. The power of the story is what we imagine about the story. The story invites you to control the story. The story gives you agency."}, {"1d23": "Two, status quo is never a story. Every story is the story of change. Your agency is in imagining the changes and how you feel about them. This, by the way, is why your parents told you can do anything you can put your mind to, and also why therapy works."}, {"a83e": "Thus, with “Baby shoes”, you are invited to imagine a family facing the ultimate grief. Once, they were happy. Now, they must fight to be happy again."}, {"d319": "This is the story of the underdog."}, {"c79c": "It is universal."}, {"7511": "Hemingway knew that."}, {"e2e6": "Donald Trump knows it better."}, {"dada": "As if to say: “Seriously?”"}, {"51c8": "The greatest story ever sold"}, {"cc06": "Donald Trump, it’s said, once wrote the world’s catchiest campaign slogan."}, {"e243": "While sitting in his office in Trump Tower, Donald bet that he could tell the story of the electorate in four words. It would make no nod to civility or diversity or inclusivity — those values that people assume yoke people to a common cause. He wrote it down. He told his lawyers to trademark it. He told his marketers to print it on a hat. Today he’s the President of the United States of America. He still wears the hat. The slogan: “Make America Great Again”."}, {"c194": "So much emotion, so few words."}, {"d9d6": "Turns out, it likely wasn’t Trump who first wrote this pithy work of staggering brevity."}, {"a7fd": "But, like Hemingway, he is the slogan’s perfect vehicle. And, like Hemingway, his slogan tells an infinitely extensible story."}, {"9aeb": "But Trump’s story does it better."}, {"4090": "Hemingway’s “Baby shoes” gives you one clear picture of the present: a sign that says “For Sale”."}, {"8c11": "It pins the story to that moment. You are free to imagine any past. You are free to imagine any future. But you must begin by imagining that sign. Its variables are the past and the future. Its constant is the present."}, {"abbd": "MAGA does the opposite."}, {"6a59": "MAGA’s constants are the past and the future. Its variable is the present. You are free to imagine a great past. You are free to imagine a great future. But you must begin with whatever your situation is right now."}, {"2015": "Another way of saying it:"}, {"3044": "“Baby shoes” makes a fact applicable to any feeling; MAGA makes a feeling applicable to any fact."}, {"afb1": "And in the battle between facts vs. feelings, like Newt Gingrich said, “I’ll go with how people feel.”"}, {"d25f": "A three-act play in only four words"}, {"a619": "MAGA is a three-act play in only four words — five words, if you count the unspoken “you” at the story’s beginning."}, {"3aa5": "In the story of MAGA, the first words—“(you) make”—give the reader agency. Those words make the slogan both a designation (“you make America great again”) and an exhortation (“you: Make America great again”)."}, {"6ea9": "The last two words — “Great Again” — do double work. They say that America was once great (nostalgic past), and America will be great again (hopeful future). This greatness is an assumed worldview. There are no possibilities other than America was great and it will be again."}, {"9ed2": "“Make America Great Again”"}, {"6752": "They don’t say exactly what that greatness was or will be, but they peg how you feel about the past and the future. They give you a broad range to work with."}, {"e4aa": "America could have been great because it had unions. Or America could have been great because it had Jim Crow. Or because it had a middle class. Or a coal mining industry. Or muscle cars. Or whatever."}, {"4dd6": "America will be great because it will have a bigger military. Or fewer hispanics. Or fewer women in office. Or fewer elites telling you what to do. Or whatever."}, {"3a98": "After you’ve set the past and the future, what’s left is the unspoken present. The unspoken present is a variable. The present can be whatever reality you, the reader, are experiencing."}, {"13dc": "You could be a coal miner who remembers a coal-mining past and envisions a coal-mining future. Or a suburban Republican who remembers when schools weren’t integrated and there weren’t so many blacks in the neighborhood. Or an evangelical politician who remembers when Christians weren’t mocked on television and there weren’t so many transexuals in the bathrooms."}, {"4788": "Or, y’know, whatever."}, {"016b": "The important point is this: the worse off you are — the bigger your change in emotional state from past to present — the more powerful MAGA is to you."}, {"3711": "These state changes are why MAGA isn’t a throwback to the past. It’s a rallying cry for the future. You were once happy and you will be happy again."}, {"2f29": "This is also why the rejoinder “America is already great” doesn’t work. If it’s already great, what’s the story? Where do we go next?"}, {"725b": "Tell me a story, but don’t tell it too strict."}, {"94b8": "Tell me a story I want to tell myself."}, {"3b3c": "Every story is the story of change, and every change is a story. The facts of the story don’t much matter. How the facts make you feel does. And no single fact exists in a vacuum."}, {"9035": "This is, of course, why telling your fact-free family the truth doesn’t change their minds. So says everyone from the eggheads to the transcendentalists. “The fact you tell is of no value,” wrote Emerson. “Only the impression.”"}, {"a2b7": "Hemingway knew this. He knew that the fact of the “For Sale” sign would make his readers feel nostalgia, sadness, fear, and hope."}, {"5afa": "Trump knew this, too."}, {"d6be": "He knew his followers already had nostalgia and hope."}, {"46f1": "He only needed to acknowledge the infinite variation of their sadness and fear."}], "author": "Steve Bryant", "child": "1446_1\t1446_2\t1446_3\t1446_4\t1446_5\t1446_6\t1446_7\t1446_8\t1446_9\t1446_10\t1446_11\t1446_12\t1446_13\t1446_14\t1446_15\t1446_16\t1446_17\t1446_18\t1446_19\t1446_20\t1446_21\t1446_22\t1446_23\t1446_24\t1446_251446_1\t1446_2\t1446_3\t1446_4\t1446_5\t1446_6\t1446_7\t1446_8\t1446_9\t1446_10\t1446_11\t1446_12\t1446_13\t1446_14\t1446_15\t1446_16\t1446_17\t1446_18\t1446_19\t1446_20\t1446_21\t1446_22\t1446_23\t1446_24\t1446_25", "name": "1446", "content": "Donald Trump is a better storyteller than Ernest Hemingway Feelings vs. facts and how they apply to the universal story of the underdog. Ernest Hemingway, it’s said, once wrote the world’s shortest novel. While lunching with friends at The Algonquin, Hemingway wagers each friend that he can craft an entire story in six words. After the pot is assembled, Hemingway writes on a napkin and passes the napkin around the table. His friends take one look, acknowledge the story’s brilliance, and Hemingway collects his winnings. The six words on the napkin: “For sale: baby shoes, never worn.” So much sadness, so few words. Turns out, it likely wasn’t Hemingway who wrote this heartbreaking work of staggering brevity. But the authorship is only a gilding anyway, a plausible pedigree that helps the story travel. Rather, what’s notable is the extreme terseness of the form. Hemingway’s story is, quite literally, only a single image: that tragic “for sale” sign. We don’t know what happened before this moment: the story begins after the beginning. We don’t know what will happen after this moment: the story ends before the end. Everything is implied at the edges. We’re invited to imagine the rest. So we can graph this thing If you’re given to reductive simplicity—or, if during a heated discussion at a bar, you were challenged by an incredulous friend to prove your absurd claim that Trump is a better storyteller than Hemingway—then you may find it useful to create a supporting exhibit by drawing the shapes of stories on a napkin. The world of every story looks like this: Every story relates the facts of the past, the present, and the future. And every story evokes feelings about that past, that present, and that future. You, the reader, are always in the present and having feelings about the present, the past, and the future. Whatever you’re feeling, it’s probably a variation of the labels in these quadrants: If we feel good about the past, we’re nostalgic. If we feel badly about the past, we’re sad. If the future looks bad, we’re fearful. And if the future looks good, we have hope. This is a serviceable enough way to understand stories, specifically, and daily existence, generally. There is only the fact of now, how you feel about now, and how you feel about the past and the future. Now the most common reading of “Baby shoes” is that we’ve been plopped down in the middle of a tragedy. There’s that sign: “For Sale: Baby shoes, never worn”. But the tragedy isn’t the sign; the tragedy is how we got to that sign. If you happen to be in a bar and you ask several patrons what happened before the “For Sale” sign was deployed, I have it on good authority that most people will say the baby died. If you ask what happened before the baby died, the kindly patrons who are humoring your questions about dead babies will suggest that the couple was happily married. In other words, the story has a nostalgic past. The open question is the future: after this low point of selling dead baby shoes, will we struggle towards a better future, or move to Mexico and drink ourselves under the volcano? Let’s go ahead and assume a hopeful future. In which case, the story looks like this: In which we bounce back from selling dead baby shoes. Of course, there are infinite ways to imagine this story, and you are free, should you be in a similar argument in a bar, to suggest as much. Maybe a millennial is selling unworn baby shoes because his kickstarted startup has disrupted the baby shoe market, but he’s afraid Facebook will copy his idea: The curve is small because nobody likes a millennial who disrupts the baby shoe market. Or maybe it’s a rag to riches story about an enterprising homeless man who stole a truck full of baby shoes as a stepping stone to becoming a toddler wares baron: The curve is large because everybody loves a rags-to-riches toddler wares baron. These are both dystopias, by the way. But regardless of how you imagine “Baby shoes”, there are two powerful lessons here. One, the power of the story isn’t the sign that says “For Sale”. The power of the story is what we imagine about the story. The story invites you to control the story. The story gives you agency. Two, status quo is never a story. Every story is the story of change. Your agency is in imagining the changes and how you feel about them. This, by the way, is why your parents told you can do anything you can put your mind to, and also why therapy works. Thus, with “Baby shoes”, you are invited to imagine a family facing the ultimate grief. Once, they were happy. Now, they must fight to be happy again. This is the story of the underdog. It is universal. Hemingway knew that. Donald Trump knows it better. As if to say: “Seriously?” The greatest story ever sold Donald Trump, it’s said, once wrote the world’s catchiest campaign slogan. While sitting in his office in Trump Tower, Donald bet that he could tell the story of the electorate in four words. It would make no nod to civility or diversity or inclusivity — those values that people assume yoke people to a common cause. He wrote it down. He told his lawyers to trademark it. He told his marketers to print it on a hat. Today he’s the President of the United States of America. He still wears the hat. The slogan: “Make America Great Again”. So much emotion, so few words. Turns out, it likely wasn’t Trump who first wrote this pithy work of staggering brevity. But, like Hemingway, he is the slogan’s perfect vehicle. And, like Hemingway, his slogan tells an infinitely extensible story. But Trump’s story does it better. Hemingway’s “Baby shoes” gives you one clear picture of the present: a sign that says “For Sale”. It pins the story to that moment. You are free to imagine any past. You are free to imagine any future. But you must begin by imagining that sign. Its variables are the past and the future. Its constant is the present. MAGA does the opposite. MAGA’s constants are the past and the future. Its variable is the present. You are free to imagine a great past. You are free to imagine a great future. But you must begin with whatever your situation is right now. Another way of saying it: “Baby shoes” makes a fact applicable to any feeling; MAGA makes a feeling applicable to any fact. And in the battle between facts vs. feelings, like Newt Gingrich said, “I’ll go with how people feel.” A three-act play in only four words MAGA is a three-act play in only four words — five words, if you count the unspoken “you” at the story’s beginning. In the story of MAGA, the first words—“(you) make”—give the reader agency. Those words make the slogan both a designation (“you make America great again”) and an exhortation (“you: Make America great again”). The last two words — “Great Again” — do double work. They say that America was once great (nostalgic past), and America will be great again (hopeful future). This greatness is an assumed worldview. There are no possibilities other than America was great and it will be again. “Make America Great Again” They don’t say exactly what that greatness was or will be, but they peg how you feel about the past and the future. They give you a broad range to work with. America could have been great because it had unions. Or America could have been great because it had Jim Crow. Or because it had a middle class. Or a coal mining industry. Or muscle cars. Or whatever. America will be great because it will have a bigger military. Or fewer hispanics. Or fewer women in office. Or fewer elites telling you what to do. Or whatever. After you’ve set the past and the future, what’s left is the unspoken present. The unspoken present is a variable. The present can be whatever reality you, the reader, are experiencing. You could be a coal miner who remembers a coal-mining past and envisions a coal-mining future. Or a suburban Republican who remembers when schools weren’t integrated and there weren’t so many blacks in the neighborhood. Or an evangelical politician who remembers when Christians weren’t mocked on television and there weren’t so many transexuals in the bathrooms. Or, y’know, whatever. The important point is this: the worse off you are — the bigger your change in emotional state from past to present — the more powerful MAGA is to you. These state changes are why MAGA isn’t a throwback to the past. It’s a rallying cry for the future. You were once happy and you will be happy again. This is also why the rejoinder “America is already great” doesn’t work. If it’s already great, what’s the story? Where do we go next? Tell me a story, but don’t tell it too strict. Tell me a story I want to tell myself. Every story is the story of change, and every change is a story. The facts of the story don’t much matter. How the facts make you feel does. And no single fact exists in a vacuum. This is, of course, why telling your fact-free family the truth doesn’t change their minds. So says everyone from the eggheads to the transcendentalists. “The fact you tell is of no value,” wrote Emerson. “Only the impression.” Hemingway knew this. He knew that the fact of the “For Sale” sign would make his readers feel nostalgia, sadness, fear, and hope. Trump knew this, too. He knew his followers already had nostalgia and hope. He only needed to acknowledge the infinite variation of their sadness and fear. "}