{"parent": "", "timestamp": "Apr 13", "title": "UX Studies & App Redesigns You Shouldn’t Miss", "sentences": [{"2048": "UX Studies & App Redesigns You Shouldn’t Miss"}, {"ce38": "As product designers, we look around for ideas and inspiration. To make it easy for fellow designers, I gathered a list of case studies that have been done on several apps. These studies provide great insights on usability for different features. The list is sorted alphabetically. Don’t forget to bookmark this as I’ll continue adding more posts!"}, {"04d6": "Tip: Use cmd +F (Mac) or ctrl + F (Windows) to quickly search the name of the app or features that each designer worked on."}, {"ed3d": "Updated April 13, 2017"}, {"7313": "Amazon: Sorting & Filtering Features"}, {"c29c": "by Agnes Kim"}, {"f19e": "Finding My Way Through The AmazonA UX case study for Amazon’s iOS Appuxdesign.cc"}, {"3779": "Artsy: Discovering Content"}, {"cd0a": "by Hugh McFall"}, {"d662": "Persona to Prototype: ArtsyRe-imagining Artsy for iOSmedium.com"}, {"9510": "Coffee Meets Bagel: Filtering & Personal Account Page"}, {"5e15": "by Patricia Zhang"}, {"3323": "A Study on Usability: Coffee Meets Bagel, a Dating App for Young ProfessionalsDisclaimer: I am not affiliated with Coffee Meets Bagel. I’m a product designer who aims to improve the matchmaking…medium.com"}, {"d1a7": "Eat 24: Filter & How Information is Presented"}, {"35c8": "by Katie Chen"}, {"56d2": "For the Love of Food, People, and UXA usability case study on food delivery app Eat24uxdesign.cc"}, {"adfa": "Expensify: Adding Expenses"}, {"9b50": "by Kate Bennet"}, {"d581": "A guerilla usability test of ExpensifyAn exercise in simplifying business bureaucracy.medium.com"}, {"f098": "Fitbit: Tracking & Logging Exercise"}, {"c4f8": "by Stacey Wang"}, {"e7a0": "Fitbit: A UX Case StudyThe UX behind the habit of exerciseuxdesign.cc"}, {"cd5e": "Goodreads: Adding My Books & Searching by Genre"}, {"880c": "by Annie Chen"}, {"9d68": "Even the smallest change countsImproving the Goodreads iOS user experience through usability testingmedium.com"}, {"b950": "Hipmunk: Home Page, Search Feature & Gallery"}, {"262d": "by Michael Tea"}, {"bb89": "Putting the “Hip” Back in HipmunkImproving Hipmunk’s Android Experienceuxdesign.cc"}, {"3a4a": "MyFitnessPal: Searching & Adding an Item"}, {"8b85": "by Mel Smith"}, {"648f": "MyFitnessPal: A UX Case StudyI’m passionate about products and services that enable individuals to live healthier lives. I conducted a usability…medium.com"}, {"6877": "Postmates: Information Architect"}, {"4499": "by Leanna Leung"}, {"e0a9": "Sore Thumbs and Empty Stomachs: Design for Decision-MakingA UX Study on the Postmates iOS app experiencemedium.com"}, {"d6fc": "Runkeeper: Uploading Photo & Workout List"}, {"23bb": "by Peter Petrovics"}, {"057b": "Runkeeper: A Usability Case StudyObjectivesuxdesign.cc"}, {"cb61": "Spotify: Information Architect"}, {"e80f": "by Renee Lin"}, {"a075": "Spotify UX Analysis and RedesignThe Challengeblog.prototypr.io"}, {"b909": "Starbucks: Page Layout"}, {"4e90": "by Jenny Ta"}, {"f4d4": "A Usability Test on the Starbucks iOS AppI’ve always been a huge fan of Starbucks; my favorite drink as a kid was a Caramel Frappuccino (shout-out to mom & dad…uxdesign.cc"}, {"815d": "Thumbtack: Step by Step Instructions"}, {"61c0": "by Abigail Kathleen"}, {"3650": "Lessons in understanding a two-sided marketplaceA UX study of Thumbtack’s customer app experiencemedium.com"}, {"507d": "VSCO: Icon Confusion & Labeling"}, {"1354": "by Kevin Kwon"}, {"aed1": "VSCO, More Than Just FiltersA UX Case Study on VSCO’s iOS Appuxdesign.cc"}, {"0855": "VSCO: Sharing Feature & Camera"}, {"d746": "by Rhea Jayachandran"}, {"d549": "VSCO — the photographer’s favorite appHow can we make it better?medium.com"}, {"8163": "Yelp: Sharing Feature"}, {"f8ba": "by Geronimo Carlo Ramos III"}, {"0ce0": "Persona to Prototype: YelpReimagining the iOS Yelp Experiencemedium.theuxblog.com"}, {"c196": "Yelp: Color, Typography & Logo"}, {"d67c": "by Kenny Lopez"}, {"d41e": "An Unsolicited App Redesign: YelpThe Intentionalitymedium.com"}, {"066d": "Zara: Checkout Flow"}, {"5942": "by William Ng"}, {"a194": "Zara: A Usability Case StudyZara is one of my favorite clothing brands, but I run into problems every time I use the app. I decided to run…uxdesign.cc"}, {"bb7f": "Not on Medium"}, {"47cd": "Epicurious: Shopping List"}, {"cad8": "by Mark Stanton"}, {"1142": "Last but not least, my own case study"}, {"4a56": "Vivino: Search Feature"}, {"ae53": "by Casper Sermsuksan"}, {"17c9": "UX Study: The Search for WineIt all began one night at the Press Club in San Francisco, where I was attending my first company event. As the…medium.muz.li"}, {"1c0a": "If you know any good case study & app redesign, please comment or shoot me an email so I can add it to this list!"}, {"7f8e": "I’m currently consulting startups on growth, product and UX strategy. If you’d like to chat about growth, product, UX or startups, please reach me at casper.sermsuksan@gmail.com, Twitter or LinkedIn =)"}], "author": "Casper Sermsuksan", "child": "1468_1\t1468_2\t1468_3\t1468_41468_1\t1468_2\t1468_3\t1468_41468_1\t1468_2\t1468_3\t1468_4", "name": "1468", "content": "UX Studies & App Redesigns You Shouldn’t Miss As product designers, we look around for ideas and inspiration. To make it easy for fellow designers, I gathered a list of case studies that have been done on several apps. These studies provide great insights on usability for different features. The list is sorted alphabetically. Don’t forget to bookmark this as I’ll continue adding more posts! Tip: Use cmd +F (Mac) or ctrl + F (Windows) to quickly search the name of the app or features that each designer worked on. Updated April 13, 2017 Amazon: Sorting & Filtering Features by Agnes Kim Finding My Way Through The AmazonA UX case study for Amazon’s iOS Appuxdesign.cc Artsy: Discovering Content by Hugh McFall Persona to Prototype: ArtsyRe-imagining Artsy for iOSmedium.com Coffee Meets Bagel: Filtering & Personal Account Page by Patricia Zhang A Study on Usability: Coffee Meets Bagel, a Dating App for Young ProfessionalsDisclaimer: I am not affiliated with Coffee Meets Bagel. I’m a product designer who aims to improve the matchmaking…medium.com Eat 24: Filter & How Information is Presented by Katie Chen For the Love of Food, People, and UXA usability case study on food delivery app Eat24uxdesign.cc Expensify: Adding Expenses by Kate Bennet A guerilla usability test of ExpensifyAn exercise in simplifying business bureaucracy.medium.com Fitbit: Tracking & Logging Exercise by Stacey Wang Fitbit: A UX Case StudyThe UX behind the habit of exerciseuxdesign.cc Goodreads: Adding My Books & Searching by Genre by Annie Chen Even the smallest change countsImproving the Goodreads iOS user experience through usability testingmedium.com Hipmunk: Home Page, Search Feature & Gallery by Michael Tea Putting the “Hip” Back in HipmunkImproving Hipmunk’s Android Experienceuxdesign.cc MyFitnessPal: Searching & Adding an Item by Mel Smith MyFitnessPal: A UX Case StudyI’m passionate about products and services that enable individuals to live healthier lives. I conducted a usability…medium.com Postmates: Information Architect by Leanna Leung Sore Thumbs and Empty Stomachs: Design for Decision-MakingA UX Study on the Postmates iOS app experiencemedium.com Runkeeper: Uploading Photo & Workout List by Peter Petrovics Runkeeper: A Usability Case StudyObjectivesuxdesign.cc Spotify: Information Architect by Renee Lin Spotify UX Analysis and RedesignThe Challengeblog.prototypr.io Starbucks: Page Layout by Jenny Ta A Usability Test on the Starbucks iOS AppI’ve always been a huge fan of Starbucks; my favorite drink as a kid was a Caramel Frappuccino (shout-out to mom & dad…uxdesign.cc Thumbtack: Step by Step Instructions by Abigail Kathleen Lessons in understanding a two-sided marketplaceA UX study of Thumbtack’s customer app experiencemedium.com VSCO: Icon Confusion & Labeling by Kevin Kwon VSCO, More Than Just FiltersA UX Case Study on VSCO’s iOS Appuxdesign.cc VSCO: Sharing Feature & Camera by Rhea Jayachandran VSCO — the photographer’s favorite appHow can we make it better?medium.com Yelp: Sharing Feature by Geronimo Carlo Ramos III Persona to Prototype: YelpReimagining the iOS Yelp Experiencemedium.theuxblog.com Yelp: Color, Typography & Logo by Kenny Lopez An Unsolicited App Redesign: YelpThe Intentionalitymedium.com Zara: Checkout Flow by William Ng Zara: A Usability Case StudyZara is one of my favorite clothing brands, but I run into problems every time I use the app. I decided to run…uxdesign.cc Not on Medium Epicurious: Shopping List by Mark Stanton Last but not least, my own case study Vivino: Search Feature by Casper Sermsuksan UX Study: The Search for WineIt all began one night at the Press Club in San Francisco, where I was attending my first company event. As the…medium.muz.li If you know any good case study & app redesign, please comment or shoot me an email so I can add it to this list! I’m currently consulting startups on growth, product and UX strategy. If you’d like to chat about growth, product, UX or startups, please reach me at casper.sermsuksan@gmail.com, Twitter or LinkedIn =) "}