{"parent": "", "timestamp": "Mar 27", "title": "Fitbit: A UX Case Study", "sentences": [{"696e": "Fitbit: A UX Case Study"}, {"55d7": "The UX behind the habit of exercise"}, {"aa98": "There are generally three types of people in the world when it comes to exercising:"}, {"c35d": "I, along with most people I know, are the third type of person. We are called the general consumers of the multi-billion dollar worth of wearable fitness tracker market. Over the years, I have tried a few fitness trackers and my current obsession is Fitbit. It’s a great tracker and motivates me to be more active, but I have encountered a few problems while using their iOS app. So I decided to put my UX designer hat on and venture into the wild to see if anyone else shares my problems and if I could make any improvements to the app."}, {"7743": "My Design Process"}, {"8082": "I decided to follow IDEO’s Human-Centered Design and Lean UX Design Thinking process to make sure that my design decisions were supported by user research and feedback."}, {"d970": "Persona"}, {"75f5": "To start off, I created a provisional persona of a potential Fitbit user based on online research and my understanding of people who I knew that used Fitbit. This persona was created with assumptions and not fully research-based but it was something that I came back to throughout my project to guide my design decisions and priorities."}, {"2cf6": "Job Stories"}, {"72c8": "I used the Jobs To Be Done framework to explore different contexts in which a user would use Fitbit and to understand their motivation and desired outcome."}, {"07fd": "I created the following job stories based on interviews with users of Fitbit:"}, {"4546": "Guerrilla Usability Testing"}, {"7e40": "Based on the job stories and my understanding of the core functions of the Fitbit app, I developed a few scenarios with a series of tasks, such as:"}, {"2dff": "Now comes the fun part. What is a better way to get some quick and free usability results than carrying out a guerrilla usability test?"}, {"5d8d": "Guerilla usability test is “the art of pouncing on lone people in cafes and public spaces, quickly filming them whilst they use a website for a couple of minutes.” — Martin Belam"}, {"ad76": "Here’s the game plan:"}, {"2d82": "With this plan, I headed to Westfield San Francisco Center to approach shoppers coming out of yoga and sports brand stores. I verified that they at least exercise once a week before starting the usability test. In the end, I tested the tasks with five individuals. Here is a breakdown of their familiarity with fitness trackers."}, {"c935": "Identifying and Prioritising Pain Points"}, {"ef57": "The next day I reviewed the recordings of the tests and jotted down each user’s pain point onto a Post-It. Then I used affinity mapping to group the pain points into similar categories on a whiteboard."}, {"837b": "Affinity mapping pain points on whiteboard, each colour represents a user"}, {"7300": "Then I prioritised each pain point based on its importance to the user as well as its importance to Fitbit. My assumptions of the importance to users were based on conversations with the existing and potential users. My assumptions of the importance to Fitbit were based on my analysis of their website and marketing materials. Tracking, logging and editing the exercise were core functions of the product and challenging a friend was a core feature that made Fitbit stand out as a social fitness app."}, {"38a0": "Prioritising pain points on a 2x2 matrix"}, {"b446": "Defining the Problem"}, {"37f8": "I decided to tackle the four pain points that were both important to users and Fitbit. I redefined the pain points below."}, {"4737": "Pain Point 1: Discoverability issue with tracking and logging exercise"}, {"0de1": "There are two entry points to track or log an exercise on the app: through a floating action button on the dashboard page and through the exercise page, but both entry points have discoverability issues."}, {"1d27": "Pain Point 2: Users had difficulty finding the relevant exercise type to log"}, {"8cb2": "Fitbit has a large database of over 100 exercises that users can use to log exercise (and only 19 exercises available for tracking). But the app does not show a list of all exercises (presumably because such a long list may be overwhelming). For a user trying to log a new exercise, she can only use the search function, but this poses a problem when the exercise that she is trying to search for does not match the exact exercise in Fitbit’s database."}, {"1549": "For the usability test, the prompt was to log a chest and arms workout at the gym. The user could not find any matching result by searching “chest”, “workout”, “arms” or “gym”. The most relevant exercise type on the database is weights but this is unknown to the user."}, {"41f8": "Pain Point 3: Users could not edit exercise records apart from exercise type"}, {"e29e": "There are four different ways to record an exercise onto the Fitbit app. I did some further research by visiting Fitbit’s online customer service forum and conducting user interviews to learn more about how an exercise can be recorded."}, {"0ca2": "User interviews revealed that keeping a (roughly) accurate record of exercises is important for a user to motivate her to achieve her fitness goal. Currently, a user can only change the exercise type after an exercise is recorded. The ability to edit the starting time and duration of exercise is equally important because a user may forget to start or stop recording on time and the auto-detection on the tracker, although helpful, is not always accurate. This leads to either an exaggerated or inflated exercise time which could be discouraging and frustrating to the user."}, {"ff53": "Pain Point 4: Users had trouble finding how to challenge a friend"}, {"e488": "Creating a challenge with friends is one of the standout features that made Fitbit so socially popular when it launched. Currently, to create a challenge, a user has to go to the Challenges tab, select a challenge, then pick friend(s) to compete with. In the usability test, 3 out of 5 users tried to look for how to create a challenge on a friend’s page and were frustrated when they couldn’t find a way. This showed that for a user who already had a friend in mind that she wanted to compete with, the current flow did not match their mental model. She would expect to be able to perform social actions (including challenging a friend) on the friend’s page."}, {"83b1": "Task Flow"}, {"5b70": "I also created a task flow to show the flow for a user who wants to accurately record her exercise on the Fitbit app. The highlighted areas represent the first 3 pain points which I will tackle in my design solutions."}, {"d1b8": "Ideating the Solution"}, {"d131": "Then it was time to start sketching. I came up with several potential solutions to each of the pain points and made some rough UI sketches."}, {"15b5": "I did some preliminary validation on the Lo-Fi UI sketches and used the feedback to refine my sketches and narrow down my solutions for the Hi-Fi mockups."}, {"ac7f": "Prototyping and Validation"}, {"0f95": "I jumped into Sketch to create Hi-Fi mockups of my proposed solutions and used Marvel to create a clickable prototype. I tested the prototype with 5 new individuals. Insights from the validation test led me to reiterate on one of the screens. Below are the Hi-Fi mockups of my final solutions including the results of the user testing before and after implementing my design solutions."}, {"626e": "Pain Point 1: Discoverability issue with tracking and logging exercise on Fitbit app"}, {"d013": "Design solution: Make the two entry points on the dashboard and exercise page more easily discoverable and make the choice between track and log exercise more apparent."}, {"68e6": "Pain Point 2: Users had difficulty finding the correct exercise type to log"}, {"0474": "Design solution: Add a way for users to browse all exercise types."}, {"4d3a": "Pain Point 3: Users could not edit exercise records apart from exercise type"}, {"43b6": "Design solution: Allow the user to be able to edit starting time and duration of an exercise."}, {"556a": "Pain Point 4: Users had trouble finding how to challenge a friend"}, {"f87d": "Design solution: Allow a user to challenge a friend on the friend’s page."}, {"cd61": "Here’s an overview of the results of my design changes."}, {"670d": "You can also check out my prototype here."}, {"c33d": "Takeaways"}, {"8070": "Fitbit is a great product with a grand mission to get people moving. To achieve this, it faces one of the biggest challenges — changing a person’s habit. It’s packed with a lot of powerful tools to do just that, such as setting personal goals, tracking and logging exercise and social fitness challenges. But changing a habit is painful, so it’s even more important to make it as easy and friction-less as possible for a user to use those tools. And sometimes a change as small as enlarging a button or changing an icon can make a difference."}, {"badc": "Note: I do not work for, nor am I affiliated with, Fitbit. I did this UX case study as I am a product designer who likes to solve problems and Fitbit is one of my favourite products. I did this case study in February before Fitbit’s recent iOS update on 22 March which addresses Pain Point 3."}, {"8ae2": "Thanks for reading! If you want to collaborate, talk about product design, or just want to say hello, hit me up at stacey.ly.wang@gmail.com or connect via LinkedIn."}], "author": "Stacey Wang", "child": "1471_1\t1471_2\t1471_3\t1471_4\t1471_5\t1471_6\t1471_7\t1471_8\t1471_9\t1471_10\t1471_11\t1471_12\t1471_13\t1471_14\t1471_15\t1471_16\t1471_17\t1471_18\t1471_19\t1471_20\t1471_21\t1471_22\t1471_23\t1471_24\t1471_251471_1\t1471_2\t1471_3\t1471_4\t1471_5\t1471_6\t1471_7\t1471_8\t1471_9\t1471_10\t1471_11\t1471_12\t1471_13\t1471_14\t1471_15\t1471_16\t1471_17\t1471_18\t1471_19\t1471_20\t1471_21\t1471_22\t1471_23\t1471_24\t1471_25", "name": "1471", "content": "Fitbit: A UX Case Study The UX behind the habit of exercise There are generally three types of people in the world when it comes to exercising: I, along with most people I know, are the third type of person. We are called the general consumers of the multi-billion dollar worth of wearable fitness tracker market. Over the years, I have tried a few fitness trackers and my current obsession is Fitbit. It’s a great tracker and motivates me to be more active, but I have encountered a few problems while using their iOS app. So I decided to put my UX designer hat on and venture into the wild to see if anyone else shares my problems and if I could make any improvements to the app. My Design Process I decided to follow IDEO’s Human-Centered Design and Lean UX Design Thinking process to make sure that my design decisions were supported by user research and feedback. Persona To start off, I created a provisional persona of a potential Fitbit user based on online research and my understanding of people who I knew that used Fitbit. This persona was created with assumptions and not fully research-based but it was something that I came back to throughout my project to guide my design decisions and priorities. Job Stories I used the Jobs To Be Done framework to explore different contexts in which a user would use Fitbit and to understand their motivation and desired outcome. I created the following job stories based on interviews with users of Fitbit: Guerrilla Usability Testing Based on the job stories and my understanding of the core functions of the Fitbit app, I developed a few scenarios with a series of tasks, such as: Now comes the fun part. What is a better way to get some quick and free usability results than carrying out a guerrilla usability test? Guerilla usability test is “the art of pouncing on lone people in cafes and public spaces, quickly filming them whilst they use a website for a couple of minutes.” — Martin Belam Here’s the game plan: With this plan, I headed to Westfield San Francisco Center to approach shoppers coming out of yoga and sports brand stores. I verified that they at least exercise once a week before starting the usability test. In the end, I tested the tasks with five individuals. Here is a breakdown of their familiarity with fitness trackers. Identifying and Prioritising Pain Points The next day I reviewed the recordings of the tests and jotted down each user’s pain point onto a Post-It. Then I used affinity mapping to group the pain points into similar categories on a whiteboard. Affinity mapping pain points on whiteboard, each colour represents a user Then I prioritised each pain point based on its importance to the user as well as its importance to Fitbit. My assumptions of the importance to users were based on conversations with the existing and potential users. My assumptions of the importance to Fitbit were based on my analysis of their website and marketing materials. Tracking, logging and editing the exercise were core functions of the product and challenging a friend was a core feature that made Fitbit stand out as a social fitness app. Prioritising pain points on a 2x2 matrix Defining the Problem I decided to tackle the four pain points that were both important to users and Fitbit. I redefined the pain points below. Pain Point 1: Discoverability issue with tracking and logging exercise There are two entry points to track or log an exercise on the app: through a floating action button on the dashboard page and through the exercise page, but both entry points have discoverability issues. Pain Point 2: Users had difficulty finding the relevant exercise type to log Fitbit has a large database of over 100 exercises that users can use to log exercise (and only 19 exercises available for tracking). But the app does not show a list of all exercises (presumably because such a long list may be overwhelming). For a user trying to log a new exercise, she can only use the search function, but this poses a problem when the exercise that she is trying to search for does not match the exact exercise in Fitbit’s database. For the usability test, the prompt was to log a chest and arms workout at the gym. The user could not find any matching result by searching “chest”, “workout”, “arms” or “gym”. The most relevant exercise type on the database is weights but this is unknown to the user. Pain Point 3: Users could not edit exercise records apart from exercise type There are four different ways to record an exercise onto the Fitbit app. I did some further research by visiting Fitbit’s online customer service forum and conducting user interviews to learn more about how an exercise can be recorded. User interviews revealed that keeping a (roughly) accurate record of exercises is important for a user to motivate her to achieve her fitness goal. Currently, a user can only change the exercise type after an exercise is recorded. The ability to edit the starting time and duration of exercise is equally important because a user may forget to start or stop recording on time and the auto-detection on the tracker, although helpful, is not always accurate. This leads to either an exaggerated or inflated exercise time which could be discouraging and frustrating to the user. Pain Point 4: Users had trouble finding how to challenge a friend Creating a challenge with friends is one of the standout features that made Fitbit so socially popular when it launched. Currently, to create a challenge, a user has to go to the Challenges tab, select a challenge, then pick friend(s) to compete with. In the usability test, 3 out of 5 users tried to look for how to create a challenge on a friend’s page and were frustrated when they couldn’t find a way. This showed that for a user who already had a friend in mind that she wanted to compete with, the current flow did not match their mental model. She would expect to be able to perform social actions (including challenging a friend) on the friend’s page. Task Flow I also created a task flow to show the flow for a user who wants to accurately record her exercise on the Fitbit app. The highlighted areas represent the first 3 pain points which I will tackle in my design solutions. Ideating the Solution Then it was time to start sketching. I came up with several potential solutions to each of the pain points and made some rough UI sketches. I did some preliminary validation on the Lo-Fi UI sketches and used the feedback to refine my sketches and narrow down my solutions for the Hi-Fi mockups. Prototyping and Validation I jumped into Sketch to create Hi-Fi mockups of my proposed solutions and used Marvel to create a clickable prototype. I tested the prototype with 5 new individuals. Insights from the validation test led me to reiterate on one of the screens. Below are the Hi-Fi mockups of my final solutions including the results of the user testing before and after implementing my design solutions. Pain Point 1: Discoverability issue with tracking and logging exercise on Fitbit app Design solution: Make the two entry points on the dashboard and exercise page more easily discoverable and make the choice between track and log exercise more apparent. Pain Point 2: Users had difficulty finding the correct exercise type to log Design solution: Add a way for users to browse all exercise types. Pain Point 3: Users could not edit exercise records apart from exercise type Design solution: Allow the user to be able to edit starting time and duration of an exercise. Pain Point 4: Users had trouble finding how to challenge a friend Design solution: Allow a user to challenge a friend on the friend’s page. Here’s an overview of the results of my design changes. You can also check out my prototype here. Takeaways Fitbit is a great product with a grand mission to get people moving. To achieve this, it faces one of the biggest challenges — changing a person’s habit. It’s packed with a lot of powerful tools to do just that, such as setting personal goals, tracking and logging exercise and social fitness challenges. But changing a habit is painful, so it’s even more important to make it as easy and friction-less as possible for a user to use those tools. And sometimes a change as small as enlarging a button or changing an icon can make a difference. Note: I do not work for, nor am I affiliated with, Fitbit. I did this UX case study as I am a product designer who likes to solve problems and Fitbit is one of my favourite products. I did this case study in February before Fitbit’s recent iOS update on 22 March which addresses Pain Point 3. Thanks for reading! If you want to collaborate, talk about product design, or just want to say hello, hit me up at stacey.ly.wang@gmail.com or connect via LinkedIn. "}