{"parent": "", "timestamp": "Apr 11", "title": "How not to be a noob at UX design", "sentences": [{"3c1d": "How not to be a noob at UX design"}, {"12b8": "A few tips which could potentially make your life as a user experience designer easier"}, {"9509": "Trigger warning! — This article uses irony and sarcasm. Have fun reading :)"}, {"37b7": "UX is hot 🌶️ right now and everyone wants a slice of the pie! 2017 is going to be an awesome year for UX, but don’t take my word for it."}, {"5288": "It makes good sense that a lot of companies, out there, are looking, constantly, to hire UX designers at a rate which would make anyone with a good sense of orientation dizzy. Now, more than ever, a lot of graphic/artsy designers are starting to jump ships. Most of them got really good at “design”. It just makes good, good sense that the “design” skills they mastered over a couple of years would, therefore, translate really well to UX Design…it being similar at face value. The reason be damned that UX Design is chock-full of “design” masters who can’t design for shit, can’t solve a problem from a user’s perspective and possible the worst offense of all could’t empathise with the users even if they lay dead right in front of them. Well worry not here’s How not be a noob at UX Design."}, {"3c87": "Learn the difference between design and art"}, {"3639": "***Spoiler alert!!!***"}, {"041f": "This might come as a surprise to you, but design ≠ art. One’s a problem solving discipline while the other creates emotions."}, {"cfc0": "Design is a roadmap or a strategic approach for someone to achieve a unique expectation. It defines the specifications, plans, parameters, costs, activities, processes and how and what to do within legal, political, social, environmental, safety and economic constraints in achieving that objective. — Don Kumaragamage, Y. (2011). Design Manual Vol 1"}, {"d485": "Good Design + Good Art = ❤️"}, {"ded7": "Know your role"}, {"b2b6": "“I’m an artist, I’m an artist, I’m an artist!” — No! You’re not an artist! The closest thing on being an artist in UX is the visual design “branch”. Yeah! It looks like you’re an artist…you got graphic table, a fancy mouse, some colouring crayons, a fancy ass hat, but there’s more to that. In fact there’s more to each UX branch that the title lets on. You’ll need to know how to use all of them properly and don’t try to do stuff that’s too far outside of the strengths of your branch."}, {"3c82": "Yeah! It’s no brainer, but you’ll be surprised how many people whine: “Why don’t they like my colours? Why don’t they like my icons or fonts? How can‘t you love my design? I studied art, I know my shit!”."}, {"fec4": "Ask “Why?” and listen carefully to what people have to say"}, {"4a1e": "UX is all about solving people’s problems first…so start arming yourself with patience and a backpack full of notebooks and ask “Why … ?” a lot."}, {"0235": "For every statement a user or client gives be ready, like a cheetah stalking its pray, to jump and ask questions which eventually will lead you to the root of the problem. Only then you can begin solving the problem."}, {"19eb": "Document and share your findings with the rest of the team. UX isn’t one man’s show, it’s a team effort. Alone, you’ll fail!"}, {"de5e": "It’s not about you! It’s about them"}, {"4357": "Remember your audience. You’re not some hotshot who poops 💩 great solutions and nice visuals. You’re the one who’s suppose to understand the business and users needs. Whatever you build has to be tailored to them…YOUR AUDIENCE!"}, {"acbc": "Engage all perspectives"}, {"7476": "Be a good team player! To bring life to your designs you’ll need an equally talented development team. Play nice with them, buy them candies every once in a while. Show up at random times and ask them how they’re doing!"}, {"bf7b": "Believe it or not, other team members think about design too. Listen to them, and don’t react like a diva when they give you design solutions. UX is a flippin’ coop game, play fair and play nice. Don’t forget to let go of your mega artsy ego."}, {"7825": "Everything has to have a reason"}, {"ef21": "Good! Now you know that asking “Why?” helps you understand the problem. When it comes to the execution, always have a reason for why a certain design looks or works the way it does. Whatever you feel about the design is irrelevant as long as you solve the bigger picture for your target audience."}, {"dc24": "UX is not a feeling discipline. You can’t add colour just because it feels good to you. Chances are it might feel bad for 80% of your audience. Whatever you do back it up with data and research. This is not a feelings game. This kinda reminds me…Always do research! The first step in solving a problem is understanding there is one."}, {"d86f": "Sketch first, add colour later"}, {"fcf6": "by Anthony Lagoon Check out his work"}, {"6d91": "Your awesome graphic “designer”, we get it! But you’re not useful to anyone if it takes 3 days to come up with a solution for a problem. Sketch first to explore various ideas to fail fast and succeed sooner."}, {"073f": "Test & Learn"}, {"81fa": "You always have to test! You can not do your job without testing, that’s just the way things are. Your goal is to create useful designs / usable solutions whatever you want to call it. You can’t do that by imagining how things can, could or will work. You got to get down in the trenches and start doing usability testing. Talk with users, give them a certain task to validate that whatever you did is usable by your audience."}, {"b153": "Just the way you did research with multiple people in parallel, multiple team members can also do the testing with several users. Going into each test, you should have a plan of what you are testing and how you know if that is successful or not. Whatever the result is, we should end the phase with a plan for moving forward."}, {"4fff": "Ditch the expert act"}, {"f40f": "You might want to pull the good old expert act and tell people how much of a big deal you are. That you know everything there is to know about colour, typography, form and how to make a sexy app. Just don’t! It just shows that you’re not willing to listen to anyone and that everyone should listen to you because reasons. The sooner you realise that every opinion is an extra option the better."}, {"6898": "This being said, go out and be an awesome UX Designer!"}, {"6396": "Like always, if you liked the article smash that ❤️️ button, it will make me write more. Until next time!"}, {"b080": "Paul Axente is a Romanian UX Designer raised in the heart of Transylvania and living in Cluj-Napoca. Founder of #UXCT. Currently working as Lead UX Designer at 3Pillar Global."}], "author": "Paul Axente", "child": "1472_11472_11472_11472_11472_11472_11472_1", "name": "1472", "content": "How not to be a noob at UX design A few tips which could potentially make your life as a user experience designer easier Trigger warning! — This article uses irony and sarcasm. Have fun reading :) UX is hot 🌶️ right now and everyone wants a slice of the pie! 2017 is going to be an awesome year for UX, but don’t take my word for it. It makes good sense that a lot of companies, out there, are looking, constantly, to hire UX designers at a rate which would make anyone with a good sense of orientation dizzy. Now, more than ever, a lot of graphic/artsy designers are starting to jump ships. Most of them got really good at “design”. It just makes good, good sense that the “design” skills they mastered over a couple of years would, therefore, translate really well to UX Design…it being similar at face value. The reason be damned that UX Design is chock-full of “design” masters who can’t design for shit, can’t solve a problem from a user’s perspective and possible the worst offense of all could’t empathise with the users even if they lay dead right in front of them. Well worry not here’s How not be a noob at UX Design. Learn the difference between design and art ***Spoiler alert!!!*** This might come as a surprise to you, but design ≠ art. One’s a problem solving discipline while the other creates emotions. Design is a roadmap or a strategic approach for someone to achieve a unique expectation. It defines the specifications, plans, parameters, costs, activities, processes and how and what to do within legal, political, social, environmental, safety and economic constraints in achieving that objective. — Don Kumaragamage, Y. (2011). Design Manual Vol 1 Good Design + Good Art = ❤️ Know your role “I’m an artist, I’m an artist, I’m an artist!” — No! You’re not an artist! The closest thing on being an artist in UX is the visual design “branch”. Yeah! It looks like you’re an artist…you got graphic table, a fancy mouse, some colouring crayons, a fancy ass hat, but there’s more to that. In fact there’s more to each UX branch that the title lets on. You’ll need to know how to use all of them properly and don’t try to do stuff that’s too far outside of the strengths of your branch. Yeah! It’s no brainer, but you’ll be surprised how many people whine: “Why don’t they like my colours? Why don’t they like my icons or fonts? How can‘t you love my design? I studied art, I know my shit!”. Ask “Why?” and listen carefully to what people have to say UX is all about solving people’s problems first…so start arming yourself with patience and a backpack full of notebooks and ask “Why … ?” a lot. For every statement a user or client gives be ready, like a cheetah stalking its pray, to jump and ask questions which eventually will lead you to the root of the problem. Only then you can begin solving the problem. Document and share your findings with the rest of the team. UX isn’t one man’s show, it’s a team effort. Alone, you’ll fail! It’s not about you! It’s about them Remember your audience. You’re not some hotshot who poops 💩 great solutions and nice visuals. You’re the one who’s suppose to understand the business and users needs. Whatever you build has to be tailored to them…YOUR AUDIENCE! Engage all perspectives Be a good team player! To bring life to your designs you’ll need an equally talented development team. Play nice with them, buy them candies every once in a while. Show up at random times and ask them how they’re doing! Believe it or not, other team members think about design too. Listen to them, and don’t react like a diva when they give you design solutions. UX is a flippin’ coop game, play fair and play nice. Don’t forget to let go of your mega artsy ego. Everything has to have a reason Good! Now you know that asking “Why?” helps you understand the problem. When it comes to the execution, always have a reason for why a certain design looks or works the way it does. Whatever you feel about the design is irrelevant as long as you solve the bigger picture for your target audience. UX is not a feeling discipline. You can’t add colour just because it feels good to you. Chances are it might feel bad for 80% of your audience. Whatever you do back it up with data and research. This is not a feelings game. This kinda reminds me…Always do research! The first step in solving a problem is understanding there is one. Sketch first, add colour later by Anthony Lagoon Check out his work Your awesome graphic “designer”, we get it! But you’re not useful to anyone if it takes 3 days to come up with a solution for a problem. Sketch first to explore various ideas to fail fast and succeed sooner. Test & Learn You always have to test! You can not do your job without testing, that’s just the way things are. Your goal is to create useful designs / usable solutions whatever you want to call it. You can’t do that by imagining how things can, could or will work. You got to get down in the trenches and start doing usability testing. Talk with users, give them a certain task to validate that whatever you did is usable by your audience. Just the way you did research with multiple people in parallel, multiple team members can also do the testing with several users. Going into each test, you should have a plan of what you are testing and how you know if that is successful or not. Whatever the result is, we should end the phase with a plan for moving forward. Ditch the expert act You might want to pull the good old expert act and tell people how much of a big deal you are. That you know everything there is to know about colour, typography, form and how to make a sexy app. Just don’t! It just shows that you’re not willing to listen to anyone and that everyone should listen to you because reasons. The sooner you realise that every opinion is an extra option the better. This being said, go out and be an awesome UX Designer! Like always, if you liked the article smash that ❤️️ button, it will make me write more. Until next time! Paul Axente is a Romanian UX Designer raised in the heart of Transylvania and living in Cluj-Napoca. Founder of #UXCT. Currently working as Lead UX Designer at 3Pillar Global. "}