{"parent": "", "timestamp": "Jan 25", "title": "Organizando redux16 (o como llegué a IxDA Buenos Aires)", "sentences": [{"c054": "Organizando redux16 (o como llegué a IxDA Buenos Aires)"}, {"5a57": "En una mano un papel con la grilla y las biografías, en la otra el micrófono y el estómago revuelto. Frente a mí 100 personas esperando escuchar a los mejores profesionales de UX de Buenos Aires. Paso a enumerar:"}, {"2555": "Y yo presentándolos a todos junto con Ana Dorado. ¿Ahora se entiende porque el estómago revuelto?"}, {"bfef": "Pero arranquemos por el principio."}, {"f678": "¿Cómo llegué hasta ahí?"}, {"e38f": "Siempre que pude traté de acercarme a la comunidad UX, escuchar las inquietudes de los que recién empiezan, participar formando a otros cosa que en definitiva termina siendo una formación constante para mí porque creo que la mejor manera de aprender es enseñando. Ahí es cuando realmente uno se da cuenta si entendió los conceptos, cuando los tiene que explicar."}, {"e2b8": "Eso me llevó diferentes conferencias, encuentros, talleres, charlas. Por ejemplo, llegué a ISA14 de la mano de Sol, excelente compañera de trabajo de aquel momento en autocosmos.com, quien me inició en el mundo UX. Luego vendría ISA15, donde brindaríamos una charla junto a Miguel Saez. Pasando ese mismo año, por la diplomatura de accesibilidad y usabilidad donde conocí a José Allona, quien se volvió un gran referente profesional, canalizador de consultas e inquietudes. Un guía incondicional."}, {"557a": "Con José hablamos constantemente sobre todo tipo de problemáticas e ideamos diversos talleres o hackatones. Un día me llegó un mail de José invitándome a una reunión. Sentí que me habían invitado a formar parte de los magios. Un listado reducido de gente del mundo UX. En el mensaje, José anunciaba por mail que yo asistiría a contar ideas mías a este selecto grupo."}, {"ec41": "No hubo mucho protocolo, ni explicación, ni manual de bienvenida. Si bien conocía mayormente a todos los que estaban en la lista no terminaba de entender los roles ni el espíritu de la reunión pero no iba ponerme a hacer un montón de preguntas en ese momento. Así que decidí participar y ver qué onda."}, {"59e6": "Sin mucho preámbulo y sin mediar trámite alguno, la noche del 20 de octubre del 2016, nos reunimos con la gente de IxDA Buenos Aires en casa de Ana (que armó una excelente picada) a charlar sobre proyectos globales a corto plazo, sobre ideas que tenía yo y sobre el gran evento que venía, ISA16 en Santiago de Chile."}, {"6b99": "Para quien no lo conozca, Interaction South America (ISA) es el evento más grande de interacción de la región, se realiza todos los años donde participan todo tipo de profesionales desde gente que se está iniciando hasta quienes ya tiene una cierta trayectoria en el mundo UX, la motivación es compartir con la comunidad sus experiencias, hallazgos, incluso sus frustraciones. En el mismo evento también encontraremos a tipos que son los creadores de nuestras prácticas diarias como J.J. Garret o Alan Cooper."}, {"9aee": "Ante cada ISA, posteriormente cada capítulo local de IxDA (la comunidad se divide en capítulos de acuerdo a las ciudades) invita a los oradores del gran evento un día determinado a replicar sus charlas para el público que no pudo viajar o simplemente no contó con el tiempo. Así nace el redux, donde se cuenta cómo fue el gran evento, qué pasó, qué dejó y deja entrever lo que vendrá. Los oradores que fueron a ISA, hacen un espacio en su agenda y gentilmente participan el día del redux, dando nuevamente su charla para el público local de cada capítulo. Una aclaración, estas actividades son completamente ad honorem, la única motivación es poder compartir conocimientos y ayudar a crecer a todos profesionalmente."}, {"8c66": "Hecha esta aclaración continuo con la reunión organizativa, una vez charlado sobre el evento de Chile, comenzamos a armar nuestra parte correspondiente, el redux Buenos Aires. La charla fluyó y el encuentro llegó a su fin, y yo aún con más preguntas que certezas. Aunque sea ya había una respuesta, fecha tentativa del redux: lunes 12 de diciembre. Hay que buscar un lugar ahora."}, {"d7a9": "Espacio disponible aquí"}, {"c3ce": "Tratamos de contactar a gente de varias empresas para ver si estaban interesadas en participar del evento que estábamos construyendo, cediendo el espacio, un salón de conferencias, un sótano, algo. Hubo bastantes idas y vueltas, mensajes que nunca se respondieron, hasta que finalmente Ana se puso en contacto con la gente de AreaTres, que de arranque nos brindaron su apoyo, y nos ofrecieron un espacio increíble."}, {"d1cc": "Pero hubo que poner una pausa."}, {"4506": "El evento de Chile"}, {"2564": "De la reunión del día 20 de octubre hasta el evento del 2 de noviembre, no quedó mucho tiempo de acción. Los que tuvimos la suerte de poder asistir a este excelente evento organizado por IxDASantiago, disfrutamos de la hospitalidad de Rodrigo Vera, Eduardo Aguayo y todos los chicos de Chile. Un evento espectacular, desde lo organizativo y desde el contenido. Las temáticas claramente van reflejando la madurez que está alcanzando la disciplina en la región. Este año además con el agregado del Education Summit para charlar de la disciplina a nivel académico."}, {"2dd8": "Pasaron los días con un mini terremoto incluido y de vuelta a casa. A quienes les gusta el pescado volvieron con la panza y el corazón contento ceviche mediante."}, {"1cfa": "Si el diseñador UX no va a la montaña…"}, {"88bb": "Ya de vuelta en Baires comenzamos con la organización fuerte. Había que confirmar el lugar (cerrar las condiciones con la gente de AreaTres), el horario, conseguir sponsors, organizar el catering, la comunicación del evento."}, {"cad4": "Lo que para mí hasta ese momento habían sido dudas, se disipaban a medida que se daban los idas y vueltas de las cadenas de mail. Ahí todo empezó a cobrar sentido, se veían cuales eran los roles (no cargos) de cada uno de los que participaba; Betina, Manuel Razzari, Santiago Bustelo, Diego Lopez Castan , José Allona y finalmente Ana que también era debutante en la organización como yo, pero con un empuje increíble. Más tarde se sumaría Sebastián D´Amore también a sumar sinergia."}, {"e82a": "Al mejor estilo scrum, se planteaban las tareas y quien levantaba la mano la tomaba y la hacía. En el caso de los más inexpertos, siempre había alguien para brindar una mano, un consejo y asesorar."}, {"ed12": "Nos encontramos con mil limitaciones, problemas, etc. A lo largo de todo el proceso se trató de mantener la gratuidad del evento para que no sea un impedimento para nadie poder asistir, pero sabíamos también que la demanda sería mayor que el espacio disponible. Por eso queríamos que si alguien se comprometía a venir, se hiciera presente, para que el espacio fuera aprovechado al 100%."}, {"a430": "Se consiguió el apoyo de la Diplomatura en Accesibilidad y Usabilidad con lo que pudo cubrir los gastos operativos del evento, todavía estaba pendiente el tema del catering. Ana propuso hacer un evento “autogestivo”, idea que trajo de un evento al que asistió, que cada uno de los asistentes llevaran algo para comer o tomar seleccionando de un listado que con mucho humor armó Manuel. Solucionado el tema del catering."}, {"1f6b": "Se generó la comunicación, se continuó la búsqueda de sponsors sin éxito. Y finalmente se publicó para que la gente pueda comenzar a inscribirse. Las entradas volaron. En los días cercanos al evento se envió un recordatorio pidiendo sinceridad de parte de los inscriptos si realmente iban a ir (que no fuera una inscripción por las dudas, si puedo voy), fue una práctica muy productiva porque mucha gente se bajó y cedió su lugar a gente que pudo asistir. Eso elevó mucho la tasa de presentismo."}, {"9f96": "El día del evento"}, {"31e3": "Finalmente llegó el día del evento, comenzamos a acomodar sillas, organizar la cocina, preparar la acreditación de los asistentes y oradores."}, {"afe0": "Ya en el salón de la conferencia previo al inicio de la jornada, se me acerca José y me dice:"}, {"de24": "— Dos cosas: 1- en un rato te paso por whatsapp una serie de recomendaciones para que compartas con el público. 2- Traten de manejar la grilla con los horarios para no retrasarnos. (Nota: para quien no sepa o no haya asistido a un evento, los oradores tienen un tiempo asignado que pueden manejar libremente, siempre y cuando respeten ese tiempo, si un orador se excede produce un efecto en cadena robándole tiempo a los siguientes, una práctica de buen vecino es respetar ese tiempo. Para ello, el presentador o un moderador suele avisarle al orador cuanto tiempo le queda para que pueda darle un cierre a su presentación y no quede incompleta ni flotando)."}, {"0a73": "Y José agregó:"}, {"6a5e": "— Fíjense ustedes (Ana y yo) cómo quieren manejar las presentaciones de los oradores. Este evento lo hicieron ustedes así que apropiénselo, disfrútenlo."}, {"03e0": "En ese momento sentí que me habló Mascherano y me dijo: — ¡¡Hoy te convertís en héroe!!."}, {"e3c0": "Salí con todo a la cancha pero la gente tardó mucho en sentarse volvió enseguida el pánico escénico (estómago revuelto)."}, {"f961": "Pero nada. Arrancamos el evento. Empezamos con las presentaciones con Ana, quien tiene un carisma y una alegría increíbles. Seguimos con la improvisada entrega de premios y el chistecito que se me ocurrió para dicha entrega (él que realizaba la mejor pregunta ganaba un premio X. Nota: espero que todos hayan recibido su premio). Fue una idea para fomentar que el público se desinhiba y participe preguntando. Considero que funcionó muy bien porque hacia el final de la jornada ya no había premios y había que limitar la cantidad de preguntas por tiempo. El clima se sentía distendido. Yo ya estaba distendido también, del pánico pasé al disfrute del evento, escuchando charlas que por horarios no había podido disfrutar en Chile, compartiendo momentos de charla amena durante los breaks, sintiéndome siempre avalado por todos en la organización."}, {"e69c": "Cena posterior"}, {"d031": "Fue un evento extenso. Hacia el final de la jornada casi las 23hs. estaba realmente cansado pero hiperfeliz. Los que quedamos fuimos a cenar y ahí sentado completamente relajado fue como que me cayeron varias fichas."}, {"6787": "A lo largo de lo sucesivo de la organización en algún momento dejé de decir “habría que hacer esto”, para pasar a decir “hagamos esto”. ¿La diferencia? Sentirse parte, ya no era un “habría” impersonal y anónimo, ahora era un “hagamos” del cual yo era parte. Así fue como comencé a ser parte de IxDA, sin darme cuenta, paulatinamente, sin anuncios, sin membresías, sin protocolo simplemente ganas de hacer cosas por una comunidad creciente, pujante y demandante."}, {"9023": "En ese momento, me di cuenta hacía mucho tiempo que era miembro de IxDA, probablemente desde el primer evento al que asistí hacia ya varios años y donde como muchos de los asistentes al redux16, tampoco entendí que era IxDA cuando lo presentaron. Sin embargo, desde ese momento ya era parte de la comunidad y del hacer que crezca."}, {"df03": "¿Y ahora?"}, {"3038": "Simplemente gracias a todos y seguiremos construyendo una comunidad cada vez más fuerte y más grande."}, {"0e37": "Quienes quieran participar de esta o de cualquier comunidad UX, háganlo. Todo suma para construir una disciplina cada vez más sólida y pujante. Cualquier duda, me escriben."}, {"c714": "Muchas gracias a todos nuevamente, nos vemos en el próximo evento."}], "author": "Walter Becerra", "child": "1503_1", "name": "1503", "content": "Organizando redux16 (o como llegué a IxDA Buenos Aires) En una mano un papel con la grilla y las biografías, en la otra el micrófono y el estómago revuelto. Frente a mí 100 personas esperando escuchar a los mejores profesionales de UX de Buenos Aires. Paso a enumerar: Y yo presentándolos a todos junto con Ana Dorado. ¿Ahora se entiende porque el estómago revuelto? Pero arranquemos por el principio. ¿Cómo llegué hasta ahí? Siempre que pude traté de acercarme a la comunidad UX, escuchar las inquietudes de los que recién empiezan, participar formando a otros cosa que en definitiva termina siendo una formación constante para mí porque creo que la mejor manera de aprender es enseñando. Ahí es cuando realmente uno se da cuenta si entendió los conceptos, cuando los tiene que explicar. Eso me llevó diferentes conferencias, encuentros, talleres, charlas. Por ejemplo, llegué a ISA14 de la mano de Sol, excelente compañera de trabajo de aquel momento en autocosmos.com, quien me inició en el mundo UX. Luego vendría ISA15, donde brindaríamos una charla junto a Miguel Saez. Pasando ese mismo año, por la diplomatura de accesibilidad y usabilidad donde conocí a José Allona, quien se volvió un gran referente profesional, canalizador de consultas e inquietudes. Un guía incondicional. Con José hablamos constantemente sobre todo tipo de problemáticas e ideamos diversos talleres o hackatones. Un día me llegó un mail de José invitándome a una reunión. Sentí que me habían invitado a formar parte de los magios. Un listado reducido de gente del mundo UX. En el mensaje, José anunciaba por mail que yo asistiría a contar ideas mías a este selecto grupo. No hubo mucho protocolo, ni explicación, ni manual de bienvenida. Si bien conocía mayormente a todos los que estaban en la lista no terminaba de entender los roles ni el espíritu de la reunión pero no iba ponerme a hacer un montón de preguntas en ese momento. Así que decidí participar y ver qué onda. Sin mucho preámbulo y sin mediar trámite alguno, la noche del 20 de octubre del 2016, nos reunimos con la gente de IxDA Buenos Aires en casa de Ana (que armó una excelente picada) a charlar sobre proyectos globales a corto plazo, sobre ideas que tenía yo y sobre el gran evento que venía, ISA16 en Santiago de Chile. Para quien no lo conozca, Interaction South America (ISA) es el evento más grande de interacción de la región, se realiza todos los años donde participan todo tipo de profesionales desde gente que se está iniciando hasta quienes ya tiene una cierta trayectoria en el mundo UX, la motivación es compartir con la comunidad sus experiencias, hallazgos, incluso sus frustraciones. En el mismo evento también encontraremos a tipos que son los creadores de nuestras prácticas diarias como J.J. Garret o Alan Cooper. Ante cada ISA, posteriormente cada capítulo local de IxDA (la comunidad se divide en capítulos de acuerdo a las ciudades) invita a los oradores del gran evento un día determinado a replicar sus charlas para el público que no pudo viajar o simplemente no contó con el tiempo. Así nace el redux, donde se cuenta cómo fue el gran evento, qué pasó, qué dejó y deja entrever lo que vendrá. Los oradores que fueron a ISA, hacen un espacio en su agenda y gentilmente participan el día del redux, dando nuevamente su charla para el público local de cada capítulo. Una aclaración, estas actividades son completamente ad honorem, la única motivación es poder compartir conocimientos y ayudar a crecer a todos profesionalmente. Hecha esta aclaración continuo con la reunión organizativa, una vez charlado sobre el evento de Chile, comenzamos a armar nuestra parte correspondiente, el redux Buenos Aires. La charla fluyó y el encuentro llegó a su fin, y yo aún con más preguntas que certezas. Aunque sea ya había una respuesta, fecha tentativa del redux: lunes 12 de diciembre. Hay que buscar un lugar ahora. Espacio disponible aquí Tratamos de contactar a gente de varias empresas para ver si estaban interesadas en participar del evento que estábamos construyendo, cediendo el espacio, un salón de conferencias, un sótano, algo. Hubo bastantes idas y vueltas, mensajes que nunca se respondieron, hasta que finalmente Ana se puso en contacto con la gente de AreaTres, que de arranque nos brindaron su apoyo, y nos ofrecieron un espacio increíble. Pero hubo que poner una pausa. El evento de Chile De la reunión del día 20 de octubre hasta el evento del 2 de noviembre, no quedó mucho tiempo de acción. Los que tuvimos la suerte de poder asistir a este excelente evento organizado por IxDASantiago, disfrutamos de la hospitalidad de Rodrigo Vera, Eduardo Aguayo y todos los chicos de Chile. Un evento espectacular, desde lo organizativo y desde el contenido. Las temáticas claramente van reflejando la madurez que está alcanzando la disciplina en la región. Este año además con el agregado del Education Summit para charlar de la disciplina a nivel académico. Pasaron los días con un mini terremoto incluido y de vuelta a casa. A quienes les gusta el pescado volvieron con la panza y el corazón contento ceviche mediante. Si el diseñador UX no va a la montaña… Ya de vuelta en Baires comenzamos con la organización fuerte. Había que confirmar el lugar (cerrar las condiciones con la gente de AreaTres), el horario, conseguir sponsors, organizar el catering, la comunicación del evento. Lo que para mí hasta ese momento habían sido dudas, se disipaban a medida que se daban los idas y vueltas de las cadenas de mail. Ahí todo empezó a cobrar sentido, se veían cuales eran los roles (no cargos) de cada uno de los que participaba; Betina, Manuel Razzari, Santiago Bustelo, Diego Lopez Castan , José Allona y finalmente Ana que también era debutante en la organización como yo, pero con un empuje increíble. Más tarde se sumaría Sebastián D´Amore también a sumar sinergia. Al mejor estilo scrum, se planteaban las tareas y quien levantaba la mano la tomaba y la hacía. En el caso de los más inexpertos, siempre había alguien para brindar una mano, un consejo y asesorar. Nos encontramos con mil limitaciones, problemas, etc. A lo largo de todo el proceso se trató de mantener la gratuidad del evento para que no sea un impedimento para nadie poder asistir, pero sabíamos también que la demanda sería mayor que el espacio disponible. Por eso queríamos que si alguien se comprometía a venir, se hiciera presente, para que el espacio fuera aprovechado al 100%. Se consiguió el apoyo de la Diplomatura en Accesibilidad y Usabilidad con lo que pudo cubrir los gastos operativos del evento, todavía estaba pendiente el tema del catering. Ana propuso hacer un evento “autogestivo”, idea que trajo de un evento al que asistió, que cada uno de los asistentes llevaran algo para comer o tomar seleccionando de un listado que con mucho humor armó Manuel. Solucionado el tema del catering. Se generó la comunicación, se continuó la búsqueda de sponsors sin éxito. Y finalmente se publicó para que la gente pueda comenzar a inscribirse. Las entradas volaron. En los días cercanos al evento se envió un recordatorio pidiendo sinceridad de parte de los inscriptos si realmente iban a ir (que no fuera una inscripción por las dudas, si puedo voy), fue una práctica muy productiva porque mucha gente se bajó y cedió su lugar a gente que pudo asistir. Eso elevó mucho la tasa de presentismo. El día del evento Finalmente llegó el día del evento, comenzamos a acomodar sillas, organizar la cocina, preparar la acreditación de los asistentes y oradores. Ya en el salón de la conferencia previo al inicio de la jornada, se me acerca José y me dice: — Dos cosas: 1- en un rato te paso por whatsapp una serie de recomendaciones para que compartas con el público. 2- Traten de manejar la grilla con los horarios para no retrasarnos. (Nota: para quien no sepa o no haya asistido a un evento, los oradores tienen un tiempo asignado que pueden manejar libremente, siempre y cuando respeten ese tiempo, si un orador se excede produce un efecto en cadena robándole tiempo a los siguientes, una práctica de buen vecino es respetar ese tiempo. Para ello, el presentador o un moderador suele avisarle al orador cuanto tiempo le queda para que pueda darle un cierre a su presentación y no quede incompleta ni flotando). Y José agregó: — Fíjense ustedes (Ana y yo) cómo quieren manejar las presentaciones de los oradores. Este evento lo hicieron ustedes así que apropiénselo, disfrútenlo. En ese momento sentí que me habló Mascherano y me dijo: — ¡¡Hoy te convertís en héroe!!. Salí con todo a la cancha pero la gente tardó mucho en sentarse volvió enseguida el pánico escénico (estómago revuelto). Pero nada. Arrancamos el evento. Empezamos con las presentaciones con Ana, quien tiene un carisma y una alegría increíbles. Seguimos con la improvisada entrega de premios y el chistecito que se me ocurrió para dicha entrega (él que realizaba la mejor pregunta ganaba un premio X. Nota: espero que todos hayan recibido su premio). Fue una idea para fomentar que el público se desinhiba y participe preguntando. Considero que funcionó muy bien porque hacia el final de la jornada ya no había premios y había que limitar la cantidad de preguntas por tiempo. El clima se sentía distendido. Yo ya estaba distendido también, del pánico pasé al disfrute del evento, escuchando charlas que por horarios no había podido disfrutar en Chile, compartiendo momentos de charla amena durante los breaks, sintiéndome siempre avalado por todos en la organización. Cena posterior Fue un evento extenso. Hacia el final de la jornada casi las 23hs. estaba realmente cansado pero hiperfeliz. Los que quedamos fuimos a cenar y ahí sentado completamente relajado fue como que me cayeron varias fichas. A lo largo de lo sucesivo de la organización en algún momento dejé de decir “habría que hacer esto”, para pasar a decir “hagamos esto”. ¿La diferencia? Sentirse parte, ya no era un “habría” impersonal y anónimo, ahora era un “hagamos” del cual yo era parte. Así fue como comencé a ser parte de IxDA, sin darme cuenta, paulatinamente, sin anuncios, sin membresías, sin protocolo simplemente ganas de hacer cosas por una comunidad creciente, pujante y demandante. En ese momento, me di cuenta hacía mucho tiempo que era miembro de IxDA, probablemente desde el primer evento al que asistí hacia ya varios años y donde como muchos de los asistentes al redux16, tampoco entendí que era IxDA cuando lo presentaron. Sin embargo, desde ese momento ya era parte de la comunidad y del hacer que crezca. ¿Y ahora? Simplemente gracias a todos y seguiremos construyendo una comunidad cada vez más fuerte y más grande. Quienes quieran participar de esta o de cualquier comunidad UX, háganlo. Todo suma para construir una disciplina cada vez más sólida y pujante. Cualquier duda, me escriben. Muchas gracias a todos nuevamente, nos vemos en el próximo evento. "}