{"parent": "", "timestamp": "Apr 15", "title": "Rudy Gobert’s Injury Is Devastating, Even If It Isn’t", "sentences": [{"5457": "Rudy Gobert’s Injury Is Devastating, Even If It Isn’t"}, {"f9a6": "The star center went down 11 seconds into his first playoff game. That’s sad no matter how the series turns out."}, {"78e6": "This piece was updated after publication."}, {"8b1d": "The series pegged as the most competitive matchup of the first round was dealt a serious blow after just 11 seconds."}, {"843d": "On the game’s first possession, Gordon Hayward curled around a screen from Rudy Gobert. Hayward’s defender — Luc Mbah a Moute, losing ground and trying to cut tightly around the pick — made knee-to-knee contact with Gobert. Hayward, seeing that the left side of the court had now been cleared for Gobert, threw a pass in his direction. But the star center was already on the ground clutching his knee."}, {"b016": "The way that the big man immediately grabbed his knee as he fell to the ground—and the way he crawled, unable to stand, as possession moved to the other end of the court—was a defeating, disheartening visual. Propped up by his teammates, he headed straight to the locker room. Later in the quarter, it was announced that Gobert had sustained a left-knee sprain and wouldn’t return to the game. Even if the injury is less serious than it looks, it’s likely that Gobert won’t be springing back onto the floor for Game 2 on Tuesday or Game 3 on Friday. The most minor knee sprains require more than a week of recovery time, meaning that even if Gobert is on a Jazz-friendly recovery track, the series could be over by the time he’s healthy."}, {"043d": "Plainly, this sucks. Gobert, one of the front-runners for Defensive Player of the Year and the league’s most effective rim protector, was expected to be a DeAndre Jordan and Blake Griffin neutralizer and to put more pressure on the Clippers’ outside shooting. Gobert is also the team’s third-leading scorer and top rebounder, averaging 14 points and 12.8 boards a game. In every aspect of the game, the Frenchman is crucial to Utah’s scheme. With Gobert on the court, the Jazz had a plus-8.1 net rating during the regular season. Without him, they were minus-2.9."}, {"e8a8": "Every time the Clippers were able to get an easy bucket near the basket, announcers and Twitter wondered aloud whether the situation would have differed had Gobert been lurking in the paint. It’s safe to assume that plays like this would not have proceeded so effortlessly:"}, {"4402": "Midway through Game 1, it’s unclear if this injury will ruin the competitive balance of the series. Even with Gobert off the floor, the Jazz have shown more energy than the Clippers. Joe Johnson poured in 14 points during the first half and Boris Diaw added seven. Eight Jazz players scored before halftime, and as a unit, Utah has managed to keep itself in the game at the Staples Center. The game was locked at 52 at the half."}, {"6676": "We haven’t seen what a Jazz team looks like without Gobert. The lineup that played for much of the first half hardly saw any shared court time during the season. Whatever happens from this point forward will be difficult to project."}, {"89ce": "With Gobert on the floor, this series may have leaned in Utah’s direction. And without him, the Jazz may still be fine. But this injury is still taking one of the most dynamic players in the league away from one of the league’s most dynamic teams. Regardless of how the series ends up, that’s sad."}, {"e1f1": "Update: Gobert got an MRI on Saturday night and got some good and bad news. The good news: There’s no structural damage to the knee. The bad: He suffered a hyperextension and a bone bruise, making his health a huge question mark for the rest of the series and beyond."}, {"8ad4": "We say “beyond,” because when you have Iso Joe Johnson, who needs the Stifle Tower?"}, {"d94a": "Utah needs the Stifle Tower — the Jazz are much better with Rudy Gobert."}, {"8faa": "After he nailed a buzzer-beating, quintessential old-man layup as the game ended to stun the Clippers, 97–95, snatching home-court advantage, Johnson said the Jazz used Gobert’s injury to spur them on through Game 1: “I think it was very motivating considering the fact that he’s a big part of what we do, especially defensively. You know, I think we felt and knew that a lot of people probably were counting us out when he went down, but man, we stuck together, fought hard for 48 minutes; we had ups and downs, but at the end of the day we came out with a win.”"}, {"4dd5": "Despite losing their defensive anchor and one of the best big men in the game, the Jazz were able to pull a smash-and-grab and redirect all the scrutiny onto the home team. And Doc Rivers loves scrutiny:"}, {"b239": "Game 2 is Tuesday night in Los Angeles."}], "author": "Chris Almeida", "child": "1505_1\t1505_2\t1505_3", "name": "1505", "content": "Rudy Gobert’s Injury Is Devastating, Even If It Isn’t The star center went down 11 seconds into his first playoff game. That’s sad no matter how the series turns out. This piece was updated after publication. The series pegged as the most competitive matchup of the first round was dealt a serious blow after just 11 seconds. On the game’s first possession, Gordon Hayward curled around a screen from Rudy Gobert. Hayward’s defender — Luc Mbah a Moute, losing ground and trying to cut tightly around the pick — made knee-to-knee contact with Gobert. Hayward, seeing that the left side of the court had now been cleared for Gobert, threw a pass in his direction. But the star center was already on the ground clutching his knee. The way that the big man immediately grabbed his knee as he fell to the ground—and the way he crawled, unable to stand, as possession moved to the other end of the court—was a defeating, disheartening visual. Propped up by his teammates, he headed straight to the locker room. Later in the quarter, it was announced that Gobert had sustained a left-knee sprain and wouldn’t return to the game. Even if the injury is less serious than it looks, it’s likely that Gobert won’t be springing back onto the floor for Game 2 on Tuesday or Game 3 on Friday. The most minor knee sprains require more than a week of recovery time, meaning that even if Gobert is on a Jazz-friendly recovery track, the series could be over by the time he’s healthy. Plainly, this sucks. Gobert, one of the front-runners for Defensive Player of the Year and the league’s most effective rim protector, was expected to be a DeAndre Jordan and Blake Griffin neutralizer and to put more pressure on the Clippers’ outside shooting. Gobert is also the team’s third-leading scorer and top rebounder, averaging 14 points and 12.8 boards a game. In every aspect of the game, the Frenchman is crucial to Utah’s scheme. With Gobert on the court, the Jazz had a plus-8.1 net rating during the regular season. Without him, they were minus-2.9. Every time the Clippers were able to get an easy bucket near the basket, announcers and Twitter wondered aloud whether the situation would have differed had Gobert been lurking in the paint. It’s safe to assume that plays like this would not have proceeded so effortlessly: Midway through Game 1, it’s unclear if this injury will ruin the competitive balance of the series. Even with Gobert off the floor, the Jazz have shown more energy than the Clippers. Joe Johnson poured in 14 points during the first half and Boris Diaw added seven. Eight Jazz players scored before halftime, and as a unit, Utah has managed to keep itself in the game at the Staples Center. The game was locked at 52 at the half. We haven’t seen what a Jazz team looks like without Gobert. The lineup that played for much of the first half hardly saw any shared court time during the season. Whatever happens from this point forward will be difficult to project. With Gobert on the floor, this series may have leaned in Utah’s direction. And without him, the Jazz may still be fine. But this injury is still taking one of the most dynamic players in the league away from one of the league’s most dynamic teams. Regardless of how the series ends up, that’s sad. Update: Gobert got an MRI on Saturday night and got some good and bad news. The good news: There’s no structural damage to the knee. The bad: He suffered a hyperextension and a bone bruise, making his health a huge question mark for the rest of the series and beyond. We say “beyond,” because when you have Iso Joe Johnson, who needs the Stifle Tower? Utah needs the Stifle Tower — the Jazz are much better with Rudy Gobert. After he nailed a buzzer-beating, quintessential old-man layup as the game ended to stun the Clippers, 97–95, snatching home-court advantage, Johnson said the Jazz used Gobert’s injury to spur them on through Game 1: “I think it was very motivating considering the fact that he’s a big part of what we do, especially defensively. You know, I think we felt and knew that a lot of people probably were counting us out when he went down, but man, we stuck together, fought hard for 48 minutes; we had ups and downs, but at the end of the day we came out with a win.” Despite losing their defensive anchor and one of the best big men in the game, the Jazz were able to pull a smash-and-grab and redirect all the scrutiny onto the home team. And Doc Rivers loves scrutiny: Game 2 is Tuesday night in Los Angeles. "}