{"parent": "", "timestamp": "Feb 9", "title": "VCU Is the Luckiest Basketball Team in the Country", "sentences": [{"ad99": "VCU Is the Luckiest Basketball Team in the Country"}, {"1a14": "Down by one with 0.4 seconds left in back-to-back games? That’s two wins."}, {"e627": "Last Saturday, VCU should have lost to St. Bonaventure. The Bonnies had taken the lead on a lovely stepback dagger of a 3 by Matt Mobley, leaving the Rams in a virtually unwinnable situation: with the ball, down one, at the wrong end of the floor, with just 0.4 seconds left. And then havoc happened — and not the kind VCU fans are used to."}, {"b6db": "The referees assessed the Bonnies an administrative technical foul for delay of game, conveniently allowing VCU to take one shot. JeQuan Lewis hit it, tied the game, and the Rams won 83–77 in overtime. At first, it was widely reported that the technical foul was for the fans who stormed the court, but they actually waited until the clock hit triple zeroes. The Atlantic 10 says the technical foul was deserved because the Bonnies players took the court too soon, a St. Bonaventure security guard snagged the ball while VCU needed to inbound it, and a fan bumped into an official."}, {"5952": "Northwestern Basketball Just Wants One DanceThe pain and guarded optimism of rooting for the Wildcats to end their NCAA tournament droughttheringer.com"}, {"ea06": "Technically, the officials were 100 percent right to assess the technical foul: The Bonnies and their fans had interrupted VCU’s opportunity to operate on offense. However, this doesn’t prevent me from being furious the technical was called; St. Bonaventure should have won because it was better at basketball for 39:59.6, and 0.4 seconds’ worth of bad celebrating allowed the Bonnies to lose the game in an additional five minutes of play."}, {"4303": "Then, on Wednesday night, it happened again."}, {"c598": "VCU should have lost to George Washington. The Colonials had taken the lead on a corner dagger of a 3 by Yuta Watanabe, leaving the Rams in another virtually unwinnable situation: with the ball, down one, at the wrong end of the floor, with just 0.4 seconds left. This time, VCU took matters into its own hands."}, {"f3cf": "Think for a second about why that situation is so unwinnable. By rule, a player can’t attempt a non-tip shot with 0.3 seconds or less on the clock. That means 0.4 seconds is literally the smallest amount of time a team can have to catch the ball and take a shot. And to generate the power required to get the ball 94 feet, you’re probably going to need more than 0.4 seconds on the catch or shot."}, {"cc37": "So, VCU coach Will Wade called the only play that could get the Rams a win. He had the inbounder, Justin Tillman, run from one side of the baseline to the other, and when defender Collin Goss followed him, Lewis set a screen on him. Completely not expecting a screener so far from the basket, Goss bowled Lewis over. Plus, in this situation, Lewis is incentivized to flop. If he successfully sets a screen, the Rams lose. If the refs ignore the contact, the Rams lose. If the refs call an offensive foul on Lewis, the Rams lose."}, {"9d37": "But the refs chose to call the foul on Goss. Lewis sunk both free throws, and the Rams won 54–53."}, {"d8b9": "There’s No Way to Explain Marcus KeeneCollege basketball’s leading scorer is a 5-foot-9 point guard who’s part mid-major phenom, part J.R. Smith, and part…theringer.com"}, {"c294": "Technically, the refs were probably right to assess the foul: You’re not allowed to blow up a screener like that. However, this doesn’t prevent me from being furious the foul was called. Wade’s play call was so cynical, completely avoiding the problem of how to get a game-winning shot. And yet it was so smart, literally the only reasonable chance his team had at victory."}, {"9769": "According to The 2017 Bracket Matrix, VCU is now on the cusp of receiving an at-large bid to the NCAA tournament. Losses to the Bonnies or Colonials, two teams with no hope of sniffing the tournament barring an A-10 tournament run, might have doomed their chances. That VCU was in a position to lose both games doesn’t make me optimistic about how good the Rams are as a team. That they found themselves in the same doomed scenario in back-to-back games and ended up with two wins makes me think they’re unkillable."}], "author": "Rodger Sherman", "child": "1511_1\t1511_2\t1511_3\t1511_4\t1511_5\t1511_6", "name": "1511", "content": "VCU Is the Luckiest Basketball Team in the Country Down by one with 0.4 seconds left in back-to-back games? That’s two wins. Last Saturday, VCU should have lost to St. Bonaventure. The Bonnies had taken the lead on a lovely stepback dagger of a 3 by Matt Mobley, leaving the Rams in a virtually unwinnable situation: with the ball, down one, at the wrong end of the floor, with just 0.4 seconds left. And then havoc happened — and not the kind VCU fans are used to. The referees assessed the Bonnies an administrative technical foul for delay of game, conveniently allowing VCU to take one shot. JeQuan Lewis hit it, tied the game, and the Rams won 83–77 in overtime. At first, it was widely reported that the technical foul was for the fans who stormed the court, but they actually waited until the clock hit triple zeroes. The Atlantic 10 says the technical foul was deserved because the Bonnies players took the court too soon, a St. Bonaventure security guard snagged the ball while VCU needed to inbound it, and a fan bumped into an official. Northwestern Basketball Just Wants One DanceThe pain and guarded optimism of rooting for the Wildcats to end their NCAA tournament droughttheringer.com Technically, the officials were 100 percent right to assess the technical foul: The Bonnies and their fans had interrupted VCU’s opportunity to operate on offense. However, this doesn’t prevent me from being furious the technical was called; St. Bonaventure should have won because it was better at basketball for 39:59.6, and 0.4 seconds’ worth of bad celebrating allowed the Bonnies to lose the game in an additional five minutes of play. Then, on Wednesday night, it happened again. VCU should have lost to George Washington. The Colonials had taken the lead on a corner dagger of a 3 by Yuta Watanabe, leaving the Rams in another virtually unwinnable situation: with the ball, down one, at the wrong end of the floor, with just 0.4 seconds left. This time, VCU took matters into its own hands. Think for a second about why that situation is so unwinnable. By rule, a player can’t attempt a non-tip shot with 0.3 seconds or less on the clock. That means 0.4 seconds is literally the smallest amount of time a team can have to catch the ball and take a shot. And to generate the power required to get the ball 94 feet, you’re probably going to need more than 0.4 seconds on the catch or shot. So, VCU coach Will Wade called the only play that could get the Rams a win. He had the inbounder, Justin Tillman, run from one side of the baseline to the other, and when defender Collin Goss followed him, Lewis set a screen on him. Completely not expecting a screener so far from the basket, Goss bowled Lewis over. Plus, in this situation, Lewis is incentivized to flop. If he successfully sets a screen, the Rams lose. If the refs ignore the contact, the Rams lose. If the refs call an offensive foul on Lewis, the Rams lose. But the refs chose to call the foul on Goss. Lewis sunk both free throws, and the Rams won 54–53. There’s No Way to Explain Marcus KeeneCollege basketball’s leading scorer is a 5-foot-9 point guard who’s part mid-major phenom, part J.R. Smith, and part…theringer.com Technically, the refs were probably right to assess the foul: You’re not allowed to blow up a screener like that. However, this doesn’t prevent me from being furious the foul was called. Wade’s play call was so cynical, completely avoiding the problem of how to get a game-winning shot. And yet it was so smart, literally the only reasonable chance his team had at victory. According to The 2017 Bracket Matrix, VCU is now on the cusp of receiving an at-large bid to the NCAA tournament. Losses to the Bonnies or Colonials, two teams with no hope of sniffing the tournament barring an A-10 tournament run, might have doomed their chances. That VCU was in a position to lose both games doesn’t make me optimistic about how good the Rams are as a team. That they found themselves in the same doomed scenario in back-to-back games and ended up with two wins makes me think they’re unkillable. "}