{"parent": "", "timestamp": "Apr 13", "title": "If You Love Legos, Ingenuity, and Curly Mustaches, ‘Click’ is for You", "sentences": [{"d473": "Short of the Day"}, {"8854": "If You Love Legos, Ingenuity, and Curly Mustaches, ‘Click’ is for You"}, {"068f": "Live-action meets Lego animation in this delightfully absurd short."}, {"641a": "Who doesn’t love Legos? No one I associate with, that’s for sure. Today kids got all these elaborate playsets that tie in to movie or comic book franchises, but there’s still something to be said for a big ole bucket of random pieces and the way it can engage the imagination of a child. Legos bring out the inventor in all of us, they cause us to examine the structure and makeup of things, and not just the finished result. How many architects, construction foremen, city planners, engineers all sorts and other such professional creators were born of a pile of Legos? A bunch, I’d bet."}, {"9337": "This idea of Legos as an instigator of great ideas is at the heart of Click, a short film from director Leigh Marling for Bluesource that combines live-action stop-motion with Lego animation into a lively and succinct short tracing the impact of invention on one curly-mustachioed man."}, {"ebe2": "This short has the look and feel of something that would have played as a standalone skit during Pee-Wee’s Playhouse, and I mean that as a big, fat compliment. Marling and crew have made a film every bit as wackily inspiring as its subject, and one that deserves to be seen by children and adults alike. Enjoy."}], "author": "H. Perry Horton", "child": "1542_1", "name": "1542", "content": "Short of the Day If You Love Legos, Ingenuity, and Curly Mustaches, ‘Click’ is for You Live-action meets Lego animation in this delightfully absurd short. Who doesn’t love Legos? No one I associate with, that’s for sure. Today kids got all these elaborate playsets that tie in to movie or comic book franchises, but there’s still something to be said for a big ole bucket of random pieces and the way it can engage the imagination of a child. Legos bring out the inventor in all of us, they cause us to examine the structure and makeup of things, and not just the finished result. How many architects, construction foremen, city planners, engineers all sorts and other such professional creators were born of a pile of Legos? A bunch, I’d bet. This idea of Legos as an instigator of great ideas is at the heart of Click, a short film from director Leigh Marling for Bluesource that combines live-action stop-motion with Lego animation into a lively and succinct short tracing the impact of invention on one curly-mustachioed man. This short has the look and feel of something that would have played as a standalone skit during Pee-Wee’s Playhouse, and I mean that as a big, fat compliment. Marling and crew have made a film every bit as wackily inspiring as its subject, and one that deserves to be seen by children and adults alike. Enjoy. "}