{"parent": "", "timestamp": "Apr 13", "title": "Mavi’nin kurucusundan mesaj: “88 yaşında yeni marka kuracağım”", "sentences": [{"4baf": "Mavi’nin kurucusundan mesaj: “88 yaşında yeni marka kuracağım”"}, {"abae": "Mavi Jeans ne kadar biliniyorsa, Sait Akarlılar da o kadar az tanınıyor. Bu onun kişisel tercihi, ama vizyonu ve mesleki birikimi Mavi olarak göz önünde varlığını sürdürüyor."}, {"9f83": "25 yıl önce Mavi Jeans doğduğunda Sait Akarlılar 51 yaşındaydı. Kendisi 14 yaşında tekstil sektöründe çalışmaya başlamıştı. 37 yıllık deneyimi ve birikimi Mavi’yi ortaya çıkardı. Yeni marka için daha fazla birikim olduğuna göre, çok ileri giden bir marka bekliyoruz."}, {"7210": "Beklentiyi geride bırakıp, vakıaya bakalım."}, {"2dab": "Eğer, dünyanın en çılgın milyarderi olarak tanınan Sir Richard Branson, İstanbul TALKS konferansına gelmeseydi, bu yazı ortaya çıkmayabilirdi. Mavi, Branson’ın konuşmasına sponsor olmuştu."}, {"2cd4": "Doğru bir tercihte bulundu. Çünkü uzay mekiği lansmanından, dünyanın bir köşesindeki yardım aktivitesine kadar hayatının her anında Mavi jeanlerini giyen Branson’dan başkası olabilir miydi?"}, {"89d4": "Dünyanın en sosyal CEO’su ve LinkedIn’de dünyanın en çok takip edilen kişisi olarak “online” hayatın rekorlarına sahip Branson, konferansa da özel yaşamında tercih ettiği Mavi Jean’iyle katıldı."}, {"a201": "Richard Branson, Virgin Galactic Spaceship Two lansmanında da Mavi Jean’ini giymiş ve havalara uçtuğu, hafızalara kazınan fotoğrafı bütün dünyayla paylaşılmıştı. Konferans sırasında fonda yer alan bu fotoğraf, dinleyiciler arasında da ilgi odağı oldu. Mavi CEO’su Cüneyt Yavuz’un söylediğine göre kıyafet sponsoru olmadıklarını, bunun Branson’un kişisel tercihi olduğunu vurguladı."}, {"c6b3": "Sadece Branson mu? Benim neslim adını yeni duymuş olabilir ama tutkulu takipçileri olan Francisco Lachowski, Vini Uehara ve Luck Blue Smith de Mavi’yi taşıyan ünlüler."}, {"a2ce": "Biraz bizim nesildekilere bakarsak: Chelsea Clinton’dan Geri Halliwell’a, Cher’den Antonio Banderas’a, Dannii Minogue’dan Billy Zane’e kadar birçok ünlünün favorisi yine Mavi’ydi."}, {"b950": "Amerika’da önce ‘Made in Maviland’, arkasından ‘Mavifits’ reklam kampanyaları yürüten Mavi’nin artık bir ‘dünya markası’ olduğu kabul ediliyor. Dünyanın önde gelen haftalık haber dergilerinden Time, “İş Dünyası” bölümünde Mavi Jeans’e yer verdi. Amerika’nın ünlü erkek moda dergisi DNR’ın belirlediği ‘Erkek Giyiminde En Güçlü 100’ kişi arasında Mavi Amerika Başkanı Ersin Akarlılar da yer aldı."}, {"d708": "Peki, bu duruma nasıl gelindi?"}, {"57a8": "Mavi Jeans’i üreten Erak Giyim’in arkasında bugün 76 yıllık bir deneyim var. Sait Akarlılar, iş hayatına 14 yaşında terzi çırağı olarak başladı. 1954 yılında tekstille tanışıyor. Önce spor giyim dikimi ile mesleğe başlayan Akarlılar, sonra mont, pantolon dikmeyi öğreniyor. 5 yıl sonra işverenliğe adım atarak 1960 yılında atölye kuruyor. 1971 yılında Güven Giyim ile üretim ve çalışma alanını genişletiyor."}, {"68ca": "80 öncesi hem ihracat cazip değildi. Küresel deneyiminde ve kendi marka sürecine katkı yapan ise, 1984 yılında kurduğu Erak şirketiyle Lee, Mustang, Wrangler gibi dünya markalarının üretimini Türkiye’de yapmaya başlıyor. Akarlılar, “Yola çıkarken 100 yıllık jean şirketlerini örnek aldık, nesillere intikal eden şirket olmayı hedefledik” diyerek düşüncelerini paylaşıyor. Yedi yıl sonra 1991 yılında ise grubun ‘amiral gemisi’ Mavi Jeans’in kuruluşu gerçekleşiyor."}, {"ca01": "Sait Akarlılar, Mavi vizyonunu ve kuruluşunu şöyle anlatıyor: “1980’li yıllarda ihracatta bir patlama oldu. Daha önce blue jean kumaşı üreten fabrikalar yoktu. Bu dışa açılma yıllarında bu fabrikalar oluştu. Bu fabrikalar olunca ve diğer yabancı markalar Türkiye’ye girince biz de bu işte bir gelecek gördük. Kumaş var, pamuk var dedik ve konfeksiyon üretimine girmeyi düşündük. Mavi Jeans de, bu fikrimizden sonra oluştu. Türkiye çok genç nüfusa sahip bir ülke. Biz de genç insanların spor giyim içerisinde jean pantolona ilgi duyacaklarını düşündük. Bazı araştırmalar yaptık. Spor giyim içerisinde jeanin yerinin iyi zamanlarda yüzde 80–85’lere ulaştığını, en düşük zamanlarda bile yüzde 60’lara düşmediğini gördük. Bu araştırmalardan sonra fabrikaya ve markaya yatırım yaptık”."}, {"b94b": "Hala aynı vizyon doğrultusunda markanın konumlandırıldığını düşünüyorum."}, {"3684": "İzleyen yıllarda Mavi’nin gelişmeleri üzerine şu notlar düşülebilir:"}, {"7f14": "1993’te Mavi Jeans’in geniş kapsamlı ilk yurtiçi reklam kampanyası yapıldı. Akmerkez ve Galeria mağazaları ile perakendeciliğe başlandı."}, {"3db1": "1994’te ilk ihracatı başladı."}, {"2d58": "Mavi Jeans, jeanin anavatanı kabul edilen ABD’de başarısı Türkiye’den gördüğümüz kadar parlak değil. Aslında yurtdışında yapacakları iş çok ve son 15 yıl yeni deneyimler ile geçti. Her ülkede kendi stratejisini oluşturacak Mavi Şirketleri kuruldu."}, {"a358": "Rusya da bu bağlamda değerlendirilmelidir. 2015 yılı Rusya için hamle yılı olacaktı ama kriz dolayısıyla şimdilik beklemeye alındı. Yani Avrupa’da, Rusya’da veya herhangi bir dünya ülkesinde birinci Türk markası Mavi değil. Zaten reklam kampanyalarına bakarsak, iç pazara hitap eden mottolar var. Bakalım küresel bir söylemle ne zaman çıkış yapacak?"}, {"c92c": "Unutmayalım ki, satış rakamlarından bahsediyorum. Algısı her zaman satış rakamlarınızın üstünde olan bir marka oluşturulduğunun hakkını verelim. Peki, bundan sonra Mavi nereye koşacak? Bunun cevabını da Sait Akarlılar’ın bir röportajdaki sözlerinde saklı."}, {"4913": "“Aile şirketiyiz, ancak ailenin kontrolünde profesyonellerin liderliğinde yönetiliyor. Son karar ise, olumlu ya da olumsuz, ailenin en büyüğü olduğum için benim tarafımdan veriliyor. Örneğin, bizim her departmanımız işe alımda kendi görüşmelerini kendileri yapar, kendi ekiplerini kendileri kurarlar. Bu elemanı al burada çalıştır zihniyeti hiçbir yerde yoktur.”"}, {"d062": "Yani kontrollü profesyonel kararlar ne kadar sağlıklı olur ve gençler ne kadar koşturursa Mavi, o ufuk noktalarına da koşacak. En önemlisi de, 88 yaşında yeni marka nasıl olacak?"}, {"e8be": "Mavi Jeans'i kuran Sait Akarlılar'dan 25 yıl mesajı \"88 yaşında yeni marka kuracağım\"Mavi Jeans ne kadar biliniyorsa, Sait Akarlılar da o kadar az tanınıyor. Bu onun kişisel tercihi, ama vizyonu ve mesleki…thebrandage.com"}], "author": "Fikri Türkel", "child": "1555_1\t1555_2", "name": "1555", "content": "Mavi’nin kurucusundan mesaj: “88 yaşında yeni marka kuracağım” Mavi Jeans ne kadar biliniyorsa, Sait Akarlılar da o kadar az tanınıyor. Bu onun kişisel tercihi, ama vizyonu ve mesleki birikimi Mavi olarak göz önünde varlığını sürdürüyor. 25 yıl önce Mavi Jeans doğduğunda Sait Akarlılar 51 yaşındaydı. Kendisi 14 yaşında tekstil sektöründe çalışmaya başlamıştı. 37 yıllık deneyimi ve birikimi Mavi’yi ortaya çıkardı. Yeni marka için daha fazla birikim olduğuna göre, çok ileri giden bir marka bekliyoruz. Beklentiyi geride bırakıp, vakıaya bakalım. Eğer, dünyanın en çılgın milyarderi olarak tanınan Sir Richard Branson, İstanbul TALKS konferansına gelmeseydi, bu yazı ortaya çıkmayabilirdi. Mavi, Branson’ın konuşmasına sponsor olmuştu. Doğru bir tercihte bulundu. Çünkü uzay mekiği lansmanından, dünyanın bir köşesindeki yardım aktivitesine kadar hayatının her anında Mavi jeanlerini giyen Branson’dan başkası olabilir miydi? Dünyanın en sosyal CEO’su ve LinkedIn’de dünyanın en çok takip edilen kişisi olarak “online” hayatın rekorlarına sahip Branson, konferansa da özel yaşamında tercih ettiği Mavi Jean’iyle katıldı. Richard Branson, Virgin Galactic Spaceship Two lansmanında da Mavi Jean’ini giymiş ve havalara uçtuğu, hafızalara kazınan fotoğrafı bütün dünyayla paylaşılmıştı. Konferans sırasında fonda yer alan bu fotoğraf, dinleyiciler arasında da ilgi odağı oldu. Mavi CEO’su Cüneyt Yavuz’un söylediğine göre kıyafet sponsoru olmadıklarını, bunun Branson’un kişisel tercihi olduğunu vurguladı. Sadece Branson mu? Benim neslim adını yeni duymuş olabilir ama tutkulu takipçileri olan Francisco Lachowski, Vini Uehara ve Luck Blue Smith de Mavi’yi taşıyan ünlüler. Biraz bizim nesildekilere bakarsak: Chelsea Clinton’dan Geri Halliwell’a, Cher’den Antonio Banderas’a, Dannii Minogue’dan Billy Zane’e kadar birçok ünlünün favorisi yine Mavi’ydi. Amerika’da önce ‘Made in Maviland’, arkasından ‘Mavifits’ reklam kampanyaları yürüten Mavi’nin artık bir ‘dünya markası’ olduğu kabul ediliyor. Dünyanın önde gelen haftalık haber dergilerinden Time, “İş Dünyası” bölümünde Mavi Jeans’e yer verdi. Amerika’nın ünlü erkek moda dergisi DNR’ın belirlediği ‘Erkek Giyiminde En Güçlü 100’ kişi arasında Mavi Amerika Başkanı Ersin Akarlılar da yer aldı. Peki, bu duruma nasıl gelindi? Mavi Jeans’i üreten Erak Giyim’in arkasında bugün 76 yıllık bir deneyim var. Sait Akarlılar, iş hayatına 14 yaşında terzi çırağı olarak başladı. 1954 yılında tekstille tanışıyor. Önce spor giyim dikimi ile mesleğe başlayan Akarlılar, sonra mont, pantolon dikmeyi öğreniyor. 5 yıl sonra işverenliğe adım atarak 1960 yılında atölye kuruyor. 1971 yılında Güven Giyim ile üretim ve çalışma alanını genişletiyor. 80 öncesi hem ihracat cazip değildi. Küresel deneyiminde ve kendi marka sürecine katkı yapan ise, 1984 yılında kurduğu Erak şirketiyle Lee, Mustang, Wrangler gibi dünya markalarının üretimini Türkiye’de yapmaya başlıyor. Akarlılar, “Yola çıkarken 100 yıllık jean şirketlerini örnek aldık, nesillere intikal eden şirket olmayı hedefledik” diyerek düşüncelerini paylaşıyor. Yedi yıl sonra 1991 yılında ise grubun ‘amiral gemisi’ Mavi Jeans’in kuruluşu gerçekleşiyor. Sait Akarlılar, Mavi vizyonunu ve kuruluşunu şöyle anlatıyor: “1980’li yıllarda ihracatta bir patlama oldu. Daha önce blue jean kumaşı üreten fabrikalar yoktu. Bu dışa açılma yıllarında bu fabrikalar oluştu. Bu fabrikalar olunca ve diğer yabancı markalar Türkiye’ye girince biz de bu işte bir gelecek gördük. Kumaş var, pamuk var dedik ve konfeksiyon üretimine girmeyi düşündük. Mavi Jeans de, bu fikrimizden sonra oluştu. Türkiye çok genç nüfusa sahip bir ülke. Biz de genç insanların spor giyim içerisinde jean pantolona ilgi duyacaklarını düşündük. Bazı araştırmalar yaptık. Spor giyim içerisinde jeanin yerinin iyi zamanlarda yüzde 80–85’lere ulaştığını, en düşük zamanlarda bile yüzde 60’lara düşmediğini gördük. Bu araştırmalardan sonra fabrikaya ve markaya yatırım yaptık”. Hala aynı vizyon doğrultusunda markanın konumlandırıldığını düşünüyorum. İzleyen yıllarda Mavi’nin gelişmeleri üzerine şu notlar düşülebilir: 1993’te Mavi Jeans’in geniş kapsamlı ilk yurtiçi reklam kampanyası yapıldı. Akmerkez ve Galeria mağazaları ile perakendeciliğe başlandı. 1994’te ilk ihracatı başladı. Mavi Jeans, jeanin anavatanı kabul edilen ABD’de başarısı Türkiye’den gördüğümüz kadar parlak değil. Aslında yurtdışında yapacakları iş çok ve son 15 yıl yeni deneyimler ile geçti. Her ülkede kendi stratejisini oluşturacak Mavi Şirketleri kuruldu. Rusya da bu bağlamda değerlendirilmelidir. 2015 yılı Rusya için hamle yılı olacaktı ama kriz dolayısıyla şimdilik beklemeye alındı. Yani Avrupa’da, Rusya’da veya herhangi bir dünya ülkesinde birinci Türk markası Mavi değil. Zaten reklam kampanyalarına bakarsak, iç pazara hitap eden mottolar var. Bakalım küresel bir söylemle ne zaman çıkış yapacak? Unutmayalım ki, satış rakamlarından bahsediyorum. Algısı her zaman satış rakamlarınızın üstünde olan bir marka oluşturulduğunun hakkını verelim. Peki, bundan sonra Mavi nereye koşacak? Bunun cevabını da Sait Akarlılar’ın bir röportajdaki sözlerinde saklı. “Aile şirketiyiz, ancak ailenin kontrolünde profesyonellerin liderliğinde yönetiliyor. Son karar ise, olumlu ya da olumsuz, ailenin en büyüğü olduğum için benim tarafımdan veriliyor. Örneğin, bizim her departmanımız işe alımda kendi görüşmelerini kendileri yapar, kendi ekiplerini kendileri kurarlar. Bu elemanı al burada çalıştır zihniyeti hiçbir yerde yoktur.” Yani kontrollü profesyonel kararlar ne kadar sağlıklı olur ve gençler ne kadar koşturursa Mavi, o ufuk noktalarına da koşacak. En önemlisi de, 88 yaşında yeni marka nasıl olacak? Mavi Jeans'i kuran Sait Akarlılar'dan 25 yıl mesajı \"88 yaşında yeni marka kuracağım\"Mavi Jeans ne kadar biliniyorsa, Sait Akarlılar da o kadar az tanınıyor. Bu onun kişisel tercihi, ama vizyonu ve mesleki…thebrandage.com "}