{"parent": "", "timestamp": "Apr 2", "title": "Living Root bridges of Meghalaya", "sentences": [{"b239": "Living Root bridges of Meghalaya"}, {"b57a": "Deep in the rainforest of Meghalaya, lies a hidden gem of human ingenuity. For centuries, the local Khasi tribes have been building living bridges out of the roots of rubber trees. Today, they’re used daily by local villagers and tourists alike. A creation straight out of fantasy novels, they’re gorgeous and surreal."}, {"520e": "There are actually more than 50 root bridges in Meghalaya, and until recently they’ve all been hidden away in the jungle, miles away from modern civilization. Even today, only a couple are within walking distance from the nearest road. Most of them are buried in the forrest and can only be found with a guide from the local village. Some of the older abandoned ones deeper in the jungles are lost even to the locals, awaiting the next intrepid explorer to stumble across their beauty."}, {"3d4e": "Our guide Hep took us to this rarely visited bridge, supposedly the longest and tallest one in the region,and made out of a single strand of root due to the wide span of the bridge."}, {"9a03": "Each of the bridges had different constraints and designs. The tallest and longest bridge sits more than 30 meters above the canyon floor. Its span is so wide, that only one root branch made it across the whole span. But over time, it has grown thick enough to form a bridge base and villagers have put up bamboo railings on top of the single root branch. Crossing it was an exhilarating exercise in trust for the ancient Khasi people."}, {"aa67": "Walking across the longest root bridge"}, {"6541": "The Double Decker"}, {"cecf": "Being the rainiest place on Earth, when the monsoon season hits, these bridges often provide the only viable way to cross the raging rivers. We heard that there’s one place where the locals have built a double-decker root bridge, with the higher one used during the monsoon. So we set out by ourselves to find it:First, we went to the local bus parking lot to find a private driver that is going down to the nearby village Sohra/Cherrapunjee. The local jeeps are called “Sumos”. and we crammed 17 people into/onto an SUV that would fit 8 in the US."}, {"90b0": "From Sohra, we took another local shared car that drove literally to the end of the road, and dropped us off. From there we’re on foot.Our destination: The bottom of the valley where the clouds live."}, {"e863": "The journey going down took two hours of stairs, multiple metal suspension bridges, and incredible scenery. We were exhausted by the time we got to the bottom, and didn’t even want to think about going back up. Luckily, there’s a homestay in the village at the bottom of the canyon! We ended up staying there for two nights, exploring the region using the owner’s hand-drawn map."}, {"70fc": "Once we reached the bottom. The double decker was every bit as magnificent as promised."}, {"b26b": "On our hike back out, the legendary rainy weather of Sohra showed it self, lightning, thunder, and pouring rain followed us the entire 3 hours as we climbed back out of the canyon, drenched to the core and feeling more alive than ever! Sadly I couldn’t take any pictures as it the rain would’ve instantly destroyed anything I took out of my bag."}, {"a23f": "Meghalaya scenery and culture:"}, {"f42b": "We came to Meghalaya for the root bridges, but instead we found so much more. There were fantastic cliff views, glorious waterfalls, and the local Khasi tribes have a distinct culture completely different from the Indian mainland. The best part is, since tourism is nascent and most sights require hours of hiking, we were alone with nature for almost all of it!"}, {"325b": "This falls doesn’t have a name, but it cascades down for a hundred meters before falling into a sheer vertical ravine!"}, {"ac0c": "Root engineering"}, {"1eb4": "If you’re like me, you’re probably super curious as to the engineering of the bridges themselves. What’s the load capacity? How was it made? What are the root patterns? Hopefully some of these pictures will answer your questions!"}, {"a5d1": "The bridges start out as bamboo and wood, but those would rot or get washed away by the rain, and would need to be rebuilt every year. So the rubber trees are planted on the river banks and the roots allowed to creep along the bamboo scaffold."}, {"a598": "Over time. The root grow into a thick lattice, and rocks and dirt are piled on to “pave” it. The oldest ones are basically wide thoroughfares one can drive cattle across!"}, {"f998": "The ingenious Khasi people not only built root bridges, but also ladders and cliff-side stairs out of the rubber roots! In the picture below on the right. Owen’s standing on centuries old stone stairs that are held up ONLY by rubber tree roots grown along the cliff edge! Below Owen are rocks, roots, and hundred meter drops into the canyon!"}, {"ff4f": "Bonus pictures:"}, {"aa09": "I just love these bridges so much. Here’s some extra photos for you. Next stop, Myanmar!"}], "author": "Tommy Liu", "child": "1575_1", "name": "1575", "content": "Living Root bridges of Meghalaya Deep in the rainforest of Meghalaya, lies a hidden gem of human ingenuity. For centuries, the local Khasi tribes have been building living bridges out of the roots of rubber trees. Today, they’re used daily by local villagers and tourists alike. A creation straight out of fantasy novels, they’re gorgeous and surreal. There are actually more than 50 root bridges in Meghalaya, and until recently they’ve all been hidden away in the jungle, miles away from modern civilization. Even today, only a couple are within walking distance from the nearest road. Most of them are buried in the forrest and can only be found with a guide from the local village. Some of the older abandoned ones deeper in the jungles are lost even to the locals, awaiting the next intrepid explorer to stumble across their beauty. Our guide Hep took us to this rarely visited bridge, supposedly the longest and tallest one in the region,and made out of a single strand of root due to the wide span of the bridge. Each of the bridges had different constraints and designs. The tallest and longest bridge sits more than 30 meters above the canyon floor. Its span is so wide, that only one root branch made it across the whole span. But over time, it has grown thick enough to form a bridge base and villagers have put up bamboo railings on top of the single root branch. Crossing it was an exhilarating exercise in trust for the ancient Khasi people. Walking across the longest root bridge The Double Decker Being the rainiest place on Earth, when the monsoon season hits, these bridges often provide the only viable way to cross the raging rivers. We heard that there’s one place where the locals have built a double-decker root bridge, with the higher one used during the monsoon. So we set out by ourselves to find it:First, we went to the local bus parking lot to find a private driver that is going down to the nearby village Sohra/Cherrapunjee. The local jeeps are called “Sumos”. and we crammed 17 people into/onto an SUV that would fit 8 in the US. From Sohra, we took another local shared car that drove literally to the end of the road, and dropped us off. From there we’re on foot.Our destination: The bottom of the valley where the clouds live. The journey going down took two hours of stairs, multiple metal suspension bridges, and incredible scenery. We were exhausted by the time we got to the bottom, and didn’t even want to think about going back up. Luckily, there’s a homestay in the village at the bottom of the canyon! We ended up staying there for two nights, exploring the region using the owner’s hand-drawn map. Once we reached the bottom. The double decker was every bit as magnificent as promised. On our hike back out, the legendary rainy weather of Sohra showed it self, lightning, thunder, and pouring rain followed us the entire 3 hours as we climbed back out of the canyon, drenched to the core and feeling more alive than ever! Sadly I couldn’t take any pictures as it the rain would’ve instantly destroyed anything I took out of my bag. Meghalaya scenery and culture: We came to Meghalaya for the root bridges, but instead we found so much more. There were fantastic cliff views, glorious waterfalls, and the local Khasi tribes have a distinct culture completely different from the Indian mainland. The best part is, since tourism is nascent and most sights require hours of hiking, we were alone with nature for almost all of it! This falls doesn’t have a name, but it cascades down for a hundred meters before falling into a sheer vertical ravine! Root engineering If you’re like me, you’re probably super curious as to the engineering of the bridges themselves. What’s the load capacity? How was it made? What are the root patterns? Hopefully some of these pictures will answer your questions! The bridges start out as bamboo and wood, but those would rot or get washed away by the rain, and would need to be rebuilt every year. So the rubber trees are planted on the river banks and the roots allowed to creep along the bamboo scaffold. Over time. The root grow into a thick lattice, and rocks and dirt are piled on to “pave” it. The oldest ones are basically wide thoroughfares one can drive cattle across! The ingenious Khasi people not only built root bridges, but also ladders and cliff-side stairs out of the rubber roots! In the picture below on the right. Owen’s standing on centuries old stone stairs that are held up ONLY by rubber tree roots grown along the cliff edge! Below Owen are rocks, roots, and hundred meter drops into the canyon! Bonus pictures: I just love these bridges so much. Here’s some extra photos for you. Next stop, Myanmar! "}