{"parent": "", "timestamp": "Apr 11", "title": "I need your loving eyes for a moment…", "sentences": [{"08cd": "I need your loving eyes for a moment…"}, {"3fd7": "A mission for the lion-hearted lovers out there"}, {"f06c": "(This is a longer one. Scan through the body and scroll all the way down to the end for a little favor I ask of you if you have time…)"}, {"f67f": "Being a regular writer in this space, I get quite a few emails and notes from people. Some of these people are in pain. And a subset of these are in severe pain."}, {"0ee0": "Then I close the computer, jump back into my life, and I don’t understand how this is even possible that another human, just miles away, is enduring so much strife and struggle."}, {"0636": "Yes, I’ve been through some… stuff. Yes, I grew up around addiction and poverty and dysfunction. Yes, I witnessed the human body of my mom slowly decay before she closed its eyes and left. Yes, I saw my dad make the same transition a little later in life. And I’ve had the stuff in between and around those moments."}, {"8213": "But I’m so crazy fortunate to have always had a lot of people in my life looking back at me with loving eyes. Not everyone. But most."}, {"aaf5": "Now, back to the emails… When I get these notes and mentions, I typically have no idea what to say to people to ‘make it better’. I really don’t. And this bugs me. Because I’m going into a line of work that will demand this of me on a regular basis time and time again."}, {"0c72": "I can’t look at these people and tell them to pray. I can’t tell them that God will take care of it. This doesn’t feel anywhere near genuine, thorough, or accurate enough."}, {"b011": "So what do I do? Here, on this platform, I’m limited to words. This is all fine and good for superficialities. But at a certain level, they only do so much good."}, {"a403": "Love and the concept of ‘peopling’"}, {"cde5": "It’s so cliche’ in spirituality: ‘God is love.’ I hear it all the time, but it hasn’t ever hit me at a deep level. I’ve always understood the sentiment, but it’s felt very fuzzy and ephemeral."}, {"beac": "Until I read something that brought this whole concept to life…"}, {"a7ea": "Here’s a blurb from a very long and complicated (but fantastic, if you’re into this kind of thing) article titled The Essence of Peopling (I understood about 15% of it, but it was enough to totally change the way I see things):"}, {"b714": "The self is not unitary and separate from others; peopling occurs in the context of mutual-mental-modeling relationships, which continue to affect each person when he is alone."}, {"4e1d": "Each person’s self is spread out among many people, simulated in all their brains at varying levels of granularity. And each person has a different “self” for each one of the people he knows, and a different self for every social context. A teenager has a very different way of behaving, speaking and thinking around his friends from the way he behaves, speaks, and thinks around his grandparents. The self at work is different from the self at home with close friends, or in bed with a spouse. And none of these are the “true self” — rather, the self exists in all these, and in the transitions between them. There can never be one single, public self; to collapse all these multiple selves together would be akin to social death."}, {"fdd5": "So, the self is not developed by mere positive thinking. Trying to enhance our love for self in solitude does us no good."}, {"f1d5": "What matters is what I perceive looking back at me when I look into your eyes."}, {"9ffb": "I’m convinced this saved me as a kid. I was surrounded by dysfunctional people, but a lot of the time (certainly not all the time) I saw love reflected back. Especially my parents. And it only takes a couple people in one’s life to take hold."}, {"95fc": "There’s no way around it. We are tribal creatures. We were this way long before language and advertising copy came around. One day, a certain set of thinkers came around and peddled this idea that the self could be developed in a vacuum. Descartes said, “I think, therefore I am.”"}, {"53b9": "And so, the exorcism of self-loathing and hatred became an inside job for many of us. Misery was something we were to handle behind closed doors. Because if we could just think better, we could change."}, {"d9dd": "But today, people are showing that it’s a liiittle more complex than this. They’re pointing back to our tribal nature and realizing that the self is never unitary or separate from others. The line of logic (for me) goes like this:"}, {"3b78": "I am not who I think I am. I am not who you think I am. I am who I think you think I am."}, {"a999": "The ‘other’ is required to be."}, {"0ea2": "It’s your perception of other people’s perception about you that creates your identity as a human. So, you are who you think OTHERS think you are."}, {"60b9": "Say what you want about the ego/identity. It’s a large part of our human experience and is not to be discarded or ignored."}, {"e7cf": "This has lead me to a mission. Through this revelation, I’ve realized one main thing I’d like to do through my work on this planet this time around:"}, {"c14d": "I want to create spaces and cultivate a tribe of people whose soul purpose (like what I did there?) is to foster a set of loving eyes and then turn them towards the world."}, {"abca": "No, we can’t control how others take those loving gazes. This is the most important thing, but it’s something no one can control."}, {"6245": "I can’t make you believe that I love you. All I can do is make it easy for you to believe I do."}, {"feb5": "This is what we’re lacking in today’s hyper-rational, I-don’t-approve-of-you culture out west."}, {"5edb": "Looking into the eyes of someone else and seeing pure love and acceptance being reflected back at us is as close as I can imagine we can get to looking into the eyes of God."}, {"422b": "So this is my mission. I want to cultivate an army of humans who can sit with someone in tremendous pain and look at them with loving — if tearful — eyes."}, {"ff0d": "Not to try to fix or heal them. Just to love them."}, {"0b3b": "Think if we could develop the ability to sit in solidarity with a fellow human — along with our own set of pains, inadequacies, and stories — and just… Love."}, {"3a78": "Now, love doesn’t have just one shade. Yes, love can be kind. Yes, love can be mellow and flowery."}, {"505e": "But true, unconditional love can also be passionate and fiery. It can turn over tables, cleanse temples, kick out moneychangers, and cut deep into the soul. Love is real. Raw. With no filter. It exposes itself and lays itself bare on the altar to be sacrificed at any open moment."}, {"fd38": "So, please… Whether you believe in a God or not (chances are, if you don’t, I likely don’t believe in THAT God either), this is something we all can get behind. Let’s do our part in making it easy for as many people we come across as possible to feel that love reflected back at them."}, {"a49c": "It’s not hippy dippy bullshit. It’s not an empty statement about God being love. It’s how we operate as living beings."}, {"7f25": "A call to action for those who are up for it"}, {"881c": "P.S. I typically don’t do this kind of thing, but I’ve come across a person, Jennifer Marie Gady. She’s one of a countless number of people who could use a set of loving eyes. She’s a beautiful soul and a passionate, poetic writer. The kind we need in this world to bring others across the bridge, because she’s crossing hers right now."}, {"40f7": "Please do me a favor… Create a Medium post with a photo of your face (yes, a selfie). I want to see those loving eyes. Meditate, pray, or just contemplate (whatever your flavor) for a few minutes before snapping it. Get in that sacred space of raw, human, unabashed love. Not concern. Not sympathy. Not sadness. Not fear. Love. Love that sees through the facade of human pain into the core of love in the other. This love exists in all of us. It’s what keeps us alive and thriving as a human species."}, {"1c90": "Then tag Jennifer Marie Gady (like I did). Just type her name in below your photo, proceeded by the @ symbol like this: @Jennifer Marie Gady (no, don’t copy and paste — it won’t work). When you start typing her name after the ‘@’, a list of medium users will pop up. As you keep typing, you’ll see hers and can click on it to select (you know you’ve done it right when her name turns green)."}, {"c54d": "Again, I’m not singling her out (well, I kinda am — but I hope she’s okay with it). She just represents one of many going through the same ordeal."}, {"25ad": "So close your eyes. Find that space. Snap that photo of your loving eyes. And send it to her. It’s a great place to start. Here’s mine:"}, {"24e8": "Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below."}], "author": "Jonas Ellison", "child": "1601_1\t1601_2\t1601_3\t1601_4\t1601_5\t1601_6\t1601_7\t1601_8\t1601_9\t1601_10\t1601_11\t1601_12\t1601_13\t1601_14\t1601_15\t1601_16\t1601_17\t1601_18\t1601_19\t1601_20\t1601_21\t1601_22\t1601_23\t1601_24\t1601_251601_1\t1601_2\t1601_3\t1601_4\t1601_5\t1601_6\t1601_7\t1601_8\t1601_9\t1601_10\t1601_11\t1601_12\t1601_13\t1601_14\t1601_15\t1601_16\t1601_17\t1601_18\t1601_19\t1601_20\t1601_21\t1601_22\t1601_23\t1601_24\t1601_25", "name": "1601", "content": "I need your loving eyes for a moment… A mission for the lion-hearted lovers out there (This is a longer one. Scan through the body and scroll all the way down to the end for a little favor I ask of you if you have time…) Being a regular writer in this space, I get quite a few emails and notes from people. Some of these people are in pain. And a subset of these are in severe pain. Then I close the computer, jump back into my life, and I don’t understand how this is even possible that another human, just miles away, is enduring so much strife and struggle. Yes, I’ve been through some… stuff. Yes, I grew up around addiction and poverty and dysfunction. Yes, I witnessed the human body of my mom slowly decay before she closed its eyes and left. Yes, I saw my dad make the same transition a little later in life. And I’ve had the stuff in between and around those moments. But I’m so crazy fortunate to have always had a lot of people in my life looking back at me with loving eyes. Not everyone. But most. Now, back to the emails… When I get these notes and mentions, I typically have no idea what to say to people to ‘make it better’. I really don’t. And this bugs me. Because I’m going into a line of work that will demand this of me on a regular basis time and time again. I can’t look at these people and tell them to pray. I can’t tell them that God will take care of it. This doesn’t feel anywhere near genuine, thorough, or accurate enough. So what do I do? Here, on this platform, I’m limited to words. This is all fine and good for superficialities. But at a certain level, they only do so much good. Love and the concept of ‘peopling’ It’s so cliche’ in spirituality: ‘God is love.’ I hear it all the time, but it hasn’t ever hit me at a deep level. I’ve always understood the sentiment, but it’s felt very fuzzy and ephemeral. Until I read something that brought this whole concept to life… Here’s a blurb from a very long and complicated (but fantastic, if you’re into this kind of thing) article titled The Essence of Peopling (I understood about 15% of it, but it was enough to totally change the way I see things): The self is not unitary and separate from others; peopling occurs in the context of mutual-mental-modeling relationships, which continue to affect each person when he is alone. Each person’s self is spread out among many people, simulated in all their brains at varying levels of granularity. And each person has a different “self” for each one of the people he knows, and a different self for every social context. A teenager has a very different way of behaving, speaking and thinking around his friends from the way he behaves, speaks, and thinks around his grandparents. The self at work is different from the self at home with close friends, or in bed with a spouse. And none of these are the “true self” — rather, the self exists in all these, and in the transitions between them. There can never be one single, public self; to collapse all these multiple selves together would be akin to social death. So, the self is not developed by mere positive thinking. Trying to enhance our love for self in solitude does us no good. What matters is what I perceive looking back at me when I look into your eyes. I’m convinced this saved me as a kid. I was surrounded by dysfunctional people, but a lot of the time (certainly not all the time) I saw love reflected back. Especially my parents. And it only takes a couple people in one’s life to take hold. There’s no way around it. We are tribal creatures. We were this way long before language and advertising copy came around. One day, a certain set of thinkers came around and peddled this idea that the self could be developed in a vacuum. Descartes said, “I think, therefore I am.” And so, the exorcism of self-loathing and hatred became an inside job for many of us. Misery was something we were to handle behind closed doors. Because if we could just think better, we could change. But today, people are showing that it’s a liiittle more complex than this. They’re pointing back to our tribal nature and realizing that the self is never unitary or separate from others. The line of logic (for me) goes like this: I am not who I think I am. I am not who you think I am. I am who I think you think I am. The ‘other’ is required to be. It’s your perception of other people’s perception about you that creates your identity as a human. So, you are who you think OTHERS think you are. Say what you want about the ego/identity. It’s a large part of our human experience and is not to be discarded or ignored. This has lead me to a mission. Through this revelation, I’ve realized one main thing I’d like to do through my work on this planet this time around: I want to create spaces and cultivate a tribe of people whose soul purpose (like what I did there?) is to foster a set of loving eyes and then turn them towards the world. No, we can’t control how others take those loving gazes. This is the most important thing, but it’s something no one can control. I can’t make you believe that I love you. All I can do is make it easy for you to believe I do. This is what we’re lacking in today’s hyper-rational, I-don’t-approve-of-you culture out west. Looking into the eyes of someone else and seeing pure love and acceptance being reflected back at us is as close as I can imagine we can get to looking into the eyes of God. So this is my mission. I want to cultivate an army of humans who can sit with someone in tremendous pain and look at them with loving — if tearful — eyes. Not to try to fix or heal them. Just to love them. Think if we could develop the ability to sit in solidarity with a fellow human — along with our own set of pains, inadequacies, and stories — and just… Love. Now, love doesn’t have just one shade. Yes, love can be kind. Yes, love can be mellow and flowery. But true, unconditional love can also be passionate and fiery. It can turn over tables, cleanse temples, kick out moneychangers, and cut deep into the soul. Love is real. Raw. With no filter. It exposes itself and lays itself bare on the altar to be sacrificed at any open moment. So, please… Whether you believe in a God or not (chances are, if you don’t, I likely don’t believe in THAT God either), this is something we all can get behind. Let’s do our part in making it easy for as many people we come across as possible to feel that love reflected back at them. It’s not hippy dippy bullshit. It’s not an empty statement about God being love. It’s how we operate as living beings. A call to action for those who are up for it P.S. I typically don’t do this kind of thing, but I’ve come across a person, Jennifer Marie Gady. She’s one of a countless number of people who could use a set of loving eyes. She’s a beautiful soul and a passionate, poetic writer. The kind we need in this world to bring others across the bridge, because she’s crossing hers right now. Please do me a favor… Create a Medium post with a photo of your face (yes, a selfie). I want to see those loving eyes. Meditate, pray, or just contemplate (whatever your flavor) for a few minutes before snapping it. Get in that sacred space of raw, human, unabashed love. Not concern. Not sympathy. Not sadness. Not fear. Love. Love that sees through the facade of human pain into the core of love in the other. This love exists in all of us. It’s what keeps us alive and thriving as a human species. Then tag Jennifer Marie Gady (like I did). Just type her name in below your photo, proceeded by the @ symbol like this: @Jennifer Marie Gady (no, don’t copy and paste — it won’t work). When you start typing her name after the ‘@’, a list of medium users will pop up. As you keep typing, you’ll see hers and can click on it to select (you know you’ve done it right when her name turns green). Again, I’m not singling her out (well, I kinda am — but I hope she’s okay with it). She just represents one of many going through the same ordeal. So close your eyes. Find that space. Snap that photo of your loving eyes. And send it to her. It’s a great place to start. Here’s mine: Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below. "}