{"parent": "", "timestamp": "Apr 12", "title": "It’s all anxiety-management", "sentences": [{"8ed7": "It’s all anxiety-management"}, {"e26a": "Some parenting and life stuff"}, {"d48b": "So, parenting lesson*#4876:"}, {"a0dc": "Parenting is 98.769% about anxiety-control. If you deal with your stuff, the kid part often works out on its own."}, {"e258": "Your kid isn’t a container that you dump your unhealed anxieties into. Life is complex. We all have our own stuff to work through."}, {"5a9e": "Giving a kid our stuff in addition to their stuff gives them double-stuff to work through. And at such a young, precious age, they easily get overwhelmed."}, {"21f3": "And they freak out. In the middle of Target. With every mom in town circling you with their shopping carts like a fight in the alley in 5th grade after school."}, {"5291": "I’ve also found this to be true with bosses, friends, exes, grocery store cashiers, bartenders, baristas, bankers, and pretty much everyone else."}, {"3b35": "*When I say ‘parenting lesson’, I’m talking about a lesson that we parents learn from our kids, not something that we teach to them."}, {"fce2": "Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below."}], "author": "Jonas Ellison", "child": "1602_1\t1602_2\t1602_3\t1602_4\t1602_5\t1602_6\t1602_71602_1\t1602_2\t1602_3\t1602_4\t1602_5\t1602_6\t1602_7", "name": "1602", "content": "It’s all anxiety-management Some parenting and life stuff So, parenting lesson*#4876: Parenting is 98.769% about anxiety-control. If you deal with your stuff, the kid part often works out on its own. Your kid isn’t a container that you dump your unhealed anxieties into. Life is complex. We all have our own stuff to work through. Giving a kid our stuff in addition to their stuff gives them double-stuff to work through. And at such a young, precious age, they easily get overwhelmed. And they freak out. In the middle of Target. With every mom in town circling you with their shopping carts like a fight in the alley in 5th grade after school. I’ve also found this to be true with bosses, friends, exes, grocery store cashiers, bartenders, baristas, bankers, and pretty much everyone else. *When I say ‘parenting lesson’, I’m talking about a lesson that we parents learn from our kids, not something that we teach to them. Jonas writes short daily stories and preachments on the daily here in Higher Thoughts. Get one to enjoy with your coffee every morning by subscribing below. "}