{"parent": "", "timestamp": "Apr 13", "title": "What Is the Meaning of Life?", "sentences": [{"9eeb": "What Is the Meaning of Life?"}, {"aa73": "To Find Out, Answer These Four Questions"}, {"d359": "Image via Pixabay.com"}, {"3489": "This essay riffs off of lecture #36, “So, What Is the Meaning of Life?,” the final lecture in the Great Courses series The Meaning of Life: Perspectives from the World’s Great Intellectual Traditions, taught by Professor Jay L. Garfield."}, {"9527": "How to Think About the Meaning of Life"}, {"2d8f": "“The Meaning of Life by Anna Vital” by Chris Lexow via Flickr/License"}, {"1384": "If you had asked me “What is the meaning of life?” before I listened to this lecture series, I might have shrugged my shoulders and sung you a verse of Monty Python’s “The Galaxy Song.” I never thought of life’s ultimate meaning as a question that had an answer, or at least not one we limited human beings stood much chance of ever finding."}, {"11de": "In The Meaning of Life: Perspectives from the Great Intellectual Traditions, Professor Garfield acknowledges the stifling enormity of the question asked flat out like that, and pares it down to a more humanly manageable query. He asks, instead — as seen through the lens of the traditions being discussed in each lecture in the course, how can I, as an individual, lead a meaningful life? If I’m a Hindu, or a Buddhist, or a Christian, or a Stoic, or a Modern or Postmodern philosopher, how can I be sure that I’m not wasting my time on earth? What’s the goal of life? How do I best pursue that goal? How do I know when I’ve achieved it?"}, {"78ff": "As you might have guessed, there is no “one right answer.” Thinkers in varying times and cultures have reached different and sometimes contradictory conclusions. But in his final, wrap-up lecture in the series, Professor Garfield manages to tease out four overarching questions that all of the traditions discussed ask in their pursuit of life’s meaning. They may find different answers, but they mostly ask the same questions. In our 21st Century quest for the meaning of our own,individual lives, with many of us operating outside any one spiritual or philosophical tradition, knowing the right questions to ask can make all the difference."}, {"764e": "Question #1: CONTEXT"}, {"6e77": "Image via Pixabay.com"}, {"fcc9": "One of the primary goals of all religions and philosophies is to help people understand their individual role within, and proper relationship to, that part of reality that is greater than themselves."}, {"a714": "For philosophers like Aristotle and Confucius, the greater reality that matters most is the social order, the Polis. We find our most significant life meaning in cultivating right relationships with each other, and playing our proper role within the societies we form."}, {"6619": "For theistic traditions like Judaism, Christianity, Islam, Hinduism and even Stoicism, which is rooted in Greek and Roman paganism, the greater reality is God or gods, from whom flow a rational order we have a place within and can understand and relate to."}, {"c08c": "Non-theistic traditions like Buddhism, much European philosophy, and, of course, science, ask individuals to locate themselves within a physical universe of causal connections. In Buddhism, for example, everything existing — including us — is seen to be the effect of causes that came before, and to simultaneously be a cause of things to come. Nothing arises independently. Our right relationship to the greater reality is mostly one of understanding how it works and accepting our ephemeral role within it. Science, and philosophies rooted in the scientific worldview, largely agree."}, {"20a7": "There are traditions that blend the contexts above, such as Taoism, which sees us embedded in the natural world, which is itself embedded in and permeated by the Tao — which is not understood to be any kind of personal god, like we see in the Abrahamic faiths. Pantheism, Wicca and many Native American traditions embrace our physical role in the natural world, while also experiencing Nature to be spiritually alive and sacred."}, {"6993": "The initial question we must ask and answer in our quest for the meaning of our individual lives is this:"}, {"3442": "First, do we even understand ourselves to exist within a larger context? Do we have any sense that we take part in larger realities like the society we live in, the natural world, or a supernatural order? Or do we just live out of our own heads, our own needs and desires of the moment, our own egocentric daily experience? For our individual lives to have meaning beyond instinctive seeking of pleasure and avoidance of pain, the religious and philosophical traditions of the world largely concur that it’s necessary to locate ourselves within a larger context than personal ego."}, {"d318": "This is really the most important of the four questions. Don’t skip it. To continue this process, and find the meaning of life, we have to start by defining the grand context in which our individual lives unfold. There’s a world outside our heads and beyond the mirror. What’s that world like, and what’s our relationship to it?"}, {"e30f": "Second, then, what does the larger context we’ve defined tell us about how we should live? About what matters, what adds (or reveals) meaning, and what sorts of thoughts, feelings, actions, disciplines, etc. are proper to a human being? Seen in that context, how do our individual lives measure up? Are there things we need to change?"}, {"1edb": "Question #2: Time and Impermanence"}, {"9fa3": "Photo by Lehigh Valley, PA via Flickr/License"}, {"3047": "We’re all going to die. There, I said it. Now what are we going to do about it?"}, {"a08b": "If our answer is “refuse to think about it,” we may struggle to find meaning in our lives."}, {"840a": "Even religions that posit an afterlife in heaven, the Summerland, via reincarnation, etc., unanimously urge us to look at the time we have in this current life on earth as finite and immensely valuable. Stoics like Epictetus and Marcus Aurelius contemplated the truth that the universe was here for billions of years before we existed, and will go on for billions more after we’re gone. Our lives are ephemeral in the extreme, and should therefore rightly be precious to us. Keeping the brevity of life in the front of our minds adds urgency and meaning to all we do."}, {"646f": "Is this life all there is? If so, are we cherishing every irreplaceable moment? If we aren’t, what do we need to change in order to rightly value, and make the best use of, our limited time on earth?"}, {"b21b": "Is there an afterlife? If so, can we just coast to it? Are there things we need to be doing, and ways we should be living right now, in this life, to be ready for the transition of death, which could come at any moment? Will we reach the end having to explain why we spent six hours a day watching TV? Or treating other people badly? Or being selfish? Or refusing to help others? Are we investing our limited hours and days and years in the urgent pursuit of enlightenment? Or demonstrating compassion? Or practicing the Yogas of action, knowledge and devotion?"}, {"5794": "Also, consider that everybody else is just as impermanent as we are. Are we taking the people in our lives for granted? Are we putting off loving and appreciating others as if we (and they) had all the time in the world?"}, {"5b43": "Do we treat non-human things like money, cars, houses, jobs, as if they had eternal significance? Are we making them more important than people? Than ourselves? Have we chained our lives to things that won’t last?"}, {"9707": "Question #3: The Human Ideal"}, {"280d": "Image by Hartwig HKD via Flickr/License"}, {"0b66": "In the larger context as we have chosen to define it, what does it mean to be human? What are we? What’s possible for us by virtue of our human birth? We’re not trees or bugs or housecats. We’re human beings. How is that special? How should we live in order to actualize our highest human potential? How will we know when we’ve achieved it? What would it mean to not pursue or achieve the human ideal?"}, {"fd77": "I’m thinking here of things like, in a religious context, sainthood, enlightenment, or better incarnations, or in a secular context, our greatest genius, our highest creative expression, our noblest love, etc."}, {"c86a": "Question #4: Authenticity"}, {"66db": "Image via Pixabay.com"}, {"626e": "In Leo Tolstoy’s novel The Death of Ivan Ilych, the main character endures a prolonged and painful illness that ends in his death. Along the way, he comes to understand the upright, successful, ordinary life he led when he was well very differently in light of his impending death. Professor Garfield explains:"}, {"708e": "He realizes that he has frittered his life away on the trivial, on the public sphere, instead of confronting the structure of his own existence. He questions whether life is that “senseless and horrible,” but of course, that’s the point: If we lead a life in which we pay little attention to the concrete reality of our existence and our mortality, a senseless and horrible life is what we’re left with. On the eve of his death, Ilych wonders whether his whole life might have been false; he asks, “But if that is so … and if I am leaving this life with the consciousness that I have lost all that was given to me and it is impossible to rectify it, what then?” Tolstoy’s point is that we may all be in exactly that position if we don’t move to lead more authentic, meaningful lives now."}, {"fc11": "Are we leading lives we have chosen for ourselves? That allow us to flower as individuals, and leave our own unique mark on the world? Or do our days just happen to us, and we respond to events the way others expect of us and call it good? Do our lives awaken what’s special about us as individuals? Or do they anesthetize our authentic selves?"}, {"3d72": "The difference between Question #3: The Human Ideal and Question #4: Authenticity is that, with the Human Ideal, we’re asking what is possible for all human beings. With Authenticity, we’re asking what is uniquely possible for us, as individuals."}, {"caa1": "The Right Questions in the Right Order"}, {"ae98": "Photo by GearedBull via Wikimedia Commons/License"}, {"b788": "Postmodernism — A theory that involves a radical reappraisal of modern assumptions about culture, identity, history, or language… [often characterized] by ironic self-reference and absurdity. (bits and pieces of the definition of “postmodern” in the Merriam-Webster dictionary)"}, {"08b0": "One big reason I think it’s become so hard to find the meaning of our lives in America (and everywhere, probably) is that our 21st Century postmodern consumer culture forbids us to ask three of the four essential questions above –which corrupts our ability to answer the fourth."}, {"9422": "If we see life as absurd, we’ll view all contexts as traps. We’ll judge religion oppressive or irrelevant and kick it to the curb. We’ll let society crash around us as we stare into screens in isolation, typing at each other across the Internet. We’ll follow pop culture and worship youth and celebrity, which rarely takes us anywhere near old age, let alone death. The main “human ideals” we’ll emulate are those of physical beauty, fame, wealth, and power."}, {"1411": "Pop-psychologists and personal development gurus urge us to live authentically, and to always be growing toward our best and truest selves… But what can it even mean to be a “best and true self” without context, urgency, or an understanding of the intellectual, emotional, or spiritual heights possible for human beings?"}, {"634b": "We have to know the context in which our lives are unfolding before we can rightly assess the relationship between our life and our death. Context also informs us what it means to be human, which allows the urgency of knowing we’re going to die to drive us to live authentically today."}, {"63d7": "-That’s the formula. It doesn’t work in reverse, and it doesn’t work if we leave out steps."}, {"080e": "Each of us can answer the question “What is the meaning of life?” But to do so, we need to step away from the ironic self-reference and assumed absurdity of postmodern consumer culture, and resolve to both ask and answer each of Professor Garfield’s four questions — fully, and in the right order."}, {"d965": "Don’t forget to click the heart! Thanks!"}, {"d755": "P.S. — This is the final lecture, and therefore the final essay, in this series, so I’d like to take a moment at the end here to highly recommend The Meaning of Life: Perspectives from the Great Intellectual Traditions. I’ve worked my way through half a dozen or so Great Courses lecture series so far, and this has been my favorite by quite a long shot. It explores how the question “What is the meaning of life?” has been answered by traditions from antiquity to right now, a grand scope of thought that includes Hinduism, Aristotle, Christianity, the Stoics, Epicurus, Confucius, Taoism, Indian Buddhism, Chinese Zen Buddhism, philosophers Hume, Kant, Mill, Tolstoy and Nietzsche, Mohandas Gandhi, Lakota Sioux medicine man Lame Deer, and the Dalai Lama. A fantastically broad spectrum of thought is covered. Professor Garfield is a talented teacher whose own bias, if he has any, never shows through in his lectures. He presents each topic with equal enthusiasm, and highlights the wisdom and value of every perspective discussed. These Great Courses programs are expensive when you order them through TheGreatCourses.com, but if you’re a member of Audible.com you can pick up The Meaning of Life: Perspectives from the Great Intellectual Traditions for just 1 credit, so that’s $14.95. Totally worth it. I’m not an affiliate of either seller, so I haven’t included links, and I don’t stand to make a dime off your purchase. This is just an honest, no strings attached recommendation."}, {"68a5": "Find more essays, poetry and fiction by Jack Preston King at:"}, {"3596": "beyondtherobotMy Journey from Robotic to Poetic Consciousness.beyondtherobot.com"}], "author": "Jack Preston King", "child": "1603_11603_11603_11603_1", "name": "1603", "content": "What Is the Meaning of Life? To Find Out, Answer These Four Questions Image via Pixabay.com This essay riffs off of lecture #36, “So, What Is the Meaning of Life?,” the final lecture in the Great Courses series The Meaning of Life: Perspectives from the World’s Great Intellectual Traditions, taught by Professor Jay L. Garfield. How to Think About the Meaning of Life “The Meaning of Life by Anna Vital” by Chris Lexow via Flickr/License If you had asked me “What is the meaning of life?” before I listened to this lecture series, I might have shrugged my shoulders and sung you a verse of Monty Python’s “The Galaxy Song.” I never thought of life’s ultimate meaning as a question that had an answer, or at least not one we limited human beings stood much chance of ever finding. In The Meaning of Life: Perspectives from the Great Intellectual Traditions, Professor Garfield acknowledges the stifling enormity of the question asked flat out like that, and pares it down to a more humanly manageable query. He asks, instead — as seen through the lens of the traditions being discussed in each lecture in the course, how can I, as an individual, lead a meaningful life? If I’m a Hindu, or a Buddhist, or a Christian, or a Stoic, or a Modern or Postmodern philosopher, how can I be sure that I’m not wasting my time on earth? What’s the goal of life? How do I best pursue that goal? How do I know when I’ve achieved it? As you might have guessed, there is no “one right answer.” Thinkers in varying times and cultures have reached different and sometimes contradictory conclusions. But in his final, wrap-up lecture in the series, Professor Garfield manages to tease out four overarching questions that all of the traditions discussed ask in their pursuit of life’s meaning. They may find different answers, but they mostly ask the same questions. In our 21st Century quest for the meaning of our own,individual lives, with many of us operating outside any one spiritual or philosophical tradition, knowing the right questions to ask can make all the difference. Question #1: CONTEXT Image via Pixabay.com One of the primary goals of all religions and philosophies is to help people understand their individual role within, and proper relationship to, that part of reality that is greater than themselves. For philosophers like Aristotle and Confucius, the greater reality that matters most is the social order, the Polis. We find our most significant life meaning in cultivating right relationships with each other, and playing our proper role within the societies we form. For theistic traditions like Judaism, Christianity, Islam, Hinduism and even Stoicism, which is rooted in Greek and Roman paganism, the greater reality is God or gods, from whom flow a rational order we have a place within and can understand and relate to. Non-theistic traditions like Buddhism, much European philosophy, and, of course, science, ask individuals to locate themselves within a physical universe of causal connections. In Buddhism, for example, everything existing — including us — is seen to be the effect of causes that came before, and to simultaneously be a cause of things to come. Nothing arises independently. Our right relationship to the greater reality is mostly one of understanding how it works and accepting our ephemeral role within it. Science, and philosophies rooted in the scientific worldview, largely agree. There are traditions that blend the contexts above, such as Taoism, which sees us embedded in the natural world, which is itself embedded in and permeated by the Tao — which is not understood to be any kind of personal god, like we see in the Abrahamic faiths. Pantheism, Wicca and many Native American traditions embrace our physical role in the natural world, while also experiencing Nature to be spiritually alive and sacred. The initial question we must ask and answer in our quest for the meaning of our individual lives is this: First, do we even understand ourselves to exist within a larger context? Do we have any sense that we take part in larger realities like the society we live in, the natural world, or a supernatural order? Or do we just live out of our own heads, our own needs and desires of the moment, our own egocentric daily experience? For our individual lives to have meaning beyond instinctive seeking of pleasure and avoidance of pain, the religious and philosophical traditions of the world largely concur that it’s necessary to locate ourselves within a larger context than personal ego. This is really the most important of the four questions. Don’t skip it. To continue this process, and find the meaning of life, we have to start by defining the grand context in which our individual lives unfold. There’s a world outside our heads and beyond the mirror. What’s that world like, and what’s our relationship to it? Second, then, what does the larger context we’ve defined tell us about how we should live? About what matters, what adds (or reveals) meaning, and what sorts of thoughts, feelings, actions, disciplines, etc. are proper to a human being? Seen in that context, how do our individual lives measure up? Are there things we need to change? Question #2: Time and Impermanence Photo by Lehigh Valley, PA via Flickr/License We’re all going to die. There, I said it. Now what are we going to do about it? If our answer is “refuse to think about it,” we may struggle to find meaning in our lives. Even religions that posit an afterlife in heaven, the Summerland, via reincarnation, etc., unanimously urge us to look at the time we have in this current life on earth as finite and immensely valuable. Stoics like Epictetus and Marcus Aurelius contemplated the truth that the universe was here for billions of years before we existed, and will go on for billions more after we’re gone. Our lives are ephemeral in the extreme, and should therefore rightly be precious to us. Keeping the brevity of life in the front of our minds adds urgency and meaning to all we do. Is this life all there is? If so, are we cherishing every irreplaceable moment? If we aren’t, what do we need to change in order to rightly value, and make the best use of, our limited time on earth? Is there an afterlife? If so, can we just coast to it? Are there things we need to be doing, and ways we should be living right now, in this life, to be ready for the transition of death, which could come at any moment? Will we reach the end having to explain why we spent six hours a day watching TV? Or treating other people badly? Or being selfish? Or refusing to help others? Are we investing our limited hours and days and years in the urgent pursuit of enlightenment? Or demonstrating compassion? Or practicing the Yogas of action, knowledge and devotion? Also, consider that everybody else is just as impermanent as we are. Are we taking the people in our lives for granted? Are we putting off loving and appreciating others as if we (and they) had all the time in the world? Do we treat non-human things like money, cars, houses, jobs, as if they had eternal significance? Are we making them more important than people? Than ourselves? Have we chained our lives to things that won’t last? Question #3: The Human Ideal Image by Hartwig HKD via Flickr/License In the larger context as we have chosen to define it, what does it mean to be human? What are we? What’s possible for us by virtue of our human birth? We’re not trees or bugs or housecats. We’re human beings. How is that special? How should we live in order to actualize our highest human potential? How will we know when we’ve achieved it? What would it mean to not pursue or achieve the human ideal? I’m thinking here of things like, in a religious context, sainthood, enlightenment, or better incarnations, or in a secular context, our greatest genius, our highest creative expression, our noblest love, etc. Question #4: Authenticity Image via Pixabay.com In Leo Tolstoy’s novel The Death of Ivan Ilych, the main character endures a prolonged and painful illness that ends in his death. Along the way, he comes to understand the upright, successful, ordinary life he led when he was well very differently in light of his impending death. Professor Garfield explains: He realizes that he has frittered his life away on the trivial, on the public sphere, instead of confronting the structure of his own existence. He questions whether life is that “senseless and horrible,” but of course, that’s the point: If we lead a life in which we pay little attention to the concrete reality of our existence and our mortality, a senseless and horrible life is what we’re left with. On the eve of his death, Ilych wonders whether his whole life might have been false; he asks, “But if that is so … and if I am leaving this life with the consciousness that I have lost all that was given to me and it is impossible to rectify it, what then?” Tolstoy’s point is that we may all be in exactly that position if we don’t move to lead more authentic, meaningful lives now. Are we leading lives we have chosen for ourselves? That allow us to flower as individuals, and leave our own unique mark on the world? Or do our days just happen to us, and we respond to events the way others expect of us and call it good? Do our lives awaken what’s special about us as individuals? Or do they anesthetize our authentic selves? The difference between Question #3: The Human Ideal and Question #4: Authenticity is that, with the Human Ideal, we’re asking what is possible for all human beings. With Authenticity, we’re asking what is uniquely possible for us, as individuals. The Right Questions in the Right Order Photo by GearedBull via Wikimedia Commons/License Postmodernism — A theory that involves a radical reappraisal of modern assumptions about culture, identity, history, or language… [often characterized] by ironic self-reference and absurdity. (bits and pieces of the definition of “postmodern” in the Merriam-Webster dictionary) One big reason I think it’s become so hard to find the meaning of our lives in America (and everywhere, probably) is that our 21st Century postmodern consumer culture forbids us to ask three of the four essential questions above –which corrupts our ability to answer the fourth. If we see life as absurd, we’ll view all contexts as traps. We’ll judge religion oppressive or irrelevant and kick it to the curb. We’ll let society crash around us as we stare into screens in isolation, typing at each other across the Internet. We’ll follow pop culture and worship youth and celebrity, which rarely takes us anywhere near old age, let alone death. The main “human ideals” we’ll emulate are those of physical beauty, fame, wealth, and power. Pop-psychologists and personal development gurus urge us to live authentically, and to always be growing toward our best and truest selves… But what can it even mean to be a “best and true self” without context, urgency, or an understanding of the intellectual, emotional, or spiritual heights possible for human beings? We have to know the context in which our lives are unfolding before we can rightly assess the relationship between our life and our death. Context also informs us what it means to be human, which allows the urgency of knowing we’re going to die to drive us to live authentically today. -That’s the formula. It doesn’t work in reverse, and it doesn’t work if we leave out steps. Each of us can answer the question “What is the meaning of life?” But to do so, we need to step away from the ironic self-reference and assumed absurdity of postmodern consumer culture, and resolve to both ask and answer each of Professor Garfield’s four questions — fully, and in the right order. Don’t forget to click the heart! Thanks! P.S. — This is the final lecture, and therefore the final essay, in this series, so I’d like to take a moment at the end here to highly recommend The Meaning of Life: Perspectives from the Great Intellectual Traditions. I’ve worked my way through half a dozen or so Great Courses lecture series so far, and this has been my favorite by quite a long shot. It explores how the question “What is the meaning of life?” has been answered by traditions from antiquity to right now, a grand scope of thought that includes Hinduism, Aristotle, Christianity, the Stoics, Epicurus, Confucius, Taoism, Indian Buddhism, Chinese Zen Buddhism, philosophers Hume, Kant, Mill, Tolstoy and Nietzsche, Mohandas Gandhi, Lakota Sioux medicine man Lame Deer, and the Dalai Lama. A fantastically broad spectrum of thought is covered. Professor Garfield is a talented teacher whose own bias, if he has any, never shows through in his lectures. He presents each topic with equal enthusiasm, and highlights the wisdom and value of every perspective discussed. These Great Courses programs are expensive when you order them through TheGreatCourses.com, but if you’re a member of Audible.com you can pick up The Meaning of Life: Perspectives from the Great Intellectual Traditions for just 1 credit, so that’s $14.95. Totally worth it. I’m not an affiliate of either seller, so I haven’t included links, and I don’t stand to make a dime off your purchase. This is just an honest, no strings attached recommendation. Find more essays, poetry and fiction by Jack Preston King at: beyondtherobotMy Journey from Robotic to Poetic Consciousness.beyondtherobot.com "}