{"parent": "", "timestamp": "Dec 2, 2016", "title": "San Francisco’s — Er, Santa Clara’s Billion-Dollar Blunder", "sentences": [{"1c6e": "San Francisco’s — Er, Santa Clara’s Billion-Dollar Blunder"}, {"6d2a": "It’s one thing to build an expensive stadium with taxpayer money. It’s another thing to build a stadium that no one likes."}, {"3df4": "Something unbelievable is happening in San Francisco — or more specifically, in Santa Clara, which is an hour away from San Francisco on a day when there’s no traffic, but there’s always traffic. The 49ers have proved themselves to be completely incompetent; the fans keep showing up. The team is now 1–10 with a 10-game losing streak filled with multi-touchdown embarrassments, and yet the 49ers are averaging 70,178 fans per game, more than the stadium’s official listed capacity. Despite a crap team and buzz that fans would counterprotest Colin Kaepernick, San Francisco is sixth in the league in attendance in relation to stadium size."}, {"4cda": "I say it’s unbelievable because I do not believe it. Pictures have shown the stadium half full. The resale market for personal seat licenses has plummeted, as some fans have been willing to take massive losses on their investment to avoid being forced to purchase an additional batch of season tickets in future years. Even the players have noticed: Two weeks ago after a game against the Patriots, Ahmad Brooks called the outsize number of road New England fans “a little disrespectful.”"}, {"1ef8": "While the stadium has sold out for every game and the Niners have the receipts to prove it, the attendance is clearly not full. People are happy to not attend Niners games they have already paid for because the team is bad. And the stadium is an hour away from San Francisco, when there’s no traffic, and there is always traffic."}, {"a6a9": "Tale of the Tape: Antonio Brown vs. Odell Beckham Jr.Who has the edge in the categories that matter most?theringer.com"}, {"be48": "On paper, Levi’s Stadium gave the 49ers a gleaming football palace capable of hosting the nation’s biggest sporting events, like last season’s Super Bowl and the 2019 college football national championship. It was supposed to be a place worthy of the many, many dollars the Bay Area and Silicon Valley have to spend. In reality, they spent $1.3 billion to build a stadium that a lot of people don’t like."}, {"4f3c": "In an ongoing series of drama, Levi’s latest concerns how the team has interacted with the civic government of Santa Clara. The city has authority over the stadium, and employs the 49ers to maintain it. In turn, the 49ers are supposed to provide documents to the city about how much money is being earned and spent at the stadium. The city says it hasn’t received these documents, and if it doesn’t get them within a month of the city’s November 22 request, it has threatened to seize the stadium from the 49ers. (49ers representatives have maintained that the team is giving the city regular reports that omit only confidential information regarding security plans and financial information related to non-NFL events.)"}, {"723e": "It’s a strange feud. Neil deMause, who covers the relationships between cities and their sports venues, points out that we don’t normally get fights like this over relatively young stadia and relatively small amounts of money. But from the moment Levi’s Stadium opened, people have had valid complaints."}, {"44b6": "A Letter to Third-and-LongA Texans fan pours his heart out to the down-and-distancetheringer.com"}, {"c602": "• The field is bad. The team had to replace the field before the first game and had to end an open practice early last August. It made Russell Wilson do this, and a sinkhole caused Ravens kicker Justin Tucker to badly shank a field goal during a game last season, when he was completely unable to plant his foot. Even on the day of the Super Bowl, the turf quality was a concern, although ultimately everything was fine. There haven’t been any notable problems with the turf this season, though, so, uh, congrats!"}, {"d3b4": "• The freakin’ sun is a problem. They didn’t think about the freakin’ sun. The stadium has a north-south alignment so TV cameras can avoid glare, which leaves about half the fans on the east side, where there is no built-in shade. At the very first preseason game, this proved to be a problem, leading to dozens of emergency calls and one death that may have been caused by heat. When Miami announced a canopy for its stadium, Niners fans poured in requests to do something similar at Levi’s. Instead, they got a “cool crew” that hands out sunscreen. Honestly, I’m surprised this isn’t a complaint at more stadiums — I’ve baked in the bleachers at baseball games, and, uh, not in the way A’s fans bake in the bleachers at Oakland–Alameda County Coliseum — but apparently it’s a bigger issue at Levi’s than most places."}, {"f6bb": "• Traffic and parking are bad at all stadiums, but the situation at Levi’s is impressively bad. Location is everything, and Levi’s is in a location that’s difficult to access and without ample room for the cars of all the people going to the game. And I know we’ve said it before, but it’s not close to San Francisco, the place the team hypothetically represents."}, {"9a69": "Week 13 NFL Picks: The AFC Still Belongs to the PatriotsThe Patriots lost their star tight end, but their AFC championship hopes remain very much alivetheringer.com"}, {"44a0": "• The stadium is pretty close to the San Jose airport, so it falls under the flight path of many incoming planes. The people who built the stadium didn’t consider this until after construction began. The FAA has to issue temporary flight restrictions during games, and even so, pilots have complained about the “blinding” lights from the stadium causing issues as they bring their planes in."}, {"5639": "• It’s expensive as hell. I’m not sure anything could’ve been done about this: All stadium food is expensive, and everything is more expensive in the Bay Area and Silicon Valley. But even in comparison to other teams’ ridiculous prices, it’s bad. The 49ers had the highest cost of attendance in 2014, and although they’re now fourth, they still boast the highest beer price in the league ($10 for 16 ounces, making each ounce worth 36 ounces of Busch Light in a $16 30-rack). And that’s not including the price of the personal seat licenses, which fans had to buy in order to then buy season tickets."}, {"375f": "• There have been two really bad cases of fan violence in the stadium. This is more of an issue with football fans in general, but it doesn’t speak well of stadium security, either."}, {"6dc3": "• And of course, the team began struggling as soon as the stadium was built. At the end of the 2012 season, the Niners were a few points away from winning the Super Bowl, and they followed that up with a 12–4 season in their last year at Candlestick. Then they went 8–8, hired a mustachioed handyman who went 5–11, and things have been even worse under Chip Kelly. If the trend continues, they will go negative-2 and 18 next year while coached by a guy who works at a local auto body shop during the week. Does this have anything to do with the stadium? No, but it’s a fun coincidence."}, {"a419": "Now, most of these issues are not unique to Santa Clara. Many stadiums have bad traffic, many stadiums are expensive, and many teams grapple with how to best ensure fan safety. But few teams consistently disrupt local airport operations or struggle to keep their field safe, and it’s concerning how it took almost no time for all these issues to bubble up."}, {"bcc5": "We know how expensive stadiums are and how they typically screw over taxpayers. But Santa Clara got what many thought was a pretty good deal for its taxpayers, and there are still plenty of problems. When you spend a billion dollars on a stadium, and it’s bad, you don’t really have an out. There have been a lot of problems in the stadium’s first three years — and the 49ers’ lease goes for another 37."}, {"95ca": "Perhaps the biggest issue with the stadium, though, is one that can’t be quantified. People just don’t like the damn stadium. It’s corporate, and fandom isn’t. Maybe the team will spend enough money to fix all the stadium’s logistical issues over the next three-plus decades. But it’s harder to fix a feeling, and there’s no telling whether fans will ever feel at home in the billion-dollar blunder."}], "author": "Rodger Sherman", "child": "1644_1\t1644_2\t1644_3\t1644_4\t1644_5\t1644_6\t1644_7\t1644_8\t1644_9\t1644_10\t1644_11\t1644_12\t1644_13\t1644_14\t1644_15\t1644_16\t1644_17\t1644_18\t1644_19\t1644_20\t1644_21\t1644_22\t1644_23\t1644_24\t1644_25", "name": "1644", "content": "San Francisco’s — Er, Santa Clara’s Billion-Dollar Blunder It’s one thing to build an expensive stadium with taxpayer money. It’s another thing to build a stadium that no one likes. Something unbelievable is happening in San Francisco — or more specifically, in Santa Clara, which is an hour away from San Francisco on a day when there’s no traffic, but there’s always traffic. The 49ers have proved themselves to be completely incompetent; the fans keep showing up. The team is now 1–10 with a 10-game losing streak filled with multi-touchdown embarrassments, and yet the 49ers are averaging 70,178 fans per game, more than the stadium’s official listed capacity. Despite a crap team and buzz that fans would counterprotest Colin Kaepernick, San Francisco is sixth in the league in attendance in relation to stadium size. I say it’s unbelievable because I do not believe it. Pictures have shown the stadium half full. The resale market for personal seat licenses has plummeted, as some fans have been willing to take massive losses on their investment to avoid being forced to purchase an additional batch of season tickets in future years. Even the players have noticed: Two weeks ago after a game against the Patriots, Ahmad Brooks called the outsize number of road New England fans “a little disrespectful.” While the stadium has sold out for every game and the Niners have the receipts to prove it, the attendance is clearly not full. People are happy to not attend Niners games they have already paid for because the team is bad. And the stadium is an hour away from San Francisco, when there’s no traffic, and there is always traffic. Tale of the Tape: Antonio Brown vs. Odell Beckham Jr.Who has the edge in the categories that matter most?theringer.com On paper, Levi’s Stadium gave the 49ers a gleaming football palace capable of hosting the nation’s biggest sporting events, like last season’s Super Bowl and the 2019 college football national championship. It was supposed to be a place worthy of the many, many dollars the Bay Area and Silicon Valley have to spend. In reality, they spent $1.3 billion to build a stadium that a lot of people don’t like. In an ongoing series of drama, Levi’s latest concerns how the team has interacted with the civic government of Santa Clara. The city has authority over the stadium, and employs the 49ers to maintain it. In turn, the 49ers are supposed to provide documents to the city about how much money is being earned and spent at the stadium. The city says it hasn’t received these documents, and if it doesn’t get them within a month of the city’s November 22 request, it has threatened to seize the stadium from the 49ers. (49ers representatives have maintained that the team is giving the city regular reports that omit only confidential information regarding security plans and financial information related to non-NFL events.) It’s a strange feud. Neil deMause, who covers the relationships between cities and their sports venues, points out that we don’t normally get fights like this over relatively young stadia and relatively small amounts of money. But from the moment Levi’s Stadium opened, people have had valid complaints. A Letter to Third-and-LongA Texans fan pours his heart out to the down-and-distancetheringer.com • The field is bad. The team had to replace the field before the first game and had to end an open practice early last August. It made Russell Wilson do this, and a sinkhole caused Ravens kicker Justin Tucker to badly shank a field goal during a game last season, when he was completely unable to plant his foot. Even on the day of the Super Bowl, the turf quality was a concern, although ultimately everything was fine. There haven’t been any notable problems with the turf this season, though, so, uh, congrats! • The freakin’ sun is a problem. They didn’t think about the freakin’ sun. The stadium has a north-south alignment so TV cameras can avoid glare, which leaves about half the fans on the east side, where there is no built-in shade. At the very first preseason game, this proved to be a problem, leading to dozens of emergency calls and one death that may have been caused by heat. When Miami announced a canopy for its stadium, Niners fans poured in requests to do something similar at Levi’s. Instead, they got a “cool crew” that hands out sunscreen. Honestly, I’m surprised this isn’t a complaint at more stadiums — I’ve baked in the bleachers at baseball games, and, uh, not in the way A’s fans bake in the bleachers at Oakland–Alameda County Coliseum — but apparently it’s a bigger issue at Levi’s than most places. • Traffic and parking are bad at all stadiums, but the situation at Levi’s is impressively bad. Location is everything, and Levi’s is in a location that’s difficult to access and without ample room for the cars of all the people going to the game. And I know we’ve said it before, but it’s not close to San Francisco, the place the team hypothetically represents. Week 13 NFL Picks: The AFC Still Belongs to the PatriotsThe Patriots lost their star tight end, but their AFC championship hopes remain very much alivetheringer.com • The stadium is pretty close to the San Jose airport, so it falls under the flight path of many incoming planes. The people who built the stadium didn’t consider this until after construction began. The FAA has to issue temporary flight restrictions during games, and even so, pilots have complained about the “blinding” lights from the stadium causing issues as they bring their planes in. • It’s expensive as hell. I’m not sure anything could’ve been done about this: All stadium food is expensive, and everything is more expensive in the Bay Area and Silicon Valley. But even in comparison to other teams’ ridiculous prices, it’s bad. The 49ers had the highest cost of attendance in 2014, and although they’re now fourth, they still boast the highest beer price in the league ($10 for 16 ounces, making each ounce worth 36 ounces of Busch Light in a $16 30-rack). And that’s not including the price of the personal seat licenses, which fans had to buy in order to then buy season tickets. • There have been two really bad cases of fan violence in the stadium. This is more of an issue with football fans in general, but it doesn’t speak well of stadium security, either. • And of course, the team began struggling as soon as the stadium was built. At the end of the 2012 season, the Niners were a few points away from winning the Super Bowl, and they followed that up with a 12–4 season in their last year at Candlestick. Then they went 8–8, hired a mustachioed handyman who went 5–11, and things have been even worse under Chip Kelly. If the trend continues, they will go negative-2 and 18 next year while coached by a guy who works at a local auto body shop during the week. Does this have anything to do with the stadium? No, but it’s a fun coincidence. Now, most of these issues are not unique to Santa Clara. Many stadiums have bad traffic, many stadiums are expensive, and many teams grapple with how to best ensure fan safety. But few teams consistently disrupt local airport operations or struggle to keep their field safe, and it’s concerning how it took almost no time for all these issues to bubble up. We know how expensive stadiums are and how they typically screw over taxpayers. But Santa Clara got what many thought was a pretty good deal for its taxpayers, and there are still plenty of problems. When you spend a billion dollars on a stadium, and it’s bad, you don’t really have an out. There have been a lot of problems in the stadium’s first three years — and the 49ers’ lease goes for another 37. Perhaps the biggest issue with the stadium, though, is one that can’t be quantified. People just don’t like the damn stadium. It’s corporate, and fandom isn’t. Maybe the team will spend enough money to fix all the stadium’s logistical issues over the next three-plus decades. But it’s harder to fix a feeling, and there’s no telling whether fans will ever feel at home in the billion-dollar blunder. "}