{"parent": "", "timestamp": "Sep 6, 2016", "title": "One woman’s quest to end the sexual assault epidemic in college football", "sentences": [{"81a3": "One woman’s quest to end the sexual assault epidemic in college football"}, {"1732": "College football season is underway, and amidst the excitement and upsets, tailgating and bowl predictions, lies a much more serious issue: the prevalence of sexual assault in the sport."}, {"0d0d": "In recent years, there have been high-profile sexual assault cases at Florida State, Baylor, Vanderbilt, and Tennessee. Just one week into this season, a linebacker from the University of Southern California (USC) is already under investigation for two separate rapes."}, {"8039": "Journalist Jessica Luther explores the deep connection between college football and sexual assault in her new book, Unsportsmanlike Conduct: College Football and the Politics of Rape."}, {"ecec": "While it’s often easier for journalists and fans alike to ignore the issue completely, Luther addresses this topic head on, laying out one playbook for better understanding the problems at hand, and a separate playbook for fixing them. The result is a harrowing, detailed account of the ways our national pastime is intertwined with violence against women, and a somewhat hopeful look at how that connection might be disrupted."}, {"399e": "Jessica Luther CREDIT: JANELLE RENEE"}, {"89da": "It helps that Luther approaches the work from the perspective of a fan. She grew up rooting for Florida State and attended the university herself. But when FSU quarterback Jameis Winston was accused of raping a fellow student in 2013, Luther watched in horror as the the system failed everyone involved in the case time and time again, and Winston was able to keep playing through it all, ultimately winning the national championship and going on to become the top pick in the 2015 NFL draft."}, {"69ef": "Luther began reporting on the topic right around the time reports about the accusations against Winston initially surfaced. Last year, she and Dan Solomon broke the news of Baylor University’s systemic mishandling of sexual assault allegations against football players. This May, after a thorough investigation by the law firm Pepper Hamilton, Baylor’s head coach Art Briles was fired."}, {"092e": "In the interest of full disclosure, Luther is a friend of mine. To celebrate the launch of her book, she joined me for a conversation on racism, privilege, accountability, second chances, Dirk Koetter, transparency, and disrupting the system."}, {"51b2": "You structure your book like a playbook, but I thought one of the most important chapters was, ‘What the Playbook Doesn’t Show.’ In just your the second chapter, you take a step back and look at some of the broader social implications of this work."}, {"61f3": "Primarily, you address how easy it is for our society to cling onto the narratives that black men are criminals and women are lying. You also directly address our nation’s history of lynching black men for allegedly raping white women. Why was it important for you to discuss these topics, particularly so early on in the book?"}, {"9310": "I’ve been writing about this subject for three and a half years, and there was a point that I realized that part of what I was doing was writing about black men as criminals, or as violent people. I almost got my PhD in history, and I was writing about slavery, racialized bodies, and racism before I ever wrote about college football and sexual assault."}, {"24e3": "I feel like I did a disservice if I didn’t address it directly. It’s a critique of my own work within my work, and I’m very aware of that, but it’s also the reality of talking about this. I tried very hard in the book to push people away from individualizing the problem, and the narrative of black men as criminals in particular. So I just felt I needed to say that out loud explicitly in order to move the reader to where I want them to go, which is to the white men who control everything and don’t seem to care about this problem."}, {"8374": "“You have to draw the curtain back to reveal that these players only have the privilege of the system as long as they’re healthy and they can play.”"}, {"67af": "So often people seem to forget that privilege is intersectional. The privilege being an elite, male athlete is significant, but that doesn’t mean that black elite, male athletes don’t still suffer consequences of racism."}, {"7d44": "Right, and in college ball especially, these men are being used as much as anyone else in the system. I think that’s really important piece to all of this. They’re in a system that protects them and there are people who protect them when something happens, but not because they care about that person as a human being, but because they care about them being able to play football so the money-making machine can keep churning. You have to draw the curtain back to reveal that these players only have the privilege of the system as long as they’re healthy and they can play."}, {"af43": "That’s so evident when you see the punishments that coaches and schools hand out, which often are more about getting the players back on the field as soon as possible, rather than creating a system of accountability or growth. If you really cared about the person as a human being, you’d want to truly teach them a lesson and make them better. That’s a part of love, but that’s absent here."}, {"5b30": "Yeah, you get the coach speak of the ‘second chances,’ but one of the things that makes it so hard to tackle this issue is that we just don’t even know what they’re doing for these men outside of making them football players."}, {"9747": "I write this a little bit in the book, but when something happens, and people are asking coaches and athletic directors [ADs], ‘What are you doing to address this issue?’ It’s always, ‘We’re giving them a talk about respecting women.’ But it’s like, what is that? What is being said? How consistent is it?"}, {"b1d1": "I agree with you — I want these guys to learn and be better people in the world, and we should care about what we’re teaching boys. But, unfortunately, there’s no transparency."}, {"7639": "“This idea that the coach is going to fix things, that they even have the ability to change this culture that they all came up in, is ridiculous.”"}, {"fd38": "I was horrified when I read in the book that after ignoring multiple allegations of sexual assault or domestic violence committed by its football players over the years, Missouri’s answer is to have its cornerback coach address rape with the players every year."}, {"3682": "Yeah, because he cares about this. Which is great, I’m glad he cares, but what does that even mean? And literally, he addresses it in a 10–12 minute after-practice chat where he talks about not being mean to women."}, {"afde": "This idea that the coach is going to fix things, that they even have the ability to change this culture that they all came up in, is ridiculous. But we’re so willing to think that these coaches are these good guys."}, {"4a0b": "Molders of men!"}, {"cfec": "They’re just dudes. Dudes who grew up in locker room culture."}, {"9323": "And benefited from it more, more than anyone, really."}, {"fc68": "Financially, absolutely."}, {"e121": "So what motivation do they have to actually change it?"}, {"fffc": "I’m well aware that overall, most of these guys will never do these things, but there’s something going on in this culture. We know that football is hyper masculine, that they treat women as an inferior, whether it’s through language — don’t be a pussy, don’t be a bitch — or by using women as recruiting tools."}, {"6e0e": "We know women aren’t involved in college football. They don’t exist in these spaces. And somehow, we think these coaches are going to change things. It doesn’t make any sense."}, {"0332": "“People think I hate football, that I walk around trying to destroy teams. But that’s not it at all. I like it. I want it to be better.”"}, {"9c83": "You mentioned this earlier, but a common theme throughout your book is second chances. I know this is something I struggle with. Every time I write about an allegations of violence against women by an athlete, past or present, I’m confronted with all of these fans saying that I just want this player’s life to be ruined. Of course, that’s not true."}, {"807a": "I want to believe in second chances, but often these second chances are being given without any acknowledgement that there was something done wrong in the first place. It’s one thing if someone really learns from the crimes they committed and puts in the work in therapy and rehab to get better, but most of the these second chances are handed out just because a coach thinks the player is a ‘good guy.’"}, {"402f": "I don’t want someone’s life to be ruined, either, but I do think people have to answer for the things that they’ve done. I get so frustrated. People think I hate football, that I walk around trying to destroy teams. But that’s not it at all. I like it. I want it to be better."}, {"1174": "And that’s how I feel: Why don’t you want this guy to be a better guy? Why don’t you want to make sure that man is not going to harm someone else, because he’s been taught to dehumanize women, because he doesn’t understand women, because he’s been taught there’s no accountability."}, {"9609": "The thing is, Art Briles was eventually held accountable by Baylor, which is wild. But the problem is the system won’t hold him accountable. People can do their own work, read the Pepper Hamilton report, read what women have said, read his recent comments that he did anything ‘unethical.’ However, we do know that within this system, he is too good not to get another job. Maybe he won’t get as good of a job, maybe it won’t be a national championship caliber team right away. But the system is going to allow him to come right back in, without accountability."}, {"1b68": "It’s great that Baylor had a sense of accountability. I think it was a big deal. But I understand people’s frustration at the system itself that will allow the second chance to come without ever asking what has changed. That’s the sticking point for me. What matters about what Baylor did if the system is just going to wrap him up and protect him?"}, {"4b43": "CREDIT: AKASHIC"}, {"58e6": "Yeah, and obviously it’s not just Briles. So often, it seems that the people who are either accused of committing violence against women or accused of overseeing the systems that enable it just fall upwards."}, {"ea31": "I mean, one of the craziest examples of that is Dirk Koetter, who is now the head coach the Tampa Bay Buccaneers, where Jameis Winston is the starting quarterback. Somehow, until I read your book I had no idea that Koetter was the head coach of Arizona State when the school reportedly mishandled allegations of sexual violence by football players. And the details of that mishandling are very damning. Koetter allegedly covered up complaints completely and actively pleaded with administrators for accused assaulters to be allowed back onto the team."}, {"d0ff": "And these ‘second chances’ that Koetter handed out had severe consequences. One of the players that Koetter decided to counsel ‘personally’ instead of reporting to police was Loren Wade, who ended up shooting and killing another former player on campus."}, {"a50d": "I remember the night I figured that out, that I put all those pieces together, I was freaking out. His story in particular is really shocking. But most people don’t care. They’re like, ‘that was so long ago.’ But when you read about what happened in that program, it’s like, ‘how does this happen?’"}, {"c639": "“I mean, he really had no reason to learn anything. The system left him off the hook.”"}, {"4905": "It’s just crazy that Koetter is now Winston’s head coach and mentor. I don’t know exactly what that means, but it feels wrong."}, {"5bbe": "Yeah, it’s hard to know what to take away from that, except that it’s so endemic of the system. Recently I was listening to The Trifecta, and [espnW reporter] Jane McManus was talking the incredibly sexist and demeaning Texas A&M women’s football clinic. And McManus said that one of the coaches who was teaching the clinic [Jim Turner] was one of the assistant coaches fired by the Miami Dolphins for involvement in the Richie Incognito harassment scandal a few years ago."}, {"85ff": "Of course you can be part of fostering this terrible locker room culture in Miami and yet you can go off and get a job as an assistant coach at one of the top programs in the nation. He clearly learned nothing in Miami, which is so concerning. And Koetter in his job at Arizona State, did he learn anything? I mean, he really had no reason to learn anything. The system left him off the hook."}, {"f13b": "There is all this rhetoric about how things have improved since Ray Rice, how much better the media and teams and universities and leagues are at dealing with accusations of sexual assault and domestic violence now. I’m guilty of relying on that narrative too. But reading your book, it was horrifying how many players or coaches who were accused of heinous things in college are now in the NFL, such as Dorial Green-Beckham and even Prince Shembo, the Notre Dame player that Lizzy Seeburg accused of sexual assault before she committed suicide back in 2010."}, {"ede1": "Shembo just got in trouble for killing his girlfriend’s dog! And the NFL did not treat the abuse of the dog as domestic violence, which is just unbelievable to me. You can google the relationship between the abuse of animals and domestic violence."}, {"1554": "[Ed note: Shembo killed his former girlfriend’s dog in 2015 and was subsequently waived from the Atlanta Falcons. The NFL announced that he was suspended for two games in the spring, and his appeal was denied last month. Shembo is not currently with a NFL team, though he is actively pursuing another chance. He recently told ESPN, “I thank Jesus Christ for what I went through because it truly opened my eyes. I was able to grow.”]"}, {"cdd1": "I don’t even know what to say. It makes me really frustrated, because we’re all saying we’re making progress, but look at where we are."}, {"c9b1": "I mean, any system built around punishment is always going to be bad, and it’s always going to feel unfair, which is why it’s so important to address the root cause."}, {"dd4a": "“I mean, any system built around punishment is always going to be bad, and it’s always going to feel unfair, which is why it’s so important to address the root cause.”"}, {"10af": "In your book, you lay out some very clear ways to tackle this and move forward. And you do a great job of addressing it from all different angles — teams, coaches, media, NCAA, we all have to have accountability. But the problem is, everyone is passing the buck. The media takes the cues from the coaches who take the cues from the NCAA which takes the cues from the media. So few people are stepping up and saying, ‘hey, this is really hard but we can at least do something.’ Which is why my favorite chapter title of yours is, ‘Do Anything.’"}, {"6052": "Right, which is why when Baylor did something it felt so huge — they did a thing! The ripples of that, who knows, it might be nothing outside of Waco. But I often feel that way. Anyone, do something. Which is why I do this work even though it’s exhausting, because someone has to disrupt. I’m not popular for it all the time, but I’ll do it, I’ll be that person who yells at my colleagues in the media about how they talk about this stuff."}, {"9cdf": "Do anything, yes. Someone do something. We just need more disruption within the system. Baylor was a disruption. It was something and I hold onto those moments really hard."}, {"4d23": "This interview has been edited for length and clarity."}], "author": "Lindsay Gibbs", "child": "1650_1\t1650_2", "name": "1650", "content": "One woman’s quest to end the sexual assault epidemic in college football College football season is underway, and amidst the excitement and upsets, tailgating and bowl predictions, lies a much more serious issue: the prevalence of sexual assault in the sport. In recent years, there have been high-profile sexual assault cases at Florida State, Baylor, Vanderbilt, and Tennessee. Just one week into this season, a linebacker from the University of Southern California (USC) is already under investigation for two separate rapes. Journalist Jessica Luther explores the deep connection between college football and sexual assault in her new book, Unsportsmanlike Conduct: College Football and the Politics of Rape. While it’s often easier for journalists and fans alike to ignore the issue completely, Luther addresses this topic head on, laying out one playbook for better understanding the problems at hand, and a separate playbook for fixing them. The result is a harrowing, detailed account of the ways our national pastime is intertwined with violence against women, and a somewhat hopeful look at how that connection might be disrupted. Jessica Luther CREDIT: JANELLE RENEE It helps that Luther approaches the work from the perspective of a fan. She grew up rooting for Florida State and attended the university herself. But when FSU quarterback Jameis Winston was accused of raping a fellow student in 2013, Luther watched in horror as the the system failed everyone involved in the case time and time again, and Winston was able to keep playing through it all, ultimately winning the national championship and going on to become the top pick in the 2015 NFL draft. Luther began reporting on the topic right around the time reports about the accusations against Winston initially surfaced. Last year, she and Dan Solomon broke the news of Baylor University’s systemic mishandling of sexual assault allegations against football players. This May, after a thorough investigation by the law firm Pepper Hamilton, Baylor’s head coach Art Briles was fired. In the interest of full disclosure, Luther is a friend of mine. To celebrate the launch of her book, she joined me for a conversation on racism, privilege, accountability, second chances, Dirk Koetter, transparency, and disrupting the system. You structure your book like a playbook, but I thought one of the most important chapters was, ‘What the Playbook Doesn’t Show.’ In just your the second chapter, you take a step back and look at some of the broader social implications of this work. Primarily, you address how easy it is for our society to cling onto the narratives that black men are criminals and women are lying. You also directly address our nation’s history of lynching black men for allegedly raping white women. Why was it important for you to discuss these topics, particularly so early on in the book? I’ve been writing about this subject for three and a half years, and there was a point that I realized that part of what I was doing was writing about black men as criminals, or as violent people. I almost got my PhD in history, and I was writing about slavery, racialized bodies, and racism before I ever wrote about college football and sexual assault. I feel like I did a disservice if I didn’t address it directly. It’s a critique of my own work within my work, and I’m very aware of that, but it’s also the reality of talking about this. I tried very hard in the book to push people away from individualizing the problem, and the narrative of black men as criminals in particular. So I just felt I needed to say that out loud explicitly in order to move the reader to where I want them to go, which is to the white men who control everything and don’t seem to care about this problem. “You have to draw the curtain back to reveal that these players only have the privilege of the system as long as they’re healthy and they can play.” So often people seem to forget that privilege is intersectional. The privilege being an elite, male athlete is significant, but that doesn’t mean that black elite, male athletes don’t still suffer consequences of racism. Right, and in college ball especially, these men are being used as much as anyone else in the system. I think that’s really important piece to all of this. They’re in a system that protects them and there are people who protect them when something happens, but not because they care about that person as a human being, but because they care about them being able to play football so the money-making machine can keep churning. You have to draw the curtain back to reveal that these players only have the privilege of the system as long as they’re healthy and they can play. That’s so evident when you see the punishments that coaches and schools hand out, which often are more about getting the players back on the field as soon as possible, rather than creating a system of accountability or growth. If you really cared about the person as a human being, you’d want to truly teach them a lesson and make them better. That’s a part of love, but that’s absent here. Yeah, you get the coach speak of the ‘second chances,’ but one of the things that makes it so hard to tackle this issue is that we just don’t even know what they’re doing for these men outside of making them football players. I write this a little bit in the book, but when something happens, and people are asking coaches and athletic directors [ADs], ‘What are you doing to address this issue?’ It’s always, ‘We’re giving them a talk about respecting women.’ But it’s like, what is that? What is being said? How consistent is it? I agree with you — I want these guys to learn and be better people in the world, and we should care about what we’re teaching boys. But, unfortunately, there’s no transparency. “This idea that the coach is going to fix things, that they even have the ability to change this culture that they all came up in, is ridiculous.” I was horrified when I read in the book that after ignoring multiple allegations of sexual assault or domestic violence committed by its football players over the years, Missouri’s answer is to have its cornerback coach address rape with the players every year. Yeah, because he cares about this. Which is great, I’m glad he cares, but what does that even mean? And literally, he addresses it in a 10–12 minute after-practice chat where he talks about not being mean to women. This idea that the coach is going to fix things, that they even have the ability to change this culture that they all came up in, is ridiculous. But we’re so willing to think that these coaches are these good guys. Molders of men! They’re just dudes. Dudes who grew up in locker room culture. And benefited from it more, more than anyone, really. Financially, absolutely. So what motivation do they have to actually change it? I’m well aware that overall, most of these guys will never do these things, but there’s something going on in this culture. We know that football is hyper masculine, that they treat women as an inferior, whether it’s through language — don’t be a pussy, don’t be a bitch — or by using women as recruiting tools. We know women aren’t involved in college football. They don’t exist in these spaces. And somehow, we think these coaches are going to change things. It doesn’t make any sense. “People think I hate football, that I walk around trying to destroy teams. But that’s not it at all. I like it. I want it to be better.” You mentioned this earlier, but a common theme throughout your book is second chances. I know this is something I struggle with. Every time I write about an allegations of violence against women by an athlete, past or present, I’m confronted with all of these fans saying that I just want this player’s life to be ruined. Of course, that’s not true. I want to believe in second chances, but often these second chances are being given without any acknowledgement that there was something done wrong in the first place. It’s one thing if someone really learns from the crimes they committed and puts in the work in therapy and rehab to get better, but most of the these second chances are handed out just because a coach thinks the player is a ‘good guy.’ I don’t want someone’s life to be ruined, either, but I do think people have to answer for the things that they’ve done. I get so frustrated. People think I hate football, that I walk around trying to destroy teams. But that’s not it at all. I like it. I want it to be better. And that’s how I feel: Why don’t you want this guy to be a better guy? Why don’t you want to make sure that man is not going to harm someone else, because he’s been taught to dehumanize women, because he doesn’t understand women, because he’s been taught there’s no accountability. The thing is, Art Briles was eventually held accountable by Baylor, which is wild. But the problem is the system won’t hold him accountable. People can do their own work, read the Pepper Hamilton report, read what women have said, read his recent comments that he did anything ‘unethical.’ However, we do know that within this system, he is too good not to get another job. Maybe he won’t get as good of a job, maybe it won’t be a national championship caliber team right away. But the system is going to allow him to come right back in, without accountability. It’s great that Baylor had a sense of accountability. I think it was a big deal. But I understand people’s frustration at the system itself that will allow the second chance to come without ever asking what has changed. That’s the sticking point for me. What matters about what Baylor did if the system is just going to wrap him up and protect him? CREDIT: AKASHIC Yeah, and obviously it’s not just Briles. So often, it seems that the people who are either accused of committing violence against women or accused of overseeing the systems that enable it just fall upwards. I mean, one of the craziest examples of that is Dirk Koetter, who is now the head coach the Tampa Bay Buccaneers, where Jameis Winston is the starting quarterback. Somehow, until I read your book I had no idea that Koetter was the head coach of Arizona State when the school reportedly mishandled allegations of sexual violence by football players. And the details of that mishandling are very damning. Koetter allegedly covered up complaints completely and actively pleaded with administrators for accused assaulters to be allowed back onto the team. And these ‘second chances’ that Koetter handed out had severe consequences. One of the players that Koetter decided to counsel ‘personally’ instead of reporting to police was Loren Wade, who ended up shooting and killing another former player on campus. I remember the night I figured that out, that I put all those pieces together, I was freaking out. His story in particular is really shocking. But most people don’t care. They’re like, ‘that was so long ago.’ But when you read about what happened in that program, it’s like, ‘how does this happen?’ “I mean, he really had no reason to learn anything. The system left him off the hook.” It’s just crazy that Koetter is now Winston’s head coach and mentor. I don’t know exactly what that means, but it feels wrong. Yeah, it’s hard to know what to take away from that, except that it’s so endemic of the system. Recently I was listening to The Trifecta, and [espnW reporter] Jane McManus was talking the incredibly sexist and demeaning Texas A&M women’s football clinic. And McManus said that one of the coaches who was teaching the clinic [Jim Turner] was one of the assistant coaches fired by the Miami Dolphins for involvement in the Richie Incognito harassment scandal a few years ago. Of course you can be part of fostering this terrible locker room culture in Miami and yet you can go off and get a job as an assistant coach at one of the top programs in the nation. He clearly learned nothing in Miami, which is so concerning. And Koetter in his job at Arizona State, did he learn anything? I mean, he really had no reason to learn anything. The system left him off the hook. There is all this rhetoric about how things have improved since Ray Rice, how much better the media and teams and universities and leagues are at dealing with accusations of sexual assault and domestic violence now. I’m guilty of relying on that narrative too. But reading your book, it was horrifying how many players or coaches who were accused of heinous things in college are now in the NFL, such as Dorial Green-Beckham and even Prince Shembo, the Notre Dame player that Lizzy Seeburg accused of sexual assault before she committed suicide back in 2010. Shembo just got in trouble for killing his girlfriend’s dog! And the NFL did not treat the abuse of the dog as domestic violence, which is just unbelievable to me. You can google the relationship between the abuse of animals and domestic violence. [Ed note: Shembo killed his former girlfriend’s dog in 2015 and was subsequently waived from the Atlanta Falcons. The NFL announced that he was suspended for two games in the spring, and his appeal was denied last month. Shembo is not currently with a NFL team, though he is actively pursuing another chance. He recently told ESPN, “I thank Jesus Christ for what I went through because it truly opened my eyes. I was able to grow.”] I don’t even know what to say. It makes me really frustrated, because we’re all saying we’re making progress, but look at where we are. I mean, any system built around punishment is always going to be bad, and it’s always going to feel unfair, which is why it’s so important to address the root cause. “I mean, any system built around punishment is always going to be bad, and it’s always going to feel unfair, which is why it’s so important to address the root cause.” In your book, you lay out some very clear ways to tackle this and move forward. And you do a great job of addressing it from all different angles — teams, coaches, media, NCAA, we all have to have accountability. But the problem is, everyone is passing the buck. The media takes the cues from the coaches who take the cues from the NCAA which takes the cues from the media. So few people are stepping up and saying, ‘hey, this is really hard but we can at least do something.’ Which is why my favorite chapter title of yours is, ‘Do Anything.’ Right, which is why when Baylor did something it felt so huge — they did a thing! The ripples of that, who knows, it might be nothing outside of Waco. But I often feel that way. Anyone, do something. Which is why I do this work even though it’s exhausting, because someone has to disrupt. I’m not popular for it all the time, but I’ll do it, I’ll be that person who yells at my colleagues in the media about how they talk about this stuff. Do anything, yes. Someone do something. We just need more disruption within the system. Baylor was a disruption. It was something and I hold onto those moments really hard. This interview has been edited for length and clarity. "}