{"parent": "", "timestamp": "Sep 15, 2016", "title": "A Scientific Examination of Alabama–Ole Miss", "sentences": [{"a276": "A Scientific Examination of Alabama–Ole Miss"}, {"0b8e": "Can the Rebels pull off another miraculous upset of the Crimson Tide?"}, {"3c21": "AP Images/Ringer illustration"}, {"775a": "“We can do science,” Carl Sagan wrote in Cosmos, “and with it we can improve our lives.”"}, {"85d6": "So let us do science*, and by so doing improve our lives. The hypothesis we’ll be looking at today is “Ole Miss can beat Alabama for the third year in a row.”"}, {"917a": "We’ll test this hypothesis with a relatively straightforward procedure: Compare and contrast the relative strengths and weaknesses of the two participants in Saturday afternoon’s game in Oxford, Mississippi."}, {"61f4": "Alabama is ranked no. 1 in the country, while Mississippi is ranked no. 19. (Edge: Alabama.) The Crimson Tide are no. 1 in Football Outsiders’ S&P+, while the Rebels are no. 8. (Edge: Alabama.) Ole Miss is no. 3 in FO’s Offensive S&P+, while Alabama is no. 12. (Edge: Ole Miss.) But Alabama is no. 2 in Defensive S&P+, while Ole Miss is no. 62. (Edge: Alabama.)"}, {"9736": "Alabama’s offense is led by a quarterback named Jalen Hurts, while Ole Miss’s offense is led by a quarterback named Chad Kelly. (Edge: Alabama … and really, all headline writers in America.) Hurts has thrown one interception so far, while Kelly already has three. (Edge: Alabama.) But Kelly leads the SEC in total QBR, while Hurts is 10th. (Edge: Ole Miss.)"}, {"983a": "Alabama won its first game by 46 points (over then-no. 20 USC) but its second game by just 28 more, prompting “ass-chewings” on the sideline from coach Nick Saban. Ole Miss lost its first game by 11 points (to then-no. 4 Florida State) and won its second by 25, prompting no known “ass-chewings” from coach Hugh Freeze. (Edge: Alabama if you’re pro-ass-chewing, Ole Miss if you’re anti-ass-chewing.)"}, {"b0d8": "It’s early yet, but Alabama is having a better 2016 season. The Crimson Tide trailed USC for much of the first half, but opened the floodgates in the second half of an utter blowout. And while Saban wasn’t happy with his team after its handling of Western Kentucky, the game was never particularly close. Ole Miss opened with an impressive half against the mighty Seminoles, but couldn’t hold a 22-point lead and lost, 45–34. And while Kelly had some issues with turnovers in the opener (the aforementioned three interceptions, plus a fumble), he cleaned those up in limited action in the Rebels’ whuppin’ of Wofford in Week 2."}, {"6596": "Really, predicting another Ole Miss upset of Alabama comes down to two things: (1) how much you value home-field advantage in the thorny early parts of a season and (2) whether you believe Freeze really has divined an operating system update capable of (at least temporarily) bricking the Saban machine."}, {"cbe5": "Earlier this week, Freeze suggested a wait-and-see approach when it comes to determining the distance between Ole Miss and Alabama."}, {"700a": "“It’s very difficult to say that you’re ever going to overcome the gap,” he said during his weekly press conference. “I think we’ve closed it considerably, obviously, the proof is on the field. Do you ever overcome that? Probably not. … But, if you have a two-deep who are good enough to play and you get the right system and the right plan that has a chance to be successful against [the Crimson Tide], I think you have a fighting chance. I’ll know more about that after Saturday.”"}, {"acf5": "We too will have another data point to add to the analysis after Saturday, but before the hard numbers are snugly in their spreadsheets, the outcome will come down at least in part to two things that aren’t quantifiable: motivation and belief."}, {"f79f": "First, motivation: If the Rebels beat the Crimson Tide, they would become the first team to beat Saban’s Alabama three straight times. If the Rebels beat the Crimson Tide, they would knock the undefeated, reigning national champs from the throne (at least temporarily). If the Rebels beat the Crimson Tide, they would provide further evidence that the previous Bama beatings weren’t miracles after all, and that Ole Miss is a dark-horse contender for the playoff. If the Crimson Tide beat the Rebels? Well, they’ll improve to 3–0 and cement their place atop the rankings. (Edge: Ole Miss.)"}, {"ab0d": "Logic would have favored Bama over Ole Miss in each of the past two years. Adore him or despise him, Saban has turned an art (recruiting, teaching, and scheming football) into something resembling cutting-edge science."}, {"6004": "But even the science we take for granted can face new challenges. For evidence of that, look no further than this:"}, {"ba7b": "But sometimes scientific challenges are just anomalies. As shocking as the upsets in 2014 and 2015 were, they guaranteed Ole Miss exactly nothing and didn’t stop Alabama from making it to the inaugural College Football Playoff in 2014 or from winning the whole thing in 2015."}, {"b4f1": "So can Ole Miss beat Alabama again? Science tells us it can, if Kelly can make plays while taking care of the ball, the defense can rattle a young Alabama passer into making mistakes, and Freeze’s penchant for spreading the field on offense can again counteract Saban’s defensive talent advantage. But if the Rebels upset the Tide again on Saturday, it won’t be because of science. It’ll be because of belief."}, {"73ce": "(*No actual science was done in the writing of this article.)"}], "author": "Jack McCluskey", "child": "1655_1\t1655_2\t1655_3", "name": "1655", "content": "A Scientific Examination of Alabama–Ole Miss Can the Rebels pull off another miraculous upset of the Crimson Tide? AP Images/Ringer illustration “We can do science,” Carl Sagan wrote in Cosmos, “and with it we can improve our lives.” So let us do science*, and by so doing improve our lives. The hypothesis we’ll be looking at today is “Ole Miss can beat Alabama for the third year in a row.” We’ll test this hypothesis with a relatively straightforward procedure: Compare and contrast the relative strengths and weaknesses of the two participants in Saturday afternoon’s game in Oxford, Mississippi. Alabama is ranked no. 1 in the country, while Mississippi is ranked no. 19. (Edge: Alabama.) The Crimson Tide are no. 1 in Football Outsiders’ S&P+, while the Rebels are no. 8. (Edge: Alabama.) Ole Miss is no. 3 in FO’s Offensive S&P+, while Alabama is no. 12. (Edge: Ole Miss.) But Alabama is no. 2 in Defensive S&P+, while Ole Miss is no. 62. (Edge: Alabama.) Alabama’s offense is led by a quarterback named Jalen Hurts, while Ole Miss’s offense is led by a quarterback named Chad Kelly. (Edge: Alabama … and really, all headline writers in America.) Hurts has thrown one interception so far, while Kelly already has three. (Edge: Alabama.) But Kelly leads the SEC in total QBR, while Hurts is 10th. (Edge: Ole Miss.) Alabama won its first game by 46 points (over then-no. 20 USC) but its second game by just 28 more, prompting “ass-chewings” on the sideline from coach Nick Saban. Ole Miss lost its first game by 11 points (to then-no. 4 Florida State) and won its second by 25, prompting no known “ass-chewings” from coach Hugh Freeze. (Edge: Alabama if you’re pro-ass-chewing, Ole Miss if you’re anti-ass-chewing.) It’s early yet, but Alabama is having a better 2016 season. The Crimson Tide trailed USC for much of the first half, but opened the floodgates in the second half of an utter blowout. And while Saban wasn’t happy with his team after its handling of Western Kentucky, the game was never particularly close. Ole Miss opened with an impressive half against the mighty Seminoles, but couldn’t hold a 22-point lead and lost, 45–34. And while Kelly had some issues with turnovers in the opener (the aforementioned three interceptions, plus a fumble), he cleaned those up in limited action in the Rebels’ whuppin’ of Wofford in Week 2. Really, predicting another Ole Miss upset of Alabama comes down to two things: (1) how much you value home-field advantage in the thorny early parts of a season and (2) whether you believe Freeze really has divined an operating system update capable of (at least temporarily) bricking the Saban machine. Earlier this week, Freeze suggested a wait-and-see approach when it comes to determining the distance between Ole Miss and Alabama. “It’s very difficult to say that you’re ever going to overcome the gap,” he said during his weekly press conference. “I think we’ve closed it considerably, obviously, the proof is on the field. Do you ever overcome that? Probably not. … But, if you have a two-deep who are good enough to play and you get the right system and the right plan that has a chance to be successful against [the Crimson Tide], I think you have a fighting chance. I’ll know more about that after Saturday.” We too will have another data point to add to the analysis after Saturday, but before the hard numbers are snugly in their spreadsheets, the outcome will come down at least in part to two things that aren’t quantifiable: motivation and belief. First, motivation: If the Rebels beat the Crimson Tide, they would become the first team to beat Saban’s Alabama three straight times. If the Rebels beat the Crimson Tide, they would knock the undefeated, reigning national champs from the throne (at least temporarily). If the Rebels beat the Crimson Tide, they would provide further evidence that the previous Bama beatings weren’t miracles after all, and that Ole Miss is a dark-horse contender for the playoff. If the Crimson Tide beat the Rebels? Well, they’ll improve to 3–0 and cement their place atop the rankings. (Edge: Ole Miss.) Logic would have favored Bama over Ole Miss in each of the past two years. Adore him or despise him, Saban has turned an art (recruiting, teaching, and scheming football) into something resembling cutting-edge science. But even the science we take for granted can face new challenges. For evidence of that, look no further than this: But sometimes scientific challenges are just anomalies. As shocking as the upsets in 2014 and 2015 were, they guaranteed Ole Miss exactly nothing and didn’t stop Alabama from making it to the inaugural College Football Playoff in 2014 or from winning the whole thing in 2015. So can Ole Miss beat Alabama again? Science tells us it can, if Kelly can make plays while taking care of the ball, the defense can rattle a young Alabama passer into making mistakes, and Freeze’s penchant for spreading the field on offense can again counteract Saban’s defensive talent advantage. But if the Rebels upset the Tide again on Saturday, it won’t be because of science. It’ll be because of belief. (*No actual science was done in the writing of this article.) "}