{"parent": "", "timestamp": "Feb 7", "title": "Please, Lord, Bring Chip Kelly to Alabama", "sentences": [{"c3ee": "Please, Lord, Bring Chip Kelly to Alabama"}, {"ccd4": "Steve Sarkisian’s departure opens the door for Nick Saban to make a dream OC hire"}, {"7d6e": "Do you miss it? Do you miss Alabama head coach Nick Saban angrily roaming the sideline in Tuscaloosa, berating an offensive coordinator who was once considered a rising star? Do you miss scenes like the one below, where Saban lit into Lane Kiffin after the Crimson Tide fumbled late in September’s 38–10 win over Western Kentucky, allowing the Hilltoppers to slice the deficit to a mere 28 points with less than a minute remaining?"}, {"3af8": "Saban dismissed Kiffin on January 2, 2017, less than a month after he’d agreed to become Florida Atlantic’s next head coach and a week before Bama lost to Clemson in the national championship game. Steve Sarkisian, who was announced as Kiffin’s replacement-in-waiting on December 16, stepped into the OC role early with subpar results, as the Tide gained just 376 yards (and went 2-of-15 on third-down conversions) against the Tigers. And now, in a surprising twist, Sarkisian has left Bama to take the same position with the Atlanta Falcons, where he’ll replace Kyle Shanahan, who became the 49ers head coach on Monday. People will claim that Sark jumped to inherit the NFL’s highest-scoring offense, but really, he left to escape this reality:"}, {"f278": "Well, college football fans wondering where the Tide will turn next, I bring you the most tantalizing possibility. It’s time: Sark’s departure clears the way for Saban to bring Chip Kelly — the lord and savior of points, Pac-12 titles, and repeatedly covering up player injuries — to Alabama."}, {"7bff": "I know, I know."}, {"0c7f": "There are three stages to processing this: (1) recalling that we’ve been teased about Chip returning to campus before, and not wanting to fall for it again. In the past six months alone, he’s been rumored to have been in the mix for positions at UCLA, Cal, LSU, and others. This couldn’t really happen, could it? (2) Remembering that story from January 2016: The one in which Chip trekked to Bama’s campus before the title game, and Saban said “Chip Kelly is a good friend of myself and a lot of coaches on our staff, and he just happened to be in the area and he stopped by and visited with us for a little bit”? The one that set the stage for a moment just like this one. (3) Realizing, oh goddamnit, this is definitely happening. Chip is going to take over, and blue-chip quarterback prospect Tua Tagovailoa is going to become the next Marcus Mariota, and Bo Scarbrough is going to become a scarier version of Kenjon Barner, and five-star early enrollee Najee Harris is going to break all kinds of NCAA rushing records, given that a coach already labeled him a “bigger Barry Sanders” and that Harris has long been a vocal critic of Taco Tuesdays and Fast-Food Fridays. (Fine, I made that last part up.)"}, {"0f6e": "The point is, Chip is fresh off two failed NFL stints and needs a second college chance. (San Francisco’s 2–14 record this season had nothing to do with the organization’s overwhelming dysfunction. Just ask Jed York!) And no one does second chances like Nick Saban. Just the idea of Kelly’s offense pairing with Saban’s defense is causing me to break into a cold sweat, and that’s not even the most exciting part of this potential (read: inevitable) partnership."}, {"4b06": "Chip Kelly Bet on His System Until It FailedThe San Francisco 49ers fired Kelly on Sunday. Once seen as a football mastermind, his coaching future is now in doubt.theringer.com"}, {"6fbc": "Just imagine it: September 16, 2017. Alabama leads Colorado State 72–7 in the waning moments of the fourth quarter, and Chip calls for quarterback Jalen Hurts (who is still in the game) to throw a bomb to Calvin Ridley (also still in the game), because this is the type of thing that Kelly does. Colorado State intercepts the pass, returns it 50-plus yards for a meaningless score, and the college football world gets a photo like this, only better. Everyone is happy, except for maybe Phyllis from Finebaum and Puddles the Duck."}, {"9ad2": "Plus, there’s one more reason Alabama has to hire Kelly — one that may have dictated his career path this entire time, unbeknownst to everyone: He still needs to exact revenge against Auburn. Michael Dyer was down."}], "author": "Ben Glicksman", "child": "1657_1\t1657_2\t1657_3\t1657_4\t1657_5\t1657_6\t1657_7", "name": "1657", "content": "Please, Lord, Bring Chip Kelly to Alabama Steve Sarkisian’s departure opens the door for Nick Saban to make a dream OC hire Do you miss it? Do you miss Alabama head coach Nick Saban angrily roaming the sideline in Tuscaloosa, berating an offensive coordinator who was once considered a rising star? Do you miss scenes like the one below, where Saban lit into Lane Kiffin after the Crimson Tide fumbled late in September’s 38–10 win over Western Kentucky, allowing the Hilltoppers to slice the deficit to a mere 28 points with less than a minute remaining? Saban dismissed Kiffin on January 2, 2017, less than a month after he’d agreed to become Florida Atlantic’s next head coach and a week before Bama lost to Clemson in the national championship game. Steve Sarkisian, who was announced as Kiffin’s replacement-in-waiting on December 16, stepped into the OC role early with subpar results, as the Tide gained just 376 yards (and went 2-of-15 on third-down conversions) against the Tigers. And now, in a surprising twist, Sarkisian has left Bama to take the same position with the Atlanta Falcons, where he’ll replace Kyle Shanahan, who became the 49ers head coach on Monday. People will claim that Sark jumped to inherit the NFL’s highest-scoring offense, but really, he left to escape this reality: Well, college football fans wondering where the Tide will turn next, I bring you the most tantalizing possibility. It’s time: Sark’s departure clears the way for Saban to bring Chip Kelly — the lord and savior of points, Pac-12 titles, and repeatedly covering up player injuries — to Alabama. I know, I know. There are three stages to processing this: (1) recalling that we’ve been teased about Chip returning to campus before, and not wanting to fall for it again. In the past six months alone, he’s been rumored to have been in the mix for positions at UCLA, Cal, LSU, and others. This couldn’t really happen, could it? (2) Remembering that story from January 2016: The one in which Chip trekked to Bama’s campus before the title game, and Saban said “Chip Kelly is a good friend of myself and a lot of coaches on our staff, and he just happened to be in the area and he stopped by and visited with us for a little bit”? The one that set the stage for a moment just like this one. (3) Realizing, oh goddamnit, this is definitely happening. Chip is going to take over, and blue-chip quarterback prospect Tua Tagovailoa is going to become the next Marcus Mariota, and Bo Scarbrough is going to become a scarier version of Kenjon Barner, and five-star early enrollee Najee Harris is going to break all kinds of NCAA rushing records, given that a coach already labeled him a “bigger Barry Sanders” and that Harris has long been a vocal critic of Taco Tuesdays and Fast-Food Fridays. (Fine, I made that last part up.) The point is, Chip is fresh off two failed NFL stints and needs a second college chance. (San Francisco’s 2–14 record this season had nothing to do with the organization’s overwhelming dysfunction. Just ask Jed York!) And no one does second chances like Nick Saban. Just the idea of Kelly’s offense pairing with Saban’s defense is causing me to break into a cold sweat, and that’s not even the most exciting part of this potential (read: inevitable) partnership. Chip Kelly Bet on His System Until It FailedThe San Francisco 49ers fired Kelly on Sunday. Once seen as a football mastermind, his coaching future is now in doubt.theringer.com Just imagine it: September 16, 2017. Alabama leads Colorado State 72–7 in the waning moments of the fourth quarter, and Chip calls for quarterback Jalen Hurts (who is still in the game) to throw a bomb to Calvin Ridley (also still in the game), because this is the type of thing that Kelly does. Colorado State intercepts the pass, returns it 50-plus yards for a meaningless score, and the college football world gets a photo like this, only better. Everyone is happy, except for maybe Phyllis from Finebaum and Puddles the Duck. Plus, there’s one more reason Alabama has to hire Kelly — one that may have dictated his career path this entire time, unbeknownst to everyone: He still needs to exact revenge against Auburn. Michael Dyer was down. "}