{"parent": "", "timestamp": "Jan 5", "title": "Calvin Ridley, National Championship Hero?", "sentences": [{"e89f": "Calvin Ridley, National Championship Hero?"}, {"8e27": "History tells us that an underused Alabama offensive player will break out in Monday’s title game. Here are the top 11 candidates."}, {"ff2e": "Only one skill-position player looked good in the Peach Bowl. That scarcity was unusual for Alabama and Washington, two teams that entered the playoff semifinal averaging more than 40 points per game, but such was the defensive talent on display. Quarterbacks Jake Browning and Jalen Hurts combined for the equivalent of a 52.3 NFL passer rating. No receiver totaled more than 44 yards. Only one running back managed more than 34."}, {"45ca": "But what a game that one rusher had — and what a surprise it was. Before facing Washington, Bo Scarbrough had yet to consistently tap his potential at Alabama. The five-star recruit placed 16th nationally in 247Sports’ composite rankings, ahead of Joe Mixon, Nick Chubb, and Royce Freeman. After a one-year delay due to academic eligibility issues, he served as a backup during his freshman campaign in 2015, then entered the 2016 season with Heisman buzz as a runner vying to replace last year’s trophy winner, Derrick Henry, in Alabama’s backfield."}, {"c735": "That hype didn’t manifest in comparable production for Scarbrough, who lost the starting job to Damien Harris and entered the playoff with just 539 rushing yards this year, fourth-most on his own team. Yet he immolated Washington’s otherwise impenetrable defense, amassing or matching career highs in carries (19), yards (180), and touchdowns (two, tying his tally from the SEC title game against Florida)."}, {"c835": "But while Scarbrough’s role as the featured back was a first for him since joining the Tide, sudden star turns in key games are nothing new for Alabama’s offense. Just last year, tight end O.J. Howard — another five-star recruit, who ranked 19th nationally in his class — emerged from a quiet season to rupture Clemson’s secondary to the tune of five catches, 208 yards, and two touchdowns, in the process winning Offensive MVP honors and setting the record for most receiving yards in a national championship game."}, {"a556": "“We’d been resting him for 14 games,” then-offensive coordinator Lane Kiffin joked after the game. “He had fresh legs.”"}, {"1474": "The same applied to Scarbrough last week, and if two makes a pattern, Alabama could be due for another breakout performance from an underused skill-position player in Monday’s title game rematch against the Tigers. Because Alabama’s roster is stocked with top recruits and athletic marvels, the candidates are plentiful; here are 11 possibilities (10 players plus a bonus) for such a breakthrough, ranked in order from most to least likely that they will serve as the game’s surprise star."}, {"b4d3": "We’ve Never Had Anything Like a Clemson-Alabama RematchThe Tigers and Crimson Tide rolled in the playoff semifinals, setting up a matchup that’s at once familiar and…theringer.com"}, {"e586": "1. Running Back Josh Jacobs"}, {"e25f": "Jacobs is a rarity on Alabama’s roster: a three-star recruit who received scholarship offers from multiple FCS schools and New Mexico State. Despite nearly slipping through the recruiting cracks, the freshman running back has a 6.64-yards-per-carry average that’s a smidge higher than Scarbrough’s 6.60."}, {"d238": "As the first back off the bench earlier in the season, Jacobs tallied 197 yards on 27 carries with Harris hurt against Kent State and Kentucky, but he hasn’t exceeded 10 rushes in a game since and has lost his spot to Scarbrough on the depth chart."}, {"9748": "Or so Nick Saban wants people to think. It would be typical if, just as the Tigers spend their week preparing to stop Scarbrough’s brute strength, they’re instead ensnared by Jacobs’s elusive cutbacks and stutter-steps. It’s time for yet another Bama back to seize the spotlight."}, {"989c": "2. Tight End Howard"}, {"f2e0": "We’ve been here before, but it bears monitoring once again."}, {"2bd4": "Howard last season, prechampionship: 33 receptions, 394 yards, 0 touchdowns"}, {"706e": "Howard this season, prechampionship: 41 receptions, 489 yards, 2 touchdowns"}, {"bd3b": "A little better, sure, but still in the same underutilized ballpark. Howard is an athletic downfield target and a tremendous blocker, and he’s going to make an NFL team very happy next year, but he hasn’t followed up his MVP honors with a numbers boost in the 2016 season thus far. He had three receptions of 50-plus yards in last year’s final; this season, he doesn’t have a catch longer than 40. He also had two touchdowns in last year’s final; this season, he has two touchdowns, total."}, {"a152": "Clemson assuredly will be better prepared to defend against the athletic tight end this time around, but if Alabama actually looks his way, there’s only so much a team can do to slow a player with the size of Rob Gronkowski and the 40-yard-dash speed of DeAndre Hopkins."}, {"1faf": "3. Receiver Gehrig Dieter"}, {"34ee": "Besides his performance against FCS school Chattanooga, when he gathered two 1-yard touchdown catches, Dieter hasn’t managed more than one reception in a game since September — which makes him the perfect target for Alabama to finally unleash in the championship."}, {"0aad": "The graduate transfer is a proven late-season performer: In two bowl games with Bowling Green, he grabbed 12 passes for 184 yards and a touchdown. Plus his namesake is the best hitter in MLB postseason history, so he seems destined for a supernatural boost in big moments."}, {"92fe": "4. Receiver Calvin Ridley"}, {"87a1": "Saban must have started planning this con the day after Alabama beat Clemson for the title, eschewing celebrating in favor of looking ahead to this championship game. Which star player to hide throughout the season, he must have wondered, to starve him for touches throughout the fall only to feed him a feast a year later?"}, {"ad74": "That’s the only explanation for Ridley’s subdued sophomore season, as he has lost 19 percent of his receptions and 25 percent of his yards (on a per-game basis) from his standout freshman campaign. Take out his 94-yard day against Chattanooga and Ridley hasn’t reached even 60 yards in a game since October 1; he caught just one ball for 6 yards against Washington and doesn’t appear to be Hurts’s preferred target downfield."}, {"b502": "What better time to break out anew than the championship game? The only reason Ridley doesn’t rank higher on this list is because Clemson defensive coordinator Brent Venables is a tactical mastermind in his own right and shouldn’t be fooled by Ridley’s season-long rope-a-dope: The Tigers’ Cordrea Tankersley is the best cornerback in the country and can still shut Ridley down."}, {"6d21": "Alabama’s Pass Rush Has Swung the SeasonCan Clemson prevent it from swinging the title game, too?theringer.com"}, {"b2b2": "5. Punt Returner Trevon Diggs"}, {"cd34": "Stefon’s little brother hasn’t played much in his freshman campaign, but he has returned punts since safety Eddie Jackson suffered a broken leg in October. The Crimson Tide won last year’s championship with special teams, recovering a surprise onside attempt and returning a kickoff for a touchdown in the fourth quarter. Diggs could be that hero this year: Although he struggled to field the directional, bouncing punts boomed forth by Washington’s Tristan Vizcaino, he delivered returns of 47 and 36 yards against Florida, leading to 10 Alabama points."}, {"f3f8": "His older brother caught 10 passes for 138 yards in his only career bowl game at Maryland. Trevon might not achieve comparable NFL success, but a key momentum-shifting return on Monday could shift household bragging rights at least on the collegiate level."}, {"47d1": "6. Offensive Coordinator Steve Sarkisian"}, {"d4d2": "If it seems odd that an undefeated defending champion would say farewell to its offensive coordinator just days before playing for a repeat title, well, Lane Kiffin has never been one for typical coaching transitions. Now that Kiffin’s gone to play shuffleboard in Boca Raton a little earlier than expected, Steve Sarkisian assumes the play-calling duties against Clemson."}, {"b997": "The former Washington and USC head coach had been serving as an unofficial analyst for Saban’s staff, so he’s familiar with Bama’s plays and principles, and he had already been announced as Kiffin’s replacement for next season. Clemson coach Dabo Swinney downplayed the effect of the transition this week, explaining, “I guess you got some nuances that might be a little different. … It’s not like they’re going to come out and run the triple-option.”"}, {"01b5": "Is he willing to wager his title hopes on that belief, though? The Hurts-Harris-Scarbrough troika would form a compelling wishbone combination, and even if Sark doesn’t make a change that drastic, odds are he will catalyze some sort of shift in the game plan after Bama’s weak offensive showing against Washington. Maximizing Hurts’s effectiveness against an at-times-dominant Clemson defensive front would be quite the cap to Sarkisian’s first week on the job, and quite the step up after a season spent away from the sideline."}, {"3051": "Clemson’s Mike Williams and Artavis Scott Would Keep Me Up at NightIf anyone can scare Alabama, it’s this pair of receiverstheringer.com"}, {"ed33": "7. Quarterback Cooper Bateman"}, {"a855": "Bateman’s recruiting class included Christian Hackenberg, which shows how long this guy — the “veteran of the Crimson Tide quarterbacks,” according to his official Bama bio — has been learning Saban’s wiles in Tuscaloosa."}, {"4c50": "He’s also a pretty good passer when he has the opportunity. If you pretend he has enough pass attempts to qualify (at just 14 this year, he doesn’t come close), Bateman has the country’s best completion percentage and the fourth-best passer rating, and he hasn’t thrown an interception since September 2015. Forget that those passes have come in blowouts against the likes of Kentucky, and that’s a mighty impressive statistical profile."}, {"f164": "Bateman is transferring after the season, but he serves as the team’s holder and could contribute off the bench in his final game with Alabama via a fake field goal pass. And if — perish the thought! — Ben Boulware tries to maim another opposing player and hurts Hurts on an option run, Bateman could step in."}, {"ba19": "8. Goal-Line Specialist Mack Wilson"}, {"33b2": "Wilson is a five-star linebacker who will replace Reuben Foster next year and likely become a mainstay on future All-SEC teams. That’s not important right now. What is is that Wilson has one career touch, and it involved him controlling a wayward pass, juggling the ball while falling, and pulling it to his chest for a touchdown while completing a backward somersault."}, {"d800": "Given the numerous similarities between Saban and Bill Belichick, Saban surely wants a Mike Vrabel of his own, so mark Wilson down for two goal-line touchdowns Monday night. On that note, also watch out for Brandon Greene, the 306-pound lineman-slash-tight-end whose two career catches include this bit of trickery against LSU in 2014."}, {"39d4": "9. Running Back B.J. Emmons"}, {"b6d8": "Emmons rated as the second-best pure running back coming out of high school last year. That no. 2 designation also went to Dalvin Cook, T.J. Yeldon, and Trent Richardson in recent years, so Emmons clearly has the talent to become a star at the collegiate level."}, {"963a": "Granted, he hasn’t played since October due to a foot injury, and the program says he is out “indefinitely.” But this is Saban, so that report could be subterfuge. Maybe something is afoot with Emmons’s foot, or maybe he’s going to rush for 150 yards against Clemson."}, {"827f": "10. Quarterback Blake Barnett"}, {"d3eb": "The erstwhile Bama quarterback is even less likely to play than Emmons because he transferred — eventually to Arizona State after a brief stint at a juco — in September after losing his starting job to Hurts. But look at this arm!"}, {"1c85": "In just 19 pass attempts this year, Barnett completed three 40-yarders, giving him as many 40-yard passes as Wisconsin’s quarterbacks combined for all season. Perhaps one of Saban’s 436 analysts and assistants has found a loophole in the NCAA rulebook that will allow Barnett to don crimson once again and loft a fourth-quarter touchdown pass to Ridley. The greatest trick Saban will pull is convincing the world his players don’t exist anymore."}, {"3a6e": "11. Running Back Derrick Henry in Disguise"}, {"852a": "I mean, the Titans missed the playoffs, so it’s not like Henry has anything better to do than to vacation down in Florida."}, {"128c": "And, wow! Look at how much “Hurts,” the Alabama player in the no. 2 jersey with the dreadlocks tied up in the back of his helmet, has bulked up in the new year! Tremble in fear at his running style on option keepers and scrambles, a mix of fluid and bruising that belies his mere 18 years of age! Gaze in awe at his open-field speed, his dances around arm-tackles, the Heisman stiff-arm he flashes upon crossing the goal line with such precision — it’s as if he’s practiced that pose before!"}, {"f44d": "It’s kind of weird that he hasn’t thrown a pass all game, though …"}], "author": "Zach Kram", "child": "1661_1\t1661_2", "name": "1661", "content": "Calvin Ridley, National Championship Hero? History tells us that an underused Alabama offensive player will break out in Monday’s title game. Here are the top 11 candidates. Only one skill-position player looked good in the Peach Bowl. That scarcity was unusual for Alabama and Washington, two teams that entered the playoff semifinal averaging more than 40 points per game, but such was the defensive talent on display. Quarterbacks Jake Browning and Jalen Hurts combined for the equivalent of a 52.3 NFL passer rating. No receiver totaled more than 44 yards. Only one running back managed more than 34. But what a game that one rusher had — and what a surprise it was. Before facing Washington, Bo Scarbrough had yet to consistently tap his potential at Alabama. The five-star recruit placed 16th nationally in 247Sports’ composite rankings, ahead of Joe Mixon, Nick Chubb, and Royce Freeman. After a one-year delay due to academic eligibility issues, he served as a backup during his freshman campaign in 2015, then entered the 2016 season with Heisman buzz as a runner vying to replace last year’s trophy winner, Derrick Henry, in Alabama’s backfield. That hype didn’t manifest in comparable production for Scarbrough, who lost the starting job to Damien Harris and entered the playoff with just 539 rushing yards this year, fourth-most on his own team. Yet he immolated Washington’s otherwise impenetrable defense, amassing or matching career highs in carries (19), yards (180), and touchdowns (two, tying his tally from the SEC title game against Florida). But while Scarbrough’s role as the featured back was a first for him since joining the Tide, sudden star turns in key games are nothing new for Alabama’s offense. Just last year, tight end O.J. Howard — another five-star recruit, who ranked 19th nationally in his class — emerged from a quiet season to rupture Clemson’s secondary to the tune of five catches, 208 yards, and two touchdowns, in the process winning Offensive MVP honors and setting the record for most receiving yards in a national championship game. “We’d been resting him for 14 games,” then-offensive coordinator Lane Kiffin joked after the game. “He had fresh legs.” The same applied to Scarbrough last week, and if two makes a pattern, Alabama could be due for another breakout performance from an underused skill-position player in Monday’s title game rematch against the Tigers. Because Alabama’s roster is stocked with top recruits and athletic marvels, the candidates are plentiful; here are 11 possibilities (10 players plus a bonus) for such a breakthrough, ranked in order from most to least likely that they will serve as the game’s surprise star. We’ve Never Had Anything Like a Clemson-Alabama RematchThe Tigers and Crimson Tide rolled in the playoff semifinals, setting up a matchup that’s at once familiar and…theringer.com 1. Running Back Josh Jacobs Jacobs is a rarity on Alabama’s roster: a three-star recruit who received scholarship offers from multiple FCS schools and New Mexico State. Despite nearly slipping through the recruiting cracks, the freshman running back has a 6.64-yards-per-carry average that’s a smidge higher than Scarbrough’s 6.60. As the first back off the bench earlier in the season, Jacobs tallied 197 yards on 27 carries with Harris hurt against Kent State and Kentucky, but he hasn’t exceeded 10 rushes in a game since and has lost his spot to Scarbrough on the depth chart. Or so Nick Saban wants people to think. It would be typical if, just as the Tigers spend their week preparing to stop Scarbrough’s brute strength, they’re instead ensnared by Jacobs’s elusive cutbacks and stutter-steps. It’s time for yet another Bama back to seize the spotlight. 2. Tight End Howard We’ve been here before, but it bears monitoring once again. Howard last season, prechampionship: 33 receptions, 394 yards, 0 touchdowns Howard this season, prechampionship: 41 receptions, 489 yards, 2 touchdowns A little better, sure, but still in the same underutilized ballpark. Howard is an athletic downfield target and a tremendous blocker, and he’s going to make an NFL team very happy next year, but he hasn’t followed up his MVP honors with a numbers boost in the 2016 season thus far. He had three receptions of 50-plus yards in last year’s final; this season, he doesn’t have a catch longer than 40. He also had two touchdowns in last year’s final; this season, he has two touchdowns, total. Clemson assuredly will be better prepared to defend against the athletic tight end this time around, but if Alabama actually looks his way, there’s only so much a team can do to slow a player with the size of Rob Gronkowski and the 40-yard-dash speed of DeAndre Hopkins. 3. Receiver Gehrig Dieter Besides his performance against FCS school Chattanooga, when he gathered two 1-yard touchdown catches, Dieter hasn’t managed more than one reception in a game since September — which makes him the perfect target for Alabama to finally unleash in the championship. The graduate transfer is a proven late-season performer: In two bowl games with Bowling Green, he grabbed 12 passes for 184 yards and a touchdown. Plus his namesake is the best hitter in MLB postseason history, so he seems destined for a supernatural boost in big moments. 4. Receiver Calvin Ridley Saban must have started planning this con the day after Alabama beat Clemson for the title, eschewing celebrating in favor of looking ahead to this championship game. Which star player to hide throughout the season, he must have wondered, to starve him for touches throughout the fall only to feed him a feast a year later? That’s the only explanation for Ridley’s subdued sophomore season, as he has lost 19 percent of his receptions and 25 percent of his yards (on a per-game basis) from his standout freshman campaign. Take out his 94-yard day against Chattanooga and Ridley hasn’t reached even 60 yards in a game since October 1; he caught just one ball for 6 yards against Washington and doesn’t appear to be Hurts’s preferred target downfield. What better time to break out anew than the championship game? The only reason Ridley doesn’t rank higher on this list is because Clemson defensive coordinator Brent Venables is a tactical mastermind in his own right and shouldn’t be fooled by Ridley’s season-long rope-a-dope: The Tigers’ Cordrea Tankersley is the best cornerback in the country and can still shut Ridley down. Alabama’s Pass Rush Has Swung the SeasonCan Clemson prevent it from swinging the title game, too?theringer.com 5. Punt Returner Trevon Diggs Stefon’s little brother hasn’t played much in his freshman campaign, but he has returned punts since safety Eddie Jackson suffered a broken leg in October. The Crimson Tide won last year’s championship with special teams, recovering a surprise onside attempt and returning a kickoff for a touchdown in the fourth quarter. Diggs could be that hero this year: Although he struggled to field the directional, bouncing punts boomed forth by Washington’s Tristan Vizcaino, he delivered returns of 47 and 36 yards against Florida, leading to 10 Alabama points. His older brother caught 10 passes for 138 yards in his only career bowl game at Maryland. Trevon might not achieve comparable NFL success, but a key momentum-shifting return on Monday could shift household bragging rights at least on the collegiate level. 6. Offensive Coordinator Steve Sarkisian If it seems odd that an undefeated defending champion would say farewell to its offensive coordinator just days before playing for a repeat title, well, Lane Kiffin has never been one for typical coaching transitions. Now that Kiffin’s gone to play shuffleboard in Boca Raton a little earlier than expected, Steve Sarkisian assumes the play-calling duties against Clemson. The former Washington and USC head coach had been serving as an unofficial analyst for Saban’s staff, so he’s familiar with Bama’s plays and principles, and he had already been announced as Kiffin’s replacement for next season. Clemson coach Dabo Swinney downplayed the effect of the transition this week, explaining, “I guess you got some nuances that might be a little different. … It’s not like they’re going to come out and run the triple-option.” Is he willing to wager his title hopes on that belief, though? The Hurts-Harris-Scarbrough troika would form a compelling wishbone combination, and even if Sark doesn’t make a change that drastic, odds are he will catalyze some sort of shift in the game plan after Bama’s weak offensive showing against Washington. Maximizing Hurts’s effectiveness against an at-times-dominant Clemson defensive front would be quite the cap to Sarkisian’s first week on the job, and quite the step up after a season spent away from the sideline. Clemson’s Mike Williams and Artavis Scott Would Keep Me Up at NightIf anyone can scare Alabama, it’s this pair of receiverstheringer.com 7. Quarterback Cooper Bateman Bateman’s recruiting class included Christian Hackenberg, which shows how long this guy — the “veteran of the Crimson Tide quarterbacks,” according to his official Bama bio — has been learning Saban’s wiles in Tuscaloosa. He’s also a pretty good passer when he has the opportunity. If you pretend he has enough pass attempts to qualify (at just 14 this year, he doesn’t come close), Bateman has the country’s best completion percentage and the fourth-best passer rating, and he hasn’t thrown an interception since September 2015. Forget that those passes have come in blowouts against the likes of Kentucky, and that’s a mighty impressive statistical profile. Bateman is transferring after the season, but he serves as the team’s holder and could contribute off the bench in his final game with Alabama via a fake field goal pass. And if — perish the thought! — Ben Boulware tries to maim another opposing player and hurts Hurts on an option run, Bateman could step in. 8. Goal-Line Specialist Mack Wilson Wilson is a five-star linebacker who will replace Reuben Foster next year and likely become a mainstay on future All-SEC teams. That’s not important right now. What is is that Wilson has one career touch, and it involved him controlling a wayward pass, juggling the ball while falling, and pulling it to his chest for a touchdown while completing a backward somersault. Given the numerous similarities between Saban and Bill Belichick, Saban surely wants a Mike Vrabel of his own, so mark Wilson down for two goal-line touchdowns Monday night. On that note, also watch out for Brandon Greene, the 306-pound lineman-slash-tight-end whose two career catches include this bit of trickery against LSU in 2014. 9. Running Back B.J. Emmons Emmons rated as the second-best pure running back coming out of high school last year. That no. 2 designation also went to Dalvin Cook, T.J. Yeldon, and Trent Richardson in recent years, so Emmons clearly has the talent to become a star at the collegiate level. Granted, he hasn’t played since October due to a foot injury, and the program says he is out “indefinitely.” But this is Saban, so that report could be subterfuge. Maybe something is afoot with Emmons’s foot, or maybe he’s going to rush for 150 yards against Clemson. 10. Quarterback Blake Barnett The erstwhile Bama quarterback is even less likely to play than Emmons because he transferred — eventually to Arizona State after a brief stint at a juco — in September after losing his starting job to Hurts. But look at this arm! In just 19 pass attempts this year, Barnett completed three 40-yarders, giving him as many 40-yard passes as Wisconsin’s quarterbacks combined for all season. Perhaps one of Saban’s 436 analysts and assistants has found a loophole in the NCAA rulebook that will allow Barnett to don crimson once again and loft a fourth-quarter touchdown pass to Ridley. The greatest trick Saban will pull is convincing the world his players don’t exist anymore. 11. Running Back Derrick Henry in Disguise I mean, the Titans missed the playoffs, so it’s not like Henry has anything better to do than to vacation down in Florida. And, wow! Look at how much “Hurts,” the Alabama player in the no. 2 jersey with the dreadlocks tied up in the back of his helmet, has bulked up in the new year! Tremble in fear at his running style on option keepers and scrambles, a mix of fluid and bruising that belies his mere 18 years of age! Gaze in awe at his open-field speed, his dances around arm-tackles, the Heisman stiff-arm he flashes upon crossing the goal line with such precision — it’s as if he’s practiced that pose before! It’s kind of weird that he hasn’t thrown a pass all game, though … "}