{"parent": "", "timestamp": "Dec 4, 2016", "title": "The College Football Playoff Committee Got It Right", "sentences": [{"2002": "The College Football Playoff Committee Got It Right"}, {"2adf": "Penn State’s omission raises numerous valid questions about human error and what matters most in the playoff age. That doesn’t mean picking Ohio State and Washington instead was wrong."}, {"ddf8": "College football fans didn’t like when computers picked the teams that got to participate in the BCS title game. It was a rigid system that often generated frustrating results. Most of us were happy when the sport adopted the College Football Playoff, both because it meant widening the field of title hopefuls from two teams to four, and because it meant swapping out those damn formulas for a selection committee populated by rational beings."}, {"306c": "But the committee presents its own worries. Humans can flip-flop. Humans can talk themselves into bad choices. Humans can be biased. Humans can decide the wrong criteria are important. Instead of cold, emotionless numbers, we’re now presented with committee chair Kirby Hocutt, who explains the committee’s justifications for its decisions. And sometimes, those decisions seem wrong."}, {"751e": "This year, the people on the selection committee made pretty much the same decision that the BCS computers would have if they were in charge of picking the playoff field. The humans released their final ranking on Sunday and put Alabama, Clemson, Ohio State, and Washington into the playoff, in that order, placing Penn State fifth. People who simulate the old BCS algorithms ran the numbers after this year’s championship games … and the only difference was swapping the order of Ohio State and Clemson. The matchups would have been the same whether those computers or these humans decided; Ohio State and Clemson would just have worn different uniforms."}, {"3d9b": "Everything You Need to Know About CFB Championship WeekendPenn State surges to a Big Ten title, Clemson holds off Virginia Tech, students throw footballs into comically large…theringer.com"}, {"1b2c": "Regardless, Penn State would be the odd team out, despite winning the Big Ten championship on Saturday night. The committee’s decision to ultimately rank PSU fifth isn’t hard to understand. Four major conference teams finished with one loss or fewer. There are four playoff spots. Penn State lost two games. In which grade do kids learn that two is bigger than one? Next year, let’s get some kids from that grade to pick the field. Small children could have settled on Alabama, Clemson, Ohio State, and Washington, and it would have been much more adorable."}, {"88e9": "Just because that logic isn’t hard to understand doesn’t mean the decision itself was easy, however. There were a lot of compelling reasons to choose the Nittany Lions. They scheduled strongly in nonconference play; Washington did not. They won the Big Ten; Ohio State did not. They beat Ohio State in football. Committee chair Kirby Hocutt told us that the committee’s job is to select the four best teams. How can the committee say Ohio State is better when it lost to Penn State? In football?"}, {"1979": "Penn State started the season as Nittany Lambs and finished as, oh, no, don’t finish the joke, please don’t finish the stupid j —"}, {"e476": "OK, starting over. Penn State has momentum. It’s a different team than it was during a 2–2 September that put James Franklin on the hot seat. Quarterback Trace McSorley was just some dude back then. Now we know he’s a Bro Wizard who can’t even throw incompletions when he closes his eyes and hurls the ball 47 yards downfield."}, {"d88f": "When the computers made their picks, they ignored these things. They couldn’t understand momentum or a quarterback’s progress. They didn’t care about the value of a conference championship. But when the humans overlook factors that we consider important, it rankles supporters even more. The committee made a conscious decision to leave out Penn State. And in order to do so, it had to choose to overlook things which seem meaningful to many college football fans."}, {"b028": "Washington’s Nonconference Schedule Was Trash! Why Reward a Team That Scheduled So Poorly?"}, {"ff5e": "That’s a fair question. Washington’s nonconference schedule featured Portland State, Idaho, and Rutgers: an FCS team, a team that’s about to be an FCS team, and a team that probably should be an FCS team but is instead a Big Ten team. Did you know that Rutgers is in the Big Ten, in Penn State’s very division?"}, {"2744": "Confessions of a College Football ConvertA Michigan adopter discovers the sport’s ecstasy — and agonytheringer.com"}, {"1565": "Meanwhile, Penn State scheduled Kent State, Pitt, and Temple in nonconference play. Pitt sneakily registered two of the most impressive wins of the year, beating the Lions and playoff team Clemson, and Temple won 10 games and its conference championship. Washington scheduled weakly and went 3–0 out of conference; Penn State scheduled tougher and went 2–1. There’s that extra loss."}, {"d8cf": "(Getty Images)"}, {"bc51": "But even that kind of head-to-head evaluation is an oversimplification. Penn State played Rutgers, too, in conference play. As a thought experiment, pretend that Penn State’s game against Rutgers was part of the nonconference schedule and that the Pitt matchup was a league game. (I am a Big Ten sports fan, please let me kick Rutgers out of the league, even in my imagination.) In that case, PSU’s and Washington’s nonconference schedules would look kind of similar. Don’t forget, Idaho won eight games!"}, {"5894": "Penn State played seven teams that finished above .500 and two teams that went 6–6. Washington played six teams that finished above .500 and two 5–7 teams. Penn State played five teams that finished in the final selection committee top 25; Washington played four. Is Penn State’s real, but slight strength of schedule advantage enough to justify an extra loss? The committee didn’t think so. It was as simple as that."}, {"e937": "Sunday’s post-rankings angst wasn’t limited to the Penn State vs. Washington debate, of course, because the Lions also got left out in favor of another Big Ten team, Ohio State."}, {"c820": "But Don’t Conference Titles Mean Anything Anymore?"}, {"d406": "Focusing too heavily on conference titles removes meaning from a quarter of the games teams play — the nonconference contests we were just talking about. Penn State happened to lose one of those games, while Ohio State didn’t despite playing tougher opponents, including Oklahoma, a top-10 team for much of the year. What’s more, even a conference record can be misleading: Since the Big Ten is an unwieldy mechaconference with heavily unbalanced divisions and random intradivisional scheduling, the Buckeyes played the two best teams in the Big Ten West while the Nittany Lions played the third- and fourth-best during the regular season. They ended up with the exact same record in conference play."}, {"9459": "Our conference identities are hardwired into our brains: We aren’t college football people, but rather Big Ten People and SEC People and ACC People. For so many decades, winning a league title was the most important thing. But the sport is different now. Rutgers people don’t really have anything in common with Nebraska people, and just because two teams are in the same conference doesn’t mean the one that wins the league is better."}, {"d2be": "The Alabama Dynasty Blocker Power RankingsIf you want the Tide to fizzle, root for these contenderstheringer.com"}, {"ddc9": "Those who believe Penn State got slighted aren’t just pointing to the conference title, though."}, {"b002": "If We’re Ignoring Head-to-Head, Why Even Bother Playing the Games?"}, {"64d4": "Well, they play the games because they’re important. Ohio State lost fewer of them than Penn State. Yes, Penn State beat Ohio State, but if you’re asking “why even bother playing the games” because you want everybody to emphasize one game over 11 other games, you need to rethink logic a little bit."}, {"e736": "We all understand the concept that the better team does not always win the game. We know that the 14-seed beating the 3-seed in the NCAA tourney does not mean the 14-seed was actually better. Often, we watch sports not because we want to find out who is better, but because we want to see if a single day’s snippet of events might feature a ridiculous result."}, {"6f4e": "Penn State’s win over Ohio State was a ridiculous result. It was a home game featuring an absurd finish, a slew of OSU special teams snafus, and a field goal block returned for a game-winning touchdown. It left us with the feeling that we had seen something extraordinary — by which I mean, not ordinary — partially because we knew that if we saw the same teams play again, the same thing probably wouldn’t happen."}, {"8987": "Similarly, Penn State’s Big Ten title win was amazing to watch. It was a microcosm of their season. Their year started out badly, and so did many of their games. But they rallied back against Ohio State, and Michigan State, and Indiana, and Wisconsin, and now look at them."}, {"9893": "And That Momentum Means Nothing?"}, {"a487": "Certainly, nobody is talking about Washington’s momentum. That’s because the Huskies played their conference title game on Friday night instead of Saturday, and ground Colorado into bison burgers."}, {"505d": "Penn State’s signature wins were later, and flashier, and since we’re distracted by shiny things and things we just saw, we think they should matter. But that doesn’t make Penn State the better team."}, {"11c4": "So Where Does That Leave Us?"}, {"9c92": "Settling on this final four wasn’t the toughest decision the committee has ever had to make. That came in 2014, when there were six major conference teams with zero or one loss, forcing the committee to pick between teams with nearly identical résumés."}, {"fe75": "This time, it was much easier. But to reach the simplest conclusion, the committee had to do something hard: ignore Penn State’s captivating case — things a computer would never see, but a human could fall in love with."}, {"1ee9": "The committee supposedly uses head-to-head wins and conference titles as tiebreakers for teams it considers evenly matched at the end of the year. It’s important that those factors are tiebreakers, and not overall determinants of team worth. It might not sit with all fans, but it’s what makes sense."}, {"c408": "The good news is that all of the things that made Penn State’s season captivating actually happened. The Nittany Lions really did go from 2–2 to 11–2. They really did beat Ohio State on a blocked kick returned for a touchdown, and they really did storm the field. This is real:"}, {"04ee": "By choosing Ohio State and Washington instead, the committee didn’t say that those things don’t matter. Even if it had tried, no Penn State fan would listen. The committee doesn’t have the ability to reach into hearts and excavate that joy. All it did was say that those moments weren’t enough to make Penn State one of the best four teams in football. Looking at the five teams, it was the right call."}, {"c95f": "Plus, it’s not all bad news. The Nittany Lions get to play in the damn Rose Bowl. They’ll have a parade, and palm trees, and they’ll get to see the sun basking the stadium in a rich glow as it dips below the Southern California hills."}, {"d111": "Meanwhile, Washington made it to the most important part of the football season and now has to play Alabama. Good luck with that. It’s a hell of a prize, and I mean that literally."}], "author": "Rodger Sherman", "child": "1665_1\t1665_2\t1665_3\t1665_4\t1665_5\t1665_6\t1665_7\t1665_8\t1665_9\t1665_10\t1665_11\t1665_12\t1665_13\t1665_14\t1665_15\t1665_16\t1665_17\t1665_18\t1665_19\t1665_20", "name": "1665", "content": "The College Football Playoff Committee Got It Right Penn State’s omission raises numerous valid questions about human error and what matters most in the playoff age. That doesn’t mean picking Ohio State and Washington instead was wrong. College football fans didn’t like when computers picked the teams that got to participate in the BCS title game. It was a rigid system that often generated frustrating results. Most of us were happy when the sport adopted the College Football Playoff, both because it meant widening the field of title hopefuls from two teams to four, and because it meant swapping out those damn formulas for a selection committee populated by rational beings. But the committee presents its own worries. Humans can flip-flop. Humans can talk themselves into bad choices. Humans can be biased. Humans can decide the wrong criteria are important. Instead of cold, emotionless numbers, we’re now presented with committee chair Kirby Hocutt, who explains the committee’s justifications for its decisions. And sometimes, those decisions seem wrong. This year, the people on the selection committee made pretty much the same decision that the BCS computers would have if they were in charge of picking the playoff field. The humans released their final ranking on Sunday and put Alabama, Clemson, Ohio State, and Washington into the playoff, in that order, placing Penn State fifth. People who simulate the old BCS algorithms ran the numbers after this year’s championship games … and the only difference was swapping the order of Ohio State and Clemson. The matchups would have been the same whether those computers or these humans decided; Ohio State and Clemson would just have worn different uniforms. Everything You Need to Know About CFB Championship WeekendPenn State surges to a Big Ten title, Clemson holds off Virginia Tech, students throw footballs into comically large…theringer.com Regardless, Penn State would be the odd team out, despite winning the Big Ten championship on Saturday night. The committee’s decision to ultimately rank PSU fifth isn’t hard to understand. Four major conference teams finished with one loss or fewer. There are four playoff spots. Penn State lost two games. In which grade do kids learn that two is bigger than one? Next year, let’s get some kids from that grade to pick the field. Small children could have settled on Alabama, Clemson, Ohio State, and Washington, and it would have been much more adorable. Just because that logic isn’t hard to understand doesn’t mean the decision itself was easy, however. There were a lot of compelling reasons to choose the Nittany Lions. They scheduled strongly in nonconference play; Washington did not. They won the Big Ten; Ohio State did not. They beat Ohio State in football. Committee chair Kirby Hocutt told us that the committee’s job is to select the four best teams. How can the committee say Ohio State is better when it lost to Penn State? In football? Penn State started the season as Nittany Lambs and finished as, oh, no, don’t finish the joke, please don’t finish the stupid j — OK, starting over. Penn State has momentum. It’s a different team than it was during a 2–2 September that put James Franklin on the hot seat. Quarterback Trace McSorley was just some dude back then. Now we know he’s a Bro Wizard who can’t even throw incompletions when he closes his eyes and hurls the ball 47 yards downfield. When the computers made their picks, they ignored these things. They couldn’t understand momentum or a quarterback’s progress. They didn’t care about the value of a conference championship. But when the humans overlook factors that we consider important, it rankles supporters even more. The committee made a conscious decision to leave out Penn State. And in order to do so, it had to choose to overlook things which seem meaningful to many college football fans. Washington’s Nonconference Schedule Was Trash! Why Reward a Team That Scheduled So Poorly? That’s a fair question. Washington’s nonconference schedule featured Portland State, Idaho, and Rutgers: an FCS team, a team that’s about to be an FCS team, and a team that probably should be an FCS team but is instead a Big Ten team. Did you know that Rutgers is in the Big Ten, in Penn State’s very division? Confessions of a College Football ConvertA Michigan adopter discovers the sport’s ecstasy — and agonytheringer.com Meanwhile, Penn State scheduled Kent State, Pitt, and Temple in nonconference play. Pitt sneakily registered two of the most impressive wins of the year, beating the Lions and playoff team Clemson, and Temple won 10 games and its conference championship. Washington scheduled weakly and went 3–0 out of conference; Penn State scheduled tougher and went 2–1. There’s that extra loss. (Getty Images) But even that kind of head-to-head evaluation is an oversimplification. Penn State played Rutgers, too, in conference play. As a thought experiment, pretend that Penn State’s game against Rutgers was part of the nonconference schedule and that the Pitt matchup was a league game. (I am a Big Ten sports fan, please let me kick Rutgers out of the league, even in my imagination.) In that case, PSU’s and Washington’s nonconference schedules would look kind of similar. Don’t forget, Idaho won eight games! Penn State played seven teams that finished above .500 and two teams that went 6–6. Washington played six teams that finished above .500 and two 5–7 teams. Penn State played five teams that finished in the final selection committee top 25; Washington played four. Is Penn State’s real, but slight strength of schedule advantage enough to justify an extra loss? The committee didn’t think so. It was as simple as that. Sunday’s post-rankings angst wasn’t limited to the Penn State vs. Washington debate, of course, because the Lions also got left out in favor of another Big Ten team, Ohio State. But Don’t Conference Titles Mean Anything Anymore? Focusing too heavily on conference titles removes meaning from a quarter of the games teams play — the nonconference contests we were just talking about. Penn State happened to lose one of those games, while Ohio State didn’t despite playing tougher opponents, including Oklahoma, a top-10 team for much of the year. What’s more, even a conference record can be misleading: Since the Big Ten is an unwieldy mechaconference with heavily unbalanced divisions and random intradivisional scheduling, the Buckeyes played the two best teams in the Big Ten West while the Nittany Lions played the third- and fourth-best during the regular season. They ended up with the exact same record in conference play. Our conference identities are hardwired into our brains: We aren’t college football people, but rather Big Ten People and SEC People and ACC People. For so many decades, winning a league title was the most important thing. But the sport is different now. Rutgers people don’t really have anything in common with Nebraska people, and just because two teams are in the same conference doesn’t mean the one that wins the league is better. The Alabama Dynasty Blocker Power RankingsIf you want the Tide to fizzle, root for these contenderstheringer.com Those who believe Penn State got slighted aren’t just pointing to the conference title, though. If We’re Ignoring Head-to-Head, Why Even Bother Playing the Games? Well, they play the games because they’re important. Ohio State lost fewer of them than Penn State. Yes, Penn State beat Ohio State, but if you’re asking “why even bother playing the games” because you want everybody to emphasize one game over 11 other games, you need to rethink logic a little bit. We all understand the concept that the better team does not always win the game. We know that the 14-seed beating the 3-seed in the NCAA tourney does not mean the 14-seed was actually better. Often, we watch sports not because we want to find out who is better, but because we want to see if a single day’s snippet of events might feature a ridiculous result. Penn State’s win over Ohio State was a ridiculous result. It was a home game featuring an absurd finish, a slew of OSU special teams snafus, and a field goal block returned for a game-winning touchdown. It left us with the feeling that we had seen something extraordinary — by which I mean, not ordinary — partially because we knew that if we saw the same teams play again, the same thing probably wouldn’t happen. Similarly, Penn State’s Big Ten title win was amazing to watch. It was a microcosm of their season. Their year started out badly, and so did many of their games. But they rallied back against Ohio State, and Michigan State, and Indiana, and Wisconsin, and now look at them. And That Momentum Means Nothing? Certainly, nobody is talking about Washington’s momentum. That’s because the Huskies played their conference title game on Friday night instead of Saturday, and ground Colorado into bison burgers. Penn State’s signature wins were later, and flashier, and since we’re distracted by shiny things and things we just saw, we think they should matter. But that doesn’t make Penn State the better team. So Where Does That Leave Us? Settling on this final four wasn’t the toughest decision the committee has ever had to make. That came in 2014, when there were six major conference teams with zero or one loss, forcing the committee to pick between teams with nearly identical résumés. This time, it was much easier. But to reach the simplest conclusion, the committee had to do something hard: ignore Penn State’s captivating case — things a computer would never see, but a human could fall in love with. The committee supposedly uses head-to-head wins and conference titles as tiebreakers for teams it considers evenly matched at the end of the year. It’s important that those factors are tiebreakers, and not overall determinants of team worth. It might not sit with all fans, but it’s what makes sense. The good news is that all of the things that made Penn State’s season captivating actually happened. The Nittany Lions really did go from 2–2 to 11–2. They really did beat Ohio State on a blocked kick returned for a touchdown, and they really did storm the field. This is real: By choosing Ohio State and Washington instead, the committee didn’t say that those things don’t matter. Even if it had tried, no Penn State fan would listen. The committee doesn’t have the ability to reach into hearts and excavate that joy. All it did was say that those moments weren’t enough to make Penn State one of the best four teams in football. Looking at the five teams, it was the right call. Plus, it’s not all bad news. The Nittany Lions get to play in the damn Rose Bowl. They’ll have a parade, and palm trees, and they’ll get to see the sun basking the stadium in a rich glow as it dips below the Southern California hills. Meanwhile, Washington made it to the most important part of the football season and now has to play Alabama. Good luck with that. It’s a hell of a prize, and I mean that literally. "}