{"parent": "", "timestamp": "Nov 16, 2016", "title": "At Least We Know Bama’s In", "sentences": [{"6316": "At Least We Know Bama’s In"}, {"bffd": "The College Football Playoff selection committee is likely to face some tough decisions come early December, but this week’s rankings don’t tell us much about where things will end up"}, {"c8eb": "Perhaps nothing speaks to college football’s need for excess like the selection committee’s weekly rankings. All the committee needs to do is decide which four teams make the College Football Playoff. This could probably be accomplished with the thoughtfulness and skill required by four or five people in a day or two in December. Instead, a group of 12 people meets to compose a ranking of the top 25 teams in the country every week from late October onward."}, {"01ef": "I’m pretty sure the reason for these weekly rankings is just to get everybody talking about college football and to stir up commotion, but hypothetically, the rankings exist to provide transparency and a glimpse into what factors the committee values."}, {"afa1": "Except the weekly rankings don’t even do that. Never forget the still-unexplained twist from the end of the 2014 season. TCU was ranked third heading into the final week of the season and then beat Iowa State, 55–3. But in the final rankings, the Horned Frogs fell to sixth. They went from having a cushion to not even being next in line. The rankings were justifiable in a vacuum, but it’s tough to argue that three teams deserved to jump TCU after their last game."}, {"ed6b": "Even on a week-to-week basis, the committee tends to be rather inconsistent. Take Tuesday night’s release. Coming in, we had little idea how these rankings would shake out after a chaotic week in which three of the top four teams in the country lost. Alabama staying at the top was the only sure thing."}, {"f98b": "Chaos Steps into the College Football Playoff PictureWith three big losses among the top 4, unlikely teams could sneak into the Playofftheringer.com"}, {"974e": "Clemson remained in the top four after its loss on a last-second field goal to 6–4 Pitt, which makes sense. It’s smart that the committee didn’t overreact by putting a worse team with a more distant loss ahead of the Tigers. But the Tigers did fall behind Michigan, which did not drop at all after its loss on a last-second field goal to 6–4 Iowa. How did those nearly identical results tell the committee that Michigan is now a better team than Clemson? Yes, Clemson’s loss was at home (embarrassing!) and Michigan’s loss was on the road (understandable!). And yes, it’s entirely valid to see Michigan as the better team. But did the home/road difference between those nearly identical losses really flip the committee’s opinions of each team’s quality in Michigan’s favor?"}, {"0dc6": "The committee’s official protocol implies that each week is an entirely new ranking started from scratch rather than an adjustment of the previous week’s ranking, which is how it should be done, I suppose. But if that’s true, why bother making rankings all year long instead of just starting when necessary?"}, {"4dcc": "Clemson Made Its Easy Path to the Playoff HarderPitt pulled off the upset, and now the ACC hierarchy is in questiontheringer.com"}, {"238f": "If we’re to take this week’s rankings as a reasonable predictor of the final rankings, the committee punted Tuesday, essentially saying, “We’re waiting for the season to play itself out.” The committee placed Ohio State and Michigan in the top four, even though one must lose when the teams play in two weeks. The committee put Louisville, who will likely miss the ACC championship game, above teams like Washington, Wisconsin, and Penn State, who might leap Louisville if they win their league championships. With two weeks to go, the rankings really told us little about who will appear in the Playoff."}, {"4597": "While the weekly rankings remain totally inscrutable, we do have two things that can help us figure out where this year’s rankings might end up. The first is the committee’s publicly listed set of guidelines, which are “conference championships, strength of schedule, and head-to-head competition.” The second is the two years’ worth of actual decisions made by the committee."}, {"acb4": "So, let’s look at how the committee selected in the past to see where it might be headed in a couple of weeks."}, {"cfa4": "2014"}, {"6ede": "Who Did the Committee Choose?"}, {"6b08": "Alabama, Oregon, Florida State, and Ohio State."}, {"6ebf": "Who Did the Committee Leave Out?"}, {"d0d5": "Baylor and TCU."}, {"df12": "Did the Committee Listen to Its Guidelines?"}, {"fac3": "Yeah. The committee included the four outright champions of major conferences while excluding the Big 12’s co-champions, emphasizing the importance of being a conference champion. That snub likely served as the determining factor in the Big 12’s decision to add a conference title game in future years, even though history shows league championship games tend to eliminate national title contenders with bad losses as often as they promote them. To be fair, the Big 12’s decision will probably earn the conference a lot of money."}, {"c9fd": "And even though they were now ranked fifth and sixth, Baylor’s ranking ahead of TCU reflected the committee’s guideline about head-to-head games. As to why TCU had been ranked higher for much of the season? No clue."}, {"7ab7": "We also learned what the committee means by “strength of schedule.” Ohio State had the worst loss of any of the top six teams, dropping a game to a Virginia Tech team that finished the regular season 6–6. But the Buckeyes had run the gamut of the Big Ten unscathed, and added another quality win by pounding Wisconsin, 59–0, in the Big Ten title game. The bad loss was deemed less important than Ohio State’s generally stronger performance against tougher opponents."}, {"16f6": "The same argument would likely go for Florida State’s no. 3 ranking despite its undefeated season. Alabama and Oregon had played stronger slates, even if they did lose a game apiece, and got the higher ranking."}, {"ee5d": "2015"}, {"998a": "Who Did the Committee Choose?"}, {"0186": "Clemson, Alabama, Michigan State, and Oklahoma."}, {"e2bd": "Who Did the Committee Leave Out?"}, {"9782": "Iowa, Stanford, and Ohio State."}, {"ea30": "Did the Committee Listen to Its Guidelines?"}, {"633d": "I think so."}, {"7903": "Oklahoma had the worst loss of any team here, losing to 5–7 Texas. (Wear that hat, Charlie.) And Michigan State also had a pretty bad loss to sub-.500 Nebraska. Meanwhile, Iowa and Ohio State each had only one loss — both to Michigan State."}, {"5582": "Ohio State and Iowa didn’t have a chance of getting in over Michigan State, which had the conference title and head-to-head wins. But there was a case to be made that OSU had a better résumé and tougher loss than Oklahoma. But the conference title shooed the Sooners in, and it seems like the committee was averse to including a team that had already lost a game to another Playoff participant."}, {"4278": "What Do Those Decisions Mean for This Year?"}, {"4313": "In the first two seasons, despite its midyear weirdness, the committee did a pretty good job of honoring its guidelines."}, {"c25c": "That’s not good news for Louisville, currently ranked fifth. The Cardinals aren’t in line to play in the ACC championship game unless Clemson loses Saturday to Wake Forest. And the exclusion of Iowa and Ohio State last year tells you most of what you need to know. The Cardinals will never beat Clemson with identical records if Clemson has the conference title and the head-to-head edge. And last year’s selection kinda sends the message that the committee frowns upon having a participant that’s already lost to another team in the Playoff, so I doubt Louisville becomes a second ACC team in the final four. It seems likely that Washington hops Louisville if the Huskies win out."}, {"c44f": "One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com"}, {"09a5": "But those are easy decisions, and things could get much trickier. If Washington doesn’t win out, the champion of the Pac-12 will have at least two losses. If Ohio State beats Michigan, and Penn State wins out, the one-loss Buckeyes would watch the two-loss Nittany Lions play in the Big Ten title game. And the Big 12 actually needs a variety of things to happen for one-loss West Virginia to top two-loss Oklahoma in the conference standings."}, {"a67f": "The committee has acted within its guidelines twice, but it hasn’t given us any idea how it would consider a one-loss non-champion against multiple two-loss champions. The guidelines don’t say the committee has to pick champions over non-champions. They merely say that should be used as a tiebreaking factor."}, {"fc7f": "What if the committee believes one-loss Ohio State or one-loss Louisville is truly better than a team that won its league with fewer, less appealing wins? Would the committee choose one-loss Ohio State over two-loss Big Ten champion Penn State, who beat Ohio State head-to-head? My guess is no, based on the way the committee has treated conference champions and head-to-head matchups the two times it’s done this. Would the committee choose one-loss Ohio State over two-loss Big Ten champion Wisconsin, who lost to Ohio State? I … I have no idea."}, {"0cbc": "If things go haywire, we’ll be left making educated guesses over the simpler decisions made the only two times this has ever been done. Understanding how the College Football Playoff committee operates is about as essential to understanding a college football season as knowing the intricacies of the contenders themselves. But despite all the weekly rankings, we’ve never really gotten a consistent idea of what matters to the committee."}, {"69bf": "There is only one thing we know for sure: Alabama will make it. Alabama always makes it."}], "author": "Rodger Sherman", "child": "1667_1\t1667_2", "name": "1667", "content": "At Least We Know Bama’s In The College Football Playoff selection committee is likely to face some tough decisions come early December, but this week’s rankings don’t tell us much about where things will end up Perhaps nothing speaks to college football’s need for excess like the selection committee’s weekly rankings. All the committee needs to do is decide which four teams make the College Football Playoff. This could probably be accomplished with the thoughtfulness and skill required by four or five people in a day or two in December. Instead, a group of 12 people meets to compose a ranking of the top 25 teams in the country every week from late October onward. I’m pretty sure the reason for these weekly rankings is just to get everybody talking about college football and to stir up commotion, but hypothetically, the rankings exist to provide transparency and a glimpse into what factors the committee values. Except the weekly rankings don’t even do that. Never forget the still-unexplained twist from the end of the 2014 season. TCU was ranked third heading into the final week of the season and then beat Iowa State, 55–3. But in the final rankings, the Horned Frogs fell to sixth. They went from having a cushion to not even being next in line. The rankings were justifiable in a vacuum, but it’s tough to argue that three teams deserved to jump TCU after their last game. Even on a week-to-week basis, the committee tends to be rather inconsistent. Take Tuesday night’s release. Coming in, we had little idea how these rankings would shake out after a chaotic week in which three of the top four teams in the country lost. Alabama staying at the top was the only sure thing. Chaos Steps into the College Football Playoff PictureWith three big losses among the top 4, unlikely teams could sneak into the Playofftheringer.com Clemson remained in the top four after its loss on a last-second field goal to 6–4 Pitt, which makes sense. It’s smart that the committee didn’t overreact by putting a worse team with a more distant loss ahead of the Tigers. But the Tigers did fall behind Michigan, which did not drop at all after its loss on a last-second field goal to 6–4 Iowa. How did those nearly identical results tell the committee that Michigan is now a better team than Clemson? Yes, Clemson’s loss was at home (embarrassing!) and Michigan’s loss was on the road (understandable!). And yes, it’s entirely valid to see Michigan as the better team. But did the home/road difference between those nearly identical losses really flip the committee’s opinions of each team’s quality in Michigan’s favor? The committee’s official protocol implies that each week is an entirely new ranking started from scratch rather than an adjustment of the previous week’s ranking, which is how it should be done, I suppose. But if that’s true, why bother making rankings all year long instead of just starting when necessary? Clemson Made Its Easy Path to the Playoff HarderPitt pulled off the upset, and now the ACC hierarchy is in questiontheringer.com If we’re to take this week’s rankings as a reasonable predictor of the final rankings, the committee punted Tuesday, essentially saying, “We’re waiting for the season to play itself out.” The committee placed Ohio State and Michigan in the top four, even though one must lose when the teams play in two weeks. The committee put Louisville, who will likely miss the ACC championship game, above teams like Washington, Wisconsin, and Penn State, who might leap Louisville if they win their league championships. With two weeks to go, the rankings really told us little about who will appear in the Playoff. While the weekly rankings remain totally inscrutable, we do have two things that can help us figure out where this year’s rankings might end up. The first is the committee’s publicly listed set of guidelines, which are “conference championships, strength of schedule, and head-to-head competition.” The second is the two years’ worth of actual decisions made by the committee. So, let’s look at how the committee selected in the past to see where it might be headed in a couple of weeks. 2014 Who Did the Committee Choose? Alabama, Oregon, Florida State, and Ohio State. Who Did the Committee Leave Out? Baylor and TCU. Did the Committee Listen to Its Guidelines? Yeah. The committee included the four outright champions of major conferences while excluding the Big 12’s co-champions, emphasizing the importance of being a conference champion. That snub likely served as the determining factor in the Big 12’s decision to add a conference title game in future years, even though history shows league championship games tend to eliminate national title contenders with bad losses as often as they promote them. To be fair, the Big 12’s decision will probably earn the conference a lot of money. And even though they were now ranked fifth and sixth, Baylor’s ranking ahead of TCU reflected the committee’s guideline about head-to-head games. As to why TCU had been ranked higher for much of the season? No clue. We also learned what the committee means by “strength of schedule.” Ohio State had the worst loss of any of the top six teams, dropping a game to a Virginia Tech team that finished the regular season 6–6. But the Buckeyes had run the gamut of the Big Ten unscathed, and added another quality win by pounding Wisconsin, 59–0, in the Big Ten title game. The bad loss was deemed less important than Ohio State’s generally stronger performance against tougher opponents. The same argument would likely go for Florida State’s no. 3 ranking despite its undefeated season. Alabama and Oregon had played stronger slates, even if they did lose a game apiece, and got the higher ranking. 2015 Who Did the Committee Choose? Clemson, Alabama, Michigan State, and Oklahoma. Who Did the Committee Leave Out? Iowa, Stanford, and Ohio State. Did the Committee Listen to Its Guidelines? I think so. Oklahoma had the worst loss of any team here, losing to 5–7 Texas. (Wear that hat, Charlie.) And Michigan State also had a pretty bad loss to sub-.500 Nebraska. Meanwhile, Iowa and Ohio State each had only one loss — both to Michigan State. Ohio State and Iowa didn’t have a chance of getting in over Michigan State, which had the conference title and head-to-head wins. But there was a case to be made that OSU had a better résumé and tougher loss than Oklahoma. But the conference title shooed the Sooners in, and it seems like the committee was averse to including a team that had already lost a game to another Playoff participant. What Do Those Decisions Mean for This Year? In the first two seasons, despite its midyear weirdness, the committee did a pretty good job of honoring its guidelines. That’s not good news for Louisville, currently ranked fifth. The Cardinals aren’t in line to play in the ACC championship game unless Clemson loses Saturday to Wake Forest. And the exclusion of Iowa and Ohio State last year tells you most of what you need to know. The Cardinals will never beat Clemson with identical records if Clemson has the conference title and the head-to-head edge. And last year’s selection kinda sends the message that the committee frowns upon having a participant that’s already lost to another team in the Playoff, so I doubt Louisville becomes a second ACC team in the final four. It seems likely that Washington hops Louisville if the Huskies win out. One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com But those are easy decisions, and things could get much trickier. If Washington doesn’t win out, the champion of the Pac-12 will have at least two losses. If Ohio State beats Michigan, and Penn State wins out, the one-loss Buckeyes would watch the two-loss Nittany Lions play in the Big Ten title game. And the Big 12 actually needs a variety of things to happen for one-loss West Virginia to top two-loss Oklahoma in the conference standings. The committee has acted within its guidelines twice, but it hasn’t given us any idea how it would consider a one-loss non-champion against multiple two-loss champions. The guidelines don’t say the committee has to pick champions over non-champions. They merely say that should be used as a tiebreaking factor. What if the committee believes one-loss Ohio State or one-loss Louisville is truly better than a team that won its league with fewer, less appealing wins? Would the committee choose one-loss Ohio State over two-loss Big Ten champion Penn State, who beat Ohio State head-to-head? My guess is no, based on the way the committee has treated conference champions and head-to-head matchups the two times it’s done this. Would the committee choose one-loss Ohio State over two-loss Big Ten champion Wisconsin, who lost to Ohio State? I … I have no idea. If things go haywire, we’ll be left making educated guesses over the simpler decisions made the only two times this has ever been done. Understanding how the College Football Playoff committee operates is about as essential to understanding a college football season as knowing the intricacies of the contenders themselves. But despite all the weekly rankings, we’ve never really gotten a consistent idea of what matters to the committee. There is only one thing we know for sure: Alabama will make it. Alabama always makes it. "}