{"parent": "", "timestamp": "Nov 7, 2016", "title": "Thad Matta Has Found His Spark", "sentences": [{"47ff": "Thad Matta Has Found His Spark"}, {"7bfa": "Once considered a top young coach, the longtime Ohio State leader has seen his reputation take a hit in recent seasons. Now, he’s returning to his roots and looking to accomplish the one thing that’s always eluded him."}, {"d6c4": "In October 2006, Thad Matta had a chance to be part of something great, and he knew it. Then 39, he was set to enter his third season as Ohio State’s head basketball coach, and he’d already developed a reputation as one of the brightest young minds in the game. In the 2004–05 campaign, his Buckeyes had notched a last-second win over previously undefeated Illinois in the regular-season finale; in 2005–06, Matta took a team that came into November unranked and led it to an outright Big Ten title."}, {"15ad": "The 2006–07 season was different, though. Armed with the best recruiting class in school history — Greg Oden, Mike Conley, Daequan Cook, David Lighty, and junior college transfer Othello Hunter — Ohio State seemed poised to use its previous two seasons as stepping stones to bigger things. Matta was in uncharted territory. He had reached this point by getting the most out of underdog, veteran-laden teams. How would he handle a roster that not only had sky-high expectations, but also was the youngest he’d ever coached?"}, {"d9c7": "By being a goofball, of course. I was a freshman walk-on on that 2006–07 team, and when Matta wasn’t impersonating Will Ferrell characters or telling raunchy jokes during team meetings, he was joining Ohio State players in drills or diving on the floor for loose balls in practice. The night before the third-ranked Buckeyes visited no. 7 North Carolina that November, Matta decided to forgo one last film session; instead, he surprised his team by screening the meatloaf scene from Wedding Crashers."}, {"1487": "As the outside pressure to win rose to unprecedented heights, Matta’s playful attitude rose with it. The Buckeyes finished that campaign 35–4, won the Big Ten regular-season and tournament titles, and saw the school’s longest NCAA tournament run in 45 years end with a loss to Florida in the national championship. While the program had to endure a bit of a rebuild the following season when Oden, Conley, and Cook left for the NBA, the foundation had been laid, and the next wave of recruits took notice. By April 2013, Matta had rattled off the most successful eight-year stretch in Ohio State basketball history: five Big Ten regular-season titles, five Sweet 16 berths, four Big Ten tournament titles, two Final Fours, three AP first-team All-Americans, seven first-round NBA draft picks, and six 25-win seasons."}, {"e937": "The Villanova Championship Ripple EffectKris Jenkins’s 3-point buzzer-beater did more than just hand the Wildcats last season’s national titletheringer.com"}, {"f90b": "Nearly 10 years after his first Final Four run, though, the man who was once praised as one of college basketball’s great young coaches isn’t so young anymore. Some would argue the “great” part in “great young coach” no longer applies, either. A streak of four straight Sweet 16 appearances has been replaced by a streak of three straight Sweet 16 absences. The Buckeyes have fallen in the Big Ten standings in each of the past three years — from fifth to sixth to seventh — with last season’s team and its second-round NIT exit earning the distinction as the worst group Matta has ever coached."}, {"e693": "What little is left of the hair Matta used to comb in various directions to cover his bald spots has turned gray. The diving on the floor in practice has stopped following a botched back surgery that left the now-49-year-old without the full use of his right foot, causing him to walk with a limp. Ohio State isn’t expected to contend for the Big Ten championship this season, let alone the national championship, which is an uneasy feeling for the growing number of Buckeyes fans who wonder if Matta’s best days are behind him."}, {"40f9": "Matta’s youth is gone, his unwavering support is gone, and the carefree attitude that made coaching so much fun for him appears to be gone too. So why is he more excited for this season than almost any other that he can remember?"}, {"5738": "Matta is a throwback in the world of college basketball coaching. He’s a player’s coach who rarely makes his guys run sprints and who yells so infrequently that it borders on comical in the few instances when he does blow a gasket. Outside of that, though, the man is as old-school as they come. He’s made defense and possession the cornerstones of his program. He stresses “doing things the right way” and says the extraneous duties that come with the job are of little interest to him. Ask Matta why he coaches and he’ll respond with a time-tested cliché, one he’s probably carried with him from his first head job, at Butler in 2000–01, to his stint at Xavier, from 2001–04, to his current gig at Ohio State: His motivation is to “make our guys better and more productive people.”"}, {"d471": "“I still love bringing a group of guys together for a common goal,” Matta says. “Part of that is that it’s much, much harder to do now because everybody has individualistic ideas about the game of basketball. But that’s what I love. You know, yesterday in practice we’re drilling over and over on Euro dribble handoffs. The first time we run it in a scrimmage, we get a dunk, and I’m like, ‘FUCK YEAH!’ That’s why I do this. It’s the learning.”"}, {"b83f": "Getty Images"}, {"64ae": "That learning, more than anything, explains his excitement for this year’s Buckeyes team. To a casual observer, Ohio State basketball looks like a mess, as it’s coming off an awful 2015–16 campaign that was followed by an offseason in which seemingly half the team (including assistant Jeff Boals, who is now the head coach at Stony Brook) left. The Buckeyes finished just 21–14, then lost all but one player from their 2015 recruiting class, as forward Mickey Mitchell, center Daniel Giddens, and guards A.J. Harris and Austin Grandstaff all transferred. But Matta sees something special in his returning core of JaQuan Lyle, Marc Loving, Keita Bates-Diop, Jae’Sean Tate, Trevor Thompson, and Kam Williams — a group that he believes ran into problems last year because of inexperience more than lack of talent. He also says the newcomers to the program “fit the puzzle better than the pieces that we lost last year.” Most notable among them: freshman Micah Potter, a 6-foot-9 ball of energy who figures to be the first true stretch 4 Matta has ever coached and whose potential has those around the team foaming at the mouth."}, {"26bc": "Ohio State has just one senior on its roster (Loving), and for a coach who finds fulfillment in watching guys develop, that youth is a godsend. Bringing back his top six players also has Matta feeling optimistic, especially since he says he is “going back to 2004 and coaching and running this program the way I did back then.” His focus is squarely on reestablishing an Ohio State basketball brand in which pride, chemistry, and toughness are paramount, not on appeasing the growing number of Buckeyes fans who are frustrated that the winningest coach in school history isn’t winning as much as they think he should. The value of not giving a damn what anyone outside of his program thinks is something Matta was forced to learn early in his career."}, {"be36": "“I’ll never forget when I went to Xavier,” Matta says, referring to his move after just one season of experience as a head coach, at Butler. “I was playing golf one day with [then–Xavier athletic director] Mike Bobinski and a guy named Bob Kohlhepp, who was the CEO of Cintas. We finished golfing and we’re sitting there drinking some water, and they said to me, ‘Thad, you do realize that if we don’t get 10,250 people into the Cintas Center every night, the school won’t run.’ And I remember getting in the car like, ‘Hoooooly shit, what did I get myself into?’”"}, {"ad78": "Lorenzo Romar’s Last (Last) ChanceWashington’s coach keeps landing top talent and failing to succeedtheringer.com"}, {"0cc9": "Even if Matta insists that he blocks out the outside noise, doing so has become much more difficult in recent seasons. Maybe years of dealing with the pressure finally caught up to him, and maybe that explains why Matta briefly lost his enthusiasm and carefree approach to the game. David Egelhoff, Ohio State’s director of basketball operations and the only person who has been a part of the program for all of Matta’s tenure in Columbus, has a different theory. He insists that declining health was the biggest factor that led to the coach’s rut."}, {"6b16": "“His health, right now, is the best I’ve seen it,” Egelhoff says. “There were some times there, back when stuff [Matta’s back surgery] first went down in the summer of 2007, and then times after that, especially in 2011, 2012, 2013, and maybe even into 2014, when I thought, ‘I don’t know if I can physically get him back out to the court after halftime.’ After games, he’d lay on the locker-room floor to try to alleviate his pain, and we’d have to literally pick him up to get him standing again. He was that bad. He’s since been able to figure things out. He’s prioritized his life and he’s gotten healthy, and I think it’s made a big difference.”"}, {"cbe7": "Matta, who was an avid distance runner before having surgery, agrees that he’s as close to pain-free as he’s been in a decade, thanks to both regular exercise and a refusal to dwell on things beyond his control. One of those is how much he’s appreciated by Ohio State fans, the most irrational of whom have called for his firing. It seems like this should enrage Matta, who arrived at a football school in 2004, inherited a basketball program in shambles, and has built one of the most successful tenures of any coach in the nation since. He just lets it all roll off his back."}, {"eea3": "“Lou Holtz once told me, ‘Never stay at a school for more than seven years. Because the longer you stay, the more you fall in love with the place and the more they fall out of love with you,’” Matta says. “And I remember in Year [7] at Ohio State, which was the year we started 24–0. I can remember coming off the floor and we’d win by 12 and people would be like, ‘Hey, Thad! 12 points? That’s it?’ And I’m like, ‘Lou was right!’ I can still remember thinking he was on to something. It’s like the old Ricky Nelson song — you can’t please everybody so you gotta please yourself.”"}, {"cd0d": "For all he’s accomplished, there’s one box that Matta has yet to check: win a national championship. It’s something every college coach dreams about, but few ever have an opportunity to make it a reality. Matta has had many chances, yet he’s come up short to varying degrees each time. His 2004 Xavier team was three minutes away from knocking off top-seeded Duke for a trip to the Final Four before Luol Deng, J.J. Redick, and the Blue Devils downed his Musketeers in the waning moments. In 2007, Matta’s Buckeyes lost to Florida in the national championship, a game that he considers the biggest regret in his career, specifically because of his decision to bench Conley in the first half because of foul trouble instead of trusting his freshman point guard. Matta’s 2009–10 team won the Big Ten regular-season and tournament titles, featured national player of the year Evan Turner, and lost to Tennessee by three in the Sweet 16 when Turner’s last-second shot attempt was blocked."}, {"2712": "Getty Images"}, {"8f5d": "The list goes on. The Buckeyes started the 2010–11 campaign 24–0, were ranked no. 1 for a lot of the season, and established themselves as the favorites to win the national championship before Kentucky pulled off a 62–60 upset in the Sweet 16. The following season produced Matta’s second trip to the Final Four, where Ohio State dropped another close game, this time to Kansas, 64–62. In 2013, Matta’s second-seeded Buckeyes fell victim to Wichita State’s Cinderella run in the Elite Eight, as their comeback attempt fell four points short. During the six-year stretch from 2009 to 2014, Matta’s teams averaged 28.3 wins per season, and their tourney trips ended with these results: two-point loss in double overtime, three-point loss, two-point loss, two-point loss, four-point loss, one-point loss."}, {"176b": "Those who know Matta best have speculated for years that a national championship is his white whale and that winning one would be enough to prompt him to retire. He’s conscious of the lingering problems with his foot, and how he’ll look and feel different at 70 than will most of his peers. His two daughters, Ali and Emily, are now in high school, with his oldest set to graduate in the spring. He’s made enough money to last a few lifetimes, and for a man who originally dreamed of becoming a high school coach, he’s enjoyed an astonishing amount of success. It’s easy to envision him walking away should he finally reach the mountaintop, especially given that he’s mentioned his desire to open a beach bar in Mexico and “do nothing all day” so often that it’s become difficult to tell if he’s joking."}, {"5877": "“I don’t have an ‘I’m going to do this until this age’ plan,” Matta says. “I want to do this as long as I possibly can, as long as I’m enjoying what I’m doing. Now, there are days throughout the course of the year when it’s not fun. But it’s the job. I talk to coaches before a game, after a game, or whatever. And we all got the same issues. We’re all worn down and we’re all upset or something, but we’re all thankful for the jobs we have. I just fight the good fight and away I go. The hardest part is that I enjoy what I do. I don’t think I’ve ever worked a day in my life. Some days are harder, but I looove what I’m doing.”"}, {"29ff": "Two years ago, those words would have sounded like a man trying to convince himself that his heart’s still in it. His honeymoon phase at Ohio State was over. His health was in shambles, and he’d lost the three best players — LaQuinton Ross, Aaron Craft, and Lenzelle Smith — from his 2013–14 team, which had been bounced in the first round of the NCAA tournament. Today, though, the statement rings sincere."}, {"e284": "Matta says he feels recharged, for reasons even he can’t quite pinpoint. Maybe it’s his health. Maybe his daughters — the same little girls he vividly remembers wearing Ohio State cheerleading outfits at his introductory press conference in 2004 — being on the verge of adulthood has adjusted his perspective. Maybe he has accomplished enough to stop worrying about proving himself and to simply enjoy the life he’s built. Or maybe the fact that he has stopped wearing a tie on the sideline — something he says he’s been waiting his entire career to have the confidence to pull off — has something to do with it."}, {"5cd3": "“Part of his rejuvenation is that he’s back to coaching basketball instead of dealing with the off-court distractions his recent teams have had,” says Ohio State strength and conditioning coach Dave Richardson, who has been part of the program since Matta’s second season in Columbus. “It’s like a weight has been lifted off his shoulders to have a group of guys that he can just coach without worrying about all the other stuff. He loves basketball and he loves the process of making his team better. But kids don’t seem to love that process like they used to. He’s got a team that does love it, though, and that’s why he’s so excited to come to work every day.”"}, {"eb42": "Perhaps the most notable manifestation of his rejuvenation came a little over a month ago. Despite maintaining a sharp sense of humor behind closed doors, Matta has historically been reserved with his public persona. It’s fair to say, then, that modeling Ohio State’s new uniforms on Twitter in late September was an enormous departure from what he’s typically been willing to let the public see."}, {"5ef8": "Just don’t expect this to be a regular thing. Matta has never had a social media account of any kind and barely, for that matter, even comprehends the concept."}, {"85eb": "“I’ll be honest with you,” Matta says. “I don’t understand that world. When they took the picture, they said, ‘Can we post this?’ I don’t even know what ‘post this’ means. I don’t understand. They’re saying this had so many hits, and I’m like, ‘Explain to me what a hit is.’ I don’t understand. Someone texted me, ‘You’ve now got street cred,’ and I’m like, ‘What is street cred? Who do I have street cred with?’ I had no idea. As soon as it came out, [former Ohio State All-American] D’Angelo [Russell] was texting me and he’s busting my balls. So someone says D’Angelo has 500,000 followers and I’m like, ‘What is a follower?’ So they’re explaining that if he sends that out then 500,000 people see that because they’re linked to him and I’m like, ‘What the fuck is going on here?’”"}, {"6e0c": "It almost feels as if the past few years have served as a transformation chamber for Matta. He stepped into it a young and hungry coach desperate to get his white whale, and he came out an elder statesman excited for the next phase of his career. The white whale still matters, of course, but Matta is more concerned with helping his players accomplish their dreams."}, {"5e60": "“I hope when the time comes,” Matta says, “that people look and say, ‘You know what, he did a hell of a job for this university. He did it the right way, he was true to his players, and he was true to himself.’ And if that’s said, then I’m good. I know I’ve never scored a point. I’ve never gotten a rebound. The players are the ones that built this program. Obviously as a coach you’re directing the ship and pointing it in the right direction and all that stuff. But I didn’t get into this profession to get famous or make money. I got in it because I loved the game of basketball. I loved what I was doing. And I think that’s the lesson in the end — love what you’re doing every day and things will take care of themselves.”"}, {"58ac": "Matta still loves what he’s doing, even if some on the outside struggle to figure out why. Given all the factors in play, it would be hard to blame him if he decided to hang up his whistle at some point in the next few years. And while he might not have the when part of the end of his career figured out, he does have a pretty good idea of what the how will look like."}, {"f6ba": "“I tell my assistants,” he says, “that my goal in life is for someone to come up to them and say, ‘Didn’t you used to work for that Thad Matta guy? Whatever happened to him?’”"}, {"1513": "For now, the beach bar in Mexico will have to wait. Matta has plenty of teaching still in him, with a team he believes is eager to learn. He’s not the same coach or person he was a decade ago, but that’s a good thing. He has a new lease on life and his career, and at long last his health and priorities are in order. Now all that’s left to do is get that white whale."}], "author": "Mark Titus", "child": "1668_1\t1668_2\t1668_3\t1668_4", "name": "1668", "content": "Thad Matta Has Found His Spark Once considered a top young coach, the longtime Ohio State leader has seen his reputation take a hit in recent seasons. Now, he’s returning to his roots and looking to accomplish the one thing that’s always eluded him. In October 2006, Thad Matta had a chance to be part of something great, and he knew it. Then 39, he was set to enter his third season as Ohio State’s head basketball coach, and he’d already developed a reputation as one of the brightest young minds in the game. In the 2004–05 campaign, his Buckeyes had notched a last-second win over previously undefeated Illinois in the regular-season finale; in 2005–06, Matta took a team that came into November unranked and led it to an outright Big Ten title. The 2006–07 season was different, though. Armed with the best recruiting class in school history — Greg Oden, Mike Conley, Daequan Cook, David Lighty, and junior college transfer Othello Hunter — Ohio State seemed poised to use its previous two seasons as stepping stones to bigger things. Matta was in uncharted territory. He had reached this point by getting the most out of underdog, veteran-laden teams. How would he handle a roster that not only had sky-high expectations, but also was the youngest he’d ever coached? By being a goofball, of course. I was a freshman walk-on on that 2006–07 team, and when Matta wasn’t impersonating Will Ferrell characters or telling raunchy jokes during team meetings, he was joining Ohio State players in drills or diving on the floor for loose balls in practice. The night before the third-ranked Buckeyes visited no. 7 North Carolina that November, Matta decided to forgo one last film session; instead, he surprised his team by screening the meatloaf scene from Wedding Crashers. As the outside pressure to win rose to unprecedented heights, Matta’s playful attitude rose with it. The Buckeyes finished that campaign 35–4, won the Big Ten regular-season and tournament titles, and saw the school’s longest NCAA tournament run in 45 years end with a loss to Florida in the national championship. While the program had to endure a bit of a rebuild the following season when Oden, Conley, and Cook left for the NBA, the foundation had been laid, and the next wave of recruits took notice. By April 2013, Matta had rattled off the most successful eight-year stretch in Ohio State basketball history: five Big Ten regular-season titles, five Sweet 16 berths, four Big Ten tournament titles, two Final Fours, three AP first-team All-Americans, seven first-round NBA draft picks, and six 25-win seasons. The Villanova Championship Ripple EffectKris Jenkins’s 3-point buzzer-beater did more than just hand the Wildcats last season’s national titletheringer.com Nearly 10 years after his first Final Four run, though, the man who was once praised as one of college basketball’s great young coaches isn’t so young anymore. Some would argue the “great” part in “great young coach” no longer applies, either. A streak of four straight Sweet 16 appearances has been replaced by a streak of three straight Sweet 16 absences. The Buckeyes have fallen in the Big Ten standings in each of the past three years — from fifth to sixth to seventh — with last season’s team and its second-round NIT exit earning the distinction as the worst group Matta has ever coached. What little is left of the hair Matta used to comb in various directions to cover his bald spots has turned gray. The diving on the floor in practice has stopped following a botched back surgery that left the now-49-year-old without the full use of his right foot, causing him to walk with a limp. Ohio State isn’t expected to contend for the Big Ten championship this season, let alone the national championship, which is an uneasy feeling for the growing number of Buckeyes fans who wonder if Matta’s best days are behind him. Matta’s youth is gone, his unwavering support is gone, and the carefree attitude that made coaching so much fun for him appears to be gone too. So why is he more excited for this season than almost any other that he can remember? Matta is a throwback in the world of college basketball coaching. He’s a player’s coach who rarely makes his guys run sprints and who yells so infrequently that it borders on comical in the few instances when he does blow a gasket. Outside of that, though, the man is as old-school as they come. He’s made defense and possession the cornerstones of his program. He stresses “doing things the right way” and says the extraneous duties that come with the job are of little interest to him. Ask Matta why he coaches and he’ll respond with a time-tested cliché, one he’s probably carried with him from his first head job, at Butler in 2000–01, to his stint at Xavier, from 2001–04, to his current gig at Ohio State: His motivation is to “make our guys better and more productive people.” “I still love bringing a group of guys together for a common goal,” Matta says. “Part of that is that it’s much, much harder to do now because everybody has individualistic ideas about the game of basketball. But that’s what I love. You know, yesterday in practice we’re drilling over and over on Euro dribble handoffs. The first time we run it in a scrimmage, we get a dunk, and I’m like, ‘FUCK YEAH!’ That’s why I do this. It’s the learning.” Getty Images That learning, more than anything, explains his excitement for this year’s Buckeyes team. To a casual observer, Ohio State basketball looks like a mess, as it’s coming off an awful 2015–16 campaign that was followed by an offseason in which seemingly half the team (including assistant Jeff Boals, who is now the head coach at Stony Brook) left. The Buckeyes finished just 21–14, then lost all but one player from their 2015 recruiting class, as forward Mickey Mitchell, center Daniel Giddens, and guards A.J. Harris and Austin Grandstaff all transferred. But Matta sees something special in his returning core of JaQuan Lyle, Marc Loving, Keita Bates-Diop, Jae’Sean Tate, Trevor Thompson, and Kam Williams — a group that he believes ran into problems last year because of inexperience more than lack of talent. He also says the newcomers to the program “fit the puzzle better than the pieces that we lost last year.” Most notable among them: freshman Micah Potter, a 6-foot-9 ball of energy who figures to be the first true stretch 4 Matta has ever coached and whose potential has those around the team foaming at the mouth. Ohio State has just one senior on its roster (Loving), and for a coach who finds fulfillment in watching guys develop, that youth is a godsend. Bringing back his top six players also has Matta feeling optimistic, especially since he says he is “going back to 2004 and coaching and running this program the way I did back then.” His focus is squarely on reestablishing an Ohio State basketball brand in which pride, chemistry, and toughness are paramount, not on appeasing the growing number of Buckeyes fans who are frustrated that the winningest coach in school history isn’t winning as much as they think he should. The value of not giving a damn what anyone outside of his program thinks is something Matta was forced to learn early in his career. “I’ll never forget when I went to Xavier,” Matta says, referring to his move after just one season of experience as a head coach, at Butler. “I was playing golf one day with [then–Xavier athletic director] Mike Bobinski and a guy named Bob Kohlhepp, who was the CEO of Cintas. We finished golfing and we’re sitting there drinking some water, and they said to me, ‘Thad, you do realize that if we don’t get 10,250 people into the Cintas Center every night, the school won’t run.’ And I remember getting in the car like, ‘Hoooooly shit, what did I get myself into?’” Lorenzo Romar’s Last (Last) ChanceWashington’s coach keeps landing top talent and failing to succeedtheringer.com Even if Matta insists that he blocks out the outside noise, doing so has become much more difficult in recent seasons. Maybe years of dealing with the pressure finally caught up to him, and maybe that explains why Matta briefly lost his enthusiasm and carefree approach to the game. David Egelhoff, Ohio State’s director of basketball operations and the only person who has been a part of the program for all of Matta’s tenure in Columbus, has a different theory. He insists that declining health was the biggest factor that led to the coach’s rut. “His health, right now, is the best I’ve seen it,” Egelhoff says. “There were some times there, back when stuff [Matta’s back surgery] first went down in the summer of 2007, and then times after that, especially in 2011, 2012, 2013, and maybe even into 2014, when I thought, ‘I don’t know if I can physically get him back out to the court after halftime.’ After games, he’d lay on the locker-room floor to try to alleviate his pain, and we’d have to literally pick him up to get him standing again. He was that bad. He’s since been able to figure things out. He’s prioritized his life and he’s gotten healthy, and I think it’s made a big difference.” Matta, who was an avid distance runner before having surgery, agrees that he’s as close to pain-free as he’s been in a decade, thanks to both regular exercise and a refusal to dwell on things beyond his control. One of those is how much he’s appreciated by Ohio State fans, the most irrational of whom have called for his firing. It seems like this should enrage Matta, who arrived at a football school in 2004, inherited a basketball program in shambles, and has built one of the most successful tenures of any coach in the nation since. He just lets it all roll off his back. “Lou Holtz once told me, ‘Never stay at a school for more than seven years. Because the longer you stay, the more you fall in love with the place and the more they fall out of love with you,’” Matta says. “And I remember in Year [7] at Ohio State, which was the year we started 24–0. I can remember coming off the floor and we’d win by 12 and people would be like, ‘Hey, Thad! 12 points? That’s it?’ And I’m like, ‘Lou was right!’ I can still remember thinking he was on to something. It’s like the old Ricky Nelson song — you can’t please everybody so you gotta please yourself.” For all he’s accomplished, there’s one box that Matta has yet to check: win a national championship. It’s something every college coach dreams about, but few ever have an opportunity to make it a reality. Matta has had many chances, yet he’s come up short to varying degrees each time. His 2004 Xavier team was three minutes away from knocking off top-seeded Duke for a trip to the Final Four before Luol Deng, J.J. Redick, and the Blue Devils downed his Musketeers in the waning moments. In 2007, Matta’s Buckeyes lost to Florida in the national championship, a game that he considers the biggest regret in his career, specifically because of his decision to bench Conley in the first half because of foul trouble instead of trusting his freshman point guard. Matta’s 2009–10 team won the Big Ten regular-season and tournament titles, featured national player of the year Evan Turner, and lost to Tennessee by three in the Sweet 16 when Turner’s last-second shot attempt was blocked. Getty Images The list goes on. The Buckeyes started the 2010–11 campaign 24–0, were ranked no. 1 for a lot of the season, and established themselves as the favorites to win the national championship before Kentucky pulled off a 62–60 upset in the Sweet 16. The following season produced Matta’s second trip to the Final Four, where Ohio State dropped another close game, this time to Kansas, 64–62. In 2013, Matta’s second-seeded Buckeyes fell victim to Wichita State’s Cinderella run in the Elite Eight, as their comeback attempt fell four points short. During the six-year stretch from 2009 to 2014, Matta’s teams averaged 28.3 wins per season, and their tourney trips ended with these results: two-point loss in double overtime, three-point loss, two-point loss, two-point loss, four-point loss, one-point loss. Those who know Matta best have speculated for years that a national championship is his white whale and that winning one would be enough to prompt him to retire. He’s conscious of the lingering problems with his foot, and how he’ll look and feel different at 70 than will most of his peers. His two daughters, Ali and Emily, are now in high school, with his oldest set to graduate in the spring. He’s made enough money to last a few lifetimes, and for a man who originally dreamed of becoming a high school coach, he’s enjoyed an astonishing amount of success. It’s easy to envision him walking away should he finally reach the mountaintop, especially given that he’s mentioned his desire to open a beach bar in Mexico and “do nothing all day” so often that it’s become difficult to tell if he’s joking. “I don’t have an ‘I’m going to do this until this age’ plan,” Matta says. “I want to do this as long as I possibly can, as long as I’m enjoying what I’m doing. Now, there are days throughout the course of the year when it’s not fun. But it’s the job. I talk to coaches before a game, after a game, or whatever. And we all got the same issues. We’re all worn down and we’re all upset or something, but we’re all thankful for the jobs we have. I just fight the good fight and away I go. The hardest part is that I enjoy what I do. I don’t think I’ve ever worked a day in my life. Some days are harder, but I looove what I’m doing.” Two years ago, those words would have sounded like a man trying to convince himself that his heart’s still in it. His honeymoon phase at Ohio State was over. His health was in shambles, and he’d lost the three best players — LaQuinton Ross, Aaron Craft, and Lenzelle Smith — from his 2013–14 team, which had been bounced in the first round of the NCAA tournament. Today, though, the statement rings sincere. Matta says he feels recharged, for reasons even he can’t quite pinpoint. Maybe it’s his health. Maybe his daughters — the same little girls he vividly remembers wearing Ohio State cheerleading outfits at his introductory press conference in 2004 — being on the verge of adulthood has adjusted his perspective. Maybe he has accomplished enough to stop worrying about proving himself and to simply enjoy the life he’s built. Or maybe the fact that he has stopped wearing a tie on the sideline — something he says he’s been waiting his entire career to have the confidence to pull off — has something to do with it. “Part of his rejuvenation is that he’s back to coaching basketball instead of dealing with the off-court distractions his recent teams have had,” says Ohio State strength and conditioning coach Dave Richardson, who has been part of the program since Matta’s second season in Columbus. “It’s like a weight has been lifted off his shoulders to have a group of guys that he can just coach without worrying about all the other stuff. He loves basketball and he loves the process of making his team better. But kids don’t seem to love that process like they used to. He’s got a team that does love it, though, and that’s why he’s so excited to come to work every day.” Perhaps the most notable manifestation of his rejuvenation came a little over a month ago. Despite maintaining a sharp sense of humor behind closed doors, Matta has historically been reserved with his public persona. It’s fair to say, then, that modeling Ohio State’s new uniforms on Twitter in late September was an enormous departure from what he’s typically been willing to let the public see. Just don’t expect this to be a regular thing. Matta has never had a social media account of any kind and barely, for that matter, even comprehends the concept. “I’ll be honest with you,” Matta says. “I don’t understand that world. When they took the picture, they said, ‘Can we post this?’ I don’t even know what ‘post this’ means. I don’t understand. They’re saying this had so many hits, and I’m like, ‘Explain to me what a hit is.’ I don’t understand. Someone texted me, ‘You’ve now got street cred,’ and I’m like, ‘What is street cred? Who do I have street cred with?’ I had no idea. As soon as it came out, [former Ohio State All-American] D’Angelo [Russell] was texting me and he’s busting my balls. So someone says D’Angelo has 500,000 followers and I’m like, ‘What is a follower?’ So they’re explaining that if he sends that out then 500,000 people see that because they’re linked to him and I’m like, ‘What the fuck is going on here?’” It almost feels as if the past few years have served as a transformation chamber for Matta. He stepped into it a young and hungry coach desperate to get his white whale, and he came out an elder statesman excited for the next phase of his career. The white whale still matters, of course, but Matta is more concerned with helping his players accomplish their dreams. “I hope when the time comes,” Matta says, “that people look and say, ‘You know what, he did a hell of a job for this university. He did it the right way, he was true to his players, and he was true to himself.’ And if that’s said, then I’m good. I know I’ve never scored a point. I’ve never gotten a rebound. The players are the ones that built this program. Obviously as a coach you’re directing the ship and pointing it in the right direction and all that stuff. But I didn’t get into this profession to get famous or make money. I got in it because I loved the game of basketball. I loved what I was doing. And I think that’s the lesson in the end — love what you’re doing every day and things will take care of themselves.” Matta still loves what he’s doing, even if some on the outside struggle to figure out why. Given all the factors in play, it would be hard to blame him if he decided to hang up his whistle at some point in the next few years. And while he might not have the when part of the end of his career figured out, he does have a pretty good idea of what the how will look like. “I tell my assistants,” he says, “that my goal in life is for someone to come up to them and say, ‘Didn’t you used to work for that Thad Matta guy? Whatever happened to him?’” For now, the beach bar in Mexico will have to wait. Matta has plenty of teaching still in him, with a team he believes is eager to learn. He’s not the same coach or person he was a decade ago, but that’s a good thing. He has a new lease on life and his career, and at long last his health and priorities are in order. Now all that’s left to do is get that white whale. "}