{"parent": "", "timestamp": "Mar 21, 2016", "title": "Why the NCAA Is America’s Longest-Running Cartel", "sentences": [{"1590": "Why the NCAA Is America’s Longest-Running Cartel"}, {"eedc": "In Bethlehem Shoals’s America, people who watch March Madness feel empathy for the young men on their TV screens because they recognize our common humanity. Each buzzer beater includes a side order of epiphany over the economic exploitation inherent in a multibillion-dollar industry where everyone except the athletes can earn every dollar the market says they’re worth."}, {"fbcb": "Oh, to live in that America! But alas."}, {"a6c9": "I’ve spent the better part of the past two decades researching and writing on the question of why we single out college athletes as undeserving of the basic American right to economic freedom. From this, I have decided that the correct question is not, “Should college athletes be paid?” but instead, “Why are we letting the colleges that form the NCAA act as a price-fixing cartel rather than recognizing the rights of the college athletes they exploit?”"}, {"673a": "When I ask the question this way, the usual response is, “Exploited? You call getting ‘free’ college exploitation? I wish I (or my kid) could be exploited like that!” (This is Myth 10 on my list of phony excuses for not paying college athletes.)"}, {"61f2": "There’s a sense that athletes are less deserving of this largesse than “real” students. People focus on the value of what athletes get rather than on the value they are denied. I often hear that “they” should be grateful for what they’ve been “given,” disregarding that the “gift” is a fraction of their market worth, built on a foundation that denies them the right to earn their worth like everyone else."}, {"ddf6": "When others in society gets a raise, we rarely ask whether he or she “needed” it — we accept it as how a capitalist society rewards good results. But when a college athlete asks for more than just having his/her expenses covered, we apply the standard we use for children—and not even our own children, but other people’s children, for poor people’s children. Why should they get anything more than they need just to get by?"}, {"33fc": "College athletes, who enrich our fall Saturdays and provide the madness every March, should get more than just sustenance. They should get more than your kid does. Why? Because in America, we’re supposed to get what we’re worth, and we’re supposed to get it through the workings of the free market. If a recruit is worth 100 letters a day, if he is worth investing in a $70 million luxury palace of a locker room, and if he is so valuable that his coaches earn $10 million to make sure he signs that letter of intent, then he is worth more than just his scholarship. He doesn’t earn more solely because the teams that value him most — the 351 programs in NCAA’s Division I — have formed a price-fixing agreement for the purpose of denying these men (and women) access to the same market forces that have allowed college sports revenues to grow at a rate far faster than the American economy as a whole. (Heck, faster than McDonald’s!)"}, {"1005": "Until we all stop ignoring the perpetual antitrust violation operating tax-free in Indianapolis, we’re essentially denying their common humanity. Do we mean it when we say we are all equal under the law? As long as we hate to take the risk that our sports might possibly be one percent less good, even though it would mean the talent would be treated 100 percent more like the rest of us, we can’t see them as Us. They are They, the Other."}, {"9264": "Seems harsh, no? Shoals appeals to our better selves, and while he asks whether perhaps it is the excitement of sport that blinds us to the injustices, he seems to hold out hope that as long as we see the common bond between the athlete and the fan, justice will prevail."}, {"ab5b": "But the college system does not talk about athletes like adults with agency. For 40 years, colleges denied athletes the right to earn expense money from their schools, but when that small ceiling was smashed, the first thing we heard was how worried we should be that athletes might blow their monthly check on “tattoos and rims.” Others made receipt of the money conditional on completing a course on the basics of finance. Still others imposed conduct rules, docking pay for on- and off-field conduct deemed inappropriate."}, {"2497": "This is not how “normal” students’ money works. The freshman who works in the cafeteria doesn’t have her pay docked if she doesn’t live up to some sort of weekend dress code. The trust-fund bro who blows his allowance on spring break in Cancun isn’t publicly shamed or forced to take a paternalistic course in how to balance his checkbook. We treat a college student who works a second job far differently than we treat a college athlete who works 40 to 50 hours per week at his craft, who might dare to buy a hoverboard with his check, even if the reality is that he might just want to send it home to his family."}, {"47b5": "Amateurism was born during the Victorian era as an explicit division between the We and the They. At the time, it was a statement about class — “We” were the British aristocracy; “They” were the British working class. A myth was created: The Greeks had competed purely for sport, and infusing cash into the system would sully Greek idealism into Roman gladiatorial excess, even though the gladiators were slaves and the original Olympians were paid."}, {"3556": "The same arguments that supported amateurism also supported the idea of the aristocracy itself: Without a leisure class—who could devote themselves to whatever they wanted to do, rather than simply work for a living—how would civilization advance? Race wasn’t a part of this inherently class-based argument, though you can find a lot of parallels to the 19th-century “logic” of those who said that maintenance of a slave class was needed to allow the full flowering of American cultural achievements:"}, {"1d2a": "“[T]he institution of slavery is a principal cause of civilization. Perhaps nothing can be more evident than that it is the sole cause… Without it, there can be no accumulation of property, no providence for the future, no tastes for comfort or elegances, which are the characteristics and essentials of civilization.”"}, {"3d97": "When college sports first took up the amateurism torch, race was not the focus — but mostly because racial segregation was so strong that many college teams were all white. But when those barriers broke down (it took some schools until the 1970s), amateurism was lying in wait, ready to become a tool of disparate impact."}, {"6693": "We moved into a world where the color of the athletes on the football and basketball team grew darker far faster than the color of the student body at large. The rest of student body could earn whatever they were worth while we turned a blind eye as colleges agreed not to pay athletes their full worth, and even took away the monthly “laundry money” that previously had been the norm. When society acquiesced to this further injustice, it can’t have hurt that the team now looked different than what most of us thought of as the “normal” college student."}, {"0f70": "In surveys of how Americans feel about college athletes and pay, the only group with anything close to a majority interest in seeing athletes earn what they are worth are respondents who identify themselves as African American or Other. For the rest of us, even those who claim to believe in free-market economics and meritocracy, it’s somehow okay to allow schools to fix prices, and we say it’s okay because, after all, the money goes to pay for lacrosse scholarships, as if that’s a normal thing for us to condone."}, {"67f3": "It’s not just fans. University presidents testify to Congress that we must deny these young men their economic rights or else, well, or else we’ll cancel wrestling, gosh darn it, and how is that fair? Republican senators like Kelly Ayotte eat it up like it’s normal to allow companies to fix the wages of their best talent to ensure everyone is paid the same. When a courageous group of young men spent months convincing a regional director of the NLRB that they fit the definition of employees and should be allowed the right to choose to unionize if that’s what they wanted, the Democratic-controlled NLRB chose to punt and refused jurisdiction over the case, an abdication unheard of since the 1970s. To my great sadness, even President Obama, our Bracketologist-in-Chief, failed to see the irony in fighting for an increase in the minimum wage and the basic dignity of all working people while stating that college athlete’s economic rights are secondary to his “sense of college sports.”"}, {"e4f4": "We don’t yet live in Bethlehem Shoals’s America, though I truly hope someday we will."}, {"b096": "That world won’t be one where college athletes must be paid, but rather where colleges simply can’t deny their athletes the same right to negotiate for what they are worth, which will mean they will be paid."}, {"4c25": "The first step is to say, “These men have rights.” Paramount among those is the right to a market free of collusion. That right should trump our wish that sports weren’t so commercial. That right should trump our feeling that what student-athletes get is “enough.”"}, {"114a": "When we recognize that we can no longer subordinate athletes’ civil rights to whatever silly argument we advance — arguments that a half dozen other sports (including the Olympics) have already disproven — then maybe we can say we see the fellow humanity of the college athletes. That will truly be “One Shining Moment.” Until then, I am afraid Shoals’s thesis is no less of a fantasy than the myths that keep the system in place."}, {"305a": "I work as an economist at OSKR, where some of my work is about pending litigation against the NCAA. The opinions expressed here are my own, not necessarily those of my clients, my business partners, or my firm. Follow me on Twitter: @andyhre."}], "author": "Andy Schwarz (@andyhre)", "child": "1691_1\t1691_21691_1\t1691_21691_1\t1691_21691_1\t1691_21691_1\t1691_21691_1\t1691_21691_1\t1691_2", "name": "1691", "content": "Why the NCAA Is America’s Longest-Running Cartel In Bethlehem Shoals’s America, people who watch March Madness feel empathy for the young men on their TV screens because they recognize our common humanity. Each buzzer beater includes a side order of epiphany over the economic exploitation inherent in a multibillion-dollar industry where everyone except the athletes can earn every dollar the market says they’re worth. Oh, to live in that America! But alas. I’ve spent the better part of the past two decades researching and writing on the question of why we single out college athletes as undeserving of the basic American right to economic freedom. From this, I have decided that the correct question is not, “Should college athletes be paid?” but instead, “Why are we letting the colleges that form the NCAA act as a price-fixing cartel rather than recognizing the rights of the college athletes they exploit?” When I ask the question this way, the usual response is, “Exploited? You call getting ‘free’ college exploitation? I wish I (or my kid) could be exploited like that!” (This is Myth 10 on my list of phony excuses for not paying college athletes.) There’s a sense that athletes are less deserving of this largesse than “real” students. People focus on the value of what athletes get rather than on the value they are denied. I often hear that “they” should be grateful for what they’ve been “given,” disregarding that the “gift” is a fraction of their market worth, built on a foundation that denies them the right to earn their worth like everyone else. When others in society gets a raise, we rarely ask whether he or she “needed” it — we accept it as how a capitalist society rewards good results. But when a college athlete asks for more than just having his/her expenses covered, we apply the standard we use for children—and not even our own children, but other people’s children, for poor people’s children. Why should they get anything more than they need just to get by? College athletes, who enrich our fall Saturdays and provide the madness every March, should get more than just sustenance. They should get more than your kid does. Why? Because in America, we’re supposed to get what we’re worth, and we’re supposed to get it through the workings of the free market. If a recruit is worth 100 letters a day, if he is worth investing in a $70 million luxury palace of a locker room, and if he is so valuable that his coaches earn $10 million to make sure he signs that letter of intent, then he is worth more than just his scholarship. He doesn’t earn more solely because the teams that value him most — the 351 programs in NCAA’s Division I — have formed a price-fixing agreement for the purpose of denying these men (and women) access to the same market forces that have allowed college sports revenues to grow at a rate far faster than the American economy as a whole. (Heck, faster than McDonald’s!) Until we all stop ignoring the perpetual antitrust violation operating tax-free in Indianapolis, we’re essentially denying their common humanity. Do we mean it when we say we are all equal under the law? As long as we hate to take the risk that our sports might possibly be one percent less good, even though it would mean the talent would be treated 100 percent more like the rest of us, we can’t see them as Us. They are They, the Other. Seems harsh, no? Shoals appeals to our better selves, and while he asks whether perhaps it is the excitement of sport that blinds us to the injustices, he seems to hold out hope that as long as we see the common bond between the athlete and the fan, justice will prevail. But the college system does not talk about athletes like adults with agency. For 40 years, colleges denied athletes the right to earn expense money from their schools, but when that small ceiling was smashed, the first thing we heard was how worried we should be that athletes might blow their monthly check on “tattoos and rims.” Others made receipt of the money conditional on completing a course on the basics of finance. Still others imposed conduct rules, docking pay for on- and off-field conduct deemed inappropriate. This is not how “normal” students’ money works. The freshman who works in the cafeteria doesn’t have her pay docked if she doesn’t live up to some sort of weekend dress code. The trust-fund bro who blows his allowance on spring break in Cancun isn’t publicly shamed or forced to take a paternalistic course in how to balance his checkbook. We treat a college student who works a second job far differently than we treat a college athlete who works 40 to 50 hours per week at his craft, who might dare to buy a hoverboard with his check, even if the reality is that he might just want to send it home to his family. Amateurism was born during the Victorian era as an explicit division between the We and the They. At the time, it was a statement about class — “We” were the British aristocracy; “They” were the British working class. A myth was created: The Greeks had competed purely for sport, and infusing cash into the system would sully Greek idealism into Roman gladiatorial excess, even though the gladiators were slaves and the original Olympians were paid. The same arguments that supported amateurism also supported the idea of the aristocracy itself: Without a leisure class—who could devote themselves to whatever they wanted to do, rather than simply work for a living—how would civilization advance? Race wasn’t a part of this inherently class-based argument, though you can find a lot of parallels to the 19th-century “logic” of those who said that maintenance of a slave class was needed to allow the full flowering of American cultural achievements: “[T]he institution of slavery is a principal cause of civilization. Perhaps nothing can be more evident than that it is the sole cause… Without it, there can be no accumulation of property, no providence for the future, no tastes for comfort or elegances, which are the characteristics and essentials of civilization.” When college sports first took up the amateurism torch, race was not the focus — but mostly because racial segregation was so strong that many college teams were all white. But when those barriers broke down (it took some schools until the 1970s), amateurism was lying in wait, ready to become a tool of disparate impact. We moved into a world where the color of the athletes on the football and basketball team grew darker far faster than the color of the student body at large. The rest of student body could earn whatever they were worth while we turned a blind eye as colleges agreed not to pay athletes their full worth, and even took away the monthly “laundry money” that previously had been the norm. When society acquiesced to this further injustice, it can’t have hurt that the team now looked different than what most of us thought of as the “normal” college student. In surveys of how Americans feel about college athletes and pay, the only group with anything close to a majority interest in seeing athletes earn what they are worth are respondents who identify themselves as African American or Other. For the rest of us, even those who claim to believe in free-market economics and meritocracy, it’s somehow okay to allow schools to fix prices, and we say it’s okay because, after all, the money goes to pay for lacrosse scholarships, as if that’s a normal thing for us to condone. It’s not just fans. University presidents testify to Congress that we must deny these young men their economic rights or else, well, or else we’ll cancel wrestling, gosh darn it, and how is that fair? Republican senators like Kelly Ayotte eat it up like it’s normal to allow companies to fix the wages of their best talent to ensure everyone is paid the same. When a courageous group of young men spent months convincing a regional director of the NLRB that they fit the definition of employees and should be allowed the right to choose to unionize if that’s what they wanted, the Democratic-controlled NLRB chose to punt and refused jurisdiction over the case, an abdication unheard of since the 1970s. To my great sadness, even President Obama, our Bracketologist-in-Chief, failed to see the irony in fighting for an increase in the minimum wage and the basic dignity of all working people while stating that college athlete’s economic rights are secondary to his “sense of college sports.” We don’t yet live in Bethlehem Shoals’s America, though I truly hope someday we will. That world won’t be one where college athletes must be paid, but rather where colleges simply can’t deny their athletes the same right to negotiate for what they are worth, which will mean they will be paid. The first step is to say, “These men have rights.” Paramount among those is the right to a market free of collusion. That right should trump our wish that sports weren’t so commercial. That right should trump our feeling that what student-athletes get is “enough.” When we recognize that we can no longer subordinate athletes’ civil rights to whatever silly argument we advance — arguments that a half dozen other sports (including the Olympics) have already disproven — then maybe we can say we see the fellow humanity of the college athletes. That will truly be “One Shining Moment.” Until then, I am afraid Shoals’s thesis is no less of a fantasy than the myths that keep the system in place. I work as an economist at OSKR, where some of my work is about pending litigation against the NCAA. The opinions expressed here are my own, not necessarily those of my clients, my business partners, or my firm. Follow me on Twitter: @andyhre. "}