{"parent": "", "timestamp": "Feb 27, 2015", "title": "I was Exercised by Wolves", "sentences": [{"9d80": "I was Exercised by Wolves"}, {"f3b6": "What I learned about how the fitness industry lies"}, {"a3ab": "So, ladies, let’s first put down the two-pound, pink dumbbells. We have been sold a false story about fitness, health (and its connection to weight loss)."}, {"8919": "I was exercised by wolves. And I’m going to tell you all the secrets and tricks I learned by avoiding the fitness-industrial complex."}, {"499a": "Most of what I’ll say applies to men, but I have discovered that most of the outrageously wrong advice is given to women."}, {"62a5": "The biggest secret? Almost everything you need to know fits into two or three sentences, and a few pages for the implementation. I’ll have most of it down before this article is over."}, {"2228": "It’s almost March, that time of the year when eagerly-purchased home exercise gadgets evolve into permanent coat hangers, and the attendance in exercise classes, spiked up by Groupon-facilitated mass purchases right before or after the new year, starts to fall off."}, {"7907": "Only about 20% of us get the minimum exercise we actually need, though most of us are interested in learning how to exercise. News items that promise shortcuts, new inventions, or magical potions tend to go viral. Last year, New York Times health blog The Well had back-to-back viral stories: first, how to exercise in seven minutes, and then how to exercise in one minute. There are a constant stream of allegedly better, novel ways to exercise."}, {"4492": "Phooey."}, {"2f47": "I’m a lifelong exerciser, and also an academic with interest in, and access to, research, so I tend to read the research about most things I do regularly. It was all a lucky coincidence, there is nobody in my family who exercised (or was in the least interested in healthy behaviors.) I just stumbled into that world, and I was lucky enough to have avoided the fitness industry aimed at women. Instead, I was trained by serious (amateur) athletes, in thai-boxing rings and in running tracks, in basketball courts and in actual gyms by people who knew what they were doing, not for-profit fitness clubs."}, {"dc9a": "Here’s the secret I have learned: There is none. We have long known most everything there is to know about what the average adult in reasonable health needs to do for fitness, and how. There is no new fad to uncover, nor is the science of it an unknown, complex field."}, {"bfc7": "Here’s the shortest version: Lift. Move. Regularly."}, {"be3e": "I’ll outline all the basics you need before this article is over."}, {"e522": "Every study uncovers more benefits to exercise. From helping ward off depression, to prolonging life to supporting immunity to regulating sleep to increasing alertness. If there was a miracle drug, this is it. The positives of regular exercise spans age limits: octogenarians and even older people benefit from exercise, as do people of all genders and weight categories."}, {"4601": "Except for one small thing."}, {"72e0": "Pssst. The very thing it is most touted for."}, {"a508": "The thing people who hop on the exercise bandwagon are told it will do, and are disappointed when it doesn’t."}, {"fd9d": "Here’s the truth: Exercise is unlikely to help you lose weight (directly). There is a link, but it’s convoluted and not the path most people think."}, {"9319": "So, forget the weight part. Just this: if your health permits, you should exercise. Remember, I’m not a medical doctor, and in any case, only your own doctor knows about you, not any general article on the Internet. Check with your doctor. This article is contains the broad lessons I have learned as a lifelong exerciser, which the CDC says is a small minority of people. That is a shame, as there are few other things you can do in life with such broad impacts on quality and length of life. Yet, the fitness industry keeps touting unreasonable messages and false promises, which discourages people."}, {"5708": "TONE AND BULK: LIES THE FITNESS INDUSTRY TOLD ME"}, {"8b02": "So, here: truth number one. Very few of us consider strength-training as essential exercise, but it is. It is especially crucial as one ages, because a natural part of the aging process is losing muscle. Women, especially, need to lift weights, and the trick to lifting weights is stressing muscles. And that weight has to be a real weight, progressively increased, and barring health issues, an average woman should not even bother with two pound weights because that won’t stress your muscles enough to benefit you."}, {"aac7": "Exercise industry is surely partially to blame for why people don’t exercise regularly: they promise the wrong thing (weight loss) and then don’t push/guide people to do the right thing."}, {"a8d0": "I encountered those pink, useless dumbbells when I joined commercial exercise classes, attempting to recover from an ankle injury, and seeking some novelty. Classes can be fun, and group exercise isn’t a bad option. I thought, after lifelong avoidance of the industry, I might as well give it a shot."}, {"882c": "A young woman had come to class with her toddler, and she exercised in the back room set aside for kids, participating through the half-open door. When we switched to strength-training, she strolled out of the room, her toddler under one arm, and walked to the weight rack, and picked the two-pounders, turned around."}, {"c564": "Her toddler, held under one arm, was at least 25 pounds."}, {"f47c": "But it’s hard to blame her. The weights in the class were mostly under five pounds. I was actually out of shape, due to my ankle injury. These were women who exercised regularly in this class that ostensibly included strength training. Some had been attending for years. Yet, there were only two dumbbells over seven pounds, and a single set of ten pounders. I asked around why the weights were so puny, and was told that “they wanted to tone, not bulk.”"}, {"4eda": "Lies the fitness industry tells women. The dumbbells available at a local, popular fitness club for women."}, {"df96": "Hahahahahahahaha, would say my gym friends, actual athletes, which included a few women who actually tried to bulk up. It’s very hard for women to “bulk up”. An average woman is not going to accidentally “bulk up”. Women also have naturally higher body fat percentage—even if they “bulked up” in muscle, it would take an enormous amount of effort, and let’s be honest, likely some shady medical “enhancements”, before an average woman ended up with noticeable musculature plus lose enough body fat for the muscles to show through. (Pssst. Carrying that low levels of bodyfat for women has lifelong negative consequences. Women and men really do differ in that aspect)."}, {"a525": "You are not going to bulk up. You don’t need to “tone.” You need to strengthen your muscles, all of them."}, {"2c01": "In hotels which have fitness rooms, I often encounter weights that have the opposite problem of women’s club—sets whose minimum start at 20–25 pounds per dumbbell. The assumption, I suppose, is that women won’t use them. (There is, indeed, some physical differences in upper body strength in men and women, especially the maximum. But many men wouldn’t start at 20 lbs—yet the racks were full of 50–80 lbs range which is probably used by very few people). Men don’t need to be needlessly lifting too heavy weights that court injury. There is great benefit to strength training that doesn’t require trying to look like Arnold Schwarzenegger. When it comes to strength training, the industry pushes women to under-exercise, and men to over-exercise, accompanied by pictures of people who almost certainly are not merely weight-training. This is just as wrong."}, {"8284": "STRENGTHEN ALL YOUR MUSCLES (NOT JUST THE ABS!)"}, {"52cc": "Women’s exercise classes and magazines are often focused on endless amount of “abs” work, and they skimp on strength-training for upper body and arms. It’s great to do what’s increasingly called “core” body strength training (the muscles from your abs to your knees) as that part of the body gives you stability and strength, but it won’t make you lose weight, it is not going to make a huge difference in your weight, or your looks, and you need to strengthen all of your body, and that includes all the muscles not just your abs."}, {"18c4": "Part of the emphasis on abs, it seems, comes from the pregnancy and “post-baby body” industry that urges women to try to look like they never got pregnant. It’s a whole other ugly lie, bolstered by pictures of celebrities in their “post baby body” pics, and hides this truth: for most women, it is virtually impossible to “exercise” your way back to a pre-pregnancy body. Those celebrities? Surgery, mostly. And genetics: just like the industry tries to find those few people who are just genetically prone to being thin, the celebrity-fitness complex focuses on the exceptions. And, oh. The muscles you exercise (abs) and where you lose fat (tummy, etc.) are not related. Muscles are muscles, and fat is fat. Your genetics/body determines where the fat comes from."}, {"9121": "All this lack of interest by the fitness industry on effective strength training is doubly ironic because besides the enormous health and fitness benefits for keeping up your muscles, no matter your weight, muscle is metabolically active. The amount of muscle you have determines how many calories your body burns throughout the day, even as you sit. Loss of muscle as we age (natural part of aging for both men and women) is one key reason we gain weight as we age, a concern that pushes many to exercise, but without strength-training—you see the irony. The more muscle you have, the more calories your body burns at all times, while an activity like running even a whole hour, not an easy feat, can be offset by eating a sandwich and an apple. And active people tend to get hungry, naturally, and add those extra calories to their diet. Besides, caloric restriction dieting (especially if it’s severe and without exercise) often results in muscle loss, which makes people even more likely to gain weight once they stop their diet, as their body now has proportionally more fat and less muscle compared to before the diet. They’ll now gain weight on even fewer calories per day, leading to further frustration and cycles of yo-yo dieting and weight gain."}, {"e5a2": "SO, WORK YOUR MUSCLES"}, {"7af4": "Strength training exercises have a few basic principles."}, {"181f": "First, you must stress your muscles, meaning that it doesn’t work if you don’t push yourself a little. Your body is honed to conserve energy, convincing it to keep building muscles requires giving it a good reason, i.e. a bit of stress. That’s what’s wrong with that 2 lbs dumbbell. If a weight becomes too easy because you've grown strong, increase it a little. Once that’s easy, too, increase that. That principle underlies all strength training."}, {"2eec": "Second, you must allow for time to rest, so don’t do strength training on the same muscle two days in a row. Rest is when your body decides to and can build up the muscle you stressed. The exercise is the signal, the rest is when the real work is done."}, {"f55c": "Third, exercise all your muscle groups, in turn. You can use dumbbells, whole body exercises (great), strength training elastics. The principle is the same."}, {"f29f": "You need to learn the names of the main muscles, and which exercises use which. (Here, this two pager has most of what you need). You can train for as little as two days of the week (say, back, triceps, trap and hamstrings one day, and chest, biceps and quadriceps the other day, and abs on both). You can train four days of the week (with rest days in between) or any combination. It usually takes 20–30 minutes each time, so you are looking at 20 minutes twice a week at a minimum. Remember, always take rest days, that’s when your body takes the chance to build that muscle, which is your goal."}, {"d446": "There are some good guidelines out there. Here’s a one. Here’s another. This isn’t bad either. Remember, ignore the unrealistic pictures. You won’t and almost certainly cannot look “ripped.” But you are best off learning the principle: look at that guide of major muscles, and make sure you exercise all of them, once or twice a week, with weights that challenge but not overwhelm you."}, {"2cc4": "If you are using dumbbells, here’s your rule of thumb: Pick a weight you can comfortably lift 12 times, rest a few minutes, lift for another 10–12 times, rest a few minutes more, but can barely lift 8 more the last time (called a set). You’ll have done three sets, and you are done with that muscle. If you go too easy your first try, increase it the next time. If you start too heavy, decrease it a bit. Err on the side of caution."}, {"5942": "You can apply the same rule of thumb if you are using whole body exercises (like pushups, squats and pullups). First, do a number (probably around 5–10) that leaves you tired, but not exhausted. Repeat. If you got it right, by the third set, you should be really feeling spent, but not miserable. Stop when you can’t do anymore. Remember, if you feel miserable, you’ve overdone it. You’ll find your sweet spot quickly, and you’ll soon learn to know what your body can do, and what feels right. When in doubt, stop. Don’t overdo it. You can try again later."}, {"3191": "The first few weeks of weight-lifting will be accompanied by a soreness that starts a day or two late—it’s called delayed onset muscle soreness. It should feel like soreness, not serious pain. This is very common. It’s okay. It won’t always be that way. It’s a normal part of starting weight-training from scratch."}, {"4ea9": "If you read online guides, remember ignore the parts about looks, weight, “toning” and various admonitions. You need to lift weights because stronger muscles are going to make you healthy, less prone to injury and more fit."}, {"9d22": "GET YOURSELF HUFFING AND PUFFING"}, {"925d": "I have even less to say about aerobic exercise, the part that conditions your cardiovascular system. What we know is exceedingly straightforward (except how to get people to do it). Every study finds more benefits. It doesn’t matter what you do as long as you are left somewhat breathless, but not too much. You can run, bike, walk briskly (not leisurely). You can dance, hop, skip and jump. You can swim or spin. If you go to an exercise class, remember, almost all the dancing choreography is to keep you interested and somewhat distracted; it is not the part that’s benefiting your health. If you just want to jump up and down, while the rest of the class twirls to a modified samba step, that works, too. Just move."}, {"9638": "How long? I’ll be straight. Like most things, most of the benefits are in the initial ramp-up, not the margins. If you are sedentary, just doing some cardio, even 30 minutes a week, 10 minutes at a time, will get you some real benefits. If I were doing bare bones, I’d say try 20 minutes at a time, three times a week. That’s just one hour the whole week. Research observes real benefits even to that little. But don’t stop there: the research also strongly suggests that you should try to do about 150 minutes per week, or 30 minutes, per day, for at least five days of the week. That’s two-and-a-half hours per week."}, {"9dc5": "By the way, if you have a desire to lose weight, research shows that people who've lost weight and kept it off long-term through non-surgical means, have mostly done it primarily through (drastically) lower caloric intake plus about an hour of exercise per day, everyday. Research also shows more weight-loss benefits to strength-training than aerobic exercise. But that’s a whole other issue: remember, exercise is for health."}, {"b900": "How little at a time? 10 minutes seems to be the absolute minimum that starts accruing benefits. So if you can do 10 minutes every day, do it. You’ll benefit. But if you can, increase it."}, {"93d7": "How hard? There are heartbeat calculators and formulas out there, but here’s your rule-of-thumb: You should be huffing and puffing a bit, but able to talk. If you are so out of breath that you can’t talk, slow down, and then gradually stop. Catch your breath. If you can hold a conversation with no huffing and puffing, it’s too easy: step it up."}, {"9afc": "If you can, throw small spikes into your exercise. These are called intervals. While walking briskly, for example, break into a jog for 20–30 seconds, and start walking again. Do it 2–3 times in your whole routine. Research shows that intervals help fitness benefits. But don’t worry about it. This is optional. You don’t need to read 30 articles on the best interval method. You don’t even need to do them if you don’t feel like it."}, {"52b4": "There is one last trick, one that actually works, in this field of a million tricks which don’t work. You can combine your strength and aerobic exercises, by doing your strength-training at a brisk pace, hence keeping your heart-rate up, for the whole 20–30 minutes in which you are stressing your muscles. This exercise routine by Jillian Michaels, available seemingly legally on Youtube in both introductory and intermediate forms, is very good in that it does really cover most major muscle groups, and is done briskly enough to be good for both cardio and strength. Ignore its name: just this won’t make you “shred.” I’ve heard that she later became a TV star with a show that’s focused on losing weight, which I’ve never watched and I actually find the idea somewhat disturbing, but the routine is good and she is mostly telling the truth throughout the video which is a rare thing in this industry."}, {"d370": "If you were crunched for time, you could get a lot out of doing the beginning version of that particular routine, and pushing yourself progressively harder, just 3–4 times a week, moving up to the intermediary version, and maybe a brisk walk or two here and there for 10–20 minutes. By the time you are too fit for the intermediate version, you will have learned a lot about your body, and how to push yourself appropriately."}, {"4be4": "So, here it is: Build your muscles by stressing them, but don’t forget to rest. Get your heart rate up at least a few times a week, for about 20 minutes at a time."}, {"21d9": "That’s, umm, it."}, {"5cff": "Most important part of this is that you will find your own groove, and your activity, as long as it fits the above broad outline. Over time, I have gotten aerobic exercise through a variety of means, including the thai-boxing ring, biking, running and basketball when I was younger (I’m not good at any of those! In fact, I’m, ahem, lousy at most. I’ve always been fortunate enough to find people who enjoyed the sport and friendly competition, not aggressive one-upmanship). At the moment, I have a time-intensive job which involves a lot of writing, so I’ve found other ways to incorporate exercise into my day. Most months, I lift weights. Sometimes, I do whole body exercises. I switch routines as I get bored. I own an elliptical that I bought for $400 about 10 years ago and use almost every week, and I’ve recently acquired a treadmill desk. I’ve packed away my television, and the only time I watch a screen for leisure is on the elliptical, which motivates me to get on it. I think better when I walk, so the treadmill desk helps with that while getting the brisk walking in."}, {"48f8": "But this is me. I don’t have an answer for what will work for you, but I encourage you to find something you enjoy. Swim with a waterproof music player, and make it your time to listen to music you miss. Go for a brisk walk with a buddy, and chat. Dance for 20 minutes. Take a class, and don’t worry if you can’t do all the complicated moves. Just move, briskly, 20–30 minutes at a time. Lift weights, or do whole bodyweight moves a few times a week. Listen to podcasts or audiobooks. Tune out and just focus on the exercise. Whatever works for you, and your body, and your motivation."}, {"3935": "That’s it. There is, surely, a lot more to learn about fitness, exercise and health but those two bolded sentences above are the core basics, and that’s where most of the benefits are. All the fads, promises, tricks are confusing and misleading. The intense focus on weight-loss and exercise, especially for women, is doubly misleading and harmful because everyone benefits from exercise while weight-loss is fraught, complicated and frustrating."}, {"427d": "Exercise because exercise. Don’t listen to the exercise industry, don’t look at the ads, and don’t read articles that spend a lot of time on the latest thing or trick."}, {"affe": "Forget the resolutions. Forget the fads."}, {"0fad": "Lift. Move. Regularly."}, {"4a6e": "That’s it. You can do it. Go."}], "author": "Zeynep Tufekci", "child": "1710_1\t1710_2\t1710_3", "name": "1710", "content": "I was Exercised by Wolves What I learned about how the fitness industry lies So, ladies, let’s first put down the two-pound, pink dumbbells. We have been sold a false story about fitness, health (and its connection to weight loss). I was exercised by wolves. And I’m going to tell you all the secrets and tricks I learned by avoiding the fitness-industrial complex. Most of what I’ll say applies to men, but I have discovered that most of the outrageously wrong advice is given to women. The biggest secret? Almost everything you need to know fits into two or three sentences, and a few pages for the implementation. I’ll have most of it down before this article is over. It’s almost March, that time of the year when eagerly-purchased home exercise gadgets evolve into permanent coat hangers, and the attendance in exercise classes, spiked up by Groupon-facilitated mass purchases right before or after the new year, starts to fall off. Only about 20% of us get the minimum exercise we actually need, though most of us are interested in learning how to exercise. News items that promise shortcuts, new inventions, or magical potions tend to go viral. Last year, New York Times health blog The Well had back-to-back viral stories: first, how to exercise in seven minutes, and then how to exercise in one minute. There are a constant stream of allegedly better, novel ways to exercise. Phooey. I’m a lifelong exerciser, and also an academic with interest in, and access to, research, so I tend to read the research about most things I do regularly. It was all a lucky coincidence, there is nobody in my family who exercised (or was in the least interested in healthy behaviors.) I just stumbled into that world, and I was lucky enough to have avoided the fitness industry aimed at women. Instead, I was trained by serious (amateur) athletes, in thai-boxing rings and in running tracks, in basketball courts and in actual gyms by people who knew what they were doing, not for-profit fitness clubs. Here’s the secret I have learned: There is none. We have long known most everything there is to know about what the average adult in reasonable health needs to do for fitness, and how. There is no new fad to uncover, nor is the science of it an unknown, complex field. Here’s the shortest version: Lift. Move. Regularly. I’ll outline all the basics you need before this article is over. Every study uncovers more benefits to exercise. From helping ward off depression, to prolonging life to supporting immunity to regulating sleep to increasing alertness. If there was a miracle drug, this is it. The positives of regular exercise spans age limits: octogenarians and even older people benefit from exercise, as do people of all genders and weight categories. Except for one small thing. Pssst. The very thing it is most touted for. The thing people who hop on the exercise bandwagon are told it will do, and are disappointed when it doesn’t. Here’s the truth: Exercise is unlikely to help you lose weight (directly). There is a link, but it’s convoluted and not the path most people think. So, forget the weight part. Just this: if your health permits, you should exercise. Remember, I’m not a medical doctor, and in any case, only your own doctor knows about you, not any general article on the Internet. Check with your doctor. This article is contains the broad lessons I have learned as a lifelong exerciser, which the CDC says is a small minority of people. That is a shame, as there are few other things you can do in life with such broad impacts on quality and length of life. Yet, the fitness industry keeps touting unreasonable messages and false promises, which discourages people. TONE AND BULK: LIES THE FITNESS INDUSTRY TOLD ME So, here: truth number one. Very few of us consider strength-training as essential exercise, but it is. It is especially crucial as one ages, because a natural part of the aging process is losing muscle. Women, especially, need to lift weights, and the trick to lifting weights is stressing muscles. And that weight has to be a real weight, progressively increased, and barring health issues, an average woman should not even bother with two pound weights because that won’t stress your muscles enough to benefit you. Exercise industry is surely partially to blame for why people don’t exercise regularly: they promise the wrong thing (weight loss) and then don’t push/guide people to do the right thing. I encountered those pink, useless dumbbells when I joined commercial exercise classes, attempting to recover from an ankle injury, and seeking some novelty. Classes can be fun, and group exercise isn’t a bad option. I thought, after lifelong avoidance of the industry, I might as well give it a shot. A young woman had come to class with her toddler, and she exercised in the back room set aside for kids, participating through the half-open door. When we switched to strength-training, she strolled out of the room, her toddler under one arm, and walked to the weight rack, and picked the two-pounders, turned around. Her toddler, held under one arm, was at least 25 pounds. But it’s hard to blame her. The weights in the class were mostly under five pounds. I was actually out of shape, due to my ankle injury. These were women who exercised regularly in this class that ostensibly included strength training. Some had been attending for years. Yet, there were only two dumbbells over seven pounds, and a single set of ten pounders. I asked around why the weights were so puny, and was told that “they wanted to tone, not bulk.” Lies the fitness industry tells women. The dumbbells available at a local, popular fitness club for women. Hahahahahahahaha, would say my gym friends, actual athletes, which included a few women who actually tried to bulk up. It’s very hard for women to “bulk up”. An average woman is not going to accidentally “bulk up”. Women also have naturally higher body fat percentage—even if they “bulked up” in muscle, it would take an enormous amount of effort, and let’s be honest, likely some shady medical “enhancements”, before an average woman ended up with noticeable musculature plus lose enough body fat for the muscles to show through. (Pssst. Carrying that low levels of bodyfat for women has lifelong negative consequences. Women and men really do differ in that aspect). You are not going to bulk up. You don’t need to “tone.” You need to strengthen your muscles, all of them. In hotels which have fitness rooms, I often encounter weights that have the opposite problem of women’s club—sets whose minimum start at 20–25 pounds per dumbbell. The assumption, I suppose, is that women won’t use them. (There is, indeed, some physical differences in upper body strength in men and women, especially the maximum. But many men wouldn’t start at 20 lbs—yet the racks were full of 50–80 lbs range which is probably used by very few people). Men don’t need to be needlessly lifting too heavy weights that court injury. There is great benefit to strength training that doesn’t require trying to look like Arnold Schwarzenegger. When it comes to strength training, the industry pushes women to under-exercise, and men to over-exercise, accompanied by pictures of people who almost certainly are not merely weight-training. This is just as wrong. STRENGTHEN ALL YOUR MUSCLES (NOT JUST THE ABS!) Women’s exercise classes and magazines are often focused on endless amount of “abs” work, and they skimp on strength-training for upper body and arms. It’s great to do what’s increasingly called “core” body strength training (the muscles from your abs to your knees) as that part of the body gives you stability and strength, but it won’t make you lose weight, it is not going to make a huge difference in your weight, or your looks, and you need to strengthen all of your body, and that includes all the muscles not just your abs. Part of the emphasis on abs, it seems, comes from the pregnancy and “post-baby body” industry that urges women to try to look like they never got pregnant. It’s a whole other ugly lie, bolstered by pictures of celebrities in their “post baby body” pics, and hides this truth: for most women, it is virtually impossible to “exercise” your way back to a pre-pregnancy body. Those celebrities? Surgery, mostly. And genetics: just like the industry tries to find those few people who are just genetically prone to being thin, the celebrity-fitness complex focuses on the exceptions. And, oh. The muscles you exercise (abs) and where you lose fat (tummy, etc.) are not related. Muscles are muscles, and fat is fat. Your genetics/body determines where the fat comes from. All this lack of interest by the fitness industry on effective strength training is doubly ironic because besides the enormous health and fitness benefits for keeping up your muscles, no matter your weight, muscle is metabolically active. The amount of muscle you have determines how many calories your body burns throughout the day, even as you sit. Loss of muscle as we age (natural part of aging for both men and women) is one key reason we gain weight as we age, a concern that pushes many to exercise, but without strength-training—you see the irony. The more muscle you have, the more calories your body burns at all times, while an activity like running even a whole hour, not an easy feat, can be offset by eating a sandwich and an apple. And active people tend to get hungry, naturally, and add those extra calories to their diet. Besides, caloric restriction dieting (especially if it’s severe and without exercise) often results in muscle loss, which makes people even more likely to gain weight once they stop their diet, as their body now has proportionally more fat and less muscle compared to before the diet. They’ll now gain weight on even fewer calories per day, leading to further frustration and cycles of yo-yo dieting and weight gain. SO, WORK YOUR MUSCLES Strength training exercises have a few basic principles. First, you must stress your muscles, meaning that it doesn’t work if you don’t push yourself a little. Your body is honed to conserve energy, convincing it to keep building muscles requires giving it a good reason, i.e. a bit of stress. That’s what’s wrong with that 2 lbs dumbbell. If a weight becomes too easy because you've grown strong, increase it a little. Once that’s easy, too, increase that. That principle underlies all strength training. Second, you must allow for time to rest, so don’t do strength training on the same muscle two days in a row. Rest is when your body decides to and can build up the muscle you stressed. The exercise is the signal, the rest is when the real work is done. Third, exercise all your muscle groups, in turn. You can use dumbbells, whole body exercises (great), strength training elastics. The principle is the same. You need to learn the names of the main muscles, and which exercises use which. (Here, this two pager has most of what you need). You can train for as little as two days of the week (say, back, triceps, trap and hamstrings one day, and chest, biceps and quadriceps the other day, and abs on both). You can train four days of the week (with rest days in between) or any combination. It usually takes 20–30 minutes each time, so you are looking at 20 minutes twice a week at a minimum. Remember, always take rest days, that’s when your body takes the chance to build that muscle, which is your goal. There are some good guidelines out there. Here’s a one. Here’s another. This isn’t bad either. Remember, ignore the unrealistic pictures. You won’t and almost certainly cannot look “ripped.” But you are best off learning the principle: look at that guide of major muscles, and make sure you exercise all of them, once or twice a week, with weights that challenge but not overwhelm you. If you are using dumbbells, here’s your rule of thumb: Pick a weight you can comfortably lift 12 times, rest a few minutes, lift for another 10–12 times, rest a few minutes more, but can barely lift 8 more the last time (called a set). You’ll have done three sets, and you are done with that muscle. If you go too easy your first try, increase it the next time. If you start too heavy, decrease it a bit. Err on the side of caution. You can apply the same rule of thumb if you are using whole body exercises (like pushups, squats and pullups). First, do a number (probably around 5–10) that leaves you tired, but not exhausted. Repeat. If you got it right, by the third set, you should be really feeling spent, but not miserable. Stop when you can’t do anymore. Remember, if you feel miserable, you’ve overdone it. You’ll find your sweet spot quickly, and you’ll soon learn to know what your body can do, and what feels right. When in doubt, stop. Don’t overdo it. You can try again later. The first few weeks of weight-lifting will be accompanied by a soreness that starts a day or two late—it’s called delayed onset muscle soreness. It should feel like soreness, not serious pain. This is very common. It’s okay. It won’t always be that way. It’s a normal part of starting weight-training from scratch. If you read online guides, remember ignore the parts about looks, weight, “toning” and various admonitions. You need to lift weights because stronger muscles are going to make you healthy, less prone to injury and more fit. GET YOURSELF HUFFING AND PUFFING I have even less to say about aerobic exercise, the part that conditions your cardiovascular system. What we know is exceedingly straightforward (except how to get people to do it). Every study finds more benefits. It doesn’t matter what you do as long as you are left somewhat breathless, but not too much. You can run, bike, walk briskly (not leisurely). You can dance, hop, skip and jump. You can swim or spin. If you go to an exercise class, remember, almost all the dancing choreography is to keep you interested and somewhat distracted; it is not the part that’s benefiting your health. If you just want to jump up and down, while the rest of the class twirls to a modified samba step, that works, too. Just move. How long? I’ll be straight. Like most things, most of the benefits are in the initial ramp-up, not the margins. If you are sedentary, just doing some cardio, even 30 minutes a week, 10 minutes at a time, will get you some real benefits. If I were doing bare bones, I’d say try 20 minutes at a time, three times a week. That’s just one hour the whole week. Research observes real benefits even to that little. But don’t stop there: the research also strongly suggests that you should try to do about 150 minutes per week, or 30 minutes, per day, for at least five days of the week. That’s two-and-a-half hours per week. By the way, if you have a desire to lose weight, research shows that people who've lost weight and kept it off long-term through non-surgical means, have mostly done it primarily through (drastically) lower caloric intake plus about an hour of exercise per day, everyday. Research also shows more weight-loss benefits to strength-training than aerobic exercise. But that’s a whole other issue: remember, exercise is for health. How little at a time? 10 minutes seems to be the absolute minimum that starts accruing benefits. So if you can do 10 minutes every day, do it. You’ll benefit. But if you can, increase it. How hard? There are heartbeat calculators and formulas out there, but here’s your rule-of-thumb: You should be huffing and puffing a bit, but able to talk. If you are so out of breath that you can’t talk, slow down, and then gradually stop. Catch your breath. If you can hold a conversation with no huffing and puffing, it’s too easy: step it up. If you can, throw small spikes into your exercise. These are called intervals. While walking briskly, for example, break into a jog for 20–30 seconds, and start walking again. Do it 2–3 times in your whole routine. Research shows that intervals help fitness benefits. But don’t worry about it. This is optional. You don’t need to read 30 articles on the best interval method. You don’t even need to do them if you don’t feel like it. There is one last trick, one that actually works, in this field of a million tricks which don’t work. You can combine your strength and aerobic exercises, by doing your strength-training at a brisk pace, hence keeping your heart-rate up, for the whole 20–30 minutes in which you are stressing your muscles. This exercise routine by Jillian Michaels, available seemingly legally on Youtube in both introductory and intermediate forms, is very good in that it does really cover most major muscle groups, and is done briskly enough to be good for both cardio and strength. Ignore its name: just this won’t make you “shred.” I’ve heard that she later became a TV star with a show that’s focused on losing weight, which I’ve never watched and I actually find the idea somewhat disturbing, but the routine is good and she is mostly telling the truth throughout the video which is a rare thing in this industry. If you were crunched for time, you could get a lot out of doing the beginning version of that particular routine, and pushing yourself progressively harder, just 3–4 times a week, moving up to the intermediary version, and maybe a brisk walk or two here and there for 10–20 minutes. By the time you are too fit for the intermediate version, you will have learned a lot about your body, and how to push yourself appropriately. So, here it is: Build your muscles by stressing them, but don’t forget to rest. Get your heart rate up at least a few times a week, for about 20 minutes at a time. That’s, umm, it. Most important part of this is that you will find your own groove, and your activity, as long as it fits the above broad outline. Over time, I have gotten aerobic exercise through a variety of means, including the thai-boxing ring, biking, running and basketball when I was younger (I’m not good at any of those! In fact, I’m, ahem, lousy at most. I’ve always been fortunate enough to find people who enjoyed the sport and friendly competition, not aggressive one-upmanship). At the moment, I have a time-intensive job which involves a lot of writing, so I’ve found other ways to incorporate exercise into my day. Most months, I lift weights. Sometimes, I do whole body exercises. I switch routines as I get bored. I own an elliptical that I bought for $400 about 10 years ago and use almost every week, and I’ve recently acquired a treadmill desk. I’ve packed away my television, and the only time I watch a screen for leisure is on the elliptical, which motivates me to get on it. I think better when I walk, so the treadmill desk helps with that while getting the brisk walking in. But this is me. I don’t have an answer for what will work for you, but I encourage you to find something you enjoy. Swim with a waterproof music player, and make it your time to listen to music you miss. Go for a brisk walk with a buddy, and chat. Dance for 20 minutes. Take a class, and don’t worry if you can’t do all the complicated moves. Just move, briskly, 20–30 minutes at a time. Lift weights, or do whole bodyweight moves a few times a week. Listen to podcasts or audiobooks. Tune out and just focus on the exercise. Whatever works for you, and your body, and your motivation. That’s it. There is, surely, a lot more to learn about fitness, exercise and health but those two bolded sentences above are the core basics, and that’s where most of the benefits are. All the fads, promises, tricks are confusing and misleading. The intense focus on weight-loss and exercise, especially for women, is doubly misleading and harmful because everyone benefits from exercise while weight-loss is fraught, complicated and frustrating. Exercise because exercise. Don’t listen to the exercise industry, don’t look at the ads, and don’t read articles that spend a lot of time on the latest thing or trick. Forget the resolutions. Forget the fads. Lift. Move. Regularly. That’s it. You can do it. Go. "}