{"parent": "", "timestamp": "Mar 20", "title": "10 Things I Had to Give Up to Heal My Anxiety", "sentences": [{"3eb6": "10 Things I Had to Give Up to Heal My Anxiety"}, {"beeb": "“Adapt what is useful, reject what is useless, and add what is specifically your own.”- Bruce Lee"}, {"faca": "To achieve something great, it is more important to focus on what you need to take away rather than what you need to add. Although there is a certain fetishization with productivity in modern society, I believe adding habits is a form of procrastination."}, {"c9fe": "If you are anything like I used to be, you tend to overcommit. Similar to a dog walking through a pet store, I was always chasing every new scent that crossed the precipice of my nose, never going deep on a single goal, in fear of what I may be missing out on if I did."}, {"b2da": "Even though anxiety was clearly causing 80% of my negative outcomes in life, I kept telling myself that if I just achieved an external goal, my anxiety would be healed as a derivative.If you have ever tried this method, then you know how it turned out for me."}, {"b1eb": "I got everything I went after. A job at a startup. A promotion. A business on the side. Lost 15 lbs. The list of achievements went on and on as my anxiety sat on the back burner, waiting to be miraculously healed through association."}, {"0940": "Two Rabbits = No Rabbits"}, {"0ba0": "“He who chases two rabbits, catches none.” — Confucius"}, {"d17b": "I distinctly remember the day when I finally had enough of this shotgun approach. I was getting ready to head on a trip out of the country on a little journey, and I was feeling anxious about it. My anxiety level was a 6/10, which a year prior I would have been ecstatic about, but a level that was still detracting too much energy and happiness from my life."}, {"2fda": "During a run the week before the trip, the frustration finally built up to the point where I couldn’t continue running. I remember stopping and being completely frustrated. I had come so far in my healing, but it was still taking away from my life. I had come to my tipping point. I was done with my half-assed attempts to heal myself."}, {"29df": "Anxiety had always been an adjacent goal. One that never took center stage. When I hit the tipping point on that run, I realized that if I was ever going to achieve any external success, I had to first achieve internal healing."}, {"fd2d": "From that moment forward, I became a military strategist, planning my moves according to a constant focus on a single goal, victory. For me, victory was healing my anxiety. And after a couple of months, I won."}, {"9d3f": "You can achieve almost anything in life if you militantly prioritize. You can’t be an author, businessman, marathoner, adventurist, and politician all this year, but you may be able to be all of those things in a decade or two."}, {"a04a": "Realize that the real opportunity cost is not committing. When you haphazardly go after things in life, and I am as guilty as the next guy, you fail to achieve anything of great stature. As Confucius said, “He who chases two rabbits, catches none,”"}, {"b3de": "What follows are the things that I had to give up to heal. Some I have reintroduced into my life because they add value, but I have left most out. You can see tremendous results by adjusting the knobs in your life. Here are the knobs that I adjusted."}, {"4588": "10 Things I Had to Give Up to Heal My Anxiety"}, {"71be": "1. Friends"}, {"70f0": "“Whenever you find yourself on the side of the majority, it is time to pause and reflect” — Mark Twain"}, {"e808": "I’m often asked by readers, what is the most important aspect to focus on to alleviate my anxiety?"}, {"3492": "My answer is always the same: Relationships."}, {"549c": "I’m not positive if you become the average of the five people you spend the most time with, but I am confident that if your lifestyle does not add to your healing, it will subtract from it."}, {"546d": "For me, the people I was spending my time with were not conducive to my healing. Not that I don’t love my friends, I do. But they were not on the same path I was, and I needed to eject myself to heal myself."}, {"8c8e": "So I went to the extreme and moved to an entirely different city where I knew almost no one. I spent the first 90 days there focusing solely on myself and my growth."}, {"6b26": "Now that may sound selfish or insincere, but if I had never made that leap, I would not be sitting here writing this article. I thoroughly believe that success in life, however you define it, is the result of how many tough conversations you are willing to have."}, {"ac1f": "There is no harder discussion than telling a friend or a group of friends that you no longer want to have a relationship with them. But, at the same time, there may not be anything more important in life than being true to yourself and finding your tribe."}, {"e0da": "You may hate this answer. You may think I am a dick for saying it. Or you may say that you could never leave “your boys.”"}, {"2426": "And my response is this, how much is your life worth?"}, {"5ad5": "It is okay to act selfishly in the short term for long term health and well-being. Don’t be cynical but understand that no one else is going to take care of you. You need to take care of yourself."}, {"b1d1": "Stop thinking about what you have “invested.”"}, {"d90a": "Relationships are essential to your growth and healing. Leaving one, whether intimate or not, is hard. You will feel bad. But understand that you are making this decision in the short-term for your long-term health."}, {"af31": "Later on, after you healed yourself, reassess the relationships by slowly dipping yourself back into them. But you will often find that when you step away for a bit and focus on developing relationships with people that more closely align with your value, you will not miss the old way of life."}, {"0d73": "Have the hard conversations."}, {"0278": "2. Alcohol"}, {"4ec0": "“A wise man will be master of his mind, A fool will be its slave” — Publilius Syrus"}, {"c049": "Alcohol is not inherently dangerous, and I have reintroduced it back into my life, albeit at a much smaller volume, but if you want to take back control of your life, it is not helping you. It is hindering you. Self-medicating, at whatever level, is dangerous and will leave you much worse off. Alcohol specifically is a depressant, and the hangovers will cause anxiety like no other."}, {"9573": "I gave up alcohol for a full ninety days at the onset of my journey. It was an eye-opening experience, realizing just how much of my social and professional life revolved around the liquid. What was even more interesting was the responses I got from people when I told them I wasn’t drinking."}, {"15db": "“Really? Come on man, just have one.”"}, {"3980": "People were so offended, believing I was making some declaration against their lifestyle, which I wasn’t. I was simply being intentional about mine."}, {"6ee0": "If you need a couple of beers to feel sociable, or if you struggle to talk to colleagues without some liquid courage, you should think long and hard about whether you want this dependence in your life. Depending on a substance to give you a result will lower the agency you have over your life."}, {"0eb5": "Everything in moderation, but if you can’t remember the last time you went thirty days without a drink, maybe it’s worth an experiment. At the very least, you may lose some weight! 🙂"}, {"f49c": "3. News"}, {"d9e5": "I didn’t vote."}, {"800b": "There, I admitted it. I get it. I get it. It’s my civic duty, blah blah blah."}, {"82ee": "I get it. It’s my civic duty, blah blah blah."}, {"e795": "But to me, healing my anxiety and personal growth was more important than following the buffoonery that was the news of 2016."}, {"77f0": "I first gave it up in January when I realized that it was the primary trigger for my catastrophizing of events, and found it so helpful that I never picked it back up."}, {"d5a4": "I am not ignorant of events, although I think we all would be happier if we hid under rocks last year. I was just committed to healing, and the news was a detriment, specifically digital media that thrives on the raunchy and terrifying to drive clicks."}, {"8a25": "Instead, I focused on what Jeff Bezos calls the things that don’t change. Taking the time to read about the men and women who have changed the world throughout past centuries. Timeless books that are just as true now as they were when they were published."}, {"a7a2": "“Breaking news” should be something you curate, not something controlled by a 24-year-old sitting in a cubicle. Be diligent."}, {"dcea": "4. Scarcity Mindset"}, {"e5c0": "“The greater danger for most of us in not that our aim is too high and we miss it, but that it is too low and we hit it.” Aristotle"}, {"b642": "One of the biggest anchors keeping me from growth was how I viewed the world. I thought everything was scarce."}, {"9a81": "If I left my job, I would never find a new one, I thought. Or if I spent $1,000 on a personal development seminar, it was cash lost without a return."}, {"34e6": "However, to heal, I had to change to an abundant mindset. I had to view the world as a beautiful place that was overflowing with goodness, rather than one in which I had to hold my chips close to my chest for fear that they were the only ones I would ever be given."}, {"b7eb": "Not only did this drastically help me take the steps necessary to healing my anxiety, but it has also led to exponential clarity in every facet of my life."}, {"024d": "Start looking at what life has already given you. Not what you don’t have. For it is only when you make this change of mind that your cup will start overflowing with abundance."}, {"ef05": "5. Social Media"}, {"afa0": "Oh, the highlight reel."}, {"db40": "I’ll keep this brief if you are someone who is always comparing yourself to others, delete your fucking social media accounts. You will not be left in the stone age. You will not lose contact with your friends. And you will not miss out."}, {"3280": "Think long and hard about what matters. I promise you social media does NOT."}, {"9e7d": "6. Single Pursuit of Money"}, {"2c14": "“If you say that money is the most important thing, you’ll spend your life completely wasting your time: You’ll be doing things you don’t like doing in order to go on living, that is, in order to go on doing things you don’t like doing — which is stupid!” — Alan Watts"}, {"c923": "At the end of 2015, I had a decision to make. Either I was going to stay at my secure consulting job, or I was going to move to New York, away from my now fiancée, to take a job at a startup for half the salary. This decision was hard because it went against everything I have to believe since taking my first finance class at University."}, {"b5db": "But, I needed change. I needed to get uncomfortable. And most importantly, I needed to start making decisions that were not rooted in money."}, {"cafe": "Where in your life are you hesitating because of a fear of not being “successful?”"}, {"0a24": "7. Television"}, {"a3b8": "If you’re just starting out as a writer, you could do worse than strip your television’s electric plug-wire, wrap a spike around it, and then stick it back into the wall. See what blows, and how far. Just an idea. — Stephen King"}, {"4bdf": "Another confession, I haven’t had a tv for 15 months. What first started out of circumstance with my move to New York, carried on as an intentional way to live my life. When you have a tv, whether you mindfully are watching it or not, it will be the perfect filler for dead space. For me, I wanted to cultivate this dead space in my life."}, {"4b42": "When people ask how I read 80+ books in the last 15 months, I tell them, “It’s simple. Pull the television cord out of your wall and throw the damn thing away.”"}, {"1f8c": "Similar to social media, television is not helping you live a better life. I promise you."}, {"49a1": "If you love movies, then make the intentional step to actually (hold your breath) go to the movie theater. That way you are mindful about it."}, {"8a76": "The lack of a tv has been the biggest life hack I have found thus far."}, {"879e": "8. What Others Thought of Me"}, {"360c": "“A man is rich in proportion to the number of things he can afford to let alone.” — Henry David Thoreau"}, {"1cd4": "As someone who struggled with anxiety, I cared far too much about what other people thought about me. I won’t go into much detail, but I will say this…"}, {"5f63": "Fuck them."}, {"ac7d": "Fuck their opinions. Fuck their validation. Fuck it so hard that it swings around and kicks your ass further toward the life you want."}, {"7e7d": "Caring about what others think about you, or your work, is the single greatest deterrent from living the life you want."}, {"637c": "It is a lifelong battle, but start it now, so you don’t wake up at 50 in a house in the suburbs, confused how you got there, realizing that someone else’s opinion dictated your every decision."}, {"2fa0": "I took the advice of Brene Brown to heart by writing down a short list of people that I care what they think about my work. Some are in the creative arena, trying to build something out of nothing, and some of them are close friends. But none of them are critics vying for me to see the world “their way.”"}, {"9667": "Do the same. Create a short list of the people whose opinions matter. And forget the rest."}, {"bdf1": "9. Self-Labeling"}, {"121b": "“A man is what he constantly thinks about all day” — Ralph Waldo Emerson"}, {"e7ad": "The day I stopped labeling myself as an “anxious person” my healing took a new trajectory."}, {"55a2": "I hear it all the time from readers and individuals in the mental health world. They love labels. They are always creating new ones."}, {"b2d1": "The other day a mother reached out to me asking for advice. She told me her son was diagnosed with “sensitive child syndrome.”"}, {"e8a1": "I couldn’t help but think to myself, are you fucking kidding me? That’s why your child is struggling. He doesn’t have a chance if you are always labeling him with terms that are not only getting more absurd but are completely debilitating."}, {"a8b1": "Now, I understand that it is important, medically, to diagnose patients. But at what costs and lengths must we go?"}, {"8b8e": "My thing is, who cares, what you are. Does having some label make you better? Does it help you heal yourself faster? Labels, in my opinion, are making you worse, not better. They put you in the victim mentality from where it is next to impossible to heal yourself."}, {"7d22": "Stop labeling yourself and start putting your energy into finding a solution. Yes, I am telling you to fool yourself. How else do you think growth happens?"}, {"2ee8": "10. 80% of My Things"}, {"65d2": "“The things you own, end up owning you.” — Tyler Durden in Fight Club"}, {"19f8": "When I made the decision to move to New York, I threw out 80% of what I owned, and I could not be happier. Material possessions, in my opinion, are weights that will hold you back from taking risks. They will slow your decision to move to a new city, leave a job, or start a business."}, {"1793": "I didn’t want that. I wanted to be nimble, able to make decisions without having to think about what I owned. I pursued learning and experiences, and they have brought me 10x the benefits."}, {"7c67": "Decrease to Increase"}, {"b77a": "Now, I don’t believe that you need to give up everything that I did. The list above is just what I had to decrease to increase my life. Your list will be different."}, {"7e72": "It is far easier to try to add things to your life continuously, and much harder to radically delve into the dirt of life to find the weeds. But unless you find the weeds and eradicate them from your life, you will never have sustained healing. I urge you to practice what Jerry Colonna calls “radical self-inquiry,” searching for the dark areas within, leaving no stone unturned, to finally heal yourself."}, {"93aa": "It will be hard. It will be worth it."}, {"4c31": "Go Deeper"}, {"2df0": "Are you ready to wake up, get more focused, and find more happiness in your life?"}, {"c4f9": "If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness!"}, {"2536": "If you are ready to take back control of your life and start living above stress and overwhelm…"}, {"6f22": "Sign Up Here!"}, {"689f": "One last thing…"}, {"1fec": "If you liked this article, click the💚 below so other people will see it here on Medium."}, {"db1b": "Originally published at www.fullyrichlife.com on March 20, 2017."}], "author": "Benjamin Foley", "child": "1719_1\t1719_2\t1719_3\t1719_4\t1719_5\t1719_6\t1719_7\t1719_8\t1719_9\t1719_10\t1719_11\t1719_12\t1719_13\t1719_14\t1719_15\t1719_16\t1719_17\t1719_18\t1719_19\t1719_20\t1719_21\t1719_22\t1719_23\t1719_241719_1\t1719_2\t1719_3\t1719_4\t1719_5\t1719_6\t1719_7\t1719_8\t1719_9\t1719_10\t1719_11\t1719_12\t1719_13\t1719_14\t1719_15\t1719_16\t1719_17\t1719_18\t1719_19\t1719_20\t1719_21\t1719_22\t1719_23\t1719_24", "name": "1719", "content": "10 Things I Had to Give Up to Heal My Anxiety “Adapt what is useful, reject what is useless, and add what is specifically your own.”- Bruce Lee To achieve something great, it is more important to focus on what you need to take away rather than what you need to add. Although there is a certain fetishization with productivity in modern society, I believe adding habits is a form of procrastination. If you are anything like I used to be, you tend to overcommit. Similar to a dog walking through a pet store, I was always chasing every new scent that crossed the precipice of my nose, never going deep on a single goal, in fear of what I may be missing out on if I did. Even though anxiety was clearly causing 80% of my negative outcomes in life, I kept telling myself that if I just achieved an external goal, my anxiety would be healed as a derivative.If you have ever tried this method, then you know how it turned out for me. I got everything I went after. A job at a startup. A promotion. A business on the side. Lost 15 lbs. The list of achievements went on and on as my anxiety sat on the back burner, waiting to be miraculously healed through association. Two Rabbits = No Rabbits “He who chases two rabbits, catches none.” — Confucius I distinctly remember the day when I finally had enough of this shotgun approach. I was getting ready to head on a trip out of the country on a little journey, and I was feeling anxious about it. My anxiety level was a 6/10, which a year prior I would have been ecstatic about, but a level that was still detracting too much energy and happiness from my life. During a run the week before the trip, the frustration finally built up to the point where I couldn’t continue running. I remember stopping and being completely frustrated. I had come so far in my healing, but it was still taking away from my life. I had come to my tipping point. I was done with my half-assed attempts to heal myself. Anxiety had always been an adjacent goal. One that never took center stage. When I hit the tipping point on that run, I realized that if I was ever going to achieve any external success, I had to first achieve internal healing. From that moment forward, I became a military strategist, planning my moves according to a constant focus on a single goal, victory. For me, victory was healing my anxiety. And after a couple of months, I won. You can achieve almost anything in life if you militantly prioritize. You can’t be an author, businessman, marathoner, adventurist, and politician all this year, but you may be able to be all of those things in a decade or two. Realize that the real opportunity cost is not committing. When you haphazardly go after things in life, and I am as guilty as the next guy, you fail to achieve anything of great stature. As Confucius said, “He who chases two rabbits, catches none,” What follows are the things that I had to give up to heal. Some I have reintroduced into my life because they add value, but I have left most out. You can see tremendous results by adjusting the knobs in your life. Here are the knobs that I adjusted. 10 Things I Had to Give Up to Heal My Anxiety 1. Friends “Whenever you find yourself on the side of the majority, it is time to pause and reflect” — Mark Twain I’m often asked by readers, what is the most important aspect to focus on to alleviate my anxiety? My answer is always the same: Relationships. I’m not positive if you become the average of the five people you spend the most time with, but I am confident that if your lifestyle does not add to your healing, it will subtract from it. For me, the people I was spending my time with were not conducive to my healing. Not that I don’t love my friends, I do. But they were not on the same path I was, and I needed to eject myself to heal myself. So I went to the extreme and moved to an entirely different city where I knew almost no one. I spent the first 90 days there focusing solely on myself and my growth. Now that may sound selfish or insincere, but if I had never made that leap, I would not be sitting here writing this article. I thoroughly believe that success in life, however you define it, is the result of how many tough conversations you are willing to have. There is no harder discussion than telling a friend or a group of friends that you no longer want to have a relationship with them. But, at the same time, there may not be anything more important in life than being true to yourself and finding your tribe. You may hate this answer. You may think I am a dick for saying it. Or you may say that you could never leave “your boys.” And my response is this, how much is your life worth? It is okay to act selfishly in the short term for long term health and well-being. Don’t be cynical but understand that no one else is going to take care of you. You need to take care of yourself. Stop thinking about what you have “invested.” Relationships are essential to your growth and healing. Leaving one, whether intimate or not, is hard. You will feel bad. But understand that you are making this decision in the short-term for your long-term health. Later on, after you healed yourself, reassess the relationships by slowly dipping yourself back into them. But you will often find that when you step away for a bit and focus on developing relationships with people that more closely align with your value, you will not miss the old way of life. Have the hard conversations. 2. Alcohol “A wise man will be master of his mind, A fool will be its slave” — Publilius Syrus Alcohol is not inherently dangerous, and I have reintroduced it back into my life, albeit at a much smaller volume, but if you want to take back control of your life, it is not helping you. It is hindering you. Self-medicating, at whatever level, is dangerous and will leave you much worse off. Alcohol specifically is a depressant, and the hangovers will cause anxiety like no other. I gave up alcohol for a full ninety days at the onset of my journey. It was an eye-opening experience, realizing just how much of my social and professional life revolved around the liquid. What was even more interesting was the responses I got from people when I told them I wasn’t drinking. “Really? Come on man, just have one.” People were so offended, believing I was making some declaration against their lifestyle, which I wasn’t. I was simply being intentional about mine. If you need a couple of beers to feel sociable, or if you struggle to talk to colleagues without some liquid courage, you should think long and hard about whether you want this dependence in your life. Depending on a substance to give you a result will lower the agency you have over your life. Everything in moderation, but if you can’t remember the last time you went thirty days without a drink, maybe it’s worth an experiment. At the very least, you may lose some weight! 🙂 3. News I didn’t vote. There, I admitted it. I get it. I get it. It’s my civic duty, blah blah blah. I get it. It’s my civic duty, blah blah blah. But to me, healing my anxiety and personal growth was more important than following the buffoonery that was the news of 2016. I first gave it up in January when I realized that it was the primary trigger for my catastrophizing of events, and found it so helpful that I never picked it back up. I am not ignorant of events, although I think we all would be happier if we hid under rocks last year. I was just committed to healing, and the news was a detriment, specifically digital media that thrives on the raunchy and terrifying to drive clicks. Instead, I focused on what Jeff Bezos calls the things that don’t change. Taking the time to read about the men and women who have changed the world throughout past centuries. Timeless books that are just as true now as they were when they were published. “Breaking news” should be something you curate, not something controlled by a 24-year-old sitting in a cubicle. Be diligent. 4. Scarcity Mindset “The greater danger for most of us in not that our aim is too high and we miss it, but that it is too low and we hit it.” Aristotle One of the biggest anchors keeping me from growth was how I viewed the world. I thought everything was scarce. If I left my job, I would never find a new one, I thought. Or if I spent $1,000 on a personal development seminar, it was cash lost without a return. However, to heal, I had to change to an abundant mindset. I had to view the world as a beautiful place that was overflowing with goodness, rather than one in which I had to hold my chips close to my chest for fear that they were the only ones I would ever be given. Not only did this drastically help me take the steps necessary to healing my anxiety, but it has also led to exponential clarity in every facet of my life. Start looking at what life has already given you. Not what you don’t have. For it is only when you make this change of mind that your cup will start overflowing with abundance. 5. Social Media Oh, the highlight reel. I’ll keep this brief if you are someone who is always comparing yourself to others, delete your fucking social media accounts. You will not be left in the stone age. You will not lose contact with your friends. And you will not miss out. Think long and hard about what matters. I promise you social media does NOT. 6. Single Pursuit of Money “If you say that money is the most important thing, you’ll spend your life completely wasting your time: You’ll be doing things you don’t like doing in order to go on living, that is, in order to go on doing things you don’t like doing — which is stupid!” — Alan Watts At the end of 2015, I had a decision to make. Either I was going to stay at my secure consulting job, or I was going to move to New York, away from my now fiancée, to take a job at a startup for half the salary. This decision was hard because it went against everything I have to believe since taking my first finance class at University. But, I needed change. I needed to get uncomfortable. And most importantly, I needed to start making decisions that were not rooted in money. Where in your life are you hesitating because of a fear of not being “successful?” 7. Television If you’re just starting out as a writer, you could do worse than strip your television’s electric plug-wire, wrap a spike around it, and then stick it back into the wall. See what blows, and how far. Just an idea. — Stephen King Another confession, I haven’t had a tv for 15 months. What first started out of circumstance with my move to New York, carried on as an intentional way to live my life. When you have a tv, whether you mindfully are watching it or not, it will be the perfect filler for dead space. For me, I wanted to cultivate this dead space in my life. When people ask how I read 80+ books in the last 15 months, I tell them, “It’s simple. Pull the television cord out of your wall and throw the damn thing away.” Similar to social media, television is not helping you live a better life. I promise you. If you love movies, then make the intentional step to actually (hold your breath) go to the movie theater. That way you are mindful about it. The lack of a tv has been the biggest life hack I have found thus far. 8. What Others Thought of Me “A man is rich in proportion to the number of things he can afford to let alone.” — Henry David Thoreau As someone who struggled with anxiety, I cared far too much about what other people thought about me. I won’t go into much detail, but I will say this… Fuck them. Fuck their opinions. Fuck their validation. Fuck it so hard that it swings around and kicks your ass further toward the life you want. Caring about what others think about you, or your work, is the single greatest deterrent from living the life you want. It is a lifelong battle, but start it now, so you don’t wake up at 50 in a house in the suburbs, confused how you got there, realizing that someone else’s opinion dictated your every decision. I took the advice of Brene Brown to heart by writing down a short list of people that I care what they think about my work. Some are in the creative arena, trying to build something out of nothing, and some of them are close friends. But none of them are critics vying for me to see the world “their way.” Do the same. Create a short list of the people whose opinions matter. And forget the rest. 9. Self-Labeling “A man is what he constantly thinks about all day” — Ralph Waldo Emerson The day I stopped labeling myself as an “anxious person” my healing took a new trajectory. I hear it all the time from readers and individuals in the mental health world. They love labels. They are always creating new ones. The other day a mother reached out to me asking for advice. She told me her son was diagnosed with “sensitive child syndrome.” I couldn’t help but think to myself, are you fucking kidding me? That’s why your child is struggling. He doesn’t have a chance if you are always labeling him with terms that are not only getting more absurd but are completely debilitating. Now, I understand that it is important, medically, to diagnose patients. But at what costs and lengths must we go? My thing is, who cares, what you are. Does having some label make you better? Does it help you heal yourself faster? Labels, in my opinion, are making you worse, not better. They put you in the victim mentality from where it is next to impossible to heal yourself. Stop labeling yourself and start putting your energy into finding a solution. Yes, I am telling you to fool yourself. How else do you think growth happens? 10. 80% of My Things “The things you own, end up owning you.” — Tyler Durden in Fight Club When I made the decision to move to New York, I threw out 80% of what I owned, and I could not be happier. Material possessions, in my opinion, are weights that will hold you back from taking risks. They will slow your decision to move to a new city, leave a job, or start a business. I didn’t want that. I wanted to be nimble, able to make decisions without having to think about what I owned. I pursued learning and experiences, and they have brought me 10x the benefits. Decrease to Increase Now, I don’t believe that you need to give up everything that I did. The list above is just what I had to decrease to increase my life. Your list will be different. It is far easier to try to add things to your life continuously, and much harder to radically delve into the dirt of life to find the weeds. But unless you find the weeds and eradicate them from your life, you will never have sustained healing. I urge you to practice what Jerry Colonna calls “radical self-inquiry,” searching for the dark areas within, leaving no stone unturned, to finally heal yourself. It will be hard. It will be worth it. Go Deeper Are you ready to wake up, get more focused, and find more happiness in your life? If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness! If you are ready to take back control of your life and start living above stress and overwhelm… Sign Up Here! One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. Originally published at www.fullyrichlife.com on March 20, 2017. "}