{"parent": "", "timestamp": "Apr 6", "title": "10 Years Ago I Collapsed From Burnout and Exhaustion, And It’s The Best Thing That Could Have Happened To Me", "sentences": [{"2171": "10 Years Ago I Collapsed From Burnout and Exhaustion, And It’s The Best Thing That Could Have Happened To Me"}, {"8394": "It was a day I’ve talked and written about dozens of times — the day I collapsed from sleep deprivation and exhaustion, broke my cheekbone and woke up in a pool of blood. And it happened on April 6th, 2007, which makes today the 10th anniversary (thank you for all the cards and letters). But, actually, it is a day to mark for me, less for the symbolism of the anniversary and more for what’s happened in the decade since. For me, it’s a prime example of how good things can come out of bad things — how, very often, events that come to define our lives in positive ways would never have happened without events that were painful and sometimes, yes, even bloody!"}, {"5d06": "For me, that day literally changed my life. It put me on a course in which I changed how I work and how I live. It put me on a course of writing two books, Thrive and The Sleep Revolution. And, not long after that, it led to me leaving a very successful company I co-founded and ran for 11 years to launch another one, Thrive Global."}, {"974c": "So collapsing into a bloody mess might seem an odd thing to celebrate, but it was the seed of an amazing ten years for me. And, in fact, one of my goals with Thrive Global is to provide a softer wake-up call, to provide the catalyst for other people to get on a different course that can bring just as many positive changes to their lives without hitting the wall–or the floor!"}, {"5b6d": "But even though much of my life has changed, what’s amazing as I look back over these ten years is how much the world has also changed. Burnout–and awareness about its dangers–is now a front-burner topic, both collectively and individually. It’s a part of our everyday conversation and, collectively, it’s finally coming to be regarded as the public health issue it is. More and more people are coming out to talk about their own wake-up calls, or how they changed their lives, or just about problems they’re having changing the way they work and live. For example, there was this memorable 2013 New York Times piece by Erin Callan, the former CFO of Lehman Brothers. “Work always came first,” she wrote, “before my family, friends and marriage — which ended just a few years later.” Looking back, she now realizes that it didn’t have to be this way: “I didn’t have to be on my BlackBerry from my first moment in the morning to my last moment at night. I didn’t have to eat the majority of my meals at my desk. I didn’t have to fly overnight to a meeting in Europe on my birthday. I now believe that I could have made it to a similar place with at least some better version of a personal life.”"}, {"07bc": "What’s notable isn’t just the insight, but that we’ve reached a point where more and more people are ready to go public with stories like this. We’ve finally gotten to a time in which it’s not burnout that’s considered a sign of strength, but avoiding it. That’s a huge change."}, {"a27e": "And as this has happened, the ways in which we avoid burnout have also come out of the shadows. We’ve gone from a time in which meditation and mindfulness were seen as vaguely flaky and new age-y to a time in which CEO after CEO comes out discussing the ways prioritizing their well-being strengthens them as leaders. There’s Mark Benioff, CEO of Salesforce, Padmasree Warrior, CEO of NIO U.S., Ray Dalio, Chairman and former CEO of Bridgewater, Mark Bertolini, CEO of Aetna, Barry Sommers, CEO of the consumer bank at Chase, and Melinda Gates, Co-Chair of the Bill and Melinda Gates Foundation — talking about their meditation practices just as freely as they talk about their business projections. In fact, the two are very connected. On The Thrive Journal, Amazon CEO Jeff Bezos talked about his habit of getting eight hours of sleep in terms of his responsibility to Amazon shareholders: “Making a small number of key decisions well is more important than making a large number of decisions. If you shortchange your sleep, you might get a couple of extra ‘productive’ hours, but that productivity might be an illusion. When you’re talking about decisions and interactions, quality is usually more important than quantity.”"}, {"a1fe": "Sleep deprivation has gone from something you’d brag about in a job interview to a giant red flag. This was LinkedIn’s Chief Human Resource Officer Pat Wadors in 2015: “Trust me, it’s not a badge of honor to brag that you can get by on 4 hours or 5 each night…You intimate that with fewer hours “wasted on sleep” you are more productive. Nope. Can’t buy that. When you brag about that, you are telling me that it’s ok for you to harm your health and not perform your best at work or at home. Is that something to brag about?”"}, {"806d": "Perhaps the best example of sleep’s new status as the ultimate performance enhancer is how it’s been embraced by the world of elite sports. It’s now rare to see a professional team without a sleep specialist on board, and without players wearing sleep trackers every night. And many of them have no problem speaking out about their use of sleep as a vital part of their training — and their performance."}, {"3602": "Andre Iguodala, named the Most Valuable Player of the 2015 NBA Finals, credits his improved numbers on the court to his improved sleep numbers at home. His advice for anybody who feels out of balance? “Sleep more and workout more.” Tom Brady is as famous for his near religious devotion to his sleep routine as he is for studying game plans. For him this often means going to bed at 8:30 p.m. The result was, at age 39, winning his 5th Super Bowl — the most Super Bowl victories by a quarterback of all time. Michael Phelps, the winner of the most Olympic medals of all-time, not only considers sleep a vital part of his training regimen, he tracks it as carefully as his swimming times. The year before the Rio Olympics, he averaged 7 hours and 36 minutes each night — and collected 6 more medals."}, {"ad53": "So it’s no surprise that the military — which has much more at stake in performance — has discovered the power of sleep, too. In 2015, a RAND study was commissioned to “identify promising policy options and best practices for DoD to mitigate the negative consequences of sleep problems and promote greater sleep health among servicemembers.”"}, {"42e3": "And the market has responded, as well. In December of 2012, the American Academy of Sleep Medicine accredited its 2,500th sleep center — a number that had quintupled in the previous decade. And last year, the business research firm IBISWorld published a market research report for sleep disorder clinics, a $7 billion industry that employs over 50,000 people. The conclusion: “Growing awareness and coverage of disorders will support demand for clinics.” But under the heading of “Industry Threats and Opportunities,” the report touches on what the next chapter in this story will be. “As broadband connections grow,” it reads, “more people will experience sleep troubles.”"}, {"a5f5": "In 2007, it was cultural attitudes about sleep as wasted time and lack of awareness about the dangers of burnout that were the problem. Ten years later, awareness has begun to catch up to the science. But now it’s technology that’s the challenge. As the report puts it, it’s both a threat and an opportunity. This is a time of incredible transition: changing attitudes around burnout, a golden age of science around performance, stress, sleep and well-being, and the feeling that it’s never been harder to find downtime, to disconnect, to recharge."}, {"087c": "Technology is granting us unprecedented power and opportunities to do amazing things — but it’s also accelerated the pace of our lives beyond our capacity to keep up. We all feel it — we’re being controlled by something we should be controlling. And no matter how much we’re aware of the science behind burnout and well-being, our ability to focus, to think, to be present, and to connect with ourselves has never felt more imperiled. This — our relationship with technology — is what’s going to be the protagonist of the next ten years of this story."}, {"5b43": "And new voices are emerging to lead the way in creating this new equilibrium. Tristan Harris is a former product philosopher at Google who is now devoting himself to changing the way the tech world creates and markets apps. “There is a way to design based not on addiction,” he says. “Never before in history have the decisions of a handful of designers (mostly men, white, living in SF, aged 25–35) working at 3 companies…had so much impact on how millions of people around the world spend their attention,” he says. “We should feel an enormous responsibility to get this right.” His Digital Bill of Rights calls for bringing a code of ethics into the attention economy."}, {"0644": "To help make this happen, he’s created an advocacy group, Time Well Spent, whose mission is “to align technology with our humanity.” And in the decade to come, this is going to be the next frontier in technology — apps and tools and AI innovations that help us set boundaries and rebuild the walls around our essential humanity."}, {"ba73": "Right now, a decade after the smartphone, we’re at an inflection point, one in which technology, as well as enabling many wonderful things in our lives, is fueling the stress and burnout epidemic. We’re addicted to our devices and they are harsh taskmasters, mining our attention and our focus and keeping us in a permanent state of heightened stress and expectation. According to a recent survey, over 70 percent of Americans sleep with their phones next to them. And during the day, we check them an average of 150 times a day. And, as practically everybody I meet as I travel around the world tells me, this just isn’t sustainable."}, {"1db4": "So, we still have a long way to go. And my hope for what will happen long before the 20th anniversary of my wake-up call is that we’ll now move from knowing what to do to actually doing it. We now know stress and burnout are literally killing us. We know they make us worse, and not better, at our jobs. We know that our relationship to technology is damaging and unsustainable. And we know about the many tools and strategies that can boost our well-being. The science is clear on all of it. The mission now is to heed the science and change the way we work and live."}, {"3ad2": "And that’s why I founded Thrive Global, to help people bring positive changes into their lives, ten years after a nasty fall brought so many to mine."}], "author": "Arianna Huffington", "child": "1721_1\t1721_2\t1721_3\t1721_4\t1721_5\t1721_6\t1721_7\t1721_8\t1721_9\t1721_10\t1721_11\t1721_12\t1721_13\t1721_14\t1721_15\t1721_16\t1721_17\t1721_18\t1721_19\t1721_20\t1721_21\t1721_22\t1721_23\t1721_24\t1721_25", "name": "1721", "content": "10 Years Ago I Collapsed From Burnout and Exhaustion, And It’s The Best Thing That Could Have Happened To Me It was a day I’ve talked and written about dozens of times — the day I collapsed from sleep deprivation and exhaustion, broke my cheekbone and woke up in a pool of blood. And it happened on April 6th, 2007, which makes today the 10th anniversary (thank you for all the cards and letters). But, actually, it is a day to mark for me, less for the symbolism of the anniversary and more for what’s happened in the decade since. For me, it’s a prime example of how good things can come out of bad things — how, very often, events that come to define our lives in positive ways would never have happened without events that were painful and sometimes, yes, even bloody! For me, that day literally changed my life. It put me on a course in which I changed how I work and how I live. It put me on a course of writing two books, Thrive and The Sleep Revolution. And, not long after that, it led to me leaving a very successful company I co-founded and ran for 11 years to launch another one, Thrive Global. So collapsing into a bloody mess might seem an odd thing to celebrate, but it was the seed of an amazing ten years for me. And, in fact, one of my goals with Thrive Global is to provide a softer wake-up call, to provide the catalyst for other people to get on a different course that can bring just as many positive changes to their lives without hitting the wall–or the floor! But even though much of my life has changed, what’s amazing as I look back over these ten years is how much the world has also changed. Burnout–and awareness about its dangers–is now a front-burner topic, both collectively and individually. It’s a part of our everyday conversation and, collectively, it’s finally coming to be regarded as the public health issue it is. More and more people are coming out to talk about their own wake-up calls, or how they changed their lives, or just about problems they’re having changing the way they work and live. For example, there was this memorable 2013 New York Times piece by Erin Callan, the former CFO of Lehman Brothers. “Work always came first,” she wrote, “before my family, friends and marriage — which ended just a few years later.” Looking back, she now realizes that it didn’t have to be this way: “I didn’t have to be on my BlackBerry from my first moment in the morning to my last moment at night. I didn’t have to eat the majority of my meals at my desk. I didn’t have to fly overnight to a meeting in Europe on my birthday. I now believe that I could have made it to a similar place with at least some better version of a personal life.” What’s notable isn’t just the insight, but that we’ve reached a point where more and more people are ready to go public with stories like this. We’ve finally gotten to a time in which it’s not burnout that’s considered a sign of strength, but avoiding it. That’s a huge change. And as this has happened, the ways in which we avoid burnout have also come out of the shadows. We’ve gone from a time in which meditation and mindfulness were seen as vaguely flaky and new age-y to a time in which CEO after CEO comes out discussing the ways prioritizing their well-being strengthens them as leaders. There’s Mark Benioff, CEO of Salesforce, Padmasree Warrior, CEO of NIO U.S., Ray Dalio, Chairman and former CEO of Bridgewater, Mark Bertolini, CEO of Aetna, Barry Sommers, CEO of the consumer bank at Chase, and Melinda Gates, Co-Chair of the Bill and Melinda Gates Foundation — talking about their meditation practices just as freely as they talk about their business projections. In fact, the two are very connected. On The Thrive Journal, Amazon CEO Jeff Bezos talked about his habit of getting eight hours of sleep in terms of his responsibility to Amazon shareholders: “Making a small number of key decisions well is more important than making a large number of decisions. If you shortchange your sleep, you might get a couple of extra ‘productive’ hours, but that productivity might be an illusion. When you’re talking about decisions and interactions, quality is usually more important than quantity.” Sleep deprivation has gone from something you’d brag about in a job interview to a giant red flag. This was LinkedIn’s Chief Human Resource Officer Pat Wadors in 2015: “Trust me, it’s not a badge of honor to brag that you can get by on 4 hours or 5 each night…You intimate that with fewer hours “wasted on sleep” you are more productive. Nope. Can’t buy that. When you brag about that, you are telling me that it’s ok for you to harm your health and not perform your best at work or at home. Is that something to brag about?” Perhaps the best example of sleep’s new status as the ultimate performance enhancer is how it’s been embraced by the world of elite sports. It’s now rare to see a professional team without a sleep specialist on board, and without players wearing sleep trackers every night. And many of them have no problem speaking out about their use of sleep as a vital part of their training — and their performance. Andre Iguodala, named the Most Valuable Player of the 2015 NBA Finals, credits his improved numbers on the court to his improved sleep numbers at home. His advice for anybody who feels out of balance? “Sleep more and workout more.” Tom Brady is as famous for his near religious devotion to his sleep routine as he is for studying game plans. For him this often means going to bed at 8:30 p.m. The result was, at age 39, winning his 5th Super Bowl — the most Super Bowl victories by a quarterback of all time. Michael Phelps, the winner of the most Olympic medals of all-time, not only considers sleep a vital part of his training regimen, he tracks it as carefully as his swimming times. The year before the Rio Olympics, he averaged 7 hours and 36 minutes each night — and collected 6 more medals. So it’s no surprise that the military — which has much more at stake in performance — has discovered the power of sleep, too. In 2015, a RAND study was commissioned to “identify promising policy options and best practices for DoD to mitigate the negative consequences of sleep problems and promote greater sleep health among servicemembers.” And the market has responded, as well. In December of 2012, the American Academy of Sleep Medicine accredited its 2,500th sleep center — a number that had quintupled in the previous decade. And last year, the business research firm IBISWorld published a market research report for sleep disorder clinics, a $7 billion industry that employs over 50,000 people. The conclusion: “Growing awareness and coverage of disorders will support demand for clinics.” But under the heading of “Industry Threats and Opportunities,” the report touches on what the next chapter in this story will be. “As broadband connections grow,” it reads, “more people will experience sleep troubles.” In 2007, it was cultural attitudes about sleep as wasted time and lack of awareness about the dangers of burnout that were the problem. Ten years later, awareness has begun to catch up to the science. But now it’s technology that’s the challenge. As the report puts it, it’s both a threat and an opportunity. This is a time of incredible transition: changing attitudes around burnout, a golden age of science around performance, stress, sleep and well-being, and the feeling that it’s never been harder to find downtime, to disconnect, to recharge. Technology is granting us unprecedented power and opportunities to do amazing things — but it’s also accelerated the pace of our lives beyond our capacity to keep up. We all feel it — we’re being controlled by something we should be controlling. And no matter how much we’re aware of the science behind burnout and well-being, our ability to focus, to think, to be present, and to connect with ourselves has never felt more imperiled. This — our relationship with technology — is what’s going to be the protagonist of the next ten years of this story. And new voices are emerging to lead the way in creating this new equilibrium. Tristan Harris is a former product philosopher at Google who is now devoting himself to changing the way the tech world creates and markets apps. “There is a way to design based not on addiction,” he says. “Never before in history have the decisions of a handful of designers (mostly men, white, living in SF, aged 25–35) working at 3 companies…had so much impact on how millions of people around the world spend their attention,” he says. “We should feel an enormous responsibility to get this right.” His Digital Bill of Rights calls for bringing a code of ethics into the attention economy. To help make this happen, he’s created an advocacy group, Time Well Spent, whose mission is “to align technology with our humanity.” And in the decade to come, this is going to be the next frontier in technology — apps and tools and AI innovations that help us set boundaries and rebuild the walls around our essential humanity. Right now, a decade after the smartphone, we’re at an inflection point, one in which technology, as well as enabling many wonderful things in our lives, is fueling the stress and burnout epidemic. We’re addicted to our devices and they are harsh taskmasters, mining our attention and our focus and keeping us in a permanent state of heightened stress and expectation. According to a recent survey, over 70 percent of Americans sleep with their phones next to them. And during the day, we check them an average of 150 times a day. And, as practically everybody I meet as I travel around the world tells me, this just isn’t sustainable. So, we still have a long way to go. And my hope for what will happen long before the 20th anniversary of my wake-up call is that we’ll now move from knowing what to do to actually doing it. We now know stress and burnout are literally killing us. We know they make us worse, and not better, at our jobs. We know that our relationship to technology is damaging and unsustainable. And we know about the many tools and strategies that can boost our well-being. The science is clear on all of it. The mission now is to heed the science and change the way we work and live. And that’s why I founded Thrive Global, to help people bring positive changes into their lives, ten years after a nasty fall brought so many to mine. "}