{"parent": "", "timestamp": "Feb 12", "title": "If Award Shows Are Annoying, Why Do We Care So Much?", "sentences": [{"915d": "The glitter."}, {"1b15": "If Award Shows Are Annoying, Why Do We Care So Much?"}, {"b0c9": "Award season is in full swing. From London to New York to Los Angeles — the industry’s elite are decked out in diamonds and pearls as designated stylists work overtime to guarantee that their clients make all the lists that matter."}, {"42f5": "JLo getting primped."}, {"66a9": "Agents and managers are also on speed dial — working to keep the clientele happily on lock while seizing the opportunity to secure newbies that have managed to woo enough for bait."}, {"9fd6": "Nobody does it better than Ari."}, {"8681": "Yes, award season is the time when sharks dare to approach shallow waters for the grand prize of proving a point."}, {"f2f1": "We know amazing people and they must know us or else what’s the fucking point?"}, {"f012": "I’m sure there are many of you who share my view about glitzy shows that are installed for the benefit of choosing the best of them all — or the ones that the important people like best."}, {"5dbb": "Back in the day — I developed an incredible obsession with The Academy Awards. Looking back, I can only assess that my infatuation was heightened by the actual show itself. Billy Crystal was superb in his ability to command the stage without any hints of fatigue. The musical numbers were sensational — in fact the entire production was akin to a Broadway show on lightened ice."}, {"a919": "Getting older can be a buzzkill, especially when you realize that what you’ve maintained as a fanciful feast is really unbearably tasteless."}, {"baea": "Frank Ocean is a talent that I wish I could be holed up with."}, {"ffe7": "It would be somewhere sparse and bright so that I can pick his brain about Nikes and other tracks that stop me in my tracks. We would bond over the love of language and our distaste for establishments that are formed to redeem the masses from the wicked trip to reality and beyond."}, {"d9d4": "Ocean recently penned a heartfelt letter on Tumblr in response to the stuff that Ken Ehrlich, who produces the Grammys, and David Wild, the show writer, said to Rolling Stone, which was essentially laced with a decadent heaping of frosted goodies that dissolve into bitterness at the first sampling."}, {"9b13": "Frank Ocean is boycotting Grammys 2017 — but it’s not because his 2013 performance was a shit show despite his best intentions — it’s because he is lucky enough to discover how whack award shows really are."}, {"7770": "I mean lets be honest — how can you take these staged erections seriously when they only aim to funnel division at the behest of desperate wannabies or old-timers who need to be reinvigorated."}, {"cb64": "Ocean was resilient in his message as he plotted out the themes of his mission. This is literally my favorite part:"}, {"6489": "I’ve actually been tuning into CBS around this time of year for awhile to see who gets the top honor and you know what’s really not ‘great TV’ guys? 1989 getting album of the year To Pimp A Butterfly. Hands down one of the most ‘faulty’ TV moments I’ve seen.”"}, {"c1f1": "Ain’t that the truth!"}, {"1d0a": "How many times have we witnessed the unfathomable for the sake of those in power who have an agenda that can’t be derailed?"}, {"51b6": "Phylicia Rashad never winning an Emmy during the Cosby era is atrocious. Angela Basset losing to Holly Hunter? Black-ish overpowering Survivor’s Remorse? Al Pacino winning an Oscar for Scent of a Woman?? Shows like Power, The Affair, Chewing Gum, and others like them being left in the dust to make way for less worthy offerings that are too popular to ignore."}, {"3d55": "Oh, this is actually the best part of Ocean’s confessional:"}, {"3464": "“Winning a TV award doesn’t christen me successful. It took me some time to learn that. I bought all my masters back last year in the prime of my career, that’s successful.”"}, {"e2e7": "Yes, it does mean something when you can define your level of success without the gramophones or the golden god pacing your steps."}, {"8519": "Award shows are annoying, and we definitely understand that concept, so why do we care so much?"}, {"3f44": "Perhaps, it’s because of our insatiable need to be prompted by the cheering of the crowd and the resounding signal that we are in fact as great as we suspected. But, the true gems never buy into the nonsensical parade of excess that permeates through the recognition of what we’ve become."}, {"8baf": "Social media has wonderfully elevated the prose of being your own hero even when none it’s tragically unwarranted."}, {"5c84": "Stationed analysts predict what we need to digest. Any Black movie that deserves attention has to reek of historical fodder. If most White people watch Empire — then that is the show that must prevail. Black-ish is the darling of the circuit so, yeah, we go with that."}, {"b7f2": "I no longer feel like shit when I recall how I turned the world upside down with my snafu involving Amy Adams and Tom Hanks. Yes, I gave them the nominations — and I would do it again!"}, {"d397": "Dear Amy Adams and Tom Hanks, I Gave You Those NominationsI fucked up and so did ABCmedium.com"}, {"1153": "The glitter and the glamour always pale in comparison to the concrete truth of what it means to be a true artist."}, {"107d": "Enjoy the show but don’t’ get too comfortable. It won’t last."}], "author": "Ezinne Ukoha", "child": "1728_1", "name": "1728", "content": "The glitter. If Award Shows Are Annoying, Why Do We Care So Much? Award season is in full swing. From London to New York to Los Angeles — the industry’s elite are decked out in diamonds and pearls as designated stylists work overtime to guarantee that their clients make all the lists that matter. JLo getting primped. Agents and managers are also on speed dial — working to keep the clientele happily on lock while seizing the opportunity to secure newbies that have managed to woo enough for bait. Nobody does it better than Ari. Yes, award season is the time when sharks dare to approach shallow waters for the grand prize of proving a point. We know amazing people and they must know us or else what’s the fucking point? I’m sure there are many of you who share my view about glitzy shows that are installed for the benefit of choosing the best of them all — or the ones that the important people like best. Back in the day — I developed an incredible obsession with The Academy Awards. Looking back, I can only assess that my infatuation was heightened by the actual show itself. Billy Crystal was superb in his ability to command the stage without any hints of fatigue. The musical numbers were sensational — in fact the entire production was akin to a Broadway show on lightened ice. Getting older can be a buzzkill, especially when you realize that what you’ve maintained as a fanciful feast is really unbearably tasteless. Frank Ocean is a talent that I wish I could be holed up with. It would be somewhere sparse and bright so that I can pick his brain about Nikes and other tracks that stop me in my tracks. We would bond over the love of language and our distaste for establishments that are formed to redeem the masses from the wicked trip to reality and beyond. Ocean recently penned a heartfelt letter on Tumblr in response to the stuff that Ken Ehrlich, who produces the Grammys, and David Wild, the show writer, said to Rolling Stone, which was essentially laced with a decadent heaping of frosted goodies that dissolve into bitterness at the first sampling. Frank Ocean is boycotting Grammys 2017 — but it’s not because his 2013 performance was a shit show despite his best intentions — it’s because he is lucky enough to discover how whack award shows really are. I mean lets be honest — how can you take these staged erections seriously when they only aim to funnel division at the behest of desperate wannabies or old-timers who need to be reinvigorated. Ocean was resilient in his message as he plotted out the themes of his mission. This is literally my favorite part: I’ve actually been tuning into CBS around this time of year for awhile to see who gets the top honor and you know what’s really not ‘great TV’ guys? 1989 getting album of the year To Pimp A Butterfly. Hands down one of the most ‘faulty’ TV moments I’ve seen.” Ain’t that the truth! How many times have we witnessed the unfathomable for the sake of those in power who have an agenda that can’t be derailed? Phylicia Rashad never winning an Emmy during the Cosby era is atrocious. Angela Basset losing to Holly Hunter? Black-ish overpowering Survivor’s Remorse? Al Pacino winning an Oscar for Scent of a Woman?? Shows like Power, The Affair, Chewing Gum, and others like them being left in the dust to make way for less worthy offerings that are too popular to ignore. Oh, this is actually the best part of Ocean’s confessional: “Winning a TV award doesn’t christen me successful. It took me some time to learn that. I bought all my masters back last year in the prime of my career, that’s successful.” Yes, it does mean something when you can define your level of success without the gramophones or the golden god pacing your steps. Award shows are annoying, and we definitely understand that concept, so why do we care so much? Perhaps, it’s because of our insatiable need to be prompted by the cheering of the crowd and the resounding signal that we are in fact as great as we suspected. But, the true gems never buy into the nonsensical parade of excess that permeates through the recognition of what we’ve become. Social media has wonderfully elevated the prose of being your own hero even when none it’s tragically unwarranted. Stationed analysts predict what we need to digest. Any Black movie that deserves attention has to reek of historical fodder. If most White people watch Empire — then that is the show that must prevail. Black-ish is the darling of the circuit so, yeah, we go with that. I no longer feel like shit when I recall how I turned the world upside down with my snafu involving Amy Adams and Tom Hanks. Yes, I gave them the nominations — and I would do it again! Dear Amy Adams and Tom Hanks, I Gave You Those NominationsI fucked up and so did ABCmedium.com The glitter and the glamour always pale in comparison to the concrete truth of what it means to be a true artist. Enjoy the show but don’t’ get too comfortable. It won’t last. "}