{"parent": "", "timestamp": "Apr 11", "title": "NYU Local’s Response To A Furry’s Response To Our Own Response To Editor Olivia Saying She Wanted To Fuck The NYU Bobcat", "sentences": [{"90fa": "NYU Local’s Response To A Furry’s Response To Our Own Response To Editor Olivia Saying She Wanted To Fuck The NYU Bobcat"}, {"0c79": "Yeah. We are still doing this."}, {"278b": "On April 9th NYU Local was called out regarding our article NYU, Where the Furries At?, which, if you have not been actively following this furry beat, was a follow-up to the debacle that was our April Fool’s Day article, OPINION: I Should Be Allowed To Fuck The NYU Bobcat."}, {"2d1f": "This 17 minute long video was made by Youtuber World in RooView, a channel that appears to be a collection of video game commentary and opinion-driven video blogs."}, {"124c": "Upon further investigation the channel is run by a kangaroo named Sonious, also known as Tantroo McNally who lives in Syracuse, NY. Whether either of these names are real is neither here nor there; however the fact that there is a website cataloging all influential furries is something to be noted, and maybe celebrated."}, {"824c": "We at Local are not at all bothered by this call out video. Actually, we’re quite flattered! Personally, I am honored that somebody would dedicate 17 minutes of their life to rant about something that I wrote. I love attention!"}, {"d0f2": "World in RooView/Sonious/Tantroo McNally (let’s say WRST for short) does make some pretty good points. For instance, he calls me out directly (having someone refer to me as “Ms. Murray” unironically was wild!), saying that I never directly express in my article why Local is looking for the NYU furry community. And you know what? He’s right! Honestly I had no follow up to that article if any local furries came forward. My editors can attest to this, my blogging style is very much “I’ll just do this and see what happens.” I most likely would have done a standard profile on the community with questions like how many are you, how can future furries get involved, does “yiffing” have anything to do with it, etc."}, {"3936": "However, we were confused by one point made by WRST. For almost 8 minutes he ranted about the graphic our managing editor Opheli Garcia Lawler created for the article. When I asked her what it was like to be roasted for the better part of a 17 minute video, she responded:"}, {"f4c0": "“Well he was right that my graphics are bad,” explained Garcia Lawler. “I’ve only taken two Tisch classes though, and they were film classes, so I’m not sure what that says about me or our ‘arts school.’”"}, {"0d62": "“I would like to inform him that my Google draws are intentionally bad and all images are sourced from the Google commons,” she continued. “I would be delighted at this critique if I had any plans for a future in graphic design but I don’t. I make Google draws for the laughs.”"}, {"5230": "He’s right, in my article I do say NYU has one of the best art schools in the country. But anyone, especially someone posing as some kind of Youtube journalist, could do a quick Google search to find that Tisch students only make up approximately 8% of the NYU student body. Furthermore, a simple glance at our more recent articles would reinforce the fact that our graphics have become intentionally shitty."}, {"af2e": "This is a screenshot of Opheli Garcia Lawler’s actual Google Drive."}, {"c291": "If you’re reading this, WRST, what gives? We at Local would love to give you some journalism tips, but that’s actually the job of our “student learning paper” Washington Square News. Feel free to shoot them an email!"}, {"a744": "And finally, WRST I have one last question:"}, {"6c68": "How do your glasses stay on if your ears are at the top of your head?"}, {"8dc8": "Editor’s Note: NYU Local’s official stance on Furries is as follows: “You do you but also…what’s up with that?”"}], "author": "Madison Murray", "child": "1734_1", "name": "1734", "content": "NYU Local’s Response To A Furry’s Response To Our Own Response To Editor Olivia Saying She Wanted To Fuck The NYU Bobcat Yeah. We are still doing this. On April 9th NYU Local was called out regarding our article NYU, Where the Furries At?, which, if you have not been actively following this furry beat, was a follow-up to the debacle that was our April Fool’s Day article, OPINION: I Should Be Allowed To Fuck The NYU Bobcat. This 17 minute long video was made by Youtuber World in RooView, a channel that appears to be a collection of video game commentary and opinion-driven video blogs. Upon further investigation the channel is run by a kangaroo named Sonious, also known as Tantroo McNally who lives in Syracuse, NY. Whether either of these names are real is neither here nor there; however the fact that there is a website cataloging all influential furries is something to be noted, and maybe celebrated. We at Local are not at all bothered by this call out video. Actually, we’re quite flattered! Personally, I am honored that somebody would dedicate 17 minutes of their life to rant about something that I wrote. I love attention! World in RooView/Sonious/Tantroo McNally (let’s say WRST for short) does make some pretty good points. For instance, he calls me out directly (having someone refer to me as “Ms. Murray” unironically was wild!), saying that I never directly express in my article why Local is looking for the NYU furry community. And you know what? He’s right! Honestly I had no follow up to that article if any local furries came forward. My editors can attest to this, my blogging style is very much “I’ll just do this and see what happens.” I most likely would have done a standard profile on the community with questions like how many are you, how can future furries get involved, does “yiffing” have anything to do with it, etc. However, we were confused by one point made by WRST. For almost 8 minutes he ranted about the graphic our managing editor Opheli Garcia Lawler created for the article. When I asked her what it was like to be roasted for the better part of a 17 minute video, she responded: “Well he was right that my graphics are bad,” explained Garcia Lawler. “I’ve only taken two Tisch classes though, and they were film classes, so I’m not sure what that says about me or our ‘arts school.’” “I would like to inform him that my Google draws are intentionally bad and all images are sourced from the Google commons,” she continued. “I would be delighted at this critique if I had any plans for a future in graphic design but I don’t. I make Google draws for the laughs.” He’s right, in my article I do say NYU has one of the best art schools in the country. But anyone, especially someone posing as some kind of Youtube journalist, could do a quick Google search to find that Tisch students only make up approximately 8% of the NYU student body. Furthermore, a simple glance at our more recent articles would reinforce the fact that our graphics have become intentionally shitty. This is a screenshot of Opheli Garcia Lawler’s actual Google Drive. If you’re reading this, WRST, what gives? We at Local would love to give you some journalism tips, but that’s actually the job of our “student learning paper” Washington Square News. Feel free to shoot them an email! And finally, WRST I have one last question: How do your glasses stay on if your ears are at the top of your head? Editor’s Note: NYU Local’s official stance on Furries is as follows: “You do you but also…what’s up with that?” "}