{"parent": "", "timestamp": "Feb 17", "title": "Your Self-Righteous T-Shirt Doesn’t Really Give Planned Parenthood $20", "sentences": [{"c024": "Your Self-Righteous T-Shirt Doesn’t Really Give Planned Parenthood $20"}, {"800e": "Senate Majority Leader Mitch McConnell kicked Elizabeth Warren out of the Senate last week for attempting to read a 1986 letter written by Coretta Scott King against Attorney General nominee Jeff Sessions."}, {"7a8d": "McConnell’s explanation that evening: “She was warned. She was given an explanation. Nevertheless, she persisted.”"}, {"33f4": "McConnell’s statement was seized upon almost immediately, spawning Tumblr edits, earning its own Twitter moment and giving way to the pinnacle of political resistance: t-shirts."}, {"6418": "Within hours, companies like Teespring and Reebok launched shirts pledging proceeds to Planned Parenthood and the Women’s March."}, {"b63b": "Reebok is donating $20 per shirt — the full cost, while Teespring donates the profits."}, {"f4bb": "That’s neat? I guess? Except for it’s not, really."}, {"54ab": "Let’s consider some reasons you’d want to get a shirt like the one designed by Teespring"}, {"ee53": "Or this one."}, {"4a1f": "image via Google Ghost"}, {"862d": "Or — god forbid — this one."}, {"6d89": "image via Mic.com"}, {"6282": "Option A is you genuinely want to give money to causes like Planned Parenthood or the ACLU."}, {"a77a": "That’s definitely admirable. But in most cases, spending money on one of these t-shirts does not transfer directly to the charity you want to benefit. First, the company has to cover the cost of production, and then any profits will go to the charity. That’s gonna chip away substantially at your donation."}, {"4a22": "On Teespring, for example, the shirts go for £19.97 (which is weird, because the company is based in San Francisco, and the designer in Brooklyn….. but whatever). That translates to a solid $24.95. As of Thursday afternoon, the last day of the charity campaign, the site claimed over $250,000 had been raised from these shirts, of which 32,458 had been sold."}, {"cc43": "Dividing the total raised by the number sold means that only about $7.70 from each shirt goes to Planned Parenthood. Keep in mind, that’s 100% of the proceeds. Other sites, like Google Ghost, which sells the Nasty Woman t-shirt for $25, donate only a portion of their proceeds."}, {"fcab": "So if you have $20 to spare, save everyone some effort and donate directly."}, {"0eef": "Option B is that you’re buying one of these shirts because you want recognition. Not for the cause you and your t-shirt say you support, but for the fact that you, the t-shirt wearer are a Good Person."}, {"9e2c": "If that’s the extent of your political activism, you’re not doing enough. A watered down, self-righteous version of activism helps nobody. Feel-good performative liberalism is a disservice to those who truly need the work of these organizations."}, {"036a": "If you genuinely care about Planned Parenthood — or any other political cause — find out how to do more. Political involvement doesn’t require large sums of money. Actively playing a role in the events around you — by attending protests or calling your representatives — doesn’t require a cent. And seriously, if you have extra cash lying around, just donate directly."}, {"0bb1": "All we’re saying is, don’t drop twenty-five bucks on a t-shirt just to say you’re politically involved. That just makes you an asshole."}], "author": "Sara Merg", "child": "1747_1", "name": "1747", "content": "Your Self-Righteous T-Shirt Doesn’t Really Give Planned Parenthood $20 Senate Majority Leader Mitch McConnell kicked Elizabeth Warren out of the Senate last week for attempting to read a 1986 letter written by Coretta Scott King against Attorney General nominee Jeff Sessions. McConnell’s explanation that evening: “She was warned. She was given an explanation. Nevertheless, she persisted.” McConnell’s statement was seized upon almost immediately, spawning Tumblr edits, earning its own Twitter moment and giving way to the pinnacle of political resistance: t-shirts. Within hours, companies like Teespring and Reebok launched shirts pledging proceeds to Planned Parenthood and the Women’s March. Reebok is donating $20 per shirt — the full cost, while Teespring donates the profits. That’s neat? I guess? Except for it’s not, really. Let’s consider some reasons you’d want to get a shirt like the one designed by Teespring Or this one. image via Google Ghost Or — god forbid — this one. image via Mic.com Option A is you genuinely want to give money to causes like Planned Parenthood or the ACLU. That’s definitely admirable. But in most cases, spending money on one of these t-shirts does not transfer directly to the charity you want to benefit. First, the company has to cover the cost of production, and then any profits will go to the charity. That’s gonna chip away substantially at your donation. On Teespring, for example, the shirts go for £19.97 (which is weird, because the company is based in San Francisco, and the designer in Brooklyn….. but whatever). That translates to a solid $24.95. As of Thursday afternoon, the last day of the charity campaign, the site claimed over $250,000 had been raised from these shirts, of which 32,458 had been sold. Dividing the total raised by the number sold means that only about $7.70 from each shirt goes to Planned Parenthood. Keep in mind, that’s 100% of the proceeds. Other sites, like Google Ghost, which sells the Nasty Woman t-shirt for $25, donate only a portion of their proceeds. So if you have $20 to spare, save everyone some effort and donate directly. Option B is that you’re buying one of these shirts because you want recognition. Not for the cause you and your t-shirt say you support, but for the fact that you, the t-shirt wearer are a Good Person. If that’s the extent of your political activism, you’re not doing enough. A watered down, self-righteous version of activism helps nobody. Feel-good performative liberalism is a disservice to those who truly need the work of these organizations. If you genuinely care about Planned Parenthood — or any other political cause — find out how to do more. Political involvement doesn’t require large sums of money. Actively playing a role in the events around you — by attending protests or calling your representatives — doesn’t require a cent. And seriously, if you have extra cash lying around, just donate directly. All we’re saying is, don’t drop twenty-five bucks on a t-shirt just to say you’re politically involved. That just makes you an asshole. "}