{"name": "1827", "title": "On Shifting Systems", "sentences": [{"eb7c": "On Shifting Systems"}, {"c721": "Context is important"}, {"792b": "I’m enjoying this piece Ash, especially as an extension of our discussions the other day. It makes me think about and reflect on many of the conversations I’ve had with the Enspiral and Lifehack crews both in the “change programs” we’ve run, as well as in the retreat spaces we’ve held."}, {"a358": "Now I’m mulling on an inquiry about systems change in the context of this inner work. It occurs to me that the systems we build our lives around — food, housing, energy, education and the likes — are a representation of the deeply held attitudes and beliefs of previous generations, which are gently being shaped by our own work in this lifetime."}, {"7cec": "These systems are often designed and evolved to be robust, resilient, and to ensure continuity of delivery of their service — not designed for rapid change."}, {"7af7": "However there’s also a range of systems — some which are deeply institutionalised into our society and economy, and some which are held in more of a social context, existing as implicit bonds and agreements between people and organisations."}, {"1a6e": "An example of an institutionalised system may be something like our legal system. It has professions, codes of practice, legislation, physical infrastructure and the likes. It’s extremely resistant to big change, with most progressive updates happening slowly and thoughtfully."}, {"50c5": "An example of a less institutionalised system may be something like our food system (this could be contentious, and bear with me as these are unfolding thoughts). Comparatively, I feel like our food system, despite the physical infrastructure such as packing sheds, supermarkets, contracts and the disturbing debt that many farmers are (sometimes) forced to carry, is held more socially due to it largely being a market-based system. Whilst things wouldn’t change overnight, if we move more people’s spending patterns towards the likes of vege organic box schemes, or fast food, the ripples of change are potentially quite profound. There’s still inertia from vested interests who would quite like to continue to make multi-million dollar profits year on year (hint: mostly not the farmers), but there’s a different speed and potential for impact here as this is a system which is held in place more by implicit social contracts (we will keep buying from supermarkets) than it is by deep, hard to shift, institutions."}, {"c100": "I think this is important to keep in mind when we talk about systems change, as well as investigating what kind of systems change we’re seeking to have — evolution, revolution or wholesale change (systems decay and replacement?). Systems can be big or small. They can be highly complex with multiple actors and dependencies, but they can also be complex with less actors and connections."}, {"5f1f": "Essentially I’m proffering that I believe we must fit the change strategy to the needs of the change we want to see, rather than always relying on deep personal change as the means to shift all systems."}, {"77a1": "I really appreciated this piece of work by rachel sinha & Tim Draimin on Systems Change as an emerging field."}, {"9b57": "In our work with Lifehack, we often held the tension between the inner work we observed (and personally experienced) is necessary for systems change, with the need for tangible, visible, manifestations of this work in the world, which would begin to create ripples or even tectonic shifts in the systems we were working on."}, {"2313": "It feels like there’s an important opportunity for the inner work to grow, morph and mature in the context of these manifestations (“outer work” if you will)."}, {"5c4e": "As I used to say — too much time sitting on a cushion in a circle isn’t going to answer the immediacy of the challenges which face us. Yet without this work, we’re building on poor foundations."}, {"b156": "I have to acknowledge Chelsea Robinson for showing so much leadership in our time together at Lifehack, and for continuing to hold the tension and displaying the courage and talent to create the spaces for this vital inner work. I hope she has some thoughts to add to this korero."}, {"240c": "I’m now becoming increasingly excited about the role of doing this inner work through good Design practice, thus creating a fusion of inner & outer work in parallel. Some early promising signs of this have been emerging in articles like this one from MIT Media Lab on Designing as Participation and in some of my recent reading on Ethics of Participatory Design (such as this article on 'Ethics of the eye, to the ethics of the hand by collaborative prototyping’, and this piece from the DSI Ethics Lab in NZ) but I think we need to more explicitly create these spaces within design processes, such as Social Labs."}, {"ef7e": "I’ll try to seed your article into the lives and work of more 'Change Program’ designers who I know. Tagging Silvia Zuur, Kate Beecroft, Toni Reid, Catarina Gutierrez, Derek Razo and Shruthi Vijayakumar to get us started ☺"}, {"d1eb": "Thanks again for thinking, writing and sharing your insights with us — it’s great to be in this work with you all."}, {"1509": "Here’s to a wide open ocean of possibility for the future…"}], "child": "1827_1\t1827_2\t1827_3\t1827_4\t1827_5\t1827_6", "timestamp": "Oct 11, 2016", "content": "On Shifting Systems Context is important I’m enjoying this piece Ash, especially as an extension of our discussions the other day. It makes me think about and reflect on many of the conversations I’ve had with the Enspiral and Lifehack crews both in the “change programs” we’ve run, as well as in the retreat spaces we’ve held. Now I’m mulling on an inquiry about systems change in the context of this inner work. It occurs to me that the systems we build our lives around — food, housing, energy, education and the likes — are a representation of the deeply held attitudes and beliefs of previous generations, which are gently being shaped by our own work in this lifetime. These systems are often designed and evolved to be robust, resilient, and to ensure continuity of delivery of their service — not designed for rapid change. However there’s also a range of systems — some which are deeply institutionalised into our society and economy, and some which are held in more of a social context, existing as implicit bonds and agreements between people and organisations. An example of an institutionalised system may be something like our legal system. It has professions, codes of practice, legislation, physical infrastructure and the likes. It’s extremely resistant to big change, with most progressive updates happening slowly and thoughtfully. An example of a less institutionalised system may be something like our food system (this could be contentious, and bear with me as these are unfolding thoughts). Comparatively, I feel like our food system, despite the physical infrastructure such as packing sheds, supermarkets, contracts and the disturbing debt that many farmers are (sometimes) forced to carry, is held more socially due to it largely being a market-based system. Whilst things wouldn’t change overnight, if we move more people’s spending patterns towards the likes of vege organic box schemes, or fast food, the ripples of change are potentially quite profound. There’s still inertia from vested interests who would quite like to continue to make multi-million dollar profits year on year (hint: mostly not the farmers), but there’s a different speed and potential for impact here as this is a system which is held in place more by implicit social contracts (we will keep buying from supermarkets) than it is by deep, hard to shift, institutions. I think this is important to keep in mind when we talk about systems change, as well as investigating what kind of systems change we’re seeking to have — evolution, revolution or wholesale change (systems decay and replacement?). Systems can be big or small. They can be highly complex with multiple actors and dependencies, but they can also be complex with less actors and connections. Essentially I’m proffering that I believe we must fit the change strategy to the needs of the change we want to see, rather than always relying on deep personal change as the means to shift all systems. I really appreciated this piece of work by rachel sinha & Tim Draimin on Systems Change as an emerging field. In our work with Lifehack, we often held the tension between the inner work we observed (and personally experienced) is necessary for systems change, with the need for tangible, visible, manifestations of this work in the world, which would begin to create ripples or even tectonic shifts in the systems we were working on. It feels like there’s an important opportunity for the inner work to grow, morph and mature in the context of these manifestations (“outer work” if you will). As I used to say — too much time sitting on a cushion in a circle isn’t going to answer the immediacy of the challenges which face us. Yet without this work, we’re building on poor foundations. I have to acknowledge Chelsea Robinson for showing so much leadership in our time together at Lifehack, and for continuing to hold the tension and displaying the courage and talent to create the spaces for this vital inner work. I hope she has some thoughts to add to this korero. I’m now becoming increasingly excited about the role of doing this inner work through good Design practice, thus creating a fusion of inner & outer work in parallel. Some early promising signs of this have been emerging in articles like this one from MIT Media Lab on Designing as Participation and in some of my recent reading on Ethics of Participatory Design (such as this article on 'Ethics of the eye, to the ethics of the hand by collaborative prototyping’, and this piece from the DSI Ethics Lab in NZ) but I think we need to more explicitly create these spaces within design processes, such as Social Labs. I’ll try to seed your article into the lives and work of more 'Change Program’ designers who I know. Tagging Silvia Zuur, Kate Beecroft, Toni Reid, Catarina Gutierrez, Derek Razo and Shruthi Vijayakumar to get us started ☺ Thanks again for thinking, writing and sharing your insights with us — it’s great to be in this work with you all. Here’s to a wide open ocean of possibility for the future… ", "author": "Sam Rye", "parent": ""}