{"name": "1853", "title": "A Mother’s Rant", "sentences": [{"97b2": "A Mother’s Rant"}, {"4610": "Of the three daughters I bore by three different menMy eldest was the wildest of the lot,She eloped abroad with one cad she marriedAnd saddled me with the two little girls they left behind,The burden of caring for them every single dayShortens my already dwindling lifespan."}, {"281c": "My middle daughter was another blowShe married the deadbeat with whom she bore three kids,She was the sole breadwinner of her familyBefore she quit her job to study law,Her life is much, much harder nowAnd so she brings me her frustrations to carry,Forever taking but giving nothing back."}, {"8b6a": "My youngest was the worst of them allShe was the one I bore with that womanizing, swindling schmuckAnd as if that permanent reminder of my worst mistake wasn’t curse enoughShe turned out to be the black sheep of the family — hardly surprising given her paternal genesShe didn’t survive university; she quit her second yearAnd lied about it for two whole years,Four years of her life gone down the sewerFor which her git of a father held me responsibleIt took another year to dig her out of that hole,She landed a steady job she held for all of eighteen monthsBut she quit that too and has been stuck home for six monthsWhile her leech father harasses her for money she barely hasBut she won’t tell him she quit her jobBecause it would open up another can of disgusting wormsAnd so she allots him a monthly cut of the measly savings she’s been living onWhile she looks for another jobBut without a degree she hasn’t been very successfulShe said she wants to be a writerI don’t even know what that means."}, {"4be1": "I can’t fathom for the life of me why I sowed such bad seedsWhen I’m such a kind-hearted woman who helps those in needYet my sister, a self-proclaimed heartless termagantHas six daughters leading great livesAnd she herself recently wed a wealthy manOh, the injustice of it all!"}, {"a7ea": "One night I was caught in a tranceOr was it a vision? An epiphany? Or wishful dreaming?I saw my eldest as a successful businesswomanThough when she finally came to claim her children, they barely remembered herMy second became a successful lawyer — not the crooked kind, thank you very much!And my last, the black sheep no one thought would amount to muchWas in fact the black swan no one saw coming, but we should haveShe became a mega successful author (so that was what she meant by writer!)We flew around the world in her private jet,We sailed around the globe in her luxury yacht,I finally got to try caviar — the dreadful thing!"}, {"6b89": "When I awoke from this sweet, sweet dreamI resolved to be more patient with my childrenAnd believe they’d eventually find their way no matter how long it tookBut when I saw the five brats return from schoolAnd thought of all the woe they were about to put me throughI heaved a steam-kettle sigh,The joys of motherhood indeed!"}], "child": "1853_1\t1853_2\t1853_3", "timestamp": "Apr 3", "content": "A Mother’s Rant Of the three daughters I bore by three different menMy eldest was the wildest of the lot,She eloped abroad with one cad she marriedAnd saddled me with the two little girls they left behind,The burden of caring for them every single dayShortens my already dwindling lifespan. My middle daughter was another blowShe married the deadbeat with whom she bore three kids,She was the sole breadwinner of her familyBefore she quit her job to study law,Her life is much, much harder nowAnd so she brings me her frustrations to carry,Forever taking but giving nothing back. My youngest was the worst of them allShe was the one I bore with that womanizing, swindling schmuckAnd as if that permanent reminder of my worst mistake wasn’t curse enoughShe turned out to be the black sheep of the family — hardly surprising given her paternal genesShe didn’t survive university; she quit her second yearAnd lied about it for two whole years,Four years of her life gone down the sewerFor which her git of a father held me responsibleIt took another year to dig her out of that hole,She landed a steady job she held for all of eighteen monthsBut she quit that too and has been stuck home for six monthsWhile her leech father harasses her for money she barely hasBut she won’t tell him she quit her jobBecause it would open up another can of disgusting wormsAnd so she allots him a monthly cut of the measly savings she’s been living onWhile she looks for another jobBut without a degree she hasn’t been very successfulShe said she wants to be a writerI don’t even know what that means. I can’t fathom for the life of me why I sowed such bad seedsWhen I’m such a kind-hearted woman who helps those in needYet my sister, a self-proclaimed heartless termagantHas six daughters leading great livesAnd she herself recently wed a wealthy manOh, the injustice of it all! One night I was caught in a tranceOr was it a vision? An epiphany? Or wishful dreaming?I saw my eldest as a successful businesswomanThough when she finally came to claim her children, they barely remembered herMy second became a successful lawyer — not the crooked kind, thank you very much!And my last, the black sheep no one thought would amount to muchWas in fact the black swan no one saw coming, but we should haveShe became a mega successful author (so that was what she meant by writer!)We flew around the world in her private jet,We sailed around the globe in her luxury yacht,I finally got to try caviar — the dreadful thing! When I awoke from this sweet, sweet dreamI resolved to be more patient with my childrenAnd believe they’d eventually find their way no matter how long it tookBut when I saw the five brats return from schoolAnd thought of all the woe they were about to put me throughI heaved a steam-kettle sigh,The joys of motherhood indeed! ", "author": "Abby O. Akoto", "parent": ""}