{"name": "1854", "title": "Love, When I Forget Where I’m Going", "sentences": [{"5d60": "Love, When I Forget Where I’m Going"}, {"8c28": "You Always Remind Me"}, {"759e": "Sweet summer boy, you have spring around your ears. You have a farmer’s tan and smell like wood shavings and earth. I’m a fall and winter girl with tightly curled curls from a messed bird’s nest bun. I am pale often, I am tired often, and I am a lot more harshly winter than you and your spring words."}, {"56fe": "It’s in the way you move. You are strong, lean, with a broad chest and shoulders. But the slump of your back and the gaze you give me, all spring and sunshine, makes you seem gentler. Bright mouth in a boyish smile, wide and full, you look as a child to me, sometimes."}, {"b054": "I cup your head in the morning as we wake, you sit with your head to my chest, and we talk about our dreams. Mine are usually nightmares. Lately, I’ve had a lot of them, or haven’t slept properly. It scares me. I see the curl of your ear. I feel the bristle of your short hair. Your hair smells good. I forget for a moment that I am drowsy with sleep and will be like that for the day. Your shirt smells good. I forget for a moment that I may be wide awake as the sun goes down."}, {"ecfa": "You smell good."}, {"a51c": "Today I hope to sleep soundly. Last night I wasn’t successful in that but you came home, late as your shifts have been, and rubbed my arms and back. You touched me gently and kissed my eyes with that bright mouth. You made me hot bitter tea to bitterly coax my body to bed."}, {"fb72": "Unsuccessful, you still talked to me, you soothed me, and you pressed your larger finger on the skin between my eyebrows and down the bridge of my nose. To soothe, to press, to warm, to coax. As a parent does to a child."}, {"e6ec": "I noticed when you opened your eyes every time I got out of bed to swallow another bitter pill to help me rest. I am not like you. I cannot go days with flecks of sleep fleeing me like splinters. It would leave me ill, as I have an illness that modern medicine hasn’t yet, or won’t yet, find a cure for."}, {"b7d1": "We talk about things like that in the time before sleep, when you are home early enough, and we slide underneath our sheets. A warm purring body presses at the foot of our bed and I think, almost, he’s listening too."}, {"4963": "We talk about how if the world wanted to cure the ails it had, it would already. There is gold in selling band-aids. There is less gold in fixing the wound entirely."}, {"dd36": "We talk about small, amusing things too. But those small things soon become large and we spin stories about stories, ideas about life, and jokes within jokes. I become large in those stories, I am a protector, a warrior of storms. A Goddess like Kali. You laugh, you laugh so hard, and I laugh, and we kiss."}, {"0d9c": "You let me be that warrior. I let you be gentle and beautiful. I wonder how you see me, you beautiful creature. I tell you that often — that I wish I was beautiful like you were beautiful. Because I’m unsure you can see what I see in the curve of your hip or the trace of your jawline."}, {"4292": "I’m not sure you can see it as it happens, as you are not omniscient in the views of the world. (Neither am I). I’m not sure you can see when we talk about something difficult but beautiful and touching, that your eyes are glass. You offer me your soul in those times, like a reverent druid with gold dipped hands placing a living heart upon my altar."}, {"1b0b": "I could strike you down, as this creature of first snow, and terror, that I am."}, {"9c90": "But I will never do that, and instead, I take your warm paw and I kiss the fingers I can find."}, {"5e15": "You are mine and I am greedy."}, {"95d9": "I had to remember this. As it is close to the end of the day, and I can see the sky has turned a deep robin’s egg blue from my little window. Our basement apartment is warm, but it is far less warm than when you are here. As if the spring had come in to melt the winter storm, when you are home, I am cider spiced autumn and not a torrid, scathing blizzard."}, {"1242": "I worry tonight that I will not sleep. I am ill if I do not sleep."}, {"ccce": "But you promised, even if it made me sick, you would protect me. Like the spring coaxes forth after a harsh snow, a small unfurling. Green amidst a sea of white, then a pink floret, then a blossom. Then a full flower. You will grow that for me, and in me. That spring."}, {"e218": "Love, when I forget where I’m going, when I am scared and crying, when I cannot sleep, cannot see my path in the storm, and cannot do as autumn does."}, {"8457": "You will always remind me."}], "child": "1854_1\t1854_2\t1854_3\t1854_4\t1854_5", "timestamp": "Mar 28", "content": "Love, When I Forget Where I’m Going You Always Remind Me Sweet summer boy, you have spring around your ears. You have a farmer’s tan and smell like wood shavings and earth. I’m a fall and winter girl with tightly curled curls from a messed bird’s nest bun. I am pale often, I am tired often, and I am a lot more harshly winter than you and your spring words. It’s in the way you move. You are strong, lean, with a broad chest and shoulders. But the slump of your back and the gaze you give me, all spring and sunshine, makes you seem gentler. Bright mouth in a boyish smile, wide and full, you look as a child to me, sometimes. I cup your head in the morning as we wake, you sit with your head to my chest, and we talk about our dreams. Mine are usually nightmares. Lately, I’ve had a lot of them, or haven’t slept properly. It scares me. I see the curl of your ear. I feel the bristle of your short hair. Your hair smells good. I forget for a moment that I am drowsy with sleep and will be like that for the day. Your shirt smells good. I forget for a moment that I may be wide awake as the sun goes down. You smell good. Today I hope to sleep soundly. Last night I wasn’t successful in that but you came home, late as your shifts have been, and rubbed my arms and back. You touched me gently and kissed my eyes with that bright mouth. You made me hot bitter tea to bitterly coax my body to bed. Unsuccessful, you still talked to me, you soothed me, and you pressed your larger finger on the skin between my eyebrows and down the bridge of my nose. To soothe, to press, to warm, to coax. As a parent does to a child. I noticed when you opened your eyes every time I got out of bed to swallow another bitter pill to help me rest. I am not like you. I cannot go days with flecks of sleep fleeing me like splinters. It would leave me ill, as I have an illness that modern medicine hasn’t yet, or won’t yet, find a cure for. We talk about things like that in the time before sleep, when you are home early enough, and we slide underneath our sheets. A warm purring body presses at the foot of our bed and I think, almost, he’s listening too. We talk about how if the world wanted to cure the ails it had, it would already. There is gold in selling band-aids. There is less gold in fixing the wound entirely. We talk about small, amusing things too. But those small things soon become large and we spin stories about stories, ideas about life, and jokes within jokes. I become large in those stories, I am a protector, a warrior of storms. A Goddess like Kali. You laugh, you laugh so hard, and I laugh, and we kiss. You let me be that warrior. I let you be gentle and beautiful. I wonder how you see me, you beautiful creature. I tell you that often — that I wish I was beautiful like you were beautiful. Because I’m unsure you can see what I see in the curve of your hip or the trace of your jawline. I’m not sure you can see it as it happens, as you are not omniscient in the views of the world. (Neither am I). I’m not sure you can see when we talk about something difficult but beautiful and touching, that your eyes are glass. You offer me your soul in those times, like a reverent druid with gold dipped hands placing a living heart upon my altar. I could strike you down, as this creature of first snow, and terror, that I am. But I will never do that, and instead, I take your warm paw and I kiss the fingers I can find. You are mine and I am greedy. I had to remember this. As it is close to the end of the day, and I can see the sky has turned a deep robin’s egg blue from my little window. Our basement apartment is warm, but it is far less warm than when you are here. As if the spring had come in to melt the winter storm, when you are home, I am cider spiced autumn and not a torrid, scathing blizzard. I worry tonight that I will not sleep. I am ill if I do not sleep. But you promised, even if it made me sick, you would protect me. Like the spring coaxes forth after a harsh snow, a small unfurling. Green amidst a sea of white, then a pink floret, then a blossom. Then a full flower. You will grow that for me, and in me. That spring. Love, when I forget where I’m going, when I am scared and crying, when I cannot sleep, cannot see my path in the storm, and cannot do as autumn does. You will always remind me. ", "author": "a dim i.v", "parent": ""}