{"name": "1859", "title": "WHY I THINK GOOGLE SHOULD BUY MEDIUM", "sentences": [{"ab51": "WHY I THINK GOOGLE SHOULD BUY MEDIUM"}, {"dc34": "Well, Medium has been through some shit lately and I love medium. It’s a great platform to share idea, deep insights, trash Trump, and just be fun all with words. Therefore, it would be really sad if the company shuts down due to VC saga and inability to create profit. Therefore, with all stupidity and naivety, I propose that Google should buy medium for these reasons:"}, {"094b": "Let’s face it medium engineers do know how to make an editor. It’s the best thing on the web since Googles own search bar. It’s simple to use, beautifully designed and best pals with media, photos, videos, and embeds."}, {"b011": "Google docs on the other hand is cool but it’s nowhere near the medium editor which at this point I think it needs a new name, I think “paddy” is cool but then again programmers are the worst with names. Back to the chapter, I think Google acquiring medium along with their engineers could help improve their docs platform and also we save paddy from dying."}, {"554a": "2. Google+ ain’t shit"}, {"9957": "You still remember Google+ right, that thing that Google forced everyone to have at one point hoping to break into the social network scene. Yeah, Medium is a very great social platform for writers and readers alike and I think dominating that niche wouldn’t be a bad at this point for Google. Its probably not as easy as it sounds but you get the idea which leads to my next point."}, {"c607": "3. Blogger is booboo"}, {"3b4b": "Googles blogging platform, Blogger just (insert worst adjective here). That thing still exists, I mean besides LindaIkeji, I can’t think of anybody using it, not since WordPress has been doing a good job kicking ass. Yo, whoever’s in charge of buying companies at Google, if your reading this just trust me, okay, call Medium’s lawyers, write the damn check, you need Medium. But trust me more on this Blogger sucks."}, {"5954": "4. Better data for Google’s"}, {"a6f0": "Okay after reading this and you want to tell me how ignorant I am about AI, let me tell you that I’m very ignorant about AI, i read the meaning on Wikipedia but that don’t count does it? But I think that Medium and its data full of great data that’s better for AIs instead of the silly content they consume from social media and search queries. Google AI first breakthrough was recognizing pictures of a cat, now where do you think all those cat pictures came from. Now instead of catmeal, Google Brain is fed with content mostly thought out deeply by writers I think we would have better AI maybe one day It could write an award winning book, but that’s just me. I don’t know shit about AI."}, {"288a": "5. Its Google they’ll always find a way to make money see how YouTube turned out."}, {"60f9": "That’s all folks. Tell me I don’t know what I’m talking about. I bloody dare you!!!"}], "child": "1859_1\t1859_2", "timestamp": "Jan 11", "content": "WHY I THINK GOOGLE SHOULD BUY MEDIUM Well, Medium has been through some shit lately and I love medium. It’s a great platform to share idea, deep insights, trash Trump, and just be fun all with words. Therefore, it would be really sad if the company shuts down due to VC saga and inability to create profit. Therefore, with all stupidity and naivety, I propose that Google should buy medium for these reasons: Let’s face it medium engineers do know how to make an editor. It’s the best thing on the web since Googles own search bar. It’s simple to use, beautifully designed and best pals with media, photos, videos, and embeds. Google docs on the other hand is cool but it’s nowhere near the medium editor which at this point I think it needs a new name, I think “paddy” is cool but then again programmers are the worst with names. Back to the chapter, I think Google acquiring medium along with their engineers could help improve their docs platform and also we save paddy from dying. 2. Google+ ain’t shit You still remember Google+ right, that thing that Google forced everyone to have at one point hoping to break into the social network scene. Yeah, Medium is a very great social platform for writers and readers alike and I think dominating that niche wouldn’t be a bad at this point for Google. Its probably not as easy as it sounds but you get the idea which leads to my next point. 3. Blogger is booboo Googles blogging platform, Blogger just (insert worst adjective here). That thing still exists, I mean besides LindaIkeji, I can’t think of anybody using it, not since WordPress has been doing a good job kicking ass. Yo, whoever’s in charge of buying companies at Google, if your reading this just trust me, okay, call Medium’s lawyers, write the damn check, you need Medium. But trust me more on this Blogger sucks. 4. Better data for Google’s Okay after reading this and you want to tell me how ignorant I am about AI, let me tell you that I’m very ignorant about AI, i read the meaning on Wikipedia but that don’t count does it? But I think that Medium and its data full of great data that’s better for AIs instead of the silly content they consume from social media and search queries. Google AI first breakthrough was recognizing pictures of a cat, now where do you think all those cat pictures came from. Now instead of catmeal, Google Brain is fed with content mostly thought out deeply by writers I think we would have better AI maybe one day It could write an award winning book, but that’s just me. I don’t know shit about AI. 5. Its Google they’ll always find a way to make money see how YouTube turned out. That’s all folks. Tell me I don’t know what I’m talking about. I bloody dare you!!! ", "author": "Tomiiide", "parent": ""}