{"name": "1874", "title": "5 Apps You Should Get Now, For 2016", "sentences": [{"99b7": "5 Apps You Should Get Now, For 2016"}, {"3953": "Exciting time of the new year has arrived!"}, {"97a6": "Personally, I love making resolutions. While they’re a bit cliche and usually forgotten about after two months; setting goals are important and help us improve."}, {"a718": "One of my resolutions this year is to share more with others, allow myself to be vulnerable and let my voice be “out there”. As a jump start to that, I’m sharing 5 app recommendations that you should get now, for 2016. Hopefully these apps can prolong the life cycle of your resolution; by adding value, or simply, help you stay on track."}, {"e5f1": "TrelloMost of you are already familiar with this handy project management tool, especially for work. I recommend using it to track your goals and utilize it for task management as well. You can create a board for your goals; add lists, links, articles, inspiration, and finally add a due date for it to hold yourself accountable! Remember to set aside some time to review and reflect on what you’ve achieved and how to do better. Keith Gutierrez has a great goal setting template, find his trello blogpost here."}, {"586f": "Trello, organize anything."}, {"8c3c": "DuolingoBeing able to communicate with others in a different language is such an incredible experience. I‘ve been trying to learn French recently, Duolingo makes the process convenient and the course is easy to digest (best part: it’s completely free). They teach you simple words, phrases and sentences, after the lesson is completed there is a simple test to help recap your knowledge. Being bilingual can be as painless as opening an app."}, {"42d2": "Duolingo, changing the way people learn languages."}, {"3dfe": "HeadspaceSo, your to-do list is a bottomless pit, it can be overwhelming. Before you know it, stress has taken over positivity and is burying your personality. Headspace helps you clear your mind and thoughts, a simple 10 minutes per day can relieve tension and allow more room for creativity, productivity and most importantly fun. Take some time for yourself this year!"}, {"d131": "Headspace, meditation made simple."}, {"bcb6": "ProductHuntWe live in such an exciting era, where new technology is being introduced to us every single day. ProductHunt makes discovering new tech effortless, there’s a list for almost everything you may need, curated by a member of the community. Wondering what the best book, tech, games and podcasts are? Find it all here."}, {"d5ee": "Product Hunt, discover the best new apps, games, books and podcasts, everyday."}, {"d139": "Smartcasual (iOS only)Alright, you’ve got the perfect conversation starter, thanks to ProductHunt and you can chat about it in a new language now, thanks to Duolingo. But where are you going to find likeminded individuals? Smartcasual allows you to connect with individuals in your area. Network with professionals and make new friends that share the same passion. Everyone has a story to tell and certainly something you can learn from. Smartcasual is still fairly new, they started by focusing on Hong Kong professionals (users are mainly in populated states). Take a step outside of your comfort zone this year and make yourself available on their app; you never know who you might link up with."}, {"d253": "Smartcasual, business networking made easier and convenient."}, {"4137": "What apps do you love? Tweet me a link or comment below."}, {"b0a8": "Happy New Year (resolutions)."}], "child": "1874_1\t1874_2\t1874_3\t1874_4\t1874_5\t1874_6", "timestamp": "Dec 31, 2015", "content": "5 Apps You Should Get Now, For 2016 Exciting time of the new year has arrived! Personally, I love making resolutions. While they’re a bit cliche and usually forgotten about after two months; setting goals are important and help us improve. One of my resolutions this year is to share more with others, allow myself to be vulnerable and let my voice be “out there”. As a jump start to that, I’m sharing 5 app recommendations that you should get now, for 2016. Hopefully these apps can prolong the life cycle of your resolution; by adding value, or simply, help you stay on track. TrelloMost of you are already familiar with this handy project management tool, especially for work. I recommend using it to track your goals and utilize it for task management as well. You can create a board for your goals; add lists, links, articles, inspiration, and finally add a due date for it to hold yourself accountable! Remember to set aside some time to review and reflect on what you’ve achieved and how to do better. Keith Gutierrez has a great goal setting template, find his trello blogpost here. Trello, organize anything. DuolingoBeing able to communicate with others in a different language is such an incredible experience. I‘ve been trying to learn French recently, Duolingo makes the process convenient and the course is easy to digest (best part: it’s completely free). They teach you simple words, phrases and sentences, after the lesson is completed there is a simple test to help recap your knowledge. Being bilingual can be as painless as opening an app. Duolingo, changing the way people learn languages. HeadspaceSo, your to-do list is a bottomless pit, it can be overwhelming. Before you know it, stress has taken over positivity and is burying your personality. Headspace helps you clear your mind and thoughts, a simple 10 minutes per day can relieve tension and allow more room for creativity, productivity and most importantly fun. Take some time for yourself this year! Headspace, meditation made simple. ProductHuntWe live in such an exciting era, where new technology is being introduced to us every single day. ProductHunt makes discovering new tech effortless, there’s a list for almost everything you may need, curated by a member of the community. Wondering what the best book, tech, games and podcasts are? Find it all here. Product Hunt, discover the best new apps, games, books and podcasts, everyday. Smartcasual (iOS only)Alright, you’ve got the perfect conversation starter, thanks to ProductHunt and you can chat about it in a new language now, thanks to Duolingo. But where are you going to find likeminded individuals? Smartcasual allows you to connect with individuals in your area. Network with professionals and make new friends that share the same passion. Everyone has a story to tell and certainly something you can learn from. Smartcasual is still fairly new, they started by focusing on Hong Kong professionals (users are mainly in populated states). Take a step outside of your comfort zone this year and make yourself available on their app; you never know who you might link up with. Smartcasual, business networking made easier and convenient. What apps do you love? Tweet me a link or comment below. Happy New Year (resolutions). ", "author": "Beatrice Leung", "parent": ""}