{"name": "1881", "title": "Three Secrets", "sentences": [{"f4c4": "Three Secrets"}, {"0a95": "Why All Hearts Are Broken"}, {"2c65": "I want to tell you three little secrets about life."}, {"4c15": "We all have broken hearts. Like mine, your heart has been broken many times. When you were born, when you fell in love for the first time, when you lost someone you loved. Your heart broke and broke and broke again. Yet. You’re not the only one, are you? I know many people who live as if they were, though: who think their hearts are broken, and everyone’s else’s aren’t. It defines their approach to life, relationships, work, everything. It suffocates them emotionally—it makes them anxious, needy, self-sabotaging, cruel — because it’s not true."}, {"00f9": "We all have broken hearts. Every being that has ever lived. So we must live gently, with grace, with love, with care, with mercy. Any other way is false to the simplest truth in this life."}, {"d63b": "A heart is meant to be broken. Your heart has been broken over and over again. Yet there it is. It still feels, doesn’t it? If anything, the more it is broken, the more and more truly that a heart feels. Yes, I’m excluding being traumatized and harmed — those are separate issues. What does that tell us? I think that it tells us something very profound, very important, one of the great truths of life."}, {"3fbd": "Our hearts are not like anything else in existence at all. The more they are “broken”, the better that they work. Can you think of anything else like that? We think that the human mind is unique, singular, special. But we are wrong. Computers, too, can calculate, sort, categorize. It is the human heart which is truly singular."}, {"4212": "A heart that isn’t broken is no good at all. Why is that? A heart isn’t there so I’m always happy, like a grinning fool, a pleasure monster. Such a heart wouldn’t be a heart, would it? It would be a drug, a machine, a program, an algorithm. But not a heart."}, {"5442": "A heart is there for a truer reason entirely: so that I can experience the awareness of life. Not just “my” life. But life. All life, whether it’s a tiny little cat, or a gigantic redwood, or a cloud, or your one true love. All of it. To do that, I need to be able to feel what other lives feel, don’t I? A heart is meant to be broken because the purpose of a heart is awareness. I cannot be aware of any other life at all if my heart is not broken. If I am pure happiness, just an idiot of pleasure, a frat boy at the keg of life, what can I be aware of? I must have suffering, grief, loss, pain, in me, to be truly aware of the beauty of, in, any other life. I am blind without a broken heart."}, {"a273": "So we are profoundly mistaken about the notion of hearts, their brokenness, and what ours means. We suppose that a broken heart just means suffering, pain, weakness, futility. We are wrong. Here is what it really means."}, {"0589": "The threads of all hearts are stitched together through their brokenness."}, {"43ab": "We’re born, we live, we suffer. All suffering is just separation. I’m separated from my mother as a baby. I suffer. Then I’m separated from my lover, partner, grandparents, kids. I live, I lose, I grieve. I end up thinking: I’m alone, just a particle in this hostile universe, separated from everything. I was born alone, and I will die alone."}, {"0505": "It’s not really true, on any level. On a material level, it’s trivially untrue. Where does your breath end, and the air begin? Where does your skin end, and the light begin? You’ll never find a stable boundary, no matter how you look. All such constraints are imposed by the mind, the mind creates the “self” as a thought, and therefore, all such constraints are false, self-referential."}, {"5539": "But separation is falser in a deeper way. Here I am, with my broken heart. There you are, with yours. I am feeling everything you are feeling. I am feeling everything every human being who has ever lived has felt. The patterns differ — but only the patterns. The substance, essence, meaning, purpose, reason, truth, feeling doesn’t. We are one heart in this way. There is no “my” heart and “your” heart”. There is just the universal heart, the one heart in all hearts."}, {"758b": "You and I have broken hearts not because ours are broken. But because that one heart has been split into a million, billion little pieces. And yet. It is only because we feel broken away from the one heart that we know it exists. And it is only when we give our hearts back to the one heart, and stop trying to run, escape, deny it, that we feel life is whole, beautiful, true."}, {"cdd1": "So our broken hearts shatter the notion of separation. Isn’t that curious? A broken thing breaking something. But only when we let them. The threads of all hearts are stitched together through their brokenness. There’s a simpler way to put that. Our broken hearts create the possibility of love. That is the gift in them."}, {"65c5": "I said three secrets. But I am going to write one more."}, {"4d6f": "We spend, you and I, the great majority of our lives hiding our broken hearts from the world. Don’t we? We suppose that they will make us look weak, foolish, naive, stupid. And yet the love we are looking for eludes us. Do you think that’s a coincidence?"}, {"916a": "You must never hide your broken heart. All the love in being is contained right there, in that broken part of you. How is it going to spill out if you are trying to bottle it up?"}, {"74aa": "Just think about it. There you are, looking for love. It doesn’t matter if you call it success, a relationship, fame, fortune, recognition, respect. Ultimately, it’s one and the same thing: love. How is love ever going to be sparked in you, with you, for you, by you, through you, if your broken heart is locked away? If you are so strong that you are perfect, then you don’t need anything or anyone. And if you don’t need anything or anyone, who is going to love you? Who can you love? And so on. It’s very simple."}, {"4896": "There is no greater gift in this life than the broken heart in every being, which is what reveals the one heart in them all."}, {"bd71": "And the moment that we learn to see both at once — the broken heart in each being, which is just the one heart in all being — is the moment we learn to see who we truly are."}, {"0408": "UmairApril 2017"}], "child": "1881_1\t1881_2\t1881_3\t1881_4\t1881_5", "timestamp": "Apr 11", "content": "Three Secrets Why All Hearts Are Broken I want to tell you three little secrets about life. We all have broken hearts. Like mine, your heart has been broken many times. When you were born, when you fell in love for the first time, when you lost someone you loved. Your heart broke and broke and broke again. Yet. You’re not the only one, are you? I know many people who live as if they were, though: who think their hearts are broken, and everyone’s else’s aren’t. It defines their approach to life, relationships, work, everything. It suffocates them emotionally—it makes them anxious, needy, self-sabotaging, cruel — because it’s not true. We all have broken hearts. Every being that has ever lived. So we must live gently, with grace, with love, with care, with mercy. Any other way is false to the simplest truth in this life. A heart is meant to be broken. Your heart has been broken over and over again. Yet there it is. It still feels, doesn’t it? If anything, the more it is broken, the more and more truly that a heart feels. Yes, I’m excluding being traumatized and harmed — those are separate issues. What does that tell us? I think that it tells us something very profound, very important, one of the great truths of life. Our hearts are not like anything else in existence at all. The more they are “broken”, the better that they work. Can you think of anything else like that? We think that the human mind is unique, singular, special. But we are wrong. Computers, too, can calculate, sort, categorize. It is the human heart which is truly singular. A heart that isn’t broken is no good at all. Why is that? A heart isn’t there so I’m always happy, like a grinning fool, a pleasure monster. Such a heart wouldn’t be a heart, would it? It would be a drug, a machine, a program, an algorithm. But not a heart. A heart is there for a truer reason entirely: so that I can experience the awareness of life. Not just “my” life. But life. All life, whether it’s a tiny little cat, or a gigantic redwood, or a cloud, or your one true love. All of it. To do that, I need to be able to feel what other lives feel, don’t I? A heart is meant to be broken because the purpose of a heart is awareness. I cannot be aware of any other life at all if my heart is not broken. If I am pure happiness, just an idiot of pleasure, a frat boy at the keg of life, what can I be aware of? I must have suffering, grief, loss, pain, in me, to be truly aware of the beauty of, in, any other life. I am blind without a broken heart. So we are profoundly mistaken about the notion of hearts, their brokenness, and what ours means. We suppose that a broken heart just means suffering, pain, weakness, futility. We are wrong. Here is what it really means. The threads of all hearts are stitched together through their brokenness. We’re born, we live, we suffer. All suffering is just separation. I’m separated from my mother as a baby. I suffer. Then I’m separated from my lover, partner, grandparents, kids. I live, I lose, I grieve. I end up thinking: I’m alone, just a particle in this hostile universe, separated from everything. I was born alone, and I will die alone. It’s not really true, on any level. On a material level, it’s trivially untrue. Where does your breath end, and the air begin? Where does your skin end, and the light begin? You’ll never find a stable boundary, no matter how you look. All such constraints are imposed by the mind, the mind creates the “self” as a thought, and therefore, all such constraints are false, self-referential. But separation is falser in a deeper way. Here I am, with my broken heart. There you are, with yours. I am feeling everything you are feeling. I am feeling everything every human being who has ever lived has felt. The patterns differ — but only the patterns. The substance, essence, meaning, purpose, reason, truth, feeling doesn’t. We are one heart in this way. There is no “my” heart and “your” heart”. There is just the universal heart, the one heart in all hearts. You and I have broken hearts not because ours are broken. But because that one heart has been split into a million, billion little pieces. And yet. It is only because we feel broken away from the one heart that we know it exists. And it is only when we give our hearts back to the one heart, and stop trying to run, escape, deny it, that we feel life is whole, beautiful, true. So our broken hearts shatter the notion of separation. Isn’t that curious? A broken thing breaking something. But only when we let them. The threads of all hearts are stitched together through their brokenness. There’s a simpler way to put that. Our broken hearts create the possibility of love. That is the gift in them. I said three secrets. But I am going to write one more. We spend, you and I, the great majority of our lives hiding our broken hearts from the world. Don’t we? We suppose that they will make us look weak, foolish, naive, stupid. And yet the love we are looking for eludes us. Do you think that’s a coincidence? You must never hide your broken heart. All the love in being is contained right there, in that broken part of you. How is it going to spill out if you are trying to bottle it up? Just think about it. There you are, looking for love. It doesn’t matter if you call it success, a relationship, fame, fortune, recognition, respect. Ultimately, it’s one and the same thing: love. How is love ever going to be sparked in you, with you, for you, by you, through you, if your broken heart is locked away? If you are so strong that you are perfect, then you don’t need anything or anyone. And if you don’t need anything or anyone, who is going to love you? Who can you love? And so on. It’s very simple. There is no greater gift in this life than the broken heart in every being, which is what reveals the one heart in them all. And the moment that we learn to see both at once — the broken heart in each being, which is just the one heart in all being — is the moment we learn to see who we truly are. UmairApril 2017 ", "author": "umair haque", "parent": ""}