{"name": "1882", "title": "I haven’t cussed in 5 years. My willpower has skyrocketed.", "sentences": [{"0978": "I haven’t cussed in 5 years. My willpower has skyrocketed."}, {"1988": "“No person is free who is not master of themselves.” — Epictetus"}, {"98e3": "I’ve tried a number of multi-year experiments to boost my willpower:"}, {"2bb8": "And yet by far the easiest thing I’ve done to strengthen my will was to quit saying certain 4-letter English words."}, {"ca4a": "Five years ago, I decided that going forward, I would refrain from saying any cuss word that you couldn’t find in the Old Testament."}, {"1485": "My commitment was immediately put to the test. I was at my brother’s house (a no-shoes household), and we had dimmed the lights so we could watch a movie. I was walking back to his living room with a bowl of freshly-popped popcorn, when suddenly a solid wood table leg appeared out of the shadows."}, {"7be8": "I stubbed my toe so hard that the entire table screeched across his hardwood floor."}, {"f968": "My family went silent. They glanced down at my gushing pinky toe. Then up at my face."}, {"07d3": "“Woah!” my brother’s wife said. “Doesn’t that hurt?”"}, {"d9b5": "I just stood there, squeezing my popcorn bowl. Through my clenched teeth — and without really thinking about it — I said: “Not if you’re tough.”"}, {"0103": "I don’t know what came over me. In truth, my toe hurt like crazy. Whatever it was, that night a family-wide meme was born."}, {"982c": "Ever since, whenever someone in our family gets injured somehow, they jokingly reply to inevitable questions about pain with “Not if you’re tough.” Then everybody laughs."}, {"a4bc": "If this had happened before I’d taken my vow of profanity silence, I would have no doubt jumped up and down shouting curse words. But instead, a serene side began to emerge and take hold of my personality."}, {"4910": "Substituting profanity with “aliases”"}, {"ba19": "Darn. Heck. Shoot. There were softer versions of pretty much every cuss word out there, and I quickly adopted these."}, {"2399": "But one word was missing. The big one that everyone uses as a verb, adjective, and even a noun — sometimes all in the same sentence. And no, “fudge” wasn’t going to cut it for me."}, {"ae5f": "Fortunately, my wife and I had just binge-watched the entire series of Battlestar Galactica over one rainy winter in Shanghai."}, {"b515": "Battlestar Galactica features a civilization that is technologically advanced, but also brooding, alcoholic, and potty-mouthed. And instead of omitting the f-word from the show entirely, like similarly gritty — yet still PG-13 — shows did, the writers decided to make up their own f-word so that the actors could freely say on TV: frak."}, {"eaa1": "When you first watch the show, and notice them saying “frak,” it’s quite cheesy. The characters say things to one another like “Frak you!”, “What the frak?” and even “Go frak yourself.”"}, {"5fc8": "And of course, this was before the term “fracking” — the environmentally questionable act of pumping high-pressure fluid into the ground to extract oil and natural gas — had entered popular lexicon."}, {"8bf9": "This made use of the word “frak” even more absurd. And that absurdity lended it a certain humor. A certain power."}, {"fdeb": "So with this final addition to my array of cuss word aliases, I had everything I needed to go profanity-free."}, {"6842": "Just like how the Mr. Robot protagonist Elliot Alderson would later condition himself to hear the words “Evil Corp” whenever someone uttered “E Corp”, I conditioned myself to hear the Battlestar Galactica “frak” in place of other people’s f-bombs."}, {"54e2": "Over time, I reached for these aliases less and less. Sure, there were occasions where I would shout, “Oh, frak! Our production servers are down!” But more often than not, I would just respond to bad situations with stoic silence."}, {"6a43": "A less %@#$ed-up tomorrow"}, {"2e29": "Quitting cussing wasn’t all that hard to do. And in addition to strengthening my willpower, it seems to have made my day-to-day outlook a bit brighter."}, {"e198": "There isn’t much solid research about the role of profanity in human psychology. There are a few one-off studies that suggest that people who cuss frequently might be smarter or perceived by others as being more honest. These conclusions seem counter-intuitive to me, but I’ll keep an open mind in case more studies support this."}, {"4383": "I personally don’t feel I’ve lost any of my dynamic range as a result of not cussing. Not that there’s anything wrong with cussing, or that it should be censored in any way. People cuss. No big deal. As of 2017, we’ve got bigger issues to worry about."}, {"d88f": "On the contrary, I think that cuss words can often add a valuable dramatic effect."}, {"4a53": "Back in 1934, Hollywood studios asked the producers of the 1934 film “Gone with the Wind” to change the now-famous line: “Frankly, my dear, I don’t give a damn” to “Frankly, my dear, I don’t care.”"}, {"6358": "But the producers successfully argued that the word “damn” was necessary to convey the extent of the emotion, and it was left in the film."}, {"53dc": "Producers also successfully advocated for the right to use the word “hell” in Captain Kirk’s famous line, “Let’s get the hell out of here.” This was one of the first times the word “hell” had been used like this on broadcast television. It was in the classic 1967 Star Trek episode “City on the Edge of Forever.” (By the way, if you haven’t seen this episode, it’s on Netflix and you should totally watch it)."}, {"0089": "One side benefit of not cussing is that I no longer have to self-censor my speech around polite company, or in front of kids. Profanity doesn’t just “slip out” in casual banter like it used to."}, {"0ad0": "I can now just say what’s on my mind, confident that, while some people may take issue with my ideas, they probably won’t flinch at the words I use."}, {"2b93": "If you want to learn more about little hacks like this one that you can use to improve your willpower — and thus your productivity — I recommend reading this book by Stanford psychology professor Kelly McGonigal:"}, {"0142": "The Willpower Instinct: How Self-Control Works, Why It Matters, and What You Can Do to Get More of…Edit descriptionamzn.to"}, {"1b67": "I plan to continue exploring habits that can boost my willpower. For as the great poet once wrote:"}, {"7295": "“Tis in ourselves that we are thus or thus. Our bodies are our gardens to the which our wills are gardeners.”―William Shakespeare, Othello"}, {"8e7f": "Thanks for reading! If you liked this article, click the 💚 below so other people will see this here on Medium."}], "child": "1882_1\t1882_2\t1882_3\t1882_4\t1882_5\t1882_6\t1882_7\t1882_8\t1882_9\t1882_10\t1882_11\t1882_12\t1882_13\t1882_14\t1882_15\t1882_16\t1882_17\t1882_18\t1882_19\t1882_20\t1882_21\t1882_22\t1882_23\t1882_24\t1882_25", "timestamp": "Apr 5", "content": "I haven’t cussed in 5 years. My willpower has skyrocketed. “No person is free who is not master of themselves.” — Epictetus I’ve tried a number of multi-year experiments to boost my willpower: And yet by far the easiest thing I’ve done to strengthen my will was to quit saying certain 4-letter English words. Five years ago, I decided that going forward, I would refrain from saying any cuss word that you couldn’t find in the Old Testament. My commitment was immediately put to the test. I was at my brother’s house (a no-shoes household), and we had dimmed the lights so we could watch a movie. I was walking back to his living room with a bowl of freshly-popped popcorn, when suddenly a solid wood table leg appeared out of the shadows. I stubbed my toe so hard that the entire table screeched across his hardwood floor. My family went silent. They glanced down at my gushing pinky toe. Then up at my face. “Woah!” my brother’s wife said. “Doesn’t that hurt?” I just stood there, squeezing my popcorn bowl. Through my clenched teeth — and without really thinking about it — I said: “Not if you’re tough.” I don’t know what came over me. In truth, my toe hurt like crazy. Whatever it was, that night a family-wide meme was born. Ever since, whenever someone in our family gets injured somehow, they jokingly reply to inevitable questions about pain with “Not if you’re tough.” Then everybody laughs. If this had happened before I’d taken my vow of profanity silence, I would have no doubt jumped up and down shouting curse words. But instead, a serene side began to emerge and take hold of my personality. Substituting profanity with “aliases” Darn. Heck. Shoot. There were softer versions of pretty much every cuss word out there, and I quickly adopted these. But one word was missing. The big one that everyone uses as a verb, adjective, and even a noun — sometimes all in the same sentence. And no, “fudge” wasn’t going to cut it for me. Fortunately, my wife and I had just binge-watched the entire series of Battlestar Galactica over one rainy winter in Shanghai. Battlestar Galactica features a civilization that is technologically advanced, but also brooding, alcoholic, and potty-mouthed. And instead of omitting the f-word from the show entirely, like similarly gritty — yet still PG-13 — shows did, the writers decided to make up their own f-word so that the actors could freely say on TV: frak. When you first watch the show, and notice them saying “frak,” it’s quite cheesy. The characters say things to one another like “Frak you!”, “What the frak?” and even “Go frak yourself.” And of course, this was before the term “fracking” — the environmentally questionable act of pumping high-pressure fluid into the ground to extract oil and natural gas — had entered popular lexicon. This made use of the word “frak” even more absurd. And that absurdity lended it a certain humor. A certain power. So with this final addition to my array of cuss word aliases, I had everything I needed to go profanity-free. Just like how the Mr. Robot protagonist Elliot Alderson would later condition himself to hear the words “Evil Corp” whenever someone uttered “E Corp”, I conditioned myself to hear the Battlestar Galactica “frak” in place of other people’s f-bombs. Over time, I reached for these aliases less and less. Sure, there were occasions where I would shout, “Oh, frak! Our production servers are down!” But more often than not, I would just respond to bad situations with stoic silence. A less %@#$ed-up tomorrow Quitting cussing wasn’t all that hard to do. And in addition to strengthening my willpower, it seems to have made my day-to-day outlook a bit brighter. There isn’t much solid research about the role of profanity in human psychology. There are a few one-off studies that suggest that people who cuss frequently might be smarter or perceived by others as being more honest. These conclusions seem counter-intuitive to me, but I’ll keep an open mind in case more studies support this. I personally don’t feel I’ve lost any of my dynamic range as a result of not cussing. Not that there’s anything wrong with cussing, or that it should be censored in any way. People cuss. No big deal. As of 2017, we’ve got bigger issues to worry about. On the contrary, I think that cuss words can often add a valuable dramatic effect. Back in 1934, Hollywood studios asked the producers of the 1934 film “Gone with the Wind” to change the now-famous line: “Frankly, my dear, I don’t give a damn” to “Frankly, my dear, I don’t care.” But the producers successfully argued that the word “damn” was necessary to convey the extent of the emotion, and it was left in the film. Producers also successfully advocated for the right to use the word “hell” in Captain Kirk’s famous line, “Let’s get the hell out of here.” This was one of the first times the word “hell” had been used like this on broadcast television. It was in the classic 1967 Star Trek episode “City on the Edge of Forever.” (By the way, if you haven’t seen this episode, it’s on Netflix and you should totally watch it). One side benefit of not cussing is that I no longer have to self-censor my speech around polite company, or in front of kids. Profanity doesn’t just “slip out” in casual banter like it used to. I can now just say what’s on my mind, confident that, while some people may take issue with my ideas, they probably won’t flinch at the words I use. If you want to learn more about little hacks like this one that you can use to improve your willpower — and thus your productivity — I recommend reading this book by Stanford psychology professor Kelly McGonigal: The Willpower Instinct: How Self-Control Works, Why It Matters, and What You Can Do to Get More of…Edit descriptionamzn.to I plan to continue exploring habits that can boost my willpower. For as the great poet once wrote: “Tis in ourselves that we are thus or thus. Our bodies are our gardens to the which our wills are gardeners.”―William Shakespeare, Othello Thanks for reading! If you liked this article, click the 💚 below so other people will see this here on Medium. ", "author": "Quincy Larson", "parent": ""}