{"name": "1884", "title": "As I Lay Dying", "sentences": [{"85ba": "As I Lay Dying"}, {"5bf5": "How I felt some nights alone in bed."}, {"c88c": "Sat April 9th, 2016"}, {"b002": "Emergency room MD: “You’re cancelling your Hawaii trip. Scans show a number of lumps on your organs. We’re going to check you into the hospital immediately. Looks like Lymphoma. [I later figured out this was code for “we sure hope it’s lymphoma, because that's much more treatable than metastatic carcinoma.”] I told our Hawaii friends we couldn’t make it, huddled with family, got more scans and cell samples at the hospital and hid at home from the world and my future."}, {"b01d": "Tuesday April 14th"}, {"e1b3": "My sister, a pediatric hematology oncologist that lives in Philly with her family, flies out to be with us. She was the first person I called after Molly on Saturday and within minutes she said she was flying out."}, {"9d49": "Wednesday April 15th"}, {"5843": "Phone call from my new oncologist taken in my kitchen. I’m home alone. She’s anxious … get’s right to the point before I even know what the point is. “I need to tell you pathology identified your tumor as a carcinoma. I’ve set up an appointment for you Friday. Speak with you then.” I scribbled notes on a handy Chinese menu. “Carcinoma, not lymphoma.” No one had wanted to prep me if I in fact did not have a treatable form of lymphoma, so I absentmindedly kept moving about until I found myself looking into a wall mirror back at my tumored self, realizing I was in grave danger. Carcinoma, not lymphoma."}, {"b278": "Friday April 17th"}, {"21fc": "Walk into my oncologist’s cramped office. My wife and my sister are with me. Mabel’s at pre-school. The doctor re-angles her monitor but I can see it’s my PET scan - and I see the same image I saw through the technician's window after getting the scan - the one I tried to ignore because there were jarring color blobs aside the grey outlines of organs and body interior. From where my sister was sitting I could tell she saw it and knew what I was going to be told."}, {"1660": "Oncologist tells me that I’m stage 4 metastatic carcinoma. Growths had formed on my kidneys, lungs, omentum, adrenal gland. (It was also on my pancreas.) I numbly sat through this diagnosis holding Molly’s hand. Since my doctor didn’t offer, I had to ask her — with as much strength as I could summon — what are the survival rates for people in my situation. Then the bomb explodes. “There’s no cure,” she says. Primal emotional horror panic. Mentally stumbling deafly through a mortal blast. I climbed onto Molly’s lap because I want to crawl inside her and I kept cry-screaming out “what are we going to do? What are we going to do?” in an inhuman voice. Molly just cried with me as I recall. She didn’t know, but she was strong. My crying sister said it could be years not just months. My doctor excused herself and left us in her office. She must have to do this on a weekly basis. I remember keying in on a family photo on her desk, with her two daughters, one she has already told me was Mabel’s age. My brain silently spoke to them. Their parents live. I orphan mine. I don’t remember going home."}, {"c741": "Late April-May"}, {"31b0": "I prioritized much of my waning strength to get our finances ready for my disappearance. Molly and I had already created a Living Trust, but since then, items hadn’t been explicitly placed in it. In California if the deceased has items of value not in a trust, it can take up to a year of probate for them to be valued by the state and be distributed to recipients. I sat in my lawyer’s conference room on a couch, a very chemo-sick man, doing all I could to keep my faculties straight. I used to do all my own paperwork because of their hourly, now I was behoving them to please manage it all. Just do it all. I wasn’t sure it would get done before I was."}, {"99af": "Chemo wrecked me as much as the cancer. Molly had now dropped her life and become my primary caregiver. As it got worse I wondered if I could be as strong as her if our roles were reversed. Within a month I was raced to the emergency room because I was, in effect, starving. Unexplained weight loss was a symptom before my diagnosis and once the chemo started I stopped eating. I was infused with 30 lbs of fluid weight, stabilized, discharged and lost it all within a couple weeks. I kept daily records of how much I ate. Each one was a sob story. My life’s whole mission became trying to eat 2,000 calories a day. I could rarely do it. I’d struggle to eat a simple meal over hours of time and then vomit it all up later. I stopped leaving the house. I could barely walk up the stairs. I couldn’t read a book to my daughter at bedtime. I couldn’t take my clothes off at bedtime. On my off weeks from chemo I still felt awful, depleted, nauseous, wrecked by opiod-induced constipation."}, {"5b25": "I was in a death spiral. I was dying. How can I make my daughter fatherless? What would life be like for Molly for the next 40 years? A friend came often and captured videos of my life story. I so wanted my daughter (and maybe her kids) to know about me. I wanted to make videos of me sharing the life guidance I’d been planning to give my daughter. I was bereft I wouldn’t be there with a shoulder when the trials of puberty, mean girls, boys and determining her life path came along. I promised myself I would sit and record them alone with my phone, but I never even tried. I knew I’d just record myself blubbering in sadness. My family was with me constantly. I tried to thank them whenever I had the headspace."}, {"d5a8": "June"}, {"03f1": "Molly would put me to bed before 9pm and I’d lie alone suffering uncontrollable crying jags. I was on anti-depressants, anti-anxiety meds, pain killers, but after keeping it together all day, I couldn’t stop thinking about my death, their lives without me. I imagined people at my memorial service, looking at each other without me. I imagined it was amongst redwood trees or on a Pacific bluff. I imagined life-like human-size great blue heron’s cutouts standing among the attendees, and frangipani blossoms everywhere. I’d hear certain songs and mentally add them to my memorial service playlist."}, {"b37a": "I often pondered the philosophy of cancer because it’s hard to make sense of it. What’s the evolutionary benefit of killing your host when that kills you too? Why does cancer win to die? I was surprised to find so few results on Google. I asked my sister who has studied cancer for 20 years and she said it would be a good post for my blog. Cancer isn’t a virus or bateria. It’s a mutation. A mutation that happens with great regularity amongst some but not all mammals and it mutates in one of a recurring common or rare manners. What is cancer’s purpose. Is it to cull the herd? Is cancer non-evolutionary (i.e. not created by natural forces)? Is cancer still evolving? Is it’s end goal to become transferable from person to person? Tasmanian Devil populations have become decimated by a transferrable facial tumor disease. Are human cancers mutating in half of all humans for the chance to find the variant that leads to transferability? Will cancer jump the transferability firewall? What is the philosophy of cancer?"}, {"e5f0": "Molly and I kept a very high-level gallows humor to get us through. I thought it would have been hilarious to shamble along in a shirt say that said “I’m dying here,” or “This is killing me,” or “OMG, dying!” I finally shared my thoughts about my funeral with Molly one night. Nothing was surprising because how could we not be thinking the same thoughts. We’ve both always been very grounded. So we just sat on the couch and shared what thoughts had come to mind."}, {"f512": "Not to slight my family, but the novelty of dear and far flung friends visiting the house usually gave me my best energy of the day. We’d talk for hours on end as if they had no where else to be in their busy lives (they did). And they were the conversations of life, experience, family, adventure, friendship, love, and loss. I always made them tell me their problems, the harder the better, as it made me forget about mine for a bit. It never felt like the last time we’d talk, but I’d share how scared I was I wouldn’t be there for Molly and Mabel and would people look out for them during and and after. I’d often collapse after the visitor left having used all my life force to connect with them. Sometimes I’d pass out and they’d show themselves out. Molly asked me to not exhaust myself and leave her and my family to manage me. It was bad. It was really bad."}, {"bf82": "I was responding awfully to chemo. It was having no affect on the mature tumors in my body and destroyed me seven days straight. Some people do chemo on Fridays so by Monday they can be back at work. I wouldn’t even get a good day before my next weekly treatment. I battled every single day to eat and keep down 2,000 calories. Lack of appetite, changed tastebuds, nausea, vomiting, excruciating constipation all conspired against me gaining a pound. Some days cannabis would give me the munchies like a glazy eyed dead head, but up it would come hours later as my body had no way to process it. Watching all those calories go into the toilet bowl was like Tom Hanks in Castaway watching Wilson float way from his raft. I was watching my life force get away from me."}, {"600a": "In July our whole focus was getting to our family place in New Hampshire for maybe one last time. It would be immediate family only and a dear friend offered to pay to fly Molly, Mabel and I private because I could barely make it. A couple weeks beforehand I had darkly started envisioned being stuck lying on the couch all day, like I was in SF, and having the sad eyes of my family on me all day long. In fact my family got a second couch for the house because I’d need one constantly. I wrote a long message to the family not to expect anything out of me and that I’d just be happy to be there."}, {"9195": "Late July-September"}, {"72aa": "If you’ve been following my story, you know a couple weeks before we tried a strategic hail mary. My oncologist at UCSF put me on a recently FDA approved immunological treatment Opdivo (Nivolumab). I placed it’s effectiveness odds at 10%. (It only worked on 1 in 3 kidney patients and I gave myself a 1 in 3 chance of having kidney vs a different urological carcinoma.) My doctors never speculated on potential results because it’s decided amongst them that offering false hope isn’t fair. My oncologist was hopeful though because DNA tests of my tumor (yes, I have the DNA sequence of my tumor now, as well as my human DNA) showed a PD1 checkpoint inhibitor marker. Cancer is a spontaneous mutation of human DNA, but it does often mutate the same way and he saw the PD1 as indication that if had kidney carcinoma then Opdivo has a 33% chance of educating human white blood cells to override the inhibitor and attack the tumors as if they’re any other foreign receptor."}, {"9dc1": "Suddenly before New Hampshire I was sitting up more. I was eating better and walking around. In New Hampshire I joined meals, I went swimming (in a wet suit) and I surprised myself when I lifted my daughter straight up into the air. Just weeks before I couldn’t even lift myself up."}, {"6e55": "Now"}, {"776e": "I’ve gained some powerful emotional powers (super powers) in what I’ve been calling my second life. Most all my deep-set hangups died with my first life. A number (but not all) of my grudges, entitled expectations, self-assumed responsibilities, judgements are simply gone. I have no FOMO. There isn’t an event I’ve heard of since I’ve recovered that I wish I would have been at. I’m simply content to be alive and living my life. I have no bucket list. Life is the bucket."}, {"d0b7": "Meanwhile I’m entirely at peace if I die. I am ready for life to end at any point, yet also ready to use each day, month, year I get towards a long arc of purpose of my life. I still carry the cancer in me and though the tumors are beaten into scab-covered lumps, if society broke down, and I couldn’t get Opdivo, I’d be a dead man walking. I had to lay with death. I had to accept it’s vacuum, it’s mortal horror. I had to get my life ready for it’s end. I had to envision the conscious reality of the people I know and love moving on without me. If tomorrow is my last day or I outlive you all, I’m content with how it all worked out."}, {"0d62": "Enjoy every day. It may be your last."}, {"1c56": "[Ted Rheingold has written about his stage 4 metastatic carcinoma experience in the Medium publication, Season of the Witch. You can follow him living his second life on Twitter @tedr.]"}], "child": "1884_1\t1884_2\t1884_3\t1884_4\t1884_5\t1884_6\t1884_7\t1884_8\t1884_9\t1884_10\t1884_11\t1884_12\t1884_13\t1884_14\t1884_15\t1884_16\t1884_17\t1884_18\t1884_19\t1884_20\t1884_21\t1884_22\t1884_23\t1884_24\t1884_25", "timestamp": "Apr 9", "content": "As I Lay Dying How I felt some nights alone in bed. Sat April 9th, 2016 Emergency room MD: “You’re cancelling your Hawaii trip. Scans show a number of lumps on your organs. We’re going to check you into the hospital immediately. Looks like Lymphoma. [I later figured out this was code for “we sure hope it’s lymphoma, because that's much more treatable than metastatic carcinoma.”] I told our Hawaii friends we couldn’t make it, huddled with family, got more scans and cell samples at the hospital and hid at home from the world and my future. Tuesday April 14th My sister, a pediatric hematology oncologist that lives in Philly with her family, flies out to be with us. She was the first person I called after Molly on Saturday and within minutes she said she was flying out. Wednesday April 15th Phone call from my new oncologist taken in my kitchen. I’m home alone. She’s anxious … get’s right to the point before I even know what the point is. “I need to tell you pathology identified your tumor as a carcinoma. I’ve set up an appointment for you Friday. Speak with you then.” I scribbled notes on a handy Chinese menu. “Carcinoma, not lymphoma.” No one had wanted to prep me if I in fact did not have a treatable form of lymphoma, so I absentmindedly kept moving about until I found myself looking into a wall mirror back at my tumored self, realizing I was in grave danger. Carcinoma, not lymphoma. Friday April 17th Walk into my oncologist’s cramped office. My wife and my sister are with me. Mabel’s at pre-school. The doctor re-angles her monitor but I can see it’s my PET scan - and I see the same image I saw through the technician's window after getting the scan - the one I tried to ignore because there were jarring color blobs aside the grey outlines of organs and body interior. From where my sister was sitting I could tell she saw it and knew what I was going to be told. Oncologist tells me that I’m stage 4 metastatic carcinoma. Growths had formed on my kidneys, lungs, omentum, adrenal gland. (It was also on my pancreas.) I numbly sat through this diagnosis holding Molly’s hand. Since my doctor didn’t offer, I had to ask her — with as much strength as I could summon — what are the survival rates for people in my situation. Then the bomb explodes. “There’s no cure,” she says. Primal emotional horror panic. Mentally stumbling deafly through a mortal blast. I climbed onto Molly’s lap because I want to crawl inside her and I kept cry-screaming out “what are we going to do? What are we going to do?” in an inhuman voice. Molly just cried with me as I recall. She didn’t know, but she was strong. My crying sister said it could be years not just months. My doctor excused herself and left us in her office. She must have to do this on a weekly basis. I remember keying in on a family photo on her desk, with her two daughters, one she has already told me was Mabel’s age. My brain silently spoke to them. Their parents live. I orphan mine. I don’t remember going home. Late April-May I prioritized much of my waning strength to get our finances ready for my disappearance. Molly and I had already created a Living Trust, but since then, items hadn’t been explicitly placed in it. In California if the deceased has items of value not in a trust, it can take up to a year of probate for them to be valued by the state and be distributed to recipients. I sat in my lawyer’s conference room on a couch, a very chemo-sick man, doing all I could to keep my faculties straight. I used to do all my own paperwork because of their hourly, now I was behoving them to please manage it all. Just do it all. I wasn’t sure it would get done before I was. Chemo wrecked me as much as the cancer. Molly had now dropped her life and become my primary caregiver. As it got worse I wondered if I could be as strong as her if our roles were reversed. Within a month I was raced to the emergency room because I was, in effect, starving. Unexplained weight loss was a symptom before my diagnosis and once the chemo started I stopped eating. I was infused with 30 lbs of fluid weight, stabilized, discharged and lost it all within a couple weeks. I kept daily records of how much I ate. Each one was a sob story. My life’s whole mission became trying to eat 2,000 calories a day. I could rarely do it. I’d struggle to eat a simple meal over hours of time and then vomit it all up later. I stopped leaving the house. I could barely walk up the stairs. I couldn’t read a book to my daughter at bedtime. I couldn’t take my clothes off at bedtime. On my off weeks from chemo I still felt awful, depleted, nauseous, wrecked by opiod-induced constipation. I was in a death spiral. I was dying. How can I make my daughter fatherless? What would life be like for Molly for the next 40 years? A friend came often and captured videos of my life story. I so wanted my daughter (and maybe her kids) to know about me. I wanted to make videos of me sharing the life guidance I’d been planning to give my daughter. I was bereft I wouldn’t be there with a shoulder when the trials of puberty, mean girls, boys and determining her life path came along. I promised myself I would sit and record them alone with my phone, but I never even tried. I knew I’d just record myself blubbering in sadness. My family was with me constantly. I tried to thank them whenever I had the headspace. June Molly would put me to bed before 9pm and I’d lie alone suffering uncontrollable crying jags. I was on anti-depressants, anti-anxiety meds, pain killers, but after keeping it together all day, I couldn’t stop thinking about my death, their lives without me. I imagined people at my memorial service, looking at each other without me. I imagined it was amongst redwood trees or on a Pacific bluff. I imagined life-like human-size great blue heron’s cutouts standing among the attendees, and frangipani blossoms everywhere. I’d hear certain songs and mentally add them to my memorial service playlist. I often pondered the philosophy of cancer because it’s hard to make sense of it. What’s the evolutionary benefit of killing your host when that kills you too? Why does cancer win to die? I was surprised to find so few results on Google. I asked my sister who has studied cancer for 20 years and she said it would be a good post for my blog. Cancer isn’t a virus or bateria. It’s a mutation. A mutation that happens with great regularity amongst some but not all mammals and it mutates in one of a recurring common or rare manners. What is cancer’s purpose. Is it to cull the herd? Is cancer non-evolutionary (i.e. not created by natural forces)? Is cancer still evolving? Is it’s end goal to become transferable from person to person? Tasmanian Devil populations have become decimated by a transferrable facial tumor disease. Are human cancers mutating in half of all humans for the chance to find the variant that leads to transferability? Will cancer jump the transferability firewall? What is the philosophy of cancer? Molly and I kept a very high-level gallows humor to get us through. I thought it would have been hilarious to shamble along in a shirt say that said “I’m dying here,” or “This is killing me,” or “OMG, dying!” I finally shared my thoughts about my funeral with Molly one night. Nothing was surprising because how could we not be thinking the same thoughts. We’ve both always been very grounded. So we just sat on the couch and shared what thoughts had come to mind. Not to slight my family, but the novelty of dear and far flung friends visiting the house usually gave me my best energy of the day. We’d talk for hours on end as if they had no where else to be in their busy lives (they did). And they were the conversations of life, experience, family, adventure, friendship, love, and loss. I always made them tell me their problems, the harder the better, as it made me forget about mine for a bit. It never felt like the last time we’d talk, but I’d share how scared I was I wouldn’t be there for Molly and Mabel and would people look out for them during and and after. I’d often collapse after the visitor left having used all my life force to connect with them. Sometimes I’d pass out and they’d show themselves out. Molly asked me to not exhaust myself and leave her and my family to manage me. It was bad. It was really bad. I was responding awfully to chemo. It was having no affect on the mature tumors in my body and destroyed me seven days straight. Some people do chemo on Fridays so by Monday they can be back at work. I wouldn’t even get a good day before my next weekly treatment. I battled every single day to eat and keep down 2,000 calories. Lack of appetite, changed tastebuds, nausea, vomiting, excruciating constipation all conspired against me gaining a pound. Some days cannabis would give me the munchies like a glazy eyed dead head, but up it would come hours later as my body had no way to process it. Watching all those calories go into the toilet bowl was like Tom Hanks in Castaway watching Wilson float way from his raft. I was watching my life force get away from me. In July our whole focus was getting to our family place in New Hampshire for maybe one last time. It would be immediate family only and a dear friend offered to pay to fly Molly, Mabel and I private because I could barely make it. A couple weeks beforehand I had darkly started envisioned being stuck lying on the couch all day, like I was in SF, and having the sad eyes of my family on me all day long. In fact my family got a second couch for the house because I’d need one constantly. I wrote a long message to the family not to expect anything out of me and that I’d just be happy to be there. Late July-September If you’ve been following my story, you know a couple weeks before we tried a strategic hail mary. My oncologist at UCSF put me on a recently FDA approved immunological treatment Opdivo (Nivolumab). I placed it’s effectiveness odds at 10%. (It only worked on 1 in 3 kidney patients and I gave myself a 1 in 3 chance of having kidney vs a different urological carcinoma.) My doctors never speculated on potential results because it’s decided amongst them that offering false hope isn’t fair. My oncologist was hopeful though because DNA tests of my tumor (yes, I have the DNA sequence of my tumor now, as well as my human DNA) showed a PD1 checkpoint inhibitor marker. Cancer is a spontaneous mutation of human DNA, but it does often mutate the same way and he saw the PD1 as indication that if had kidney carcinoma then Opdivo has a 33% chance of educating human white blood cells to override the inhibitor and attack the tumors as if they’re any other foreign receptor. Suddenly before New Hampshire I was sitting up more. I was eating better and walking around. In New Hampshire I joined meals, I went swimming (in a wet suit) and I surprised myself when I lifted my daughter straight up into the air. Just weeks before I couldn’t even lift myself up. Now I’ve gained some powerful emotional powers (super powers) in what I’ve been calling my second life. Most all my deep-set hangups died with my first life. A number (but not all) of my grudges, entitled expectations, self-assumed responsibilities, judgements are simply gone. I have no FOMO. There isn’t an event I’ve heard of since I’ve recovered that I wish I would have been at. I’m simply content to be alive and living my life. I have no bucket list. Life is the bucket. Meanwhile I’m entirely at peace if I die. I am ready for life to end at any point, yet also ready to use each day, month, year I get towards a long arc of purpose of my life. I still carry the cancer in me and though the tumors are beaten into scab-covered lumps, if society broke down, and I couldn’t get Opdivo, I’d be a dead man walking. I had to lay with death. I had to accept it’s vacuum, it’s mortal horror. I had to get my life ready for it’s end. I had to envision the conscious reality of the people I know and love moving on without me. If tomorrow is my last day or I outlive you all, I’m content with how it all worked out. Enjoy every day. It may be your last. [Ted Rheingold has written about his stage 4 metastatic carcinoma experience in the Medium publication, Season of the Witch. You can follow him living his second life on Twitter @tedr.] ", "author": "Ted Rheingold", "parent": ""}