{"name": "1891", "title": "Welcome to The Boob Lounge, Part 4", "sentences": [{"1805": "Welcome to The Boob Lounge, Part 4"}, {"596a": "A Serialized Account of How I Was Crowned The Prom Queen of WTF World."}, {"abb7": "(Note: This is an unfolding story. If you haven’t read the first installment, you’ll find it easier to move about the cabin if you go back and start here)."}, {"fa31": "Photo credit: veerterzy"}, {"3eb7": "Part 4: Decisions About Incisions"}, {"b305": "October 8th. But first I tell the kids."}, {"7d9e": "Have you ever dropped something glass or china and noticed that just as it starts to slip out of your hand, time feels like it’s splitting?"}, {"793e": "I only ask this in the hopes that there are some other equally Klutzy-capital K types out there like me who have done this enough times that it can start to feel like a spiritual experience. Who drop things often enough that after a while, “Oh, shit” seems, I don’t know, kind of a lackluster attempt at finding meaning in the everyday."}, {"293a": "If you’re like me, two things start happening at the same time. Your brain, clearly the one who is in charge of General Coordination And Not Dropping Stuff, begins to grasp what’s going to probably happen next, and immediately starts preparing to file it into the These Things Happen file: not noticing the mason jar on the counter is slick with condensation until it’s too late. Rushing while reorganizing the heirloom crystal even though you know it’s not a good idea (because let’s face it, so boring). Changing a lightbulb single-handedly then absentmindedly switching to two hands to screw the fixtures back in before you remember you’re still holding the dead bulb."}, {"04d1": "We’re human. Things break. But whatever the item is that has loosed its way into free fall — a plate that’s already chipped anyway, a drinking glass that now makes the third out of the set that’s bit the dust in as many months, it sort of hovers in the air for the minutest of fractions of moments. Wherefore the brain, which also happens to be in charge of Deductive Reasoning Based On Experience, offers a second option, split-screening it if you will: the first moment is now divided into two simultaneous awarenesses: knowing what’s probably going to happen next and also experiencing it too."}, {"a964": "Your brain knows that you know that it knows this, that what’s going to happen very shortly involves noise and mess and shouts of “I’m ok!” to reassure people in the next room. And while These Things Happen, you’re already making plans for vacuum cleaners and wet paper towels. Slightly desperately, your brain now offers a third reality populated mostly by dogs or small children whose consciousness is unburdened by the laws of physics and so contains the hope for an eventuality a bit more surprising. Like maybe the glass will bounce."}, {"3fff": "Okay, three things happening at the same time. One in which we understand. Another in which we begin to prepare. And one in which we hope for magic."}, {"0d29": "I think it’s safe to say that I would rather have taken the entirety of all the dishes and glassware I had, including all the wedding china and stemware, out of my kitchen cabinets and dropped all of it right on my driveway rather than walk into the living room to tell 12 and 14 there was a malignancy in my breast. I could already hear the shattering anyway. And I’d never wanted more for something not to be true."}, {"dfa7": "Which seems strange when you consider that I’d already experienced, along with their dad, telling them he was dying, and also telling them on my own six weeks later that he was gone. And as horrifyingly sad and difficult as that was, this felt incomparably worse. Because they had already had to go through the other things. And now this. And this wasn’t going to get cleaned up in twenty minutes with a vacuum and wet paper towels."}, {"d765": "What I didn’t understand until well into the conversation was that our Now was colored completely by the fact that he’d been gone just a little over a year. A case could be made that we were still traumatized. Once I told them the news, we were all triggered by that loss again, like a sickening double-feature brought to you by PTSD Studios. When you say “cancer,” we say “death”!"}, {"cb6b": "But after I began to try and soothe their initial reactions, which were as individual as they were and made me feel like the leader of an emotional triage unit — 12 all drama and movement, 14 quiet and turning in — I focused on giving them the facts that I knew so far. I was surprised that I’d retained as much as I had given that I had been going in and out of shock all week. The science of what was going on brought them out gently and they began listening. Intently."}, {"934c": "I finished by saying something I hadn’t actually run by my doctors yet, but would do the following week to a room full of my “team,” and when I did would be met by nodding heads all around. I explained that as far as tumors went, what I had and what Daddy’d had could not have been more different. Mine was outside my main organs, sluggish, slow-growing, very treatable. His was aggressive, rare, hard to treat. “Sort of like the tortoise and the hare,” I suggested."}, {"b324": "“Yeah but you shouldn’t use that analogy,” 14 drolly replied. I suddenly realized why."}, {"e69d": "“The tortoise is the one who won,” added 12."}, {"0aac": "“Yes, but, mine’s not going to win, right? I’m just trying to characterize…Crap….Okay but you know what I mean!” I said with fake exasperation, which was my trusty hall pass of a phrase, especially if I’d dug myself into a corner with my husband. And we all knew what he would say in response. As if on queue, we beamed at each other, the tension finally subsiding."}, {"30b9": "As if I’d pitched it right to him, with a smile and a twinkle in his eye, he would reply as dryly as toast made in the desert on the hottest day of the year."}, {"a396": "“I have no idea what you’re talking about.”"}, {"99ba": "“You did great,” he offered later. “You are an amazing mum. Remember that. And what you said at the end is all true. Don’t worry.”"}, {"ad31": "What I’d said at the end hadn’t occurred to me at all until I found myself in the middle of saying it. A channeled message, like the ones that come through me when I am connected to and “speaking” with a client’s loved one that has passed on, or my own, or my guides that assist me with my work, often arrive incognito and leave no trace of memory. Like all channeled messages, this one unfolded itself on the spot, moving through me instantly, like a discovery. It often feels like I am translating from another language, phrase by phrase, and only until it is fully uttered does the meaning become clear. Almost like how unwrapping a present reveals the gift."}, {"9b04": "Channeled messages also have the hallmark of being incredibly calming to the channel. It’s the kind of experience that we as mediums are hard pressed to describe fully. The energy we carry through us not only has the individual personality hallmarks of the spirit or spirits relaying them to us, but also carries with it a tremendously powerful mandate to transform anything that’s not working towards our highest good. Those of us who do this work over a lifetime must take care to keep ourselves in good shape on all levels. Our bodies, minds, hearts and spirits must continually improve to become the best working vessel for an energy that demands healing and does not compromise. Anything out of balance must be addressed."}, {"b220": "The irony of this was not lost on me. I had a tumor in my boob. I knew there were huge and serious implications to that psychically speaking, but also in every other area of my life. Yet as I spoke, I felt a deep resourcefulness and the first glimmers of understanding of the work ahead of me. And despite the terror we would continue to dodge, I knew in ways I could not yet articulate that this tumor would be connected to my highest good."}, {"b62f": "I felt urged to set the question of whether I would die from it aside."}, {"e399": "What I found myself relating to the boys next was not only about why this was happening. The message coming through me encouraged us only on how to move through it. The messaged gained force as I spoke. This was painful to be sure, but we were supported and loved and would be able to reframe what had just happened to our family. Not all cancers killed. We were still holding trauma from losing our beloved dad and husband to a deadly, rare cancer. But this cancer would not kill me."}, {"e704": "I told them, “Listen very carefully to what I’m about to tell you. This completely sucks that we have to go through this. And we are likely going to have some really bad days full of worry. But I am going to be ok. You guys understand?” I made sure they were looking at me straight in the eye. “I am not dying. We are walking through this experience to understand, among other things, that not all cancers kill. And although we may not believe that fully until it’s over, we will get through this to the other side. This experience gives us the chance to begin again, with hope. And it will restore our hearts to us.”"}, {"b7f7": "Those poor kids. Getting a lecture on almost anything sucks, but a metaphysical treatise by your mom who is an Intuitive is just insufferable."}, {"e414": "Yet, telling my children I was not going to die so assuredly felt like a risky thing to do. Mostly because I was afraid of appearing as if I was in denial. It’s hard to clarify the power of intuition in a world that does not value it. It also seemed to me the stakes were pretty high for everyone involved, and culturally it’s even harder to trust one’s intuition in those circumstances. However, as I’ve taught over and over again, those are the stories that are most impactful and instructive, not only for us as the teller and the one who experienced it, but for others to hear."}, {"3ce5": "I knew that if I was starting to get messages from not only my dearly departed dead guy of a husband but other guides as well, about the apparent non-lethality of this tumor, I could trust them. But I am just as much a part of our culture that marginalizes intuition and have spent my share of hours in loops of second-guessing and self-doubt. With my clients and others, it’s easy and always has been. But it took a long time to unlearn bad habits and assumptions with regard to my own life. I think that’s why I am so passionate about teaching others that intuition is a natural resource."}, {"e46d": "I’m not sure I understand completely why it was the case that I believed so many people who over the years would tell me, oh-so-casually, that of course intuitives can’t read for themselves. It seemed like de facto common knowledge. It took my experience of my husband’s illness and death to reveal to me that, yes, we can."}, {"374b": "And I did. From the moment of his diagnosis until his death, I consistently received information about his illness well ahead of his doctors. The day they found out it was actually gastric cancer, I was away in New York City teaching a workshop and seeing clients. We decided that I should finish the last two days of my work and come home at the usual time so the kids wouldn’t be alarmed, and we would tell them when I returned. So that meant I had time after work on my own to process what was happening."}, {"71a3": "I walked for hours through Manhattan, intermittently with tears streaming down my face, as the information poured through me. He was going to die from this. I was given a general sense of those months when the disease would advance and when his body would weaken quickly. I was also given a strong directive towards a part of our souls’ agreements with each other in this life, which was that I was supposed to help him die as peacefully as possible."}, {"c23f": "Carrying the trajectory of his illness and death in my heart was the most challenging, difficult and lonely thing that I have ever done."}, {"27c2": "The gifts from that time were also the most prodigious. I was able to watch over and prepare my children because I knew what was going to happen. That is something that I will be forever grateful for, and possibly the whole of what was important to me at the time. But complicating the situation was the fact that increasingly my husband felt that remaining positive under all circumstances was going to save him from this deadly cancer. I actually believe that it kept him alive longer. But the fact is, stomach cancer, although rare, is incredibly lethal. He actually did live longer from the onset of his symptoms than most people in his situation. He survived through multiple surgeries, radiation, and two rounds of chemotherapy (one course of which 50% of patients do not complete as its side effects are so severe). But as the cancer advanced and the treatments failed, his positive outlook began to look more like a kind of insanity."}, {"357e": "The scathing cruelty of his loan of life coming due so soon was unfathomable to him. Who could imagine such a thing? He was a strong man in his prime who loved his family with a deep intensity. He could not cope with the reality that his life was ending, nor did he have the strength to actually grieve it. He clung to whatever dwindling vestiges of the old normality that were still available to him for almost eighteen months, including working right up until a few weeks before he died. Outside of that, he took every mental shortcut he could to avoid facing the enormity of what was happening."}, {"f266": "In the same pattern of behavior that kept him initially from telling his doctor that the antacid prescribed was having no effect on his chronic indigestion, thus delaying a proper diagnosis by nine months, he continued to minimize, rationalize and refuse. He turned his back on almost every suggestion I made. So I stopped making them unless he asked me directly."}, {"9a64": "The amount of energy it took to both swim in and at the same time delicately keep him safe from the reservoir of information of what I knew, was immense. He needed to but didn’t ask questions of his doctor, tell the truth about his symptoms, then later, make a will, fill out a DNR order, and lastly, sign up for hospice, go on oxygen. Plus a million more things dying requires of us. That we don’t want to do. I was sometimes a coach, sometimes bossy, sometimes sitting on my hands. Every day was different."}, {"4620": "In the very end, knowing he was speeding toward death, I spent three of his last six weeks trying to get him transferred to a local hospital so he could spend as much time as he could with our children. I attempted to make a case for a palliative care. His doctors, on the other hand, were adamant that he needed procedures to keep his esophagus open. Treatment only emaciated him further and bought him just five more days of being able to swallow."}, {"fb84": "I spent a lot of time crying both in front of him and in my office, where I would sneak off to sob into a pillow when I just could not take it anymore. Some weeks it seemed the more upset I got, the more dug in and lost he became. Other times it was the only signal he’d pay attention to. I felt like I was failing all the time."}, {"5e93": "And I was frequently angry. A lot of doors got slammed in our home in the face of his stubbornness that at times made him completely withdraw. There were periods where he didn’t even realize he hadn’t spoken a direct word to anyone in days. Every doctor he saw offered a positive spin or another procedural option or an optimistic interpretation of a test or even, two weeks before he died, an offer of chemo. I stood by and watched him grab them all. Sometimes aghast and trying not to show it. Trying to intervene as little as possible, knowing that I could no more open my mouth and speak my own language about what I knew than he could admit he was dying. After one CT scan in which his surgeon buoyantly proclaimed that the fluid in his lungs was an average side effect of chemo that had ended months before, and would probably clear up soon like many other cases she’d seen, I lost all hope of my own helpfulness."}, {"0c17": "It had taken me two days just to get the strength to go to the appointment, where I was sure he would be receiving confirmation of what I had been feeling increasingly for weeks, that his cancer had metastasized to his lungs, possibly his liver too. I would lie in bed with him at night, my hands drawn to places over his body where the cancer had traveled to and which felt overheated, like a fever burning in localized spots. My hands responded to the heat with a heat of their own. “Wow,” I blurted out once. “Can you feel that?” I said without thinking. “Feel what?” he responded. My hands, so chronically cold they are a daily nuisance, felt like they were on fire."}, {"49c5": "I said nothing."}, {"45f0": "It took me almost six weeks to recover from the doctor’s almost casual insistence that he was fine. Six weeks in which his disease then advanced so fast it was like watching a dog chase a squirrel up a tree. When I could not bear the loneliness of watching his denial race his disease to the finish, I would try to articulate what a tightrope I was on. I tried to tell a few people I trusted. Family. Friends. Healers. But they loved him too and could not face how sick he was and that he could die. I tried to tell them, he is dying. I’ve known. Don’t you see?"}, {"9b22": "I then endured everything from cheerleading, self-righteous coaching not to give up faith, and even being criticized for not being positive enough, for not being optimistic or supportive, and even for having no compassion for him nor for my children."}, {"2005": "I made a phone call. I had to ask."}, {"5a7a": "“So, Dr. Palladino, how did this happen?”"}, {"8644": "I mean, I’ve been having mammograms for ten years now. I believe the last three years were with 3D mammography. How the hell did the tumor get so big, undetected, if it’s slow growing and the equipment is so good?"}, {"d185": "She responded readily, almost as if she’d been waiting for me to bring it up. Cautioning me to consider the fact that my breast tissue was so dense it could, and did, camouflage the tumor insidiously. She told me that she and the radiologists had looked carefully at my mammograms on file and it appeared as though it was indeed identifiable in the mammogram I’d had in June of 2015. Again, she reminded me I needed to consider that it was even difficult to see it then, but they can with some confidence identify it retroactively. Only because they’re looking for it."}, {"9146": "June 2015. I’d had a diagnostic mammogram for what felt like a tiny hard lump barely as big as half a grain of rice. That I’d found in my right breast. Two centimeters max below where the malignancy was."}, {"4e8b": "They’d been looking right at it. And hadn’t seen it for what it was."}, {"8c0f": "June of 2015. My husband was in the hospital down in Boston after I finally insisted he speak to his doctor about all of the symptoms that been increasing since March: a persistent cough, terrible difficulty swallowing, more weight loss, fatigue, labored breathing."}, {"b2e7": "June of 2015. He’d finally been diagnosed with metastasis to the lungs. They were in the middle of proceduring and proceduring him, and I’d been driving an hour each way every day to be there for as much of it as I could. Friends would watch the boys after school and then when school ended for the year, camp, and I would try to get home before they went to bed. When I left for the hospital I felt guilty for leaving them and when I left the hospital for home I felt guilty for leaving my husband."}, {"9411": "Then I’d felt the lump and I took a day off to get it checked out."}, {"fa09": "June of 2015. We’d had cancer in our bodies at the same time."}, {"e67b": "Photo credit: Danielle MacInnes Photography"}, {"d450": "Next Time in Welcome To The Boob Lounge: Decisions About Incisions. Promise."}, {"c0a1": "☞ Susan Gorman is an Intuitive who has read for people around the globe for 30 years. Passionate that intuition is our birthright, she leads a variety of workshops on Intuitive Development and her Intuitive Meditation method. Recently widowed, she is working on her first book."}, {"4231": "If you liked reading this, check out Susan’s other pieces and hit the “recommend” button. It helps get the story to others who might get some healing out of it. And she loves hearing you liked it (you know, in your out-loud, non-telepathic voice)."}, {"7dec": "Visit her at www.susangorman.net, where you can find out more about me and my work, and sign up to get installments delivered straight to your inbox. Fun!"}, {"75c6": "Follow Susan on Facebook & Twitter."}, {"aae4": "Thanks to Debbie Galant"}], "child": "1891_11891_11891_11891_11891_11891_11891_11891_1", "timestamp": "Apr 6", "content": "Welcome to The Boob Lounge, Part 4 A Serialized Account of How I Was Crowned The Prom Queen of WTF World. (Note: This is an unfolding story. If you haven’t read the first installment, you’ll find it easier to move about the cabin if you go back and start here). Photo credit: veerterzy Part 4: Decisions About Incisions October 8th. But first I tell the kids. Have you ever dropped something glass or china and noticed that just as it starts to slip out of your hand, time feels like it’s splitting? I only ask this in the hopes that there are some other equally Klutzy-capital K types out there like me who have done this enough times that it can start to feel like a spiritual experience. Who drop things often enough that after a while, “Oh, shit” seems, I don’t know, kind of a lackluster attempt at finding meaning in the everyday. If you’re like me, two things start happening at the same time. Your brain, clearly the one who is in charge of General Coordination And Not Dropping Stuff, begins to grasp what’s going to probably happen next, and immediately starts preparing to file it into the These Things Happen file: not noticing the mason jar on the counter is slick with condensation until it’s too late. Rushing while reorganizing the heirloom crystal even though you know it’s not a good idea (because let’s face it, so boring). Changing a lightbulb single-handedly then absentmindedly switching to two hands to screw the fixtures back in before you remember you’re still holding the dead bulb. We’re human. Things break. But whatever the item is that has loosed its way into free fall — a plate that’s already chipped anyway, a drinking glass that now makes the third out of the set that’s bit the dust in as many months, it sort of hovers in the air for the minutest of fractions of moments. Wherefore the brain, which also happens to be in charge of Deductive Reasoning Based On Experience, offers a second option, split-screening it if you will: the first moment is now divided into two simultaneous awarenesses: knowing what’s probably going to happen next and also experiencing it too. Your brain knows that you know that it knows this, that what’s going to happen very shortly involves noise and mess and shouts of “I’m ok!” to reassure people in the next room. And while These Things Happen, you’re already making plans for vacuum cleaners and wet paper towels. Slightly desperately, your brain now offers a third reality populated mostly by dogs or small children whose consciousness is unburdened by the laws of physics and so contains the hope for an eventuality a bit more surprising. Like maybe the glass will bounce. Okay, three things happening at the same time. One in which we understand. Another in which we begin to prepare. And one in which we hope for magic. I think it’s safe to say that I would rather have taken the entirety of all the dishes and glassware I had, including all the wedding china and stemware, out of my kitchen cabinets and dropped all of it right on my driveway rather than walk into the living room to tell 12 and 14 there was a malignancy in my breast. I could already hear the shattering anyway. And I’d never wanted more for something not to be true. Which seems strange when you consider that I’d already experienced, along with their dad, telling them he was dying, and also telling them on my own six weeks later that he was gone. And as horrifyingly sad and difficult as that was, this felt incomparably worse. Because they had already had to go through the other things. And now this. And this wasn’t going to get cleaned up in twenty minutes with a vacuum and wet paper towels. What I didn’t understand until well into the conversation was that our Now was colored completely by the fact that he’d been gone just a little over a year. A case could be made that we were still traumatized. Once I told them the news, we were all triggered by that loss again, like a sickening double-feature brought to you by PTSD Studios. When you say “cancer,” we say “death”! But after I began to try and soothe their initial reactions, which were as individual as they were and made me feel like the leader of an emotional triage unit — 12 all drama and movement, 14 quiet and turning in — I focused on giving them the facts that I knew so far. I was surprised that I’d retained as much as I had given that I had been going in and out of shock all week. The science of what was going on brought them out gently and they began listening. Intently. I finished by saying something I hadn’t actually run by my doctors yet, but would do the following week to a room full of my “team,” and when I did would be met by nodding heads all around. I explained that as far as tumors went, what I had and what Daddy’d had could not have been more different. Mine was outside my main organs, sluggish, slow-growing, very treatable. His was aggressive, rare, hard to treat. “Sort of like the tortoise and the hare,” I suggested. “Yeah but you shouldn’t use that analogy,” 14 drolly replied. I suddenly realized why. “The tortoise is the one who won,” added 12. “Yes, but, mine’s not going to win, right? I’m just trying to characterize…Crap….Okay but you know what I mean!” I said with fake exasperation, which was my trusty hall pass of a phrase, especially if I’d dug myself into a corner with my husband. And we all knew what he would say in response. As if on queue, we beamed at each other, the tension finally subsiding. As if I’d pitched it right to him, with a smile and a twinkle in his eye, he would reply as dryly as toast made in the desert on the hottest day of the year. “I have no idea what you’re talking about.” “You did great,” he offered later. “You are an amazing mum. Remember that. And what you said at the end is all true. Don’t worry.” What I’d said at the end hadn’t occurred to me at all until I found myself in the middle of saying it. A channeled message, like the ones that come through me when I am connected to and “speaking” with a client’s loved one that has passed on, or my own, or my guides that assist me with my work, often arrive incognito and leave no trace of memory. Like all channeled messages, this one unfolded itself on the spot, moving through me instantly, like a discovery. It often feels like I am translating from another language, phrase by phrase, and only until it is fully uttered does the meaning become clear. Almost like how unwrapping a present reveals the gift. Channeled messages also have the hallmark of being incredibly calming to the channel. It’s the kind of experience that we as mediums are hard pressed to describe fully. The energy we carry through us not only has the individual personality hallmarks of the spirit or spirits relaying them to us, but also carries with it a tremendously powerful mandate to transform anything that’s not working towards our highest good. Those of us who do this work over a lifetime must take care to keep ourselves in good shape on all levels. Our bodies, minds, hearts and spirits must continually improve to become the best working vessel for an energy that demands healing and does not compromise. Anything out of balance must be addressed. The irony of this was not lost on me. I had a tumor in my boob. I knew there were huge and serious implications to that psychically speaking, but also in every other area of my life. Yet as I spoke, I felt a deep resourcefulness and the first glimmers of understanding of the work ahead of me. And despite the terror we would continue to dodge, I knew in ways I could not yet articulate that this tumor would be connected to my highest good. I felt urged to set the question of whether I would die from it aside. What I found myself relating to the boys next was not only about why this was happening. The message coming through me encouraged us only on how to move through it. The messaged gained force as I spoke. This was painful to be sure, but we were supported and loved and would be able to reframe what had just happened to our family. Not all cancers killed. We were still holding trauma from losing our beloved dad and husband to a deadly, rare cancer. But this cancer would not kill me. I told them, “Listen very carefully to what I’m about to tell you. This completely sucks that we have to go through this. And we are likely going to have some really bad days full of worry. But I am going to be ok. You guys understand?” I made sure they were looking at me straight in the eye. “I am not dying. We are walking through this experience to understand, among other things, that not all cancers kill. And although we may not believe that fully until it’s over, we will get through this to the other side. This experience gives us the chance to begin again, with hope. And it will restore our hearts to us.” Those poor kids. Getting a lecture on almost anything sucks, but a metaphysical treatise by your mom who is an Intuitive is just insufferable. Yet, telling my children I was not going to die so assuredly felt like a risky thing to do. Mostly because I was afraid of appearing as if I was in denial. It’s hard to clarify the power of intuition in a world that does not value it. It also seemed to me the stakes were pretty high for everyone involved, and culturally it’s even harder to trust one’s intuition in those circumstances. However, as I’ve taught over and over again, those are the stories that are most impactful and instructive, not only for us as the teller and the one who experienced it, but for others to hear. I knew that if I was starting to get messages from not only my dearly departed dead guy of a husband but other guides as well, about the apparent non-lethality of this tumor, I could trust them. But I am just as much a part of our culture that marginalizes intuition and have spent my share of hours in loops of second-guessing and self-doubt. With my clients and others, it’s easy and always has been. But it took a long time to unlearn bad habits and assumptions with regard to my own life. I think that’s why I am so passionate about teaching others that intuition is a natural resource. I’m not sure I understand completely why it was the case that I believed so many people who over the years would tell me, oh-so-casually, that of course intuitives can’t read for themselves. It seemed like de facto common knowledge. It took my experience of my husband’s illness and death to reveal to me that, yes, we can. And I did. From the moment of his diagnosis until his death, I consistently received information about his illness well ahead of his doctors. The day they found out it was actually gastric cancer, I was away in New York City teaching a workshop and seeing clients. We decided that I should finish the last two days of my work and come home at the usual time so the kids wouldn’t be alarmed, and we would tell them when I returned. So that meant I had time after work on my own to process what was happening. I walked for hours through Manhattan, intermittently with tears streaming down my face, as the information poured through me. He was going to die from this. I was given a general sense of those months when the disease would advance and when his body would weaken quickly. I was also given a strong directive towards a part of our souls’ agreements with each other in this life, which was that I was supposed to help him die as peacefully as possible. Carrying the trajectory of his illness and death in my heart was the most challenging, difficult and lonely thing that I have ever done. The gifts from that time were also the most prodigious. I was able to watch over and prepare my children because I knew what was going to happen. That is something that I will be forever grateful for, and possibly the whole of what was important to me at the time. But complicating the situation was the fact that increasingly my husband felt that remaining positive under all circumstances was going to save him from this deadly cancer. I actually believe that it kept him alive longer. But the fact is, stomach cancer, although rare, is incredibly lethal. He actually did live longer from the onset of his symptoms than most people in his situation. He survived through multiple surgeries, radiation, and two rounds of chemotherapy (one course of which 50% of patients do not complete as its side effects are so severe). But as the cancer advanced and the treatments failed, his positive outlook began to look more like a kind of insanity. The scathing cruelty of his loan of life coming due so soon was unfathomable to him. Who could imagine such a thing? He was a strong man in his prime who loved his family with a deep intensity. He could not cope with the reality that his life was ending, nor did he have the strength to actually grieve it. He clung to whatever dwindling vestiges of the old normality that were still available to him for almost eighteen months, including working right up until a few weeks before he died. Outside of that, he took every mental shortcut he could to avoid facing the enormity of what was happening. In the same pattern of behavior that kept him initially from telling his doctor that the antacid prescribed was having no effect on his chronic indigestion, thus delaying a proper diagnosis by nine months, he continued to minimize, rationalize and refuse. He turned his back on almost every suggestion I made. So I stopped making them unless he asked me directly. The amount of energy it took to both swim in and at the same time delicately keep him safe from the reservoir of information of what I knew, was immense. He needed to but didn’t ask questions of his doctor, tell the truth about his symptoms, then later, make a will, fill out a DNR order, and lastly, sign up for hospice, go on oxygen. Plus a million more things dying requires of us. That we don’t want to do. I was sometimes a coach, sometimes bossy, sometimes sitting on my hands. Every day was different. In the very end, knowing he was speeding toward death, I spent three of his last six weeks trying to get him transferred to a local hospital so he could spend as much time as he could with our children. I attempted to make a case for a palliative care. His doctors, on the other hand, were adamant that he needed procedures to keep his esophagus open. Treatment only emaciated him further and bought him just five more days of being able to swallow. I spent a lot of time crying both in front of him and in my office, where I would sneak off to sob into a pillow when I just could not take it anymore. Some weeks it seemed the more upset I got, the more dug in and lost he became. Other times it was the only signal he’d pay attention to. I felt like I was failing all the time. And I was frequently angry. A lot of doors got slammed in our home in the face of his stubbornness that at times made him completely withdraw. There were periods where he didn’t even realize he hadn’t spoken a direct word to anyone in days. Every doctor he saw offered a positive spin or another procedural option or an optimistic interpretation of a test or even, two weeks before he died, an offer of chemo. I stood by and watched him grab them all. Sometimes aghast and trying not to show it. Trying to intervene as little as possible, knowing that I could no more open my mouth and speak my own language about what I knew than he could admit he was dying. After one CT scan in which his surgeon buoyantly proclaimed that the fluid in his lungs was an average side effect of chemo that had ended months before, and would probably clear up soon like many other cases she’d seen, I lost all hope of my own helpfulness. It had taken me two days just to get the strength to go to the appointment, where I was sure he would be receiving confirmation of what I had been feeling increasingly for weeks, that his cancer had metastasized to his lungs, possibly his liver too. I would lie in bed with him at night, my hands drawn to places over his body where the cancer had traveled to and which felt overheated, like a fever burning in localized spots. My hands responded to the heat with a heat of their own. “Wow,” I blurted out once. “Can you feel that?” I said without thinking. “Feel what?” he responded. My hands, so chronically cold they are a daily nuisance, felt like they were on fire. I said nothing. It took me almost six weeks to recover from the doctor’s almost casual insistence that he was fine. Six weeks in which his disease then advanced so fast it was like watching a dog chase a squirrel up a tree. When I could not bear the loneliness of watching his denial race his disease to the finish, I would try to articulate what a tightrope I was on. I tried to tell a few people I trusted. Family. Friends. Healers. But they loved him too and could not face how sick he was and that he could die. I tried to tell them, he is dying. I’ve known. Don’t you see? I then endured everything from cheerleading, self-righteous coaching not to give up faith, and even being criticized for not being positive enough, for not being optimistic or supportive, and even for having no compassion for him nor for my children. I made a phone call. I had to ask. “So, Dr. Palladino, how did this happen?” I mean, I’ve been having mammograms for ten years now. I believe the last three years were with 3D mammography. How the hell did the tumor get so big, undetected, if it’s slow growing and the equipment is so good? She responded readily, almost as if she’d been waiting for me to bring it up. Cautioning me to consider the fact that my breast tissue was so dense it could, and did, camouflage the tumor insidiously. She told me that she and the radiologists had looked carefully at my mammograms on file and it appeared as though it was indeed identifiable in the mammogram I’d had in June of 2015. Again, she reminded me I needed to consider that it was even difficult to see it then, but they can with some confidence identify it retroactively. Only because they’re looking for it. June 2015. I’d had a diagnostic mammogram for what felt like a tiny hard lump barely as big as half a grain of rice. That I’d found in my right breast. Two centimeters max below where the malignancy was. They’d been looking right at it. And hadn’t seen it for what it was. June of 2015. My husband was in the hospital down in Boston after I finally insisted he speak to his doctor about all of the symptoms that been increasing since March: a persistent cough, terrible difficulty swallowing, more weight loss, fatigue, labored breathing. June of 2015. He’d finally been diagnosed with metastasis to the lungs. They were in the middle of proceduring and proceduring him, and I’d been driving an hour each way every day to be there for as much of it as I could. Friends would watch the boys after school and then when school ended for the year, camp, and I would try to get home before they went to bed. When I left for the hospital I felt guilty for leaving them and when I left the hospital for home I felt guilty for leaving my husband. Then I’d felt the lump and I took a day off to get it checked out. June of 2015. We’d had cancer in our bodies at the same time. Photo credit: Danielle MacInnes Photography Next Time in Welcome To The Boob Lounge: Decisions About Incisions. Promise. ☞ Susan Gorman is an Intuitive who has read for people around the globe for 30 years. Passionate that intuition is our birthright, she leads a variety of workshops on Intuitive Development and her Intuitive Meditation method. Recently widowed, she is working on her first book. If you liked reading this, check out Susan’s other pieces and hit the “recommend” button. It helps get the story to others who might get some healing out of it. And she loves hearing you liked it (you know, in your out-loud, non-telepathic voice). Visit her at www.susangorman.net, where you can find out more about me and my work, and sign up to get installments delivered straight to your inbox. Fun! Follow Susan on Facebook & Twitter. Thanks to Debbie Galant ", "author": "susan gorman", "parent": ""}