{"name": "1911", "title": "Stop Asking For An Eight Team College Football Playoff — Ask For One That’s Fair", "sentences": [{"c57c": "Stop Asking For An Eight Team College Football Playoff — Ask For One That’s Fair"}, {"498f": "The problem isn’t the number of teams selected, it’s HOW those teams are being selected. So what now?"}, {"2a54": "During the summer of 2014, I worked for a news outlet in Alabama where televisions throughout the office were showing the World Cup. During the group stages, the United States played Germany, a crazy game which concluded with an American loss. One of my coworkers, a self-professed “soccer hater,” thought the loss eliminated the U.S. team. “At least we’re done with this soccer nonsense now,” she said."}, {"315f": "Only, we weren’t done. A tie against Portugal and a win against Ghana gave the Americans enough points to advance to the knockout round. When I explained this to her, she expressed distaste. “You mean to tell me that we lost and still get to move on? That’s so stupid!”"}, {"4c42": "Now, keep in mind, I was working for a news outlet in Alabama. The woman was a huge Crimson Tide fan. I couldn’t help but reply, “The subjective system used in college football is OK with you, but THIS is stupid?!”"}, {"7840": "I thought of her last month when the College Football Playoff teams were announced. I wondered if she thought it was “stupid” that two conference champions missed the cut. The omissions of Penn State and Oklahoma felt stupid to me. After all, if you win your conference, shouldn’t that grant you get a ticket to the dance?"}, {"bb85": "Conference championships should be the most important factor in determining who qualifies. Why? Because they are not subjective."}, {"d701": "Objectivity Makes Sports Beautiful"}, {"2077": "The best thing about sports is that they aren’t biased. The outcome isn’t determined by color, class, who you are or where you’re from. All that matters is who scored the most points. This characteristic of sports has allowed for some beautiful moments."}, {"4b3e": "Take, for example, the 1983 NCAA Tournament. That year, Jim Valvano’s North Carolina State shocked the nation by winning the tournament. They didn’t just win a fluky game. They won the whole damn thing. Nobody saw it coming. In each round, they were the underdog. Everybody was just waiting for them to lose. But, somehow, at the end of each game, the Wolfpack had more points than the other team."}, {"391b": "Then, in the final, they were up against a historically good Houston team. A Houston team that included two NBA hall-of-famers — Hakeem Olajuwon and Clyde Drexler. Yeah, that team — “Phi Slamma Jamma.” NC State had NO CHANCE of winning that game. It just wasn’t possible. But Jimmy V believed. As he put it, “Every single day, in every walk of life, ordinary people do extraordinary things!” In the 1983 NCAA Tournament Final, the “ordinary” NC State did something extraordinary. They scored more points than Houston. They won."}, {"a4d5": "It’s chilling stuff that teaches an important lesson. That is, if you work hard and believe in yourself, anything’s possible."}, {"ebf1": "What makes this possible? Objectivity."}, {"599d": "In the early rounds, when NC State upset teams, everybody still doubted them. They wrote the games off as a fluke. But, in the NCAA Tournament, an objective measurement determines who advances. That is, if you score more points than the other team, you advance. Even though nobody considered NC State the “better team,” they went on to the next round. In that way, college basketball is like pretty much every other sport."}, {"1e4f": "That is, every sport except college football."}, {"f4b6": "This year, nobody expected much from Penn State. They weren’t ranked to start the season and nobody thought they had any chance of winning the Big-10. In contrast, Ohio State were favorite to win the Big-10 and were considered a legitimate national title contender."}, {"bc7a": "Yet, in October, Penn State shocked the country. They beat Ohio State 24–21. Nobody saw it coming. Everybody wrote it off as a fluke. But, James Franklin believed in his team. And, like Jimmy V’s NC State, Penn State just kept winning. They managed to make it out of the formidable Big Ten East and moved on to the Big Ten Championship game."}, {"28e0": "Penn State entered the championship game an underdog to the always competitive Wisconsin Badgers. Then, at halftime, Penn State trailed by a large margin. The game seemed all but lost. But, the team still believed. Somehow, Penn State was able to overcome a 21-point deficit to win the game 38–31. It was remarkable."}, {"8912": "“Every single day, in every walk of life, ordinary people do extraordinary things!” — Jim Valvano"}, {"fb65": "But, in college football, that’s not the end of the line. To become a national champion, you have to win a four team playoff. And, unlike college basketball, an objective measurement doesn’t determine who goes."}, {"b334": "Instead, it’s entirely subjective. A group of “experts” pick who they think the “best teams” are. This year, these “experts” didn’t think Penn State was one of the best teams. But who did they think was?"}, {"13a9": "Ohio State …"}, {"dd8e": "A team that Penn State beat."}, {"72d3": "A team that plays in the same division and conference that Penn State won."}, {"78f3": "If it sounds like that shouldn’t be possible, it’s because it shouldn’t be. But, for whatever reason, that’s just how college football works."}, {"a49c": "In college football, you don’t get Jimmy V’s NC State. NC State wouldn’t pass the “eye test.” When the Wolfpack upsets a team in the early rounds, the doubters prevail and the “better team” advances. The important lesson we’re supposed to learn from sports is moot. It doesn’t matter how hard you work. All that matters is how people perceive you."}, {"80da": "Make no mistake, that’s why Ohio State is going to the playoffs and Penn State isn’t. It’s because Ohio State is perceived as the better team. If their seasons were reversed, there’s little doubt that Ohio State would still be going."}, {"3ac3": "This is the problem with college football — subjectivity. It’s NOT that there’s too few teams in the playoff. Accordingly, simply switching to an eight team playoff will not solve the problem. At least not if we continue to select teams in the same way."}, {"b33e": "If switching to eight teams doesn’t solve the problem, what needs to be done?"}, {"55f8": "Whatever eliminates as much subjectivity as possible. At the very least, conference champions must be guaranteed a spot. After that, there’s several options."}, {"9efc": "Ideally, each conference champion would go to the playoff. Unfortunately, the FBS is aligned in such a way that makes it unlikely for this idea to gain any traction. Specifically, there’s a significant lack of parity between the power five conferences and the other conferences. Because of this, most people don’t want to see a playoff game between the champion of a power five conference, like Alabama, and the champion of one of the other conferences, like Western Kentucky. To many, it doesn’t seem right that Western Kentucky would go to the playoff over teams in the power five conferences with substantially tougher schedules."}, {"3e8b": "To solve this lack of parity, there are two options. One option is to completely realign the conferences to create more parity. The other option is to reconsider whether teams in non-power five conferences are eligible for the College Football Playoff."}, {"a6c6": "The second option makes the most sense. After all, schools in those conferences do not have even close to the same resources as the schools in the power five conferences. Perhaps, then, they should not be competing for the same prize."}, {"a856": "Also, it’s not like these teams have a legitimate shot at making the playoff under the current subjective system anyway. Even if they go undefeated, they’ll almost certainly be left out. That’s exactly what happened to Western Michigan this year, who the selection committee decided was merely the 10th best team in the country despite not losing a single game."}, {"5b18": "Instead, then, the College Football Playoff would be limited to the power five conferences. For the playoff to have an even number of teams, we would have to send more than just the five conference champions. The least subjective way to even it out would be to send the second place team from each conference as well, making it a 10 team playoff. Even though this idea rewards some non-champions, it still accomplishes the ultimate goal — curbing the subjectivity and unpredictability of the current system."}, {"28e9": "This approach is completely objective. If you want to go to the playoff, you just have to win more games than the other teams in your conference. It’s that simple. No complaining that other teams got lucky. No comparing teams that didn’t even play any common opponents. Just get it done on the field like teams have to do in virtually every other sport."}, {"10f7": "“I don’t like the sound of any of this,” said a lot of you just now, probably."}, {"4192": "A lot of you don’t like the sound of either of these options. You probably can’t explain why, but you just don’t like them. Furthermore, I’m sure the powers that be don’t like these options for a bunch of political and financial reasons I’m not completely aware of."}, {"c70b": "Well, relax. There are other (less effective) ways of fixing the problem without as much drastic change."}, {"9dae": "For example, there could be a six team playoff in which the winners of the power five conferences are all guaranteed a spot. The remaining spot would go to the highest ranked team that is either an independent or in one of the other conferences. Seeding would be based on ranking. Obviously, this doesn’t remove all subjectivity. There would still be an element of subjectivity in seeding and picking the sixth team. But, it certainly minimizes it and that’s the goal. The less subjectivity, the better."}, {"fb0f": "Clay Travis proposed a similar idea involving an eight team playoff. As in my idea, the winners of the power five conferences are guaranteed a spot. But in his version, there are three wild cards. He also has a good idea about eliminating divisions within the conferences. This is also a step in the right direction. If you have a better idea, speak up."}, {"2150": "Rewarding conference champions is important because it determines worthiness by what happens on the field. Instead of just sending the most prestigious programs, it rewards teams based on the fairest metric of all — results. Every team in the conference plays each other and thus every team’s path to the playoff is the same. It doesn’t matter who’s considered the “better team.” All that matters is what team gets the job done when it counts."}, {"0a48": "And that’s what we love about sports — their inherent fairness."}, {"8966": "Al Pacino’s hair-raising halftime speech in “Any Given Sunday” exemplifies this fundamental principle of sports:"}, {"df4d": "“Life’s a game of inches — like football. Because in either game, life or football, the margin for error is so small…One-half a step too late, or to early, and you don’t quite make it. One-half second too slow, too fast, you don’t quite catch it. The inches we need are everywhere around us… On this team we fight for that inch… Because we know, when you add up all those inches, that’s going to make the f***ing difference between winning and losing!”"}, {"c582": "That speech is electric. Just writing that made me want to run through a brick wall."}, {"8b5b": "Of course, in that movie, Pacino was speaking to a professional football team. If the movie was about a college football team (Ohio State, perhaps), there’d be an extra caveat:"}, {"ddab": "“…But if you don’t get those inches, don’t worry about it. The committee will write it off as a fluke.”"}, {"32bb": "Somehow that doesn’t pack quite the same punch."}], "child": "1911_1\t1911_2\t1911_3\t1911_41911_1\t1911_2\t1911_3\t1911_41911_1\t1911_2\t1911_3\t1911_41911_1\t1911_2\t1911_3\t1911_4", "timestamp": "Jan 9", "content": "Stop Asking For An Eight Team College Football Playoff — Ask For One That’s Fair The problem isn’t the number of teams selected, it’s HOW those teams are being selected. So what now? During the summer of 2014, I worked for a news outlet in Alabama where televisions throughout the office were showing the World Cup. During the group stages, the United States played Germany, a crazy game which concluded with an American loss. One of my coworkers, a self-professed “soccer hater,” thought the loss eliminated the U.S. team. “At least we’re done with this soccer nonsense now,” she said. Only, we weren’t done. A tie against Portugal and a win against Ghana gave the Americans enough points to advance to the knockout round. When I explained this to her, she expressed distaste. “You mean to tell me that we lost and still get to move on? That’s so stupid!” Now, keep in mind, I was working for a news outlet in Alabama. The woman was a huge Crimson Tide fan. I couldn’t help but reply, “The subjective system used in college football is OK with you, but THIS is stupid?!” I thought of her last month when the College Football Playoff teams were announced. I wondered if she thought it was “stupid” that two conference champions missed the cut. The omissions of Penn State and Oklahoma felt stupid to me. After all, if you win your conference, shouldn’t that grant you get a ticket to the dance? Conference championships should be the most important factor in determining who qualifies. Why? Because they are not subjective. Objectivity Makes Sports Beautiful The best thing about sports is that they aren’t biased. The outcome isn’t determined by color, class, who you are or where you’re from. All that matters is who scored the most points. This characteristic of sports has allowed for some beautiful moments. Take, for example, the 1983 NCAA Tournament. That year, Jim Valvano’s North Carolina State shocked the nation by winning the tournament. They didn’t just win a fluky game. They won the whole damn thing. Nobody saw it coming. In each round, they were the underdog. Everybody was just waiting for them to lose. But, somehow, at the end of each game, the Wolfpack had more points than the other team. Then, in the final, they were up against a historically good Houston team. A Houston team that included two NBA hall-of-famers — Hakeem Olajuwon and Clyde Drexler. Yeah, that team — “Phi Slamma Jamma.” NC State had NO CHANCE of winning that game. It just wasn’t possible. But Jimmy V believed. As he put it, “Every single day, in every walk of life, ordinary people do extraordinary things!” In the 1983 NCAA Tournament Final, the “ordinary” NC State did something extraordinary. They scored more points than Houston. They won. It’s chilling stuff that teaches an important lesson. That is, if you work hard and believe in yourself, anything’s possible. What makes this possible? Objectivity. In the early rounds, when NC State upset teams, everybody still doubted them. They wrote the games off as a fluke. But, in the NCAA Tournament, an objective measurement determines who advances. That is, if you score more points than the other team, you advance. Even though nobody considered NC State the “better team,” they went on to the next round. In that way, college basketball is like pretty much every other sport. That is, every sport except college football. This year, nobody expected much from Penn State. They weren’t ranked to start the season and nobody thought they had any chance of winning the Big-10. In contrast, Ohio State were favorite to win the Big-10 and were considered a legitimate national title contender. Yet, in October, Penn State shocked the country. They beat Ohio State 24–21. Nobody saw it coming. Everybody wrote it off as a fluke. But, James Franklin believed in his team. And, like Jimmy V’s NC State, Penn State just kept winning. They managed to make it out of the formidable Big Ten East and moved on to the Big Ten Championship game. Penn State entered the championship game an underdog to the always competitive Wisconsin Badgers. Then, at halftime, Penn State trailed by a large margin. The game seemed all but lost. But, the team still believed. Somehow, Penn State was able to overcome a 21-point deficit to win the game 38–31. It was remarkable. “Every single day, in every walk of life, ordinary people do extraordinary things!” — Jim Valvano But, in college football, that’s not the end of the line. To become a national champion, you have to win a four team playoff. And, unlike college basketball, an objective measurement doesn’t determine who goes. Instead, it’s entirely subjective. A group of “experts” pick who they think the “best teams” are. This year, these “experts” didn’t think Penn State was one of the best teams. But who did they think was? Ohio State … A team that Penn State beat. A team that plays in the same division and conference that Penn State won. If it sounds like that shouldn’t be possible, it’s because it shouldn’t be. But, for whatever reason, that’s just how college football works. In college football, you don’t get Jimmy V’s NC State. NC State wouldn’t pass the “eye test.” When the Wolfpack upsets a team in the early rounds, the doubters prevail and the “better team” advances. The important lesson we’re supposed to learn from sports is moot. It doesn’t matter how hard you work. All that matters is how people perceive you. Make no mistake, that’s why Ohio State is going to the playoffs and Penn State isn’t. It’s because Ohio State is perceived as the better team. If their seasons were reversed, there’s little doubt that Ohio State would still be going. This is the problem with college football — subjectivity. It’s NOT that there’s too few teams in the playoff. Accordingly, simply switching to an eight team playoff will not solve the problem. At least not if we continue to select teams in the same way. If switching to eight teams doesn’t solve the problem, what needs to be done? Whatever eliminates as much subjectivity as possible. At the very least, conference champions must be guaranteed a spot. After that, there’s several options. Ideally, each conference champion would go to the playoff. Unfortunately, the FBS is aligned in such a way that makes it unlikely for this idea to gain any traction. Specifically, there’s a significant lack of parity between the power five conferences and the other conferences. Because of this, most people don’t want to see a playoff game between the champion of a power five conference, like Alabama, and the champion of one of the other conferences, like Western Kentucky. To many, it doesn’t seem right that Western Kentucky would go to the playoff over teams in the power five conferences with substantially tougher schedules. To solve this lack of parity, there are two options. One option is to completely realign the conferences to create more parity. The other option is to reconsider whether teams in non-power five conferences are eligible for the College Football Playoff. The second option makes the most sense. After all, schools in those conferences do not have even close to the same resources as the schools in the power five conferences. Perhaps, then, they should not be competing for the same prize. Also, it’s not like these teams have a legitimate shot at making the playoff under the current subjective system anyway. Even if they go undefeated, they’ll almost certainly be left out. That’s exactly what happened to Western Michigan this year, who the selection committee decided was merely the 10th best team in the country despite not losing a single game. Instead, then, the College Football Playoff would be limited to the power five conferences. For the playoff to have an even number of teams, we would have to send more than just the five conference champions. The least subjective way to even it out would be to send the second place team from each conference as well, making it a 10 team playoff. Even though this idea rewards some non-champions, it still accomplishes the ultimate goal — curbing the subjectivity and unpredictability of the current system. This approach is completely objective. If you want to go to the playoff, you just have to win more games than the other teams in your conference. It’s that simple. No complaining that other teams got lucky. No comparing teams that didn’t even play any common opponents. Just get it done on the field like teams have to do in virtually every other sport. “I don’t like the sound of any of this,” said a lot of you just now, probably. A lot of you don’t like the sound of either of these options. You probably can’t explain why, but you just don’t like them. Furthermore, I’m sure the powers that be don’t like these options for a bunch of political and financial reasons I’m not completely aware of. Well, relax. There are other (less effective) ways of fixing the problem without as much drastic change. For example, there could be a six team playoff in which the winners of the power five conferences are all guaranteed a spot. The remaining spot would go to the highest ranked team that is either an independent or in one of the other conferences. Seeding would be based on ranking. Obviously, this doesn’t remove all subjectivity. There would still be an element of subjectivity in seeding and picking the sixth team. But, it certainly minimizes it and that’s the goal. The less subjectivity, the better. Clay Travis proposed a similar idea involving an eight team playoff. As in my idea, the winners of the power five conferences are guaranteed a spot. But in his version, there are three wild cards. He also has a good idea about eliminating divisions within the conferences. This is also a step in the right direction. If you have a better idea, speak up. Rewarding conference champions is important because it determines worthiness by what happens on the field. Instead of just sending the most prestigious programs, it rewards teams based on the fairest metric of all — results. Every team in the conference plays each other and thus every team’s path to the playoff is the same. It doesn’t matter who’s considered the “better team.” All that matters is what team gets the job done when it counts. And that’s what we love about sports — their inherent fairness. Al Pacino’s hair-raising halftime speech in “Any Given Sunday” exemplifies this fundamental principle of sports: “Life’s a game of inches — like football. Because in either game, life or football, the margin for error is so small…One-half a step too late, or to early, and you don’t quite make it. One-half second too slow, too fast, you don’t quite catch it. The inches we need are everywhere around us… On this team we fight for that inch… Because we know, when you add up all those inches, that’s going to make the f***ing difference between winning and losing!” That speech is electric. Just writing that made me want to run through a brick wall. Of course, in that movie, Pacino was speaking to a professional football team. If the movie was about a college football team (Ohio State, perhaps), there’d be an extra caveat: “…But if you don’t get those inches, don’t worry about it. The committee will write it off as a fluke.” Somehow that doesn’t pack quite the same punch. ", "author": "Jacob Green", "parent": ""}