{"name": "1912", "title": "A Sooner Saturday", "sentences": [{"d663": "A Sooner Saturday"}, {"8139": "Big road win? Check. Embarrassing loss for an eternal rival? Check. An opening in the playoff picture? Check."}, {"5ef2": "You’d think the Mountaineer would do well in a snowstorm. He’s rugged and covered in clothing items that used to be fuzzy animals. But in a Morgantown snowstorm, Oklahoma walloped West Virginia, 56–28, doubling up a team hypothetically fighting them for a chance at the Big 12 title."}, {"dbfc": "This was supposed to be the best game of Week 12, a battle between squads in the top 15 of the playoff ranking and a few breaks away from football’s final four. After a 1–2 start to the year, Oklahoma was undefeated in conference play, finally looking as elite as we thought they might be in September. On the other side, Dana Holgorsen had finally fashioned a capable West Virginia defense to go with his Red Bull–infused offenses."}, {"833f": "There were so many Sooner successes: Wideout Dede Westbrook staked his claim as one of the top two sporting Westbrooks in the Oklahoma region, Samaje Perine and Joe Mixon both went over 100 yards rushing by halftime, and Baker Mayfield barely had to throw in the snow."}, {"cf96": "Meanwhile, the Mountaineers made multiple mistakes, playing like their hands were frostbitten and could no longer hold footballs. In the game’s first half, they muffed a punt a few yards from their end zone, fumbled within the Oklahoma 5-yard line twice, and picked up a string of personal fouls. Then they opened the second half by giving up a pick-six to go down 41–7. That they ended up scoring 21 straight points to make the scoreline somewhat respectable is irrelevant: The whooping was real."}, {"0ec1": "It was a great weekend for Oklahoma — but not just because of their dominant road win over a division rival. While they still need some luck to get into the College Football Playoff, they’re as close as they’ve been since the season began."}, {"5d51": "They Did Work Against West Virginia"}, {"0884": "Hoo, boy, did they do work. I just want to make that clear to anybody who only saw the box score, which suggests a sturdy West Virginia performance featuring nearly 600 yards of offense."}, {"f510": "Yeah, the ’Eers moved the ball. Holgorsen always collects his yardage, and Oklahoma’s defense does have issues, as you might have noticed from that one game when they tied the FBS record for most passing yards given up in a single game. West Virginia’s Justin Crawford ran for 331 yards, which I believe is legally referred to as a hectare. But he didn’t score. He ran for 331 yards with no touchdowns, like a hamster having the performance of his life and finding himself still on the same damn wheel."}, {"1093": "Imagine If a Millennial Coached a College Football TeamP.J. Fleck has created something special at Western Michigantheringer.com"}, {"b137": "The Sooners’ offense was effortless — they were 8 yards downfield before anybody bothered to alert West Virginia that plays had started — and the defense forced turnovers and prevented points, which is what defenses are ultimately supposed to do."}, {"c448": "They Laughed at Their Biggest Rival"}, {"68eb": "Texas hit Rock Chalk rock bottom with a loss to Kansas. “Texas lost to Kansas!” is a fun phrase to type, and I’m going to get as much mileage out of it as I can, since Texas hadn’t lost to Kansas in almost 80 years, and since Kansas might not win another game for 80 more."}, {"1e37": "The Jayhawks entered the day 1–9 with a win over Rhode Island, an FCS team that finished at the bottom of its conference and lost to James Madison 84–7. They hadn’t won a Big 12 game since 2014, when they beat Iowa State under interim coach Clint Bowen. They hadn’t beaten Texas since 1938, towards the start of the Dana X. Bible regime in Austin. The Jayhawks had racked up a string of L’s plentiful enough to supply Lollapalooza through the end of this decade. Even when blue moons shone and Kansas peeked into football relevance, they couldn’t topple Texas."}, {"6a5f": "One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com"}, {"2fdb": "Then on Saturday, Kansas stormed back from a 21–10 deficit in the fourth quarter to win in overtime. Texas gave the ball over and over again to D’Onta Foreman, who had 51 carries for 250 yards. But the Longhorns turned the ball over six times, and that gave Kansas enough room to pull out a win. (Yes, the Longhorns gave one of the best running backs in football 51 carries and lost.)"}, {"207d": "I like Charlie Strong, so I’d love to point out examples of previous Texas coaches losing similar games and surviving. But I can’t: Texas hasn’t really lost a game this embarrassing under any circumstances. Some fans have itched for Strong to be fired since shortly after he got hired, and this just about seals it."}, {"c066": "This had to be fun for Oklahoma fans: Texas lost to Kansas."}, {"4564": "Hypothetically, this is bad for every team besides Texas. The loss will end an unloved era in Texas football and lead the program to the best coach money can buy, most likely Houston’s Tom Herman. Everybody else should be scared about a coach that good going to a team with pockets that deep."}, {"fced": "Except … that was going to happen eventually anyway. Saturday’s comical loss just ensured it. So for Texas’ opponents, the key was to maximize laughter while the Longhorns were down, extending a once-proud program’s pratfall down as many flights of stairs as possible. This was the best result, a Texas-sized failure against college football’s purest punchline. Thank you, Jayhawks, for making this happen. In return, we will root for your basketballs to go into the basketball hoops you love so much."}, {"41ae": "Texas lost to Kansas. Third time typing it, it’s still good."}, {"34c3": "They Had Some Dominoes Fall Their Way"}, {"381b": "On Thursday night, Houston lit up no. 5 Louisville, winning 36–10. This helped out Oklahoma in two ways. First of all, it essentially eliminated one of the few remaining contenders for a playoff spot, as Louisville won’t win their conference and now has two losses."}, {"012b": "Louisville’s loss also made one of Oklahoma’s two losses, a season-opener to Houston, look a lot better. Conference defeats to Navy and SMU had Houston looking lackluster after climbing to no. 6 in the polls. This win gave Herman’s grill some of its shine back, and makes Oklahoma’s loss seem more reasonable."}, {"d1c0": "With losses to Houston and Ohio State in its first three games, we assumed Oklahoma’s playoff hopes were dashed. In two years, the committee had yet to select a team with two losses, and the Sooners had nine games remaining to rack up a third."}, {"dd4c": "They haven’t yet. The Bedlam rivalry game in two weeks against Oklahoma State has become a de facto conference championship game. If the Sooners win, they finish Big 12 play 9–0. If Oklahoma State wins, both teams will be 8–1, and the Cowboys will have the tiebreaker."}, {"16dd": "If Oklahoma wins that game, they’re in good shape. They’ll be the One True Champion the Big 12 hoped for when it ran those doomed ads several years ago. And we know the selection committee values conference championships over just about everything as a tiebreaker; it’s a guideline the committee has actually followed in practice."}, {"a6db": "The Weekly College Football Playoff Rankings Have Never Told Us MuchWant to know who makes the final four? Look to last year — not this weektheringer.com"}, {"f77d": "Of course, the Sooners will still need other results to go their way. They’ll want somebody besides Washington to win the Pac-12, and they’ll want the Big Ten’s champion to have at least two losses. And even then, they’ll have to hope the committee deems their résumé more impressive than plenty of other two-loss teams."}, {"f0eb": "Yet for a team that had supposedly eliminated itself by the start of October, Oklahoma is in pretty good shape. With a win in two weeks, they can extinguish the hopes of an in-state rival and seal an undefeated conference season. Plus, they’ve been able to laugh at Texas along the way. Things could be much worse."}], "child": "1912_1\t1912_2\t1912_3\t1912_4\t1912_5", "timestamp": "Nov 19, 2016", "content": "A Sooner Saturday Big road win? Check. Embarrassing loss for an eternal rival? Check. An opening in the playoff picture? Check. You’d think the Mountaineer would do well in a snowstorm. He’s rugged and covered in clothing items that used to be fuzzy animals. But in a Morgantown snowstorm, Oklahoma walloped West Virginia, 56–28, doubling up a team hypothetically fighting them for a chance at the Big 12 title. This was supposed to be the best game of Week 12, a battle between squads in the top 15 of the playoff ranking and a few breaks away from football’s final four. After a 1–2 start to the year, Oklahoma was undefeated in conference play, finally looking as elite as we thought they might be in September. On the other side, Dana Holgorsen had finally fashioned a capable West Virginia defense to go with his Red Bull–infused offenses. There were so many Sooner successes: Wideout Dede Westbrook staked his claim as one of the top two sporting Westbrooks in the Oklahoma region, Samaje Perine and Joe Mixon both went over 100 yards rushing by halftime, and Baker Mayfield barely had to throw in the snow. Meanwhile, the Mountaineers made multiple mistakes, playing like their hands were frostbitten and could no longer hold footballs. In the game’s first half, they muffed a punt a few yards from their end zone, fumbled within the Oklahoma 5-yard line twice, and picked up a string of personal fouls. Then they opened the second half by giving up a pick-six to go down 41–7. That they ended up scoring 21 straight points to make the scoreline somewhat respectable is irrelevant: The whooping was real. It was a great weekend for Oklahoma — but not just because of their dominant road win over a division rival. While they still need some luck to get into the College Football Playoff, they’re as close as they’ve been since the season began. They Did Work Against West Virginia Hoo, boy, did they do work. I just want to make that clear to anybody who only saw the box score, which suggests a sturdy West Virginia performance featuring nearly 600 yards of offense. Yeah, the ’Eers moved the ball. Holgorsen always collects his yardage, and Oklahoma’s defense does have issues, as you might have noticed from that one game when they tied the FBS record for most passing yards given up in a single game. West Virginia’s Justin Crawford ran for 331 yards, which I believe is legally referred to as a hectare. But he didn’t score. He ran for 331 yards with no touchdowns, like a hamster having the performance of his life and finding himself still on the same damn wheel. Imagine If a Millennial Coached a College Football TeamP.J. Fleck has created something special at Western Michigantheringer.com The Sooners’ offense was effortless — they were 8 yards downfield before anybody bothered to alert West Virginia that plays had started — and the defense forced turnovers and prevented points, which is what defenses are ultimately supposed to do. They Laughed at Their Biggest Rival Texas hit Rock Chalk rock bottom with a loss to Kansas. “Texas lost to Kansas!” is a fun phrase to type, and I’m going to get as much mileage out of it as I can, since Texas hadn’t lost to Kansas in almost 80 years, and since Kansas might not win another game for 80 more. The Jayhawks entered the day 1–9 with a win over Rhode Island, an FCS team that finished at the bottom of its conference and lost to James Madison 84–7. They hadn’t won a Big 12 game since 2014, when they beat Iowa State under interim coach Clint Bowen. They hadn’t beaten Texas since 1938, towards the start of the Dana X. Bible regime in Austin. The Jayhawks had racked up a string of L’s plentiful enough to supply Lollapalooza through the end of this decade. Even when blue moons shone and Kansas peeked into football relevance, they couldn’t topple Texas. One of College Football’s Sleeping Giants Has AwokenHow a defensive revival triggered Colorado’s resurgencetheringer.com Then on Saturday, Kansas stormed back from a 21–10 deficit in the fourth quarter to win in overtime. Texas gave the ball over and over again to D’Onta Foreman, who had 51 carries for 250 yards. But the Longhorns turned the ball over six times, and that gave Kansas enough room to pull out a win. (Yes, the Longhorns gave one of the best running backs in football 51 carries and lost.) I like Charlie Strong, so I’d love to point out examples of previous Texas coaches losing similar games and surviving. But I can’t: Texas hasn’t really lost a game this embarrassing under any circumstances. Some fans have itched for Strong to be fired since shortly after he got hired, and this just about seals it. This had to be fun for Oklahoma fans: Texas lost to Kansas. Hypothetically, this is bad for every team besides Texas. The loss will end an unloved era in Texas football and lead the program to the best coach money can buy, most likely Houston’s Tom Herman. Everybody else should be scared about a coach that good going to a team with pockets that deep. Except … that was going to happen eventually anyway. Saturday’s comical loss just ensured it. So for Texas’ opponents, the key was to maximize laughter while the Longhorns were down, extending a once-proud program’s pratfall down as many flights of stairs as possible. This was the best result, a Texas-sized failure against college football’s purest punchline. Thank you, Jayhawks, for making this happen. In return, we will root for your basketballs to go into the basketball hoops you love so much. Texas lost to Kansas. Third time typing it, it’s still good. They Had Some Dominoes Fall Their Way On Thursday night, Houston lit up no. 5 Louisville, winning 36–10. This helped out Oklahoma in two ways. First of all, it essentially eliminated one of the few remaining contenders for a playoff spot, as Louisville won’t win their conference and now has two losses. Louisville’s loss also made one of Oklahoma’s two losses, a season-opener to Houston, look a lot better. Conference defeats to Navy and SMU had Houston looking lackluster after climbing to no. 6 in the polls. This win gave Herman’s grill some of its shine back, and makes Oklahoma’s loss seem more reasonable. With losses to Houston and Ohio State in its first three games, we assumed Oklahoma’s playoff hopes were dashed. In two years, the committee had yet to select a team with two losses, and the Sooners had nine games remaining to rack up a third. They haven’t yet. The Bedlam rivalry game in two weeks against Oklahoma State has become a de facto conference championship game. If the Sooners win, they finish Big 12 play 9–0. If Oklahoma State wins, both teams will be 8–1, and the Cowboys will have the tiebreaker. If Oklahoma wins that game, they’re in good shape. They’ll be the One True Champion the Big 12 hoped for when it ran those doomed ads several years ago. And we know the selection committee values conference championships over just about everything as a tiebreaker; it’s a guideline the committee has actually followed in practice. The Weekly College Football Playoff Rankings Have Never Told Us MuchWant to know who makes the final four? Look to last year — not this weektheringer.com Of course, the Sooners will still need other results to go their way. They’ll want somebody besides Washington to win the Pac-12, and they’ll want the Big Ten’s champion to have at least two losses. And even then, they’ll have to hope the committee deems their résumé more impressive than plenty of other two-loss teams. Yet for a team that had supposedly eliminated itself by the start of October, Oklahoma is in pretty good shape. With a win in two weeks, they can extinguish the hopes of an in-state rival and seal an undefeated conference season. Plus, they’ve been able to laugh at Texas along the way. Things could be much worse. ", "author": "Rodger Sherman", "parent": ""}