{"name": "1936", "title": "City of Angels, City of Devils: The 80s L.A. of Cinematographer Robby Müller", "sentences": [{"a5d6": "City of Angels, City of Devils: The 80s L.A. of Cinematographer Robby Müller"}, {"dc81": "How one DP captured and defined the juxtaposition of glamour and grime."}, {"f91c": "Like most major metropolitan areas of the United States, Los Angeles is a juxtaposition of fortune and failure. It’s a city where lifelong dreams are made and crushed every hour of every day, a city that’s home to some of the wealthiest people in our culture, and simultaneously a city that has one of the largest homeless populations in the country. It’s a city of angels and devils alike, the two often co-mingling so even the salvation in Los Angeles seems to come with tinges of sin. On screen, this translates to a landscape that’s both glitzy and grimy, a place of promise and also a spiritual purgatory."}, {"bb70": "These reasons and more are why not only is Los Angeles the capital of the American filmmaking industry, it’s also the setting for so many films. In Los Angeles — more so than in New York City, or Chicago — the potential for immortality is higher than anywhere else, but with that comes an equally great potential for personal destruction; either you eat L.A., or L.A. eats you."}, {"b70a": "For my money, L.A.’s best era at the movies was the late 80s-early 90s. That’s when filmmakers like Michael Mann (Thief), William Friedkin (To Live and Die in L.A.), John Singleton (Boyz n the Hood) and others really played with the off-balance meshing of the city’s two sides. But that’s from a narrative perspective. From a visual perspective, the cinematographer of this era who perhaps best captured the contradictions of Los Angeles was undoubtedly Robby Müller, as proven by this new montage by Philip Brubaker for Fandor."}, {"8b90": "In addition to To Live and Die in L.A., Müller shot three other films set in L.A. during the late 80s: Alex Cox’s Repo Man, Barbet Schroeder’s Barfly, and Wim Wenders’ Paris, Texas. What makes this lineup interesting, as Brubaker deftly points out, is that each of these directors was from a different country and only one, Friedkin, was an American. But despite these multiple and dominantly-international perspectives — Müller himself is Dutch — Müller managed to make Los Angeles into “an archetypal American city of dreams,” as Brubaker puts it, by repeating specific visual patterns and cinematographical techniques over the course of these films."}, {"2756": "The Los Angeles of Müller has a legacy that can be seen both visually and narratively in more recent films like David Lynch’s Mulholland Drive, Paul Thomas Anderson’s Magnolia, Dan Gilroy’s Nightcrawler, and Nicolas Winding Refn’s The Neon Demon — that of a city with the personality of a pusher, a charming surface masking a dark, predatory heart. Chances are most readers are more familiar with these films than Müller’s earlier work, but if true, that’s something you should remedy immediately, and I’m pretty sure that about four minutes after you press play below you’re going to agree."}], "child": "1936_1\t1936_2", "timestamp": "Apr 5", "content": "City of Angels, City of Devils: The 80s L.A. of Cinematographer Robby Müller How one DP captured and defined the juxtaposition of glamour and grime. Like most major metropolitan areas of the United States, Los Angeles is a juxtaposition of fortune and failure. It’s a city where lifelong dreams are made and crushed every hour of every day, a city that’s home to some of the wealthiest people in our culture, and simultaneously a city that has one of the largest homeless populations in the country. It’s a city of angels and devils alike, the two often co-mingling so even the salvation in Los Angeles seems to come with tinges of sin. On screen, this translates to a landscape that’s both glitzy and grimy, a place of promise and also a spiritual purgatory. These reasons and more are why not only is Los Angeles the capital of the American filmmaking industry, it’s also the setting for so many films. In Los Angeles — more so than in New York City, or Chicago — the potential for immortality is higher than anywhere else, but with that comes an equally great potential for personal destruction; either you eat L.A., or L.A. eats you. For my money, L.A.’s best era at the movies was the late 80s-early 90s. That’s when filmmakers like Michael Mann (Thief), William Friedkin (To Live and Die in L.A.), John Singleton (Boyz n the Hood) and others really played with the off-balance meshing of the city’s two sides. But that’s from a narrative perspective. From a visual perspective, the cinematographer of this era who perhaps best captured the contradictions of Los Angeles was undoubtedly Robby Müller, as proven by this new montage by Philip Brubaker for Fandor. In addition to To Live and Die in L.A., Müller shot three other films set in L.A. during the late 80s: Alex Cox’s Repo Man, Barbet Schroeder’s Barfly, and Wim Wenders’ Paris, Texas. What makes this lineup interesting, as Brubaker deftly points out, is that each of these directors was from a different country and only one, Friedkin, was an American. But despite these multiple and dominantly-international perspectives — Müller himself is Dutch — Müller managed to make Los Angeles into “an archetypal American city of dreams,” as Brubaker puts it, by repeating specific visual patterns and cinematographical techniques over the course of these films. The Los Angeles of Müller has a legacy that can be seen both visually and narratively in more recent films like David Lynch’s Mulholland Drive, Paul Thomas Anderson’s Magnolia, Dan Gilroy’s Nightcrawler, and Nicolas Winding Refn’s The Neon Demon — that of a city with the personality of a pusher, a charming surface masking a dark, predatory heart. Chances are most readers are more familiar with these films than Müller’s earlier work, but if true, that’s something you should remedy immediately, and I’m pretty sure that about four minutes after you press play below you’re going to agree. ", "author": "H. Perry Horton", "parent": ""}