{"name": "1938", "title": "The Illusion of ‘Birdman:’ Hidden Edits in Inarritu’s “One-Take” Film", "sentences": [{"6712": "The Illusion of ‘Birdman:’ Hidden Edits in Inarritu’s “One-Take” Film"}, {"692c": "Blink and you miss them."}, {"9a3c": "One of the greatest tricks Alejandro Gonzalez Inarritu has yet to play on audiences is the illusion that Birdman (OR: The Unexpected Virtue of Ignorance) is a single-take film. A cursory watch of the film will convince you that it is an uninterrupted narrative stream in which every actor always hits their mark and every millisecond of timing works out perfectly. In reality, though, while the shoot was built on extended sequences, like Hitchcock’s Rope, another purported single-take film, there are cuts hidden throughout Birdman, places where Inarritu and cinematographer Emmanuel Lubezki trick your eyes into thinking the scenes are seamless when truly they are snippets so masterfully sewn together you can’t tell where one ends and the other begins."}, {"6af8": "Unless you know what you’re looking for, that is, like editor Harrison Edgecombe does; he’s put together the following montage revealing, in his own surreptitious way, the cuts in Birdman. You still have to work to see them, Edgecombe’s is an unnarrated video that relies solely on footage and audio from the film, but I promise you the cuts are there, in every fully-black screen, every seeming push zoom or whip pan, and every opening door."}, {"1598": "It’s a treasure hunt to be sure, one where the valuables are the grace and wit with which Inarritu composes the fragments of his film, and the care he takes to try and convince us that the result is an unfragmented whole."}], "child": "1938_1\t1938_2", "timestamp": "Apr 4", "content": "The Illusion of ‘Birdman:’ Hidden Edits in Inarritu’s “One-Take” Film Blink and you miss them. One of the greatest tricks Alejandro Gonzalez Inarritu has yet to play on audiences is the illusion that Birdman (OR: The Unexpected Virtue of Ignorance) is a single-take film. A cursory watch of the film will convince you that it is an uninterrupted narrative stream in which every actor always hits their mark and every millisecond of timing works out perfectly. In reality, though, while the shoot was built on extended sequences, like Hitchcock’s Rope, another purported single-take film, there are cuts hidden throughout Birdman, places where Inarritu and cinematographer Emmanuel Lubezki trick your eyes into thinking the scenes are seamless when truly they are snippets so masterfully sewn together you can’t tell where one ends and the other begins. Unless you know what you’re looking for, that is, like editor Harrison Edgecombe does; he’s put together the following montage revealing, in his own surreptitious way, the cuts in Birdman. You still have to work to see them, Edgecombe’s is an unnarrated video that relies solely on footage and audio from the film, but I promise you the cuts are there, in every fully-black screen, every seeming push zoom or whip pan, and every opening door. It’s a treasure hunt to be sure, one where the valuables are the grace and wit with which Inarritu composes the fragments of his film, and the care he takes to try and convince us that the result is an unfragmented whole. ", "author": "H. Perry Horton", "parent": ""}