{"name": "1942", "title": "A Film About Understanding: ‘2001’ and Ocular Imagery", "sentences": [{"b6ef": "A Film About Understanding: ‘2001’ and Ocular Imagery"}, {"4f05": "A supercut of every eye image in Kubrick’s masterpiece."}, {"0320": "Stanley Kubrick’s 2001: A Space Odyssey is a film about understanding, both what it means to have that capacity and how that capacity can catapult a species further, both positively and negatively. It is a film about looking at the universe surrounding us with new eyes, eyes that don’t just look but that see, eyes that look through the surface of things into the core where understanding is waiting to be attained."}, {"ea2f": "Narratively, this is a tough concept to get across, which is why plot-wise 2001 can feel lose, lightly-structured or even nonsensical in spots. But visually, Kubrick and his cinematographers Geoffrey Unsworth and John Alcott are enforcing this concept all throughout the film with the repetition of ocular images, that is, images that resemble or recreate eyes."}, {"e6fe": "Obviously there’s the glowing red pupil of Hal 9000, but everything from corridors to spacecraft to solar flares hints at the idea of eyes, seeing, and understanding. To prove the point I’ve gathered into one supercut all the ocular imagery from 2001. Some are more obvious than others, but all lend themselves to helping us understand this film about understanding."}, {"4cc5": "For more OPS videos, visit here."}, {"b8a7": "For more videos written and edited by me, visit here."}], "child": "1942_1", "timestamp": "Mar 24", "content": "A Film About Understanding: ‘2001’ and Ocular Imagery A supercut of every eye image in Kubrick’s masterpiece. Stanley Kubrick’s 2001: A Space Odyssey is a film about understanding, both what it means to have that capacity and how that capacity can catapult a species further, both positively and negatively. It is a film about looking at the universe surrounding us with new eyes, eyes that don’t just look but that see, eyes that look through the surface of things into the core where understanding is waiting to be attained. Narratively, this is a tough concept to get across, which is why plot-wise 2001 can feel lose, lightly-structured or even nonsensical in spots. But visually, Kubrick and his cinematographers Geoffrey Unsworth and John Alcott are enforcing this concept all throughout the film with the repetition of ocular images, that is, images that resemble or recreate eyes. Obviously there’s the glowing red pupil of Hal 9000, but everything from corridors to spacecraft to solar flares hints at the idea of eyes, seeing, and understanding. To prove the point I’ve gathered into one supercut all the ocular imagery from 2001. Some are more obvious than others, but all lend themselves to helping us understand this film about understanding. For more OPS videos, visit here. For more videos written and edited by me, visit here. ", "author": "H. Perry Horton", "parent": ""}