{"name": "1975", "title": "The 31 Best Products that Launched in March", "sentences": [{"67db": "The 31 Best Products that Launched in March"}, {"6258": "This past month alone, hundreds of new products launched on Product Hunt. It’s always fun to look back on the most-loved launches each day of the month; the variety is always intriguing and exciting. This list covers it all—from tiny startups that are meeting the world for the first time, to product launches from much bigger companies like YouTube and Medium."}, {"b4c0": "Below, you’ll find the top voted product every day throughout the month of March. Whether you’re looking for a simple solution to build your brand, or want to learn more about Elon Musk’s latest company, you’ll find it all here."}, {"efd6": "March 1: YouTube TV"}, {"8352": "YouTube takes on the cable TV providers."}, {"8928": "YouTube is officially competing with the major cable companies on the market. Their offering, YouTube TV, enables users to stream AMC, NBC, CBS, FOX, and more. You get six different accounts per household for a flat rate of $35/month. It hasn’t launched yet, but you can sign up to get notified when it does launch wherever you live."}, {"462c": "March 2: Emblem"}, {"a6ba": "Build your own beautiful brand."}, {"c06b": "Build your own unique brand identity in minutes with Emblem. The company has distilled branding down to four ingredients: logo, color palette, typography, and pattern/texture. With a subscription, you’ll get access to a logo, monogram, color palette details, pattern download, vector assets, custom website CSS, and typeface names. This complete brand package solution is seriously impressive."}, {"2865": "March 3: Tiny Cards by Duolingo"}, {"1834": "Learn languages with this flash card app, now on the web."}, {"b453": "Tiny Cards by Duolingo is the future of flashcards. It uses spaced repition and other smart learning techniques to help you learn new stuff. You can choose from thousands of topics—like constellations, country capitals, languages, world history, and more. Follow the topics and teachers you’re interested in, and start learning something new right away."}, {"8a39": "March 4: Everypixel"}, {"3414": "Use AI to find images that suit to your project."}, {"7651": "Everypixel is a smart image search tool for creatives that are looking for great photos for their projects—but want to find ones at a reasonable price. It essentially works like Google Images, but searches across licensable photos only. In other words, no more grabbing photos from the internet that you can’t use in the first place. There’s also a reverse image search, which allows you to upload any image to find similar photos."}, {"d142": "March 5: Uber without Internet"}, {"3ec0": "Order an Uber even when you don’t have internet service."}, {"fd81": "It’s such a pain when you’re trying to order an Uber, but you don’t have internet access. Now you can do it with Uber without Internet, which allows you to order a ride via SMS even when you don’t have access to the internet. This is particularly useful if you’re a frequent international traveler or work/live in an area where internet access is spotty."}, {"7e98": "March 6: Startup School"}, {"cd03": "A course on how to start a startup, by Y Combinator."}, {"f472": "The beloved Startup School course, by Y Combinator, is back. They built this course to educate and identify great founders on a more scalable way. You can participate in Startup School as an accepted student, which means you will be assigned an advisor. If you aren’t formally accepted, you can still participate as a visitor and view all lectures and discussions."}, {"d076": "March 7: Visual Biographies"}, {"5f70": "Timelines of amazing lives for visual learners."}, {"df4a": "This incredible collection of Visual Biographies will help you grasp the success timeline of amazing leaders, such as: Jeff Bezos, Elon Musk, Hillary Clinton, Einstein, and Steve Jobs. The creators of these biographies, Adioma, also have tools to help you build your own professional infographics."}, {"3eae": "March 8: Kite Compositor"}, {"c2a4": "A UI animation and prototyping application for Mac & iOS."}, {"9880": "Kite Compositor is a powerful animation and prototyping application for Mac and iOS. You can use it to build designs that bring your ideas to life, which is particularly useful when you’re first dreaming up ideas in the early stages of a startup. Features include: path editing, an adaptive interface, import from Sketch, and real-time rendering. There are tutorials, as well, to guide you through the tool when you’re first starting to use it."}, {"4b62": "March 9: Google Invisible reCAPTCHA"}, {"5fee": "Protect your website from spam and abuse."}, {"9269": "You know those “I am not a robot” checkboxes and “Which photos have an image of X” challenges? They prevent bots from spamming sites, but they aren’t always fun for us non-bot humans. Luckily, now there’s Google Invisible reCAPTCHA, which means sites that use it will still get the same level of advanced security, but humans won’t have to check boxes or solve challenges anymore. Win-win!"}, {"1f97": "March 10: Hangouts Chat by Google"}, {"cdab": "Bring your team together."}, {"94a9": "Google has officially killed Gchat (aka Google Talk), and they are replacing it with Hangouts Chat by Google, which has basically been up and running for four years and does the same thing. The interface changes slightly, with this integration serving the enterprise user a bit more. In other words: Gchat will still be around, but it’s about to feel a little bit more like Slack."}, {"b1c5": "March 11: Waffle Grid"}, {"cf00": "An easy to use flexbox grid system."}, {"5a6e": "The Waffle Grid is a lightweight system for developers that will help them make layouts fully responsive. It was also written entirely in saas so anyone can easily customize or change the grid to suit their needs."}, {"ba8d": "March 12: Buoy Health"}, {"db4a": "A chatbot that helps diagnose your symptoms."}, {"905e": "Buoy Health is an artificial intelligence tool that is meant to replicate a conversation you’d be able to have with your doctor using real data from almost 20,000 clinical papers covering 5 million patients. Instead of using a service like WebMD to try and self-diagnose your own condition (hey, we’ve all been there), Buoy will pick 1 of 30,000 possible questions to ask you based on which one (statistically speaking) will most reduce the uncertainty of your condition. It then delivers 1–3 possible diagnoses, and gives you guidance on the best next steps."}, {"4093": "March 13: Glitch"}, {"eb50": "The community where you’ll build the app of your dreams."}, {"de76": "Anybody can build a web app on Glitch for free. This community provides working example apps that you can remix for your own personal needs. The built-in editor allows you to edit code all at once and edit as you go—kind of like working in Google Docs. Getting a fun new app on the web is no longer a complicated mess, thanks to tools like Glitch."}, {"170d": "March 14: Tetra"}, {"7044": "Automatic note taker for phone calls."}, {"ba78": "If you’ve ever finished a call and realized you didn’t take great notes, it can sometimes feel like the meeting was a waste. Tetra does the heavy lifting for you by dialing into your calls and taking notes automatically so you can concentrate on the conversation. Once the call is over and Tetra is done transcribing, you can export your notes to various apps like Evernote, Dropbox, Google Docs, and Slack."}, {"3793": "March 15: Nimuno Loops — The Toy Block Tape"}, {"e025": "LEGO everywhere with LEGO adhesive tape."}, {"39e8": "Ummm, just when we thought the concept of LEGOs couldn’t get any more fun, we now have Nimuno Loops — The Toy Block Tape. Now you can build on any surface, around corners, and on the sides of just about any object. This is such a clever take on building blocks—it’s no wonder over 39,000 people have backed it on Indiegogo."}, {"32e8": "March 16: Mixmax Calendar"}, {"4733": "The fastest way to schedule meetings with anyone, anywhere."}, {"94c6": "Use Mixmax Calendar to quickly book meetings and automate communication to avoid that endless back-and-forth that happens when you’re trying to find a common meeting time. All you have to do is set up your availability, share your link, and allow guests to pick an available time that works for them."}, {"7e25": "March 17: Typeform Chat"}, {"92bd": "Convert your typeforms into Facebook Messenger conversations."}, {"8174": "Typeform Chat is a brilliant way to collect data using typeforms in messaging apps, like Facebook Messenger. The idea: you’re more likely to collect useful data if you ask customers for feedback in a medium where it’s safe, easy, and comfortable for them to have a conversation. This allows you to provide more of a human interaction than the typical survey experience."}, {"e173": "March 18: Owy"}, {"a585": "Keep track of the things people owe you."}, {"47e8": "Owy is an app that helps you keep track of what people owe you—from books you lend out to cash your friends borrow. Quickly add an item, and you’ll receive an automatic reminder in a week to make sure you don’t forget about it. By the way, the creator of this app, Kasper Dolk, is 16 years old. 😮"}, {"b8a1": "March 19: Animista"}, {"2057": "Create beautiful CSS animations in your browser."}, {"baa9": "Check out Animista for a collection of pre-made CSS animations. You can test and tweak them before you decide which ones you want to use. There are a number of fun features to play around with, including backgrounds that change color, text that moves, and objects that rotate, swirl, and flip. Designers in particular will find this tool incredibly useful."}, {"dab7": "March 20: Noun Project for Mac"}, {"9da5": "Search nearly a million icons, now in color."}, {"937d": "Noun Project for Mac gives you access to almost a million icons. Seriously. You don’t even need to download any of them; just drag and drop icons directly into your favorite apps. You can also change the color of a set of icons easily so you get just what you need. The free starter icons include 100 of the most searched icons, which you can use royalty-free. Whenever you want to unlock the full collection, just upgrade to NounPro."}, {"d2da": "March 21: Clips by Apple"}, {"b421": "A new iOS app for making and sharing fun social videos 📸."}, {"4ec1": "Clips by Apple allows you to make and share social videos. If you prefer to create videos with the default camera (versus a social app like Instagram or Snapchat), Clips is the perfect integration. Start by recording on the spot or grabbing a video or photo from your library. Then, create animated captions, select from different filters, and apply overlays like music or speech bubbles. It’ll be interesting to see how this app fits into the current video landscape."}, {"9629": "March 22: Medium Membership"}, {"8d49": "Pay $5/month for an ad-free experience with premium content."}, {"455d": "Medium just launched Medium Membership, which is an ad-free, open platform for writers and thinkers around the world. You pay a small membership fee and get exclusive stories and first access to Medium’s new features, including offline reading. It’s notoriously difficult to get people to pay for online content these days, so it could be a game-changer if Medium’s new business model takes off."}, {"7067": "March 23: Remotive Jobs"}, {"509d": "A curated selection of remote startup jobs."}, {"c800": "Remotive Jobs is a curated list of remote startup jobs. If you want to be able to do a job you love from anywhere in the world, this is a great place to start the search. Use this site to look for qualified sales, marketing, product, support, HR, engineering, and education opportunities."}, {"807a": "March 24: Ring4"}, {"fa12": "Smart phone numbers on demand in 🇺🇸 🇨🇦 🇬🇧 🇧🇪 🇳🇱 🇦🇹."}, {"8765": "If you need an extra phone line, but aren’t crazy about carrying around another phone or paying for an extra carrier plan, check out Ring4. Use it to get smartphone numbers that you can use on your preexisting phone. You can use it to create a separate business number, use a temporary number for dating or classified ads, or use numbers from other countries without needing a local SIM card—perfect for international travel."}, {"e4b3": "March 25: Loopy"}, {"131e": "A tool for thinking in systems."}, {"3560": "Loopy is an interactive simulation tool that helps you understand complex technological, political, sociological, psychological, and economic systems. Here’s an example of what a model would look like about the impact of automation on job loss:"}, {"360d": "Use Loopy to make sense of complex systems—and help others around you do the same. You can use it for anything, from embedding the simulation in a blog, to making it part of a live lecture or speech, to using it for ideation and collaboration in an office or classroom."}, {"4153": "March 26: Unsplash Bulk Downloader"}, {"c04a": "Download a batch of stock images from Unsplash at once."}, {"15ad": "The Unsplash Bulk Downloader is a simple command line tool that allows you to download multiple images from the beautiful Unsplash site in batches. All you have to do is clone the repo, install the modules with npm, and run node index. No more downloading a single image at a time!"}, {"8add": "March 27: Neuralink"}, {"7105": "Elon Musk’s newest company, merging our brain with AI."}, {"7833": "Well, this should be interesting. Elon Musk just launched another company, and it’s already receiving (unsurprisingly) a lot of attention. Neuralink is still in its nascent stages; if you go to their website, all you’ll see is an email address if you’re interested in a job at the company. But, here’s what we expect Neuralink to create eventually: devices that can be implanted in the human brain to improve the speed of human “outputs” and merge them with software so they keep pace with advancements in artificial intelligence. If we didn’t know it already, we know it now: Musk is taking over the world."}, {"16cb": "March 28: Kite"}, {"1cf5": "The smart copilot for programmers, now available for Python."}, {"2225": "Programmers today are constantly pulled away from their editors to search for help on the web (e.g. to look for sample code or the right arguments to a function). Of course, the context switching reduces productivity. With Kite, programmers can now save time. This tool sits inside your editor, learns what you’re trying to do, and feeds you the information you’re looking for at the right time. Coding just got smarter!"}, {"4bc4": "March 29: Google Open Source"}, {"8b34": "All of Google’s open source projects under a single umbrella."}, {"e890": "Google has released millions of lines of code under open source licenses for other developers to use. You can find over 2,000 released projects at Google Open Source, ranging from TouchTime (which allows you to tell the time through vibration patterns on an Android smartwatch) to DeepMind Lab, a customizable 3D platform for agent-based AI research."}, {"02bb": "March 30: adJelly Size Guide 2.0"}, {"75b1": "The ultimate social and digital ad size guide."}, {"3546": "The adJelly size guide is a free tool created to help designers, marketers, and entrepreneurs build high-quality digital ads. Use it to determine the perfect sizing specifications of anything from a YouTube display ad to an Instagram carousel ad. You can also download PSD and Sketch files that make it even easier for you to create any ad you want with the right specs."}, {"f4f8": "March 31: The Parking Book"}, {"2009": "A book about the real story of Product Hunt."}, {"7925": "The most-loved product that launched on the last day of March 2017 was The Parking Book, by Product Hunt. In the words of Founder Ryan Hoover: “You deserve to know the truth about the early days. We wrote a book about the true story of Product Hunt, the details of which are being revealed for the first time ever. It’s told in a short, coffee table book style format, through a series of images, and explores how parking garages around the world inspired what Product Hunt is today.”"}, {"ba85": "The book was an April Fools’ joke, but it actually became an Amazon Best Seller. So now we’re actually going to write it. Get The Parking Book on Amazon. 😬"}, {"b1ff": "You can check out the full collection of top product launches in March 2017 here on Product Hunt:"}], "child": "1975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_61975_1\t1975_2\t1975_3\t1975_4\t1975_5\t1975_6", "timestamp": "Apr 5", "content": "The 31 Best Products that Launched in March This past month alone, hundreds of new products launched on Product Hunt. It’s always fun to look back on the most-loved launches each day of the month; the variety is always intriguing and exciting. This list covers it all—from tiny startups that are meeting the world for the first time, to product launches from much bigger companies like YouTube and Medium. Below, you’ll find the top voted product every day throughout the month of March. Whether you’re looking for a simple solution to build your brand, or want to learn more about Elon Musk’s latest company, you’ll find it all here. March 1: YouTube TV YouTube takes on the cable TV providers. YouTube is officially competing with the major cable companies on the market. Their offering, YouTube TV, enables users to stream AMC, NBC, CBS, FOX, and more. You get six different accounts per household for a flat rate of $35/month. It hasn’t launched yet, but you can sign up to get notified when it does launch wherever you live. March 2: Emblem Build your own beautiful brand. Build your own unique brand identity in minutes with Emblem. The company has distilled branding down to four ingredients: logo, color palette, typography, and pattern/texture. With a subscription, you’ll get access to a logo, monogram, color palette details, pattern download, vector assets, custom website CSS, and typeface names. This complete brand package solution is seriously impressive. March 3: Tiny Cards by Duolingo Learn languages with this flash card app, now on the web. Tiny Cards by Duolingo is the future of flashcards. It uses spaced repition and other smart learning techniques to help you learn new stuff. You can choose from thousands of topics—like constellations, country capitals, languages, world history, and more. Follow the topics and teachers you’re interested in, and start learning something new right away. March 4: Everypixel Use AI to find images that suit to your project. Everypixel is a smart image search tool for creatives that are looking for great photos for their projects—but want to find ones at a reasonable price. It essentially works like Google Images, but searches across licensable photos only. In other words, no more grabbing photos from the internet that you can’t use in the first place. There’s also a reverse image search, which allows you to upload any image to find similar photos. March 5: Uber without Internet Order an Uber even when you don’t have internet service. It’s such a pain when you’re trying to order an Uber, but you don’t have internet access. Now you can do it with Uber without Internet, which allows you to order a ride via SMS even when you don’t have access to the internet. This is particularly useful if you’re a frequent international traveler or work/live in an area where internet access is spotty. March 6: Startup School A course on how to start a startup, by Y Combinator. The beloved Startup School course, by Y Combinator, is back. They built this course to educate and identify great founders on a more scalable way. You can participate in Startup School as an accepted student, which means you will be assigned an advisor. If you aren’t formally accepted, you can still participate as a visitor and view all lectures and discussions. March 7: Visual Biographies Timelines of amazing lives for visual learners. This incredible collection of Visual Biographies will help you grasp the success timeline of amazing leaders, such as: Jeff Bezos, Elon Musk, Hillary Clinton, Einstein, and Steve Jobs. The creators of these biographies, Adioma, also have tools to help you build your own professional infographics. March 8: Kite Compositor A UI animation and prototyping application for Mac & iOS. Kite Compositor is a powerful animation and prototyping application for Mac and iOS. You can use it to build designs that bring your ideas to life, which is particularly useful when you’re first dreaming up ideas in the early stages of a startup. Features include: path editing, an adaptive interface, import from Sketch, and real-time rendering. There are tutorials, as well, to guide you through the tool when you’re first starting to use it. March 9: Google Invisible reCAPTCHA Protect your website from spam and abuse. You know those “I am not a robot” checkboxes and “Which photos have an image of X” challenges? They prevent bots from spamming sites, but they aren’t always fun for us non-bot humans. Luckily, now there’s Google Invisible reCAPTCHA, which means sites that use it will still get the same level of advanced security, but humans won’t have to check boxes or solve challenges anymore. Win-win! March 10: Hangouts Chat by Google Bring your team together. Google has officially killed Gchat (aka Google Talk), and they are replacing it with Hangouts Chat by Google, which has basically been up and running for four years and does the same thing. The interface changes slightly, with this integration serving the enterprise user a bit more. In other words: Gchat will still be around, but it’s about to feel a little bit more like Slack. March 11: Waffle Grid An easy to use flexbox grid system. The Waffle Grid is a lightweight system for developers that will help them make layouts fully responsive. It was also written entirely in saas so anyone can easily customize or change the grid to suit their needs. March 12: Buoy Health A chatbot that helps diagnose your symptoms. Buoy Health is an artificial intelligence tool that is meant to replicate a conversation you’d be able to have with your doctor using real data from almost 20,000 clinical papers covering 5 million patients. Instead of using a service like WebMD to try and self-diagnose your own condition (hey, we’ve all been there), Buoy will pick 1 of 30,000 possible questions to ask you based on which one (statistically speaking) will most reduce the uncertainty of your condition. It then delivers 1–3 possible diagnoses, and gives you guidance on the best next steps. March 13: Glitch The community where you’ll build the app of your dreams. Anybody can build a web app on Glitch for free. This community provides working example apps that you can remix for your own personal needs. The built-in editor allows you to edit code all at once and edit as you go—kind of like working in Google Docs. Getting a fun new app on the web is no longer a complicated mess, thanks to tools like Glitch. March 14: Tetra Automatic note taker for phone calls. If you’ve ever finished a call and realized you didn’t take great notes, it can sometimes feel like the meeting was a waste. Tetra does the heavy lifting for you by dialing into your calls and taking notes automatically so you can concentrate on the conversation. Once the call is over and Tetra is done transcribing, you can export your notes to various apps like Evernote, Dropbox, Google Docs, and Slack. March 15: Nimuno Loops — The Toy Block Tape LEGO everywhere with LEGO adhesive tape. Ummm, just when we thought the concept of LEGOs couldn’t get any more fun, we now have Nimuno Loops — The Toy Block Tape. Now you can build on any surface, around corners, and on the sides of just about any object. This is such a clever take on building blocks—it’s no wonder over 39,000 people have backed it on Indiegogo. March 16: Mixmax Calendar The fastest way to schedule meetings with anyone, anywhere. Use Mixmax Calendar to quickly book meetings and automate communication to avoid that endless back-and-forth that happens when you’re trying to find a common meeting time. All you have to do is set up your availability, share your link, and allow guests to pick an available time that works for them. March 17: Typeform Chat Convert your typeforms into Facebook Messenger conversations. Typeform Chat is a brilliant way to collect data using typeforms in messaging apps, like Facebook Messenger. The idea: you’re more likely to collect useful data if you ask customers for feedback in a medium where it’s safe, easy, and comfortable for them to have a conversation. This allows you to provide more of a human interaction than the typical survey experience. March 18: Owy Keep track of the things people owe you. Owy is an app that helps you keep track of what people owe you—from books you lend out to cash your friends borrow. Quickly add an item, and you’ll receive an automatic reminder in a week to make sure you don’t forget about it. By the way, the creator of this app, Kasper Dolk, is 16 years old. 😮 March 19: Animista Create beautiful CSS animations in your browser. Check out Animista for a collection of pre-made CSS animations. You can test and tweak them before you decide which ones you want to use. There are a number of fun features to play around with, including backgrounds that change color, text that moves, and objects that rotate, swirl, and flip. Designers in particular will find this tool incredibly useful. March 20: Noun Project for Mac Search nearly a million icons, now in color. Noun Project for Mac gives you access to almost a million icons. Seriously. You don’t even need to download any of them; just drag and drop icons directly into your favorite apps. You can also change the color of a set of icons easily so you get just what you need. The free starter icons include 100 of the most searched icons, which you can use royalty-free. Whenever you want to unlock the full collection, just upgrade to NounPro. March 21: Clips by Apple A new iOS app for making and sharing fun social videos 📸. Clips by Apple allows you to make and share social videos. If you prefer to create videos with the default camera (versus a social app like Instagram or Snapchat), Clips is the perfect integration. Start by recording on the spot or grabbing a video or photo from your library. Then, create animated captions, select from different filters, and apply overlays like music or speech bubbles. It’ll be interesting to see how this app fits into the current video landscape. March 22: Medium Membership Pay $5/month for an ad-free experience with premium content. Medium just launched Medium Membership, which is an ad-free, open platform for writers and thinkers around the world. You pay a small membership fee and get exclusive stories and first access to Medium’s new features, including offline reading. It’s notoriously difficult to get people to pay for online content these days, so it could be a game-changer if Medium’s new business model takes off. March 23: Remotive Jobs A curated selection of remote startup jobs. Remotive Jobs is a curated list of remote startup jobs. If you want to be able to do a job you love from anywhere in the world, this is a great place to start the search. Use this site to look for qualified sales, marketing, product, support, HR, engineering, and education opportunities. March 24: Ring4 Smart phone numbers on demand in 🇺🇸 🇨🇦 🇬🇧 🇧🇪 🇳🇱 🇦🇹. If you need an extra phone line, but aren’t crazy about carrying around another phone or paying for an extra carrier plan, check out Ring4. Use it to get smartphone numbers that you can use on your preexisting phone. You can use it to create a separate business number, use a temporary number for dating or classified ads, or use numbers from other countries without needing a local SIM card—perfect for international travel. March 25: Loopy A tool for thinking in systems. Loopy is an interactive simulation tool that helps you understand complex technological, political, sociological, psychological, and economic systems. Here’s an example of what a model would look like about the impact of automation on job loss: Use Loopy to make sense of complex systems—and help others around you do the same. You can use it for anything, from embedding the simulation in a blog, to making it part of a live lecture or speech, to using it for ideation and collaboration in an office or classroom. March 26: Unsplash Bulk Downloader Download a batch of stock images from Unsplash at once. The Unsplash Bulk Downloader is a simple command line tool that allows you to download multiple images from the beautiful Unsplash site in batches. All you have to do is clone the repo, install the modules with npm, and run node index. No more downloading a single image at a time! March 27: Neuralink Elon Musk’s newest company, merging our brain with AI. Well, this should be interesting. Elon Musk just launched another company, and it’s already receiving (unsurprisingly) a lot of attention. Neuralink is still in its nascent stages; if you go to their website, all you’ll see is an email address if you’re interested in a job at the company. But, here’s what we expect Neuralink to create eventually: devices that can be implanted in the human brain to improve the speed of human “outputs” and merge them with software so they keep pace with advancements in artificial intelligence. If we didn’t know it already, we know it now: Musk is taking over the world. March 28: Kite The smart copilot for programmers, now available for Python. Programmers today are constantly pulled away from their editors to search for help on the web (e.g. to look for sample code or the right arguments to a function). Of course, the context switching reduces productivity. With Kite, programmers can now save time. This tool sits inside your editor, learns what you’re trying to do, and feeds you the information you’re looking for at the right time. Coding just got smarter! March 29: Google Open Source All of Google’s open source projects under a single umbrella. Google has released millions of lines of code under open source licenses for other developers to use. You can find over 2,000 released projects at Google Open Source, ranging from TouchTime (which allows you to tell the time through vibration patterns on an Android smartwatch) to DeepMind Lab, a customizable 3D platform for agent-based AI research. March 30: adJelly Size Guide 2.0 The ultimate social and digital ad size guide. The adJelly size guide is a free tool created to help designers, marketers, and entrepreneurs build high-quality digital ads. Use it to determine the perfect sizing specifications of anything from a YouTube display ad to an Instagram carousel ad. You can also download PSD and Sketch files that make it even easier for you to create any ad you want with the right specs. March 31: The Parking Book A book about the real story of Product Hunt. The most-loved product that launched on the last day of March 2017 was The Parking Book, by Product Hunt. In the words of Founder Ryan Hoover: “You deserve to know the truth about the early days. We wrote a book about the true story of Product Hunt, the details of which are being revealed for the first time ever. It’s told in a short, coffee table book style format, through a series of images, and explores how parking garages around the world inspired what Product Hunt is today.” The book was an April Fools’ joke, but it actually became an Amazon Best Seller. So now we’re actually going to write it. Get The Parking Book on Amazon. 😬 You can check out the full collection of top product launches in March 2017 here on Product Hunt: ", "author": "Product Hunt", "parent": ""}