{"name": "1984", "title": "roly-polies freak me out.", "sentences": [{"9895": "roly-polies freak me out."}, {"6a9a": "source"}, {"24bb": "I tell my friends that I’ve discovered a couple of new molesErupted overnight, and that I’m terrified."}, {"135b": "I don’t tell them that I’m scarily aloneThat the scary part is how OK with it I am.I don’t tell them how much I crave the solitude,How the thought of “catching up” freaks me outBecause I never know what to say in these instances,When we’re out and devouring beers and I’m like3 pints in while they’re still halfway on their first."}, {"56ec": "See, I’m a writer, not a talker.So I don’t know the adequate reply for when they’reTelling me that their sister’s son is premature,That their rent is overdue or that they think their S.O is cheating.I can write a pretty hallmark card, even paintSome somber cartoon, but never voice out the truth.It might involve my truth."}, {"16b5": "My thoughts are loud enough that I runFrom real conversations because I am hardly genuine"}, {"585e": "And more than a couple beers in, you’ll see meFor the fraud I may or may not be and deduceThe character that I’m currently imitating.So I tell them that I just moved into my first house,Instead of a cramped apartment and suddenly there areWaaaay too many shelves and my books lay cluttered on my rugAnd my bins are lined with empty wine bottles andWhen did we get so adult?"}, {"82de": "I’ve learnt that if I talk enoughI never actually have to say anything."}], "child": "1984_1\t1984_2", "timestamp": "Apr 16", "content": "roly-polies freak me out. source I tell my friends that I’ve discovered a couple of new molesErupted overnight, and that I’m terrified. I don’t tell them that I’m scarily aloneThat the scary part is how OK with it I am.I don’t tell them how much I crave the solitude,How the thought of “catching up” freaks me outBecause I never know what to say in these instances,When we’re out and devouring beers and I’m like3 pints in while they’re still halfway on their first. See, I’m a writer, not a talker.So I don’t know the adequate reply for when they’reTelling me that their sister’s son is premature,That their rent is overdue or that they think their S.O is cheating.I can write a pretty hallmark card, even paintSome somber cartoon, but never voice out the truth.It might involve my truth. My thoughts are loud enough that I runFrom real conversations because I am hardly genuine And more than a couple beers in, you’ll see meFor the fraud I may or may not be and deduceThe character that I’m currently imitating.So I tell them that I just moved into my first house,Instead of a cramped apartment and suddenly there areWaaaay too many shelves and my books lay cluttered on my rugAnd my bins are lined with empty wine bottles andWhen did we get so adult? I’ve learnt that if I talk enoughI never actually have to say anything. ", "author": "C. Duhnne", "parent": ""}