{"name": "1993", "title": "Villanova Didn’t Have Enough Magic for an Encore", "sentences": [{"cb41": "Villanova Didn’t Have Enough Magic for an Encore"}, {"c0ab": "The Wildcats don’t look much different from last year, but couldn’t recreate their tourney run"}, {"7dfc": "The last play of the 2016 Villanova season and the last play of the 2017 Villanova season had one thing in common: A defender decided not to stick with Kris Jenkins as he settled behind the arc."}, {"5019": "Last year, that was a pretty big mistake. It was instantly followed by the thud of confetti cannons, a play that’s been replayed a few million times — and will be replayed a few million more over the decades to come. Sure, Villanova beat Patrick Ewing in the 1980s, but the shot by Jenkins is certainly the greatest moment in the history of the tiny basketball-crazed school from Philly."}, {"160c": "This year, that situation ended horribly for Villanova, thanks to an excellent decision by Wisconsin’s Vitto Brown. He had to choose between staying with Jenkins, the highlight hero and Villanova’s most prolific 3-point shooter, or switching onto Josh Hart, the possible national player of the year and a preposterously good finisher at the hoop. He chose Hart, yoinking the ball from the senior guard before he could even attempt a game-tying layup."}, {"addb": "After Brown hit a free throw with three seconds left, the Wildcats had a 70-foot desperation heave, but it didn’t come close; the Badgers held on for a 65–62 victory, knocking out the top overall seed in this year’s tournament — the biggest upset of the NCAA tournament so far."}, {"7610": "It’s the third time in four years that Villanova has lost in the second round of the tournament, but of course, that one national championship mixed in changes everything. It eases the pain; we know this Villanova team has already hit the highest heights. It also enhances the shock. We know what we’re missing."}, {"520e": "When Villanova won the Big East championship, Hart noticed something. The celebration wasn’t quite as enthusiastic as he expected."}, {"f247": "“I think last time we ran on, we stormed the court, everyone’s jumping around, doing all that,” Hart told me after this year’s game. He could barely take the moment to enjoy. “We’ve got to keep getting better.”"}, {"cf97": "Coach Jay Wright felt it, too. “I feel like we were like everybody else here, because we weren’t defending champions, you know?” Wright said. “There’s definitely a hangover from last year, which, however you define it, put pressure on us through this season.”"}, {"4fe3": "Both highlighted something that had changed about this program. Before last year, Villanova’s calling card was a string of disappointments under Wright. This year, they were the overall no. 1 seed, the favorite."}, {"704a": "It would be nice to point to some concrete thing that shows why this team was less perfect than last year’s. But for as long as Hart has been on the team, the Wildcats have been remarkably consistent. In his four years, they’ve never lost more than four regular season games or fewer than two, and they’ve alternated between being a 1-seed and a 2-seed."}, {"6b6f": "Last year, though, Villanova turned into magic. They shot exactly 50 percent on 112 3s in the NCAA tournament, hitting 10 in four of their six wins. They eviscerated Oklahoma in the biggest blowout in Final Four history — just a few months after getting blown out by Oklahoma in Hawaii. They weren’t even a great 3-point shooting team during the regular season — they were 105th in the nation in 3-point field goal percentage and second in 2-point field goal percentage. But they exploded at the perfect time."}, {"7b63": "That team lost in the Big East tournament to a Seton Hall team that ended up getting trounced in the first round of the NCAA tournament. And while Hart was great, this year he was arguably the best player in college basketball. Nobody thought last year’s team deserved to be the top seed in the NCAA Tournament, and nobody really argued that year’s team didn’t deserve to be the no. 1 overall seed."}, {"5cb3": "But being the top seed earned them an extremely tough draw, including a second-round matchup against a Wisconsin team that definitely didn’t deserve to be an 8-seed. Nova went 5-for-16 from three in the loss, just one better than their season low of the year. In the regular season, they never played a game with fewer than seven assists; Saturday they had just five. This echoes 2015, when they had a season-low seven assists in their upset NCAA tournament loss to North Carolina State. Both losses were by just three points, but the stunning drop-off in assists indicates the offense just wasn’t operating the way it had in the previous 30-odd games."}, {"c914": "This is the beauty and stupidity of March. Villanova has been roughly as good in the years they’ve flopped as in the year that they won it all."}, {"cc55": "Think of those two plays at the end of two games. Both ended with Villanova’s best shooter open in space, a chance at success for one of basketball’s best teams. One made history, and the other is a failure to be forgotten."}], "child": "1993_1", "timestamp": "Mar 18", "content": "Villanova Didn’t Have Enough Magic for an Encore The Wildcats don’t look much different from last year, but couldn’t recreate their tourney run The last play of the 2016 Villanova season and the last play of the 2017 Villanova season had one thing in common: A defender decided not to stick with Kris Jenkins as he settled behind the arc. Last year, that was a pretty big mistake. It was instantly followed by the thud of confetti cannons, a play that’s been replayed a few million times — and will be replayed a few million more over the decades to come. Sure, Villanova beat Patrick Ewing in the 1980s, but the shot by Jenkins is certainly the greatest moment in the history of the tiny basketball-crazed school from Philly. This year, that situation ended horribly for Villanova, thanks to an excellent decision by Wisconsin’s Vitto Brown. He had to choose between staying with Jenkins, the highlight hero and Villanova’s most prolific 3-point shooter, or switching onto Josh Hart, the possible national player of the year and a preposterously good finisher at the hoop. He chose Hart, yoinking the ball from the senior guard before he could even attempt a game-tying layup. After Brown hit a free throw with three seconds left, the Wildcats had a 70-foot desperation heave, but it didn’t come close; the Badgers held on for a 65–62 victory, knocking out the top overall seed in this year’s tournament — the biggest upset of the NCAA tournament so far. It’s the third time in four years that Villanova has lost in the second round of the tournament, but of course, that one national championship mixed in changes everything. It eases the pain; we know this Villanova team has already hit the highest heights. It also enhances the shock. We know what we’re missing. When Villanova won the Big East championship, Hart noticed something. The celebration wasn’t quite as enthusiastic as he expected. “I think last time we ran on, we stormed the court, everyone’s jumping around, doing all that,” Hart told me after this year’s game. He could barely take the moment to enjoy. “We’ve got to keep getting better.” Coach Jay Wright felt it, too. “I feel like we were like everybody else here, because we weren’t defending champions, you know?” Wright said. “There’s definitely a hangover from last year, which, however you define it, put pressure on us through this season.” Both highlighted something that had changed about this program. Before last year, Villanova’s calling card was a string of disappointments under Wright. This year, they were the overall no. 1 seed, the favorite. It would be nice to point to some concrete thing that shows why this team was less perfect than last year’s. But for as long as Hart has been on the team, the Wildcats have been remarkably consistent. In his four years, they’ve never lost more than four regular season games or fewer than two, and they’ve alternated between being a 1-seed and a 2-seed. Last year, though, Villanova turned into magic. They shot exactly 50 percent on 112 3s in the NCAA tournament, hitting 10 in four of their six wins. They eviscerated Oklahoma in the biggest blowout in Final Four history — just a few months after getting blown out by Oklahoma in Hawaii. They weren’t even a great 3-point shooting team during the regular season — they were 105th in the nation in 3-point field goal percentage and second in 2-point field goal percentage. But they exploded at the perfect time. That team lost in the Big East tournament to a Seton Hall team that ended up getting trounced in the first round of the NCAA tournament. And while Hart was great, this year he was arguably the best player in college basketball. Nobody thought last year’s team deserved to be the top seed in the NCAA Tournament, and nobody really argued that year’s team didn’t deserve to be the no. 1 overall seed. But being the top seed earned them an extremely tough draw, including a second-round matchup against a Wisconsin team that definitely didn’t deserve to be an 8-seed. Nova went 5-for-16 from three in the loss, just one better than their season low of the year. In the regular season, they never played a game with fewer than seven assists; Saturday they had just five. This echoes 2015, when they had a season-low seven assists in their upset NCAA tournament loss to North Carolina State. Both losses were by just three points, but the stunning drop-off in assists indicates the offense just wasn’t operating the way it had in the previous 30-odd games. This is the beauty and stupidity of March. Villanova has been roughly as good in the years they’ve flopped as in the year that they won it all. Think of those two plays at the end of two games. Both ended with Villanova’s best shooter open in space, a chance at success for one of basketball’s best teams. One made history, and the other is a failure to be forgotten. ", "author": "Rodger Sherman", "parent": ""}