{"name": "1994", "title": "Florida’s Win Over Wisconsin Gave Us the Three Best Moments of the Tournament", "sentences": [{"8b46": "Florida’s Win Over Wisconsin Gave Us the Three Best Moments of the Tournament"}, {"5578": "Two buzzer-beaters, one stunning block, and the beauty of late-game March Madness improvisation"}, {"e627": "Zak Showalter knew he’d made the shot that saved Wisconsin’s season."}, {"ddc9": "“It felt good right away,” Showalter said. “That’s how it’s supposed to happen, right?”"}, {"3a26": "Yeah, that’s how it’s supposed to happen. Of course the walk-on senior guard is supposed to find nothing but net after hoisting an awkward runner on a broken play against a vicious Florida defense, and of course he’s supposed to turn to NFL superstar Aaron Rodgers afterward and do an imitation of the quarterback’s signature championship-belt celebration. This was normal, expected, planned."}, {"14a7": "“[Rodgers] told me to do [the celebration] before the game,” Showalter said. “So I had to stay true to my word and get him one.”"}, {"0f4c": "But just as he’d known the shot that saved his team’s season was good, Showalter also knew the one that ended his college career was good. Mere minutes after the senior sent the Badgers’ Sweet 16 matchup against Florida to overtime — the first of the 2017 NCAA tournament — Gators junior guard Chris Chiozza sent his team to the Elite Eight with a game-winning buzzer-beater — also the first of this NCAA tournament."}, {"c593": "“From the angle I was at, it looked good off his hands,” Showalter said. “I knew he was behind the line, and I knew he got it off in time.”"}, {"1c99": "On Friday night at Madison Square Garden, no. 4 seed Florida beat no. 8 seed Wisconsin, 84–83, in college basketball’s game of the season. It was a contest that seemed one-sided, until it wasn’t, and then one-sided again, until it dramatically flipped the other way. Florida led by eight points with 1:44 to go in regulation. That was bad news for a Wisconsin group that isn’t known for scoring quickly — of the 351 Division I basketball teams, the Badgers rank 344th in KenPom’s average length of offensive possession. But Wisconsin scored the final eight points of the second half, and that was bad news for the Gators: They had seen a sure win vanish, and Wisconsin raced out to a five-point lead in overtime."}, {"cdf2": "“They had all the momentum in the world,” Gators head coach Mike White said. “We have had games like that where we had a run against us. You guys have seen it. We kind of freak out.”"}, {"fa54": "This was the type of back-and-forth affair that doesn’t make sense in the immediate aftermath, and that still may not make sense years from now. If you plotted a win probability chart, it would probably look something like a map of San Francisco’s Lombard Street. It’s the type of classic that will be remembered for its flashbulb moments — in this case, two buzzer-beaters and one critical block — and the improvisation that made them all possible."}, {"f1c2": "Things didn’t go as planned on Wisconsin’s final play of regulation. Coming out of a timeout, Showalter was supposed to receive a ball screen from Wisconsin senior point guard Bronson Koenig. But Koenig was hobbled, and he couldn’t make the play. So Showalter just ran forward, slightly stumbling, and haphazardly hurled the ball toward the net."}, {"cd6a": "“I had a crease,” Showalter said. “And I took it. Basketball is an opportunistic game.”"}, {"8210": "Florida’s game-winning shot came after Badgers senior forward Nigel Hayes made a pair of free throws with four seconds remaining in overtime. The Gators had no timeouts — “Thank goodness,” White joked after the game — and simply had to go. Chiozza had no guidelines."}, {"7507": "“I just knew I had four seconds and I was trying to get down the court as fast as I could,” Chiozza said. “If somebody was open I was going to pass it. I was really trying to get to the rim, but they did a good job of bumping me and slowing me and that was the only shot I had, so I had to take that one.”"}, {"3019": "There are some things you can plan for. Down four with under a minute left in overtime, Florida fifth-year senior guard Canyon Barry was asked to hit a pair of free throws, which proved easy: He’d long been taught by his father, NBA Hall of Famer Rick Barry, to shoot them underhanded, a stroke that’s often derided but is undeniably effective. But after the shots, something you can’t plan for happened: Barry was tasked with guarding Wisconsin’s Khalil Iverson on the inbounds pass and fouling him if he ever got possession. Only Iverson beat him deep, streaking toward the hoop with the basketball, so White tried to remind Barry of his task — and instantly regretted it."}, {"32fd": "“[Number] 21 has the ball at the top of the key with a head of steam, and I’m screaming FOUL FOUL FOUL,” White said. “And then I’m thinking, “I hope it’s not a flagrant. I hope we wrap him up [and avoid an and-1].”"}, {"547d": "Instead, Barry decided to try to block Iverson’s shot. “It was one of those things where I had nothing to lose,” Barry said. And it worked."}, {"f718": "“Canyon goes up and I’m thinking ‘What are we doing?’” White said. “And then I’m thinking ‘What an incredible play.’”"}, {"b707": "March Madness is at its best when players respond to wildly unpredictable moments with incredible solutions. Showalter, Barry, and Chiozza watched as things fell apart around them. They saw things veer terrifyingly off script with their seasons hanging in the balance. And yet they avoided freakouts. They created composed brilliance amid the frenzied chaos."}, {"7b19": "Plays like those take mere instants. White can’t even remember all the details. Asked about Chiozza’s game winner, he tries to name the players involved, but knows he might be wrong."}, {"5622": "“These guys might not have even been in the damn game,” White said. “My brain’s fried.”"}, {"868a": "In this single-elimination basketball tournament, those instants can last lifetimes. They live in One Shining Moment montages and memories. White knows this — he played on the 1998 Ole Miss team that lost to Valparaiso when Bryce Drew drilled a game winner that’s since been replayed roughly a hundred billion times. (Asked Friday if Chiozza’s shot makes up for that experience, White answered: “Hell yes. With an emphasis on the hell.”) And now so do the players on Wisconsin. In this Sweet 16 matchup, they had what seemed to be another moment for the ages, the buzzer-beating shot by Showalter — the one that was supposed to lead to glory."}, {"4c52": "Then it all went the other way."}, {"8edc": "In the locker room after Florida’s win, I watched twice as reporters asked Showalter about the experience of watching the shot he knew would end his college career. He relived that spontaneous split-second, and seemed to already realize that it will last an eternity."}, {"d4ec": "“The ball was in the air forever,” Showalter said. “Just like they say.”"}], "child": "1994_1\t1994_2", "timestamp": "Mar 25", "content": "Florida’s Win Over Wisconsin Gave Us the Three Best Moments of the Tournament Two buzzer-beaters, one stunning block, and the beauty of late-game March Madness improvisation Zak Showalter knew he’d made the shot that saved Wisconsin’s season. “It felt good right away,” Showalter said. “That’s how it’s supposed to happen, right?” Yeah, that’s how it’s supposed to happen. Of course the walk-on senior guard is supposed to find nothing but net after hoisting an awkward runner on a broken play against a vicious Florida defense, and of course he’s supposed to turn to NFL superstar Aaron Rodgers afterward and do an imitation of the quarterback’s signature championship-belt celebration. This was normal, expected, planned. “[Rodgers] told me to do [the celebration] before the game,” Showalter said. “So I had to stay true to my word and get him one.” But just as he’d known the shot that saved his team’s season was good, Showalter also knew the one that ended his college career was good. Mere minutes after the senior sent the Badgers’ Sweet 16 matchup against Florida to overtime — the first of the 2017 NCAA tournament — Gators junior guard Chris Chiozza sent his team to the Elite Eight with a game-winning buzzer-beater — also the first of this NCAA tournament. “From the angle I was at, it looked good off his hands,” Showalter said. “I knew he was behind the line, and I knew he got it off in time.” On Friday night at Madison Square Garden, no. 4 seed Florida beat no. 8 seed Wisconsin, 84–83, in college basketball’s game of the season. It was a contest that seemed one-sided, until it wasn’t, and then one-sided again, until it dramatically flipped the other way. Florida led by eight points with 1:44 to go in regulation. That was bad news for a Wisconsin group that isn’t known for scoring quickly — of the 351 Division I basketball teams, the Badgers rank 344th in KenPom’s average length of offensive possession. But Wisconsin scored the final eight points of the second half, and that was bad news for the Gators: They had seen a sure win vanish, and Wisconsin raced out to a five-point lead in overtime. “They had all the momentum in the world,” Gators head coach Mike White said. “We have had games like that where we had a run against us. You guys have seen it. We kind of freak out.” This was the type of back-and-forth affair that doesn’t make sense in the immediate aftermath, and that still may not make sense years from now. If you plotted a win probability chart, it would probably look something like a map of San Francisco’s Lombard Street. It’s the type of classic that will be remembered for its flashbulb moments — in this case, two buzzer-beaters and one critical block — and the improvisation that made them all possible. Things didn’t go as planned on Wisconsin’s final play of regulation. Coming out of a timeout, Showalter was supposed to receive a ball screen from Wisconsin senior point guard Bronson Koenig. But Koenig was hobbled, and he couldn’t make the play. So Showalter just ran forward, slightly stumbling, and haphazardly hurled the ball toward the net. “I had a crease,” Showalter said. “And I took it. Basketball is an opportunistic game.” Florida’s game-winning shot came after Badgers senior forward Nigel Hayes made a pair of free throws with four seconds remaining in overtime. The Gators had no timeouts — “Thank goodness,” White joked after the game — and simply had to go. Chiozza had no guidelines. “I just knew I had four seconds and I was trying to get down the court as fast as I could,” Chiozza said. “If somebody was open I was going to pass it. I was really trying to get to the rim, but they did a good job of bumping me and slowing me and that was the only shot I had, so I had to take that one.” There are some things you can plan for. Down four with under a minute left in overtime, Florida fifth-year senior guard Canyon Barry was asked to hit a pair of free throws, which proved easy: He’d long been taught by his father, NBA Hall of Famer Rick Barry, to shoot them underhanded, a stroke that’s often derided but is undeniably effective. But after the shots, something you can’t plan for happened: Barry was tasked with guarding Wisconsin’s Khalil Iverson on the inbounds pass and fouling him if he ever got possession. Only Iverson beat him deep, streaking toward the hoop with the basketball, so White tried to remind Barry of his task — and instantly regretted it. “[Number] 21 has the ball at the top of the key with a head of steam, and I’m screaming FOUL FOUL FOUL,” White said. “And then I’m thinking, “I hope it’s not a flagrant. I hope we wrap him up [and avoid an and-1].” Instead, Barry decided to try to block Iverson’s shot. “It was one of those things where I had nothing to lose,” Barry said. And it worked. “Canyon goes up and I’m thinking ‘What are we doing?’” White said. “And then I’m thinking ‘What an incredible play.’” March Madness is at its best when players respond to wildly unpredictable moments with incredible solutions. Showalter, Barry, and Chiozza watched as things fell apart around them. They saw things veer terrifyingly off script with their seasons hanging in the balance. And yet they avoided freakouts. They created composed brilliance amid the frenzied chaos. Plays like those take mere instants. White can’t even remember all the details. Asked about Chiozza’s game winner, he tries to name the players involved, but knows he might be wrong. “These guys might not have even been in the damn game,” White said. “My brain’s fried.” In this single-elimination basketball tournament, those instants can last lifetimes. They live in One Shining Moment montages and memories. White knows this — he played on the 1998 Ole Miss team that lost to Valparaiso when Bryce Drew drilled a game winner that’s since been replayed roughly a hundred billion times. (Asked Friday if Chiozza’s shot makes up for that experience, White answered: “Hell yes. With an emphasis on the hell.”) And now so do the players on Wisconsin. In this Sweet 16 matchup, they had what seemed to be another moment for the ages, the buzzer-beating shot by Showalter — the one that was supposed to lead to glory. Then it all went the other way. In the locker room after Florida’s win, I watched twice as reporters asked Showalter about the experience of watching the shot he knew would end his college career. He relived that spontaneous split-second, and seemed to already realize that it will last an eternity. “The ball was in the air forever,” Showalter said. “Just like they say.” ", "author": "Rodger Sherman", "parent": ""}