{"name": "1995", "title": "In Praise of Nigel Hayes, March Madness’s Most Delightful Player", "sentences": [{"66b1": "In Praise of Nigel Hayes, March Madness’s Most Delightful Player"}, {"b7e4": "Celebrating Wisconsin’s eccentric, outspoken, and talented power forward in advance of his fourth Sweet 16 appearance"}, {"6583": "Nigel Hayes, he who helped bust the nation’s brackets and sent yours truly to the dang basement of my office pool, is not your typical college basketball player. Now in the midst of his fourth NCAA tournament, Wisconsin’s 6-foot-8, 240-pound power forward has the kind of visibility that only rarely extends beyond the sport’s biggest stars. Which is not to say that Hayes isn’t one: He is averaging 13.8 points and 6.6 rebounds per game and was named third-team All-Big Ten in 2016–17. But his contributions extend well beyond the court."}, {"fe89": "Hayes first broke onto the national radar in 2014, coming off the bench in the Badgers’ run to the Final Four. He started alongside Frank Kaminsky and Sam Dekker on the 2015 squad that toppled then-undefeated Kentucky, and averaged 15.7 points during his standout junior campaign. This season Hayes regressed, putting up lesser numbers than he did in 2015–16, and on Saturday, with 37 seconds left in no. 8 seed Wisconsin’s matchup against no. 1 seed Villanova, he committed an unfortunate foul that temporarily put an upset win in jeopardy."}, {"d526": "But then, well — this is March, etc. — it was Hayes who wrestled victory from the jaws of defeat with a Michael Jordan–esque spin and the closing shot of the game. He finished with 19 points on 8-of-15 shooting, and the Badgers found a way to keep on dancing."}, {"e624": "As the senior barrels toward the fourth (!) and final Sweet 16 matchup of his career (this time against no. 4 seed Florida), let’s take a moment to celebrate the power forward in all his fun, and occasionally weird, glory."}, {"70da": "Hayes is a man of many passions. He watches Naruto. He knows his way around memes. He makes for excellent GIFs:"}, {"ae7b": "He also crashes weddings. OK — so it’s not exactly crashing if you’re invited. But after Hayes made it known that he — equipped with a new blue suit from a local Men’s Wearhouse — was interested in appearing at various weddings, the invitations to nuptials around Madison began rolling in, according to a Sports Illustrated feature from 2015. So he started turning up, posing for pictures and at least once helping bride and groom cut their cake — all while in search of, in his words, “cake and cougars.”"}, {"7dc7": "He started with hashtag #ijustwantcake; now there’s #amore and, after he “[helped] engage” a couple, #I’llprobablyshowupatthewedding. He is a man of his word."}, {"02ac": "He’s also a player who has made ample use of the platform provided by his success. He is the only player competing in the 2017 tournament who is a plaintiff in Jenkins v. NCAA, the lawsuit asserting that the governing body has illegally capped the aid that can be given to student-athletes. Hayes regularly jokes about the NCAA’s stance on amateurism — most recently by suggesting that one of his teammates couldn’t afford new underwear — and makes his case simply enough: “We deserve to be paid,” he told reporters last fall."}, {"162b": "“I don’t know how much money I’ve brought in [to Wisconsin]. But it probably has been millions. I know Final Fours generate a lot of money, and I’ve been to two of those. So I deserve a check. Yeah. Just like all my teammates.”"}, {"0cd9": "Hayes has also been vocal about other injustices. In November, he posted a statement on Twitter discussing the hostility that he and his fellow athletes of color had encountered on campus. “As a student,” he wrote, “I demand change from @UWMadison.” He continued, “[w]e ask that the university not continue to sweep the collective experiences of the students of color under a rug.” To date, the post has received more than 4,000 retweets."}, {"e258": "Hayes has spoken in the past about being baffled by the positive attention he’s attracted in recent years. As his star has risen, so has a sense among strangers, he says, that they know him — even if they’ve never met. This is more than a little understandable: Given everything he’s offered both on and off the court, it’s hard to blame people for thinking that they might want to invite the guy who once challenged a stenographer to spell “cattywampus” to their wedding, too."}, {"abc0": "“Hayes wants to be remembered at Wisconsin,” SI’s Brian Hamilton concluded in his story from 2015. “He wants everyone to think, When Nigel was here, it was a great time.”"}, {"144e": "As Hayes’s college career winds to a close, he’s trying to make that time even greater. Asked on Saturday how he feels approaching his 17th NCAA tournament game, he made clear that he’s hoping to get to no. 20 — which would be the championship. If that happens, he’ll cement his legacy: as one of the most successful players in March Madness history, as one of the most beloved figures in Madison, and maybe, per his request, as the WiscGod."}], "child": "1995_1\t1995_2\t1995_3\t1995_4\t1995_5", "timestamp": "Mar 22", "content": "In Praise of Nigel Hayes, March Madness’s Most Delightful Player Celebrating Wisconsin’s eccentric, outspoken, and talented power forward in advance of his fourth Sweet 16 appearance Nigel Hayes, he who helped bust the nation’s brackets and sent yours truly to the dang basement of my office pool, is not your typical college basketball player. Now in the midst of his fourth NCAA tournament, Wisconsin’s 6-foot-8, 240-pound power forward has the kind of visibility that only rarely extends beyond the sport’s biggest stars. Which is not to say that Hayes isn’t one: He is averaging 13.8 points and 6.6 rebounds per game and was named third-team All-Big Ten in 2016–17. But his contributions extend well beyond the court. Hayes first broke onto the national radar in 2014, coming off the bench in the Badgers’ run to the Final Four. He started alongside Frank Kaminsky and Sam Dekker on the 2015 squad that toppled then-undefeated Kentucky, and averaged 15.7 points during his standout junior campaign. This season Hayes regressed, putting up lesser numbers than he did in 2015–16, and on Saturday, with 37 seconds left in no. 8 seed Wisconsin’s matchup against no. 1 seed Villanova, he committed an unfortunate foul that temporarily put an upset win in jeopardy. But then, well — this is March, etc. — it was Hayes who wrestled victory from the jaws of defeat with a Michael Jordan–esque spin and the closing shot of the game. He finished with 19 points on 8-of-15 shooting, and the Badgers found a way to keep on dancing. As the senior barrels toward the fourth (!) and final Sweet 16 matchup of his career (this time against no. 4 seed Florida), let’s take a moment to celebrate the power forward in all his fun, and occasionally weird, glory. Hayes is a man of many passions. He watches Naruto. He knows his way around memes. He makes for excellent GIFs: He also crashes weddings. OK — so it’s not exactly crashing if you’re invited. But after Hayes made it known that he — equipped with a new blue suit from a local Men’s Wearhouse — was interested in appearing at various weddings, the invitations to nuptials around Madison began rolling in, according to a Sports Illustrated feature from 2015. So he started turning up, posing for pictures and at least once helping bride and groom cut their cake — all while in search of, in his words, “cake and cougars.” He started with hashtag #ijustwantcake; now there’s #amore and, after he “[helped] engage” a couple, #I’llprobablyshowupatthewedding. He is a man of his word. He’s also a player who has made ample use of the platform provided by his success. He is the only player competing in the 2017 tournament who is a plaintiff in Jenkins v. NCAA, the lawsuit asserting that the governing body has illegally capped the aid that can be given to student-athletes. Hayes regularly jokes about the NCAA’s stance on amateurism — most recently by suggesting that one of his teammates couldn’t afford new underwear — and makes his case simply enough: “We deserve to be paid,” he told reporters last fall. “I don’t know how much money I’ve brought in [to Wisconsin]. But it probably has been millions. I know Final Fours generate a lot of money, and I’ve been to two of those. So I deserve a check. Yeah. Just like all my teammates.” Hayes has also been vocal about other injustices. In November, he posted a statement on Twitter discussing the hostility that he and his fellow athletes of color had encountered on campus. “As a student,” he wrote, “I demand change from @UWMadison.” He continued, “[w]e ask that the university not continue to sweep the collective experiences of the students of color under a rug.” To date, the post has received more than 4,000 retweets. Hayes has spoken in the past about being baffled by the positive attention he’s attracted in recent years. As his star has risen, so has a sense among strangers, he says, that they know him — even if they’ve never met. This is more than a little understandable: Given everything he’s offered both on and off the court, it’s hard to blame people for thinking that they might want to invite the guy who once challenged a stenographer to spell “cattywampus” to their wedding, too. “Hayes wants to be remembered at Wisconsin,” SI’s Brian Hamilton concluded in his story from 2015. “He wants everyone to think, When Nigel was here, it was a great time.” As Hayes’s college career winds to a close, he’s trying to make that time even greater. Asked on Saturday how he feels approaching his 17th NCAA tournament game, he made clear that he’s hoping to get to no. 20 — which would be the championship. If that happens, he’ll cement his legacy: as one of the most successful players in March Madness history, as one of the most beloved figures in Madison, and maybe, per his request, as the WiscGod. ", "author": "Claire McNear", "parent": ""}