{"name": "1998", "title": "Oregon Is the Best Team Without a Good Road Win", "sentences": [{"ae36": "Titus’s Top 12 NCAA Power Rankings"}, {"849e": "Oregon Is the Best Team Without a Good Road Win"}, {"8dd6": "The Ducks had UCLA right where they wanted, but couldn’t finish the job. Can they win outside of Eugene come March? Plus, the inimitable Ethan Happ has lifted Wisconsin to another level."}, {"770d": "Thursday night was college basketball at its finest. UCLA-Oregon lived up to the hype, with the Bruins’ 82–79 comeback win providing a handful of highlights. Meanwhile, the ACC and Big Ten — the two conferences that have historically dominated the sport — showcased prestige rivalries, putting on games that served as perfect representations for the current state of each league. In the ACC, Duke beat North Carolina 86–78 in a thrilling game that had athletes flying all over the court for 40 minutes. And in the Big Ten, Wisconsin needed overtime to defeat Nebraska 70–69 in a game that saw the same number of combined fouls (47) as made field goals. No, wait. Wrong rivalry. I meant to say that Purdue beat Indiana 69–64 in a slugfest in which both teams had more turnovers than assists and the outcome was partially decided on a late block/charge call that took the refs a few minutes to sort out. Ultimately, officials called a double foul on Caleb Swanigan and Thomas Bryant (i.e. they called a block and a charge on the same play) with 45 seconds left, resulting in the two best players on the floor simultaneously fouling out in the most bizarre, confusing, and gutless way possible. (Side note: If I told you that Ted Valentine once called a triple foul, would you question it even for a second?) But there was good news: We got to hear Dick Vitale make his 10,000th plea for players to get six fouls instead of five, because fouling out is a huge bummer, you guys. Big Ten basketball!"}, {"725b": "In all seriousness, the biggest takeaway from Thursday night is that Duke is officially back to being back now that Mike Krzyzewski’s back is back, and shame on you if you didn’t see this coming. There are so many levels to the 2016–17 Duke conspiracy that it’s going to take me months to uncover how the Blue Devils pulled everything off. In the meantime, just know that if you took everything at face value — all the injuries, Grayson Allen’s one-game suspension for tripping, Coach K’s back surgery, the chemistry issues, etc. — you’re a sucker and everyone affiliated with Duke’s program is laughing at your expense."}, {"70a4": "On to the power rankings."}, {"ecdd": "Five Takeaways From the Duke-UNC/UCLA-Oregon DoubleheaderIf that didn’t get you excited for March Madness, nothing willtheringer.com"}, {"5c10": "12. Duke (19–5)11. Cincinnati (22–2)10. Virginia (18–5)9. Arizona (22–3)8. Louisville (19–5)"}, {"5f43": "7. Oregon (21–4)"}, {"3599": "It wasn’t quite as bad as the Falcons’ loss in the Super Bowl, but Oregon’s meltdown at UCLA on Thursday night gave me that same uneasy feeling, like I wanted to somehow pause time so I could fly to Pauley Pavilion and tell the Ducks to take a few deep breaths. After beating the Bruins on a Dillon Brooks buzzer-beater in December and absolutely annihilating Arizona on Saturday, Oregon came into this game with a target on its back. The Ducks were in command of the Pac-12 race and had won 19 of their previous 20, with their only loss coming at Colorado in the second game of the infamous altitude trip. (Pac-12 scheduling often requires teams to play at Utah and Colorado within a 48-hour window, a stretch that has tripped up plenty of contenders over the past few years.) But most of Oregon’s wins came on its home court, and its only marquee road game to date — at Baylor on November 15 — had ended in a 66–49 loss. Thursday was a great opportunity for the Ducks to silence the doubters and prove that they belong in the national title conversation."}, {"8c31": "And for the first 13:30 of the game, that’s what Oregon did. The Ducks picked up right where they left off against Arizona, bursting out to a 37–18 lead. UCLA’s historically great offense was visibly frustrated, Lonzo Ball was a borderline liability, and the Ducks got any shot they wanted. All signs pointed to another massacre until Ball was subbed out late in the first half and UCLA went on a 14–0 run to cut the lead to five. But even then, Oregon stopped the bleeding, built a 15-point second-half lead, and seemed to be in control. Only … well … I’ll let Dennis Green explain what happened next."}, {"8af1": "What made Thursday’s performance so frustrating for Oregon wasn’t that it lost, or even that it let a big lead slip away. It’s that the Bruins were exactly who the Ducks thought they were and they let them off the hook. Oregon had a perfect game plan and executed it wonderfully to build a huge lead, and then it inexplicably went away from everything that had been working. The Ducks were having their way with UCLA by being unselfish, exploiting mismatches on every offensive possession, and playing fundamentally sound defense that limited the Bruins’ transition opportunities and forced them into tough shots. Once Oregon thought it had built an insurmountable lead, the execution suddenly stopped, and by the time the Ducks realized the game was slipping away it was too late. I suppose UCLA deserves credit for tightening its defense and being more patient offensively in the second half. But I’ve seen enough from the Bruins this season to know that the circumstances don’t really matter; if UCLA’s defense is blowing up your actions, you’ve got serious problems."}, {"eba1": "Dillon Brooks (Getty Images)"}, {"ef5b": "Losing a close road game to a great team is far from a death blow to Oregon’s season, even if the Ducks now face an uphill battle to repeat as Pac-12 champions. There’s still plenty to love about Oregon, starting with Brooks, who was a preseason All-American and has been playing like it of late, averaging 18.4 points, 4.6 boards, and 3.2 assists over his past five games. The Ducks have a ton of experience, multiple rim protectors, lockdown perimeter defenders, and a roster full of scorers who ooze confidence and can make it rain from anywhere. Outside of some potential depth issues, the Ducks don’t have any obvious weaknesses, which is why it isn’t hard to envision them making a second straight Elite Eight trip."}, {"f792": "Of course, that would require them beating good teams outside of Eugene, which is something Oregon hasn’t done this season. (Its best win away from home came against Tennessee in the Maui Invitational in November.) And given the top-heavy nature of the Pac-12 and the fact the Ducks don’t play at Arizona this season, another opportunity like Thursday’s won’t come until the conference tournament at the earliest. So with the collapse at UCLA serving as a sole road data point over the past three months and with the Duke curse still lingering, I’m not saying you shouldn’t trust the Ducks come March — I’m just saying to proceed with caution."}, {"9e25": "The Ringer’s 2017 NBA Draft Lottery Big Board, Version 4.0Analyzing the biggest holes in Markelle Fultz’s and Lonzo Ball’s games, and taking a look at Josh Jackson’s recent hot…theringer.com"}, {"b22c": "Halftime"}, {"1f98": "It’s halftime, which can mean only one thing: It’s time for Dick’s Degrees of Separation, the most mildly amusing internet game involving college basketball! You know the drill: I give you the endpoint of a Dick Vitale tangent and you pick the path he took to get there. Let’s get to it."}, {"9893": "During last Sunday’s North Carolina–Notre Dame game, how did Dick Vitale end up talking about Mark Gottfried?"}, {"7f6a": "A. A graphic is shown on screen highlighting the chaos that unfolded the day before, when six of the top 10 teams in the AP poll lost. Dave O’Brien, Vitale’s partner for the game, says he thought the biggest shock was Oregon’s 85–58 rout of Arizona. Vitale agrees and offers his thoughts on the game before noting that he believes UCLA is the Pac-12 team best suited for a national championship run. O’Brien says it’s hard to believe that UCLA has won just one national title in the last 40-plus years, in 1995. Dickie V. agrees and reminds viewers that the assistant coaches on that 1994–95 squad were Steve Lavin, Lorenzo Romar, and Mark Gottfried."}, {"51c6": "B. Notre Dame goes to the free throw line early in the game, prompting Vitale to mention that the Fighting Irish no longer lead college basketball in free throw percentage. Vitale explains that distinction now belongs to a different northern Indiana team, Valparaiso, which is shooting 80.9 percent from the stripe. Dickie V. quickly notes that the Irish, who are shooting 80.5 percent on their free throw attempts, are still on pace to break the ACC record, held by the 2003–04 North Carolina State Wolfpack (79.9 percent). Vitale proceeds to say that the current NC State team and its head coach, Mark Gottfried, have had a tough go lately."}, {"8f51": "C. As the broadcast returns from a timeout, the ACC standings are shown on screen. O’Brien explains to viewers the impact this game will have on the hunt for the regular-season conference title. Vitale declares it a must-win for Notre Dame, which was in the thick of the race before it dropped three straight heading into this matchup with Carolina. Dickie V. then pivots and says the Tar Heels are in the driver’s seat, but reminds viewers that UNC has a big test coming up against Duke. Vitale believes the Blue Devils might still be the best team in the ACC. He adds that Duke has been playing well ever since losing to Mark Gottfried and NC State on January 23."}, {"750a": "Meet Marcus Keene, College Basketball’s 5-Foot-9 Leading ScorerKeene is part mid-major phenom, part J.R. Smith, and part magiciantheringer.com"}, {"8782": "6. UCLA (22–3)"}, {"896d": "5. Wisconsin (21–3)"}, {"1baa": "Purdue’s Caleb Swanigan is the best player in the Big Ten, and assuming the people who vote on this stuff don’t have an ax to grind, he should win the conference’s player of the year award by a comfortable margin. I don’t say that to be confrontational. I say it because I hate the notion that liking someone now means that you automatically hate that person’s competitor. Because while I’m as big a fan of Swanigan as any that exists, to the point that I’m reeeeeallllly close to convinced that he’s the best player in America, that doesn’t mean I won’t acknowledge that Wisconsin’s Ethan Happ is the nation’s best defender and one of the 10 best players in college basketball."}, {"39ab": "In 2006–07, I helplessly watched as people all over the Midwest pretended that Alando Tucker was better than Greg Oden, so I get why Wisconsin fans are upset that their dominant big man is getting overshadowed by someone who they feel isn’t as good as his stats would suggest. But trust me on this one, Wisconsin fans: Let it go. Concede the Swanigan-versus-Happ debate and take solace in knowing that all signs point to the Badgers making a deep NCAA tournament run, while Swanigan will probably go something like 1-for-6 from the 3-point line as the Boilermakers get upset in … oh, I don’t know … let’s say the second round by a Mountain West team that hasn’t made the Sweet 16 in 16 years."}, {"aab0": "Ethan Happ (Getty Images)"}, {"ad71": "Part of what makes those who love Happ so eager to sing his praises is there isn’t a player in the country like him. In fact, I can’t think of a college player who has ever been like him. If someone who’d never watched Happ asked me to describe his game, I’d raise my eyebrows and slowly shake my head before offering up something like this: “He’s like a 6-foot-10 point guard, only he isn’t explosive, he never shoots jumpers, he’s got a deadly old-man post-up game, he averages nine boards, and he’s a rim protector on defense. So basically he’s not a point guard at all, except that he leads the Badgers in steals, can orchestrate a fast break, and averages 2.8 assists. Who knows? Maybe you should just watch him and draw your own conclusions. All I can tell you is it makes perfect sense that he plays for Wisconsin.”"}, {"c9ca": "A sophomore blossoming into an All-American-type talent would be a boon for any program, but Happ’s emergence has been especially impactful for a Wisconsin team desperate for a bona fide star. The Badgers entered this season returning all five starters — including four seniors — from 2015–16’s Sweet 16 squad, which was enough to earn them a no. 9 ranking in the preseason AP poll. Their big concern, though, was that none of their players were overwhelmingly talented, leaving many to believe that this team had an obvious ceiling. I figured Wisconsin would use its experience and chemistry to win a decent amount of games and maybe even make a Big Ten title run, but I saw no reason to take it too seriously beyond that. I just couldn’t get behind the idea that Nigel Hayes was good enough to be the best player on a national champion."}, {"c677": "Think back on all the great teams Bo Ryan had at Wisconsin that underperformed come March. (I know head coach Greg Gard isn’t Ryan, but he’s cut from the same cloth, so go with it.) The difference between them and Ryan’s two Final Four squads (2013–14 and 2014–15) was that the latter featured Frank Kaminsky and Sam Dekker, two guys who could be classified as serious and unusual problems for opponents rather than simply great players. It’s a tiny distinction, I know, but I’m convinced it makes a world of difference in the NCAA tournament, especially for a program that traditionally plays a conservative style. The Badgers have produced plenty of great players through the years, but most of them fit a familiar mold. Wisconsin didn’t experience its breakthrough until Kaminsky, a 7-foot mismatch nightmare who could do everything, and Dekker, a 6-foot-9 small forward with NBA-caliber range, came along and gave the team an element it had previously lacked."}, {"9e6b": "You know how coaches do weird things, like use broomsticks in practice to simulate an opponent’s length, when preparing for players who are so special that memorizing their tendencies isn’t enough? That’s what Happ brings to Wisconsin. If he were only as good as he was last year, Wisconsin would be like so many Badgers teams in the past: good enough to beat anyone in America, but not good enough to be remembered. Instead, Happ has emerged as a full-fledged superstar, which explains how Wisconsin has won 17 of its last 18, sits atop the Big Ten standings, and has ascended to the no. 7 spot in the AP poll."}, {"bb4c": "I still think this Wisconsin team is more like the late-2010s Badgers than the 2013–14 and 2014–15 teams, mostly because I’m not sold that this group has the flexibility to adjust to the different styles. Case in point: The Badgers have played three ranked opponents this season (Creighton, North Carolina, and Purdue) that rate among the top third of teams in the KenPom adjusted tempo statistic, and those three games account for all of Wisconsin’s losses, each coming by double digits. Still, you would have to be crazy to count Wisconsin out. Because while the Badgers have a weakness, so will every other team in America when it plays Wisconsin: It won’t have Ethan Happ."}, {"d16e": "Northwestern Basketball Just Wants One DanceThe pain and guarded optimism of rooting for the Wildcats to end their NCAA tournament droughttheringer.com"}, {"dd71": "4. Baylor (21–3)3. Kansas (21–3)2. Villanova (23–2)1. Gonzaga (24–0)"}, {"9dcd": "The Reckless Bus Driver of the Week"}, {"1556": "St. Louis University’s basketball team was temporarily stranded in western New York when its bus went missing following Wednesday’s 70–55 loss at St. Bonaventure. Thanks to the GPS tracking device on head coach Travis Ford’s iPad, the vehicle was discovered 40 miles from the arena, with a driver behind the wheel whose blood-alcohol content registered at 0.22, according to a police statement. The driver was arrested, the bus and team’s property were returned, and the Billikens got a new driver to take them safely to the airport. That seems to be where the story ends, which leaves me with so many questions."}, {"e412": "Was the driver trying to steal the bus or the team’s stuff? That would seem to make sense, but apparently nothing was taken. Did she think that her job was only to drop the team off, and that someone else would get the Billikens after the game? And most puzzlingly, how did she get so drunk so fast? She probably dropped the team off about 90 minutes before tip-off. The game took roughly two hours, meaning she had about three and a half hours to go from stone-cold sober to Stone Cold Steve Austin. So had she already been drinking when she was driving to the arena? Or did she just have one hell of a party during the game? It’s infuriating that I will never get these answers."}, {"ba54": "The Dick’s Degrees of Separation answer is B. See you next week."}], "child": "1998_1\t1998_2\t1998_3\t1998_4\t1998_5\t1998_6\t1998_7", "timestamp": "Feb 10", "content": "Titus’s Top 12 NCAA Power Rankings Oregon Is the Best Team Without a Good Road Win The Ducks had UCLA right where they wanted, but couldn’t finish the job. Can they win outside of Eugene come March? Plus, the inimitable Ethan Happ has lifted Wisconsin to another level. Thursday night was college basketball at its finest. UCLA-Oregon lived up to the hype, with the Bruins’ 82–79 comeback win providing a handful of highlights. Meanwhile, the ACC and Big Ten — the two conferences that have historically dominated the sport — showcased prestige rivalries, putting on games that served as perfect representations for the current state of each league. In the ACC, Duke beat North Carolina 86–78 in a thrilling game that had athletes flying all over the court for 40 minutes. And in the Big Ten, Wisconsin needed overtime to defeat Nebraska 70–69 in a game that saw the same number of combined fouls (47) as made field goals. No, wait. Wrong rivalry. I meant to say that Purdue beat Indiana 69–64 in a slugfest in which both teams had more turnovers than assists and the outcome was partially decided on a late block/charge call that took the refs a few minutes to sort out. Ultimately, officials called a double foul on Caleb Swanigan and Thomas Bryant (i.e. they called a block and a charge on the same play) with 45 seconds left, resulting in the two best players on the floor simultaneously fouling out in the most bizarre, confusing, and gutless way possible. (Side note: If I told you that Ted Valentine once called a triple foul, would you question it even for a second?) But there was good news: We got to hear Dick Vitale make his 10,000th plea for players to get six fouls instead of five, because fouling out is a huge bummer, you guys. Big Ten basketball! In all seriousness, the biggest takeaway from Thursday night is that Duke is officially back to being back now that Mike Krzyzewski’s back is back, and shame on you if you didn’t see this coming. There are so many levels to the 2016–17 Duke conspiracy that it’s going to take me months to uncover how the Blue Devils pulled everything off. In the meantime, just know that if you took everything at face value — all the injuries, Grayson Allen’s one-game suspension for tripping, Coach K’s back surgery, the chemistry issues, etc. — you’re a sucker and everyone affiliated with Duke’s program is laughing at your expense. On to the power rankings. Five Takeaways From the Duke-UNC/UCLA-Oregon DoubleheaderIf that didn’t get you excited for March Madness, nothing willtheringer.com 12. Duke (19–5)11. Cincinnati (22–2)10. Virginia (18–5)9. Arizona (22–3)8. Louisville (19–5) 7. Oregon (21–4) It wasn’t quite as bad as the Falcons’ loss in the Super Bowl, but Oregon’s meltdown at UCLA on Thursday night gave me that same uneasy feeling, like I wanted to somehow pause time so I could fly to Pauley Pavilion and tell the Ducks to take a few deep breaths. After beating the Bruins on a Dillon Brooks buzzer-beater in December and absolutely annihilating Arizona on Saturday, Oregon came into this game with a target on its back. The Ducks were in command of the Pac-12 race and had won 19 of their previous 20, with their only loss coming at Colorado in the second game of the infamous altitude trip. (Pac-12 scheduling often requires teams to play at Utah and Colorado within a 48-hour window, a stretch that has tripped up plenty of contenders over the past few years.) But most of Oregon’s wins came on its home court, and its only marquee road game to date — at Baylor on November 15 — had ended in a 66–49 loss. Thursday was a great opportunity for the Ducks to silence the doubters and prove that they belong in the national title conversation. And for the first 13:30 of the game, that’s what Oregon did. The Ducks picked up right where they left off against Arizona, bursting out to a 37–18 lead. UCLA’s historically great offense was visibly frustrated, Lonzo Ball was a borderline liability, and the Ducks got any shot they wanted. All signs pointed to another massacre until Ball was subbed out late in the first half and UCLA went on a 14–0 run to cut the lead to five. But even then, Oregon stopped the bleeding, built a 15-point second-half lead, and seemed to be in control. Only … well … I’ll let Dennis Green explain what happened next. What made Thursday’s performance so frustrating for Oregon wasn’t that it lost, or even that it let a big lead slip away. It’s that the Bruins were exactly who the Ducks thought they were and they let them off the hook. Oregon had a perfect game plan and executed it wonderfully to build a huge lead, and then it inexplicably went away from everything that had been working. The Ducks were having their way with UCLA by being unselfish, exploiting mismatches on every offensive possession, and playing fundamentally sound defense that limited the Bruins’ transition opportunities and forced them into tough shots. Once Oregon thought it had built an insurmountable lead, the execution suddenly stopped, and by the time the Ducks realized the game was slipping away it was too late. I suppose UCLA deserves credit for tightening its defense and being more patient offensively in the second half. But I’ve seen enough from the Bruins this season to know that the circumstances don’t really matter; if UCLA’s defense is blowing up your actions, you’ve got serious problems. Dillon Brooks (Getty Images) Losing a close road game to a great team is far from a death blow to Oregon’s season, even if the Ducks now face an uphill battle to repeat as Pac-12 champions. There’s still plenty to love about Oregon, starting with Brooks, who was a preseason All-American and has been playing like it of late, averaging 18.4 points, 4.6 boards, and 3.2 assists over his past five games. The Ducks have a ton of experience, multiple rim protectors, lockdown perimeter defenders, and a roster full of scorers who ooze confidence and can make it rain from anywhere. Outside of some potential depth issues, the Ducks don’t have any obvious weaknesses, which is why it isn’t hard to envision them making a second straight Elite Eight trip. Of course, that would require them beating good teams outside of Eugene, which is something Oregon hasn’t done this season. (Its best win away from home came against Tennessee in the Maui Invitational in November.) And given the top-heavy nature of the Pac-12 and the fact the Ducks don’t play at Arizona this season, another opportunity like Thursday’s won’t come until the conference tournament at the earliest. So with the collapse at UCLA serving as a sole road data point over the past three months and with the Duke curse still lingering, I’m not saying you shouldn’t trust the Ducks come March — I’m just saying to proceed with caution. The Ringer’s 2017 NBA Draft Lottery Big Board, Version 4.0Analyzing the biggest holes in Markelle Fultz’s and Lonzo Ball’s games, and taking a look at Josh Jackson’s recent hot…theringer.com Halftime It’s halftime, which can mean only one thing: It’s time for Dick’s Degrees of Separation, the most mildly amusing internet game involving college basketball! You know the drill: I give you the endpoint of a Dick Vitale tangent and you pick the path he took to get there. Let’s get to it. During last Sunday’s North Carolina–Notre Dame game, how did Dick Vitale end up talking about Mark Gottfried? A. A graphic is shown on screen highlighting the chaos that unfolded the day before, when six of the top 10 teams in the AP poll lost. Dave O’Brien, Vitale’s partner for the game, says he thought the biggest shock was Oregon’s 85–58 rout of Arizona. Vitale agrees and offers his thoughts on the game before noting that he believes UCLA is the Pac-12 team best suited for a national championship run. O’Brien says it’s hard to believe that UCLA has won just one national title in the last 40-plus years, in 1995. Dickie V. agrees and reminds viewers that the assistant coaches on that 1994–95 squad were Steve Lavin, Lorenzo Romar, and Mark Gottfried. B. Notre Dame goes to the free throw line early in the game, prompting Vitale to mention that the Fighting Irish no longer lead college basketball in free throw percentage. Vitale explains that distinction now belongs to a different northern Indiana team, Valparaiso, which is shooting 80.9 percent from the stripe. Dickie V. quickly notes that the Irish, who are shooting 80.5 percent on their free throw attempts, are still on pace to break the ACC record, held by the 2003–04 North Carolina State Wolfpack (79.9 percent). Vitale proceeds to say that the current NC State team and its head coach, Mark Gottfried, have had a tough go lately. C. As the broadcast returns from a timeout, the ACC standings are shown on screen. O’Brien explains to viewers the impact this game will have on the hunt for the regular-season conference title. Vitale declares it a must-win for Notre Dame, which was in the thick of the race before it dropped three straight heading into this matchup with Carolina. Dickie V. then pivots and says the Tar Heels are in the driver’s seat, but reminds viewers that UNC has a big test coming up against Duke. Vitale believes the Blue Devils might still be the best team in the ACC. He adds that Duke has been playing well ever since losing to Mark Gottfried and NC State on January 23. Meet Marcus Keene, College Basketball’s 5-Foot-9 Leading ScorerKeene is part mid-major phenom, part J.R. Smith, and part magiciantheringer.com 6. UCLA (22–3) 5. Wisconsin (21–3) Purdue’s Caleb Swanigan is the best player in the Big Ten, and assuming the people who vote on this stuff don’t have an ax to grind, he should win the conference’s player of the year award by a comfortable margin. I don’t say that to be confrontational. I say it because I hate the notion that liking someone now means that you automatically hate that person’s competitor. Because while I’m as big a fan of Swanigan as any that exists, to the point that I’m reeeeeallllly close to convinced that he’s the best player in America, that doesn’t mean I won’t acknowledge that Wisconsin’s Ethan Happ is the nation’s best defender and one of the 10 best players in college basketball. In 2006–07, I helplessly watched as people all over the Midwest pretended that Alando Tucker was better than Greg Oden, so I get why Wisconsin fans are upset that their dominant big man is getting overshadowed by someone who they feel isn’t as good as his stats would suggest. But trust me on this one, Wisconsin fans: Let it go. Concede the Swanigan-versus-Happ debate and take solace in knowing that all signs point to the Badgers making a deep NCAA tournament run, while Swanigan will probably go something like 1-for-6 from the 3-point line as the Boilermakers get upset in … oh, I don’t know … let’s say the second round by a Mountain West team that hasn’t made the Sweet 16 in 16 years. Ethan Happ (Getty Images) Part of what makes those who love Happ so eager to sing his praises is there isn’t a player in the country like him. In fact, I can’t think of a college player who has ever been like him. If someone who’d never watched Happ asked me to describe his game, I’d raise my eyebrows and slowly shake my head before offering up something like this: “He’s like a 6-foot-10 point guard, only he isn’t explosive, he never shoots jumpers, he’s got a deadly old-man post-up game, he averages nine boards, and he’s a rim protector on defense. So basically he’s not a point guard at all, except that he leads the Badgers in steals, can orchestrate a fast break, and averages 2.8 assists. Who knows? Maybe you should just watch him and draw your own conclusions. All I can tell you is it makes perfect sense that he plays for Wisconsin.” A sophomore blossoming into an All-American-type talent would be a boon for any program, but Happ’s emergence has been especially impactful for a Wisconsin team desperate for a bona fide star. The Badgers entered this season returning all five starters — including four seniors — from 2015–16’s Sweet 16 squad, which was enough to earn them a no. 9 ranking in the preseason AP poll. Their big concern, though, was that none of their players were overwhelmingly talented, leaving many to believe that this team had an obvious ceiling. I figured Wisconsin would use its experience and chemistry to win a decent amount of games and maybe even make a Big Ten title run, but I saw no reason to take it too seriously beyond that. I just couldn’t get behind the idea that Nigel Hayes was good enough to be the best player on a national champion. Think back on all the great teams Bo Ryan had at Wisconsin that underperformed come March. (I know head coach Greg Gard isn’t Ryan, but he’s cut from the same cloth, so go with it.) The difference between them and Ryan’s two Final Four squads (2013–14 and 2014–15) was that the latter featured Frank Kaminsky and Sam Dekker, two guys who could be classified as serious and unusual problems for opponents rather than simply great players. It’s a tiny distinction, I know, but I’m convinced it makes a world of difference in the NCAA tournament, especially for a program that traditionally plays a conservative style. The Badgers have produced plenty of great players through the years, but most of them fit a familiar mold. Wisconsin didn’t experience its breakthrough until Kaminsky, a 7-foot mismatch nightmare who could do everything, and Dekker, a 6-foot-9 small forward with NBA-caliber range, came along and gave the team an element it had previously lacked. You know how coaches do weird things, like use broomsticks in practice to simulate an opponent’s length, when preparing for players who are so special that memorizing their tendencies isn’t enough? That’s what Happ brings to Wisconsin. If he were only as good as he was last year, Wisconsin would be like so many Badgers teams in the past: good enough to beat anyone in America, but not good enough to be remembered. Instead, Happ has emerged as a full-fledged superstar, which explains how Wisconsin has won 17 of its last 18, sits atop the Big Ten standings, and has ascended to the no. 7 spot in the AP poll. I still think this Wisconsin team is more like the late-2010s Badgers than the 2013–14 and 2014–15 teams, mostly because I’m not sold that this group has the flexibility to adjust to the different styles. Case in point: The Badgers have played three ranked opponents this season (Creighton, North Carolina, and Purdue) that rate among the top third of teams in the KenPom adjusted tempo statistic, and those three games account for all of Wisconsin’s losses, each coming by double digits. Still, you would have to be crazy to count Wisconsin out. Because while the Badgers have a weakness, so will every other team in America when it plays Wisconsin: It won’t have Ethan Happ. Northwestern Basketball Just Wants One DanceThe pain and guarded optimism of rooting for the Wildcats to end their NCAA tournament droughttheringer.com 4. Baylor (21–3)3. Kansas (21–3)2. Villanova (23–2)1. Gonzaga (24–0) The Reckless Bus Driver of the Week St. Louis University’s basketball team was temporarily stranded in western New York when its bus went missing following Wednesday’s 70–55 loss at St. Bonaventure. Thanks to the GPS tracking device on head coach Travis Ford’s iPad, the vehicle was discovered 40 miles from the arena, with a driver behind the wheel whose blood-alcohol content registered at 0.22, according to a police statement. The driver was arrested, the bus and team’s property were returned, and the Billikens got a new driver to take them safely to the airport. That seems to be where the story ends, which leaves me with so many questions. Was the driver trying to steal the bus or the team’s stuff? That would seem to make sense, but apparently nothing was taken. Did she think that her job was only to drop the team off, and that someone else would get the Billikens after the game? And most puzzlingly, how did she get so drunk so fast? She probably dropped the team off about 90 minutes before tip-off. The game took roughly two hours, meaning she had about three and a half hours to go from stone-cold sober to Stone Cold Steve Austin. So had she already been drinking when she was driving to the arena? Or did she just have one hell of a party during the game? It’s infuriating that I will never get these answers. The Dick’s Degrees of Separation answer is B. See you next week. ", "author": "Mark Titus", "parent": ""}