{"name": "1999", "title": "LSU’s Shocking Stumble Stemmed From an All-Too-Familiar Problem: Bad Quarterback Play", "sentences": [{"2221": "LSU’s Shocking Stumble Stemmed From an All-Too-Familiar Problem: Bad Quarterback Play"}, {"7a28": "Getty Images"}, {"2100": "Numbers are never the whole story. They can’t be, because they can’t capture a missed block, or a wide receiver slipping while trying to extend a play, or a star running back who comes up limping at a key juncture in the game."}, {"777c": "Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com"}, {"96a7": "All of those misfortunes befell LSU on its final drive against Wisconsin on Saturday, as the no. 5 Tigers lost 16–14 at Lambeau Field, remarkably their first nonconference defeat of Les Miles’s tenure. But for LSU, the numbers did tell a painful story. Here are the results of the team’s drives in the first half:"}, {"09b0": "After going scoreless — and not coming particularly close to the end zone — in the first half, the Tigers moved the ball a bit better in the second, but still failed to produce a drive eclipsing 50 yards in the game. Bruising back Leonard Fournette put up a 23-carry, 138-yard outing, but he didn’t score or produce any “Heisman moments.” And quarterback Brandon Harris tossed a touchdown pass to give LSU the lead in the third quarter, but he couldn’t complete a game-winning drive in the final minute, instead heaving a curious ball straight into the welcoming arms of Wisconsin’s D’Cota Dixon."}, {"edf2": "It was an afternoon of “buts” for LSU, with an overarching one hanging over the team. The Tigers have an all-world running back and a game-changing defense, which on Saturday scored LSU’s first touchdown on an interception return and set up the offense for the second after forcing a fumble in Wisconsin territory, but the team still has a question mark at quarterback and can’t move the ball downfield with any regularity. In other words, it’s the same group we’ve been watching for years."}, {"0809": "Take a Breath Before Letting Houston Playoff Hype Dominate the SeasonThe Cougs’ Oklahoma upset deserves a moment of respecttheringer.com"}, {"cc6a": "After an unreliable 2015 campaign, Harris was supposed to develop into a more consistent passer this season. He had swagger and was a more mature leader; he had improved his strength and mechanics and was ready to contribute in a multivaried attack. The Times-Picayune summarized the expectations two weeks ago: Harris was poised for a breakout season, which would propel LSU into playoff contention."}, {"b2b1": "And then he completed three passes for 38 yards and an interception in the first half. He looked no more confident in the pocket than he did last year against Alabama, when he managed a 31.6 percent completion rate and just 128 yards in a 30–16 defeat. His mechanics looked no more consistent than they did against Texas A&M last season, when he completed 33.3 percent of his passes for a meager 83 yards."}, {"96b3": "LSU’s offense sputtered and coughed just as it had when Anthony Jennings ran the huddle, and Jordan Jefferson and Jarrett Lee before that. Miles might be a wizard and Fournette an armored truck molded into human form, but there’s only so much the pair can create when a defense like Wisconsin’s can stack the box with eight or nine defenders."}, {"3e9d": "2016 College Football Preview Special"}, {"a61f": "Fournette found a few lanes in the second half, including on the draw play on the final drive in which he was shaken up by a hit, but the overall performance was an oddly quiet one for Fournette. We’ve become accustomed to a highlight-reel run or three from the preseason Heisman favorite in every game, but the only plays that stood out on Saturday were LSU’s pick-six, Harris’s final interception, and the cheap late hit Tiger lineman Josh Boutte delivered in frustration afterward."}, {"8fc3": "The discussion from this game will — and should — turn to Wisconsin in the coming days and weeks. The Badgers thoroughly outplayed a top-five team and have a chance to raise their stock further with a delicious upcoming stretch at Michigan State and Michigan, and home against Ohio State in consecutive games. It wouldn’t be a surprise to see GameDay return to a Wisconsin game in the next month."}, {"790c": "Everyone’s a Loser After Tennessee’s Insane Last-Minute WinCollege football is back, peopletheringer.com"}, {"9e03": "For a little longer, though, the chatter will linger on LSU, where the program’s 2016 playoff chances and Miles’s job security are fluttering and unpredictable, much like an average Harris pass. Teams can recover from an early nonconference loss to reach the College Football Playoff. But — there’s that word again — the Tigers’ margin for error is gone, and every game will be a struggle if they can’t generate consistent aerial offense. Even Alabama needs to score 40-plus to win at times."}], "child": "1999_1\t1999_2\t1999_3\t1999_4\t1999_5\t1999_6", "timestamp": "Sep 3, 2016", "content": "LSU’s Shocking Stumble Stemmed From an All-Too-Familiar Problem: Bad Quarterback Play Getty Images Numbers are never the whole story. They can’t be, because they can’t capture a missed block, or a wide receiver slipping while trying to extend a play, or a star running back who comes up limping at a key juncture in the game. Embrace the Overreaction to College Football’s Opening WeekYou’re wrong. But feeling right will be glorious while it lasts.theringer.com All of those misfortunes befell LSU on its final drive against Wisconsin on Saturday, as the no. 5 Tigers lost 16–14 at Lambeau Field, remarkably their first nonconference defeat of Les Miles’s tenure. But for LSU, the numbers did tell a painful story. Here are the results of the team’s drives in the first half: After going scoreless — and not coming particularly close to the end zone — in the first half, the Tigers moved the ball a bit better in the second, but still failed to produce a drive eclipsing 50 yards in the game. Bruising back Leonard Fournette put up a 23-carry, 138-yard outing, but he didn’t score or produce any “Heisman moments.” And quarterback Brandon Harris tossed a touchdown pass to give LSU the lead in the third quarter, but he couldn’t complete a game-winning drive in the final minute, instead heaving a curious ball straight into the welcoming arms of Wisconsin’s D’Cota Dixon. It was an afternoon of “buts” for LSU, with an overarching one hanging over the team. The Tigers have an all-world running back and a game-changing defense, which on Saturday scored LSU’s first touchdown on an interception return and set up the offense for the second after forcing a fumble in Wisconsin territory, but the team still has a question mark at quarterback and can’t move the ball downfield with any regularity. In other words, it’s the same group we’ve been watching for years. Take a Breath Before Letting Houston Playoff Hype Dominate the SeasonThe Cougs’ Oklahoma upset deserves a moment of respecttheringer.com After an unreliable 2015 campaign, Harris was supposed to develop into a more consistent passer this season. He had swagger and was a more mature leader; he had improved his strength and mechanics and was ready to contribute in a multivaried attack. The Times-Picayune summarized the expectations two weeks ago: Harris was poised for a breakout season, which would propel LSU into playoff contention. And then he completed three passes for 38 yards and an interception in the first half. He looked no more confident in the pocket than he did last year against Alabama, when he managed a 31.6 percent completion rate and just 128 yards in a 30–16 defeat. His mechanics looked no more consistent than they did against Texas A&M last season, when he completed 33.3 percent of his passes for a meager 83 yards. LSU’s offense sputtered and coughed just as it had when Anthony Jennings ran the huddle, and Jordan Jefferson and Jarrett Lee before that. Miles might be a wizard and Fournette an armored truck molded into human form, but there’s only so much the pair can create when a defense like Wisconsin’s can stack the box with eight or nine defenders. 2016 College Football Preview Special Fournette found a few lanes in the second half, including on the draw play on the final drive in which he was shaken up by a hit, but the overall performance was an oddly quiet one for Fournette. We’ve become accustomed to a highlight-reel run or three from the preseason Heisman favorite in every game, but the only plays that stood out on Saturday were LSU’s pick-six, Harris’s final interception, and the cheap late hit Tiger lineman Josh Boutte delivered in frustration afterward. The discussion from this game will — and should — turn to Wisconsin in the coming days and weeks. The Badgers thoroughly outplayed a top-five team and have a chance to raise their stock further with a delicious upcoming stretch at Michigan State and Michigan, and home against Ohio State in consecutive games. It wouldn’t be a surprise to see GameDay return to a Wisconsin game in the next month. Everyone’s a Loser After Tennessee’s Insane Last-Minute WinCollege football is back, peopletheringer.com For a little longer, though, the chatter will linger on LSU, where the program’s 2016 playoff chances and Miles’s job security are fluttering and unpredictable, much like an average Harris pass. Teams can recover from an early nonconference loss to reach the College Football Playoff. But — there’s that word again — the Tigers’ margin for error is gone, and every game will be a struggle if they can’t generate consistent aerial offense. Even Alabama needs to score 40-plus to win at times. ", "author": "Zach Kram", "parent": ""}