{"sentences": [{"sentence": "Wells Fargo's board said on Monday that it would claw back an additional $75 million in compensation from the two executives on whom it pinned most of the blame for the company's sales scandal: the bank's former chief executive, John G. Stumpf, and its former head of community banking, Carrie L. Tolstedt."}, {"sentence": "In a scathing 113-page report that made it clear that all the warning signs of the problem had been glaring, the board released the results of its six-month investigation into the conditions and culture that prompted thousands of Wells Fargo employees to create fraudulent accounts in an effort to meet aggressive sales goals."}, {"sentence": "The report, compiled by the law firm Shearman & Sterling after interviewing 100 current and former employees and reviewing 35 million documents, said that it was obvious where the problems lay. Structurally, the bank was too decentralized, with department heads like Ms. Tolstedt given the mantra of \"run it like you own it\" and given broad authority to shake off questions from superiors, subordinates or lateral colleagues."}, {"sentence": "So many suspicious things should have added up, the report said: People were not funding, or putting money into, their new accounts at alarming rates. Regional managers were imploring their bosses to drop sales goals, saying they were unrealistic and bad for customers."}, {"sentence": "Particularly in Arizona and Los Angeles, where this toxic culture was most pronounced, managers explicitly told subordinates to sell people accounts even if they did not need them."}, {"sentence": "Because of the bank's decentralized structure, the problem went unnoticed for a long time. When it finally came to light - thanks in part to The Los Angeles Times - the bank was slow to take action. Ms. Tolstedt, who ran the community bank - Wells Fargo's term for the branch network - was told to fix the problem that she had created."}, {"sentence": "Her department saw itself as a \"sales organization, like department or retail stores, rather than a service-oriented financial institution,\" the report said. Further, Ms. Tolstedt was said to have kept hidden the true number of people who were fired for setting up false accounts. Her report to the board in October 2015 \"was widely viewed by directors as having minimized and understated problems at the community bank,\" the report said."}, {"sentence": "Mr. Stumpf - who had a long and warm professional relationship with Ms. Tolstedt and was inclined to trust her and let her manage on her own - was warned as early as 2012 about \"numerous\" customer and employee complaints about the company's sales tactics but ignored growing evidence that the problem was pervasive, the board said in its report."}, {"sentence": "Much of the pressure-cooker climate stemmed from Ms. Tolstedt, according to the report, who led Wells Fargo's community bank for eight years before retiring last year. The report casts her as a powerful and insular leader who focused obsessively on sales targets and turned a blind eye to signs that some managers and employees were cheating to meet them."}, {"sentence": "\"She resisted and rejected the near-unanimous view of senior regional bank leaders that the sales goals were unreasonable and led to negative outcomes and improper behavior,\" according to the report, which was commissioned by a committee of Wells Fargo independent directors."}, {"sentence": "Timothy J. Sloan, who succeeded Mr. Stumpf as chief executive, was largely exonerated by the report, despite the fact that he was also a career Wells Fargo executive. As president and chief operating officer, he became Ms. Tolstedt's immediate supervisor in November 2015. At that point, the report said, he \"assessed her performance over several months before deciding that she should not continue to lead the community bank.\""}, {"sentence": "Mr. Stumpf, who retired in October, exercised all of his remaining options and converted them to stock, which he retained, in the months before Wells Fargo announced its regulatory settlement. He held 2.5 million shares as of late February, currently valued at $137 million."}, {"sentence": "Asked about the timing of Mr. Stumpf's options exercise, Stephen W. Sanger, the board's chairman and leader of its investigation, said in a news conference on Monday morning that it was a routine move that did not raise concern. The $28 million that the board is taking back from Mr. Stumpf - the proceeds of a 2013 equity grant - will be deducted from his retirement plan payouts, Mr. Sanger said."}, {"sentence": "The board's report, which praised the changes the bank had made since the sales scandal erupted into public view, is unlikely to quell the bank's critics. Better Markets, a nonprofit organization that advocates stricter regulation of Wall Street, called the report a compendium of \"too-little, too-late cosmetic actions\" and called on shareholders to oust all of Wells Fargo's board members at the company's annual meeting this month."}, {"sentence": "Two influential advisory firms have also recommended significant changes to the company's board."}, {"sentence": "Six of Wells Fargo's 15 board members, including all of those who served on bank's risk committee, should not be re-elected, according to Glass Lewis, which advises shareholders on governance matters. A rival firm, Institutional Shareholder Services, called for all 12 of the bank's incumbent directors to be removed, citing signs of \"a sustained breakdown of risk oversight on the part of the board.\""}, {"sentence": "The report suggests that Wells Fargo's management knew its goals were unrealistically high but flogged them anyway. \"They were commonly referred to as 50/50 plans, meaning that there was an expectation that only half the regions would be able to meet them,\" the report said."}, {"sentence": "Some Wells Fargo branch employees have described health problems they experienced because of the crushing pressure of the bank's sales culture, and the report offers glimpses of how bad things were. Daily and monthly \"Motivator\" reports were issued, pitting individuals, branches and regions against one another in terms of sales goals; these were discontinued in 2014 after regional executives complained at a \"leadership summit\" meeting that the reports perpetuated a \"culture of shaming and sales pressure.\""}, {"sentence": "Ms. Tolstedt also put in place a system of sales scorecards, which measured people against impossibly high goals. \"Certain managers made meeting scorecard requirements their sole objective, a tactic referred to as ‘managing to the scorecard,'\" the report said."}, {"sentence": "During the period when sham accounts were being pumped out - employees created as many as two million unwanted bank accounts and credit card accounts - Mr. Stumpf used to brag during quarterly earnings calls about Wells Fargo's cross-selling prowess. Whereas most banks could claim perhaps only three accounts per customer, Wells Fargo \"grew our 2012 cross-sell ratio to a record 5.98 products per household,\" Mr. Stumpf said in April 2012."}, {"sentence": "He later boasted of even higher numbers, such as 6.17 in 2014 - as Senator Elizabeth Warren, Democrat of Massachusetts, noted in her questioning of Mr. Stumpf at a Banking Committee hearing in September. Some Wells Fargo employees complained that customers did not need so many accounts."}, {"sentence": "The brass-knuckle tactics were harshest in \"areas where bad practices tended to disproportionately cluster,\" like Los Angeles and Arizona, the report said. There, senior bankers were \"particularly associated with extreme pressure, in some cases calling their subordinates several times a day to check in on sales performance and chastising those who failed to meet sales objectives.\""}, {"sentence": "The sales pressure peaked each January, when the bank imposed higher daily sales targets on its workers as part of a \"Jump into January\" campaign."}, {"sentence": "Bankers \"were encouraged to make prospect lists of friends and family members who were potential Jump into January sales targets\" and would sometimes \"sandbag,\" or temporarily withhold, accounts opened in December in order to meet their January goals."}, {"sentence": "The January sales frenzy was found to produce more turnover, lower-quality accounts and overall employee misery, but the bank was \"hesitant to end the program because Tolstedt was ‘scared to death' that it could hurt sales figures for the entire year,\" the report said. The January program was replaced with one called \"Accelerate\" that ran from January until March and was supposed to focus more on banker-customer relationships, but some employees felt that it was just a \"name change,\" the report said."}, {"sentence": "Mr. Sanger said that the board's report on Monday concluded nearly all of its investigation, and that no further terminations or compensation clawbacks are expected. But other investigations - including criminal inquiries by the Justice Department and several state attorneys general - remain in progress."}, {"sentence": "The board's law firm is still looking into reports that the bank retaliated against some former employees who tried to blow the whistle on its wrongdoing. Last week, a federal regulator, the Occupational Safety and Health Administration of the Labor Department, ordered Wells Fargo to reinstate and pay $5.4 million to a former employee who said he was fired after making internal complaints about wrongdoing that he observed."}, {"sentence": "The agency has also warned Wells Fargo that it is likely to order the bank to rehire another worker who said she was fired in 2011 after trying to gain her supervisors' attention to accounts that she said had been fraudulently created."}, {"sentence": "So far, Shearman & Sterling has found no evidence of retaliation, according to Stuart J. Baskin, a partner at the firm."}, {"sentence": "\"We still have a few loose ends, but we don't think it's likely to change any findings,\" he said."}], "child": "1_1\t1_2\t1_3\t1_4\t1_5\t1_6\t1_7\t1_8\t1_9\t1_10\t1_11\t1_12\t1_13\t1_14\t1_15", "parent": "", "name": "1", "title": "Wells Fargo to Claw Back $75 Million From 2 Former Executives", "content": "Wells Fargo's board said on Monday that it would claw back an additional $75 million in compensation from the two executives on whom it pinned most of the blame for the company's sales scandal: the bank's former chief executive, John G. Stumpf, and its former head of community banking, Carrie L. Tolstedt. In a scathing 113-page report that made it clear that all the warning signs of the problem had been glaring, the board released the results of its six-month investigation into the conditions and culture that prompted thousands of Wells Fargo employees to create fraudulent accounts in an effort to meet aggressive sales goals. The report, compiled by the law firm Shearman & Sterling after interviewing 100 current and former employees and reviewing 35 million documents, said that it was obvious where the problems lay. Structurally, the bank was too decentralized, with department heads like Ms. Tolstedt given the mantra of \"run it like you own it\" and given broad authority to shake off questions from superiors, subordinates or lateral colleagues. So many suspicious things should have added up, the report said: People were not funding, or putting money into, their new accounts at alarming rates. Regional managers were imploring their bosses to drop sales goals, saying they were unrealistic and bad for customers. Particularly in Arizona and Los Angeles, where this toxic culture was most pronounced, managers explicitly told subordinates to sell people accounts even if they did not need them. Because of the bank's decentralized structure, the problem went unnoticed for a long time. When it finally came to light - thanks in part to The Los Angeles Times - the bank was slow to take action. Ms. Tolstedt, who ran the community bank - Wells Fargo's term for the branch network - was told to fix the problem that she had created. Her department saw itself as a \"sales organization, like department or retail stores, rather than a service-oriented financial institution,\" the report said. Further, Ms. Tolstedt was said to have kept hidden the true number of people who were fired for setting up false accounts. Her report to the board in October 2015 \"was widely viewed by directors as having minimized and understated problems at the community bank,\" the report said. Mr. Stumpf - who had a long and warm professional relationship with Ms. Tolstedt and was inclined to trust her and let her manage on her own - was warned as early as 2012 about \"numerous\" customer and employee complaints about the company's sales tactics but ignored growing evidence that the problem was pervasive, the board said in its report. Much of the pressure-cooker climate stemmed from Ms. Tolstedt, according to the report, who led Wells Fargo's community bank for eight years before retiring last year. The report casts her as a powerful and insular leader who focused obsessively on sales targets and turned a blind eye to signs that some managers and employees were cheating to meet them. \"She resisted and rejected the near-unanimous view of senior regional bank leaders that the sales goals were unreasonable and led to negative outcomes and improper behavior,\" according to the report, which was commissioned by a committee of Wells Fargo independent directors. Timothy J. Sloan, who succeeded Mr. Stumpf as chief executive, was largely exonerated by the report, despite the fact that he was also a career Wells Fargo executive. As president and chief operating officer, he became Ms. Tolstedt's immediate supervisor in November 2015. At that point, the report said, he \"assessed her performance over several months before deciding that she should not continue to lead the community bank.\" Mr. Stumpf, who retired in October, exercised all of his remaining options and converted them to stock, which he retained, in the months before Wells Fargo announced its regulatory settlement. He held 2.5 million shares as of late February, currently valued at $137 million. Asked about the timing of Mr. Stumpf's options exercise, Stephen W. Sanger, the board's chairman and leader of its investigation, said in a news conference on Monday morning that it was a routine move that did not raise concern. The $28 million that the board is taking back from Mr. Stumpf - the proceeds of a 2013 equity grant - will be deducted from his retirement plan payouts, Mr. Sanger said. The board's report, which praised the changes the bank had made since the sales scandal erupted into public view, is unlikely to quell the bank's critics. Better Markets, a nonprofit organization that advocates stricter regulation of Wall Street, called the report a compendium of \"too-little, too-late cosmetic actions\" and called on shareholders to oust all of Wells Fargo's board members at the company's annual meeting this month. Two influential advisory firms have also recommended significant changes to the company's board. Six of Wells Fargo's 15 board members, including all of those who served on bank's risk committee, should not be re-elected, according to Glass Lewis, which advises shareholders on governance matters. A rival firm, Institutional Shareholder Services, called for all 12 of the bank's incumbent directors to be removed, citing signs of \"a sustained breakdown of risk oversight on the part of the board.\" The report suggests that Wells Fargo's management knew its goals were unrealistically high but flogged them anyway. \"They were commonly referred to as 50/50 plans, meaning that there was an expectation that only half the regions would be able to meet them,\" the report said. Some Wells Fargo branch employees have described health problems they experienced because of the crushing pressure of the bank's sales culture, and the report offers glimpses of how bad things were. Daily and monthly \"Motivator\" reports were issued, pitting individuals, branches and regions against one another in terms of sales goals; these were discontinued in 2014 after regional executives complained at a \"leadership summit\" meeting that the reports perpetuated a \"culture of shaming and sales pressure.\" Ms. Tolstedt also put in place a system of sales scorecards, which measured people against impossibly high goals. \"Certain managers made meeting scorecard requirements their sole objective, a tactic referred to as ‘managing to the scorecard,'\" the report said. During the period when sham accounts were being pumped out - employees created as many as two million unwanted bank accounts and credit card accounts - Mr. Stumpf used to brag during quarterly earnings calls about Wells Fargo's cross-selling prowess. Whereas most banks could claim perhaps only three accounts per customer, Wells Fargo \"grew our 2012 cross-sell ratio to a record 5.98 products per household,\" Mr. Stumpf said in April 2012. He later boasted of even higher numbers, such as 6.17 in 2014 - as Senator Elizabeth Warren, Democrat of Massachusetts, noted in her questioning of Mr. Stumpf at a Banking Committee hearing in September. Some Wells Fargo employees complained that customers did not need so many accounts. The brass-knuckle tactics were harshest in \"areas where bad practices tended to disproportionately cluster,\" like Los Angeles and Arizona, the report said. There, senior bankers were \"particularly associated with extreme pressure, in some cases calling their subordinates several times a day to check in on sales performance and chastising those who failed to meet sales objectives.\" The sales pressure peaked each January, when the bank imposed higher daily sales targets on its workers as part of a \"Jump into January\" campaign. Bankers \"were encouraged to make prospect lists of friends and family members who were potential Jump into January sales targets\" and would sometimes \"sandbag,\" or temporarily withhold, accounts opened in December in order to meet their January goals. The January sales frenzy was found to produce more turnover, lower-quality accounts and overall employee misery, but the bank was \"hesitant to end the program because Tolstedt was ‘scared to death' that it could hurt sales figures for the entire year,\" the report said. The January program was replaced with one called \"Accelerate\" that ran from January until March and was supposed to focus more on banker-customer relationships, but some employees felt that it was just a \"name change,\" the report said. Mr. Sanger said that the board's report on Monday concluded nearly all of its investigation, and that no further terminations or compensation clawbacks are expected. But other investigations - including criminal inquiries by the Justice Department and several state attorneys general - remain in progress. The board's law firm is still looking into reports that the bank retaliated against some former employees who tried to blow the whistle on its wrongdoing. Last week, a federal regulator, the Occupational Safety and Health Administration of the Labor Department, ordered Wells Fargo to reinstate and pay $5.4 million to a former employee who said he was fired after making internal complaints about wrongdoing that he observed. The agency has also warned Wells Fargo that it is likely to order the bank to rehire another worker who said she was fired in 2011 after trying to gain her supervisors' attention to accounts that she said had been fraudulently created. So far, Shearman & Sterling has found no evidence of retaliation, according to Stuart J. Baskin, a partner at the firm. \"We still have a few loose ends, but we don't think it's likely to change any findings,\" he said. "}