{"child": "11_1\t11_2\t11_3\t11_4\t11_5\t11_6\t11_7\t11_8", "title": "California Moves to Become ‘Sanctuary State,’ and Others Look to Follow", "sentences": [{"sentence": "A 42-year-old immigrant was on her way to church in Mendota, a small city in California's Central Valley, one afternoon last month when the police stopped her because the tinted windows on her 2006 Nissan were too dark. What happened next says much about the growing conflict between states like California and the Trump administration."}, {"sentence": "After inspecting her license, the police officer returned to the car and asked the woman, a mother of two, whether she knew that a deportation order had been issued against her. Yes, she replied, she was supposed to appear in front of an immigration judge in Texas nearly 15 years ago, but had no way of getting there."}, {"sentence": "After several minutes, the officer released her, but not before calling the federal immigration authorities. The police officer informed her that Immigration and Customs Enforcement officers would come to her house. Fearing deportation to El Salvador, the woman did not return home - neighbors informed her that immigration officers appeared at her front door half an hour after she was pulled over - and she has not gone back since, one of her lawyers said."}, {"sentence": "For the Trump administration, that kind of assistance from local police officers is a model. For California lawmakers, it is the clearest evidence yet of the need to strictly curb communication between local law enforcement and federal immigration officials."}, {"sentence": "With the federal government vastly expanding who is considered a priority for deportation, the California State Senate approved a bill last week that increased protections for immigrants. The measure prohibits local law enforcement agencies from using resources to investigate, detain, report or arrest people for immigration violations."}, {"sentence": "Supporters say the law - essentially making California the country's first \"sanctuary state\" - would prevent immigrants like the woman in Mendota, who faced no criminal charges, from being turned over for deportation. If approved, the law could directly contradict federal directives, putting local law enforcement agencies in the difficult position of deciding whether to obey Sacramento or Washington. Legal battles are considered likely."}, {"sentence": "\"The federal government is going to have to step in and decide if this is worth a lawsuit, because I am not sure what we can do,\" said Donny Youngblood, the sheriff in Kern County and the president of the California State Sheriffs' Association, which is lobbying against the measure. \"All we are doing is providing information to the federal government so that they can do their job. To restrict that doesn't make sense.\""}, {"sentence": "While California is moving more decisively and quickly than any other state, bills that restrict cooperation with immigration officials have been introduced in several legislatures throughout the country, including in Illinois, Maryland, Nevada and New York."}, {"sentence": "In Vermont last month, Gov. Phil Scott, a Republican, signed a measure that bars state and local police officers from enforcing immigration laws without his approval and prohibits the collection of personal information, including immigration status and religion, for any kind of registry that could be used by federal officials."}, {"sentence": "If enacted, the California law could have a significant effect on federal immigration enforcement - at least half of immigrants living in the United States who are deported come from local jails and prisons, experts say."}, {"sentence": "The law goes next to the Assembly, where it is expected to pass. But Gov. Jerry Brown has not indicated whether he supports it."}, {"sentence": "Lt. Kevin Smith of the Mendota police said officers routinely run the name of anyone they pull over through a national database. If they find that immigration officials are looking for the person, he said, they alert the local ICE office. He said he was unsure whether the department would change its policy if the proposed legislation were approved."}, {"sentence": "Under a state law in place since 2013, local jails in California have not complied with \"detainers,\" or requests from ICE to hold immigrants who could be deported."}, {"sentence": "Still, nearly every county jail allows ICE officers inside, so they can easily keep track of who is brought in and scheduled for release, comparing names and fingerprints with federal immigration databases. The new law would end that policy and would also prohibit the police from notifying ICE about anyone they pull over."}, {"sentence": "The law is intended to prevent immigrants from being deported for minor crimes, said Kevin de León, president pro tem of the California Senate and author of the legislation. \"It's the absolute height of ridiculousness that ICE would come in and just deport somebody as opposed to that person having their day in immigration court,\" he said."}, {"sentence": "Opponents of the policy argue that the state will effectively force the immigration authorities to make more arrests in public, where other immigrants who have not been convicted of any crime could also be swept up."}, {"sentence": "It is still unclear how Attorney General Jeff Sessions will follow through on the administration's threat to withhold grants from so-called sanctuary cities, let alone states."}, {"sentence": "Many states are siding with the administration and have been drafting laws requiring local governments to cooperate with ICE requests to hold inmates for deportation proceedings."}, {"sentence": "In Texas, for example, Gov. Greg Abbott has already denied state funding from any local government that does not enforce detainers. He is also pushing for a bill that would require law enforcement to comply with detainers."}, {"sentence": "\"I will not tolerate sanctuary city policies that put the citizens of Texas at risk,\" he said after the bill passed the Senate in February. \"Elected officials do not get to pick and choose which laws they will obey.\""}, {"sentence": "Tactically, California appears to be taking a page from the playbook Texas used during the Obama administration by confronting the federal government on immigration. In 2014, Texas sued to block the administration's plans to grant temporary protection against deportation to as many as five million undocumented immigrants who met certain requirements. The state argued that the president had changed the law without proper public review. The lawsuit effectively stopped the plans."}, {"sentence": "Rick Su, a law professor at the University at Buffalo, said the lawsuit in Texas and the legislation in California were both \"efforts in some ways to goad, to sort of transform the partisan battle into a state versus federal fight.\""}, {"sentence": "Other states have proposed bills to limit the role local officers can play in immigration enforcement, but their path forward is uncertain."}, {"sentence": "Democrats in Massachusetts have been gathering support for one such bill, but Gov. Charlie Baker, a Republican, has said he opposes Massachusetts's becoming a \"sanctuary state\" and would rather leave the matter up to cities and towns. A similar measure in Maryland passed the House last month, but it drew the ire of some in law enforcement and a veto threat from the Republican governor, Larry Hogan. Only a small portion of the bill has moved forward in the Senate."}, {"sentence": "Immigration advocates say Vermont's law is largely symbolic, because the Trump administration has not tried to collect information for a registry and because departments there do not currently enforce immigration law."}, {"sentence": "But the bill, which passed unanimously in the State Senate and overwhelmingly in the House, has raised alarms in the northern reaches of the state, where small-town police officers frequently turn to federal officers, like the Border Patrol, for help in emergencies."}, {"sentence": "The law \"sends a message that could be construed to imply that local law enforcement shouldn't be working with our federal partners,\" said Chief Leonard Stell, of the Police Department in Swanton, a community of about 6,400, eight miles from the Canadian border."}], "name": "11", "parent": "", "content": "A 42-year-old immigrant was on her way to church in Mendota, a small city in California's Central Valley, one afternoon last month when the police stopped her because the tinted windows on her 2006 Nissan were too dark. What happened next says much about the growing conflict between states like California and the Trump administration. After inspecting her license, the police officer returned to the car and asked the woman, a mother of two, whether she knew that a deportation order had been issued against her. Yes, she replied, she was supposed to appear in front of an immigration judge in Texas nearly 15 years ago, but had no way of getting there. After several minutes, the officer released her, but not before calling the federal immigration authorities. The police officer informed her that Immigration and Customs Enforcement officers would come to her house. Fearing deportation to El Salvador, the woman did not return home - neighbors informed her that immigration officers appeared at her front door half an hour after she was pulled over - and she has not gone back since, one of her lawyers said. For the Trump administration, that kind of assistance from local police officers is a model. For California lawmakers, it is the clearest evidence yet of the need to strictly curb communication between local law enforcement and federal immigration officials. With the federal government vastly expanding who is considered a priority for deportation, the California State Senate approved a bill last week that increased protections for immigrants. The measure prohibits local law enforcement agencies from using resources to investigate, detain, report or arrest people for immigration violations. Supporters say the law - essentially making California the country's first \"sanctuary state\" - would prevent immigrants like the woman in Mendota, who faced no criminal charges, from being turned over for deportation. If approved, the law could directly contradict federal directives, putting local law enforcement agencies in the difficult position of deciding whether to obey Sacramento or Washington. Legal battles are considered likely. \"The federal government is going to have to step in and decide if this is worth a lawsuit, because I am not sure what we can do,\" said Donny Youngblood, the sheriff in Kern County and the president of the California State Sheriffs' Association, which is lobbying against the measure. \"All we are doing is providing information to the federal government so that they can do their job. To restrict that doesn't make sense.\" While California is moving more decisively and quickly than any other state, bills that restrict cooperation with immigration officials have been introduced in several legislatures throughout the country, including in Illinois, Maryland, Nevada and New York. In Vermont last month, Gov. Phil Scott, a Republican, signed a measure that bars state and local police officers from enforcing immigration laws without his approval and prohibits the collection of personal information, including immigration status and religion, for any kind of registry that could be used by federal officials. If enacted, the California law could have a significant effect on federal immigration enforcement - at least half of immigrants living in the United States who are deported come from local jails and prisons, experts say. The law goes next to the Assembly, where it is expected to pass. But Gov. Jerry Brown has not indicated whether he supports it. Lt. Kevin Smith of the Mendota police said officers routinely run the name of anyone they pull over through a national database. If they find that immigration officials are looking for the person, he said, they alert the local ICE office. He said he was unsure whether the department would change its policy if the proposed legislation were approved. Under a state law in place since 2013, local jails in California have not complied with \"detainers,\" or requests from ICE to hold immigrants who could be deported. Still, nearly every county jail allows ICE officers inside, so they can easily keep track of who is brought in and scheduled for release, comparing names and fingerprints with federal immigration databases. The new law would end that policy and would also prohibit the police from notifying ICE about anyone they pull over. The law is intended to prevent immigrants from being deported for minor crimes, said Kevin de León, president pro tem of the California Senate and author of the legislation. \"It's the absolute height of ridiculousness that ICE would come in and just deport somebody as opposed to that person having their day in immigration court,\" he said. Opponents of the policy argue that the state will effectively force the immigration authorities to make more arrests in public, where other immigrants who have not been convicted of any crime could also be swept up. It is still unclear how Attorney General Jeff Sessions will follow through on the administration's threat to withhold grants from so-called sanctuary cities, let alone states. Many states are siding with the administration and have been drafting laws requiring local governments to cooperate with ICE requests to hold inmates for deportation proceedings. In Texas, for example, Gov. Greg Abbott has already denied state funding from any local government that does not enforce detainers. He is also pushing for a bill that would require law enforcement to comply with detainers. \"I will not tolerate sanctuary city policies that put the citizens of Texas at risk,\" he said after the bill passed the Senate in February. \"Elected officials do not get to pick and choose which laws they will obey.\" Tactically, California appears to be taking a page from the playbook Texas used during the Obama administration by confronting the federal government on immigration. In 2014, Texas sued to block the administration's plans to grant temporary protection against deportation to as many as five million undocumented immigrants who met certain requirements. The state argued that the president had changed the law without proper public review. The lawsuit effectively stopped the plans. Rick Su, a law professor at the University at Buffalo, said the lawsuit in Texas and the legislation in California were both \"efforts in some ways to goad, to sort of transform the partisan battle into a state versus federal fight.\" Other states have proposed bills to limit the role local officers can play in immigration enforcement, but their path forward is uncertain. Democrats in Massachusetts have been gathering support for one such bill, but Gov. Charlie Baker, a Republican, has said he opposes Massachusetts's becoming a \"sanctuary state\" and would rather leave the matter up to cities and towns. A similar measure in Maryland passed the House last month, but it drew the ire of some in law enforcement and a veto threat from the Republican governor, Larry Hogan. Only a small portion of the bill has moved forward in the Senate. Immigration advocates say Vermont's law is largely symbolic, because the Trump administration has not tried to collect information for a registry and because departments there do not currently enforce immigration law. But the bill, which passed unanimously in the State Senate and overwhelmingly in the House, has raised alarms in the northern reaches of the state, where small-town police officers frequently turn to federal officers, like the Border Patrol, for help in emergencies. The law \"sends a message that could be construed to imply that local law enforcement shouldn't be working with our federal partners,\" said Chief Leonard Stell, of the Police Department in Swanton, a community of about 6,400, eight miles from the Canadian border. "}