{"title": "Snarled Commutes, Squabbling Agencies and Amtrak’s Penn Station Responsibilities", "name": "12", "child": "12_1\t12_2\t12_3\t12_4\t12_5\t12_6\t12_7\t12_8\t12_9\t12_10\t12_11\t12_12\t12_13", "sentences": [{"sentence": "Commuters from the East End of Long Island to the western edge of New Jersey suffered a transportation meltdown and four days of upheaval last week - all because of the faulty maintenance of a federal railroad they may never ride."}, {"sentence": "Amtrak accepted blame for the minor train derailment that forced cancellations and disrupted tens of thousands of commuters last week. That admission only exacerbated the frustration of the slogging hordes, reminding them just how deeply the New York City area depends on a network of transit agencies that do not always work as a team."}, {"sentence": "The disruption highlighted an entrenched problem in the New York metropolitan area: The task of moving people around the most congested corner of the United States is divided among several autonomous agencies, each with its own priorities - and interests that often clash."}, {"sentence": "As a result, in a region where the highways, bridges, tunnels, trains and subways are packed, even a minor accident like the one at Penn Station can reverberate far and wide - in this case, all the way to Washington."}, {"sentence": "Once a jewel of the nation's transportation network, Penn Station, North America's busiest rail terminal, is now the overburdened nexus of two of the country's biggest commuter railroads and its only viable intercity train service. Amtrak, New Jersey Transit and the Long Island Rail Road combine to push and pull half a million people through the station's aging infrastructure every weekday."}, {"sentence": "But when something breaks, it falls to Amtrak, which owns and operates the station, to perform triage, deciding how to spread the pain among the customers of the three railroads. The agencies must then seek any help they can arrange. Last week, New Jersey Transit enlisted PATH trains, operated by the Port Authority of New York and New Jersey, and New York Waterway ferries, run by a private company, to carry displaced riders across the Hudson River."}, {"sentence": "The diffuse nature of the transportation system occasionally causes sniping among agencies, which was precisely what happened last week. Both the Long Island Rail Road and New Jersey Transit publicly vented about Amtrak. Gov. Chris Christie of New Jersey went further, threatening to withhold payments to Amtrak and calling for a congressional hearing."}, {"sentence": "\"They're the landlord,\" Mr. Christie said of Amtrak. \"They're the owner of the rails, and they need to make sure they're safe for our people to travel on them.\""}, {"sentence": "Penn Station's 21 tracks are chock-full during rush hours, so when several are unavailable, dozens of scheduled trains must be canceled. That was why the derailment of a New Jersey Transit train near the Hudson River on Monday morning, which knocked out eight tracks, was still disrupting the routines of riders from Long Island on Friday."}, {"sentence": "As the traffic controller, Amtrak has to coordinate with the commuter railroads, explaining the effects of an episode like Monday's derailment, said Charles W. Moorman, the chief executive of Amtrak."}, {"sentence": "\"We then have to go through and say, ‘O.K., here is the new capacity of the station,' and then try to allocate it so people understand this is what we can get into the station today,\" Mr. Moorman said in an interview."}, {"sentence": "He said Amtrak notified other local and state agencies, too. But the derailment also exposed another complication in the region's transportation system: While New York City relies on the rail system to carry a sizable portion of its work force, it has little say over how that system operates."}, {"sentence": "\"The city has an enormous vested interest,\" said Thomas K. Wright, the president of the Regional Plan Association, an urban policy group that has been calling for a new rail tunnel under the Hudson River for over 20 years. \"Every property owner, every employee, every resident in New York has an enormous stake in this system working because the city's economy depends on it.\""}, {"sentence": "The Partnership for New York City, which represents the interests of the city's biggest private companies, estimates that it costs Manhattan employers $14.5 million for every hour that train commuters from New Jersey and Long Island are delayed, said its president and chief executive, Kathryn S. Wylde. For some companies, such as Guardian Life, whose headquarters are in Lower Manhattan, more than half their employees travel from New Jersey and Long Island."}, {"sentence": "\"Penn Station is a symbol of the failure of America to keep up with the escalating demands on urban public transportation, as cities have become much bigger and more important as global economic hubs,\" Ms. Wylde said."}, {"sentence": "She said large employers in New York were frustrated by the exclusion of private investment to help improve the city's transportation infrastructure."}, {"sentence": "\"Our competitor cities in Europe, Asia and Australia generally have modern systems and equipment, largely designed, built and managed through public-private partnerships,\" Ms. Wylde said. \"The frustration of the business community is not over which governmental units are running the railroad, but the missed opportunity to tap the private sector to create systems that can measure up to 21st-century expectations.\""}, {"sentence": "Mr. Wright said the patchwork response to the recent disruptions offered a glimpse of what life in the region might be like if one of the 110-year-old rail tunnels under the Hudson had to shut down. And the question is no longer \"if,\" but \"when.\""}, {"sentence": "Amtrak officials have warned that the damage to those two single-track tubes from Hurricane Sandy will eventually force Amtrak to close off one for repairs. When that happens, the number of commuter trains crossing the river at peak travel times will decline by 75 percent, a potentially crippling blow to the regional economy, they said."}, {"sentence": "The loss of that many trains would drive commuters to try crossing in buses or cars, on ferries or on PATH. Last week, New York Waterway added boats to its routes out of Hoboken and PATH honored New Jersey Transit passes, the costs to be recouped later from the railroad."}, {"sentence": "The Port Authority said the PATH system, which connects to Manhattan from Hoboken, Jersey City and Newark, carried an additional 55,000 riders per day from Monday through Thursday. That surge of more than 20 percent overwhelmed some PATH station entrances and platforms. At Hoboken Terminal, the police blocked off a main entrance to the PATH station."}, {"sentence": "\"It's just a nightmare,\" Mr. Wright said, after a fourth day of protracted commutes from his New Jersey home. \"This is simply a harbinger of what's going to be coming more and more. It's still not what fully would happen if cracks start appearing in the Hudson tunnels.\""}, {"sentence": "And given the fragmented nature of the region's transportation network, perhaps the only viable solution is Amtrak's Gateway project, which would include new rail tunnels between New Jersey and Penn Station. Mr. Wright said the corporation created to manage Gateway should have the power to take private property, override zoning rules and maybe even impose taxes on businesses that would benefit from the project."}, {"sentence": "As a model, he cited the Crossrail project in London, a network of rail tunnels being built by a corporation financed by the British government, the City of London, and taxes and fees assessed on businesses and property owners. After more than 25 years of planning, Crossrail is scheduled to start providing new service this year."}, {"sentence": "But until Gateway is completed - if it ever is completed - more than 200,000 daily commuters will continue to rely on Penn Station, its 21 tracks and Amtrak's stewardship."}, {"sentence": "Mr. Moorman said he believed that Amtrak was the right agency to manage the daily crush at the station."}, {"sentence": "\"We're the appropriate party to make the right judgments to balance out the needs of everyone else,\" Mr. Moorman said."}, {"sentence": "He said he planned to convene officials from all of the agencies that use Penn Station and \"hammer out\" their priorities. \"I think we all can and will and should work together,\" he said, \"because it's in all of our best interests to work together.\""}], "parent": "", "content": "Commuters from the East End of Long Island to the western edge of New Jersey suffered a transportation meltdown and four days of upheaval last week - all because of the faulty maintenance of a federal railroad they may never ride. Amtrak accepted blame for the minor train derailment that forced cancellations and disrupted tens of thousands of commuters last week. That admission only exacerbated the frustration of the slogging hordes, reminding them just how deeply the New York City area depends on a network of transit agencies that do not always work as a team. The disruption highlighted an entrenched problem in the New York metropolitan area: The task of moving people around the most congested corner of the United States is divided among several autonomous agencies, each with its own priorities - and interests that often clash. As a result, in a region where the highways, bridges, tunnels, trains and subways are packed, even a minor accident like the one at Penn Station can reverberate far and wide - in this case, all the way to Washington. Once a jewel of the nation's transportation network, Penn Station, North America's busiest rail terminal, is now the overburdened nexus of two of the country's biggest commuter railroads and its only viable intercity train service. Amtrak, New Jersey Transit and the Long Island Rail Road combine to push and pull half a million people through the station's aging infrastructure every weekday. But when something breaks, it falls to Amtrak, which owns and operates the station, to perform triage, deciding how to spread the pain among the customers of the three railroads. The agencies must then seek any help they can arrange. Last week, New Jersey Transit enlisted PATH trains, operated by the Port Authority of New York and New Jersey, and New York Waterway ferries, run by a private company, to carry displaced riders across the Hudson River. The diffuse nature of the transportation system occasionally causes sniping among agencies, which was precisely what happened last week. Both the Long Island Rail Road and New Jersey Transit publicly vented about Amtrak. Gov. Chris Christie of New Jersey went further, threatening to withhold payments to Amtrak and calling for a congressional hearing. \"They're the landlord,\" Mr. Christie said of Amtrak. \"They're the owner of the rails, and they need to make sure they're safe for our people to travel on them.\" Penn Station's 21 tracks are chock-full during rush hours, so when several are unavailable, dozens of scheduled trains must be canceled. That was why the derailment of a New Jersey Transit train near the Hudson River on Monday morning, which knocked out eight tracks, was still disrupting the routines of riders from Long Island on Friday. As the traffic controller, Amtrak has to coordinate with the commuter railroads, explaining the effects of an episode like Monday's derailment, said Charles W. Moorman, the chief executive of Amtrak. \"We then have to go through and say, ‘O.K., here is the new capacity of the station,' and then try to allocate it so people understand this is what we can get into the station today,\" Mr. Moorman said in an interview. He said Amtrak notified other local and state agencies, too. But the derailment also exposed another complication in the region's transportation system: While New York City relies on the rail system to carry a sizable portion of its work force, it has little say over how that system operates. \"The city has an enormous vested interest,\" said Thomas K. Wright, the president of the Regional Plan Association, an urban policy group that has been calling for a new rail tunnel under the Hudson River for over 20 years. \"Every property owner, every employee, every resident in New York has an enormous stake in this system working because the city's economy depends on it.\" The Partnership for New York City, which represents the interests of the city's biggest private companies, estimates that it costs Manhattan employers $14.5 million for every hour that train commuters from New Jersey and Long Island are delayed, said its president and chief executive, Kathryn S. Wylde. For some companies, such as Guardian Life, whose headquarters are in Lower Manhattan, more than half their employees travel from New Jersey and Long Island. \"Penn Station is a symbol of the failure of America to keep up with the escalating demands on urban public transportation, as cities have become much bigger and more important as global economic hubs,\" Ms. Wylde said. She said large employers in New York were frustrated by the exclusion of private investment to help improve the city's transportation infrastructure. \"Our competitor cities in Europe, Asia and Australia generally have modern systems and equipment, largely designed, built and managed through public-private partnerships,\" Ms. Wylde said. \"The frustration of the business community is not over which governmental units are running the railroad, but the missed opportunity to tap the private sector to create systems that can measure up to 21st-century expectations.\" Mr. Wright said the patchwork response to the recent disruptions offered a glimpse of what life in the region might be like if one of the 110-year-old rail tunnels under the Hudson had to shut down. And the question is no longer \"if,\" but \"when.\" Amtrak officials have warned that the damage to those two single-track tubes from Hurricane Sandy will eventually force Amtrak to close off one for repairs. When that happens, the number of commuter trains crossing the river at peak travel times will decline by 75 percent, a potentially crippling blow to the regional economy, they said. The loss of that many trains would drive commuters to try crossing in buses or cars, on ferries or on PATH. Last week, New York Waterway added boats to its routes out of Hoboken and PATH honored New Jersey Transit passes, the costs to be recouped later from the railroad. The Port Authority said the PATH system, which connects to Manhattan from Hoboken, Jersey City and Newark, carried an additional 55,000 riders per day from Monday through Thursday. That surge of more than 20 percent overwhelmed some PATH station entrances and platforms. At Hoboken Terminal, the police blocked off a main entrance to the PATH station. \"It's just a nightmare,\" Mr. Wright said, after a fourth day of protracted commutes from his New Jersey home. \"This is simply a harbinger of what's going to be coming more and more. It's still not what fully would happen if cracks start appearing in the Hudson tunnels.\" And given the fragmented nature of the region's transportation network, perhaps the only viable solution is Amtrak's Gateway project, which would include new rail tunnels between New Jersey and Penn Station. Mr. Wright said the corporation created to manage Gateway should have the power to take private property, override zoning rules and maybe even impose taxes on businesses that would benefit from the project. As a model, he cited the Crossrail project in London, a network of rail tunnels being built by a corporation financed by the British government, the City of London, and taxes and fees assessed on businesses and property owners. After more than 25 years of planning, Crossrail is scheduled to start providing new service this year. But until Gateway is completed - if it ever is completed - more than 200,000 daily commuters will continue to rely on Penn Station, its 21 tracks and Amtrak's stewardship. Mr. Moorman said he believed that Amtrak was the right agency to manage the daily crush at the station. \"We're the appropriate party to make the right judgments to balance out the needs of everyone else,\" Mr. Moorman said. He said he planned to convene officials from all of the agencies that use Penn Station and \"hammer out\" their priorities. \"I think we all can and will and should work together,\" he said, \"because it's in all of our best interests to work together.\" "}