{"child": "", "parent": "", "name": "13", "content": "The New York Daily News and ProPublica won the Pulitzer Prize for public service on Monday for a series on the New York Police Department's widespread abuse of a decades-old law to force people from their homes and businesses over alleged illegal activity. The investigation, which involved the examination of more than 1,100 nuisance abatement cases, found that the Police Department almost exclusively targeted households and shops in minority neighborhoods. The reporting drove New York City to re-examine the nuisance law and pass sweeping reforms. The New York Times won three awards - for breaking news photography, feature writing and international reporting. Daniel Berehulak won for photographs that provided a haunting portrait of a violent campaign in the Philippines; C.J. Chivers won for a magazine piece on a young veteran of the war in Afghanistan suffering from PTSD; and the Times reporters won for international reporting for a series on Russia's surreptitious assertion of power. Mr. Berehulak won in the feature photography category two years ago for his moving portraits depicting the spread of Ebola in West Africa. David A. Fahrenthold of The Washington Post won the Pulitzer Prize for national reporting for his work on Mr. Trump's charitable foundation. The Pulitzers this year come as newsrooms across the country face daunting challenges, with financial pressure draining many news organizations of the resources to pursue top-flight journalism. They also come in the face of a Trump administration that is openly hostile to much of the news media. Mr. Trump has called the news media \"the enemy of the American people.\" ", "title": "Pulitzer Prizes: Daily News and ProPublica Share Public Service Award; New York Times Wins 3", "sentences": [{"sentence": "The New York Daily News and ProPublica won the Pulitzer Prize for public service on Monday for a series on the New York Police Department's widespread abuse of a decades-old law to force people from their homes and businesses over alleged illegal activity."}, {"sentence": "The investigation, which involved the examination of more than 1,100 nuisance abatement cases, found that the Police Department almost exclusively targeted households and shops in minority neighborhoods. The reporting drove New York City to re-examine the nuisance law and pass sweeping reforms."}, {"sentence": "The New York Times won three awards - for breaking news photography, feature writing and international reporting. Daniel Berehulak won for photographs that provided a haunting portrait of a violent campaign in the Philippines; C.J. Chivers won for a magazine piece on a young veteran of the war in Afghanistan suffering from PTSD; and the Times reporters won for international reporting for a series on Russia's surreptitious assertion of power."}, {"sentence": "Mr. Berehulak won in the feature photography category two years ago for his moving portraits depicting the spread of Ebola in West Africa."}, {"sentence": "David A. Fahrenthold of The Washington Post won the Pulitzer Prize for national reporting for his work on Mr. Trump's charitable foundation."}, {"sentence": "The Pulitzers this year come as newsrooms across the country face daunting challenges, with financial pressure draining many news organizations of the resources to pursue top-flight journalism. They also come in the face of a Trump administration that is openly hostile to much of the news media. Mr. Trump has called the news media \"the enemy of the American people.\""}]}