{"parent": "", "name": "14", "sentences": [{"sentence": "Good morning."}, {"sentence": "(Want to get California Today by email? Here's the sign-up.)"}, {"sentence": "It's sprayed on home gardens, Little League Baseball fields and, most heavily, the corn, soybean and other crops of the Central Valley."}, {"sentence": "More than 10 million pounds of glyphosate, the active ingredient in the weedkiller Roundup, are applied in California each year, according to government figures."}, {"sentence": "Now, after a yearlong legal battle, California's environmental health agency has announced that it will list it as a known carcinogen."}, {"sentence": "The move would make the agency the first American regulatory body to do so. Yet the science is not settled, researchers say."}, {"sentence": "Two years ago, the cancer research arm of the World Health Organization deemed glyphosate a probable carcinogen. But other regulators have played down concerns of a cancer risk, including the U.S. Environmental Protection Agency which has said glyphosate poses \"low toxicity for humans.\""}, {"sentence": "The mixed science can be attributed in part to the way studies have been designed, said Nathan Donley, a senior scientist at the Center for Biological Diversity. \"There's a lot of controversy around it,\" he said."}, {"sentence": "In court, the manufacturer of Roundup, Monsanto, argued that California had no basis to make the cancer designation and said it would hurt the company financially."}, {"sentence": "In January, a judge rejected the lawsuit. Monsanto, based in Missouri, has appealed."}, {"sentence": "\"We disagree with the court's ruling, and we will continue to fight the decision on the basis of sound science and the law,\" the chemical giant said in an emailed statement."}, {"sentence": "The listing of glyphosate as a carcinogen would represent a warning to consumers, not a ban. Still, environmental leaders say they are counting on the move to tilt debates over its use."}, {"sentence": "A pivotal battleground would be in the Central Valley, where spraying of the herbicide is common and agricultural groups defend it as an essential tool in controlling weeds and safeguarding the food supply. (See a map of glyphosate use in California)."}, {"sentence": "Along the coast, grass-roots groups opposed to glyphosate have already been securing victories."}, {"sentence": "Last month, school districts in both Burbank and Glendale agreed to halt their use of glyphosate after demands from parents."}, {"sentence": "Kathleen Hallal, a former PTA leader who led another successful effort to eliminate glyphosate use in Irvine, said she expected pressure on officials to intensify."}, {"sentence": "\"A lot of parents have been awakened to the reality of Roundup being everywhere,\" she said."}, {"sentence": "(Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.)"}, {"sentence": "• If California becomes a so-called sanctuary state, expect several counties to resist. [San Francisco Chronicle]"}, {"sentence": "• A congressional bill would prohibit immigration agents from wearing clothing that bears the word \"police.\" [Los Angeles Times]"}, {"sentence": "• Years ago, the Santa Monica-Malibu school district decided to spread PTA money to less-wealthy schools. Not all are thrilled. [The New York Times]"}, {"sentence": "• As interior California has lost influence, Bay Area progressives now dominate state politics. [Opinion | Orange County Register]"}, {"sentence": "• How did the gas tax increase win support in the State Legislature? Nearly $1 billion in side deals played a role. [Los Angeles Times]"}, {"sentence": "• A Los Angeles man transformed a barren strip of public property into a community garden. Now he's fighting eviction. [The New York Times]"}, {"sentence": "• A free speech debate has flared at Claremont McKenna College after protesters disrupted a talk by a conservative commentator. [Los Angeles Times]"}, {"sentence": "• The photographer Larry Sultan trained his camera on people in the California suburbs - immigrant laborers, porn actors and his parents. [The New Yorker]"}, {"sentence": "• Boomers got older, but continue to love rock 'n' roll. Mark Hover, a retiree in Moreno Valley, attends more than 100 concerts a year. [The New York Times]"}, {"sentence": "• Thanks to a Kickstarter campaign, a revival of the cult hit \"Mystery Science Theater 3000\" is coming to Netflix. [The New York Times]"}, {"sentence": "• The 10 best dining spots on the Highway 101 trek between San Francisco and Santa Barbara. [The Mercury News]"}, {"sentence": "• At least two California members of Congress will hold town halls this week: Jared Huffman on Monday in Crescent City, and Mark DeSaulnier on Tuesday in Richmond."}, {"sentence": "• The three-day Coachella music festival kicks off Friday. The headliners: Radiohead, Lady Gaga and Kendrick Lamar. The festival repeats the following weekend."}, {"sentence": "• The N.B.A. playoffs start Saturday. The Warriors and Clippers will compete in the Western Conference. The Lakers and Kings failed to qualify."}, {"sentence": "• In celebration of National Park Week, California parks - including Yosemite, Pinnacles and Joshua Tree - will waive entry fees for the next two weekends."}, {"sentence": "Ever wondered why some San Franciscans hate the nickname Frisco? (Class seems to play a part)."}, {"sentence": "Or whether those \"speed enforced by aircraft\" signs are for real? (Rare, but it happens.)"}, {"sentence": "The folks at KQED, the public radio station in San Francisco, have been tackling those and other questions as part of its weekly mystery-solving podcast Bay Curious."}, {"sentence": "The show invites listeners to ask questions that are on their minds, then investigates the most compelling ones. (It's good. Here's how to subscribe)."}, {"sentence": "We asked Olivia Allen-Price, the Bay Curious host, what makes a good question."}, {"sentence": "\"Definitely something you can't Google,\" she said, adding, \"I love questions that haven't occurred to me but as soon as you read the question, you are curious along with the person who asked. It sort of plants an itch.\""}, {"sentence": "With that in mind, what have you wondered about California or its people?"}, {"sentence": "Send your question to CAtoday@nytimes.com. We'll select a few and try to provide the answers in upcoming newsletters."}, {"sentence": "California Today goes live at 6 a.m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes.com."}, {"sentence": "The California Today columnist, Mike McPhate, is a third-generation Californian - born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter."}, {"sentence": "California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U.C. Berkeley."}], "child": "", "title": "California Today: Cancer Worries Over a Common Weedkiller", "content": "Good morning. (Want to get California Today by email? Here's the sign-up.) It's sprayed on home gardens, Little League Baseball fields and, most heavily, the corn, soybean and other crops of the Central Valley. More than 10 million pounds of glyphosate, the active ingredient in the weedkiller Roundup, are applied in California each year, according to government figures. Now, after a yearlong legal battle, California's environmental health agency has announced that it will list it as a known carcinogen. The move would make the agency the first American regulatory body to do so. Yet the science is not settled, researchers say. Two years ago, the cancer research arm of the World Health Organization deemed glyphosate a probable carcinogen. But other regulators have played down concerns of a cancer risk, including the U.S. Environmental Protection Agency which has said glyphosate poses \"low toxicity for humans.\" The mixed science can be attributed in part to the way studies have been designed, said Nathan Donley, a senior scientist at the Center for Biological Diversity. \"There's a lot of controversy around it,\" he said. In court, the manufacturer of Roundup, Monsanto, argued that California had no basis to make the cancer designation and said it would hurt the company financially. In January, a judge rejected the lawsuit. Monsanto, based in Missouri, has appealed. \"We disagree with the court's ruling, and we will continue to fight the decision on the basis of sound science and the law,\" the chemical giant said in an emailed statement. The listing of glyphosate as a carcinogen would represent a warning to consumers, not a ban. Still, environmental leaders say they are counting on the move to tilt debates over its use. A pivotal battleground would be in the Central Valley, where spraying of the herbicide is common and agricultural groups defend it as an essential tool in controlling weeds and safeguarding the food supply. (See a map of glyphosate use in California). Along the coast, grass-roots groups opposed to glyphosate have already been securing victories. Last month, school districts in both Burbank and Glendale agreed to halt their use of glyphosate after demands from parents. Kathleen Hallal, a former PTA leader who led another successful effort to eliminate glyphosate use in Irvine, said she expected pressure on officials to intensify. \"A lot of parents have been awakened to the reality of Roundup being everywhere,\" she said. (Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.) • If California becomes a so-called sanctuary state, expect several counties to resist. [San Francisco Chronicle] • A congressional bill would prohibit immigration agents from wearing clothing that bears the word \"police.\" [Los Angeles Times] • Years ago, the Santa Monica-Malibu school district decided to spread PTA money to less-wealthy schools. Not all are thrilled. [The New York Times] • As interior California has lost influence, Bay Area progressives now dominate state politics. [Opinion | Orange County Register] • How did the gas tax increase win support in the State Legislature? Nearly $1 billion in side deals played a role. [Los Angeles Times] • A Los Angeles man transformed a barren strip of public property into a community garden. Now he's fighting eviction. [The New York Times] • A free speech debate has flared at Claremont McKenna College after protesters disrupted a talk by a conservative commentator. [Los Angeles Times] • The photographer Larry Sultan trained his camera on people in the California suburbs - immigrant laborers, porn actors and his parents. [The New Yorker] • Boomers got older, but continue to love rock 'n' roll. Mark Hover, a retiree in Moreno Valley, attends more than 100 concerts a year. [The New York Times] • Thanks to a Kickstarter campaign, a revival of the cult hit \"Mystery Science Theater 3000\" is coming to Netflix. [The New York Times] • The 10 best dining spots on the Highway 101 trek between San Francisco and Santa Barbara. [The Mercury News] • At least two California members of Congress will hold town halls this week: Jared Huffman on Monday in Crescent City, and Mark DeSaulnier on Tuesday in Richmond. • The three-day Coachella music festival kicks off Friday. The headliners: Radiohead, Lady Gaga and Kendrick Lamar. The festival repeats the following weekend. • The N.B.A. playoffs start Saturday. The Warriors and Clippers will compete in the Western Conference. The Lakers and Kings failed to qualify. • In celebration of National Park Week, California parks - including Yosemite, Pinnacles and Joshua Tree - will waive entry fees for the next two weekends. Ever wondered why some San Franciscans hate the nickname Frisco? (Class seems to play a part). Or whether those \"speed enforced by aircraft\" signs are for real? (Rare, but it happens.) The folks at KQED, the public radio station in San Francisco, have been tackling those and other questions as part of its weekly mystery-solving podcast Bay Curious. The show invites listeners to ask questions that are on their minds, then investigates the most compelling ones. (It's good. Here's how to subscribe). We asked Olivia Allen-Price, the Bay Curious host, what makes a good question. \"Definitely something you can't Google,\" she said, adding, \"I love questions that haven't occurred to me but as soon as you read the question, you are curious along with the person who asked. It sort of plants an itch.\" With that in mind, what have you wondered about California or its people? Send your question to CAtoday@nytimes.com. We'll select a few and try to provide the answers in upcoming newsletters. California Today goes live at 6 a.m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes.com. The California Today columnist, Mike McPhate, is a third-generation Californian - born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U.C. Berkeley. "}