{"title": "Loans ‘Designed to Fail’: States Say Navient Preyed on Students", "sentences": [{"sentence": "Ashley Hardin dreamed of being a professional photographer - glamorous shoots, perhaps some exotic travel. So in 2006, she enrolled in the Brooks Institute of Photography and borrowed more than $150,000 to pay for what the school described as a pathway into an industry clamoring for its graduates."}, {"sentence": "\"Brooks was advertised as the most prestigious photography school on the West Coast,\" Ms. Hardin said. \"I wanted to learn from the best of the best.\""}, {"sentence": "Ms. Hardin did not realize that she had taken out high-risk private loans in pursuit of a low-paying career. But her lender, SLM Corporation, better known as Sallie Mae, knew all of that, government lawyers say - and made the loans anyway."}, {"sentence": "In recent months, the student loan giant Navient, which was spun off from Sallie Mae in 2014 and retained nearly all of the company's loan portfolio, has come under fire for aggressive and sloppy loan collection practices, which led to a set of government lawsuits filed in January. But those accusations have overshadowed broader claims, detailed in two state lawsuits filed by the attorneys general in Illinois and Washington, that Sallie Mae engaged in predatory lending, extending billions of dollars in private loans to students like Ms. Hardin that never should have been made in the first place."}, {"sentence": "\"These loans were designed to fail,\" said Shannon Smith, chief of the consumer protection division at the Washington State attorney general's office."}, {"sentence": "New details unsealed last month in the state lawsuits against Navient shed light on how Sallie Mae used private subprime loans - some of which it expected to default at rates as high as 92 percent - as a tool to build its business relationships with colleges and universities across the country. From the outset, the lender knew that many borrowers would be unable to repay, government lawyers say, but it still made the loans, ensnaring students in debt traps that have dogged them for more than a decade."}, {"sentence": "While these risky loans were a bad deal for students, they were a boon for Sallie Mae. The private loans were - as Sallie Mae itself put it - a \"baited hook\" that the lender used to reel in more federally guaranteed loans, according to an internal strategy memo cited in the Illinois lawsuit."}, {"sentence": "The attorneys general in Illinois and Washington - backed by a coalition of those in 27 other states, who participated in a three-year investigation of student lending abuses - want those private loans forgiven."}, {"sentence": "In a pair of cases that could affect hundreds of thousands of borrowers, they have sued Navient. The lawsuits cover private subprime loans made from 2000 to 2009."}, {"sentence": "These cases have parallels to the mortgage crisis that helped drive the American economy into recession, both in scope - borrowers in the United States owe $1.4 trillion on student loans - and in the details of the misdeeds claimed. Working together, the lenders and colleges were preying on a vital part of the American dream, the government lawyers say: the belief that higher education can help lift people toward a prosperous future."}, {"sentence": "That was Ms. Hardin's goal. Today, she is a 33-year-old waitress in Seattle who still owes $150,000 in student loans and pays $1,395 a month, more than her monthly rent, to Navient. If the attorneys general succeed, a chunk of her debt could be erased."}, {"sentence": "Navient, which is based in Wilmington, Del., has denied any wrongdoing and is fighting the lawsuits. It does not originate any loans itself, but when it split off from Sallie Mae, it kept most of Sallie Mae's existing loans. It collects payments from some 12 million people - about one in four student loan borrowers."}, {"sentence": "\"We have a proven track record of helping millions of Americans access and achieve the benefits of higher education,\" said Patricia Nash Christel, a Navient spokeswoman."}, {"sentence": "Sallie Mae said in a statement that Navient \"has accepted responsibility for all costs, expenses, losses and remediation arising from this matter.\""}, {"sentence": "Perhaps more than any other company, Sallie Mae is synonymous in America with student loans - and, in the years after the lending boom, crushing student debt."}, {"sentence": "It got its start more than 30 years ago as a government-sponsored enterprise, collecting payments on loans that were backed by a federal guarantee. By the mid-2000s, Sallie Mae had become a for-profit, publicly traded company no longer tied to the government, although it still made most of its money by originating federally guaranteed student loans."}, {"sentence": "But the company also had a sideline in private loans. Those came with higher interest rates and fewer protections for borrowers than the federal loans. And if the borrowers stopped paying, Sallie Mae was stuck with the loss."}, {"sentence": "Private loans were often profitable for the company, but a portion of them - the riskiest part of Sallie Mae's portfolio - were not. The company made subprime loans to students who would not otherwise qualify, including borrowers with poor credit who took out loans to attend schools with high dropout rates."}, {"sentence": "Those subprime loans were a bargaining chip, the government lawyers said, a tool Sallie Mae used to build relationships with schools so that the company could make more federal loans to their students. The federal loans were the real prize, because they came with a built-in safety net: If a borrower defaulted, the government would step in and reimburse the lender for most of its losses."}, {"sentence": "Sallie Mae could afford to absorb the losses from its private loan business as, essentially, a marketing cost of snagging more lucrative loans. In a 2007 internal note, quoted in Illinois's lawsuit, Sallie Mae described its strategy of using subprime loans to \"win school deals and secure F.F.E.L.P. and standard private volume,\" a reference to the Federal Family Education Loan program that generated most of the company's profits."}, {"sentence": "Defaults on one set of subprime loan products were between 50 and 92 percent every year from 2000 to 2007, according to Illinois's lawsuit. Students did not know about the risk, the state said in its lawsuit, but \"this fact was no secret to Sallie Mae.\""}, {"sentence": "Those defaults did not discourage Sallie Mae, the lawsuits show. From 2000 to 2006, Sallie Mae increased the number of borrowers with one kind of troubled loan to 43,000 from 165, an increase of some 26,000 percent."}, {"sentence": "Sallie Mae was not the only one with an incentive. The schools themselves often had a reason to push private loans."}, {"sentence": "Under Education Department rules, no more than 90 percent of a school's tuition payments can come from federal funding. That means at least 10 percent must come from private sources. At for-profit schools, which rely heavily on federal lending, private loans - even ones to borrowers likely to default - were crucial for staying under the threshold."}, {"sentence": "Some schools made deals with Sallie Mae to subsidize its losses, regulatory filings show. The owner of the Brooks Institute of Photography, Career Education Corporation, once one of the largest for-profit chains in the country, had a typical arrangement: From 2002 to 2006, it agreed to repay 20 percent of Sallie Mae's losses. In 2007, it increased its subsidy to 25 percent."}, {"sentence": "Early on, Career Education treated loan losses as a routine business expense. On an earnings call in August 2006 - the same month that Ms. Hardin began her studies - an analyst suggested that the company should \"be willing to lose a little more money on some of these students to get them in the door,\" according to a transcript of the call."}, {"sentence": "The company's chief financial officer replied, \"That's absolutely our intent.\""}, {"sentence": "But the next year, the tide turned. Government investigations revealed that financial aid officers had been accepting kickbacks, junkets and even stock options in return for steering students to certain lenders. A regulatory crackdown followed, just as the economy plunged into recession."}, {"sentence": "As defaults piled up and heads rolled - Sallie Mae's chief executive stepped down - Sallie Mae abandoned its riskiest practices. In early 2008, the company ended its subprime lending and told at least seven major operators of for-profit schools, including Career Education, that it would stop making private loans to many of their students."}, {"sentence": "In 2014, Sallie Mae and Navient broke apart, and Navient retained the troubled loans the company had originated years earlier."}, {"sentence": "But for the students, containing the damage was not so easy."}, {"sentence": "Lenders can hound students for payments on their debt, or sell it to a collection firm, long after they have written the loan off as soured debt. And because student loans cannot typically be wiped away through bankruptcy, many borrowers have no choice but to continue chipping away at their balance, no matter how dire their financial situation."}, {"sentence": "Ms. Christel, Navient's spokeswoman, defended the company's lending practices as typical for the time."}, {"sentence": "\"Hindsight is always 20/20,\" she said. \"We have called for tools to improve upfront borrowing decisions, and we also support bankruptcy reform that would allow struggling borrowers the option to discharge federal and private student loans in bankruptcy after a good-faith effort to repay.\""}, {"sentence": "Career Education did not respond to requests for comment."}, {"sentence": "The school that Tom Panzica, 42, attended shut down nine years ago, but he is still carrying $6,000 in debt for a degree that turned out to be useless. Every month, he sends $100 to Navient."}, {"sentence": "Mr. Panzica, a firefighter in Chicago, enrolled in Medical Careers Institute to learn sonography. But the school offered no clinical training - and it neglected to tell its students that without that training, they would not be allowed to take the industry's licensing exam."}, {"sentence": "After Mr. Panzica graduated, he discovered that he had none of the qualifications needed to land a job."}, {"sentence": "Medical Careers closed in 2008, and a group of students sued, accusing it of making false claims. The case was settled. Mr. Panzica received around $3,000, less than half of what he had borrowed from Sallie Mae to pay his tuition."}, {"sentence": "Several students, including Mr. Panzica, then sued Sallie Mae, arguing that it was unfair to expect repayment on a loan made for fraudulent goods. The case went to arbitration, where the students lost."}, {"sentence": "Students in California also lost a lawsuit against Sallie Mae. They had sought the dismissal of loans they took out to attend California Culinary Academy, a Le Cordon Bleu affiliate also owned by Career Education, which paid $42 million to settle a class-action claim that it inflated graduation and job-placement rates. (When Career Education shut down its Le Cordon Bleu culinary schools in 2015, the food-world celebrity Alton Brown posted his approval on Twitter, calling the chain \"a culinary puppy mill.\")"}, {"sentence": "A judge tossed out the case, and an appeals court panel upheld the decision. One of the panel's three judges dissented, writing that the complaint plausibly suggested that Sallie Mae \"knew what C.C.A. was up to.\""}, {"sentence": "For Adam Wolf, the lawyer who represented the students, the decision still rankles. \"Sallie Mae facilitated the fraud,\" Mr. Wolf said."}, {"sentence": "Arbitration clauses, buried in the fine print of loan contracts, have largely thwarted students' legal challenges. But the attorneys general are not bound by those clauses. Their cases may be the only avenue left for borrowers to get relief, said Edward X. Clinton Jr., the lawyer who represented Mr. Panzica."}, {"sentence": "Borrowers who take out federal loans to attend schools that misled them can apply to have their loans forgiven, but private loans lack that protection."}, {"sentence": "To Ms. Hardin, that is deeply frustrating. After eight years of payments, her balance has dropped by only $1,000."}, {"sentence": "\"I've cried on the phone several times,\" Ms. Hardin said of her regular fights with Navient."}, {"sentence": "When her husband, a chef, saw that Washington's attorney general had sued Navient, he asked Ms. Hardin what she would do if the case somehow led to her loans being wiped away."}, {"sentence": "Again, she teared up. Since graduating, she has never had any spare cash to travel, or save or plan any further than the next month's loan bill."}, {"sentence": "\"We want to open a sandwich shop,\" Ms. Hardin said. \"The money could be going toward that.\""}], "child": "15_1\t15_2\t15_3\t15_4\t15_5\t15_6\t15_7\t15_8\t15_9\t15_10\t15_11\t15_12\t15_13\t15_14\t15_15\t15_16\t15_17\t15_18\t15_19\t15_20\t15_21\t15_22\t15_23\t15_24\t15_25", "name": "15", "content": "Ashley Hardin dreamed of being a professional photographer - glamorous shoots, perhaps some exotic travel. So in 2006, she enrolled in the Brooks Institute of Photography and borrowed more than $150,000 to pay for what the school described as a pathway into an industry clamoring for its graduates. \"Brooks was advertised as the most prestigious photography school on the West Coast,\" Ms. Hardin said. \"I wanted to learn from the best of the best.\" Ms. Hardin did not realize that she had taken out high-risk private loans in pursuit of a low-paying career. But her lender, SLM Corporation, better known as Sallie Mae, knew all of that, government lawyers say - and made the loans anyway. In recent months, the student loan giant Navient, which was spun off from Sallie Mae in 2014 and retained nearly all of the company's loan portfolio, has come under fire for aggressive and sloppy loan collection practices, which led to a set of government lawsuits filed in January. But those accusations have overshadowed broader claims, detailed in two state lawsuits filed by the attorneys general in Illinois and Washington, that Sallie Mae engaged in predatory lending, extending billions of dollars in private loans to students like Ms. Hardin that never should have been made in the first place. \"These loans were designed to fail,\" said Shannon Smith, chief of the consumer protection division at the Washington State attorney general's office. New details unsealed last month in the state lawsuits against Navient shed light on how Sallie Mae used private subprime loans - some of which it expected to default at rates as high as 92 percent - as a tool to build its business relationships with colleges and universities across the country. From the outset, the lender knew that many borrowers would be unable to repay, government lawyers say, but it still made the loans, ensnaring students in debt traps that have dogged them for more than a decade. While these risky loans were a bad deal for students, they were a boon for Sallie Mae. The private loans were - as Sallie Mae itself put it - a \"baited hook\" that the lender used to reel in more federally guaranteed loans, according to an internal strategy memo cited in the Illinois lawsuit. The attorneys general in Illinois and Washington - backed by a coalition of those in 27 other states, who participated in a three-year investigation of student lending abuses - want those private loans forgiven. In a pair of cases that could affect hundreds of thousands of borrowers, they have sued Navient. The lawsuits cover private subprime loans made from 2000 to 2009. These cases have parallels to the mortgage crisis that helped drive the American economy into recession, both in scope - borrowers in the United States owe $1.4 trillion on student loans - and in the details of the misdeeds claimed. Working together, the lenders and colleges were preying on a vital part of the American dream, the government lawyers say: the belief that higher education can help lift people toward a prosperous future. That was Ms. Hardin's goal. Today, she is a 33-year-old waitress in Seattle who still owes $150,000 in student loans and pays $1,395 a month, more than her monthly rent, to Navient. If the attorneys general succeed, a chunk of her debt could be erased. Navient, which is based in Wilmington, Del., has denied any wrongdoing and is fighting the lawsuits. It does not originate any loans itself, but when it split off from Sallie Mae, it kept most of Sallie Mae's existing loans. It collects payments from some 12 million people - about one in four student loan borrowers. \"We have a proven track record of helping millions of Americans access and achieve the benefits of higher education,\" said Patricia Nash Christel, a Navient spokeswoman. Sallie Mae said in a statement that Navient \"has accepted responsibility for all costs, expenses, losses and remediation arising from this matter.\" Perhaps more than any other company, Sallie Mae is synonymous in America with student loans - and, in the years after the lending boom, crushing student debt. It got its start more than 30 years ago as a government-sponsored enterprise, collecting payments on loans that were backed by a federal guarantee. By the mid-2000s, Sallie Mae had become a for-profit, publicly traded company no longer tied to the government, although it still made most of its money by originating federally guaranteed student loans. But the company also had a sideline in private loans. Those came with higher interest rates and fewer protections for borrowers than the federal loans. And if the borrowers stopped paying, Sallie Mae was stuck with the loss. Private loans were often profitable for the company, but a portion of them - the riskiest part of Sallie Mae's portfolio - were not. The company made subprime loans to students who would not otherwise qualify, including borrowers with poor credit who took out loans to attend schools with high dropout rates. Those subprime loans were a bargaining chip, the government lawyers said, a tool Sallie Mae used to build relationships with schools so that the company could make more federal loans to their students. The federal loans were the real prize, because they came with a built-in safety net: If a borrower defaulted, the government would step in and reimburse the lender for most of its losses. Sallie Mae could afford to absorb the losses from its private loan business as, essentially, a marketing cost of snagging more lucrative loans. In a 2007 internal note, quoted in Illinois's lawsuit, Sallie Mae described its strategy of using subprime loans to \"win school deals and secure F.F.E.L.P. and standard private volume,\" a reference to the Federal Family Education Loan program that generated most of the company's profits. Defaults on one set of subprime loan products were between 50 and 92 percent every year from 2000 to 2007, according to Illinois's lawsuit. Students did not know about the risk, the state said in its lawsuit, but \"this fact was no secret to Sallie Mae.\" Those defaults did not discourage Sallie Mae, the lawsuits show. From 2000 to 2006, Sallie Mae increased the number of borrowers with one kind of troubled loan to 43,000 from 165, an increase of some 26,000 percent. Sallie Mae was not the only one with an incentive. The schools themselves often had a reason to push private loans. Under Education Department rules, no more than 90 percent of a school's tuition payments can come from federal funding. That means at least 10 percent must come from private sources. At for-profit schools, which rely heavily on federal lending, private loans - even ones to borrowers likely to default - were crucial for staying under the threshold. Some schools made deals with Sallie Mae to subsidize its losses, regulatory filings show. The owner of the Brooks Institute of Photography, Career Education Corporation, once one of the largest for-profit chains in the country, had a typical arrangement: From 2002 to 2006, it agreed to repay 20 percent of Sallie Mae's losses. In 2007, it increased its subsidy to 25 percent. Early on, Career Education treated loan losses as a routine business expense. On an earnings call in August 2006 - the same month that Ms. Hardin began her studies - an analyst suggested that the company should \"be willing to lose a little more money on some of these students to get them in the door,\" according to a transcript of the call. The company's chief financial officer replied, \"That's absolutely our intent.\" But the next year, the tide turned. Government investigations revealed that financial aid officers had been accepting kickbacks, junkets and even stock options in return for steering students to certain lenders. A regulatory crackdown followed, just as the economy plunged into recession. As defaults piled up and heads rolled - Sallie Mae's chief executive stepped down - Sallie Mae abandoned its riskiest practices. In early 2008, the company ended its subprime lending and told at least seven major operators of for-profit schools, including Career Education, that it would stop making private loans to many of their students. In 2014, Sallie Mae and Navient broke apart, and Navient retained the troubled loans the company had originated years earlier. But for the students, containing the damage was not so easy. Lenders can hound students for payments on their debt, or sell it to a collection firm, long after they have written the loan off as soured debt. And because student loans cannot typically be wiped away through bankruptcy, many borrowers have no choice but to continue chipping away at their balance, no matter how dire their financial situation. Ms. Christel, Navient's spokeswoman, defended the company's lending practices as typical for the time. \"Hindsight is always 20/20,\" she said. \"We have called for tools to improve upfront borrowing decisions, and we also support bankruptcy reform that would allow struggling borrowers the option to discharge federal and private student loans in bankruptcy after a good-faith effort to repay.\" Career Education did not respond to requests for comment. The school that Tom Panzica, 42, attended shut down nine years ago, but he is still carrying $6,000 in debt for a degree that turned out to be useless. Every month, he sends $100 to Navient. Mr. Panzica, a firefighter in Chicago, enrolled in Medical Careers Institute to learn sonography. But the school offered no clinical training - and it neglected to tell its students that without that training, they would not be allowed to take the industry's licensing exam. After Mr. Panzica graduated, he discovered that he had none of the qualifications needed to land a job. Medical Careers closed in 2008, and a group of students sued, accusing it of making false claims. The case was settled. Mr. Panzica received around $3,000, less than half of what he had borrowed from Sallie Mae to pay his tuition. Several students, including Mr. Panzica, then sued Sallie Mae, arguing that it was unfair to expect repayment on a loan made for fraudulent goods. The case went to arbitration, where the students lost. Students in California also lost a lawsuit against Sallie Mae. They had sought the dismissal of loans they took out to attend California Culinary Academy, a Le Cordon Bleu affiliate also owned by Career Education, which paid $42 million to settle a class-action claim that it inflated graduation and job-placement rates. (When Career Education shut down its Le Cordon Bleu culinary schools in 2015, the food-world celebrity Alton Brown posted his approval on Twitter, calling the chain \"a culinary puppy mill.\") A judge tossed out the case, and an appeals court panel upheld the decision. One of the panel's three judges dissented, writing that the complaint plausibly suggested that Sallie Mae \"knew what C.C.A. was up to.\" For Adam Wolf, the lawyer who represented the students, the decision still rankles. \"Sallie Mae facilitated the fraud,\" Mr. Wolf said. Arbitration clauses, buried in the fine print of loan contracts, have largely thwarted students' legal challenges. But the attorneys general are not bound by those clauses. Their cases may be the only avenue left for borrowers to get relief, said Edward X. Clinton Jr., the lawyer who represented Mr. Panzica. Borrowers who take out federal loans to attend schools that misled them can apply to have their loans forgiven, but private loans lack that protection. To Ms. Hardin, that is deeply frustrating. After eight years of payments, her balance has dropped by only $1,000. \"I've cried on the phone several times,\" Ms. Hardin said of her regular fights with Navient. When her husband, a chef, saw that Washington's attorney general had sued Navient, he asked Ms. Hardin what she would do if the case somehow led to her loans being wiped away. Again, she teared up. Since graduating, she has never had any spare cash to travel, or save or plan any further than the next month's loan bill. \"We want to open a sandwich shop,\" Ms. Hardin said. \"The money could be going toward that.\" ", "parent": ""}