{"title": "Neil Gorsuch Is Sworn In as Supreme Court Justice", "sentences": [{"sentence": "WASHINGTON -  Neil M. Gorsuch was sworn in on Monday as the 113th justice of the Supreme Court, placing a devoted conservative in the seat once occupied by Justice Antonin Scalia and handing President Trump a victory in his push to shape the court for decades to come."}, {"sentence": "Justice Gorsuch, 49, took his judicial oath in the White House Rose Garden with Mr. Trump looking on. It was the fulfillment of a vital campaign promise made by Mr. Trump - one that allayed the reservations of many Republican Party stalwarts, who were otherwise repelled by his candidacy - to make the appointment of a strict conservative to the Supreme Court a top priority."}, {"sentence": "Justice Anthony M. Kennedy, 80, often a swing vote who holds the balance of power on the court, presided, a reminder that Justice Gorsuch's ascendance may not be this president's final chance to influence the direction of the high court."}, {"sentence": "\"Justice Gorsuch, you are now entrusted with the sacred duty of defending our Constitution,\" Mr. Trump said. \"Our country is counting on you to be wise, impartial and fair, to serve under our laws not over them, and to safeguard the right of the people to govern their own affairs.\""}, {"sentence": "Justice Kennedy's presence was symbolic personally for Justice Gorsuch, who served as a clerk for Justice Kennedy and considers him a mentor. It is the first time in the history of the Supreme Court that a sitting justice will serve with a justice who had been his clerk."}, {"sentence": "About two hours before the Rose Garden ceremony, Chief Justice John G. Roberts Jr. administered a separate oath, the one given to all federal officials to support and defend the Constitution, to Justice Gorsuch in a private session at the Supreme Court."}, {"sentence": "But the public event at the White House, which was attended by all eight other justices and several conservative activists, was an opportunity for Mr. Trump to wring maximum public credit from Justice Gorsuch's confirmation. He showcased a rare domestic victory after a chaotic first few months in office marred by legal troubles over his travel ban, the failure of his effort to repeal the health care law and intense feuding inside his senior team."}, {"sentence": "Mr. Trump called the occasion \"momentous\" and \"historic,\" noting that his power to appoint was among a president's most important."}, {"sentence": "\"And I got it done in the first 100 days,\" Mr. Trump said. \"You think that's easy?\""}, {"sentence": "The Rose Garden ceremony, on a sun-soaked spring day, recalled one just over a year ago in which President Barack Obama announced his selection of Judge Merrick B. Garland to succeed Justice Scalia. Senate Republicans quickly declared, however, that they would not consider Judge Garland's nomination, saying the choice of the next justice should belong to the next president."}, {"sentence": "Justice Gorsuch's confirmation process, too, was marred by an extraordinary degree of partisanship. After Democrats waged a filibuster against him, making it impossible to reach the 60 votes required to advance his nomination to a final vote, Republicans invoked the so-called nuclear option, lowering the threshold on Supreme Court nominations to a simple majority vote."}, {"sentence": "Justice Gorsuch alluded to the intensity of the battle on Monday, as he thanked the many White House and Justice Department officials who \"worked through so many late nights and long weeks\" to get him confirmed."}, {"sentence": "\"I promise you that I will do all my powers permit to be a faithful servant of the Constitution and laws of this great nation,\" he said."}], "content": "WASHINGTON -  Neil M. Gorsuch was sworn in on Monday as the 113th justice of the Supreme Court, placing a devoted conservative in the seat once occupied by Justice Antonin Scalia and handing President Trump a victory in his push to shape the court for decades to come. Justice Gorsuch, 49, took his judicial oath in the White House Rose Garden with Mr. Trump looking on. It was the fulfillment of a vital campaign promise made by Mr. Trump - one that allayed the reservations of many Republican Party stalwarts, who were otherwise repelled by his candidacy - to make the appointment of a strict conservative to the Supreme Court a top priority. Justice Anthony M. Kennedy, 80, often a swing vote who holds the balance of power on the court, presided, a reminder that Justice Gorsuch's ascendance may not be this president's final chance to influence the direction of the high court. \"Justice Gorsuch, you are now entrusted with the sacred duty of defending our Constitution,\" Mr. Trump said. \"Our country is counting on you to be wise, impartial and fair, to serve under our laws not over them, and to safeguard the right of the people to govern their own affairs.\" Justice Kennedy's presence was symbolic personally for Justice Gorsuch, who served as a clerk for Justice Kennedy and considers him a mentor. It is the first time in the history of the Supreme Court that a sitting justice will serve with a justice who had been his clerk. About two hours before the Rose Garden ceremony, Chief Justice John G. Roberts Jr. administered a separate oath, the one given to all federal officials to support and defend the Constitution, to Justice Gorsuch in a private session at the Supreme Court. But the public event at the White House, which was attended by all eight other justices and several conservative activists, was an opportunity for Mr. Trump to wring maximum public credit from Justice Gorsuch's confirmation. He showcased a rare domestic victory after a chaotic first few months in office marred by legal troubles over his travel ban, the failure of his effort to repeal the health care law and intense feuding inside his senior team. Mr. Trump called the occasion \"momentous\" and \"historic,\" noting that his power to appoint was among a president's most important. \"And I got it done in the first 100 days,\" Mr. Trump said. \"You think that's easy?\" The Rose Garden ceremony, on a sun-soaked spring day, recalled one just over a year ago in which President Barack Obama announced his selection of Judge Merrick B. Garland to succeed Justice Scalia. Senate Republicans quickly declared, however, that they would not consider Judge Garland's nomination, saying the choice of the next justice should belong to the next president. Justice Gorsuch's confirmation process, too, was marred by an extraordinary degree of partisanship. After Democrats waged a filibuster against him, making it impossible to reach the 60 votes required to advance his nomination to a final vote, Republicans invoked the so-called nuclear option, lowering the threshold on Supreme Court nominations to a simple majority vote. Justice Gorsuch alluded to the intensity of the battle on Monday, as he thanked the many White House and Justice Department officials who \"worked through so many late nights and long weeks\" to get him confirmed. \"I promise you that I will do all my powers permit to be a faithful servant of the Constitution and laws of this great nation,\" he said. ", "parent": "", "name": "2", "child": "2_1\t2_2\t2_3\t2_4\t2_5\t2_6\t2_7\t2_8\t2_9\t2_10\t2_11\t2_12"}