{"name": "1000", "parent": "", "content": "The 10 Best Facebook Groups for Writers Sometimes as I sit at my desk in a remote corner of the house, writing my soul out on the page, I need the company of other writers. Someone who understands how I can both crave and loath this quiet aloneness. When it’s 2am, and I’m working feverishly to meet a deadline or trying to make sense out of the jumble of ideas in my brain, I need community. Where can you find a group that understands your struggles, your dreams, and how hard it is, but knows how much you love this life? On Facebook, of course. Whatever type of writer you are — fiction, blogger, copywriter, content marketer — you can find a community of like-minded individuals on Facebook. So you like Sci-Fi and world-building? Join the Facebook group (see below). Are you an indie author looking for support? There’s a group for you, too. Here are 10 Facebook groups (in no particular order) for writers you need to check out. You might find your next writing soul sister or brother online. 1. Where Authors Begin Writers of all levels, ability, and experience welcome. If you need a supportive community that loves sharing resources and tips, join this group. You’re bound to find someone with whom to connect. And they’re adamant about being supportive. They’ll remove anyone who isn’t constructive in helping others. 2. Women Writers, Women’s Books This is the Facebook group for BooksByWomen.org, an online literary magazine filled with contemporary women writers from around the world. Their mission is to encourage and promote women writers; their About page reads “We are particularly interested in the edges, the intersections between genres, nationalities, languages, arts, and cultures.” 3. Copywriter Café Just like your neighborhood café, you can drop in anytime and find someone willing to give your copy a quick critique. If you have a big project and you want to knock their socks off, get some one-on-one encouragement and coaching. The Café is good about giving you the boost of self-confidence you need to put yourself out there. 4. Writers Helping Writers Are you ready to hand off your manuscript to beta readers for some healthy feedback? Or are you an editor willing to help writers with comments and suggestions? This group is for writers, readers, and editors to mingle over manuscripts. They strongly urge writers to be beta readers as well, so be prepared to read others’ work as well as post your own. 5. Grimdark Fiction Readers & Writers Here’s their promo: “Grimdark is a sub-genre of speculative fiction that usually consists of a) bleak settings, b) morally ambiguous characters, c) gritty violence, and d) dark realism.” That’s good stuff. And they must be doing something that both writers and readers like because they’re almost 3,000 strong. 6. The Blogging Squad Almost 6,000 members come together to support bloggers and influencers. You can share your latest blog posts in the daily thread, and you can find other bloggers with whom to collaborate and commune. If you’re looking for support and encouragement to keep blogging, The Blogging Squad is the one. 7. Fantasy & Science Fiction Writers in America If you’re serious about the craft, you need to join this group. Their focus is solely on Sci-Fi and fantasy, and they encourage writers to post small pieces of their work to get opinions, comments, and suggestions. You’ll find a like-minded group dedicated to the art, craft, and business of writing this genre. 8. Indie Authors International They bill themselves as “the group with no boundaries.” If you’re looking for indie authors, readers, and artists from around the world, you’ve found your community. No matter what you’re looking for — a new writer to follow, an editor for your manuscript, or to post a link to your new book on Amazon — it’s here. 9. FanFiction.net Writers Unite! If you’re hooked on fan fiction, there’s a group just for you. This community has over 8,000 members who enjoy hanging out and talking all things fan fiction. Who knows? Maybe you’ll write the next 50 Shades series and hit it big. You can post links here to get feedback from others. 10. The Content Marketing Lounge Content marketing professionals unite! Here’s where you can meet others and discuss and learn the latest, best tips and advice on content marketing. They’re an avid community interested in content marketing, content creation, and content strategy planning. No blatant promotion, though. It’s a network of content marketers who want to learn and grow. What are your go-to groups on Facebook? Share your favorite Facebook writing group in the comments below. You may stumble upon the very writing community you didn’t know you were looking for…serendipitously. Please share this with all the writers in your life and hit that ♥ button below to spread it around even more. Also add any other tips or tricks that you use regularly below in the comments! Originally published at prowritingaid.com. ", "title": "The 10 Best Facebook Groups for Writers", "sentences": [{"2a89": "The 10 Best Facebook Groups for Writers"}, {"5046": "Sometimes as I sit at my desk in a remote corner of the house, writing my soul out on the page, I need the company of other writers. Someone who understands how I can both crave and loath this quiet aloneness. When it’s 2am, and I’m working feverishly to meet a deadline or trying to make sense out of the jumble of ideas in my brain, I need community."}, {"813c": "Where can you find a group that understands your struggles, your dreams, and how hard it is, but knows how much you love this life?"}, {"0328": "On Facebook, of course."}, {"5a22": "Whatever type of writer you are — fiction, blogger, copywriter, content marketer — you can find a community of like-minded individuals on Facebook. So you like Sci-Fi and world-building? Join the Facebook group (see below). Are you an indie author looking for support? There’s a group for you, too."}, {"ae85": "Here are 10 Facebook groups (in no particular order) for writers you need to check out. You might find your next writing soul sister or brother online."}, {"1943": "1. Where Authors Begin"}, {"4974": "Writers of all levels, ability, and experience welcome. If you need a supportive community that loves sharing resources and tips, join this group. You’re bound to find someone with whom to connect. And they’re adamant about being supportive. They’ll remove anyone who isn’t constructive in helping others."}, {"f75b": "2. Women Writers, Women’s Books"}, {"89d3": "This is the Facebook group for BooksByWomen.org, an online literary magazine filled with contemporary women writers from around the world. Their mission is to encourage and promote women writers; their About page reads “We are particularly interested in the edges, the intersections between genres, nationalities, languages, arts, and cultures.”"}, {"e6a8": "3. Copywriter Café"}, {"2e94": "Just like your neighborhood café, you can drop in anytime and find someone willing to give your copy a quick critique. If you have a big project and you want to knock their socks off, get some one-on-one encouragement and coaching. The Café is good about giving you the boost of self-confidence you need to put yourself out there."}, {"7b4e": "4. Writers Helping Writers"}, {"f484": "Are you ready to hand off your manuscript to beta readers for some healthy feedback? Or are you an editor willing to help writers with comments and suggestions? This group is for writers, readers, and editors to mingle over manuscripts. They strongly urge writers to be beta readers as well, so be prepared to read others’ work as well as post your own."}, {"cee6": "5. Grimdark Fiction Readers & Writers"}, {"1125": "Here’s their promo: “Grimdark is a sub-genre of speculative fiction that usually consists of a) bleak settings, b) morally ambiguous characters, c) gritty violence, and d) dark realism.” That’s good stuff. And they must be doing something that both writers and readers like because they’re almost 3,000 strong."}, {"ffb2": "6. The Blogging Squad"}, {"e925": "Almost 6,000 members come together to support bloggers and influencers. You can share your latest blog posts in the daily thread, and you can find other bloggers with whom to collaborate and commune. If you’re looking for support and encouragement to keep blogging, The Blogging Squad is the one."}, {"c8e1": "7. Fantasy & Science Fiction Writers in America"}, {"e716": "If you’re serious about the craft, you need to join this group. Their focus is solely on Sci-Fi and fantasy, and they encourage writers to post small pieces of their work to get opinions, comments, and suggestions. You’ll find a like-minded group dedicated to the art, craft, and business of writing this genre."}, {"69b9": "8. Indie Authors International"}, {"caee": "They bill themselves as “the group with no boundaries.” If you’re looking for indie authors, readers, and artists from around the world, you’ve found your community. No matter what you’re looking for — a new writer to follow, an editor for your manuscript, or to post a link to your new book on Amazon — it’s here."}, {"bbff": "9. FanFiction.net Writers Unite!"}, {"dec8": "If you’re hooked on fan fiction, there’s a group just for you. This community has over 8,000 members who enjoy hanging out and talking all things fan fiction. Who knows? Maybe you’ll write the next 50 Shades series and hit it big. You can post links here to get feedback from others."}, {"d9bf": "10. The Content Marketing Lounge"}, {"725e": "Content marketing professionals unite! Here’s where you can meet others and discuss and learn the latest, best tips and advice on content marketing. They’re an avid community interested in content marketing, content creation, and content strategy planning. No blatant promotion, though. It’s a network of content marketers who want to learn and grow."}, {"6a78": "What are your go-to groups on Facebook?"}, {"2ab9": "Share your favorite Facebook writing group in the comments below. You may stumble upon the very writing community you didn’t know you were looking for…serendipitously."}, {"4330": "Please share this with all the writers in your life and hit that ♥ button below to spread it around even more. Also add any other tips or tricks that you use regularly below in the comments!"}, {"a02c": "Originally published at prowritingaid.com."}], "child": "1000_1\t1000_21000_1\t1000_2"}