{"name": "1001", "parent": "", "content": "A strategy for blogging. How to figure out what you want to say. The great thing about blogging is that you can, literally, write about anything. The sky is the limit. Also? No one is going to read it for a while (harsh, but true), so you can experiment with relatively low risk. So, blog about baking scones today and about solving the problems of the world tomorrow — whatever. You have the time and space to find your groove. Remember that silver lining when you start your blog and four people look at it the first day. I’ve actually been really excited by how Quora helps me figure out what to blog about. The questions are like prompts and the upvotes let you see what people actually care about, so you’re not just shooting into the dark. It’s the difference between a blank page and a blank page with a question at the top that a bunch of people really want you to answer. And when your post gains some traction, it can ladder up: from Quora to Medium to bigger and bigger audiences. Here’s an example of laddering up: Two days ago, I saw a question on Quora: What does it feel like to be poor? I have some personal experience with poverty and the question was interesting to me. It also had a lot of views and the answers already there had some upvotes, so I figured it was something other people were interested in as well. So I wrote an indepth answer. Then I realized my answer was really blog-post length, so I cross-posted it to Medium. Yesterday morning I had a Tweet from an editor at Huffington Post wanting to republish my blog post. So that happened. Then this morning I had an email from a different publication offering to pay me to reprint my post. I’m not sure I would have thought to write about what being poor feels like without Quora, so that worked out well for me. And, it helped a lot that I could see on Quora that the topic was something that would draw interest. So, do this: If you enjoyed this post, give it some love with a green heart. ❤❤❤ >>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "title": "A strategy for blogging.", "sentences": [{"d489": "A strategy for blogging."}, {"54cf": "How to figure out what you want to say."}, {"8b9c": "The great thing about blogging is that you can, literally, write about anything. The sky is the limit."}, {"307a": "Also? No one is going to read it for a while (harsh, but true), so you can experiment with relatively low risk. So, blog about baking scones today and about solving the problems of the world tomorrow — whatever. You have the time and space to find your groove."}, {"7252": "Remember that silver lining when you start your blog and four people look at it the first day."}, {"1ffe": "I’ve actually been really excited by how Quora helps me figure out what to blog about. The questions are like prompts and the upvotes let you see what people actually care about, so you’re not just shooting into the dark."}, {"9c9f": "It’s the difference between a blank page and a blank page with a question at the top that a bunch of people really want you to answer. And when your post gains some traction, it can ladder up: from Quora to Medium to bigger and bigger audiences."}, {"1985": "Here’s an example of laddering up:"}, {"2c30": "Two days ago, I saw a question on Quora: What does it feel like to be poor?"}, {"10de": "I have some personal experience with poverty and the question was interesting to me. It also had a lot of views and the answers already there had some upvotes, so I figured it was something other people were interested in as well."}, {"87a4": "So I wrote an indepth answer. Then I realized my answer was really blog-post length, so I cross-posted it to Medium."}, {"cfce": "Yesterday morning I had a Tweet from an editor at Huffington Post wanting to republish my blog post. So that happened. Then this morning I had an email from a different publication offering to pay me to reprint my post."}, {"2898": "I’m not sure I would have thought to write about what being poor feels like without Quora, so that worked out well for me. And, it helped a lot that I could see on Quora that the topic was something that would draw interest."}, {"b9d0": "So, do this:"}, {"d9fd": "If you enjoyed this post, give it some love with a green heart. ❤❤❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "child": "1001_1\t1001_2\t1001_3\t1001_4\t1001_5\t1001_6\t1001_7\t1001_8\t1001_9\t1001_10\t1001_11\t1001_12\t1001_13\t1001_14\t1001_15\t1001_16\t1001_17\t1001_18\t1001_19\t1001_20\t1001_21\t1001_22\t1001_23\t1001_241001_1\t1001_2\t1001_3\t1001_4\t1001_5\t1001_6\t1001_7\t1001_8\t1001_9\t1001_10\t1001_11\t1001_12\t1001_13\t1001_14\t1001_15\t1001_16\t1001_17\t1001_18\t1001_19\t1001_20\t1001_21\t1001_22\t1001_23\t1001_24"}