{"name": "1004", "parent": "", "content": "A Web que temosque salvar A internet rica, diversa e livre que eu amava — e pela qual passei anos em uma prisão iraniana — está morrendo. Por que ninguém está fazendo nada pra impedir isso? por Hossein DerakhshanIlustrações por Tim McDonaghTradução por Lara Freitas Sete meses atrás, sentei em uma pequena mesa na cozinha do meu apartamento dos anos 60, que fica no último andar de um edifício na movimentada área central de Teerã, e fiz algo que já fiz milhares de vezes antes. Abri meu laptop e postei no meu novo blog. Essa, no entanto, foi a primeira vez em seis anos. E isso quase partiu meu coração. Algumas semanas antes, eu havia sido repentinamente perdoado e libertado da prisão de Evin, no norte de Teerã. Eu já esperava passar a maior parte da minha vida naquelas celas: em novembro de 2008, eu tinha sido sentenciado a quase 20 anos de cadeia, sobretudo por coisas que eu havia escrito no meu blog. Esse momento de liberdade, quando chegou, foi totalmente inesperado. Fumei um cigarro na cozinha com um dos meus colegas presos e voltei à cela que eu dividia com 12 outros homens. Estávamos também dividindo uma xícara de chá quando o anúncio de uma voz — de outro prisioneiro — encheu as celas e corredores. Em seu tom suave, ele anunciou em persa: “Caros colegas presos, a sorte pousou mais uma vez sobre um companheiro. Sr. Hossein Derakhshan, a partir deste momento você está livre”. Naquela tarde, pela primeira vez, passei por aquelas portas como um homem livre. Tudo parecia novo: a brisa do outono, o barulho do tráfego da ponte, o cheiro e as cores da cidade em que vivi a maior parte da minha vida. Em torno de mim, percebi uma Teerã muito diferente da que eu estava acostumado. Um influxo descarado de novos condomínios luxuosos havia substituído as charmosas casinhas com as quais eu já estava familiarizado. Novas estradas, novas rodovias, uma invasão de SUVs. Outdoors gigantes com propagandas de relógios suíços e TVs coreanas de tela plana. Mulheres com cachecóis e casacos coloridos, homens com cabelos e barbas tingidos e centenas de cafés interessantes com música ocidental moderna e funcionárias mulheres. Os tipos de mudanças que assustavam as pessoas; o tipo de mudança que você só percebe quando a rotina de uma vida normal é tirada de você. Duas semanas depois comecei a escrever outra vez. Alguns amigos concordaram em deixar que eu começasse um blog em uma revista de artes que eles tinham. O blog chamava Ketabkhan — que significa “leitor de livro” em persa. Seis anos é muito tempo na cadeia, mas corresponde a uma era inteira na internet. Escrever na web, em si, não havia mudado, mas a leitura — ou, ao menos, como ler as coisas — é muito diferente. Já haviam me dito que as redes sociais tinham se tornado essenciais enquanto eu estava preso, então entendi que se eu quisesse atrair as pessoas para o que eu estava escrevendo hoje, tinha que usá-las. Assim, tentei postar um link de uma das minhas histórias no Facebook. Mas meus amigos do Facebook não deram a mínima. Ficou parecendo um anúncio de classificado sem graça. Nenhuma descrição. Nenhuma imagem. Nada. Consegui três curtidas. Três! E nada mais. Naquele momento, ficou claro pra mim que as coisas haviam mesmo mudado. Eu não estava preparado para atuar neste novo campo — todos os meus investimentos e esforços haviam sido reduzidos a cinzas. Fiquei arrasado. B logs eram ouro e blogueiros eram rock stars em 2008, quando fui preso. Naquele momento, apesar de meu blog estar bloqueado para acessos dentro de todo o Irã, eu tinha uma audiência de 20.000 visitantes diários. Qualquer outro site que eu lincasse no meu blog veria um aumento repentino de tráfego, eu tinha poder para dar moral ou detonar com quem eu quisesse. As pessoas costumavam ler meus posts cuidadosamente e deixar vários comentários relevantes, e até mesmo aqueles que discordavam de mim voltavam sempre para me ler. Outros blogs lincavam meus posts pra discutir o que eu dizia. Eu me sentia como um rei. O iPhone tinha sido lançado há pouco mais de um ano naquela época, mas os smartphones ainda eram usados basicamente pra fazer chamadas telefônicas e enviar mensagens de texto, ler emails e acessar a internet. Não existiam muitos apps, pelo menos não como eles são hoje. Não tinha Instagram, Snapchat, Viber ou WhatsApp. Em vez disso, existia só a web e, na web, havia blogs: o melhor lugar pra encontrar pensamentos alternativos, notícias e análises. Eles eram a minha vida. Tudo começou com o 9/11. Eu estava em Toronto, e meu pai tinha acabado de chegar de Teerã para uma visita. Estávamos tomando café da manhã quando o segundo avião atingiu o World Trade Center. Eu estava perplexo e confuso e à procura de idéias e explicações quando me deparei com os blogs. Depois de ler alguns deles, eu pensei “é isso, eu preciso começar um blog, e incentivar todos os iranianos a blogarem também”. Assim, usando o bloco de notas do Windows, comecei a experimentar. Em seguida, passei a escrever no Hoder.com, usando o Blogger como plataforma de publicação — antes do Google comprá-lo. Em seguida, no dia 5 de novembro de 2001, eu publiquei um guia passo-a-passo sobre como começar um blog. Isso deflagrou algo que mais tarde foi chamado de “Revolução dos Blogs”: em pouco tempo, centenas de milhares de iranianos fizeram do Irã um dos cinco maiores países em número de blogs, e eu estava orgulhoso de ter tido um papel nessa democratização sem precedentes da escrita. Naquela época, eu costumava manter uma lista com todos os blogs em persa e, por um certo tempo, eu era a primeira pessoa com quem todo novo blogueiro do Irã falaria para que pudesse entrar nessa lista. É por isso que quando eu tinha pouco mais de vinte anos eles me chamavam de “The Blogfather” (em alusão a “The Godfather”) — era um apelido bobo, mas dava uma ideia do quanto eu era importante. Toda manhã, no meu pequeno apartamento no centro de Toronto, eu abria meu computador e cuidava de blogs novos, ajudando para que ganhassem exposição e audiência. O público era diversificado — desde autores e jornalistas exilados, cronistas e peritos em tecnologia até jornalistas locais, políticos, padres e veteranos de guerra — e eu sempre os incentivei ainda mais. Convidei mais homens e mulheres religiosos e pro-República Islâmica, pessoas que viveram no Irã, para começar a escrever. O alcance daquilo que publicávamos naquela época deixou todos impressionados. E, em parte, foi por isso que eu incentivei blogs com veemência. Deixei o Irã no final dos anos 2000 para experimentar a vida no Ocidente, e temi perder todas as tendências que rapidamente emergiam em casa. Mas ler blogs iranianos em Toronto foi a experiência mais próxima que eu poderia ter de dividir um táxi em Teerã e escutar conversas coletivas entre o motorista falante e os passageiros aleatórios. H em uma história no Alcorão sobre a qual eu pensava muito durante meus primeiros oito meses na solitária. Nessa história, um grupo de cristãos perseguidos encontra refúgio em uma caverna. Eles, e um cão que os acompanhava, dormem profundamente, e quando acordam têm a impressão de que haviam apenas tirado um cochilo. Na verdade, havia se passado 300 anos. Uma versão da história conta sobre como um deles sai para comprar alimentos — e imagino como eles deveriam estar famintos depois de 300 anos — e descobre que seu dinheiro agora não vale mais nada, é um item de museu. É quando ele realmente percebe quanto tempo ficaram ausentes. Há seis anos, o hyperlink era a minha moeda. Decorrente da ideia do hypertexto, o hyperlink oferecia uma diversidade e uma descentralização que o mundo real não tinha. O hyperlink representava o espírito aberto, interconectado da World Wide Web — uma visão que começou com seu inventor, Tim Berners-Lee. Era uma maneira de abandonar a centralização — todos os links, linhas e hierarquias — e substituí-la por algo mais distribuído, um sistema de nós e redes. Os blogs deram forma a esse espírito de descentralização: eles eram janelas para vidas que você raramente conheceria de perto; pontes que conectavam vidas diferentes umas às outras e, assim, as mudava. Os blogs eram cafés onde as pessoas trocavam ideias diversas sobre todo e qualquer assunto que você pudesse se interessar. Eles eram os táxis de Teerã em grande escala. Desde que saí da prisão, porém, eu percebi o quanto o hyperlink se desvalorizou, tornando-se quase obsoleto. Quase toda rede social hoje trata um link como qualquer outro objeto — uma foto ou um pedaço de texto — em vez de tratá-lo como uma maneira de tornar esse texto mais rico. Você é incentivado a postar um único hyperlink e expor este hyperlink a um processo quasi-democrático de curtidas, coraçõezinhos e afins: adicionar diversos links a um trecho de texto geralmente não é permitido. Os hyperlinks são objetivados, isolados, destituídos de seus poderes. Ao mesmo tempo, estas redes sociais tendem a tratar o texto e as fotos nativos — coisas que são postadas diretamente neles — com muito mais respeito do que as coisas que estão em sites externos. Um amigo fotógrafo explicou como as imagens que ele postava diretamente no Facebook recebiam um grande número curtidas, o que por sua vez significava que elas apareciam mais nos feeds das pessoas. Por outro lado, quando ele posta um link para as mesmas fotos fora do Facebook — como por exemplo, no seu blog cada vez mais empoeirado — as imagens ficam muito menos visíveis para o próprio Facebook e, consequentemente ganham cada vez menos curtidas. O ciclo se reforça. Algumas redes, como o Twitter, tratam os hyperlinks um pouco melhor. Outras redes são muito mais paranóicas. O Instagram — que pertence ao Facebook — não permite que sua audiência publique nenhum link. Você pode publicar um endereço de localização junto com suas fotos, mas ele não te levará a lugar algum. Muitas pessoas começam suas rotinas digitais diárias nestas redes sociais que são como becos sem saída, e suas jornadas terminam aí. Muitos não têm nem noção de que estão usando a infraestrutura da internet quando curtem uma foto no Instagram ou deixam um comentário em um vídeo do Facebook. É apenas um app, não é mesmo? Mas os hyperlinks não são somente o esqueleto da web: eles são seus olhos, um caminho para sua alma. E uma página web cega, sem hyperlinks, não consegue ver ou observar outra página — e isso têm sérias consequências para a dinâmica de poder na web. De certa forma, todos os teóricos já pensaram sobre a relação entre observação x poder, e em geral em um sentido negativo: o observador desnuda o observado e o transforma em um objeto sem poder, desprovido de inteligência ou ação. Mas no mundo das páginas web, a observação funciona de maneira diferente: ela dá mais poder. Quando um website poderoso — digamos o Google ou o Facebook — observa, ou linca outro site, eles não apenas se conectam — isso faz com que eles EXISTAM; dá vida a eles. Metaforicamente, sem esta observação poderosa, sua página web não respira. Não importa quantos links você coloque em um site, a menos que alguém esteja observando, eles estão mortos e cegos; e, consequentemente, incapazes de transferir poder para qualquer página externa. Por outro lado, as páginas mais poderosas são aquelas que são muito observadas. Assim como celebridades que atraem um certo tipo de poder através dos milhões de olhares humanos que as observam em determinado momento, as páginas conseguem captar e distribuir seu poder através dos hyperlinks. Mas apps como o Instagram são cegos — ou quase cegos. A observação destes apps não chega a lugar algum exceto a eles mesmos, relutantes em transferir parte do seu vasto poder a outros, conduzindo-os a uma morte silenciosa. A consequência é que as páginas fora das mídias sociais estão morrendo. M ntretanto, mesmo antes de eu ir para a prisão, o poder dos hyperlinks já estava sendo refreado. O principal inimigo era uma filosofia que combinava dois dos valores mais dominantes e supervalorizados da nossa época: novidade e popularidade, consequência da dominação de jovens celebridades no mundo real. Essa filosofia é o “Stream”. O “Stream” hoje domina a maneira como as pessoas recebem a informação na web. Poucos usuários estão acessando sites diretamente, em vez disso, eles estão sendo abastecidos por um fluxo interminável de informações que é escolhido para eles por algoritmos complexos e secretos. O Stream significa que você não precisa mais abrir tantos sites. Você não precisa de tantas abas. Você não precisa sequer de um navegador. Basta abrir o Twitter ou o Facebook no seu smartphone e se jogar. A montanha veio até você. Os algoritmos já escolheram tudo para você. De acordo com o que você ou seus amigos leram ou viram anteriormente, os algoritmos preveem o que você poderia gostar de ver. É muito bom não precisar perder tempo procurando coisas interessantes em tantos sites. No entanto, estaríamos perdendo algo aqui nessa relação? O que estamos dando em troca da eficiência? Em muitos apps, os votos que conseguimos — curtidas, estrelas, corações e afins — estão na verdade mais relacionados a avatares bonitos e status de celebridades do que ao conteúdo que é postado. Um parágrafo brilhante postado por uma pessoa de aparência comum pode ser deixado de fora do “Stream”, enquanto as divagações idiotas de uma celebridade ganham uma presença imediata na web. E não só os algoritmos por trás do “Stream” igualam novidade e popularidade à relevância, mas também tendem a mostrar mais sobre o que já curtimos. Estes serviços fazem uma varredura cuidadosa do nosso comportamento e montam delicadamente nossos feeds de notícias com posts, fotos e vídeos que eles acreditam que gostaríamos de ver. A popularidade, em si, não é algo errado, mas traz riscos. Em uma economia de livre-mercado, bens de baixa qualidade com preços errados levam ao fracasso. Ninguém fica chateado quando um discreto café do Brooklyn com capuccinos ruins e funcionários grosseiros fecha. Mas as opiniões não são as mesmas para bens materiais ou serviços. Eles não vão desaparecer se não forem populares ou ruins. Na verdade, a história provou que a maioria das grandes ideias (e muitas das ideias ruins) não eram muito populares durante muito tempo e esse status marginal apenas as fortaleceu. As opiniões minoritárias são radicalizadas quando não podem ser expressas e reconhecidas. Hoje, o “Stream” é forma dominante de organização de informações na mídia digital. Funciona assim em toda rede social e aplicativo móvel. Desde que ganhei minha liberdade, para toda parte que olho vejo o “Stream”. Acredito que não levará muito tempo até que vejamos sites de notícias organizando todo seu conteúdo baseado nos mesmos princípios. A relevância do “Stream” não apenas constrói imensos blocos tendenciosos na Internet contra a qualidade — mas também significa uma profunda traição da diversidade que a World Wide Web originalmente vislumbrou. Pra mim, não há dúvidas de que a diversidade de temas e opiniões está menos representada hoje do que já esteve no passado. Ideias novas, diferentes e desafiadoras começam a ser suprimidas pelas redes sociais de porque suas estratégias de ranking dão prioridade ao popular e habitual. (Não me admira que a Apple esteja contratando editores humanos para seu app de notícias.) Mas a diversidade está sendo reduzida de outras maneiras e para outras finalidades. Uma delas é a visual. Sim, é verdade que todos meus posts no Twitter e no Facebook são muito similares a um blog pessoal: eles são organizados em ordem reverso-cronológica, em uma página específica, com endereços web diretos para cada post. Porém eu tenho pouco controle sobre a aparência; não posso personalizá-los muito. Minha página deve ter uma aparência uniforme, a qual designers da rede social já decidiram por mim. A centralização da informação também me preocupa porque faz com que seja mais fácil que as coisas desapareçam. Depois que fui preso, o serviço de hospedagem do meu blog fechou minha conta porque eu não conseguia pagar a mensalidade. Mas pelo menos eu tinha um backup de todos meus posts em um banco de dados em um servidor próprio. (A maioria das plataformas de blogs costumava permitir que você transferisse seus posts e arquivos para seu próprio servidor, enquanto hoje a maioria não permite). Mesmo que eu não tivesse esse backup, o site Internet Archive manteria uma cópia. Mas e se minha conta no Facebook ou no Twitter for fechada por qualquer razão? Esses serviços em si provavelmente não vão morrer em breve, mas não seria muito difícil imaginar um dia em que muitos serviços americanos fechassem contas de cidadão iranianos em consequência do regime atual do país. Se isso acontecesse, eu poderia fazer o download dos meus posts em alguns desses serviços, supondo também que esse backup pudesse ser facilmente importado pra outra plataforma. Mas e o endereço único do meu perfil nessas redes sociais? Será que eu poderia reivindicá-lo mais tarde, caso alguém tomasse posse daquele usuário? Os domínios de sites também mudam de mãos, mas o controle sobre esse procedimento é mais fácil e mais claro — especialmente porque há uma relação financeira entre você e o vendedor do domínio, o que faz com que ele esteja menos inclinado a tomar decisões repentinas e pouco transparentes. Mas o resultado mais assustador dessa centralização da informação na Era das Redes Sociais é que isso está diminuindo nosso poder frente ao governo e às corporações. A vigilância é cada vez mais imposta à sociedade civilizada, e isso só tender a piorar. A única maneira de ficar fora deste vasto aparato de vigilância seria entrar em uma caverna e dormir, mesmo que você não possa fazê-lo por 300 anos. Eventualmente, todos teremos que nos acostumar a sermos observados — e, infelizmente, isso não tem nada a ver com o país onde nós moramos. Ironicamente, os estados que cooperam com o Facebook e o Twitter sabem muito mais sobre seus cidadãos do que aqueles países, como o Irã, onde o estado estrangula a Internet mas não têm acesso legal às empresas de mídias sociais. É muito mais assustador ser controlado do que meramente observado. Quando o Facebook nos conhece melhor do que nossos pais com somente 150 curtidas, e melhor do que nossos companheiros com 300 curtidas, o mundo fica muito previsível, tanto para os governos quanto para as empresas. E previsibilidade significa controle. Os iranianos de classe média, como a maioria das pessoas no mundo, são obcecados por novas tendências. A utilidade ou qualidade real das coisas geralmente ficam em segundo plano. No início dos anos 2000, escrever blogs fazia de você moderno e descolado, em 2008 veio o Facebook e em seguida o Twitter. Desde 2014, o hype é o Instagram… e ninguém sabe o que mais vem por aí. Mas quanto mais eu penso sobre estas mudanças, mais eu percebo que todas as minhas preocupações talvez tenham sido mal direcionadas. Talvez eu esteja preocupado com a coisa errada. Talvez o problema não seja exatamente a morte do hyperlink ou a centralização. Talvez seja o próprio texto que esteja desaparecendo. Os primeiros visitantes da web passavam seu tempo online lendo revistas online. Aí então vieram os blogs, depois o Facebook e aí o Twitter. Agora, a maioria das pessoas passa seu tempo vendo vídeos do Facebook ou o Instagram ou o Snapchat. Há cada vez menos texto para ler em redes sociais e mais e mais vídeos para assistir, mais e mais imagens para ver. Será que estamos testemunhando um declínio da leitura em relação às coisas que são assistidas ou ouvidas? Será que essa tendência é consequência de uma mudança nos hábitos culturais das pessoas ou será que são as pessoas que estão seguindo as novas leis das redes sociais? Não sei — isso quem vai nos dizer são os pesquisadores — mas parece como se estivéssemos revivendo antigas guerras culturais. Afinal, a web começou mimetizando livros e, por muitos anos, foi extremamente dominada pelo texto e pelo hypertexto. Os sistemas de busca colocaram um valor enorme em cima dessas coisas, e empresas inteiras — monopólios inteiros — foram construídos em cima disso. Mas, conforme o número de scanners de imagem, fotos digitais e filmadoras foram crescendo exponencialmente, isso passou a mudar. As ferramentas da busca estão começando a adotar algoritmos avançados de reconhecimento de imagem; e a verba de publicidade está indo pra lá. Mas o “Stream”, os apps e as imagens em movimento nos mostram que está acontecendo uma mudança, da web-livro pra web-tv. Aparentemente nós fomos de um modo não-linear de comunicação — com nós, redes e links — para um linear, com centralização e hierarquias. A web não foi vislumbrada como um tipo de televisão quando foi inventada. Mas, goste você ou não, ela está se tornando cada vez mais, e rapidamente, similar à TV: linear, passiva, programada e auto-referente. Quando eu entro no Facebook, minha televisão pessoal começa. Tudo o que eu preciso fazer é rolar a tela: novas fotos de perfil de amigos, trechos curtos da opinião sobre assuntos atuais, links para notícias com uma explicação bem breve, anúncios publicitários e, naturalmente, vídeos que se reproduzem automaticamente. Vez ou outra, eu clico em curtir ou compartilhar, leio ou deixo um comentário, ou abro um artigo. Mas eu permaneço dentro do Facebook, e ele continua a mostrar o que eu poderia gostar de ver. Esta não é a web que eu conhecia quando fui preso. Este não é o futuro da web. Este futuro é a televisão. Às vezes penso que talvez eu esteja me tornando muito rigoroso conforme fico mais velho. Talvez isso tudo seja apenas a evolução natural de uma tecnologia. Mas não posso fechar meus olhos para o que está acontecendo: uma perda do poder e da diversidade intelectuais, e dos grandes potenciais que isso poderia ter nestes tempos estranhos de hoje. No passado, a web era poderosa e séria o bastante para me mandar para a prisão. Hoje parece que serve para nada mais do que entretenimento. Tanto que até mesmo o Irã não leva muito a sério algumas destas redes — como o Instagram, por exemplo — para chegar a bloqueá-lo. Sinto falta de quando as pessoas tinham tempo e se expunham a diferentes opiniões e se importavam em ler mais do que um parágrafo ou 140 caracteres. Sinto falta do tempo em que eu podia escrever algo no meu próprio blog, publicar no meu próprio domínio, sem ter que dedicar tempo igual para promovê-lo em várias redes sociais; um tempo em que ninguém ligava para curtidas e compartilhamentos. Essa é a web da qual me lembro antes prisão. Essa é a web que temos de salvar. Se você gostou do texto, clique no botão “Recommend” aí embaixo.Fazendo isso, você ajuda esse post a ser encontrado por mais pessoas. Pra ficar sabendo sempre que publicarmos algo aqui no youPIX,clique aqui e cadastre seu email na nossa Newsletter. Siga o youPIX:Newsletter - Twitter ─ Facebook ─ RSS ─ Youtube - Instagram O youPIX é parte do Virgula. ❤Acesse nossos arquivos aqui. ", "title": "A Web que temos", "sentences": [{"8378": "A Web que temosque salvar"}, {"1b3a": "A internet rica, diversa e livre que eu amava — e pela qual passei anos em uma prisão iraniana — está morrendo. Por que ninguém está fazendo nada pra impedir isso?"}, {"2796": "por Hossein DerakhshanIlustrações por Tim McDonaghTradução por Lara Freitas"}, {"fa69": "Sete meses atrás, sentei em uma pequena mesa na cozinha do meu apartamento dos anos 60, que fica no último andar de um edifício na movimentada área central de Teerã, e fiz algo que já fiz milhares de vezes antes. Abri meu laptop e postei no meu novo blog. Essa, no entanto, foi a primeira vez em seis anos. E isso quase partiu meu coração."}, {"a06f": "Algumas semanas antes, eu havia sido repentinamente perdoado e libertado da prisão de Evin, no norte de Teerã. Eu já esperava passar a maior parte da minha vida naquelas celas: em novembro de 2008, eu tinha sido sentenciado a quase 20 anos de cadeia, sobretudo por coisas que eu havia escrito no meu blog."}, {"498c": "Esse momento de liberdade, quando chegou, foi totalmente inesperado. Fumei um cigarro na cozinha com um dos meus colegas presos e voltei à cela que eu dividia com 12 outros homens. Estávamos também dividindo uma xícara de chá quando o anúncio de uma voz — de outro prisioneiro — encheu as celas e corredores. Em seu tom suave, ele anunciou em persa: “Caros colegas presos, a sorte pousou mais uma vez sobre um companheiro. Sr. Hossein Derakhshan, a partir deste momento você está livre”."}, {"7a4c": "Naquela tarde, pela primeira vez, passei por aquelas portas como um homem livre. Tudo parecia novo: a brisa do outono, o barulho do tráfego da ponte, o cheiro e as cores da cidade em que vivi a maior parte da minha vida."}, {"8a1c": "Em torno de mim, percebi uma Teerã muito diferente da que eu estava acostumado. Um influxo descarado de novos condomínios luxuosos havia substituído as charmosas casinhas com as quais eu já estava familiarizado. Novas estradas, novas rodovias, uma invasão de SUVs. Outdoors gigantes com propagandas de relógios suíços e TVs coreanas de tela plana. Mulheres com cachecóis e casacos coloridos, homens com cabelos e barbas tingidos e centenas de cafés interessantes com música ocidental moderna e funcionárias mulheres. Os tipos de mudanças que assustavam as pessoas; o tipo de mudança que você só percebe quando a rotina de uma vida normal é tirada de você."}, {"201b": "Duas semanas depois comecei a escrever outra vez. Alguns amigos concordaram em deixar que eu começasse um blog em uma revista de artes que eles tinham. O blog chamava Ketabkhan — que significa “leitor de livro” em persa."}, {"5399": "Seis anos é muito tempo na cadeia, mas corresponde a uma era inteira na internet. Escrever na web, em si, não havia mudado, mas a leitura — ou, ao menos, como ler as coisas — é muito diferente. Já haviam me dito que as redes sociais tinham se tornado essenciais enquanto eu estava preso, então entendi que se eu quisesse atrair as pessoas para o que eu estava escrevendo hoje, tinha que usá-las."}, {"ca93": "Assim, tentei postar um link de uma das minhas histórias no Facebook. Mas meus amigos do Facebook não deram a mínima. Ficou parecendo um anúncio de classificado sem graça. Nenhuma descrição. Nenhuma imagem. Nada. Consegui três curtidas. Três! E nada mais."}, {"542a": "Naquele momento, ficou claro pra mim que as coisas haviam mesmo mudado. Eu não estava preparado para atuar neste novo campo — todos os meus investimentos e esforços haviam sido reduzidos a cinzas. Fiquei arrasado."}, {"0e09": "B"}, {"9759": "logs eram ouro e blogueiros eram rock stars em 2008, quando fui preso. Naquele momento, apesar de meu blog estar bloqueado para acessos dentro de todo o Irã, eu tinha uma audiência de 20.000 visitantes diários. Qualquer outro site que eu lincasse no meu blog veria um aumento repentino de tráfego, eu tinha poder para dar moral ou detonar com quem eu quisesse."}, {"7565": "As pessoas costumavam ler meus posts cuidadosamente e deixar vários comentários relevantes, e até mesmo aqueles que discordavam de mim voltavam sempre para me ler. Outros blogs lincavam meus posts pra discutir o que eu dizia. Eu me sentia como um rei."}, {"2a47": "O iPhone tinha sido lançado há pouco mais de um ano naquela época, mas os smartphones ainda eram usados basicamente pra fazer chamadas telefônicas e enviar mensagens de texto, ler emails e acessar a internet. Não existiam muitos apps, pelo menos não como eles são hoje. Não tinha Instagram, Snapchat, Viber ou WhatsApp."}, {"960c": "Em vez disso, existia só a web e, na web, havia blogs: o melhor lugar pra encontrar pensamentos alternativos, notícias e análises. Eles eram a minha vida."}, {"edbc": "Tudo começou com o 9/11. Eu estava em Toronto, e meu pai tinha acabado de chegar de Teerã para uma visita. Estávamos tomando café da manhã quando o segundo avião atingiu o World Trade Center. Eu estava perplexo e confuso e à procura de idéias e explicações quando me deparei com os blogs. Depois de ler alguns deles, eu pensei “é isso, eu preciso começar um blog, e incentivar todos os iranianos a blogarem também”. Assim, usando o bloco de notas do Windows, comecei a experimentar. Em seguida, passei a escrever no Hoder.com, usando o Blogger como plataforma de publicação — antes do Google comprá-lo."}, {"dbdb": "Em seguida, no dia 5 de novembro de 2001, eu publiquei um guia passo-a-passo sobre como começar um blog. Isso deflagrou algo que mais tarde foi chamado de “Revolução dos Blogs”: em pouco tempo, centenas de milhares de iranianos fizeram do Irã um dos cinco maiores países em número de blogs, e eu estava orgulhoso de ter tido um papel nessa democratização sem precedentes da escrita."}, {"442d": "Naquela época, eu costumava manter uma lista com todos os blogs em persa e, por um certo tempo, eu era a primeira pessoa com quem todo novo blogueiro do Irã falaria para que pudesse entrar nessa lista. É por isso que quando eu tinha pouco mais de vinte anos eles me chamavam de “The Blogfather” (em alusão a “The Godfather”) — era um apelido bobo, mas dava uma ideia do quanto eu era importante."}, {"53ea": "Toda manhã, no meu pequeno apartamento no centro de Toronto, eu abria meu computador e cuidava de blogs novos, ajudando para que ganhassem exposição e audiência. O público era diversificado — desde autores e jornalistas exilados, cronistas e peritos em tecnologia até jornalistas locais, políticos, padres e veteranos de guerra — e eu sempre os incentivei ainda mais. Convidei mais homens e mulheres religiosos e pro-República Islâmica, pessoas que viveram no Irã, para começar a escrever."}, {"3555": "O alcance daquilo que publicávamos naquela época deixou todos impressionados. E, em parte, foi por isso que eu incentivei blogs com veemência. Deixei o Irã no final dos anos 2000 para experimentar a vida no Ocidente, e temi perder todas as tendências que rapidamente emergiam em casa. Mas ler blogs iranianos em Toronto foi a experiência mais próxima que eu poderia ter de dividir um táxi em Teerã e escutar conversas coletivas entre o motorista falante e os passageiros aleatórios."}, {"f92d": "H"}, {"46ab": "em uma história no Alcorão sobre a qual eu pensava muito durante meus primeiros oito meses na solitária. Nessa história, um grupo de cristãos perseguidos encontra refúgio em uma caverna. Eles, e um cão que os acompanhava, dormem profundamente, e quando acordam têm a impressão de que haviam apenas tirado um cochilo. Na verdade, havia se passado 300 anos. Uma versão da história conta sobre como um deles sai para comprar alimentos — e imagino como eles deveriam estar famintos depois de 300 anos — e descobre que seu dinheiro agora não vale mais nada, é um item de museu. É quando ele realmente percebe quanto tempo ficaram ausentes."}, {"47bb": "Há seis anos, o hyperlink era a minha moeda. Decorrente da ideia do hypertexto, o hyperlink oferecia uma diversidade e uma descentralização que o mundo real não tinha. O hyperlink representava o espírito aberto, interconectado da World Wide Web — uma visão que começou com seu inventor, Tim Berners-Lee. Era uma maneira de abandonar a centralização — todos os links, linhas e hierarquias — e substituí-la por algo mais distribuído, um sistema de nós e redes."}, {"c9d4": "Os blogs deram forma a esse espírito de descentralização: eles eram janelas para vidas que você raramente conheceria de perto; pontes que conectavam vidas diferentes umas às outras e, assim, as mudava. Os blogs eram cafés onde as pessoas trocavam ideias diversas sobre todo e qualquer assunto que você pudesse se interessar. Eles eram os táxis de Teerã em grande escala."}, {"dab5": "Desde que saí da prisão, porém, eu percebi o quanto o hyperlink se desvalorizou, tornando-se quase obsoleto."}, {"0697": "Quase toda rede social hoje trata um link como qualquer outro objeto — uma foto ou um pedaço de texto — em vez de tratá-lo como uma maneira de tornar esse texto mais rico. Você é incentivado a postar um único hyperlink e expor este hyperlink a um processo quasi-democrático de curtidas, coraçõezinhos e afins: adicionar diversos links a um trecho de texto geralmente não é permitido. Os hyperlinks são objetivados, isolados, destituídos de seus poderes."}, {"7805": "Ao mesmo tempo, estas redes sociais tendem a tratar o texto e as fotos nativos — coisas que são postadas diretamente neles — com muito mais respeito do que as coisas que estão em sites externos. Um amigo fotógrafo explicou como as imagens que ele postava diretamente no Facebook recebiam um grande número curtidas, o que por sua vez significava que elas apareciam mais nos feeds das pessoas. Por outro lado, quando ele posta um link para as mesmas fotos fora do Facebook — como por exemplo, no seu blog cada vez mais empoeirado — as imagens ficam muito menos visíveis para o próprio Facebook e, consequentemente ganham cada vez menos curtidas. O ciclo se reforça."}, {"03d7": "Algumas redes, como o Twitter, tratam os hyperlinks um pouco melhor. Outras redes são muito mais paranóicas. O Instagram — que pertence ao Facebook — não permite que sua audiência publique nenhum link. Você pode publicar um endereço de localização junto com suas fotos, mas ele não te levará a lugar algum. Muitas pessoas começam suas rotinas digitais diárias nestas redes sociais que são como becos sem saída, e suas jornadas terminam aí. Muitos não têm nem noção de que estão usando a infraestrutura da internet quando curtem uma foto no Instagram ou deixam um comentário em um vídeo do Facebook. É apenas um app, não é mesmo?"}, {"b090": "Mas os hyperlinks não são somente o esqueleto da web: eles são seus olhos, um caminho para sua alma. E uma página web cega, sem hyperlinks, não consegue ver ou observar outra página — e isso têm sérias consequências para a dinâmica de poder na web."}, {"55b3": "De certa forma, todos os teóricos já pensaram sobre a relação entre observação x poder, e em geral em um sentido negativo: o observador desnuda o observado e o transforma em um objeto sem poder, desprovido de inteligência ou ação. Mas no mundo das páginas web, a observação funciona de maneira diferente: ela dá mais poder. Quando um website poderoso — digamos o Google ou o Facebook — observa, ou linca outro site, eles não apenas se conectam — isso faz com que eles EXISTAM; dá vida a eles. Metaforicamente, sem esta observação poderosa, sua página web não respira. Não importa quantos links você coloque em um site, a menos que alguém esteja observando, eles estão mortos e cegos; e, consequentemente, incapazes de transferir poder para qualquer página externa."}, {"9ebd": "Por outro lado, as páginas mais poderosas são aquelas que são muito observadas. Assim como celebridades que atraem um certo tipo de poder através dos milhões de olhares humanos que as observam em determinado momento, as páginas conseguem captar e distribuir seu poder através dos hyperlinks."}, {"fac9": "Mas apps como o Instagram são cegos — ou quase cegos. A observação destes apps não chega a lugar algum exceto a eles mesmos, relutantes em transferir parte do seu vasto poder a outros, conduzindo-os a uma morte silenciosa. A consequência é que as páginas fora das mídias sociais estão morrendo."}, {"e409": "M"}, {"fd31": "ntretanto, mesmo antes de eu ir para a prisão, o poder dos hyperlinks já estava sendo refreado. O principal inimigo era uma filosofia que combinava dois dos valores mais dominantes e supervalorizados da nossa época: novidade e popularidade, consequência da dominação de jovens celebridades no mundo real. Essa filosofia é o “Stream”."}, {"6311": "O “Stream” hoje domina a maneira como as pessoas recebem a informação na web. Poucos usuários estão acessando sites diretamente, em vez disso, eles estão sendo abastecidos por um fluxo interminável de informações que é escolhido para eles por algoritmos complexos e secretos."}, {"f944": "O Stream significa que você não precisa mais abrir tantos sites. Você não precisa de tantas abas. Você não precisa sequer de um navegador. Basta abrir o Twitter ou o Facebook no seu smartphone e se jogar. A montanha veio até você. Os algoritmos já escolheram tudo para você. De acordo com o que você ou seus amigos leram ou viram anteriormente, os algoritmos preveem o que você poderia gostar de ver. É muito bom não precisar perder tempo procurando coisas interessantes em tantos sites."}, {"4d36": "No entanto, estaríamos perdendo algo aqui nessa relação? O que estamos dando em troca da eficiência?"}, {"c9ec": "Em muitos apps, os votos que conseguimos — curtidas, estrelas, corações e afins — estão na verdade mais relacionados a avatares bonitos e status de celebridades do que ao conteúdo que é postado. Um parágrafo brilhante postado por uma pessoa de aparência comum pode ser deixado de fora do “Stream”, enquanto as divagações idiotas de uma celebridade ganham uma presença imediata na web."}, {"69e7": "E não só os algoritmos por trás do “Stream” igualam novidade e popularidade à relevância, mas também tendem a mostrar mais sobre o que já curtimos. Estes serviços fazem uma varredura cuidadosa do nosso comportamento e montam delicadamente nossos feeds de notícias com posts, fotos e vídeos que eles acreditam que gostaríamos de ver."}, {"d0b7": "A popularidade, em si, não é algo errado, mas traz riscos. Em uma economia de livre-mercado, bens de baixa qualidade com preços errados levam ao fracasso. Ninguém fica chateado quando um discreto café do Brooklyn com capuccinos ruins e funcionários grosseiros fecha. Mas as opiniões não são as mesmas para bens materiais ou serviços. Eles não vão desaparecer se não forem populares ou ruins. Na verdade, a história provou que a maioria das grandes ideias (e muitas das ideias ruins) não eram muito populares durante muito tempo e esse status marginal apenas as fortaleceu. As opiniões minoritárias são radicalizadas quando não podem ser expressas e reconhecidas."}, {"749b": "Hoje, o “Stream” é forma dominante de organização de informações na mídia digital. Funciona assim em toda rede social e aplicativo móvel. Desde que ganhei minha liberdade, para toda parte que olho vejo o “Stream”. Acredito que não levará muito tempo até que vejamos sites de notícias organizando todo seu conteúdo baseado nos mesmos princípios. A relevância do “Stream” não apenas constrói imensos blocos tendenciosos na Internet contra a qualidade — mas também significa uma profunda traição da diversidade que a World Wide Web originalmente vislumbrou."}, {"8b01": "Pra mim, não há dúvidas de que a diversidade de temas e opiniões está menos representada hoje do que já esteve no passado. Ideias novas, diferentes e desafiadoras começam a ser suprimidas pelas redes sociais de porque suas estratégias de ranking dão prioridade ao popular e habitual. (Não me admira que a Apple esteja contratando editores humanos para seu app de notícias.) Mas a diversidade está sendo reduzida de outras maneiras e para outras finalidades."}, {"8cd9": "Uma delas é a visual. Sim, é verdade que todos meus posts no Twitter e no Facebook são muito similares a um blog pessoal: eles são organizados em ordem reverso-cronológica, em uma página específica, com endereços web diretos para cada post. Porém eu tenho pouco controle sobre a aparência; não posso personalizá-los muito. Minha página deve ter uma aparência uniforme, a qual designers da rede social já decidiram por mim."}, {"0a76": "A centralização da informação também me preocupa porque faz com que seja mais fácil que as coisas desapareçam. Depois que fui preso, o serviço de hospedagem do meu blog fechou minha conta porque eu não conseguia pagar a mensalidade. Mas pelo menos eu tinha um backup de todos meus posts em um banco de dados em um servidor próprio. (A maioria das plataformas de blogs costumava permitir que você transferisse seus posts e arquivos para seu próprio servidor, enquanto hoje a maioria não permite). Mesmo que eu não tivesse esse backup, o site Internet Archive manteria uma cópia."}, {"d7af": "Mas e se minha conta no Facebook ou no Twitter for fechada por qualquer razão? Esses serviços em si provavelmente não vão morrer em breve, mas não seria muito difícil imaginar um dia em que muitos serviços americanos fechassem contas de cidadão iranianos em consequência do regime atual do país. Se isso acontecesse, eu poderia fazer o download dos meus posts em alguns desses serviços, supondo também que esse backup pudesse ser facilmente importado pra outra plataforma. Mas e o endereço único do meu perfil nessas redes sociais? Será que eu poderia reivindicá-lo mais tarde, caso alguém tomasse posse daquele usuário? Os domínios de sites também mudam de mãos, mas o controle sobre esse procedimento é mais fácil e mais claro — especialmente porque há uma relação financeira entre você e o vendedor do domínio, o que faz com que ele esteja menos inclinado a tomar decisões repentinas e pouco transparentes."}, {"e973": "Mas o resultado mais assustador dessa centralização da informação na Era das Redes Sociais é que isso está diminuindo nosso poder frente ao governo e às corporações."}, {"0ab8": "A vigilância é cada vez mais imposta à sociedade civilizada, e isso só tender a piorar. A única maneira de ficar fora deste vasto aparato de vigilância seria entrar em uma caverna e dormir, mesmo que você não possa fazê-lo por 300 anos."}, {"2b4a": "Eventualmente, todos teremos que nos acostumar a sermos observados — e, infelizmente, isso não tem nada a ver com o país onde nós moramos. Ironicamente, os estados que cooperam com o Facebook e o Twitter sabem muito mais sobre seus cidadãos do que aqueles países, como o Irã, onde o estado estrangula a Internet mas não têm acesso legal às empresas de mídias sociais."}, {"d8bf": "É muito mais assustador ser controlado do que meramente observado. Quando o Facebook nos conhece melhor do que nossos pais com somente 150 curtidas, e melhor do que nossos companheiros com 300 curtidas, o mundo fica muito previsível, tanto para os governos quanto para as empresas. E previsibilidade significa controle."}, {"67fa": "Os iranianos de classe média, como a maioria das pessoas no mundo, são obcecados por novas tendências. A utilidade ou qualidade real das coisas geralmente ficam em segundo plano. No início dos anos 2000, escrever blogs fazia de você moderno e descolado, em 2008 veio o Facebook e em seguida o Twitter. Desde 2014, o hype é o Instagram… e ninguém sabe o que mais vem por aí. Mas quanto mais eu penso sobre estas mudanças, mais eu percebo que todas as minhas preocupações talvez tenham sido mal direcionadas. Talvez eu esteja preocupado com a coisa errada. Talvez o problema não seja exatamente a morte do hyperlink ou a centralização."}, {"91fc": "Talvez seja o próprio texto que esteja desaparecendo."}, {"ec31": "Os primeiros visitantes da web passavam seu tempo online lendo revistas online. Aí então vieram os blogs, depois o Facebook e aí o Twitter. Agora, a maioria das pessoas passa seu tempo vendo vídeos do Facebook ou o Instagram ou o Snapchat. Há cada vez menos texto para ler em redes sociais e mais e mais vídeos para assistir, mais e mais imagens para ver. Será que estamos testemunhando um declínio da leitura em relação às coisas que são assistidas ou ouvidas?"}, {"450d": "Será que essa tendência é consequência de uma mudança nos hábitos culturais das pessoas ou será que são as pessoas que estão seguindo as novas leis das redes sociais?"}, {"add7": "Não sei — isso quem vai nos dizer são os pesquisadores — mas parece como se estivéssemos revivendo antigas guerras culturais. Afinal, a web começou mimetizando livros e, por muitos anos, foi extremamente dominada pelo texto e pelo hypertexto. Os sistemas de busca colocaram um valor enorme em cima dessas coisas, e empresas inteiras — monopólios inteiros — foram construídos em cima disso. Mas, conforme o número de scanners de imagem, fotos digitais e filmadoras foram crescendo exponencialmente, isso passou a mudar. As ferramentas da busca estão começando a adotar algoritmos avançados de reconhecimento de imagem; e a verba de publicidade está indo pra lá."}, {"cbd5": "Mas o “Stream”, os apps e as imagens em movimento nos mostram que está acontecendo uma mudança, da web-livro pra web-tv. Aparentemente nós fomos de um modo não-linear de comunicação — com nós, redes e links — para um linear, com centralização e hierarquias."}, {"a7fd": "A web não foi vislumbrada como um tipo de televisão quando foi inventada. Mas, goste você ou não, ela está se tornando cada vez mais, e rapidamente, similar à TV: linear, passiva, programada e auto-referente."}, {"3047": "Quando eu entro no Facebook, minha televisão pessoal começa. Tudo o que eu preciso fazer é rolar a tela: novas fotos de perfil de amigos, trechos curtos da opinião sobre assuntos atuais, links para notícias com uma explicação bem breve, anúncios publicitários e, naturalmente, vídeos que se reproduzem automaticamente. Vez ou outra, eu clico em curtir ou compartilhar, leio ou deixo um comentário, ou abro um artigo. Mas eu permaneço dentro do Facebook, e ele continua a mostrar o que eu poderia gostar de ver. Esta não é a web que eu conhecia quando fui preso. Este não é o futuro da web. Este futuro é a televisão."}, {"f515": "Às vezes penso que talvez eu esteja me tornando muito rigoroso conforme fico mais velho. Talvez isso tudo seja apenas a evolução natural de uma tecnologia. Mas não posso fechar meus olhos para o que está acontecendo: uma perda do poder e da diversidade intelectuais, e dos grandes potenciais que isso poderia ter nestes tempos estranhos de hoje."}, {"a5a3": "No passado, a web era poderosa e séria o bastante para me mandar para a prisão. Hoje parece que serve para nada mais do que entretenimento."}, {"978e": "Tanto que até mesmo o Irã não leva muito a sério algumas destas redes — como o Instagram, por exemplo — para chegar a bloqueá-lo."}, {"b2eb": "Sinto falta de quando as pessoas tinham tempo e se expunham a diferentes opiniões e se importavam em ler mais do que um parágrafo ou 140 caracteres. Sinto falta do tempo em que eu podia escrever algo no meu próprio blog, publicar no meu próprio domínio, sem ter que dedicar tempo igual para promovê-lo em várias redes sociais; um tempo em que ninguém ligava para curtidas e compartilhamentos."}, {"1935": "Essa é a web da qual me lembro antes prisão."}, {"d77c": "Essa é a web que temos de salvar."}, {"0e82": "Se você gostou do texto, clique no botão “Recommend” aí embaixo.Fazendo isso, você ajuda esse post a ser encontrado por mais pessoas."}, {"a26f": "Pra ficar sabendo sempre que publicarmos algo aqui no youPIX,clique aqui e cadastre seu email na nossa Newsletter."}, {"4b2e": "Siga o youPIX:Newsletter - Twitter ─ Facebook ─ RSS ─ Youtube - Instagram"}, {"eef7": "O youPIX é parte do Virgula. ❤Acesse nossos arquivos aqui."}], "child": "1004_1\t1004_2\t1004_3\t1004_4\t1004_5\t1004_6\t1004_7\t1004_8\t1004_9\t1004_10\t1004_11\t1004_121004_1\t1004_2\t1004_3\t1004_4\t1004_5\t1004_6\t1004_7\t1004_8\t1004_9\t1004_10\t1004_11\t1004_121004_1\t1004_2\t1004_3\t1004_4\t1004_5\t1004_6\t1004_7\t1004_8\t1004_9\t1004_10\t1004_11\t1004_121004_1\t1004_2\t1004_3\t1004_4\t1004_5\t1004_6\t1004_7\t1004_8\t1004_9\t1004_10\t1004_11\t1004_121004_1\t1004_2\t1004_3\t1004_4\t1004_5\t1004_6\t1004_7\t1004_8\t1004_9\t1004_10\t1004_11\t1004_12"}