{"name": "1007", "parent": "", "content": "How I introduced design thinking at my company When someone says they’re a designer, the image of a very creative person with superior drawing skills comes to mind. In actuality, designers can take many different shapes and forms, but they all have a very similar mindset in how they craft and formulate ideas. This foundation is called design thinking. A designer at work. Supposedly. When I was a product manager at my previous company, I would receive a lot of product feedback from our client-facing teams. Though I was grateful for the amount of feedback we received, oftentimes the request or comments from customers were vague and I would have to ask multiple follow-up questions before I could even consider the feedback. This added a lot of extra email chains and chatter that I felt was taking time away from other issues. I realized that what I needed was to instill a designer mindset in these client-facing teams. If they were able to curate and collect the same level of information that I would, then the number of back and forth messages would be reduced. I needed to teach them design thinking. What is design thinking? Design is intentional. Design is present and embedded in the world around us, from the buildings that we live in, the cars we drive, and the chairs that we sit on. Design thinking is used in each and every one of these examples. At a high level, design thinking is a problem solving process with four distinct elements: You can read a more thorough explanation in this great article from Fast Company. “Product Improv” (the design workshop) I decided to develop a workshop to promote design thinking, and worked with our product designers to come up with the agenda. We decided to call it “product improv” to make it feel like a light, casual and informal workshop. We also figured that an interactive workshop would have the greatest impact. Rather than us talking about design thinking, participants could apply it to an actual problem that we assigned to them. We split the workshop into several parts, each one building upon each other. Build your toolbox I started by referencing something I learned in architecture school. I had watched a video by IDEO, a design consultancy, that had a huge impact on how I approached problem solving. In this video, it walks through how IDEO redesigned the shopping cart, showcasing every step of their design process. This video set the stage for the rest of our workshop. By showing the end to end process of designing, our participants got a taste of what they would be doing. Identify users and needs Since this was our first workshop, we wanted it to leave a strong and meaningful impression on our colleagues. We decided that we would present an actual feature we were working on, and have them apply the design thinking process to it. Our company builds software for health insurance, and one of our products enabled employees to shop for insurance plans online. We wanted to redesign the “compare products” feature in our software. This part of our product had been untouched for a while and we felt that there was room for improvement, especially given the complexity of insurance plans and the variety of different plans our users had to choose from. We identified the users for this feature, and listed out some primary issues. We told our participants that they would be in charge of redesigning this feature. Assemble the team At the time, our company was not very large (less than 60 people) but there were still silos between the different departments. As part of the workshop, we wanted to promote strong relationships and cross-departmental collaboration. We asked everyone to get into groups of 3–5 people, but the rule was that they had to have at least two departments on a team. We also encouraged them to team up with people they don’t normally work with. Once the teams were assembled, we were ready to begin. Brainstorm Each team was given markers and post-it notes, and told to brainstorm as many ideas as possible in five minutes. Each person would write down their own ideas and post it on a wall. We stressed that there were no bad ideas, and at this stage we wanted quantity over quality. This was arguably the most difficult part of the workshop. Most people possess filters for their mind that stops them from sharing untested or new ideas. We coached everyone to just write anything that came to mind, regardless of whether they thought it made sense. We assured them that no ideas would be judged. Refine and iterate After the initial brainstorm, each team was asked to review all their ideas and mark the ones that showed promise. Then they were asked to discuss the highest rated ideas and add to it. Similar to improv, the exercise encouraged people to build upon each other’s ideas. “Yes and…” instead of “but”. This technique allows people to see ideas from other perspectives before considering viability. After the initial discussion, the teams chose one idea that they felt was the strongest. This would be the solution they take to the next step. Prototype Execution is everything. We wanted people to not just apply design thinking to ideas, but also understand what it takes to take an idea to execution. Many people might take product feedback and “throw it over the wall” to the product team and expect magic in return. We wanted them to empathize with the end to end process, so they would know how great ideas are processed and realized. Here is where they got to experience that first hand. Each team, with their chosen idea, was asked to develop a prototype. This scared many people. “I can’t draw” or “I’m not a designer” were common concerns at this stage. We showed them that prototypes didn’t need to be highly detailed for it to be effective. In fact, most designers start with low fidelity prototypes before moving on to the finished designs that most people see. We encouraged them to tell the story of their idea on paper, without having to think of layouts, menus, buttons. After the initial hesitation, teams put pen to paper and started sketching their prototype. Some teams designed a web page and illustrated where columns and text would be. Others drew bubble diagrams that showed how the user progresses through their journey. Each one was effective in their own way. Each approach told a story. Result When I started developing the workshop, I had the goal of providing our colleagues with a set of tools that would help them apply design thinking to their discussions with clients. After the workshop, I found that people really enjoyed being part of the design process, and working with colleagues from other departments. By applying design thinking to an actual product feature, people felt more engaged in the product development process and empathized with the product team. Without them realizing it, they had become designers. Design is for everybody. Design is not just pretty things and beautiful apps. It’s a set of processes to assess a problem and methodically find ways to solve them. If every organization helped their people think and talk like a designer, it would go a long way towards finding the right problems and creating the right solutions. ", "title": "How I introduced design thinking at my company", "sentences": [{"8c42": "How I introduced design thinking at my company"}, {"4964": "When someone says they’re a designer, the image of a very creative person with superior drawing skills comes to mind. In actuality, designers can take many different shapes and forms, but they all have a very similar mindset in how they craft and formulate ideas. This foundation is called design thinking."}, {"b9af": "A designer at work. Supposedly."}, {"ade0": "When I was a product manager at my previous company, I would receive a lot of product feedback from our client-facing teams. Though I was grateful for the amount of feedback we received, oftentimes the request or comments from customers were vague and I would have to ask multiple follow-up questions before I could even consider the feedback. This added a lot of extra email chains and chatter that I felt was taking time away from other issues."}, {"26df": "I realized that what I needed was to instill a designer mindset in these client-facing teams. If they were able to curate and collect the same level of information that I would, then the number of back and forth messages would be reduced. I needed to teach them design thinking."}, {"e707": "What is design thinking?"}, {"7599": "Design is intentional."}, {"014f": "Design is present and embedded in the world around us, from the buildings that we live in, the cars we drive, and the chairs that we sit on. Design thinking is used in each and every one of these examples."}, {"4a82": "At a high level, design thinking is a problem solving process with four distinct elements:"}, {"7a58": "You can read a more thorough explanation in this great article from Fast Company."}, {"cf84": "“Product Improv” (the design workshop)"}, {"f468": "I decided to develop a workshop to promote design thinking, and worked with our product designers to come up with the agenda. We decided to call it “product improv” to make it feel like a light, casual and informal workshop. We also figured that an interactive workshop would have the greatest impact. Rather than us talking about design thinking, participants could apply it to an actual problem that we assigned to them. We split the workshop into several parts, each one building upon each other."}, {"76d8": "Build your toolbox"}, {"379f": "I started by referencing something I learned in architecture school. I had watched a video by IDEO, a design consultancy, that had a huge impact on how I approached problem solving. In this video, it walks through how IDEO redesigned the shopping cart, showcasing every step of their design process."}, {"9739": "This video set the stage for the rest of our workshop. By showing the end to end process of designing, our participants got a taste of what they would be doing."}, {"c75d": "Identify users and needs"}, {"303b": "Since this was our first workshop, we wanted it to leave a strong and meaningful impression on our colleagues. We decided that we would present an actual feature we were working on, and have them apply the design thinking process to it."}, {"0c1e": "Our company builds software for health insurance, and one of our products enabled employees to shop for insurance plans online. We wanted to redesign the “compare products” feature in our software. This part of our product had been untouched for a while and we felt that there was room for improvement, especially given the complexity of insurance plans and the variety of different plans our users had to choose from."}, {"eb60": "We identified the users for this feature, and listed out some primary issues. We told our participants that they would be in charge of redesigning this feature."}, {"8ba9": "Assemble the team"}, {"84ff": "At the time, our company was not very large (less than 60 people) but there were still silos between the different departments. As part of the workshop, we wanted to promote strong relationships and cross-departmental collaboration."}, {"d382": "We asked everyone to get into groups of 3–5 people, but the rule was that they had to have at least two departments on a team. We also encouraged them to team up with people they don’t normally work with. Once the teams were assembled, we were ready to begin."}, {"24c9": "Brainstorm"}, {"beff": "Each team was given markers and post-it notes, and told to brainstorm as many ideas as possible in five minutes. Each person would write down their own ideas and post it on a wall. We stressed that there were no bad ideas, and at this stage we wanted quantity over quality."}, {"0448": "This was arguably the most difficult part of the workshop. Most people possess filters for their mind that stops them from sharing untested or new ideas. We coached everyone to just write anything that came to mind, regardless of whether they thought it made sense. We assured them that no ideas would be judged."}, {"6199": "Refine and iterate"}, {"d28f": "After the initial brainstorm, each team was asked to review all their ideas and mark the ones that showed promise. Then they were asked to discuss the highest rated ideas and add to it."}, {"9ef3": "Similar to improv, the exercise encouraged people to build upon each other’s ideas. “Yes and…” instead of “but”. This technique allows people to see ideas from other perspectives before considering viability."}, {"ec69": "After the initial discussion, the teams chose one idea that they felt was the strongest. This would be the solution they take to the next step."}, {"aa27": "Prototype"}, {"a001": "Execution is everything."}, {"fbd3": "We wanted people to not just apply design thinking to ideas, but also understand what it takes to take an idea to execution. Many people might take product feedback and “throw it over the wall” to the product team and expect magic in return. We wanted them to empathize with the end to end process, so they would know how great ideas are processed and realized. Here is where they got to experience that first hand."}, {"ea45": "Each team, with their chosen idea, was asked to develop a prototype. This scared many people. “I can’t draw” or “I’m not a designer” were common concerns at this stage. We showed them that prototypes didn’t need to be highly detailed for it to be effective. In fact, most designers start with low fidelity prototypes before moving on to the finished designs that most people see. We encouraged them to tell the story of their idea on paper, without having to think of layouts, menus, buttons."}, {"f42b": "After the initial hesitation, teams put pen to paper and started sketching their prototype. Some teams designed a web page and illustrated where columns and text would be. Others drew bubble diagrams that showed how the user progresses through their journey. Each one was effective in their own way. Each approach told a story."}, {"594d": "Result"}, {"5654": "When I started developing the workshop, I had the goal of providing our colleagues with a set of tools that would help them apply design thinking to their discussions with clients."}, {"74c5": "After the workshop, I found that people really enjoyed being part of the design process, and working with colleagues from other departments. By applying design thinking to an actual product feature, people felt more engaged in the product development process and empathized with the product team. Without them realizing it, they had become designers."}, {"a3ad": "Design is for everybody. Design is not just pretty things and beautiful apps. It’s a set of processes to assess a problem and methodically find ways to solve them. If every organization helped their people think and talk like a designer, it would go a long way towards finding the right problems and creating the right solutions."}], "child": "1007_1"}