{"name": "1008", "parent": "", "content": "How a Simple Routine Improved My life As a designer, we’re often tasked with deliverables that can be tough to complete. External forces such as client requirements and timelines can often increase difficulty. With proper management, we can ensure there’s enough time to complete our tasks. I use Evernote to create to-do lists for work and different aspects of my life. This routine helps me stay accountable, organized, and creates a sense of purpose for each day. I understood the power of to-do lists after reading Eat That Frog by author Brian Tracy. The premise of his book is based on the Law of Forced Efficiency which states, “There is never enough time to do everything, but there is always enough time to do the most important thing.” Your job is to identify those key tasks where you can spend 20% of your time for 80% of returns as stated by the Pareto Principle. “There is never enough time to do everything, but there is always enough time to do the most important thing.” The book discusses an old saying that, if you eat a live frog first thing in the morning, you’ll have the satisfaction of knowing that it’s the worst thing you will have to do all day. By using this metaphor and prioritizing your tasks, you can complete the most impactful and difficult ones first. Then anything you do after will be much easier. Here are some tips to help you get started: The lesson I’ve learned from applying these principles is that time management is a means to an end. By being consistent in planning my days in advance, I can spend my time at work, working. There is never a moment where I don’t know what to do next. Planning helps me stay proactive and allows me to get more done. Now when I leave work, I don’t feel guilty for going home and spending time with the people that matter to me. Keep in mind, what works for me, may not for you. Experiment until you find something that helps you become more productive. TL;DR ", "title": "How a Simple Routine Improved My life", "sentences": [{"5b51": "How a Simple Routine Improved My life"}, {"d81e": "As a designer, we’re often tasked with deliverables that can be tough to complete. External forces such as client requirements and timelines can often increase difficulty. With proper management, we can ensure there’s enough time to complete our tasks. I use Evernote to create to-do lists for work and different aspects of my life. This routine helps me stay accountable, organized, and creates a sense of purpose for each day."}, {"b02d": "I understood the power of to-do lists after reading Eat That Frog by author Brian Tracy. The premise of his book is based on the Law of Forced Efficiency which states, “There is never enough time to do everything, but there is always enough time to do the most important thing.” Your job is to identify those key tasks where you can spend 20% of your time for 80% of returns as stated by the Pareto Principle."}, {"e70f": "“There is never enough time to do everything, but there is always enough time to do the most important thing.”"}, {"7bac": "The book discusses an old saying that, if you eat a live frog first thing in the morning, you’ll have the satisfaction of knowing that it’s the worst thing you will have to do all day. By using this metaphor and prioritizing your tasks, you can complete the most impactful and difficult ones first. Then anything you do after will be much easier."}, {"4122": "Here are some tips to help you get started:"}, {"54d2": "The lesson I’ve learned from applying these principles is that time management is a means to an end. By being consistent in planning my days in advance, I can spend my time at work, working. There is never a moment where I don’t know what to do next. Planning helps me stay proactive and allows me to get more done. Now when I leave work, I don’t feel guilty for going home and spending time with the people that matter to me."}, {"97b8": "Keep in mind, what works for me, may not for you. Experiment until you find something that helps you become more productive."}, {"f52c": "TL;DR"}], "child": "1008_1\t1008_2\t1008_3\t1008_41008_1\t1008_2\t1008_3\t1008_41008_1\t1008_2\t1008_3\t1008_41008_1\t1008_2\t1008_3\t1008_41008_1\t1008_2\t1008_3\t1008_4"}