{"name": "1012", "parent": "", "content": "Animation for interactive prototype Different from storytelling and visual exploration, animations for an interactive prototyping actually have a clear purpose, which is to communicate with developers and give clients a sense that what the system should look like. Examples from Material Design To be more specific, animations for UI is not animations, but a transition, to show how users will feel when they interact with the final product. And help the prototype team to test it. Different tools can stimulate and inspired designers with different ideas, and even improve the original thought. Because different tools have their unique features. Here are some of the tools I’ve tried: 1. Dear AE… One of the adobe products we have used since in colleague. For a designer who with a remarkable patient can create most of the UI animation frame by frame. However, one of the AE defect is when a picky designer drags the curve carefully and send the delicate videos to the development team, the result usually won’t be exactly same as your work, actually very different most of the time: “what? That’s totally different from what I just send you” It’s fair, developers are not trained to feel the detail of graphic or motion but running by the numbers. Therefore, you can use Bodymovin to export JSON file, and developers can use Lottie to read it, so they code not by what they “feel” but the actual number. I think it’s a great tool for animators, however, it cannot make users to interact (experience) it, which I believe it’s important. In AE, elements are more controllable, so I think it’s a good backup solution if you can’t think figuring out how to solve the problem by other interactive tools. 2. Interactive tools: Proto & Atomic When I finished my first proto.io project, and ran in a device, I immediately know it’s a better prototyping tool because it enables everyone in the meeting room to engage and have the same experience as end users. Ideas and sketch design became a real product with these tools. Atomic vs. Proto are both interactive prototyping tools. Atomic is cheaper but basic, like one object can’t have more than 2 interactions. However, the helping center is friendly, they will provide the alternative solutions. On the other hand, proto.io is more mature since it has both containers and screen states, so you can make animation separately and compose in one file. So at present, proto.io is still my favorite. 3. Framer, Javascript and Origami It’s good to code, but it’s hard to be proficient. I am still trying… These coding based tools indeed helping designers to think closer as developers since it has similar language. A developers in our team said 1–10, if you give me AE file I will say 5…maybe, but if you provide codepen, then it’s 10. Even it’s coding, the concept of layer in framer is closer to how the designer thinks, and also makes me think about pinching and pouring data, which is none coding tools hard to achieve. In general, I believe do more coding is only benefiting the digital designers, even though, Origami is the other story which it still cause me a headache… Why interaction is important Interactive prototype helps us and other designers, clients, hopefully the end users, to be more engaging and participate with the prototype when they can really test it on devices. Therefore, it’s not just about prototype, but also help everyone in the meeting room to have a better decision. As a designer, I admit we can’t control everything, so I prefer the way which can create more conversation with others. Many times, a good idea or a simple, but be ignored problem will appear immediately when you directly try it, like: wait, so how should I deselect this? Often, when I watch a transition video in 5 seconds, and I will blank out and think “wait, what did I just watch?” and click the play icon to watch it again. Cause a plan video lack hardly engage people, and an interactive prototype simulates the environment and interactions, how the end users will feel like. ", "title": "Animation for interactive prototype", "sentences": [{"8a41": "Animation for interactive prototype"}, {"4a8a": "Different from storytelling and visual exploration, animations for an interactive prototyping actually have a clear purpose, which is to communicate with developers and give clients a sense that what the system should look like."}, {"2373": "Examples from Material Design"}, {"e845": "To be more specific, animations for UI is not animations, but a transition, to show how users will feel when they interact with the final product. And help the prototype team to test it. Different tools can stimulate and inspired designers with different ideas, and even improve the original thought. Because different tools have their unique features."}, {"1689": "Here are some of the tools I’ve tried:"}, {"cbaa": "1. Dear AE…"}, {"85c0": "One of the adobe products we have used since in colleague. For a designer who with a remarkable patient can create most of the UI animation frame by frame."}, {"20e5": "However, one of the AE defect is when a picky designer drags the curve carefully and send the delicate videos to the development team, the result usually won’t be exactly same as your work, actually very different most of the time:"}, {"244c": "“what? That’s totally different from what I just send you”"}, {"7a2c": "It’s fair, developers are not trained to feel the detail of graphic or motion but running by the numbers. Therefore, you can use Bodymovin to export JSON file, and developers can use Lottie to read it, so they code not by what they “feel” but the actual number."}, {"0aa8": "I think it’s a great tool for animators, however, it cannot make users to interact (experience) it, which I believe it’s important. In AE, elements are more controllable, so I think it’s a good backup solution if you can’t think figuring out how to solve the problem by other interactive tools."}, {"c709": "2. Interactive tools: Proto & Atomic"}, {"cb35": "When I finished my first proto.io project, and ran in a device, I immediately know it’s a better prototyping tool because it enables everyone in the meeting room to engage and have the same experience as end users. Ideas and sketch design became a real product with these tools."}, {"7d29": "Atomic vs. Proto are both interactive prototyping tools. Atomic is cheaper but basic, like one object can’t have more than 2 interactions. However, the helping center is friendly, they will provide the alternative solutions."}, {"0da0": "On the other hand, proto.io is more mature since it has both containers and screen states, so you can make animation separately and compose in one file. So at present, proto.io is still my favorite."}, {"3a7e": "3. Framer, Javascript and Origami"}, {"83cc": "It’s good to code, but it’s hard to be proficient. I am still trying… These coding based tools indeed helping designers to think closer as developers since it has similar language."}, {"fe04": "A developers in our team said 1–10, if you give me AE file I will say 5…maybe, but if you provide codepen, then it’s 10."}, {"29f8": "Even it’s coding, the concept of layer in framer is closer to how the designer thinks, and also makes me think about pinching and pouring data, which is none coding tools hard to achieve."}, {"c3f3": "In general, I believe do more coding is only benefiting the digital designers, even though, Origami is the other story which it still cause me a headache…"}, {"f12a": "Why interaction is important"}, {"9d0b": "Interactive prototype helps us and other designers, clients, hopefully the end users, to be more engaging and participate with the prototype when they can really test it on devices. Therefore, it’s not just about prototype, but also help everyone in the meeting room to have a better decision."}, {"0769": "As a designer, I admit we can’t control everything, so I prefer the way which can create more conversation with others. Many times, a good idea or a simple, but be ignored problem will appear immediately when you directly try it, like: wait, so how should I deselect this?"}, {"2de6": "Often, when I watch a transition video in 5 seconds, and I will blank out and think “wait, what did I just watch?” and click the play icon to watch it again."}, {"c828": "Cause a plan video lack hardly engage people, and an interactive prototype simulates the environment and interactions, how the end users will feel like."}], "child": "1012_1\t1012_2"}