{"name": "1015", "parent": "", "content": "A designer’s ethics in the world of bytes Imagine you are a designer in a brainstorm meeting in Airbnb’s headquarter in San Francisco. You are surrounded by posh art, brewed coffee, and hardcore liberal designers. The question on the white board is “How to make people of color feel more welcomed on Airbnb?” Where do you begin? On Feb 6th, Airbnb Launched a campaign to provide housing for people in urgent time. Imagine you are a designer working on OKCupid (or any other dating app). You open the emails from your marketing researcher and data scientist at the same time. The marketing data tell you that user likes to see bigger pictures and make a snap judgment. Apps with bigger photos have more friction with the user. At the same time, the data scientist’s study shows people’s common interest is a stronger indicator if a couple will work out in the long run. Your PM and Engineering team is waiting for you to decide the size of the photo and the size of the text. What do you do? Let’s do one more.You are the only designer sitting at a meeting table in Google. The table is full of automobile experts and machine learning engineers. You are designing the self-driving car for next year’s launch. One of the questions arise: if the car is driving on a cliff, all of sudden, it detect five persons in front of the car, and there is no time to apply the break. How does the car react? You can keep driving, ran over the five people and save the car owner. Or you can drive off the cliff, save the five people, and kill the car’s owner. There was a heated debate, everyone talked about moral and philosophy. To everyone’s surprise, the team reached a decision. Now you are in charge of designing the communication of this decision. What do you put up on that dashboard in the last seconds of the accident? As a designer, where do you begin? Picking the bloody typeface for that message? Self Driving Car A little history Before we dive into the future, let’s see how we landed here.The world of bytes has been in the safe hands of scientist and engineers till the 80s. Designers only emerged When the machines need to be used by everyday people. In the 80’s, designers worked on the graphic user interface to make the machine(Macintosh, 1984) understandable and easy to use. During the 90’s, the internet came about (Yahoo, 1994; Google, 1996). In that ten years, designer’s key contribution was to experiment the internet as a medium, to build a virtual space easy to navigate. In the new millennium, We start to carry computers with us all the time(iPhone, 2007). Many of the design challenges has been how to connect this small screen with the physical world, and help us navigate the world we are living in. The design professions matured with the rise of bytes.Today, If I want to design a useful and easy to use software application, I have lots of tools at my disposal. I can draw sketches on paper to brainstorm ideas. Then use digital tools (inVision) to build a prototype. And test the prototype by conducting user research. The process has evolved too. Process like design sprint helped designer to construct an effective collaborative exploration. We learned how to talk through different design options and iterate on ideas. We even share similar vocabulary. Engineers understand the importance of user experience. Designers understand the beauty of agile software development. Which brings us to today A new wave of development in data, machine learning are making our machines smarter every day. The prime examples are Siri, Alexa and Google Home start from 2015. They’re not listening to human’s command but rather helping people make decisions. For designers, the focus are shifting from connecting human and the machine to “design” a machine. How machine make choices, and how to communicate those choices back to human? Coming back to the self-driving car example, how to work out that problem in a software team? I don’t know if the tools and process listed above can help me. Do we do prototype? do we debate moral responsibilities? Do we do an “ethical sprint”? If yes, who to include in that sprint? What framework can we use to work this out? Here is my challenge on my desk every Monday:In my company, we ask students in K-12 schools how they feel in a classroom. And we build a software to give those feedback back to educators. My job is to design the interface to communicate those data. Imagine you are an 8th-grade math teacher, you have 20 students in your classroom. You want to understand if the students are learning the material. You asked: “Do you understand the materials in my math class?” Given a few choices:A, I understand the materials well.B, I understand the materials most of the time.C, I sometimes get lost in the material. 4 students selected A, 10 students selected B, and 6 students choose C.How to visualize this data? We can combine 4(A)+10(B) and divide by the 20 students. The results are 70% of the students understand the materials well, and 30% don’t. Design with simple numbers As a teacher, I can walk away with an impression “I need to focus on the 30% of the students in my classroom” Design with distributions Take one step further, I can draw a graph of all the student’s distribution. This way, the teacher can see how the answers are being distributed. It may take the teacher a little longer to read the graph, but she will have a more nuanced view of her classroom. Design with color and icons I can make the visualization more vivid, by giving color to the graph and using icons to represent people. This way I can emphasize the different choices students made.  This seems to be a better design than we start off. But some of the design choices I’ve made are worth careful examination. Are all the kids in the “green zone” doing well? One of my friend, Julia, was a straight A student in her classroom when she grows up. She understands the class material quickly and works well with her classmates. But she recalls she was so bored in her classroom. When I mark a big green next to her score, are we ignoring a student full of curiosity and opportunities? While facing those decisions, I am lost. I don’t think I have the right toolkit and skill set to work out those challenges alone. As a designer, I can present the challenge in a design critique, but is the question really about red or green, bar charts or students icons? or it’s about direct limited teaching resources in a public school classroom? When we representing a class of students in the world of bytes, are we taking individuality away? Designers are not the only one that stands between the dark side of the technology. Anyone who had the rare opportunity to bring a product to life knew the product is made by a team. A team of engineers, researchers, product managers, client services and beyond. Designers are only a part of the team behind a product. What we decide as a team reflects the value of how we see the world, and where we want to the world to move to. With all the bytes we write, we are building a road towards future. I am asking “How to construct a process to talk about these values and choices we make in the product?” I want to end this post with a quote from an open letter by Microsoft’s CEO Satya Nadella. And I would love to see the world where product makers have more debates like this and share their ideas. I would argue that perhaps the most productive debate we can have isn’t one of good versus evil: The debate should be about the values instilled in the people and institutions creating this technology. In his book Machines of Loving Grace, John Markoff writes, “The best way to answer the hard questions about control in a world full of smart machines is by understanding the values of those who are actually building these systems.” It’s an intriguing question, and one that our industry must discuss and answer together. Cynthia said we are the most social and emotional of all the species, yet we spend little time thinking about empathy in the design of technology. She said, “After all, how we experience the world is through communications and collaboration. If we are interested in machines that work with us, then we can’t ignore the humanistic approach.” ", "title": "A designer’s ethics in the world of bytes", "sentences": [{"14ec": "A designer’s ethics in the world of bytes"}, {"0465": "Imagine you are a designer in a brainstorm meeting in Airbnb’s headquarter in San Francisco. You are surrounded by posh art, brewed coffee, and hardcore liberal designers. The question on the white board is “How to make people of color feel more welcomed on Airbnb?” Where do you begin?"}, {"ff1c": "On Feb 6th, Airbnb Launched a campaign to provide housing for people in urgent time."}, {"f8c4": "Imagine you are a designer working on OKCupid (or any other dating app). You open the emails from your marketing researcher and data scientist at the same time. The marketing data tell you that user likes to see bigger pictures and make a snap judgment. Apps with bigger photos have more friction with the user. At the same time, the data scientist’s study shows people’s common interest is a stronger indicator if a couple will work out in the long run. Your PM and Engineering team is waiting for you to decide the size of the photo and the size of the text. What do you do?"}, {"8b5e": "Let’s do one more.You are the only designer sitting at a meeting table in Google. The table is full of automobile experts and machine learning engineers. You are designing the self-driving car for next year’s launch. One of the questions arise: if the car is driving on a cliff, all of sudden, it detect five persons in front of the car, and there is no time to apply the break. How does the car react? You can keep driving, ran over the five people and save the car owner. Or you can drive off the cliff, save the five people, and kill the car’s owner. There was a heated debate, everyone talked about moral and philosophy. To everyone’s surprise, the team reached a decision. Now you are in charge of designing the communication of this decision. What do you put up on that dashboard in the last seconds of the accident? As a designer, where do you begin? Picking the bloody typeface for that message?"}, {"7aa6": "Self Driving Car"}, {"07ad": "A little history"}, {"ff19": "Before we dive into the future, let’s see how we landed here.The world of bytes has been in the safe hands of scientist and engineers till the 80s. Designers only emerged When the machines need to be used by everyday people. In the 80’s, designers worked on the graphic user interface to make the machine(Macintosh, 1984) understandable and easy to use. During the 90’s, the internet came about (Yahoo, 1994; Google, 1996). In that ten years, designer’s key contribution was to experiment the internet as a medium, to build a virtual space easy to navigate. In the new millennium, We start to carry computers with us all the time(iPhone, 2007). Many of the design challenges has been how to connect this small screen with the physical world, and help us navigate the world we are living in."}, {"b030": "The design professions matured with the rise of bytes.Today, If I want to design a useful and easy to use software application, I have lots of tools at my disposal. I can draw sketches on paper to brainstorm ideas. Then use digital tools (inVision) to build a prototype. And test the prototype by conducting user research."}, {"af04": "The process has evolved too. Process like design sprint helped designer to construct an effective collaborative exploration. We learned how to talk through different design options and iterate on ideas. We even share similar vocabulary. Engineers understand the importance of user experience. Designers understand the beauty of agile software development."}, {"034c": "Which brings us to today"}, {"060e": "A new wave of development in data, machine learning are making our machines smarter every day. The prime examples are Siri, Alexa and Google Home start from 2015. They’re not listening to human’s command but rather helping people make decisions. For designers, the focus are shifting from connecting human and the machine to “design” a machine. How machine make choices, and how to communicate those choices back to human?"}, {"a323": "Coming back to the self-driving car example, how to work out that problem in a software team? I don’t know if the tools and process listed above can help me. Do we do prototype? do we debate moral responsibilities? Do we do an “ethical sprint”? If yes, who to include in that sprint? What framework can we use to work this out?"}, {"0468": "Here is my challenge on my desk every Monday:In my company, we ask students in K-12 schools how they feel in a classroom. And we build a software to give those feedback back to educators. My job is to design the interface to communicate those data."}, {"289f": "Imagine you are an 8th-grade math teacher, you have 20 students in your classroom. You want to understand if the students are learning the material."}, {"5982": "You asked: “Do you understand the materials in my math class?” Given a few choices:A, I understand the materials well.B, I understand the materials most of the time.C, I sometimes get lost in the material."}, {"272d": "4 students selected A, 10 students selected B, and 6 students choose C.How to visualize this data? We can combine 4(A)+10(B) and divide by the 20 students. The results are 70% of the students understand the materials well, and 30% don’t."}, {"ebda": "Design with simple numbers"}, {"74ef": "As a teacher, I can walk away with an impression “I need to focus on the 30% of the students in my classroom”"}, {"fc29": "Design with distributions"}, {"8f2e": "Take one step further, I can draw a graph of all the student’s distribution. This way, the teacher can see how the answers are being distributed. It may take the teacher a little longer to read the graph, but she will have a more nuanced view of her classroom."}, {"167e": "Design with color and icons"}, {"4099": "I can make the visualization more vivid, by giving color to the graph and using icons to represent people. This way I can emphasize the different choices students made.  This seems to be a better design than we start off. But some of the design choices I’ve made are worth careful examination. Are all the kids in the “green zone” doing well?"}, {"ef3e": "One of my friend, Julia, was a straight A student in her classroom when she grows up. She understands the class material quickly and works well with her classmates. But she recalls she was so bored in her classroom. When I mark a big green next to her score, are we ignoring a student full of curiosity and opportunities?"}, {"3ab7": "While facing those decisions, I am lost. I don’t think I have the right toolkit and skill set to work out those challenges alone. As a designer, I can present the challenge in a design critique, but is the question really about red or green, bar charts or students icons? or it’s about direct limited teaching resources in a public school classroom? When we representing a class of students in the world of bytes, are we taking individuality away?"}, {"c07b": "Designers are not the only one that stands between the dark side of the technology. Anyone who had the rare opportunity to bring a product to life knew the product is made by a team. A team of engineers, researchers, product managers, client services and beyond. Designers are only a part of the team behind a product. What we decide as a team reflects the value of how we see the world, and where we want to the world to move to. With all the bytes we write, we are building a road towards future. I am asking “How to construct a process to talk about these values and choices we make in the product?” I want to end this post with a quote from an open letter by Microsoft’s CEO Satya Nadella. And I would love to see the world where product makers have more debates like this and share their ideas."}, {"41ee": "I would argue that perhaps the most productive debate we can have isn’t one of good versus evil: The debate should be about the values instilled in the people and institutions creating this technology. In his book Machines of Loving Grace, John Markoff writes, “The best way to answer the hard questions about control in a world full of smart machines is by understanding the values of those who are actually building these systems.” It’s an intriguing question, and one that our industry must discuss and answer together."}, {"201f": "Cynthia said we are the most social and emotional of all the species, yet we spend little time thinking about empathy in the design of technology. She said, “After all, how we experience the world is through communications and collaboration. If we are interested in machines that work with us, then we can’t ignore the humanistic approach.”"}], "child": "1015_1\t1015_21015_1\t1015_21015_1\t1015_21015_1\t1015_21015_1\t1015_21015_1\t1015_2"}