{"name": "1016", "parent": "", "content": "Why I’m done making wireframes! And maybe you should be too Let me start by saying I make products, digital ones that frequently include lots of interaction. I’m not creating marketing sites or projects that require traditional information architecture and content structure. Meaning everything that follows is from an “app” perspective. Lately, I’ve been struggling with the role of UX inside the confines of traditional Agile iterations. As I work to provide my team and larger organization with the answers they need, wireframes have always been the obvious “go to” deliverable. After all, it’s easy to just draw some boxes that represent a screen, then assume everyone who sees it is on the same page. Unfortunately, just because something’s obvious doesn’t make it right. Wireframes are time-consuming to create especially at higher fidelity but seem to be providing less and less value. “Less value!?!” you say, “but they’re what UX designer’s do!” Fine, here are my gripes with wireframes. Maybe you’ll agree. The purpose is murky Why do we need a wireframe? In the context of a product, wireframes serve a similar function to that of a specification. But in my experience, it’s common for both a formal spec and a wireframe to exist. These two items are often created by different individuals representing slightly different expectations. Unfortunately, the audience often assumes that spec and wireframe are in complete agreement. Since pictures are faster to digest than words, it’s easy to fall into the trap of looking at wireframes without engaging with the spec. This results in errors or unexpected gotcha’s in the final product. Wireframes aren’t really Agile An iterative process is the foundation of most product development methodologies. Wireframes like any artifact can (and should be) changed as learning occurs. However, since wireframes are often treated as spec they lend themselves to a Waterfall expectation as the “source of truth”. In other words, the wireframe is supposed to represent having everything figured out. Then when a wireframe does change, its extremely difficult to comprehend what’s different. There are plenty of tools to help figure that stuff out (revision history, diffs, etc) but the reality is that most teams don’t utilize them and work gets out of sync. Interaction states inflate complexity Do you ever get asked what a screen looks like? If the thing you’re building forces you to follow up with “In what state or condition?”, it’s a sure sign that wireframing all those variations is going to be really complex. In general, the more interaction or types of content in an app the more versions of a screen will be required. Do you really want to wireframe each of those? Worse are you even remotely confident that you know all the states? Five wireframes for a single screen isn’t overly sustainable let alone 20 or more. Wireframes aren’t exactly testable I’ve yet to receive really valuable feedback by testing a wireframe. The experience is always a bit confusing. I spend so much time setting up concepts that I wonder how much bias I’ve created which in turn causes me to question the feedback. Plus testing a wireframe doesn’t provide much in the way of emotional and contextual feedback. Is it obvious that content is connected if you didn’t see a card flip over? Sure wireframes are helpful for understanding a flow but they’re often so detailed that it’s hard to focus viewers on the right discussions. So yeah, I’m done making wireframes. The ROI just isn’t there for the type of things I make. Plus I’m sick of wasting my time on stuff that seems to break the process. If not wireframes then what? Ok, you got me. I’m not trying to do less work. I simply want to be efficient with my time to provide the most valuable output possible. Instead of basking in my new found free time I need a different deliverable. So how do I replace wireframes? To be honest I’m not entirely sure. I’m going to try providing storyboards (similar to a movie) showing the interplay between screens and clickable prototypes. Both deliverables are much more collaborative, easier to test & discuss, and add context that might be missing from the spec. I have no idea if those things will be accepted by my team but there’s little lost by trying. What about you? How do you provide direction to your team in valuable and meaningful terms? If you like this, please tap the heart or share it with others. If you take issue with something I’ve said, leave a comment or response so we can discuss. By day, I’m a product designer currently working to improve healthcare communication. By night I’m a Google Expert, a product mentor and writing a book about getting started in UX. Follow me on Twitter @howitson. ", "title": "Why I’m done making wireframes!", "sentences": [{"cc57": "Why I’m done making wireframes!"}, {"8181": "And maybe you should be too"}, {"d0ab": "Let me start by saying I make products, digital ones that frequently include lots of interaction. I’m not creating marketing sites or projects that require traditional information architecture and content structure. Meaning everything that follows is from an “app” perspective."}, {"3844": "Lately, I’ve been struggling with the role of UX inside the confines of traditional Agile iterations. As I work to provide my team and larger organization with the answers they need, wireframes have always been the obvious “go to” deliverable. After all, it’s easy to just draw some boxes that represent a screen, then assume everyone who sees it is on the same page."}, {"588d": "Unfortunately, just because something’s obvious doesn’t make it right. Wireframes are time-consuming to create especially at higher fidelity but seem to be providing less and less value. “Less value!?!” you say, “but they’re what UX designer’s do!” Fine, here are my gripes with wireframes. Maybe you’ll agree."}, {"5c20": "The purpose is murky"}, {"e2ca": "Why do we need a wireframe? In the context of a product, wireframes serve a similar function to that of a specification. But in my experience, it’s common for both a formal spec and a wireframe to exist. These two items are often created by different individuals representing slightly different expectations. Unfortunately, the audience often assumes that spec and wireframe are in complete agreement. Since pictures are faster to digest than words, it’s easy to fall into the trap of looking at wireframes without engaging with the spec. This results in errors or unexpected gotcha’s in the final product."}, {"c436": "Wireframes aren’t really Agile"}, {"b33b": "An iterative process is the foundation of most product development methodologies. Wireframes like any artifact can (and should be) changed as learning occurs. However, since wireframes are often treated as spec they lend themselves to a Waterfall expectation as the “source of truth”. In other words, the wireframe is supposed to represent having everything figured out. Then when a wireframe does change, its extremely difficult to comprehend what’s different. There are plenty of tools to help figure that stuff out (revision history, diffs, etc) but the reality is that most teams don’t utilize them and work gets out of sync."}, {"88d8": "Interaction states inflate complexity"}, {"ea98": "Do you ever get asked what a screen looks like? If the thing you’re building forces you to follow up with “In what state or condition?”, it’s a sure sign that wireframing all those variations is going to be really complex. In general, the more interaction or types of content in an app the more versions of a screen will be required. Do you really want to wireframe each of those? Worse are you even remotely confident that you know all the states? Five wireframes for a single screen isn’t overly sustainable let alone 20 or more."}, {"8994": "Wireframes aren’t exactly testable"}, {"a4f9": "I’ve yet to receive really valuable feedback by testing a wireframe. The experience is always a bit confusing. I spend so much time setting up concepts that I wonder how much bias I’ve created which in turn causes me to question the feedback. Plus testing a wireframe doesn’t provide much in the way of emotional and contextual feedback. Is it obvious that content is connected if you didn’t see a card flip over? Sure wireframes are helpful for understanding a flow but they’re often so detailed that it’s hard to focus viewers on the right discussions."}, {"a43e": "So yeah, I’m done making wireframes. The ROI just isn’t there for the type of things I make. Plus I’m sick of wasting my time on stuff that seems to break the process."}, {"0d4f": "If not wireframes then what?"}, {"5997": "Ok, you got me. I’m not trying to do less work. I simply want to be efficient with my time to provide the most valuable output possible. Instead of basking in my new found free time I need a different deliverable."}, {"6e31": "So how do I replace wireframes? To be honest I’m not entirely sure. I’m going to try providing storyboards (similar to a movie) showing the interplay between screens and clickable prototypes. Both deliverables are much more collaborative, easier to test & discuss, and add context that might be missing from the spec. I have no idea if those things will be accepted by my team but there’s little lost by trying."}, {"18a6": "What about you? How do you provide direction to your team in valuable and meaningful terms?"}, {"af61": "If you like this, please tap the heart or share it with others. If you take issue with something I’ve said, leave a comment or response so we can discuss."}, {"14c3": "By day, I’m a product designer currently working to improve healthcare communication. By night I’m a Google Expert, a product mentor and writing a book about getting started in UX. Follow me on Twitter @howitson."}], "child": "1016_1\t1016_2\t1016_3\t1016_4\t1016_5\t1016_6\t1016_7\t1016_8\t1016_9\t1016_10\t1016_11\t1016_12\t1016_13\t1016_141016_1\t1016_2\t1016_3\t1016_4\t1016_5\t1016_6\t1016_7\t1016_8\t1016_9\t1016_10\t1016_11\t1016_12\t1016_13\t1016_141016_1\t1016_2\t1016_3\t1016_4\t1016_5\t1016_6\t1016_7\t1016_8\t1016_9\t1016_10\t1016_11\t1016_12\t1016_13\t1016_14"}