{"name": "1026", "parent": "", "content": "A diferença entre não esquecer e não deixar acontecer de novo Quando eu tinha 16 anos, participei junto a todos os meus colegas de ensino médio da Marcha da Vida, uma viagem que passa pela Polônia (ou Polônia e Alemanha) e termina em Israel, cujo tema é o extermínio judeu durante a Segunda Guerra Mundial. Foram aproximadamente 15 dias entre os dois países, conhecendo os mais famosos guetos judaicos, campos de concentração, de extermínio, museus e demais localidades importantes e remanescentes da época. Seu nome é uma oposição à famosa Marcha da Morte, realizada no início de 1945, com o propósito de transferir prisioneiros entre campos. A Marcha foi uma jornada bastante chocante. Estive dentro de câmaras de gás, cujas paredes eram marcadas por rastros de unhas desesperadas e impregnadas por um cheiro horroroso. Vi pilhas de cabelos, sapatos, malas, cinzas humanas. Vi uma das macas onde o doente Josef Mengele fazia experimentos médicos tenebrosos em prisioneiros. Foi bastante informação pra ser assimilada a respeito da capacidade humana de crueldade, especialmente sendo tão jovem. Ao mesmo tempo, nos encontramos e confraternizamos com comunidades judaicas do mundo inteiro, reunidas na Polônia para fazer a caminhada de Auschwitz para Birkenau, um forte símbolo de resistência dos descendentes de sobreviventes da guerra. Eu estudava em um colégio judaico e a viagem fazia parte do nosso aprendizado. Éramos 150 alunos de 3 colégios judaicos paulistanos fazendo a jornada, patrocinada por diversas doações de entidades e famílias diferentes. Entre nós, judeus, existe uma reverência muito grande em relação ao Shoah (nome hebraico para Holocausto). O extermínio de seis milhões de nós, sendo mais de um milhão destes crianças e pré-adolescentes, é parte de um episódio histórico que jamais esqueceremos. Em festividades judaicas, é comum a menção ao Shoah. Em Israel, no Dia Internacional de Lembrança do Holocausto, a cidade inteira para ao soar de uma sirene e permanece em silêncio durante um minuto. Na época em que fiz a viagem, meu pai fez uma crítica muito acertada ao programa da Marcha da Vida, cuja profundidade e importância eu só fui reconhecer alguns anos depois: muito se fala sobre a perseguição, a Noite dos Cristais, a Solução Final, o sofrimento e a coragem dos que sobreviveram. Pouco se fala, no entanto, do processo político e social que permitiu que esse tipo de crime acontecesse. Pouco se fala no fato de que além de judeus, foram mortos comunistas, lésbicas, gays, bissexuais, prostitutas, ciganos. Sempre nos referimos a Adolf Hitler como um monstro e esquecemos que, na verdade, ele era apenas mais uma pessoa. O reflexo disso nos dias de hoje é bastante sintomático dessa ausência de pensamento mais profundo, de reflexão acerca dos processos que levaram um homem tão terrível a acumular tanto poder nas mãos. Poucos se lembram de que antes dos campos de extermínio, houve um período em que judeus eram motivo de piada: caricaturas preconceituosas mostravam figuras rabugentas com grandes narizes e sacos de dinheiro nas mãos. “O judeu errante”, propaganda nazista. Anos se passaram entre a inicial culpabilização do judeu pelos problemas da Europa até o extermínio de milhões. Meu bisavô, por exemplo, teve a perspicácia de antever o cenário nefasto que aguardava os judeus na Polônia e fugiu para o Brasil em 1928. Sua família, infelizmente, não acreditou que a situação fosse ficar tão ruim. Encontrei alguns de seus nomes nas listas de deportação, na Polônia. Uns estavam atravessados por um risco vermelho, o que indicava que morreram nos trens superlotados, antes sequer de chegar aos campos. A parte mais privilegiada da comunidade judaica brasileira (que é ironicamente filha ou neta de sobreviventes do Holocausto) pareceu ter esquecido a discriminação sofrida por seus antepassados, reproduzindo essas atitudes com outras minorias sociais. Durante meus anos vivendo na comunidade, cansei de ver exemplos perturbadores de homofobia, racismo, xenofobia e preconceito de classe. Muita gente também escolheu aderir a discursos falaciosos como a meritocracia, que adoram justificam com o fato de que seus pais ou avós fugiram da guerra e chegaram ao Brasil sem posses, trabalhando para edificar o que suas famílias possuem hoje. Essa ignorância culminou recentemente num evento absolutamente pavoroso: a recepção, em um dos antros da comunidade judaica brasileira (A Hebraica do Rio de Janeiro), de um homem de ideais desavergonhadamente fascistas e perigosos, o deputado Jair Bolsonaro. Durante suas falas, Bolsonaro destilou seu já conhecido veneno: trata-se de um homem misógino, homofóbico, racista, violento e tremendamente mal informado. Entre seus maiores apoiadores, encontram-se os neonazistas e a extrema direita. Mas isso tudo parece ter passado batido para os responsáveis pelo convite ao deputado e também para as dezenas que aplaudiram seus discursos hediondos, ovacionando e entoando coros. Ele prometeu, caso seja eleito, eliminar reservas indígenas e quilombolas, além de permitir o porte de armas de fogo pela população. Adicionalmente, o deputado alega ter “fraquejado” ao ter uma filha, depois de quatro filhos consecutivos. Sua triste audiência judia claramente falhou em fazer as contas que, estivéssemos em 1935, provavelmente Bolsonaro estaria apoiando todas as medidas que ceifaram os direitos civis dos judeus e posteriormente endossaria também os assassinatos em massa. É grotesco que membros de uma minoria política até tão recentemente perseguida e discriminada sofra de um fenômeno tão impressionante de perda de memória, ou simplesmente escolha ignorar a incoerência de suas ações. Apoiar Bolsonaro é legitimar aquele que é conhecido como um dos políticos mais nojentos do mundo, além de compactuar com indivíduos que glorificam o Holocausto e se mostram saudosos dos tempos de ditadura brasileira, exaltando torturadores. É claro que ser judeu não impede ninguém de ser ignorante. Mas nossa cultura estimula e enaltece a sabedoria, o conhecimento, a realização intelectual e a transmissão da história judaica de geração para geração (ou, como dizemos em hebraico, le dor va dor). Então, é bastante surpreendente que viver dentro de uma comunidade que preserva estes valores não tenha feito diferença alguma para os descendentes daqueles que escaparam de terríveis homens iguais ao que hoje seus filhos louvam. É com profunda vergonha que observo este fenômeno. Nós, judeus, deveríamos estar fortemente unidos para impedir qualquer figura que apoie discriminação social de alcançar o mais ínfimo grau de poder. É inaceitável a indiferença e inconcebível o apoio a esses indivíduos. Não se esqueçam que tudo começa dessa forma: uma piada, um comentário preconceituoso, um cargo político, uma promessa de mudança. Somos um exemplo de irresponsabilidade histórica por não fazermos campanhas massivas contra esse tipo de pensamento. De nada adianta dizer que “jamais esqueceremos” os horrores do Holocausto se não lutarmos de forma veemente contra as sementes da barbárie. Não se esqueçam das sábias palavras de Martin Niemöller, em 1933: Um dia vieram e levaram meu vizinho que era judeu.Como não sou judeu, não me incomodei.No dia seguinte, vieram e levarammeu outro vizinho que era comunista.Como não sou comunista, não me incomodei.No terceiro dia vierame levaram meu vizinho católico.Como não sou católico, não me incomodei.No quarto dia, vieram e me levaram;já não havia mais ninguém para reclamar… Por fim, gostaria de agradecer profundamente aos que ainda resistem e não se calaram: todos os manifestantes que se reuniram à porta do clube para protestar, meu pai, o rabino Nilton Bonder e todos os que se manifestaram contra a presença de Jair Bolsonaro n’A Hebraica de São Paulo. Obrigada por não permitirem que nosso legado de luta seja esquecido. ", "title": "A diferença entre não esquecer e não deixar acontecer de novo", "sentences": [{"c1a8": "A diferença entre não esquecer e não deixar acontecer de novo"}, {"69c3": "Quando eu tinha 16 anos, participei junto a todos os meus colegas de ensino médio da Marcha da Vida, uma viagem que passa pela Polônia (ou Polônia e Alemanha) e termina em Israel, cujo tema é o extermínio judeu durante a Segunda Guerra Mundial. Foram aproximadamente 15 dias entre os dois países, conhecendo os mais famosos guetos judaicos, campos de concentração, de extermínio, museus e demais localidades importantes e remanescentes da época. Seu nome é uma oposição à famosa Marcha da Morte, realizada no início de 1945, com o propósito de transferir prisioneiros entre campos."}, {"76db": "A Marcha foi uma jornada bastante chocante. Estive dentro de câmaras de gás, cujas paredes eram marcadas por rastros de unhas desesperadas e impregnadas por um cheiro horroroso. Vi pilhas de cabelos, sapatos, malas, cinzas humanas. Vi uma das macas onde o doente Josef Mengele fazia experimentos médicos tenebrosos em prisioneiros. Foi bastante informação pra ser assimilada a respeito da capacidade humana de crueldade, especialmente sendo tão jovem. Ao mesmo tempo, nos encontramos e confraternizamos com comunidades judaicas do mundo inteiro, reunidas na Polônia para fazer a caminhada de Auschwitz para Birkenau, um forte símbolo de resistência dos descendentes de sobreviventes da guerra."}, {"50b2": "Eu estudava em um colégio judaico e a viagem fazia parte do nosso aprendizado. Éramos 150 alunos de 3 colégios judaicos paulistanos fazendo a jornada, patrocinada por diversas doações de entidades e famílias diferentes. Entre nós, judeus, existe uma reverência muito grande em relação ao Shoah (nome hebraico para Holocausto). O extermínio de seis milhões de nós, sendo mais de um milhão destes crianças e pré-adolescentes, é parte de um episódio histórico que jamais esqueceremos. Em festividades judaicas, é comum a menção ao Shoah. Em Israel, no Dia Internacional de Lembrança do Holocausto, a cidade inteira para ao soar de uma sirene e permanece em silêncio durante um minuto."}, {"465d": "Na época em que fiz a viagem, meu pai fez uma crítica muito acertada ao programa da Marcha da Vida, cuja profundidade e importância eu só fui reconhecer alguns anos depois: muito se fala sobre a perseguição, a Noite dos Cristais, a Solução Final, o sofrimento e a coragem dos que sobreviveram. Pouco se fala, no entanto, do processo político e social que permitiu que esse tipo de crime acontecesse. Pouco se fala no fato de que além de judeus, foram mortos comunistas, lésbicas, gays, bissexuais, prostitutas, ciganos. Sempre nos referimos a Adolf Hitler como um monstro e esquecemos que, na verdade, ele era apenas mais uma pessoa."}, {"3fc3": "O reflexo disso nos dias de hoje é bastante sintomático dessa ausência de pensamento mais profundo, de reflexão acerca dos processos que levaram um homem tão terrível a acumular tanto poder nas mãos. Poucos se lembram de que antes dos campos de extermínio, houve um período em que judeus eram motivo de piada: caricaturas preconceituosas mostravam figuras rabugentas com grandes narizes e sacos de dinheiro nas mãos."}, {"46c9": "“O judeu errante”, propaganda nazista."}, {"209d": "Anos se passaram entre a inicial culpabilização do judeu pelos problemas da Europa até o extermínio de milhões. Meu bisavô, por exemplo, teve a perspicácia de antever o cenário nefasto que aguardava os judeus na Polônia e fugiu para o Brasil em 1928. Sua família, infelizmente, não acreditou que a situação fosse ficar tão ruim. Encontrei alguns de seus nomes nas listas de deportação, na Polônia. Uns estavam atravessados por um risco vermelho, o que indicava que morreram nos trens superlotados, antes sequer de chegar aos campos."}, {"499e": "A parte mais privilegiada da comunidade judaica brasileira (que é ironicamente filha ou neta de sobreviventes do Holocausto) pareceu ter esquecido a discriminação sofrida por seus antepassados, reproduzindo essas atitudes com outras minorias sociais. Durante meus anos vivendo na comunidade, cansei de ver exemplos perturbadores de homofobia, racismo, xenofobia e preconceito de classe. Muita gente também escolheu aderir a discursos falaciosos como a meritocracia, que adoram justificam com o fato de que seus pais ou avós fugiram da guerra e chegaram ao Brasil sem posses, trabalhando para edificar o que suas famílias possuem hoje."}, {"ff51": "Essa ignorância culminou recentemente num evento absolutamente pavoroso: a recepção, em um dos antros da comunidade judaica brasileira (A Hebraica do Rio de Janeiro), de um homem de ideais desavergonhadamente fascistas e perigosos, o deputado Jair Bolsonaro."}, {"822f": "Durante suas falas, Bolsonaro destilou seu já conhecido veneno: trata-se de um homem misógino, homofóbico, racista, violento e tremendamente mal informado. Entre seus maiores apoiadores, encontram-se os neonazistas e a extrema direita. Mas isso tudo parece ter passado batido para os responsáveis pelo convite ao deputado e também para as dezenas que aplaudiram seus discursos hediondos, ovacionando e entoando coros."}, {"bcbb": "Ele prometeu, caso seja eleito, eliminar reservas indígenas e quilombolas, além de permitir o porte de armas de fogo pela população. Adicionalmente, o deputado alega ter “fraquejado” ao ter uma filha, depois de quatro filhos consecutivos. Sua triste audiência judia claramente falhou em fazer as contas que, estivéssemos em 1935, provavelmente Bolsonaro estaria apoiando todas as medidas que ceifaram os direitos civis dos judeus e posteriormente endossaria também os assassinatos em massa."}, {"34df": "É grotesco que membros de uma minoria política até tão recentemente perseguida e discriminada sofra de um fenômeno tão impressionante de perda de memória, ou simplesmente escolha ignorar a incoerência de suas ações. Apoiar Bolsonaro é legitimar aquele que é conhecido como um dos políticos mais nojentos do mundo, além de compactuar com indivíduos que glorificam o Holocausto e se mostram saudosos dos tempos de ditadura brasileira, exaltando torturadores."}, {"f78c": "É claro que ser judeu não impede ninguém de ser ignorante. Mas nossa cultura estimula e enaltece a sabedoria, o conhecimento, a realização intelectual e a transmissão da história judaica de geração para geração (ou, como dizemos em hebraico, le dor va dor). Então, é bastante surpreendente que viver dentro de uma comunidade que preserva estes valores não tenha feito diferença alguma para os descendentes daqueles que escaparam de terríveis homens iguais ao que hoje seus filhos louvam."}, {"12f2": "É com profunda vergonha que observo este fenômeno. Nós, judeus, deveríamos estar fortemente unidos para impedir qualquer figura que apoie discriminação social de alcançar o mais ínfimo grau de poder. É inaceitável a indiferença e inconcebível o apoio a esses indivíduos. Não se esqueçam que tudo começa dessa forma: uma piada, um comentário preconceituoso, um cargo político, uma promessa de mudança. Somos um exemplo de irresponsabilidade histórica por não fazermos campanhas massivas contra esse tipo de pensamento. De nada adianta dizer que “jamais esqueceremos” os horrores do Holocausto se não lutarmos de forma veemente contra as sementes da barbárie."}, {"209e": "Não se esqueçam das sábias palavras de Martin Niemöller, em 1933:"}, {"f262": "Um dia vieram e levaram meu vizinho que era judeu.Como não sou judeu, não me incomodei.No dia seguinte, vieram e levarammeu outro vizinho que era comunista.Como não sou comunista, não me incomodei.No terceiro dia vierame levaram meu vizinho católico.Como não sou católico, não me incomodei.No quarto dia, vieram e me levaram;já não havia mais ninguém para reclamar…"}, {"f6fd": "Por fim, gostaria de agradecer profundamente aos que ainda resistem e não se calaram: todos os manifestantes que se reuniram à porta do clube para protestar, meu pai, o rabino Nilton Bonder e todos os que se manifestaram contra a presença de Jair Bolsonaro n’A Hebraica de São Paulo. Obrigada por não permitirem que nosso legado de luta seja esquecido."}], "child": "1026_1\t1026_2\t1026_3\t1026_4\t1026_5\t1026_6\t1026_7\t1026_8\t1026_9\t1026_10\t1026_11\t1026_12"}