{"name": "1029", "parent": "", "content": "Confissão de uma viciada em ler os comentários Aleksandra Waliszewska Começou em 2012, mas nos últimos meses tem sido cada vez mais difícil resistir a ler os comentários. Quando um alcoólatra quer superar o vício, recomenda-se que ele fique longe de bares e eventos em que bebida alcoólica será servida. Que passe um tempo longe, em resguardo — eu não posso ficar longe dos comentários. Eu sou uma jornalista, uma usuária da internet que precisa dela para trabalhar em cada um dos pontos da minha vida. Ficar longe dos comentários significa desconectar. Não resisto. Vejo uma polêmica e clico para ver os malditos comentários e sentir como o mundo está se acabando e os valores estão cada vez mais invertidos. Coloquei um post it na tela do computador me lembrando de ficar longe dos comentários, mas não ajudou, é automático, e a cada post eu preciso ver como o mundo está sendo destruído em poucos caracteres. Dependendo da bobagem escrita, me pego digitando fervorosamente, uma avalanche dos meus dedos sobre o teclado, acompanhado de um aperto no peito que só se alivia depois do enter, para começar tudo de novo quando o infeliz decide por me responder. Por que me sinto tão atraída pelos comentários? Que tipo de prazer mórbido eu sinto em ler tanta desgraça? Que tipo de ganho eu tenho ao abrir uma série de frases machistas, homofóbicas e racistas numa notícia de portal qualquer? Já falei sobre isso com amigos, família, namorado e terapeuta. Ninguém parece entender o meu vício e a ansiedade que me consome quando rolo a página para longe do número de comentários naquele post polêmico. Num piscar de olhos, eu já estou observando, atenta, cada uma ideias controversas nas centenas de postagens que acompanho por dia. Acredita que tem gente que duvida da vítima até mesmo quando há provas? Até mesmo quando o abusador assume o crime? Eu acredito. Eu vi. Não sei o que fazer. Sinto vontade de chorar, gritar e fazer o planeta Terra parar em nome das merdas que as pessoas têm na cabeça. Talvez seja um desejo de saber o que se passa na mente do outro, saber o que existe fora da minha bolha ou do meu próprio cérebro. Talvez se trate de um desejo de conhecer o diferente, ou mesmo uma busca por uma fagulha de esperança em meio ao caos. Talvez eu seja uma dessas pessoas que só gosta de ver o mundo pegar fogo e, frequentemente, discutir com quem riscou o fósforo. O ponto mais alto da minha loucura foi quando meu celular travou no meio de uma discussão. Estava numa festa e fui ao banheiro, aproveitando para checar as notificações e conferir como iam os comentários do jornal O Tempo. Um sujeito daqueles grandes e agressivos defendia o porte de armas e falava em matar homossexuais, e apontei a incoerência desse discurso com a foto de capa do homem. No perfil dele, Jesus me encarava com olhos amorosos, brilhando na tela trincada do meu celular. Ele me chamou de arrombada, “feminazi”, puta e mal comida. Meu celular travou, superaquecendo, e logo me vi chorando e pisando no aparelho dentro de um banheiro sujo da casa de alguém. Batiam na porta pedindo para que eu saísse, a fila estava grande, e eu pensava que deveria ir para casa para responder o fulano com a foto de capa de Jesus. No mês passado, deletei o Facebook. Fiquei ansiosa, mordi cada cantinho das minhas unhas até sair sangue. Comecei a perguntar para as pessoas qual a opinião delas sobre tudo. Será que elas apoiam o Bolsonaro? O que acham da hashtag de denúncia do momento? Elas acreditam que o Bruno se reabilitou na cadeia? Será que elas viram o último Amor&Sexo? Será que acharam transgressor ou libertino? Logo meus amigos começaram a me evitar, já que passei a querer debater em todas as mesas de bar, festas, velórios e chás de bebê. Não saber me corroeu por dentro. Não via sentido na internet mais, e, portanto, não via sentido na minha própria vida. Na verdade, já tem um tempo que o interesse pelos comentários — do Facebook, do G1, do Instagram, do Reddit e do 4chan, que seja — se tornou a única coisa na qual consigo pensar. Meu regime sem os comentários do Facebook durou apenas uma semana e, ao voltar, passei 3 horas seguidas me deleitando nas páginas dos portais de notícia. Deixei de comer e de dormir, tornando-me uma escrava da imbecilidade alheia. Ainda não me recuperei. Meus amigos já não falam comigo, mas sempre tenho alguém com quem discutir nos comentários. Esse é meu comentário de despedida, o fim de todas as minhas discussões. Já não aguento mais — é minha última confissão, meu último pedido de ajuda e súplica antes de ir embora sem deixar vestígios. Me apagar, como se apaga um comentário, três cliques, Tem certeza? Tenho. E já não existirei mais. Puff. Gostou? Clique no ❤ e deixe um comentário, ele é muito importante para nós! Não deixe de nos seguir e curtir nas redes sociais: Twitter; Facebook; Instagram. Não perca nenhum texto, assine a nossa Newsletter: Revista Subjetiva by Revista SubjetivaEdit descriptiontinyletter.com ", "title": "Confissão de uma viciada em ler os comentários", "sentences": [{"9619": "Confissão de uma viciada em ler os comentários"}, {"8cfc": "Aleksandra Waliszewska"}, {"d8bf": "Começou em 2012, mas nos últimos meses tem sido cada vez mais difícil resistir a ler os comentários."}, {"f266": "Quando um alcoólatra quer superar o vício, recomenda-se que ele fique longe de bares e eventos em que bebida alcoólica será servida. Que passe um tempo longe, em resguardo — eu não posso ficar longe dos comentários. Eu sou uma jornalista, uma usuária da internet que precisa dela para trabalhar em cada um dos pontos da minha vida. Ficar longe dos comentários significa desconectar."}, {"5018": "Não resisto. Vejo uma polêmica e clico para ver os malditos comentários e sentir como o mundo está se acabando e os valores estão cada vez mais invertidos. Coloquei um post it na tela do computador me lembrando de ficar longe dos comentários, mas não ajudou, é automático, e a cada post eu preciso ver como o mundo está sendo destruído em poucos caracteres. Dependendo da bobagem escrita, me pego digitando fervorosamente, uma avalanche dos meus dedos sobre o teclado, acompanhado de um aperto no peito que só se alivia depois do enter, para começar tudo de novo quando o infeliz decide por me responder."}, {"d597": "Por que me sinto tão atraída pelos comentários? Que tipo de prazer mórbido eu sinto em ler tanta desgraça? Que tipo de ganho eu tenho ao abrir uma série de frases machistas, homofóbicas e racistas numa notícia de portal qualquer?"}, {"ee24": "Já falei sobre isso com amigos, família, namorado e terapeuta. Ninguém parece entender o meu vício e a ansiedade que me consome quando rolo a página para longe do número de comentários naquele post polêmico. Num piscar de olhos, eu já estou observando, atenta, cada uma ideias controversas nas centenas de postagens que acompanho por dia. Acredita que tem gente que duvida da vítima até mesmo quando há provas? Até mesmo quando o abusador assume o crime? Eu acredito. Eu vi."}, {"639c": "Não sei o que fazer. Sinto vontade de chorar, gritar e fazer o planeta Terra parar em nome das merdas que as pessoas têm na cabeça. Talvez seja um desejo de saber o que se passa na mente do outro, saber o que existe fora da minha bolha ou do meu próprio cérebro. Talvez se trate de um desejo de conhecer o diferente, ou mesmo uma busca por uma fagulha de esperança em meio ao caos. Talvez eu seja uma dessas pessoas que só gosta de ver o mundo pegar fogo e, frequentemente, discutir com quem riscou o fósforo."}, {"d27e": "O ponto mais alto da minha loucura foi quando meu celular travou no meio de uma discussão. Estava numa festa e fui ao banheiro, aproveitando para checar as notificações e conferir como iam os comentários do jornal O Tempo. Um sujeito daqueles grandes e agressivos defendia o porte de armas e falava em matar homossexuais, e apontei a incoerência desse discurso com a foto de capa do homem. No perfil dele, Jesus me encarava com olhos amorosos, brilhando na tela trincada do meu celular. Ele me chamou de arrombada, “feminazi”, puta e mal comida. Meu celular travou, superaquecendo, e logo me vi chorando e pisando no aparelho dentro de um banheiro sujo da casa de alguém. Batiam na porta pedindo para que eu saísse, a fila estava grande, e eu pensava que deveria ir para casa para responder o fulano com a foto de capa de Jesus."}, {"94ef": "No mês passado, deletei o Facebook. Fiquei ansiosa, mordi cada cantinho das minhas unhas até sair sangue. Comecei a perguntar para as pessoas qual a opinião delas sobre tudo. Será que elas apoiam o Bolsonaro? O que acham da hashtag de denúncia do momento? Elas acreditam que o Bruno se reabilitou na cadeia? Será que elas viram o último Amor&Sexo? Será que acharam transgressor ou libertino? Logo meus amigos começaram a me evitar, já que passei a querer debater em todas as mesas de bar, festas, velórios e chás de bebê."}, {"2976": "Não saber me corroeu por dentro. Não via sentido na internet mais, e, portanto, não via sentido na minha própria vida. Na verdade, já tem um tempo que o interesse pelos comentários — do Facebook, do G1, do Instagram, do Reddit e do 4chan, que seja — se tornou a única coisa na qual consigo pensar. Meu regime sem os comentários do Facebook durou apenas uma semana e, ao voltar, passei 3 horas seguidas me deleitando nas páginas dos portais de notícia. Deixei de comer e de dormir, tornando-me uma escrava da imbecilidade alheia. Ainda não me recuperei. Meus amigos já não falam comigo, mas sempre tenho alguém com quem discutir nos comentários."}, {"39d9": "Esse é meu comentário de despedida, o fim de todas as minhas discussões. Já não aguento mais — é minha última confissão, meu último pedido de ajuda e súplica antes de ir embora sem deixar vestígios. Me apagar, como se apaga um comentário, três cliques, Tem certeza? Tenho. E já não existirei mais."}, {"f03f": "Puff."}, {"7d01": "Gostou? Clique no ❤ e deixe um comentário, ele é muito importante para nós!"}, {"e126": "Não deixe de nos seguir e curtir nas redes sociais: Twitter; Facebook; Instagram."}, {"454d": "Não perca nenhum texto, assine a nossa Newsletter:"}, {"dba0": "Revista Subjetiva by Revista SubjetivaEdit descriptiontinyletter.com"}], "child": "1029_1\t1029_2\t1029_3\t1029_4\t1029_5\t1029_6\t1029_7\t1029_81029_1\t1029_2\t1029_3\t1029_4\t1029_5\t1029_6\t1029_7\t1029_8"}