{"sentences": [{"2bfa": "Canals of the World, Photographed from Space"}, {"30ce": "We have a host of modern-day gongoozlers here at Planet. From behind our computer screens we can observe a ton of activity in canals. It’s fun to see container ships, personal watercraft, cruise ships and water taxis zip through the world’s manmade waterways every day. Check out some of the imagery that has fascinated Planet’s contingent of canal enthusiasts:"}, {"8698": "Venice, Italy"}, {"5417": "We can’t talk about canals without first highlighting the floating city of Venice, Italy. From space, we get a different view of the canals that inspired Turner, Monet and Canaletto:"}, {"c94e": "Venice, Italy. Captured April 21, 2016. RapidEye images ©2016 Planet Labs, Inc. cc-by-sa 4.0."}, {"5acd": "Venice’s Grand Canal snakes through the city center. While wide enough to accommodate large Renaissance-era merchant vessels, the canal is now mostly home to bevy of water taxis, gondolas and personal watercraft."}, {"7e6b": "Saint Petersburg, Russia"}, {"f0f8": "If we travel over 1500 kilometers northeast, we find a “Venice of the North” with an impressive (and beautiful) canal system: Saint Petersburg, Russia."}, {"f398": "Saint Petersburg, Russia. Captured May 6, 2016. RapidEye images ©2016 Planet Labs, Inc. cc-by-sa 4.0."}, {"4d3c": "Over 300 bridges criss-cross the Neva River and its associated canals in Saint Petersburg proper. The canals in the port city’s historical city center were built in the 19th Century and modeled after those seen in prominent cities in Western Europe, like Venice."}, {"ce83": "Cape Coral, Florida"}, {"409b": "In the last century, another not-so-famous canal city emerged in the United States: Cape Coral, Florida. Cape Coral has no shortage of “waterfront property” — with over 640 kilometers of navigable canals, Cape Coral has more canals within its limits than any other city in the world."}, {"8d2a": "Cape Coral, Florida. Captured August 22, 2016. Planetscope images ©2016 Planet Labs, Inc. cc-by-sa 4.0"}, {"3ca8": "While many of these master-planned canals are navigable, several do not provide an outlet into the Gulf of Mexico."}, {"438b": "While many cities utilize canals for civilian transportation and aesthetics, several modern canals of were built to improve shipping routes."}, {"1b77": "Suez Canal, Egypt"}, {"f7ad": "The Suez Canal provides an access route between the Mediterranean Sea and the Red Sea, allowing ships to pass through the Isthmus of Suez rather than sail around Africa."}, {"e0dd": "Suez Canal, Egypt. Captured May 31, 2016. PlanetScope images ©2016 Planet Labs, Inc. cc-by-sa 4.0"}, {"5899": "Completed in 1869, the Suez Canal is 193.3 kilometers long. The Suez doesn’t have a lock system — ships can navigate straight through the canal, shaving about 7,000 kilometers off of their trip."}, {"a093": "Ara Canal, South Korea"}, {"4d42": "Some canals, like South Korea’s Ara Canal, help ships avoid geopolitical hotspots."}, {"3088": "Ara Canal, South Korea. Captured March 13, 2015. Dove images ©2016 Planet Labs, Inc. cc-by-sa 4.0"}, {"5736": "The Ara Canal, a manmade channel completed in 2011, redirects cargo and civilian ships from the Han River to the Yellow Sea. The Han’s natural path runs through the heart of Seoul and empties into the sea near the Northern Limit Line — a disputed maritime border between North and South Korea. The canal’s grass-lined banks are a popular weekend spot for city-dwellers looking for some *semi* natural beauty."}, {"3621": "Panama Canal"}, {"fd7d": "And then there’s Panama. The canal’s complex series of locks—an early 20th century engineering marvel—can raise ships as large as a city block 26 meters (85 feet) above sea level. In the animation, it’s easy to see the canal’s newly expanded locks, designed to double its traffic capacity. The expansion project began in 2007, taking almost a decade to complete. At the time this imagery was captured, the expanded locks on the Pacific side had been open only for two weeks. Check out this flyover:"}, {"eee6": "Panama City, Miraflores locks, and Pedro Miguel Locks. Captured July 19, 2016. Planetscope images ©2016 Planet Labs, Inc"}, {"c4cf": "See more intriguing Earth imagery in Planet’s online gallery."}], "content": "Canals of the World, Photographed from Space We have a host of modern-day gongoozlers here at Planet. From behind our computer screens we can observe a ton of activity in canals. It’s fun to see container ships, personal watercraft, cruise ships and water taxis zip through the world’s manmade waterways every day. Check out some of the imagery that has fascinated Planet’s contingent of canal enthusiasts: Venice, Italy We can’t talk about canals without first highlighting the floating city of Venice, Italy. From space, we get a different view of the canals that inspired Turner, Monet and Canaletto: Venice, Italy. Captured April 21, 2016. RapidEye images ©2016 Planet Labs, Inc. cc-by-sa 4.0. Venice’s Grand Canal snakes through the city center. While wide enough to accommodate large Renaissance-era merchant vessels, the canal is now mostly home to bevy of water taxis, gondolas and personal watercraft. Saint Petersburg, Russia If we travel over 1500 kilometers northeast, we find a “Venice of the North” with an impressive (and beautiful) canal system: Saint Petersburg, Russia. Saint Petersburg, Russia. Captured May 6, 2016. RapidEye images ©2016 Planet Labs, Inc. cc-by-sa 4.0. Over 300 bridges criss-cross the Neva River and its associated canals in Saint Petersburg proper. The canals in the port city’s historical city center were built in the 19th Century and modeled after those seen in prominent cities in Western Europe, like Venice. Cape Coral, Florida In the last century, another not-so-famous canal city emerged in the United States: Cape Coral, Florida. Cape Coral has no shortage of “waterfront property” — with over 640 kilometers of navigable canals, Cape Coral has more canals within its limits than any other city in the world. Cape Coral, Florida. Captured August 22, 2016. Planetscope images ©2016 Planet Labs, Inc. cc-by-sa 4.0 While many of these master-planned canals are navigable, several do not provide an outlet into the Gulf of Mexico. While many cities utilize canals for civilian transportation and aesthetics, several modern canals of were built to improve shipping routes. Suez Canal, Egypt The Suez Canal provides an access route between the Mediterranean Sea and the Red Sea, allowing ships to pass through the Isthmus of Suez rather than sail around Africa. Suez Canal, Egypt. Captured May 31, 2016. PlanetScope images ©2016 Planet Labs, Inc. cc-by-sa 4.0 Completed in 1869, the Suez Canal is 193.3 kilometers long. The Suez doesn’t have a lock system — ships can navigate straight through the canal, shaving about 7,000 kilometers off of their trip. Ara Canal, South Korea Some canals, like South Korea’s Ara Canal, help ships avoid geopolitical hotspots. Ara Canal, South Korea. Captured March 13, 2015. Dove images ©2016 Planet Labs, Inc. cc-by-sa 4.0 The Ara Canal, a manmade channel completed in 2011, redirects cargo and civilian ships from the Han River to the Yellow Sea. The Han’s natural path runs through the heart of Seoul and empties into the sea near the Northern Limit Line — a disputed maritime border between North and South Korea. The canal’s grass-lined banks are a popular weekend spot for city-dwellers looking for some *semi* natural beauty. Panama Canal And then there’s Panama. The canal’s complex series of locks—an early 20th century engineering marvel—can raise ships as large as a city block 26 meters (85 feet) above sea level. In the animation, it’s easy to see the canal’s newly expanded locks, designed to double its traffic capacity. The expansion project began in 2007, taking almost a decade to complete. At the time this imagery was captured, the expanded locks on the Pacific side had been open only for two weeks. Check out this flyover: Panama City, Miraflores locks, and Pedro Miguel Locks. Captured July 19, 2016. Planetscope images ©2016 Planet Labs, Inc See more intriguing Earth imagery in Planet’s online gallery. ", "parent": "", "title": "Canals of the World, Photographed from Space", "child": "103_1\t103_2\t103_3\t103_4\t103_5\t103_6\t103_7\t103_8\t103_9", "name": "103"}