{"name": "1030", "parent": "", "content": "Quando a gente sabe que é amor? Não é num estalo mágico. Ou é? A Ana já estava na sexta rodada de cachaça de banana, e no mínimo o dobro de cerveja, quando levantou uma questão importantíssima na mesa. — Rafa, quando a gente sabe que é amor? A Ana tinha esse olhar perdido de quem olha para as estrelas como se olhasse uma pintura de Monet (sem entender porra nenhuma). Ela fazia isso agora, de modo que eu não sabia se a pergunta foi retórica ou se era pra mim mesma. — Mano, sei lá. Quando a gente fala eu te amo. Lembrei da vez que falei que amava o Zeca. Eu não amava ele, mas a maré mansa dos relacionamentos às vezes nos puxa para o mar aberto, deixando somente a bóia do \"eu te amo\" pra gente se segurar. A Ana percebeu meu erro de cara. — Rafa, não pode ser, cara. A gente fala que ama até pro garçom. — Nisso, a Ana segurou gentilmente no braço do garçom que passava — Theo, eu te amo! — Ô, dona, a gente também te ama! — e saiu. Gaitamos. Eu, que não queria ficar pra trás, pedi uma dose dupla de cachacinha. A Ana me acompanhou. Tentei puxar o papo pro lado de séries. Não adiantou. — Rafa, é sério. Quando a gente ama? Tipo, quando que a gente olha no espelho e fala \"fodeu, tô amando\". — Quando a gente…pensa na pessoa toda hora? — Não, mano, isso é obsessão. — Ana passou a mão pelos seus cabelos curtos e cor-de-rosa levemente — eu queria ficar com o filha-da-puta do André toda hora. Mas eu era ingênua e ele mandava bem. Eu não amava ele, eu precisava. — Ele transava bem? — Uhum. O Thales foi assim, pra mim, mas eu não quis falar pra ela que já tinha transado com ele. Era primo dela, ela ia rir da minha cara. — Ué, Ana. Onde você quer chegar? Você não tá gostando mais do Gusta? — Não, não. O Gusta é ótimo. É legal, tem um papo cabeça, não surta só de pensar em filhos e cozinha bem. Eu devia amar ele. E se pá eu amo. Mas cadê a certeza? — E novamente Ana cutuca o garçom — Theo, quando a gente sabe que é amor de verdade? O garçom, largando mais um litrão gelado na mesa, que abre com um estampido, responde. — Quando traz cerveja gelada? Caímos na risada novamente. — Cara, tipo, eu sei que eu amo meu trabalho. Eu amo ilustrar. Eu trabalho de casa, tem dia que eu começo a trabalhar meia-noite e durmo até meio-dia. Eu tenho certeza que eu amo meu trabalho. Todo dia eu acordo e penso: \"caralho, eu faria isso até de graça se eu tivesse grana pra caralho\". Mas com relacionamento não. Eu nunca acordei todo dia pensando \"caralho, eu amo essa porra mais que minha vida toda!\". Durante o papo, comecei a me incomodar. A Ana sempre foi super aberta e tranquila pra falar que não amava os caras que ela estava, mas eu sempre amei os meus. Ou achava que amava. Para cada um dos namoros e casos-de-mais-de-um-mês deixei escapar um eu te amo aqui e outro ali. E tinha aquela certeza de Vinícius de Moraes de que eu havia amado cada um deles. Mas, nesse momento, comecei a separá-los em caixinhas. Carência. Amizade. Fase da vida. Resolvi me apegar nessa teoria para defender a minha própria vida. — Ana, eu acho que amor é uma palavra que inventaram pra agrupar um monte de sentimentos. Mesmo quando restringimos só para relacionamentos amorosos e sexuais, tem um monte de amor diferente. Carência, amizade, fase da vida. Nem por isso é menos amor. Acho que é isso. — Você explicou o tipo. Mas quando que a gente sabe? — Ana disse, com a cachaça fazendo com que ela se demorasse em algumas palavras. Sabe quando você se sentiu carente e — pá! — ligou pro Ronaldo pra dar uns beijos e depois quis dizer que amava ele? Aquilo não deixa de ser amor. Naquele momento era amor. Amor não precisa ser daqui pra sempre, pode ser daqui pra daqui à pouco. Pode largar um \"eu te amo\" sem medo. — Encerrei tão confiante que virei o copo de cerveja, devolvendo-o com estrondo para a mesa de metal. Ana, bêbada como estava, levantou para me aplaudir. Sem querer, ela puxou um coro de \"Parabéns à Você\" no bar. Não era meu aniversário. — Senta, idiota! Depois de mais risadas e mais uma rodada de cachaça, Ana volta a me torrar a paciência. — Rafa, você é muito decidida. Você tem certeza que ama o Léo. Às vezes dá vontade de ser mais assim. Tinha certeza? Eu nunca acordei em polvorosa por ele ter me amado ou estar comigo. Eu gostava da companhia dele e nós combinávamos em um monte de coisa. Era isso, e eu sempre achei que o nome disso era amor. Até agora. — Ana, vira essa porra e para de fazer pergunta difícil. Mais uma dose. Mais uma e mais uns litrões. Deu a hora. Durante a volta pra casa o negócio bateu, a tontura chegou, o estômago se inverteu. Cheguei em casa tropeçando, o Léo acordou. — Caralho, Rafa! Duas e meia e essa barulheira. — Léo, me azzuda aqui! — mal dá tempo de chegar no banheiro. BLHAUSSSH. Tchau, tchau, cachaça, cerveja e torresmo do bar. Léo segura meu cabelo. Vejo a risadinha de canto de boca do sacana. — Para de rir, seu sacana! — Tequila? — Teu cu! — ele sabia que eu odiava tequila. — Quer que eu faça um misto quente? Depois de me recompor, escovar os dentes e me ajeitar na cama. Léo chega trazendo o lanche. O teto girava. — Amor, eu vou ficar de muita ressaca amanhã? — Deixei um remédio e dois copos de água ali. Bebe um hoje e outro amanhã, com o remédio. Vai ficar zerada. O misto tava bom? — Sei lá. Ele vira e vê que consegui comer só metade. — Cuidado com as formigas nesse resto aí. Qualquer coisa grita. — e virou pra dormir. Que homão da porra. — Léo, eu te amo. — Hmmmmm. E, sim, era amor mesmo. Pelo menos até chegar a ressaca. Se você gostou, deixa um ❤️ aí. Isso faz com que o texto alcance mais pessoas. Acompanhe todas as histórias da Revista Simbiose. ", "title": "Quando a gente sabe que é amor?", "sentences": [{"4897": "Quando a gente sabe que é amor?"}, {"7704": "Não é num estalo mágico. Ou é?"}, {"efa5": "A Ana já estava na sexta rodada de cachaça de banana, e no mínimo o dobro de cerveja, quando levantou uma questão importantíssima na mesa."}, {"b417": "— Rafa, quando a gente sabe que é amor?"}, {"540e": "A Ana tinha esse olhar perdido de quem olha para as estrelas como se olhasse uma pintura de Monet (sem entender porra nenhuma). Ela fazia isso agora, de modo que eu não sabia se a pergunta foi retórica ou se era pra mim mesma."}, {"bee9": "— Mano, sei lá. Quando a gente fala eu te amo."}, {"b899": "Lembrei da vez que falei que amava o Zeca. Eu não amava ele, mas a maré mansa dos relacionamentos às vezes nos puxa para o mar aberto, deixando somente a bóia do \"eu te amo\" pra gente se segurar. A Ana percebeu meu erro de cara."}, {"7823": "— Rafa, não pode ser, cara. A gente fala que ama até pro garçom. — Nisso, a Ana segurou gentilmente no braço do garçom que passava — Theo, eu te amo!"}, {"2e71": "— Ô, dona, a gente também te ama! — e saiu."}, {"edca": "Gaitamos. Eu, que não queria ficar pra trás, pedi uma dose dupla de cachacinha. A Ana me acompanhou. Tentei puxar o papo pro lado de séries. Não adiantou."}, {"d1cf": "— Rafa, é sério. Quando a gente ama? Tipo, quando que a gente olha no espelho e fala \"fodeu, tô amando\"."}, {"48e0": "— Quando a gente…pensa na pessoa toda hora?"}, {"18cd": "— Não, mano, isso é obsessão. — Ana passou a mão pelos seus cabelos curtos e cor-de-rosa levemente — eu queria ficar com o filha-da-puta do André toda hora. Mas eu era ingênua e ele mandava bem. Eu não amava ele, eu precisava."}, {"bd3f": "— Ele transava bem?"}, {"7f2e": "— Uhum."}, {"ec91": "O Thales foi assim, pra mim, mas eu não quis falar pra ela que já tinha transado com ele. Era primo dela, ela ia rir da minha cara."}, {"d6fa": "— Ué, Ana. Onde você quer chegar? Você não tá gostando mais do Gusta?"}, {"a0b4": "— Não, não. O Gusta é ótimo. É legal, tem um papo cabeça, não surta só de pensar em filhos e cozinha bem. Eu devia amar ele. E se pá eu amo. Mas cadê a certeza? — E novamente Ana cutuca o garçom — Theo, quando a gente sabe que é amor de verdade?"}, {"338a": "O garçom, largando mais um litrão gelado na mesa, que abre com um estampido, responde."}, {"65ae": "— Quando traz cerveja gelada?"}, {"68c0": "Caímos na risada novamente."}, {"5883": "— Cara, tipo, eu sei que eu amo meu trabalho. Eu amo ilustrar. Eu trabalho de casa, tem dia que eu começo a trabalhar meia-noite e durmo até meio-dia. Eu tenho certeza que eu amo meu trabalho. Todo dia eu acordo e penso: \"caralho, eu faria isso até de graça se eu tivesse grana pra caralho\". Mas com relacionamento não. Eu nunca acordei todo dia pensando \"caralho, eu amo essa porra mais que minha vida toda!\"."}, {"712d": "Durante o papo, comecei a me incomodar. A Ana sempre foi super aberta e tranquila pra falar que não amava os caras que ela estava, mas eu sempre amei os meus. Ou achava que amava. Para cada um dos namoros e casos-de-mais-de-um-mês deixei escapar um eu te amo aqui e outro ali. E tinha aquela certeza de Vinícius de Moraes de que eu havia amado cada um deles. Mas, nesse momento, comecei a separá-los em caixinhas."}, {"e250": "Carência. Amizade. Fase da vida. Resolvi me apegar nessa teoria para defender a minha própria vida."}, {"6d88": "— Ana, eu acho que amor é uma palavra que inventaram pra agrupar um monte de sentimentos. Mesmo quando restringimos só para relacionamentos amorosos e sexuais, tem um monte de amor diferente. Carência, amizade, fase da vida. Nem por isso é menos amor. Acho que é isso."}, {"41b5": "— Você explicou o tipo. Mas quando que a gente sabe? — Ana disse, com a cachaça fazendo com que ela se demorasse em algumas palavras."}, {"3b2e": "Sabe quando você se sentiu carente e — pá! — ligou pro Ronaldo pra dar uns beijos e depois quis dizer que amava ele? Aquilo não deixa de ser amor. Naquele momento era amor. Amor não precisa ser daqui pra sempre, pode ser daqui pra daqui à pouco. Pode largar um \"eu te amo\" sem medo. — Encerrei tão confiante que virei o copo de cerveja, devolvendo-o com estrondo para a mesa de metal."}, {"0eaf": "Ana, bêbada como estava, levantou para me aplaudir. Sem querer, ela puxou um coro de \"Parabéns à Você\" no bar. Não era meu aniversário."}, {"ec7b": "— Senta, idiota!"}, {"2b04": "Depois de mais risadas e mais uma rodada de cachaça, Ana volta a me torrar a paciência."}, {"abab": "— Rafa, você é muito decidida. Você tem certeza que ama o Léo. Às vezes dá vontade de ser mais assim."}, {"5db8": "Tinha certeza? Eu nunca acordei em polvorosa por ele ter me amado ou estar comigo. Eu gostava da companhia dele e nós combinávamos em um monte de coisa. Era isso, e eu sempre achei que o nome disso era amor. Até agora."}, {"4bda": "— Ana, vira essa porra e para de fazer pergunta difícil."}, {"fe5e": "Mais uma dose. Mais uma e mais uns litrões. Deu a hora."}, {"ae04": "Durante a volta pra casa o negócio bateu, a tontura chegou, o estômago se inverteu."}, {"d2eb": "Cheguei em casa tropeçando, o Léo acordou."}, {"ed65": "— Caralho, Rafa! Duas e meia e essa barulheira."}, {"20b7": "— Léo, me azzuda aqui! — mal dá tempo de chegar no banheiro. BLHAUSSSH. Tchau, tchau, cachaça, cerveja e torresmo do bar."}, {"3b6a": "Léo segura meu cabelo. Vejo a risadinha de canto de boca do sacana."}, {"ad92": "— Para de rir, seu sacana!"}, {"cbaf": "— Tequila?"}, {"64cc": "— Teu cu! — ele sabia que eu odiava tequila."}, {"c6f5": "— Quer que eu faça um misto quente?"}, {"4cf8": "Depois de me recompor, escovar os dentes e me ajeitar na cama. Léo chega trazendo o lanche. O teto girava."}, {"0ffa": "— Amor, eu vou ficar de muita ressaca amanhã?"}, {"7ab9": "— Deixei um remédio e dois copos de água ali. Bebe um hoje e outro amanhã, com o remédio. Vai ficar zerada. O misto tava bom?"}, {"befd": "— Sei lá."}, {"6f77": "Ele vira e vê que consegui comer só metade."}, {"6ca8": "— Cuidado com as formigas nesse resto aí. Qualquer coisa grita. — e virou pra dormir."}, {"ff31": "Que homão da porra."}, {"728f": "— Léo, eu te amo."}, {"beaa": "— Hmmmmm."}, {"30b8": "E, sim, era amor mesmo. Pelo menos até chegar a ressaca."}, {"622c": "Se você gostou, deixa um ❤️ aí. Isso faz com que o texto alcance mais pessoas."}, {"6dce": "Acompanhe todas as histórias da Revista Simbiose."}], "child": "1030_1\t1030_2\t1030_3\t1030_41030_1\t1030_2\t1030_3\t1030_41030_1\t1030_2\t1030_3\t1030_4"}