{"name": "1032", "parent": "", "content": "A Chechênia é aqui Diversos veículos de comunicação russos denunciaram na última semana a existência de um campo de concentração destinado a prender, torturar e assassinar LGBTs na Chechênia, uma das repúblicas da Federação Russa. Os relatos apontam que pelo menos 100 pessoas foram raptadas e que 3 delas foram mortas por conta de sua orientação sexual. Autoridades locais rechaçam a possibilidade da existência de tal campo. O líder checheno, Razman Kadyrov, um dos responsáveis pela implantação de leis muçulmanas na região, informou, por meio de um porta-voz, que a denúncia é falsa, pois não existem homossexuais na Chechênia e, se existissem, “não haveria necessidade de leis punitivas porque os próprios parentes ficariam responsáveis por mandá-los a um lugar de onde não retornariam”. Deixemos a veracidade dessa notícia para uma discussão à parte. Concentremo-nos na discussão que ela nos permite fazer neste momento: que rumos a LGBTfobia tem tomado, em especial, no nosso país? Será que o Brasil está muito distante da Chechênia, região dominada pelo extremismo? Tomemos como exemplos o espancamento da travesti Dandara e o assassinato de Itaberli Lozano pela própria mãe, dentre tantos outros casos que, todos os dias, surgem no nosso país. O Brasil não precisa de um campo de concentração para prender e matar LGBTs. O Brasil faz isso em plena luz do dia, em meio aos pedestres, diante dos nossos olhos, no seio familiar e no trabalho. Não somos encarcerados pela nossa orientação sexual ou identidade de gênero neste país. Mas somos igualmente mortos. Desde a nossa classe política, até as nossas relações familiares, a sociedade brasileira é LGBTfóbica e incentiva o extermínio de minorias sexuais e de gênero. Por isso, LGBTs vivem suas vidas com medo. Por isso, casais LGBTs saem às ruas com medo. Por isso, ser LGBT no Brasil é sinônimo de sentir medo. Não estamos muito distantes da Chechênia. Com ou sem campo de concentração, a LGBTfobia mostra sua face em todos os lugares. Aqui, de forma mais velada. Lá, de forma explícita. Lá, as mortes motivadas por LGBTfobia são punições pelo “crime” de ser diverso. Aqui, as mortes motivadas por LGBTfobia são punições pelo “pecado” de ser diverso. Lá, pecado e crime são a mesma coisa. Aqui, não mais. Mas ainda existem aqueles que pensam que sim. Por isso, a vida de um LGBT no Brasil é um campo de concentração. Afinal, nunca se sabe em qual esquina o carrasco aparecerá. Mas o que se sabe é que existem muitas Dandaras e Itaberlis por aí, que morrem ser serem noticiados. O que se sabe é que o medo é o denominador comum de todos os LGBTs desse país. Gostou? Clique no ❤ e deixe um comentário, ele é muito importante para nós! Não deixe de nos seguir e curtir nas redes sociais: Twitter; Facebook; Instagram. Não perca nenhum texto, assine a nossa Newsletter: Revista Subjetiva by Revista SubjetivaEdit descriptiontinyletter.com ", "title": "A Chechênia é aqui", "sentences": [{"f5b7": "A Chechênia é aqui"}, {"53cd": "Diversos veículos de comunicação russos denunciaram na última semana a existência de um campo de concentração destinado a prender, torturar e assassinar LGBTs na Chechênia, uma das repúblicas da Federação Russa. Os relatos apontam que pelo menos 100 pessoas foram raptadas e que 3 delas foram mortas por conta de sua orientação sexual."}, {"1fcd": "Autoridades locais rechaçam a possibilidade da existência de tal campo. O líder checheno, Razman Kadyrov, um dos responsáveis pela implantação de leis muçulmanas na região, informou, por meio de um porta-voz, que a denúncia é falsa, pois não existem homossexuais na Chechênia e, se existissem, “não haveria necessidade de leis punitivas porque os próprios parentes ficariam responsáveis por mandá-los a um lugar de onde não retornariam”."}, {"1fe6": "Deixemos a veracidade dessa notícia para uma discussão à parte. Concentremo-nos na discussão que ela nos permite fazer neste momento: que rumos a LGBTfobia tem tomado, em especial, no nosso país? Será que o Brasil está muito distante da Chechênia, região dominada pelo extremismo?"}, {"8ca1": "Tomemos como exemplos o espancamento da travesti Dandara e o assassinato de Itaberli Lozano pela própria mãe, dentre tantos outros casos que, todos os dias, surgem no nosso país."}, {"fb2c": "O Brasil não precisa de um campo de concentração para prender e matar LGBTs. O Brasil faz isso em plena luz do dia, em meio aos pedestres, diante dos nossos olhos, no seio familiar e no trabalho. Não somos encarcerados pela nossa orientação sexual ou identidade de gênero neste país. Mas somos igualmente mortos."}, {"aa1a": "Desde a nossa classe política, até as nossas relações familiares, a sociedade brasileira é LGBTfóbica e incentiva o extermínio de minorias sexuais e de gênero. Por isso, LGBTs vivem suas vidas com medo. Por isso, casais LGBTs saem às ruas com medo. Por isso, ser LGBT no Brasil é sinônimo de sentir medo."}, {"4b31": "Não estamos muito distantes da Chechênia. Com ou sem campo de concentração, a LGBTfobia mostra sua face em todos os lugares. Aqui, de forma mais velada. Lá, de forma explícita. Lá, as mortes motivadas por LGBTfobia são punições pelo “crime” de ser diverso. Aqui, as mortes motivadas por LGBTfobia são punições pelo “pecado” de ser diverso. Lá, pecado e crime são a mesma coisa. Aqui, não mais. Mas ainda existem aqueles que pensam que sim."}, {"c7f3": "Por isso, a vida de um LGBT no Brasil é um campo de concentração. Afinal, nunca se sabe em qual esquina o carrasco aparecerá. Mas o que se sabe é que existem muitas Dandaras e Itaberlis por aí, que morrem ser serem noticiados. O que se sabe é que o medo é o denominador comum de todos os LGBTs desse país."}, {"0984": "Gostou? Clique no ❤ e deixe um comentário, ele é muito importante para nós!"}, {"e126": "Não deixe de nos seguir e curtir nas redes sociais: Twitter; Facebook; Instagram."}, {"454d": "Não perca nenhum texto, assine a nossa Newsletter:"}, {"dba0": "Revista Subjetiva by Revista SubjetivaEdit descriptiontinyletter.com"}], "child": "1032_11032_11032_11032_1"}