{"name": "1033", "parent": "", "content": "Congresso Nacional se distancia da sociedade na velocidade de seu desgate | Foto Agência Brasil ­­Vitória do táxi sobre o Uber e os interesses que movem as votações no Congresso A crise de representatividade da política, em especial do Parlamento, está na origem das principais causas dos movimentos de protesto ocorridos a partir de 2008 em várias partes do mundo. A chamada Revolução das Panelas, na Islândia, uma ilha no Atlântico Norte, entre a Europa continental e a Groelândia, com 320 mil habitantes, começou em outubro de 2008, depois que três grandes bancos, com a conivência do governo e do Parlamento, levaram o país à bancarrota. Os manifestantes exigiram a renúncia do governo, a realização de novas eleições e a elaboração de uma nova Constituição por considerarem que os políticos e seus partidos estavam subordinados à elite econômica. E conseguiram mudar o governo. Na Tunísia, origem da Primavera Árabe, a autoimolação do vendedor ambulante Mohamed Bouazizi, em 17 de dezembro de 2010, desencadeou protestos espontâneos por todo o país, até chegar às grandes manifestações em que o povo gritava “degage” (fora) para todos os poderes constituídos, representados por políticos corruptos, especuladores financeiros, policiais violentos e mídia subserviente. Histórias semelhantes em 2011 ocorreram no Egito, na Líbia (que derrubaram os governos), na Síria, (desencadeando a guerra que já dura seis anos, deixou 5 milhões de refugiados e já matou quase 500 mil pessoas), com reverberações na Argélia, Jordânia, Mauritânia, Kwait, Arábia Saudita, entre outros. Os protestos seguiram com os Indignados na Espanha e nos Estados Unidos com Occupy Wall Street. A crise de representatividade das instituições também foi pano de fundo das manifestações que estouraram no Brasil dois anos depois da Primavera Árabe, em 2013. A história recente do país ainda carece de uma profunda análise científica, mas independentemente desse necessário estudo, é possível afirmar que no Brasil as insatisfações populares não redundaram em profundas transformações institucionais. A exceção, para confirmar a regra, foi a troca de mãos no comando do Palácio do Planalto, com o impeachment de Dilma Rousseff. O furacão que derrubou Dilma, contudo, não atingiu as demais instituições brasileiras, como o Parlamento, para ficar apenas no tema deste artigo. A aprovação do projeto de lei 5.587/2016, pela Câmara dos Deputados, na terça-feira (4), deve ser vista sob este contexto sócio-político. A proposta aprovada é de autoria do deputado Carlos Zaratini (PT/SP) e mais quatro colegas, Luiz Carlos Ramos (PTN/RJ), o hoje Ministro da Justiça Osmar Serraglio (PMDB/PR), Laudivio Carvalho (SD/MG) e Rôney Nemer (PP/DF). Sob o pretexto de regulamentar aplicativos de transporte individual, a Câmara dos Deputados aprovou um projeto que fere de morte o Uber e aplicativos similares. Inicialmente, um substitutivo apresentado ao projeto original definia o serviço de transporte remunerado privado individual de passageiros como atividade de natureza privada. Dois destaques retiraram do texto esse trecho e ainda determinou os municípios a regulamentação do serviço. Se o Senado referendar o projeto, o serviço passará a ser de natureza pública. Em outras palavras, a prestação de serviço de transporte individual continuará a ser exclusividade dos taxistas, o que inviabilizará os aplicativos. Como foi possível a aprovação desse projeto se a população brasileira usa e aprova o novo serviço introduzido pelo Uber no Brasil e que atualmente já conta com outros aplicativos, como Cabify, 99 e Easy? Doutor em Direito e mestre em Economia, Bruno Carazza, fez esta e outras perguntas em Investigando a fundo o crime do projeto que pretende acabar com a Uber: um pequeno manual de análise legislativa, em seu site Leis e Números. Para responder suas perguntas, ele criou um passo a passo para análise do projeto de lei aprovado, que resumo a seguir. Passo nº 1 — Descubra quem é o autor do projeto, qual é o seu partido e de que região ele vem. Os cinco autores do PL 5.587/2016 são de partidos e regiões diferentes. Foi uma ação suprapartidária, capitaneada por representantes das regiões mais populosas do país. Passo nº 2 — Leia a justificativa “[…] É imperiosa correção do texto [lei anterior] para sepultar as dúvidas e manter incólume a regulamentação dos serviços de transporte público individual de passageiros nos Municípios brasileiros, haja vista que o crescimento do transporte clandestino, inclusive por meios tecnológicos, está impactando negativamente na gestão pública, além de desconstruir o mercado de táxi, invadir o campo restrito ao profissional taxista e causar insegurança aos consumidores”, diz a justificativa. Como diz Carazza, “O PL tinha dois objetivos claros, proteger os taxistas e assegurar o poder estadual de regular os aplicativos e sua relação com os consumidores”. Passo nº 3 — Procure encontrar o vínculo entre os políticos e os grupos de interesses Há no Congresso uma Frente Parlamentar em Defesa dos Interesses da Classe dos Taxistas. Seu presidente é o autor do PL, Carlos Zarattini. Todos os demais autores, à exceção do ministro Osmar Serraglio, fazem parte dessa frente parlamentar. Passo nº 4 — Pesquise a tramitação do projeto de lei Entre a apresentação do PL, em 15 de junho de 2016, e sua votação em 4 de abril, passaram-se apenas 10 meses, uma tramitação muito acelerada em relação à média dos demais projetos de autoria parlamentar, de 1,7 mil dias para virar lei. Isso foi possível graças a uma série de manobras regimentais, que vão desde a anexação do projeto original a projetos similares, até a ajuda do presidente da Câmara, Rodrigo Maia (PFL/RJ) para acelerar sua aprovação nas comissões da casa. Maia também é membro da frente parlamentar de apoio aos taxistas. Passo nº 5 — Analise o que foi colocado em votação Várias mudanças foram feitas no projeto original para facilitar sua tramitação. O projeto original visava proteger o mercado de transporte individual para os taxistas, mas foi flexibilizado. Recebeu um substitutivo que permitia a atuação de motoristas autônomos, mas exigia a regulamentação pelos municípios. Passo nº 6 — Nem tudo o que é aprovado é votado A votação do PL 5.587/2016 foi simbólica. Por este sistema, o projeto não é discutido em plenário e aprovado pela maioria silenciosa que “permanece como está”, sem se manifestar. São poucos segundos entre discussão e aprovação. Essas votações ocorrem quando há acordo prévio entre os líderes partidários para aprovar o texto do relator. Passo nº 7 — Fique de olho na votação dos destaques Os partidos têm a prerrogativa de pedir a votação de “destaques”, recurso previsto no Regimento Interno pode alterar pontos do texto aprovado. Por meio do PT, Carlos Zarattini pediu a votação de dois destaques. O primeiro retirava a classificação da atividade dos aplicativos como de natureza privada e exigia que os veículos utilizados fossem de aluguel, e não de particulares e o segundo exigia que os motoristas de Uber e Cabify fossem autorizados a trabalhar pela autoridade municipal, não mais por meio de cadastros diretos no aplicativo. Os dois destaques recuperaram o teor do PL original favorável aos taxistas. Passo nº 8 — Analise como cada partido se posicionou Bruno Carazza analisou os votos dos parlamentes por bancada. Ele concluiu que os partidos ideologicamente mais à esquerda (PT, PC do B, e PSOL) votaram a favor de atribuir aos municípios o poder de regulamentar as atividades dos aplicativos e que os partidos mais à direita (PMDB, PSDB, DEM, PP, PR e aliados) foram contra conceder mais poder aos municípios. Passo nº 9 — As traições dizem muita coisa Houve traição às orientações dos partidos, principalmente entre os conservadores, votando a favor de destaques que ajudaram os taxistas. As traições foram fundamentais (Carazza publicou em seu site duas planilhas analisando esses votos). Os taxistas representados pela Frente Parlamentar em Defesa dos Interesses da Classe dos Taxistas, formadores de opinião pública, tiveram mais força que os usuários dos serviços de transporte por meio de aplicativo. O projeto uniu várias pontas, observa Carazza, como partidos diferenciados, políticos de matizes ideológicos diferentes porque o Congresso tornou-se “ainda mais paroquial e corporativo nestes tempos de descrédito dos políticos tradicionais”. Neste ponto, chegamos a questão inicial deste artigo, a crise de representatividade do Parlamento. Norberto Bobbio tratou nos anos 80 do conflito entre o interesse nacional e o interesse particular. Observou que o Parlamento seria o lugar para fazer essa separação, mas ele mesmo conclui que o interesse dos partidos, que deve prevalecer sobre o do deputado isoladamente, também configura um interesse desse grupo, que nem sempre é o da sociedade. Bobbio chamou de “neocorporativismo” o sistema existente em boa parte dos Estados democráticos europeus que apenas media o interesse entre grupos sociais. No Brasil atual, a julgar pela posição da Câmara no conflito Uber x Taxi, não tem havido nem sequer essa mediação. “A discussão ocorreu entre esses dois interesses, o dos aplicativos e o dos taxistas. Mas e o interesse do cidadão? O que era melhor para ele? Essa questão não esteve presente nesse debate”, constatou o deputado federal Thiago Peixoto (PSD/GO), que votou contra o PL e os destaques. Se o corporativismo é uma das questões seminais da democracia, como Bobbio já demonstrou, ele atualmente pode ter se disseminado com ainda mais força em função, inclusive, do crescimento da crise de representatividade, como sugere Bruno Carazza e pode ser notado nas frentes parlamentares existentes na Câmara dos Deputados. Há nesta 55ª Legislatura (2015–2018) 271 frentes, 58% a mais do que há 14 anos, na 52ª Legislatura (2003–2006), quando havia 113. O crescimento dessas organizações parlamentares ocorreu ano a ano. Aumento de 17% entre a atual e a 54ª (2010–2014); de 46% entre esta e a 53ª (2007–2010), período de maior crescimento entre uma legislatura e a anterior; e de 7% da 53ª para a 52ª (2003–2006). A criação de frentes parlamentares aumentou na mesma proporção do crescimento da crise política. Segundo pesquisa Datafolha, divulgada em dezembro de 2016, 53% dos brasileiros reprovavam o Congresso Nacional, a pior avaliação desde junho de 1993, época do escândalo dos Anões do Orçamento, quando 56% reprovaram os parlamentares. A proliferação das frentes parlamentares não indica, como se poderia supor, aproximação entre o Congresso e a sociedade, mas o fortalecimento da relação dos congressistas com as corporações, conforme a hipótese levantada por Carazza. Os interesses econômicos e corporativos estão infiltrados na atividade parlamentar e influenciam não apenas o voto e comportamento de cada um, mas também as manobras regimentais, apresentação de emendas, de projetos de lei, e de substitutivos, concluiu em sua longa análise da votação deste PL. Como se pode perceber, muitos deputados se agarram a grupos privados, a exemplo dos taxistas, para aumentarem suas chances eleitorais exatamente quando a sociedade caminha em direção oposta à do Parlamento. Ao fazer esse movimento, os congressistas se distanciam mais do eleitor médio aumentando o fosso entre este e o Congresso. ", "title": "­­Vitória do táxi sobre o Uber e os interesses que movem as votações no Congresso", "sentences": [{"cb3c": "Congresso Nacional se distancia da sociedade na velocidade de seu desgate | Foto Agência Brasil"}, {"4418": "­­Vitória do táxi sobre o Uber e os interesses que movem as votações no Congresso"}, {"fd25": "A crise de representatividade da política, em especial do Parlamento, está na origem das principais causas dos movimentos de protesto ocorridos a partir de 2008 em várias partes do mundo."}, {"180e": "A chamada Revolução das Panelas, na Islândia, uma ilha no Atlântico Norte, entre a Europa continental e a Groelândia, com 320 mil habitantes, começou em outubro de 2008, depois que três grandes bancos, com a conivência do governo e do Parlamento, levaram o país à bancarrota."}, {"c361": "Os manifestantes exigiram a renúncia do governo, a realização de novas eleições e a elaboração de uma nova Constituição por considerarem que os políticos e seus partidos estavam subordinados à elite econômica. E conseguiram mudar o governo."}, {"6e95": "Na Tunísia, origem da Primavera Árabe, a autoimolação do vendedor ambulante Mohamed Bouazizi, em 17 de dezembro de 2010, desencadeou protestos espontâneos por todo o país, até chegar às grandes manifestações em que o povo gritava “degage” (fora) para todos os poderes constituídos, representados por políticos corruptos, especuladores financeiros, policiais violentos e mídia subserviente."}, {"7fd6": "Histórias semelhantes em 2011 ocorreram no Egito, na Líbia (que derrubaram os governos), na Síria, (desencadeando a guerra que já dura seis anos, deixou 5 milhões de refugiados e já matou quase 500 mil pessoas), com reverberações na Argélia, Jordânia, Mauritânia, Kwait, Arábia Saudita, entre outros. Os protestos seguiram com os Indignados na Espanha e nos Estados Unidos com Occupy Wall Street."}, {"1d57": "A crise de representatividade das instituições também foi pano de fundo das manifestações que estouraram no Brasil dois anos depois da Primavera Árabe, em 2013. A história recente do país ainda carece de uma profunda análise científica, mas independentemente desse necessário estudo, é possível afirmar que no Brasil as insatisfações populares não redundaram em profundas transformações institucionais."}, {"a786": "A exceção, para confirmar a regra, foi a troca de mãos no comando do Palácio do Planalto, com o impeachment de Dilma Rousseff. O furacão que derrubou Dilma, contudo, não atingiu as demais instituições brasileiras, como o Parlamento, para ficar apenas no tema deste artigo."}, {"41e4": "A aprovação do projeto de lei 5.587/2016, pela Câmara dos Deputados, na terça-feira (4), deve ser vista sob este contexto sócio-político. A proposta aprovada é de autoria do deputado Carlos Zaratini (PT/SP) e mais quatro colegas, Luiz Carlos Ramos (PTN/RJ), o hoje Ministro da Justiça Osmar Serraglio (PMDB/PR), Laudivio Carvalho (SD/MG) e Rôney Nemer (PP/DF)."}, {"9aa3": "Sob o pretexto de regulamentar aplicativos de transporte individual, a Câmara dos Deputados aprovou um projeto que fere de morte o Uber e aplicativos similares. Inicialmente, um substitutivo apresentado ao projeto original definia o serviço de transporte remunerado privado individual de passageiros como atividade de natureza privada."}, {"aec0": "Dois destaques retiraram do texto esse trecho e ainda determinou os municípios a regulamentação do serviço. Se o Senado referendar o projeto, o serviço passará a ser de natureza pública. Em outras palavras, a prestação de serviço de transporte individual continuará a ser exclusividade dos taxistas, o que inviabilizará os aplicativos."}, {"a58b": "Como foi possível a aprovação desse projeto se a população brasileira usa e aprova o novo serviço introduzido pelo Uber no Brasil e que atualmente já conta com outros aplicativos, como Cabify, 99 e Easy?"}, {"d6cf": "Doutor em Direito e mestre em Economia, Bruno Carazza, fez esta e outras perguntas em Investigando a fundo o crime do projeto que pretende acabar com a Uber: um pequeno manual de análise legislativa, em seu site Leis e Números."}, {"b50a": "Para responder suas perguntas, ele criou um passo a passo para análise do projeto de lei aprovado, que resumo a seguir."}, {"368d": "Passo nº 1 — Descubra quem é o autor do projeto, qual é o seu partido e de que região ele vem."}, {"1930": "Os cinco autores do PL 5.587/2016 são de partidos e regiões diferentes. Foi uma ação suprapartidária, capitaneada por representantes das regiões mais populosas do país."}, {"0044": "Passo nº 2 — Leia a justificativa"}, {"d7ba": "“[…] É imperiosa correção do texto [lei anterior] para sepultar as dúvidas e manter incólume a regulamentação dos serviços de transporte público individual de passageiros nos Municípios brasileiros, haja vista que o crescimento do transporte clandestino, inclusive por meios tecnológicos, está impactando negativamente na gestão pública, além de desconstruir o mercado de táxi, invadir o campo restrito ao profissional taxista e causar insegurança aos consumidores”, diz a justificativa."}, {"a8a5": "Como diz Carazza, “O PL tinha dois objetivos claros, proteger os taxistas e assegurar o poder estadual de regular os aplicativos e sua relação com os consumidores”."}, {"2e1b": "Passo nº 3 — Procure encontrar o vínculo entre os políticos e os grupos de interesses"}, {"ee4b": "Há no Congresso uma Frente Parlamentar em Defesa dos Interesses da Classe dos Taxistas. Seu presidente é o autor do PL, Carlos Zarattini. Todos os demais autores, à exceção do ministro Osmar Serraglio, fazem parte dessa frente parlamentar."}, {"a5d2": "Passo nº 4 — Pesquise a tramitação do projeto de lei"}, {"e457": "Entre a apresentação do PL, em 15 de junho de 2016, e sua votação em 4 de abril, passaram-se apenas 10 meses, uma tramitação muito acelerada em relação à média dos demais projetos de autoria parlamentar, de 1,7 mil dias para virar lei. Isso foi possível graças a uma série de manobras regimentais, que vão desde a anexação do projeto original a projetos similares, até a ajuda do presidente da Câmara, Rodrigo Maia (PFL/RJ) para acelerar sua aprovação nas comissões da casa. Maia também é membro da frente parlamentar de apoio aos taxistas."}, {"5fe4": "Passo nº 5 — Analise o que foi colocado em votação"}, {"69fc": "Várias mudanças foram feitas no projeto original para facilitar sua tramitação. O projeto original visava proteger o mercado de transporte individual para os taxistas, mas foi flexibilizado. Recebeu um substitutivo que permitia a atuação de motoristas autônomos, mas exigia a regulamentação pelos municípios."}, {"a39a": "Passo nº 6 — Nem tudo o que é aprovado é votado"}, {"0e2d": "A votação do PL 5.587/2016 foi simbólica. Por este sistema, o projeto não é discutido em plenário e aprovado pela maioria silenciosa que “permanece como está”, sem se manifestar. São poucos segundos entre discussão e aprovação. Essas votações ocorrem quando há acordo prévio entre os líderes partidários para aprovar o texto do relator."}, {"1a99": "Passo nº 7 — Fique de olho na votação dos destaques"}, {"5b46": "Os partidos têm a prerrogativa de pedir a votação de “destaques”, recurso previsto no Regimento Interno pode alterar pontos do texto aprovado. Por meio do PT, Carlos Zarattini pediu a votação de dois destaques. O primeiro retirava a classificação da atividade dos aplicativos como de natureza privada e exigia que os veículos utilizados fossem de aluguel, e não de particulares e o segundo exigia que os motoristas de Uber e Cabify fossem autorizados a trabalhar pela autoridade municipal, não mais por meio de cadastros diretos no aplicativo. Os dois destaques recuperaram o teor do PL original favorável aos taxistas."}, {"1ee7": "Passo nº 8 — Analise como cada partido se posicionou"}, {"0049": "Bruno Carazza analisou os votos dos parlamentes por bancada. Ele concluiu que os partidos ideologicamente mais à esquerda (PT, PC do B, e PSOL) votaram a favor de atribuir aos municípios o poder de regulamentar as atividades dos aplicativos e que os partidos mais à direita (PMDB, PSDB, DEM, PP, PR e aliados) foram contra conceder mais poder aos municípios."}, {"1406": "Passo nº 9 — As traições dizem muita coisa"}, {"e83c": "Houve traição às orientações dos partidos, principalmente entre os conservadores, votando a favor de destaques que ajudaram os taxistas. As traições foram fundamentais (Carazza publicou em seu site duas planilhas analisando esses votos)."}, {"8c7c": "Os taxistas representados pela Frente Parlamentar em Defesa dos Interesses da Classe dos Taxistas, formadores de opinião pública, tiveram mais força que os usuários dos serviços de transporte por meio de aplicativo. O projeto uniu várias pontas, observa Carazza, como partidos diferenciados, políticos de matizes ideológicos diferentes porque o Congresso tornou-se “ainda mais paroquial e corporativo nestes tempos de descrédito dos políticos tradicionais”."}, {"ee16": "Neste ponto, chegamos a questão inicial deste artigo, a crise de representatividade do Parlamento. Norberto Bobbio tratou nos anos 80 do conflito entre o interesse nacional e o interesse particular. Observou que o Parlamento seria o lugar para fazer essa separação, mas ele mesmo conclui que o interesse dos partidos, que deve prevalecer sobre o do deputado isoladamente, também configura um interesse desse grupo, que nem sempre é o da sociedade. Bobbio chamou de “neocorporativismo” o sistema existente em boa parte dos Estados democráticos europeus que apenas media o interesse entre grupos sociais."}, {"ff4d": "No Brasil atual, a julgar pela posição da Câmara no conflito Uber x Taxi, não tem havido nem sequer essa mediação. “A discussão ocorreu entre esses dois interesses, o dos aplicativos e o dos taxistas. Mas e o interesse do cidadão? O que era melhor para ele? Essa questão não esteve presente nesse debate”, constatou o deputado federal Thiago Peixoto (PSD/GO), que votou contra o PL e os destaques."}, {"87ab": "Se o corporativismo é uma das questões seminais da democracia, como Bobbio já demonstrou, ele atualmente pode ter se disseminado com ainda mais força em função, inclusive, do crescimento da crise de representatividade, como sugere Bruno Carazza e pode ser notado nas frentes parlamentares existentes na Câmara dos Deputados."}, {"2628": "Há nesta 55ª Legislatura (2015–2018) 271 frentes, 58% a mais do que há 14 anos, na 52ª Legislatura (2003–2006), quando havia 113. O crescimento dessas organizações parlamentares ocorreu ano a ano. Aumento de 17% entre a atual e a 54ª (2010–2014); de 46% entre esta e a 53ª (2007–2010), período de maior crescimento entre uma legislatura e a anterior; e de 7% da 53ª para a 52ª (2003–2006)."}, {"8436": "A criação de frentes parlamentares aumentou na mesma proporção do crescimento da crise política. Segundo pesquisa Datafolha, divulgada em dezembro de 2016, 53% dos brasileiros reprovavam o Congresso Nacional, a pior avaliação desde junho de 1993, época do escândalo dos Anões do Orçamento, quando 56% reprovaram os parlamentares."}, {"2bc7": "A proliferação das frentes parlamentares não indica, como se poderia supor, aproximação entre o Congresso e a sociedade, mas o fortalecimento da relação dos congressistas com as corporações, conforme a hipótese levantada por Carazza. Os interesses econômicos e corporativos estão infiltrados na atividade parlamentar e influenciam não apenas o voto e comportamento de cada um, mas também as manobras regimentais, apresentação de emendas, de projetos de lei, e de substitutivos, concluiu em sua longa análise da votação deste PL."}, {"2fdb": "Como se pode perceber, muitos deputados se agarram a grupos privados, a exemplo dos taxistas, para aumentarem suas chances eleitorais exatamente quando a sociedade caminha em direção oposta à do Parlamento. Ao fazer esse movimento, os congressistas se distanciam mais do eleitor médio aumentando o fosso entre este e o Congresso."}], "child": "1033_1"}