{"name": "1035", "parent": "", "content": "A cena brasileira de CTF Sobre lágrimas e ego O primeiro CTF que joguei foi o Hack N’ Roll 2014, eu estava me preparando para o Hackaflag, e acabei ficando em 16º jogando sozinho. O descobrimento deste tipo de competição foi fabuloso, em um dia jogando aprendi mais do que um mês lendo blog posts e treinando em máquinas locais, a adrenalina da competição era o impulso que precisava para me dedicar mais na área. Depois da final do Hackaflag montei um time, o já finado hu3BR, que durou uns bons 3 mêses sem ninguém jogar direito. Atualmente jogo pelo ELT, o time brasileiro com melhor posição internacional — não que quadragésimo lugar seja grande coisa. feito pelo TheZakMan Desde então muita coisa mudou: surgiram novos times, a esmagadora maioria advindos do Hackaflag; a segurança é um tema recorrente nos cursos e na mídia e pessoas incríveis estão entrando na área. Ouso dizer que estamos finalmente atingindo as metas que o CTF-BR tanto almejou. Entretanto, estamos estagnados. CTFs nacionais se tornaram um briga de ego com ranking. Nada é compartilhado na “cena”, não há debate, fórum ou lista de email para se discutir um aspecto técnico se quer. Olhamos apenas para o nosso umbigo e nos alimentamos de “tretas”. E os grandes culpados somos nós mesmos, que incentivamos a resolução de challenges apenas pelas flags e nada mais, sem um pingo de conhecimento técnico adquirido. Estamos criando grandes resolvedores de desafios, apenas. Tal qual as instituições de ensino que tentamos subverter, tal qual competições de programação que achamos robotizadas. Por nos importamos tanto com o nosso ego, agimos como se as competições brasileiras representassem a tecnologia mais avançada em segurança. Sequer gastamos energia com competições internacionais, talvez porque saibamos que iremos falhar, ou que não irão encher nosso ego da mesma forma. Veneramos challenges que demoram 10 dias para serem resolvidos, ao passo que eu adquiriria mais conhecimento se encarasse uma porta pelos mesmos 10 dias. Somos absolutamente ridículos em Engenharia Reversa e em Pwning, nos falta conhecimento técnico. O único time a pontuar em uma classificatória da DEF CON — provalemente o CTF mais difícil e com maior credibilidade no mundo — fora o The Goonies. Tal time é formado por profissionais que, por alto, tem mais de 10 anos de experiência em TI, com grande parte, se não todos, morando no exterior. Eles deveriam ser a nossa meta. Capture The Flag não são competições de hacking. Hacking não pode ser medido através de uma competição. Você não são melhores “hackers” — note as aspas — apenas pontuando em algum ranking ou matando um desafio que ninguém resolveu. Estas competições são ferramentas de aprendizado, ferramentas! As usem como tal. Use-a para ir até o artigo mais recente de alguma técnica que você nunca ouviu falar. Passe 30 horas preso em challenge até descobrir porque um byte não foi removido da pilha, mesmo que lhe custe a flag. As flags não importam, o conhecimento aprendido na competição é a única coisa que você irá carregar até o fim da vida. 4 n3w H0p3 Ouvi diversas vezes que “hackers” brasileiros são os mais criativos. Está se formando uma newschool com sede de conhecimento e completamente capaz de ultrapassar tecnicamente o “““underground-br””” (não tinham mais aspas). É preciso direcionar essa energia para o aprofundamento técnico e abrir os horizontes para fora do nosso umbigo. Para que daqui a três ou quatro anos termos o primeiro time brasileiro competindo na DEF CON. Para que possamos ter o mínimo controle sobre nossa democracia, e não revidando com backdoor na BIOS por causa de um deauth. Para enxergar o Brasil sob uma nova perspectiva através da subversão. Para que nosso status-quo seja questionado. Ou apenas just4fun, para saciar a curiosidade inerente à todos nós. Keep Hacking ", "title": "A cena brasileira de CTF", "sentences": [{"cf0b": "A cena brasileira de CTF"}, {"7534": "Sobre lágrimas e ego"}, {"ed7f": "O primeiro CTF que joguei foi o Hack N’ Roll 2014, eu estava me preparando para o Hackaflag, e acabei ficando em 16º jogando sozinho. O descobrimento deste tipo de competição foi fabuloso, em um dia jogando aprendi mais do que um mês lendo blog posts e treinando em máquinas locais, a adrenalina da competição era o impulso que precisava para me dedicar mais na área. Depois da final do Hackaflag montei um time, o já finado hu3BR, que durou uns bons 3 mêses sem ninguém jogar direito. Atualmente jogo pelo ELT, o time brasileiro com melhor posição internacional — não que quadragésimo lugar seja grande coisa."}, {"bfe5": "feito pelo TheZakMan"}, {"6fef": "Desde então muita coisa mudou: surgiram novos times, a esmagadora maioria advindos do Hackaflag; a segurança é um tema recorrente nos cursos e na mídia e pessoas incríveis estão entrando na área. Ouso dizer que estamos finalmente atingindo as metas que o CTF-BR tanto almejou."}, {"28c7": "Entretanto, estamos estagnados."}, {"a44d": "CTFs nacionais se tornaram um briga de ego com ranking. Nada é compartilhado na “cena”, não há debate, fórum ou lista de email para se discutir um aspecto técnico se quer. Olhamos apenas para o nosso umbigo e nos alimentamos de “tretas”. E os grandes culpados somos nós mesmos, que incentivamos a resolução de challenges apenas pelas flags e nada mais, sem um pingo de conhecimento técnico adquirido. Estamos criando grandes resolvedores de desafios, apenas. Tal qual as instituições de ensino que tentamos subverter, tal qual competições de programação que achamos robotizadas."}, {"b503": "Por nos importamos tanto com o nosso ego, agimos como se as competições brasileiras representassem a tecnologia mais avançada em segurança. Sequer gastamos energia com competições internacionais, talvez porque saibamos que iremos falhar, ou que não irão encher nosso ego da mesma forma. Veneramos challenges que demoram 10 dias para serem resolvidos, ao passo que eu adquiriria mais conhecimento se encarasse uma porta pelos mesmos 10 dias. Somos absolutamente ridículos em Engenharia Reversa e em Pwning, nos falta conhecimento técnico. O único time a pontuar em uma classificatória da DEF CON — provalemente o CTF mais difícil e com maior credibilidade no mundo — fora o The Goonies. Tal time é formado por profissionais que, por alto, tem mais de 10 anos de experiência em TI, com grande parte, se não todos, morando no exterior. Eles deveriam ser a nossa meta."}, {"0fd3": "Capture The Flag não são competições de hacking. Hacking não pode ser medido através de uma competição. Você não são melhores “hackers” — note as aspas — apenas pontuando em algum ranking ou matando um desafio que ninguém resolveu. Estas competições são ferramentas de aprendizado, ferramentas! As usem como tal. Use-a para ir até o artigo mais recente de alguma técnica que você nunca ouviu falar. Passe 30 horas preso em challenge até descobrir porque um byte não foi removido da pilha, mesmo que lhe custe a flag. As flags não importam, o conhecimento aprendido na competição é a única coisa que você irá carregar até o fim da vida."}, {"8985": "4 n3w H0p3"}, {"3b45": "Ouvi diversas vezes que “hackers” brasileiros são os mais criativos. Está se formando uma newschool com sede de conhecimento e completamente capaz de ultrapassar tecnicamente o “““underground-br””” (não tinham mais aspas). É preciso direcionar essa energia para o aprofundamento técnico e abrir os horizontes para fora do nosso umbigo. Para que daqui a três ou quatro anos termos o primeiro time brasileiro competindo na DEF CON. Para que possamos ter o mínimo controle sobre nossa democracia, e não revidando com backdoor na BIOS por causa de um deauth. Para enxergar o Brasil sob uma nova perspectiva através da subversão. Para que nosso status-quo seja questionado. Ou apenas just4fun, para saciar a curiosidade inerente à todos nós."}, {"e882": "Keep Hacking"}], "child": "1035_1\t1035_2"}