{"name": "1038", "parent": "", "content": "Learning from vulnerability reports. Yesterday, I was checking this site Hackerone where many software companies offer rewards (Bug Bounty) for finding security vulnerabilities in their apps including mobiles ones (Android and iOS). What really caught my attention was that after a company has fixed the issue they have the option of making the reports public, and everybody can take measures in case they have something similar in their products. In my case, I believe is a great source for getting security tips for developing apps for mobile platforms, and I’m trying to make a habit of reading some reports every week, I want to share with you how you can learn from these reports. How does it work? Every company has a profile on the website, where they give information about their products and how white hat hackers can supply reports. When a white hat hacker finds a vulnerability he/she supplies a detailed report indicating what was found, and how to replicate it. Then, the company reviews the report and if they find that there is a real problem, they give a reward(Bug Bounty) to hacker and they tell him/her that does not disclose this information until they release a fix for it. Square Open Source How to find a vulnerability report. Unfortunately, not all the reports are made public but many of them are and we can learn from them. First, we have to find a company with a Bug resolved. You can do it either with an account or without one, the info is available in both cases. Click the Directory link Then you will get a list with all the companies. The key is to find which of these have public reports, unfortunately, there is not a straight way to find public reports, I prefer to sort them by Highest Minimum Bounty because this will show me the companies that are more eager to find vulnerabilities, and where more hackers want to report. Directory sort by Highest Minimum Bounty Choose one, and in its profile, after the info part, you will find a timeline with all the reports. Timeline Now the hard task is to find one that is public, you can identify it because it has the description of the report. You just have to click it. Timeline This is the full report, where we can find what happened. There are some caveats that you might take into consideration, if you are like me you will be interested in finding vulnerabilities in mobile apps in particular Android, you can not filter by type of apps or by public reports, all the reports are mixed and is tedious to find them, but it worth it. To sum up, this is a great way to learn about software security. I courage you make habit of reading some reports, at least one per week this will help you to be aware of security issues, and deter them before they cause harm to your users. ", "title": "Learning from vulnerability reports.", "sentences": [{"3dc7": "Learning from vulnerability reports."}, {"e280": "Yesterday, I was checking this site Hackerone where many software companies offer rewards (Bug Bounty) for finding security vulnerabilities in their apps including mobiles ones (Android and iOS). What really caught my attention was that after a company has fixed the issue they have the option of making the reports public, and everybody can take measures in case they have something similar in their products."}, {"f675": "In my case, I believe is a great source for getting security tips for developing apps for mobile platforms, and I’m trying to make a habit of reading some reports every week, I want to share with you how you can learn from these reports."}, {"95bd": "How does it work?"}, {"c405": "Every company has a profile on the website, where they give information about their products and how white hat hackers can supply reports."}, {"30f9": "When a white hat hacker finds a vulnerability he/she supplies a detailed report indicating what was found, and how to replicate it. Then, the company reviews the report and if they find that there is a real problem, they give a reward(Bug Bounty) to hacker and they tell him/her that does not disclose this information until they release a fix for it."}, {"dbb2": "Square Open Source"}, {"ec79": "How to find a vulnerability report."}, {"df9e": "Unfortunately, not all the reports are made public but many of them are and we can learn from them."}, {"4556": "First, we have to find a company with a Bug resolved. You can do it either with an account or without one, the info is available in both cases."}, {"b3c5": "Click the Directory link"}, {"2508": "Then you will get a list with all the companies. The key is to find which of these have public reports, unfortunately, there is not a straight way to find public reports, I prefer to sort them by Highest Minimum Bounty because this will show me the companies that are more eager to find vulnerabilities, and where more hackers want to report."}, {"b324": "Directory sort by Highest Minimum Bounty"}, {"c898": "Choose one, and in its profile, after the info part, you will find a timeline with all the reports."}, {"3ef4": "Timeline"}, {"2a29": "Now the hard task is to find one that is public, you can identify it because it has the description of the report. You just have to click it."}, {"1a9a": "Timeline"}, {"8d0a": "This is the full report, where we can find what happened."}, {"38e5": "There are some caveats that you might take into consideration, if you are like me you will be interested in finding vulnerabilities in mobile apps in particular Android, you can not filter by type of apps or by public reports, all the reports are mixed and is tedious to find them, but it worth it."}, {"0a4c": "To sum up, this is a great way to learn about software security. I courage you make habit of reading some reports, at least one per week this will help you to be aware of security issues, and deter them before they cause harm to your users."}], "child": "1038_1\t1038_2"}