{"sentences": [{"4081": "Annual Report"}, {"966c": "Thanks to our partners, 2016 was a remarkable year at Neighborland. We launched new projects in San Francisco, Los Angeles, New York, and Atlanta. We expanded our strategic partnership with the City of San Francisco’s Planning Department, designing and building several new tools for their public engagement practice. We consulted with several cities on their community-centered design strategy as part of 100 Resilient Cities, pioneered by the Rockefeller Foundation. Most importantly, we continued to see meaningful outcomes from our work with city agencies, foundations, non-profits, and universities across the U.S."}, {"0b9a": "For the third consecutive year, hundreds of thousands of people participated on Neighborland projects. People shared their insights, volunteered their time, and donated money to help make great projects happen. Many of our projects from the past few years are now in the delivery phase. Nothing inspires our team more than real outcomes that reflect the priorities of the communities where we work. Given that our mission is to help people shape the development of their communities, we’re thrilled to say that 2016 was one of our most successful years to date."}, {"5614": "As we began working on projects of larger scale and greater complexity, we made significant improvements to our platform, especially our project administration tools. Working closely with the San Francisco Planning Department, we designed and built plan scenarios, segmentation surveys, anonymous participation, and new mapping capabilities. We kept our house clean with the latest in internet security, improved uptime, and built several new layout templates based on our partners’ needs. We integrated spatial data from ArcGIS and Google Fusion Tables. And we made it easier to export complex sets of data (cross-tabbed spreadsheets) from Neighborland for data analysts. We updated our product guide to explain all of all of our new capabilities and configurations in detail."}, {"93ad": "We continuously evaluate the social and economic impact of every project we support, at every scale — from buildings to blocks, neighborhoods, cities, and regions. As we have started supporting projects of significantly larger scale and complexity, the stakes for our partners, residents, and our organization have grown significantly. The fact is that our cities and towns are more important socially, economically, and politically than ever. Over the past five years, we’ve listened closely to our partners and our platform continues to improve and evolve. We have updated our core values and mission statement and welcome your feedback on the outcomes of our collective work here in the 2016 Neighborland Annual Report."}, {"0f30": "Outcomes"}, {"a336": "City of Atlanta Planning and Community Development"}, {"e78a": "The 67 acre Turner Field site is one of the largest project sites in any metropolitan area in the U.S. It presents the City of Atlanta with a rare opportunity to dramatically reshape their downtown. Over nine months in 2016, the Atlanta Regional Commission, Department of Planning and Community Development, Invest Atlanta, Council Member Carla Smith, Mayor Kasim Reed, and Annie Casey Foundation led one of the most innovative, community-centered planning processes in the city’s history."}, {"ff3b": "The engagement team was led by Contente Terry and Perkins+Will’s Atlanta office. They focused their engagement strategy on collecting a broad-based, diverse, and representative vision from the public. Insights were collected through innovative in-person workshops and extended online with Neighborland, and via our SMS and Twitter integrations. It was imperative that we were able to segment resident insights by resident type (live, work, visit) in our reporting, so we designed and built a new surveying capability for the project. Over 4,000 Atlanta residents have participated on the project by sharing their ideas, votes, and comments at public meetings and on the Neighborland project website."}, {"e6c5": "With a development of this scale, the political and economic stakes are extremely high for all of the stakeholders involved. By engaging with the surrounding neighborhoods’ residents in an open, honest, and meaningful dialogue that included tradeoff and participatory budgeting exercises, the project team engaged stakeholders in the most accessible and equitable way possible."}, {"de2a": "Here’s a case study on this project."}, {"94f3": "City of San Francisco Planning Department"}, {"e9cd": "We’re currently supporting the SF Planning’s City Design Group on the Central Waterfront / Dogpatch and Lower Haight Public Realm Plans. SF Planning’s public engagement strategy is based on the best practices of participatory planning, and we are continually inspired by their equitable approach to outreach at community workshops, events in public space, and online. The City Design Group’s engagement team is remarkably nimble in refining their approach to meet the needs of a passionate, diverse, and dynamic public. They truly meet the people of San Francisco where they are."}, {"8736": "We worked with the City Design Group to design several new capabilities this year including: plan scenario comments, map-based ideation, traditional surveys (for example, segmentation and intercept surveys), a polygon uploader for plan area and project boundaries, and anonymous authentication. We also built new administrative tools to help format and export data from Neighborland into formats that work seamlessly with the department’s internal tool set. These capabilities are now part of our core platform thanks to our partnership with SF Planning."}, {"0250": "New Orleans Regional Transit Authority"}, {"6bec": "When we launched Neighborland in New Orleans in 2011, one of the first ideas that gained support was a streetcar from the Central Business District to the 9th Ward, running down St. Claude Avenue and Rampart Street. It wasn’t a new idea — residents had advocated for the streetcar for over a decade. And it was admittedly naive to think that a group of active residents could raise $100m to build a streetcar. But support for the idea was emphatic and helped us learn more about the long game, including a few potential financing solutions like federal Tiger Grants or a local bond. We decided as an organization to do everything that we could to help residents make it happen."}, {"8258": "We worked with Ride Nola, Bywater Neighborhood Association, and Councilwoman Kristin Palmer to raise awareness of the benefits of the streetcar project, and to advocate publicly for it. Our first action was to collect over 2500 signatures, both online and in the real world, to help the coalition demonstrate popular support for her efforts to fund the project. We also staged a “show of force” in the middle ground of St. Claude, which attracted media attention early in the campaign. At the time, several locals questioned our motives and our efforts, with some skeptics calling us “Neighborland of pipe dreams.” It was a reasonable critique, and it drove us to focus on solutions. Despite our efforts, our Tiger Grant application was rejected by the US Department of Transportation. Undeterred, we continued to help organizations and residents draw attention to the larger issue of equitable transportation access in the city."}, {"8697": "We want to express our thanks to RIDE, Councilwoman Palmer, and Mayor Landrieu who continued to work with NORTA to make this idea happen. In 2011, NORTA allocated $90m raised in a municipal bond to finance the project. Construction began in 2015, and 22 months later, on October 3rd, 2016, the North Rampart / St. Claude streetcar began servicing the residents of Marigny, Treme, and St. Roch. If you’ve ever wondered what the “Made it Happen” flags mean on Neighborland, this is one of our favorite examples of a passionate group of city leaders, transportation advocates, and residents working together to make something meaningful happen in their neighborhood. Many people want to see the streetcar extended to Poland Avenue, and will continue to advocate for this in the years to come."}, {"0f91": "City of San Francisco Department of Public Works, SF Planning, SFMTA"}, {"60f4": "In June of 2012, the Mission Repair Fund raised $10,000 to help businesses vandalized in the Mission. After all was said and done they were left with $1900. They asked residents on Neighborland to share ideas for what we should do with the remaining money. The most feasible, popular idea that stayed true to the mission of the initial fundraise would be awarded the micro-grant."}, {"5a59": "Over 50 residents supported an idea to fund improvements to Bartlett Street and further the efforts of the Mission Community Market. The grant helped fund early design concepts for Bartlett Street, which subsequently received $1.7m from the City of San Francisco Public Works, SF Planning, and SFMTA. After a community-led planning and design process, the street was renovated and opened to the public on March 16th."}, {"a46e": "City of San Jose Planning Division, Greenbelt Alliance, Street Plans"}, {"a843": "Greenbelt Alliance is working with the City of San Jose to empower community members in their local urban village planning processes. Greenbelt partnered with the Street Plans Collaborative to design, plan, and implement tactical urbanism interventions as part of the West San Carlos Street and South Bascom Avenue urban village plans."}, {"9c9b": "Street Plans worked with the Buena Vista Neighborhood Association, Performance Bicycle, Our City Forest, San Jose Fire Department, San Jose DOT, and Be The Change Yoga & Wellness to create a 2-day “demonstration project” showing what a safer Scott Street could look like. The project featured temporary sharrow markings on the street (in advance of a planned permanent sharrow installation by SJDOT this summer), an energizer station with free bike repair, and a bike-themed block party. Thank to all the partners who made this event such a success!"}, {"93f5": "San Francisco Beautiful, SFMTA"}, {"50c8": "San Francisco has 700,000 public transit commuters every day, the third highest of any city in the United States. Public transit takes the city’s residents to hospitals, schools, jobs and affords them access to the city’s plethora of cultural and arts events. The Muni Art program asks “What if we allocated some of the advertising space in these buses to local artists?” SF Beautiful engaged over 15,000 Bay Area residents over the past 2 years on Neighborland to vote on the local artists featured in the program."}, {"2810": "In this second year of the Muni Art program, the SFMTA doubled the number of buses on which local art will be displayed from 50 to 100. The Muni Art program is funded in part by the Community Challenge Grant program which facilitates neighborhood beautification projects throughout San Francisco."}, {"4373": "University of Montana"}, {"8d0b": "Throughout the 2016–17 academic year, the University of Montana Strategic Planning team invited stakeholders to engage in critical and creative thinking about the institution’s identity, vision, values and direction. The Strategic Planning Coordinating Council committed to a process that was open to and inclusive of many perspectives, and culminated not just in a plan, but in a new way of working together on behalf of their stakeholders. Over 1700 people participated in the project on Neighborland, representing more than 10% of the campus community."}, {"bb67": "Butler County"}, {"4593": "Butler County’s Project Spark was a collaborative initiative of the Butler County Commissioners, Butler County Visitors Bureau, and Butler County Port Authority. With the support of Trajectory, the County led a bold, proactive planning initiative to position Butler County as a dynamic, forward-looking destination — a “top choice” for business, major events, culture, sport, tourism and investment — as well as a great place to study or call home. Over 2,000 residents participated in the project across the county, one of our first rural case studies."}, {"03f2": "In progress"}, {"d414": "Housing Authority of the City of Los Angeles"}, {"82b6": "The Housing Authority of the City of Los Angeles (HACLA) is developing a long-term, 25-year Vision Plan to preserve and expand its role in producing affordable housing and supporting healthy communities. The Vision Plan seeks to expand affordable housing opportunities and improve communities within and around affordable housing sites that are inclusive of the interests and support of residents and stakeholders. The Vision Plan is intended to develop a strategy to ensure existing HACLA residents have housing security, provide new opportunities to develop more affordable housing for a range of housing needs, and invest in place and people to improve personal and community health and prosperity. Neighborland is providing the core communications platform for the Vision Plan to ensure the plan reflects the interests and aspirations of residents and stakeholders. We’re thrilled to announce the launch of the platform in Spanish, and now offer multi-lingual setup in any language. This project is supported in part by the U.S. Department of Housing and Urban Development’s Affirmatively Furthering Fair Housing Act."}, {"91cb": "Yerba Buena Center for the Arts"}, {"99ba": "We are thrilled to be partnering with YBCA on a new program as part of the Creativity Connects initiative funded by the National Endowment for the Arts. We share YBCA’s belief that the purpose of art is to spur social change, and that we need to draw more voices, perspectives, and life experiences into our collective network if we want to solve the toughest challenges that we face as a society."}, {"b3d2": "We would need to write a book to share everything that we learned from YBCA and SF Planning from the Market Street Prototyping Festival, and we look forward to building on our collective social impact in the Bay Area to date with this new program. We have learned that artists, makers, and civic hackers play an integral role in helping residents see possibilities for social change in their neighborhoods."}, {"a790": "County of Miami-Dade Department of Transportation"}, {"e978": "City Innovate Foundation is working with Miami-Dade County and a number of private sector technology companies (Microsoft, Cubic, Lyft, Zipcar, Siemens) to write a policy playbook that will help Miami-Dade build a multi-modal transit network. This collaboration is focused on how to create a more viable and attractive transit network, while at the same time seamlessly integrating the use of private operators like Uber and Lyft into the system."}, {"6b6d": "The County of Miami-Dade Department of Transportation partnered with Neighborland to craft a user research strategy as part of their effort to “ground-truth” their product assumptions. This strategy outlined several methods for testing MDT’s product concepts, including launching a project on Neighborland. Our open and transparent discussion forum is enabling Miami residents to discuss the future of the county’s transportation system. We also worked closely with the County of Miami-Dade’s Department of Communications to share the project with existing transportation advocacy groups, integrate their previous outreach on social media, and leverage our Twitter integration to insure equitable input into the design process."}, {"74a3": "Makers Point"}, {"b822": "Hunts Point Habla! is a community-centered planning project led by Makers Point in Hunts Point, Bronx. The Hunts Point Habla! team is reaching out to residents to hear what they think about their community and how they wish to improve the quality of life in Hunts Point. At the end of this project, Makers Point will identify projects that have community support and work with residents to make their great ideas happen."}, {"1af2": "Hunts Point Habla! is a capacity building program model, supported in part by the Hunts Point Alliance. Makers Point is empowering a team of young, local leaders to lead the initiative. This team is attending community events and engaging with residents at local events and gathering places. Their goal is to reach as broad, inclusive, and representative group of residents as possible and start building a network of residents that can support projects with their social, political, and intellectual capital in the years to come."}, {"be6b": "Giving back"}, {"152b": "As a social enterprise, part of our responsibility is to help organizations in need by volunteering our staff time and expertise, and donating our platform license whenever possible. We donated over 500 hours of our staff’s time to non-profits and NGOs across the U.S. in 2016 on the following initiatives:"}, {"623d": "What’s next?"}, {"a7d5": "Over the past few years, we’ve heard from many of our partners that they needed help with their overall public engagement strategy, including their technology strategy. The fundamental question from everyone we work with is simply, “What tools are the most effective for our project?”"}, {"1b7e": "The current market for civic engagement technology is confusing and filled with uncertainty. Over the past few years, advertising-based social networks have continued to grow in influence, several well-known companies have pivoted or shifted into zombie mode, and an unending stream of startups continue to build unsustainable businesses. In response to the lack of timely market research for our partners at 100 Resilient Cities, we wrote an analysis of public engagement software, and published it openly for the public good. Additionally, our co-founder and CEO, Dan Parham, is supporting 100 Resilient Cities as a Subject Matter Expert on public engagement technology, and we do offer strategic consulting to many of our partners."}, {"0dbd": "We believe civic engagement at the local level is more important than ever. We look forward to empowering residents to create the places that reflect what matters most to them — both as individuals, and as communities."}, {"4350": "Contact us"}, {"0a4b": "Please contact us if you would like to explore working together in 2017 and beyond."}], "content": "Annual Report Thanks to our partners, 2016 was a remarkable year at Neighborland. We launched new projects in San Francisco, Los Angeles, New York, and Atlanta. We expanded our strategic partnership with the City of San Francisco’s Planning Department, designing and building several new tools for their public engagement practice. We consulted with several cities on their community-centered design strategy as part of 100 Resilient Cities, pioneered by the Rockefeller Foundation. Most importantly, we continued to see meaningful outcomes from our work with city agencies, foundations, non-profits, and universities across the U.S. For the third consecutive year, hundreds of thousands of people participated on Neighborland projects. People shared their insights, volunteered their time, and donated money to help make great projects happen. Many of our projects from the past few years are now in the delivery phase. Nothing inspires our team more than real outcomes that reflect the priorities of the communities where we work. Given that our mission is to help people shape the development of their communities, we’re thrilled to say that 2016 was one of our most successful years to date. As we began working on projects of larger scale and greater complexity, we made significant improvements to our platform, especially our project administration tools. Working closely with the San Francisco Planning Department, we designed and built plan scenarios, segmentation surveys, anonymous participation, and new mapping capabilities. We kept our house clean with the latest in internet security, improved uptime, and built several new layout templates based on our partners’ needs. We integrated spatial data from ArcGIS and Google Fusion Tables. And we made it easier to export complex sets of data (cross-tabbed spreadsheets) from Neighborland for data analysts. We updated our product guide to explain all of all of our new capabilities and configurations in detail. We continuously evaluate the social and economic impact of every project we support, at every scale — from buildings to blocks, neighborhoods, cities, and regions. As we have started supporting projects of significantly larger scale and complexity, the stakes for our partners, residents, and our organization have grown significantly. The fact is that our cities and towns are more important socially, economically, and politically than ever. Over the past five years, we’ve listened closely to our partners and our platform continues to improve and evolve. We have updated our core values and mission statement and welcome your feedback on the outcomes of our collective work here in the 2016 Neighborland Annual Report. Outcomes City of Atlanta Planning and Community Development The 67 acre Turner Field site is one of the largest project sites in any metropolitan area in the U.S. It presents the City of Atlanta with a rare opportunity to dramatically reshape their downtown. Over nine months in 2016, the Atlanta Regional Commission, Department of Planning and Community Development, Invest Atlanta, Council Member Carla Smith, Mayor Kasim Reed, and Annie Casey Foundation led one of the most innovative, community-centered planning processes in the city’s history. The engagement team was led by Contente Terry and Perkins+Will’s Atlanta office. They focused their engagement strategy on collecting a broad-based, diverse, and representative vision from the public. Insights were collected through innovative in-person workshops and extended online with Neighborland, and via our SMS and Twitter integrations. It was imperative that we were able to segment resident insights by resident type (live, work, visit) in our reporting, so we designed and built a new surveying capability for the project. Over 4,000 Atlanta residents have participated on the project by sharing their ideas, votes, and comments at public meetings and on the Neighborland project website. With a development of this scale, the political and economic stakes are extremely high for all of the stakeholders involved. By engaging with the surrounding neighborhoods’ residents in an open, honest, and meaningful dialogue that included tradeoff and participatory budgeting exercises, the project team engaged stakeholders in the most accessible and equitable way possible. Here’s a case study on this project. City of San Francisco Planning Department We’re currently supporting the SF Planning’s City Design Group on the Central Waterfront / Dogpatch and Lower Haight Public Realm Plans. SF Planning’s public engagement strategy is based on the best practices of participatory planning, and we are continually inspired by their equitable approach to outreach at community workshops, events in public space, and online. The City Design Group’s engagement team is remarkably nimble in refining their approach to meet the needs of a passionate, diverse, and dynamic public. They truly meet the people of San Francisco where they are. We worked with the City Design Group to design several new capabilities this year including: plan scenario comments, map-based ideation, traditional surveys (for example, segmentation and intercept surveys), a polygon uploader for plan area and project boundaries, and anonymous authentication. We also built new administrative tools to help format and export data from Neighborland into formats that work seamlessly with the department’s internal tool set. These capabilities are now part of our core platform thanks to our partnership with SF Planning. New Orleans Regional Transit Authority When we launched Neighborland in New Orleans in 2011, one of the first ideas that gained support was a streetcar from the Central Business District to the 9th Ward, running down St. Claude Avenue and Rampart Street. It wasn’t a new idea — residents had advocated for the streetcar for over a decade. And it was admittedly naive to think that a group of active residents could raise $100m to build a streetcar. But support for the idea was emphatic and helped us learn more about the long game, including a few potential financing solutions like federal Tiger Grants or a local bond. We decided as an organization to do everything that we could to help residents make it happen. We worked with Ride Nola, Bywater Neighborhood Association, and Councilwoman Kristin Palmer to raise awareness of the benefits of the streetcar project, and to advocate publicly for it. Our first action was to collect over 2500 signatures, both online and in the real world, to help the coalition demonstrate popular support for her efforts to fund the project. We also staged a “show of force” in the middle ground of St. Claude, which attracted media attention early in the campaign. At the time, several locals questioned our motives and our efforts, with some skeptics calling us “Neighborland of pipe dreams.” It was a reasonable critique, and it drove us to focus on solutions. Despite our efforts, our Tiger Grant application was rejected by the US Department of Transportation. Undeterred, we continued to help organizations and residents draw attention to the larger issue of equitable transportation access in the city. We want to express our thanks to RIDE, Councilwoman Palmer, and Mayor Landrieu who continued to work with NORTA to make this idea happen. In 2011, NORTA allocated $90m raised in a municipal bond to finance the project. Construction began in 2015, and 22 months later, on October 3rd, 2016, the North Rampart / St. Claude streetcar began servicing the residents of Marigny, Treme, and St. Roch. If you’ve ever wondered what the “Made it Happen” flags mean on Neighborland, this is one of our favorite examples of a passionate group of city leaders, transportation advocates, and residents working together to make something meaningful happen in their neighborhood. Many people want to see the streetcar extended to Poland Avenue, and will continue to advocate for this in the years to come. City of San Francisco Department of Public Works, SF Planning, SFMTA In June of 2012, the Mission Repair Fund raised $10,000 to help businesses vandalized in the Mission. After all was said and done they were left with $1900. They asked residents on Neighborland to share ideas for what we should do with the remaining money. The most feasible, popular idea that stayed true to the mission of the initial fundraise would be awarded the micro-grant. Over 50 residents supported an idea to fund improvements to Bartlett Street and further the efforts of the Mission Community Market. The grant helped fund early design concepts for Bartlett Street, which subsequently received $1.7m from the City of San Francisco Public Works, SF Planning, and SFMTA. After a community-led planning and design process, the street was renovated and opened to the public on March 16th. City of San Jose Planning Division, Greenbelt Alliance, Street Plans Greenbelt Alliance is working with the City of San Jose to empower community members in their local urban village planning processes. Greenbelt partnered with the Street Plans Collaborative to design, plan, and implement tactical urbanism interventions as part of the West San Carlos Street and South Bascom Avenue urban village plans. Street Plans worked with the Buena Vista Neighborhood Association, Performance Bicycle, Our City Forest, San Jose Fire Department, San Jose DOT, and Be The Change Yoga & Wellness to create a 2-day “demonstration project” showing what a safer Scott Street could look like. The project featured temporary sharrow markings on the street (in advance of a planned permanent sharrow installation by SJDOT this summer), an energizer station with free bike repair, and a bike-themed block party. Thank to all the partners who made this event such a success! San Francisco Beautiful, SFMTA San Francisco has 700,000 public transit commuters every day, the third highest of any city in the United States. Public transit takes the city’s residents to hospitals, schools, jobs and affords them access to the city’s plethora of cultural and arts events. The Muni Art program asks “What if we allocated some of the advertising space in these buses to local artists?” SF Beautiful engaged over 15,000 Bay Area residents over the past 2 years on Neighborland to vote on the local artists featured in the program. In this second year of the Muni Art program, the SFMTA doubled the number of buses on which local art will be displayed from 50 to 100. The Muni Art program is funded in part by the Community Challenge Grant program which facilitates neighborhood beautification projects throughout San Francisco. University of Montana Throughout the 2016–17 academic year, the University of Montana Strategic Planning team invited stakeholders to engage in critical and creative thinking about the institution’s identity, vision, values and direction. The Strategic Planning Coordinating Council committed to a process that was open to and inclusive of many perspectives, and culminated not just in a plan, but in a new way of working together on behalf of their stakeholders. Over 1700 people participated in the project on Neighborland, representing more than 10% of the campus community. Butler County Butler County’s Project Spark was a collaborative initiative of the Butler County Commissioners, Butler County Visitors Bureau, and Butler County Port Authority. With the support of Trajectory, the County led a bold, proactive planning initiative to position Butler County as a dynamic, forward-looking destination — a “top choice” for business, major events, culture, sport, tourism and investment — as well as a great place to study or call home. Over 2,000 residents participated in the project across the county, one of our first rural case studies. In progress Housing Authority of the City of Los Angeles The Housing Authority of the City of Los Angeles (HACLA) is developing a long-term, 25-year Vision Plan to preserve and expand its role in producing affordable housing and supporting healthy communities. The Vision Plan seeks to expand affordable housing opportunities and improve communities within and around affordable housing sites that are inclusive of the interests and support of residents and stakeholders. The Vision Plan is intended to develop a strategy to ensure existing HACLA residents have housing security, provide new opportunities to develop more affordable housing for a range of housing needs, and invest in place and people to improve personal and community health and prosperity. Neighborland is providing the core communications platform for the Vision Plan to ensure the plan reflects the interests and aspirations of residents and stakeholders. We’re thrilled to announce the launch of the platform in Spanish, and now offer multi-lingual setup in any language. This project is supported in part by the U.S. Department of Housing and Urban Development’s Affirmatively Furthering Fair Housing Act. Yerba Buena Center for the Arts We are thrilled to be partnering with YBCA on a new program as part of the Creativity Connects initiative funded by the National Endowment for the Arts. We share YBCA’s belief that the purpose of art is to spur social change, and that we need to draw more voices, perspectives, and life experiences into our collective network if we want to solve the toughest challenges that we face as a society. We would need to write a book to share everything that we learned from YBCA and SF Planning from the Market Street Prototyping Festival, and we look forward to building on our collective social impact in the Bay Area to date with this new program. We have learned that artists, makers, and civic hackers play an integral role in helping residents see possibilities for social change in their neighborhoods. County of Miami-Dade Department of Transportation City Innovate Foundation is working with Miami-Dade County and a number of private sector technology companies (Microsoft, Cubic, Lyft, Zipcar, Siemens) to write a policy playbook that will help Miami-Dade build a multi-modal transit network. This collaboration is focused on how to create a more viable and attractive transit network, while at the same time seamlessly integrating the use of private operators like Uber and Lyft into the system. The County of Miami-Dade Department of Transportation partnered with Neighborland to craft a user research strategy as part of their effort to “ground-truth” their product assumptions. This strategy outlined several methods for testing MDT’s product concepts, including launching a project on Neighborland. Our open and transparent discussion forum is enabling Miami residents to discuss the future of the county’s transportation system. We also worked closely with the County of Miami-Dade’s Department of Communications to share the project with existing transportation advocacy groups, integrate their previous outreach on social media, and leverage our Twitter integration to insure equitable input into the design process. Makers Point Hunts Point Habla! is a community-centered planning project led by Makers Point in Hunts Point, Bronx. The Hunts Point Habla! team is reaching out to residents to hear what they think about their community and how they wish to improve the quality of life in Hunts Point. At the end of this project, Makers Point will identify projects that have community support and work with residents to make their great ideas happen. Hunts Point Habla! is a capacity building program model, supported in part by the Hunts Point Alliance. Makers Point is empowering a team of young, local leaders to lead the initiative. This team is attending community events and engaging with residents at local events and gathering places. Their goal is to reach as broad, inclusive, and representative group of residents as possible and start building a network of residents that can support projects with their social, political, and intellectual capital in the years to come. Giving back As a social enterprise, part of our responsibility is to help organizations in need by volunteering our staff time and expertise, and donating our platform license whenever possible. We donated over 500 hours of our staff’s time to non-profits and NGOs across the U.S. in 2016 on the following initiatives: What’s next? Over the past few years, we’ve heard from many of our partners that they needed help with their overall public engagement strategy, including their technology strategy. The fundamental question from everyone we work with is simply, “What tools are the most effective for our project?” The current market for civic engagement technology is confusing and filled with uncertainty. Over the past few years, advertising-based social networks have continued to grow in influence, several well-known companies have pivoted or shifted into zombie mode, and an unending stream of startups continue to build unsustainable businesses. In response to the lack of timely market research for our partners at 100 Resilient Cities, we wrote an analysis of public engagement software, and published it openly for the public good. Additionally, our co-founder and CEO, Dan Parham, is supporting 100 Resilient Cities as a Subject Matter Expert on public engagement technology, and we do offer strategic consulting to many of our partners. We believe civic engagement at the local level is more important than ever. We look forward to empowering residents to create the places that reflect what matters most to them — both as individuals, and as communities. Contact us Please contact us if you would like to explore working together in 2017 and beyond. ", "parent": "", "title": "Annual Report", "child": "104_1", "name": "104"}