{"name": "1054", "parent": "", "content": "Start of a tech interview, start of a journey Last Summer Guide to Fall Season Tech Job Hunting What you could do in the summer to get that dream job in the following fall recruiting season I am starting this blog because I am inspired by Bryan Cai. Even though I am far from a mature software engineer, my experience fresh from last year could still be of use, at least so I hope. This guide is entirely based on my own experience and may not apply to everyone, but here are the things that I have done or I really wish I have done. Though I am in software industry, starting early really applies in any industry / academia. So here it comes — 1. You have accomplished more than you think! Your past class projects / side projects / research / internship have built you as a very strong candidate. Put the very strong past experiences on your resume and give the interviewers an opportunity to ask questions about the great things you have done. 2. Now is the time to brush up on those algorithms your learned 2 years ago Because after all, algorithms are what the tech companies are mostly testing. You can go back to your algorithms textbook, or really just read the summary from Cracking the Coding Interview by Gayle Laakmann McDowell. This great book is helpful no matter you are a freshman, sophomore, junior, senior or graduated. 3. Practice! Practice! Practice! Two reasons: one, there are certain patterns in algorithm questions that you will not find out unless you practice a lot; two, you want to go into a zen state of solving algorithm questions so you don’t panic during the actual interview. The Cracking the Coding Interview mentioned above has many great classical questions. However, you will more often than not come up with a different solution (which is great!), so I recommend using an online platform that can test your solution against test cases to catch the edge cases you might not have noticed. I used leetcode.com and hackerrank.com and I am sure there are a lot more great platforms out there. Meanwhile, also practice solving questions on a whiteboard / a piece of paper and explain your solution out aloud. Tech companies value communication and teamwork, so this process is important during interviews and after you enter the workforce. Ask a friend to give you feedback. You want to get used to how real interviews are conducted! 4. Research companies early Many companies start their recruiting season in July or August for the fall season, so start researching & reaching out to companies early! If you apply early, companies are more like to see your resume & invite you for an interview! These are just very broad ideas for what you could do during the summer (while working on an internship). Of course, there are way more other things you could do to prep yourself as a stronger candidate. My biggest takeaway is to always start early. Be passionate and be confident! Thank you for reading my first ever blog post *feeling relieved*, and I hope it can be even the slightest helpful. If you enjoyed reading, please Like this post, Follow me, or Recommend it to a friend who might find it helpful! If you have specific questions about applying for a tech position, or experience to share, or feedback for me, feel free to comment! I’ll try to address them in following posts! Any feedback is much appreciated! Again, hope you enjoyed reading! ", "title": "Last Summer Guide to Fall Season Tech Job Hunting", "sentences": [{"b461": "Start of a tech interview, start of a journey"}, {"fed4": "Last Summer Guide to Fall Season Tech Job Hunting"}, {"b1a9": "What you could do in the summer to get that dream job in the following fall recruiting season"}, {"ee2b": "I am starting this blog because I am inspired by Bryan Cai. Even though I am far from a mature software engineer, my experience fresh from last year could still be of use, at least so I hope. This guide is entirely based on my own experience and may not apply to everyone, but here are the things that I have done or I really wish I have done. Though I am in software industry, starting early really applies in any industry / academia. So here it comes —"}, {"7d83": "1. You have accomplished more than you think!"}, {"d5b4": "Your past class projects / side projects / research / internship have built you as a very strong candidate. Put the very strong past experiences on your resume and give the interviewers an opportunity to ask questions about the great things you have done."}, {"15ca": "2. Now is the time to brush up on those algorithms your learned 2 years ago"}, {"efcd": "Because after all, algorithms are what the tech companies are mostly testing. You can go back to your algorithms textbook, or really just read the summary from Cracking the Coding Interview by Gayle Laakmann McDowell. This great book is helpful no matter you are a freshman, sophomore, junior, senior or graduated."}, {"e66a": "3. Practice! Practice! Practice!"}, {"404b": "Two reasons: one, there are certain patterns in algorithm questions that you will not find out unless you practice a lot; two, you want to go into a zen state of solving algorithm questions so you don’t panic during the actual interview."}, {"641c": "The Cracking the Coding Interview mentioned above has many great classical questions. However, you will more often than not come up with a different solution (which is great!), so I recommend using an online platform that can test your solution against test cases to catch the edge cases you might not have noticed. I used leetcode.com and hackerrank.com and I am sure there are a lot more great platforms out there."}, {"7ac4": "Meanwhile, also practice solving questions on a whiteboard / a piece of paper and explain your solution out aloud. Tech companies value communication and teamwork, so this process is important during interviews and after you enter the workforce. Ask a friend to give you feedback. You want to get used to how real interviews are conducted!"}, {"12a4": "4. Research companies early"}, {"a71e": "Many companies start their recruiting season in July or August for the fall season, so start researching & reaching out to companies early! If you apply early, companies are more like to see your resume & invite you for an interview!"}, {"ee7f": "These are just very broad ideas for what you could do during the summer (while working on an internship). Of course, there are way more other things you could do to prep yourself as a stronger candidate. My biggest takeaway is to always start early. Be passionate and be confident!"}, {"c41e": "Thank you for reading my first ever blog post *feeling relieved*, and I hope it can be even the slightest helpful. If you enjoyed reading, please Like this post, Follow me, or Recommend it to a friend who might find it helpful!"}, {"6028": "If you have specific questions about applying for a tech position, or experience to share, or feedback for me, feel free to comment! I’ll try to address them in following posts! Any feedback is much appreciated!"}, {"1856": "Again, hope you enjoyed reading!"}], "child": "1054_1\t1054_2\t1054_31054_1\t1054_2\t1054_3"}