{"name": "1063", "parent": "", "content": "How to Assess Emotional Intelligence During the Interview Process Among employees who fail to meet expectations during their first 18 months on the job, 23% fail due to low emotional intelligence. That’s the second most prevalent reason new hires fail, following only a general lack of coachability. So we know gauging a candidate’s emotional intelligence is pivotal when it comes to hiring the best new talent —the question is, how to evaluate something so complex in a brief interview setting? Here are five emotional intelligence questions that have worked for my team…and no…none of them are “what’s your greatest weakness?” 🙄 1. Can you tell me about a time you tried to do something and failed?Asking a candidate to explain a failed project is a great way to see how they cope when things don’t go as planned, it’s also an opportunity to see whether or not they’re comfortable taking full responsibility for their actions. Look for a candidate who can straightforwardly describe a recent failure without shirking the bulk of the blame on other parties or unfortunate circumstances. Even if some external factors played a hand in the mishap, you want a candidate who is comfortable being held fully accountable, and can discuss even the nitty-gritty details of a failed project with fair-minded focus. Does the candidate seem like they were able to fully bounce back from the issue without getting defensive? Emotionally intelligent individuals possess an inherent self-confidence that can buoy them through setbacks and lets them assess troubling situations objectively, without harsh self-judgment or resorting to outward frustration. Be wary of candidates who fixate too much on who or what they blame for the failure. When a project doesn’t work out, the key takeaway shouldn’t be based on blame. Emotionally intelligent people know how to move on and examine a situation without bitterness or resentment clouding their judgment. 2. Tell me about a time you received negative feedback from your boss. How did that make you feel? One of the most easily recognizable qualities of an emotionally intelligent person is their ability to deal with criticism. People with high emotional intelligence are well-equipped to handle negative feedback without losing stride. They can process even unexpected feedback without letting it damage their self-worth. That’s not to say negative feedback has no emotional impact on emotionally intelligent employees. People with high emotional intelligence experience emotions like everyone else — they just know how to fully process those emotions with a level head and a clear focus on the facts. Look for a candidate who can specifically describe the feelings they experienced upon receiving negative feedback, e.g.: “At first I was surprised and a little frustrated by my manager’s comments on the project, but when I looked deeper into the reasoning behind her comments, I realized that I could have definitely given more attention to several key areas. On my next project, I was able to use her feedback to develop a more well-rounded approach.” A response that acknowledges the specific emotions they experienced and shows an empathic understanding of their manager’s point of view indicates a high level of emotional awareness. Candidates who say they felt “bad” or can’t really express why the feedback affected them might be less emotionally intelligent. Similarly, if a candidate thinks the feedback was wholly undeserved and doesn’t attempt to understand their manager’s point of view, they might have difficulty stepping outside of their own perspective. 3. Can you tell me about a conflict at work that made you feel frustrated? Everyone gets frustrated sometimes. It’s how you handle that frustration that really matters. Hearing how a candidate explains a work conflict can offer some valuable clues into their level of emotional intelligence. Conflicts can stir up a lot of difficult emotions, and asking a candidate to describe a dispute and how they dealt with it can give you meaningful insight into how they manage their emotions and empathize with others. According to psychologist and author Daniel Goleman, emotionally intelligent people have four distinguishing characteristics: 2. They were good at managing their emotions (self-management) 3. They were empathetic to the emotional drives of other people (social awareness) 4. They were good at handling other people’s emotions (social skills) All four of these characteristics are put to the test in conflicts situations. Emotionally intelligent people will be able to explain a conflict situation clearly and objectively, giving a specific run down of how they felt at the time, how they managed those feelings, and how they used social cues from those around them to inform their decisions. As they explain the conflict situation, consider the following four areas: 4. Tell me about a hobby you like to do outside of work. Can you teach me about it? Ask the candidate to explain one of their hobbies to you as if you know nothing about it. It can be anything — golf, horseback riding, cookie jar collecting — anything they’re interested in and willing to share details about. As they explain the hobby, prompt them with questions that force them to simplify, re-explain, and change their communication style to suit your clear lack of understanding. See how they react. Are they getting flustered or frustrated? Are they quick to adapt their communication style to meet your needs? Emotionally intelligent people remain patient and calm when faced with a communication challenge. They can easily read social cues when their message isn’t clearly getting across, and will deftly pivot their approach to meet the needs of their audience. 5. Can you tell me about a time you needed to ask for help on a project? Emotionally intelligent people are self-confident without being overconfident. They have a realistic understanding of their own strengths and limitations, and they aren’t afraid to admit what they don’t know. They know that asking for help and collaborating with others is a sign of strength, not weakness. Be wary of candidates who seem hesitant or embarrassed to admit they need help sometimes. Look for someone who can confidently discuss a time when they sought the help of a colleague due to a gap in their knowledge of a subject. Emotionally intelligent people will be transparent about their weak points, and will show a real drive to better themselves by collaborating and using all the resources available to them. If you learned something, click the 💚 to help others find this article. A version of this post was first published on the HubSpot Marketing blog. ", "title": "How to Assess Emotional Intelligence During the Interview Process", "sentences": [{"00e1": "How to Assess Emotional Intelligence During the Interview Process"}, {"82fd": "Among employees who fail to meet expectations during their first 18 months on the job, 23% fail due to low emotional intelligence. That’s the second most prevalent reason new hires fail, following only a general lack of coachability."}, {"a884": "So we know gauging a candidate’s emotional intelligence is pivotal when it comes to hiring the best new talent —the question is, how to evaluate something so complex in a brief interview setting?"}, {"4635": "Here are five emotional intelligence questions that have worked for my team…and no…none of them are “what’s your greatest weakness?” 🙄"}, {"6b35": "1. Can you tell me about a time you tried to do something and failed?Asking a candidate to explain a failed project is a great way to see how they cope when things don’t go as planned, it’s also an opportunity to see whether or not they’re comfortable taking full responsibility for their actions."}, {"9a14": "Look for a candidate who can straightforwardly describe a recent failure without shirking the bulk of the blame on other parties or unfortunate circumstances."}, {"ab92": "Even if some external factors played a hand in the mishap, you want a candidate who is comfortable being held fully accountable, and can discuss even the nitty-gritty details of a failed project with fair-minded focus."}, {"ecda": "Does the candidate seem like they were able to fully bounce back from the issue without getting defensive? Emotionally intelligent individuals possess an inherent self-confidence that can buoy them through setbacks and lets them assess troubling situations objectively, without harsh self-judgment or resorting to outward frustration."}, {"bc35": "Be wary of candidates who fixate too much on who or what they blame for the failure. When a project doesn’t work out, the key takeaway shouldn’t be based on blame. Emotionally intelligent people know how to move on and examine a situation without bitterness or resentment clouding their judgment."}, {"87ed": "2. Tell me about a time you received negative feedback from your boss. How did that make you feel? One of the most easily recognizable qualities of an emotionally intelligent person is their ability to deal with criticism. People with high emotional intelligence are well-equipped to handle negative feedback without losing stride. They can process even unexpected feedback without letting it damage their self-worth."}, {"76ce": "That’s not to say negative feedback has no emotional impact on emotionally intelligent employees. People with high emotional intelligence experience emotions like everyone else — they just know how to fully process those emotions with a level head and a clear focus on the facts."}, {"2917": "Look for a candidate who can specifically describe the feelings they experienced upon receiving negative feedback, e.g.: “At first I was surprised and a little frustrated by my manager’s comments on the project, but when I looked deeper into the reasoning behind her comments, I realized that I could have definitely given more attention to several key areas. On my next project, I was able to use her feedback to develop a more well-rounded approach.”"}, {"9ebd": "A response that acknowledges the specific emotions they experienced and shows an empathic understanding of their manager’s point of view indicates a high level of emotional awareness."}, {"4e0c": "Candidates who say they felt “bad” or can’t really express why the feedback affected them might be less emotionally intelligent. Similarly, if a candidate thinks the feedback was wholly undeserved and doesn’t attempt to understand their manager’s point of view, they might have difficulty stepping outside of their own perspective."}, {"f544": "3. Can you tell me about a conflict at work that made you feel frustrated? Everyone gets frustrated sometimes. It’s how you handle that frustration that really matters."}, {"ed88": "Hearing how a candidate explains a work conflict can offer some valuable clues into their level of emotional intelligence. Conflicts can stir up a lot of difficult emotions, and asking a candidate to describe a dispute and how they dealt with it can give you meaningful insight into how they manage their emotions and empathize with others."}, {"1c10": "According to psychologist and author Daniel Goleman, emotionally intelligent people have four distinguishing characteristics:"}, {"0cc8": "2. They were good at managing their emotions (self-management)"}, {"6f70": "3. They were empathetic to the emotional drives of other people (social awareness)"}, {"6215": "4. They were good at handling other people’s emotions (social skills)"}, {"3415": "All four of these characteristics are put to the test in conflicts situations. Emotionally intelligent people will be able to explain a conflict situation clearly and objectively, giving a specific run down of how they felt at the time, how they managed those feelings, and how they used social cues from those around them to inform their decisions."}, {"69e2": "As they explain the conflict situation, consider the following four areas:"}, {"78ce": "4. Tell me about a hobby you like to do outside of work. Can you teach me about it? Ask the candidate to explain one of their hobbies to you as if you know nothing about it. It can be anything — golf, horseback riding, cookie jar collecting — anything they’re interested in and willing to share details about."}, {"a228": "As they explain the hobby, prompt them with questions that force them to simplify, re-explain, and change their communication style to suit your clear lack of understanding. See how they react. Are they getting flustered or frustrated? Are they quick to adapt their communication style to meet your needs?"}, {"fa4c": "Emotionally intelligent people remain patient and calm when faced with a communication challenge."}, {"3dc0": "They can easily read social cues when their message isn’t clearly getting across, and will deftly pivot their approach to meet the needs of their audience."}, {"91e7": "5. Can you tell me about a time you needed to ask for help on a project? Emotionally intelligent people are self-confident without being overconfident. They have a realistic understanding of their own strengths and limitations, and they aren’t afraid to admit what they don’t know. They know that asking for help and collaborating with others is a sign of strength, not weakness."}, {"f996": "Be wary of candidates who seem hesitant or embarrassed to admit they need help sometimes. Look for someone who can confidently discuss a time when they sought the help of a colleague due to a gap in their knowledge of a subject."}, {"4764": "Emotionally intelligent people will be transparent about their weak points, and will show a real drive to better themselves by collaborating and using all the resources available to them."}, {"ead5": "If you learned something, click the 💚 to help others find this article."}, {"3ac0": "A version of this post was first published on the HubSpot Marketing blog."}], "child": "1063_1\t1063_2\t1063_3\t1063_4\t1063_5\t1063_6\t1063_7\t1063_8\t1063_9\t1063_10\t1063_11\t1063_12\t1063_13\t1063_14\t1063_15\t1063_16\t1063_17\t1063_18\t1063_19"}