{"name": "1064", "parent": "", "content": "Hire a Head of Product in 11 Steps If you’re anything like me, hiring for product is a complete and utter friggin’ nightmare. It’s not because there isn’t a dearth of talent, and it’s not because product leadership isn’t an absolutely necessity for any startup. It’s because no discipline is as misunderstood, misapplied, mystified, misnamed and mistaken, as the product discipline. Today is a big day for Mylestone. After a 5 month search we welcome Drew Condon as our new Head of Product. [Editor’s Note: Thank dear god. I don’t really pray, but if I did, someone certainly blessed me on this one.]. If you’re hiring product leadership, be forewarned: this is no high school dance. Buckle in, it’s time to do the rhumba. One of these two is a great product leader 1. Learn what product is. Then learn it again. What the hell is “product” anyway? This is a discipline that evolves so fast, even the experienced require continuous education. This Quora thread is a good initial cheat sheet: What is a Product Manager?Answer (1 of 20): It depends on the industry and the company. I will answer it from a tech startup perspective.…www.quora.com Finished reading? Good, now read 50 more articles just like this throughout your search. Wash, rinse, repeat. 2. Decide the Macro During their time at Runkeeper, Max Freiert and Drew Condon were apparently a “two-headed product monster.” Max was the “business” guy, Drew the “design” guy. They both led big chunks of the product — usually together and occasionally overlapping. I talked to a number of people at Runkeeper who explained it this way: Max was focused on how to generate value. Drew was focused on designing the experience so consumers understood it. Before you get started, you have a macro question to answer: Do you need someone to figure out the business itself, or someone to design the business so customers engage? Wanting “both” is a fair answer, but candidates will lean heavily one way or the other, so you should, too. 3. Consider the 4 Foundations Every product leader’s skills are rooted in some foundation, based on early career history. These will translate into unfair advantages and how they’ll execute for you — here are the 4 most common foundations: 4. Seek Advice, Send Scotch Scour your network to find product experts willing to impart a little wisdom. Given they aren’t interviewing for the job, their ability to advise and provide unfettered feedback is incredible. “You’re looking for a purple squirrel,” advised Richard Banfield, the CEO of Fresh Tilled Soil, on the first of a handful of calls. Banfield was right by the way, and anything more than 3 calls requires a scotch delivery. Drizly to the rescue. Drew Condon, Purple Squirrel? 5. Identify “Talent Look-Alikes” Yeah, you’re going to plunder LinkedIn to connect with candidates in your network. But when that well runs dry, then what? Here’s a trick to finding a slew of people you might otherwise overlook: Steve Street | LinkedInFrom prototyping a new product with users to harmonizing your UX across multiple digital properties, corporations and…www.linkedin.com Steve Street is one of the most talented product guys you’ll meet. He wouldn’t let me hire him, so I used him as a “Talent Look Alike” to find others who described themselves just like him. 6. Don’t Get Flummoxed by Titles You. Product People. Get your stories straight. What’s with all the mix-master-grandflash-mashing of your damn titles? Case in point: UX Designers now seem to be called Product Designers. So are you a product person or a designer? Oh wait, product is design now? What’s that — you’re an “experience” designer, but not a “visual” designer? Ok, so I want a product designer, but not a visual designer, but one that has UX capabilities? So what do you do? 7. 90 Minutes, No More, No Less After a candidate has met a few team members — and you’ve qualified chemistry — it’s time to dive deeper. Outline a specific challenge, and have the candidate lead a group strategy session as if they already had the job. Make it 90 minutes; long enough to go deep, but short enough so they’re constrained and have to manage the clock. (that’s how it is in real life, right?). How candidates prepare for the sessions, how they gain the respect of the team, how they own the room — that’s gold, jerry, gold. 8. Back Channel Early & Often Far too often hiring managers wait until they’re nearing the end of their search to back channel references. Reputation is a huge indicator, and unlisted references will deliver in spades. “Hey, confidentially, what’s your take on Drew Condon?” is vague enough to ensure you don’t expose that they might be looking. Back channeling early will allow you to punt the less-than-stellar candidates so you can focus your energy on the top candidates. You’ll need the extra effort close them anyway! 9. Hypnotize Them With Talent Once you are down to two candidates, it’s time to call in your closers. Pedro Martinez, Closing It. I leaned on the two most impressive product leaders I know: Jeffrey Veen (True Ventures, TypeKit, Adobe) and Nate Walkingshaw (Pluralsight, Tanner Labs, Stryker) both agreed to quick interviews with our final candidates. Leaders of this caliber will provide unparalleled feedback, (“This candidate has a more contemporary approach,” changed my entire thinking) but more importantly, the association alone will hypnotize candidates into wanting to “step up” to the business. 10. Decide When To Pass (and Why) As with every single hire you make, do not accept anything less than what feels like a perfect fit. If you feel unsettled. If reference checks don’t ask if they can join once you hire the candidate. If people pause or caveat when you ask, “would you work with them again?” Then pass. Just do it. Even if you don’t have a second choice. An ineffective Head of Product will require at least 6 months recovery. 11. Hire Drew Condon Final tip. But give us a few years with him first, ok? Please hit the ❤ below if you read this far and would hire Drew. ", "title": "Hire a Head of Product in 11 Steps", "sentences": [{"89ae": "Hire a Head of Product in 11 Steps"}, {"e3e0": "If you’re anything like me, hiring for product is a complete and utter friggin’ nightmare."}, {"9717": "It’s not because there isn’t a dearth of talent, and it’s not because product leadership isn’t an absolutely necessity for any startup."}, {"7b37": "It’s because no discipline is as misunderstood, misapplied, mystified, misnamed and mistaken, as the product discipline."}, {"39d5": "Today is a big day for Mylestone. After a 5 month search we welcome Drew Condon as our new Head of Product. [Editor’s Note: Thank dear god. I don’t really pray, but if I did, someone certainly blessed me on this one.]."}, {"9e6e": "If you’re hiring product leadership, be forewarned: this is no high school dance. Buckle in, it’s time to do the rhumba."}, {"ede5": "One of these two is a great product leader"}, {"2a7a": "1. Learn what product is. Then learn it again."}, {"dbab": "What the hell is “product” anyway? This is a discipline that evolves so fast, even the experienced require continuous education. This Quora thread is a good initial cheat sheet:"}, {"4076": "What is a Product Manager?Answer (1 of 20): It depends on the industry and the company. I will answer it from a tech startup perspective.…www.quora.com"}, {"bb13": "Finished reading? Good, now read 50 more articles just like this throughout your search."}, {"26e1": "Wash, rinse, repeat."}, {"6d82": "2. Decide the Macro"}, {"ac73": "During their time at Runkeeper, Max Freiert and Drew Condon were apparently a “two-headed product monster.” Max was the “business” guy, Drew the “design” guy."}, {"f111": "They both led big chunks of the product — usually together and occasionally overlapping. I talked to a number of people at Runkeeper who explained it this way:"}, {"62ee": "Max was focused on how to generate value."}, {"a722": "Drew was focused on designing the experience so consumers understood it."}, {"7c9f": "Before you get started, you have a macro question to answer: Do you need someone to figure out the business itself, or someone to design the business so customers engage?"}, {"8ffc": "Wanting “both” is a fair answer, but candidates will lean heavily one way or the other, so you should, too."}, {"9e2c": "3. Consider the 4 Foundations"}, {"afda": "Every product leader’s skills are rooted in some foundation, based on early career history. These will translate into unfair advantages and how they’ll execute for you — here are the 4 most common foundations:"}, {"641d": "4. Seek Advice, Send Scotch"}, {"38c8": "Scour your network to find product experts willing to impart a little wisdom. Given they aren’t interviewing for the job, their ability to advise and provide unfettered feedback is incredible."}, {"b743": "“You’re looking for a purple squirrel,” advised Richard Banfield, the CEO of Fresh Tilled Soil, on the first of a handful of calls."}, {"bc44": "Banfield was right by the way, and anything more than 3 calls requires a scotch delivery. Drizly to the rescue."}, {"94da": "Drew Condon, Purple Squirrel?"}, {"a674": "5. Identify “Talent Look-Alikes”"}, {"4a00": "Yeah, you’re going to plunder LinkedIn to connect with candidates in your network. But when that well runs dry, then what? Here’s a trick to finding a slew of people you might otherwise overlook:"}, {"4791": "Steve Street | LinkedInFrom prototyping a new product with users to harmonizing your UX across multiple digital properties, corporations and…www.linkedin.com"}, {"b6aa": "Steve Street is one of the most talented product guys you’ll meet. He wouldn’t let me hire him, so I used him as a “Talent Look Alike” to find others who described themselves just like him."}, {"aab7": "6. Don’t Get Flummoxed by Titles"}, {"59eb": "You. Product People. Get your stories straight. What’s with all the mix-master-grandflash-mashing of your damn titles?"}, {"a398": "Case in point: UX Designers now seem to be called Product Designers. So are you a product person or a designer? Oh wait, product is design now? What’s that — you’re an “experience” designer, but not a “visual” designer? Ok, so I want a product designer, but not a visual designer, but one that has UX capabilities?"}, {"eb4c": "So what do you do?"}, {"3cd9": "7. 90 Minutes, No More, No Less"}, {"dcd3": "After a candidate has met a few team members — and you’ve qualified chemistry — it’s time to dive deeper."}, {"e4f2": "Outline a specific challenge, and have the candidate lead a group strategy session as if they already had the job."}, {"5bc9": "Make it 90 minutes; long enough to go deep, but short enough so they’re constrained and have to manage the clock. (that’s how it is in real life, right?)."}, {"6107": "How candidates prepare for the sessions, how they gain the respect of the team, how they own the room — that’s gold, jerry, gold."}, {"5106": "8. Back Channel Early & Often"}, {"f34f": "Far too often hiring managers wait until they’re nearing the end of their search to back channel references. Reputation is a huge indicator, and unlisted references will deliver in spades."}, {"ba74": "“Hey, confidentially, what’s your take on Drew Condon?” is vague enough to ensure you don’t expose that they might be looking."}, {"77d4": "Back channeling early will allow you to punt the less-than-stellar candidates so you can focus your energy on the top candidates. You’ll need the extra effort close them anyway!"}, {"fe53": "9. Hypnotize Them With Talent"}, {"9518": "Once you are down to two candidates, it’s time to call in your closers."}, {"0246": "Pedro Martinez, Closing It."}, {"d650": "I leaned on the two most impressive product leaders I know: Jeffrey Veen (True Ventures, TypeKit, Adobe) and Nate Walkingshaw (Pluralsight, Tanner Labs, Stryker) both agreed to quick interviews with our final candidates."}, {"d4c1": "Leaders of this caliber will provide unparalleled feedback, (“This candidate has a more contemporary approach,” changed my entire thinking) but more importantly, the association alone will hypnotize candidates into wanting to “step up” to the business."}, {"8e07": "10. Decide When To Pass (and Why)"}, {"cfae": "As with every single hire you make, do not accept anything less than what feels like a perfect fit."}, {"0da8": "If you feel unsettled."}, {"55db": "If reference checks don’t ask if they can join once you hire the candidate."}, {"6975": "If people pause or caveat when you ask, “would you work with them again?”"}, {"7efe": "Then pass. Just do it. Even if you don’t have a second choice."}, {"9268": "An ineffective Head of Product will require at least 6 months recovery."}, {"0ead": "11. Hire Drew Condon"}, {"545b": "Final tip."}, {"2b55": "But give us a few years with him first, ok?"}, {"2fb7": "Please hit the ❤ below if you read this far and would hire Drew."}], "child": "1064_1\t1064_21064_1\t1064_21064_1\t1064_2"}