{"name": "1067", "parent": "", "content": "Five Lessons from Scaling Pinterest I was involved with Pinterest from 5 employees through 650. Here’s what I learned. When you’re scaling quickly, you get a lot right, but you inevitably get some things wrong. The best companies — like Pinterest — are the ones that learn from those mistakes and adjust quickly. This post is a distillation of the lessons I learned, first as an investor, then as one of the company’s first product managers, and finally leading product for our discovery team — overseeing search, recommendations, our visual search team, and more. People often say that what you measure, improves. While true, it overlooks how strategic the decision of what you measure is. If you get stuck measuring the wrong thing, you could end up wasting your time on the wrong initiatives. For example, early on at Pinterest, our newly created growth team set its objective: to increase the number of monthly active users. MAUs is a common metric used by a lot of growth teams and social networks, so it made intuitive sense. The growth team then created and executed on a product roadmap that poured new users into the top of our sign-up funnel. The problem was that while MAUs did increase, we had a leaky bucket. While the growth team was pouring people into the top of the funnel and the product teams were focused on increasing engagement of existing users, no one was responsible for making sure those new users became engaged, productive users.  Realizing this, the team shifted their focus from MAUs to increasing the number of new weekly active pinners (the people who use Pinterest to pin or repin something new on the site that week — Pinterest’s core action). With this shift in focus, the growth team’s priorities aligned with what was better for our users (and the company), and weekly active pinner growth accelerated. Now, it wasn’t just about getting new users to sign up, it was about making sure they had a great experience from sign-up to first home feed that set them up for long-term success on Pinterest. This by the way is why vanity metrics are so dangerous to companies. They aren’t just misleading to the outside world— they can start a vicious-cycle. You use a metric because it makes your company (or team) look good, and because you start tracking it, you want it to continue to increase, so you start optimizing for it. This will take you down the wrong path. So yes — if you measure it, it will improve. But make sure you measure the right thing. Most execution problems boil down to two root causes: Wrong org structure, or wrong person in the job. There’s a lot written about “wrong person in the job”, but org structure isn’t covered as much. Indeed, it’s common for young companies to focus on keeping the organization “flat” and nonhierarchical, or letting it take form organically. But that approach can lead to mediocre execution. I’ll give two examples: Early days at Pinterest, we had a matrixed organization. This meant no team had all the resources it needed to ship a product. The strategic pillars like my team (Discover) were mostly backend engineers. When we wanted to ship a new Discovery feature, I’d have to beg the mobile team to prioritize my project for the next front-end engineer who’d become available, and try to line up timelines so that we’d have the backend and designs ready when the front-end engineer became available (at one desperate point, I made a Gantt chart to help!). This approach made it really hard to build something excellent quickly. When we switched to full stack teams, it was night and day. Everything moved faster, we could prioritize better, we built better products, and everyone was a lot happier. Another example is when at one point, the growth team reported to the marketing team. Result: Tons of coordination overhead. People on the growth team were constantly having meetings with the product team in order to get their strategies and roadmaps aligned. It added a huge number of meetings to our schedules, and made it harder to align priorities with strategy. When we moved the growth team over so it reported to product, it streamlined their strategy, got everyone aligned better — and also eliminated a heck of a lot of meetings. Lastly, if you have a strategic initiative, you better create a team that can drive that initiative if you want to make any progress. Org changes are often painful and distracting but they’re absolutely necessary as a company scales. When an org structure doesn’t reflect your strategy or is overly matrixed, it acts as a tax on your company’s ability to execute. Your loudest users — the users who complain when you ship something they don’t like, and post in your Facebook Group their feature requests, are a blessing and a curse. Without them, you wouldn’t have a company. But to reach your next 100m users, you need to be willing to ignore them. Here’s the trick: Your loudest users don’t represent all your users, and they definitely don’t represent your future users. They are your power users, your users who best understand your product the way it is now. This creates two biases: This is how these two biases can lead you down the wrong path: Not wanting things to change The best companies over time realize that in order to endure, they need to disrupt themselves. Remember when Facebook first rolled out its newsfeed in 2006? It caused a huge backlash. Users threatened to boycott Facebook, they created Facebook Groups protesting the feature. But over time, it became the core of the product. If Facebook had let that small minority of power users dictate what was best for the majority, Facebook would be a lot smaller than it is today. Could Facebook have done a better job rolling out the newsfeed? Absolutely. But ultimately Facebook was right to ignore that vocal minority and stick to their guns. The newsfeed is an extreme example, but these things happen all the time on a smaller scale. Want to simplify a core product flow? Your users don’t care if a redesigned flow takes out two steps — they’re used to those two steps! Want to simplify the product by removing a little-used feature? But that’s my favorite feature! It takes courage to make these changes — you don’t want to irritate your best users, but you need to keep that next 100m users in mind who can’t tell you what they want. The key is to listen to what the data says, communicate to your users, and be prepared to ignore your vocal minority if the data points you in a different direction. All that said, as I’ll talk about in lesson #9, sometimes the vocal minority is the tip of the iceberg. Building power user features If you build every feature your users ask for, you’ll end up with a very small, highly engaged user base. First, user requests operate within the local maxima that your product sits in. Remember the famous (likely made-up) Ford quote of customers asking for a faster horse? That’s your users. Inevitably, they’ll ask for features that add complexity to the product, making it harder to understand for a new person who’s trying it out for the first time. Sometimes this additional complexity is worth it, but more often it’s not. Whenever we built the #1 most requested feature of our existing users, it got used by <5% of users, so it really needs to be a game changer for those <5%. And remember: it’s a lot easier to add features than it is to take them away. So be careful with what you add. The other problem is that the features they request are often band-aids on symptoms, not real solutions. As an example, one of the most requested features while I was at Pinterest was the ability to re-arrange pins. You can imagine the use case: having to always scroll down to the bottom of a board to find your favorite recipe. If only you could drag that pin to be on the top of your board! But this isn’t the best solution. Power users request power-user features. Re-arranging pins is the type of feature only a very small percentage of committed users would use. When you dig deeper, the request is a symptom of a root cause — it’s hard to find pins you’re looking for. Your job is not to build the features your users ask for, it’s to ask the right questions that help you find the scalable solution — the solution that the majority of users will do. In this case, instead of helping users re-arrange pins, we built a feature we called “personal search”. Now, a pinner can search across all their pins to find the pin they’re looking for. A lot more people will do a search than constantly re-arrange their pins. Lastly, we can’t forget the resources that these types of feature requests can consume. When you’re working in a resource constrained environment, which all startups are, you always need to make trade-offs of building features that increase engagement of existing users vs help grow the user base. The latter doesn’t just mean growth hacking, it can mean making the product simpler, adding more use cases, increasing conversion of new users to retained users, etc.  In summary: Once you reach a certain point and have built a sticky product, you have to stop building for the users you already have, and start building for that next hundred million users. You have to be willing to risk angering your existing users in order to win the next big group. At a Q&A one Friday, Ben and Evan described user trust like a bank; we want to be depositing in that bank a lot more than we withdraw. Indeed, I once heard that it takes five positive experiences to make up for a single negative experience. That’s an expensive exchange rate. That mindset stuck with me, and I believe it’s what allowed Pinterest to build one of the best consumer brands in the US in an incredibly short period of time. It was no surprise to me when I saw Prophet recently included Pinterest in the top ten US brands alongside Nike and Apple. We tried to make the bulk of our deposits in the form of a delightful product experience, but that wasn’t our only means of deposits. We made deposits in the copy we wrote for error messages, in the community team that handled help desk questions, and in the way we communicated to our pinners about product updates. When you have enough of a surplus in your bank, users give you the benefit of the doubt, both when you mess up, and when you try something new. For example, early on when Pinterest was scaling rapidly, the site would occasionally go down. As the engineers worked to get the site back up, our community team would post on Facebook and Twitter that Pinterest was down and that we were working to get everyone pinning again. Inevitably, users would thank the team for working hard to get Pinterest back up! If we hadn’t had a surplus in our trust bank at that time, it would reinforce to our users the negative schema they had for us, and further erode our trust balance. When you have this trust surplus, it also lets you take more risks with your product. It’s the difference between your users defaulting to a positive interpretation of a change versus a negative interpretation. It makes a big difference when you want to make bold changes. Every company will have moments where the growth curve is flat, or morale is down. Even Facebook had a flat period: Pinterest too went through this pretty early. Until summer of 2012, Facebook had been our main distribution channel, and then in short order, Facebook acquired Instagram and throttled Pinterest’s distribution in the newsfeed. It was a one-two punch. We had to figure out a new way to grow.  Times when growth slows can be scary moments for a company. It’s a natural moment of self doubt and self-reflection. Are we a niche? Should we try to be more like Instagram? It takes leadership to stick to your first principles during moments of organizational self-doubt. My first job out of college was in a consulting company that was itself a startup. When this moment happened to us, the company’s strategy thrashed. From one day to the next, we were updating our website to reflect a different strategy that we hoped would save us. It was a vicious cycle, and eventually everyone (myself included) left. Ultimately at Pinterest, we dug in to really understand who we were, doubled-down on our value prop to users, our growth team persevered and cracked a new distribution strategy. Growth re-accelerated. Just remember that there will be days, months, or even quarters like this. Even the almighty Facebook went through this moment. But as long as you’re focused on your core strategy — and that strategy is differentiated — you can break through it with execution. I’d love to hear your feedback on this post, as well as your experiences in hyper-growth companies. And as always, if you are building a consumer tech company that is entering into hyper-growth, I’d love to chat (tavel at greylock dot com). ", "title": "Five Lessons from Scaling Pinterest", "sentences": [{"5f5f": "Five Lessons from Scaling Pinterest"}, {"72ce": "I was involved with Pinterest from 5 employees through 650. Here’s what I learned."}, {"2dbc": "When you’re scaling quickly, you get a lot right, but you inevitably get some things wrong. The best companies — like Pinterest — are the ones that learn from those mistakes and adjust quickly."}, {"1817": "This post is a distillation of the lessons I learned, first as an investor, then as one of the company’s first product managers, and finally leading product for our discovery team — overseeing search, recommendations, our visual search team, and more."}, {"8955": "People often say that what you measure, improves. While true, it overlooks how strategic the decision of what you measure is. If you get stuck measuring the wrong thing, you could end up wasting your time on the wrong initiatives."}, {"adac": "For example, early on at Pinterest, our newly created growth team set its objective: to increase the number of monthly active users. MAUs is a common metric used by a lot of growth teams and social networks, so it made intuitive sense."}, {"a618": "The growth team then created and executed on a product roadmap that poured new users into the top of our sign-up funnel. The problem was that while MAUs did increase, we had a leaky bucket. While the growth team was pouring people into the top of the funnel and the product teams were focused on increasing engagement of existing users, no one was responsible for making sure those new users became engaged, productive users.  Realizing this, the team shifted their focus from MAUs to increasing the number of new weekly active pinners (the people who use Pinterest to pin or repin something new on the site that week — Pinterest’s core action)."}, {"c566": "With this shift in focus, the growth team’s priorities aligned with what was better for our users (and the company), and weekly active pinner growth accelerated. Now, it wasn’t just about getting new users to sign up, it was about making sure they had a great experience from sign-up to first home feed that set them up for long-term success on Pinterest."}, {"f5cc": "This by the way is why vanity metrics are so dangerous to companies. They aren’t just misleading to the outside world— they can start a vicious-cycle. You use a metric because it makes your company (or team) look good, and because you start tracking it, you want it to continue to increase, so you start optimizing for it. This will take you down the wrong path."}, {"42d9": "So yes — if you measure it, it will improve. But make sure you measure the right thing."}, {"d44f": "Most execution problems boil down to two root causes: Wrong org structure, or wrong person in the job."}, {"6678": "There’s a lot written about “wrong person in the job”, but org structure isn’t covered as much. Indeed, it’s common for young companies to focus on keeping the organization “flat” and nonhierarchical, or letting it take form organically. But that approach can lead to mediocre execution."}, {"0905": "I’ll give two examples:"}, {"ceb8": "Early days at Pinterest, we had a matrixed organization. This meant no team had all the resources it needed to ship a product. The strategic pillars like my team (Discover) were mostly backend engineers. When we wanted to ship a new Discovery feature, I’d have to beg the mobile team to prioritize my project for the next front-end engineer who’d become available, and try to line up timelines so that we’d have the backend and designs ready when the front-end engineer became available (at one desperate point, I made a Gantt chart to help!)."}, {"a330": "This approach made it really hard to build something excellent quickly. When we switched to full stack teams, it was night and day. Everything moved faster, we could prioritize better, we built better products, and everyone was a lot happier."}, {"8088": "Another example is when at one point, the growth team reported to the marketing team. Result: Tons of coordination overhead. People on the growth team were constantly having meetings with the product team in order to get their strategies and roadmaps aligned. It added a huge number of meetings to our schedules, and made it harder to align priorities with strategy. When we moved the growth team over so it reported to product, it streamlined their strategy, got everyone aligned better — and also eliminated a heck of a lot of meetings."}, {"d3f2": "Lastly, if you have a strategic initiative, you better create a team that can drive that initiative if you want to make any progress."}, {"4327": "Org changes are often painful and distracting but they’re absolutely necessary as a company scales. When an org structure doesn’t reflect your strategy or is overly matrixed, it acts as a tax on your company’s ability to execute."}, {"a174": "Your loudest users — the users who complain when you ship something they don’t like, and post in your Facebook Group their feature requests, are a blessing and a curse. Without them, you wouldn’t have a company. But to reach your next 100m users, you need to be willing to ignore them."}, {"7496": "Here’s the trick: Your loudest users don’t represent all your users, and they definitely don’t represent your future users. They are your power users, your users who best understand your product the way it is now. This creates two biases:"}, {"0723": "This is how these two biases can lead you down the wrong path:"}, {"7434": "Not wanting things to change"}, {"b346": "The best companies over time realize that in order to endure, they need to disrupt themselves."}, {"c19e": "Remember when Facebook first rolled out its newsfeed in 2006? It caused a huge backlash. Users threatened to boycott Facebook, they created Facebook Groups protesting the feature. But over time, it became the core of the product."}, {"fa7c": "If Facebook had let that small minority of power users dictate what was best for the majority, Facebook would be a lot smaller than it is today. Could Facebook have done a better job rolling out the newsfeed? Absolutely. But ultimately Facebook was right to ignore that vocal minority and stick to their guns."}, {"be14": "The newsfeed is an extreme example, but these things happen all the time on a smaller scale. Want to simplify a core product flow? Your users don’t care if a redesigned flow takes out two steps — they’re used to those two steps! Want to simplify the product by removing a little-used feature? But that’s my favorite feature!"}, {"0ab0": "It takes courage to make these changes — you don’t want to irritate your best users, but you need to keep that next 100m users in mind who can’t tell you what they want. The key is to listen to what the data says, communicate to your users, and be prepared to ignore your vocal minority if the data points you in a different direction. All that said, as I’ll talk about in lesson #9, sometimes the vocal minority is the tip of the iceberg."}, {"38df": "Building power user features"}, {"c48b": "If you build every feature your users ask for, you’ll end up with a very small, highly engaged user base."}, {"44e3": "First, user requests operate within the local maxima that your product sits in. Remember the famous (likely made-up) Ford quote of customers asking for a faster horse? That’s your users."}, {"373f": "Inevitably, they’ll ask for features that add complexity to the product, making it harder to understand for a new person who’s trying it out for the first time. Sometimes this additional complexity is worth it, but more often it’s not. Whenever we built the #1 most requested feature of our existing users, it got used by <5% of users, so it really needs to be a game changer for those <5%. And remember: it’s a lot easier to add features than it is to take them away. So be careful with what you add."}, {"7345": "The other problem is that the features they request are often band-aids on symptoms, not real solutions. As an example, one of the most requested features while I was at Pinterest was the ability to re-arrange pins. You can imagine the use case: having to always scroll down to the bottom of a board to find your favorite recipe. If only you could drag that pin to be on the top of your board! But this isn’t the best solution."}, {"da6a": "Power users request power-user features. Re-arranging pins is the type of feature only a very small percentage of committed users would use. When you dig deeper, the request is a symptom of a root cause — it’s hard to find pins you’re looking for."}, {"fe61": "Your job is not to build the features your users ask for, it’s to ask the right questions that help you find the scalable solution — the solution that the majority of users will do. In this case, instead of helping users re-arrange pins, we built a feature we called “personal search”. Now, a pinner can search across all their pins to find the pin they’re looking for. A lot more people will do a search than constantly re-arrange their pins."}, {"bdce": "Lastly, we can’t forget the resources that these types of feature requests can consume. When you’re working in a resource constrained environment, which all startups are, you always need to make trade-offs of building features that increase engagement of existing users vs help grow the user base. The latter doesn’t just mean growth hacking, it can mean making the product simpler, adding more use cases, increasing conversion of new users to retained users, etc.  In summary: Once you reach a certain point and have built a sticky product, you have to stop building for the users you already have, and start building for that next hundred million users. You have to be willing to risk angering your existing users in order to win the next big group."}, {"e5d5": "At a Q&A one Friday, Ben and Evan described user trust like a bank; we want to be depositing in that bank a lot more than we withdraw. Indeed, I once heard that it takes five positive experiences to make up for a single negative experience. That’s an expensive exchange rate."}, {"2074": "That mindset stuck with me, and I believe it’s what allowed Pinterest to build one of the best consumer brands in the US in an incredibly short period of time. It was no surprise to me when I saw Prophet recently included Pinterest in the top ten US brands alongside Nike and Apple."}, {"11bd": "We tried to make the bulk of our deposits in the form of a delightful product experience, but that wasn’t our only means of deposits. We made deposits in the copy we wrote for error messages, in the community team that handled help desk questions, and in the way we communicated to our pinners about product updates."}, {"be3d": "When you have enough of a surplus in your bank, users give you the benefit of the doubt, both when you mess up, and when you try something new. For example, early on when Pinterest was scaling rapidly, the site would occasionally go down. As the engineers worked to get the site back up, our community team would post on Facebook and Twitter that Pinterest was down and that we were working to get everyone pinning again. Inevitably, users would thank the team for working hard to get Pinterest back up! If we hadn’t had a surplus in our trust bank at that time, it would reinforce to our users the negative schema they had for us, and further erode our trust balance. When you have this trust surplus, it also lets you take more risks with your product. It’s the difference between your users defaulting to a positive interpretation of a change versus a negative interpretation. It makes a big difference when you want to make bold changes."}, {"2017": "Every company will have moments where the growth curve is flat, or morale is down. Even Facebook had a flat period:"}, {"2e6d": "Pinterest too went through this pretty early. Until summer of 2012, Facebook had been our main distribution channel, and then in short order, Facebook acquired Instagram and throttled Pinterest’s distribution in the newsfeed. It was a one-two punch. We had to figure out a new way to grow.  Times when growth slows can be scary moments for a company. It’s a natural moment of self doubt and self-reflection. Are we a niche? Should we try to be more like Instagram?"}, {"c1e3": "It takes leadership to stick to your first principles during moments of organizational self-doubt. My first job out of college was in a consulting company that was itself a startup. When this moment happened to us, the company’s strategy thrashed. From one day to the next, we were updating our website to reflect a different strategy that we hoped would save us. It was a vicious cycle, and eventually everyone (myself included) left."}, {"2f73": "Ultimately at Pinterest, we dug in to really understand who we were, doubled-down on our value prop to users, our growth team persevered and cracked a new distribution strategy. Growth re-accelerated."}, {"179b": "Just remember that there will be days, months, or even quarters like this. Even the almighty Facebook went through this moment. But as long as you’re focused on your core strategy — and that strategy is differentiated — you can break through it with execution."}, {"c737": "I’d love to hear your feedback on this post, as well as your experiences in hyper-growth companies. And as always, if you are building a consumer tech company that is entering into hyper-growth, I’d love to chat (tavel at greylock dot com)."}], "child": "1067_1\t1067_2\t1067_3\t1067_4\t1067_5\t1067_6\t1067_7\t1067_8\t1067_9\t1067_10\t1067_11\t1067_12\t1067_13\t1067_14\t1067_15\t1067_16\t1067_17\t1067_18\t1067_19\t1067_20\t1067_21\t1067_22\t1067_23\t1067_24\t1067_251067_1\t1067_2\t1067_3\t1067_4\t1067_5\t1067_6\t1067_7\t1067_8\t1067_9\t1067_10\t1067_11\t1067_12\t1067_13\t1067_14\t1067_15\t1067_16\t1067_17\t1067_18\t1067_19\t1067_20\t1067_21\t1067_22\t1067_23\t1067_24\t1067_25"}