{"name": "1070", "parent": "", "content": "Top 5 Daily Habits That Wire Your Mind For Success Our minds are inherently wired to survive, NOT to succeed After millions of years of evolutionary trial and error, or natural selection as Charles Darwin put it, the homo sapiens proved to be the dominant species. Was this the case because humans were expert risk takers or fear conquerors? Quite the opposite actually. We as human beings were designed to survive, reproduce, protect our young so they can survive and reproduce again. Success has never been part of our thought process or vocabulary until recently in the lifespan of our species. Risk Aversion = Survival Let us put on our time machine hats for a minute and take a journey back in time. The human beings that survived the rough elements of the stone age without a doubt tried to avoid risk or loss at all costs. Think about it, when one is living that close to the edge of life, to risk or lose even a little may put there entire existence in jeopardy. Within the Stone Age, having a cautious approach to risk absolutely increased our chances of survival — and thus creating offspring. Their descendants (us now) with this genetic inheritance, would therefore be more likely to avoid risk as well. Our Lizard Brain Our amygdala or as I like to put it our “lizard brain” is our emotional control center where our primitive instincts reside. This part of our limbic system is responsible for the fight or flight response we experience when fear sets in. Although the amygdala is still crucial for our survival, such as our desire to have sex (let’s keep that one) some of its functions are severely outdated. In this day and age, success is strongly and positively correlated to being a master of your own emotions. The goal is not to go against your natural instincts but more so use them when it’s advantageous to do so. After years of my own evolutionary trial and error I’ve worked up my top 5 methods to wire your mind for success. My Top 5 Methods To Wire Your Mind For Success This dude knows what I am talking about! 1. Meditate Meditation has been the single most beneficial habit towards my success. If you choose to do nothing else, above all I encourage you to meditate. What is meditation? Meditation can realistically be found in all things, whether it be playing a sport, being in nature, or sitting there staring at the wall (The Chubirka Method). My personal definition for meditation is the practice of being in an elevated state of awareness. How do you meditate? There is no “one size fits all” method of meditation. Some excellent guides can be found here and here. Simply for your reference, I’ll explain how I do it. Why daily meditation wires your mind for success I am on my fifth month of meditating regularly and the results are massive. This daily practice has allowed me the freedom to choose how I use my emotions. When fear sets in, meditation has taught me to first understand what it is that I fear in that moment — then properly label that fear as either a useless social construct or a legitimate danger. See, our fear response from our amygdala does not put labels on things. Fear is felt the same way whether you are being chased by a rabid grizzly or giving a presentation in front of your fellow students or colleagues. Meditation will give your mind the organizational ability to sort your emotions based on the situation. 2. Exercise Just like meditation, exercise can come in a variety of forms. This is something I do not necessarily need to explain to you, we all already know what exercising is, how to do it, and that it is good for our health. Nevertheless, I want to explain why daily exercise can wire your mind for success. Why daily exercise wires your mind for success Exercising every day is insanely fucking hard! Yet its rewards greatly outweigh the high level of difficulty. Exercising daily primes our mind to endure pain and resistance every single day. If you continually make exercising the most difficult part of your day and you commit to it, the rest of your life starts to become a breeze. Immediately following your workout you feel amazing! This is because during the process our brains’ emit a plethora of elevating hormones and chemicals. People pay top dollar to do drugs that emit these same chemicals, do yourself a favor and produce that shit yourself. One of my early mottos in life was “look good, feel good, play good”. When you exercise daily you get all three. You look sexy as fuck, you feel more confident and inevitably you begin to make life your bitch. 3. Read, Listen, or Watch Inspirational Material This tiny habit pays out huge dividends. When I wake up I make sure to read at least one inspirational article. This is the sure-fire way to start your day off right. Before letting your mind think or act for itself, fill it with motivation and optimism. Why daily inspiration wires your mind for success Answer yourself honestly — when you wake up what is the first thing you do? Do you check your phone for texts, emails, or social media notifications? I succumb to this sometimes as well, I think we all do. Anyways, if that does sound like you, then your day begins by reacting to things. This habitually wires your mind to be reactive rather than proactive. I get it, you use your phone for an alarm, it is impossible to not see notifications in the morning. Rather than paying them any mind, turn off your alarm and pick up a book or pick out an inspiring article (like mine!) on medium to read. If you fill your mind with positivity every single day, over time you will naturally become an optimist no matter how big of a Negative Nelly you once were. Having a mind full of optimism is one of the first crucial steps toward leading a successful life. 4. Practice Solitude Practicing solitude simply put; is the act of being alone for an extended period of time. Every day I spend a great deal of time by myself, and I enjoy that time of solitude. Now I am no “lone wolf”, I just choose to have several hours of alone time everyday, which to me are the most important hours. Why daily solitude wires your mind for success When you are alone for extended periods of time it is impossible to ignore that little voice inside your head. Most people’s minds are primed for negative thoughts so they will do anything to distract themselves….from themselves. This is a commonly traveled pathway to destruction. When you continually distract yourself in avoidance of addressing the real problems within you — instead of them disappearing they compound and get stronger. This can later lead to drug dependence, violence, emotional breakdowns, midlife crises, and other self-abusive behaviors. This is why it is extremely important to spend time by yourself to literally get to know who you are as a person. In solitude you develop peace within yourself, you learn your direction in life, understand and address your emotions, and ultimately become whole. 5. Take Cold Showers This is a much more recent habit of mine, one that originally occurred without choice. I just bought a house and the water heater wasn’t working, so the first few days I took cold showers. Although bizarre on the forefront, the benefits of cold showers are surprisingly positive. I myself am a HUGE fan of hot steamy showers. I mean they are fucking amazing right? I am not telling you to go ahead and eliminate the awesomeness of a hot shower but I am asking you to consider a quick cold shower in the morning. Why daily cold showers wire your mind for success There is nothing worse than having to take a cold shower in the morning…but is it really as bad as people make it out to be? When you step inside a freezing cold vortex of spraying water your whole body is jolted awake. You are so cold that your body automatically reacts by forcing heavy breaths out of you. After a minute or so, this turns into complete and utter euphoric lucidity. Taking cold showers forces you very quickly to become less of a pussy and much more of a strong individual. However, to fully reap this benefit you need to do it daily — which as a residual result teaches you discipline. A disciplined mind that is alert, lucid, and strong is almost unstoppable and this can be gradually trained with the help of one cold shower a day. Why I Write I truly believe we are all here for a reason, we all have a purpose. Mine is to understand and apply the mindset of growth and to inspire others to do the same. If you felt inspired by my article today please recommend, share, and subscribe to receive inspiration every Sunday! Did this publication bring you value? Click the ❤ below to recommend it to others and spread the value further! ", "title": "Top 5 Daily Habits That Wire Your Mind For Success", "sentences": [{"5463": "Top 5 Daily Habits That Wire Your Mind For Success"}, {"4f55": "Our minds are inherently wired to survive, NOT to succeed"}, {"5130": "After millions of years of evolutionary trial and error, or natural selection as Charles Darwin put it, the homo sapiens proved to be the dominant species. Was this the case because humans were expert risk takers or fear conquerors? Quite the opposite actually."}, {"bc74": "We as human beings were designed to survive, reproduce, protect our young so they can survive and reproduce again. Success has never been part of our thought process or vocabulary until recently in the lifespan of our species."}, {"9fb9": "Risk Aversion = Survival"}, {"b0bb": "Let us put on our time machine hats for a minute and take a journey back in time."}, {"401f": "The human beings that survived the rough elements of the stone age without a doubt tried to avoid risk or loss at all costs. Think about it, when one is living that close to the edge of life, to risk or lose even a little may put there entire existence in jeopardy."}, {"d56a": "Within the Stone Age, having a cautious approach to risk absolutely increased our chances of survival — and thus creating offspring. Their descendants (us now) with this genetic inheritance, would therefore be more likely to avoid risk as well."}, {"5850": "Our Lizard Brain"}, {"91ce": "Our amygdala or as I like to put it our “lizard brain” is our emotional control center where our primitive instincts reside. This part of our limbic system is responsible for the fight or flight response we experience when fear sets in."}, {"98ac": "Although the amygdala is still crucial for our survival, such as our desire to have sex (let’s keep that one) some of its functions are severely outdated."}, {"4a6f": "In this day and age, success is strongly and positively correlated to being a master of your own emotions. The goal is not to go against your natural instincts but more so use them when it’s advantageous to do so."}, {"0f4b": "After years of my own evolutionary trial and error I’ve worked up my top 5 methods to wire your mind for success."}, {"b89d": "My Top 5 Methods To Wire Your Mind For Success"}, {"a215": "This dude knows what I am talking about!"}, {"0ebc": "1. Meditate"}, {"8abf": "Meditation has been the single most beneficial habit towards my success. If you choose to do nothing else, above all I encourage you to meditate."}, {"8a31": "What is meditation?"}, {"ffca": "Meditation can realistically be found in all things, whether it be playing a sport, being in nature, or sitting there staring at the wall (The Chubirka Method)."}, {"a696": "My personal definition for meditation is the practice of being in an elevated state of awareness."}, {"2ac6": "How do you meditate?"}, {"278a": "There is no “one size fits all” method of meditation. Some excellent guides can be found here and here."}, {"de52": "Simply for your reference, I’ll explain how I do it."}, {"f024": "Why daily meditation wires your mind for success"}, {"4782": "I am on my fifth month of meditating regularly and the results are massive. This daily practice has allowed me the freedom to choose how I use my emotions."}, {"dbf2": "When fear sets in, meditation has taught me to first understand what it is that I fear in that moment — then properly label that fear as either a useless social construct or a legitimate danger."}, {"3a6e": "See, our fear response from our amygdala does not put labels on things. Fear is felt the same way whether you are being chased by a rabid grizzly or giving a presentation in front of your fellow students or colleagues."}, {"1e62": "Meditation will give your mind the organizational ability to sort your emotions based on the situation."}, {"a652": "2. Exercise"}, {"0e11": "Just like meditation, exercise can come in a variety of forms. This is something I do not necessarily need to explain to you, we all already know what exercising is, how to do it, and that it is good for our health. Nevertheless, I want to explain why daily exercise can wire your mind for success."}, {"8a68": "Why daily exercise wires your mind for success"}, {"cc72": "Exercising every day is insanely fucking hard! Yet its rewards greatly outweigh the high level of difficulty."}, {"f72b": "Exercising daily primes our mind to endure pain and resistance every single day. If you continually make exercising the most difficult part of your day and you commit to it, the rest of your life starts to become a breeze."}, {"725f": "Immediately following your workout you feel amazing! This is because during the process our brains’ emit a plethora of elevating hormones and chemicals. People pay top dollar to do drugs that emit these same chemicals, do yourself a favor and produce that shit yourself."}, {"52cb": "One of my early mottos in life was “look good, feel good, play good”. When you exercise daily you get all three. You look sexy as fuck, you feel more confident and inevitably you begin to make life your bitch."}, {"6de1": "3. Read, Listen, or Watch Inspirational Material"}, {"b63a": "This tiny habit pays out huge dividends. When I wake up I make sure to read at least one inspirational article. This is the sure-fire way to start your day off right."}, {"8dd7": "Before letting your mind think or act for itself, fill it with motivation and optimism."}, {"abf8": "Why daily inspiration wires your mind for success"}, {"efe3": "Answer yourself honestly — when you wake up what is the first thing you do? Do you check your phone for texts, emails, or social media notifications? I succumb to this sometimes as well, I think we all do."}, {"5293": "Anyways, if that does sound like you, then your day begins by reacting to things. This habitually wires your mind to be reactive rather than proactive."}, {"3e48": "I get it, you use your phone for an alarm, it is impossible to not see notifications in the morning. Rather than paying them any mind, turn off your alarm and pick up a book or pick out an inspiring article (like mine!) on medium to read."}, {"36bf": "If you fill your mind with positivity every single day, over time you will naturally become an optimist no matter how big of a Negative Nelly you once were."}, {"627d": "Having a mind full of optimism is one of the first crucial steps toward leading a successful life."}, {"5713": "4. Practice Solitude"}, {"695a": "Practicing solitude simply put; is the act of being alone for an extended period of time. Every day I spend a great deal of time by myself, and I enjoy that time of solitude."}, {"d48b": "Now I am no “lone wolf”, I just choose to have several hours of alone time everyday, which to me are the most important hours."}, {"8a84": "Why daily solitude wires your mind for success"}, {"f059": "When you are alone for extended periods of time it is impossible to ignore that little voice inside your head. Most people’s minds are primed for negative thoughts so they will do anything to distract themselves….from themselves. This is a commonly traveled pathway to destruction."}, {"7369": "When you continually distract yourself in avoidance of addressing the real problems within you — instead of them disappearing they compound and get stronger. This can later lead to drug dependence, violence, emotional breakdowns, midlife crises, and other self-abusive behaviors."}, {"9da5": "This is why it is extremely important to spend time by yourself to literally get to know who you are as a person. In solitude you develop peace within yourself, you learn your direction in life, understand and address your emotions, and ultimately become whole."}, {"aa88": "5. Take Cold Showers"}, {"4a5e": "This is a much more recent habit of mine, one that originally occurred without choice. I just bought a house and the water heater wasn’t working, so the first few days I took cold showers. Although bizarre on the forefront, the benefits of cold showers are surprisingly positive."}, {"3fdc": "I myself am a HUGE fan of hot steamy showers. I mean they are fucking amazing right? I am not telling you to go ahead and eliminate the awesomeness of a hot shower but I am asking you to consider a quick cold shower in the morning."}, {"b609": "Why daily cold showers wire your mind for success"}, {"e478": "There is nothing worse than having to take a cold shower in the morning…but is it really as bad as people make it out to be?"}, {"96a9": "When you step inside a freezing cold vortex of spraying water your whole body is jolted awake. You are so cold that your body automatically reacts by forcing heavy breaths out of you. After a minute or so, this turns into complete and utter euphoric lucidity."}, {"ee14": "Taking cold showers forces you very quickly to become less of a pussy and much more of a strong individual. However, to fully reap this benefit you need to do it daily — which as a residual result teaches you discipline."}, {"63a7": "A disciplined mind that is alert, lucid, and strong is almost unstoppable and this can be gradually trained with the help of one cold shower a day."}, {"84fe": "Why I Write"}, {"148f": "I truly believe we are all here for a reason, we all have a purpose. Mine is to understand and apply the mindset of growth and to inspire others to do the same."}, {"44a2": "If you felt inspired by my article today please recommend, share, and subscribe to receive inspiration every Sunday!"}, {"f58d": "Did this publication bring you value? Click the ❤ below to recommend it to others and spread the value further!"}], "child": "1070_1\t1070_2\t1070_3\t1070_4\t1070_5\t1070_6\t1070_7\t1070_8\t1070_9\t1070_10\t1070_11\t1070_12\t1070_13\t1070_14\t1070_15\t1070_16\t1070_17\t1070_18\t1070_19\t1070_20\t1070_21\t1070_22\t1070_23\t1070_24\t1070_251070_1\t1070_2\t1070_3\t1070_4\t1070_5\t1070_6\t1070_7\t1070_8\t1070_9\t1070_10\t1070_11\t1070_12\t1070_13\t1070_14\t1070_15\t1070_16\t1070_17\t1070_18\t1070_19\t1070_20\t1070_21\t1070_22\t1070_23\t1070_24\t1070_25"}