{"name": "1073", "parent": "", "content": "It is what it is A couple of years back, where did you think you would be? Contrast that to where are you right now. If where you are right now is where you thought you’d be, then you have accomplished quite a great deal and for that I commend you. But if you haven’t, then you’re a lot like me. There’s always hope that things will work your way, that you’ll get everything it is that you seek, but that’s not how things are handed out to you. How often do you really end up with what you want? Not a lot, yeah? Finding purpose in life isn’t as hyped out as it’s made to be, and neither is becoming successful. Success can be measured in a lot of ways. Some people equate it to money, the others to power or position. But there exist things that are worth way more than just money or possessions. What you think you want, and what you end up with, are two sides of the same coin, except that the one that’s showing is what you really need. So what if you aren’t rich? Or successful? Or smart? So what? That’s not the ultimate goal. If it were, then once you get there, what happens? You want more. To get richer, or smarter, or more successful. There’s an insatiable desire that never seems to be satisfied, regardless of how hard you try. What if you could just be happy, be content with everything that’s thrown your way? When things aren’t going your way, all you need to do is slow down. There are some things that simply cannot be rushed. Some things that need to take their toll on you before an outcome can be obtained. Some things that have to break you before they make you stronger. It’s funny how we envision life to be. How we make plans to get ahead, to make better what we lack right now. We’re always hoping that things will always go our way. Always hoping that something comes by, saving us by the skin of our teeth. What we don’t anticipate, however, is what would happen if things didn’t go our way. Sure, everyone has their weigh in on best case, worst case scenario. But how many of us actually really think about the worst case scenario being our reality? Not me I can safely say. There’s always hope, that bank on luck and not to forget escaping by just an inch. Despite your past, and everything that you’ve been through, the present simply cannot be predicted, needless to say, neither can the future. We live in a dynamic environment where anything could happen, quite literally. Sometimes it’s all smooth sailing which is when expectation sets in. Expectation that things will always turn up this way, when the bitter truth is that it won’t. To every upside, there’s a downside. That’s how life chooses to balance itself. To every wrong there’s a right. That’s how you’re served up a fair dose of everything. You only get what you can tolerate. Everything that comes your way is not going to be easy. It’s going to give you hell if it has to. It’s going to break you if it has to. Crush you to tiny pieces if it has to. But you know what? That’s okay. For every ounce that it breaks you, it makes you. For every crumb that it reduces you to, it builds you. For every hellish moment, it strengthens you. These are life’s strange way of teaching us how to live it. It’s okay to fall, it’s okay to not know where you’re headed, what you want to be, where you want to be. What’s not okay, is staying that way, ending the quest to figure out the answers to those questions. Think about it, if you had everything handed out to you on a platter, do you really think that you’d put in an effort? Do you think you would struggle to make something out of your life? Or would you just stay put, content at the pace of things? Maybe what you’re going through isn’t the best. Maybe you deserve a lot better. Maybe you’re limited by the situation. And that’s okay. Keep fighting regardless of the outcome. Always come back for more air if you feel swallowed by the sea. There’s no way for you to know you have to manage your anger, if you haven’t been put in a situation that makes you want to break things. There’s no way for you to tell you’re bad at something, unless you’ve been in a situation where you have failed miserably. Don’t settle for anything less. Maybe right now isn’t the best for you, but that shouldn’t stop you from making tomorrow any better. Confidence in yourself is what you need. To learn your strengths, your weaknesses and shortcomings, so you know how to handle them. It’s okay to lose your cool every once in a while. But that doesn’t mean you don’t try to control it. It’s alright to feel like muck every once in a while, but that doesn’t mean you forever stay in that state. It’s okay to shut people out, but that doesn’t mean you always do that. Keep moving no matter what it is that anchors you from doing just that. Keep moving, floating, or whatever it is you call it, until you’re on the right shore. You never know how every tiny little act could work out for you. For a better tomorrow, forget yesterday and live for today. Learn from yesterday and let today be where you apply all that you’ve learned. If today isn’t your day, maybe tomorrow will be. You just need to give your very best to all that you do, so that way when life throws you a curve ball, you know that you’re a victim of uncertainty and not one of regret, caught in the doldrums of that force we call life. And that’s completely okay as long as you keep moving. Another ditch in the road, You keep moving,Another stop sign, You keep moving on. The going is going to get tough. It’s going to be rough. But that doesn’t mean it stays that way. The world’s a fairly simple place to be in, if you just live for right now to best of your ability. The ultimate goal isn’t to emerge victor. It isn’t to get ahead of everyone else. It isn’t to win. It isn’t to be the richest, the wisest, or the smartest. It’s to become the best version of yourself. It’s to be able to stand up for yourself. It’s to be comfortable within your own skin. It’s to find yourself through the ups and downs. It’s to make it through in tact despite everything that came your way. It’s to take anything that comes your way head first. Most of all it’s to become You. You in all your glory. The one true you that nothing can break. ", "title": "It is what it is", "sentences": [{"d8f7": "It is what it is"}, {"728e": "A couple of years back, where did you think you would be? Contrast that to where are you right now. If where you are right now is where you thought you’d be, then you have accomplished quite a great deal and for that I commend you. But if you haven’t, then you’re a lot like me."}, {"32a4": "There’s always hope that things will work your way, that you’ll get everything it is that you seek, but that’s not how things are handed out to you. How often do you really end up with what you want? Not a lot, yeah?"}, {"0581": "Finding purpose in life isn’t as hyped out as it’s made to be, and neither is becoming successful. Success can be measured in a lot of ways. Some people equate it to money, the others to power or position. But there exist things that are worth way more than just money or possessions."}, {"d32a": "What you think you want, and what you end up with, are two sides of the same coin, except that the one that’s showing is what you really need."}, {"ef51": "So what if you aren’t rich? Or successful? Or smart? So what? That’s not the ultimate goal. If it were, then once you get there, what happens? You want more. To get richer, or smarter, or more successful. There’s an insatiable desire that never seems to be satisfied, regardless of how hard you try."}, {"6487": "What if you could just be happy, be content with everything that’s thrown your way? When things aren’t going your way, all you need to do is slow down. There are some things that simply cannot be rushed. Some things that need to take their toll on you before an outcome can be obtained. Some things that have to break you before they make you stronger."}, {"b92d": "It’s funny how we envision life to be. How we make plans to get ahead, to make better what we lack right now. We’re always hoping that things will always go our way. Always hoping that something comes by, saving us by the skin of our teeth. What we don’t anticipate, however, is what would happen if things didn’t go our way. Sure, everyone has their weigh in on best case, worst case scenario. But how many of us actually really think about the worst case scenario being our reality? Not me I can safely say."}, {"b94b": "There’s always hope, that bank on luck and not to forget escaping by just an inch. Despite your past, and everything that you’ve been through, the present simply cannot be predicted, needless to say, neither can the future. We live in a dynamic environment where anything could happen, quite literally. Sometimes it’s all smooth sailing which is when expectation sets in. Expectation that things will always turn up this way, when the bitter truth is that it won’t."}, {"8f1e": "To every upside, there’s a downside. That’s how life chooses to balance itself. To every wrong there’s a right. That’s how you’re served up a fair dose of everything."}, {"403e": "You only get what you can tolerate. Everything that comes your way is not going to be easy. It’s going to give you hell if it has to. It’s going to break you if it has to. Crush you to tiny pieces if it has to. But you know what? That’s okay. For every ounce that it breaks you, it makes you. For every crumb that it reduces you to, it builds you. For every hellish moment, it strengthens you. These are life’s strange way of teaching us how to live it."}, {"adf9": "It’s okay to fall, it’s okay to not know where you’re headed, what you want to be, where you want to be. What’s not okay, is staying that way, ending the quest to figure out the answers to those questions. Think about it, if you had everything handed out to you on a platter, do you really think that you’d put in an effort? Do you think you would struggle to make something out of your life? Or would you just stay put, content at the pace of things?"}, {"889d": "Maybe what you’re going through isn’t the best. Maybe you deserve a lot better. Maybe you’re limited by the situation. And that’s okay. Keep fighting regardless of the outcome. Always come back for more air if you feel swallowed by the sea. There’s no way for you to know you have to manage your anger, if you haven’t been put in a situation that makes you want to break things. There’s no way for you to tell you’re bad at something, unless you’ve been in a situation where you have failed miserably."}, {"f495": "Don’t settle for anything less. Maybe right now isn’t the best for you, but that shouldn’t stop you from making tomorrow any better."}, {"b0ff": "Confidence in yourself is what you need. To learn your strengths, your weaknesses and shortcomings, so you know how to handle them. It’s okay to lose your cool every once in a while. But that doesn’t mean you don’t try to control it. It’s alright to feel like muck every once in a while, but that doesn’t mean you forever stay in that state. It’s okay to shut people out, but that doesn’t mean you always do that. Keep moving no matter what it is that anchors you from doing just that. Keep moving, floating, or whatever it is you call it, until you’re on the right shore."}, {"ceb7": "You never know how every tiny little act could work out for you. For a better tomorrow, forget yesterday and live for today. Learn from yesterday and let today be where you apply all that you’ve learned. If today isn’t your day, maybe tomorrow will be. You just need to give your very best to all that you do, so that way when life throws you a curve ball, you know that you’re a victim of uncertainty and not one of regret, caught in the doldrums of that force we call life. And that’s completely okay as long as you keep moving."}, {"6bce": "Another ditch in the road, You keep moving,Another stop sign, You keep moving on."}, {"cef8": "The going is going to get tough. It’s going to be rough. But that doesn’t mean it stays that way."}, {"a612": "The world’s a fairly simple place to be in, if you just live for right now to best of your ability. The ultimate goal isn’t to emerge victor. It isn’t to get ahead of everyone else. It isn’t to win. It isn’t to be the richest, the wisest, or the smartest. It’s to become the best version of yourself. It’s to be able to stand up for yourself. It’s to be comfortable within your own skin. It’s to find yourself through the ups and downs. It’s to make it through in tact despite everything that came your way. It’s to take anything that comes your way head first."}, {"b25e": "Most of all it’s to become You. You in all your glory. The one true you that nothing can break."}], "child": "1073_1\t1073_2\t1073_3\t1073_4\t1073_5\t1073_6\t1073_7\t1073_8\t1073_9\t1073_10\t1073_11\t1073_12\t1073_13\t1073_14\t1073_15\t1073_16\t1073_17\t1073_18\t1073_19\t1073_20\t1073_21\t1073_22\t1073_23"}