{"name": "1076", "parent": "", "content": "9 Dying Instagram Trends That Are Dragging You Down By Sandra Iakovleva, Content Marketing Manager at Depositphotos Previously, we’ve talked about tips that could help you improve your instagram game. Just as it is important knowing what to do, it’s good to know what not to. Instagram is an incredible platform that is also rewarding but you need a little bit of background knowledge to succeed. It has been around for a while now and here are some of the lessons we’ve learned and 9 trends that are definitely no longer ‘in’. It doesn’t mean you shouldn’t photograph in this style, but do understand that they’re outdated trends and you should be a little more innovative if you want to increase your following and improve your feed. This article also contains some of the top Clashot photographs to give you more ideas on what to photograph and what is trending right now. 1. Collages Posting a collage with 12 perfect shots of sunsets, food, drinks etc. is no longer a trend. We have the option of posting multiple images in one post which tells you this is no longer relative. Collages can quickly become tacky and that’s the last thing anyone wants. Try this instead: You can take a series of photographs instead of a collage and upload them as 1 post. Street photography is becoming increasingly popular which is another theme to explore. 2. Follow me The only account that can pull this off is Murad Osmann. His account has made it into a signature image and all other copycat styles just don’t reach the bar. The photographs others take are a little cheesy and no longer valid as a trend. Try this instead: Show something unusual — photograph street life and other creative spaces. Everyday is such a great opportunity to explore creative angles and photograph new subjects. 3. Smug photos of food These, and also random pictures of food are just a big no-no now. There are accounts that put all their efforts into food photography but they are artistic, well thought out shots. Random pictures of food have people rolling their eyes. Unless you can find a new twist to it, you have to stop. Another pet peeve is posting pictures of unappetizing food. If you’re going there, at least make it presentable! Try this instead: Experiment with minimalism if you are going to take food photographs. Architecture and candid moments of everyday life is another great area to venture into. 4. Outfit of the day Unless you’re a celebrity with a wardrobe the size of your apartment, chances are your images will not be appreciated in the way you intend them to be. This trend is getting old especially when the shots are from your perspective looking at your feet. Try this instead: Photographs taken from unconventional angles are much more interesting. Take pictures of DIY things and experiment with composition and flat lay. 5. Inspirational quotes I’m sure that most Instagram feeds are full of these motivational, inspirational, cheesy phrases. Quotes are nice, but their days are numbered. One thing you’ll notice with all these trends is that if you don’t take it up a notch, it’s safe to say they’re dead. You can find other ways to inspire people or at least give your quotes an artistic touch. See Depositphotos’ inspirational quotes on Facebook. Try this instead: Compose inspirational images that show thought and have deeper meanings. 6. Next level hashtags More than any of the other dying trends, this one is just annoying. If you’re taking a picture at the beach and feel the need to basically hashtag your hashtags (#breakfast #delicious #photooftheday #yum #heaven #bliss #food #ilovefood #foodie), you’re falling in the trap of extreme hashtagging. Be more thoughtful and creative, keep it relevant and minimal. Try this instead: Tone down on the hashtags, think in metaphors and put more thought into your tags or if you’re hungry for followers — TagsForLikes. 7. Throwback Thursday Don’t get me wrong, throwback Thursdays are fun but it’s another thing when it is taken advantage of and abused. I’m talking about spamming streams with endless pictures of yourself as a kid and combining that with ‘next level hashtags’. There is a time and place for baby pictures, and it’s not Instagram in 2017. Try this instead: Thursday? Post something more fitting that will speak to people in a universal language. 8. Gym selfies Everyone gets it, you work out — good job! Some things should be kept to yourself. Since we’re on the topic, if you’re working out, do it for yourself. You’re not working out to impress anyone. It’s about your wellbeing and everyone is happy for you but we don’t want to see a million gym selfies in mirrors. You’re also probably making people that came to actually work out a little uncomfortable. Try this instead: Focus on someone other than yourself. Take photographs of people on the streets, doing their job and going about their daily lives. 9. Fisheye shots There was a time when fisheye lenses were cool, but 2017 has brought us with so many great trends that this one is kind of a bore! I think it is safe to say that we don’t see these very often anymore (and for good reasons). Try this instead: Taking authentic photographs, action shots and images that show movement. Keep up with our articles to learn more about current Instagram trends and the things you can do to improve your feed. This story was originally published at blog.depositphotos.com ", "title": "9 Dying Instagram Trends That Are Dragging You Down", "sentences": [{"6819": "9 Dying Instagram Trends That Are Dragging You Down"}, {"91cc": "By Sandra Iakovleva, Content Marketing Manager at Depositphotos"}, {"4fd4": "Previously, we’ve talked about tips that could help you improve your instagram game. Just as it is important knowing what to do, it’s good to know what not to. Instagram is an incredible platform that is also rewarding but you need a little bit of background knowledge to succeed. It has been around for a while now and here are some of the lessons we’ve learned and 9 trends that are definitely no longer ‘in’."}, {"d419": "It doesn’t mean you shouldn’t photograph in this style, but do understand that they’re outdated trends and you should be a little more innovative if you want to increase your following and improve your feed."}, {"9938": "This article also contains some of the top Clashot photographs to give you more ideas on what to photograph and what is trending right now."}, {"a399": "1. Collages"}, {"a8ca": "Posting a collage with 12 perfect shots of sunsets, food, drinks etc. is no longer a trend. We have the option of posting multiple images in one post which tells you this is no longer relative. Collages can quickly become tacky and that’s the last thing anyone wants."}, {"baa2": "Try this instead:"}, {"c6d5": "You can take a series of photographs instead of a collage and upload them as 1 post. Street photography is becoming increasingly popular which is another theme to explore."}, {"3362": "2. Follow me"}, {"cdeb": "The only account that can pull this off is Murad Osmann. His account has made it into a signature image and all other copycat styles just don’t reach the bar. The photographs others take are a little cheesy and no longer valid as a trend."}, {"3b62": "Try this instead:"}, {"09ae": "Show something unusual — photograph street life and other creative spaces. Everyday is such a great opportunity to explore creative angles and photograph new subjects."}, {"d21c": "3. Smug photos of food"}, {"1f46": "These, and also random pictures of food are just a big no-no now. There are accounts that put all their efforts into food photography but they are artistic, well thought out shots. Random pictures of food have people rolling their eyes. Unless you can find a new twist to it, you have to stop. Another pet peeve is posting pictures of unappetizing food. If you’re going there, at least make it presentable!"}, {"d705": "Try this instead:"}, {"a4ba": "Experiment with minimalism if you are going to take food photographs. Architecture and candid moments of everyday life is another great area to venture into."}, {"f536": "4. Outfit of the day"}, {"23e2": "Unless you’re a celebrity with a wardrobe the size of your apartment, chances are your images will not be appreciated in the way you intend them to be. This trend is getting old especially when the shots are from your perspective looking at your feet."}, {"e446": "Try this instead:"}, {"a8cc": "Photographs taken from unconventional angles are much more interesting. Take pictures of DIY things and experiment with composition and flat lay."}, {"0183": "5. Inspirational quotes"}, {"723c": "I’m sure that most Instagram feeds are full of these motivational, inspirational, cheesy phrases. Quotes are nice, but their days are numbered. One thing you’ll notice with all these trends is that if you don’t take it up a notch, it’s safe to say they’re dead. You can find other ways to inspire people or at least give your quotes an artistic touch. See Depositphotos’ inspirational quotes on Facebook."}, {"e2b2": "Try this instead:"}, {"b049": "Compose inspirational images that show thought and have deeper meanings."}, {"b9d4": "6. Next level hashtags"}, {"ebc2": "More than any of the other dying trends, this one is just annoying. If you’re taking a picture at the beach and feel the need to basically hashtag your hashtags (#breakfast #delicious #photooftheday #yum #heaven #bliss #food #ilovefood #foodie), you’re falling in the trap of extreme hashtagging. Be more thoughtful and creative, keep it relevant and minimal."}, {"3e49": "Try this instead:"}, {"33b5": "Tone down on the hashtags, think in metaphors and put more thought into your tags or if you’re hungry for followers — TagsForLikes."}, {"a441": "7. Throwback Thursday"}, {"cb2a": "Don’t get me wrong, throwback Thursdays are fun but it’s another thing when it is taken advantage of and abused. I’m talking about spamming streams with endless pictures of yourself as a kid and combining that with ‘next level hashtags’. There is a time and place for baby pictures, and it’s not Instagram in 2017."}, {"d53e": "Try this instead:"}, {"ae54": "Thursday? Post something more fitting that will speak to people in a universal language."}, {"e1b0": "8. Gym selfies"}, {"c396": "Everyone gets it, you work out — good job! Some things should be kept to yourself. Since we’re on the topic, if you’re working out, do it for yourself. You’re not working out to impress anyone. It’s about your wellbeing and everyone is happy for you but we don’t want to see a million gym selfies in mirrors. You’re also probably making people that came to actually work out a little uncomfortable."}, {"65f9": "Try this instead:"}, {"e862": "Focus on someone other than yourself. Take photographs of people on the streets, doing their job and going about their daily lives."}, {"29c0": "9. Fisheye shots"}, {"5bb1": "There was a time when fisheye lenses were cool, but 2017 has brought us with so many great trends that this one is kind of a bore! I think it is safe to say that we don’t see these very often anymore (and for good reasons)."}, {"9d85": "Try this instead:"}, {"284b": "Taking authentic photographs, action shots and images that show movement."}, {"3657": "Keep up with our articles to learn more about current Instagram trends and the things you can do to improve your feed."}, {"e44e": "This story was originally published at blog.depositphotos.com"}], "child": "1076_1\t1076_2"}