{"name": "1083", "parent": "", "content": "AIGrant: Get $5,000 for your open source AI project After I graduated from MIT, I knew I wanted to work on open source – but I didn’t have any money. For weeks after graduation, I lived in the lounge of my old dorm, sleeping on a smelly red sofa because I still had a key and the internet was fast. I’d turned down some respectable job offers to sleep on that sofa and my parents were starting to worry about my judgment. Tim Ney at the Free Software Foundation took pity on me and wrote me a check for $350. The money was ostensibly for helping them with their office network, but Tim didn’t ask me to do anything, and the actual effect was to keep me afloat for another couple weeks while I hacked on GNOME and worked on starting my first company. Open source was the foundation of my career and some of my closest friendships; but it’s also the foundation of millions of products and ideas that only exist because you can get started by grabbing free code off the internet. It’s actually hard to remember what the world was like before open source became widespread. Creating something new used to mean that your first step was to build or buy your baseline infrastructure. That’s gone today, and with every new piece of open source, the price of admission gets closer to zero. I am sure that AI will be the foundation of a million new products, ideas, and companies in the future. From cars to medicine to finance to education, AI will power a huge wave of innovation. And open source AI will lower the price of admission so that anyone can participate (ok, you’ll still have to pay for GPUs). So for anyone sleeping on a smelly red sofa (actual or metaphorical), I want to provide the same opportunity Tim gave me; to get a little funding to pursue a dream. I am offering five grants of $5,000 each to anyone who wants to pursue a project in AI, and open source their work. FAQs Can anyone apply? Yes – any age, any country, no credentials required. What type of project qualifies? Any project in AI, large or small, as long as you release your work under the MIT or Apache 2.0 license. If possible, any datasets employed should also be released. As for what qualifies as “AI,” I’m open-minded. Your project can be: …or anything else that feels like AI. How will you select the winners? I’m looking for smart people with interesting ideas that could be useful to the world. I’ll pay extra attention to projects that seem like they won’t get funded another way. Some friends who know a lot about AI will help review applications (if you know a lot about AI and want to help review applications, email me!) I have a job. Can I still apply? Yes! Anyone can apply. You just need to make sure that your employer will let you release your work under the MIT or Apache 2.0 license. Can teams apply? Yes. Multiple people can apply together as a team. Please fill out a single application, but provide background information for each person in the team. You should designate a lead person to coordinate the interview as well as receive and distribute/spend the money. How does it work if I win? I’ll give you 50% up front. I’ll check in with you before sending the second half. Then I’ll do a follow-up phone call and/or email at the end to hear how it went. I’ll publish a list of all the winners on aigrant.org after they’ve been selected, and maybe when the projects complete, or reach interesting milestones. During the project, you don’t need to make regular reports on your progress (though I’d be happy to hear from you). How do I apply? To apply, please fill out the form at aigrant.org. I’ll select 10 to 20 finalists for a short interview to make sure you’re a real person and to ask a few questions about your project. Winners will be chosen after the interviews are complete. What’s the deadline? The key dates are: Of course, these dates are subject to change if they turn out to be wildly wrong for some reason! Can I apply multiple times? Yes, you can apply as often as you like. You can only win once. How do I get the money? I can send you the money via PayPal, wire transfer, or bitcoin. I love this idea and I want to help! Can I provide additional funding, hardware, GPU time, datasets, mentorship, or help reviewing applications? Yes! 🙏 Thank you for being awesome! If you want to contribute in any way, please email me. Are you doing this as part of a company? Nope, this is just me. The money is an unrestricted personal gift. It’s not an equity investment or loan, I won’t own any of your intellectual property, and there’s no contract to sign. Will this be a regular thing? Maybe! Let’s see how it goes. Where did you get the idea to do this? This post is inspired by, and directly borrows many elements from Nadia Eghbal’s amazing no-strings-attached grant program. Thanks, Nadia! ", "title": "AIGrant: Get $5,000 for your open source AI project", "sentences": [{"05a4": "AIGrant: Get $5,000 for your open source AI project"}, {"ba43": "After I graduated from MIT, I knew I wanted to work on open source – but I didn’t have any money. For weeks after graduation, I lived in the lounge of my old dorm, sleeping on a smelly red sofa because I still had a key and the internet was fast. I’d turned down some respectable job offers to sleep on that sofa and my parents were starting to worry about my judgment."}, {"d88e": "Tim Ney at the Free Software Foundation took pity on me and wrote me a check for $350. The money was ostensibly for helping them with their office network, but Tim didn’t ask me to do anything, and the actual effect was to keep me afloat for another couple weeks while I hacked on GNOME and worked on starting my first company."}, {"714f": "Open source was the foundation of my career and some of my closest friendships; but it’s also the foundation of millions of products and ideas that only exist because you can get started by grabbing free code off the internet. It’s actually hard to remember what the world was like before open source became widespread. Creating something new used to mean that your first step was to build or buy your baseline infrastructure. That’s gone today, and with every new piece of open source, the price of admission gets closer to zero."}, {"7207": "I am sure that AI will be the foundation of a million new products, ideas, and companies in the future. From cars to medicine to finance to education, AI will power a huge wave of innovation. And open source AI will lower the price of admission so that anyone can participate (ok, you’ll still have to pay for GPUs)."}, {"3f51": "So for anyone sleeping on a smelly red sofa (actual or metaphorical), I want to provide the same opportunity Tim gave me; to get a little funding to pursue a dream. I am offering five grants of $5,000 each to anyone who wants to pursue a project in AI, and open source their work."}, {"6164": "FAQs"}, {"d2ed": "Can anyone apply?"}, {"8783": "Yes – any age, any country, no credentials required."}, {"461d": "What type of project qualifies?"}, {"af15": "Any project in AI, large or small, as long as you release your work under the MIT or Apache 2.0 license. If possible, any datasets employed should also be released."}, {"64ff": "As for what qualifies as “AI,” I’m open-minded. Your project can be:"}, {"fc9b": "…or anything else that feels like AI."}, {"e883": "How will you select the winners?"}, {"4565": "I’m looking for smart people with interesting ideas that could be useful to the world. I’ll pay extra attention to projects that seem like they won’t get funded another way."}, {"d413": "Some friends who know a lot about AI will help review applications (if you know a lot about AI and want to help review applications, email me!)"}, {"e6cc": "I have a job. Can I still apply?"}, {"afc2": "Yes! Anyone can apply. You just need to make sure that your employer will let you release your work under the MIT or Apache 2.0 license."}, {"f329": "Can teams apply?"}, {"f573": "Yes. Multiple people can apply together as a team. Please fill out a single application, but provide background information for each person in the team. You should designate a lead person to coordinate the interview as well as receive and distribute/spend the money."}, {"d38e": "How does it work if I win?"}, {"61dd": "I’ll give you 50% up front. I’ll check in with you before sending the second half. Then I’ll do a follow-up phone call and/or email at the end to hear how it went."}, {"2c6b": "I’ll publish a list of all the winners on aigrant.org after they’ve been selected, and maybe when the projects complete, or reach interesting milestones."}, {"57e0": "During the project, you don’t need to make regular reports on your progress (though I’d be happy to hear from you)."}, {"c82b": "How do I apply?"}, {"10b6": "To apply, please fill out the form at aigrant.org."}, {"72f8": "I’ll select 10 to 20 finalists for a short interview to make sure you’re a real person and to ask a few questions about your project. Winners will be chosen after the interviews are complete."}, {"1dd4": "What’s the deadline?"}, {"55ad": "The key dates are:"}, {"7695": "Of course, these dates are subject to change if they turn out to be wildly wrong for some reason!"}, {"aedd": "Can I apply multiple times?"}, {"1459": "Yes, you can apply as often as you like. You can only win once."}, {"c36e": "How do I get the money?"}, {"c957": "I can send you the money via PayPal, wire transfer, or bitcoin."}, {"3edd": "I love this idea and I want to help! Can I provide additional funding, hardware, GPU time, datasets, mentorship, or help reviewing applications?"}, {"b26e": "Yes! 🙏 Thank you for being awesome! If you want to contribute in any way, please email me."}, {"c571": "Are you doing this as part of a company?"}, {"908a": "Nope, this is just me. The money is an unrestricted personal gift. It’s not an equity investment or loan, I won’t own any of your intellectual property, and there’s no contract to sign."}, {"d3ce": "Will this be a regular thing?"}, {"0df4": "Maybe! Let’s see how it goes."}, {"a315": "Where did you get the idea to do this?"}, {"979a": "This post is inspired by, and directly borrows many elements from Nadia Eghbal’s amazing no-strings-attached grant program. Thanks, Nadia!"}], "child": "1083_1\t1083_2\t1083_3\t1083_4\t1083_5\t1083_6"}