{"name": "1085", "parent": "", "content": "The top GitHub projects per country Let’s find the most popular GitHub projects for each country. A simple query can give us that result: Take every star given on GitHub and look for the country of origin of users who have chosen to show their country on their GitHub profile. But we are going to go deeper than that. Step 1: The most popular GitHub project per country — naive count The first pass results are somehow monotone, and not surprising: FreeCodeCamp was the most starred GitHub project by far in 2016: The most starred project per country on GitHub during 2016 — naive count. Step 2: What about the 2nd most popular project for each country? The 2nd most starred project per country on GitHub during 2016 — naive count. The 2nd most starred project for each country shows more variety results: Let’s skip the top 75 worldwide GitHub projects, and only then choose the most popular project per country: A list of the most interesting GitHub projects for each country: Let’s get a list of top projects for each country, this time with some rules: And these are our results: Joshua Levy appears on top of the US — Americans show a lot of attention to compensation. It’s great to see Kelsey Hightower in this list too with his Kubernetes in hard mode. On data — I love data, in this case coming from FiveThirtyEight. And thanks Alex Gaynor for teaching us “what happens when”, Ben Brown for chat bots, J Delaney for easy applications, and everyone else listed here and beyond! China — they love WeChat — and they have their own version of FreeCodeCamp. Germany — Daniel Quinn is Canadian who lives in the UK, nevertheless Germans starred his project paperless to the top. UK — great to see Max Woolf and Kelsey Hightower again. And on top of the UK, Rich Harris’s Svelte. India seems to pay a lot of attention to CS educational repositories. Brazil — where the top project translates to “love Serenade” and its mission is to give “Artificial Intelligence for social control of public administration”. Tell me more, Irio Musskopf at Data Science Brigade. Russia — yandex is big there, as well as YoptaScript (as in Ukraine). France seems to be big into PHP. I’d love to learn more. Japan — I don’t know much about these projects, but they seem very Japanese oriented. Canada — seems not only the us cares about stock options compensation. Australia — not many Australian exclusive projects show up, but some of the ones we already saw. Not sure why relax/relax is big here, as their top maintainers live in Portugal (Bruno Mota, for example). Taiwan — where the top project mission is to “Make the Taiwan a Better Place to Work”. I like it. Ukraine — top project samgozman/YoptaScript says “Скриптовый язык программирования для гопников и реальных пацанов”. Makes sense. Spain — Karumi is a Spanish company, and their Android framework is the top project for Spain. Great to see open data as their #2. (comments pending) Netherlands — They also pay a lot of attention to Max’s big list of naughty strings. (comments pending) South Korea — open government on top. Also interesting to see Apache Zeppelin on top of this country ranking, as I met many of its developers in Seoul (hello Seoul Engineer!). Italy — where you can find the constitutional reform on top of their GitHub projects (and maybe send pull requests?). (comments pending) (comments pending) (comments pending) Switzerland — not only Germany has danielquinn/paperless within the top, Switzerland too. But the top project is “an opensource, publicly owned evoting system. It is the result of the collaboration between the Geneva State Chancellery and the Geneva IT Department”. Good. (comments pending) (comments pending) Portugal — Max Woolf again between the top projects with his big list of naughty strings. (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) (comments pending) Romania — where a list of cool projects made in Romania is on top of the Romanian projects. Thanks IonicaBizau! Ireland: Not only the US and Canada care about stock options compensation. Probably due to a big presence of American tech companies, Ireland also shows its interest. (comments pending) Israel — on top of this list we can see Arik Fraimovich’s re:dash — my favorite open source dashboarding tool. This project is not exclusive to Israel, but since Arik lives there that apparently makes an awareness impact. (comments pending) (comments pending) Philippines — Rico Sta. Cruz lives there, and his project shows on top. (comments pending) (comments pending) Chile — my home country! Great to see projects from Juan Antonio Karmy, Agustin Feuerhake, platanus, Yerko Palma, Juan Antonio Karmy on top. More countries? Find the raw list on a spreadsheet. Queries Datasets Most popular GitHub project per country, naive count: #standardSQLSELECT REGEXP_EXTRACT(a.name, r'/(.*)'), stars, iso3FROM (  SELECT * FROM (    SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn    FROM (      SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name      FROM `githubarchive.year.2016` a      JOIN `ghtorrent-bq.ght_2017_01_19.users` b        ON a.actor.login=b.login      WHERE country_code IS NOT null       AND a.type='WatchEvent'      GROUP BY 1, 2      HAVING stars>5    )  )  WHERE rn=1) aJOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars DESC Most popular GitHub projects per country, removing the top 75, special rank: #standardSQLSELECT REGEXP_EXTRACT(a.name, r'/(.*)'), stars, iso3FROM (  SELECT * FROM (      SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn      FROM (        SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name        FROM `githubarchive.year.2016` a        JOIN `ghtorrent-bq.ght_2017_01_19.users` b          ON a.actor.login=b.login        WHERE country_code IS NOT null         AND repo.id NOT IN (SELECT id FROM (          SELECT repo.id, COUNT(*) c          FROM `githubarchive.year.2016` a          WHERE a.type='WatchEvent'          GROUP BY 1          ORDER BY 2 DESC          LIMIT 75        ))        AND a.type='WatchEvent'        GROUP BY 1, 2        HAVING stars>5      )    )    WHERE rn=1) aJOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars DESC Most popular GitHub projects per country, removing the top 75: #standardSQLSELECT country, a.name, stars, description, stars_country, other_countries_scFROM (SELECT * FROM (  SELECT *, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn2  FROM (    SELECT *, ROUND(SUM(1/(1+ROUND(rn/20,0))) OVER(PARTITION BY repo_id),1) other_countries_sc    FROM (      SELECT * FROM (        SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn, SUM(stars) OVER(PARTITION BY country_code) stars_country, repo_id        FROM (          SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name          FROM `githubarchive.year.2016` a          JOIN `ghtorrent-bq.ght_2017_01_19.users` b            ON a.actor.login=b.login          WHERE country_code IS NOT null           AND repo.id NOT IN (SELECT id FROM (            SELECT repo.id, COUNT(*) c            FROM `githubarchive.year.2016` a            WHERE a.type='WatchEvent'            GROUP BY 1            ORDER BY 2 DESC            LIMIT 75          ))          AND a.type='WatchEvent'          GROUP BY 1, 2          HAVING stars>5        )      )      WHERE rn<300    )  )  WHERE other_countries_sc<3)WHERE rn2<11) aLEFT JOIN (SELECT url, ANY_VALUE(description) description FROM `ghtorrent-bq.ght_2017_01_19.projects` GROUP BY 1) bON a.name=REPLACE(url, 'https://api.github.com/repos/', '')JOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars_country DESC, country_code, stars DESC Want more? Want more stories? Check my Medium, follow me on twitter, and subscribe to reddit.com/r/bigquery. And try BigQuery — every month you get a full terabyte of analysis for free. The top weekend programming languages — based on GitHub’s activityStack Overflow published an article analyzing the “top weekend programming languages”. One of their data scientists …medium.com What countries have more open source developers per capita than the US?We are going to use GitHub Archive, GHTorrent, population statistics and BigQuery to find the answer.medium.com Analyzing GitHub issues and comments with BigQuery(Docker, Kubernetes, TensorFlow and other top projects)medium.com ", "title": "The top GitHub projects per country", "sentences": [{"b6e4": "The top GitHub projects per country"}, {"4fad": "Let’s find the most popular GitHub projects for each country. A simple query can give us that result: Take every star given on GitHub and look for the country of origin of users who have chosen to show their country on their GitHub profile. But we are going to go deeper than that."}, {"1a3e": "Step 1: The most popular GitHub project per country — naive count"}, {"144a": "The first pass results are somehow monotone, and not surprising: FreeCodeCamp was the most starred GitHub project by far in 2016:"}, {"3526": "The most starred project per country on GitHub during 2016 — naive count."}, {"b8bf": "Step 2: What about the 2nd most popular project for each country?"}, {"341e": "The 2nd most starred project per country on GitHub during 2016 — naive count."}, {"ab62": "The 2nd most starred project for each country shows more variety results:"}, {"5f7e": "Let’s skip the top 75 worldwide GitHub projects, and only then choose the most popular project per country:"}, {"7e97": "A list of the most interesting GitHub projects for each country:"}, {"109f": "Let’s get a list of top projects for each country, this time with some rules:"}, {"a762": "And these are our results:"}, {"4d69": "Joshua Levy appears on top of the US — Americans show a lot of attention to compensation. It’s great to see Kelsey Hightower in this list too with his Kubernetes in hard mode. On data — I love data, in this case coming from FiveThirtyEight. And thanks Alex Gaynor for teaching us “what happens when”, Ben Brown for chat bots, J Delaney for easy applications, and everyone else listed here and beyond!"}, {"6d81": "China — they love WeChat — and they have their own version of FreeCodeCamp."}, {"19c3": "Germany — Daniel Quinn is Canadian who lives in the UK, nevertheless Germans starred his project paperless to the top."}, {"3f53": "UK — great to see Max Woolf and Kelsey Hightower again. And on top of the UK, Rich Harris’s Svelte."}, {"31ed": "India seems to pay a lot of attention to CS educational repositories."}, {"606c": "Brazil — where the top project translates to “love Serenade” and its mission is to give “Artificial Intelligence for social control of public administration”. Tell me more, Irio Musskopf at Data Science Brigade."}, {"a11f": "Russia — yandex is big there, as well as YoptaScript (as in Ukraine)."}, {"4212": "France seems to be big into PHP. I’d love to learn more."}, {"ff63": "Japan — I don’t know much about these projects, but they seem very Japanese oriented."}, {"f35e": "Canada — seems not only the us cares about stock options compensation."}, {"c247": "Australia — not many Australian exclusive projects show up, but some of the ones we already saw. Not sure why relax/relax is big here, as their top maintainers live in Portugal (Bruno Mota, for example)."}, {"36f1": "Taiwan — where the top project mission is to “Make the Taiwan a Better Place to Work”. I like it."}, {"2faa": "Ukraine — top project samgozman/YoptaScript says “Скриптовый язык программирования для гопников и реальных пацанов”. Makes sense."}, {"5f80": "Spain — Karumi is a Spanish company, and their Android framework is the top project for Spain. Great to see open data as their #2."}, {"5957": "(comments pending)"}, {"7739": "Netherlands — They also pay a lot of attention to Max’s big list of naughty strings."}, {"7a77": "(comments pending)"}, {"d2ed": "South Korea — open government on top. Also interesting to see Apache Zeppelin on top of this country ranking, as I met many of its developers in Seoul (hello Seoul Engineer!)."}, {"b6fa": "Italy — where you can find the constitutional reform on top of their GitHub projects (and maybe send pull requests?)."}, {"c281": "(comments pending)"}, {"f81d": "(comments pending)"}, {"e0d7": "(comments pending)"}, {"edae": "Switzerland — not only Germany has danielquinn/paperless within the top, Switzerland too. But the top project is “an opensource, publicly owned evoting system. It is the result of the collaboration between the Geneva State Chancellery and the Geneva IT Department”. Good."}, {"6093": "(comments pending)"}, {"b985": "(comments pending)"}, {"6500": "Portugal — Max Woolf again between the top projects with his big list of naughty strings."}, {"1e55": "(comments pending)"}, {"d3e4": "(comments pending)"}, {"8085": "(comments pending)"}, {"dd1b": "(comments pending)"}, {"199f": "(comments pending)"}, {"c2c0": "(comments pending)"}, {"5daa": "(comments pending)"}, {"21c4": "(comments pending)"}, {"fa36": "(comments pending)"}, {"547c": "(comments pending)"}, {"fa7c": "(comments pending)"}, {"4f1c": "Romania — where a list of cool projects made in Romania is on top of the Romanian projects. Thanks IonicaBizau!"}, {"9473": "Ireland: Not only the US and Canada care about stock options compensation. Probably due to a big presence of American tech companies, Ireland also shows its interest."}, {"2b7a": "(comments pending)"}, {"1d28": "Israel — on top of this list we can see Arik Fraimovich’s re:dash — my favorite open source dashboarding tool. This project is not exclusive to Israel, but since Arik lives there that apparently makes an awareness impact."}, {"4b2b": "(comments pending)"}, {"3f6c": "(comments pending)"}, {"6f30": "Philippines — Rico Sta. Cruz lives there, and his project shows on top."}, {"1aef": "(comments pending)"}, {"9f3a": "(comments pending)"}, {"abee": "Chile — my home country! Great to see projects from Juan Antonio Karmy, Agustin Feuerhake, platanus, Yerko Palma, Juan Antonio Karmy on top."}, {"3964": "More countries? Find the raw list on a spreadsheet."}, {"94fe": "Queries"}, {"dad5": "Datasets"}, {"05bf": "Most popular GitHub project per country, naive count:"}, {"31a2": "#standardSQLSELECT REGEXP_EXTRACT(a.name, r'/(.*)'), stars, iso3FROM (  SELECT * FROM (    SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn    FROM (      SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name      FROM `githubarchive.year.2016` a      JOIN `ghtorrent-bq.ght_2017_01_19.users` b        ON a.actor.login=b.login      WHERE country_code IS NOT null       AND a.type='WatchEvent'      GROUP BY 1, 2      HAVING stars>5    )  )  WHERE rn=1) aJOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars DESC"}, {"9d4d": "Most popular GitHub projects per country, removing the top 75, special rank:"}, {"6719": "#standardSQLSELECT REGEXP_EXTRACT(a.name, r'/(.*)'), stars, iso3FROM (  SELECT * FROM (      SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn      FROM (        SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name        FROM `githubarchive.year.2016` a        JOIN `ghtorrent-bq.ght_2017_01_19.users` b          ON a.actor.login=b.login        WHERE country_code IS NOT null         AND repo.id NOT IN (SELECT id FROM (          SELECT repo.id, COUNT(*) c          FROM `githubarchive.year.2016` a          WHERE a.type='WatchEvent'          GROUP BY 1          ORDER BY 2 DESC          LIMIT 75        ))        AND a.type='WatchEvent'        GROUP BY 1, 2        HAVING stars>5      )    )    WHERE rn=1) aJOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars DESC"}, {"6b86": "Most popular GitHub projects per country, removing the top 75:"}, {"8c9b": "#standardSQLSELECT country, a.name, stars, description, stars_country, other_countries_scFROM (SELECT * FROM (  SELECT *, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn2  FROM (    SELECT *, ROUND(SUM(1/(1+ROUND(rn/20,0))) OVER(PARTITION BY repo_id),1) other_countries_sc    FROM (      SELECT * FROM (        SELECT country_code, name, stars, ROW_NUMBER() OVER(PARTITION BY country_code ORDER BY stars DESC) rn, SUM(stars) OVER(PARTITION BY country_code) stars_country, repo_id        FROM (          SELECT country_code, repo.id repo_id,  COUNT(DISTINCT actor.login) stars, APPROX_TOP_COUNT(repo.name, 1)[OFFSET(0)].value name          FROM `githubarchive.year.2016` a          JOIN `ghtorrent-bq.ght_2017_01_19.users` b            ON a.actor.login=b.login          WHERE country_code IS NOT null           AND repo.id NOT IN (SELECT id FROM (            SELECT repo.id, COUNT(*) c            FROM `githubarchive.year.2016` a            WHERE a.type='WatchEvent'            GROUP BY 1            ORDER BY 2 DESC            LIMIT 75          ))          AND a.type='WatchEvent'          GROUP BY 1, 2          HAVING stars>5        )      )      WHERE rn<300    )  )  WHERE other_countries_sc<3)WHERE rn2<11) aLEFT JOIN (SELECT url, ANY_VALUE(description) description FROM `ghtorrent-bq.ght_2017_01_19.projects` GROUP BY 1) bON a.name=REPLACE(url, 'https://api.github.com/repos/', '')JOIN `gdelt-bq.extra.countryinfo` cON a.country_code=LOWER(c.iso)ORDER BY stars_country DESC, country_code, stars DESC"}, {"f39f": "Want more?"}, {"1c40": "Want more stories? Check my Medium, follow me on twitter, and subscribe to reddit.com/r/bigquery. And try BigQuery — every month you get a full terabyte of analysis for free."}, {"2601": "The top weekend programming languages — based on GitHub’s activityStack Overflow published an article analyzing the “top weekend programming languages”. One of their data scientists …medium.com"}, {"e94c": "What countries have more open source developers per capita than the US?We are going to use GitHub Archive, GHTorrent, population statistics and BigQuery to find the answer.medium.com"}, {"3edd": "Analyzing GitHub issues and comments with BigQuery(Docker, Kubernetes, TensorFlow and other top projects)medium.com"}], "child": "1085_1\t1085_2\t1085_3\t1085_4\t1085_5\t1085_6\t1085_7\t1085_8\t1085_9\t1085_10\t1085_11\t1085_12\t1085_13\t1085_14\t1085_15\t1085_16\t1085_17"}