{"name": "1099", "parent": "", "content": "The Black Mirror-ing of Christianity Answering Yuval Harari on Christianity and Virtual Reality In a recent interview with Ezra Klein, über-pessimistic socio-historian Yuval Harari said this: This idea of humans finding meaning in virtual reality games is actually not a new idea. It’s a very old idea. We have been finding meaning in virtual reality games for thousands of years. We’ve just called it religion until now. You can think about religion simply as a virtual reality game. You invent rules that don’t really exist, but you believe these rules, and for your entire life you try to follow the rules. If you’re Christian, then if you do this, you get points. If you sin, you lose points. If by the time you finish the game when you’re dead, you gained enough points, you get up to the next level. You go to heaven. People have been playing this virtual reality game for thousands of years, and it made them relatively content and happy with their lives. In the 21st century, we’ll just have the technology to create far more persuasive virtual reality games than the ones we’ve been playing for the past thousands of years. We’ll have the technology to actually create heavens and hells, not in our minds but using bits and using direct brain-computer interfaces. After reading Harari’s summation of Christianity, I reflexively buried my face in my palms. Yuval Harari is wrong about the Christian faith. He’s very wrong. In fact, what he described — leveling up by good behavior in order to advance to Heaven — is totally antithetical to Christian doctrine. Despite being dead wrong in explaining the essence of Christianity, Harari was, however, spot on in describing the day-to-day life of many Christians. This is the reason I was so disturbed when I read his interview. It is true that for many “Christianity” is nothing more than a vaguely spiritual exercise in morality, or, perhaps more accurately, a vaguely spiritual exercise in concealing immorality, facilitated by the crafting of increasingly efficient devotional artifice: We fake it to fit in, and then we size ourselves up against other people who are also faking it, and then proceed to feel inferior because they’re faking it better than we are, and then put more effort into faking it ourselves. There’s a danger in such a pattern. When we fall into a pattern of faking it, deception creeps in. We can easily lose touch with the reality of our nature — with who we truly are when no one is looking. We can begin to believe the lie we’re telling everyone else. And in the background, very subtly, sin becomes an abstract, something hypothetical and remote, not something that makes its home with and within us. And when that happens, another great tragedy occurs: Christ — the Lamb of God slain for sinners —likewise becomes an abstract, something hypothetical and remote, not someone who makes His home with and within us. And all at once, Christianity is no longer an expression of the Gospel, but an expression of the exact opposite. It doesn’t take a lot of intellectual effort to understand how Yuval Harari could look on Christianity and see something not unlike the bleakly depressing technodystopia of Black Mirror. Remember Bing’s speech in “15 Million Merits”? You don’t see people up here, it’s all fodder. And the faker the fodder is, the more you love it, because fake fodder’s the only thing that works anymore. Fake fodder is all that we can stomach … Show us something real and free and beautiful — you couldn’t. It’d break us. We’re too numb for it. Our minds would choke. There’s only so much wonder we can bear. Black Mirror, Episode 102: “15 Million Merits” Is it any wonder Yuval Harari would say that Christianity is no different than virtual reality? Is it any wonder he perceives Christianity as a meaningless fantasy meant to distract us from the reality of everyday life? One of the great crises in the American church is that there are so many in the Church who are dying to be honest with someone about what’s going on in their life, but the rest are too preoccupied with their own spiritual advancement (or the appearance of it) and cannot be bothered with the inconveniences of someone else’s pain — especially if that pain is the self-inflicted consequence of sin in one’s life. The dilemma is that introducing athenticity into a relationship or community built on pretense is essentially the same as tapping a virtual reality gamer on the shoulder — it ruins the illusion. And disillusionment can have serious consequences. Having seen what happened to the last person who was honest, the silently struggling make up their minds to soldier on and keep their mouths shut. Many of us have also learned firsthand that to survive in the church crowd we have to go unseen and unknown, blending in with everyone else who’s also pretending (all these millennia later and we’re still carrying fig leaves around). We have learned which improprieties are allowable under the unspoken covenants of true membership in our church communities, and we use those as decoys to distract from the really dark things going on in our hearts and minds and lives. A bit of faux-vulnerability can go a long way, especially if you’re a leader in a church. Real vulnerability carries too much risk, so we settle for a shadow of it. After all, so many of us have been victims of that wicked hoax, where people with presumed spiritual authority over us pester us to confess our indiscretions, goading us with words like “authentic” and “transparent,” coaxing us with promises of loyalty and friendship and understanding, and then, when we have taken the bait, turn and write us off. I recognize that all of this may sound awfully cynical, but I have known people in my life who were brave enough to get real with folks, only to be punished for it. Some of those people had no one to come in afterward and perform spiritual first aid. Some of those people became embittered and ultimately decided to abandon the whole operation. And if Yuval Harari were right, and if Christianity were just a virtual reality game in which leveling up through good behavior warranted entry into Heaven, then I for one wouldn’t blame them. But he isn’t. And it isn’t. Jesus did not come and bleed and die to purchase our admission into an elite association of morality enthusiasts bent on personal advancement and conformity and self-congratulation. That’s what Yuval Harari doesn’t understand — Christianity is not about ladder-climbing. We do not worship a God who promises to let us into heaven based on our moral advancement or on the condition that our good outweighs our evil. All the Black Mirror virtual reality foolishness of moralistic “Christianity” never brought anyone a single step closer to salvation, ever. It is not the healthy, after all, who need a doctor. Jesus’ invitation is to a life of audacious trust in the inexhaustible grace of God. The Gospel is the Good News that Jesus Christ came and bled and died so that every sin could be forgiven, every debt paid, and every spiritually dead man and woman raised to walk in newness of life. It is the hope for those who are living life with their head down, trying their best not to be found out among a community of people who are doing their best to project success and piety. I grew up in church, but I didn’t embrace the Gospel life until my college years. Even then, letting go of my two-bit “Christian life” and opening myself up instead to a relationship with God predicated on His grace was a painful process. It meant becoming increasingly aware of the depth of my wickedness, and coming to terms with the fact that, in God’s economy, my talents and accomplishments and reputation and good behavior weren’t worth a damn thing. Everything I thought made me important was a delusion. Everything I thought made me a good person was shown to be corrupted. Every vote of approval or disapproval from the crowd had to be discarded, and every last piece of my religious paradigm dismantled, until all that remained was one irreducibly complex truth: That God demonstrated His love toward me in that, while I was yet a sinner, Christ died for me. Show us something real and free and beautiful, indeed. Thank you for reading! READ MORE… I Work at a “Feel Good” Church ← P R E V I O U S N E X T → Coming Soon! ", "title": "The ", "sentences": [{"f1ef": "The Black Mirror-ing of Christianity"}, {"a094": "Answering Yuval Harari on Christianity and Virtual Reality"}, {"f208": "In a recent interview with Ezra Klein, über-pessimistic socio-historian Yuval Harari said this:"}, {"1d9a": "This idea of humans finding meaning in virtual reality games is actually not a new idea. It’s a very old idea. We have been finding meaning in virtual reality games for thousands of years. We’ve just called it religion until now."}, {"c21e": "You can think about religion simply as a virtual reality game. You invent rules that don’t really exist, but you believe these rules, and for your entire life you try to follow the rules. If you’re Christian, then if you do this, you get points. If you sin, you lose points. If by the time you finish the game when you’re dead, you gained enough points, you get up to the next level. You go to heaven."}, {"c6bb": "People have been playing this virtual reality game for thousands of years, and it made them relatively content and happy with their lives. In the 21st century, we’ll just have the technology to create far more persuasive virtual reality games than the ones we’ve been playing for the past thousands of years. We’ll have the technology to actually create heavens and hells, not in our minds but using bits and using direct brain-computer interfaces."}, {"75e8": "After reading Harari’s summation of Christianity, I reflexively buried my face in my palms."}, {"1ada": "Yuval Harari is wrong about the Christian faith. He’s very wrong. In fact, what he described — leveling up by good behavior in order to advance to Heaven — is totally antithetical to Christian doctrine."}, {"4430": "Despite being dead wrong in explaining the essence of Christianity, Harari was, however, spot on in describing the day-to-day life of many Christians. This is the reason I was so disturbed when I read his interview."}, {"6c0b": "It is true that for many “Christianity” is nothing more than a vaguely spiritual exercise in morality, or, perhaps more accurately, a vaguely spiritual exercise in concealing immorality, facilitated by the crafting of increasingly efficient devotional artifice: We fake it to fit in, and then we size ourselves up against other people who are also faking it, and then proceed to feel inferior because they’re faking it better than we are, and then put more effort into faking it ourselves."}, {"ceee": "There’s a danger in such a pattern. When we fall into a pattern of faking it, deception creeps in. We can easily lose touch with the reality of our nature — with who we truly are when no one is looking. We can begin to believe the lie we’re telling everyone else. And in the background, very subtly, sin becomes an abstract, something hypothetical and remote, not something that makes its home with and within us. And when that happens, another great tragedy occurs: Christ — the Lamb of God slain for sinners —likewise becomes an abstract, something hypothetical and remote, not someone who makes His home with and within us. And all at once, Christianity is no longer an expression of the Gospel, but an expression of the exact opposite."}, {"0b07": "It doesn’t take a lot of intellectual effort to understand how Yuval Harari could look on Christianity and see something not unlike the bleakly depressing technodystopia of Black Mirror. Remember Bing’s speech in “15 Million Merits”?"}, {"8806": "You don’t see people up here, it’s all fodder. And the faker the fodder is, the more you love it, because fake fodder’s the only thing that works anymore. Fake fodder is all that we can stomach … Show us something real and free and beautiful — you couldn’t. It’d break us. We’re too numb for it. Our minds would choke. There’s only so much wonder we can bear."}, {"26ff": "Black Mirror, Episode 102: “15 Million Merits”"}, {"510e": "Is it any wonder Yuval Harari would say that Christianity is no different than virtual reality? Is it any wonder he perceives Christianity as a meaningless fantasy meant to distract us from the reality of everyday life?"}, {"9b38": "One of the great crises in the American church is that there are so many in the Church who are dying to be honest with someone about what’s going on in their life, but the rest are too preoccupied with their own spiritual advancement (or the appearance of it) and cannot be bothered with the inconveniences of someone else’s pain — especially if that pain is the self-inflicted consequence of sin in one’s life. The dilemma is that introducing athenticity into a relationship or community built on pretense is essentially the same as tapping a virtual reality gamer on the shoulder — it ruins the illusion. And disillusionment can have serious consequences. Having seen what happened to the last person who was honest, the silently struggling make up their minds to soldier on and keep their mouths shut."}, {"7e8b": "Many of us have also learned firsthand that to survive in the church crowd we have to go unseen and unknown, blending in with everyone else who’s also pretending (all these millennia later and we’re still carrying fig leaves around). We have learned which improprieties are allowable under the unspoken covenants of true membership in our church communities, and we use those as decoys to distract from the really dark things going on in our hearts and minds and lives. A bit of faux-vulnerability can go a long way, especially if you’re a leader in a church. Real vulnerability carries too much risk, so we settle for a shadow of it. After all, so many of us have been victims of that wicked hoax, where people with presumed spiritual authority over us pester us to confess our indiscretions, goading us with words like “authentic” and “transparent,” coaxing us with promises of loyalty and friendship and understanding, and then, when we have taken the bait, turn and write us off."}, {"3c44": "I recognize that all of this may sound awfully cynical, but I have known people in my life who were brave enough to get real with folks, only to be punished for it. Some of those people had no one to come in afterward and perform spiritual first aid. Some of those people became embittered and ultimately decided to abandon the whole operation. And if Yuval Harari were right, and if Christianity were just a virtual reality game in which leveling up through good behavior warranted entry into Heaven, then I for one wouldn’t blame them."}, {"cd2a": "But he isn’t. And it isn’t."}, {"6a68": "Jesus did not come and bleed and die to purchase our admission into an elite association of morality enthusiasts bent on personal advancement and conformity and self-congratulation."}, {"9d29": "That’s what Yuval Harari doesn’t understand — Christianity is not about ladder-climbing. We do not worship a God who promises to let us into heaven based on our moral advancement or on the condition that our good outweighs our evil. All the Black Mirror virtual reality foolishness of moralistic “Christianity” never brought anyone a single step closer to salvation, ever. It is not the healthy, after all, who need a doctor. Jesus’ invitation is to a life of audacious trust in the inexhaustible grace of God. The Gospel is the Good News that Jesus Christ came and bled and died so that every sin could be forgiven, every debt paid, and every spiritually dead man and woman raised to walk in newness of life. It is the hope for those who are living life with their head down, trying their best not to be found out among a community of people who are doing their best to project success and piety."}, {"3067": "I grew up in church, but I didn’t embrace the Gospel life until my college years. Even then, letting go of my two-bit “Christian life” and opening myself up instead to a relationship with God predicated on His grace was a painful process. It meant becoming increasingly aware of the depth of my wickedness, and coming to terms with the fact that, in God’s economy, my talents and accomplishments and reputation and good behavior weren’t worth a damn thing. Everything I thought made me important was a delusion. Everything I thought made me a good person was shown to be corrupted. Every vote of approval or disapproval from the crowd had to be discarded, and every last piece of my religious paradigm dismantled, until all that remained was one irreducibly complex truth: That God demonstrated His love toward me in that, while I was yet a sinner, Christ died for me."}, {"346a": "Show us something real and free and beautiful, indeed."}, {"87b4": "Thank you for reading!"}, {"dcea": "READ MORE…"}, {"c59b": "I Work at a “Feel Good” Church ← P R E V I O U S"}, {"6813": "N E X T → Coming Soon!"}], "child": "1099_1\t1099_21099_1\t1099_2"}