{"name": "11", "parent": "", "content": "Build your reputation, but don’t be afraid to destroy it and become notorious A young man was speaking in front of a group of older businessmen. They had outdated ideas about how they wanted to run their marketing campaign. The young man told them their ideas were horrible. He was a marketing expert and had a crystal clear vision in his head of what they should do. But when he tried to articulate it to the group of older businessmen… they stonewalled him. It was maddening. Here he was, telling them how he’d succeeded,, and no one was listening. They scoffed at every idea he brought up. The young man grew angry and didn’t back down. The conversation devolved into angry shouts — it was one against twelve. The older businessmen couldn’t believe it. Nobody told them what to do, but here was this young guy who wasn’t just telling… he was yelling. The young man’s tirade paused when a stern hand fell on his shoulder. It was the founder of the non-profit who had invited him to speak and accepted his donation. He told the young man to shut up and leave Crestfallen, he walked out into the foggy California morning and sank into the seat of his car. He broke down crying. A few minutes later, the founder of the non-profit walked out. The founder watched, dumbfounded, as the young man sobbed over his steering wheel. He’d never seen an outsider care that much about making his non-profit a success. He leaned into the car and patted the young man on the back. “‘It’s okay,’ said the old man. ‘I’m sorry. I’m too wound up,’ [he] said. ‘I live in two worlds.’ ‘It’s okay. You should come back in,’ said the old man. ‘I’m going to leave. I know I was out of order. I just wanted them to listen.’ ‘It’s okay. Come back in.’ ‘I’m going to go in and apologize. And then I’m going to leave,’ he said. And that is what he did.” –Becoming Steve Jobs The young man in the story is none other than Steve Jobs. Steve Jobs’s stories are the classic examples that everyone is familiar with, but if we pull back the kimono on other greats, we see the same trends: idiosyncrasies, a full range of emotions, and extreme sincerity. Just the act of caring about something so much that you break down and cry is a great sign. It’s more than that — it’s beautiful. The average person doesn’t care enough about anything to put all of their emotions on the line. What brings you to tears? What are the things you care so much about that you’d yell and fight for them? Being cold and calculating in business can only get you so far. To make your vision a reality, you need conviction and enthusiasm. We’re constantly told that reputation is something that takes decades to build, and can be destroyed in minutes. That’s only partially true. Sometimes, what we think of as our “reputation” is little more than a panopticon we’ve agreed to live inside. “The [Panopticon] concept of the design is to allow all (pan-) inmates of an institution to be observed (-opticon) by a single watchman without the inmates being able to tell whether or not they are being watched.” –Panopticon We’re trapped in our cells by the cultural prison guards who think we should only have a few thoughts and robotic emotions. The prison cell of how we think others think we should act is one that few people escape. They’re watching… Photo, Twenty20 “Destroy your reputation. Be notorious.” –Rumi What most people think of as their “reputation” is really just a narrow bounds of permissible behavior that the people around them will tolerate. In order to build a reputation worth having, you might have to destroy your “reputation.” Don’t be afraid to venture outside the panopticon of culture. If you have interesting ideas, don’t be afraid to look like a fool when you articulate them to others. Some people will think you’re stupid no matter what. They’ll see that you’re operating outside the prison of culture, they’ll report you, ostracize you, make fun of you. “If you want to improve, be content to be thought foolish and stupid.” –Epictetus Sometimes they’ll be right — you might look, talk, or do something idiotic. So what? Go into the parking lot, cry if you have to… then come back in and apologize. The great achievements in this world are reserved for those willing to look like a fool in the eyes of society. Reputation can be helpful to get things done. But it’s more important to find the things you care about so much that you’re willing to argue, fight, and persevere for. The full spectrum of human emotions is a beautiful thing. Celebrate life! Photo, Twenty20 Only a handful of them are convenient for culture, but all of them are necessary to create a life worth living. Build your reputation, but don’t be afraid to destroy it and become notorious. If you enjoyed this article, please click recommend or share to help others find it! Chad Grills is a veteran turned founder of The Mission, your #1 source for accelerated learning. ", "title": "Build your reputation, but don’t be afraid to destroy it and become notorious", "sentences": [{"a8d5": "Build your reputation, but don’t be afraid to destroy it and become notorious"}, {"b409": "A young man was speaking in front of a group of older businessmen."}, {"dcda": "They had outdated ideas about how they wanted to run their marketing campaign."}, {"b677": "The young man told them their ideas were horrible. He was a marketing expert and had a crystal clear vision in his head of what they should do."}, {"695d": "But when he tried to articulate it to the group of older businessmen… they stonewalled him."}, {"cc5f": "It was maddening."}, {"db32": "Here he was, telling them how he’d succeeded,, and no one was listening. They scoffed at every idea he brought up. The young man grew angry and didn’t back down. The conversation devolved into angry shouts — it was one against twelve. The older businessmen couldn’t believe it. Nobody told them what to do, but here was this young guy who wasn’t just telling… he was yelling."}, {"6f36": "The young man’s tirade paused when a stern hand fell on his shoulder. It was the founder of the non-profit who had invited him to speak and accepted his donation. He told the young man to shut up and leave"}, {"bd75": "Crestfallen, he walked out into the foggy California morning and sank into the seat of his car. He broke down crying. A few minutes later, the founder of the non-profit walked out. The founder watched, dumbfounded, as the young man sobbed over his steering wheel. He’d never seen an outsider care that much about making his non-profit a success. He leaned into the car and patted the young man on the back."}, {"1d42": "“‘It’s okay,’ said the old man."}, {"211a": "‘I’m sorry. I’m too wound up,’ [he] said. ‘I live in two worlds.’"}, {"7eed": "‘It’s okay. You should come back in,’ said the old man."}, {"1dac": "‘I’m going to leave. I know I was out of order. I just wanted them to listen.’"}, {"947e": "‘It’s okay. Come back in.’"}, {"8a62": "‘I’m going to go in and apologize. And then I’m going to leave,’ he said. And that is what he did.”"}, {"aa39": "–Becoming Steve Jobs"}, {"7e9e": "The young man in the story is none other than Steve Jobs."}, {"571c": "Steve Jobs’s stories are the classic examples that everyone is familiar with, but if we pull back the kimono on other greats, we see the same trends: idiosyncrasies, a full range of emotions, and extreme sincerity."}, {"5d3a": "Just the act of caring about something so much that you break down and cry is a great sign. It’s more than that — it’s beautiful. The average person doesn’t care enough about anything to put all of their emotions on the line."}, {"bd81": "What brings you to tears?"}, {"d7ed": "What are the things you care so much about that you’d yell and fight for them?"}, {"39e5": "Being cold and calculating in business can only get you so far. To make your vision a reality, you need conviction and enthusiasm."}, {"4af2": "We’re constantly told that reputation is something that takes decades to build, and can be destroyed in minutes. That’s only partially true."}, {"6de3": "Sometimes, what we think of as our “reputation” is little more than a panopticon we’ve agreed to live inside."}, {"ecef": "“The [Panopticon] concept of the design is to allow all (pan-) inmates of an institution to be observed (-opticon) by a single watchman without the inmates being able to tell whether or not they are being watched.” –Panopticon"}, {"9d64": "We’re trapped in our cells by the cultural prison guards who think we should only have a few thoughts and robotic emotions. The prison cell of how we think others think we should act is one that few people escape."}, {"41d4": "They’re watching… Photo, Twenty20"}, {"2693": "“Destroy your reputation. Be notorious.” –Rumi"}, {"3fe7": "What most people think of as their “reputation” is really just a narrow bounds of permissible behavior that the people around them will tolerate."}, {"71b8": "In order to build a reputation worth having, you might have to destroy your “reputation.”"}, {"0c86": "Don’t be afraid to venture outside the panopticon of culture. If you have interesting ideas, don’t be afraid to look like a fool when you articulate them to others."}, {"ef66": "Some people will think you’re stupid no matter what. They’ll see that you’re operating outside the prison of culture, they’ll report you, ostracize you, make fun of you."}, {"ec67": "“If you want to improve, be content to be thought foolish and stupid.” –Epictetus"}, {"a9ed": "Sometimes they’ll be right — you might look, talk, or do something idiotic. So what? Go into the parking lot, cry if you have to… then come back in and apologize."}, {"acd4": "The great achievements in this world are reserved for those willing to look like a fool in the eyes of society. Reputation can be helpful to get things done. But it’s more important to find the things you care about so much that you’re willing to argue, fight, and persevere for."}, {"08ea": "The full spectrum of human emotions is a beautiful thing."}, {"61b2": "Celebrate life! Photo, Twenty20"}, {"6136": "Only a handful of them are convenient for culture, but all of them are necessary to create a life worth living."}, {"13fd": "Build your reputation, but don’t be afraid to destroy it and become notorious."}, {"2d97": "If you enjoyed this article, please click recommend or share to help others find it!"}, {"f212": "Chad Grills is a veteran turned founder of The Mission, your #1 source for accelerated learning."}], "child": "11_1\t11_2\t11_3\t11_4\t11_5\t11_6\t11_7\t11_8\t11_9\t11_10\t11_11\t11_12\t11_13\t11_14\t11_15\t11_16\t11_17\t11_18\t11_19\t11_20\t11_21\t11_22\t11_23\t11_24"}