{"name": "1101", "parent": "", "content": "Don’t Impeach the Precedent; Pence Lurks Because the precedent is the only thing standing between us and christian supremacy dominionism. So by all means, mock and criticize the golden god as much as you are wont; he certainly deserves it. But do everyone a solid. And remember what foul creature looms, staggers, lurches, and reels beyond the precedential succession horizon: christian theocracy. The end of the separation of church and state. Or as T.S. Eliot memorably put it: “20 centuries of stony sleep were vexed to nightmare by a rocking cradle. And what rough beast, its hour come round at last, slouches towards Bethlehem to be born?” The fascist churchstate; that’s what rough beast. The Family It’s not hyperbole. Elevated to the white house, Mike Pence has now become the premier member of a far-reaching, apocalyptic evangelical cult bent on seizing control of the government. These are not some mere backwoods baptists. But a well-organized and funded group of ambitious, determined born again who wield enormous power via unknown hundreds of members already peppering government. They call themselves the Family or the Fellowship. Sponsor America’s annual sacrilege the national prayer breakfast. And keep an office on capitol hill right behind the house of representatives buildings. Where they hybridize the religious right’s vectors of public and social policy lobbying. Harmonizing all their biblical literalist bullshit. That you know-it-all liberals have been mocking your whole lives. A vast, farflung organization of myriad, unnamed congressmen, senators, state representatives, and governors who think they’re fighting an actual supernatural, spiritual war with the devil and hell’s legions walking the earth. And plan to govern accordingly. It’s naive to think that Mike’s not now their leader. Zeal of the convert So it’s not the precedent we need fear so much as the vice. A vicious, anti-everything/ believe-anything, redneck jerk from the foul backwaters of confederate-volunteer, slavery-collaborationist Indiana. And even worse, he chose to be one. Born liberal catholic in a klan state, he picked klan. Thus does this former rightwing talk radio host now practice his faith with the zeal of a convert. Because his whole life he just wanted to be like everyone else. One of the good ole boys. Not a Kennedy man. Name the stereotype, he manifests it. The only thing he wasn’t, was a childhood bully. Unfortunate for this thesis, he was by all accounts a very nice boy. Until he converted from catholicism to evangelicalism. Then he took a dark turn for the worse. Converted by his frat bro’s bling. No shit. Starry-eyed mancrushing over torture device jewelry depicting the heinous instrument upon which their martyr Jesus (if he ever existed) ostensibly died his agonizing death. Unlikely, but even if that were the case it would be like Bill Hicks said: “A lot of Christians wear crosses around their necks. You think when Jesus comes back he ever wants to see a fucking cross? It’s like going up to Jackie Kennedy wearing a rifle pendant: “Just thinking of John.” Say your prayers The 2016 repug primary field originally featured 15 breathlessly low-quality, idiot contenders. Almost all of whom either pay true believer homage or just politically expedient lip service to dipshit biblical literalism and apocalyptic christian supremacy. Fuck these people and their god. Gleefully anticipating the annihilation of everything and everyone else on the planet to make room for their exclusive end times resort. To which most of mankind will be unwelcome. A reprehensible exclusivism built upon the dangerous, apocalyptic certainty that everyone else on the planet will one day agonize and suffer for simply disagreeing with you. Savage, eternal torment in a hell of their own design. By anyone who questions their coldblooded bullshit. Which at last count is over two-thirds of Earth’s population. Roughly five and a half billion future hellburners. It’s monstrous. And preys on the most divisive human instincts. Fascist churchstate So thank whatever ancient semitic desert magic all these jackasses doubtless believe in that the least christian of them all managed to claw his way to the top of this sinful pile and prevail. And pray to sorcerer jesus god, who just so also happens to be his own father, that nothing happens to the precedent. John Hersey artwork for Mother Jones. Because he’s now perversely the only thing protecting us from them. They’ve never been this close to the oval office. And now that they are, will find as many ways as possible to weaponize the constitution against gays and any/all other groups they disapprove of. And even worse than suddenly realizing that the precedent is in this warped way our defender, is that it won’t even matter if he and congress fail to act at the federal level on preposterous legislation to placate Kentucky. Because Pence and his confederal friends have other tools at their disposal too. Like the American Legislative Exchange Council, National Governors Association, and the two-thirds of state legislatures currently at their mercy. Through which they will seek to amend the constitution at everyone else’s expense while our gaze is transfixed by their golden idol. And despite professing the constitution’s sacrosanctity, they will not hesitate to change it again and quickly if it suits their fiendish ends. Especially not now. With all the machinery of state at their vicious, vengeful fingertips. Damning demographics So equipped, eager believers will do their damnedest to roll back as much of sickular, post-civil rights America as possible before the great extinction event hits. And the salt of god’s christian earth ignominiously move on to their hard-earned, well-deserved graves. These volk aren’t interested in leaving later generations a better world to inherit. Global warming, resource scarcity, and a sustainable future do not concern them. Because they’ll be rejoicing in heaven with imaginary Jesus. While the rest of us sinners left behind here on the late, great planet earth suffer the millenarian, acid nightmare, end times prophecies that these simpletons just made up. Conjuring all this heinous nonsense out of thin air just to gleefully daydream about what it will one day be like for gliberals to get what’s coming to them. No one will mourn their inevitable passing. To the contrary, it can’t happen soon enough. Ten more years maybe. Even if a precedent Palin were to somehow succeed this one in some wretched, even laster gasp of our ruling white trash class, the baby boom will definitely die by 2028. So again ironically thank their ancient semitic desert magic. That most of them won’t be able to afford the healthcare they all so desperately need from eating both literal and metaphorical shit their whole lives. Once they successfully repeal progress toward its universal affordability. Scoff all you like at forecasts and prophecies of old testament doom from an antitheist. But from the apocalypticists’ perspective, they’ve been waiting a long time for Jesus to come back and get them. Many are starting to wonder if he ever will. Doubt makes them crazy and desperate. Out of desperation they are ready to make armageddon happen even if the risen savior won’t. Now or never And they’re finally in the white house. They’ve never been this close to the triumph of christ’s dominion on earth. It is dubious to assert that they won’t do everything in their power to achieve it now that they almost can. Hallelujah. Praise jesus. Sinners repent. Pray they don’t get any closer. Like it? Click something. I integrate commenters’ insights into new pieces. So thanks for the ideas too:) If I may be so bold, you might also like one of these. ", "title": "Don’t Impeach the Precedent; Pence Lurks", "sentences": [{"9653": "Don’t Impeach the Precedent; Pence Lurks"}, {"3505": "Because the precedent is the only thing standing between us and christian supremacy dominionism. So by all means, mock and criticize the golden god as much as you are wont; he certainly deserves it."}, {"d5d1": "But do everyone a solid. And remember what foul creature looms, staggers, lurches, and reels beyond the precedential succession horizon: christian theocracy. The end of the separation of church and state."}, {"a2ac": "Or as T.S. Eliot memorably put it:"}, {"c852": "“20 centuries of stony sleep were vexed to nightmare by a rocking cradle. And what rough beast, its hour come round at last, slouches towards Bethlehem to be born?”"}, {"f643": "The fascist churchstate; that’s what rough beast."}, {"b769": "The Family"}, {"ade7": "It’s not hyperbole. Elevated to the white house, Mike Pence has now become the premier member of a far-reaching, apocalyptic evangelical cult bent on seizing control of the government."}, {"1d46": "These are not some mere backwoods baptists. But a well-organized and funded group of ambitious, determined born again who wield enormous power via unknown hundreds of members already peppering government."}, {"d138": "They call themselves the Family or the Fellowship. Sponsor America’s annual sacrilege the national prayer breakfast. And keep an office on capitol hill right behind the house of representatives buildings."}, {"90aa": "Where they hybridize the religious right’s vectors of public and social policy lobbying. Harmonizing all their biblical literalist bullshit. That you know-it-all liberals have been mocking your whole lives."}, {"6867": "A vast, farflung organization of myriad, unnamed congressmen, senators, state representatives, and governors who think they’re fighting an actual supernatural, spiritual war with the devil and hell’s legions walking the earth. And plan to govern accordingly."}, {"67cb": "It’s naive to think that Mike’s not now their leader."}, {"97a8": "Zeal of the convert"}, {"eb9a": "So it’s not the precedent we need fear so much as the vice. A vicious, anti-everything/ believe-anything, redneck jerk from the foul backwaters of confederate-volunteer, slavery-collaborationist Indiana."}, {"d76b": "And even worse, he chose to be one. Born liberal catholic in a klan state, he picked klan. Thus does this former rightwing talk radio host now practice his faith with the zeal of a convert. Because his whole life he just wanted to be like everyone else. One of the good ole boys. Not a Kennedy man."}, {"158f": "Name the stereotype, he manifests it. The only thing he wasn’t, was a childhood bully. Unfortunate for this thesis, he was by all accounts a very nice boy. Until he converted from catholicism to evangelicalism. Then he took a dark turn for the worse. Converted by his frat bro’s bling. No shit."}, {"086d": "Starry-eyed mancrushing over torture device jewelry depicting the heinous instrument upon which their martyr Jesus (if he ever existed) ostensibly died his agonizing death."}, {"76ee": "Unlikely, but even if that were the case it would be like Bill Hicks said:"}, {"c20d": "“A lot of Christians wear crosses around their necks. You think when Jesus comes back he ever wants to see a fucking cross? It’s like going up to Jackie Kennedy wearing a rifle pendant: “Just thinking of John.”"}, {"c3cc": "Say your prayers"}, {"8544": "The 2016 repug primary field originally featured 15 breathlessly low-quality, idiot contenders. Almost all of whom either pay true believer homage or just politically expedient lip service to dipshit biblical literalism and apocalyptic christian supremacy."}, {"516b": "Fuck these people and their god. Gleefully anticipating the annihilation of everything and everyone else on the planet to make room for their exclusive end times resort. To which most of mankind will be unwelcome."}, {"b5e8": "A reprehensible exclusivism built upon the dangerous, apocalyptic certainty that everyone else on the planet will one day agonize and suffer for simply disagreeing with you. Savage, eternal torment in a hell of their own design."}, {"b2a8": "By anyone who questions their coldblooded bullshit. Which at last count is over two-thirds of Earth’s population. Roughly five and a half billion future hellburners. It’s monstrous. And preys on the most divisive human instincts."}, {"3f08": "Fascist churchstate"}, {"0389": "So thank whatever ancient semitic desert magic all these jackasses doubtless believe in that the least christian of them all managed to claw his way to the top of this sinful pile and prevail. And pray to sorcerer jesus god, who just so also happens to be his own father, that nothing happens to the precedent."}, {"0c41": "John Hersey artwork for Mother Jones."}, {"1fe7": "Because he’s now perversely the only thing protecting us from them. They’ve never been this close to the oval office. And now that they are, will find as many ways as possible to weaponize the constitution against gays and any/all other groups they disapprove of."}, {"8ed4": "And even worse than suddenly realizing that the precedent is in this warped way our defender, is that it won’t even matter if he and congress fail to act at the federal level on preposterous legislation to placate Kentucky. Because Pence and his confederal friends have other tools at their disposal too."}, {"dbfb": "Like the American Legislative Exchange Council, National Governors Association, and the two-thirds of state legislatures currently at their mercy. Through which they will seek to amend the constitution at everyone else’s expense while our gaze is transfixed by their golden idol."}, {"31d8": "And despite professing the constitution’s sacrosanctity, they will not hesitate to change it again and quickly if it suits their fiendish ends. Especially not now. With all the machinery of state at their vicious, vengeful fingertips."}, {"79ec": "Damning demographics"}, {"3edb": "So equipped, eager believers will do their damnedest to roll back as much of sickular, post-civil rights America as possible before the great extinction event hits. And the salt of god’s christian earth ignominiously move on to their hard-earned, well-deserved graves."}, {"1f37": "These volk aren’t interested in leaving later generations a better world to inherit. Global warming, resource scarcity, and a sustainable future do not concern them. Because they’ll be rejoicing in heaven with imaginary Jesus."}, {"c9e2": "While the rest of us sinners left behind here on the late, great planet earth suffer the millenarian, acid nightmare, end times prophecies that these simpletons just made up. Conjuring all this heinous nonsense out of thin air just to gleefully daydream about what it will one day be like for gliberals to get what’s coming to them."}, {"0aa5": "No one will mourn their inevitable passing. To the contrary, it can’t happen soon enough. Ten more years maybe. Even if a precedent Palin were to somehow succeed this one in some wretched, even laster gasp of our ruling white trash class, the baby boom will definitely die by 2028."}, {"85dd": "So again ironically thank their ancient semitic desert magic. That most of them won’t be able to afford the healthcare they all so desperately need from eating both literal and metaphorical shit their whole lives. Once they successfully repeal progress toward its universal affordability."}, {"264f": "Scoff all you like at forecasts and prophecies of old testament doom from an antitheist. But from the apocalypticists’ perspective, they’ve been waiting a long time for Jesus to come back and get them."}, {"a1c2": "Many are starting to wonder if he ever will. Doubt makes them crazy and desperate. Out of desperation they are ready to make armageddon happen even if the risen savior won’t."}, {"e257": "Now or never"}, {"a1ee": "And they’re finally in the white house. They’ve never been this close to the triumph of christ’s dominion on earth. It is dubious to assert that they won’t do everything in their power to achieve it now that they almost can."}, {"c784": "Hallelujah."}, {"5d8e": "Praise jesus."}, {"f0a5": "Sinners repent."}, {"c658": "Pray they don’t get any closer."}, {"1372": "Like it? Click something. I integrate commenters’ insights into new pieces. So thanks for the ideas too:) If I may be so bold, you might also like one of these."}], "child": "1101_1\t1101_2\t1101_3"}