{"name": "1105", "parent": "", "content": "Christian group threatens to sue federal government over educational tool on Islam It wants all subject matter on Islam discarded. CREDIT: AP Photo/Molly Riley The Christian Action Network (CAN), whose mission is “to protect America’s religious and moral heritage through educational efforts,” is preparing to sue the Department of Education (DOE) for lesson plans on Islam that it reportedly funded twice — over a decade ago. After the attacks on 9/11, Access Islam, an educational program marketed to public elementary and middle school students, was created to provide a “fuller understanding of Muslims the world over.” Lesson plans combine PBS videos, handouts, and other classroom tools for fourth through eighth grade students in participating locations. They describe the pillars of Islam, Muslim American life, women in Islam, and sacred texts — altogether providing a comprehensive guide to the religion. According to CAN, the DOE funds and supports the indoctrination of Islam, because the Access Islam website still lists the DOE as a funder. CAN also takes issue with the lack of comparable lesson plans for other religions, and is ready to take legal action. “We demand that you immediately remove all such promoted lesson plans from the publicly funded web sites and immediately cease spending public funds on the promotion of the Islamic religion in this or any other manner,” it wrote in a letter submitted to Secretary of Education Betsy Devos on March 28. The group also demanded that DeVos publicly condemn the program as a rejection of the Constitution. If the DOE does not comply within 60 days, CAN plans to file a federal lawsuit. ThinkProgress has been tracking hate since Trump’s election. Here’s what we found.It disturbed us.thinkprogress.org “Can anyone imagine The Lord’s Prayer recited in a classroom?” Founder and President Martin Mawyer said in a statement on CAN’s website. “Or students taught that the Bible is the inspired, infallible final Word of God? Or displaying the Christian cross in the school classroom? Or lesson plans that encourage students to pray to Jesus Christ? It’s out of the question! Christ, the Bible, the cross and Christian prayer were thrown out our public schools decades ago.” But experts on indoctrination flat out deny that Access Islam is, in fact, an indoctrination tool. Moreover, the DOE is not funding it. During FY 2005, the DOE, under the Bush administration, offered $166,000 in grant money that went towards the project, and another $8,000 in 2006. The agency hasn’t offered additional funds since, and a DOE spokesman reportedly told World Net Daily that the grant actually went to the Educational Broadcasting Corporation at the time. The money was then funneled into Access Islam. A federal lawsuit against the DOE over outdated information could lead to a costly legal battle at the expense of American taxpayers. Removing existing educational materials about Islam would also deprive students of the opportunity to learn about the fastest growing religion in the world, at a time when violent Islamophobia — largely predicated on misunderstanding — is on the rise. ", "title": "Christian group threatens to sue federal government over educational tool on Islam", "sentences": [{"a7e1": "Christian group threatens to sue federal government over educational tool on Islam"}, {"6e28": "It wants all subject matter on Islam discarded."}, {"f01b": "CREDIT: AP Photo/Molly Riley"}, {"6c82": "The Christian Action Network (CAN), whose mission is “to protect America’s religious and moral heritage through educational efforts,” is preparing to sue the Department of Education (DOE) for lesson plans on Islam that it reportedly funded twice — over a decade ago."}, {"2e7c": "After the attacks on 9/11, Access Islam, an educational program marketed to public elementary and middle school students, was created to provide a “fuller understanding of Muslims the world over.” Lesson plans combine PBS videos, handouts, and other classroom tools for fourth through eighth grade students in participating locations. They describe the pillars of Islam, Muslim American life, women in Islam, and sacred texts — altogether providing a comprehensive guide to the religion."}, {"29aa": "According to CAN, the DOE funds and supports the indoctrination of Islam, because the Access Islam website still lists the DOE as a funder. CAN also takes issue with the lack of comparable lesson plans for other religions, and is ready to take legal action."}, {"4286": "“We demand that you immediately remove all such promoted lesson plans from the publicly funded web sites and immediately cease spending public funds on the promotion of the Islamic religion in this or any other manner,” it wrote in a letter submitted to Secretary of Education Betsy Devos on March 28. The group also demanded that DeVos publicly condemn the program as a rejection of the Constitution."}, {"951c": "If the DOE does not comply within 60 days, CAN plans to file a federal lawsuit."}, {"e56c": "ThinkProgress has been tracking hate since Trump’s election. Here’s what we found.It disturbed us.thinkprogress.org"}, {"8d6b": "“Can anyone imagine The Lord’s Prayer recited in a classroom?” Founder and President Martin Mawyer said in a statement on CAN’s website. “Or students taught that the Bible is the inspired, infallible final Word of God? Or displaying the Christian cross in the school classroom? Or lesson plans that encourage students to pray to Jesus Christ? It’s out of the question! Christ, the Bible, the cross and Christian prayer were thrown out our public schools decades ago.”"}, {"27be": "But experts on indoctrination flat out deny that Access Islam is, in fact, an indoctrination tool. Moreover, the DOE is not funding it."}, {"0745": "During FY 2005, the DOE, under the Bush administration, offered $166,000 in grant money that went towards the project, and another $8,000 in 2006. The agency hasn’t offered additional funds since, and a DOE spokesman reportedly told World Net Daily that the grant actually went to the Educational Broadcasting Corporation at the time. The money was then funneled into Access Islam."}, {"b34c": "A federal lawsuit against the DOE over outdated information could lead to a costly legal battle at the expense of American taxpayers. Removing existing educational materials about Islam would also deprive students of the opportunity to learn about the fastest growing religion in the world, at a time when violent Islamophobia — largely predicated on misunderstanding — is on the rise."}], "child": "1105_1\t1105_2\t1105_3\t1105_4\t1105_5\t1105_6\t1105_7\t1105_8\t1105_9\t1105_10\t1105_11\t1105_12\t1105_13\t1105_14\t1105_15"}