{"name": "1106", "parent": "", "content": "The latest group opposing Trump’s policies: Buddhists “We hear the cries of a nation whose democracy and social fabric are at risk.” CREDIT: AP/Ermindo Armino A group of more than 100 American Buddhist leaders are calling on their fellow faithful to resist President Donald Trump’s administration, saying his policies are hurting the nation’s “most vulnerable communities.” On Monday, the Canada-based Buddhist publication Lion’s Roar published a lengthy letter decrying the president’s policy agenda, with signers arguing that Buddhists have an obligation to respond to suffering with “with loving-kindness, wisdom, calm minds, and courage.” “In this time of crisis, we hear the cries of millions who will suffer from regressive policies of the new U.S. administration targetting our most vulnerable communities,” the statement, which uses Canadian verbiage, reads. “We hear the cries of a nation whose democracy and social fabric are at risk. We join in solidarity with many others who are also hearing these cries, knowing that together we can be a remarkable force for transformation and liberation.” “Buddhism is respected around the world as a religion of compassion and peace,” it adds. “We are wanted and needed in this movement, and we have much to contribute.” “If the policies of the new administration prevail, millions of people in vulnerable and less privileged communities will suffer.” Signers stressed that “Buddhism does not align itself with any party or ideology,” but noted that the current political moment is a unique. “If the policies of the new administration prevail, millions of people in vulnerable and less privileged communities will suffer,” the statement, which doesn’t mention Trump by name, reads. “Hopes will be dashed. Undoubtedly, lives will be lost. International conflict will intensify and environmental destruction will worsen.” The letter also suggested various ways for Buddhists to aid the vulnerable during the Trump era, such as joining protests or lending their worship spaces to the New Sanctuary Movement to aid undocumented immigrants at risk of deportation. “Our Buddhist communities can become centers of protection and vision,” it reads. “This can take many forms. It can mean providing sanctuary for those in danger or skilfully confronting those whose actions would harm the vulnerable among us. It can be standing up for the environment or becoming an active ally for those targeted by hate and prejudice.” Vatican, U.S. bishops want Trump to ‘reconsider’ his stance on climateTop-level cardinal hopes the president will listen to “dissenting voices.”thinkprogress.org Signatories included a host of prominent Buddhist teachers and thinkers, including 13 major names such as author Jack Kornfield, writer Rev. angel Kyodo williams, Roshi Joan Halifax, and monk-activist Bhikkhu Bodhi. “Now…that the Trump administration has been issuing executive orders and proposing bills and policies that clash so strongly with Buddhist ethical values, even the most reticent Buddhist teachers are starting to feel the need to speak up,” Ven. Bhikkhu Bodhi told ThinkProgress in an email. He noted that he tentatively expects Buddhists to make similar statements in the future. Buddhists make up less than 1 percent of the U.S. population, according to PRRI, representing a wide array of traditions and theological schools. Melvin McLeod, editor-in-chief of Lion’s Roar magazine, lauded this diversity as a strength of the community, but said sweeping expressions of political solidarity such as Monday’s letter — while certainly not unprecedented — are “quite unusual.” “I think it is really the first time such a broad and diverse group of Buddhist teachers have come together,” McLeod told ThinkProgress. “It does represent a broad consensus of Buddhist teachers.” The letter is the latest in a growing wave of faith-based opposition to Trump’s agenda. Since his election in November, progressive and conservative religious groups have voiced passionate resistance to the president’s cabinet nominations, plan to repeal Obamacare, both versions of the Muslim ban, budget proposals, and stance on climate change, among other issues. This post was updated to include comments from Ven. Bhikkhu Bodhi. It was also corrected to remove a quote attributed to Bodhi that was actually Bodhi quoting McLeod. ", "title": "The latest group opposing Trump’s policies: Buddhists", "sentences": [{"7e17": "The latest group opposing Trump’s policies: Buddhists"}, {"1ad4": "“We hear the cries of a nation whose democracy and social fabric are at risk.”"}, {"2526": "CREDIT: AP/Ermindo Armino"}, {"d4cb": "A group of more than 100 American Buddhist leaders are calling on their fellow faithful to resist President Donald Trump’s administration, saying his policies are hurting the nation’s “most vulnerable communities.”"}, {"a578": "On Monday, the Canada-based Buddhist publication Lion’s Roar published a lengthy letter decrying the president’s policy agenda, with signers arguing that Buddhists have an obligation to respond to suffering with “with loving-kindness, wisdom, calm minds, and courage.”"}, {"1108": "“In this time of crisis, we hear the cries of millions who will suffer from regressive policies of the new U.S. administration targetting our most vulnerable communities,” the statement, which uses Canadian verbiage, reads. “We hear the cries of a nation whose democracy and social fabric are at risk. We join in solidarity with many others who are also hearing these cries, knowing that together we can be a remarkable force for transformation and liberation.”"}, {"23d9": "“Buddhism is respected around the world as a religion of compassion and peace,” it adds. “We are wanted and needed in this movement, and we have much to contribute.”"}, {"cda9": "“If the policies of the new administration prevail, millions of people in vulnerable and less privileged communities will suffer.”"}, {"9ff6": "Signers stressed that “Buddhism does not align itself with any party or ideology,” but noted that the current political moment is a unique."}, {"2524": "“If the policies of the new administration prevail, millions of people in vulnerable and less privileged communities will suffer,” the statement, which doesn’t mention Trump by name, reads. “Hopes will be dashed. Undoubtedly, lives will be lost. International conflict will intensify and environmental destruction will worsen.”"}, {"bf02": "The letter also suggested various ways for Buddhists to aid the vulnerable during the Trump era, such as joining protests or lending their worship spaces to the New Sanctuary Movement to aid undocumented immigrants at risk of deportation."}, {"7c59": "“Our Buddhist communities can become centers of protection and vision,” it reads. “This can take many forms. It can mean providing sanctuary for those in danger or skilfully confronting those whose actions would harm the vulnerable among us. It can be standing up for the environment or becoming an active ally for those targeted by hate and prejudice.”"}, {"4684": "Vatican, U.S. bishops want Trump to ‘reconsider’ his stance on climateTop-level cardinal hopes the president will listen to “dissenting voices.”thinkprogress.org"}, {"04fd": "Signatories included a host of prominent Buddhist teachers and thinkers, including 13 major names such as author Jack Kornfield, writer Rev. angel Kyodo williams, Roshi Joan Halifax, and monk-activist Bhikkhu Bodhi."}, {"ff7c": "“Now…that the Trump administration has been issuing executive orders and proposing bills and policies that clash so strongly with Buddhist ethical values, even the most reticent Buddhist teachers are starting to feel the need to speak up,” Ven. Bhikkhu Bodhi told ThinkProgress in an email. He noted that he tentatively expects Buddhists to make similar statements in the future."}, {"fb5e": "Buddhists make up less than 1 percent of the U.S. population, according to PRRI, representing a wide array of traditions and theological schools. Melvin McLeod, editor-in-chief of Lion’s Roar magazine, lauded this diversity as a strength of the community, but said sweeping expressions of political solidarity such as Monday’s letter — while certainly not unprecedented — are “quite unusual.”"}, {"3528": "“I think it is really the first time such a broad and diverse group of Buddhist teachers have come together,” McLeod told ThinkProgress. “It does represent a broad consensus of Buddhist teachers.”"}, {"e02c": "The letter is the latest in a growing wave of faith-based opposition to Trump’s agenda. Since his election in November, progressive and conservative religious groups have voiced passionate resistance to the president’s cabinet nominations, plan to repeal Obamacare, both versions of the Muslim ban, budget proposals, and stance on climate change, among other issues."}, {"6b77": "This post was updated to include comments from Ven. Bhikkhu Bodhi. It was also corrected to remove a quote attributed to Bodhi that was actually Bodhi quoting McLeod."}], "child": "1106_1\t1106_2\t1106_3\t1106_4\t1106_5\t1106_6\t1106_7\t1106_8"}