{"name": "1108", "parent": "", "content": "Texas school’s Muslim prayer room prompts outrage from state attorney general’s office The school has called the controversy a “publicity stunt.” Muslim students at Liberty High School using the prayer room. CREDIT: Wingspan, Liberty’s student news outlet For the past seven years, Frisco Independent School District, a booming and extremely diverse district outside of Dallas, has made a room available at Liberty High School for its Muslim students to pray. Before the prayer room existed, several students had been missing as much as two hours of class time on Fridays to travel to a mosque in Plano; by giving them a space to pray on school grounds, the district accommodated the students’ religious needs and ensured equal access to education. But now then the Texas Office of the Attorney General (OAG) found out about the room. And they’re not happy about it. Last week, Deputy Attorney General Andrew Leonie sent the school a letter — and issued an accompanying press release — expressing “concerns” that it was discriminating against non-Muslim students by providing an accommodation exclusively for the Muslim students. “It is unclear whether students of other faiths may use the room at the same time or at other times during the week,” the letter said. “It appears that students are being treated different based on their religious beliefs.” Monday morning, Attorney General Ken Paxton (R) took to Fox News to defend the office’s actions, but even the Fox & Friends crew was skeptical. “You don’t really have any evidence that people were being excluded, did you?” Steve Doocy asked. “No, actually, we weren’t sure,” Paxton responded. “So that’s why we sent the letter.” Twice in that interview, Paxton said he hadn’t heard anything back from the district, suggesting he hadn’t read the news at all over the weekend. Frisco’s superintendent, Dr. Jeremy Lyon, actually responded on Friday in a very terse letter calling out the OAG for a “publicity stunt.” Indeed, it seems the OAG’s only trigger for responding was some recent uncontroversial media coverage that the prayer room had received. Lyon pointed out that the OAG claimed it was responding to an “initial inquiry” but that there was zero evidence the office had ever reached out to the district over its apparent “concerns.” Instead, it issued its letter — and press release — based not on any evidence, but apparently because the media coverage spurred constituents to be concerned. Texas Gov. Greg Abbott (R) tweeted on Friday that “many of you have questioned” the prayer room “issue.” Lyon demanded documentation to verify whether OAG had actually reached out to the district as part of its inquiry, and also whether it had any evidence of individuals being denied access to the prayer room The basis of Leonie’s letter was a report earlier this month by Frisco’s own video journalism students that described the prayer room as being “dedicated to the religious needs of some students.” This is clearly a reference to the fact that only “some” students have “religious needs” for such an accommodation. But Leonie’s letter cites this specific phrasing as evidence that the prayer room is somehow off-limits to other students. In his response, Lyon cited a recent public radio report that also covered Frisco’s prayer room and the budding diversity at Liberty High School. In it, Principal Scott Warstler specifically says of the Muslim students, “They take care of themselves in their group and they accept those that are a part of their group. And honestly, if others wanted to go in and learn and see and experience that, they’re OK with that.” The story also featured students of other religious faiths talking about how their faiths have been accommodated in various ways. Likely referencing the Trump administration’s multiple Muslim bans and constant fear-mongering that Islam is a threat to the United States, Lyon called out the OAG for further fomenting such intolerance. “It is important to note Frisco ISD is greatly concerned that this type of inflammatory rhetoric in the current climate may place the District, its students, staff, parents, and community in danger of unnecessary disruption,” the superintendent wrote. In addition to requesting all documentation of inquiries and complaints, Lyon also suggested that “ideally,” the OAG will issue a follow-up press release “to clear up any confusion” from its first press release. ", "title": "Texas school’s Muslim prayer room prompts outrage from state attorney general’s office", "sentences": [{"65a5": "Texas school’s Muslim prayer room prompts outrage from state attorney general’s office"}, {"fb5b": "The school has called the controversy a “publicity stunt.”"}, {"08e6": "Muslim students at Liberty High School using the prayer room. CREDIT: Wingspan, Liberty’s student news outlet"}, {"5072": "For the past seven years, Frisco Independent School District, a booming and extremely diverse district outside of Dallas, has made a room available at Liberty High School for its Muslim students to pray. Before the prayer room existed, several students had been missing as much as two hours of class time on Fridays to travel to a mosque in Plano; by giving them a space to pray on school grounds, the district accommodated the students’ religious needs and ensured equal access to education."}, {"1fb8": "But now then the Texas Office of the Attorney General (OAG) found out about the room. And they’re not happy about it."}, {"e0e4": "Last week, Deputy Attorney General Andrew Leonie sent the school a letter — and issued an accompanying press release — expressing “concerns” that it was discriminating against non-Muslim students by providing an accommodation exclusively for the Muslim students. “It is unclear whether students of other faiths may use the room at the same time or at other times during the week,” the letter said. “It appears that students are being treated different based on their religious beliefs.”"}, {"e05a": "Monday morning, Attorney General Ken Paxton (R) took to Fox News to defend the office’s actions, but even the Fox & Friends crew was skeptical. “You don’t really have any evidence that people were being excluded, did you?” Steve Doocy asked."}, {"d842": "“No, actually, we weren’t sure,” Paxton responded. “So that’s why we sent the letter.”"}, {"0222": "Twice in that interview, Paxton said he hadn’t heard anything back from the district, suggesting he hadn’t read the news at all over the weekend. Frisco’s superintendent, Dr. Jeremy Lyon, actually responded on Friday in a very terse letter calling out the OAG for a “publicity stunt.” Indeed, it seems the OAG’s only trigger for responding was some recent uncontroversial media coverage that the prayer room had received."}, {"548b": "Lyon pointed out that the OAG claimed it was responding to an “initial inquiry” but that there was zero evidence the office had ever reached out to the district over its apparent “concerns.” Instead, it issued its letter — and press release — based not on any evidence, but apparently because the media coverage spurred constituents to be concerned. Texas Gov. Greg Abbott (R) tweeted on Friday that “many of you have questioned” the prayer room “issue.”"}, {"9039": "Lyon demanded documentation to verify whether OAG had actually reached out to the district as part of its inquiry, and also whether it had any evidence of individuals being denied access to the prayer room"}, {"0e5d": "The basis of Leonie’s letter was a report earlier this month by Frisco’s own video journalism students that described the prayer room as being “dedicated to the religious needs of some students.” This is clearly a reference to the fact that only “some” students have “religious needs” for such an accommodation. But Leonie’s letter cites this specific phrasing as evidence that the prayer room is somehow off-limits to other students."}, {"efed": "In his response, Lyon cited a recent public radio report that also covered Frisco’s prayer room and the budding diversity at Liberty High School. In it, Principal Scott Warstler specifically says of the Muslim students, “They take care of themselves in their group and they accept those that are a part of their group. And honestly, if others wanted to go in and learn and see and experience that, they’re OK with that.” The story also featured students of other religious faiths talking about how their faiths have been accommodated in various ways."}, {"c097": "Likely referencing the Trump administration’s multiple Muslim bans and constant fear-mongering that Islam is a threat to the United States, Lyon called out the OAG for further fomenting such intolerance. “It is important to note Frisco ISD is greatly concerned that this type of inflammatory rhetoric in the current climate may place the District, its students, staff, parents, and community in danger of unnecessary disruption,” the superintendent wrote."}, {"4601": "In addition to requesting all documentation of inquiries and complaints, Lyon also suggested that “ideally,” the OAG will issue a follow-up press release “to clear up any confusion” from its first press release."}], "child": "1108_1\t1108_2\t1108_3\t1108_4\t1108_5\t1108_6\t1108_7\t1108_8"}