{"name": "1109", "parent": "", "content": "Even conservative faith leaders aren’t happy with Trump’s new budget “As followers of Christ, it is our moral responsibility to urge you to…avoid disproportionate cuts to these vital programs.” CREDIT: AP/Evan Vucci Donald Trump’s new budget proposal has a lot of critics. The budget, entitled “America First,” has already been lambasted by scientists, comedians, and elected officials from both parties for slashing funds for agencies across government and eliminating some federal programs altogether. But now faith leaders are adding their voices to the chorus of detractors, with many arguing that the budget disproportionately impacts the needy in America and abroad. A group of more than 100 Christians — many of whom are conservative — blasted the White House proposal in a letter on Thursday, saying its cuts to the international development initiatives will hinder humanitarian programs abroad. Trump’s plan would slash the U.S. Agency for International Development and the U.S. State Department by $10.1 billion (28 percent), both of which are part of the International Affairs Budget. “As followers of Christ, it is our moral responsibility to urge you to support and protect the International Affairs Budget, and avoid disproportionate cuts to these vital programs that ensure that our country continues to be the ‘shining city upon a hill.’” “With just 1 percent of our nation’s budget, the International Affairs Budget has helped alleviate the suffering of millions; drastically cutting the number of people living in extreme poverty in half, stopping the spread of infectious diseases like HIV/AIDs and Ebola, and nearly eliminating polio,” the letter, which was addressed to congressional leaders, reads. “As followers of Christ, it is our moral responsibility to urge you to support and protect the International Affairs Budget, and avoid disproportionate cuts to these vital programs that ensure that our country continues to be the ‘shining city upon a hill.’” National Hispanic Christian Leadership Conference president Samuel Rodriguez and Cardinal Timothy Dolan — both of whom led prayers at Trump’s inauguration —are among the letter’s signatories. The list also includes Leith Anderson, President National Association of Evangelicals; Tom Lin, head of InterVarsity Christian Fellowship; and Dr. Ronnie Floyd, former President of the Southern Baptist Convention. Other, more progressive faith groups also expressed disdain for the budget. Sister Simone Campbell, head of the Catholic social justice lobby NETWORK, said Trump’s cuts “disproportionately affect the same group of people — women, people of color, and all at the economic margins.” Campbell previously spearheaded an effort to oppose the House Republican-backed budget in 2012, leading a “Nuns on the Bus” tour around the country to raise awareness of how funding slashes can harm the poor. “The President’s Budget is not a faithful budget; it eviscerates funding for housing, doesn’t fund the census, and creates more demand for mass deportation and detention while funding a massive and impractical border wall,” Campbell wrote in a press release. “The President’s Budget does not reflect the values and priorities of everyday Americans.” “As an organization committed to the Jewish values of repairing the world…our vision for America’s role in the world is starkly different from that of President Trump.” The frustration from some faith groups may also be rooted in very real concerns for the future of their own work. In addition to worship practices, religious organizations often run faith-based humanitarian initiatives in the United States and abroad. Some of these programs and charities rely on federal grants to operate, a longstanding practice that has recently come under criticism by Fox News commentator Tucker Carlson, who decried faith groups who use federal funds to help resettle refugees. Trump’s budget is sparse on details, and it is unclear how the proposal would threaten such grants. But even groups such as the American Jewish World Service, which does not list taking public funds in a 2015 financial report, are concerned about what the cuts could mean. “As an organization committed to the Jewish values of repairing the world, aiding the poor and embracing the stranger, our vision for America’s role in the world is starkly different from that of President Trump,” Robert Bank, President and CEO of American Jewish World Service, said in a statement. “His proposed budget slashes efforts to combat poverty and disease and undermines both U.S. diplomacy and global institutions that work to guarantee the human rights of people worldwide.” Faith groups of all stripes have consistently opposed various aspects of Trump’s agenda. Dozens of religious organizations, institutions, and denominations have decried both iterations of the Muslim ban, and others have stood up against his cabinet nominations and plan to repeal Obamacare. This piece has been updated to clarify the progressive leanings of some of the faith groups cited. ", "title": "Even conservative faith leaders aren’t happy with Trump’s new budget", "sentences": [{"cbd6": "Even conservative faith leaders aren’t happy with Trump’s new budget"}, {"5a3e": "“As followers of Christ, it is our moral responsibility to urge you to…avoid disproportionate cuts to these vital programs.”"}, {"c7cd": "CREDIT: AP/Evan Vucci"}, {"21a5": "Donald Trump’s new budget proposal has a lot of critics. The budget, entitled “America First,” has already been lambasted by scientists, comedians, and elected officials from both parties for slashing funds for agencies across government and eliminating some federal programs altogether."}, {"58c7": "But now faith leaders are adding their voices to the chorus of detractors, with many arguing that the budget disproportionately impacts the needy in America and abroad."}, {"a464": "A group of more than 100 Christians — many of whom are conservative — blasted the White House proposal in a letter on Thursday, saying its cuts to the international development initiatives will hinder humanitarian programs abroad. Trump’s plan would slash the U.S. Agency for International Development and the U.S. State Department by $10.1 billion (28 percent), both of which are part of the International Affairs Budget."}, {"a758": "“As followers of Christ, it is our moral responsibility to urge you to support and protect the International Affairs Budget, and avoid disproportionate cuts to these vital programs that ensure that our country continues to be the ‘shining city upon a hill.’”"}, {"624f": "“With just 1 percent of our nation’s budget, the International Affairs Budget has helped alleviate the suffering of millions; drastically cutting the number of people living in extreme poverty in half, stopping the spread of infectious diseases like HIV/AIDs and Ebola, and nearly eliminating polio,” the letter, which was addressed to congressional leaders, reads. “As followers of Christ, it is our moral responsibility to urge you to support and protect the International Affairs Budget, and avoid disproportionate cuts to these vital programs that ensure that our country continues to be the ‘shining city upon a hill.’”"}, {"150a": "National Hispanic Christian Leadership Conference president Samuel Rodriguez and Cardinal Timothy Dolan — both of whom led prayers at Trump’s inauguration —are among the letter’s signatories. The list also includes Leith Anderson, President National Association of Evangelicals; Tom Lin, head of InterVarsity Christian Fellowship; and Dr. Ronnie Floyd, former President of the Southern Baptist Convention."}, {"12dd": "Other, more progressive faith groups also expressed disdain for the budget. Sister Simone Campbell, head of the Catholic social justice lobby NETWORK, said Trump’s cuts “disproportionately affect the same group of people — women, people of color, and all at the economic margins.”"}, {"5fa6": "Campbell previously spearheaded an effort to oppose the House Republican-backed budget in 2012, leading a “Nuns on the Bus” tour around the country to raise awareness of how funding slashes can harm the poor."}, {"8d83": "“The President’s Budget is not a faithful budget; it eviscerates funding for housing, doesn’t fund the census, and creates more demand for mass deportation and detention while funding a massive and impractical border wall,” Campbell wrote in a press release. “The President’s Budget does not reflect the values and priorities of everyday Americans.”"}, {"037a": "“As an organization committed to the Jewish values of repairing the world…our vision for America’s role in the world is starkly different from that of President Trump.”"}, {"a70d": "The frustration from some faith groups may also be rooted in very real concerns for the future of their own work. In addition to worship practices, religious organizations often run faith-based humanitarian initiatives in the United States and abroad. Some of these programs and charities rely on federal grants to operate, a longstanding practice that has recently come under criticism by Fox News commentator Tucker Carlson, who decried faith groups who use federal funds to help resettle refugees."}, {"d3d5": "Trump’s budget is sparse on details, and it is unclear how the proposal would threaten such grants. But even groups such as the American Jewish World Service, which does not list taking public funds in a 2015 financial report, are concerned about what the cuts could mean."}, {"8d53": "“As an organization committed to the Jewish values of repairing the world, aiding the poor and embracing the stranger, our vision for America’s role in the world is starkly different from that of President Trump,” Robert Bank, President and CEO of American Jewish World Service, said in a statement. “His proposed budget slashes efforts to combat poverty and disease and undermines both U.S. diplomacy and global institutions that work to guarantee the human rights of people worldwide.”"}, {"1dd1": "Faith groups of all stripes have consistently opposed various aspects of Trump’s agenda. Dozens of religious organizations, institutions, and denominations have decried both iterations of the Muslim ban, and others have stood up against his cabinet nominations and plan to repeal Obamacare."}, {"f44f": "This piece has been updated to clarify the progressive leanings of some of the faith groups cited."}], "child": "1109_1\t1109_2\t1109_3\t1109_4\t1109_5\t1109_6\t1109_7\t1109_8"}