{"name": "1110", "parent": "", "content": "What religious solidarity looks like in Trump’s America “It’s me today, it’s going to be you tomorrow.” It was less than a week after the 2016 election, and Rev. Robert Harvey was already scared. The priest at the Episcopal Church of Our Saviour in Silver Spring, Maryland, was readying for Sunday worship when he noticed that a sign outside the sanctuary had been defaced. The banner, which advertised a Spanish-language service, was now obscured with hateful graffiti: “Trump Nation. Whites Only.” It was a direct attack on their congregation, which Harvey told ThinkProgress is heavily Latino and is comprised of more than 85 percent immigrants. Members of the church hail from more than 50 countries. “We consider our diversity an asset,” he said. “We consider immigrants the best part of who we are.” “We consider our diversity an asset. We consider immigrants the best part of who we are.” But as swiftly as hatred darkened their church door, even swifter was the rush of support. Worshipers from across the Washington, D.C. area packed Our Saviour’s pews that day in a show of prayerful solidarity, singing hymns underneath signs reading “Love wins.” Within days, a different banner spontaneously appeared outside the church, left by a good Samaritan: “Silver Spring Loves and Welcomes Immigrants!” The biggest surprise, however, came weeks later, when the church received a box in the mail filled with more than 550 cards reading, “There is strength in the diversity of our community. We stand with you against hatred and prejudice.” Some were decorated with brightly colored crayons, and all were filled with handwritten notes of support scribbled by tiny hands. It took a moment for the staff to notice the signature on the back: “Your neighbors at the Muslim Community Center Weekend School.” Rev. Robert Harvey at his church in Silver Spring. CREDIT: Jack Jenkins/ThinkProgress Harvey was taken aback. He had never been in contact with the Islamic center before the incident — and never would have expected such a robust, unexpected display of kindness from the strangers there. The gesture was just one of countless expressions of solidarity among religious communities in recent months. Although media attention has largely focused on the rash of hate incidents against minority groups across the country — especially Muslims, Jews, and immigrants — houses of worship have also quietly begun banding together to push back. Islamic groups have launched fundraising campaigns to help repair Jewish cemeteries desecrated by vandals, for instance, and Jewish groups have collected donations to rebuild mosques ruined by suspicious fires. Tasnuva Khan, the public relations chair for the Muslim community center in Silver Spring, said the idea to send letters to the Our Saviour congregation was inspired by a similar exchange the year before. Amid rising Islamophobia during the 2016 election season, a different Silver Spring church sent letters to the Islamic community written by Sunday school children in celebration of the Muslim celebration of Eid. “It’s me today, it’s going to be you tomorrow.” But this year, she said, small expressions of compassion seem to carry a bit more weight. “It’s me today, it’s going to be you tomorrow,” Khan said, noting that center’s imam and other members also traveled to Our Savior to offer encouragement. “We need to support one another, and find ways to work together against the kind of hate and wrongdoing that has been going on.” “To ‘love thy neighbor’ is the same in Islam as it is in Judaism as it is in Christianity,” she added. “We believe you should not be able to sleep at night knowing that your neighbor is hungry or oppressed.” Members of the Muslim Community Center of Silver Spring visit Our Savior. CREDIT: Tasnuva Khan Compassion, it turns out, is contagious. It was only a few weeks later when the nearby Jewish Community Center of Greater Washington became one of the first JCCs to receive a chilling — and increasingly common — bomb threat directed at Jewish institutions. Harvey said he and his staff saw the moment as an opportunity to “pay it forward”; they encouraged the congregation’s children to write letters to the JCC during Sunday school, urging them to have courage in the face of animosity. “A good deed was done to us, so we wanted to pass it on to somebody else,” Harvey said. “Also, we like the idea of doing it unexpectedly.” Michael Feinstein, head of the Greater Washington JCC, said the cards struck a chord. “When I got their letters, I have to tell you, it blew me away,” Feinstein said. “In the aftermath of the bomb threat I was feeling very isolated — it was very stressful — and being targeted like that made us feel pretty alone. And then this envelope shows up with not only a letter, but also 9 or 10 index cards that the Sunday school kids had written, with pictures and crayons.” Feinstein said the center has since received dozens of notes from all over the country, with Muslims, Christians, and atheists all voicing concern about the attack. But the cards from Our Savior represented the first batch he received, and are now on display in the entryway to the JCC. He made sure to pick up the phone to personally thank Harvey. “He was just totally shocked that I called him,” Feinstein said, chuckling. One parent’s story of enduring a bomb threat at a Jewish day school“I wish I could say that I was surprised or shocked, but I was not.”thinkprogress.org These kind of acts of solidarity are forming the foundation for a flurry of interfaith organizing activity. All three faith leaders who spoke to ThinkProgress described renewed efforts to forge what Harvey called “alliances” with other groups, designed to resist the kind of hatred experienced by their communities and many others. The Church of our Saviour is hosting interfaith discussions in its sanctuary, for instance, and working to involve the congregation in a network of communities that support the New Sanctuary Movement — an effort to harbor undocumented immigrants at risk of deportation. Cards from Our Saviour and others on display in the entryway to the Jewish Community Center of Greater Washington. CREDIT: Greater Washington JCC The JCC organized a local interfaith film festival to tell the stories of immigrants and others impacted by the volatile political climate. It’s also hosting a press conference to speak out against hatred this Friday, where Harvey — who organizers made a point of inviting — will finally meet Feinstein in person. “We’re starting to know our neighbors,” Harvey said. Khan said she and other members of her Islamic community had gone to “so many interfaith programs in the D.C. area” in the past few months that she’s lost count. “The immigrant community, the Muslim community, and the Jewish community have been targeted right now in ways that we have not seen in a long, long time,” Feinstein said. “This is actually bringing us together in ways that probably wouldn’t have happened otherwise.” Indeed, faith groups are rapidly becoming a crucial part of the effort to resist Donald Trump’s rhetoric and policies, which many experts believe are directly linked to uptick in hate. Remember that “Silver Spring Loves and Welcomes Immigrants!” sign outside Harvey’s church? Kahn said it only took a few weeks for her to spot it at Dulles International Airport in Virginia, where demonstrators held it aloft to protest the Trump administration’s Muslim ban. Interfaith solidarity networks are primed to grow larger and more active as hate incidents continue, countering vitriol with virtue. So, too, will their dedication to spontaneous acts of kindness: When ThinkProgress asked Feinstein if he planned to repeat something akin to the letter-writing effort, he said the JCC was already considering reaching out to two nearby mosques that recently received threatening letters. Doing so will bring things full circle: One of those mosques was Kahn’s Muslim Community Center in Silver Spring. “Our brotherhood, sisterhood, and neighborliness is so much bigger than what is attacking us,” Kahn said. “It’s really important to show that right now.” ", "title": "What religious solidarity looks like in Trump’s America", "sentences": [{"c3eb": "What religious solidarity looks like in Trump’s America"}, {"0c3c": "“It’s me today, it’s going to be you tomorrow.”"}, {"ae91": "It was less than a week after the 2016 election, and Rev. Robert Harvey was already scared."}, {"5e9a": "The priest at the Episcopal Church of Our Saviour in Silver Spring, Maryland, was readying for Sunday worship when he noticed that a sign outside the sanctuary had been defaced. The banner, which advertised a Spanish-language service, was now obscured with hateful graffiti: “Trump Nation. Whites Only.”"}, {"386e": "It was a direct attack on their congregation, which Harvey told ThinkProgress is heavily Latino and is comprised of more than 85 percent immigrants. Members of the church hail from more than 50 countries."}, {"d864": "“We consider our diversity an asset,” he said. “We consider immigrants the best part of who we are.”"}, {"376e": "“We consider our diversity an asset. We consider immigrants the best part of who we are.”"}, {"5fb4": "But as swiftly as hatred darkened their church door, even swifter was the rush of support. Worshipers from across the Washington, D.C. area packed Our Saviour’s pews that day in a show of prayerful solidarity, singing hymns underneath signs reading “Love wins.” Within days, a different banner spontaneously appeared outside the church, left by a good Samaritan: “Silver Spring Loves and Welcomes Immigrants!”"}, {"5a48": "The biggest surprise, however, came weeks later, when the church received a box in the mail filled with more than 550 cards reading, “There is strength in the diversity of our community. We stand with you against hatred and prejudice.” Some were decorated with brightly colored crayons, and all were filled with handwritten notes of support scribbled by tiny hands."}, {"ef09": "It took a moment for the staff to notice the signature on the back: “Your neighbors at the Muslim Community Center Weekend School.”"}, {"a9cc": "Rev. Robert Harvey at his church in Silver Spring. CREDIT: Jack Jenkins/ThinkProgress"}, {"797e": "Harvey was taken aback. He had never been in contact with the Islamic center before the incident — and never would have expected such a robust, unexpected display of kindness from the strangers there."}, {"be91": "The gesture was just one of countless expressions of solidarity among religious communities in recent months. Although media attention has largely focused on the rash of hate incidents against minority groups across the country — especially Muslims, Jews, and immigrants — houses of worship have also quietly begun banding together to push back."}, {"2714": "Islamic groups have launched fundraising campaigns to help repair Jewish cemeteries desecrated by vandals, for instance, and Jewish groups have collected donations to rebuild mosques ruined by suspicious fires."}, {"5c71": "Tasnuva Khan, the public relations chair for the Muslim community center in Silver Spring, said the idea to send letters to the Our Saviour congregation was inspired by a similar exchange the year before. Amid rising Islamophobia during the 2016 election season, a different Silver Spring church sent letters to the Islamic community written by Sunday school children in celebration of the Muslim celebration of Eid."}, {"120c": "“It’s me today, it’s going to be you tomorrow.”"}, {"73a3": "But this year, she said, small expressions of compassion seem to carry a bit more weight."}, {"246f": "“It’s me today, it’s going to be you tomorrow,” Khan said, noting that center’s imam and other members also traveled to Our Savior to offer encouragement. “We need to support one another, and find ways to work together against the kind of hate and wrongdoing that has been going on.”"}, {"6109": "“To ‘love thy neighbor’ is the same in Islam as it is in Judaism as it is in Christianity,” she added. “We believe you should not be able to sleep at night knowing that your neighbor is hungry or oppressed.”"}, {"8572": "Members of the Muslim Community Center of Silver Spring visit Our Savior. CREDIT: Tasnuva Khan"}, {"3682": "Compassion, it turns out, is contagious."}, {"cdf5": "It was only a few weeks later when the nearby Jewish Community Center of Greater Washington became one of the first JCCs to receive a chilling — and increasingly common — bomb threat directed at Jewish institutions. Harvey said he and his staff saw the moment as an opportunity to “pay it forward”; they encouraged the congregation’s children to write letters to the JCC during Sunday school, urging them to have courage in the face of animosity."}, {"4f5a": "“A good deed was done to us, so we wanted to pass it on to somebody else,” Harvey said. “Also, we like the idea of doing it unexpectedly.”"}, {"f393": "Michael Feinstein, head of the Greater Washington JCC, said the cards struck a chord."}, {"7695": "“When I got their letters, I have to tell you, it blew me away,” Feinstein said. “In the aftermath of the bomb threat I was feeling very isolated — it was very stressful — and being targeted like that made us feel pretty alone. And then this envelope shows up with not only a letter, but also 9 or 10 index cards that the Sunday school kids had written, with pictures and crayons.”"}, {"9792": "Feinstein said the center has since received dozens of notes from all over the country, with Muslims, Christians, and atheists all voicing concern about the attack. But the cards from Our Savior represented the first batch he received, and are now on display in the entryway to the JCC."}, {"db09": "He made sure to pick up the phone to personally thank Harvey. “He was just totally shocked that I called him,” Feinstein said, chuckling."}, {"0894": "One parent’s story of enduring a bomb threat at a Jewish day school“I wish I could say that I was surprised or shocked, but I was not.”thinkprogress.org"}, {"68fb": "These kind of acts of solidarity are forming the foundation for a flurry of interfaith organizing activity. All three faith leaders who spoke to ThinkProgress described renewed efforts to forge what Harvey called “alliances” with other groups, designed to resist the kind of hatred experienced by their communities and many others."}, {"b095": "The Church of our Saviour is hosting interfaith discussions in its sanctuary, for instance, and working to involve the congregation in a network of communities that support the New Sanctuary Movement — an effort to harbor undocumented immigrants at risk of deportation."}, {"ded2": "Cards from Our Saviour and others on display in the entryway to the Jewish Community Center of Greater Washington. CREDIT: Greater Washington JCC"}, {"d6ea": "The JCC organized a local interfaith film festival to tell the stories of immigrants and others impacted by the volatile political climate. It’s also hosting a press conference to speak out against hatred this Friday, where Harvey — who organizers made a point of inviting — will finally meet Feinstein in person."}, {"f24a": "“We’re starting to know our neighbors,” Harvey said."}, {"191c": "Khan said she and other members of her Islamic community had gone to “so many interfaith programs in the D.C. area” in the past few months that she’s lost count."}, {"847b": "“The immigrant community, the Muslim community, and the Jewish community have been targeted right now in ways that we have not seen in a long, long time,” Feinstein said. “This is actually bringing us together in ways that probably wouldn’t have happened otherwise.”"}, {"212f": "Indeed, faith groups are rapidly becoming a crucial part of the effort to resist Donald Trump’s rhetoric and policies, which many experts believe are directly linked to uptick in hate. Remember that “Silver Spring Loves and Welcomes Immigrants!” sign outside Harvey’s church? Kahn said it only took a few weeks for her to spot it at Dulles International Airport in Virginia, where demonstrators held it aloft to protest the Trump administration’s Muslim ban."}, {"cf0a": "Interfaith solidarity networks are primed to grow larger and more active as hate incidents continue, countering vitriol with virtue. So, too, will their dedication to spontaneous acts of kindness: When ThinkProgress asked Feinstein if he planned to repeat something akin to the letter-writing effort, he said the JCC was already considering reaching out to two nearby mosques that recently received threatening letters."}, {"5111": "Doing so will bring things full circle: One of those mosques was Kahn’s Muslim Community Center in Silver Spring."}, {"1335": "“Our brotherhood, sisterhood, and neighborliness is so much bigger than what is attacking us,” Kahn said. “It’s really important to show that right now.”"}], "child": "1110_1\t1110_2\t1110_3\t1110_4\t1110_5\t1110_6"}