{"name": "1111", "parent": "", "content": "White House adviser isn’t sure if Trump thinks Islam is a religion “If the president has a certain attitude toward a certain religion, that’s something you can ask him.” CREDIT: Screenshot/Fox News Sebastian Gorka, a deputy assistant to President Donald Trump focusing on national security, can’t confirm if the president thinks Islam is a religion. Gorka appeared on NPR’s Morning Edition on Wednesday to discuss the president’s approach to terrorism, and in doing so, revealed that he isn’t sure if Trump sees Islam as a religion. “This isn’t a theological seminary, this is the White House, and we’re not going to get into theological debates,” Gorka said. “If the president has a certain attitude toward a certain religion, that’s something you can ask him, but we’re talking about national security and the totalitarian ideologies that drive the groups that threaten America.” This is the second time Gorka has refused to confirm whether Trump sees Islam as a religion. After being asked if the president believes Islam is a religion on NPR last month, Gorka simply said, “I think you should ask him that question. I’m not a spokesperson for the president.” It shouldn’t be controversial to say the president believes Islam is a religion. Islam, in all its various sects, is followed by nearly a quarter of humanity, or 1.6. billion people around the world. It is the world’s second largest religion, and there are about 3.3 million Muslims in the United States. Gorka’s comments came during a conversation about how Trump will be approaching terrorism in his administration. During his first speech to a joint session of Congress on Tuesday, Trump repeatedly spoke about the threat of “radical Islamic terrorism.” “Those are the most, clearest 3 words of his speech: the enemy is radical Islamic terrorism and that has not changed and it will not change,” Gorka said on NPR. “It’s not just about specific threat groups doing specific crimes, it’s about a global movement, that I like to call global jihadism, and which the president is clear on, it is radical Islamic terrorism, and that’s never changed and it will not change.” Other than using the phrase “radical Islamic terrorism,” Gorka didn’t have a lot of answers for how the president would be approaching terrorism. The only other thing he could point to was Trump’s executive order suspending refugee resettlement and banning nationals from seven-Muslim majority countries. This ban is not good for national security. Despite Trump’s claim during the speech that foreigners are the largest domestic terrorism threat, right-wing extremists actually pose more of a threat on U.S. soil. Lt. Gen. H.R. McMaster, the new National Security Advisor who replaced noted Islamophobe Michael Flynn, has urged Trump to not use the phrase radical Islamic terrorism and told his own staff he finds it “unhelpful.” Neither former presidents Barack Obama or George W. Bush used the phrase in order to avoid the idea that militant groups, like ISIS, actually represent Islam. Other national security experts have similarly said the term only furthers xenophobia and anti-Muslim bigotry. Gorka was previously national security editor for Breitbart News, an outlet which embraces white supremacy, and now advises the president on national security. He holds hard line views on Islam, has called racial profiling of Muslims “common sense,” and said accepting Muslim refugees would be “national suicide.” ", "title": "White House adviser isn’t sure if Trump thinks Islam is a religion", "sentences": [{"3ad0": "White House adviser isn’t sure if Trump thinks Islam is a religion"}, {"8ede": "“If the president has a certain attitude toward a certain religion, that’s something you can ask him.”"}, {"e5f7": "CREDIT: Screenshot/Fox News"}, {"cab1": "Sebastian Gorka, a deputy assistant to President Donald Trump focusing on national security, can’t confirm if the president thinks Islam is a religion."}, {"08fe": "Gorka appeared on NPR’s Morning Edition on Wednesday to discuss the president’s approach to terrorism, and in doing so, revealed that he isn’t sure if Trump sees Islam as a religion."}, {"2c33": "“This isn’t a theological seminary, this is the White House, and we’re not going to get into theological debates,” Gorka said. “If the president has a certain attitude toward a certain religion, that’s something you can ask him, but we’re talking about national security and the totalitarian ideologies that drive the groups that threaten America.”"}, {"a802": "This is the second time Gorka has refused to confirm whether Trump sees Islam as a religion. After being asked if the president believes Islam is a religion on NPR last month, Gorka simply said, “I think you should ask him that question. I’m not a spokesperson for the president.”"}, {"70dc": "It shouldn’t be controversial to say the president believes Islam is a religion. Islam, in all its various sects, is followed by nearly a quarter of humanity, or 1.6. billion people around the world. It is the world’s second largest religion, and there are about 3.3 million Muslims in the United States."}, {"4158": "Gorka’s comments came during a conversation about how Trump will be approaching terrorism in his administration."}, {"0543": "During his first speech to a joint session of Congress on Tuesday, Trump repeatedly spoke about the threat of “radical Islamic terrorism.”"}, {"30dd": "“Those are the most, clearest 3 words of his speech: the enemy is radical Islamic terrorism and that has not changed and it will not change,” Gorka said on NPR. “It’s not just about specific threat groups doing specific crimes, it’s about a global movement, that I like to call global jihadism, and which the president is clear on, it is radical Islamic terrorism, and that’s never changed and it will not change.”"}, {"1a1c": "Other than using the phrase “radical Islamic terrorism,” Gorka didn’t have a lot of answers for how the president would be approaching terrorism. The only other thing he could point to was Trump’s executive order suspending refugee resettlement and banning nationals from seven-Muslim majority countries. This ban is not good for national security. Despite Trump’s claim during the speech that foreigners are the largest domestic terrorism threat, right-wing extremists actually pose more of a threat on U.S. soil."}, {"dfc2": "Lt. Gen. H.R. McMaster, the new National Security Advisor who replaced noted Islamophobe Michael Flynn, has urged Trump to not use the phrase radical Islamic terrorism and told his own staff he finds it “unhelpful.” Neither former presidents Barack Obama or George W. Bush used the phrase in order to avoid the idea that militant groups, like ISIS, actually represent Islam. Other national security experts have similarly said the term only furthers xenophobia and anti-Muslim bigotry."}, {"178d": "Gorka was previously national security editor for Breitbart News, an outlet which embraces white supremacy, and now advises the president on national security. He holds hard line views on Islam, has called racial profiling of Muslims “common sense,” and said accepting Muslim refugees would be “national suicide.”"}], "child": "1111_1\t1111_2\t1111_3\t1111_4\t1111_5\t1111_6\t1111_7\t1111_8\t1111_9\t1111_10"}