{"name": "1112", "parent": "", "content": "Trump echoes David Duke, reportedly suggests Jews are behind threats to Jewish schools “He just said, ‘Sometimes it’s the reverse, to make people — or to make others — look bad.’” Trump poses with state attorneys general at the White House on Tuesday. CREDIT: Video screengrab During a meeting with state attorneys general on Tuesday, President Trump reportedly suggested the repeated bomb threats against Jewish community centers and schools around the country in recent weeks could be false flags. Those comments echo former KKK Grand Wizard and outspoken Trump fan David Duke, who has been pushing the false flag conspiracy theory. According to Pennsylvania Attorney General Josh Shapiro’s account of the Tuesday’s meeting, when the threats came up, Trump said, “sometimes it’s the reverse.” “He just said, ‘Sometimes it’s the reverse, to make people — or to make others — look bad,’ and he used the word ‘reverse’ I would say two or three times in his comments,” Shapiro said, according to BuzzFeed’s Chris Geidner. “He did say at the top that it was reprehensible.” “I really don’t know what he means, or why he said that,” Shapiro, who is a Democrat, added. “It didn’t make a whole lot of sense to me.” Shapiro didn’t immediately respond to a message seeking clarification, but other reporters characterized Shapiro’s account of Trump’s comments in a similar fashion: In recent days, Trump passed on three easy opportunities to denounce anti-Semitic hate. The topic is in the news because anti-Jewish hatred has spiked since Trump’s election victory last November. ThinkProgress tracked 70 instances of anti-Semitic hate between November 9 and February 20, the highest of any marginalized group impacted by the general rise in hate incidents across the country during that same time frame. Since January alone, there have been five waves of bomb threats against Jewish community centers and schools. Trump’s comments to the attorneys general echoes the false flag conspiracy theory Duke has been pushing on Twitter. Trump’s comments on Tuesday didn’t come out of nowhere. During a press conference last week, he floated the idea that anti-Semitic incidents are the work of “our opponents.” “Some of the signs you’ll see are not put up by the people that love or live Donald Trump,” Trump said. “They’re put up by the other side, and you think it’s like playing it straight? No.” That news conference created additional pressure for Trump to denounce anti-Semitism. He finally did during remarks from the National Museum of African American History last Tuesday. Trump claims he denounces anti-Semitism ‘wherever I get a chance.’ Actually, he doesn’t.He’ll tweet immediately about nonexistent events in Sweden, though.thinkprogress.org “Anti-Semitism is horrible, and it’s going to stop,” Trump said. “The anti-Semitic threats targeting our Jewish community and community centers are horrible and are painful and a very sad reminder of the work that still must be done to root out hate and prejudice and evil.” In response to those comments, Steve Goldstein, the executive director of the Anne Frank Center for Mutual Respect, released a statement saying Trump’s “sudden acknowledgement of Anti-Semitism is a Band-Aid on the cancer of Anti-Semitism that has infected his own Administration.” “His statement today is a pathetic asterisk of condescension after weeks in which he and his staff have committed grotesque acts and omissions reflecting Anti-Semitism, yet day after day have refused to apologize and correct the record,” Goldstein said. “Make no mistake: The Anti-Semitism coming out of this Administration is the worst we have ever seen from any Administration… When President Trump responds to Anti-Semitism proactively and in real time, and without pleas and pressure, that’s when we’ll be able to say this President has turned a corner. This is not that moment.” According to the Anti-Defamation League (ADL), the level of anti-Semitism in public and political discourse is the worst it’s been since the 1930s. UPDATE: Early Tuesday evening, Shapiro’s office released this statement: ", "title": "Trump echoes David Duke, reportedly suggests Jews are behind threats to Jewish schools", "sentences": [{"12ed": "Trump echoes David Duke, reportedly suggests Jews are behind threats to Jewish schools"}, {"5c8f": "“He just said, ‘Sometimes it’s the reverse, to make people — or to make others — look bad.’”"}, {"a982": "Trump poses with state attorneys general at the White House on Tuesday. CREDIT: Video screengrab"}, {"307d": "During a meeting with state attorneys general on Tuesday, President Trump reportedly suggested the repeated bomb threats against Jewish community centers and schools around the country in recent weeks could be false flags."}, {"41e0": "Those comments echo former KKK Grand Wizard and outspoken Trump fan David Duke, who has been pushing the false flag conspiracy theory."}, {"89e6": "According to Pennsylvania Attorney General Josh Shapiro’s account of the Tuesday’s meeting, when the threats came up, Trump said, “sometimes it’s the reverse.”"}, {"5f43": "“He just said, ‘Sometimes it’s the reverse, to make people — or to make others — look bad,’ and he used the word ‘reverse’ I would say two or three times in his comments,” Shapiro said, according to BuzzFeed’s Chris Geidner. “He did say at the top that it was reprehensible.”"}, {"64ee": "“I really don’t know what he means, or why he said that,” Shapiro, who is a Democrat, added. “It didn’t make a whole lot of sense to me.”"}, {"c233": "Shapiro didn’t immediately respond to a message seeking clarification, but other reporters characterized Shapiro’s account of Trump’s comments in a similar fashion:"}, {"d2d3": "In recent days, Trump passed on three easy opportunities to denounce anti-Semitic hate. The topic is in the news because anti-Jewish hatred has spiked since Trump’s election victory last November. ThinkProgress tracked 70 instances of anti-Semitic hate between November 9 and February 20, the highest of any marginalized group impacted by the general rise in hate incidents across the country during that same time frame. Since January alone, there have been five waves of bomb threats against Jewish community centers and schools."}, {"1610": "Trump’s comments to the attorneys general echoes the false flag conspiracy theory Duke has been pushing on Twitter."}, {"24eb": "Trump’s comments on Tuesday didn’t come out of nowhere. During a press conference last week, he floated the idea that anti-Semitic incidents are the work of “our opponents.”"}, {"fd59": "“Some of the signs you’ll see are not put up by the people that love or live Donald Trump,” Trump said. “They’re put up by the other side, and you think it’s like playing it straight? No.”"}, {"09c5": "That news conference created additional pressure for Trump to denounce anti-Semitism. He finally did during remarks from the National Museum of African American History last Tuesday."}, {"6682": "Trump claims he denounces anti-Semitism ‘wherever I get a chance.’ Actually, he doesn’t.He’ll tweet immediately about nonexistent events in Sweden, though.thinkprogress.org"}, {"8978": "“Anti-Semitism is horrible, and it’s going to stop,” Trump said. “The anti-Semitic threats targeting our Jewish community and community centers are horrible and are painful and a very sad reminder of the work that still must be done to root out hate and prejudice and evil.”"}, {"0286": "In response to those comments, Steve Goldstein, the executive director of the Anne Frank Center for Mutual Respect, released a statement saying Trump’s “sudden acknowledgement of Anti-Semitism is a Band-Aid on the cancer of Anti-Semitism that has infected his own Administration.”"}, {"2096": "“His statement today is a pathetic asterisk of condescension after weeks in which he and his staff have committed grotesque acts and omissions reflecting Anti-Semitism, yet day after day have refused to apologize and correct the record,” Goldstein said. “Make no mistake: The Anti-Semitism coming out of this Administration is the worst we have ever seen from any Administration… When President Trump responds to Anti-Semitism proactively and in real time, and without pleas and pressure, that’s when we’ll be able to say this President has turned a corner. This is not that moment.”"}, {"2910": "According to the Anti-Defamation League (ADL), the level of anti-Semitism in public and political discourse is the worst it’s been since the 1930s."}, {"6049": "UPDATE: Early Tuesday evening, Shapiro’s office released this statement:"}], "child": "1112_1\t1112_2\t1112_3\t1112_4\t1112_5\t1112_6\t1112_7\t1112_8\t1112_9\t1112_10\t1112_11\t1112_12\t1112_13\t1112_14\t1112_15\t1112_16\t1112_17\t1112_18\t1112_19\t1112_20\t1112_211112_1\t1112_2\t1112_3\t1112_4\t1112_5\t1112_6\t1112_7\t1112_8\t1112_9\t1112_10\t1112_11\t1112_12\t1112_13\t1112_14\t1112_15\t1112_16\t1112_17\t1112_18\t1112_19\t1112_20\t1112_21"}