{"name": "1113", "parent": "", "content": "Police arrest American citizen in Israel thought to be behind bomb threats at Jewish centers That’s little reprieve from the rise of anti-Semitic attacks though. Law enforcement officials arrested an Israeli teenager with American citizenship in southern Israel this week, accusing the 19-year-old of making more than 100 bomb threats against Jewish institutions in the U.S. and other parts of the world. According to the Jewish Telegraphic Agency, the arrest resulted from a months-long investigation by Israeli authorities working in tandem with the American FBI and other agencies scattered across the globe. The teenager is accused of making bomb threats in the United States, Australia, New Zealand, and Europe over the past six months — all while living in Israel. The suspect, whose name has not been released, reportedly used complex methods to evade authorities for months before being apprehended. He is expected to be indicted in Israel, but American officials will likely request he be extradited to the United States for trial. The FBI declined to reveal additional details of the investigation, but sent ThinkProgress the following statement: Early this morning in Israel, the FBI and Israeli National Police worked jointly to locate and arrest the individual suspected for threats to Jewish organizations across the United States and in other parts of the world. The FBI commends the great work of the Israeli National Police in this investigation. Investigating hate crimes is a top priority for the FBI and we will continue to work to make sure all races and religions feel safe in their communities and in their places of worship. The Jewish Community Center Association, which has been deeply impacted by the threats, released a statement praising law enforcement. “On behalf of the JCC Association of North America and JCCs across the continent, we are gratified by the progress in this investigation, and applaud the commitment and leadership of the FBI and other federal agencies, Israeli law enforcement, and local law enforcement across the United States and Canada,” the statement read in part. “We are troubled to learn that the individual suspected of making these threats against Jewish Community Centers, which play a central role in the Jewish community, as well as serve as inclusive and welcoming places for all — is reportedly Jewish.” The news is the latest development in a months-long saga in which hundreds of Jewish institutions, community centers, and schools have been subject to multiple bomb threats across the United States. The threats, which came in several waves beginning in January, often resulted in evacuations, and proved to be a harrowing experience for many Jewish children and parents. The attacks, in turn, are believed to have inspired copycat incidents. Earlier this month, disgraced journalist Juan Thompson was arrested for allegedly making some of the threats as an act of revenge against a former love interest. But even if the suspect arrested in Israel proves to be the chief culprit behind the threats, anti-Semitism remains an issue in the United States in the wake of the 2016 election. Jewish cemeteries in different cities have been desecrated since January, with headstones in Philadelphia, Pennsylvania and St. Louis, Missouri toppled by vandals. Meanwhile, Jewish seminaries and synagogues have been defaced with Nazi propaganda, and ThinkProgress tracked 70 instances of anti-Jewish hatred between November 9, 2016 and February 10, 2017. ", "title": "Police arrest American citizen in Israel thought to be behind bomb threats at Jewish centers", "sentences": [{"11bb": "Police arrest American citizen in Israel thought to be behind bomb threats at Jewish centers"}, {"2f53": "That’s little reprieve from the rise of anti-Semitic attacks though."}, {"648a": "Law enforcement officials arrested an Israeli teenager with American citizenship in southern Israel this week, accusing the 19-year-old of making more than 100 bomb threats against Jewish institutions in the U.S. and other parts of the world."}, {"ee45": "According to the Jewish Telegraphic Agency, the arrest resulted from a months-long investigation by Israeli authorities working in tandem with the American FBI and other agencies scattered across the globe. The teenager is accused of making bomb threats in the United States, Australia, New Zealand, and Europe over the past six months — all while living in Israel."}, {"c6d2": "The suspect, whose name has not been released, reportedly used complex methods to evade authorities for months before being apprehended. He is expected to be indicted in Israel, but American officials will likely request he be extradited to the United States for trial."}, {"a220": "The FBI declined to reveal additional details of the investigation, but sent ThinkProgress the following statement:"}, {"59f9": "Early this morning in Israel, the FBI and Israeli National Police worked jointly to locate and arrest the individual suspected for threats to Jewish organizations across the United States and in other parts of the world. The FBI commends the great work of the Israeli National Police in this investigation. Investigating hate crimes is a top priority for the FBI and we will continue to work to make sure all races and religions feel safe in their communities and in their places of worship."}, {"86e1": "The Jewish Community Center Association, which has been deeply impacted by the threats, released a statement praising law enforcement."}, {"6643": "“On behalf of the JCC Association of North America and JCCs across the continent, we are gratified by the progress in this investigation, and applaud the commitment and leadership of the FBI and other federal agencies, Israeli law enforcement, and local law enforcement across the United States and Canada,” the statement read in part. “We are troubled to learn that the individual suspected of making these threats against Jewish Community Centers, which play a central role in the Jewish community, as well as serve as inclusive and welcoming places for all — is reportedly Jewish.”"}, {"6b0d": "The news is the latest development in a months-long saga in which hundreds of Jewish institutions, community centers, and schools have been subject to multiple bomb threats across the United States. The threats, which came in several waves beginning in January, often resulted in evacuations, and proved to be a harrowing experience for many Jewish children and parents."}, {"271f": "The attacks, in turn, are believed to have inspired copycat incidents. Earlier this month, disgraced journalist Juan Thompson was arrested for allegedly making some of the threats as an act of revenge against a former love interest."}, {"4a6f": "But even if the suspect arrested in Israel proves to be the chief culprit behind the threats, anti-Semitism remains an issue in the United States in the wake of the 2016 election. Jewish cemeteries in different cities have been desecrated since January, with headstones in Philadelphia, Pennsylvania and St. Louis, Missouri toppled by vandals. Meanwhile, Jewish seminaries and synagogues have been defaced with Nazi propaganda, and ThinkProgress tracked 70 instances of anti-Jewish hatred between November 9, 2016 and February 10, 2017."}], "child": "1113_1\t1113_2\t1113_3\t1113_4"}