{"name": "1114", "parent": "", "content": "Progressive faith communities face their own wave of hate “This administration has given…a kind of legitimacy to acts of hate.” CREDIT: First Unitarian Universalist Church of New Orleans Last Friday, First Unitarian Universalist Church of New Orleans convened a highly publicized town hall in support of transgender rights. The church is well known throughout the city for its progressive stance, and leaders were delighted by the heavy turnout. “We packed the sanctuary for that,” Rev. Paul Beedle, the minister of First Unitarian, told ThinkProgress. “We had to have 200 people.” But when the congregation gathered for Sunday services two days later, the mood shifted. As members worshipped in the sanctuary, a parishioner found a gaping hole yawning out of a stained glass window in a hallway. Dozens of brightly colored shards lay scattered across the floor. Someone had thrown a brick through it. “It’s a three-paneled piece that represents the recovery from the [Katrina] flood,” Beedle said, noting that police are currently investigating the incident. “It’s a treasure to us.” Beedle couldn’t be sure the attack was an act of hate. But he suspected it was “probably” connected to the transgender rights event, as it was the first time the church has been attacked in such a brazen way. Members of First Unitarian have reason to be concerned about foul play: their experience is part of a troubling — and largely unreported — phenomenon impacting several left-leaning religious communities across the United States. Threats against churches haven’t risen to the scale of the recent wave of bomb threats directed at Jewish Community Centers or the steady stream of attacks on mosques and Islamic centers. But many outwardly progressive congregations say they are also part of the surge of hate that has rocked so many communities since Donald Trump’s election. Many outwardly progressive churches say they are also part of the surge of hate that has rocked so many communities since Trump’s election. Rev. Peter Morales, president of the liberal-leaning Unitarian Universalist Association, said that attacks on Unitarian Universalist (UU) churches have escalated over the past three years — particularly against those that trumpet their progressive religious values. It’s not an entirely new issue, he said. Several congregations displaying Black Lives Matter (BLM) banners in front of their buildings or waving rainbow flags in their church lawns have seen them defaced as early as 2015. “Some of this goes back a ways,” Morales said. But Morales said things have only gotten worse during Trump’s rise to power. Since the election, a BLM signs outside UU churches in Boston and in Pittsburgh have been defaced, and swastikas have been scratched into the doors of a congregation in New York City. CREDIT: Paul Beedle “Unfortunately I think with the election, this administration has given encouragement and a kind of legitimacy to acts of hate,” Morales said. The uptick extends beyond UU churches. In addition to black churches that have been defaced seemingly for no other reason than having a majority African-American congregation, virtually any faith community that takes a public progressive stance can become a target. A sign outside a Maryland Episcopal advertising a Spanish language service was scrawled over with the slogan “Trump nation whites only,” for instance, and a Florida man threatened to launch an assault on a LGBTQ-friendly United Church of Christ church that would make the Orlando massacre “look small.” “Unfortunately I think with the election, this administration has given encouragement and a kind of legitimacy to acts of hate.” Many of the attacks appear to emanate from anti-LGBTQ vitriol. In Tempe, Arizona, a man reportedly stormed into the offices of Disciples of Christ church about a month after the election, complaining about a rainbow flag flying out front. He then allegedly spouted hatred for LGBTQ people, saying he would pay people to protest outside the church. His inspiration? Trump. “He said that if Hillary would have won he would have driven right on by the church without stopping, but because Trump won he felt he had permission to say and act the way he wanted to expressing the hate that he had for this particular group of people,” Doug Bland, the church’s pastor, told 3TV. If there is one Christian denomination that has likely endured a disproportionate number of anti-LGBTQ attacks of late, it’s the Metropolitan Community Church, whose membership is largely LGBTQ. Rev. Elder. Rachelle Brown, Interim Moderator of MCC, said she knows of at least five churches that have endured attacks since Trump’s election. In St. Petersburg, Florida, an MCC church was defaced with Nazi symbols and Trump’s campaign slogans. Brown said that members of her denomination are hardly surprised by the recent surge — if anything, they’re used to it. The MCC’s openly pro-LGBTQ identity has long made its congregations a target for homophobic hatred: the infamous UpStairs Lounge arson attack, where 32 people were killed in a horrific blaze, occurred during an MCC gathering that met in the gay club in downtown New Orleans. Until the 2016 Pulse Nightclub shooting, it was the deadliest assault on the LGBTQ community in U.S. history. “There is a new boldness.” “I had one pastor tell me, ‘Since the inauguration, we’ve only had 4 windows broken out — as opposed to 110 after the marriage ruling,’” she said. “This is just normal.” Even so, Brown said the new spate of attacks since Trump’s election feels different. Denomination officials created a “Report Hate” portal on the front page of the MCC website shortly after the election, encouraging members to document any attacks they receive or witness. “There is a new boldness,” she said, noting that hate incidents aren’t occurring in places that she says are unusual, such as Seattle or the Northeast. “The intensity has shifted.” Despite this, none of the church leaders who spoke to ThinkProgress felt the attacks would impact their faith-fueled compulsion to preach an inclusive, progressive religious message. If anything, Brown said, it’s emboldened them to be louder, hoping to defeat hatred with love. “People of faith help to change the tide on marriage equality, and I think people of faith can help change the tide on this,” she said. In New Orleans, Rev. Beedle is similarly defiant. “Our message is: this is not going to change our commitment to stand by the transgender community, or any of our neighbors who are marginalized or who are suffering under systemic oppressions,” he said. ", "title": "Progressive faith communities face their own wave of hate", "sentences": [{"1d55": "Progressive faith communities face their own wave of hate"}, {"1fb7": "“This administration has given…a kind of legitimacy to acts of hate.”"}, {"9ec8": "CREDIT: First Unitarian Universalist Church of New Orleans"}, {"9fcb": "Last Friday, First Unitarian Universalist Church of New Orleans convened a highly publicized town hall in support of transgender rights. The church is well known throughout the city for its progressive stance, and leaders were delighted by the heavy turnout."}, {"8ed2": "“We packed the sanctuary for that,” Rev. Paul Beedle, the minister of First Unitarian, told ThinkProgress. “We had to have 200 people.”"}, {"52fc": "But when the congregation gathered for Sunday services two days later, the mood shifted. As members worshipped in the sanctuary, a parishioner found a gaping hole yawning out of a stained glass window in a hallway. Dozens of brightly colored shards lay scattered across the floor."}, {"c1f7": "Someone had thrown a brick through it."}, {"a65e": "“It’s a three-paneled piece that represents the recovery from the [Katrina] flood,” Beedle said, noting that police are currently investigating the incident. “It’s a treasure to us.”"}, {"09ac": "Beedle couldn’t be sure the attack was an act of hate. But he suspected it was “probably” connected to the transgender rights event, as it was the first time the church has been attacked in such a brazen way."}, {"a40c": "Members of First Unitarian have reason to be concerned about foul play: their experience is part of a troubling — and largely unreported — phenomenon impacting several left-leaning religious communities across the United States. Threats against churches haven’t risen to the scale of the recent wave of bomb threats directed at Jewish Community Centers or the steady stream of attacks on mosques and Islamic centers. But many outwardly progressive congregations say they are also part of the surge of hate that has rocked so many communities since Donald Trump’s election."}, {"9680": "Many outwardly progressive churches say they are also part of the surge of hate that has rocked so many communities since Trump’s election."}, {"43d6": "Rev. Peter Morales, president of the liberal-leaning Unitarian Universalist Association, said that attacks on Unitarian Universalist (UU) churches have escalated over the past three years — particularly against those that trumpet their progressive religious values."}, {"009a": "It’s not an entirely new issue, he said. Several congregations displaying Black Lives Matter (BLM) banners in front of their buildings or waving rainbow flags in their church lawns have seen them defaced as early as 2015."}, {"6e79": "“Some of this goes back a ways,” Morales said."}, {"0e4a": "But Morales said things have only gotten worse during Trump’s rise to power. Since the election, a BLM signs outside UU churches in Boston and in Pittsburgh have been defaced, and swastikas have been scratched into the doors of a congregation in New York City."}, {"d8ef": "CREDIT: Paul Beedle"}, {"9801": "“Unfortunately I think with the election, this administration has given encouragement and a kind of legitimacy to acts of hate,” Morales said."}, {"b64b": "The uptick extends beyond UU churches. In addition to black churches that have been defaced seemingly for no other reason than having a majority African-American congregation, virtually any faith community that takes a public progressive stance can become a target. A sign outside a Maryland Episcopal advertising a Spanish language service was scrawled over with the slogan “Trump nation whites only,” for instance, and a Florida man threatened to launch an assault on a LGBTQ-friendly United Church of Christ church that would make the Orlando massacre “look small.”"}, {"d0fd": "“Unfortunately I think with the election, this administration has given encouragement and a kind of legitimacy to acts of hate.”"}, {"9874": "Many of the attacks appear to emanate from anti-LGBTQ vitriol. In Tempe, Arizona, a man reportedly stormed into the offices of Disciples of Christ church about a month after the election, complaining about a rainbow flag flying out front. He then allegedly spouted hatred for LGBTQ people, saying he would pay people to protest outside the church."}, {"707f": "His inspiration? Trump."}, {"7f74": "“He said that if Hillary would have won he would have driven right on by the church without stopping, but because Trump won he felt he had permission to say and act the way he wanted to expressing the hate that he had for this particular group of people,” Doug Bland, the church’s pastor, told 3TV."}, {"c15d": "If there is one Christian denomination that has likely endured a disproportionate number of anti-LGBTQ attacks of late, it’s the Metropolitan Community Church, whose membership is largely LGBTQ."}, {"d966": "Rev. Elder. Rachelle Brown, Interim Moderator of MCC, said she knows of at least five churches that have endured attacks since Trump’s election. In St. Petersburg, Florida, an MCC church was defaced with Nazi symbols and Trump’s campaign slogans."}, {"1093": "Brown said that members of her denomination are hardly surprised by the recent surge — if anything, they’re used to it. The MCC’s openly pro-LGBTQ identity has long made its congregations a target for homophobic hatred: the infamous UpStairs Lounge arson attack, where 32 people were killed in a horrific blaze, occurred during an MCC gathering that met in the gay club in downtown New Orleans. Until the 2016 Pulse Nightclub shooting, it was the deadliest assault on the LGBTQ community in U.S. history."}, {"fd5e": "“There is a new boldness.”"}, {"46d6": "“I had one pastor tell me, ‘Since the inauguration, we’ve only had 4 windows broken out — as opposed to 110 after the marriage ruling,’” she said. “This is just normal.”"}, {"2e70": "Even so, Brown said the new spate of attacks since Trump’s election feels different. Denomination officials created a “Report Hate” portal on the front page of the MCC website shortly after the election, encouraging members to document any attacks they receive or witness."}, {"9dcb": "“There is a new boldness,” she said, noting that hate incidents aren’t occurring in places that she says are unusual, such as Seattle or the Northeast. “The intensity has shifted.”"}, {"5d0b": "Despite this, none of the church leaders who spoke to ThinkProgress felt the attacks would impact their faith-fueled compulsion to preach an inclusive, progressive religious message. If anything, Brown said, it’s emboldened them to be louder, hoping to defeat hatred with love."}, {"88d1": "“People of faith help to change the tide on marriage equality, and I think people of faith can help change the tide on this,” she said."}, {"bf24": "In New Orleans, Rev. Beedle is similarly defiant."}, {"495a": "“Our message is: this is not going to change our commitment to stand by the transgender community, or any of our neighbors who are marginalized or who are suffering under systemic oppressions,” he said."}], "child": "1114_1\t1114_2\t1114_3\t1114_4"}