{"name": "1115", "parent": "", "content": "Trump White House won’t condemn Steve King’s racist comments A day after punting on the question, Press Secretary Sean Spicer offers the weakest response possible. Sean Spicer at his daily briefing on Tuesday CREDIT: MSNBC Two days after Rep. Steve King’s (R-IA) white nationalist tweet warning that “We can’t restore our civilization with somebody else’s babies,” the White House finally responded on Tuesday… barely. At his daily press briefing on Monday, White House Press Secretary Sean Spicer had declined to weigh in on the tweet — or the Monday interview in which King strongly reaffirmed its sentiments — saying that he would “touch base with the president.” Asked again on Tuesday, he declined to criticize King — who Trump endorsed in 2014 as a “special guy, a smart person with really the right views on almost everything.” Instead, Spicer said simply that “I think the president believes that this is not a point of view that he shares.” “He believes he is the president for all Americans,” Spicer concluded, before announcing that he would “leave it at that.” Watch: This is not the first time the Trump White House has opted not to condemn hate. Its official statement on International Holocaust Remembrance Day omitted any mention of the fact that 6 million Jews were exterminated. After a string of anti-Semitic attacks in the United States, Trump responded by reminding Americans of his Electoral College victory in 2016. And the administration has been either silent on — or behind — attacks on Muslim Americans. There have been at least 261 documented incidents of hate in America since Trump’s election. Last month a top Trump surrogate explained that “the president is controlling the bully pulpit and the news cycle, and he doesn’t want to overly discuss the stuff because you’re worried that in itself will cause a fire.” House Minority Leader Nancy Pelosi (D-CA) urged Republican leaders to strip King of his subcommittee chairmanship. But far from doing that, they have largely they have taken pains to avoid criticizing King directly. Speaker of the House Paul Ryan (R-WI) said Monday that he disagreed with King’s comments, but would “like to think he misspoke and it wasn’t really meant the way it sounds and hopefully he’s clarified that.” ", "title": "Trump White House won’t condemn Steve King’s racist comments", "sentences": [{"c76b": "Trump White House won’t condemn Steve King’s racist comments"}, {"98aa": "A day after punting on the question, Press Secretary Sean Spicer offers the weakest response possible."}, {"d66f": "Sean Spicer at his daily briefing on Tuesday CREDIT: MSNBC"}, {"8453": "Two days after Rep. Steve King’s (R-IA) white nationalist tweet warning that “We can’t restore our civilization with somebody else’s babies,” the White House finally responded on Tuesday… barely."}, {"d444": "At his daily press briefing on Monday, White House Press Secretary Sean Spicer had declined to weigh in on the tweet — or the Monday interview in which King strongly reaffirmed its sentiments — saying that he would “touch base with the president.”"}, {"46d5": "Asked again on Tuesday, he declined to criticize King — who Trump endorsed in 2014 as a “special guy, a smart person with really the right views on almost everything.” Instead, Spicer said simply that “I think the president believes that this is not a point of view that he shares.”"}, {"d7e9": "“He believes he is the president for all Americans,” Spicer concluded, before announcing that he would “leave it at that.”"}, {"4948": "Watch:"}, {"106d": "This is not the first time the Trump White House has opted not to condemn hate. Its official statement on International Holocaust Remembrance Day omitted any mention of the fact that 6 million Jews were exterminated. After a string of anti-Semitic attacks in the United States, Trump responded by reminding Americans of his Electoral College victory in 2016. And the administration has been either silent on — or behind — attacks on Muslim Americans."}, {"bf4a": "There have been at least 261 documented incidents of hate in America since Trump’s election. Last month a top Trump surrogate explained that “the president is controlling the bully pulpit and the news cycle, and he doesn’t want to overly discuss the stuff because you’re worried that in itself will cause a fire.”"}, {"e910": "House Minority Leader Nancy Pelosi (D-CA) urged Republican leaders to strip King of his subcommittee chairmanship. But far from doing that, they have largely they have taken pains to avoid criticizing King directly. Speaker of the House Paul Ryan (R-WI) said Monday that he disagreed with King’s comments, but would “like to think he misspoke and it wasn’t really meant the way it sounds and hopefully he’s clarified that.”"}], "child": "1115_1\t1115_2\t1115_3\t1115_4\t1115_5\t1115_6\t1115_7\t1115_8\t1115_9\t1115_10"}