{"name": "1116", "parent": "", "content": "‘This is what hate looks like’: D.C. transgender shelter vandalized Casa Ruby’s door may be shattered, but residents say its doors are still open. WASHINGTON, D.C. — Residents of Casa Ruby, a LGBT youth community center and shelter in Washington, D.C., were preparing to turn on a movie on Sunday afternoon to distract themselves from the cold late-winter day. But before they could settle down in their warm, safe space, a visitor stood up, assaulted a staff member, threw a brick, shattered the glass door, and threatened to return to kill someone. “It came out of nowhere,” said Anthony Killinger, a 51-year old Casa Ruby resident who was in the center when the incident occurred. Killinger told ThinkProgress on Monday morning that the perpetrator had been sitting in the center and was “somebody who came around every so often.” Though this is not the first time he has displayed signs of anger, residents were still surprised when he suddenly became enraged and started yelling at a staff member, verbally and physically assaulting her. “He was literally pushing up against her,” Killinger said. Surveillance video shows the attacker picking up an object, which Killinger said was a bar of soap, and throwing it across the room. As residents and staff tried to push him out to the street, he kicked in the front door, breaking the wood frame. He also threw a brick through the door two times, shattering both panes of the glass and almost hitting a client. Ruby Corado, a transgender woman who fled civil war in El Salvador and became an LGBT advocate in Washington, D.C., founding the shelter for vulnerable youth in 2015, said it was the third act of violence against the center in two weeks. “This is what hate looks like,” she said. On Monday morning, roughly ten clients and residents sat in the center’s winter hypothermia shelter, watching news reports about the incident on their cell phones. When the landline rang, 23-year-old Mally Hatcher, a transgender woman and the director of youth services, greeted a caller with the standard: “It’s a beautiful day at Casa Ruby.” A few feet away, the plastic tarp covering the front door fluttered in the wind. Aside from the front door and the heightened nerves, there were few signs of Sunday’s assault. The glass had been swept up and business continued as usual. “Yesterday a brick flew across the room. Today, who knows?” one resident said to another, forcing out a laugh. “It makes me angry,” Hatcher told ThinkProgress about the incident, the second violent attack she has witnessed since she started working at Casa Ruby. “It’s very disconcerting that you have people out here that continuously want to break up or destroy a safe space.” “More and more things are progressing to a violent level,” she continued. “Unfortunately, we get promises made that we’re going to be looked after and taken care of, and that doesn’t happen.” Hatcher said she still feels safe in her workplace, but “I do feel for the safety of others.” “It’s very disconcerting that you have people out here that continuously want to break up or destroy a safe space.” Killinger agreed. Though he has only lived in the home for two months, he has been a client at Casa Ruby for far longer. Killinger said that if the perpetrator or anyone else were to return to inflict more violence, he would be there to protect the other residents. “These are my girls, these are my people, this is my family, and I’m going to try to keep everybody safe,” he said. “I’m not afraid.” For some residents, the incident reminds them that they can never feel entirely safe in a society where many people — including the current presidential administration — are still hostile to their existence. “You gotta be blessed when you walk outside, because you never know what’s going to happen,” said 23-year-old A’nee Johnson, a transgender woman who has lived in Casa Ruby since January. “You never know when it could be you.” A’nee Johnson outside Casa Ruby. CREDIT: Kira Lerner Johnson said she moved into Casa Ruby at a time when she was going from house to house and would otherwise have ended up on the streets. The advocates who administer her hormones at D.C.’s Whitman-Walker Health suggested she connect with Corado, who gave her a permanent place to live. “It was a blessing, because I was at the end of the road and I didn’t know what else I was going to do,” she said. In a video posted on her Facebook page late Sunday, Corado talked about the importance of keeping D.C.’s LGBT community safe and off the streets, saying that this is not the first time she or her residents have been targeted with hate crimes. “There are seven murders so far this year of trans women of color,” she told a reporter. “I don’t want the next one to be here at Casa Ruby.” At least 7 transgender women have been killed in 2017Ciara McElveen, an advocate for the homeless, was stabbed to death in New Orleans.thinkprogress.org Of the seven trans women of color killed so far in 2017, three were black women murdered in Louisiana in the span of just nine days. Last year, 27 trans women were killed — a record high — and almost all of the victims were women of color. In its most recent report on hate crimes, the FBI found that bias-motivated incidents based on gender identity increased dramatically from 2013 to 2015. Johnson said she credits the uptick less to the Trump administration’s hostility toward the transgender community and more to the inaction of police. “Maybe the people who are doing the hate crimes feel comfortable because they know they can get away with it,” she said. After the incident on Sunday, Corado contacted D.C. Police Chief Peter Newsham, who arrived at the center and vowed to track down the suspect. “These are my girls, these are my people, this is my family, and I’m going to try to keep everybody safe.” The quick response gives Johnson hope, she said, as does the progress she has seen in the Washington area since she began physically transitioning when she was in middle school in the mid-2000's. “It’s not as taboo anymore and it feels good to know that you can walk outside, at least in certain areas, and not have to worry about getting shot or killed or assaulted,” she said. With a heavy snowfall projected for the D.C. area on Tuesday, the center’s cots will likely fill with almost two-dozen transgender people and advocates on Monday night. In preparation, Killinger spent Monday morning unpacking food into the freezer and breaking down boxes. “Ruby has put a lot of time and energy into this place, and I’m behind her 100 percent,” he said. ", "title": "‘This is what hate looks like’: D.C. transgender shelter vandalized", "sentences": [{"92a8": "‘This is what hate looks like’: D.C. transgender shelter vandalized"}, {"77b9": "Casa Ruby’s door may be shattered, but residents say its doors are still open."}, {"b5b9": "WASHINGTON, D.C. — Residents of Casa Ruby, a LGBT youth community center and shelter in Washington, D.C., were preparing to turn on a movie on Sunday afternoon to distract themselves from the cold late-winter day."}, {"b589": "But before they could settle down in their warm, safe space, a visitor stood up, assaulted a staff member, threw a brick, shattered the glass door, and threatened to return to kill someone."}, {"4759": "“It came out of nowhere,” said Anthony Killinger, a 51-year old Casa Ruby resident who was in the center when the incident occurred."}, {"1c21": "Killinger told ThinkProgress on Monday morning that the perpetrator had been sitting in the center and was “somebody who came around every so often.” Though this is not the first time he has displayed signs of anger, residents were still surprised when he suddenly became enraged and started yelling at a staff member, verbally and physically assaulting her. “He was literally pushing up against her,” Killinger said."}, {"0a53": "Surveillance video shows the attacker picking up an object, which Killinger said was a bar of soap, and throwing it across the room. As residents and staff tried to push him out to the street, he kicked in the front door, breaking the wood frame. He also threw a brick through the door two times, shattering both panes of the glass and almost hitting a client."}, {"6d1a": "Ruby Corado, a transgender woman who fled civil war in El Salvador and became an LGBT advocate in Washington, D.C., founding the shelter for vulnerable youth in 2015, said it was the third act of violence against the center in two weeks."}, {"1aaf": "“This is what hate looks like,” she said."}, {"d5db": "On Monday morning, roughly ten clients and residents sat in the center’s winter hypothermia shelter, watching news reports about the incident on their cell phones. When the landline rang, 23-year-old Mally Hatcher, a transgender woman and the director of youth services, greeted a caller with the standard: “It’s a beautiful day at Casa Ruby.”"}, {"a230": "A few feet away, the plastic tarp covering the front door fluttered in the wind."}, {"ae35": "Aside from the front door and the heightened nerves, there were few signs of Sunday’s assault. The glass had been swept up and business continued as usual. “Yesterday a brick flew across the room. Today, who knows?” one resident said to another, forcing out a laugh."}, {"dba4": "“It makes me angry,” Hatcher told ThinkProgress about the incident, the second violent attack she has witnessed since she started working at Casa Ruby. “It’s very disconcerting that you have people out here that continuously want to break up or destroy a safe space.”"}, {"14b6": "“More and more things are progressing to a violent level,” she continued. “Unfortunately, we get promises made that we’re going to be looked after and taken care of, and that doesn’t happen.”"}, {"392d": "Hatcher said she still feels safe in her workplace, but “I do feel for the safety of others.”"}, {"2ffc": "“It’s very disconcerting that you have people out here that continuously want to break up or destroy a safe space.”"}, {"5119": "Killinger agreed. Though he has only lived in the home for two months, he has been a client at Casa Ruby for far longer. Killinger said that if the perpetrator or anyone else were to return to inflict more violence, he would be there to protect the other residents."}, {"8b0e": "“These are my girls, these are my people, this is my family, and I’m going to try to keep everybody safe,” he said. “I’m not afraid.”"}, {"5f4e": "For some residents, the incident reminds them that they can never feel entirely safe in a society where many people — including the current presidential administration — are still hostile to their existence."}, {"9fe0": "“You gotta be blessed when you walk outside, because you never know what’s going to happen,” said 23-year-old A’nee Johnson, a transgender woman who has lived in Casa Ruby since January. “You never know when it could be you.”"}, {"de3b": "A’nee Johnson outside Casa Ruby. CREDIT: Kira Lerner"}, {"478c": "Johnson said she moved into Casa Ruby at a time when she was going from house to house and would otherwise have ended up on the streets. The advocates who administer her hormones at D.C.’s Whitman-Walker Health suggested she connect with Corado, who gave her a permanent place to live."}, {"c5bd": "“It was a blessing, because I was at the end of the road and I didn’t know what else I was going to do,” she said."}, {"6077": "In a video posted on her Facebook page late Sunday, Corado talked about the importance of keeping D.C.’s LGBT community safe and off the streets, saying that this is not the first time she or her residents have been targeted with hate crimes."}, {"a9af": "“There are seven murders so far this year of trans women of color,” she told a reporter. “I don’t want the next one to be here at Casa Ruby.”"}, {"99b7": "At least 7 transgender women have been killed in 2017Ciara McElveen, an advocate for the homeless, was stabbed to death in New Orleans.thinkprogress.org"}, {"5cb3": "Of the seven trans women of color killed so far in 2017, three were black women murdered in Louisiana in the span of just nine days. Last year, 27 trans women were killed — a record high — and almost all of the victims were women of color. In its most recent report on hate crimes, the FBI found that bias-motivated incidents based on gender identity increased dramatically from 2013 to 2015."}, {"7926": "Johnson said she credits the uptick less to the Trump administration’s hostility toward the transgender community and more to the inaction of police. “Maybe the people who are doing the hate crimes feel comfortable because they know they can get away with it,” she said."}, {"2623": "After the incident on Sunday, Corado contacted D.C. Police Chief Peter Newsham, who arrived at the center and vowed to track down the suspect."}, {"9d4f": "“These are my girls, these are my people, this is my family, and I’m going to try to keep everybody safe.”"}, {"b272": "The quick response gives Johnson hope, she said, as does the progress she has seen in the Washington area since she began physically transitioning when she was in middle school in the mid-2000's. “It’s not as taboo anymore and it feels good to know that you can walk outside, at least in certain areas, and not have to worry about getting shot or killed or assaulted,” she said."}, {"066c": "With a heavy snowfall projected for the D.C. area on Tuesday, the center’s cots will likely fill with almost two-dozen transgender people and advocates on Monday night. In preparation, Killinger spent Monday morning unpacking food into the freezer and breaking down boxes."}, {"a6ec": "“Ruby has put a lot of time and energy into this place, and I’m behind her 100 percent,” he said."}], "child": "1116_1\t1116_2\t1116_3\t1116_4\t1116_5\t1116_6\t1116_7\t1116_8\t1116_9\t1116_10\t1116_11\t1116_12\t1116_13\t1116_14"}