{"name": "1117", "parent": "", "content": "Mosques are getting bomb threats, too Islamophobia isn’t going away. Yes, America, Islamophobia is still very much a problem. While the issue hasn’t been as headline-grabbing as the recurring waves of bomb threats directed at Jewish community centers across the country since January, American mosques and Islamic organizations have been enduring their own onslaught of hate incidents this year. Over the weekend, at least two mosques — one in Cincinnati, Ohio, the other in Lexington, Kentucky—received bomb threats from unknown sources. Leaders at Lexington’s Masjid Bilal told reporters they discovered a letter in their mailbox containing a green index card wrapped in a blank sheet of paper. The envelope’s return address mentioned far-away England, but the card’s chilling message was local: “An explosive device will be placed at your mosque very soon!” “I was shocked. I did not expect it,” mosque president Salah Elbakoush told the Lexington Herald-Leader. The Islamic Society of Greater Cincinnati (ICGC) issued a press release after it reported its threat to the police, pointing to an emerging climate of hatred that is impacted several minority faiths — including Muslims. “ICGC is concerned, but we will not be intimidated,” the statement read. “[The threat] comes at a time when the Islamic Center was finalizing a statement to condemn the acts of hatred and threats against the Jewish community as well as immigrants, showing us that when we tolerate a climate of hate, no one is immune.” Several mosques across the country have also endured less specific (but no less disturbing) threats in recent days. Communities in Maryland, Virginia, New York, New Jersey, and Georgia all found hastily-written messages in their mailboxes beginning in late February, some containing poorly drawn sketches of a Muslim being beheaded. Hours after Trump signs Muslim ban, Texas mosque goes up in flamesThis is just tragic.thinkprogress.org In addition, Corey Saylor, who heads up CAIR’s Department to Monitor and Combat Islamophobia, said his organization has tracked 28 “anti-mosque” incidents since January. CAIR’s list, provided to ThinkProgress, is filled with troubling accounts: mosque signs defaced with Nazi references in Illinois. Windows broken and tires slashed at a California Islamic center. Muslim worship halls burned to the ground under suspicious circumstances in Florida, Washington, and Texas. Most of these incidents are still under investigation, and it remains to be seen if 2017 will be more Islamophobic than years past. But Saylor pointed out that “better” and “worse” are fast becoming relative terms for American Muslims. “We started tracking these things in 2009, and 2015 was the worst ever,” he said. “Then 2016 topped that.” “Trump’s demonization of Islam and fear-mongering regarding Muslims is a key ingredient in the rise of bias incidents.” Saylor explained that his group chronicled 127 anti-mosque incidents in 2014, and 139 incidents in 2016. That’s a sharp uptick from 2014, when they only recorded 39. The numbers are staggering, especially since Muslims make up just 1 percent of the U.S. population. But while the Trump administration was successfully pressured into condemning anti-Semitism recently, officials have declined to decry Islamophobia — even when explicitly asked by reporters. Meanwhile, Trump has signed yet another version of his Muslim ban, an executive order which halts refugee resettlement and bars travelers from 6 Muslim-majority countries from entering the United States. Saylor said many Muslims believe such policies are partly inspiring anti-Muslim attacks. “Trump’s demonization of Islam and fear-mongering regarding Muslims is a key ingredient in the rise of bias incidents,” Saylor said. Indeed, there are strong signs that Islamophobia has significantly worsened during Trump’s rise to power. ThinkProgress tracked 111 anti-Islam incidents from November 2015 to November 2016, and another 31 incidents between Election Day 2016 and February 10 of this year. In several cases, Trump’s campaign, rhetoric, or policies were mentioned during the attack. ", "title": "Mosques are getting bomb threats, too", "sentences": [{"8e96": "Mosques are getting bomb threats, too"}, {"3f4a": "Islamophobia isn’t going away."}, {"4271": "Yes, America, Islamophobia is still very much a problem."}, {"485b": "While the issue hasn’t been as headline-grabbing as the recurring waves of bomb threats directed at Jewish community centers across the country since January, American mosques and Islamic organizations have been enduring their own onslaught of hate incidents this year."}, {"ae3a": "Over the weekend, at least two mosques — one in Cincinnati, Ohio, the other in Lexington, Kentucky—received bomb threats from unknown sources."}, {"428b": "Leaders at Lexington’s Masjid Bilal told reporters they discovered a letter in their mailbox containing a green index card wrapped in a blank sheet of paper. The envelope’s return address mentioned far-away England, but the card’s chilling message was local: “An explosive device will be placed at your mosque very soon!”"}, {"4d2b": "“I was shocked. I did not expect it,” mosque president Salah Elbakoush told the Lexington Herald-Leader."}, {"f8f8": "The Islamic Society of Greater Cincinnati (ICGC) issued a press release after it reported its threat to the police, pointing to an emerging climate of hatred that is impacted several minority faiths — including Muslims."}, {"b071": "“ICGC is concerned, but we will not be intimidated,” the statement read. “[The threat] comes at a time when the Islamic Center was finalizing a statement to condemn the acts of hatred and threats against the Jewish community as well as immigrants, showing us that when we tolerate a climate of hate, no one is immune.”"}, {"e08e": "Several mosques across the country have also endured less specific (but no less disturbing) threats in recent days. Communities in Maryland, Virginia, New York, New Jersey, and Georgia all found hastily-written messages in their mailboxes beginning in late February, some containing poorly drawn sketches of a Muslim being beheaded."}, {"d554": "Hours after Trump signs Muslim ban, Texas mosque goes up in flamesThis is just tragic.thinkprogress.org"}, {"95fc": "In addition, Corey Saylor, who heads up CAIR’s Department to Monitor and Combat Islamophobia, said his organization has tracked 28 “anti-mosque” incidents since January. CAIR’s list, provided to ThinkProgress, is filled with troubling accounts: mosque signs defaced with Nazi references in Illinois. Windows broken and tires slashed at a California Islamic center. Muslim worship halls burned to the ground under suspicious circumstances in Florida, Washington, and Texas."}, {"6306": "Most of these incidents are still under investigation, and it remains to be seen if 2017 will be more Islamophobic than years past. But Saylor pointed out that “better” and “worse” are fast becoming relative terms for American Muslims."}, {"3a2c": "“We started tracking these things in 2009, and 2015 was the worst ever,” he said. “Then 2016 topped that.”"}, {"3702": "“Trump’s demonization of Islam and fear-mongering regarding Muslims is a key ingredient in the rise of bias incidents.”"}, {"1a6b": "Saylor explained that his group chronicled 127 anti-mosque incidents in 2014, and 139 incidents in 2016. That’s a sharp uptick from 2014, when they only recorded 39."}, {"c184": "The numbers are staggering, especially since Muslims make up just 1 percent of the U.S. population. But while the Trump administration was successfully pressured into condemning anti-Semitism recently, officials have declined to decry Islamophobia — even when explicitly asked by reporters."}, {"46ff": "Meanwhile, Trump has signed yet another version of his Muslim ban, an executive order which halts refugee resettlement and bars travelers from 6 Muslim-majority countries from entering the United States. Saylor said many Muslims believe such policies are partly inspiring anti-Muslim attacks."}, {"f701": "“Trump’s demonization of Islam and fear-mongering regarding Muslims is a key ingredient in the rise of bias incidents,” Saylor said."}, {"d6e4": "Indeed, there are strong signs that Islamophobia has significantly worsened during Trump’s rise to power. ThinkProgress tracked 111 anti-Islam incidents from November 2015 to November 2016, and another 31 incidents between Election Day 2016 and February 10 of this year. In several cases, Trump’s campaign, rhetoric, or policies were mentioned during the attack."}], "child": "1117_1\t1117_2\t1117_3\t1117_4\t1117_5"}