{"name": "1118", "parent": "", "content": "With hate crimes against Jews on the rise, one community grapples with how to respond “I just keep thinking about the shattered gravestones and the shattered hopes.” Maybe the ground was soft. It was uneven, for certain. Some of the stones were already in disrepair, victims of indifferent assaults by weather, neglect, and time. Mount Carmel Cemetery in Northeast Philadelphia is at least 100 years old. It has not been particularly well tended-to. The light rain stopped by midnight that Saturday, though the sky remained overcast until sunrise. It had been too warm the day before — a high of 72 in February — but the temperatures dipped into the forties overnight. With the chill and the humidity, someone there could have been able to see their breath. Their exhalations would have hovered in the air, like ghosts. They would have met little resistance upon entry: A flimsy fence along the edges, a front gate on Frankford Ave. No security to speak of. There were no lights, and it was likely too cloudy for the moon to assist. Maybe they worked by the glow of cellphone screens. Maybe they brought flashlights. Maybe they toiled in darkness. Probably safe to assume they didn’t read the names on the graves before severing somewhere near 200 headstones from their anchors and pushing them onto the dirt. Probably took more than one person. Probably were at it for hours. Probably used a sledgehammer. The investigation is ongoing. In Judaism, caring for the dead is considered one of the most important acts a person can perform. It is a chesed shel emet, kindness for which one can never be repaid. It’s tradition. But the desecration of Jewish cemeteries is tradition, too. The attack on Mt. Carmel, which came only a week after vandals knocked over at least 170 headstones in a Jewish cemetery in Missouri, has roots as far back as the 19th century, when the assaults were part of the Russian empire’s pogroms against its Jewish population. Jewish cemeteries were vandalized on Kristallnacht and damaged by Nazis throughout World War II. Last fall, a Jewish cemetery in New York was spray-painted with swastikas and other assorted symbols of the Third Reich days before Yom Kippur, the holiest day in the Jewish calendar. Cemeteries, though sites of sorrow, are peaceful places. Whatever violence befell the people buried here is over now; whatever horror they faced in life they are free from, finally, in death. Days after the attack, Mt. Carmel felt electric with the violation of that peace, and what that violation meant. The boundless hate of someone with so much contempt for the Jewish people, it was not enough for him that these Jews were already dead. Vandalism at Mount Carmel Cemetery. CREDIT: Jessica Goldstein Mt. Carmel Cemetery sits on a gentle slope. You can stand at the top and see the backs of all the stones nearly to the end. Last Thursday, it was almost empty. The Jewish Federation of Greater Philadelphia had organized shifts of volunteers to clean up debris and map the graves, but that afternoon was set aside for professionals — mostly brick layers, cement masons, and operating engineers from the Philadelphia Building Trades — to assess the damage and develop a plan for repairs. John J. Dougherty, business manager of the Philadelphia Building Trades, said it was “still too early” to know how long repairs might take. “It’s pretty extensive, the damage,” he said. “This is my first tour through here. I stayed away until today. And it’s a shame. There’s a lot of damage done here. I think way more than people realize.” Improving security is also a priority, but a considerable undertaking: “You’re talking cameras, you’re talking lights, you’re talking fencing.” Even from the street, the wreckage is impossible to miss. The vandal, or vandals, did not focus their attack on just one corner or plot. Graves were chosen, seemingly at random, all across the space. Massive headstones, big as fourth-graders, were broken from their bases and lay flat in the grass, the granite gleaming in the sun. “I grew up across the street, just down the road there,” said city councilman Bobby Henon, nodding toward the gate. “So not only is it sad that there’s this kind of hate that’s taken place anywhere, but it’s heartbreaking because it’s my neighborhood. It’s where I grew up.” Henon first got to Mt. Carmel on Sunday night. “It was awful. It was sad. There were volunteers, they were physically shaken up and emotionally sad and weeping and comforting each other.” “The thing that’s most painful, the thing I keep thinking… is, they came to America, they had so much hope. And I just keep thinking about the shattered gravestones and the shattered hopes.” Just mapping the cemetery is a major endeavor. Addie Lewis Klein, director of community engagement for the Jewish Federation of Greater Philadelphia, said that volunteers are relying on a handwritten, historic map they found online “plus an inventory that an Eagle Scout typed up years ago” to make a new map that will “show who is buried where and the condition of each stone.” “We’re going to use that to be able to get back in touch with people around the country who have reached out to the Jewish Federation to say, ‘Can you please check on the state of my relatives’ graves?’” she said. “That’s our hope: To be able to get back to them some with some information about how their relatives’ graves are doing.” “We’re trying to use this disgusting act to fix the future for this place,” Dougherty said. “We’re here to let people know there’s an urgency to be helpful, to let people know that the wrongs are going to be righted.” Hot pink pussy hats dotted the crowd at the Stand Against Hate event at Independence Mall that morning. The knitted pointy ears stuck out among the wide-brimmed Borsalinos of the Orthodox and the baseball caps of veterans, the yarmulkes and the hijabs. Posters that read “Jewish Lives Matter” and “We Won’t Go Back: Jews Defend Democracy” and a range of flags — American, Israeli, LGBT, “Coexist” with symbols for letters — rippled against the wind. The attendees were so diverse that the scene could have looked staged, like the photos in a liberal arts college brochure. Instead the mass was so earnest and genuine you almost felt self-conscious looking directly at it. Though the entire country was hit with a wave of hate crimes in the wake of the presidential election, the days leading up to the rally had been especially cruel to Philadelphia. Just one day after the desecration at Mt. Carmel was discovered, two Philadelphia-area Jewish Community Centers received bomb threats. The same day that bomb threats terrorized the Katz Jewish Community Center and Jewish Federation of Southern New Jersey in Cherry Hill, N.J., and the Perelman Jewish Day School and Kaiserman JCC in Wynnewood, Pa., bomb threats forced evacuations at Jewish schools and community centers in twelve states total: Alabama, Delaware, Florida, Indiana, Maryland, Michigan, New Jersey, New York, Rhode Island, North Carolina, Virginia, and Pennsylvania. Last Monday’s cavalcade of phoned-in terror was just the latest in a string of such threats: There have been at least 92 threats against Jewish institutions in the U.S. since January, with targets ranging from small JCCs to the ADL’s national headquarters in New York City. The number keeps rising as this story is being written and may well be higher by the time you read this sentence. On February 16 — at which point nearly 50 Jewish organizations in America had received bomb threats— President Trump was asked by reporter Jake Turx to “address [the] uptick in anti-Semitism and how in this climate you’re going to take care of it.” Before Turx could finish his question, Trump interrupted to say Turx’s inquiry was “not a fair question” and to assure the nation that “I’m the least anti-Semitic person you’ve seen in your entire life.” Four days later, after yet another wave of bomb threats hit 11 JCCs across the country (and after his daughter, Ivanka, tweeted about the matter), President Trump told reporters that “the anti-Semitic threats targeting our Jewish community and community centers are horrible and are painful and a very sad reminder of the work that still must be done to root out hate and prejudice and evil.” The FBI gave a statement to CNN saying that the bureau and the Justice Department’s Civil Rights Division were “investigating possible civil rights violations in connections with threats to Jewish Community Centers across the country.” The bombs these callers promise have yet to materialize. But fear needs no lit fuse, and the people most immediately affected by these threats — the people who are typically at JCCs in the middle of a weekday: children at school or day care, their teachers, and the elderly — are evacuated, their days disrupted, and sense of security rattled just the same. Stand Against Hate was planned only three days in advance, organized by the Jewish Federation of Greater Philadelphia and rapidly supported by the Interfaith Center of Greater Philadelphia, religious leaders of all persuasions, and a smattering of elected officials, including Governor Tom Wolf (D-PA), Pennsylvania Attorney General Josh Shapiro, and Philadelphia Mayor Jim Kenney (D), all of whom gave speeches. Perhaps a year ago, such short notice would have stifled turnout. But America is invigorated anew with the spirit of protest. Nothing like the fear that First Amendment rights are eroding to encourage one to exercise them: Since the historic Women’s March on January 21, which drew an estimated 470,000 people in Washington, D.C. alone, the gusto for taking it to the streets, whatever the “it” of the day may be — outrage at a Muslim ban, gender discrimination — is high. “You do what you feel is right. I want my kids to know what I stand for. Facebook wasn’t visible to them. This is visible to them.” And so, with 36 hours lead time, 5,000 people filled Independence Mall on Thursday at noon for two hours of speeches, songs, and prayers. (The National Park Service, as President Trump discovered during his Inauguration-headcount debacle, does not issue official crowd estimates, but the NPS did tell the event organizers how many people could fit in the designated space, and that space was full.) The Jewish Federation was loathe to use the word “rally” as a label for a gathering they insisted was non-partisan and apolitical. But it would be inaccurate to describe the event as anything else, as it was clearly intended to do just that: Rally the community around a common cause, rally the spirits of those who feel vulnerable, afraid, and under attack. That’s what brought Sharon Pennock in from Havertown, just down the Main Line. Carrying a poster that read “If not now, when?”, she said that she’s “just been going to everything” since the election, including the airport protests of Trump’s immigration ban. “I happen to be Jewish, so this is more personal for me,” she said, but “everybody deserves to have everyone turn out for each other.” She brought her mom, whose involvement has scaled up along with her daughter’s. “It’s been a bonding experience.” At Stand Against Hate in Philadelphia, Pa., on March 2, 2017. CREDIT: Jessica Goldstein Pennock attributed some of her increased activism to the outcome of the election and some to a kind of adult coming-of-age. Though she long posted her political views on social media, she recently turned 40 and decided it was time to live her beliefs more fully. At her age, she said, “You do what you feel is right. I want my kids to know what I stand for. Facebook wasn’t visible to them. This is visible to them.” As the crowd dispersed, Rabbi Deborah Waxman explained that a number of her family members were buried at Mt. Carmel. She visited them for the first time years ago, when she had just started rabbinical school. “It was hard to find the graves, and they were quite worn,” she said. But she and her mom found them: Her great-grandparents, two great uncles for whom her mother was named, and her great-great-grandfather. Waxman took a rubbing of the Hebrew lettering of her great-great-grandfather’s name. “It was very moving,” she said. She hadn’t been back since. As the years passed, Waxman and her mother lost track of where, exactly, the cemetery was, and what it was named. “On Sunday, I heard the news, and I had this sick feeling that this was the cemetery,” Waxman said. By Thursday morning, she confirmed it. She still doesn’t know whether her family’s graves are among the damaged. “The thing that’s most painful, the thing I keep thinking… is, they came to America, they had so much hope,” she said. “And I just keep thinking about the shattered gravestones and the shattered hopes.” The rise in anti-Semitic hate crimes, she said, doesn’t change “our day-to-day life” as Jews. “But existentially, it just feels like the ground is less secure than it used to be. And what the future is, it’s more of an open question… If this,” she said, gesturing to the Stand Against Hate attendees milling around behind her, “wins the day, then we’ll be fine. If the other wins the day, then we will not be fine.” Cemetery desecration is “an attack on the vulnerable,” she said. “We enter into a covenant of good faith with people, that whether or not they’re your people, that you’ll respect them.” “I don’t think it should make a difference that my family is affected, and it does,” she said. “I’ve wept a lot.” The day of the rally, admission was free at the National Museum of American Jewish History, which overlooks Independence Mall. (The museum is also collecting narratives about people interred at Mt. Carmel “to preserve the stories of the people who are buried there.”) A class trip of Jewish schoolchildren arrived that morning. A teacher corralled the students, chattering among themselves and wired with field trip energy, around an immigration exhibit. “Is it more important to become an American or uphold your traditions?” She waited for a reply, then decided to answer her own question: “A little bit of both.” The National Museum of American Jewish History bearing a banner added in December 2016 that quotes George Washington’s letter to the Hebrew Congregation of Newport, Rhode Island in 1790. The original letter is displayed inside the museum. CREDIT: NMAJH Their voices echoed up from the entrance to the fourth floor, where an introductory video to the museum explains that the Jews who came to America were “inspired by the promise of freedom. They’ve come from all over the world, dreaming of a better life.” For the lion’s share of immigrants and their descendants, that phrase is a familiar one, bordering on cliché. A better life. It is telling that the oft-repeated line is not “they were dreaming of the best life.” No one dreamt of best. Only better. And it was, and it is. It was better to be a Jew in America in 1654, when the first Jewish refugees came to these shores, than it was in Brazil, the land from which they fled — they’d been given three months to leave by the conquering Portuguese — even though the earliest Jewish residents of New Amsterdam were immediately deemed “hateful enemies” by their new government. What can you do? For Jews, the bar for better is low. Anything short of genocide will do. It is better to be a Jew in America in 2017, where anti-Semitism is rising like smoke, where the bomb threats keep pouring in, where the president suggests the perpetrators of these hate crimes against the Jewish community might actually be Jews themselves, because “sometimes it’s the reverse.” It is still better, here, than almost anywhere else on Earth. For whatever that’s worth. Better is not so much the absence of hateful violence as the presence of resistance to that violence, of collective intolerance for intolerance. Better is exhausting, and better is disappointing, and better is not enough, except for when it is, because it has to be. Better is one neighbor toppling your tombstones in the middle of the night and the rest of your neighbors arriving, by the dawn’s early light, to right them. ", "title": "With hate crimes against Jews on the rise, one community grapples with how to respond", "sentences": [{"2287": "With hate crimes against Jews on the rise, one community grapples with how to respond"}, {"d42f": "“I just keep thinking about the shattered gravestones and the shattered hopes.”"}, {"49c9": "Maybe the ground was soft. It was uneven, for certain. Some of the stones were already in disrepair, victims of indifferent assaults by weather, neglect, and time. Mount Carmel Cemetery in Northeast Philadelphia is at least 100 years old. It has not been particularly well tended-to."}, {"e7ad": "The light rain stopped by midnight that Saturday, though the sky remained overcast until sunrise. It had been too warm the day before — a high of 72 in February — but the temperatures dipped into the forties overnight. With the chill and the humidity, someone there could have been able to see their breath. Their exhalations would have hovered in the air, like ghosts."}, {"0cc8": "They would have met little resistance upon entry: A flimsy fence along the edges, a front gate on Frankford Ave. No security to speak of. There were no lights, and it was likely too cloudy for the moon to assist. Maybe they worked by the glow of cellphone screens. Maybe they brought flashlights. Maybe they toiled in darkness. Probably safe to assume they didn’t read the names on the graves before severing somewhere near 200 headstones from their anchors and pushing them onto the dirt."}, {"64da": "Probably took more than one person. Probably were at it for hours. Probably used a sledgehammer."}, {"897f": "The investigation is ongoing."}, {"082c": "In Judaism, caring for the dead is considered one of the most important acts a person can perform. It is a chesed shel emet, kindness for which one can never be repaid. It’s tradition."}, {"8685": "But the desecration of Jewish cemeteries is tradition, too. The attack on Mt. Carmel, which came only a week after vandals knocked over at least 170 headstones in a Jewish cemetery in Missouri, has roots as far back as the 19th century, when the assaults were part of the Russian empire’s pogroms against its Jewish population. Jewish cemeteries were vandalized on Kristallnacht and damaged by Nazis throughout World War II. Last fall, a Jewish cemetery in New York was spray-painted with swastikas and other assorted symbols of the Third Reich days before Yom Kippur, the holiest day in the Jewish calendar."}, {"5972": "Cemeteries, though sites of sorrow, are peaceful places. Whatever violence befell the people buried here is over now; whatever horror they faced in life they are free from, finally, in death. Days after the attack, Mt. Carmel felt electric with the violation of that peace, and what that violation meant. The boundless hate of someone with so much contempt for the Jewish people, it was not enough for him that these Jews were already dead."}, {"ecd5": "Vandalism at Mount Carmel Cemetery. CREDIT: Jessica Goldstein"}, {"247a": "Mt. Carmel Cemetery sits on a gentle slope. You can stand at the top and see the backs of all the stones nearly to the end. Last Thursday, it was almost empty. The Jewish Federation of Greater Philadelphia had organized shifts of volunteers to clean up debris and map the graves, but that afternoon was set aside for professionals — mostly brick layers, cement masons, and operating engineers from the Philadelphia Building Trades — to assess the damage and develop a plan for repairs."}, {"b035": "John J. Dougherty, business manager of the Philadelphia Building Trades, said it was “still too early” to know how long repairs might take. “It’s pretty extensive, the damage,” he said. “This is my first tour through here. I stayed away until today. And it’s a shame. There’s a lot of damage done here. I think way more than people realize.” Improving security is also a priority, but a considerable undertaking: “You’re talking cameras, you’re talking lights, you’re talking fencing.”"}, {"1423": "Even from the street, the wreckage is impossible to miss. The vandal, or vandals, did not focus their attack on just one corner or plot. Graves were chosen, seemingly at random, all across the space. Massive headstones, big as fourth-graders, were broken from their bases and lay flat in the grass, the granite gleaming in the sun."}, {"60a8": "“I grew up across the street, just down the road there,” said city councilman Bobby Henon, nodding toward the gate. “So not only is it sad that there’s this kind of hate that’s taken place anywhere, but it’s heartbreaking because it’s my neighborhood. It’s where I grew up.”"}, {"4e2e": "Henon first got to Mt. Carmel on Sunday night. “It was awful. It was sad. There were volunteers, they were physically shaken up and emotionally sad and weeping and comforting each other.”"}, {"c8c9": "“The thing that’s most painful, the thing I keep thinking… is, they came to America, they had so much hope. And I just keep thinking about the shattered gravestones and the shattered hopes.”"}, {"87b8": "Just mapping the cemetery is a major endeavor. Addie Lewis Klein, director of community engagement for the Jewish Federation of Greater Philadelphia, said that volunteers are relying on a handwritten, historic map they found online “plus an inventory that an Eagle Scout typed up years ago” to make a new map that will “show who is buried where and the condition of each stone.”"}, {"c007": "“We’re going to use that to be able to get back in touch with people around the country who have reached out to the Jewish Federation to say, ‘Can you please check on the state of my relatives’ graves?’” she said. “That’s our hope: To be able to get back to them some with some information about how their relatives’ graves are doing.”"}, {"fac9": "“We’re trying to use this disgusting act to fix the future for this place,” Dougherty said. “We’re here to let people know there’s an urgency to be helpful, to let people know that the wrongs are going to be righted.”"}, {"67b1": "Hot pink pussy hats dotted the crowd at the Stand Against Hate event at Independence Mall that morning. The knitted pointy ears stuck out among the wide-brimmed Borsalinos of the Orthodox and the baseball caps of veterans, the yarmulkes and the hijabs. Posters that read “Jewish Lives Matter” and “We Won’t Go Back: Jews Defend Democracy” and a range of flags — American, Israeli, LGBT, “Coexist” with symbols for letters — rippled against the wind. The attendees were so diverse that the scene could have looked staged, like the photos in a liberal arts college brochure. Instead the mass was so earnest and genuine you almost felt self-conscious looking directly at it."}, {"2150": "Though the entire country was hit with a wave of hate crimes in the wake of the presidential election, the days leading up to the rally had been especially cruel to Philadelphia. Just one day after the desecration at Mt. Carmel was discovered, two Philadelphia-area Jewish Community Centers received bomb threats."}, {"545e": "The same day that bomb threats terrorized the Katz Jewish Community Center and Jewish Federation of Southern New Jersey in Cherry Hill, N.J., and the Perelman Jewish Day School and Kaiserman JCC in Wynnewood, Pa., bomb threats forced evacuations at Jewish schools and community centers in twelve states total: Alabama, Delaware, Florida, Indiana, Maryland, Michigan, New Jersey, New York, Rhode Island, North Carolina, Virginia, and Pennsylvania. Last Monday’s cavalcade of phoned-in terror was just the latest in a string of such threats: There have been at least 92 threats against Jewish institutions in the U.S. since January, with targets ranging from small JCCs to the ADL’s national headquarters in New York City. The number keeps rising as this story is being written and may well be higher by the time you read this sentence."}, {"3ef5": "On February 16 — at which point nearly 50 Jewish organizations in America had received bomb threats— President Trump was asked by reporter Jake Turx to “address [the] uptick in anti-Semitism and how in this climate you’re going to take care of it.” Before Turx could finish his question, Trump interrupted to say Turx’s inquiry was “not a fair question” and to assure the nation that “I’m the least anti-Semitic person you’ve seen in your entire life.”"}, {"0f38": "Four days later, after yet another wave of bomb threats hit 11 JCCs across the country (and after his daughter, Ivanka, tweeted about the matter), President Trump told reporters that “the anti-Semitic threats targeting our Jewish community and community centers are horrible and are painful and a very sad reminder of the work that still must be done to root out hate and prejudice and evil.” The FBI gave a statement to CNN saying that the bureau and the Justice Department’s Civil Rights Division were “investigating possible civil rights violations in connections with threats to Jewish Community Centers across the country.”"}, {"a659": "The bombs these callers promise have yet to materialize. But fear needs no lit fuse, and the people most immediately affected by these threats — the people who are typically at JCCs in the middle of a weekday: children at school or day care, their teachers, and the elderly — are evacuated, their days disrupted, and sense of security rattled just the same."}, {"a081": "Stand Against Hate was planned only three days in advance, organized by the Jewish Federation of Greater Philadelphia and rapidly supported by the Interfaith Center of Greater Philadelphia, religious leaders of all persuasions, and a smattering of elected officials, including Governor Tom Wolf (D-PA), Pennsylvania Attorney General Josh Shapiro, and Philadelphia Mayor Jim Kenney (D), all of whom gave speeches."}, {"c4bf": "Perhaps a year ago, such short notice would have stifled turnout. But America is invigorated anew with the spirit of protest. Nothing like the fear that First Amendment rights are eroding to encourage one to exercise them: Since the historic Women’s March on January 21, which drew an estimated 470,000 people in Washington, D.C. alone, the gusto for taking it to the streets, whatever the “it” of the day may be — outrage at a Muslim ban, gender discrimination — is high."}, {"073f": "“You do what you feel is right. I want my kids to know what I stand for. Facebook wasn’t visible to them. This is visible to them.”"}, {"a8eb": "And so, with 36 hours lead time, 5,000 people filled Independence Mall on Thursday at noon for two hours of speeches, songs, and prayers. (The National Park Service, as President Trump discovered during his Inauguration-headcount debacle, does not issue official crowd estimates, but the NPS did tell the event organizers how many people could fit in the designated space, and that space was full.) The Jewish Federation was loathe to use the word “rally” as a label for a gathering they insisted was non-partisan and apolitical. But it would be inaccurate to describe the event as anything else, as it was clearly intended to do just that: Rally the community around a common cause, rally the spirits of those who feel vulnerable, afraid, and under attack."}, {"8647": "That’s what brought Sharon Pennock in from Havertown, just down the Main Line. Carrying a poster that read “If not now, when?”, she said that she’s “just been going to everything” since the election, including the airport protests of Trump’s immigration ban. “I happen to be Jewish, so this is more personal for me,” she said, but “everybody deserves to have everyone turn out for each other.” She brought her mom, whose involvement has scaled up along with her daughter’s. “It’s been a bonding experience.”"}, {"ed73": "At Stand Against Hate in Philadelphia, Pa., on March 2, 2017. CREDIT: Jessica Goldstein"}, {"45b2": "Pennock attributed some of her increased activism to the outcome of the election and some to a kind of adult coming-of-age. Though she long posted her political views on social media, she recently turned 40 and decided it was time to live her beliefs more fully. At her age, she said, “You do what you feel is right. I want my kids to know what I stand for. Facebook wasn’t visible to them. This is visible to them.”"}, {"b189": "As the crowd dispersed, Rabbi Deborah Waxman explained that a number of her family members were buried at Mt. Carmel. She visited them for the first time years ago, when she had just started rabbinical school. “It was hard to find the graves, and they were quite worn,” she said. But she and her mom found them: Her great-grandparents, two great uncles for whom her mother was named, and her great-great-grandfather. Waxman took a rubbing of the Hebrew lettering of her great-great-grandfather’s name. “It was very moving,” she said. She hadn’t been back since."}, {"8e82": "As the years passed, Waxman and her mother lost track of where, exactly, the cemetery was, and what it was named. “On Sunday, I heard the news, and I had this sick feeling that this was the cemetery,” Waxman said. By Thursday morning, she confirmed it. She still doesn’t know whether her family’s graves are among the damaged."}, {"d28a": "“The thing that’s most painful, the thing I keep thinking… is, they came to America, they had so much hope,” she said. “And I just keep thinking about the shattered gravestones and the shattered hopes.”"}, {"c5bf": "The rise in anti-Semitic hate crimes, she said, doesn’t change “our day-to-day life” as Jews. “But existentially, it just feels like the ground is less secure than it used to be. And what the future is, it’s more of an open question… If this,” she said, gesturing to the Stand Against Hate attendees milling around behind her, “wins the day, then we’ll be fine. If the other wins the day, then we will not be fine.”"}, {"87fa": "Cemetery desecration is “an attack on the vulnerable,” she said. “We enter into a covenant of good faith with people, that whether or not they’re your people, that you’ll respect them.”"}, {"b110": "“I don’t think it should make a difference that my family is affected, and it does,” she said. “I’ve wept a lot.”"}, {"9626": "The day of the rally, admission was free at the National Museum of American Jewish History, which overlooks Independence Mall. (The museum is also collecting narratives about people interred at Mt. Carmel “to preserve the stories of the people who are buried there.”)"}, {"1fdd": "A class trip of Jewish schoolchildren arrived that morning. A teacher corralled the students, chattering among themselves and wired with field trip energy, around an immigration exhibit. “Is it more important to become an American or uphold your traditions?” She waited for a reply, then decided to answer her own question: “A little bit of both.”"}, {"f836": "The National Museum of American Jewish History bearing a banner added in December 2016 that quotes George Washington’s letter to the Hebrew Congregation of Newport, Rhode Island in 1790. The original letter is displayed inside the museum. CREDIT: NMAJH"}, {"0654": "Their voices echoed up from the entrance to the fourth floor, where an introductory video to the museum explains that the Jews who came to America were “inspired by the promise of freedom. They’ve come from all over the world, dreaming of a better life.”"}, {"bc6a": "For the lion’s share of immigrants and their descendants, that phrase is a familiar one, bordering on cliché. A better life. It is telling that the oft-repeated line is not “they were dreaming of the best life.” No one dreamt of best. Only better."}, {"ccbd": "And it was, and it is. It was better to be a Jew in America in 1654, when the first Jewish refugees came to these shores, than it was in Brazil, the land from which they fled — they’d been given three months to leave by the conquering Portuguese — even though the earliest Jewish residents of New Amsterdam were immediately deemed “hateful enemies” by their new government. What can you do? For Jews, the bar for better is low. Anything short of genocide will do."}, {"36b4": "It is better to be a Jew in America in 2017, where anti-Semitism is rising like smoke, where the bomb threats keep pouring in, where the president suggests the perpetrators of these hate crimes against the Jewish community might actually be Jews themselves, because “sometimes it’s the reverse.” It is still better, here, than almost anywhere else on Earth. For whatever that’s worth."}, {"8e06": "Better is not so much the absence of hateful violence as the presence of resistance to that violence, of collective intolerance for intolerance. Better is exhausting, and better is disappointing, and better is not enough, except for when it is, because it has to be. Better is one neighbor toppling your tombstones in the middle of the night and the rest of your neighbors arriving, by the dawn’s early light, to right them."}], "child": "1118_1\t1118_2\t1118_3\t1118_4\t1118_51118_1\t1118_2\t1118_3\t1118_4\t1118_51118_1\t1118_2\t1118_3\t1118_4\t1118_51118_1\t1118_2\t1118_3\t1118_4\t1118_5"}