{"name": "1119", "parent": "", "content": "Sixth wave of bomb threats strikes Jewish community centers and institutions “It is time for action,” says Anti-Defamation League CEO A sixth wave of bomb threats struck Jewish Community Centers (JCCs) and other Jewish institutions across the country on Tuesday, once again triggering multiple evacuations. News of the surge broke after the Anti-Defamation League tweeted that it had received “multiple” bomb threats at offices in Atlanta, Georgia; Boston, Massachusetts; New York City, New York; and Washington, D.C. Jonathan Greenblatt, CEO of the Anti-Defamation League, offered the following statement to ThinkProgress over Twitter: Several JCCs also reported receiving bomb threats. Locations include centers in Davie, Florida; Milwaukee, Wisconsin; Syracuse, New York; Rockville, Maryland; and Portland, Oregon. At least some of the threats appear to be somewhat different from those of previous waves, as they were reportedly received via email instead of over the phone. The threats come just over a week since the last barrage, and a few days after law enforcement officials apprehended a man allegedly responsible for some of the threats. The suspect, disgraced reporter Juan Thompson, is believed to be a “copycat” culprit who is only connected to 8 of the more than 116 threats made against Jewish centers since January. Meanwhile, other forms of anti-Semitism — such as the desecration of Jewish grave sites — are also on the rise across the country. ThinkProgress chronicled more 70 instances of anti-Jewish hatred between November 9 and February 20 alone, the highest of any group we tracked. Although President Donald Trump declined to respond to numerous requests to condemn the bomb threats throughout February, he eventually decried the hatred on at least two occasions, saying anti-Semitism “will stop.” Jewish groups, however, demanded he do more, and are finally starting to see some action in Washington: The Department of Homeland Security has pledged to help JCCs improve security, and all 100 U.S. senators signed a letter this week asking Trump’s administration to reach out to Jewish institutions “regarding victim assistance, grant opportunities or other federal assistance that may be available to enhance security measures and improve preparedness.” But while bomb threats and other acts of aggression have unsettled many Jewish parents and their children, the attacks are also sparking hopeful moments of solidarity. Faith groups from across the spectrum are banding together to resist the uptick in hatred nationwide. Christian congregations are sending letters of support to JCCs that receive threats, and Islamic groups have raised funds to help repair damaged Jewish cemeteries. Jewish organizations have responded in kind when other faith groups are attacked. The JCC in Rockville, which received bomb threats in January and on Tuesday, recently convened a major interfaith gathering where a diverse group of religious leaders reaffirmed their support for the Jewish community. ", "title": "Sixth wave of bomb threats strikes Jewish community centers and institutions", "sentences": [{"5a3b": "Sixth wave of bomb threats strikes Jewish community centers and institutions"}, {"616b": "“It is time for action,” says Anti-Defamation League CEO"}, {"db45": "A sixth wave of bomb threats struck Jewish Community Centers (JCCs) and other Jewish institutions across the country on Tuesday, once again triggering multiple evacuations."}, {"af63": "News of the surge broke after the Anti-Defamation League tweeted that it had received “multiple” bomb threats at offices in Atlanta, Georgia; Boston, Massachusetts; New York City, New York; and Washington, D.C."}, {"9796": "Jonathan Greenblatt, CEO of the Anti-Defamation League, offered the following statement to ThinkProgress over Twitter:"}, {"7d7f": "Several JCCs also reported receiving bomb threats. Locations include centers in Davie, Florida; Milwaukee, Wisconsin; Syracuse, New York; Rockville, Maryland; and Portland, Oregon."}, {"9ca7": "At least some of the threats appear to be somewhat different from those of previous waves, as they were reportedly received via email instead of over the phone."}, {"cb41": "The threats come just over a week since the last barrage, and a few days after law enforcement officials apprehended a man allegedly responsible for some of the threats. The suspect, disgraced reporter Juan Thompson, is believed to be a “copycat” culprit who is only connected to 8 of the more than 116 threats made against Jewish centers since January."}, {"a09d": "Meanwhile, other forms of anti-Semitism — such as the desecration of Jewish grave sites — are also on the rise across the country. ThinkProgress chronicled more 70 instances of anti-Jewish hatred between November 9 and February 20 alone, the highest of any group we tracked."}, {"a6c7": "Although President Donald Trump declined to respond to numerous requests to condemn the bomb threats throughout February, he eventually decried the hatred on at least two occasions, saying anti-Semitism “will stop.” Jewish groups, however, demanded he do more, and are finally starting to see some action in Washington: The Department of Homeland Security has pledged to help JCCs improve security, and all 100 U.S. senators signed a letter this week asking Trump’s administration to reach out to Jewish institutions “regarding victim assistance, grant opportunities or other federal assistance that may be available to enhance security measures and improve preparedness.”"}, {"5b26": "But while bomb threats and other acts of aggression have unsettled many Jewish parents and their children, the attacks are also sparking hopeful moments of solidarity. Faith groups from across the spectrum are banding together to resist the uptick in hatred nationwide. Christian congregations are sending letters of support to JCCs that receive threats, and Islamic groups have raised funds to help repair damaged Jewish cemeteries. Jewish organizations have responded in kind when other faith groups are attacked."}, {"37df": "The JCC in Rockville, which received bomb threats in January and on Tuesday, recently convened a major interfaith gathering where a diverse group of religious leaders reaffirmed their support for the Jewish community."}], "child": "1119_1\t1119_2"}