{"name": "1120", "parent": "", "content": "UPDATED: Five Jewish tombstones reportedly vandalized in New York City It’s the fourth incident involving damaged Jewish gravestones in the U.S. since February. CREDIT: NY State Assemblyman Dov Hikind/Twitter UPDATE: NYPD investigators have concluded that the tombstones were damaged due to environmental reasons, not vandalism. Officials said the stones were toppled due to neglect and soil erosion, among other reasons. Original story is below. Five tombstones at a historic Jewish cemetery in New York were reported damaged over the weekend, the latest in what appears to be a spate of attacks on Jewish burial grounds as anti-Semitic incidents spike across the country. According to CNN, five granite and marble tombstones at the Washington Cemetery in Brooklyn, New York were toppled or otherwise desecrated Saturday night. An NYPD hate-crime task force is investigating whether the incident was intentional. New York State Assemblyman Dov Hikind tweeted images of damaged gravestones. The incident appears to be the fourth involving toppled Jewish gravestones this year, and the second in New York this week. Vandals in Rochester, Philadelphia, and St. Louis have all knocked over tombstones in Jewish cemeteries since February. Meanwhile, an uptick in anti-Semitism incidents has swept the country this year, with more than 110 bomb threats made against Jewish Community Centers (JCCs), schools, and the offices of the Anti-Defamation league. ThinkProgress tracked 70 instances of anti-Jewish actions between November 9 and February 20 of 2017, the most of any group impacted by the general uptick in hate incidents across the United States. One parent’s story of enduring a bomb threat at a Jewish day school“I wish I could say that I was surprised or shocked, but I was not.”thinkprogress.org The harrowing incidents have unsettled many American Jews, but faith communities are banding together to offer financial and spiritual support in response. The Center for American-Islamic Relations has advertised a reward for information about the perpetrators. Catching the suspects, however, remains difficult. A man who allegedly made several of the bomb threats was arrested last week but is believed to be a “copycat” culprit who is only connected to eight of the incidents. To date, no arrests have been made in any of the cemetery desecrations, which remain under investigation. The attacks have also become a political flashpoint in recent weeks, beginning when President Donald Trump declined to condemn anti-Semitism on three separate occasions in one week. Jewish groups were outraged at the silence, especially since anti-Semitic rhetoric increased during Trump’s 2016 campaign and appears to have worsened since his election. Trump eventually condemned anti-Semitism twice (including his address to Congress), and the Department of Homeland Security has promised to assist JCCs with security concerns. Jewish groups such as the Anti-Defamation League, however, continue to ask the administration to do more. ", "title": "UPDATED: Five Jewish tombstones reportedly vandalized in New York City", "sentences": [{"004a": "UPDATED: Five Jewish tombstones reportedly vandalized in New York City"}, {"0103": "It’s the fourth incident involving damaged Jewish gravestones in the U.S. since February."}, {"3d82": "CREDIT: NY State Assemblyman Dov Hikind/Twitter"}, {"3634": "UPDATE: NYPD investigators have concluded that the tombstones were damaged due to environmental reasons, not vandalism. Officials said the stones were toppled due to neglect and soil erosion, among other reasons."}, {"37d6": "Original story is below."}, {"e5eb": "Five tombstones at a historic Jewish cemetery in New York were reported damaged over the weekend, the latest in what appears to be a spate of attacks on Jewish burial grounds as anti-Semitic incidents spike across the country."}, {"2af4": "According to CNN, five granite and marble tombstones at the Washington Cemetery in Brooklyn, New York were toppled or otherwise desecrated Saturday night. An NYPD hate-crime task force is investigating whether the incident was intentional."}, {"01dd": "New York State Assemblyman Dov Hikind tweeted images of damaged gravestones."}, {"67b1": "The incident appears to be the fourth involving toppled Jewish gravestones this year, and the second in New York this week. Vandals in Rochester, Philadelphia, and St. Louis have all knocked over tombstones in Jewish cemeteries since February."}, {"7bdd": "Meanwhile, an uptick in anti-Semitism incidents has swept the country this year, with more than 110 bomb threats made against Jewish Community Centers (JCCs), schools, and the offices of the Anti-Defamation league. ThinkProgress tracked 70 instances of anti-Jewish actions between November 9 and February 20 of 2017, the most of any group impacted by the general uptick in hate incidents across the United States."}, {"b080": "One parent’s story of enduring a bomb threat at a Jewish day school“I wish I could say that I was surprised or shocked, but I was not.”thinkprogress.org"}, {"a40d": "The harrowing incidents have unsettled many American Jews, but faith communities are banding together to offer financial and spiritual support in response. The Center for American-Islamic Relations has advertised a reward for information about the perpetrators."}, {"8e83": "Catching the suspects, however, remains difficult. A man who allegedly made several of the bomb threats was arrested last week but is believed to be a “copycat” culprit who is only connected to eight of the incidents. To date, no arrests have been made in any of the cemetery desecrations, which remain under investigation."}, {"d539": "The attacks have also become a political flashpoint in recent weeks, beginning when President Donald Trump declined to condemn anti-Semitism on three separate occasions in one week. Jewish groups were outraged at the silence, especially since anti-Semitic rhetoric increased during Trump’s 2016 campaign and appears to have worsened since his election."}, {"4956": "Trump eventually condemned anti-Semitism twice (including his address to Congress), and the Department of Homeland Security has promised to assist JCCs with security concerns. Jewish groups such as the Anti-Defamation League, however, continue to ask the administration to do more."}], "child": "1120_1\t1120_2\t1120_3\t1120_41120_1\t1120_2\t1120_3\t1120_4"}