{"name": "1121", "parent": "", "content": "Man arrested for making JCC bomb threats to intimidate a former love interest Authorities say he is a “copycat” culprit who made threats against JCCs to “settle a personal score.” Federal authorities announced on Friday that they have arrested the man they believe has participated in the rash of bomb threats against Jewish Community Centers (JCCs) across the country since January. According to a statement, law enforcement officials apprehended Juan Thompson this morning on charges of cyberstalking a “former romantic interest” by, among other things, allegedly making bomb threats against JCCs and the Anti-Defamation League in her name. “Threats of violence targeting people and places based on religion or race — whatever the motivation — are unacceptable, un-American, and criminal,” U.S. attorney Preet Bharara said in a press release. According to Bradd Jaffy of NBC, the arrest of Thompson is unlikely to end the onslaught of JCC threats, as Thompson is believed to be a “copycat” culprit who used threats against JCCs to “settle a personal score.” “Thompson’s alleged pattern of harassment not only involved the defamation of his female victim, but his threats intimidated an entire religious community,” FBI Assistant Director William Sweeney said. Based on the Twitter account quoted in the FBI complaint, the suspect appears to be the same Juan Thompson who was fired from the Intercept for fabricating stories. The editor-in-chief of the Intercept, Betsy Reed, told BuzzFeed she believes the Twitter account belongs to the site’s former writer. Violence against women, which takes many forms, has been identified as a precursor to erratic and sometimes violent behavior. As ThinkProgress reported last year, 40 percent of mass shootings between 2009 and 2012 started with a shooter targeting his girlfriend, wife, or ex-wife. In 2015 alone, nearly a third of mass shooting deaths included some element of domestic violence. UPDATE: The Anti-Defamation League has released a statement applauding the arrest, and calling for authorities to resolve other pending cases as well. “We are relieved and gratified that the FBI has made an arrest in these cases. We applaud law enforcement’s unwavering effort to resolve this matter” Jonathan A. Greenblatt, ADL CEO, said. “We look forward to the quick resolution of the remaining open cases.” ", "title": "Man arrested for making JCC bomb threats to intimidate a former love interest", "sentences": [{"ad16": "Man arrested for making JCC bomb threats to intimidate a former love interest"}, {"27d2": "Authorities say he is a “copycat” culprit who made threats against JCCs to “settle a personal score.”"}, {"9101": "Federal authorities announced on Friday that they have arrested the man they believe has participated in the rash of bomb threats against Jewish Community Centers (JCCs) across the country since January."}, {"936c": "According to a statement, law enforcement officials apprehended Juan Thompson this morning on charges of cyberstalking a “former romantic interest” by, among other things, allegedly making bomb threats against JCCs and the Anti-Defamation League in her name."}, {"589b": "“Threats of violence targeting people and places based on religion or race — whatever the motivation — are unacceptable, un-American, and criminal,” U.S. attorney Preet Bharara said in a press release."}, {"2197": "According to Bradd Jaffy of NBC, the arrest of Thompson is unlikely to end the onslaught of JCC threats, as Thompson is believed to be a “copycat” culprit who used threats against JCCs to “settle a personal score.”"}, {"4369": "“Thompson’s alleged pattern of harassment not only involved the defamation of his female victim, but his threats intimidated an entire religious community,” FBI Assistant Director William Sweeney said."}, {"36b7": "Based on the Twitter account quoted in the FBI complaint, the suspect appears to be the same Juan Thompson who was fired from the Intercept for fabricating stories. The editor-in-chief of the Intercept, Betsy Reed, told BuzzFeed she believes the Twitter account belongs to the site’s former writer."}, {"d10a": "Violence against women, which takes many forms, has been identified as a precursor to erratic and sometimes violent behavior. As ThinkProgress reported last year, 40 percent of mass shootings between 2009 and 2012 started with a shooter targeting his girlfriend, wife, or ex-wife. In 2015 alone, nearly a third of mass shooting deaths included some element of domestic violence."}, {"f62b": "UPDATE: The Anti-Defamation League has released a statement applauding the arrest, and calling for authorities to resolve other pending cases as well."}, {"f97b": "“We are relieved and gratified that the FBI has made an arrest in these cases. We applaud law enforcement’s unwavering effort to resolve this matter” Jonathan A. Greenblatt, ADL CEO, said. “We look forward to the quick resolution of the remaining open cases.”"}], "child": "1121_1\t1121_21121_1\t1121_2"}