{"name": "1122", "parent": "", "content": "Bomb threats made against Jewish schools and centers in at least 11 states It’s the fifth wave of anti-Semitic bomb threats this year. A round of bomb threats struck Jewish community centers and schools across the country on Monday, the latest in several waves of anti-Semitic incidents that have surged this year. According to various local news agencies, the threats appear to have impacted Jewish day schools in Miami, Florida; Rockville, Maryland; and Fairfax, Virginia. Jewish community centers in Asheville, North Carolina; York and Harrisburg, Pennsylvania; Staten Island and Tarrytown, New York; Cherry Hill, New Jersey; Ann Arbor, Michigan; Indianapolis, Indiana; Birmingham, Alabama; and Talleyville, Delaware reportedly also received bomb threats. Thus far, no one has been harmed and no bombs have been found. Another Jewish school in Durham, North Carolina, was reportedly evacuated last week after a similar bomb threat. Meanwhile, a Jewish cemetery in Philadelphia was desecrated over the weekend — the second such incident in roughly a week. Monday’s string of hateful phone calls is the fifth major wave of bomb threats against Jewish community centers and schools since January, with several locations receiving more than one. The calls now appear to occur almost weekly, and the culprit has yet to be identified or caught. The effort is part of a general wave of anti-Semitic hatred that increased during the 2016 campaign season and worsened after Donald Trump was elected President. ThinkProgress tracked 70 instances of anti-Jewish hatred between November 9 and February 20, the highest of any marginalized group impacted by the general rise in hate incidents across the country. The uptick received national attention after President Donald Trump declined to condemn anti-Semitism on three separate occasions in one week. Trump finally condemned the attacks the following week, and Vice President Mike Pence visited a damaged Jewish cemetery to deliver a speech condemning anti-Jewish hatred. All three times Trump declined to denounce anti-Semitism this weekThree. Times.thinkprogress.org Several Jewish organizations such as the Anne Frank Center for Mutual Respect, however, do not believe the administration has done enough to quell the rising tide of vitriol. “The President’s sudden acknowledgment is a Band-Aid on the cancer of anti-Semitism that has infected his own administration,” Steven Goldstein, head of the Anne Frank Center, said in a statement. UPDATE: NBC News now reporting at least 20 bomb threats to Jewish Community Centers and day schools in 13 states. This post will be updated with more information. ", "title": "Bomb threats made against Jewish schools and centers in at least 11 states", "sentences": [{"4728": "Bomb threats made against Jewish schools and centers in at least 11 states"}, {"67db": "It’s the fifth wave of anti-Semitic bomb threats this year."}, {"adf3": "A round of bomb threats struck Jewish community centers and schools across the country on Monday, the latest in several waves of anti-Semitic incidents that have surged this year."}, {"5a08": "According to various local news agencies, the threats appear to have impacted Jewish day schools in Miami, Florida; Rockville, Maryland; and Fairfax, Virginia. Jewish community centers in Asheville, North Carolina; York and Harrisburg, Pennsylvania; Staten Island and Tarrytown, New York; Cherry Hill, New Jersey; Ann Arbor, Michigan; Indianapolis, Indiana; Birmingham, Alabama; and Talleyville, Delaware reportedly also received bomb threats."}, {"2cc4": "Thus far, no one has been harmed and no bombs have been found."}, {"2c86": "Another Jewish school in Durham, North Carolina, was reportedly evacuated last week after a similar bomb threat. Meanwhile, a Jewish cemetery in Philadelphia was desecrated over the weekend — the second such incident in roughly a week."}, {"f9c1": "Monday’s string of hateful phone calls is the fifth major wave of bomb threats against Jewish community centers and schools since January, with several locations receiving more than one. The calls now appear to occur almost weekly, and the culprit has yet to be identified or caught."}, {"0355": "The effort is part of a general wave of anti-Semitic hatred that increased during the 2016 campaign season and worsened after Donald Trump was elected President. ThinkProgress tracked 70 instances of anti-Jewish hatred between November 9 and February 20, the highest of any marginalized group impacted by the general rise in hate incidents across the country."}, {"70dc": "The uptick received national attention after President Donald Trump declined to condemn anti-Semitism on three separate occasions in one week. Trump finally condemned the attacks the following week, and Vice President Mike Pence visited a damaged Jewish cemetery to deliver a speech condemning anti-Jewish hatred."}, {"4b95": "All three times Trump declined to denounce anti-Semitism this weekThree. Times.thinkprogress.org"}, {"8c14": "Several Jewish organizations such as the Anne Frank Center for Mutual Respect, however, do not believe the administration has done enough to quell the rising tide of vitriol."}, {"df03": "“The President’s sudden acknowledgment is a Band-Aid on the cancer of anti-Semitism that has infected his own administration,” Steven Goldstein, head of the Anne Frank Center, said in a statement."}, {"86c8": "UPDATE: NBC News now reporting at least 20 bomb threats to Jewish Community Centers and day schools in 13 states."}, {"de5f": "This post will be updated with more information."}], "child": "1122_1\t1122_2\t1122_3\t1122_4\t1122_51122_1\t1122_2\t1122_3\t1122_4\t1122_5"}