{"name": "1124", "parent": "", "content": "ThinkProgress has been tracking hate since Trump’s election. Here’s what we found. It disturbed us. Three months ago, ThinkProgress began tracking the wave of hate incidents — threatening or harassing actions targeted against individuals because of their identities — that swept the country in the immediate aftermath of Donald Trump’s election as President of the United States. Our goal was to investigate the severity of the vitriol, giving readers a heavily scrutinized, researched vision of what hate looks like in the Trump era. What we found disturbed us: Since November 9, 2016, we have tracked 261 hate incidents across the country. Our standard for a hate incident was very specific, and the bar for inclusion on our list was high. We only tracked occurrences targeted against individuals or communities, which means that we did not cite the numerous instances of vague but unmistakably hateful speech scrawled in public places across the country. We also required accounts to be backed up by a news article, a police report, or an original investigation by ThinkProgress. As such, our final list is significantly smaller than the catalogue of instances collected by the Southern Poverty Law Center, which relies largely on first-hand accounts reported directly to the organization. The number, scope, and severity of hate incidents remains staggering. Furthermore, the precise nature of our methodology means our data does not necessarily reflect broader cultural expressions of hate, such as general anti-Muslim sentiment spouted by politicians. Our conclusions require context: For example, while anti-Muslim incidents are one of our smallest categories, they are also by far the smallest population of those listed. In addition, a disproportionate number of anti-Semitic incidents are part of a wave of bomb threats targeted at Jewish Community Centers, almost all of which came in recent weeks—as attacks on other groups began to dip. Yet the number, scope, and severity of hate incidents remains staggering. More populous states tended to have more occurrences—possibly because city dwellers are more likely to report them—but the wave of hate extended deep into the Southeast, Midwest, Northeast, and the American heartland. The incidents themselves run the gamut from disheartening to are chilling: Muslim women report being physically assaulted and told to remove their hijabs on buses and street corners. LGBTQ people allege being harassed and beaten as they walk home. Black churches were reportedly defaced with hateful racial slurs. A man of Guatemalan descent told police he was beaten as his assailants chanted “make America white again!” Trump supporters were also allegedly attacked, and at least three people were killed in what appear to be hate incidents. Tracking the explosion of hate in Trump’s AmericaHate incidents have skyrocketed since Election Day.thinkprogress.org And while Trump has done little to quell the rise in hate, the connection between many of these occurrences and his presidency is clear: 109 (42 percent) of the incidents we tracked over the past three months included specific references to Trump, his election, or his policies. It is also clear that this time period produced noticeable spike in hate crimes, a specific legal category that varies by state. Even without our data, the FBI reported in December that twice as many hate crimes were recorded in New York City after the election than in the same time period in 2015. And despite claims by some that accounts were largely fabricated, only two incidents that made it on to our list were later discovered to be false (they were subsequently removed). ThinkProgress will no longer be tracking these hate incidents in a systemic way, but a group of journalists and hate crime experts led by ProPublica will. We encourage you to follow their efforts. In the meantime, feel free to investigate our map below. ", "title": "ThinkProgress has been tracking hate since Trump’s election. Here’s what we found.", "sentences": [{"9f20": "ThinkProgress has been tracking hate since Trump’s election. Here’s what we found."}, {"0b26": "It disturbed us."}, {"bc13": "Three months ago, ThinkProgress began tracking the wave of hate incidents — threatening or harassing actions targeted against individuals because of their identities — that swept the country in the immediate aftermath of Donald Trump’s election as President of the United States. Our goal was to investigate the severity of the vitriol, giving readers a heavily scrutinized, researched vision of what hate looks like in the Trump era."}, {"d345": "What we found disturbed us: Since November 9, 2016, we have tracked 261 hate incidents across the country."}, {"2d9a": "Our standard for a hate incident was very specific, and the bar for inclusion on our list was high. We only tracked occurrences targeted against individuals or communities, which means that we did not cite the numerous instances of vague but unmistakably hateful speech scrawled in public places across the country. We also required accounts to be backed up by a news article, a police report, or an original investigation by ThinkProgress."}, {"fbff": "As such, our final list is significantly smaller than the catalogue of instances collected by the Southern Poverty Law Center, which relies largely on first-hand accounts reported directly to the organization."}, {"04b2": "The number, scope, and severity of hate incidents remains staggering."}, {"bf64": "Furthermore, the precise nature of our methodology means our data does not necessarily reflect broader cultural expressions of hate, such as general anti-Muslim sentiment spouted by politicians. Our conclusions require context: For example, while anti-Muslim incidents are one of our smallest categories, they are also by far the smallest population of those listed. In addition, a disproportionate number of anti-Semitic incidents are part of a wave of bomb threats targeted at Jewish Community Centers, almost all of which came in recent weeks—as attacks on other groups began to dip."}, {"0ca9": "Yet the number, scope, and severity of hate incidents remains staggering."}, {"2f32": "More populous states tended to have more occurrences—possibly because city dwellers are more likely to report them—but the wave of hate extended deep into the Southeast, Midwest, Northeast, and the American heartland. The incidents themselves run the gamut from disheartening to are chilling: Muslim women report being physically assaulted and told to remove their hijabs on buses and street corners. LGBTQ people allege being harassed and beaten as they walk home. Black churches were reportedly defaced with hateful racial slurs. A man of Guatemalan descent told police he was beaten as his assailants chanted “make America white again!” Trump supporters were also allegedly attacked, and at least three people were killed in what appear to be hate incidents."}, {"3c9d": "Tracking the explosion of hate in Trump’s AmericaHate incidents have skyrocketed since Election Day.thinkprogress.org"}, {"ae26": "And while Trump has done little to quell the rise in hate, the connection between many of these occurrences and his presidency is clear: 109 (42 percent) of the incidents we tracked over the past three months included specific references to Trump, his election, or his policies."}, {"b942": "It is also clear that this time period produced noticeable spike in hate crimes, a specific legal category that varies by state. Even without our data, the FBI reported in December that twice as many hate crimes were recorded in New York City after the election than in the same time period in 2015. And despite claims by some that accounts were largely fabricated, only two incidents that made it on to our list were later discovered to be false (they were subsequently removed)."}, {"8c8a": "ThinkProgress will no longer be tracking these hate incidents in a systemic way, but a group of journalists and hate crime experts led by ProPublica will. We encourage you to follow their efforts."}, {"2059": "In the meantime, feel free to investigate our map below."}], "child": "1124_1\t1124_2\t1124_3\t1124_4\t1124_5\t1124_6\t1124_7\t1124_8\t1124_9\t1124_10\t1124_11\t1124_12"}