{"name": "1125", "parent": "", "content": "All three times Trump declined to denounce anti-Semitism this week Three. Times. On three separate occasions this week, President Donald Trump was given an opportunity by a reporter to denounce anti-Semitism. All three times, he declined. Since ThinkProgress began tracking hate-incidents after Trump’s election, we have recorded 70 instances of anti-Semitic hatred. This includes synagogues being desecrated by vandals, swastikas being scrawled onto Jewish seminaries, and 48 Jewish Community Centers in 27 states receiving bomb threats. Although the uptick in hate is impacting multiple communities, our analysis found that the largest percentage of hate instances are anti-Semitic, with anti-Jewish vitriol surging in recent weeks—some of them invoking Trump’s name or slogans. ThinkProgress has been tracking hate since Trump’s election. Here’s what we found.It disturbed us.thinkprogress.org According to the Anti-Defamation League (ADL), the level of anti-Semitism in public and political discourse is the worst it’s been since the 1930s. Yet Trump appeared to dismiss the growing issue during a press conference with Israeli Prime Minister Benjamin Netanyahu on Wednesday. When an Israeli reporter rose to ask about the “sharp rise” in “anti-Semitic incidences across the United States,” Trump responded by championing his Electoral College victory. When an Israeli reporter rose to ask about the “sharp rise” in “anti-semitic incidences across the United States,” Trump responded by championing his Electoral College victory. “Well, I just want to say that we are, you know, very honored by the victory that we had,” he said, turning to Netanyahu. “306 electoral college votes. We were not supposed to crack 220. You know that, right?” Trump then deflected the reporter’s comment that his administration may be “playing with racist tones” by citing his Jewish friends and family members. “As far as people, Jewish people, so many friends, a daughter who happens to be here right now,” Trump said. “A son-in-law. And three beautiful grandchildren. I think that you are going to see a lot different united States of America over the next three, four, or eight years. I think a lot of good things are happening. You’re going to see a lot of love. You’re going to see a lot of love. Okay?” At no time did Trump condemn or even directly address the surge in anti-Semitic incidents during his campaign or since his election. Netanyahu appeared to defend Trump after the question, but Israeli media characterized the president’s answer as a “sidestep.” Trump was given another opportunity to speak to the same issue the very next day at another press conference. After demanding to hear from a “friendly reporter,” he pointed to Jake Turx of the Orthodox Jewish weekly Ami Magazine. Turx, wearing a traditional Jewish kippa, began his question by dismissing claims that Trump or anyone on his staff was anti-Semitic. But when he pivoted to a question about the rise in anti-Semitic attacks, things took a turn. “What we are concerned about and what we haven’t heard you address is the uptick in anti-Semitism and how the government is trying to take care of it,” he said. “There is a report out that 48 bomb threats have been made against Jewish centers all across the country in the last couple of weeks, and there are people committing acts or threatening to—” Trump promptly cut Turx off, telling the journalist to “sit down” and describing his inquiry as “not a fair question.” The president then began defending himself against accusations of anti-Semitism—something Turx had already addressed. “Number one, I am the least anti-Semitic person you’ve ever seen in your entire life,” Trump said. “Number two, racism, the least racist person. In fact, we did really well relative to other people running as a Republican.” When Turx attempted to interject that he was only referring to the rise in hate incidents and not Trump himself, the president silenced him. “Quiet, quiet, quiet,” he said, gesticulating at Turx. “He lied that he was going to get up and ask a straight, simple question, so, you know, welcome to the world of the media.” Trump concluded by referencing Netanyahu’s support for him, and deriding Turx’s inquiry a “very insulting question.” Later in the same press conference, another reporter attempted—for a third time—to push Trump to answer the same question. “I’d just like to follow-up on my colleague’s question about anti-Semitism,” he began. “It’s not about your personality or your beliefs, we’re talking about a rising anti-Semitism around the country, some by supporters in your name—” But Trump once again cut off the reporter, claiming—without evidence—that some hate incidents committed by Trump supporters were actually committed by his opponents. “Can I be honest with you?” Trump said. “This has to do with racism and horrible things that are put up. Some of it [is] written by our opponents. You do know that. Do you understand that?” “Some of the signs you see are not put up by the people that love or like Donald Trump, they’re put up by the other side,” he added. Trump provided no proof to back his claim. But there is evidence to support concern over anti-Semitism inspired by his political career: His candidacy and presidency have been endorsed by prominent anti-Semites such as Richard Spencer and former KKK Grand Wizard David Duke. Jewish groups were quick to express outrage over Trump’s repeated refusal to answer simple questions about anti-Semitism. “It is honestly mind-boggling why President Trump prefers to shout down a reporter or brush this off as a political distraction,” Jonathan Greenblatt, the ADL’s national director, said in a statement. American Jewish Committee CEO David Harris was similarly frustrated by the president’s non-response. “Instead of answering a timely and legitimate question, the president chose instead to besmirch the reporter,” Harris wrote. “Respectfully, Mr. President, please use your bully pulpit not to bully reporters asking questions potentially affecting millions of Americans, but rather to help solve a problem that, for many, is real and menacing.” Despite the outcry, recent history suggests it is difficult to push Trump to speak out forcefully against anti-Semitism. People claiming to support Trump harassed Jewish reporters throughout his campaign—including here at ThinkProgress—sometimes even sending death threats to those who wrote pieces critical of him or his family. Trump supporters were also recorded shouting, “Go to fucking Auschwitz!” as they left his rallies, and his own speech to Republican Jews was decried as riddled with Jewish stereotypes. When Trump was asked by CNN’s Wolf Blitzer to comment on his anti-Semitic supporters the campaign, however, he said he didn’t know enough to comment. “You’ll have to talk to them about it,” he said. ", "title": "All three times Trump declined to denounce anti-Semitism this week", "sentences": [{"1bbd": "All three times Trump declined to denounce anti-Semitism this week"}, {"8d5c": "Three. Times."}, {"aa1d": "On three separate occasions this week, President Donald Trump was given an opportunity by a reporter to denounce anti-Semitism."}, {"7fd8": "All three times, he declined."}, {"2fa9": "Since ThinkProgress began tracking hate-incidents after Trump’s election, we have recorded 70 instances of anti-Semitic hatred. This includes synagogues being desecrated by vandals, swastikas being scrawled onto Jewish seminaries, and 48 Jewish Community Centers in 27 states receiving bomb threats. Although the uptick in hate is impacting multiple communities, our analysis found that the largest percentage of hate instances are anti-Semitic, with anti-Jewish vitriol surging in recent weeks—some of them invoking Trump’s name or slogans."}, {"c50a": "ThinkProgress has been tracking hate since Trump’s election. Here’s what we found.It disturbed us.thinkprogress.org"}, {"39e5": "According to the Anti-Defamation League (ADL), the level of anti-Semitism in public and political discourse is the worst it’s been since the 1930s."}, {"86f7": "Yet Trump appeared to dismiss the growing issue during a press conference with Israeli Prime Minister Benjamin Netanyahu on Wednesday. When an Israeli reporter rose to ask about the “sharp rise” in “anti-Semitic incidences across the United States,” Trump responded by championing his Electoral College victory."}, {"39a0": "When an Israeli reporter rose to ask about the “sharp rise” in “anti-semitic incidences across the United States,” Trump responded by championing his Electoral College victory."}, {"85a4": "“Well, I just want to say that we are, you know, very honored by the victory that we had,” he said, turning to Netanyahu. “306 electoral college votes. We were not supposed to crack 220. You know that, right?”"}, {"9e20": "Trump then deflected the reporter’s comment that his administration may be “playing with racist tones” by citing his Jewish friends and family members."}, {"64d8": "“As far as people, Jewish people, so many friends, a daughter who happens to be here right now,” Trump said. “A son-in-law. And three beautiful grandchildren. I think that you are going to see a lot different united States of America over the next three, four, or eight years. I think a lot of good things are happening. You’re going to see a lot of love. You’re going to see a lot of love. Okay?”"}, {"ad21": "At no time did Trump condemn or even directly address the surge in anti-Semitic incidents during his campaign or since his election. Netanyahu appeared to defend Trump after the question, but Israeli media characterized the president’s answer as a “sidestep.”"}, {"a75c": "Trump was given another opportunity to speak to the same issue the very next day at another press conference. After demanding to hear from a “friendly reporter,” he pointed to Jake Turx of the Orthodox Jewish weekly Ami Magazine. Turx, wearing a traditional Jewish kippa, began his question by dismissing claims that Trump or anyone on his staff was anti-Semitic."}, {"2230": "But when he pivoted to a question about the rise in anti-Semitic attacks, things took a turn."}, {"3f45": "“What we are concerned about and what we haven’t heard you address is the uptick in anti-Semitism and how the government is trying to take care of it,” he said. “There is a report out that 48 bomb threats have been made against Jewish centers all across the country in the last couple of weeks, and there are people committing acts or threatening to—”"}, {"6354": "Trump promptly cut Turx off, telling the journalist to “sit down” and describing his inquiry as “not a fair question.” The president then began defending himself against accusations of anti-Semitism—something Turx had already addressed."}, {"baa6": "“Number one, I am the least anti-Semitic person you’ve ever seen in your entire life,” Trump said. “Number two, racism, the least racist person. In fact, we did really well relative to other people running as a Republican.”"}, {"6c7a": "When Turx attempted to interject that he was only referring to the rise in hate incidents and not Trump himself, the president silenced him."}, {"0408": "“Quiet, quiet, quiet,” he said, gesticulating at Turx. “He lied that he was going to get up and ask a straight, simple question, so, you know, welcome to the world of the media.”"}, {"5fb0": "Trump concluded by referencing Netanyahu’s support for him, and deriding Turx’s inquiry a “very insulting question.”"}, {"afd4": "Later in the same press conference, another reporter attempted—for a third time—to push Trump to answer the same question."}, {"eca9": "“I’d just like to follow-up on my colleague’s question about anti-Semitism,” he began. “It’s not about your personality or your beliefs, we’re talking about a rising anti-Semitism around the country, some by supporters in your name—”"}, {"c45e": "But Trump once again cut off the reporter, claiming—without evidence—that some hate incidents committed by Trump supporters were actually committed by his opponents."}, {"6e02": "“Can I be honest with you?” Trump said. “This has to do with racism and horrible things that are put up. Some of it [is] written by our opponents. You do know that. Do you understand that?”"}, {"09e7": "“Some of the signs you see are not put up by the people that love or like Donald Trump, they’re put up by the other side,” he added."}, {"f86b": "Trump provided no proof to back his claim. But there is evidence to support concern over anti-Semitism inspired by his political career: His candidacy and presidency have been endorsed by prominent anti-Semites such as Richard Spencer and former KKK Grand Wizard David Duke."}, {"003c": "Jewish groups were quick to express outrage over Trump’s repeated refusal to answer simple questions about anti-Semitism."}, {"6563": "“It is honestly mind-boggling why President Trump prefers to shout down a reporter or brush this off as a political distraction,” Jonathan Greenblatt, the ADL’s national director, said in a statement."}, {"b14d": "American Jewish Committee CEO David Harris was similarly frustrated by the president’s non-response."}, {"e194": "“Instead of answering a timely and legitimate question, the president chose instead to besmirch the reporter,” Harris wrote. “Respectfully, Mr. President, please use your bully pulpit not to bully reporters asking questions potentially affecting millions of Americans, but rather to help solve a problem that, for many, is real and menacing.”"}, {"f89f": "Despite the outcry, recent history suggests it is difficult to push Trump to speak out forcefully against anti-Semitism. People claiming to support Trump harassed Jewish reporters throughout his campaign—including here at ThinkProgress—sometimes even sending death threats to those who wrote pieces critical of him or his family. Trump supporters were also recorded shouting, “Go to fucking Auschwitz!” as they left his rallies, and his own speech to Republican Jews was decried as riddled with Jewish stereotypes."}, {"d5fc": "When Trump was asked by CNN’s Wolf Blitzer to comment on his anti-Semitic supporters the campaign, however, he said he didn’t know enough to comment. “You’ll have to talk to them about it,” he said."}], "child": "1125_1\t1125_2\t1125_3\t1125_4\t1125_5\t1125_6\t1125_7\t1125_8\t1125_9\t1125_10\t1125_11\t1125_12\t1125_13"}