{"name": "1126", "parent": "", "content": "‘Trump is setting us free:’ White supremacists celebrate reports that Trump will dial down scrutiny “This is absolutely a signal of favor to us.” By Laurel Raymond and Alan Pyke Online neo-Nazi and white supremacist forums have been unmistakably jubilant lately, as web chatter moved from celebrating President Donald Trump’s electoral victory to celebrating individual cabinet appointments and policy proposals. On Thursday, internet racists celebrated another perceived victory: Reports that President Trump will soon remove white nationalist groups from a federal effort to study and neutralize extremist radicalization, and rebrand the program to focus solely on groups associating themselves with Islam. “Yes, this is real life. Our memes are all real life. Donald Trump is setting us free.” The Countering Violent Extremism (CVE) program partners government agencies with community organizations in hopes of preventing people from being radicalized into various types of terror and hate groups. Its primary focus has always been in Muslim communities, but the Obama administration designed it to also encompass the American far-right groups that propagandize to people like Dylann Roof. News of Trump’s plan to reverse that symbolic recognition of right-wing threats prompted a wave of celebration in white nationalist circles. “Donald Trump wants to remove us from undue federal scrutiny by removing ‘white supremacists’ from the definition of ‘extremism,’” the founder and editor of the neo-Nazi website The Daily Stormer (which takes its name from a Nazi propaganda publication) wrote in a post on the site. “Yes, this is real life. Our memes are all real life. Donald Trump is setting us free.” This interpretation overstates the scope of Reuter’s report somewhat. The meme-filled Daily Stormer post alleges that changing the CVE program and renaming it to focus solely on “Islamic extremism,” as Trump puts it, would also extend to to calling off FBI scrutiny and taking white supremacists and neo-Nazis off of extremist databases. That would actually require separate action from Trump. CREDIT: Screenshot But in Trump’s move to take even some measure of scrutiny off of far-right extremism, The Daily Stormer sees a direct parroting of their own writing and a reward for the far-right’s role in getting Trump elected. “It’s fair to say that if the Trump team is not listening to us directly (I assume they are), they are thinking along very similar lines. We helped get Trump get [sic] elected, and the fact of the matter is, without Alt-Right meme magick, it simply wouldn’t have happened,” the post continues. “This is absolutely a signal of favor to us.” Another neo-Nazi site that associates itself with the so-called “alt-right,” Infostormer, celebrated the news and took it as a sign of support. “We may truly have underestimated President Trump’s covert support of our Cause (at least in some form), but after this proposal, I am fully ready to offer myself in service of this glorious regime” the post reads. This celebratory coverage of the news spread widely through white nationalist forums and chat rooms. CREDIT: Screenshot Commenters at Stormfront rejoiced. “Amazing my government no longer targets me as an enemy,” wrote one. “It’s now officially understood at the the highest levels that we are soooo much better than the kidnapper terrorist pedophile left,” wrote another. On the messaging service Gab, which has become a favorite of white nationalists after Twitter started closing some high-profile accounts for hate speech, users gleefully posted links to the Infowars coverage of the news, mainstream news coverage, and the Daily Stormer article, often tagging the posts #MAGA and editorializing their celebration of the news. CREDIT: Screenshot, Gab Trump’s presidency has been met with widespread celebration by white supremacist groups, many of which recognized Trump’s “America first” rhetoric as their own. Civil liberties organizations and libertarian observers have long criticized the CVE program as a counterproductive whitewash of government surveillance of Muslim communities. A former official with the program told CNN that in practice, the controversial program has always focused on Muslim communities, and thus that Trump’s most substantial proposed change is the renaming of the program. According to Reuters, Trump would rechristen it the “Countering Islamic Extremism” or the “Countering Radical Islamic Extremism” program. Much of the white supremacist celebration seems to revolve around the proposed name change alone. Credit: Screenshot, Gab Only one organization has thus far won a CVE grant for work focused on hate group de-radicalization. Life After Hate, founded in 2009 and run by a small staff of men and women who were once part of skinhead, Aryan, and other violent extremist organizations, has yet to receive the grant it was awarded last summer. Life After Hate co-founder Christian Picciolini called Trump’s reported plan “extremely troubling,” citing the signal it sends to hate groups. “It sends a message that white extremism does not exist, or is not a priority in our country, when in fact it is a statistically larger and more present terror threat than any by foreign or other domestic actors,” LAH’s Christian Picciolini told ThinkProgress. “We have hundreds of thousands of homegrown sovereign citizens and militia members with ties to white nationalism training in paramilitary camps across the U.S. and standing armed in front of mosques to intimidate marginalized Americans.” “It sends a message that white extremism does not exist.” With the proposed change, Picciolini worries Trump could even end up increasing the likehood of violence within our borders if he does alter the program to ignore white supremacists, militia groups, and so-called “sovereign citizens.” Since 9/11, attacks from right-wing organizations have killed far more Americans than groups claiming to be Islamic, according to data from the Southern Poverty Law Center. The move “could bolster and legitimize violent white extremism while also potentially serving to radicalize disaffected fringe elements within Muslim communities,” he said. “This decision, if true, would severely harm or destroy any community-led efforts to helping people disengage from violent extremism and potentially stop future terrorist acts.” ", "title": "‘Trump is setting us free:’ White supremacists celebrate reports that Trump will dial down scrutiny", "sentences": [{"da35": "‘Trump is setting us free:’ White supremacists celebrate reports that Trump will dial down scrutiny"}, {"e475": "“This is absolutely a signal of favor to us.”"}, {"0db7": "By Laurel Raymond and Alan Pyke"}, {"3759": "Online neo-Nazi and white supremacist forums have been unmistakably jubilant lately, as web chatter moved from celebrating President Donald Trump’s electoral victory to celebrating individual cabinet appointments and policy proposals."}, {"f049": "On Thursday, internet racists celebrated another perceived victory: Reports that President Trump will soon remove white nationalist groups from a federal effort to study and neutralize extremist radicalization, and rebrand the program to focus solely on groups associating themselves with Islam."}, {"3fd4": "“Yes, this is real life. Our memes are all real life. Donald Trump is setting us free.”"}, {"e2d9": "The Countering Violent Extremism (CVE) program partners government agencies with community organizations in hopes of preventing people from being radicalized into various types of terror and hate groups. Its primary focus has always been in Muslim communities, but the Obama administration designed it to also encompass the American far-right groups that propagandize to people like Dylann Roof."}, {"6f0e": "News of Trump’s plan to reverse that symbolic recognition of right-wing threats prompted a wave of celebration in white nationalist circles."}, {"a72b": "“Donald Trump wants to remove us from undue federal scrutiny by removing ‘white supremacists’ from the definition of ‘extremism,’” the founder and editor of the neo-Nazi website The Daily Stormer (which takes its name from a Nazi propaganda publication) wrote in a post on the site. “Yes, this is real life. Our memes are all real life. Donald Trump is setting us free.”"}, {"eb57": "This interpretation overstates the scope of Reuter’s report somewhat. The meme-filled Daily Stormer post alleges that changing the CVE program and renaming it to focus solely on “Islamic extremism,” as Trump puts it, would also extend to to calling off FBI scrutiny and taking white supremacists and neo-Nazis off of extremist databases. That would actually require separate action from Trump."}, {"d6ac": "CREDIT: Screenshot"}, {"d2e7": "But in Trump’s move to take even some measure of scrutiny off of far-right extremism, The Daily Stormer sees a direct parroting of their own writing and a reward for the far-right’s role in getting Trump elected."}, {"e622": "“It’s fair to say that if the Trump team is not listening to us directly (I assume they are), they are thinking along very similar lines. We helped get Trump get [sic] elected, and the fact of the matter is, without Alt-Right meme magick, it simply wouldn’t have happened,” the post continues. “This is absolutely a signal of favor to us.”"}, {"19ff": "Another neo-Nazi site that associates itself with the so-called “alt-right,” Infostormer, celebrated the news and took it as a sign of support. “We may truly have underestimated President Trump’s covert support of our Cause (at least in some form), but after this proposal, I am fully ready to offer myself in service of this glorious regime” the post reads."}, {"7dc1": "This celebratory coverage of the news spread widely through white nationalist forums and chat rooms."}, {"c256": "CREDIT: Screenshot"}, {"fe4f": "Commenters at Stormfront rejoiced."}, {"d833": "“Amazing my government no longer targets me as an enemy,” wrote one. “It’s now officially understood at the the highest levels that we are soooo much better than the kidnapper terrorist pedophile left,” wrote another."}, {"d1fd": "On the messaging service Gab, which has become a favorite of white nationalists after Twitter started closing some high-profile accounts for hate speech, users gleefully posted links to the Infowars coverage of the news, mainstream news coverage, and the Daily Stormer article, often tagging the posts #MAGA and editorializing their celebration of the news."}, {"9e8b": "CREDIT: Screenshot, Gab"}, {"03b4": "Trump’s presidency has been met with widespread celebration by white supremacist groups, many of which recognized Trump’s “America first” rhetoric as their own."}, {"26b8": "Civil liberties organizations and libertarian observers have long criticized the CVE program as a counterproductive whitewash of government surveillance of Muslim communities. A former official with the program told CNN that in practice, the controversial program has always focused on Muslim communities, and thus that Trump’s most substantial proposed change is the renaming of the program. According to Reuters, Trump would rechristen it the “Countering Islamic Extremism” or the “Countering Radical Islamic Extremism” program."}, {"8c8b": "Much of the white supremacist celebration seems to revolve around the proposed name change alone."}, {"0e07": "Credit: Screenshot, Gab"}, {"77b0": "Only one organization has thus far won a CVE grant for work focused on hate group de-radicalization. Life After Hate, founded in 2009 and run by a small staff of men and women who were once part of skinhead, Aryan, and other violent extremist organizations, has yet to receive the grant it was awarded last summer."}, {"e391": "Life After Hate co-founder Christian Picciolini called Trump’s reported plan “extremely troubling,” citing the signal it sends to hate groups."}, {"c123": "“It sends a message that white extremism does not exist, or is not a priority in our country, when in fact it is a statistically larger and more present terror threat than any by foreign or other domestic actors,” LAH’s Christian Picciolini told ThinkProgress. “We have hundreds of thousands of homegrown sovereign citizens and militia members with ties to white nationalism training in paramilitary camps across the U.S. and standing armed in front of mosques to intimidate marginalized Americans.”"}, {"0db9": "“It sends a message that white extremism does not exist.”"}, {"1987": "With the proposed change, Picciolini worries Trump could even end up increasing the likehood of violence within our borders if he does alter the program to ignore white supremacists, militia groups, and so-called “sovereign citizens.” Since 9/11, attacks from right-wing organizations have killed far more Americans than groups claiming to be Islamic, according to data from the Southern Poverty Law Center."}, {"c214": "The move “could bolster and legitimize violent white extremism while also potentially serving to radicalize disaffected fringe elements within Muslim communities,” he said."}, {"d1c0": "“This decision, if true, would severely harm or destroy any community-led efforts to helping people disengage from violent extremism and potentially stop future terrorist acts.”"}], "child": "1126_1\t1126_2\t1126_3\t1126_4\t1126_5\t1126_6\t1126_7\t1126_8\t1126_9\t1126_10\t1126_11\t1126_12\t1126_13\t1126_14\t1126_15\t1126_16\t1126_17\t1126_18\t1126_19\t1126_20\t1126_21\t1126_22\t1126_23\t1126_24\t1126_25"}