{"name": "1127", "parent": "", "content": "Donald Trump is demanding the names of federal employees working to curb violent extremism Stop me if you’ve heard this before. Donald Trump likes lists. Credit: AP Photo Officials from Donald Trump’s transition team submitted requests to at least two cabinet departments demanding they hand over the names of any government employees who are working on programs that seek to combat the rise of violent extremism, according to a report from Reuters. The news wire obtained a copy of an email sent from members of Trump’s transition team to the State Department, asking for the identities of anyone working on anti-extremism programs. “Please indicate names of people serving in those roles and status (political or career),” the email says. While the State Department deals largely with threats posed by foreign extremists and international terrorist organizations like ISIS, a similar request was made of the Department of Homeland Security. In addition to their work on international terrorism, DHS focuses on domestic threats as well, including the rise of right-wing extremism. A 2012 report from DHS outlined the growing threat of so-called “sovereign citizen extremists,” pockets of far-right activists who reject, sometimes violently, the authority of government. One notable example is the Bundy family, who confronted federal workers in Nevada with a small militia in 2014 and then staged an armed insurrection on federal land in Oregon a year later. Rather than strongly disavowing the occupation, the Trump campaign actively sought their vote. Cliven Bundy, the family elder, endorsed Trump. The request made by Trump’s transition team bears striking resemblance to a similar request filed with the Department of Energy earlier this month. In that case, the incoming administration was seeking the names of employees doing any work related to climate change, which Donald Trump has repeatedly dismissed as a Chinese hoax. In response, the Department of Energy politely rejected the request, instead urging climate scientists to grab as much data as they could in the event Trump instructs the department to abandon all climate research. It’s less clear what the response will be from the State Department or DHS. One senior-level official from the State Department told Reuters that “I know of no requests that have been denied,” though the official wouldn’t comment about this latest request specifically. ", "title": "Donald Trump is demanding the names of federal employees working to curb violent extremism", "sentences": [{"5989": "Donald Trump is demanding the names of federal employees working to curb violent extremism"}, {"6174": "Stop me if you’ve heard this before."}, {"129c": "Donald Trump likes lists. Credit: AP Photo"}, {"c6c9": "Officials from Donald Trump’s transition team submitted requests to at least two cabinet departments demanding they hand over the names of any government employees who are working on programs that seek to combat the rise of violent extremism, according to a report from Reuters."}, {"94d8": "The news wire obtained a copy of an email sent from members of Trump’s transition team to the State Department, asking for the identities of anyone working on anti-extremism programs. “Please indicate names of people serving in those roles and status (political or career),” the email says."}, {"7175": "While the State Department deals largely with threats posed by foreign extremists and international terrorist organizations like ISIS, a similar request was made of the Department of Homeland Security. In addition to their work on international terrorism, DHS focuses on domestic threats as well, including the rise of right-wing extremism. A 2012 report from DHS outlined the growing threat of so-called “sovereign citizen extremists,” pockets of far-right activists who reject, sometimes violently, the authority of government."}, {"2d1c": "One notable example is the Bundy family, who confronted federal workers in Nevada with a small militia in 2014 and then staged an armed insurrection on federal land in Oregon a year later. Rather than strongly disavowing the occupation, the Trump campaign actively sought their vote. Cliven Bundy, the family elder, endorsed Trump."}, {"ba85": "The request made by Trump’s transition team bears striking resemblance to a similar request filed with the Department of Energy earlier this month. In that case, the incoming administration was seeking the names of employees doing any work related to climate change, which Donald Trump has repeatedly dismissed as a Chinese hoax. In response, the Department of Energy politely rejected the request, instead urging climate scientists to grab as much data as they could in the event Trump instructs the department to abandon all climate research."}, {"ac68": "It’s less clear what the response will be from the State Department or DHS. One senior-level official from the State Department told Reuters that “I know of no requests that have been denied,” though the official wouldn’t comment about this latest request specifically."}], "child": "1127_1\t1127_2\t1127_3\t1127_4\t1127_5\t1127_6\t1127_7\t1127_8\t1127_9\t1127_10\t1127_11\t1127_12\t1127_13\t1127_14\t1127_15\t1127_16\t1127_17\t1127_18\t1127_19\t1127_20\t1127_21\t1127_22\t1127_23"}