{"name": "1128", "parent": "", "content": "Trump’s response to racist shooting in Kansas: silence The gun violence Trump won’t talk about. On Wednesday night, at a bar in Olathe, Kansas, a man named Adam Purinton allegedly told two men he thought were Middle Eastern to “get out of my country” before shooting both of them, one fatally. He also allegedly shot and injured a white bystander who intervened in the situation. Purinton was arrested five hours later in Missouri after he told a bartender “that he needed a place to hide out because he had just killed two Middle Eastern men,” the Kansas City Star reports. (The men are actually of Indian descent and worked on an engineering team for Garmin.) The racially motivated violence in Kansas comes amid an explosion of hate incidents since the election. But instead of commenting on the Kansas shooting in any way or denouncing hate, Trump on Thursday tweeted this: Trump has established a pattern of trying to capitalize on incidents that reinforce his Islamophobia and fear-mongering about “inner cities,” while ignoring violence perpetrated by white supremacists. He has still not publicly denounced a January 29 mass shooting at a mosque in Quebec City that left six dead and was reportedly perpetrated by a white nationalist, anti-immigrant fan of his. Instead, days later, he tweeted about an attack in Paris that left one person with minor injuries. Research indicates a person in America is far more likely to be killed by a right-wing extremist or white supremacist — like the one who allegedly opened fire on Wednesday night in Kansas — than a Muslim terrorist. But three days after the Quebec City mosque shooting, news broke that the Trump administration wants a federal counter-terrorism program to stop focusing on violent white supremacists and any other extremist groups not comprised of Muslims. Earlier this month, the Trump administration released a list of 78 terror attacks it doesn’t think received adequate media coverage. None of them were perpetrated by white supremacists, Islamophobes, or right-wing extremists. Considering the wave of hate correlated with Trump’s political ascendency and the president’s total silence about incidents that can’t be spun to support his agenda, one could argue that violence directed against the Indian men in Kansas should be on the list. UPDATE: On Friday night, Sushma Swaraj, minister of foreign affairs for India, responded to the shooting: The Trump administration still hasn’t commented. ", "title": "Trump’s response to racist shooting in Kansas: silence", "sentences": [{"dc56": "Trump’s response to racist shooting in Kansas: silence"}, {"0348": "The gun violence Trump won’t talk about."}, {"f771": "On Wednesday night, at a bar in Olathe, Kansas, a man named Adam Purinton allegedly told two men he thought were Middle Eastern to “get out of my country” before shooting both of them, one fatally. He also allegedly shot and injured a white bystander who intervened in the situation."}, {"9fbb": "Purinton was arrested five hours later in Missouri after he told a bartender “that he needed a place to hide out because he had just killed two Middle Eastern men,” the Kansas City Star reports. (The men are actually of Indian descent and worked on an engineering team for Garmin.)"}, {"eddf": "The racially motivated violence in Kansas comes amid an explosion of hate incidents since the election. But instead of commenting on the Kansas shooting in any way or denouncing hate, Trump on Thursday tweeted this:"}, {"2997": "Trump has established a pattern of trying to capitalize on incidents that reinforce his Islamophobia and fear-mongering about “inner cities,” while ignoring violence perpetrated by white supremacists. He has still not publicly denounced a January 29 mass shooting at a mosque in Quebec City that left six dead and was reportedly perpetrated by a white nationalist, anti-immigrant fan of his. Instead, days later, he tweeted about an attack in Paris that left one person with minor injuries."}, {"c89c": "Research indicates a person in America is far more likely to be killed by a right-wing extremist or white supremacist — like the one who allegedly opened fire on Wednesday night in Kansas — than a Muslim terrorist. But three days after the Quebec City mosque shooting, news broke that the Trump administration wants a federal counter-terrorism program to stop focusing on violent white supremacists and any other extremist groups not comprised of Muslims."}, {"96d1": "Earlier this month, the Trump administration released a list of 78 terror attacks it doesn’t think received adequate media coverage. None of them were perpetrated by white supremacists, Islamophobes, or right-wing extremists. Considering the wave of hate correlated with Trump’s political ascendency and the president’s total silence about incidents that can’t be spun to support his agenda, one could argue that violence directed against the Indian men in Kansas should be on the list."}, {"ba8c": "UPDATE: On Friday night, Sushma Swaraj, minister of foreign affairs for India, responded to the shooting:"}, {"54c3": "The Trump administration still hasn’t commented."}], "child": "1128_1\t1128_2\t1128_3\t1128_4\t1128_5\t1128_6\t1128_7\t1128_8\t1128_9\t1128_10\t1128_11\t1128_12\t1128_13\t1128_14\t1128_15\t1128_16\t1128_17\t1128_18\t1128_19\t1128_20\t1128_21\t1128_22\t1128_231128_1\t1128_2\t1128_3\t1128_4\t1128_5\t1128_6\t1128_7\t1128_8\t1128_9\t1128_10\t1128_11\t1128_12\t1128_13\t1128_14\t1128_15\t1128_16\t1128_17\t1128_18\t1128_19\t1128_20\t1128_21\t1128_22\t1128_23"}