{"name": "1129", "parent": "", "content": "Hate crimes in New York City have skyrocketed this year And Jews are increasingly the ones being targeted. The largest Jewish community outside of Israel has seen a huge spike in anti-Semitic attacks. Credit: AP Images Except for Tel Aviv in Israel, New York City is home to the largest Jewish population on earth. And since January 1, the number of attacks and threats made towards Jews in the five boroughs is up 94 percent compared to the same period last year. The New York Police Department has documented 68 hate crimes since the year began, more than half of which targeted Jews. Over the same span in 2016 there were 44 hate crimes — an increase of 55 percent from year to year. The rise of anti-Semitic attacks isn’t constrained to New York City, either. Across the country, waves of terroristic threats and attacks have poured into Jewish neighborhoods and communities in recent weeks. So far, ProPublica has documented more than 100 bomb threats directed towards various Jewish organizations, schools, and community centers in more than 90 different locations since January 1. At least three Jewish cemeteries have been desecrated in Philadelphia, St. Louis, and Rochester. And since Election Day, Nazi symbols like swastikas have been part of a larger trend of hate incidents across the country. Incident after incident, the White House has failed to do or say much of anything, except to broadly condemn hate crimes. On the contrary, since the early days of his campaign, Donald Trump has openly embraced anti-Semites and white nationalists, going so far as to happily share anti-Semitic imagery with his millions of followers on Twitter. Since taking office barely a month ago, his administration has white-washed the Holocaust by denying the Nazis specifically targeted Jews, hired a white nationalist who complained about his daughter’s school because there were too many Jews enrolled, and just this week, blamed Jews for the recent wave of anti-Semitic attacks, suggesting it was an attempt to portray his anti-Semitic supporters as anti-Semitic. ", "title": "Hate crimes in New York City have skyrocketed this year", "sentences": [{"0872": "Hate crimes in New York City have skyrocketed this year"}, {"6383": "And Jews are increasingly the ones being targeted."}, {"f879": "The largest Jewish community outside of Israel has seen a huge spike in anti-Semitic attacks. Credit: AP Images"}, {"b89f": "Except for Tel Aviv in Israel, New York City is home to the largest Jewish population on earth. And since January 1, the number of attacks and threats made towards Jews in the five boroughs is up 94 percent compared to the same period last year."}, {"b04f": "The New York Police Department has documented 68 hate crimes since the year began, more than half of which targeted Jews. Over the same span in 2016 there were 44 hate crimes — an increase of 55 percent from year to year."}, {"2e74": "The rise of anti-Semitic attacks isn’t constrained to New York City, either. Across the country, waves of terroristic threats and attacks have poured into Jewish neighborhoods and communities in recent weeks. So far, ProPublica has documented more than 100 bomb threats directed towards various Jewish organizations, schools, and community centers in more than 90 different locations since January 1. At least three Jewish cemeteries have been desecrated in Philadelphia, St. Louis, and Rochester. And since Election Day, Nazi symbols like swastikas have been part of a larger trend of hate incidents across the country."}, {"8e2c": "Incident after incident, the White House has failed to do or say much of anything, except to broadly condemn hate crimes."}, {"6a38": "On the contrary, since the early days of his campaign, Donald Trump has openly embraced anti-Semites and white nationalists, going so far as to happily share anti-Semitic imagery with his millions of followers on Twitter. Since taking office barely a month ago, his administration has white-washed the Holocaust by denying the Nazis specifically targeted Jews, hired a white nationalist who complained about his daughter’s school because there were too many Jews enrolled, and just this week, blamed Jews for the recent wave of anti-Semitic attacks, suggesting it was an attempt to portray his anti-Semitic supporters as anti-Semitic."}], "child": "1129_1\t1129_2\t1129_3"}