{"name": "1130", "parent": "", "content": "I’m a Trans Woman, and I Was Socialized Female Despite being assigned male at birth (AMAB), from my earliest memories, I remember that I was never treated like a boy. I grew up alongside a younger brother, Luke. We were extremely similar — the same tastes, many of the same skills, the same background, et cetera. We were both the white children of middle-class Christian conservative, military parents. Yet despite appearing to be on even footing, we received drastically different treatment. Luke was instantly accepted by the other boys; boys always metaphorically held me at arm’s length. He was encouraged to pursue interests in STEM; I was expected to become a nurse, and I was taught from a very early age how to perform emotional labor. His gender was almost never critiqued; my every mannerism was endlessly picked apart, even down to, very memorably, the way I hold water bottles. My body and my clothes were a favorite topic of critical conversation, while his appearance was left alone. But these are merely the more tame aspects of our differential socialization. The overt harassment from peers and authority figures worsened significantly when I was about eight years old, and it only became worse from there. Boys would tell jokes about my appearance and behavior, and when walking past me, they made a show of very carefully making sure they made no physical contact with me, pressing themselves up against walls and smirking cruelly as they tiptoed past. Girls spread rumors about me, and banded together to exclude me; since I only got along well with other girls, this made it extremely difficult to make friends. I was alone. Men, especially male teachers, took it upon themselves to try to “fix” me into being a “real boy.” I was forced into sports, where, naturally, the gendered bullying from boys was at its worst. I tried to tell women what was happening, but most of them didn’t believe me, and the ones who did provided no more help than trite, verbal statements of support, said in private, even though public support would likely have encouraged other people to treat me better. My brother was my only friend, but he couldn’t understand why I was getting treated like this. My parents always (and I invoke the absolute intentionally) blamed my social rejection on me: “You must have provoked them,” or “You need to be nicer,” or some other advice to change myself instead of expecting others to treat me as a human being the way I already was. This was gendered mistreatment. It is an aspect of misogyny that women and girls are told to change who they are in reaction to abuse, instead of being told that people are wrong for abusing them in the first place. To be female is to be expected to endlessly mold oneself into a more acceptable, more submissive, more nice person. The thin veneer of “boy” slapped on top of how I was treated does not change the essence of what it was. People can and do say one thing, and do another. [Trigger warning: Child sexual abuse and homophobic slur.] The worst part of my childhood came when I was ten years old. My parents had forced me into a martial arts program as yet another attempt to “toughen me up,” to erase my femininity. It didn’t work. One of the instructors at the martial arts facilities, Daniel, took notice of me. At the time, I thought he was being kind for trying to get the boys to laugh at “jokes” about me. I was young and naïve; I did not realize he was laughing at me, not with me. He told me to play up what a fag I was. This hit a boiling point one day in the exercise room. Daniel proposed that the bored class do “theater” by roleplaying according to his instructions. When it became my turn to “act,” he gestured me toward him and conspiratorially told me to do something along the lines of “acting really, really gay” with the male mannequin in the room. Nervously, I shuffled up to the mannequin and tried pretending to hug and kiss it. He called out across the room to encourage me to go further. I was so desperate for approval at the age of ten, after already having been through a couple of years of near-total social rejection, that I complied. I awkwardly gyrated my body against the mannequin, to the uproarious laughter of both the teacher and my classmates. I couldn’t have known that I’d just surrendered my access to what little pretense they had shown up until that point. From then on, the gendered abuse at the martial arts center (which doubled as an after-school daycare) was so severe that I would regularly hide under tables, stacking furniture and backpacks in front in a terrified attempt to hide myself. I was kicked, spat on, and most memorably, peeped on while I was in the restroom. I was regularly called a “faggot,” a “girl,” and all sorts of other homophobic and misogynistic insults. My brother eventually let it slip to my parents what had happened, one night when we were out getting fast food. They were furious, but not because their child had been abused; no, their anger was because their child had been made to look gay. Like a girl. They reported what had happened to the owner of the martial arts center/daycare, and they also spoke to the police. In the ensuing investigation, it was revealed that Daniel, who was eighteen at the time, had also been pressuring a twelve-year-old cis girl into performing oral sex on him. Her parents found out by reading her diary, after they heard about what had happened to me. Daniel was convicted and sent to prison, but not for what he did to me. He was never punished whatsoever for molesting me. The owner didn’t even fire him. I wasn’t allowed to stop going to that center until two years later, when I turned twelve. I had a brief, one-year respite during which I received the least abuse of my life. Sixth grade was blissful. I began to explore the sciences and the arts entirely on my own. I checked out technical books from the library, and taught myself all about topics like electromagnetism. At the same time, I advanced further in my orchestra class, playing the viola as second chair. Boys still bullied me for my gender deviance, but being among the artsy kids for so much of my days shielded me from a good portion of it. Then my family moved overseas at the same time as I began the wrong puberty. I rapidly descended into extremely severe clinical depression, and with that new weakness front and center, the gendered abuse amped back up with a vengeance. At the Christian private school to which I was sent, my gender and sexuality were more heavily-policed than ever. Almost everything I did was wrong. This was when I discovered that I could attain a modicum of protection by performing emotional labor for others. I fell into a pattern of offering unconditional support to classmates; I would listen for hours on end to their problems, and assure them that they were good people who did not deserve the mistreatment they received. I began to deeply understand that my worth (as a girl) was directly proportional to how much work I put into shouldering the psychological burdens of others. Feminists are intimately familiar with this concept — under patriarchy, a woman’s worth is defined by the emotional labor she provides for free. This was my exact experience. It was in sharp contrast to my brother’s, who was beloved by others even if he did not set aside vast amounts of time to check on and care for them, as I learned I had to. [Trigger warning: Sexual harassment and rape.] In high school, a new, disgusting form of gendered abuse emerged: Straight boys treating me like a sex object. They would do things such as mockingly telling me how much they “loved” me, then snickering to their friends when it made me blush. More overtly, some of them would make masturbating gestures at me, or grope me as I walked by. They gave many unsolicited comments on my skin, my hair, my clothes, and everything else women and girls are made to feel insecure about. These were also the years when I experienced my first rapes. Grown men began to prey on my loneliness and yearning for love by pressuring me, a minor, into having sex with them. These men were all straight or bi. At the time, I wondered how I could possibly be “converting” them. In retrospect, I see this, combined with the total lack of romantic interest gay men showed in me, as very telling. No matter how hard I tried to hide that I was a girl, people could tell. The first rape was when I was fifteen years old, and at a band camp. (Yes, I know, stereotypical.) A man named Mac, who had a girlfriend, lured me to his dorm room to “hang out,” then began to make sexual advances. He said he wanted to “experiment.” To him, I was merely an object of fantasy, not a human being. (Misogyny.) Afterward, despite my obvious disinterest in staying in contact, he continued to message me for months, even after he went home and was with his girlfriend. The messages were all sexual; none were supportive, even though I badly needed support at that time in my life. I got my first boyfriend, Allen, when I was sixteen years old. Again, he had only dated women, and considered himself straight. It was one of the best times of my life. I had never felt loved before, least of all by a member of the group that had been most dedicated to hurting me. But naturally, it was unhealthy. He kept our relationship a secret, because he was too afraid of being with me in public. His parents were strongly religious, and very bigoted, and they only allowed us to spend time together as long as we at least tried to present ourselves as male best friends. Of course, even they didn’t really treat me like a boy. It was contradictory and confusing, and the entire charade came crashing to a halt one day, when his mother was snooping in his text messages, and found our digital love notes to one another. She demanded that he dump me, and she threatened to out me to my parents as “gay” if I ever went near her son again. I had never had panic attacks in my life until that day, but her threat, and the sudden abandonment of the person I had loved most, caused me to develop a brand-new anxiety disorder. Love was made into a weapon against me, just as it is against all other women. In my despair, I fell into a deeply unhealthy pattern of having casual sex with adult men. I knew that, at age 17, I shouldn’t have been doing it, but I didn’t care then, and neither did they. I wanted a semblance of acceptance, but I was too hurt to trust somebody enough to form another relationship, so the most I could manage was hookups. I am deeply lucky to have never faced violence while doing this, nor did I ever catch any STDs, according to the many comprehensive tests I have had done. At age 18, I entered into the most abusive relationship in which I’ve ever been, with a man named Nick. By then, I had already consciously realized that I was not actually male, so I tried to insist that he call me “they” pronouns. (Internalized transmisogyny kept me from believing that I could actually be a girl, so I concluded, at the time, that I must’ve been non-binary.) Nick responded with emotional abuse, which escalated ever-further, until, finally, when I said I wanted to leave him, he threatened me with suicide if I did not stay with him, an experience to which many cis women can relate. That was the only time I have ever called the police on somebody, but I did not feel guilty about it, because he was a cis straight white middle-class man — he was safe from almost all police brutality. My assumption was proven correct when the police officers deployed to his house did no more than merely talk to him about whether he may have been suicidal, and they left after he convinced them he was not going to harm himself. I started hormone replacement therapy (HRT) the following year, at age 19. My ensuing, gradual social transition resulted in people treating me largely the same, albeit without the surface veneer of verbally calling me “male” while not at all treating me like I was. Now, at age 23, I have spent my entire adult life like this. I find it ironic that I am accused of having been a “man,” not only due to all the experiences above, but also because coming out at 18 meant I never even pretended to be a “man.” My façade ended with “boyhood.” But of course, I cannot expect nuance from transmisogynists, nor can I assume they realize there is a huge diversity of experiences of what it is to be a woman. My gender was policed. I was molested. I was raped. My worth was systematically defined by my emotional labor. Men treated me like a sexual object. My appearance was considered up for public debate. This was clearly, unequivocally female socialization, and when feminism and the social justice community realize that trans women have been treated like women from the start, they can finally start fighting for trans women’s liberation, as they should have been doing all along. We are your sisters, we are also suffering from misogyny, and we need your help. ", "title": "I’m a Trans Woman, and I Was Socialized Female", "sentences": [{"445c": "I’m a Trans Woman, and I Was Socialized Female"}, {"84ce": "Despite being assigned male at birth (AMAB), from my earliest memories, I remember that I was never treated like a boy."}, {"8a71": "I grew up alongside a younger brother, Luke. We were extremely similar — the same tastes, many of the same skills, the same background, et cetera. We were both the white children of middle-class Christian conservative, military parents. Yet despite appearing to be on even footing, we received drastically different treatment. Luke was instantly accepted by the other boys; boys always metaphorically held me at arm’s length. He was encouraged to pursue interests in STEM; I was expected to become a nurse, and I was taught from a very early age how to perform emotional labor. His gender was almost never critiqued; my every mannerism was endlessly picked apart, even down to, very memorably, the way I hold water bottles. My body and my clothes were a favorite topic of critical conversation, while his appearance was left alone. But these are merely the more tame aspects of our differential socialization."}, {"a5d5": "The overt harassment from peers and authority figures worsened significantly when I was about eight years old, and it only became worse from there. Boys would tell jokes about my appearance and behavior, and when walking past me, they made a show of very carefully making sure they made no physical contact with me, pressing themselves up against walls and smirking cruelly as they tiptoed past. Girls spread rumors about me, and banded together to exclude me; since I only got along well with other girls, this made it extremely difficult to make friends. I was alone. Men, especially male teachers, took it upon themselves to try to “fix” me into being a “real boy.” I was forced into sports, where, naturally, the gendered bullying from boys was at its worst. I tried to tell women what was happening, but most of them didn’t believe me, and the ones who did provided no more help than trite, verbal statements of support, said in private, even though public support would likely have encouraged other people to treat me better. My brother was my only friend, but he couldn’t understand why I was getting treated like this. My parents always (and I invoke the absolute intentionally) blamed my social rejection on me: “You must have provoked them,” or “You need to be nicer,” or some other advice to change myself instead of expecting others to treat me as a human being the way I already was."}, {"a9b8": "This was gendered mistreatment. It is an aspect of misogyny that women and girls are told to change who they are in reaction to abuse, instead of being told that people are wrong for abusing them in the first place. To be female is to be expected to endlessly mold oneself into a more acceptable, more submissive, more nice person."}, {"54e3": "The thin veneer of “boy” slapped on top of how I was treated does not change the essence of what it was. People can and do say one thing, and do another."}, {"0a93": "[Trigger warning: Child sexual abuse and homophobic slur.]"}, {"b8de": "The worst part of my childhood came when I was ten years old. My parents had forced me into a martial arts program as yet another attempt to “toughen me up,” to erase my femininity. It didn’t work."}, {"cf31": "One of the instructors at the martial arts facilities, Daniel, took notice of me. At the time, I thought he was being kind for trying to get the boys to laugh at “jokes” about me. I was young and naïve; I did not realize he was laughing at me, not with me. He told me to play up what a fag I was."}, {"9bd9": "This hit a boiling point one day in the exercise room. Daniel proposed that the bored class do “theater” by roleplaying according to his instructions. When it became my turn to “act,” he gestured me toward him and conspiratorially told me to do something along the lines of “acting really, really gay” with the male mannequin in the room. Nervously, I shuffled up to the mannequin and tried pretending to hug and kiss it. He called out across the room to encourage me to go further. I was so desperate for approval at the age of ten, after already having been through a couple of years of near-total social rejection, that I complied. I awkwardly gyrated my body against the mannequin, to the uproarious laughter of both the teacher and my classmates. I couldn’t have known that I’d just surrendered my access to what little pretense they had shown up until that point."}, {"45bc": "From then on, the gendered abuse at the martial arts center (which doubled as an after-school daycare) was so severe that I would regularly hide under tables, stacking furniture and backpacks in front in a terrified attempt to hide myself. I was kicked, spat on, and most memorably, peeped on while I was in the restroom. I was regularly called a “faggot,” a “girl,” and all sorts of other homophobic and misogynistic insults."}, {"f86a": "My brother eventually let it slip to my parents what had happened, one night when we were out getting fast food. They were furious, but not because their child had been abused; no, their anger was because their child had been made to look gay. Like a girl."}, {"7890": "They reported what had happened to the owner of the martial arts center/daycare, and they also spoke to the police. In the ensuing investigation, it was revealed that Daniel, who was eighteen at the time, had also been pressuring a twelve-year-old cis girl into performing oral sex on him. Her parents found out by reading her diary, after they heard about what had happened to me."}, {"e073": "Daniel was convicted and sent to prison, but not for what he did to me. He was never punished whatsoever for molesting me. The owner didn’t even fire him."}, {"11b1": "I wasn’t allowed to stop going to that center until two years later, when I turned twelve. I had a brief, one-year respite during which I received the least abuse of my life. Sixth grade was blissful. I began to explore the sciences and the arts entirely on my own. I checked out technical books from the library, and taught myself all about topics like electromagnetism. At the same time, I advanced further in my orchestra class, playing the viola as second chair. Boys still bullied me for my gender deviance, but being among the artsy kids for so much of my days shielded me from a good portion of it."}, {"a1fd": "Then my family moved overseas at the same time as I began the wrong puberty."}, {"6a3b": "I rapidly descended into extremely severe clinical depression, and with that new weakness front and center, the gendered abuse amped back up with a vengeance. At the Christian private school to which I was sent, my gender and sexuality were more heavily-policed than ever. Almost everything I did was wrong."}, {"c0ce": "This was when I discovered that I could attain a modicum of protection by performing emotional labor for others. I fell into a pattern of offering unconditional support to classmates; I would listen for hours on end to their problems, and assure them that they were good people who did not deserve the mistreatment they received. I began to deeply understand that my worth (as a girl) was directly proportional to how much work I put into shouldering the psychological burdens of others."}, {"f566": "Feminists are intimately familiar with this concept — under patriarchy, a woman’s worth is defined by the emotional labor she provides for free. This was my exact experience. It was in sharp contrast to my brother’s, who was beloved by others even if he did not set aside vast amounts of time to check on and care for them, as I learned I had to."}, {"e76d": "[Trigger warning: Sexual harassment and rape.]"}, {"71d4": "In high school, a new, disgusting form of gendered abuse emerged: Straight boys treating me like a sex object. They would do things such as mockingly telling me how much they “loved” me, then snickering to their friends when it made me blush. More overtly, some of them would make masturbating gestures at me, or grope me as I walked by. They gave many unsolicited comments on my skin, my hair, my clothes, and everything else women and girls are made to feel insecure about."}, {"971d": "These were also the years when I experienced my first rapes. Grown men began to prey on my loneliness and yearning for love by pressuring me, a minor, into having sex with them. These men were all straight or bi. At the time, I wondered how I could possibly be “converting” them. In retrospect, I see this, combined with the total lack of romantic interest gay men showed in me, as very telling. No matter how hard I tried to hide that I was a girl, people could tell."}, {"9fca": "The first rape was when I was fifteen years old, and at a band camp. (Yes, I know, stereotypical.) A man named Mac, who had a girlfriend, lured me to his dorm room to “hang out,” then began to make sexual advances. He said he wanted to “experiment.” To him, I was merely an object of fantasy, not a human being. (Misogyny.) Afterward, despite my obvious disinterest in staying in contact, he continued to message me for months, even after he went home and was with his girlfriend. The messages were all sexual; none were supportive, even though I badly needed support at that time in my life."}, {"1163": "I got my first boyfriend, Allen, when I was sixteen years old. Again, he had only dated women, and considered himself straight. It was one of the best times of my life. I had never felt loved before, least of all by a member of the group that had been most dedicated to hurting me. But naturally, it was unhealthy. He kept our relationship a secret, because he was too afraid of being with me in public. His parents were strongly religious, and very bigoted, and they only allowed us to spend time together as long as we at least tried to present ourselves as male best friends. Of course, even they didn’t really treat me like a boy. It was contradictory and confusing, and the entire charade came crashing to a halt one day, when his mother was snooping in his text messages, and found our digital love notes to one another. She demanded that he dump me, and she threatened to out me to my parents as “gay” if I ever went near her son again. I had never had panic attacks in my life until that day, but her threat, and the sudden abandonment of the person I had loved most, caused me to develop a brand-new anxiety disorder. Love was made into a weapon against me, just as it is against all other women."}, {"ee4f": "In my despair, I fell into a deeply unhealthy pattern of having casual sex with adult men. I knew that, at age 17, I shouldn’t have been doing it, but I didn’t care then, and neither did they. I wanted a semblance of acceptance, but I was too hurt to trust somebody enough to form another relationship, so the most I could manage was hookups. I am deeply lucky to have never faced violence while doing this, nor did I ever catch any STDs, according to the many comprehensive tests I have had done."}, {"29a5": "At age 18, I entered into the most abusive relationship in which I’ve ever been, with a man named Nick. By then, I had already consciously realized that I was not actually male, so I tried to insist that he call me “they” pronouns. (Internalized transmisogyny kept me from believing that I could actually be a girl, so I concluded, at the time, that I must’ve been non-binary.) Nick responded with emotional abuse, which escalated ever-further, until, finally, when I said I wanted to leave him, he threatened me with suicide if I did not stay with him, an experience to which many cis women can relate."}, {"2e1b": "That was the only time I have ever called the police on somebody, but I did not feel guilty about it, because he was a cis straight white middle-class man — he was safe from almost all police brutality. My assumption was proven correct when the police officers deployed to his house did no more than merely talk to him about whether he may have been suicidal, and they left after he convinced them he was not going to harm himself."}, {"2277": "I started hormone replacement therapy (HRT) the following year, at age 19. My ensuing, gradual social transition resulted in people treating me largely the same, albeit without the surface veneer of verbally calling me “male” while not at all treating me like I was. Now, at age 23, I have spent my entire adult life like this. I find it ironic that I am accused of having been a “man,” not only due to all the experiences above, but also because coming out at 18 meant I never even pretended to be a “man.” My façade ended with “boyhood.” But of course, I cannot expect nuance from transmisogynists, nor can I assume they realize there is a huge diversity of experiences of what it is to be a woman."}, {"6e6c": "My gender was policed. I was molested. I was raped. My worth was systematically defined by my emotional labor. Men treated me like a sexual object. My appearance was considered up for public debate. This was clearly, unequivocally female socialization, and when feminism and the social justice community realize that trans women have been treated like women from the start, they can finally start fighting for trans women’s liberation, as they should have been doing all along. We are your sisters, we are also suffering from misogyny, and we need your help."}], "child": "1130_1\t1130_2\t1130_3\t1130_4\t1130_5\t1130_6\t1130_7\t1130_8"}