{"name": "1131", "parent": "", "content": "What Just Happened in Gavin Grimm’s Case and Why Does it Prove we are Winning? An unusual order from the federal appeals court hearing Gavin Grimm’s case is a reminder that even when we don’t win in the courts, we transform society through our testimony and organizing. On Friday, the Fourth Circuit Court of Appeals issued a series of procedural orders in Gavin Grimm’s trans rights case that will further delay his fight to be treated with basic decency. But while the resolution of his legal battle may be delayed, his fight for justice has already transformed us all. Following the Supreme Court’s decision last month to send Gavin’s case back to the appeals court in light of the Trump Administration’s decision to rescind the Obama-era interpretive guidance that had been the basis of Gavin’s win in the lower courts, the Fourth Circuit was charged with scheduling the next steps in Gavin’s case. Last year, this same federal appeals court, which covers Maryland, Virginia, West Virginia, South Carolina, and North Carolina, had ruled in Gavin’s favor, holding that he could bring a claim against his school district under Title IX, the federal law banning sex discrimination in schools, for discrimination based on the district’s policy banning Gavin from the boys’ restroom just because he is transgender. That decision resulted in an order requiring Gavin’s school to treat him equally with other boys for purposes of restroom use — a major win for Gavin and a beacon of hope for trans students across the country. Unfortunately, over the summer the Supreme Court had put Gavin’s win on hold pending its consideration of the school district’s appeal. In October, just one week before the presidential election, the Supreme Court decided it would hear Gavin’s case at the request of his school district, which fought relentlessly to overturn his win and keep him out of the restroom used by all the other boys at school just because he is transgender. When the Supreme Court granted review of his case in October, it was clear that Gavin would likely graduate before ever again being afforded use of the school’s facilities on equal terms with his peers. But by then the case was much bigger than Gavin, representing instead a major turning point in the fight for trans justice. The stakes of the case became even higher after the Presidential election and President Trump’s appointment of the most anti-LGBTQ cabinet in history. Led by Attorney General Sessions and Education Secretary DeVos, hours before Gavin filed his brief in the Supreme Court, the Trump administration rescinded the Obama administration’s guidance to schools on how to best protect the rights of transgender students under federal law. Though the parties in Gavin’s case urged the Supreme Court to nonetheless resolve the substantive question presented in the case of whether transgender individuals are protected under Title IX’s prohibition on sex discrimination in educational settings, the Court decided to overturn Gavin’s win, which had been based on the Obama administration’s interpretation of the law, and send the case back to be relitigated in the lower courts. It was a disappointing decision that dashed the hopes of trans people across the country who looked to Gavin’s case as a chance for national clarity around the scope of our legal rights and protections under federal law. But as painful as it was, it did not change or diminish the rights we enjoy under federal non-discrimination law and the Constitution — it merely delayed a definitive declaration of those rights by the highest court. With the Supreme Court declining to weigh-in at the eleventh hour, Gavin asked the fourth circuit court of appeals to hear his case on an expedited basis to give him a chance to use the restroom and be treated equally for even one day before he graduated. On Friday, the fourth circuit denied his request and officially overturned his win. Both orders were largely formalities after the Supreme Court’s decision in March and his case will still be heard just later this year and after he graduates. Generally, such orders would have been short, one-line updates to the case docket. But on Friday, Senior Judge Andre Davis took the opportunity to pen a moving, four-page tribute to Gavin and his fight. Judge Henry Floyd joined. The order is as beautiful as it is unusual. It really should be read in its entirety by anyone who cares about law, justice or our shared humanity. Of Gavin’s fight, Judge Davis writes: “G.G.’s case is about much more than bathrooms. It’s about a boy asking his school to treat him just like any other boy. It’s about protecting the rights of transgender people in public spaces and not forcing them to exist on the margins. It’s about governmental validation of the existence and experiences of transgender people, as well as the simple recognition of their humanity. His case is part of a larger movement that is redefining and broadening the scope of civil and human rights so that they extend to a vulnerable group that has traditionally been unrecognized, unrepresented, and unprotected.” This passage is striking because it reads almost verbatim like the story we, as advocates, have been telling about this case — it is not about restrooms but about our ability to participate in public life. We don’t seek to enter the restroom because we want to make others uncomfortable but rather, for the simple reason that we exist. And as hard as it can be to wrestle with and claim our truth, it is simply untenable to deny our existence. By speaking up at his school board meeting at just fifteen years-old and continuing this fight into the center of a national conversation, Gavin defended not only his own existence but all of ours. Davis’s words are a testament not only to Gavin’s bravery, brilliance and resilience but also to the power of narrative storytelling generally to transform those around us, including the judges, lawmakers and executives who retain significant power over our lives. This is what Judge Davis recognized. “Today,” he continued his opinion, “hatred, intolerance, and discrimination persist — and are sometimes even promoted — but by challenging unjust policies rooted in invidious discrimination, G.G. takes his place among other modern-day human rights leaders who strive to ensure that, one day, equality will prevail, and that the core dignity of every one of our brothers and sisters is respected by lawmakers and others who wield power over their lives.” We will never be able to measure the extent to which Gavin changed the course of history. Change is simply not quantifiable in that way. But what is impossible to deny is how, over the past six months as Gavin’s story captivated the public, we all learned, and grew, and moved together. We moved the needle toward justice and helped a larger group of the American public see us — trans people — as human. Quoting the final lines of a poem by Palestinian-American poet Naomi Shehab Nye, Judge Davis wrote of Gavin, “Despite his youth and the formidable power of those arrayed against him at every stage of these proceedings, ‘[he] never forgot what [he] could do.’” The nature of injustice and systemic oppression is that certain people — white people, wealthy people, non-transgender people, straight people, United States citizens, to name a few — are given more space, more power, more opportunities to do, to live, to breath, to dream. But those who toil under the relentless weight of systems that seek to destroy them are always the ones who build and dream and vision a world ever greater than the one we live today. It is the power of their testimony — spoken, lived, dreamed — that moves us forward and transforms us. We may lose in the courts, we may lose in the legislatures, we may lose on every metric that can be validated in this system but if we tell our stories, live our truths, and resist the notion that we are limited by the story of our lives that the legal system would have us tell, then these losses will still bring us forward. If we never forget what we can do, if we never forget to lift each other up, if we never forget that others made our lives possible and we can make each others lives not only possible but breathtakingly beautiful, then we will win. We are already winning. ", "title": "What Just Happened in Gavin Grimm’s Case and Why Does it Prove we are Winning?", "sentences": [{"b08d": "What Just Happened in Gavin Grimm’s Case and Why Does it Prove we are Winning?"}, {"0031": "An unusual order from the federal appeals court hearing Gavin Grimm’s case is a reminder that even when we don’t win in the courts, we transform society through our testimony and organizing."}, {"4b8e": "On Friday, the Fourth Circuit Court of Appeals issued a series of procedural orders in Gavin Grimm’s trans rights case that will further delay his fight to be treated with basic decency. But while the resolution of his legal battle may be delayed, his fight for justice has already transformed us all."}, {"d940": "Following the Supreme Court’s decision last month to send Gavin’s case back to the appeals court in light of the Trump Administration’s decision to rescind the Obama-era interpretive guidance that had been the basis of Gavin’s win in the lower courts, the Fourth Circuit was charged with scheduling the next steps in Gavin’s case. Last year, this same federal appeals court, which covers Maryland, Virginia, West Virginia, South Carolina, and North Carolina, had ruled in Gavin’s favor, holding that he could bring a claim against his school district under Title IX, the federal law banning sex discrimination in schools, for discrimination based on the district’s policy banning Gavin from the boys’ restroom just because he is transgender."}, {"31ca": "That decision resulted in an order requiring Gavin’s school to treat him equally with other boys for purposes of restroom use — a major win for Gavin and a beacon of hope for trans students across the country. Unfortunately, over the summer the Supreme Court had put Gavin’s win on hold pending its consideration of the school district’s appeal. In October, just one week before the presidential election, the Supreme Court decided it would hear Gavin’s case at the request of his school district, which fought relentlessly to overturn his win and keep him out of the restroom used by all the other boys at school just because he is transgender."}, {"2a60": "When the Supreme Court granted review of his case in October, it was clear that Gavin would likely graduate before ever again being afforded use of the school’s facilities on equal terms with his peers. But by then the case was much bigger than Gavin, representing instead a major turning point in the fight for trans justice. The stakes of the case became even higher after the Presidential election and President Trump’s appointment of the most anti-LGBTQ cabinet in history. Led by Attorney General Sessions and Education Secretary DeVos, hours before Gavin filed his brief in the Supreme Court, the Trump administration rescinded the Obama administration’s guidance to schools on how to best protect the rights of transgender students under federal law. Though the parties in Gavin’s case urged the Supreme Court to nonetheless resolve the substantive question presented in the case of whether transgender individuals are protected under Title IX’s prohibition on sex discrimination in educational settings, the Court decided to overturn Gavin’s win, which had been based on the Obama administration’s interpretation of the law, and send the case back to be relitigated in the lower courts. It was a disappointing decision that dashed the hopes of trans people across the country who looked to Gavin’s case as a chance for national clarity around the scope of our legal rights and protections under federal law. But as painful as it was, it did not change or diminish the rights we enjoy under federal non-discrimination law and the Constitution — it merely delayed a definitive declaration of those rights by the highest court."}, {"254c": "With the Supreme Court declining to weigh-in at the eleventh hour, Gavin asked the fourth circuit court of appeals to hear his case on an expedited basis to give him a chance to use the restroom and be treated equally for even one day before he graduated. On Friday, the fourth circuit denied his request and officially overturned his win. Both orders were largely formalities after the Supreme Court’s decision in March and his case will still be heard just later this year and after he graduates. Generally, such orders would have been short, one-line updates to the case docket. But on Friday, Senior Judge Andre Davis took the opportunity to pen a moving, four-page tribute to Gavin and his fight. Judge Henry Floyd joined."}, {"449c": "The order is as beautiful as it is unusual. It really should be read in its entirety by anyone who cares about law, justice or our shared humanity. Of Gavin’s fight, Judge Davis writes:"}, {"7270": "“G.G.’s case is about much more than bathrooms. It’s about a boy asking his school to treat him just like any other boy. It’s about protecting the rights of transgender people in public spaces and not forcing them to exist on the margins. It’s about governmental validation of the existence and experiences of transgender people, as well as the simple recognition of their humanity. His case is part of a larger movement that is redefining and broadening the scope of civil and human rights so that they extend to a vulnerable group that has traditionally been unrecognized, unrepresented, and unprotected.”"}, {"f3a5": "This passage is striking because it reads almost verbatim like the story we, as advocates, have been telling about this case — it is not about restrooms but about our ability to participate in public life. We don’t seek to enter the restroom because we want to make others uncomfortable but rather, for the simple reason that we exist. And as hard as it can be to wrestle with and claim our truth, it is simply untenable to deny our existence. By speaking up at his school board meeting at just fifteen years-old and continuing this fight into the center of a national conversation, Gavin defended not only his own existence but all of ours."}, {"7011": "Davis’s words are a testament not only to Gavin’s bravery, brilliance and resilience but also to the power of narrative storytelling generally to transform those around us, including the judges, lawmakers and executives who retain significant power over our lives."}, {"65e7": "This is what Judge Davis recognized."}, {"90aa": "“Today,” he continued his opinion, “hatred, intolerance, and discrimination persist — and are sometimes even promoted — but by challenging unjust policies rooted in invidious discrimination, G.G. takes his place among other modern-day human rights leaders who strive to ensure that, one day, equality will prevail, and that the core dignity of every one of our brothers and sisters is respected by lawmakers and others who wield power over their lives.”"}, {"61f6": "We will never be able to measure the extent to which Gavin changed the course of history. Change is simply not quantifiable in that way. But what is impossible to deny is how, over the past six months as Gavin’s story captivated the public, we all learned, and grew, and moved together. We moved the needle toward justice and helped a larger group of the American public see us — trans people — as human."}, {"ade8": "Quoting the final lines of a poem by Palestinian-American poet Naomi Shehab Nye, Judge Davis wrote of Gavin, “Despite his youth and the formidable power of those arrayed against him at every stage of these proceedings, ‘[he] never forgot what [he] could do.’”"}, {"538a": "The nature of injustice and systemic oppression is that certain people — white people, wealthy people, non-transgender people, straight people, United States citizens, to name a few — are given more space, more power, more opportunities to do, to live, to breath, to dream. But those who toil under the relentless weight of systems that seek to destroy them are always the ones who build and dream and vision a world ever greater than the one we live today. It is the power of their testimony — spoken, lived, dreamed — that moves us forward and transforms us. We may lose in the courts, we may lose in the legislatures, we may lose on every metric that can be validated in this system but if we tell our stories, live our truths, and resist the notion that we are limited by the story of our lives that the legal system would have us tell, then these losses will still bring us forward."}, {"fde7": "If we never forget what we can do, if we never forget to lift each other up, if we never forget that others made our lives possible and we can make each others lives not only possible but breathtakingly beautiful, then we will win. We are already winning."}], "child": "1131_1"}