{"name": "1133", "parent": "", "content": "What to Do About Boys Who Wear Dresses Illustration by Carly Jean Andrews Darcy’s 7-year-old son Francis wears a dress pretty much every day. “It makes him feel pretty,” she explains. “He started really early, around 2 years old.” Darcy bought gender-neutral toys to see what Francis gravitated toward, and says he was naturally drawn to trains and cars — but also to the idea of being a girl. Sometimes he re-enacts dramatic scenes as movie characters, like Elsa from Frozen, or models twinkly jewelry sent by Darcy’s mother. “But then he’ll sit down and play with trains or build Legos all afternoon,” Darcy explains. “It’s fluid.” Darcy, a psychologist, says she and her husband haven’t really been concerned about it. “This is exploration; it’s natural development.” Jaclyn Lafer, a psychotherapist and early childhood specialist, agrees. “Boys wear dresses because they feel good — they’re soft, silky and fun to twirl. It doesn’t have to mean anything. We adults apply the meaning to it.” Lafer says there are benefits to allowing sons to wear feminine clothes because children naturally want to explore their world. “The more that we can let them come into themselves without applying shame to what they are doing, the better chance we’re giving them to become human beings. Any time you say, ‘That’s not appropriate’ or ‘You shouldn’t do that,’ you’re defining something for your child. But these aren’t things we need to define for them.” Of course, a lot of parents disagree. Jacob’s New Dress, Book by Ian Hoffman and Sarah Hoffman Last month Jacob’s New Dress, a children’s book about a boy wearing a dress meant to foster support and acceptance of gender-nonconforming children, was abruptly pulled from the reading list of the Charlotte-Mecklenburg Schools, one of the largest public school districts in North Carolina, after widespread outcry from parents. From the North Carolina Values Facebook page: Mabel Frank: I WILL take my children out of public school IF they dare to bring this book into their curriculum! AND I WILL SUE THE SCHOOL SYSTEM!!!! Kathy Auten Wrenn: I pray in the Name of Jesus Christ that this book is never introduced in any school system… anywhere. And that children never see it….read it… or hear of it. Amen James Mangum: If I had a son and he ever wore a dress the abuse would be to the seat of his pants. #not in my house “What are they so worried about?” asks Darcy, who says it’s inaccurate to associate Francis’s affinity for dresses with his future sexual orientation or gender identity. But is it? Studies have found that anywhere from 24 percent to 82 percent of gender-nonconforming kids may grow up to be gay or bisexual. Case in point: My friend Stephen, who is gay, says he used to sneak into his mom’s closet when he was 8 years old to wear her dresses and high-heeled shoes. “She had some sequined dresses that made me feel glamorous! That could explain my fascination with beaded gowns today.” On the flips side, other studies suggest the vast majority of boys who wear dresses stop doing so by puberty. My cousin’s son Elliot is one of them. When he started wearing his sister’s mermaid and fairy costumes, it was clear to his parents that he was drawn to the sparkles and the intricacy of the material itself. “The clothing didn’t have a gender,” his mom explains. “It was fun and colorful and allowed him to use his imagination in the same way that his box of crayons or sidewalk chalk did.” Another friend’s twin boys donned dresses and crowns for Halloween last year, telling their mom, “Princesses are cool so we want to be princesses.” She shared on Facebook that she was proud to be raising feminist young men. Lafer stresses that children are naturally curious and says we shouldn’t discourage that. “I encourage parents to talk to their kids by asking questions. Instead of saying, ‘You shouldn’t be wearing that dress,’ why not ask, ‘What is it you like about wearing that dress?’ Go with their creativity. Encourage their thought and help them develop the person that they are and understand why they’re drawn to things.” As for Francis, Darcy says he’s recently grown his hair long and enjoys putting it in pigtails. Sometimes, she says, if he’s performing a scene, he’ll add jewelry and accessories, but otherwise he just tries things out. “He went as Cinderella for for Halloween last year — wedding dress, veil and all. There were some kids who said some nasty things, but he wore it proudly.” C. Brian Smith is a staff writer at MEL. He last wrote about an at-home sperm count test, via your smartphone. More boys: The Life and Times of a Closeted Frat BoyMichael Rohrbaugh’s short film ‘American Male’ examines the violence beneath the ‘straight’ facade of a gay frat boymelmagazine.com The Ideal Dick Is the ‘Boyfriend Dick’Bigger isn’t always better: Most women just want a dick they can take home to meet their parentsmelmagazine.com Meet the Woman Who Runs a ‘School for Boys Who Want to Be Girls’Ms. Vera’s motto: ‘Trans isn’t just for trans people’melmagazine.com ", "title": "What to Do About Boys Who Wear Dresses", "sentences": [{"baaf": "What to Do About Boys Who Wear Dresses"}, {"9c7b": "Illustration by Carly Jean Andrews"}, {"434a": "Darcy’s 7-year-old son Francis wears a dress pretty much every day."}, {"cd64": "“It makes him feel pretty,” she explains. “He started really early, around 2 years old.” Darcy bought gender-neutral toys to see what Francis gravitated toward, and says he was naturally drawn to trains and cars — but also to the idea of being a girl. Sometimes he re-enacts dramatic scenes as movie characters, like Elsa from Frozen, or models twinkly jewelry sent by Darcy’s mother."}, {"8af1": "“But then he’ll sit down and play with trains or build Legos all afternoon,” Darcy explains. “It’s fluid.” Darcy, a psychologist, says she and her husband haven’t really been concerned about it. “This is exploration; it’s natural development.”"}, {"600f": "Jaclyn Lafer, a psychotherapist and early childhood specialist, agrees. “Boys wear dresses because they feel good — they’re soft, silky and fun to twirl. It doesn’t have to mean anything. We adults apply the meaning to it.”"}, {"8468": "Lafer says there are benefits to allowing sons to wear feminine clothes because children naturally want to explore their world. “The more that we can let them come into themselves without applying shame to what they are doing, the better chance we’re giving them to become human beings. Any time you say, ‘That’s not appropriate’ or ‘You shouldn’t do that,’ you’re defining something for your child. But these aren’t things we need to define for them.”"}, {"8a91": "Of course, a lot of parents disagree."}, {"0e2b": "Jacob’s New Dress, Book by Ian Hoffman and Sarah Hoffman"}, {"7711": "Last month Jacob’s New Dress, a children’s book about a boy wearing a dress meant to foster support and acceptance of gender-nonconforming children, was abruptly pulled from the reading list of the Charlotte-Mecklenburg Schools, one of the largest public school districts in North Carolina, after widespread outcry from parents."}, {"93ce": "From the North Carolina Values Facebook page:"}, {"594c": "Mabel Frank: I WILL take my children out of public school IF they dare to bring this book into their curriculum! AND I WILL SUE THE SCHOOL SYSTEM!!!!"}, {"4633": "Kathy Auten Wrenn: I pray in the Name of Jesus Christ that this book is never introduced in any school system… anywhere. And that children never see it….read it… or hear of it. Amen"}, {"5c5c": "James Mangum: If I had a son and he ever wore a dress the abuse would be to the seat of his pants. #not in my house"}, {"800f": "“What are they so worried about?” asks Darcy, who says it’s inaccurate to associate Francis’s affinity for dresses with his future sexual orientation or gender identity."}, {"b80e": "But is it? Studies have found that anywhere from 24 percent to 82 percent of gender-nonconforming kids may grow up to be gay or bisexual. Case in point: My friend Stephen, who is gay, says he used to sneak into his mom’s closet when he was 8 years old to wear her dresses and high-heeled shoes. “She had some sequined dresses that made me feel glamorous! That could explain my fascination with beaded gowns today.”"}, {"ed86": "On the flips side, other studies suggest the vast majority of boys who wear dresses stop doing so by puberty. My cousin’s son Elliot is one of them. When he started wearing his sister’s mermaid and fairy costumes, it was clear to his parents that he was drawn to the sparkles and the intricacy of the material itself. “The clothing didn’t have a gender,” his mom explains. “It was fun and colorful and allowed him to use his imagination in the same way that his box of crayons or sidewalk chalk did.”"}, {"ea2b": "Another friend’s twin boys donned dresses and crowns for Halloween last year, telling their mom, “Princesses are cool so we want to be princesses.” She shared on Facebook that she was proud to be raising feminist young men."}, {"f00c": "Lafer stresses that children are naturally curious and says we shouldn’t discourage that. “I encourage parents to talk to their kids by asking questions. Instead of saying, ‘You shouldn’t be wearing that dress,’ why not ask, ‘What is it you like about wearing that dress?’ Go with their creativity. Encourage their thought and help them develop the person that they are and understand why they’re drawn to things.”"}, {"deb1": "As for Francis, Darcy says he’s recently grown his hair long and enjoys putting it in pigtails. Sometimes, she says, if he’s performing a scene, he’ll add jewelry and accessories, but otherwise he just tries things out. “He went as Cinderella for for Halloween last year — wedding dress, veil and all. There were some kids who said some nasty things, but he wore it proudly.”"}, {"ab71": "C. Brian Smith is a staff writer at MEL. He last wrote about an at-home sperm count test, via your smartphone."}, {"f5f6": "More boys:"}, {"38a2": "The Life and Times of a Closeted Frat BoyMichael Rohrbaugh’s short film ‘American Male’ examines the violence beneath the ‘straight’ facade of a gay frat boymelmagazine.com"}, {"7905": "The Ideal Dick Is the ‘Boyfriend Dick’Bigger isn’t always better: Most women just want a dick they can take home to meet their parentsmelmagazine.com"}, {"5c5a": "Meet the Woman Who Runs a ‘School for Boys Who Want to Be Girls’Ms. Vera’s motto: ‘Trans isn’t just for trans people’melmagazine.com"}], "child": "1133_1\t1133_2"}