{"name": "1134", "parent": "", "content": "A Trump Administration Official Was Involved in a Bush-Era Purge of Gay Employees A government investigation found that Jim Renne was a key player in a scandal in which staff were targeted on the basis of sexual orientation. By Justin Elliott It was one of the uglier scandals of the Bush administration: Top officials at an agency dedicated to protecting whistle-blowers launched a campaign against their own employees based on suspected sexual orientation, according to an inspector general report. Staffers were abruptly re-assigned from Washington, D.C., to a new office 500 miles away in Detroit in what the head of the office reportedly described as an effort to “ship [them] out.” Staffers who refused were fired. Crude anti-gay emails were found in the agency chief’s account. Now one of the major players in the scandal has a new assignment: He works in the Trump administration. In December, James Renne was appointed to the Trump “landing team” at the Office of the Director of National Intelligence, as part of the transition effort between the election and the inauguration. He was then hired January 30th in a senior role at the Department of Agriculture, though his exact job duties are not clear. Renne was part of the wave of early political appointees on so-called “beachhead teams,” whose role is to lay the groundwork for the new administration’s policies. (We published details on hundreds of beachhead hires, obtained through public records requests.) The White House Just Announced It Won’t Go After Federal Protections for LGBT AmericansIt seems religious freedom is a losing argument, even on the right.psmag.com In the Bush administration, Renne was hired in 2004 as deputy special counsel of the Office of Special Counsel, the small federal agency that is supposed to protect employees across the government from retaliation for whistle-blowing. The tenures of Renne and his boss, Special Counsel Scott Bloch, were almost immediately mired in controversy after career employees said they were improperly fired. Language stating that job discrimination protections extend to sexual orientation also disappeared from the agency website. A little-noticed inspector general report, released in 2013, depicts Renne as a central player in the efforts. Bloch and Renne, it found, hatched the plan to abruptly open a new “Midwest Field Office” in Detroit and re-assign career staff there. Employees who declined to move lost their jobs. The report found that the employees were targeted for no legitimate reason, pointing to “facts which reflect that Bloch and Renne may have been motivated in their actions by a negative personal attitude toward homosexuality and individuals whose orientation is homosexual.” One evening shortly after he was hired in 2004, Renne took the lead in removing the language from the agency’s website about how job protections cover sexual orientation, the report says. From the report: “Mr. Renne was depicted as intently searching the OSC website with the assistance of a senior career official to identify passages, which interpreted [the non-discrimination law] as extending protection to employees on the basis of their sexual orientation. According to this account, Mr. Renne demanded that OSC’s information technology manager remove these materials from the website immediately.” That change was later the subject of congressional hearings. Renne did not respond to requests for comment. The Department of Agriculture, which hired him, declined to comment. The scandal at the Office of Special Counsel dragged on for years, spawning congressional and criminal investigations. In a formal complaint filed at the time, the employees who were reassigned to Detroit pointed to a “Concerned Catholic Attorneys” letter Renne had signed in 2000 that is a broadside against a range of gay rights efforts. It warns that the “homosexual lobby’s power has grown exponentially.” The inspector general report found that Renne played a central role in the plan to open a Detroit office, noting that “the reorganization was formulated by Mr. Bloch and Mr. Renne very early in their tenure.” An outside consultant they hired to help with the plan told investigators that “it appeared that Mr. Bloch may have been heavily influenced by Mr. Renne.” That consultant, retired Lieutenant General Richard Trefry, told investigators: Mr. Bloch indicated to General Trefry that there was a sizeable group of homosexuals employed by OSC, which had developed during the years prior to his taking office, that he “had a license” to get rid of homosexual employees, and that he intended to “ship them out.” The report continues: Further, in the portions of Mr. Bloch’s official e-mail account that were available to the investigative team, there were crude and vulgar messages containing anti-homosexual themes that appeared to have been forwarded from his personal email. … Similarly, Mr. Bloch’s public media references to [his predecessor as Special Counsel, Elaine] Kaplan contained repeated, negatively-phrased assertions regarding her sexual orientation. For example, in interviews he granted during 2007, Mr. Bloch described her as a “lesbian activist,” a “public lesbian,” a “well-known gay activist”, and similar depictions. Now in private practice, Bloch told ProPublica the report is “filled with untruth, outright falsehoods, and innuendo.” When the report was released, Bloch denied that he ever talked about targeting gay employees. The inspector general report says it was based on interviews with more than 60 people and examination of over 100,000 emails. The Trump Administration Is Pretending Older LGBTQ Americans Don’t ExistHHS is looking to erase LGBTQ seniors from an annual survey that determines services for older Americans.psmag.com The affected employees ultimately came to a settlement with the government. The terms were not released. During the investigation into his tenure, Bloch’s home and office were raided by the Federal Bureau of Investigation and he ultimately pleaded guilty to a misdemeanor charge arising from his hiring the company Geeks on Call to do a “seven-level wipe” on his government computers. Years later, Bloch later unsuccessfully sued the government over his firing. There’s little public record of what Renne has been doing since his time working with Bloch. The Trump landing team announcement identified him as working for Renne Law. A fellow member of the Office of the Director of National Intelligence landing team said that Renne had worked at the ODNI inspector general office. And Bloch said he also heard that Renne had gotten a job in the intelligence community after their work together. An ODNI spokesman declined to comment. This story originally appeared on ProPublica as “Official Involved in Bush-Era Purge of Gay Employees Now in Trump Administration” and is republished here under a Creative Commons license. ", "title": "A Trump Administration Official Was Involved in a Bush-Era Purge of Gay Employees", "sentences": [{"6035": "A Trump Administration Official Was Involved in a Bush-Era Purge of Gay Employees"}, {"94e8": "A government investigation found that Jim Renne was a key player in a scandal in which staff were targeted on the basis of sexual orientation."}, {"1924": "By Justin Elliott"}, {"62b9": "It was one of the uglier scandals of the Bush administration: Top officials at an agency dedicated to protecting whistle-blowers launched a campaign against their own employees based on suspected sexual orientation, according to an inspector general report."}, {"f9dc": "Staffers were abruptly re-assigned from Washington, D.C., to a new office 500 miles away in Detroit in what the head of the office reportedly described as an effort to “ship [them] out.” Staffers who refused were fired."}, {"550d": "Crude anti-gay emails were found in the agency chief’s account."}, {"da50": "Now one of the major players in the scandal has a new assignment: He works in the Trump administration."}, {"ea03": "In December, James Renne was appointed to the Trump “landing team” at the Office of the Director of National Intelligence, as part of the transition effort between the election and the inauguration. He was then hired January 30th in a senior role at the Department of Agriculture, though his exact job duties are not clear."}, {"a094": "Renne was part of the wave of early political appointees on so-called “beachhead teams,” whose role is to lay the groundwork for the new administration’s policies. (We published details on hundreds of beachhead hires, obtained through public records requests.)"}, {"eae9": "The White House Just Announced It Won’t Go After Federal Protections for LGBT AmericansIt seems religious freedom is a losing argument, even on the right.psmag.com"}, {"b1aa": "In the Bush administration, Renne was hired in 2004 as deputy special counsel of the Office of Special Counsel, the small federal agency that is supposed to protect employees across the government from retaliation for whistle-blowing. The tenures of Renne and his boss, Special Counsel Scott Bloch, were almost immediately mired in controversy after career employees said they were improperly fired. Language stating that job discrimination protections extend to sexual orientation also disappeared from the agency website."}, {"4c22": "A little-noticed inspector general report, released in 2013, depicts Renne as a central player in the efforts. Bloch and Renne, it found, hatched the plan to abruptly open a new “Midwest Field Office” in Detroit and re-assign career staff there. Employees who declined to move lost their jobs."}, {"b051": "The report found that the employees were targeted for no legitimate reason, pointing to “facts which reflect that Bloch and Renne may have been motivated in their actions by a negative personal attitude toward homosexuality and individuals whose orientation is homosexual.”"}, {"4c3c": "One evening shortly after he was hired in 2004, Renne took the lead in removing the language from the agency’s website about how job protections cover sexual orientation, the report says."}, {"60bc": "From the report: “Mr. Renne was depicted as intently searching the OSC website with the assistance of a senior career official to identify passages, which interpreted [the non-discrimination law] as extending protection to employees on the basis of their sexual orientation. According to this account, Mr. Renne demanded that OSC’s information technology manager remove these materials from the website immediately.”"}, {"303b": "That change was later the subject of congressional hearings."}, {"779f": "Renne did not respond to requests for comment. The Department of Agriculture, which hired him, declined to comment."}, {"2021": "The scandal at the Office of Special Counsel dragged on for years, spawning congressional and criminal investigations."}, {"c034": "In a formal complaint filed at the time, the employees who were reassigned to Detroit pointed to a “Concerned Catholic Attorneys” letter Renne had signed in 2000 that is a broadside against a range of gay rights efforts. It warns that the “homosexual lobby’s power has grown exponentially.”"}, {"048f": "The inspector general report found that Renne played a central role in the plan to open a Detroit office, noting that “the reorganization was formulated by Mr. Bloch and Mr. Renne very early in their tenure.” An outside consultant they hired to help with the plan told investigators that “it appeared that Mr. Bloch may have been heavily influenced by Mr. Renne.”"}, {"d97d": "That consultant, retired Lieutenant General Richard Trefry, told investigators:"}, {"de5c": "Mr. Bloch indicated to General Trefry that there was a sizeable group of homosexuals employed by OSC, which had developed during the years prior to his taking office, that he “had a license” to get rid of homosexual employees, and that he intended to “ship them out.”"}, {"329a": "The report continues:"}, {"4fb9": "Further, in the portions of Mr. Bloch’s official e-mail account that were available to the investigative team, there were crude and vulgar messages containing anti-homosexual themes that appeared to have been forwarded from his personal email. … Similarly, Mr. Bloch’s public media references to [his predecessor as Special Counsel, Elaine] Kaplan contained repeated, negatively-phrased assertions regarding her sexual orientation. For example, in interviews he granted during 2007, Mr. Bloch described her as a “lesbian activist,” a “public lesbian,” a “well-known gay activist”, and similar depictions."}, {"835a": "Now in private practice, Bloch told ProPublica the report is “filled with untruth, outright falsehoods, and innuendo.” When the report was released, Bloch denied that he ever talked about targeting gay employees."}, {"5715": "The inspector general report says it was based on interviews with more than 60 people and examination of over 100,000 emails."}, {"b121": "The Trump Administration Is Pretending Older LGBTQ Americans Don’t ExistHHS is looking to erase LGBTQ seniors from an annual survey that determines services for older Americans.psmag.com"}, {"c074": "The affected employees ultimately came to a settlement with the government. The terms were not released."}, {"1ac9": "During the investigation into his tenure, Bloch’s home and office were raided by the Federal Bureau of Investigation and he ultimately pleaded guilty to a misdemeanor charge arising from his hiring the company Geeks on Call to do a “seven-level wipe” on his government computers. Years later, Bloch later unsuccessfully sued the government over his firing."}, {"6440": "There’s little public record of what Renne has been doing since his time working with Bloch. The Trump landing team announcement identified him as working for Renne Law. A fellow member of the Office of the Director of National Intelligence landing team said that Renne had worked at the ODNI inspector general office. And Bloch said he also heard that Renne had gotten a job in the intelligence community after their work together. An ODNI spokesman declined to comment."}, {"1057": "This story originally appeared on ProPublica as “Official Involved in Bush-Era Purge of Gay Employees Now in Trump Administration” and is republished here under a Creative Commons license."}], "child": "1134_11134_1"}