{"name": "1136", "parent": "", "content": "La Tchétchénie ouvre un camp de concentration pour les homosexuels. Ils sont torturés à l’électricité et battus à mort. Le Président Ramzan Kadyrov allié clé de Vladimir Poutine, aurait ordonné une répression sans précédent. Premier camp de concentration pour les homosexuels depuis Hitler. Ceux qui ont fui ont rapportés que les prisonniers étaient battus et torturés. Forcés à révéler d’autres membres de la communauté gay Plus d’une centaine d’homosexuels ont été arrêtés et trois tués la semaine dernière en Tchétchénie. Un rapport de Novaya Gazeta dit que les autorités auraient mis en place plusieurs camps où les homosexuels seraient tués ou contraints de promettre de quitter la République Tchétchénie. L’un des camps est apparemment l’ancien quartier général militaire de la ville d’Argoun. Aucunes sources ne le confirme mais les témoignages convergent. Svetlana Zakharova, du Réseau LGBT russe, a déclaré : “Des homosexuels ont été arrêtés et nous travaillons pour évacuer les gens des camps et certains, par crainte, ont quitté la région.”“Ceux qui y ont échappé disent qu’ils sont détenus dans une seule et même pièce, environ 30 ou 40 personnes. Ils sont torturés avec des courants électriques et sauvagement battus, parfois, jusqu’à la mort.” Ceux qui se sont échappés, dit Novoya Gazeta ont rapportés que “les prisonniers ont été battus pour les forcer à révéler d’autres membres de la communauté gay dans la région.” Un autre prisonnier qui a fui dit que, avant d’être incarcéré dans l’un des camps, il avait été contraint de payer des pots de vin à la police tchétchène pour survivre. Alexander Artemyev, d’Amnesty International en Russie, a déclaré : “Nous ne pouvons appeler les autorités russes à enquêter sur les allégations. Les homosexuels ont peur de parler. Ils doivent se cacher ou quitter la république.” Nous maintenons le contact avec le réseau LGBT local qui aide les gens à trouver un abri. Le problème est que les gens là-bas ne peuvent pas parler car ils mettent leur vie en danger. Ekaterina Sokirianskaia, directrice de projet pour l’International Crisis Group, a déclarée : “La situation se développe et ne fait qu’empirer, les victimes fuient.” Tanya Lokshina, de Human Rights Watch à Moscou, a déclarée: “Depuis plusieurs semaines, une campagne brutale contre les personnes LGBT se passe en Tchétchénie” “Ces jours-ci, très peu de gens en Tchétchénie n’osent parler aux observateurs des droits de l’homme ou aux journalistes, même de façon anonyme parce que le climat de peur est écrasant et les gens ont été intimidés, intimés de garder le silence sous peine de représailles.” Les personnes LGBT sont vulnérables en Tchétchénie, l’homophobie est intense et endémique. Les personnes LGBT sont en danger, non seulement la persécution se fait par les autorités, mais aussi par sa propre famille. Régulièrement des «crimes d’honneur» sont répertoriés. Le président Ramzan Kadyrov, aurait ordonné la répression, bien qu’officiellement son régime ait nié les arrestations en affirmant “qu’il est impossible de les persécuter parce que les gays n’existent pas en Tchétchénie.” Kadyrov, qui a introduit la loi islamique dans la région, à majorité musulmane, a été accusé de violation des droits de l’homme à plusieurs reprises. il a décrit les allégations comme “mensonges absolus et de la désinformation.” Le porte-parole de Kadyrov, Alvi Karimov a déclaré à l’Agence Interfax Nouvelles: “Vous ne pouvez pas arrêter ou réprimer des gens qui n’existent pas dans la république.” Selon le New York Times, les homosexuels dans la région ont procédé à l’effacement de toutes traces sur les réseaux sociaux, blogs et sites de rencontre après qu’il a été rapporté que les autorités essayaient d’attirer les hommes gays dans des guets-apens pour les arrêter. La France semble peu s’en soucier tant le silence médiatique est assourdissant ! Les presses anglo-saxonne et américaine sont les seules à prendre la mesure de la gravité de la situation. Nous demandons aux dirigeants européens de prendre des mesures de vérification et d’entreprendre des actions de protection pour protéger cette minorité persécutée. Nous demandons aux candidats à l’élection présidentielle de s’exprimer publiquement sur le sujet. Nous demandons aux journalistes des médias mainstream de faire leur travail d’investigation et de relayer massivement l’information pour une prise de conscience collective. Le silence médiatique français est inacceptable. Il est coupable ! Faut-il attendre de compter les morts et les charniers pour s’en émouvoir et en faire votre UNE ? Il est temps de faire votre travail. La presse étrangère s’en charge, pourquoi ce silence ? Il est incompréhensible. Ne commettons pas les erreurs du passé à regarder de loin en se demandant si les faits sont avérés et si les morts s’y accumulent vraiment… Mehdi AIFA Président de l’Amicale des Jeunes du Refuge. m.aifa@le-refuge.org tel: 06.01.32.31.43 Source : * dailymail* thesun* rfi* courrierinternational* thenewyorktime* novayagazeta* france24 — MAJ : Paris Match Belgique vient à l’instant de publier un article faisant écho à notre dénonciation : https://parismatch.be/actualites/societe/31495/tchetchenie-homosexuels-prisons-camps-concentration ", "title": "La Tchétchénie ouvre un camp de concentration pour les homosexuels.", "sentences": [{"df6a": "La Tchétchénie ouvre un camp de concentration pour les homosexuels."}, {"8a17": "Ils sont torturés à l’électricité et battus à mort."}, {"2a8e": "Le Président Ramzan Kadyrov allié clé de Vladimir Poutine, aurait ordonné une répression sans précédent."}, {"9f9e": "Premier camp de concentration pour les homosexuels depuis Hitler."}, {"a8a5": "Ceux qui ont fui ont rapportés que les prisonniers étaient battus et torturés. Forcés à révéler d’autres membres de la communauté gay"}, {"1319": "Plus d’une centaine d’homosexuels ont été arrêtés et trois tués la semaine dernière en Tchétchénie."}, {"c7bc": "Un rapport de Novaya Gazeta dit que les autorités auraient mis en place plusieurs camps où les homosexuels seraient tués ou contraints de promettre de quitter la République Tchétchénie."}, {"1a53": "L’un des camps est apparemment l’ancien quartier général militaire de la ville d’Argoun. Aucunes sources ne le confirme mais les témoignages convergent."}, {"ce22": "Svetlana Zakharova, du Réseau LGBT russe, a déclaré : “Des homosexuels ont été arrêtés et nous travaillons pour évacuer les gens des camps et certains, par crainte, ont quitté la région.”“Ceux qui y ont échappé disent qu’ils sont détenus dans une seule et même pièce, environ 30 ou 40 personnes. Ils sont torturés avec des courants électriques et sauvagement battus, parfois, jusqu’à la mort.”"}, {"c01b": "Ceux qui se sont échappés, dit Novoya Gazeta ont rapportés que “les prisonniers ont été battus pour les forcer à révéler d’autres membres de la communauté gay dans la région.”"}, {"009e": "Un autre prisonnier qui a fui dit que, avant d’être incarcéré dans l’un des camps, il avait été contraint de payer des pots de vin à la police tchétchène pour survivre."}, {"8efe": "Alexander Artemyev, d’Amnesty International en Russie, a déclaré : “Nous ne pouvons appeler les autorités russes à enquêter sur les allégations. Les homosexuels ont peur de parler. Ils doivent se cacher ou quitter la république.”"}, {"a469": "Nous maintenons le contact avec le réseau LGBT local qui aide les gens à trouver un abri. Le problème est que les gens là-bas ne peuvent pas parler car ils mettent leur vie en danger."}, {"c777": "Ekaterina Sokirianskaia, directrice de projet pour l’International Crisis Group, a déclarée : “La situation se développe et ne fait qu’empirer, les victimes fuient.”"}, {"62cf": "Tanya Lokshina, de Human Rights Watch à Moscou, a déclarée: “Depuis plusieurs semaines, une campagne brutale contre les personnes LGBT se passe en Tchétchénie”"}, {"a4b6": "“Ces jours-ci, très peu de gens en Tchétchénie n’osent parler aux observateurs des droits de l’homme ou aux journalistes, même de façon anonyme parce que le climat de peur est écrasant et les gens ont été intimidés, intimés de garder le silence sous peine de représailles.”"}, {"217d": "Les personnes LGBT sont vulnérables en Tchétchénie, l’homophobie est intense et endémique. Les personnes LGBT sont en danger, non seulement la persécution se fait par les autorités, mais aussi par sa propre famille. Régulièrement des «crimes d’honneur» sont répertoriés."}, {"02d5": "Le président Ramzan Kadyrov, aurait ordonné la répression, bien qu’officiellement son régime ait nié les arrestations en affirmant “qu’il est impossible de les persécuter parce que les gays n’existent pas en Tchétchénie.”"}, {"e016": "Kadyrov, qui a introduit la loi islamique dans la région, à majorité musulmane, a été accusé de violation des droits de l’homme à plusieurs reprises."}, {"7dd6": "il a décrit les allégations comme “mensonges absolus et de la désinformation.”"}, {"37d7": "Le porte-parole de Kadyrov, Alvi Karimov a déclaré à l’Agence Interfax Nouvelles: “Vous ne pouvez pas arrêter ou réprimer des gens qui n’existent pas dans la république.”"}, {"9823": "Selon le New York Times, les homosexuels dans la région ont procédé à l’effacement de toutes traces sur les réseaux sociaux, blogs et sites de rencontre après qu’il a été rapporté que les autorités essayaient d’attirer les hommes gays dans des guets-apens pour les arrêter."}, {"4958": "La France semble peu s’en soucier tant le silence médiatique est assourdissant ! Les presses anglo-saxonne et américaine sont les seules à prendre la mesure de la gravité de la situation."}, {"9dff": "Nous demandons aux dirigeants européens de prendre des mesures de vérification et d’entreprendre des actions de protection pour protéger cette minorité persécutée."}, {"3ac0": "Nous demandons aux candidats à l’élection présidentielle de s’exprimer publiquement sur le sujet."}, {"6c50": "Nous demandons aux journalistes des médias mainstream de faire leur travail d’investigation et de relayer massivement l’information pour une prise de conscience collective."}, {"2839": "Le silence médiatique français est inacceptable. Il est coupable !"}, {"b7f4": "Faut-il attendre de compter les morts et les charniers pour s’en émouvoir et en faire votre UNE ? Il est temps de faire votre travail. La presse étrangère s’en charge, pourquoi ce silence ? Il est incompréhensible."}, {"1498": "Ne commettons pas les erreurs du passé à regarder de loin en se demandant si les faits sont avérés et si les morts s’y accumulent vraiment…"}, {"d7e1": "Mehdi AIFA"}, {"e30c": "Président de l’Amicale des Jeunes du Refuge."}, {"ea63": "m.aifa@le-refuge.org tel: 06.01.32.31.43"}, {"ea5d": "Source : * dailymail* thesun* rfi* courrierinternational* thenewyorktime* novayagazeta* france24"}, {"4f96": "— MAJ : Paris Match Belgique vient à l’instant de publier un article faisant écho à notre dénonciation : https://parismatch.be/actualites/societe/31495/tchetchenie-homosexuels-prisons-camps-concentration"}], "child": "1136_1\t1136_2\t1136_3\t1136_4\t1136_5\t1136_6\t1136_7\t1136_8\t1136_9\t1136_10\t1136_11\t1136_12\t1136_13\t1136_14\t1136_15\t1136_16\t1136_17\t1136_18\t1136_19\t1136_20\t1136_21\t1136_22\t1136_23\t1136_24\t1136_251136_1\t1136_2\t1136_3\t1136_4\t1136_5\t1136_6\t1136_7\t1136_8\t1136_9\t1136_10\t1136_11\t1136_12\t1136_13\t1136_14\t1136_15\t1136_16\t1136_17\t1136_18\t1136_19\t1136_20\t1136_21\t1136_22\t1136_23\t1136_24\t1136_25"}