{"name": "114", "parent": "", "content": "How the Knicks Can Quickly Rebuild Without Tanking In New York, a slow and true rebuild is never an option. Here’s how the Knicks can quickly reshuffle the pieces and maximize their draft pick to become relevant in 2018. Photo: Tony Gutierrez/AP Much has been made of the Knicks potentially tanking this season to move up in the lottery and draft a young player to pair with Kristaps Porzingis. Of course, tanking would require a full rebuild of the team, meaning at the very least dealing away Carmelo Anthony and letting Derrick Rose walk in free agency. via The Knicks Wall/SoundCloud Currently, a Carmelo trade certainly seems like a possibility, but his no-trade clause could be the reason New York doesn’t go through a full rebuild and has to re-tool in the offseason with the main core of the roster still intact. So, if the Knicks don’t go all the way with a full rebuild this year and once again have to add to the roster on the fly in the summer, how would they finish out the season and improve through the draft and free agency? Here’s how it could go down: Photo: Tony Gutierrez/AP According to Adrian Wojnarowski of Yahoo Sports, Phil Jackson is “determined to rid the roster of Anthony and his contract, and start rebuilding around Kristaps Porzingis.” However, Carmelo’s no-trade clause, which allows him to veto any trade he doesn’t approve of, makes him the deciding factor in whether or not he’ll be traded. If Anthony doesn’t like the move, he doesn’t have to leave. In addition to the NTC, there’s also a good chance the Knicks won’t be able to find a trade offer in which they receive an equal haul for Anthony and he stays in New York. So, if Carmelo remains with the Knicks, how would they finish off the season? New York is currently projected to win 35 games, miss the playoffs (via FiveThirtyEight), and get the 11th overall pick in the draft (per Tankathon). Give or take a few games, and the Knicks could slip into the eighth seed while their pick loses value, or end up with a more valuable pick as they fall lower in the standings. New York Should Move Derrick Rose to the Shooting Guard PositionA quick change in the guard’s role on the court could do wonders in Rose’s productivity with the Knickstheknickswall.com Say the projections are correct and the Knicks miss the playoffs and finish with one of the top ten worst records in the league. New York could jump or fall a few spots in the lottery, but would likely pick around the tenth spot. Mock drafts currently have the Knicks selecting anyone from point guard De’Aaron Fox out of Kentucky, to Miles Bridges out of Michigan State. If New York can hop up in the lotto, going with a point guard in Fox and letting Rose walk in free agency would make the most sense. While he has been somewhat effective thus far in his first season with the Knicks, Rose is said to be looking for a max-contract, which New York won’t give him if they have any clue what they’re doing. Kentucky’s De’Aaron Fox (Photo: Mark Zerof/USA TODAY Sports) If the Knicks get a lower pick, or even remain at around ten, Miles Bridges out Michigan State or Harry Giles out of Duke would also make sense. Both can play four, and could make for a deadly frontcourt in just a few years. Drafting a big would cause problems with the roster though, as Joakim Noah would almost have to be traded, and the Knicks would have to roll the dice on a point guard in free agency. Following the draft, the Knicks would have to put the final pieces in place during free agency. Derrick Rose, Brandon Jennings, Justin Holiday, Ron Baker, and Sasha Vujacic will all be free agents in the offseason, and New York will have to make some decisions regarding who they want to go with long-term. No One From the Knicks Will Play on the 2017 All-Star TeamThe annual game, this year in New Orleans, does not feature any New York players for the first time since 2009theknickswall.com If New York selects a guard in the draft, Rose will likely walk with his spot on the roster compromised and the Knicks will have to focus on bolstering their bench. Brandon Jennings could easily be re-signed, but if the front office would rather go with someone new, Darren Collison or even Jrue Holiday could be an option found in free agency to come off the bench and back up a rookie guard. If Phil wants to go cheap, there’s always Ron Baker, who should be re-signed regardless. Baker has played surprisingly well this season, but I’m not sure if he’d be quite ready to take on too many minutes off the bench every game yet. Holiday will likely be re-signed for his ability to score off the bench this year, and Sasha “Triangle” Vujacic will likely get a spot on the roster as well, if he wants it. (Editor’s note: please no.) Photo: Tom Zweibel If the Knicks go the other direction in the draft and draft a big rather than a guard, they’ll have to focus on their backcourt in free agency. I like to think New York will let Derrick Rose and his max-contract dreams walk, but re-signing an injury-prone vet for $120 million just seems like such a Knicks move. If they don’t want to go with Rose, though, there are plenty of point-guard options in free agency. Jeff Teague, George Hill, and Jrue Holiday are all going to be looking for new contracts this offseason, and any of these players on an appropriate contract seem like a much better move than re-signing Rose on a max. The Knicks could actually have a pretty decent roster coming out of free agency, and could of course make a trade or two afterwards to bolster it. Hopefully Joakim Noah’s contract can be moved, especially if the Knicks draft a big. In my opinion, what would be best for this team would be an all-out rebuild. However, that can be hard to accomplish with the current pieces on the roster, so a quick re-tool with the same core guys this offseason doesn’t seem so bad. By moving a few pieces around and drafting the right player, the Knicks could have a good mix of young and old and possibly (Maybe? Please?) make the playoffs next season. — Peter Saclarides, senior writer Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud. ", "title": "How the Knicks Can Quickly Rebuild Without Tanking", "sentences": [{"9ad1": "How the Knicks Can Quickly Rebuild Without Tanking"}, {"316d": "In New York, a slow and true rebuild is never an option. Here’s how the Knicks can quickly reshuffle the pieces and maximize their draft pick to become relevant in 2018."}, {"a7fe": "Photo: Tony Gutierrez/AP"}, {"17ea": "Much has been made of the Knicks potentially tanking this season to move up in the lottery and draft a young player to pair with Kristaps Porzingis."}, {"bef6": "Of course, tanking would require a full rebuild of the team, meaning at the very least dealing away Carmelo Anthony and letting Derrick Rose walk in free agency."}, {"2ba5": "via The Knicks Wall/SoundCloud"}, {"6653": "Currently, a Carmelo trade certainly seems like a possibility, but his no-trade clause could be the reason New York doesn’t go through a full rebuild and has to re-tool in the offseason with the main core of the roster still intact."}, {"6b4d": "So, if the Knicks don’t go all the way with a full rebuild this year and once again have to add to the roster on the fly in the summer, how would they finish out the season and improve through the draft and free agency? Here’s how it could go down:"}, {"95a7": "Photo: Tony Gutierrez/AP"}, {"2818": "According to Adrian Wojnarowski of Yahoo Sports, Phil Jackson is “determined to rid the roster of Anthony and his contract, and start rebuilding around Kristaps Porzingis.” However, Carmelo’s no-trade clause, which allows him to veto any trade he doesn’t approve of, makes him the deciding factor in whether or not he’ll be traded. If Anthony doesn’t like the move, he doesn’t have to leave. In addition to the NTC, there’s also a good chance the Knicks won’t be able to find a trade offer in which they receive an equal haul for Anthony and he stays in New York."}, {"15de": "So, if Carmelo remains with the Knicks, how would they finish off the season? New York is currently projected to win 35 games, miss the playoffs (via FiveThirtyEight), and get the 11th overall pick in the draft (per Tankathon). Give or take a few games, and the Knicks could slip into the eighth seed while their pick loses value, or end up with a more valuable pick as they fall lower in the standings."}, {"9eac": "New York Should Move Derrick Rose to the Shooting Guard PositionA quick change in the guard’s role on the court could do wonders in Rose’s productivity with the Knickstheknickswall.com"}, {"59e4": "Say the projections are correct and the Knicks miss the playoffs and finish with one of the top ten worst records in the league. New York could jump or fall a few spots in the lottery, but would likely pick around the tenth spot. Mock drafts currently have the Knicks selecting anyone from point guard De’Aaron Fox out of Kentucky, to Miles Bridges out of Michigan State. If New York can hop up in the lotto, going with a point guard in Fox and letting Rose walk in free agency would make the most sense."}, {"fbbf": "While he has been somewhat effective thus far in his first season with the Knicks, Rose is said to be looking for a max-contract, which New York won’t give him if they have any clue what they’re doing."}, {"f502": "Kentucky’s De’Aaron Fox (Photo: Mark Zerof/USA TODAY Sports)"}, {"7bf2": "If the Knicks get a lower pick, or even remain at around ten, Miles Bridges out Michigan State or Harry Giles out of Duke would also make sense. Both can play four, and could make for a deadly frontcourt in just a few years. Drafting a big would cause problems with the roster though, as Joakim Noah would almost have to be traded, and the Knicks would have to roll the dice on a point guard in free agency."}, {"c15a": "Following the draft, the Knicks would have to put the final pieces in place during free agency. Derrick Rose, Brandon Jennings, Justin Holiday, Ron Baker, and Sasha Vujacic will all be free agents in the offseason, and New York will have to make some decisions regarding who they want to go with long-term."}, {"6e91": "No One From the Knicks Will Play on the 2017 All-Star TeamThe annual game, this year in New Orleans, does not feature any New York players for the first time since 2009theknickswall.com"}, {"498a": "If New York selects a guard in the draft, Rose will likely walk with his spot on the roster compromised and the Knicks will have to focus on bolstering their bench."}, {"8b03": "Brandon Jennings could easily be re-signed, but if the front office would rather go with someone new, Darren Collison or even Jrue Holiday could be an option found in free agency to come off the bench and back up a rookie guard."}, {"78a0": "If Phil wants to go cheap, there’s always Ron Baker, who should be re-signed regardless. Baker has played surprisingly well this season, but I’m not sure if he’d be quite ready to take on too many minutes off the bench every game yet. Holiday will likely be re-signed for his ability to score off the bench this year, and Sasha “Triangle” Vujacic will likely get a spot on the roster as well, if he wants it. (Editor’s note: please no.)"}, {"799e": "Photo: Tom Zweibel"}, {"a5f4": "If the Knicks go the other direction in the draft and draft a big rather than a guard, they’ll have to focus on their backcourt in free agency. I like to think New York will let Derrick Rose and his max-contract dreams walk, but re-signing an injury-prone vet for $120 million just seems like such a Knicks move. If they don’t want to go with Rose, though, there are plenty of point-guard options in free agency. Jeff Teague, George Hill, and Jrue Holiday are all going to be looking for new contracts this offseason, and any of these players on an appropriate contract seem like a much better move than re-signing Rose on a max."}, {"8e0f": "The Knicks could actually have a pretty decent roster coming out of free agency, and could of course make a trade or two afterwards to bolster it. Hopefully Joakim Noah’s contract can be moved, especially if the Knicks draft a big."}, {"2fc1": "In my opinion, what would be best for this team would be an all-out rebuild. However, that can be hard to accomplish with the current pieces on the roster, so a quick re-tool with the same core guys this offseason doesn’t seem so bad. By moving a few pieces around and drafting the right player, the Knicks could have a good mix of young and old and possibly (Maybe? Please?) make the playoffs next season."}, {"26cd": "— Peter Saclarides, senior writer"}, {"f5a8": "Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud."}], "child": "114_1114_1"}