{"name": "1140", "parent": "", "content": "Out of Sight Out of Mind The Erasure of LGBTQ People from Society Public Displays of Affection for gay men still challenging: Source In Australia, the LGBTQ community remains in a long and protracted fight to gain marriage equality. We still do not have it. In 2004, when conservative Prime Minister John Howard summarily changed the wording of the Marriage Act, which actually specified no gender at all, to enshrine in law that marriage would only be between a man and a woman, a contest between the gay community and the conservatives began that has raged ever since. In that same year, 2004, three senators, Michael Organ of the Australian Greens and Natasha Stott Despoja and Andrew Bartlett of the Australian Democrats, sponsored Australia’s first ever marriage equality bill. Needless to say, it was defeated, by both the conservatives and the Labor Party, and to this day, thirteen years later, Australia still does not have marriage equality. In recent months, the LGBTQ community has noticed that opponents of marriage equality have all but ceased arguing the substantive issues in the debate, and instead of discussing marriage, have targeted children, free speech, freedom of religion, the workplace, the wearing of acceptance rings, the claim of its own victimisation, and so-called bullying by LGBTQ people; in other words, anything else but marriage equality. Part of this redirection, has been a willingness to return to old anti-gay tropes such as: This reaction, beginning to gain traction in conservative discourse, is a piece of ugliness from a by-gone era, one that has its roots in the concept of heteronormativity; the idea that everyone is straight or should be, and that anyone not conforming to this sexual identification is either abnormal or sick or sinful. When this was the every day attitude in the 1940s, 50s and 60s, the LGBTQ community was visible only in our own ghettos, but invisible to wider society. On the world stage, Cary Grant, Rock Hudson, Laurence Olivier, Cole Porter, Anthony Perkins, Greta Garbo and Elanor Roosevelt were all gay, but no-one knew. Here in Australia, late night talk show host, the King, Graham Kennedy, was gay, but outside the close-knit television community, no-one knew. Historically, we know the winners of wars write the histories; at least the initial ones. In the West, history has traditionally been Western, white, victorious, Christian, male and straight. Those who do not belong in those categories of privilege rarely get a mention in the history books, unless it’s a special case or a funny little story to go with the main story. In other words, erasure. LGBTQ people have been erased from history since we started writing history. It is only now that queer histories are being written or inserted into the larger human drama. Nowadays, we do read of the gay soldiers in the trenches of WWI. We hear of the lesbian nurses in the field hospitals of WWII. We read of gay people in sport, in science, in the theatre and movies, in politics, in education, in medicine, in space exploration, in the armed services and in the police. But despite this latter day resurgence of queer history and queer stories being consciously reinserted into the wider panorama of history, originally, all these lives and stories, all definitely there, definitely present, were erased. No-one knew. It was as if we had never been there. Now in Australia, conservatives, both political and religious, are trying the same again. This move springs from a discomfort with gay people and the LGBTQ community being too present, too public and being seen as a contributing part of society, all around and in every sphere. Such a presence totally subverts the old heteronormative straight society, a society that was actually a myth and whose opacity is now being exploded into clarity and transparency by the inexorable march to wider acceptance of the LGBTQ community by wider society. But there is kick-back. The watchdog bureau for television advertising in Australia, the Australian Standards Board, has released its findings on a complaint about a recent Magnum ice-cream advertisement depicting two brides at their wedding each having a bite of a Magnum in an intimate moment. The Board threw the complaint out saying, “in today’s society, it is not inappropriate to show gay intimacy”. But look at an excerpt of the complaint and note the language used. “Promotion of lesbianism during family viewing time. I know this will not be taken seriously as ramming this down our throats now happens daily”. Magnum Brides: Source These conservative forces don’t want public displays of affection between gay people. They don’t want to see men holding hands. They don’t even want to see women offering a bite of an ice-cream together. They don’t want sex education in the schools to mention the scientific fact of human sexual diversity. They only want straight sex education to be taught, despite the fact that statistically, gay people are about 5% to 7% of the population. They don’t want kids to know that gay people exist, that transgendered people exist. They fight school libraries that might want to stock story books or fairy-tales that have same-sex relationships in them too. They don’t want teens to be able to access LGBTQ information online. They throw around phrases like “confusing our kids” and “the rainbow agenda” and “the radical gay agenda”, implying that gay people want to corrupt young people. What they are comfortable with is enforcing the LGBTQ community being viewed as different. They want to keep the gays ‘othered’ and abnormal. Deviated from the straight and healthy. This is us over here, healthy, straight and normal, and that is them over there, unhealthy, gay and abnormal. Our relationships, healthy, normal and first-rate. Their relationships, unhealthy, abnormal and second-rate. The last thing they want is for gay people, or LGBTQ folk generally, to be thought of as normal and healthy. In other words, like them. That is a bridge too far. “They’re not like us. They are nothing like us,” goes the secret rationale. To such thinkers, LGBTQ people are ontologically different. That is why they oppose us getting married. In their estimation, although they would never admit it publicly, they see us as inferior and our relationships as inferior to theirs. These reactionary forces of conservatism come from both politics and religion. Conservative politicians, fundamentalist Christians, para-political, and para-religious groups are the most vocal offenders. Because of the marriage equality debate, they think “this gay thing has gotten out of hand”, that “there’s a gay on every corner of every street and it’s all too much now. Enough is enough. Why don’t the gays just shut up, get back in their box and understand that this country is not all about them”? That’s the sentiment. So once again, they are trying erasure. Erase us, this time not from history, but from the present. From society. So that, with enough conservative pressure, we will acquiesce to forces greater than us and will slink quietly back into our ghettos and society can once again be seen as the normative straight society they believe it should be and gays can be thought of as ‘other’ and ‘different’. In the public space - No gays. No queers. No LGBTQ. Oh, you can stay on the stage and in the theatre, but that’s all! They claim on their television appearances and on their public blogs that they are happy for us to be here in society, but deep down and in the privacy of their own in-house conversations, they really do want us erased. Out of sight out of mind. PS. When hell freezes over! ", "title": "Out of Sight Out of Mind", "sentences": [{"9571": "Out of Sight Out of Mind"}, {"da0a": "The Erasure of LGBTQ People from Society"}, {"bf07": "Public Displays of Affection for gay men still challenging: Source"}, {"3536": "In Australia, the LGBTQ community remains in a long and protracted fight to gain marriage equality. We still do not have it. In 2004, when conservative Prime Minister John Howard summarily changed the wording of the Marriage Act, which actually specified no gender at all, to enshrine in law that marriage would only be between a man and a woman, a contest between the gay community and the conservatives began that has raged ever since. In that same year, 2004, three senators, Michael Organ of the Australian Greens and Natasha Stott Despoja and Andrew Bartlett of the Australian Democrats, sponsored Australia’s first ever marriage equality bill. Needless to say, it was defeated, by both the conservatives and the Labor Party, and to this day, thirteen years later, Australia still does not have marriage equality."}, {"3e78": "In recent months, the LGBTQ community has noticed that opponents of marriage equality have all but ceased arguing the substantive issues in the debate, and instead of discussing marriage, have targeted children, free speech, freedom of religion, the workplace, the wearing of acceptance rings, the claim of its own victimisation, and so-called bullying by LGBTQ people; in other words, anything else but marriage equality. Part of this redirection, has been a willingness to return to old anti-gay tropes such as:"}, {"9a5b": "This reaction, beginning to gain traction in conservative discourse, is a piece of ugliness from a by-gone era, one that has its roots in the concept of heteronormativity; the idea that everyone is straight or should be, and that anyone not conforming to this sexual identification is either abnormal or sick or sinful. When this was the every day attitude in the 1940s, 50s and 60s, the LGBTQ community was visible only in our own ghettos, but invisible to wider society. On the world stage, Cary Grant, Rock Hudson, Laurence Olivier, Cole Porter, Anthony Perkins, Greta Garbo and Elanor Roosevelt were all gay, but no-one knew. Here in Australia, late night talk show host, the King, Graham Kennedy, was gay, but outside the close-knit television community, no-one knew."}, {"8141": "Historically, we know the winners of wars write the histories; at least the initial ones. In the West, history has traditionally been Western, white, victorious, Christian, male and straight. Those who do not belong in those categories of privilege rarely get a mention in the history books, unless it’s a special case or a funny little story to go with the main story."}, {"aa46": "In other words, erasure."}, {"c24e": "LGBTQ people have been erased from history since we started writing history. It is only now that queer histories are being written or inserted into the larger human drama. Nowadays, we do read of the gay soldiers in the trenches of WWI. We hear of the lesbian nurses in the field hospitals of WWII. We read of gay people in sport, in science, in the theatre and movies, in politics, in education, in medicine, in space exploration, in the armed services and in the police. But despite this latter day resurgence of queer history and queer stories being consciously reinserted into the wider panorama of history, originally, all these lives and stories, all definitely there, definitely present, were erased. No-one knew. It was as if we had never been there."}, {"55b9": "Now in Australia, conservatives, both political and religious, are trying the same again. This move springs from a discomfort with gay people and the LGBTQ community being too present, too public and being seen as a contributing part of society, all around and in every sphere. Such a presence totally subverts the old heteronormative straight society, a society that was actually a myth and whose opacity is now being exploded into clarity and transparency by the inexorable march to wider acceptance of the LGBTQ community by wider society."}, {"027f": "But there is kick-back. The watchdog bureau for television advertising in Australia, the Australian Standards Board, has released its findings on a complaint about a recent Magnum ice-cream advertisement depicting two brides at their wedding each having a bite of a Magnum in an intimate moment. The Board threw the complaint out saying, “in today’s society, it is not inappropriate to show gay intimacy”. But look at an excerpt of the complaint and note the language used. “Promotion of lesbianism during family viewing time. I know this will not be taken seriously as ramming this down our throats now happens daily”."}, {"0002": "Magnum Brides: Source"}, {"e9c1": "These conservative forces don’t want public displays of affection between gay people. They don’t want to see men holding hands. They don’t even want to see women offering a bite of an ice-cream together. They don’t want sex education in the schools to mention the scientific fact of human sexual diversity. They only want straight sex education to be taught, despite the fact that statistically, gay people are about 5% to 7% of the population. They don’t want kids to know that gay people exist, that transgendered people exist. They fight school libraries that might want to stock story books or fairy-tales that have same-sex relationships in them too. They don’t want teens to be able to access LGBTQ information online. They throw around phrases like “confusing our kids” and “the rainbow agenda” and “the radical gay agenda”, implying that gay people want to corrupt young people."}, {"87a9": "What they are comfortable with is enforcing the LGBTQ community being viewed as different. They want to keep the gays ‘othered’ and abnormal. Deviated from the straight and healthy. This is us over here, healthy, straight and normal, and that is them over there, unhealthy, gay and abnormal. Our relationships, healthy, normal and first-rate. Their relationships, unhealthy, abnormal and second-rate. The last thing they want is for gay people, or LGBTQ folk generally, to be thought of as normal and healthy. In other words, like them. That is a bridge too far. “They’re not like us. They are nothing like us,” goes the secret rationale. To such thinkers, LGBTQ people are ontologically different. That is why they oppose us getting married. In their estimation, although they would never admit it publicly, they see us as inferior and our relationships as inferior to theirs."}, {"2072": "These reactionary forces of conservatism come from both politics and religion. Conservative politicians, fundamentalist Christians, para-political, and para-religious groups are the most vocal offenders. Because of the marriage equality debate, they think “this gay thing has gotten out of hand”, that “there’s a gay on every corner of every street and it’s all too much now. Enough is enough. Why don’t the gays just shut up, get back in their box and understand that this country is not all about them”? That’s the sentiment."}, {"cd48": "So once again, they are trying erasure. Erase us, this time not from history, but from the present. From society. So that, with enough conservative pressure, we will acquiesce to forces greater than us and will slink quietly back into our ghettos and society can once again be seen as the normative straight society they believe it should be and gays can be thought of as ‘other’ and ‘different’."}, {"8dd3": "In the public space - No gays. No queers. No LGBTQ. Oh, you can stay on the stage and in the theatre, but that’s all!"}, {"d1a2": "They claim on their television appearances and on their public blogs that they are happy for us to be here in society, but deep down and in the privacy of their own in-house conversations, they really do want us erased."}, {"2676": "Out of sight out of mind."}, {"476c": "PS. When hell freezes over!"}], "child": "1140_1"}