{"name": "1143", "parent": "", "content": "Grieving Ain’t Easy I was widowed at 34 years old. I never thought I’d be sitting here, currently 35, writing somewhat objectively about the death of my dear ex-husband, Gery, and how it has affected me in this seemingly never-ending grieving process. Yet here I am, a little over 7 months after his passing, feeling like an overwhelmed, wounded, yet empowered puppy with a strong desire to share my honest and raw experiences. Hopefully my ramblings will guide other grievers, supporters, and curious folks into a healthy place of peace, mindfulness, love, and compassion. But first, let’s talk about wEirD. “wEirD” My husband Gery was a Texas-raised state worker, a certified bubba, and a hyper-talented ceramic artist. His family called him “wEirD,” which appropriately described his unique, Southwest-meets-Pee Wee Herman aesthetic, and his raw, honest, goofy, colorful, and emotionally evocative approach to life. He was the walking, talking, and farting epitome of a “gentle giant,” towering above the world at 6'6\", 300 pounds. Between his plus-sized presence and vibrant tie-dye-and-overalls looks (complete with delicately manicured beard and flawless Stetson hat), he stood out in every crowd. He was also super easy to spot when we lost each other in a crowd. wEirD was 26 years older than me (everyone thought he was my dad), but through our commitment to honest, open communication and gentle, respectful love for one another, we joyously coexisted for 12 glorious years. Proudly, we were one of the first few hundred gay couples in Texas to wed the day same-sex marriage was legalized in the USA, back in June of 2015. All good things… In mid-2016, just a few months after his epic 60th birthday party (or his 15th, in leap baby years), he started feeling intense, sharp pains in his belly that weren’t going away. Initially, he thought it was indigestion or an angry gallbladder, but after several tests, he was diagnosed with pancreatic cancer, stage IV. It was already spreading to other parts of his body, and we were told he had 2 to 3 months to live. When Gery became sick, I immediately stopped working and assumed the role of full-time caregiver. I was with him basically 24/7, scheduling endless tests and procedures, deliriously waking up every couple of hours to give him numerous medications, trying to be an accommodating host for visitors, and posting updates to a private Facebook group. I was insanely stressed out, sad, angry, terrified, helpless, confused, and utterly exhausted. I remember thinking to myself, “Why is this happening to us? Am I being punished?” The feeling of wanting him to be out of pain was absolutely stifling. I felt like I was living in a horror movie, watching his body rapidly weaken and deteriorate right before my eyes. There was nothing I could do, other than tend to his needs and be as present and loving as possible. I held his hand and watched him as he took his final mortal breaths. I’ll never forget his last bizarre gasp of energy. He gently grabbed onto my shirt, somehow pulled himself forward, looked straight ahead into the backyard with his giant, gorgeous, bluebonnet blue eyes, and let nature take his consciousness eternally. It was the most beautiful, bizarre, frightening, surreal, and challenging moment I have ever witnessed. He passed away peacefully at our home, not even 30 days after his cancer diagnosis. It’s oh, so quiet The next morning after Gery passed, I woke up feeling incredibly confused and shocked at how quiet and vastly empty the house felt. I cried my eyes out, wondering why my darling baby G wasn’t in the bed next to me, snoring away like usual. Why wasn’t he in the kitchen, meticulously crafting his famous iced coffee? The house was set up as if he was still there, ready to slip into his boots, give his teeth a good brushing, and complete his morning ritual, before kissing me goodbye and dipping out to his ceramic art studio. The emptiness I experienced in coming to grips with his physical absence was, and has been, stronger and more challenging than any emotion I’ve ever felt. I was desperately hoping I would wake up from the nightmare, and poof! It was all a dream. But he’s really, truly gone. Ready or not… The grief process began immediately, whether I was ready for it or not (I wasn’t). I experienced new moments of social anxiety, stress, depression, and sadness at a depth I’ve never felt before, or even knew I was capable of having. I was constantly drowned by overwhelming waves of almost PTSD-style flashbacks of the horrors of watching his body weaken, or the expression on his face when he passed away, or my intense longing to hold him just one more time as we fell asleep in each other’s arms. I cried profusely as I discarded piles of his unused medications and as I slowly combed through his clothes and possessions, confused as to whether I should keep or donate everything. Would Gery get upset at me for donating his underwear? (Sorry baby, I had to!) I had almost zero drive to work on my art or music for several months, which was entirely uncharacteristic for an obsessive creator like me. I simply didn’t know what to do with myself. Luckily, I have a truly amazing support network who flooded my house with casseroles, Gery-inspired artwork, and countless stories, hugs, and tears. My best friend and I took a spontaneous trip to an empty, dusty Louisiana casino on a random weeknight, devouring authentic poboys the next day. I did a performance at a dirty local punk bar, where I improvised a spoken word piece over an extremely challenging audio recording I made of Gery’s breathing patterns the night before he passed. I drove out to west Texas on an “Ashes Adventure,” in which I spread Gery’s ashes onto some of his favorite rustic landscapes with family by my side. Every action and emotion I have had the energy to release in my grieving process has been beautifully and tragically cathartic. Grieving is constantly bittersweet and wildly exhausting. If I start to feel tears come, I let them out in full force, sometimes wailing on the floor in anguish, if needed. I don’t hold any tears back, or set them aside for later, even if I’m at the grocery store or a social gathering. If other people have a problem with it, that’s their problem, not mine. I welcome all emotions to gather deep within me — from light to dark, happy to sad, joy to terror. I stop what I’m doing to let the emotion fill me up like a balloon, and once it passes through me, I usually feel like a huge, honking weight has been lifted off my shoulders. The balloon pops and it’s sometimes filled with confetti. I “feel everything,” as Gery would tell me. Don’t you want me, baby? In my early grieving process, I was warned from supporters who had also lost loved ones that the initial huge wave of support might dissipate after a few weeks, then I’d be left alone to figure out what to do with my life. They were almost 100% correct. It felt as if a magic carpet of comfort and security was suddenly ripped away from my feet, spitting me out like a stumbling baby, perplexed by the mysterious, new world in front of them. I was only 22 when Gery and I met, and I had spent the last 12 years building a symbiotic storyline based around the concept of “us.” Then, all of a sudden, it was just “me.” What the hell do I do with my life now? Yearning for interaction and support, I started posting photos of Gery to Facebook, detailing an anecdote with each photo, what it meant to me, and how Gery made each moment so magical. The cathartic posts received a pile of likes and comments, which filled the void temporarily. However, I started to sense that many people seemed tongue-tied about how to actually talk to me about my grieving experience and death in general. So many people have told me, “I’m sorry for your loss” and “I can’t imagine what you’re going through,” but the conversation usually ends there, in awkward silence. I know those people genuinely mean well, but I’m also not quite sure how to respond to those statements. “Thanks” seems to quickly get the job done. I’m rarely asked how I’m actually doing. It makes me wonder: Do people actually want to know what I’m going through when they tell me they can’t imagine what I’m going through? Do they hesitate, imagining me falling to my knees and bawling into their perfectly-hemmed dress or pant leg? Are they gambling with the devil when their morbid curiosity might taint their oh-so happy day with stormclouds of sadness? Let’s talk about grief, baby Grieving is a multi-layered, sensitive, touchy topic. It’s not exactly the sexiest thing to discuss while eating out with friends, or while twerking with your cousins at a wedding. There is no “right” or “wrong” — or even “best” or “worst” — way to talk about grief. Every situation is beautifully unique and nuanced with countless experiences, emotions, and circumstances that led up to where and who we are today. We’re not given a handy guidebook for emotionally and physically dealing with death and the grieving process that follows. Instead, grievers (and sensitive souls) are conditioned with the highly unrealistic and dangerous expectation to magically “power through” emotions, to hide and hold back our tears, and to view our deepest feelings as overreactions and expressions of weakness. Supporters of the grieving seem similarly limited to a vague, campy set of Hallmark-esque “I’m sorry for your loss” and “time heals everything” slogans to rehash and sell on bumper stickers at shopping malls. How many times have we watched Hollywood depict widows dramatically crying for a day, then triumphantly re-immersing themselves back into the world with a nothing-will-stop-me-now, set-your-tears-aside, superhero-esque immortality? Screw that. I say: cry all you want, laugh all you want, and scream into that pillow all you want. Vulnerability is strength. Take your time with it. Every night, I sleep with the shirt Gery was wearing when he passed away. I pace through my house a lot, and sometimes talk out loud to him as if he’s standing behind me. Is that crazy? Who cares? Honestly, I don’t want anyone else to tell me they’re sorry for my loss, or that they can’t imagine what I’m going through. I know that probably sounds kind of harsh and judgemental since these people are probably attempting to be empathetic, but why would I want anyone else to imagine what I’m going through? Don’t! It sucks. It really sucks. A few people have told me they don’t want to mention Gery around me because they think it will make me sad. But seriously, I can’t get enough of hearing his name, while learning new things about him and his mighty influence on this world. In fact, the more he is mentioned and remembered, the higher the compliment is to his wonderful existence. Also, while I’m over here ranting, I’m not going to “move on” when I’m “ready.” Telling a griever to “move on” is insulting, because it seems to imply that we want to forget or diminish the memory of our loved ones. The last thing I want to do (and it’s something I’m also terrified of actually happening) is forget about my ex-husband, or compartmentalize his existence into a lonely, insignificant blip of the past. If anything, I’m going to move forward with who I am and keep the beautiful memories of Gery and other lost loved ones by my side forever. How to talk to (and act around) the grieving Now that you know what not to tell me, here’s what I would love to hear more of (and perhaps these tips might work for others as well): I would love to hear more people simply telling me they were thinking about Gery or me, or asking me how I’ve been doing (and actually want to hear an honest response). Tell me a funny story about Gery! We can crack up and cry together. It’ll be fun. Sometimes (most of the time), actions speak louder than words: Bring me a pizza (meatballs and bell peppers, please). Or take me out for a relaxing country drive. Let’s go see a stupid action movie with no plot. Or just give me a damn hug! Form new memories. Use your imagination. Don’t be afraid to check in here and there. Make it fun. Be patient. Be respectful. Feel everything I don’t necessarily believe that “time heals all wounds,” especially in the context of grief. We don’t magically feel better and “move on” after the first brutal year, contrary to popular belief. However, I do believe that by being brutally honest with ourselves and others about our emotions — by really feeling them, instead of trying to analyze or compartmentalize our way out of them — and by being gentle with ourselves, we can form a nice, juicy blister around our deepest wounds. Keep working at it (and it does take some serious work), and that blister will eventually scab and fall off (gross!). But it will be replaced with a beautiful scar. Who knows if that scar will ever heal, but it’ll always be an integral part of you. Nurture your scars; don’t hide them. And, most importantly, take Gery’s advice: Feel everything. ", "title": "Grieving Ain’t Easy", "sentences": [{"3951": "Grieving Ain’t Easy"}, {"59e8": "I was widowed at 34 years old."}, {"d786": "I never thought I’d be sitting here, currently 35, writing somewhat objectively about the death of my dear ex-husband, Gery, and how it has affected me in this seemingly never-ending grieving process."}, {"8628": "Yet here I am, a little over 7 months after his passing, feeling like an overwhelmed, wounded, yet empowered puppy with a strong desire to share my honest and raw experiences. Hopefully my ramblings will guide other grievers, supporters, and curious folks into a healthy place of peace, mindfulness, love, and compassion."}, {"c44d": "But first, let’s talk about wEirD."}, {"4628": "“wEirD”"}, {"1c08": "My husband Gery was a Texas-raised state worker, a certified bubba, and a hyper-talented ceramic artist. His family called him “wEirD,” which appropriately described his unique, Southwest-meets-Pee Wee Herman aesthetic, and his raw, honest, goofy, colorful, and emotionally evocative approach to life."}, {"3df0": "He was the walking, talking, and farting epitome of a “gentle giant,” towering above the world at 6'6\", 300 pounds. Between his plus-sized presence and vibrant tie-dye-and-overalls looks (complete with delicately manicured beard and flawless Stetson hat), he stood out in every crowd. He was also super easy to spot when we lost each other in a crowd."}, {"2fe8": "wEirD was 26 years older than me (everyone thought he was my dad), but through our commitment to honest, open communication and gentle, respectful love for one another, we joyously coexisted for 12 glorious years. Proudly, we were one of the first few hundred gay couples in Texas to wed the day same-sex marriage was legalized in the USA, back in June of 2015."}, {"b23e": "All good things…"}, {"8d7b": "In mid-2016, just a few months after his epic 60th birthday party (or his 15th, in leap baby years), he started feeling intense, sharp pains in his belly that weren’t going away. Initially, he thought it was indigestion or an angry gallbladder, but after several tests, he was diagnosed with pancreatic cancer, stage IV. It was already spreading to other parts of his body, and we were told he had 2 to 3 months to live."}, {"ce60": "When Gery became sick, I immediately stopped working and assumed the role of full-time caregiver. I was with him basically 24/7, scheduling endless tests and procedures, deliriously waking up every couple of hours to give him numerous medications, trying to be an accommodating host for visitors, and posting updates to a private Facebook group. I was insanely stressed out, sad, angry, terrified, helpless, confused, and utterly exhausted."}, {"acb3": "I remember thinking to myself, “Why is this happening to us? Am I being punished?”"}, {"8fdd": "The feeling of wanting him to be out of pain was absolutely stifling. I felt like I was living in a horror movie, watching his body rapidly weaken and deteriorate right before my eyes. There was nothing I could do, other than tend to his needs and be as present and loving as possible."}, {"e84a": "I held his hand and watched him as he took his final mortal breaths. I’ll never forget his last bizarre gasp of energy. He gently grabbed onto my shirt, somehow pulled himself forward, looked straight ahead into the backyard with his giant, gorgeous, bluebonnet blue eyes, and let nature take his consciousness eternally. It was the most beautiful, bizarre, frightening, surreal, and challenging moment I have ever witnessed. He passed away peacefully at our home, not even 30 days after his cancer diagnosis."}, {"f6bb": "It’s oh, so quiet"}, {"29ea": "The next morning after Gery passed, I woke up feeling incredibly confused and shocked at how quiet and vastly empty the house felt. I cried my eyes out, wondering why my darling baby G wasn’t in the bed next to me, snoring away like usual. Why wasn’t he in the kitchen, meticulously crafting his famous iced coffee?"}, {"3321": "The house was set up as if he was still there, ready to slip into his boots, give his teeth a good brushing, and complete his morning ritual, before kissing me goodbye and dipping out to his ceramic art studio."}, {"3338": "The emptiness I experienced in coming to grips with his physical absence was, and has been, stronger and more challenging than any emotion I’ve ever felt. I was desperately hoping I would wake up from the nightmare, and poof! It was all a dream."}, {"7fc8": "But he’s really, truly gone."}, {"c403": "Ready or not…"}, {"53c0": "The grief process began immediately, whether I was ready for it or not (I wasn’t). I experienced new moments of social anxiety, stress, depression, and sadness at a depth I’ve never felt before, or even knew I was capable of having. I was constantly drowned by overwhelming waves of almost PTSD-style flashbacks of the horrors of watching his body weaken, or the expression on his face when he passed away, or my intense longing to hold him just one more time as we fell asleep in each other’s arms."}, {"6995": "I cried profusely as I discarded piles of his unused medications and as I slowly combed through his clothes and possessions, confused as to whether I should keep or donate everything. Would Gery get upset at me for donating his underwear? (Sorry baby, I had to!)"}, {"4e6a": "I had almost zero drive to work on my art or music for several months, which was entirely uncharacteristic for an obsessive creator like me. I simply didn’t know what to do with myself."}, {"4a9b": "Luckily, I have a truly amazing support network who flooded my house with casseroles, Gery-inspired artwork, and countless stories, hugs, and tears. My best friend and I took a spontaneous trip to an empty, dusty Louisiana casino on a random weeknight, devouring authentic poboys the next day. I did a performance at a dirty local punk bar, where I improvised a spoken word piece over an extremely challenging audio recording I made of Gery’s breathing patterns the night before he passed. I drove out to west Texas on an “Ashes Adventure,” in which I spread Gery’s ashes onto some of his favorite rustic landscapes with family by my side."}, {"734c": "Every action and emotion I have had the energy to release in my grieving process has been beautifully and tragically cathartic. Grieving is constantly bittersweet and wildly exhausting."}, {"9eeb": "If I start to feel tears come, I let them out in full force, sometimes wailing on the floor in anguish, if needed. I don’t hold any tears back, or set them aside for later, even if I’m at the grocery store or a social gathering. If other people have a problem with it, that’s their problem, not mine."}, {"aa4b": "I welcome all emotions to gather deep within me — from light to dark, happy to sad, joy to terror. I stop what I’m doing to let the emotion fill me up like a balloon, and once it passes through me, I usually feel like a huge, honking weight has been lifted off my shoulders. The balloon pops and it’s sometimes filled with confetti. I “feel everything,” as Gery would tell me."}, {"bb50": "Don’t you want me, baby?"}, {"2570": "In my early grieving process, I was warned from supporters who had also lost loved ones that the initial huge wave of support might dissipate after a few weeks, then I’d be left alone to figure out what to do with my life. They were almost 100% correct. It felt as if a magic carpet of comfort and security was suddenly ripped away from my feet, spitting me out like a stumbling baby, perplexed by the mysterious, new world in front of them."}, {"c5f4": "I was only 22 when Gery and I met, and I had spent the last 12 years building a symbiotic storyline based around the concept of “us.” Then, all of a sudden, it was just “me.” What the hell do I do with my life now?"}, {"1788": "Yearning for interaction and support, I started posting photos of Gery to Facebook, detailing an anecdote with each photo, what it meant to me, and how Gery made each moment so magical. The cathartic posts received a pile of likes and comments, which filled the void temporarily. However, I started to sense that many people seemed tongue-tied about how to actually talk to me about my grieving experience and death in general."}, {"d766": "So many people have told me, “I’m sorry for your loss” and “I can’t imagine what you’re going through,” but the conversation usually ends there, in awkward silence. I know those people genuinely mean well, but I’m also not quite sure how to respond to those statements. “Thanks” seems to quickly get the job done. I’m rarely asked how I’m actually doing."}, {"a065": "It makes me wonder: Do people actually want to know what I’m going through when they tell me they can’t imagine what I’m going through? Do they hesitate, imagining me falling to my knees and bawling into their perfectly-hemmed dress or pant leg? Are they gambling with the devil when their morbid curiosity might taint their oh-so happy day with stormclouds of sadness?"}, {"8a84": "Let’s talk about grief, baby"}, {"0bb6": "Grieving is a multi-layered, sensitive, touchy topic. It’s not exactly the sexiest thing to discuss while eating out with friends, or while twerking with your cousins at a wedding."}, {"683e": "There is no “right” or “wrong” — or even “best” or “worst” — way to talk about grief. Every situation is beautifully unique and nuanced with countless experiences, emotions, and circumstances that led up to where and who we are today."}, {"870c": "We’re not given a handy guidebook for emotionally and physically dealing with death and the grieving process that follows. Instead, grievers (and sensitive souls) are conditioned with the highly unrealistic and dangerous expectation to magically “power through” emotions, to hide and hold back our tears, and to view our deepest feelings as overreactions and expressions of weakness."}, {"1b59": "Supporters of the grieving seem similarly limited to a vague, campy set of Hallmark-esque “I’m sorry for your loss” and “time heals everything” slogans to rehash and sell on bumper stickers at shopping malls. How many times have we watched Hollywood depict widows dramatically crying for a day, then triumphantly re-immersing themselves back into the world with a nothing-will-stop-me-now, set-your-tears-aside, superhero-esque immortality?"}, {"e1ad": "Screw that. I say: cry all you want, laugh all you want, and scream into that pillow all you want. Vulnerability is strength. Take your time with it."}, {"3d49": "Every night, I sleep with the shirt Gery was wearing when he passed away. I pace through my house a lot, and sometimes talk out loud to him as if he’s standing behind me. Is that crazy? Who cares?"}, {"5114": "Honestly, I don’t want anyone else to tell me they’re sorry for my loss, or that they can’t imagine what I’m going through. I know that probably sounds kind of harsh and judgemental since these people are probably attempting to be empathetic, but why would I want anyone else to imagine what I’m going through? Don’t! It sucks. It really sucks."}, {"05e5": "A few people have told me they don’t want to mention Gery around me because they think it will make me sad. But seriously, I can’t get enough of hearing his name, while learning new things about him and his mighty influence on this world. In fact, the more he is mentioned and remembered, the higher the compliment is to his wonderful existence."}, {"130b": "Also, while I’m over here ranting, I’m not going to “move on” when I’m “ready.” Telling a griever to “move on” is insulting, because it seems to imply that we want to forget or diminish the memory of our loved ones. The last thing I want to do (and it’s something I’m also terrified of actually happening) is forget about my ex-husband, or compartmentalize his existence into a lonely, insignificant blip of the past. If anything, I’m going to move forward with who I am and keep the beautiful memories of Gery and other lost loved ones by my side forever."}, {"4461": "How to talk to (and act around) the grieving"}, {"1c9a": "Now that you know what not to tell me, here’s what I would love to hear more of (and perhaps these tips might work for others as well):"}, {"abba": "I would love to hear more people simply telling me they were thinking about Gery or me, or asking me how I’ve been doing (and actually want to hear an honest response). Tell me a funny story about Gery! We can crack up and cry together. It’ll be fun."}, {"2d19": "Sometimes (most of the time), actions speak louder than words: Bring me a pizza (meatballs and bell peppers, please). Or take me out for a relaxing country drive. Let’s go see a stupid action movie with no plot. Or just give me a damn hug!"}, {"8cbd": "Form new memories. Use your imagination. Don’t be afraid to check in here and there. Make it fun. Be patient. Be respectful."}, {"ccda": "Feel everything"}, {"ed44": "I don’t necessarily believe that “time heals all wounds,” especially in the context of grief. We don’t magically feel better and “move on” after the first brutal year, contrary to popular belief."}, {"cff3": "However, I do believe that by being brutally honest with ourselves and others about our emotions — by really feeling them, instead of trying to analyze or compartmentalize our way out of them — and by being gentle with ourselves, we can form a nice, juicy blister around our deepest wounds. Keep working at it (and it does take some serious work), and that blister will eventually scab and fall off (gross!). But it will be replaced with a beautiful scar. Who knows if that scar will ever heal, but it’ll always be an integral part of you."}, {"6de9": "Nurture your scars; don’t hide them. And, most importantly, take Gery’s advice: Feel everything."}], "child": "1143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_191143_1\t1143_2\t1143_3\t1143_4\t1143_5\t1143_6\t1143_7\t1143_8\t1143_9\t1143_10\t1143_11\t1143_12\t1143_13\t1143_14\t1143_15\t1143_16\t1143_17\t1143_18\t1143_19"}