{"name": "1147", "parent": "", "content": "How is this ok? Medium is leaving a very bad taste in my mouth So, I recently had this exchange with someone on Medium. Their article was about the white working class, but — from what I read of it, at least — the author of the article showed an immense amount of bigotry and an incredible lack of understanding as to the subject he was writing about. Normally, I would skip these types of articles. But the logic the author was trying to present in this one — to me — was laughable. So, after reading a few paragraphs, I wrote this: …to which the author responds with this: … to which I respond with this: … to which he responds with this: … to which I respond with this: …to which he responds with this: Um, ok? I wish you well, and I am a triggered bitch? Admittedly, now I am. I do a web search on the author, to see what his credentials are to even write the things that he wrote in the article. The only thing I come across is a Go Fund Me page with his same name and profile pic, and links to some social media gibberish. So I private message said author, telling him to grow the fuck up (in response to his “whiny triggered bitch” comment) and quit doing the things in the article that he’s calling these folks out for. Today, I receive this email from Gerald at Medium Support: Hello, I am writing in regards to your account on Medium.com. Medium exists to move conversation forward. We provide a platform for everyone to come to share their stories and express their viewpoints. The ability for people to confidently and comfortably share these personal stories is of paramount importance to our mission as a service. We do understand that discourse and disagreement is part of this process, and is often a very necessary part indeed. However, we do not allow harassment, and that includes in private notes. We again ask that when you find yourself in contentious disagreements or discussions, you block the other user and move on. Otherwise, we are going to have to suspend your account. If you have any questions, please write back. Thank youMedium Trust and Safety Wait. So this isn’t harassment: …and this isn’t harassment: … and this addition to the article, which the author added to the end of the piece, and which was recently pointed out to me by another Medium reader, isn’t harassment: (Side note, Edwin: Sending you a private message is not doxing you.) The message from Gerald was vague in nature. It didn’t even cite what “harassment” incident it was speaking of. However, knowing that this correspondence was the only negative exchange I have had recently — not to mention the only private message I have sent that was ever negative in anyway — I knew this had to be what Gerald from Medium Support must have been referencing. Alas, this whole experience has given me a really bad taste and an uneasy feeling for this platform. It seems that everyday Medium gives me yet another reason to be not ok with their website. Sure, I could have chose to not respond to the author’s piece to begin with. And maybe I shouldn’t have sent the private message in response to his last message, telling him to grow the fuck up (“triggered bitch” triggered me indeed, after “you people”) and pointing out that he is guilty of some of the same things he opposes in the original article. In that, I admit my responsibility. But you know something, Medium? I am someone in the “everyone” that you claim to provide a platform for expression for. Users who use language like “you people” and “triggered bitch,” and who make additions to their articles citing my username indicating I have done wrongdoing are also guilty of harassment. I hope, too, that the author of the original article has received the same canned response, and that you will ensure the author will remove my username from a piece that I do not wish to be associated with. I almost feel incredibly immature for writing this. Almost. I just want it to be clear, Medium, that I am growing skeptical of your platform, and the role that all viewpoints have in it. As I mentioned in my response to you, I would let others know of my experience, and my concerns. Well, consider this that formality. Oh, and if you “are going to have to suspend [my] account,” as your email indicates, be my guest. I’d rather share the poetry, creative nonfiction, and opinions I produce — for free, none-the-less! — on a platform that would value me as a writer. Unlike yours. ", "title": "How is this ok?", "sentences": [{"8895": "How is this ok?"}, {"2225": "Medium is leaving a very bad taste in my mouth"}, {"824c": "So, I recently had this exchange with someone on Medium. Their article was about the white working class, but — from what I read of it, at least — the author of the article showed an immense amount of bigotry and an incredible lack of understanding as to the subject he was writing about. Normally, I would skip these types of articles. But the logic the author was trying to present in this one — to me — was laughable. So, after reading a few paragraphs, I wrote this:"}, {"a0d0": "…to which the author responds with this:"}, {"e551": "… to which I respond with this:"}, {"6c38": "… to which he responds with this:"}, {"fcda": "… to which I respond with this:"}, {"ca43": "…to which he responds with this:"}, {"c9e9": "Um, ok? I wish you well, and I am a triggered bitch? Admittedly, now I am."}, {"c538": "I do a web search on the author, to see what his credentials are to even write the things that he wrote in the article. The only thing I come across is a Go Fund Me page with his same name and profile pic, and links to some social media gibberish. So I private message said author, telling him to grow the fuck up (in response to his “whiny triggered bitch” comment) and quit doing the things in the article that he’s calling these folks out for."}, {"e267": "Today, I receive this email from Gerald at Medium Support:"}, {"2cdf": "Hello,"}, {"2f77": "I am writing in regards to your account on Medium.com."}, {"56ec": "Medium exists to move conversation forward. We provide a platform for everyone to come to share their stories and express their viewpoints. The ability for people to confidently and comfortably share these personal stories is of paramount importance to our mission as a service."}, {"fdd0": "We do understand that discourse and disagreement is part of this process, and is often a very necessary part indeed."}, {"6dd0": "However, we do not allow harassment, and that includes in private notes."}, {"da11": "We again ask that when you find yourself in contentious disagreements or discussions, you block the other user and move on. Otherwise, we are going to have to suspend your account."}, {"6580": "If you have any questions, please write back."}, {"7df4": "Thank youMedium Trust and Safety"}, {"4d73": "Wait. So this isn’t harassment:"}, {"72a4": "…and this isn’t harassment:"}, {"330d": "… and this addition to the article, which the author added to the end of the piece, and which was recently pointed out to me by another Medium reader, isn’t harassment:"}, {"ed08": "(Side note, Edwin: Sending you a private message is not doxing you.)"}, {"a162": "The message from Gerald was vague in nature. It didn’t even cite what “harassment” incident it was speaking of. However, knowing that this correspondence was the only negative exchange I have had recently — not to mention the only private message I have sent that was ever negative in anyway — I knew this had to be what Gerald from Medium Support must have been referencing."}, {"81ef": "Alas, this whole experience has given me a really bad taste and an uneasy feeling for this platform. It seems that everyday Medium gives me yet another reason to be not ok with their website."}, {"7503": "Sure, I could have chose to not respond to the author’s piece to begin with. And maybe I shouldn’t have sent the private message in response to his last message, telling him to grow the fuck up (“triggered bitch” triggered me indeed, after “you people”) and pointing out that he is guilty of some of the same things he opposes in the original article. In that, I admit my responsibility."}, {"7f05": "But you know something, Medium? I am someone in the “everyone” that you claim to provide a platform for expression for. Users who use language like “you people” and “triggered bitch,” and who make additions to their articles citing my username indicating I have done wrongdoing are also guilty of harassment. I hope, too, that the author of the original article has received the same canned response, and that you will ensure the author will remove my username from a piece that I do not wish to be associated with."}, {"07a9": "I almost feel incredibly immature for writing this. Almost. I just want it to be clear, Medium, that I am growing skeptical of your platform, and the role that all viewpoints have in it. As I mentioned in my response to you, I would let others know of my experience, and my concerns. Well, consider this that formality."}, {"6062": "Oh, and if you “are going to have to suspend [my] account,” as your email indicates, be my guest. I’d rather share the poetry, creative nonfiction, and opinions I produce — for free, none-the-less! — on a platform that would value me as a writer. Unlike yours."}], "child": "1147_1\t1147_2\t1147_3\t1147_4\t1147_5\t1147_6\t1147_7\t1147_8\t1147_9\t1147_10\t1147_11\t1147_12\t1147_13\t1147_14\t1147_15\t1147_16\t1147_17\t1147_18\t1147_19\t1147_20\t1147_21\t1147_22\t1147_23\t1147_24"}