{"name": "1149", "parent": "", "content": "Historia de una Startup: Asistia Escribo este artículo, no como una queja, ni una excusa, sino con varios otros propósitos en mente. El primero siendo que lo considero importante dentro de mi proceso personal de “duelo”, al ver morir un proyecto que tanto quiero y al que tanto esfuerzo y tiempo he dedicado. El segundo, como testamento de que realmente creo que no debemos enterrar los fracasos, tampoco celebrarlos, simplemente tomarlos como lo que son…lecciones. Y el tercero, como una historia para todos aquellos emprendedores que batallan con un ecosistema en desarrollo, espero que puedan sentirse identificados y logre transmitirles algo positivo en base a mi experiencia personal. Nace una idea: Desde Agosto 2015, después de haber luchado junto con mi familia para poder encontrar a alguien de confianza que cuidara a mis abuelos, nace la idea de Asistia. Con la misión de crear una nueva forma de apoyar a familias a cuidar a sus seres queridos. Después de meses de investigación, y tomando mi experiencia personal, quise crear un concepto que arreglara el modelo bajo el cual funciona el cuidado en casa en México. Las familias mexicanas se enfrentan a una decisión difícil cuando surge la situación de cuidar un familiar. Creamos Asistia tomando todo lo positivo y desechando lo negativo de cada una de las opciones disponibles en el mercado: Entrando al sector salud: Aprendimos a entender de fondo los intereses que existen por parte de los diferentes jugadores en la industria de la salud. Influencias ocultas y fuerte burocracia muchas veces limitan las posibilidades de realizar proyectos que den un verdadero valor a los recipientes de los servicios. Como startup, basar tu estrategia de crecimiento en relaciones con empresas de salud (hospitales, aseguradoras, etc.), es insostenible si no tienes por lo menos 18–24 meses de runway, y una forma de sostenerte en los largos periodos de negociaciones que debes llevar al tratar con una empresa líder de mercado. Por el lado de empresas que den servicio directo a los clientes, el mercado altamente segmentado, en donde los clientes prefieren una atención sumamente personalizada. Esto limita a empresas enfocadas a crecimiento masivo a poder estandarizar procesos de venta y atención a clientes, ya que las relaciones humanas difícilmente son escalables. El error de basar el negocio en algo incontrolable: Vivimos en un país que no le da la importancia y relevancia necesaria a la profesión de enfermería y de cuidadoras de adultos mayores. Este último perfil en específico, es el más buscado por los clientes, y al mismo tiempo es el menos preparado y regulado. Esto ha creado un ciclo vicioso dentro del sector, en donde la falta de personal capacitado y con experiencia suficiente, ha obligado a todos los involucrados a aceptar estándares bajos de calidad y servicio, algo que se refleja en los precios castigados y la falta de claridad de los alcances y responsabilidades que tienen los profesionales (o personas con intención de profesionalizarse). Curso de primeros auxilios Tuvimos la fortuna de trabajar con gente maravillosa, con verdadera vocación y amor por el cuidado de otras personas, pero también tuvimos que lidiar con gente que trabaja en base a necesidad y no voluntad, lo cual lleva muchas veces a informalidad y comportamientos o acciones de mala fe. Por otro lado, muchos de los clientes y potenciales clientes que tuvimos, parecen no entender las responsabilidades de una cuidadora. Buscan, en muchos casos, una sirvienta dispuesta a hacer lo que les plazca, asimilando en muchos aspectos a tener un esclavo en la casa. Cuando tu producto y empresa se sostienen de una percepción errónea del mercado, y un perfil de profesionales que no puedes controlar ni incentivar efectivamente, la escalabilidad de tu empresa estará siempre limitada, y tu negocio se edifica sobre arenas movedizas. La evolución de nuestro modelo de negocio: Decidimos empezar entrando al mercado como un tipo de “Agencia de enfermería digital”, pero con tecnología que nos permite ser 4x más eficientes que cualquier empresa del nicho. El cliente encontraba a través de nosotros enfermeras y cuidadoras que nosotros verificamos con un proceso interno de reclutamiento que incluía varios pasos y medidas de seguridad. El modelo inicial era sencillo y al cliente le daba una manera de organizar el cuidado y tener a Asistia como un mediador que daba respaldo al servicio. La forma en que funcionaba era la siguiente: Lo complicado de este modelo viene de 3 partes: a) El factor laboral: Por más que a las Asociadas y clientes les explicamos que no son empleadas nuestras y que nuestro modelo es el de un mediador/referenciador, era algo muy complicado de entender. Ej: “Si tu no eres su jefe, y ellas no son profesionales independientes, ¿Entonces el jefe soy yo?” b) El factor fiscal: La mayoría de las Asociadas son personas con poca experiencia laboral formal. Su conocimiento del mundo contable y fiscal es sumamente limitado. Esto se traducía en que nosotros teníamos que “educar” profesionales a llevar su propia contabilidad, darse de alta en el SAT, declarar sus impuestos, y administrarse. Prácticamente significaba trabajar para el SAT. c) El cliente tiene expectativas y percepciones equivocadas: En México, creemos que al contratar una empresa de servicio, todo lo que salga mal es 100% su culpa. En nuestro caso por ejemplo, si una Asociada (una persona que entrevistamos, revisamos legalmente, y conocimos 1 o 2 veces), decidía faltar a un servicio, entonces los clientes asumían que nosotros éramos los responsables. Al toparnos con estas barreras, decidimos migrar nuestro modelo a algo que nos diera más flexibilidad, marcara con mayor claridad a los clientes y asociadas nuestra posición en el acuerdo comercial, y sobre todo nos permitiera escalar a otros mercados con mínima fricción. El modelo funcionaba así: Este modelo nos quitaba de encima cualquier indicio de relación laboral, responsabilidad fiscal por el servicio, y dejaba clara nuestra posición. Logramos validar este modelo, sin embargo surgieron nuevos retos en términos de recurrencia y valor agregado a los clientes. Finalmente, para aumentar la recurrencia y fortalecer nuestra oferta de valor, desarrollamos aplicaciones para que la familia de los pacientes pudiera tener más transparencia y control de lo que pasaba en el servicio. Las asociadas llenan una bitácora digital, y los clientes pueden ver todo lo realizado en el servicio y compartirlo con el resto de sus familiares. Este último modelo evolucionó a esclarecer y fortalecer nuestra visión como empresa: el poder dar tranquilidad a millones de familias con una herramienta que permitiera coordinar y organizar el cuidado de su ser querido. A través de tecnología, con un modelo de suscripción, confiando en que las familias que necesitan organizar sus vidas estarán dispuestas a pagar por este concepto de “manejar la vida completa del paciente” desde la palma de su mano. Desafortunadamente, esta última iteración del producto no vió la luz del sol al no poder conseguir más financiamiento. Conseguir inversión: Siendo una empresa cuyos retornos empiezan normalmente a generarse en etapas posteriores, el levantamiento de capital es clave para crecer a un ritmo acelerado y generar el mayor impacto lo más rápido posible. Durante nuestros 18 meses de operación, tuvimos la suerte de contar con socios increíbles que nos apoyaron en las buenas y en las malas. Que entienden el riesgo que implica empezar un negocio de tecnología en un país como México. Fondos como 500 startups e Investo, quienes impulsan un ecosistema nuevo y emocionante, son ejemplos de visionarios que luchan todos los días para crear un ambiente de innovación en LatAm. Por desgracia, la falta de resultados y casos de éxito en el mercado todavía dejan mucho a desear para que existan opciones viables de financiamiento en todas las etapas de una Startup. Estas son todas las opciones con las que me topé al buscar inversión en México: Inversión en etapas iniciales (Idea): Nuestro caso fue un poco particular, la inversión inicial con la que empezamos Asistia vino de los mismos socios con los que trabajamos en proyectos anteriores. Normalmente en México las opciones que existen para esta etapa provienen de family and friends, incubadoras, y ángeles inversionistas que buscan diversificar su portafolio. Aceleración (producto y salida a mercado): Encontramos un excelente socio en 500 startups, una aceleradora de negocios enfocados en tecnología. El programa consta en recibir una inversión de $65k USD a cambio de un porcentaje de tu empresa, en proyectos que son seleccionados, 4.5 meses de mentoría y seguimiento, y la inclusión a un selecto grupo de emprendedores con mucha experiencia y proyectos con potencial increíble. Escribí otro artículo con referencia a este tipo de modelos hace unos meses. Ronda Semilla (Seed): Fue aquí donde se empezó a complicar la historia. En México tenemos ya consolidados varios fondos institucionales de inversión, dirigidos por gente muy capaz y con mucha experiencia en el desarrollo de empresas exitosas. Pero la mayoría de estos fondos buscan co-invertir (para minimizar su riesgo), y sus procesos son largos y tediosos para todos los involucrados. Se tienen muchos criterios de inversión, y es normal recibir negativas justificadas por la etapa temprana de un proyecto, sobre todo cuando buscas inversión en el rango de los $100 mil USD a $400 mil USD, como fue nuestro caso. Empresas con intención de invertir: En paralelo al estar intentando avanzar con estos fondos, surgió la oportunidad de recibir inversión por parte de una empresa del sector, quienes prometían increíbles sinergías y proyectos en conjunto. Al ser una empresa con menos experiencia en inversiones, sus criterios, expectativas, y motivos son diferentes a los de un fondo. Cometimos el grave error de confiar en la palabra de una empresa que tenía otra intención en mente. Nos dimos cuenta poco tiempo después, que aunque se trate con una empresa de renombre, la informalidad es algo común en este tipo de negociaciones, con cambios de última hora, cláusulas leoninas, y con un interés propio despegado de formar una alianza real que fuera mutuamente favorable. El que esta inversión no se haya materializado causó un impacto rotundo en nuestros planes y el futuro de la empresa. Ángeles inversionistas: El interés de invertir en startups por parte de inversionistas privados con altos recursos, ha aumentado. Cada vez más me encuentro con personas que han tenido experiencia o por lo menos el interés de invertir en proyectos de alto impacto, que conllevan alto riesgo. Sin embargo, es común conocer inversionistas que no terminan de entender la manera en la que una empresa de tecnología puede ser valuada, ni como pueden obtener retornos a mediano y largo plazo. Eventualmente al no tener éxito con ninguna de estas opciones para levantar más capital, me topé con la decisión más difícil de mi vida: seguir operando un par de meses más buscando inversión (sabiendo que cada día el riesgo aumentaba para todos), o liquidar a todo mi equipo y dejarlos en mejor posición para encontrar una oportunidad en otro lado. Opté por la segunda. Esta decisión me dolió hasta los huesos, sobre todo porque el equipo que formé en Asistia es el mejor equipo con el que he trabajado en mi vida, pero como su líder consideré que era lo correcto. El haber emprendido este proyecto es algo que se quedará siempre en mí como una experiencia increíble, llena de aprendizajes y duras lecciones. Siempre estaré agradecido por la confianza y apoyo que me brindó mi equipo, socios, inversionistas, mentores, y todos los involucrados en este proyecto tan humano, y que en tan poco tiempo, logró mejorar la vida de tantas personas. Logramos muchas cosas, pero desgraciadamente en esta ocasión, no logramos cumplir nuestra misión. No queda más que aprender y seguir adelante. “El éxito es la habilidad de ir de fracaso en fracaso sin perder el entusiasmo” — Winston Churchill ", "title": "Historia de una Startup: Asistia", "sentences": [{"5bac": "Historia de una Startup: Asistia"}, {"257e": "Escribo este artículo, no como una queja, ni una excusa, sino con varios otros propósitos en mente."}, {"463f": "El primero siendo que lo considero importante dentro de mi proceso personal de “duelo”, al ver morir un proyecto que tanto quiero y al que tanto esfuerzo y tiempo he dedicado."}, {"28bc": "El segundo, como testamento de que realmente creo que no debemos enterrar los fracasos, tampoco celebrarlos, simplemente tomarlos como lo que son…lecciones."}, {"80a3": "Y el tercero, como una historia para todos aquellos emprendedores que batallan con un ecosistema en desarrollo, espero que puedan sentirse identificados y logre transmitirles algo positivo en base a mi experiencia personal."}, {"aa99": "Nace una idea:"}, {"e2b2": "Desde Agosto 2015, después de haber luchado junto con mi familia para poder encontrar a alguien de confianza que cuidara a mis abuelos, nace la idea de Asistia. Con la misión de crear una nueva forma de apoyar a familias a cuidar a sus seres queridos."}, {"6482": "Después de meses de investigación, y tomando mi experiencia personal, quise crear un concepto que arreglara el modelo bajo el cual funciona el cuidado en casa en México. Las familias mexicanas se enfrentan a una decisión difícil cuando surge la situación de cuidar un familiar. Creamos Asistia tomando todo lo positivo y desechando lo negativo de cada una de las opciones disponibles en el mercado:"}, {"d85e": "Entrando al sector salud:"}, {"f112": "Aprendimos a entender de fondo los intereses que existen por parte de los diferentes jugadores en la industria de la salud. Influencias ocultas y fuerte burocracia muchas veces limitan las posibilidades de realizar proyectos que den un verdadero valor a los recipientes de los servicios. Como startup, basar tu estrategia de crecimiento en relaciones con empresas de salud (hospitales, aseguradoras, etc.), es insostenible si no tienes por lo menos 18–24 meses de runway, y una forma de sostenerte en los largos periodos de negociaciones que debes llevar al tratar con una empresa líder de mercado."}, {"b0a5": "Por el lado de empresas que den servicio directo a los clientes, el mercado altamente segmentado, en donde los clientes prefieren una atención sumamente personalizada. Esto limita a empresas enfocadas a crecimiento masivo a poder estandarizar procesos de venta y atención a clientes, ya que las relaciones humanas difícilmente son escalables."}, {"7966": "El error de basar el negocio en algo incontrolable:"}, {"9785": "Vivimos en un país que no le da la importancia y relevancia necesaria a la profesión de enfermería y de cuidadoras de adultos mayores. Este último perfil en específico, es el más buscado por los clientes, y al mismo tiempo es el menos preparado y regulado. Esto ha creado un ciclo vicioso dentro del sector, en donde la falta de personal capacitado y con experiencia suficiente, ha obligado a todos los involucrados a aceptar estándares bajos de calidad y servicio, algo que se refleja en los precios castigados y la falta de claridad de los alcances y responsabilidades que tienen los profesionales (o personas con intención de profesionalizarse)."}, {"6ef7": "Curso de primeros auxilios"}, {"37ed": "Tuvimos la fortuna de trabajar con gente maravillosa, con verdadera vocación y amor por el cuidado de otras personas, pero también tuvimos que lidiar con gente que trabaja en base a necesidad y no voluntad, lo cual lleva muchas veces a informalidad y comportamientos o acciones de mala fe."}, {"8344": "Por otro lado, muchos de los clientes y potenciales clientes que tuvimos, parecen no entender las responsabilidades de una cuidadora. Buscan, en muchos casos, una sirvienta dispuesta a hacer lo que les plazca, asimilando en muchos aspectos a tener un esclavo en la casa."}, {"7c54": "Cuando tu producto y empresa se sostienen de una percepción errónea del mercado, y un perfil de profesionales que no puedes controlar ni incentivar efectivamente, la escalabilidad de tu empresa estará siempre limitada, y tu negocio se edifica sobre arenas movedizas."}, {"2140": "La evolución de nuestro modelo de negocio:"}, {"36bb": "Decidimos empezar entrando al mercado como un tipo de “Agencia de enfermería digital”, pero con tecnología que nos permite ser 4x más eficientes que cualquier empresa del nicho."}, {"e77d": "El cliente encontraba a través de nosotros enfermeras y cuidadoras que nosotros verificamos con un proceso interno de reclutamiento que incluía varios pasos y medidas de seguridad."}, {"41e4": "El modelo inicial era sencillo y al cliente le daba una manera de organizar el cuidado y tener a Asistia como un mediador que daba respaldo al servicio. La forma en que funcionaba era la siguiente:"}, {"5e11": "Lo complicado de este modelo viene de 3 partes:"}, {"1ee7": "a) El factor laboral: Por más que a las Asociadas y clientes les explicamos que no son empleadas nuestras y que nuestro modelo es el de un mediador/referenciador, era algo muy complicado de entender. Ej: “Si tu no eres su jefe, y ellas no son profesionales independientes, ¿Entonces el jefe soy yo?”"}, {"e086": "b) El factor fiscal: La mayoría de las Asociadas son personas con poca experiencia laboral formal. Su conocimiento del mundo contable y fiscal es sumamente limitado. Esto se traducía en que nosotros teníamos que “educar” profesionales a llevar su propia contabilidad, darse de alta en el SAT, declarar sus impuestos, y administrarse. Prácticamente significaba trabajar para el SAT."}, {"984b": "c) El cliente tiene expectativas y percepciones equivocadas: En México, creemos que al contratar una empresa de servicio, todo lo que salga mal es 100% su culpa. En nuestro caso por ejemplo, si una Asociada (una persona que entrevistamos, revisamos legalmente, y conocimos 1 o 2 veces), decidía faltar a un servicio, entonces los clientes asumían que nosotros éramos los responsables."}, {"e56b": "Al toparnos con estas barreras, decidimos migrar nuestro modelo a algo que nos diera más flexibilidad, marcara con mayor claridad a los clientes y asociadas nuestra posición en el acuerdo comercial, y sobre todo nos permitiera escalar a otros mercados con mínima fricción. El modelo funcionaba así:"}, {"c400": "Este modelo nos quitaba de encima cualquier indicio de relación laboral, responsabilidad fiscal por el servicio, y dejaba clara nuestra posición. Logramos validar este modelo, sin embargo surgieron nuevos retos en términos de recurrencia y valor agregado a los clientes."}, {"4f36": "Finalmente, para aumentar la recurrencia y fortalecer nuestra oferta de valor, desarrollamos aplicaciones para que la familia de los pacientes pudiera tener más transparencia y control de lo que pasaba en el servicio. Las asociadas llenan una bitácora digital, y los clientes pueden ver todo lo realizado en el servicio y compartirlo con el resto de sus familiares."}, {"31de": "Este último modelo evolucionó a esclarecer y fortalecer nuestra visión como empresa: el poder dar tranquilidad a millones de familias con una herramienta que permitiera coordinar y organizar el cuidado de su ser querido. A través de tecnología, con un modelo de suscripción, confiando en que las familias que necesitan organizar sus vidas estarán dispuestas a pagar por este concepto de “manejar la vida completa del paciente” desde la palma de su mano."}, {"938f": "Desafortunadamente, esta última iteración del producto no vió la luz del sol al no poder conseguir más financiamiento."}, {"9375": "Conseguir inversión:"}, {"298e": "Siendo una empresa cuyos retornos empiezan normalmente a generarse en etapas posteriores, el levantamiento de capital es clave para crecer a un ritmo acelerado y generar el mayor impacto lo más rápido posible."}, {"7d76": "Durante nuestros 18 meses de operación, tuvimos la suerte de contar con socios increíbles que nos apoyaron en las buenas y en las malas. Que entienden el riesgo que implica empezar un negocio de tecnología en un país como México."}, {"6d02": "Fondos como 500 startups e Investo, quienes impulsan un ecosistema nuevo y emocionante, son ejemplos de visionarios que luchan todos los días para crear un ambiente de innovación en LatAm. Por desgracia, la falta de resultados y casos de éxito en el mercado todavía dejan mucho a desear para que existan opciones viables de financiamiento en todas las etapas de una Startup. Estas son todas las opciones con las que me topé al buscar inversión en México:"}, {"0a4f": "Inversión en etapas iniciales (Idea): Nuestro caso fue un poco particular, la inversión inicial con la que empezamos Asistia vino de los mismos socios con los que trabajamos en proyectos anteriores. Normalmente en México las opciones que existen para esta etapa provienen de family and friends, incubadoras, y ángeles inversionistas que buscan diversificar su portafolio."}, {"8f7c": "Aceleración (producto y salida a mercado): Encontramos un excelente socio en 500 startups, una aceleradora de negocios enfocados en tecnología. El programa consta en recibir una inversión de $65k USD a cambio de un porcentaje de tu empresa, en proyectos que son seleccionados, 4.5 meses de mentoría y seguimiento, y la inclusión a un selecto grupo de emprendedores con mucha experiencia y proyectos con potencial increíble. Escribí otro artículo con referencia a este tipo de modelos hace unos meses."}, {"2c59": "Ronda Semilla (Seed): Fue aquí donde se empezó a complicar la historia. En México tenemos ya consolidados varios fondos institucionales de inversión, dirigidos por gente muy capaz y con mucha experiencia en el desarrollo de empresas exitosas. Pero la mayoría de estos fondos buscan co-invertir (para minimizar su riesgo), y sus procesos son largos y tediosos para todos los involucrados. Se tienen muchos criterios de inversión, y es normal recibir negativas justificadas por la etapa temprana de un proyecto, sobre todo cuando buscas inversión en el rango de los $100 mil USD a $400 mil USD, como fue nuestro caso."}, {"f044": "Empresas con intención de invertir: En paralelo al estar intentando avanzar con estos fondos, surgió la oportunidad de recibir inversión por parte de una empresa del sector, quienes prometían increíbles sinergías y proyectos en conjunto. Al ser una empresa con menos experiencia en inversiones, sus criterios, expectativas, y motivos son diferentes a los de un fondo. Cometimos el grave error de confiar en la palabra de una empresa que tenía otra intención en mente. Nos dimos cuenta poco tiempo después, que aunque se trate con una empresa de renombre, la informalidad es algo común en este tipo de negociaciones, con cambios de última hora, cláusulas leoninas, y con un interés propio despegado de formar una alianza real que fuera mutuamente favorable. El que esta inversión no se haya materializado causó un impacto rotundo en nuestros planes y el futuro de la empresa."}, {"b6b8": "Ángeles inversionistas: El interés de invertir en startups por parte de inversionistas privados con altos recursos, ha aumentado. Cada vez más me encuentro con personas que han tenido experiencia o por lo menos el interés de invertir en proyectos de alto impacto, que conllevan alto riesgo. Sin embargo, es común conocer inversionistas que no terminan de entender la manera en la que una empresa de tecnología puede ser valuada, ni como pueden obtener retornos a mediano y largo plazo."}, {"dd17": "Eventualmente al no tener éxito con ninguna de estas opciones para levantar más capital, me topé con la decisión más difícil de mi vida: seguir operando un par de meses más buscando inversión (sabiendo que cada día el riesgo aumentaba para todos), o liquidar a todo mi equipo y dejarlos en mejor posición para encontrar una oportunidad en otro lado. Opté por la segunda. Esta decisión me dolió hasta los huesos, sobre todo porque el equipo que formé en Asistia es el mejor equipo con el que he trabajado en mi vida, pero como su líder consideré que era lo correcto."}, {"377a": "El haber emprendido este proyecto es algo que se quedará siempre en mí como una experiencia increíble, llena de aprendizajes y duras lecciones. Siempre estaré agradecido por la confianza y apoyo que me brindó mi equipo, socios, inversionistas, mentores, y todos los involucrados en este proyecto tan humano, y que en tan poco tiempo, logró mejorar la vida de tantas personas. Logramos muchas cosas, pero desgraciadamente en esta ocasión, no logramos cumplir nuestra misión."}, {"3a1c": "No queda más que aprender y seguir adelante."}, {"5670": "“El éxito es la habilidad de ir de fracaso en fracaso sin perder el entusiasmo” — Winston Churchill"}], "child": "1149_1"}