{"name": "1150", "parent": "", "content": "An Open Letter to Trump on Mental Illness Dear President Trump, Hi, my name is Kari. I am 41 years old. I’ve been a low-income mother for over twenty years. My two sons are the most amazing people on the planet. I think you would be very impressed with these two fine young men, despite the fact that we are poor. I invite you to please keep reading. I would be honored to share my story with you. FIRST ORDER OF MESSY BUSINESS TO GET OUT OF THE WAY: I didn’t vote for you. To me, you are a human being, but a human being who’s morals and values don’t match mine. It really is just that simple. And this is all okay, because if we all thought the same way life would no longer be challenging and interesting and fun. Although I fiercely disagree with your presidency, policy, beliefs, and administration, I want to forget all that and just talk to you as one human being to another — just me and you. Underneath all of the chaos, you are a person who has feelings, and I have hope that you are a reasonable person because you feel. You are capable of tapping into your humanity. This is all I ask of you Mr. President. SECOND ORDER OF BUSINESS: I have mental illness. Does this automatically make you think less of me? I sure hope not… This fear (stigma damn it all to hell) right here is what I struggle with on a daily basis. I even had trouble telling my boss about it. But I am here today to announce to you sir, the President of the United States, that I am diagnosed with mental illness. I am at peace with this (finally). I am who I am because of it. I have Bipolar Disorder Type II, Histrionic Borderline Personality Disorder (i.e. Emotional Dysregulation Disorder), PTSD, anxiety, and a few other things. Wow…sure sounds scary and overwhelming doesn’t it…all those big words and diagnoses seem to compound into one hot mess… But the good news is that I am not a hot mess. (Anymore). My diagnoses actually saved my life. Before I was diagnosed I was on a train going a million miles an hour heading towards an inferno of self-destruction. Those words, those scary words, are what gave me my life back. Now, I love who I am. I am kind, loving, compassionate, your best friend if you need one, and a pretty cool ass chick who just happens to have a medical condition that you can’t see. I also like to joke around a lot because it makes others happy. I am pretty fun to be around and you seem like you might need some fun these days. If you need a friend… just sayin. A PRODUCTIVE MEMBER OF SOCIETY I am a volunteer at a homeless shelter for women and their children. I also volunteer as a counselor and HIV tester at a free STI testing site for the metro Denver community. I am also a lobbyist. I actively lobbied my Colorado state representatives and senators for legislation which will improve and strengthen Colorado’s statewide response to behavioral health crises. Senate Bill 17–207 will create a coordinated behavioral health crisis response system. This will keep people who are suffering from mental illness crises (episodes) out of the jails, where they don’t belong. Those who are experiencing a mental health crisis will be put into proper mental health care facilities. Here they will receive treatment plans which are conducive to their needs — jail only exacerbates mental illness symptoms, which therefore may cause the inmate (patient in need of care) to receive more criminal charges, and thus to end up further in the system. This is backwards, inhumane and asinine. Mr. President, politicians are listening to me and my fellow lobbyists. Will you listen too? WHY I NEED MY MEDICAID I take medication to help keep me stable, happy and productive. The medications have saved my life. People die from mental illnesses. You may be thinking, well how on earth do people die from mental illness? We take our own lives. Sometimes, it is the only permanent way to escape the pain. This leaves loved ones with a black hole in their lives which siphons any possibility of ever being normal again. Think… If someone you loved was desperate enough to commit suicide, how would that leave you? I don’t want this for you sir. I don’t want this for anyone. I don’t want to commit suicide… This is why I militantly follow exactly what my treatment team tells me to do. Meds and therapy, probably for the rest of my life. I am okay with that. I am able to function and stay stable because I have Medicaid. Thank you eternally for my health insurance. Here’s the awful truth — I could die without Medicaid (see above). Please don’t take it away from me and millions of other people who are just like me. Mr. President, I am humbly grateful for the help I get, and I give back to my community as a way to say thank you (see A Productive Member of Society). HUMANITY Lastly, I have one last request. Please, remember your humanity. Never forget the people like me — the mentally ill, the poor, the underdogs, the ostracized, the outcasts, the unwanted, the undesirables...Please, let children and families come here who were chemically attacked and bombed and forced out of their homes. They deserve to have a place to call home, where they don’t have to fear for their lives. Please remember my homeless brothers and sisters — a lot of whom are mentally ill — because they too deserve a place to call home. I would ask you to place a focus of compassion on your domestic policy to help, to be kind, to remember us, and to be the president we know you can be. Thank you. I wish you well. Kari Ann Meding Thank you kindly for reading my work. I appreciate it with everything that I am. Follow me on Twitter! ", "title": "An Open Letter to Trump on Mental Illness", "sentences": [{"a513": "An Open Letter to Trump on Mental Illness"}, {"8c64": "Dear President Trump,"}, {"bc52": "Hi, my name is Kari. I am 41 years old. I’ve been a low-income mother for over twenty years. My two sons are the most amazing people on the planet. I think you would be very impressed with these two fine young men, despite the fact that we are poor. I invite you to please keep reading. I would be honored to share my story with you."}, {"f476": "FIRST ORDER OF MESSY BUSINESS TO GET OUT OF THE WAY:"}, {"9d9f": "I didn’t vote for you. To me, you are a human being, but a human being who’s morals and values don’t match mine. It really is just that simple. And this is all okay, because if we all thought the same way life would no longer be challenging and interesting and fun. Although I fiercely disagree with your presidency, policy, beliefs, and administration, I want to forget all that and just talk to you as one human being to another — just me and you. Underneath all of the chaos, you are a person who has feelings, and I have hope that you are a reasonable person because you feel. You are capable of tapping into your humanity. This is all I ask of you Mr. President."}, {"17ee": "SECOND ORDER OF BUSINESS:"}, {"b6f0": "I have mental illness. Does this automatically make you think less of me? I sure hope not… This fear (stigma damn it all to hell) right here is what I struggle with on a daily basis. I even had trouble telling my boss about it. But I am here today to announce to you sir, the President of the United States, that I am diagnosed with mental illness. I am at peace with this (finally). I am who I am because of it."}, {"b5df": "I have Bipolar Disorder Type II, Histrionic Borderline Personality Disorder (i.e. Emotional Dysregulation Disorder), PTSD, anxiety, and a few other things. Wow…sure sounds scary and overwhelming doesn’t it…all those big words and diagnoses seem to compound into one hot mess… But the good news is that I am not a hot mess. (Anymore). My diagnoses actually saved my life. Before I was diagnosed I was on a train going a million miles an hour heading towards an inferno of self-destruction. Those words, those scary words, are what gave me my life back. Now, I love who I am. I am kind, loving, compassionate, your best friend if you need one, and a pretty cool ass chick who just happens to have a medical condition that you can’t see. I also like to joke around a lot because it makes others happy. I am pretty fun to be around and you seem like you might need some fun these days. If you need a friend… just sayin."}, {"f113": "A PRODUCTIVE MEMBER OF SOCIETY"}, {"278d": "I am a volunteer at a homeless shelter for women and their children. I also volunteer as a counselor and HIV tester at a free STI testing site for the metro Denver community. I am also a lobbyist. I actively lobbied my Colorado state representatives and senators for legislation which will improve and strengthen Colorado’s statewide response to behavioral health crises."}, {"bc02": "Senate Bill 17–207 will create a coordinated behavioral health crisis response system. This will keep people who are suffering from mental illness crises (episodes) out of the jails, where they don’t belong. Those who are experiencing a mental health crisis will be put into proper mental health care facilities. Here they will receive treatment plans which are conducive to their needs — jail only exacerbates mental illness symptoms, which therefore may cause the inmate (patient in need of care) to receive more criminal charges, and thus to end up further in the system. This is backwards, inhumane and asinine. Mr. President, politicians are listening to me and my fellow lobbyists. Will you listen too?"}, {"5e51": "WHY I NEED MY MEDICAID"}, {"6dfa": "I take medication to help keep me stable, happy and productive. The medications have saved my life. People die from mental illnesses. You may be thinking, well how on earth do people die from mental illness? We take our own lives. Sometimes, it is the only permanent way to escape the pain. This leaves loved ones with a black hole in their lives which siphons any possibility of ever being normal again. Think… If someone you loved was desperate enough to commit suicide, how would that leave you? I don’t want this for you sir. I don’t want this for anyone. I don’t want to commit suicide… This is why I militantly follow exactly what my treatment team tells me to do. Meds and therapy, probably for the rest of my life. I am okay with that. I am able to function and stay stable because I have Medicaid. Thank you eternally for my health insurance. Here’s the awful truth — I could die without Medicaid (see above). Please don’t take it away from me and millions of other people who are just like me. Mr. President, I am humbly grateful for the help I get, and I give back to my community as a way to say thank you (see A Productive Member of Society)."}, {"e7b3": "HUMANITY"}, {"651b": "Lastly, I have one last request. Please, remember your humanity. Never forget the people like me — the mentally ill, the poor, the underdogs, the ostracized, the outcasts, the unwanted, the undesirables...Please, let children and families come here who were chemically attacked and bombed and forced out of their homes. They deserve to have a place to call home, where they don’t have to fear for their lives. Please remember my homeless brothers and sisters — a lot of whom are mentally ill — because they too deserve a place to call home. I would ask you to place a focus of compassion on your domestic policy to help, to be kind, to remember us, and to be the president we know you can be."}, {"b30d": "Thank you. I wish you well."}, {"c990": "Kari Ann Meding"}, {"8a16": "Thank you kindly for reading my work. I appreciate it with everything that I am. Follow me on Twitter!"}], "child": "1150_1\t1150_2\t1150_3\t1150_4\t1150_5\t1150_6"}