{"name": "1151", "parent": "", "content": "The Story of the Dead Rat Men are so Gross I’m not sure where I should begin my story. Should I start with the dead rat being found years ago in my not then husband’s toolbox back in Phoenix? Should I start with him moving the dead rat 1500 miles across country? Should I start with the fact the dead rat is still in his toolbox in our garage here in Iowa? Should I start with how the dead rat freaks me out? Or, should I start with the fact that I’ve asked my husband to remove the dead rat roughly 37 times and it’s still there. It’s dead. The rat is dead. It’s gross. When I brought it to his attention 16 times ago he took photos and text them to a friend. While we were doing our weekend chores my husband cleaned the garage but left the dead rat yet again. I asked my husband why he doesn’t get rid of the dead rat and he laughed and said, “I don’t know, it’s just there.” I responded with, “You know when a spouse dies and the other spouse is clutching onto the tombstone at the cemetery sobbing so hard they can’t breathe, and they can’t move on, and they can’t survive without their loved one? If you die and leave me with that dead rat, that won’t be me. ” This is the end of my story. You can contribute to my writing habit by clicking this link. You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.” ", "title": "The Story of the Dead Rat", "sentences": [{"33bb": "The Story of the Dead Rat"}, {"e898": "Men are so Gross"}, {"82b7": "I’m not sure where I should begin my story."}, {"7e08": "Should I start with the dead rat being found years ago in my not then husband’s toolbox back in Phoenix?"}, {"0a14": "Should I start with him moving the dead rat 1500 miles across country?"}, {"763a": "Should I start with the fact the dead rat is still in his toolbox in our garage here in Iowa?"}, {"4c5b": "Should I start with how the dead rat freaks me out?"}, {"dc6e": "Or, should I start with the fact that I’ve asked my husband to remove the dead rat roughly 37 times and it’s still there."}, {"8543": "It’s dead. The rat is dead. It’s gross."}, {"8ddb": "When I brought it to his attention 16 times ago he took photos and text them to a friend."}, {"cdee": "While we were doing our weekend chores my husband cleaned the garage but left the dead rat yet again."}, {"419d": "I asked my husband why he doesn’t get rid of the dead rat and he laughed and said, “I don’t know, it’s just there.”"}, {"f1e6": "I responded with, “You know when a spouse dies and the other spouse is clutching onto the tombstone at the cemetery sobbing so hard they can’t breathe, and they can’t move on, and they can’t survive without their loved one? If you die and leave me with that dead rat, that won’t be me. ”"}, {"11ed": "This is the end of my story."}, {"f9d1": "You can contribute to my writing habit by clicking this link."}, {"05c8": "You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.”"}], "child": "1151_1\t1151_2\t1151_3"}