{"name": "1153", "parent": "", "content": "Balance a one line poem prompt Lit with brilliant glare of what could be, sat our lofty ideals of an equitable balance. Your Turn Please share your own one-line poem on the theme balance. Either as a response to this post, or if you prefer to write it as a stand alone piece, just make sure to leave a link to it in the response section below along with making “the prompt” one of your tags. FYI: Responding to this or any prompt adds you to the prompt notification list. In 2006 Allan Rae left a career as a flight paramedic to obtain his MFA in creative nonfiction. Today he is a qualitative public health researcher exploring intersections of HIV, PTSD, and stigma using a narrative focused model of inquiry. The editorial lead for creative nonfiction at daCunha, and the creator and editorial director of Crossin(G)enres, he admits to a mild Starbucks addiction, and is an avid collector of stray dogs. ", "title": "Balance", "sentences": [{"b25c": "Balance"}, {"b9a1": "a one line poem prompt"}, {"e762": "Lit with brilliant glare of what could be, sat our lofty ideals of an equitable balance."}, {"467c": "Your Turn"}, {"8dd0": "Please share your own one-line poem on the theme balance. Either as a response to this post, or if you prefer to write it as a stand alone piece, just make sure to leave a link to it in the response section below along with making “the prompt” one of your tags."}, {"fa8e": "FYI: Responding to this or any prompt adds you to the prompt notification list."}, {"5259": "In 2006 Allan Rae left a career as a flight paramedic to obtain his MFA in creative nonfiction. Today he is a qualitative public health researcher exploring intersections of HIV, PTSD, and stigma using a narrative focused model of inquiry. The editorial lead for creative nonfiction at daCunha, and the creator and editorial director of Crossin(G)enres, he admits to a mild Starbucks addiction, and is an avid collector of stray dogs."}], "child": "1153_1\t1153_2\t1153_3\t1153_4\t1153_5\t1153_6\t1153_7\t1153_8\t1153_9\t1153_10\t1153_11\t1153_12\t1153_13\t1153_14\t1153_15\t1153_16\t1153_17\t1153_18\t1153_19\t1153_20\t1153_21\t1153_22\t1153_23\t1153_24\t1153_251153_1\t1153_2\t1153_3\t1153_4\t1153_5\t1153_6\t1153_7\t1153_8\t1153_9\t1153_10\t1153_11\t1153_12\t1153_13\t1153_14\t1153_15\t1153_16\t1153_17\t1153_18\t1153_19\t1153_20\t1153_21\t1153_22\t1153_23\t1153_24\t1153_25"}