{"name": "1158", "parent": "", "content": "Rereading that book OR: rereading a book is not a waste of time image taken from instagram.com/joshguilar Time. It’s the reason people cite for not reading as much: or not rereading their favourite books. I’ve said in other blogs, if you want to read (or reread) a book you’ll make time. Watch less TV, don’t play that latest craze app on your phone: why not listen to an audiobook version while you drive or go for your morning walk/run? Reread that favourite book of yours, the one you’ve been thinking about rereading for a while now: do it, you’ll be thankful you did. With so many good unread books around, why reread? I say: why not both. Why not reread and read new books? For me every 2 years I reread Harry Potter. And every year I reread “The Name of the Rose”, “On the Road” and “Fear and Loathing in Las Vegas”. Every year. “The Name of the Rose” (by Umberto Eco) is one of those fine novels that teaches you something, makes you think and still has time to be an entertaining, page-turning medieval murder mystery. It’s also a good introduction to the author’s view on semiotics and how to interpret/read texts. “On the Road” (by Jack Kerouac) is — for me — about wanderlust. The desire to go, go, go and keep moving. The book’s jazz prose and unreliable narrator also make the book interesting: the less you trust the narrator the more interesting the book becomes. “Fear and Loathing in Las Vegas” (by Hunter S Thompson) is dark humour, and road trip American dream satire. The perverse philosophical outlook is a good reminder that reading should be fun, and that to live well, one cannot take life seriously all the time. So, why reread a book? A book worth reading is a book that makes you laugh in all the same places each time you read it. Or it shows you something you didn’t see the first time around. A book worth rereading will teach you more, show you more and help you to appreciate the fine detail in a story. Or a biography. Not all books are worth rereading. Because, let’s face it, not all books are worth reading once. You will hear people like Tony Robbins (American motivational speaker) say reading a book more than once is just a comfort thing, a security thing: you know it’s going to be good, and that the best thing you can do is find a new book because that’s a new challenge. I would argue Tony Robbins has never read Proust. Or dived into a book so good you never want to come out of it. And why not? Each of us takes away something different when we read. Whether you read purely because you believe it’ll help you progress professionally, or you read for the pure fun enjoyment of a good story. Don’t let others dictate how you should enjoy your reading time. Why you read is important As long as you remember reading is not a competition. If you don’t enjoy reading — you’re doing it wrong. If you think the number of books you read in a year is more important than what you read, and what you got out of reading — you’re doing it wrong. The latter point is why so many don’t want to reread. They feel the need to always be reading something new, something different, because otherwise how will they fit it all in? How, indeed. You will reread that book, because you will enjoy it: you’ll learn something; and it will force you to slow down. There’s no rush, all those other books aren’t going anywhere. Thank you for reading. ", "title": "Rereading that book", "sentences": [{"2a93": "Rereading that book"}, {"fe75": "OR: rereading a book is not a waste of time"}, {"51b5": "image taken from instagram.com/joshguilar"}, {"46fb": "Time. It’s the reason people cite for not reading as much: or not rereading their favourite books."}, {"7d5e": "I’ve said in other blogs, if you want to read (or reread) a book you’ll make time. Watch less TV, don’t play that latest craze app on your phone: why not listen to an audiobook version while you drive or go for your morning walk/run?"}, {"7413": "Reread that favourite book of yours, the one you’ve been thinking about rereading for a while now: do it, you’ll be thankful you did."}, {"f61d": "With so many good unread books around, why reread?"}, {"e058": "I say: why not both. Why not reread and read new books? For me every 2 years I reread Harry Potter. And every year I reread “The Name of the Rose”, “On the Road” and “Fear and Loathing in Las Vegas”."}, {"2f93": "Every year."}, {"9a14": "“The Name of the Rose” (by Umberto Eco) is one of those fine novels that teaches you something, makes you think and still has time to be an entertaining, page-turning medieval murder mystery."}, {"84c9": "It’s also a good introduction to the author’s view on semiotics and how to interpret/read texts."}, {"83e6": "“On the Road” (by Jack Kerouac) is — for me — about wanderlust. The desire to go, go, go and keep moving. The book’s jazz prose and unreliable narrator also make the book interesting: the less you trust the narrator the more interesting the book becomes."}, {"04db": "“Fear and Loathing in Las Vegas” (by Hunter S Thompson) is dark humour, and road trip American dream satire. The perverse philosophical outlook is a good reminder that reading should be fun, and that to live well, one cannot take life seriously all the time."}, {"36af": "So, why reread a book?"}, {"68a1": "A book worth reading is a book that makes you laugh in all the same places each time you read it. Or it shows you something you didn’t see the first time around."}, {"4908": "A book worth rereading will teach you more, show you more and help you to appreciate the fine detail in a story. Or a biography."}, {"b24f": "Not all books are worth rereading. Because, let’s face it, not all books are worth reading once."}, {"0055": "You will hear people like Tony Robbins (American motivational speaker) say reading a book more than once is just a comfort thing, a security thing: you know it’s going to be good, and that the best thing you can do is find a new book because that’s a new challenge."}, {"f667": "I would argue Tony Robbins has never read Proust. Or dived into a book so good you never want to come out of it. And why not? Each of us takes away something different when we read."}, {"1a11": "Whether you read purely because you believe it’ll help you progress professionally, or you read for the pure fun enjoyment of a good story. Don’t let others dictate how you should enjoy your reading time."}, {"1fc0": "Why you read is important"}, {"f2e7": "As long as you remember reading is not a competition."}, {"f00f": "If you don’t enjoy reading — you’re doing it wrong. If you think the number of books you read in a year is more important than what you read, and what you got out of reading — you’re doing it wrong."}, {"9517": "The latter point is why so many don’t want to reread. They feel the need to always be reading something new, something different, because otherwise how will they fit it all in?"}, {"e77e": "How, indeed."}, {"a1f9": "You will reread that book, because you will enjoy it: you’ll learn something; and it will force you to slow down. There’s no rush, all those other books aren’t going anywhere."}, {"27a5": "Thank you for reading."}], "child": "1158_1\t1158_2\t1158_3"}