{"name": "1159", "parent": "", "content": "The Forever Procrastinator A short poem that every procrastinator can relate too. As days pass due to Earth’s movement sun around, Sits on his bed the comfort bound, The everyday goals and to-do list traitor, The great lazy procrastinator. . From lying in bed in morning each day, Despite the tasks that in front lay, To spending too much time on phone before sleep, Who cares if social media doesn’t any benefits reap? . Oh he reads too many of those articles each day, How to kill procrastination this or that way, But alas, on none of those does he act, And that’s a simple undeniable fact. . One of these days I will do something great, But before that for right time I must wait, That’s what he tells himself every time, Cuz watching one more episode is not a crime. . No matter how much work he got on his plate, No matter if he is ever for everything so late, He finds something to do rather than being productive, No matter if to his future that may be destructive. . And that’s the story of how he lives, How to all the unnecessary things time he gives, The everyday goals and to-do list traitor, The forever procrastinator. Note: This is one of my first posts on medium, so any suggestions/tips are welcomed! Liked this post or found it relatable? Kindly tap the ❤ button below! #ThankYou ", "title": "The Forever Procrastinator", "sentences": [{"0d7f": "The Forever Procrastinator"}, {"acb6": "A short poem that every procrastinator can relate too."}, {"b560": "As days pass due to Earth’s movement sun around,"}, {"2338": "Sits on his bed the comfort bound,"}, {"41f2": "The everyday goals and to-do list traitor,"}, {"72f8": "The great lazy procrastinator."}, {"df46": "."}, {"9e7c": "From lying in bed in morning each day,"}, {"82ce": "Despite the tasks that in front lay,"}, {"80cc": "To spending too much time on phone before sleep,"}, {"6007": "Who cares if social media doesn’t any benefits reap?"}, {"5307": "."}, {"fb2b": "Oh he reads too many of those articles each day,"}, {"cb8f": "How to kill procrastination this or that way,"}, {"cc8f": "But alas, on none of those does he act,"}, {"6808": "And that’s a simple undeniable fact."}, {"4382": "."}, {"d117": "One of these days I will do something great,"}, {"7e76": "But before that for right time I must wait,"}, {"4d44": "That’s what he tells himself every time,"}, {"83ec": "Cuz watching one more episode is not a crime."}, {"9aa7": "."}, {"19fa": "No matter how much work he got on his plate,"}, {"912b": "No matter if he is ever for everything so late,"}, {"16cd": "He finds something to do rather than being productive,"}, {"07be": "No matter if to his future that may be destructive."}, {"31d2": "."}, {"077a": "And that’s the story of how he lives,"}, {"b308": "How to all the unnecessary things time he gives,"}, {"555e": "The everyday goals and to-do list traitor,"}, {"8195": "The forever procrastinator."}, {"78ad": "Note: This is one of my first posts on medium, so any suggestions/tips are welcomed!"}, {"b725": "Liked this post or found it relatable? Kindly tap the ❤ button below! #ThankYou"}], "child": "1159_1\t1159_2"}