{"name": "1160", "parent": "", "content": "The fall time change: the good, the bad, and the ugly What it means for our health and productivity Photo by Bjorn Lindell, source This Sunday at 2 a.m. will mark the end of Daylight Saving Time in North America, which means we will reset our clocks to 1 a.m. and get an extra hour of sleep… unless you’re working the night shift, in which case all I can say is: I’m sorry. We all know that the time change was instituted in an attempt to save energy. But I’ll bet you also have first-hand experience of some of the pros and cons of this practice. In my case, I vividly remember showing up at the school bus stop on a snowy November morning (this was in Canada) to find nobody there, feeling like I was the only person in the world and slowly realizing that it wasn’t even 7 a.m. “Alone in This Beautiful World” by Matthew Skelton, source To add insult to injury, I then trudged back home to find the door locked, my parents having already left for work, equally oblivious to the time change. Obviously, this was before the days of cell phones and computers automatically resetting the time! Such humiliating memories aside, ever wonder whether the time change has any effect on our health and productivity? You may be surprised to hear that since its establishment, the time change has been blamed for all sorts of health problems, from heart attacks to early labor in pregnant women. In fact, there is even a debate between two teams of researchers about whether the time change negatively affects the U.S. stock market! [1] Fortunately, many of these fears seem to be unfounded. For example, a recent Swedish study examined the incidence of spontaneous deliveries (where a pregnant woman went into labor without being induced by medications) over a period of 13 years and found no increase in births in the week following a time change. [2] Similarly, the time change doesn’t seem to increase the incidence of heart attacks — phew! [3] As you might predict, the fall time change comes more easily to our bodies than the spring time change, in which we “lose” an hour of nighttime. [4] In the spring, workers tend to get 40 minutes less of sleep on the Monday following the time change. [5] Many psychologists believe that lack of sleep leads to a decreased ability to regulate one’s behavior; interestingly, the Monday after the spring time change is usually a day of increased “cyberloafing”, or goofing off online while at work. [6] Photo by Mario, source There is some indication that people also have trouble making ethical or moral judgments on the Monday after the spring time change as well. [7] More troubling still, that day also sees more workplace injuries as well as injuries of greater severity than on other workdays, although not all studies agree on this [5,8]. Fortunately, there is no increase in injuries on the Monday following the fall time change. [5] Still, a 1-hour shift in our sleep schedules does decrease our performance somewhat, as shown by slower reaction times on a test of attention catchily called the Psychomotor Vigilance Test. [9] It’s very simple: the subject watches a dark screen, on which a dot of light spontaneously appears every few seconds over a span of 10 minutes; the subject has to press a button every time the dot appears. The screen in a psychomotor vigilance test. Image: Maria Ter-Mikaelian Sleep-deprived people tend to “tune out” and miss the appearance of the dot, so it’s a good test of sleepiness and alertness. This means that if your work involves meticulous attention to detail or the need to react quickly, you will have to be extra careful this coming Monday. Indeed, because of its troubling side-effects, some experts believe that Daylight Saving Time does more harm than good. For example, Christopher Barnes, whose research on DST in relation to health and productivity includes several of the studies discussed above, recently co-authored an article arguing that Daylight Saving Time should be abolished in the U.S. altogether. [10] In fact, several U.S. states and territories — for example, Arizona, Hawaii, and Puerto Rico — do not observe DST. In addition, some countries, such as Russia, have recently abandoned the practice. It will be interesting to see whether research reveals noticeable differences in health or work performance in those regions. For this year, at least, most North Americans are stuck with DST. Photo by tyle_r, source If you like, you can try to influence the powers that be by signing this petition to U.S. Congress: petition to end DST. In the meantime, my suggestion to you is: this coming Monday, arm yourself with some upbeat music and a strong cup of coffee, and if you must, do a little cyberloafing to ease the transition. If you enjoyed this article, please consider scrolling down and clicking on the heart below to recommend it to other readers. To be notified when I publish a new article, join my mailing list here. Sources [1] Kamstra, M.J. et al. (2013). Effects of daylight-saving time changes on stock market returns and stock market volatility: rebuttal. Psychological Reports 112(1): 89–99 [2] Laszlo, K.D. et al. (2016). Transition into and out of daylight saving time and spontaneous delivery: a population-based study. BMJ Open 6(9):e010925 [3] Sipila, J.O. et al. (2016). Association of daylight saving time transitions with incidence and in-hospital mortality of myocardial infarction in Finland. Annals of Medicine 48(1–2):10–6 [4] Tonetti, L. et al. (2013). Effects of transitions into and out of daylight saving time on the quality of the sleep/wake cycle: an actigraphic study in healthy university students. Chronobiology International 30(10):1218–22 [5] Barnes, C.M. and D.T. Wagner. (2009). Changing to daylight saving time cuts into sleep and increases workplace injuries. Journal of Applied Psychology 94(5):1305–17 [6] Wagner, D.T. et al. (2012). Lost sleep and cyberloafing: Evidence from the laboratory and a daylight saving time quasi-experiment. Journal of Applied Psychology 97(5):1068–76 [7] Barnes, C.M. et al. (2015). Sleep and moral awareness. Journal of Sleep Research 24: 181–188 [8] Lahti, T. et al. (2011). Work-related accidents and daylight saving time in Finland. Occupational Medicine 61:26–28 [9] Burgess, H.J. et al. (2013). Can small shifts in circadian phase affect performance? Applied Ergonomics 44(1):109–11 [10] Barnes, C.M. and C.L. Drake. (2015). Prioritizing sleep health: public health policy recommendations. Perspectives on Psychological Science 10(6): 733–737 ", "title": "The fall time change: the good, the bad, and the ugly", "sentences": [{"984b": "The fall time change: the good, the bad, and the ugly"}, {"e785": "What it means for our health and productivity"}, {"bca3": "Photo by Bjorn Lindell, source"}, {"ed62": "This Sunday at 2 a.m. will mark the end of Daylight Saving Time in North America, which means we will reset our clocks to 1 a.m. and get an extra hour of sleep… unless you’re working the night shift, in which case all I can say is: I’m sorry."}, {"8385": "We all know that the time change was instituted in an attempt to save energy. But I’ll bet you also have first-hand experience of some of the pros and cons of this practice. In my case, I vividly remember showing up at the school bus stop on a snowy November morning (this was in Canada) to find nobody there, feeling like I was the only person in the world and slowly realizing that it wasn’t even 7 a.m."}, {"b470": "“Alone in This Beautiful World” by Matthew Skelton, source"}, {"fce1": "To add insult to injury, I then trudged back home to find the door locked, my parents having already left for work, equally oblivious to the time change. Obviously, this was before the days of cell phones and computers automatically resetting the time!"}, {"f277": "Such humiliating memories aside, ever wonder whether the time change has any effect on our health and productivity?"}, {"0fbe": "You may be surprised to hear that since its establishment, the time change has been blamed for all sorts of health problems, from heart attacks to early labor in pregnant women. In fact, there is even a debate between two teams of researchers about whether the time change negatively affects the U.S. stock market! [1] Fortunately, many of these fears seem to be unfounded. For example, a recent Swedish study examined the incidence of spontaneous deliveries (where a pregnant woman went into labor without being induced by medications) over a period of 13 years and found no increase in births in the week following a time change. [2] Similarly, the time change doesn’t seem to increase the incidence of heart attacks — phew! [3]"}, {"e54d": "As you might predict, the fall time change comes more easily to our bodies than the spring time change, in which we “lose” an hour of nighttime. [4] In the spring, workers tend to get 40 minutes less of sleep on the Monday following the time change. [5] Many psychologists believe that lack of sleep leads to a decreased ability to regulate one’s behavior; interestingly, the Monday after the spring time change is usually a day of increased “cyberloafing”, or goofing off online while at work. [6]"}, {"09da": "Photo by Mario, source"}, {"6fe5": "There is some indication that people also have trouble making ethical or moral judgments on the Monday after the spring time change as well. [7] More troubling still, that day also sees more workplace injuries as well as injuries of greater severity than on other workdays, although not all studies agree on this [5,8]."}, {"6a34": "Fortunately, there is no increase in injuries on the Monday following the fall time change. [5] Still, a 1-hour shift in our sleep schedules does decrease our performance somewhat, as shown by slower reaction times on a test of attention catchily called the Psychomotor Vigilance Test. [9] It’s very simple: the subject watches a dark screen, on which a dot of light spontaneously appears every few seconds over a span of 10 minutes; the subject has to press a button every time the dot appears."}, {"d487": "The screen in a psychomotor vigilance test. Image: Maria Ter-Mikaelian"}, {"d58e": "Sleep-deprived people tend to “tune out” and miss the appearance of the dot, so it’s a good test of sleepiness and alertness. This means that if your work involves meticulous attention to detail or the need to react quickly, you will have to be extra careful this coming Monday."}, {"7397": "Indeed, because of its troubling side-effects, some experts believe that Daylight Saving Time does more harm than good. For example, Christopher Barnes, whose research on DST in relation to health and productivity includes several of the studies discussed above, recently co-authored an article arguing that Daylight Saving Time should be abolished in the U.S. altogether. [10] In fact, several U.S. states and territories — for example, Arizona, Hawaii, and Puerto Rico — do not observe DST. In addition, some countries, such as Russia, have recently abandoned the practice. It will be interesting to see whether research reveals noticeable differences in health or work performance in those regions."}, {"9b45": "For this year, at least, most North Americans are stuck with DST."}, {"05ba": "Photo by tyle_r, source"}, {"9fed": "If you like, you can try to influence the powers that be by signing this petition to U.S. Congress: petition to end DST."}, {"34ef": "In the meantime, my suggestion to you is: this coming Monday, arm yourself with some upbeat music and a strong cup of coffee, and if you must, do a little cyberloafing to ease the transition."}, {"40e4": "If you enjoyed this article, please consider scrolling down and clicking on the heart below to recommend it to other readers."}, {"a79c": "To be notified when I publish a new article, join my mailing list here."}, {"56ee": "Sources"}, {"ed8c": "[1] Kamstra, M.J. et al. (2013). Effects of daylight-saving time changes on stock market returns and stock market volatility: rebuttal. Psychological Reports 112(1): 89–99"}, {"993e": "[2] Laszlo, K.D. et al. (2016). Transition into and out of daylight saving time and spontaneous delivery: a population-based study. BMJ Open 6(9):e010925"}, {"ae26": "[3] Sipila, J.O. et al. (2016). Association of daylight saving time transitions with incidence and in-hospital mortality of myocardial infarction in Finland. Annals of Medicine 48(1–2):10–6"}, {"36e5": "[4] Tonetti, L. et al. (2013). Effects of transitions into and out of daylight saving time on the quality of the sleep/wake cycle: an actigraphic study in healthy university students. Chronobiology International 30(10):1218–22"}, {"b773": "[5] Barnes, C.M. and D.T. Wagner. (2009). Changing to daylight saving time cuts into sleep and increases workplace injuries. Journal of Applied Psychology 94(5):1305–17"}, {"9628": "[6] Wagner, D.T. et al. (2012). Lost sleep and cyberloafing: Evidence from the laboratory and a daylight saving time quasi-experiment. Journal of Applied Psychology 97(5):1068–76"}, {"b3f2": "[7] Barnes, C.M. et al. (2015). Sleep and moral awareness. Journal of Sleep Research 24: 181–188"}, {"f633": "[8] Lahti, T. et al. (2011). Work-related accidents and daylight saving time in Finland. Occupational Medicine 61:26–28"}, {"e2e3": "[9] Burgess, H.J. et al. (2013). Can small shifts in circadian phase affect performance? Applied Ergonomics 44(1):109–11"}, {"fa55": "[10] Barnes, C.M. and C.L. Drake. (2015). Prioritizing sleep health: public health policy recommendations. Perspectives on Psychological Science 10(6): 733–737"}], "child": "1160_1\t1160_2\t1160_3\t1160_4\t1160_5\t1160_6\t1160_71160_1\t1160_2\t1160_3\t1160_4\t1160_5\t1160_6\t1160_71160_1\t1160_2\t1160_3\t1160_4\t1160_5\t1160_6\t1160_7"}