{"name": "1161", "parent": "", "content": "Here’s Exactly How Long You Can Retain Insane Productivity For BY MAX LUKOMINKSKYI Work harder, get up earlier, stay up later — those have been considered to be prerequisites for better results and incredible productivity for a long time. The more you work, the more tasks you get done. The harder they work the closer they get to the things they want to accomplish. Is that really true? Most people believe that more hours spent doing things can actually help them experience a breakthrough toward massive wins. In reality, this mindset very often appears to be completely misleading. For many people, extra hours have become a conventional way of working rather than a rare exception. According to the recent survey conducted by EY, approximately half (46%) of managers, globally, are working more than 40 hours a week, 24% of which work more than 50 hours a week. The reasons for overworking often differ from organizational culture and policy or supervisory pressure to the individual`s own decision to stay in the office longer than required in order to show his or her commitment, dedication and meet employer`s expectations. However, the truth is that overworking has nothing to do with the quality and efficiency of your work. Instead, it contributes to depression, insomnia, exhaustion and poor performance. The innate human desire to improve one`s lot is strong enough to make workmen apt to overwork themselves and ruin their health and constitution in a few years — Adam Smith, 1776, Wealth of Nations, Book One, Chapter VIII Embrace the truth. You are not likely to enjoy the feeling of the forthcoming promotion or the confidence regarding your place in the company because the price for the robust habit of overworking is too high and usually unjustified. Besides, an overworked employee might, after a certain number of extra hours be so fatigued that any additional work he or she might try to perform would lead to mistakes and oversights that would take longer to fix than the additional hours worked. Despite we all have a limited amount of time per day, with the strong eagerness to work more, people have invented how to stretch the working time. It was not that difficult. They merely sacrificed their resting time. Employees keep on trading sleep for a few additional hours of work. Unfortunately, this decision was completely misguided by poor logic. In reality, as well as electronic devices human beings also demand the time to recharge in order to stay alert, energetic and creative. Thanks to nature we can do so via sleeping. Ironically, this is the first thing that is usually sacrificed with the intention to work more. However, cutting down the resting time, chances are, you are not likely to increase your productivity, but rather harm it recklessly. As a result, with constant overworking and too little rest, people face massive difficulties with staying motivated, productive and up to new wins. Sometimes we all need to crunch and work overtime. No doubt, a few extra hours of work can add value and boost productivity in the short term. Meanwhile, if you stay in the constant crunch mode, in the long run, you are likely to end up approaching burnout. The multiple studies within the huge body of knowledge regarding the correlation between hours of work and productivity show that 40 hours per week is both optimal and the most efficient duration of the working week. The point is that 40 hours is not a random length. In fact, it was tested, designed and justified over centuries. People can stay neither productive nor efficient if they overwork on a regular basis. In fact, productivity plummets after 8 hours of active work a day. Every hour after 9 hours of work does not pay off at all. The concentration tends to evaporate then, and the working process transforms into pointless procrastination and a continuous waste of time. However, the practice shows that even 8 hours is too much for productive work. People cannot retain focus and concentration for too long. They get easily distracted by chatty colleagues, social media, and even the weather. The survey showed that 69% of professionals waste on average from 30 to 60 minutes at work on a daily basis. It is a human nature to try to be everywhere and doing everything. We all easily lose focus and spend a lot of precious time trying to restore it. Nevertheless, it is impossible to escape interruptions completely. Even if you manage to shut the door, enter your alone zone and turn off all the notifications, you still have your mind that constantly generates striking ideas and chaotic thoughts. All in all, both the science and the practice show that people cannot work productively for more than 7 hours a day. Moreover, some studies indicate that 35 hours per week is the ideal maximum for the intellectual work. Hence, if you are a knowledge worker and your tasks require creativity, your brain can produce the results of the highest quality if you work no more than 7 hours a day. Nonetheless, you should aim for an 8-hour working day and 40-hour work week, taking into account your life is full of distraction and it is impossible to fully escape time stealers. Conclusion Do not schedule anything over 8 hours a day. Anything more is the waste of time. It is an illusion of work. It is rather a busyness than the efficient process of production of outstanding results. Moreover, the underrated secret of staying productive is a night’s rest. Do not trade your sleep for work. It is not going to pay off. High productivity does not last forever. You can stay insanely productive for 7 hours per day. Use this time wisely. Please feel free to check out Slice Planner that was designed to help you improve your productivity with the revolutionary new approach to planning. Live on Kickstarter now at 35% OFF. ", "title": "Here’s Exactly How Long You Can Retain Insane Productivity For", "sentences": [{"029e": "Here’s Exactly How Long You Can Retain Insane Productivity For"}, {"299d": "BY MAX LUKOMINKSKYI"}, {"e55c": "Work harder, get up earlier, stay up later — those have been considered to be prerequisites for better results and incredible productivity for a long time. The more you work, the more tasks you get done. The harder they work the closer they get to the things they want to accomplish. Is that really true?"}, {"9851": "Most people believe that more hours spent doing things can actually help them experience a breakthrough toward massive wins. In reality, this mindset very often appears to be completely misleading."}, {"79fd": "For many people, extra hours have become a conventional way of working rather than a rare exception. According to the recent survey conducted by EY, approximately half (46%) of managers, globally, are working more than 40 hours a week, 24% of which work more than 50 hours a week."}, {"033d": "The reasons for overworking often differ from organizational culture and policy or supervisory pressure to the individual`s own decision to stay in the office longer than required in order to show his or her commitment, dedication and meet employer`s expectations."}, {"8fb8": "However, the truth is that overworking has nothing to do with the quality and efficiency of your work. Instead, it contributes to depression, insomnia, exhaustion and poor performance."}, {"85d2": "The innate human desire to improve one`s lot is strong enough to make workmen apt to overwork themselves and ruin their health and constitution in a few years — Adam Smith, 1776, Wealth of Nations, Book One, Chapter VIII"}, {"a686": "Embrace the truth. You are not likely to enjoy the feeling of the forthcoming promotion or the confidence regarding your place in the company because the price for the robust habit of overworking is too high and usually unjustified."}, {"7dbd": "Besides, an overworked employee might, after a certain number of extra hours be so fatigued that any additional work he or she might try to perform would lead to mistakes and oversights that would take longer to fix than the additional hours worked."}, {"c3b2": "Despite we all have a limited amount of time per day, with the strong eagerness to work more, people have invented how to stretch the working time. It was not that difficult. They merely sacrificed their resting time. Employees keep on trading sleep for a few additional hours of work."}, {"36c2": "Unfortunately, this decision was completely misguided by poor logic. In reality, as well as electronic devices human beings also demand the time to recharge in order to stay alert, energetic and creative. Thanks to nature we can do so via sleeping. Ironically, this is the first thing that is usually sacrificed with the intention to work more."}, {"94e7": "However, cutting down the resting time, chances are, you are not likely to increase your productivity, but rather harm it recklessly. As a result, with constant overworking and too little rest, people face massive difficulties with staying motivated, productive and up to new wins."}, {"326d": "Sometimes we all need to crunch and work overtime. No doubt, a few extra hours of work can add value and boost productivity in the short term. Meanwhile, if you stay in the constant crunch mode, in the long run, you are likely to end up approaching burnout."}, {"bc46": "The multiple studies within the huge body of knowledge regarding the correlation between hours of work and productivity show that 40 hours per week is both optimal and the most efficient duration of the working week."}, {"1f62": "The point is that 40 hours is not a random length. In fact, it was tested, designed and justified over centuries. People can stay neither productive nor efficient if they overwork on a regular basis."}, {"5f34": "In fact, productivity plummets after 8 hours of active work a day. Every hour after 9 hours of work does not pay off at all. The concentration tends to evaporate then, and the working process transforms into pointless procrastination and a continuous waste of time."}, {"429e": "However, the practice shows that even 8 hours is too much for productive work. People cannot retain focus and concentration for too long. They get easily distracted by chatty colleagues, social media, and even the weather. The survey showed that 69% of professionals waste on average from 30 to 60 minutes at work on a daily basis."}, {"6911": "It is a human nature to try to be everywhere and doing everything. We all easily lose focus and spend a lot of precious time trying to restore it. Nevertheless, it is impossible to escape interruptions completely. Even if you manage to shut the door, enter your alone zone and turn off all the notifications, you still have your mind that constantly generates striking ideas and chaotic thoughts."}, {"bfef": "All in all, both the science and the practice show that people cannot work productively for more than 7 hours a day. Moreover, some studies indicate that 35 hours per week is the ideal maximum for the intellectual work. Hence, if you are a knowledge worker and your tasks require creativity, your brain can produce the results of the highest quality if you work no more than 7 hours a day."}, {"5bd6": "Nonetheless, you should aim for an 8-hour working day and 40-hour work week, taking into account your life is full of distraction and it is impossible to fully escape time stealers."}, {"db38": "Conclusion"}, {"0bb7": "Do not schedule anything over 8 hours a day. Anything more is the waste of time. It is an illusion of work. It is rather a busyness than the efficient process of production of outstanding results."}, {"215a": "Moreover, the underrated secret of staying productive is a night’s rest. Do not trade your sleep for work. It is not going to pay off."}, {"9d39": "High productivity does not last forever. You can stay insanely productive for 7 hours per day. Use this time wisely."}, {"abb3": "Please feel free to check out Slice Planner that was designed to help you improve your productivity with the revolutionary new approach to planning. Live on Kickstarter now at 35% OFF."}], "child": "1161_1"}