{"name": "1162", "parent": "", "content": "Please Stop Interrupting Me! Why interruptions make us irritable, anxious, and unproductive Several years ago, I devised a system for quickly getting into the “zone” while I wrote. Free from distractions and interruptions, I wrote quickly, joyfully, and with surprisingly little effort. But then we moved, and now my husband and I both work mostly from home. And although we work in separate rooms, at opposite ends of the house, he is forever interrupting me, jarring me out of that coveted state of flow. He’ll saunter into my office to use my recycling bin, and even if my attention is clearly fixed on my work, he’ll put his face right in front of my computer screen and lean in for a smooch. I recognize how sweet this is. And I am super grateful to have such a loving and affectionate husband. And I appreciate being able to work from home, because it allows me more time with both my husband and my children (who also interrupt me constantly once they are home from school). But by 4:00 pm, each interruption causes me so much irritation that it sometimes borders on rage. Even when the person interrupting me is a considerate and whispering middle-schooler needing homework help, or a loving husband who wants to shower me with affection, I feel frustrated and snappish. Am I overreacting? Perhaps I could try harder to keep my irritation in check, but research gives me some grounds for it. In fact, studies have found that getting interrupted isn’t just a nuisance; it’s costly and problematic. Here are three sometimes hidden costs to interruptions. For starters, they cost us a lot of time. On average, interruptions take 23 minutes and 15 seconds to recover from–even if the distraction is only a minute! For example, say I’m uber-focused, but then my hubby (or perhaps your co-worker) comes in for a minute or two to chit-chat about dinner plans (or for an upcoming meeting). Before I turn my attention back to my work, I might decide to take a quick peek at my email, and while I’m doing that, notice that I’ve missed a call and three texts. If I answer just a few of these incoming communications, it may well be longer than 23 minutes before I get back to work. I suppose, if I tried really hard, I could get back on track faster. But that effort takes focus and energy that I could be putting toward my writing or other work. Second, interruptions lower the quality of our work. A mountain of research has demonstrated time and again that interruptions increase our error rate. For example, when college students that are concentrating on a task are interrupted for 2.8 seconds, they make twice as many errors as those who are not interrupted. When they are interrupted for 4.4 seconds, their error rate triples. According Glenn Wilson at the University of London, just being in a work situation where you can be interrupted by text and email can decrease your IQ by 10 points. For writers like me, the news here is even more depressing: Interruptions measurably lower both the quantity and the quality of writing we can do in even a very short period of time (20 minutes). Finally, interruptions contribute to stress and overwhelm, making us feel conflicted and time-pressured. As we shift our focus between tasks–as when we steal a glance at our email while we are working on a presentation–it increases our perception that we have too much to do in the time that we have to do it. According to Gloria Mark, who studies interruption at UC Irvine, when we are diverted from one task to another, we can pick up our work pace to make up for lost time, but this increased speed comes at a cost: People who’ve been interrupted report having a greater workload, more stress and frustration, feeling more time pressure, and exerting more effort. And guess what? This makes a lot of people feel annoyed, anxious, and irritable, as I do. Behavioral scientist Alan Keen believes the stress and overload that comes from constantly being expected to multitask is causing an “epidemic of rage.” Interruption and task switching raises stress hormones and adrenaline, which tends to make us more aggressive and impulsive. The takeaway: Interruption drains our energy and dampens our performance. The stress, inefficiency, inaccuracy, and time pressure that interruptions create are the very opposite of being in the sweet spot. Take time today to build yourself a fortress against interruptions. You’ll be more productive — and a heck of a lot happier! If you need more support building your fortress, I hope you’ll join my The Science of Finding Flow. In 9 self-paced units, you’ll learn to allow your most joyful, productive, energetic, and successful self to emerge. To learn more about this eCourse or to enroll, click here. ", "title": "Please Stop Interrupting Me!", "sentences": [{"ded2": "Please Stop Interrupting Me!"}, {"ecef": "Why interruptions make us irritable, anxious, and unproductive"}, {"21bb": "Several years ago, I devised a system for quickly getting into the “zone” while I wrote. Free from distractions and interruptions, I wrote quickly, joyfully, and with surprisingly little effort."}, {"20bb": "But then we moved, and now my husband and I both work mostly from home. And although we work in separate rooms, at opposite ends of the house, he is forever interrupting me, jarring me out of that coveted state of flow. He’ll saunter into my office to use my recycling bin, and even if my attention is clearly fixed on my work, he’ll put his face right in front of my computer screen and lean in for a smooch."}, {"c842": "I recognize how sweet this is. And I am super grateful to have such a loving and affectionate husband. And I appreciate being able to work from home, because it allows me more time with both my husband and my children (who also interrupt me constantly once they are home from school)."}, {"6dcf": "But by 4:00 pm, each interruption causes me so much irritation that it sometimes borders on rage. Even when the person interrupting me is a considerate and whispering middle-schooler needing homework help, or a loving husband who wants to shower me with affection, I feel frustrated and snappish."}, {"e2b7": "Am I overreacting? Perhaps I could try harder to keep my irritation in check, but research gives me some grounds for it. In fact, studies have found that getting interrupted isn’t just a nuisance; it’s costly and problematic. Here are three sometimes hidden costs to interruptions."}, {"e489": "For starters, they cost us a lot of time. On average, interruptions take 23 minutes and 15 seconds to recover from–even if the distraction is only a minute!"}, {"ab12": "For example, say I’m uber-focused, but then my hubby (or perhaps your co-worker) comes in for a minute or two to chit-chat about dinner plans (or for an upcoming meeting). Before I turn my attention back to my work, I might decide to take a quick peek at my email, and while I’m doing that, notice that I’ve missed a call and three texts. If I answer just a few of these incoming communications, it may well be longer than 23 minutes before I get back to work."}, {"01ab": "I suppose, if I tried really hard, I could get back on track faster. But that effort takes focus and energy that I could be putting toward my writing or other work."}, {"e97b": "Second, interruptions lower the quality of our work. A mountain of research has demonstrated time and again that interruptions increase our error rate. For example, when college students that are concentrating on a task are interrupted for 2.8 seconds, they make twice as many errors as those who are not interrupted. When they are interrupted for 4.4 seconds, their error rate triples."}, {"81fb": "According Glenn Wilson at the University of London, just being in a work situation where you can be interrupted by text and email can decrease your IQ by 10 points. For writers like me, the news here is even more depressing: Interruptions measurably lower both the quantity and the quality of writing we can do in even a very short period of time (20 minutes)."}, {"fe74": "Finally, interruptions contribute to stress and overwhelm, making us feel conflicted and time-pressured. As we shift our focus between tasks–as when we steal a glance at our email while we are working on a presentation–it increases our perception that we have too much to do in the time that we have to do it."}, {"79ed": "According to Gloria Mark, who studies interruption at UC Irvine, when we are diverted from one task to another, we can pick up our work pace to make up for lost time, but this increased speed comes at a cost: People who’ve been interrupted report having a greater workload, more stress and frustration, feeling more time pressure, and exerting more effort."}, {"e594": "And guess what? This makes a lot of people feel annoyed, anxious, and irritable, as I do. Behavioral scientist Alan Keen believes the stress and overload that comes from constantly being expected to multitask is causing an “epidemic of rage.” Interruption and task switching raises stress hormones and adrenaline, which tends to make us more aggressive and impulsive."}, {"34a3": "The takeaway: Interruption drains our energy and dampens our performance. The stress, inefficiency, inaccuracy, and time pressure that interruptions create are the very opposite of being in the sweet spot."}, {"ef29": "Take time today to build yourself a fortress against interruptions. You’ll be more productive — and a heck of a lot happier! If you need more support building your fortress, I hope you’ll join my The Science of Finding Flow. In 9 self-paced units, you’ll learn to allow your most joyful, productive, energetic, and successful self to emerge. To learn more about this eCourse or to enroll, click here."}], "child": "1162_1\t1162_2\t1162_3"}