{"name": "1163", "parent": "", "content": "What Would You Do If You Had A Month of “Me Time”? A month ago it started. I would have about 5 weeks to myself and thought about how much I could get done while my wife and three kids were in Argentina traveling and visiting with family during summer vacation. An entire month of extra ‘me time.’ That time is now almost over. I pick them up from the airport next week. My time alone didn’t go as planned, but I did learn a couple things from reflecting on how I spent it. Lessons Learned: To start the 5 weeks, I reviewed my Honey-Do List and made several lists of my own. I like lists. They give me focus. They give me an outline of steps to take. It feels good to check items off the list and say “Done.” Lists are also a source of great anxiety and a misleading tool if used improperly. My to-do lists usually contain a mix of items that fall into opposing camps: creative vs. maintenance, recharging vs. charging ahead, big and time-consuming vs. quick hits. Taking a breath and thinking back on the past four weeks, here are some observations. Copyright: fieldwork / 123RF Stock Photo Course Corrections: With the one week I have left, here are the changes I’m committing to. Put Into Practice All fine in theory. But what would this look like from day to day? This post is one example. In the beginning of “Me Time” I had planned to use the extra time to write about and publish several ideas piling up in my drafts folder. Four weeks later my list of ideas is even bigger, but I didn’t complete a single post. Today, I traded-off a few hours of maintenance items to sit down and follow-through on something that simultaneously feeds my spiritual, emotional and mental needs. As I wind down this article, I not only feel good about checking something off my original list, I also feel nourished. I made time to recharge my energy and be creative. For all the other scenarios out there — for whatever you might be personally experiencing — the one take-away is this. Shift your focus from simply doing, to doing the right things. As Greg McKeown says in Essentialism, narrow your focus to what’s essentially important to you and be willing to trade-off the trivial many (e.g. checking my phone every other minute, staying up late binge watching Netflix, etc. in my case.) In The One Thing, Gary Keller recommends we ask ourselves some variation of the following question, “What’s the one thing I can do today/this week/this month to [insert context for family, career, exercise, whatever applies to you] such that by doing it everything will be easier or unnecessary?” Using my personal example, I asked “What’s the one thing I can do today for my peace of mind, body and soul such that by doing it everything will be easier or unnecessary?” My answer: Block out a couple of hours to reflect, collect my thoughts, then write about them. As I close, I already feel the nourishment kicking in. I still have a lot of necessary chores to do, but I’ll get to them in between more important things. Instead of rushing back to attack my to-do list, I’m going to take the dog for a nice leisurely walk (without my phone) to enjoy the sun, the warm breeze and the simple pleasure of pausing to sniff the roses. What would you have done with that time? Next Story: Respecting The Yin and Yang of ProductivityIn this achievement, results-driven culture that we find ourselves in, it can be easy to get caught up in the craze…medium.com ", "title": "What Would You Do If You Had A Month of “Me Time”?", "sentences": [{"7638": "What Would You Do If You Had A Month of “Me Time”?"}, {"0d5b": "A month ago it started. I would have about 5 weeks to myself and thought about how much I could get done while my wife and three kids were in Argentina traveling and visiting with family during summer vacation."}, {"42af": "An entire month of extra ‘me time.’"}, {"0107": "That time is now almost over. I pick them up from the airport next week. My time alone didn’t go as planned, but I did learn a couple things from reflecting on how I spent it."}, {"abb5": "Lessons Learned:"}, {"98c5": "To start the 5 weeks, I reviewed my Honey-Do List and made several lists of my own. I like lists. They give me focus. They give me an outline of steps to take. It feels good to check items off the list and say “Done.”"}, {"c1d5": "Lists are also a source of great anxiety and a misleading tool if used improperly."}, {"b49a": "My to-do lists usually contain a mix of items that fall into opposing camps: creative vs. maintenance, recharging vs. charging ahead, big and time-consuming vs. quick hits."}, {"c44f": "Taking a breath and thinking back on the past four weeks, here are some observations."}, {"95fe": "Copyright: fieldwork / 123RF Stock Photo"}, {"27e4": "Course Corrections:"}, {"b46e": "With the one week I have left, here are the changes I’m committing to."}, {"4568": "Put Into Practice"}, {"a802": "All fine in theory. But what would this look like from day to day?"}, {"9034": "This post is one example. In the beginning of “Me Time” I had planned to use the extra time to write about and publish several ideas piling up in my drafts folder. Four weeks later my list of ideas is even bigger, but I didn’t complete a single post. Today, I traded-off a few hours of maintenance items to sit down and follow-through on something that simultaneously feeds my spiritual, emotional and mental needs. As I wind down this article, I not only feel good about checking something off my original list, I also feel nourished. I made time to recharge my energy and be creative."}, {"8924": "For all the other scenarios out there — for whatever you might be personally experiencing — the one take-away is this. Shift your focus from simply doing, to doing the right things."}, {"d0dd": "As Greg McKeown says in Essentialism, narrow your focus to what’s essentially important to you and be willing to trade-off the trivial many (e.g. checking my phone every other minute, staying up late binge watching Netflix, etc. in my case.)"}, {"1e6e": "In The One Thing, Gary Keller recommends we ask ourselves some variation of the following question, “What’s the one thing I can do today/this week/this month to [insert context for family, career, exercise, whatever applies to you] such that by doing it everything will be easier or unnecessary?”"}, {"7322": "Using my personal example, I asked “What’s the one thing I can do today for my peace of mind, body and soul such that by doing it everything will be easier or unnecessary?” My answer: Block out a couple of hours to reflect, collect my thoughts, then write about them."}, {"ed3d": "As I close, I already feel the nourishment kicking in. I still have a lot of necessary chores to do, but I’ll get to them in between more important things. Instead of rushing back to attack my to-do list, I’m going to take the dog for a nice leisurely walk (without my phone) to enjoy the sun, the warm breeze and the simple pleasure of pausing to sniff the roses."}, {"4188": "What would you have done with that time?"}, {"aa46": "Next Story:"}, {"3256": "Respecting The Yin and Yang of ProductivityIn this achievement, results-driven culture that we find ourselves in, it can be easy to get caught up in the craze…medium.com"}], "child": "1163_1\t1163_2\t1163_3\t1163_4\t1163_5\t1163_61163_1\t1163_2\t1163_3\t1163_4\t1163_5\t1163_6"}