{"name": "1165", "parent": "", "content": "Time Waits for No One. And it especially won’t wait for me. A year ago, my husband and I were taking a walk through our mountain neighborhood. We passed an adorable young boy wearing a backpack walking with his father toward a car. I shouted out, “Hello. Are you on your way to school?” Peter looked at me in disbelief. “Honey, it’s 5pm.” I began giggling with embarrassment. Peter swiftly guided me on our way. The father ignored me and put his arm around his son, presumably to protect him from the crazy lady of the forest. I have trouble with time management. In my defense, I’m on disability and can’t work. As a result of not having a regimented schedule, I often sleep late and am unaware of what time it is. Or what day it is, for that matter. A few months ago I was at the dentist and upon preparing to leave I cheerfully said, “Have a great weekend!” My dentist looked at me with sympathy, an expression I am not unfamiliar with, and said, “Um, it’s the beginning of the week.” I was embarrassed but made a quick recovery and replied, “Oh right, it’s Monday! Have a great week.” Dr. B was now looking at me with full-on pity. He said, “Sherry, it’s not Monday.” Finally, in exasperation, I blurted out, “Well, what day is it?” “It’s Tuesday.” Ah, Tuesday. Still the beginning of the week, but not Monday. How pedantic does one have to be to fuck with an obviously confused but well-meaning patient in this way? I made a mental note: Dr. B has a mean streak. Time management has always been the bane of my existence. No matter how early I used to get up, I was always late for work. The entire way to work, I was busy making up excuses while simultaneously speeding and applying make-up, occasionally letting loose with a vitriolic string of profane insults to the drivers surrounding me, all of whom seemed to be slowly making their way toward nowhere without a care in the world. One of my problems is the shower. Since I was a child, the shower has had a powerful hold over me, completely stopping time and holding me hostage, not unlike the Bermuda Triangle. I want to get out. I just can’t. Another issue is my life-long OCD. I will finally be completely ready to leave the house when that little voice in my head says, “Wash the dishes before you leave or you will die.” The medication only helps so much. I also have a problem telling time. My grandfather was a watch repairman, and I asked him if I could have a watch for my 6th birthday. He said he would give me a watch as soon as I learned to tell time. I immediately set upon my big sister to teach me. She is two years older than me, and as soon as she learned something new she would generously share her knowledge with me. She was a great teacher and had me counting and reciting the alphabet at an impressively early age, as well as learning to read very easily because of her coaching me with phonetics. She worked tirelessly to teach me how to how to tell time, but I could not get the hang of it to save my life. Needless to say, I did not get the watch from my grandpa, not that it would have been anything more than ornamental. To this day, when I look at my watch I have to stare at it for 5 minutes before I can figure out where the big hand is and where the little hand is and what it all means. My husband frequently takes naps and will ask me to wake him in 20 minutes. I look at my watch and try to calculate when 20 minutes from now is but it usually will not compute and I end up having to say, “Just tell me what time you want me to get you up.” Then I look at the digital clock on the television to be sure to wake him up on time. Still, I frequently let him oversleep, because I am easily distracted and when I am drawing or writing, time is a complete mystery to me. What seems like 3 minutes is 15 and what feels like 15 minutes is 3 hours. If I want to wake Peter up on time, I have to stop what I’m doing and just sit and watch the clock patiently, waiting for the LED display to match the prearranged time. At which point I go in his office and he’s already awake! Just watching me with a sweet smile. Meanwhile, I’m thinking, well, there went 20 minutes of my life I will never get back. I could have spent that extra time in the Bermuda Triangle. ", "title": "Time Waits for No One.", "sentences": [{"043a": "Time Waits for No One."}, {"1bed": "And it especially won’t wait for me."}, {"d90b": "A year ago, my husband and I were taking a walk through our mountain neighborhood. We passed an adorable young boy wearing a backpack walking with his father toward a car."}, {"8c60": "I shouted out, “Hello. Are you on your way to school?”"}, {"bfed": "Peter looked at me in disbelief. “Honey, it’s 5pm.”"}, {"1404": "I began giggling with embarrassment. Peter swiftly guided me on our way."}, {"93a4": "The father ignored me and put his arm around his son, presumably to protect him from the crazy lady of the forest."}, {"3ac2": "I have trouble with time management."}, {"3d6a": "In my defense, I’m on disability and can’t work. As a result of not having a regimented schedule, I often sleep late and am unaware of what time it is. Or what day it is, for that matter."}, {"80ae": "A few months ago I was at the dentist and upon preparing to leave I cheerfully said, “Have a great weekend!”"}, {"95af": "My dentist looked at me with sympathy, an expression I am not unfamiliar with, and said, “Um, it’s the beginning of the week.”"}, {"4783": "I was embarrassed but made a quick recovery and replied, “Oh right, it’s Monday! Have a great week.”"}, {"61b6": "Dr. B was now looking at me with full-on pity. He said, “Sherry, it’s not Monday.”"}, {"c90d": "Finally, in exasperation, I blurted out, “Well, what day is it?”"}, {"30a9": "“It’s Tuesday.”"}, {"25e5": "Ah, Tuesday. Still the beginning of the week, but not Monday. How pedantic does one have to be to fuck with an obviously confused but well-meaning patient in this way? I made a mental note: Dr. B has a mean streak."}, {"79fd": "Time management has always been the bane of my existence. No matter how early I used to get up, I was always late for work."}, {"35bf": "The entire way to work, I was busy making up excuses while simultaneously speeding and applying make-up, occasionally letting loose with a vitriolic string of profane insults to the drivers surrounding me, all of whom seemed to be slowly making their way toward nowhere without a care in the world."}, {"1f2f": "One of my problems is the shower. Since I was a child, the shower has had a powerful hold over me, completely stopping time and holding me hostage, not unlike the Bermuda Triangle. I want to get out. I just can’t."}, {"cb9f": "Another issue is my life-long OCD. I will finally be completely ready to leave the house when that little voice in my head says, “Wash the dishes before you leave or you will die.” The medication only helps so much."}, {"d24f": "I also have a problem telling time."}, {"56f3": "My grandfather was a watch repairman, and I asked him if I could have a watch for my 6th birthday. He said he would give me a watch as soon as I learned to tell time."}, {"24ac": "I immediately set upon my big sister to teach me. She is two years older than me, and as soon as she learned something new she would generously share her knowledge with me. She was a great teacher and had me counting and reciting the alphabet at an impressively early age, as well as learning to read very easily because of her coaching me with phonetics."}, {"0224": "She worked tirelessly to teach me how to how to tell time, but I could not get the hang of it to save my life."}, {"31fd": "Needless to say, I did not get the watch from my grandpa, not that it would have been anything more than ornamental."}, {"2520": "To this day, when I look at my watch I have to stare at it for 5 minutes before I can figure out where the big hand is and where the little hand is and what it all means."}, {"44c2": "My husband frequently takes naps and will ask me to wake him in 20 minutes. I look at my watch and try to calculate when 20 minutes from now is but it usually will not compute and I end up having to say, “Just tell me what time you want me to get you up.”"}, {"d9eb": "Then I look at the digital clock on the television to be sure to wake him up on time. Still, I frequently let him oversleep, because I am easily distracted and when I am drawing or writing, time is a complete mystery to me. What seems like 3 minutes is 15 and what feels like 15 minutes is 3 hours."}, {"d0c9": "If I want to wake Peter up on time, I have to stop what I’m doing and just sit and watch the clock patiently, waiting for the LED display to match the prearranged time. At which point I go in his office and he’s already awake! Just watching me with a sweet smile."}, {"21b4": "Meanwhile, I’m thinking, well, there went 20 minutes of my life I will never get back. I could have spent that extra time in the Bermuda Triangle."}], "child": "1165_1\t1165_2\t1165_3\t1165_4\t1165_5\t1165_6\t1165_7\t1165_8\t1165_9\t1165_10\t1165_11\t1165_12\t1165_13\t1165_14\t1165_15\t1165_16\t1165_17\t1165_181165_1\t1165_2\t1165_3\t1165_4\t1165_5\t1165_6\t1165_7\t1165_8\t1165_9\t1165_10\t1165_11\t1165_12\t1165_13\t1165_14\t1165_15\t1165_16\t1165_17\t1165_181165_1\t1165_2\t1165_3\t1165_4\t1165_5\t1165_6\t1165_7\t1165_8\t1165_9\t1165_10\t1165_11\t1165_12\t1165_13\t1165_14\t1165_15\t1165_16\t1165_17\t1165_181165_1\t1165_2\t1165_3\t1165_4\t1165_5\t1165_6\t1165_7\t1165_8\t1165_9\t1165_10\t1165_11\t1165_12\t1165_13\t1165_14\t1165_15\t1165_16\t1165_17\t1165_181165_1\t1165_2\t1165_3\t1165_4\t1165_5\t1165_6\t1165_7\t1165_8\t1165_9\t1165_10\t1165_11\t1165_12\t1165_13\t1165_14\t1165_15\t1165_16\t1165_17\t1165_18"}