{"name": "1166", "parent": "", "content": "Do Just This One Thing To Improve Your Productivity Today The One Life Hack I’d Like Everyone To Know Keep your phone out of sight. I’ll say that again, very slowly, because it might not make sense at first. Keep. Your phone. Out. Of. Sight. The difference between this… …and this… …is an increase in your productivity with a magnitude of at least 5x-10x. A study at the University of California, Irvine, found that… “…the typical office worker is interrupted or switches tasks, on average, every three minutes and five seconds.” 3 minutes and 5 seconds. That’s 185 seconds in total between one interruption and the next. What’s more… “…it takes an average of 23 minutes and 15 seconds to get back to the task.” 23 minutes! That’s over 7 times as long as it takes for you to be interrupted again. Hm. How does that work? Oh, right, it doesn’t. What does that tell us? The average worker never even gets close to the zone of deep work, where complex tasks are accomplished with good results. As if that wasn’t enough — your phone is only one of many sources of distractions, after all — we keep our biggest nemesis right in front of us. Not only will we look at it every time it vibrates or makes a noise, when our phone is within arm’s reach, we’ll naturally pick it up every couple minutes, just because we can. You know “just in case.” Don’t give me that look. I know you do it too. We’re all weak. Well, Justin, you can stay in your case from now on (pun alert), because we won’t be playing your game any more. Out of sight, out of mind. Put your phone… …or keep it in another room altogether. The level of peace, relaxation and productivity you’ll face will be unprecedented. Stop being “the typical office worker.” Start being an awesome office worker. Sometimes, all it takes is something as small as moving your phone a few centimeters. That’s the life hack I’d like everyone to know. Think it’s smart? Hit the heart! 💚 Help others hack their productivity by sharing this with them. I write more here. This started as an answer on Quora. ", "title": "Do Just This One Thing To Improve Your Productivity Today", "sentences": [{"2210": "Do Just This One Thing To Improve Your Productivity Today"}, {"fd9f": "The One Life Hack I’d Like Everyone To Know"}, {"0282": "Keep your phone out of sight. I’ll say that again, very slowly, because it might not make sense at first."}, {"8770": "Keep. Your phone. Out. Of. Sight."}, {"7dd3": "The difference between this…"}, {"e948": "…and this…"}, {"ea4e": "…is an increase in your productivity with a magnitude of at least 5x-10x."}, {"bef2": "A study at the University of California, Irvine, found that…"}, {"22e1": "“…the typical office worker is interrupted or switches tasks, on average, every three minutes and five seconds.”"}, {"e4eb": "3 minutes and 5 seconds. That’s 185 seconds in total between one interruption and the next."}, {"ae92": "What’s more…"}, {"acdc": "“…it takes an average of 23 minutes and 15 seconds to get back to the task.”"}, {"9073": "23 minutes! That’s over 7 times as long as it takes for you to be interrupted again."}, {"933a": "Hm. How does that work? Oh, right, it doesn’t."}, {"62fa": "What does that tell us? The average worker never even gets close to the zone of deep work, where complex tasks are accomplished with good results."}, {"385d": "As if that wasn’t enough — your phone is only one of many sources of distractions, after all — we keep our biggest nemesis right in front of us."}, {"fd2d": "Not only will we look at it every time it vibrates or makes a noise, when our phone is within arm’s reach, we’ll naturally pick it up every couple minutes, just because we can."}, {"8f27": "You know “just in case.” Don’t give me that look. I know you do it too. We’re all weak."}, {"8069": "Well, Justin, you can stay in your case from now on (pun alert), because we won’t be playing your game any more."}, {"01f4": "Out of sight, out of mind."}, {"72e6": "Put your phone…"}, {"019f": "…or keep it in another room altogether."}, {"db3e": "The level of peace, relaxation and productivity you’ll face will be unprecedented."}, {"0899": "Stop being “the typical office worker.” Start being an awesome office worker."}, {"efa3": "Sometimes, all it takes is something as small as moving your phone a few centimeters. That’s the life hack I’d like everyone to know."}, {"a1a6": "Think it’s smart? Hit the heart! 💚 Help others hack their productivity by sharing this with them."}, {"e316": "I write more here. This started as an answer on Quora."}], "child": "1166_1\t1166_2\t1166_3\t1166_4\t1166_5\t1166_6\t1166_71166_1\t1166_2\t1166_3\t1166_4\t1166_5\t1166_6\t1166_71166_1\t1166_2\t1166_3\t1166_4\t1166_5\t1166_6\t1166_7"}