{"sentences": [{"dd87": "How I carefully crafted a truly terrible data visualization"}, {"207f": "Yes, you read that right. I am going to explain how I put together a really bad visualization, intentionally."}, {"09d4": "Andy Kirk of visualisingdata.com posted an interesting contest challenging everyone to come up with the “best worst viz.” Of course, one of the motivations for me doing this is to win a copy of his book. But the contest itself is also a thoughtful exercise."}, {"b2fa": "When talking about extremely bad visualizations, the stereotypical ones often involve 3D pie charts, rainbow color palettes and terrible choices of fonts, layouts, and colors."}, {"55e2": "In my opinion, bad visualizations don’t have to be just that. The goal I had in mind was to create a piece that looks totally harmless, but will torture your brain until you realize how absurdly ridiculous the whole thing is."}, {"9056": "I collected data from visualizations featured on viz.wtf and drew each mark to represent one of the visualizations and its properties. Example questions to exercise your WTF gland are:"}, {"4190": "Before reading the next section, try to figure out everything that is wrong with this chart by yourself."}, {"8cc7": "Concept"}, {"7b05": "The main idea was to create conflicts in perception and mess with viewers’ cognitive thinking."}, {"d4f0": "Bad visualizations usually have mismatches between visual encodings and data, such as encoding incomparable areas (3D pie) for numerical values. These mismatches leave viewers with little to do but scratch their heads, then abandon the visualization because it takes too much effort to make sense of it."}, {"8518": "I wanted to take bad to the next level, and was inspired by one of my favorite responses from the Stack Overflow questions, “What is the best comment in source code you have ever encountered?”"}, {"2a09": "#define TRUE FALSE//Happy debugging suckers"}, {"28ad": "My goal was to make something that seems like it can be interpreted, but creates very strong conflicts with our prior knowledge that are almost impossible to overcome. To do this, I chose very direct choices of encoding, such as using color to represent color, and position to represent position, then set the mappings counterintuitively so I could wreak complete havoc with viewers’ minds."}, {"7f27": "Data"}, {"c0e6": "I was looking for a good dataset to try the idea on but could not find one I really liked. Then I got the idea that it would be recursively bad to create a bad visualization, of bad visualizations, so I manually collected some data from viz.wtf"}, {"108f": "Here are all the crimes I have committed to this chart:"}, {"f6a0": "If you spot other terrible aspects of this visualization that I’ve overlooked, please feel free to leave a response below, or tweet at me."}], "content": "How I carefully crafted a truly terrible data visualization Yes, you read that right. I am going to explain how I put together a really bad visualization, intentionally. Andy Kirk of visualisingdata.com posted an interesting contest challenging everyone to come up with the “best worst viz.” Of course, one of the motivations for me doing this is to win a copy of his book. But the contest itself is also a thoughtful exercise. When talking about extremely bad visualizations, the stereotypical ones often involve 3D pie charts, rainbow color palettes and terrible choices of fonts, layouts, and colors. In my opinion, bad visualizations don’t have to be just that. The goal I had in mind was to create a piece that looks totally harmless, but will torture your brain until you realize how absurdly ridiculous the whole thing is. I collected data from visualizations featured on viz.wtf and drew each mark to represent one of the visualizations and its properties. Example questions to exercise your WTF gland are: Before reading the next section, try to figure out everything that is wrong with this chart by yourself. Concept The main idea was to create conflicts in perception and mess with viewers’ cognitive thinking. Bad visualizations usually have mismatches between visual encodings and data, such as encoding incomparable areas (3D pie) for numerical values. These mismatches leave viewers with little to do but scratch their heads, then abandon the visualization because it takes too much effort to make sense of it. I wanted to take bad to the next level, and was inspired by one of my favorite responses from the Stack Overflow questions, “What is the best comment in source code you have ever encountered?” #define TRUE FALSE//Happy debugging suckers My goal was to make something that seems like it can be interpreted, but creates very strong conflicts with our prior knowledge that are almost impossible to overcome. To do this, I chose very direct choices of encoding, such as using color to represent color, and position to represent position, then set the mappings counterintuitively so I could wreak complete havoc with viewers’ minds. Data I was looking for a good dataset to try the idea on but could not find one I really liked. Then I got the idea that it would be recursively bad to create a bad visualization, of bad visualizations, so I manually collected some data from viz.wtf Here are all the crimes I have committed to this chart: If you spot other terrible aspects of this visualization that I’ve overlooked, please feel free to leave a response below, or tweet at me. ", "parent": "", "title": "How I carefully crafted a truly terrible data visualization", "child": "117_1\t117_2", "name": "117"}