{"name": "1173", "parent": "", "content": "Bim ! L’incroyable rapprochement Le Petit Ballon & vente-privee Paris, le 12 avril 2017. Le Petit Ballon est fier de vous annoncer une étape stratégique de son développement avec la prise de participation de vente-privee dans son capital. Un rapprochement qui signe la volonté commune de réinventer l’expérience de shopping du vin en ligne . 6 ans après mon premier déjeuner avec ce cher et grand sommelier Jean-Michel Deluc, l’inarrêtable Matthieu Lesne et le talentueux Clément Thibault… nous voici désormais de mèche avec le créateur du concept même de ventes évènementielles sur Internet et le leader mondial du secteur : vente-privee. Vous me l’auriez dit il y a 6 ans je ne vous aurais pas cru. Un heureux hasard En février 2016, je reçois un coup de fil de Matthieu qui veut me présenter les équipes vins & food de vente-privee rencontrées dans un salon. Le plus gros vendeur de vin en France, rendez-vous compte! Alors pourquoi ne pas aller échanger sur nos pratiques et faire germer quelques bonnes idées ? Venus pour discuter sur nos stratégies respectives, nous découvrons que le mastodonte VP était en fait une super équipe, dirigée avec un véritable esprit entrepreneurial, avec cette même vision du futur du vin , ses problématiques, et une volonté toute aussi forte que la nôtre. Après quelques heures dans leurs locaux de Saint-Denis, nous voici ressortis avec l’intime conviction qu’ensemble, nous pourrions faire quelque chose d’énorme. La machine était en marche ! Proposer une expérience vin encore plus dingue Au Petit Ballon, nous avons toujours eu l’ambition de proposer à notre grande famille une expérience toujours plus innovante et toujours plus simple pour découvrir, apprendre et acheter du vin. Nous avons commencé avec l’abonnement et notre ton simple et ludique. Puis nous avons enrichis l’expérience avec la création de nos labels et d’un profil vin pour vous faire découvrir les vins que vous aimez. Nous restons cependant convaincus que beaucoup de choses restent à faire pour remplir cette mission et devenir le plus gros vendeur de vins en France (pour commencer :)). Grâce à ce partenariat, nous allons développer un laboratoire d’idées au service de l’innovation dans la distribution du vin en France et en Europe. Nous allons encore améliorer l’expérience utilisateur en nous appuyant sur les savoir-faire bien différents de nos deux entreprises et aller au-delà ! Et que vive la liberté Soyez-en sûrs, Le Petit Ballon restera indépendant, et les synergies de ce rapprochement vont nous permettre de poursuivre notre croissance pour toujours simplifier d’avantage l’achat et la consommation de vin. L’offre reste inchangée sur Le Petit Ballon. Jean-Michel Deluc, continuera à vous proposer ses magnifiques sélections. Notre exigence et notre façon de travailler avec les vignerons seront toujours les mêmes. Attachés à la relation de confiance mutuelle et de respect pour leur travail acharné, nous ne changerons cela pour rien au monde. C’est d’ailleurs pour eux la garantie de travailler encore plus avec nous. Gardez les yeux bien ouverts chers abonnés, nous vous réservons quelques bonnes surprises. Quant au site vente-privee.com, les membres pourront y découvrir de nombreuses nouveautés. Ils pourront bientôt profiter d’un contenu enrichi pour mieux les guider dans leur sélection et leurs achats : les labels du Petit Ballon les y guideront, leur profil vin leur permettra d’affiner leurs goûts et nos conseils et astuces spécialement créés pour eux leur permettront de devenir des as de la dégustation. Réécrire l’histoire du vin Il est temps d’écrire un nouveau chapitre dans l’aventure du Petit Ballon. Ce chapitre, nous sommes fiers de l’écrire avec vente-privee afin d’imaginer le vin de demain…eux aussi semblent l’être un petit peu : « Nous sommes très heureux d’accueillir Le Petit Ballon et ses équipes, avec qui nous partageons des valeurs communes d’innovation, de qualité et d’excellence. Ce partenariat ouvre de nouvelles perspectives de croissance dans le secteur du vin. Il s’inscrit dans notre vision long terme de l’entreprise, et va nous permettre d’offrir une expérience de shopping toujours plus innovante à nos membres. Nous sommes très heureux de collaborer avec une jeune équipe ambitieuse, animée par la volonté d’écrire le vin de demain. » comme l’explique Jacques-Antoine Granjon, PDG et fondateur de vente-privee. Et ça c’est beau. Un grand merci J’en profite pour remercier toute notre équipe de croire en ce projet fou. Vous êtes en or. Par ordre d’apparition, Moop, Soso, Eric, Yannick, Greg, Nao Thibaut, Léo, Max, Josie, Pauline, Lucie, Anna, Myriam, Oliv, Jeanne, Wiwi, Alex, Anne, Léopoldine, Christabel et Clément… Mes associés de toujours #forever #lafamille, Jean-Michel, Matthieu et Clément, Nos incroyables investisseurs, merci encore pour vos bons conseils !!! Marc Ménasé, David Nedzela, les frères Hadida, Fabrice Lépine, Bertile Burel et James Blouzard, Jacques-Antoine Granjon, mon idole, Emmanuel, Paloma, Jean-Baptiste et toute l’équipe vente-privee. À mon Pap, à JP et à ma femme ❤ Et enfin nos vignerons qui rendent cette histoire possible en nous proposant toujours le meilleur. Et pour finir… Vous, nos chers abonnés, les véritables ambassadeurs du Petit Ballon. Merci pour votre confiance et votre soutien depuis le début de l’aventure. Ca nous donne tous les jours plus de force pour trouver de nouvelles idées et enrichir l’expérience. ", "title": "Bim ! L’incroyable rapprochement Le Petit Ballon & vente-privee", "sentences": [{"e7fb": "Bim ! L’incroyable rapprochement Le Petit Ballon & vente-privee"}, {"6477": "Paris, le 12 avril 2017. Le Petit Ballon est fier de vous annoncer une étape stratégique de son développement avec la prise de participation de vente-privee dans son capital. Un rapprochement qui signe la volonté commune de réinventer l’expérience de shopping du vin en ligne ."}, {"0439": "6 ans après mon premier déjeuner avec ce cher et grand sommelier Jean-Michel Deluc, l’inarrêtable Matthieu Lesne et le talentueux Clément Thibault… nous voici désormais de mèche avec le créateur du concept même de ventes évènementielles sur Internet et le leader mondial du secteur : vente-privee. Vous me l’auriez dit il y a 6 ans je ne vous aurais pas cru."}, {"919a": "Un heureux hasard"}, {"49f9": "En février 2016, je reçois un coup de fil de Matthieu qui veut me présenter les équipes vins & food de vente-privee rencontrées dans un salon. Le plus gros vendeur de vin en France, rendez-vous compte! Alors pourquoi ne pas aller échanger sur nos pratiques et faire germer quelques bonnes idées ?"}, {"6970": "Venus pour discuter sur nos stratégies respectives, nous découvrons que le mastodonte VP était en fait une super équipe, dirigée avec un véritable esprit entrepreneurial, avec cette même vision du futur du vin , ses problématiques, et une volonté toute aussi forte que la nôtre."}, {"9112": "Après quelques heures dans leurs locaux de Saint-Denis, nous voici ressortis avec l’intime conviction qu’ensemble, nous pourrions faire quelque chose d’énorme. La machine était en marche !"}, {"0bfc": "Proposer une expérience vin encore plus dingue"}, {"80ac": "Au Petit Ballon, nous avons toujours eu l’ambition de proposer à notre grande famille une expérience toujours plus innovante et toujours plus simple pour découvrir, apprendre et acheter du vin. Nous avons commencé avec l’abonnement et notre ton simple et ludique. Puis nous avons enrichis l’expérience avec la création de nos labels et d’un profil vin pour vous faire découvrir les vins que vous aimez. Nous restons cependant convaincus que beaucoup de choses restent à faire pour remplir cette mission et devenir le plus gros vendeur de vins en France (pour commencer :))."}, {"fbb5": "Grâce à ce partenariat, nous allons développer un laboratoire d’idées au service de l’innovation dans la distribution du vin en France et en Europe. Nous allons encore améliorer l’expérience utilisateur en nous appuyant sur les savoir-faire bien différents de nos deux entreprises et aller au-delà !"}, {"b89e": "Et que vive la liberté"}, {"01c0": "Soyez-en sûrs, Le Petit Ballon restera indépendant, et les synergies de ce rapprochement vont nous permettre de poursuivre notre croissance pour toujours simplifier d’avantage l’achat et la consommation de vin."}, {"dcea": "L’offre reste inchangée sur Le Petit Ballon."}, {"4f07": "Jean-Michel Deluc, continuera à vous proposer ses magnifiques sélections."}, {"90d8": "Notre exigence et notre façon de travailler avec les vignerons seront toujours les mêmes. Attachés à la relation de confiance mutuelle et de respect pour leur travail acharné, nous ne changerons cela pour rien au monde. C’est d’ailleurs pour eux la garantie de travailler encore plus avec nous. Gardez les yeux bien ouverts chers abonnés, nous vous réservons quelques bonnes surprises."}, {"f285": "Quant au site vente-privee.com, les membres pourront y découvrir de nombreuses nouveautés. Ils pourront bientôt profiter d’un contenu enrichi pour mieux les guider dans leur sélection et leurs achats : les labels du Petit Ballon les y guideront, leur profil vin leur permettra d’affiner leurs goûts et nos conseils et astuces spécialement créés pour eux leur permettront de devenir des as de la dégustation."}, {"900a": "Réécrire l’histoire du vin"}, {"3daf": "Il est temps d’écrire un nouveau chapitre dans l’aventure du Petit Ballon. Ce chapitre, nous sommes fiers de l’écrire avec vente-privee afin d’imaginer le vin de demain…eux aussi semblent l’être un petit peu : « Nous sommes très heureux d’accueillir Le Petit Ballon et ses équipes, avec qui nous partageons des valeurs communes d’innovation, de qualité et d’excellence. Ce partenariat ouvre de nouvelles perspectives de croissance dans le secteur du vin. Il s’inscrit dans notre vision long terme de l’entreprise, et va nous permettre d’offrir une expérience de shopping toujours plus innovante à nos membres. Nous sommes très heureux de collaborer avec une jeune équipe ambitieuse, animée par la volonté d’écrire le vin de demain. » comme l’explique Jacques-Antoine Granjon, PDG et fondateur de vente-privee. Et ça c’est beau."}, {"fe6e": "Un grand merci"}, {"f4bb": "J’en profite pour remercier toute notre équipe de croire en ce projet fou. Vous êtes en or. Par ordre d’apparition, Moop, Soso, Eric, Yannick, Greg, Nao Thibaut, Léo, Max, Josie, Pauline, Lucie, Anna, Myriam, Oliv, Jeanne, Wiwi, Alex, Anne, Léopoldine, Christabel et Clément…"}, {"a07b": "Mes associés de toujours #forever #lafamille, Jean-Michel, Matthieu et Clément,"}, {"8fb7": "Nos incroyables investisseurs, merci encore pour vos bons conseils !!! Marc Ménasé, David Nedzela, les frères Hadida, Fabrice Lépine, Bertile Burel et James Blouzard,"}, {"ebf5": "Jacques-Antoine Granjon, mon idole, Emmanuel, Paloma, Jean-Baptiste et toute l’équipe vente-privee."}, {"1c8a": "À mon Pap, à JP et à ma femme ❤"}, {"6988": "Et enfin nos vignerons qui rendent cette histoire possible en nous proposant toujours le meilleur."}, {"4646": "Et pour finir… Vous, nos chers abonnés, les véritables ambassadeurs du Petit Ballon. Merci pour votre confiance et votre soutien depuis le début de l’aventure. Ca nous donne tous les jours plus de force pour trouver de nouvelles idées et enrichir l’expérience."}], "child": "1173_1\t1173_2"}