{"name": "1174", "parent": "", "content": "Don’t Fall for the “Benchmark Trap” Benchmarks are our way of providing us validation before reaching our end goal. They supposedly act as indicators telling us we are heading in the right direction. But often we fall under one of three benchmark traps: At best, a benchmark can provide you with a gauge to know if you are heading in the general direction of your goal. At worst, a benchmark can turn you around and have you chasing trivial short-term goals instead. So how do we avoid the benchmark trap but still receive clarity about our progress? Here’s how… Know what you are benchmarking I once ran 2 miles in 11 minutes and 58 seconds. Impressive, right? Wrong. I didn’t run 2 miles, I ran twice around a track only 3/4th of a mile long. I spent an entire summer running on this track in preparation for varsity soccer. I thought I was good enough to land a starting position on the team. I wasn’t. Someone told me the track was a mile long, I believed them (this was before Google Maps or Map My Run) and for an entire summer I benchmarked myself against the wrong standard. Consequently, during training camp my mile times were all 33% more than my practice times (i.e. if I ran 3/4th of a mile in 6 minutes, I’d run a full-mile in 8 minutes). I learned an important lesson that summer: Know what you are benchmarking. Benchmark against yourself Do you remember this from last year’s summer Olympics: If you don’t recall, that’s South African swimmer Chad Le Clos watching Michael Phelps win yet another gold medal — minutes after deliberately taunting Phelps in a futile attempt to distract him. Phelps focused on the race. Le Clos focused on Phelps. The rest is history. If you are breaking into a new scene (writing, entrepreneurship, social media, etc.) it’s tempting to look at the successful players (more on that in a bit) and formulate your benchmarks from superficial signals. When we lose focus on ourselves and instead divert our attention to what other people are doing, we crash and burn. Or in the case of Le Clos, we lose the race. The only things you can control are you and your actions. Seeing what others are doing to accomplish their goals may add a touch of inspiration, but attempting to emulate how and what they do is nothing but a distraction. A distraction that costs you unique and creative work. Benchmark the ‘real’ you Here’s a trick I use to force myself to go after big goals. I think of something I want to accomplish. I multiply that goal by a factor of 5. I set the 5x goal as my new goal. Almost always, I fail to reach the 5x goal. But I’m okay with that. Why? Because I know the bigger goal is a stretch and not a realistic expectation of what I’m able to achieve. The 5x trick is simply a way to challenge myself to achieve more. However, this trick doesn’t work for everyone. Often we tend to set unrealistic benchmarks for ourselves with the expectation that we will achieve them. And when we don’t hit these benchmarks, we feel like we’re falling behind. Self-awareness, or being comfortable with your limitations, frees you from the disappointment of not achieving challenging goals. Understanding who you are and what you are capable of translates to setting better benchmarks. On the flip side, know when you are selling yourself short and are hitting benchmarks that are too easy. Either way, get comfortable with the real you. Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button: ", "title": "Don’t Fall for the “Benchmark Trap”", "sentences": [{"551b": "Don’t Fall for the “Benchmark Trap”"}, {"cc3d": "Benchmarks are our way of providing us validation before reaching our end goal. They supposedly act as indicators telling us we are heading in the right direction."}, {"fd36": "But often we fall under one of three benchmark traps:"}, {"fb8b": "At best, a benchmark can provide you with a gauge to know if you are heading in the general direction of your goal. At worst, a benchmark can turn you around and have you chasing trivial short-term goals instead."}, {"54e1": "So how do we avoid the benchmark trap but still receive clarity about our progress?"}, {"885d": "Here’s how…"}, {"4f14": "Know what you are benchmarking"}, {"0f58": "I once ran 2 miles in 11 minutes and 58 seconds. Impressive, right?"}, {"6aa0": "Wrong."}, {"6a47": "I didn’t run 2 miles, I ran twice around a track only 3/4th of a mile long."}, {"dc03": "I spent an entire summer running on this track in preparation for varsity soccer. I thought I was good enough to land a starting position on the team. I wasn’t."}, {"8790": "Someone told me the track was a mile long, I believed them (this was before Google Maps or Map My Run) and for an entire summer I benchmarked myself against the wrong standard."}, {"4456": "Consequently, during training camp my mile times were all 33% more than my practice times (i.e. if I ran 3/4th of a mile in 6 minutes, I’d run a full-mile in 8 minutes)."}, {"5001": "I learned an important lesson that summer: Know what you are benchmarking."}, {"73f2": "Benchmark against yourself"}, {"d343": "Do you remember this from last year’s summer Olympics:"}, {"79f2": "If you don’t recall, that’s South African swimmer Chad Le Clos watching Michael Phelps win yet another gold medal — minutes after deliberately taunting Phelps in a futile attempt to distract him."}, {"0bcf": "Phelps focused on the race. Le Clos focused on Phelps. The rest is history."}, {"adec": "If you are breaking into a new scene (writing, entrepreneurship, social media, etc.) it’s tempting to look at the successful players (more on that in a bit) and formulate your benchmarks from superficial signals."}, {"2923": "When we lose focus on ourselves and instead divert our attention to what other people are doing, we crash and burn."}, {"43d1": "Or in the case of Le Clos, we lose the race."}, {"a8e9": "The only things you can control are you and your actions. Seeing what others are doing to accomplish their goals may add a touch of inspiration, but attempting to emulate how and what they do is nothing but a distraction."}, {"74c1": "A distraction that costs you unique and creative work."}, {"572a": "Benchmark the ‘real’ you"}, {"7243": "Here’s a trick I use to force myself to go after big goals."}, {"9d0d": "I think of something I want to accomplish. I multiply that goal by a factor of 5. I set the 5x goal as my new goal."}, {"8229": "Almost always, I fail to reach the 5x goal. But I’m okay with that. Why?"}, {"1d82": "Because I know the bigger goal is a stretch and not a realistic expectation of what I’m able to achieve. The 5x trick is simply a way to challenge myself to achieve more."}, {"10e9": "However, this trick doesn’t work for everyone."}, {"61eb": "Often we tend to set unrealistic benchmarks for ourselves with the expectation that we will achieve them. And when we don’t hit these benchmarks, we feel like we’re falling behind."}, {"086f": "Self-awareness, or being comfortable with your limitations, frees you from the disappointment of not achieving challenging goals."}, {"6a71": "Understanding who you are and what you are capable of translates to setting better benchmarks."}, {"ab91": "On the flip side, know when you are selling yourself short and are hitting benchmarks that are too easy."}, {"0dd7": "Either way, get comfortable with the real you."}, {"b3ce": "Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button:"}], "child": "1174_1\t1174_21174_1\t1174_2"}