{"name": "1176", "parent": "", "content": "The 3 Most Important Questions You Can Ask When Hiring You want to smartly and quickly add great employees who will help your business thrive and grow. After all, recruiting and hiring people isn’t cheap. It takes time and money to advertise the open position, interview candidates, and train your new hires. Despite all your best efforts to screen out the slackers or potentially toxic employees, it’s pretty much inevitable that you’ll hire the wrong person (or many such persons) at some point. Want to stop hiring losers? Wouldn’t you rather hire employees who are likely to become superstars at your company? I’ve got the solution for you. You shouldn’t hire someone just because they check off a certain number of boxes: Are You Asking Situational Questions? I’m not involved much with hiring these days (because my company has grown so big). However, in the early days of my company, I was very much hands on during the hiring process. Many of the people I hired went on to become superstar performers who helped my company get to where it is today (and many of them are still there), while others have moved on to create businesses of their own or do other amazing things. What was my secret for hiring the best people? Asking them the RIGHT questions. It’s not about asking crazy interview questions like “would you rather fight 1 horse-sized duck or 100 duck-sized horses” or “if you were a pizza delivery man, how would you benefit from scissors?” Instead of wasting everyone’s time, try asking these three situational questions. These interview questions will help you figure out whether the person you’re interviewing is truly a unicorn — or just a donkey with a plunger stuck to its face. 1. Tell Me About Your Best Achievement and Why It Was so Great In an interview, I force applicants to focus on what they have done rather than how they describe themselves. For the remainder of this article, let’s pretend I’m trying to hire for a content marketing position. Instead of asking about their education or some award they won, I will ask something like: “Tell me about your best content marketing campaign of all time and what was so great about it?” How the person answers this question will give me a ton of insight about their ability to measure and analyze results, how they define success, their creative process, and much more. 2. How Do You Decide What to do Next? Another critical interview question to ask of your potential new hires is how they manage workflow after completing a task. So during the interview I might ask an applicant: “You’ve just successfully completed writing an article. How do you decide what to do next?” Continuing our hiring example, one obvious answer to the question is to start working on a new piece of content. But what I really want to know is how they research topics. What’s their process? How do they pick where to focus? How they answer this question will reveal a lot about your potential new employee’s thought process. Knowing how your employee thinks is incredibly valuable. 3. How Do You Know What You Did Paid Off? Want to find out what metrics your potential new employee values? In marketing, it’s all about the almighty return on investment (ROI). But everyone has their own definition of ROI. So I ask potential hires: How do you know if that content campaign if your hard work paid off or not. What analytics to they care about? Is it just pageviews? Or are they thinking more deeply about What are the analytics behind PVs that they’re thinking about. Bonus Question: Will You Complete This Project? Want to make extra sure you’re hiring the best person for the job? Ask them to create something. Continuing our example, I might ask, “Can you write me a listicle?” It’s really hard to get a sense for someone’s writing abilities from an interview. If they really want the job and have the necessary skills (but perhaps they don’t have a large body of published work), then they should have no trouble completing such a basic assignment. In fact, in some instances, it might make more sense for you to bypass the interview completely and start here. Yes, many applicants will scoff at giving away their talents for free. Consider offering to pay them a little something for their time and effort to create the sample. It’s better to spend a few bucks now to find out rather than putting them on the payroll before you find out the truth. If what they turn in is great, then great! If not, then move on. Conclusion It can be really tough to figure out from a 30-minute interview whether you’ve just interviewed someone who is truly excellent, or who is just a charming liar. These three questions will act as your personal unicorn detector, to help you separate the great people from the average during the interview process. All you have to do is adapt these three questions for your particular industry or a specific role: · “Tell me about your best [job specific accomplishment] of all time and what was so great about it?” · “After completing a task/project, how do you decide what to do next?” · “How do you know what you did paid off?” Asking these questions will help you consistently start hiring the best people for the position — the unicorns! Found this post useful? Kindly tap the ❤ button below! :) About The Author Larry Kim is the Founder of WordStream. You can connect with him on Twitter, Facebook, LinkedIn and Instagram. ", "title": "The 3 Most Important Questions You Can Ask When Hiring", "sentences": [{"4ba5": "The 3 Most Important Questions You Can Ask When Hiring"}, {"23d1": "You want to smartly and quickly add great employees who will help your business thrive and grow."}, {"41d2": "After all, recruiting and hiring people isn’t cheap. It takes time and money to advertise the open position, interview candidates, and train your new hires."}, {"4953": "Despite all your best efforts to screen out the slackers or potentially toxic employees, it’s pretty much inevitable that you’ll hire the wrong person (or many such persons) at some point."}, {"1963": "Want to stop hiring losers? Wouldn’t you rather hire employees who are likely to become superstars at your company?"}, {"75f5": "I’ve got the solution for you."}, {"fd60": "You shouldn’t hire someone just because they check off a certain number of boxes:"}, {"45c5": "Are You Asking Situational Questions?"}, {"439f": "I’m not involved much with hiring these days (because my company has grown so big). However, in the early days of my company, I was very much hands on during the hiring process."}, {"02bd": "Many of the people I hired went on to become superstar performers who helped my company get to where it is today (and many of them are still there), while others have moved on to create businesses of their own or do other amazing things."}, {"5f95": "What was my secret for hiring the best people?"}, {"c21b": "Asking them the RIGHT questions."}, {"4c96": "It’s not about asking crazy interview questions like “would you rather fight 1 horse-sized duck or 100 duck-sized horses” or “if you were a pizza delivery man, how would you benefit from scissors?”"}, {"2450": "Instead of wasting everyone’s time, try asking these three situational questions."}, {"c5fb": "These interview questions will help you figure out whether the person you’re interviewing is truly a unicorn — or just a donkey with a plunger stuck to its face."}, {"65ba": "1. Tell Me About Your Best Achievement and Why It Was so Great"}, {"3837": "In an interview, I force applicants to focus on what they have done rather than how they describe themselves."}, {"cf93": "For the remainder of this article, let’s pretend I’m trying to hire for a content marketing position. Instead of asking about their education or some award they won, I will ask something like:"}, {"923d": "“Tell me about your best content marketing campaign of all time and what was so great about it?”"}, {"236b": "How the person answers this question will give me a ton of insight about their ability to measure and analyze results, how they define success, their creative process, and much more."}, {"d67c": "2. How Do You Decide What to do Next?"}, {"090a": "Another critical interview question to ask of your potential new hires is how they manage workflow after completing a task."}, {"d836": "So during the interview I might ask an applicant:"}, {"dc45": "“You’ve just successfully completed writing an article. How do you decide what to do next?”"}, {"f971": "Continuing our hiring example, one obvious answer to the question is to start working on a new piece of content. But what I really want to know is how they research topics. What’s their process? How do they pick where to focus?"}, {"7570": "How they answer this question will reveal a lot about your potential new employee’s thought process. Knowing how your employee thinks is incredibly valuable."}, {"3e86": "3. How Do You Know What You Did Paid Off?"}, {"9bdb": "Want to find out what metrics your potential new employee values?"}, {"12a0": "In marketing, it’s all about the almighty return on investment (ROI). But everyone has their own definition of ROI."}, {"9edf": "So I ask potential hires:"}, {"4ac9": "How do you know if that content campaign if your hard work paid off or not."}, {"0727": "What analytics to they care about? Is it just pageviews? Or are they thinking more deeply about"}, {"aab7": "What are the analytics behind PVs that they’re thinking about."}, {"c69f": "Bonus Question: Will You Complete This Project?"}, {"5a39": "Want to make extra sure you’re hiring the best person for the job?"}, {"9e5a": "Ask them to create something."}, {"1c85": "Continuing our example, I might ask, “Can you write me a listicle?”"}, {"1db9": "It’s really hard to get a sense for someone’s writing abilities from an interview. If they really want the job and have the necessary skills (but perhaps they don’t have a large body of published work), then they should have no trouble completing such a basic assignment."}, {"0224": "In fact, in some instances, it might make more sense for you to bypass the interview completely and start here."}, {"363c": "Yes, many applicants will scoff at giving away their talents for free. Consider offering to pay them a little something for their time and effort to create the sample. It’s better to spend a few bucks now to find out rather than putting them on the payroll before you find out the truth."}, {"9048": "If what they turn in is great, then great! If not, then move on."}, {"61b2": "Conclusion"}, {"c60b": "It can be really tough to figure out from a 30-minute interview whether you’ve just interviewed someone who is truly excellent, or who is just a charming liar."}, {"59e0": "These three questions will act as your personal unicorn detector, to help you separate the great people from the average during the interview process."}, {"6357": "All you have to do is adapt these three questions for your particular industry or a specific role:"}, {"7a3e": "· “Tell me about your best [job specific accomplishment] of all time and what was so great about it?”"}, {"e9f4": "· “After completing a task/project, how do you decide what to do next?”"}, {"4af1": "· “How do you know what you did paid off?”"}, {"ec96": "Asking these questions will help you consistently start hiring the best people for the position — the unicorns!"}, {"b984": "Found this post useful? Kindly tap the ❤ button below! :)"}, {"72bf": "About The Author"}, {"aeb5": "Larry Kim is the Founder of WordStream. You can connect with him on Twitter, Facebook, LinkedIn and Instagram."}], "child": "1176_1\t1176_2\t1176_3\t1176_4\t1176_5\t1176_6\t1176_7\t1176_8\t1176_9\t1176_10\t1176_11\t1176_12\t1176_13\t1176_14\t1176_15\t1176_16"}