{"name": "1177", "parent": "", "content": "Stop Complaining If You Are Unwilling To Jump In AKA Shut the hell up and MOVE your awesome arse! So, I started this differently but then realised I had a particular bug bear to address and so here goes — RNK is about to rant! Right now, there are people dying… In various countries round the world, people are in danger, they are hurting, it is horrid… And I hate it. Peace, freedom, abundance, to me, is everyone’s birthright but some people really are in dire straits at the moment and it is simply not working out for them… However, here we are, we have access to all of this stuff and for the most part, take it for granted. It is unfortunate. It is human nature not to value what they do not have to pay for. And in fact, it is human nature to find hardship where there is none, as well! Which is plain crazy but it is what it is. Not the point of my rant though… Maybe a little part… I am someone who chooses to have both money and meaning and I have worked pretty dang hard to design such a life… I continue to work hard to uplevel my and my family’s existence and to also wake at least 334k people up to their potential because THERE ARE PEOPLE DYING who do not need to be dying… THERE ARE PEOPLE BEING HURT who do not need to be hurt… And we, the blessed, are the ones to make a change… WE ARE THE ANSWER! NOt the government, politicians or anything — IT IS US who can make a change… But here is the snag… One little you, though powerful, cannot change the whole world alone BUT YOU CAN DO YOUR BIT, right?! You can wake up and live to the fullness of your potential, use your gifts and strengths and deliberately design a life of meaning and wealth so that that wealth can be used to potentially support people outside your circle, if you so choose. I believe you have specific gifts, talents, strengths for the reason of USAGE to inspire, entertain, help, serve other people in some way… And I believe you can be handsomely compensated for it, too! I believe you are present, in this day and this age for a reason… I believe you fit into the jigsaw puzzle of the planet in a specific manner to bring about peace, abundance and freedom for all… And that you change lives by being your best self… Now there is no guilt or ‘have to’ in this, of course… You always have a choice… But when I see people with massive gifts and talents who are ranting on FB about how some other people’s hunt for power and money is causing the problems in the world… WHEN THEY ARE NOT EVEN DARING TO DO WHAT THEY COULD DO TO CHANGE THEIR OWN EXISTENCE!!!!!! WELL, THAT RILES ME! It makes me angry! Am I even making sense?! Maybe this is a livestream but it just started flowing out of me when I started writing about the fact that I choose both money and meaning… I realised that something had got under my skin whilst I was stupidly paying attention to my FB feed… And it is a subject that continually annoys me… It usually shows up in various forms… This whole thing of people complaining about ‘WHAT IS’ but being unwilling to do the little they can to make a difference… I get it… The media sending us all these messages of doom and gloom on the other side of the world where you cannot physically go, can be a source of deep-dark frustration… Even the messages from your own country about what people in ‘power’ are doing to ‘destroy’ your country… All of this stuff can make you feel helpless if you are simply listening in, without any filter… And if you feel trapped in a little life where you have no power… You feel yourself getting riled up with righteous anger and you tell us all about it on FB (like I am doing, I suppose, so you don’t have to listen to me!) But what I hate to see, are people who I know, are completely motivated by money, pretending to be somehow above the ‘leaders’ they claim to abhor… These people revel in their struggle and their poverty while refusing to do ANYTHING to change their situation… But then complain about the ‘leaders’ who though they may or may not be misguided, these leaders are playing full-out!!! I see these people who pride themselves on being separate from what they consider to be the ‘money-grabbing, power-hungry’ crowd complain about said ‘leaders’… BUT THEN they put down their computer having spewed their ‘holy’ sounding nonsense, have a dinner with cheap food that their little salary can stretch to, go to sleep in a house that they have probably settled for, wake up somewhat depressed and go to a job which they are ONLY doing for the money… They refuse to use their talents and gifts because they think they cannot GET PAID ENOUGH for it… And hey, they have bills to pay… They refuse to figure out ways to serve more people while using their strengths… And so they condemn themselves to a small existence… And they will never really be in the position to help people dying and being hurt in some other country somewhere… Their voice will never really be heard and they will make no difference to anyone because when it came down to it, they chose money over meaning. They probably do not see it that way because lots of people live this half-life and cannot see the hypocrisy of their lives… They complain about the ‘rich’ but are unwilling to do anything to become someone who could actually change things… They are so afraid to step out and be different from all the people around them that they settle for putting out a social media post every so often, feeling self-righteous that they have spoken up for the poor and then they return to their half-life and pretend to not notice how pointless it all is… OR WORSE, they take their frustration and anger at being so helpless, out on those closest to them… I wonder how many people’s anger problem is because of this… This learned helplessness and frustration because deep down inside, they know they could be doing more but they refuse to. It is too scary and they might lose the little money they are making… And so they refuse to use the gifts and strengths that they have to make a difference in the world… They buy into the lie that their strengths are not all that useful… They buy into the lie that they are powerless and so… They refuse to figure out a way to make their strengths work so that they can create wealth whilst living a life of meaning… NO, I do not think that changing the world will be on the shoulders of ONE awakened soul… But imagine a world where everyone that could, was using their strengths to better their lives, their families’ lives and then their communities and maybe even their country, the world… Imagine the butterfly effect that could happen… If everyone that could, DID! If you are reading this, YOU CAN! YOU CAN BE YOUR MOST POWERFUL SELF! It is not too small! You may be one, BUT YOU ARE ONE and you can change your world and as a result, change someone else’s world who could then go on to change someone else’s world and on and on it could go… But if you are not willing to get over your fears… Get over the fact that you think you are small… Get over thinking that you can have either money or meaning but not both… Get over downplaying your strengths and instead use that energy to figure out how to serve more people with it… And YES, I am talking to the artists, the musicians, the comedians, the creative types as well… You are most likely to hide your light because you think your strengths are pointless in the world… But it is by inspiring people with your art that you can cause them to change! Words, pictures are powerful… And for you the more technical types, you can design products, services that may be novel but may also be EXACTLY What the world needs… But you have to be brave! Courageous enough to face down the fact that to start with, it will be tough… It may be unnoticed… No one may seem to care… And yet, you have to find the bravery inside to stay the course… You have to believe in yourself before anyone else will believe in you! And if you are unwilling, then please stop fucking complaining about what the ‘leaders’ in the world are doing… It is just annoying to listen to you, when I KNOW what you are capable of! I see you, remember!!! WAKE UP! Fight for, deliberately design the life you are born to live… One of impact and income serving people using your GOD-GIVEN strengths — There is no mistake about your design… There is no mistake about you being here in this day and time… SO please get off your awesome arse and start doing something useful with your gifting, will ya? Because, deep down, you really do want to anyway! PS — Bulletproof bravery is here. Honey, if you are going to impact the world in even the smallest of ways, then you are going to need to be brave. At the moment, we live in a world where it is normal to think of yourself as too small to make a difference, it takes the mavericks, the crazy ones to choose to step up and refuse to let money be the only determinant of what they will or will not do… It takes COURAGE to stand against the regular trends and choose to figure out a way to be BOTH wealthy and POSITIVELY IMPACTFUL and not to be ashamed of it. Bulletproof bravery is EXACTLY what you need in your quest to be the leader and mavericks that brings change about. Check it out now at RosemaryNonnyKnight.com/bulletproofbravery ", "title": "Stop Complaining If You Are Unwilling To Jump In AKA Shut the hell up and MOVE your awesome arse!", "sentences": [{"52ab": "Stop Complaining If You Are Unwilling To Jump In AKA Shut the hell up and MOVE your awesome arse!"}, {"eff9": "So, I started this differently but then realised I had a particular bug bear to address and so here goes — RNK is about to rant!"}, {"397d": "Right now, there are people dying…"}, {"5fea": "In various countries round the world, people are in danger, they are hurting, it is horrid…"}, {"5e0f": "And I hate it."}, {"f137": "Peace, freedom, abundance, to me, is everyone’s birthright but some people really are in dire straits at the moment and it is simply not working out for them…"}, {"c4ec": "However, here we are, we have access to all of this stuff and for the most part, take it for granted."}, {"4b0a": "It is unfortunate."}, {"3ce6": "It is human nature not to value what they do not have to pay for."}, {"e417": "And in fact, it is human nature to find hardship where there is none, as well!"}, {"446d": "Which is plain crazy but it is what it is."}, {"05b0": "Not the point of my rant though…"}, {"8b45": "Maybe a little part…"}, {"005b": "I am someone who chooses to have both money and meaning and I have worked pretty dang hard to design such a life…"}, {"82c1": "I continue to work hard to uplevel my and my family’s existence and to also wake at least 334k people up to their potential because THERE ARE PEOPLE DYING who do not need to be dying…"}, {"972a": "THERE ARE PEOPLE BEING HURT who do not need to be hurt…"}, {"021e": "And we, the blessed, are the ones to make a change…"}, {"6bb0": "WE ARE THE ANSWER!"}, {"7934": "NOt the government, politicians or anything — IT IS US who can make a change…"}, {"a80b": "But here is the snag…"}, {"f17b": "One little you, though powerful, cannot change the whole world alone BUT YOU CAN DO YOUR BIT, right?!"}, {"3320": "You can wake up and live to the fullness of your potential, use your gifts and strengths and deliberately design a life of meaning and wealth so that that wealth can be used to potentially support people outside your circle, if you so choose."}, {"f8a4": "I believe you have specific gifts, talents, strengths for the reason of USAGE to inspire, entertain, help, serve other people in some way…"}, {"43f9": "And I believe you can be handsomely compensated for it, too!"}, {"b54f": "I believe you are present, in this day and this age for a reason…"}, {"b055": "I believe you fit into the jigsaw puzzle of the planet in a specific manner to bring about peace, abundance and freedom for all…"}, {"ba64": "And that you change lives by being your best self…"}, {"a55a": "Now there is no guilt or ‘have to’ in this, of course…"}, {"935e": "You always have a choice…"}, {"7ce9": "But when I see people with massive gifts and talents who are ranting on FB about how some other people’s hunt for power and money is causing the problems in the world…"}, {"53df": "WHEN THEY ARE NOT EVEN DARING TO DO WHAT THEY COULD DO TO CHANGE THEIR OWN EXISTENCE!!!!!! WELL, THAT RILES ME!"}, {"d237": "It makes me angry!"}, {"ffb2": "Am I even making sense?!"}, {"9bd6": "Maybe this is a livestream but it just started flowing out of me when I started writing about the fact that I choose both money and meaning…"}, {"52cd": "I realised that something had got under my skin whilst I was stupidly paying attention to my FB feed…"}, {"098e": "And it is a subject that continually annoys me…"}, {"8d24": "It usually shows up in various forms…"}, {"1aae": "This whole thing of people complaining about ‘WHAT IS’ but being unwilling to do the little they can to make a difference…"}, {"93c6": "I get it…"}, {"64ae": "The media sending us all these messages of doom and gloom on the other side of the world where you cannot physically go, can be a source of deep-dark frustration…"}, {"5843": "Even the messages from your own country about what people in ‘power’ are doing to ‘destroy’ your country…"}, {"d748": "All of this stuff can make you feel helpless if you are simply listening in, without any filter…"}, {"0d3c": "And if you feel trapped in a little life where you have no power…"}, {"6645": "You feel yourself getting riled up with righteous anger and you tell us all about it on FB (like I am doing, I suppose, so you don’t have to listen to me!)"}, {"080c": "But what I hate to see, are people who I know, are completely motivated by money, pretending to be somehow above the ‘leaders’ they claim to abhor…"}, {"af7d": "These people revel in their struggle and their poverty while refusing to do ANYTHING to change their situation…"}, {"4b7c": "But then complain about the ‘leaders’ who though they may or may not be misguided, these leaders are playing full-out!!!"}, {"54e9": "I see these people who pride themselves on being separate from what they consider to be the ‘money-grabbing, power-hungry’ crowd complain about said ‘leaders’…"}, {"4b38": "BUT THEN they put down their computer having spewed their ‘holy’ sounding nonsense, have a dinner with cheap food that their little salary can stretch to, go to sleep in a house that they have probably settled for, wake up somewhat depressed and go to a job which they are ONLY doing for the money…"}, {"0e62": "They refuse to use their talents and gifts because they think they cannot GET PAID ENOUGH for it…"}, {"3285": "And hey, they have bills to pay…"}, {"112c": "They refuse to figure out ways to serve more people while using their strengths…"}, {"eb8a": "And so they condemn themselves to a small existence…"}, {"fcb9": "And they will never really be in the position to help people dying and being hurt in some other country somewhere…"}, {"7392": "Their voice will never really be heard and they will make no difference to anyone because when it came down to it, they chose money over meaning."}, {"5818": "They probably do not see it that way because lots of people live this half-life and cannot see the hypocrisy of their lives…"}, {"f942": "They complain about the ‘rich’ but are unwilling to do anything to become someone who could actually change things…"}, {"7daa": "They are so afraid to step out and be different from all the people around them that they settle for putting out a social media post every so often, feeling self-righteous that they have spoken up for the poor and then they return to their half-life and pretend to not notice how pointless it all is…"}, {"05d9": "OR WORSE, they take their frustration and anger at being so helpless, out on those closest to them…"}, {"0d88": "I wonder how many people’s anger problem is because of this…"}, {"cfd5": "This learned helplessness and frustration because deep down inside, they know they could be doing more but they refuse to."}, {"ff52": "It is too scary and they might lose the little money they are making…"}, {"0736": "And so they refuse to use the gifts and strengths that they have to make a difference in the world…"}, {"86d8": "They buy into the lie that their strengths are not all that useful…"}, {"7a98": "They buy into the lie that they are powerless and so…"}, {"5da0": "They refuse to figure out a way to make their strengths work so that they can create wealth whilst living a life of meaning…"}, {"65f0": "NO, I do not think that changing the world will be on the shoulders of ONE awakened soul…"}, {"fa3c": "But imagine a world where everyone that could, was using their strengths to better their lives, their families’ lives and then their communities and maybe even their country, the world…"}, {"509a": "Imagine the butterfly effect that could happen…"}, {"7c67": "If everyone that could, DID!"}, {"70b9": "If you are reading this, YOU CAN!"}, {"eeb7": "YOU CAN BE YOUR MOST POWERFUL SELF!"}, {"6bf9": "It is not too small!"}, {"b686": "You may be one, BUT YOU ARE ONE and you can change your world and as a result, change someone else’s world who could then go on to change someone else’s world and on and on it could go…"}, {"9635": "But if you are not willing to get over your fears…"}, {"b08f": "Get over the fact that you think you are small…"}, {"3860": "Get over thinking that you can have either money or meaning but not both…"}, {"cae3": "Get over downplaying your strengths and instead use that energy to figure out how to serve more people with it…"}, {"d869": "And YES, I am talking to the artists, the musicians, the comedians, the creative types as well…"}, {"b242": "You are most likely to hide your light because you think your strengths are pointless in the world…"}, {"b6c2": "But it is by inspiring people with your art that you can cause them to change!"}, {"442f": "Words, pictures are powerful…"}, {"371f": "And for you the more technical types, you can design products, services that may be novel but may also be EXACTLY What the world needs…"}, {"f403": "But you have to be brave!"}, {"8387": "Courageous enough to face down the fact that to start with, it will be tough…"}, {"3367": "It may be unnoticed…"}, {"2dcc": "No one may seem to care…"}, {"6564": "And yet, you have to find the bravery inside to stay the course…"}, {"b28c": "You have to believe in yourself before anyone else will believe in you!"}, {"4e3d": "And if you are unwilling, then please stop fucking complaining about what the ‘leaders’ in the world are doing…"}, {"98d9": "It is just annoying to listen to you, when I KNOW what you are capable of!"}, {"b1f2": "I see you, remember!!!"}, {"0a54": "WAKE UP!"}, {"09ea": "Fight for, deliberately design the life you are born to live…"}, {"b498": "One of impact and income serving people using your GOD-GIVEN strengths — There is no mistake about your design…"}, {"6bb1": "There is no mistake about you being here in this day and time…"}, {"1a96": "SO please get off your awesome arse and start doing something useful with your gifting, will ya?"}, {"82ad": "Because, deep down, you really do want to anyway!"}, {"b68c": "PS — Bulletproof bravery is here. Honey, if you are going to impact the world in even the smallest of ways, then you are going to need to be brave. At the moment, we live in a world where it is normal to think of yourself as too small to make a difference, it takes the mavericks, the crazy ones to choose to step up and refuse to let money be the only determinant of what they will or will not do…"}, {"4873": "It takes COURAGE to stand against the regular trends and choose to figure out a way to be BOTH wealthy and POSITIVELY IMPACTFUL and not to be ashamed of it."}, {"133d": "Bulletproof bravery is EXACTLY what you need in your quest to be the leader and mavericks that brings change about. Check it out now at RosemaryNonnyKnight.com/bulletproofbravery"}], "child": "1177_1"}