{"name": "1178", "parent": "", "content": "Great Entrepreneurs Are A Lot Like Magicians When a magician waves his hand and says, “This is where the magic is happening.” The real trick is happening somewhere else. Misdirection. Have you ever watched a magic show and thought to yourself, “there is no way this is possible.” Then, time and time again — the impossible is done right before your very eyes. It’s a lot like what great entrepreneurs do on a recurring basis. Imagine what people thought in 1903 when Wilbur and Orville Wright said they were going to fly. I’m sure people doubted they would get more than a foot off the ground. The impossible was done and they flew. Just the same, Harry Houdini was once lowered head first into a glass tank filled with water while his feet manacled. After dropping into the water via pulleys, the top of the tank was secured, a drape thrown over the glass, and Houdini had two minutes to escape. Can you imagine people’s reactions when Houdini told them about the stunt he wanted to pull off? They must have thought he was mad, but then he went ahead and proved them wrong. Regardless whether you’re a great entrepreneur or a magician, you are expected to make the impossible happen. Things Don’t Always Go As Planned Consider this story about Harry Houdini. A small town in the British Isles built a new jail cell. They were quite proud the quality of this particular jail cell. “Come give us a try,” they said to Houdini, and he agreed. He walked into the prison cell with a chest brimming with confidence (after all, he had done this hundreds of times before.) Houdini had secretly hid inside his belt a special lock pick he had designed. Once the jail cell was closed, Houdini took off his coat and began to work with his secret lock pick. But he discovered that something was unusual about this particular lock. For 30 minutes he worked diligently and getting nowhere. His confident expression quickly disappeared. An hour passed, and still, he had not been able to open the door. By now he was bathed in sweat and panting in exasperation, but he still could not pick the lock. He tried all the tricks of his trade, but nothing worked. After two hours of tireless work, Houdini literally collapsed against the door in exhaustion. The door swung open, and he discovered it had never been locked in the first place! It was locked only to him in his mind. I’m sure this story strikes home with every entrepreneur. While Houdini threw everything he had at trying to open the door, entrepreneurs do the same thing with product market fit. Entrepreneurs spin their wheels trying to find the channel to unlocked explosive growth. It’s typically the most challenging and frustrating things to solve for. Just the same, Houdini literally collapsed in exhaustion trying to find a way to unlock his door. No matter what you’re doing, when things don’t go as planned — you need to persevere. Now You See Me Take for example this story of David Copperfield to see the power of storytelling. One of Copperfield’s most famous illusions occurred on television on April 8, 1983. A live audience of 20 tourists were seated in front of a giant curtain attached to 2 lateral scaffolding built on Liberty Island in an enclosed viewing area. Copperfield (with the help of two of his friends) lowered the curtain to reveal the space where the Statue of Liberty once stood. Liberty Island was at that moment — empty. A helicopter hovered overhead to give an aerial view of the illusion, and the statue appeared to have vanished. Only the circle of lights surrounding it was still present and visible. Before making the statue reappear, Copperfield explained in front of the camera why he wanted to perform this illusion. He wanted people to imagine what it would be like if there were no liberty or freedom in the world today and what the world would be like without the freedoms and rights we enjoy. Copperfield then brought Lady Liberty back ending the illusion by saying that “our ancestors couldn’t (enjoy rights and freedoms), we can and our children will.” Did you notice how the message behind the illusion made the trick even more powerful? Instead of just doing a grand trick, Copperfield turned the entire ordeal into a story. Entrepreneurs need to realize people don’t buy products for the features, but rather from the stories they are told. Great entrepreneurs are known for their ability to craft amazing stories for their products. Consumers live for things like use cases and other stories because it helps them put themselves in the shoes of someone who has experienced success. It helps them envision how they can be successful. Just the same, Copperfield helped the world put themselves in their ancestor’s shoes and empathize with them to help his illusion become even more powerful. Don’t underestimate the power of storytelling. Be Ahead of the Curve Do you remember this heated exchange from the movie hit magic movie, ‘Now You See Me’? It’s a powerful message about staying ahead of the curve. Cop: I can maintain my resolve much longer than you can maintain that phony arrogance. And the instant that you even show the slightest crack in that smug facade, I’ll be there. I’ll be all over you like… Magician: Like white on rice? Sorry, that’s unfair. Let me warn you. I want you to follow because no matter what you think you might know, we will always be one step, three steps — seven steps ahead of you, and just when you think you’re catching up, that’s when we’ll be right behind you. And at no time will you be anywhere other than exactly where I want you to be. So come close, get all over me because the closer you think you are, the less you’ll actually see. Entrepreneurs need to be thinking about the future rather than the now. Playing the long game is how you come out successful. Great entrepreneurs think about the next big product that doesn’t exist, they don’t just copy the most popular thing at the time. We know it’s easy to be far ahead of the curve with an endless list of features that need to be implemented. This isn’t what’s going to set you apart. A list is a list until you execute on it. Do you think the iPad was the first tablet ever? No, it was the first time a company executed on how to give people a functional and easy to use tablet. By prioritizing what the users wanted, Apple was able to dominate the tablet market. The crucial thing is prioritizing the endless list of features and other things you have to maximize the effectiveness of what you’re doing. Staying ahead of the curve means nothing unless you’re doing things that will actually have a positive impact. You can simply prioritize your next steps by making data-driven decisions. Let the numbers do the talking, and go from there. Stay ahead by staying lean. Always Put The Audience First A magician’s goal is to entertain their audience while bringing about a sense of wonder. The means for accomplishing this goal involves the use of any combination of some tools including misdirection, psychology, sleight of hand, and storytelling. If a magician does his or her job well, the feeling of being tricked doesn’t enter into a spectator’s mind. The big idea here is the creation of wonder. The same can be said for entrepreneurs. It’s all about putting the customer first and making them happy. Great entrepreneurs always put the customer first regardless if it’s the most profitable thing to do. If you’re not making your audience or customer happy, then you simply won’t have one. Summary Great entrepreneurs and magicians are the same in a variety of ways. Aside from both making the impossible happen on a consistent basis, it’s the goal for both to provide something to benefit people in some way. Magicians have troubles getting out of difficult tricks, they craft stories around their performances, they stay multiple steps ahead of the audience, and their goal is to entertain the audience. Entrepreneurs struggle to find product-market fit, they emphasize stories over features, they choose their next steps carefully based on data, and they put their customers first. In the end, both magicians and great entrepreneurs make the world a better place. Enjoyed this piece? ❤ or let me know in the comments! While you’re at it, learn more about what we’re working on here! ", "title": "Great Entrepreneurs Are A Lot Like Magicians", "sentences": [{"914d": "Great Entrepreneurs Are A Lot Like Magicians"}, {"d562": "When a magician waves his hand and says, “This is where the magic is happening.” The real trick is happening somewhere else. Misdirection."}, {"9d51": "Have you ever watched a magic show and thought to yourself, “there is no way this is possible.” Then, time and time again — the impossible is done right before your very eyes."}, {"6b83": "It’s a lot like what great entrepreneurs do on a recurring basis."}, {"1195": "Imagine what people thought in 1903 when Wilbur and Orville Wright said they were going to fly. I’m sure people doubted they would get more than a foot off the ground. The impossible was done and they flew."}, {"cf6b": "Just the same, Harry Houdini was once lowered head first into a glass tank filled with water while his feet manacled. After dropping into the water via pulleys, the top of the tank was secured, a drape thrown over the glass, and Houdini had two minutes to escape."}, {"2741": "Can you imagine people’s reactions when Houdini told them about the stunt he wanted to pull off? They must have thought he was mad, but then he went ahead and proved them wrong."}, {"45b1": "Regardless whether you’re a great entrepreneur or a magician, you are expected to make the impossible happen."}, {"0f91": "Things Don’t Always Go As Planned"}, {"0f81": "Consider this story about Harry Houdini."}, {"56a4": "A small town in the British Isles built a new jail cell. They were quite proud the quality of this particular jail cell. “Come give us a try,” they said to Houdini, and he agreed."}, {"13c8": "He walked into the prison cell with a chest brimming with confidence (after all, he had done this hundreds of times before.) Houdini had secretly hid inside his belt a special lock pick he had designed. Once the jail cell was closed, Houdini took off his coat and began to work with his secret lock pick. But he discovered that something was unusual about this particular lock."}, {"8af4": "For 30 minutes he worked diligently and getting nowhere. His confident expression quickly disappeared."}, {"0276": "An hour passed, and still, he had not been able to open the door. By now he was bathed in sweat and panting in exasperation, but he still could not pick the lock. He tried all the tricks of his trade, but nothing worked."}, {"cea9": "After two hours of tireless work, Houdini literally collapsed against the door in exhaustion. The door swung open, and he discovered it had never been locked in the first place! It was locked only to him in his mind."}, {"db91": "I’m sure this story strikes home with every entrepreneur. While Houdini threw everything he had at trying to open the door, entrepreneurs do the same thing with product market fit."}, {"e59b": "Entrepreneurs spin their wheels trying to find the channel to unlocked explosive growth. It’s typically the most challenging and frustrating things to solve for. Just the same, Houdini literally collapsed in exhaustion trying to find a way to unlock his door."}, {"274e": "No matter what you’re doing, when things don’t go as planned — you need to persevere."}, {"58ea": "Now You See Me"}, {"c811": "Take for example this story of David Copperfield to see the power of storytelling."}, {"510d": "One of Copperfield’s most famous illusions occurred on television on April 8, 1983. A live audience of 20 tourists were seated in front of a giant curtain attached to 2 lateral scaffolding built on Liberty Island in an enclosed viewing area. Copperfield (with the help of two of his friends) lowered the curtain to reveal the space where the Statue of Liberty once stood. Liberty Island was at that moment — empty."}, {"e59e": "A helicopter hovered overhead to give an aerial view of the illusion, and the statue appeared to have vanished. Only the circle of lights surrounding it was still present and visible. Before making the statue reappear, Copperfield explained in front of the camera why he wanted to perform this illusion."}, {"4116": "He wanted people to imagine what it would be like if there were no liberty or freedom in the world today and what the world would be like without the freedoms and rights we enjoy."}, {"6b6d": "Copperfield then brought Lady Liberty back ending the illusion by saying that “our ancestors couldn’t (enjoy rights and freedoms), we can and our children will.”"}, {"ff5b": "Did you notice how the message behind the illusion made the trick even more powerful? Instead of just doing a grand trick, Copperfield turned the entire ordeal into a story."}, {"c068": "Entrepreneurs need to realize people don’t buy products for the features, but rather from the stories they are told. Great entrepreneurs are known for their ability to craft amazing stories for their products."}, {"697f": "Consumers live for things like use cases and other stories because it helps them put themselves in the shoes of someone who has experienced success. It helps them envision how they can be successful."}, {"5c72": "Just the same, Copperfield helped the world put themselves in their ancestor’s shoes and empathize with them to help his illusion become even more powerful."}, {"6e94": "Don’t underestimate the power of storytelling."}, {"e2aa": "Be Ahead of the Curve"}, {"7ca3": "Do you remember this heated exchange from the movie hit magic movie, ‘Now You See Me’? It’s a powerful message about staying ahead of the curve."}, {"7b47": "Cop: I can maintain my resolve much longer than you can maintain that phony arrogance. And the instant that you even show the slightest crack in that smug facade, I’ll be there. I’ll be all over you like…"}, {"f1e5": "Magician: Like white on rice? Sorry, that’s unfair. Let me warn you. I want you to follow because no matter what you think you might know, we will always be one step, three steps — seven steps ahead of you, and just when you think you’re catching up, that’s when we’ll be right behind you. And at no time will you be anywhere other than exactly where I want you to be. So come close, get all over me because the closer you think you are, the less you’ll actually see."}, {"1372": "Entrepreneurs need to be thinking about the future rather than the now. Playing the long game is how you come out successful. Great entrepreneurs think about the next big product that doesn’t exist, they don’t just copy the most popular thing at the time."}, {"daa2": "We know it’s easy to be far ahead of the curve with an endless list of features that need to be implemented. This isn’t what’s going to set you apart. A list is a list until you execute on it."}, {"c55d": "Do you think the iPad was the first tablet ever? No, it was the first time a company executed on how to give people a functional and easy to use tablet. By prioritizing what the users wanted, Apple was able to dominate the tablet market."}, {"2661": "The crucial thing is prioritizing the endless list of features and other things you have to maximize the effectiveness of what you’re doing. Staying ahead of the curve means nothing unless you’re doing things that will actually have a positive impact."}, {"9030": "You can simply prioritize your next steps by making data-driven decisions. Let the numbers do the talking, and go from there."}, {"98e3": "Stay ahead by staying lean."}, {"acf7": "Always Put The Audience First"}, {"a016": "A magician’s goal is to entertain their audience while bringing about a sense of wonder. The means for accomplishing this goal involves the use of any combination of some tools including misdirection, psychology, sleight of hand, and storytelling."}, {"2539": "If a magician does his or her job well, the feeling of being tricked doesn’t enter into a spectator’s mind. The big idea here is the creation of wonder."}, {"f49d": "The same can be said for entrepreneurs. It’s all about putting the customer first and making them happy. Great entrepreneurs always put the customer first regardless if it’s the most profitable thing to do."}, {"630b": "If you’re not making your audience or customer happy, then you simply won’t have one."}, {"b065": "Summary"}, {"b456": "Great entrepreneurs and magicians are the same in a variety of ways. Aside from both making the impossible happen on a consistent basis, it’s the goal for both to provide something to benefit people in some way."}, {"d281": "Magicians have troubles getting out of difficult tricks, they craft stories around their performances, they stay multiple steps ahead of the audience, and their goal is to entertain the audience."}, {"9d3a": "Entrepreneurs struggle to find product-market fit, they emphasize stories over features, they choose their next steps carefully based on data, and they put their customers first."}, {"4101": "In the end, both magicians and great entrepreneurs make the world a better place."}, {"b780": "Enjoyed this piece? ❤ or let me know in the comments! While you’re at it, learn more about what we’re working on here!"}], "child": "1178_1\t1178_2\t1178_3\t1178_4\t1178_5\t1178_6\t1178_7\t1178_8\t1178_9\t1178_10\t1178_11\t1178_12\t1178_13\t1178_14\t1178_15\t1178_161178_1\t1178_2\t1178_3\t1178_4\t1178_5\t1178_6\t1178_7\t1178_8\t1178_9\t1178_10\t1178_11\t1178_12\t1178_13\t1178_14\t1178_15\t1178_161178_1\t1178_2\t1178_3\t1178_4\t1178_5\t1178_6\t1178_7\t1178_8\t1178_9\t1178_10\t1178_11\t1178_12\t1178_13\t1178_14\t1178_15\t1178_16"}