{"name": "1179", "parent": "", "content": "Save rejoint Remade Group Je suis sorti du tribunal ce matin avec beaucoup de soulagement. Le plan de continuation de l’activité vient d’être accepté. L’histoire de Save va continuer. C’est la fin d’un cycle compliqué et la suite d’une belle aventure. Il était une fois… Je me revois plein d’enthousiasme entre les quatre murs de la première boutique Save my Smartphone en travaux. Jamais je n’aurais pu imaginer que 3 ans plus tard nous serions 500 salariés, répartis dans 137 points de ventes dans 6 pays en Europe, chouchous de la presse, de nos investisseurs, de nos amis et de tout le reste de l’écosystème. En réalité, on s’est rapidement mis dans une bulle, isolés de toute critique, ne craignant aucune barrière et privés de tout discernement. Les marges n’étaient pas encore au rendez-vous, les opérations se déroulaient sans réelle maîtrise, on a levé des fonds, on était en hyper croissance et on se dit que c’est normal. Sauf qu’en mars 2016, Save consomme beaucoup trop de cash par mois et va dans le mur. La fête est finie. Le mur n’est pas passé loin. Tout tient à un déjeuner avec un entrepreneur chevronné des télécoms qui a vécu une histoire similaire. 5 Juillet 2016. Mise en redressement judiciaire. Fini les médias. Fini la conquête du monde. On se retrousse les manches et on attaque les problèmes un à un (http://bit.ly/save-2016). Les derniers arrivés partent, les guerriers restent, certains sont remerciés. On se met en mode survie et on traite tous les sujets pour retrouver un périmètre financier et opérationnel qui permette de donner à Save et à ses salariés un avenir. Fermetures de magasins, fermeture de filiales, plan social… La restructuration est douloureuse mais les équipes donnent tout avec force et talent. Après 6 mois, nous avons presque arrêté de consommer de l’argent et retrouvé un périmètre de magasins rentables. La gestion de notre stock qui était l’une de nos plus grandes faiblesses est devenue notre force. On est passé du flou à la précision. C’était alors le bon moment de s’assoir avec nos actionnaires et de faire des choix: http://bit.ly/save--2017 Remade Group. Dans ma recherche d’opportunités pour la suite de Save, on a naturellement parlé avec Matthieu Millet, le fondateur et dirigeant de Remade Group leader dans le marché des smartphones reconditionnés. Grâce à Remade, la marque de Save est conservée, nos magasins et nos sauveteurs aussi. Les créanciers vont être remboursés grâce au plan de continuation, les intérêts de nos investisseurs sont préservés et 20% du montant de la cession revient aux dirigeants et managers clés. Merci Matthieu pour ta pro-activité et ton engagement tout au long du process. La suite . Save va intégrer Remade Group et reprendre activement son développement grâce à leur maîtrise industrielle: Elle sera notre nouveau socle et nous pourrons y déployer toute notre énergie. Ayant retrouvé le chemin de la croissance, la société sera recapitalisée. Remade c’est autant de compétences que d’expériences qu’il nous manquait pour aller au bout de notre projet. Notre modèle va enfin pouvoir évoluer vers la franchise et ainsi attirer des entrepreneurs “localement”. (Pour rejoindre l ‘aventure: franchise@save.co). Quatre ans après, les quatre murs sont plus épais et plus solides. L’énergie est toujours la même. Nous avons pris de sacrés coups, traversé des déserts, retrouvé l’espoir et nous voilà près à relever tous les défis. C’est une belle aventure humaine qui continue. On a pris de sacrées leçons et on n’oubliera pas tous ceux qui ont été là sans réserve, dans les moments difficiles. → Remerciements (click) DM. ", "title": "Save rejoint Remade Group", "sentences": [{"4ea3": "Save rejoint Remade Group"}, {"3768": "Je suis sorti du tribunal ce matin avec beaucoup de soulagement. Le plan de continuation de l’activité vient d’être accepté. L’histoire de Save va continuer. C’est la fin d’un cycle compliqué et la suite d’une belle aventure."}, {"24c7": "Il était une fois…"}, {"6577": "Je me revois plein d’enthousiasme entre les quatre murs de la première boutique Save my Smartphone en travaux. Jamais je n’aurais pu imaginer que 3 ans plus tard nous serions 500 salariés, répartis dans 137 points de ventes dans 6 pays en Europe, chouchous de la presse, de nos investisseurs, de nos amis et de tout le reste de l’écosystème."}, {"6aab": "En réalité, on s’est rapidement mis dans une bulle, isolés de toute critique, ne craignant aucune barrière et privés de tout discernement. Les marges n’étaient pas encore au rendez-vous, les opérations se déroulaient sans réelle maîtrise, on a levé des fonds, on était en hyper croissance et on se dit que c’est normal. Sauf qu’en mars 2016, Save consomme beaucoup trop de cash par mois et va dans le mur. La fête est finie."}, {"4087": "Le mur n’est pas passé loin. Tout tient à un déjeuner avec un entrepreneur chevronné des télécoms qui a vécu une histoire similaire."}, {"2b84": "5 Juillet 2016. Mise en redressement judiciaire."}, {"ff1b": "Fini les médias. Fini la conquête du monde. On se retrousse les manches et on attaque les problèmes un à un (http://bit.ly/save-2016). Les derniers arrivés partent, les guerriers restent, certains sont remerciés. On se met en mode survie et on traite tous les sujets pour retrouver un périmètre financier et opérationnel qui permette de donner à Save et à ses salariés un avenir."}, {"122d": "Fermetures de magasins, fermeture de filiales, plan social… La restructuration est douloureuse mais les équipes donnent tout avec force et talent. Après 6 mois, nous avons presque arrêté de consommer de l’argent et retrouvé un périmètre de magasins rentables. La gestion de notre stock qui était l’une de nos plus grandes faiblesses est devenue notre force. On est passé du flou à la précision."}, {"3ac8": "C’était alors le bon moment de s’assoir avec nos actionnaires et de faire des choix: http://bit.ly/save--2017"}, {"cc22": "Remade Group."}, {"42e0": "Dans ma recherche d’opportunités pour la suite de Save, on a naturellement parlé avec Matthieu Millet, le fondateur et dirigeant de Remade Group leader dans le marché des smartphones reconditionnés."}, {"3823": "Grâce à Remade, la marque de Save est conservée, nos magasins et nos sauveteurs aussi. Les créanciers vont être remboursés grâce au plan de continuation, les intérêts de nos investisseurs sont préservés et 20% du montant de la cession revient aux dirigeants et managers clés."}, {"dd7b": "Merci Matthieu pour ta pro-activité et ton engagement tout au long du process."}, {"9fdb": "La suite ."}, {"b69d": "Save va intégrer Remade Group et reprendre activement son développement grâce à leur maîtrise industrielle: Elle sera notre nouveau socle et nous pourrons y déployer toute notre énergie. Ayant retrouvé le chemin de la croissance, la société sera recapitalisée. Remade c’est autant de compétences que d’expériences qu’il nous manquait pour aller au bout de notre projet."}, {"4a5b": "Notre modèle va enfin pouvoir évoluer vers la franchise et ainsi attirer des entrepreneurs “localement”. (Pour rejoindre l ‘aventure: franchise@save.co)."}, {"d852": "Quatre ans après, les quatre murs sont plus épais et plus solides. L’énergie est toujours la même. Nous avons pris de sacrés coups, traversé des déserts, retrouvé l’espoir et nous voilà près à relever tous les défis. C’est une belle aventure humaine qui continue. On a pris de sacrées leçons et on n’oubliera pas tous ceux qui ont été là sans réserve, dans les moments difficiles."}, {"d43d": "→ Remerciements (click)"}, {"562e": "DM."}], "child": "1179_1\t1179_2"}