{"sentences": [{"fac4": "I ranked every Intro to Data Science course on the internet, based on thousands of data points"}, {"8cf1": "A year ago, I dropped out of one of the best computer science programs in Canada. I started creating my own data science master’s program using online resources. I realized that I could learn everything I needed through edX, Coursera, and Udacity instead. And I could learn it faster, more efficiently, and for a fraction of the cost."}, {"c9b6": "I’m almost finished now. I’ve taken many data science-related courses and audited portions of many more. I know the options out there, and what skills are needed for learners preparing for a data analyst or data scientist role. A few months ago, I started creating a review-driven guide that recommends the best courses for each subject within data science."}, {"9faf": "For the first guide in the series, I recommended a few coding classes for the beginner data scientist. Then it was statistics and probability classes."}, {"a4cc": "Now onto introductions to data science."}, {"e403": "(Don’t worry if you’re unsure of what an intro to data science course entails. I’ll explain shortly.)"}, {"fe66": "For this guide, I spent 10+ hours trying to identify every online intro to data science course offered as of January 2017, extracting key bits of information from their syllabi and reviews, and compiling their ratings. For this task, I turned to none other than the open source Class Central community and its database of thousands of course ratings and reviews."}, {"865b": "Since 2011, Class Central founder Dhawal Shah has kept a closer eye on online courses than arguably anyone else in the world. Dhawal personally helped me assemble this list of resources."}, {"4c73": "How we picked courses to consider"}, {"7af6": "Each course must fit three criteria:"}, {"c21e": "We believe we covered every notable course that fits the above criteria. Since there are seemingly hundreds of courses on Udemy, we chose to consider the most-reviewed and highest-rated ones only. There’s always a chance that we missed something, though. So please let us know in the comments section if we left a good course out."}, {"4394": "How we evaluated courses"}, {"28e5": "We compiled average rating and number of reviews from Class Central and other review sites to calculate a weighted average rating for each course. We read text reviews and used this feedback to supplement the numerical ratings."}, {"1c9a": "We made subjective syllabus judgment calls based on two factors:"}, {"604a": "1. Coverage of the data science process. Does the course brush over or skip certain subjects? Does it cover certain subjects in too much detail? See the next section for what this process entails."}, {"c931": "2. Usage of common data science tools. Is the course taught using popular programming languages like Python and/or R? These aren’t necessary, but helpful in most cases so slight preference is given to these courses."}, {"b94a": "Python and R are the two most popular programming languages used in data science."}, {"6bac": "What is the data science process?"}, {"a7ea": "What is data science? What does a data scientist do? These are the types of fundamental questions that an intro to data science course should answer. The following infographic from Harvard professors Joe Blitzstein and Hanspeter Pfister outlines a typical data science process, which will help us answer these questions."}, {"c4b9": "Our goal with this introduction to data science course is to become familiar with the data science process. We don’t want too in-depth coverage of specific aspects of the process, hence the “intro to” portion of the title."}, {"d50a": "For each aspect, the ideal course explains key concepts within the framework of the process, introduces common tools, and provides a few examples (preferably hands-on)."}, {"c0c8": "We’re only looking for an introduction. This guide therefore won’t include full specializations or programs like Johns Hopkins University’s Data Science Specialization on Coursera or Udacity’s Data Analyst Nanodegree. These compilations of courses elude the purpose of this series: to find the best individual courses for each subject to comprise a data science education. The final three guides in this series of articles will cover each aspect of the data science process in detail."}, {"0371": "Basic coding, stats, and probability experience required"}, {"6b33": "Several courses listed below require basic programming, statistics, and probability experience. This requirement is understandable given that the new content is reasonably advanced, and that these subjects often have several courses dedicated to them."}, {"12cb": "This experience can be acquired through our recommendations in the first two articles (programming, statistics) in this Data Science Career Guide."}, {"6cef": "Our pick for the best intro to data science course is…"}, {"c9d2": "Kirill Eremenko’s Data Science A-Z™ on Udemy is the clear winner in terms of breadth and depth of coverage of the data science process of the 20+ courses that qualified. It has a 4.5-star weighted average rating over 3,071 reviews, which places it among the highest rated and most reviewed courses of the ones considered."}, {"d9e1": "It outlines the full process and provides real-life examples. At 21 hours of content, it is a good length. Reviewers love the instructor’s delivery and the organization of the content. The price varies depending on Udemy discounts, which are frequent, so you may be able to purchase access for as little as $10."}, {"8ad0": "Though it doesn’t check our “usage of common data science tools” box, the non-Python/R tool choices (gretl, Tableau, Excel) are used effectively in context. Eremenko mentions the following when explaining the gretl choice (gretl is a statistical software package), though it applies to all of the tools he uses (emphasis mine):"}, {"c421": "In gretl, we will be able to do the same modeling just like in R and Python but we won’t have to code. That’s the big deal here. Some of you may already know R very well, but some may not know it at all. My goal is to show you how to build a robust model and give you a framework that you can apply in any tool you choose. gretl will help us avoid getting bogged down in our coding."}, {"2ed2": "One prominent reviewer noted the following:"}, {"597c": "Kirill is the best teacher I’ve found online. He uses real life examples and explains common problems so that you get a deeper understanding of the coursework. He also provides a lot of insight as to what it means to be a data scientist from working with insufficient data all the way to presenting your work to C-class management. I highly recommend this course for beginner students to intermediate data analysts!"}, {"1329": "The preview video for Data Science A-Z™."}, {"d3f6": "A great Python-focused introduction"}, {"14a6": "Udacity’s Intro to Data Analysis is a relatively new offering that is part of Udacity’s popular Data Analyst Nanodegree. It covers the data science process clearly and cohesively using Python, though it lacks a bit in the modeling aspect. The estimated timeline is 36 hours (six hours per week over six weeks), though it is shorter in my experience. It has a 5-star rating over one review. It is free."}, {"8ec0": "The videos are well-produced and the instructor (Caroline Buckey) is clear and personable. Lots of programming quizzes enforce the concepts learned in the videos. Students will leave the course confident in their new and/or improved NumPy and Pandas skills (these are popular Python libraries). The final project — which is graded and reviewed in the Nanodegree but not in the free individual course — can be a nice add to a portfolio."}, {"96c0": "Udacity instructor Caroline Buckey outlining the data analysis process (also known as the data science process)."}, {"bf81": "An impressive offering with no review data"}, {"4eda": "Data Science Fundamentals is a four-course series provided by IBM’s Big Data University. It includes courses titled Data Science 101, Data Science Methodology, Data Science Hands-on with Open Source Tools, and R 101."}, {"4628": "It covers the full data science process and introduces Python, R, and several other open-source tools. The courses have tremendous production value. 13–18 hours of effort is estimated, depending on if you take the “R 101” course at the end, which isn’t necessary for the purpose of this guide. Unfortunately, it has no review data on the major review sites that we used for this analysis, so we can’t recommend it over the above two options yet. It is free."}, {"8c6f": "A video from the first module of the Big Data University’s Data Science 101 (which is the first course in the Data Science Fundamentals series)."}, {"b35b": "The competition"}, {"f951": "Our #1 pick had a weighted average rating of 4.5 out of 5 stars over 3,068 reviews. Let’s look at the other alternatives, sorted by descending rating. Below you’ll find several R-focused courses, if you are set on an introduction in that language."}, {"4811": "V2 Maestros has two versions of their “Applied Data Science” course: one for Python and one for R."}, {"fb33": "The following courses had no reviews as of January 2017."}, {"65ac": "The featured viz on Harvard CS109’s homepage."}, {"cbec": "Wrapping it Up"}, {"375c": "This is the third of a six-piece series that covers the best online courses for launching yourself into the data science field. We covered programming in the first article and statistics and probability in the second article. The remainder of the series will cover other data science core competencies: data visualization and machine learning."}, {"82f3": "If you want to learn Data Science, start with one of these programming classesmedium.freecodecamp.com"}, {"917d": "If you want to learn Data Science, take a few of these statistics classesmedium.freecodecamp.com"}, {"d985": "The final piece will be a summary of those articles, plus the best online courses for other key topics such as data wrangling, databases, and even software engineering."}, {"85e4": "If you’re looking for a complete list of Data Science online courses, you can find them on Class Central’s Data Science and Big Data subject page."}, {"4dec": "If you enjoyed reading this, check out some of Class Central’s other pieces:"}, {"3220": "Here are 250 Ivy League courses you can take online right now for free250 MOOCs from Brown, Columbia, Cornell, Dartmouth, Harvard, Penn, Princeton, and Yale.medium.freecodecamp.com"}, {"9515": "The 50 best free online university courses according to dataWhen I launched Class Central back in November 2011, there were around 18 or so free online courses, and almost all of…medium.freecodecamp.com"}, {"082e": "If you have suggestions for courses I missed, let me know in the responses!"}, {"57cd": "If you found this helpful, click the 💚 so more people will see it here on Medium."}, {"66e6": "This is a condensed version of my original article published on Class Central, where I’ve included further course descriptions, syllabi, and multiple reviews."}], "content": "I ranked every Intro to Data Science course on the internet, based on thousands of data points A year ago, I dropped out of one of the best computer science programs in Canada. I started creating my own data science master’s program using online resources. I realized that I could learn everything I needed through edX, Coursera, and Udacity instead. And I could learn it faster, more efficiently, and for a fraction of the cost. I’m almost finished now. I’ve taken many data science-related courses and audited portions of many more. I know the options out there, and what skills are needed for learners preparing for a data analyst or data scientist role. A few months ago, I started creating a review-driven guide that recommends the best courses for each subject within data science. For the first guide in the series, I recommended a few coding classes for the beginner data scientist. Then it was statistics and probability classes. Now onto introductions to data science. (Don’t worry if you’re unsure of what an intro to data science course entails. I’ll explain shortly.) For this guide, I spent 10+ hours trying to identify every online intro to data science course offered as of January 2017, extracting key bits of information from their syllabi and reviews, and compiling their ratings. For this task, I turned to none other than the open source Class Central community and its database of thousands of course ratings and reviews. Since 2011, Class Central founder Dhawal Shah has kept a closer eye on online courses than arguably anyone else in the world. Dhawal personally helped me assemble this list of resources. How we picked courses to consider Each course must fit three criteria: We believe we covered every notable course that fits the above criteria. Since there are seemingly hundreds of courses on Udemy, we chose to consider the most-reviewed and highest-rated ones only. There’s always a chance that we missed something, though. So please let us know in the comments section if we left a good course out. How we evaluated courses We compiled average rating and number of reviews from Class Central and other review sites to calculate a weighted average rating for each course. We read text reviews and used this feedback to supplement the numerical ratings. We made subjective syllabus judgment calls based on two factors: 1. Coverage of the data science process. Does the course brush over or skip certain subjects? Does it cover certain subjects in too much detail? See the next section for what this process entails. 2. Usage of common data science tools. Is the course taught using popular programming languages like Python and/or R? These aren’t necessary, but helpful in most cases so slight preference is given to these courses. Python and R are the two most popular programming languages used in data science. What is the data science process? What is data science? What does a data scientist do? These are the types of fundamental questions that an intro to data science course should answer. The following infographic from Harvard professors Joe Blitzstein and Hanspeter Pfister outlines a typical data science process, which will help us answer these questions. Our goal with this introduction to data science course is to become familiar with the data science process. We don’t want too in-depth coverage of specific aspects of the process, hence the “intro to” portion of the title. For each aspect, the ideal course explains key concepts within the framework of the process, introduces common tools, and provides a few examples (preferably hands-on). We’re only looking for an introduction. This guide therefore won’t include full specializations or programs like Johns Hopkins University’s Data Science Specialization on Coursera or Udacity’s Data Analyst Nanodegree. These compilations of courses elude the purpose of this series: to find the best individual courses for each subject to comprise a data science education. The final three guides in this series of articles will cover each aspect of the data science process in detail. Basic coding, stats, and probability experience required Several courses listed below require basic programming, statistics, and probability experience. This requirement is understandable given that the new content is reasonably advanced, and that these subjects often have several courses dedicated to them. This experience can be acquired through our recommendations in the first two articles (programming, statistics) in this Data Science Career Guide. Our pick for the best intro to data science course is… Kirill Eremenko’s Data Science A-Z™ on Udemy is the clear winner in terms of breadth and depth of coverage of the data science process of the 20+ courses that qualified. It has a 4.5-star weighted average rating over 3,071 reviews, which places it among the highest rated and most reviewed courses of the ones considered. It outlines the full process and provides real-life examples. At 21 hours of content, it is a good length. Reviewers love the instructor’s delivery and the organization of the content. The price varies depending on Udemy discounts, which are frequent, so you may be able to purchase access for as little as $10. Though it doesn’t check our “usage of common data science tools” box, the non-Python/R tool choices (gretl, Tableau, Excel) are used effectively in context. Eremenko mentions the following when explaining the gretl choice (gretl is a statistical software package), though it applies to all of the tools he uses (emphasis mine): In gretl, we will be able to do the same modeling just like in R and Python but we won’t have to code. That’s the big deal here. Some of you may already know R very well, but some may not know it at all. My goal is to show you how to build a robust model and give you a framework that you can apply in any tool you choose. gretl will help us avoid getting bogged down in our coding. One prominent reviewer noted the following: Kirill is the best teacher I’ve found online. He uses real life examples and explains common problems so that you get a deeper understanding of the coursework. He also provides a lot of insight as to what it means to be a data scientist from working with insufficient data all the way to presenting your work to C-class management. I highly recommend this course for beginner students to intermediate data analysts! The preview video for Data Science A-Z™. A great Python-focused introduction Udacity’s Intro to Data Analysis is a relatively new offering that is part of Udacity’s popular Data Analyst Nanodegree. It covers the data science process clearly and cohesively using Python, though it lacks a bit in the modeling aspect. The estimated timeline is 36 hours (six hours per week over six weeks), though it is shorter in my experience. It has a 5-star rating over one review. It is free. The videos are well-produced and the instructor (Caroline Buckey) is clear and personable. Lots of programming quizzes enforce the concepts learned in the videos. Students will leave the course confident in their new and/or improved NumPy and Pandas skills (these are popular Python libraries). The final project — which is graded and reviewed in the Nanodegree but not in the free individual course — can be a nice add to a portfolio. Udacity instructor Caroline Buckey outlining the data analysis process (also known as the data science process). An impressive offering with no review data Data Science Fundamentals is a four-course series provided by IBM’s Big Data University. It includes courses titled Data Science 101, Data Science Methodology, Data Science Hands-on with Open Source Tools, and R 101. It covers the full data science process and introduces Python, R, and several other open-source tools. The courses have tremendous production value. 13–18 hours of effort is estimated, depending on if you take the “R 101” course at the end, which isn’t necessary for the purpose of this guide. Unfortunately, it has no review data on the major review sites that we used for this analysis, so we can’t recommend it over the above two options yet. It is free. A video from the first module of the Big Data University’s Data Science 101 (which is the first course in the Data Science Fundamentals series). The competition Our #1 pick had a weighted average rating of 4.5 out of 5 stars over 3,068 reviews. Let’s look at the other alternatives, sorted by descending rating. Below you’ll find several R-focused courses, if you are set on an introduction in that language. V2 Maestros has two versions of their “Applied Data Science” course: one for Python and one for R. The following courses had no reviews as of January 2017. The featured viz on Harvard CS109’s homepage. Wrapping it Up This is the third of a six-piece series that covers the best online courses for launching yourself into the data science field. We covered programming in the first article and statistics and probability in the second article. The remainder of the series will cover other data science core competencies: data visualization and machine learning. If you want to learn Data Science, start with one of these programming classesmedium.freecodecamp.com If you want to learn Data Science, take a few of these statistics classesmedium.freecodecamp.com The final piece will be a summary of those articles, plus the best online courses for other key topics such as data wrangling, databases, and even software engineering. If you’re looking for a complete list of Data Science online courses, you can find them on Class Central’s Data Science and Big Data subject page. If you enjoyed reading this, check out some of Class Central’s other pieces: Here are 250 Ivy League courses you can take online right now for free250 MOOCs from Brown, Columbia, Cornell, Dartmouth, Harvard, Penn, Princeton, and Yale.medium.freecodecamp.com The 50 best free online university courses according to dataWhen I launched Class Central back in November 2011, there were around 18 or so free online courses, and almost all of…medium.freecodecamp.com If you have suggestions for courses I missed, let me know in the responses! If you found this helpful, click the 💚 so more people will see it here on Medium. This is a condensed version of my original article published on Class Central, where I’ve included further course descriptions, syllabi, and multiple reviews. ", "parent": "", "title": "I ranked every Intro to Data Science course on the internet, based on thousands of data points", "child": "118_1\t118_2\t118_3\t118_4\t118_5\t118_6\t118_7\t118_8\t118_9\t118_10\t118_11\t118_12\t118_13\t118_14\t118_15\t118_16\t118_17\t118_18\t118_19\t118_20\t118_21\t118_22\t118_23\t118_24\t118_25", "name": "118"}