{"name": "1180", "parent": "", "content": "3 Things You Can Do in the Next 3 Minutes that Will Benefit You for a Lifetime It’s so simple you’ll hate me for even writing this post. Yes, I have a 3 step method you can do in 3 minutes that will change your life (or at the very least the next 10 minutes). I have to forewarn you, it’s not a productivity hack. It’s not a goal-setting method. It has absolutely nothing to do with Bulletproof coffee. It’s the art of resetting. Here’s how it goes: Step 1: Pause for 1 minute Pause. Drop what ever you’re doing. Don’t think. Don’t act. Pause. The purpose is to settle down and break away from the hustle, anxiety, or overwhelming feelings you currently face. And just pause, for 1 minute. Step 2: Reflect on something good for 1 minute Reflect. Reflect on something good that’s happened to you today. Reflect on friends or family. Reflect on how far you’ve come in life. Reflect on the beauty in front of you. Force your brain to turn it’s cognitive powers onto the good things in your life (because we’re hardwired for the exact opposite). The purpose here is to shift your mindset to seek good. This plays an important roll in the next step. Reflect on the good, for 1 minute. Step 3: Focus entirely on your ONE thing for 1 minute Focus. Life is a process, a series of actions. Once this minute is up, there will be something you’ll need to do. Not two things. Not four. One. Whether it’s spending quality time with a spouse, or writing an email, or painting, there has to be one thing facing you at the end of this timer. Therefore, focus all your attention on how you will do that one thing, well. Focus on the feeling of achieving your one thing. Focus on the good it will bring. Focus on being the best lover/writer/painter for the next ___ minutes. Then get to work. Repeat this as many times as you need for a lifetime. The art of resetting will change you. Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button: ", "title": "3 Things You Can Do in the Next 3 Minutes that Will Benefit You for a Lifetime", "sentences": [{"45e0": "3 Things You Can Do in the Next 3 Minutes that Will Benefit You for a Lifetime"}, {"b927": "It’s so simple you’ll hate me for even writing this post."}, {"db67": "Yes, I have a 3 step method you can do in 3 minutes that will change your life (or at the very least the next 10 minutes)."}, {"5442": "I have to forewarn you, it’s not a productivity hack. It’s not a goal-setting method. It has absolutely nothing to do with Bulletproof coffee."}, {"5149": "It’s the art of resetting."}, {"b7b7": "Here’s how it goes:"}, {"6c7b": "Step 1: Pause for 1 minute"}, {"1820": "Pause."}, {"d3c6": "Drop what ever you’re doing. Don’t think. Don’t act."}, {"5ff4": "Pause."}, {"79db": "The purpose is to settle down and break away from the hustle, anxiety, or overwhelming feelings you currently face."}, {"21b9": "And just pause, for 1 minute."}, {"7e9f": "Step 2: Reflect on something good for 1 minute"}, {"55be": "Reflect."}, {"6811": "Reflect on something good that’s happened to you today. Reflect on friends or family. Reflect on how far you’ve come in life. Reflect on the beauty in front of you."}, {"0dfb": "Force your brain to turn it’s cognitive powers onto the good things in your life (because we’re hardwired for the exact opposite)."}, {"7975": "The purpose here is to shift your mindset to seek good. This plays an important roll in the next step."}, {"c446": "Reflect on the good, for 1 minute."}, {"6792": "Step 3: Focus entirely on your ONE thing for 1 minute"}, {"6401": "Focus."}, {"4de6": "Life is a process, a series of actions. Once this minute is up, there will be something you’ll need to do."}, {"541f": "Not two things. Not four. One."}, {"00d6": "Whether it’s spending quality time with a spouse, or writing an email, or painting, there has to be one thing facing you at the end of this timer."}, {"c6f3": "Therefore, focus all your attention on how you will do that one thing, well."}, {"3af4": "Focus on the feeling of achieving your one thing. Focus on the good it will bring. Focus on being the best lover/writer/painter for the next ___ minutes."}, {"b254": "Then get to work."}, {"5281": "Repeat this as many times as you need for a lifetime."}, {"7d96": "The art of resetting will change you."}, {"c2b0": "Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button:"}], "child": "1180_1\t1180_2\t1180_3\t1180_4\t1180_51180_1\t1180_2\t1180_3\t1180_4\t1180_5"}