{"name": "1184", "parent": "", "content": "Procrastinators It’s time to kill Procrastination! (Infographics) Procrastination, many people say, is bad. You waste time. Time which you would have been better spent finishing the project and then doing something you actually wanted to do later. The problem is that the thing you need to be doing is boring or difficult, and that computer game/chat/origami puppet is a lot more fun. Here’s the thing: procrastination is bad, but understandable. Most tasks that we have to do: bookkeeping, reading papers, homework, a ten page letter to a client, are boring. ThugStart — If You Begin, You Win. If you liked this and want more: Do me a solid ❤ Heart it, 💬 comment on it, and/or follow me 😀 Also, if you would like to read more captivating stuff on the topics of entrepreneurship, marketing, social media, leadership, technology, innovation and venture capital via my regular posts then please click ‘Follow’ and feel free to connect via SlideShare, Twitter, Facebook and LinkedIn. & Please go ahead and ThugStart! P.S. here are my other Articles on Medium. ", "title": "Procrastinators It’s time to kill Procrastination! (Infographics)", "sentences": [{"5c27": "Procrastinators It’s time to kill Procrastination! (Infographics)"}, {"9263": "Procrastination, many people say, is bad. You waste time. Time which you would have been better spent finishing the project and then doing something you actually wanted to do later."}, {"7713": "The problem is that the thing you need to be doing is boring or difficult, and that computer game/chat/origami puppet is a lot more fun. Here’s the thing: procrastination is bad, but understandable. Most tasks that we have to do: bookkeeping, reading papers, homework, a ten page letter to a client, are boring."}, {"3a42": "ThugStart — If You Begin, You Win."}, {"e575": "If you liked this and want more:"}, {"b582": "Do me a solid ❤ Heart it, 💬 comment on it, and/or follow me 😀"}, {"068b": "Also, if you would like to read more captivating stuff on the topics of entrepreneurship, marketing, social media, leadership, technology, innovation and venture capital via my regular posts then please click ‘Follow’ and feel free to connect via SlideShare, Twitter, Facebook and LinkedIn."}, {"6655": "& Please go ahead and ThugStart!"}, {"b2d7": "P.S. here are my other Articles on Medium."}], "child": "1184_11184_1"}