{"name": "1187", "parent": "", "content": "I’m sorry, I can’t If it’s not a priority, just let me know. Don’t say you’d love to get together…later. Just say no. You might miss something, but you’re the expert on prioritizing your time. You do you. No harm. No hard feelings. But just tell me because knowing I am not a priority for you is very helpful to me and my priorities. When I was just starting to think about finding a role in venture capital, there were a few people, senior GP’s at top funds, that I reached out to ask for time and advice. The first did not respond. I assumed I was not a priority and after one follow up attempt, let it go. Is he disorganized? Bad at eMail? A little arrogant? Not sure. The second wrote back after a “warm introduction” letting me know he was excited to meet, but couldn’t do it for a few months. I was psyched. Then, a week before the meeting was supposed to happen, it got pushed back. I would call it rescheduled, but there was no new date offered. I persevered and kept in touch with his assistant for a few months and finally got a date on the calendar, that got moved and moved and moved. The purposeful waste of my time ground in like skin sliding on pavement. I felt disrespected by an arrogant asshole. The third GP replied to my cold email in less than an hour with a simple line that I will never forget: “I’m sorry. I can’t.” So elegant, honest and direct. With that quick note, I knew that he read my request and could not make time for me — I was not a priority right then, and he was sorry about that fact. The quick clarity of his response showed me he was organized and purposeful about how he allocated his time and managed his priorities. I felt respected. Disappointed, but respected. I try to remember this when asking for time and when being asked for time. I can’t give everyone my time and respect my priorities. But, I do have time to give everyone my respect. ", "title": "I’m sorry, I can’t", "sentences": [{"e6e9": "I’m sorry, I can’t"}, {"57bf": "If it’s not a priority, just let me know. Don’t say you’d love to get together…later. Just say no. You might miss something, but you’re the expert on prioritizing your time. You do you. No harm. No hard feelings. But just tell me because knowing I am not a priority for you is very helpful to me and my priorities."}, {"0dd3": "When I was just starting to think about finding a role in venture capital, there were a few people, senior GP’s at top funds, that I reached out to ask for time and advice."}, {"0ecb": "The first did not respond. I assumed I was not a priority and after one follow up attempt, let it go. Is he disorganized? Bad at eMail? A little arrogant? Not sure."}, {"41f3": "The second wrote back after a “warm introduction” letting me know he was excited to meet, but couldn’t do it for a few months. I was psyched. Then, a week before the meeting was supposed to happen, it got pushed back. I would call it rescheduled, but there was no new date offered. I persevered and kept in touch with his assistant for a few months and finally got a date on the calendar, that got moved and moved and moved. The purposeful waste of my time ground in like skin sliding on pavement. I felt disrespected by an arrogant asshole."}, {"beed": "The third GP replied to my cold email in less than an hour with a simple line that I will never forget:"}, {"eab1": "“I’m sorry. I can’t.”"}, {"d5fc": "So elegant, honest and direct. With that quick note, I knew that he read my request and could not make time for me — I was not a priority right then, and he was sorry about that fact. The quick clarity of his response showed me he was organized and purposeful about how he allocated his time and managed his priorities. I felt respected. Disappointed, but respected."}, {"45b4": "I try to remember this when asking for time and when being asked for time. I can’t give everyone my time and respect my priorities. But, I do have time to give everyone my respect."}], "child": "1187_1\t1187_2"}