{"name": "1189", "parent": "", "content": "Announcing Eniac IV, a $100M Seed Fund, and the Eniac Platform We first started Eniac Ventures in 2010 as an opportunity to leverage our experience as startup founders and operators to help a new generation of founders. Today we are excited to announce Eniac IV, a $100 million vehicle to back bold founders at the institutional seed stage. Our investment focus remains the same, leading seed rounds in bold technical teams with a transformational vision to build the next iconic company. In addition to Eniac IV, we are also announcing our platform, providing the tools and services to our founders that will allow them to focus on execution and finding product market fit. So why $100M fund for seed investments? At Eniac we have always focused on seed rounds. Amongst the four partners, we have founded and grown over a dozen companies, some more successful than others, but all providing valuable lessons that can be leveraged to accelerate the growth of our portfolio companies. When we work with seed stage founders we help in real, meaningful ways. Sometimes our founders tell us it’s like having four additional co-founders on demand. The institutional seed stage asset class has continued to grow in terms of company maturity, investor landscape, and round sizes. It was important for us to raise a fund that will allow us to lead or co-lead seed rounds, continue to support our companies through their growth lifecycle, and give founders the resources to execute. Eniac IV is the perfect size to allow us to continue investing at our current pace as lead investors and enables us to accelerate our companies by providing industry-leading services through our platform. But it’s not so big that we can’t continue to invest alongside the other seed investors we love working with. Eniac Ventures on TechCrunchTV What is The Eniac Platform? Our founders tend to come to us very early in the evolution of their product or vision, so we have always been very hands-on. Anything we can offload from them provides more time they can dedicate to finding product-market fit in advance of their Series A. Our new platform is an extension of this layer of support, taking it to the next level by hiring experts and institutionalizing the services. Our portfolio companies can expect the following free services from Eniac: What sectors are we interested in? Most of the areas we’re currently excited about can be broadly grouped into two seismic evolutions: the progression towards seamless computing and the ascent of automation. In the future, the way we interact with technology will be drastically different. All the screens people interact with will ultimately disappear and be replaced with more humanistic and natural interfaces. So instead of tapping on a phone screen, you might message with friends using gestures and voice and see their reply in the form of augmented reality. We think of this as a new era of seamless computing and it informs a lot of the investments we’ll make over the next few years. Equally important is the march toward automation, which will be driven by improvements in both machine intelligence and the physical manifestation of computing. The percentage of tasks that machines can more efficiently complete than humans will continue to increase at an incredible rate. This creates huge new business opportunities while freeing up humans to focus on more interesting and fulfilling activities. Our current view of the technology cycle is depicted in the technology S-curves below that show areas of interest as well as how they manifest themselves into business opportunities over time. Robotics Right now many people only think about robotics in terms of large scale robots building cars or hobby and military drones. However, as artificial intelligence continues to grow exponentially, we will increasingly interact with computing around us through robotics. We are especially interested in the intersection of AI and new robotic technologies that will automate manufacturing, transportation, and other large industries. Augmented Reality/Virtual Reality Soon these technologies will be one of the primary modes in which people interact with and experience the Internet. AR especially has the promise of lifting people’s eyes off phones and towards the world around them while still acting on the information they need. We are investing in the companies that are preparing the world for a VR/AR revolution. Conversational User Interfaces Every day we see the way people interact with their devices evolve. From AI-powered bots to natural language processing to gesture tracking technology, the changes are happening all around us. The truth is, interfacing with technology in these ways is more natural and closely mirrors the way people have interacted with one another for thousands of years. We will continue to support founders who build the technology behind these new forms of communications. Disrupting Mature Industries Technology adoption is often slowest by some of the world’s largest industries. We regularly see billion dollar opportunities from companies using software to disrupt industries like finance, construction, insurance, and healthcare to name a few. We will continue to make bets on companies that can bring innovation and efficiency to the titans of industry. You may notice that we did not call out artificial intelligence directly as one of our sectors. This is because we don’t see AI as a sector, but rather a fundamental titanic shift that cuts across everything we do. Much like “big data” when we started investing in 2010, we expect almost every investment we make to utilize different branches of AI to solve big problems for users and customers. How are we picking our next investments? The characteristics that make a great company are well documented, but at the seed stage its is often more art than science when identifying and partnering with breakthrough companies. We generally look for companies we believe can take a monopolistic position in their market. In the case of massive markets like finance, they must have unique insight they can exploit to carve out a giant piece of the space. This overarching mindset manifests itself into several criteria we evaluate for new investments. First and foremost, we are looking to partner with founders who are deeply technical, possess incredible drive, and the grit required to power through the ups and downs of a startup. We also have to believe the founder is uniquely positioned to exploit a highly attractive market in terms of competition, size, growth rate and timing. At Eniac all of our partners have built software startups, and like to see teams that have built a product or service, demonstrating an ability to execute. Thank You Last but not least, we’d like to express tremendous gratitude towards our families, friends, limited partners, co-investors, colleagues, mentors and most of all… our portfolio companies. They are the incredible women and men who make the impossible possible, each and every day. We’re just fortunate to be able to play a tiny role in their successes. ", "title": "Announcing Eniac IV, a $100M Seed Fund, and the Eniac Platform", "sentences": [{"3499": "Announcing Eniac IV, a $100M Seed Fund, and the Eniac Platform"}, {"a4b0": "We first started Eniac Ventures in 2010 as an opportunity to leverage our experience as startup founders and operators to help a new generation of founders. Today we are excited to announce Eniac IV, a $100 million vehicle to back bold founders at the institutional seed stage. Our investment focus remains the same, leading seed rounds in bold technical teams with a transformational vision to build the next iconic company. In addition to Eniac IV, we are also announcing our platform, providing the tools and services to our founders that will allow them to focus on execution and finding product market fit."}, {"abc3": "So why $100M fund for seed investments?"}, {"da50": "At Eniac we have always focused on seed rounds. Amongst the four partners, we have founded and grown over a dozen companies, some more successful than others, but all providing valuable lessons that can be leveraged to accelerate the growth of our portfolio companies. When we work with seed stage founders we help in real, meaningful ways. Sometimes our founders tell us it’s like having four additional co-founders on demand."}, {"7b65": "The institutional seed stage asset class has continued to grow in terms of company maturity, investor landscape, and round sizes. It was important for us to raise a fund that will allow us to lead or co-lead seed rounds, continue to support our companies through their growth lifecycle, and give founders the resources to execute."}, {"de67": "Eniac IV is the perfect size to allow us to continue investing at our current pace as lead investors and enables us to accelerate our companies by providing industry-leading services through our platform. But it’s not so big that we can’t continue to invest alongside the other seed investors we love working with."}, {"0569": "Eniac Ventures on TechCrunchTV"}, {"291f": "What is The Eniac Platform?"}, {"cb76": "Our founders tend to come to us very early in the evolution of their product or vision, so we have always been very hands-on. Anything we can offload from them provides more time they can dedicate to finding product-market fit in advance of their Series A. Our new platform is an extension of this layer of support, taking it to the next level by hiring experts and institutionalizing the services. Our portfolio companies can expect the following free services from Eniac:"}, {"caa6": "What sectors are we interested in?"}, {"b83d": "Most of the areas we’re currently excited about can be broadly grouped into two seismic evolutions: the progression towards seamless computing and the ascent of automation. In the future, the way we interact with technology will be drastically different. All the screens people interact with will ultimately disappear and be replaced with more humanistic and natural interfaces. So instead of tapping on a phone screen, you might message with friends using gestures and voice and see their reply in the form of augmented reality. We think of this as a new era of seamless computing and it informs a lot of the investments we’ll make over the next few years."}, {"af91": "Equally important is the march toward automation, which will be driven by improvements in both machine intelligence and the physical manifestation of computing. The percentage of tasks that machines can more efficiently complete than humans will continue to increase at an incredible rate. This creates huge new business opportunities while freeing up humans to focus on more interesting and fulfilling activities."}, {"33df": "Our current view of the technology cycle is depicted in the technology S-curves below that show areas of interest as well as how they manifest themselves into business opportunities over time."}, {"589c": "Robotics"}, {"56ce": "Right now many people only think about robotics in terms of large scale robots building cars or hobby and military drones. However, as artificial intelligence continues to grow exponentially, we will increasingly interact with computing around us through robotics. We are especially interested in the intersection of AI and new robotic technologies that will automate manufacturing, transportation, and other large industries."}, {"1d09": "Augmented Reality/Virtual Reality"}, {"284c": "Soon these technologies will be one of the primary modes in which people interact with and experience the Internet. AR especially has the promise of lifting people’s eyes off phones and towards the world around them while still acting on the information they need. We are investing in the companies that are preparing the world for a VR/AR revolution."}, {"8053": "Conversational User Interfaces"}, {"2713": "Every day we see the way people interact with their devices evolve. From AI-powered bots to natural language processing to gesture tracking technology, the changes are happening all around us. The truth is, interfacing with technology in these ways is more natural and closely mirrors the way people have interacted with one another for thousands of years. We will continue to support founders who build the technology behind these new forms of communications."}, {"4b3e": "Disrupting Mature Industries"}, {"2278": "Technology adoption is often slowest by some of the world’s largest industries. We regularly see billion dollar opportunities from companies using software to disrupt industries like finance, construction, insurance, and healthcare to name a few. We will continue to make bets on companies that can bring innovation and efficiency to the titans of industry."}, {"cd74": "You may notice that we did not call out artificial intelligence directly as one of our sectors. This is because we don’t see AI as a sector, but rather a fundamental titanic shift that cuts across everything we do. Much like “big data” when we started investing in 2010, we expect almost every investment we make to utilize different branches of AI to solve big problems for users and customers."}, {"53df": "How are we picking our next investments?"}, {"2916": "The characteristics that make a great company are well documented, but at the seed stage its is often more art than science when identifying and partnering with breakthrough companies. We generally look for companies we believe can take a monopolistic position in their market. In the case of massive markets like finance, they must have unique insight they can exploit to carve out a giant piece of the space."}, {"c2de": "This overarching mindset manifests itself into several criteria we evaluate for new investments. First and foremost, we are looking to partner with founders who are deeply technical, possess incredible drive, and the grit required to power through the ups and downs of a startup. We also have to believe the founder is uniquely positioned to exploit a highly attractive market in terms of competition, size, growth rate and timing. At Eniac all of our partners have built software startups, and like to see teams that have built a product or service, demonstrating an ability to execute."}, {"6a0b": "Thank You"}, {"5244": "Last but not least, we’d like to express tremendous gratitude towards our families, friends, limited partners, co-investors, colleagues, mentors and most of all… our portfolio companies. They are the incredible women and men who make the impossible possible, each and every day. We’re just fortunate to be able to play a tiny role in their successes."}], "child": "1189_1"}