{"name": "119", "parent": "", "content": "The Game 82 All-Stars Which NBA players shine when no one else cares anymore? The final night of the NBA season is often filled with drama. There are playoff bids to fight for, as the Pacers, Bulls, and Heat will do tonight. There are statistical accomplishments to chase, like when David Thompson and George Gervin put up 73 and 63 in pursuit of the 1978 scoring title. There are legacies to leave, like with Kobe Bryant’s 60-point send-off last year. It’s also filled with a lot of meaningless basketball. Twenty-eight teams play Wednesday night; only seven of them stand to gain anything from winning, and some of those seven will prioritize resting players over potentially improving their playoff seeding. Championship contenders and tanking losers alike just want the season to be over, and they will let their least valuable players soak up minutes to avoid injury to anyone meaningful. Your Last-Night-of-the-Season Tanking PrimerWhat the Lakers, Suns, Sixers, and Kings need to dotheringer.com Whether these no-names play well is besides the point, but some fight valiantly, becoming heroes of battles nobody else cares about. These are the Game 82 All-Stars, players who had the greatest nights of their careers in contests that didn’t matter. Here’s the starting five — and yes, there are four guards; come Game 82, positions no longer matter. Point Guard: Zoran Dragic, Miami Heat, 2015 Zoran is the younger brother of Heat star Goran Dragic. In this picture, Goran has a tiny mustache and Zoran is clean-shaven, but in the video you’ll see later on, Zoran has a tiny mustache while Goran is clean-shaven. Zoran is a decent European player, but his NBA career has been limited to nepotistic favors to his brother. In 2012, Goran’s Rockets gave Zoran a summer league roster spot. In 2014, Goran’s Suns actually signed Zoran, who scored six points in six garbage-time appearances. In 2015, Miami traded for Goran and took Zoran as well. (Luckily, Goran has never convinced an NBA team to sign either of his evil siblings, Woran and Wagoran Dragic.) In his first nine games for the Heat, Zoran failed to score a single point. But Miami’s final game of the 2015 season was one of the strangest in NBA history. The Heat weren’t your stereotypical tanking team, sitting at 36–45. They had the 10th-worst record in the NBA, but they owed a top-10-protected pick to the Sixers — their opponent in the last game of the season. If the Heat lost, they would keep the 10th-worst record in the league, which would give them a high chance of keeping their pick. If the Sixers lost, they could bump the Heat into the 11th-worst record and potentially take their pick. The Heat benched virtually everybody. This was no time to develop young talent: They needed to play their worst guys as much as possible. Four players — Michael Beasley, James Ennis, Tyler Johnson, and Henry Walker — played all 48 minutes. Zoran Dragic, who never played more than five minutes in any of his other NBA appearances, got the start and played for more than 40 minutes. The only time Erik Spoelstra made a substitution was when he put in Udonis Haslem for Dragic with a bit more than seven minutes to go in the second quarter. Yung Dragic had the game of his life as Ol’ Dragic smiled from the bench. Ignoring Miami’s need to lose, Zoran had back-to-back-to-back layups in the fourth quarter to turn a tie game into a six-point Heat lead. The Heat won, thanks to 34 points from Beasley. Honestly, Beasley is the Game 82 MVP: Two of the top-five scoring performances in his 500-plus-game career have been in the final game of his team’s season. Despite the win, Miami stayed in the 10th spot since the team with the 11th-worst record, the Nets, also won. They held onto their draft pick, selecting Justise Winslow. Everything turned out well, except for Zoran. He was traded to the Celtics in the offseason — Goran expressed mild disappointment — and was quickly cut. Until Goran can get Zoran another contract, this game accounts for almost all of Zoran’s NBA statistics: 41 of his 75 career minutes, 22 of his 28 points, and his only three 3s. Shooting Guard: Eddie House, Miami Heat, 2011 House once played in the actual final game of an NBA season, helping the Celtics win the 2008 championship thanks to his 3-point shooting and hustle. In 2010, House took what talents he had left to South Beach, but this championship contender didn’t really need shooting help; they already had James Jones and Mike Miller. House was like them, but shorter and worse at shooting. In Game 82, against the Raptors, all three of the Big Three took the night off, giving House his first start in three years. He put up 18 in the first quarter and drilled seven 3s on the night: House played 717 regular-season games in his career. In this game, he played more minutes, took more shots, and scored more points — 35! — than in any of the previous 716. He did not set a career high in assists, though; he had only one. Game 82 is not about passing. House played sparingly in the playoffs and had knee surgery before the beginning of the next season. After a career as a role player, his final game gave him the opportunity to be a star. Even More Shooting Guard: Jabari Brown, Los Angeles Lakers, 2015 Every single guard on the Lakers got injured in 2014–15. By the season finale, they were missing Kobe, Steve Nash, Nick Young, Jeremy Lin, Jordan Clarkson, Ronnie Price, and Wayne Ellington. With eight games to go, the team signed point guard Dwight Buycks for late-season depth; he somehow broke his hand before the year ended. The Lakers were allowed to sign an 18th player so they could finish the season. In the final game of the year, against the Kings, they played two guards for 48 minutes. One was Vander Blue, who was playing in his fifth — and to date, final — NBA game. The other was Jabari Brown, who’d led the SEC in scoring for Mizzou in 2014 and dropped 50 and 48 in games for the Lakers’ D-League team, the Los Angeles D-Fenders. He went off. Brown scored 32 points that night, 14 percent of his career total. There isn’t much room in the NBA for players like Brown. He’s a ball-dominant scorer, and every NBA team has a better scorer than him. He’s spent most of the two years since this game bouncing between China and the D-League. He might finish his career with 19 NBA games, and he scored 19 points in a quarter in one of them. Points Forward: Jordan McRae, Who Is Also Definitely Not a Forward, Cleveland Cavaliers, 2016, The Cavaliers had the top seed in the Eastern Conference locked up well in advance of the last game last year, and their objectives in that game were clear: Play meaningful players as few minutes as possible. LeBron James and Kyrie Irving sat; Tristan Thompson, who at the time had never missed a game in his NBA career, started, committed an intentional foul four seconds after tip-off, and then sat. Before the game against the Pistons, they signed Dahntay Jones, who hadn’t played a game all year and had no remaining basketball skills besides “punching players in the junk,” and the team let him play 42 minutes. But McRae didn’t care. He’s a damn scorer, as he proved when he set a D-League record with 61 points in a game. If you give him a uniform, he will get buckets. Cleveland was down five with about a minute to go, but McRae would not let them lose a game they could afford to lose. He scored seven points in the final 75 seconds and hit a game-tying 3 to force overtime. On a night when minutes were a bigger enemy than the opposition, this dude added five more. He finished with 36 points after having scored just 26 in his first 14 games with the Cavs. This year, though, Cleveland is playing it safe. They cut McRae in March despite a pair of 20-point outings during the season and again just signed Jones, who didn’t play any of the first 81 games of this year either. McRae haunts Irving’s dreams, and probably gets buckets there too. Center: Earl Barron, New York Knicks, 2013 The Knicks were once good. It wasn’t even that long ago! In 2012–13, they won 54 games, second-best in the Eastern Conference. To let Carmelo Anthony and Amar’e Stoudemire rest in Game 82, against the Hawks, they signed Quentin Richardson, who had spent some years with the Knicks half a decade earlier, and journeyman center Earl Barron. Richardson, who hadn’t played in months and would never play in the NBA again, was rusty, going 1-for-11 from the field. But Barron had a career-high 18 rebounds. I distinctly remember his halftime interview: He was completely winded, suddenly forced into heavy action after months with none at all, and he couldn’t stop smiling. This was his only game of the year with the Knicks, so technically you can say that Barron’s 18.0 rebounds-per-game average was the best season since Dennis Rodman had 18.3 in 1992–93. Barron and Chris Copeland, who scored a career-high 33, carried the Knicks to a win. Laugh, but this game is one of my few purely happy memories as a Knicks fan. There was no stress. Everybody giggled as no-names — and, for some reason, Quentin Richardson — put on Knicks uniforms and won. Nobody knew how depressing it would be when they lost in the postseason a few weeks later. If your favorite team plays tonight, you would be fine ignoring it: Game 82 has no bearing on your team’s present-day success, and many of the players will never play on your team — or in this league — again. But that’s what makes it beautiful: The last game of the season is meaningless — except to the people playing it, some of whom may never get another chance to ball out. ", "title": "The Game 82 All-Stars", "sentences": [{"6c00": "The Game 82 All-Stars"}, {"4536": "Which NBA players shine when no one else cares anymore?"}, {"2c42": "The final night of the NBA season is often filled with drama. There are playoff bids to fight for, as the Pacers, Bulls, and Heat will do tonight. There are statistical accomplishments to chase, like when David Thompson and George Gervin put up 73 and 63 in pursuit of the 1978 scoring title. There are legacies to leave, like with Kobe Bryant’s 60-point send-off last year."}, {"3fc0": "It’s also filled with a lot of meaningless basketball. Twenty-eight teams play Wednesday night; only seven of them stand to gain anything from winning, and some of those seven will prioritize resting players over potentially improving their playoff seeding. Championship contenders and tanking losers alike just want the season to be over, and they will let their least valuable players soak up minutes to avoid injury to anyone meaningful."}, {"a330": "Your Last-Night-of-the-Season Tanking PrimerWhat the Lakers, Suns, Sixers, and Kings need to dotheringer.com"}, {"6d65": "Whether these no-names play well is besides the point, but some fight valiantly, becoming heroes of battles nobody else cares about. These are the Game 82 All-Stars, players who had the greatest nights of their careers in contests that didn’t matter. Here’s the starting five — and yes, there are four guards; come Game 82, positions no longer matter."}, {"dc59": "Point Guard: Zoran Dragic, Miami Heat, 2015"}, {"7ebf": "Zoran is the younger brother of Heat star Goran Dragic. In this picture, Goran has a tiny mustache and Zoran is clean-shaven, but in the video you’ll see later on, Zoran has a tiny mustache while Goran is clean-shaven."}, {"3f4b": "Zoran is a decent European player, but his NBA career has been limited to nepotistic favors to his brother. In 2012, Goran’s Rockets gave Zoran a summer league roster spot. In 2014, Goran’s Suns actually signed Zoran, who scored six points in six garbage-time appearances. In 2015, Miami traded for Goran and took Zoran as well. (Luckily, Goran has never convinced an NBA team to sign either of his evil siblings, Woran and Wagoran Dragic.)"}, {"6387": "In his first nine games for the Heat, Zoran failed to score a single point. But Miami’s final game of the 2015 season was one of the strangest in NBA history."}, {"63aa": "The Heat weren’t your stereotypical tanking team, sitting at 36–45. They had the 10th-worst record in the NBA, but they owed a top-10-protected pick to the Sixers — their opponent in the last game of the season. If the Heat lost, they would keep the 10th-worst record in the league, which would give them a high chance of keeping their pick. If the Sixers lost, they could bump the Heat into the 11th-worst record and potentially take their pick."}, {"cfe5": "The Heat benched virtually everybody. This was no time to develop young talent: They needed to play their worst guys as much as possible. Four players — Michael Beasley, James Ennis, Tyler Johnson, and Henry Walker — played all 48 minutes. Zoran Dragic, who never played more than five minutes in any of his other NBA appearances, got the start and played for more than 40 minutes. The only time Erik Spoelstra made a substitution was when he put in Udonis Haslem for Dragic with a bit more than seven minutes to go in the second quarter."}, {"ca8a": "Yung Dragic had the game of his life as Ol’ Dragic smiled from the bench. Ignoring Miami’s need to lose, Zoran had back-to-back-to-back layups in the fourth quarter to turn a tie game into a six-point Heat lead."}, {"12f4": "The Heat won, thanks to 34 points from Beasley. Honestly, Beasley is the Game 82 MVP: Two of the top-five scoring performances in his 500-plus-game career have been in the final game of his team’s season."}, {"bdcf": "Despite the win, Miami stayed in the 10th spot since the team with the 11th-worst record, the Nets, also won. They held onto their draft pick, selecting Justise Winslow. Everything turned out well, except for Zoran. He was traded to the Celtics in the offseason — Goran expressed mild disappointment — and was quickly cut. Until Goran can get Zoran another contract, this game accounts for almost all of Zoran’s NBA statistics: 41 of his 75 career minutes, 22 of his 28 points, and his only three 3s."}, {"b490": "Shooting Guard: Eddie House, Miami Heat, 2011"}, {"77fc": "House once played in the actual final game of an NBA season, helping the Celtics win the 2008 championship thanks to his 3-point shooting and hustle. In 2010, House took what talents he had left to South Beach, but this championship contender didn’t really need shooting help; they already had James Jones and Mike Miller. House was like them, but shorter and worse at shooting. In Game 82, against the Raptors, all three of the Big Three took the night off, giving House his first start in three years."}, {"1405": "He put up 18 in the first quarter and drilled seven 3s on the night:"}, {"2bdd": "House played 717 regular-season games in his career. In this game, he played more minutes, took more shots, and scored more points — 35! — than in any of the previous 716. He did not set a career high in assists, though; he had only one. Game 82 is not about passing."}, {"299e": "House played sparingly in the playoffs and had knee surgery before the beginning of the next season. After a career as a role player, his final game gave him the opportunity to be a star."}, {"c2ab": "Even More Shooting Guard: Jabari Brown, Los Angeles Lakers, 2015"}, {"9752": "Every single guard on the Lakers got injured in 2014–15. By the season finale, they were missing Kobe, Steve Nash, Nick Young, Jeremy Lin, Jordan Clarkson, Ronnie Price, and Wayne Ellington. With eight games to go, the team signed point guard Dwight Buycks for late-season depth; he somehow broke his hand before the year ended. The Lakers were allowed to sign an 18th player so they could finish the season."}, {"1e1d": "In the final game of the year, against the Kings, they played two guards for 48 minutes. One was Vander Blue, who was playing in his fifth — and to date, final — NBA game. The other was Jabari Brown, who’d led the SEC in scoring for Mizzou in 2014 and dropped 50 and 48 in games for the Lakers’ D-League team, the Los Angeles D-Fenders."}, {"13f9": "He went off."}, {"efbb": "Brown scored 32 points that night, 14 percent of his career total."}, {"c5c3": "There isn’t much room in the NBA for players like Brown. He’s a ball-dominant scorer, and every NBA team has a better scorer than him. He’s spent most of the two years since this game bouncing between China and the D-League. He might finish his career with 19 NBA games, and he scored 19 points in a quarter in one of them."}, {"c0c9": "Points Forward: Jordan McRae, Who Is Also Definitely Not a Forward, Cleveland Cavaliers, 2016,"}, {"5666": "The Cavaliers had the top seed in the Eastern Conference locked up well in advance of the last game last year, and their objectives in that game were clear: Play meaningful players as few minutes as possible. LeBron James and Kyrie Irving sat; Tristan Thompson, who at the time had never missed a game in his NBA career, started, committed an intentional foul four seconds after tip-off, and then sat. Before the game against the Pistons, they signed Dahntay Jones, who hadn’t played a game all year and had no remaining basketball skills besides “punching players in the junk,” and the team let him play 42 minutes."}, {"91db": "But McRae didn’t care. He’s a damn scorer, as he proved when he set a D-League record with 61 points in a game. If you give him a uniform, he will get buckets."}, {"da86": "Cleveland was down five with about a minute to go, but McRae would not let them lose a game they could afford to lose. He scored seven points in the final 75 seconds and hit a game-tying 3 to force overtime. On a night when minutes were a bigger enemy than the opposition, this dude added five more."}, {"825e": "He finished with 36 points after having scored just 26 in his first 14 games with the Cavs."}, {"e35c": "This year, though, Cleveland is playing it safe. They cut McRae in March despite a pair of 20-point outings during the season and again just signed Jones, who didn’t play any of the first 81 games of this year either. McRae haunts Irving’s dreams, and probably gets buckets there too."}, {"a538": "Center: Earl Barron, New York Knicks, 2013"}, {"0b62": "The Knicks were once good. It wasn’t even that long ago! In 2012–13, they won 54 games, second-best in the Eastern Conference. To let Carmelo Anthony and Amar’e Stoudemire rest in Game 82, against the Hawks, they signed Quentin Richardson, who had spent some years with the Knicks half a decade earlier, and journeyman center Earl Barron."}, {"1aa8": "Richardson, who hadn’t played in months and would never play in the NBA again, was rusty, going 1-for-11 from the field. But Barron had a career-high 18 rebounds. I distinctly remember his halftime interview: He was completely winded, suddenly forced into heavy action after months with none at all, and he couldn’t stop smiling."}, {"616a": "This was his only game of the year with the Knicks, so technically you can say that Barron’s 18.0 rebounds-per-game average was the best season since Dennis Rodman had 18.3 in 1992–93. Barron and Chris Copeland, who scored a career-high 33, carried the Knicks to a win."}, {"d89a": "Laugh, but this game is one of my few purely happy memories as a Knicks fan. There was no stress. Everybody giggled as no-names — and, for some reason, Quentin Richardson — put on Knicks uniforms and won. Nobody knew how depressing it would be when they lost in the postseason a few weeks later."}, {"6ace": "If your favorite team plays tonight, you would be fine ignoring it: Game 82 has no bearing on your team’s present-day success, and many of the players will never play on your team — or in this league — again. But that’s what makes it beautiful: The last game of the season is meaningless — except to the people playing it, some of whom may never get another chance to ball out."}], "child": "119_1\t119_2\t119_3\t119_4"}