{"name": "1190", "parent": "", "content": "Blessed are the “Boring,” for they Create the Billion Dollar Startups Micah Rosenbloom, Managing Partner “I need to find a industry or product I’m passionate about.” I often hear this from entrepreneurs and it frequently means wanting to start a business in a consumer space that they love—music or gaming, for example. It’s an understandable impulse. If you’re going to start a business that will consume your life for years, why not make it something you’re interested in? There are three major challenges to pursuing passion projects: Endless competition: Many consumer industries are hard to broach and are subject to intense competition from dozens, even hundreds of people who share the same passion. Passion != Competence: One has to separate things they’d love to use or buy from the types of businesses they would be well suited to start. I love music personally, but I would be terrible at running a business in that space. How do you define passion?: “Hip” businesses often have humble beginnings. An app to dispatch black car services didn’t sound sexy until Uber came around. It is the new perspective an entrepreneur brings that makes a “boring” category cool. Instead of chasing passions, think about how you can become passionate about the way you work. There are some impressive models to follow. Waste Management Photo Credit: Fool.com Wayne Huizenga was the grandson of a garbage truck driver and in 1968 he purchased a single truck to carry on the family business. By 1983 Waste Management was the largest waste management company in the world. Today, the company he built has a $23 billion dollar market cap. I doubt Huizenga was passionate about dumpsters, but he does seem to love the process of building companies. He specifically seemed to enjoy growing a mom & pop shop into a globe-spanning chain. Using the tricks learned at Waste Management Huizenga bought up a handful of video rental chains and turned it into BlockBuster Video. The retail giant is is now a punchline, yet at its peak was worth $5 billion dollars. He followed that up by developing Extended Stay America, a chain of nondescript hotels for long-term business travelers. Now, that business is worth over $2 billion dollars. Moving trash, collecting late fees, and building hotel rooms for recent divorcées aren’t things that get most entrepreneurs excited, but Huizenga used them as a vehicle for his seemingly insatiable appetite for scaling startups. Invisalign Orthodontia is not a sexy business. Underbites, expressive spreading, and abnormal eruptions are, in a word, gross. But that didn’t stop Invisalign founder Kelsey Wirth. She pioneered the use of 3-D printers to create transparent braces that fix smiles. Wirth studied American History and Literature in college. Nothing in her bio suggests a deep love for incisors, yet the intellectual challenge of uniting a massively underserved market and a magical technology was irresistible. Today, the company is valued at ~$5 billion dollars. Today, Wirth uses the resources gained and honed building a dental business to passionately campaign against global warming. MailChimp MailChimp co-founder Ben Chestnut ran a small web design shop in Atlanta and was faced with a client list that needed help with email marketing. He hated those commissions, but loved the steady paychecks that subsidized more creative work, so his team developed software to automate the process. Over time, the MailChimp product took on a life of it’s own. The company figured out how to make HTML formatting accessible to everyone and its back-end engineers learned how to evade the stingiest of spam filters. Today, the company remains privately held, employs over 500 has a $400M run rate and has metrics that either meet or exceed those of Constant Contact, a competitor that was recently acquired for over a billion dollars. Moreover, Chestnut has used the profits generated to become the entrepreneurial anchor of Atlanta’s creative resurgence. Their product is intrinsically no more interesting than tax prep software, but the creative culture at the company appears to rival Etsy, Snap, and other startups that are usually cited by the “passionate” crowd. I don’t imagine these founders aspired to start businesses in video rental, orthodonture, or email deliverability as kids. The point is that passion can be found in a lot of places. We meet passionate entrepreneurs every day in categories like long haul trucking, mattress sales, and insoles. Innovative ideas can be found in any industry and a bit of critical detachment from a specific industry or product can be a good thing. Be passionate about your company and loyal to your team, but remember markets and product lines shift. Passion and enthusiasm can come from a love of find opportunities and executing on them, even if it’s garbage hauling or fixing teeth. By all means, if you’re Reed Hastings 2.0, start the next Netflix, but don’t let a label like “boring” be the thing that stops you from starting a billion dollar business in a “blah” market. ", "title": "Blessed are the “Boring,” for they Create the Billion Dollar Startups", "sentences": [{"d669": "Blessed are the “Boring,” for they Create the Billion Dollar Startups"}, {"6c20": "Micah Rosenbloom, Managing Partner"}, {"5ba9": "“I need to find a industry or product I’m passionate about.”"}, {"885b": "I often hear this from entrepreneurs and it frequently means wanting to start a business in a consumer space that they love—music or gaming, for example. It’s an understandable impulse. If you’re going to start a business that will consume your life for years, why not make it something you’re interested in? There are three major challenges to pursuing passion projects:"}, {"2cd9": "Endless competition: Many consumer industries are hard to broach and are subject to intense competition from dozens, even hundreds of people who share the same passion."}, {"1aaa": "Passion != Competence: One has to separate things they’d love to use or buy from the types of businesses they would be well suited to start. I love music personally, but I would be terrible at running a business in that space."}, {"16d6": "How do you define passion?: “Hip” businesses often have humble beginnings. An app to dispatch black car services didn’t sound sexy until Uber came around. It is the new perspective an entrepreneur brings that makes a “boring” category cool."}, {"b0c3": "Instead of chasing passions, think about how you can become passionate about the way you work. There are some impressive models to follow."}, {"5428": "Waste Management"}, {"790e": "Photo Credit: Fool.com"}, {"e8cb": "Wayne Huizenga was the grandson of a garbage truck driver and in 1968 he purchased a single truck to carry on the family business. By 1983 Waste Management was the largest waste management company in the world. Today, the company he built has a $23 billion dollar market cap."}, {"daf1": "I doubt Huizenga was passionate about dumpsters, but he does seem to love the process of building companies. He specifically seemed to enjoy growing a mom & pop shop into a globe-spanning chain."}, {"f147": "Using the tricks learned at Waste Management Huizenga bought up a handful of video rental chains and turned it into BlockBuster Video. The retail giant is is now a punchline, yet at its peak was worth $5 billion dollars."}, {"86ef": "He followed that up by developing Extended Stay America, a chain of nondescript hotels for long-term business travelers. Now, that business is worth over $2 billion dollars."}, {"54a5": "Moving trash, collecting late fees, and building hotel rooms for recent divorcées aren’t things that get most entrepreneurs excited, but Huizenga used them as a vehicle for his seemingly insatiable appetite for scaling startups."}, {"1a34": "Invisalign"}, {"8aae": "Orthodontia is not a sexy business. Underbites, expressive spreading, and abnormal eruptions are, in a word, gross. But that didn’t stop Invisalign founder Kelsey Wirth. She pioneered the use of 3-D printers to create transparent braces that fix smiles."}, {"5de2": "Wirth studied American History and Literature in college. Nothing in her bio suggests a deep love for incisors, yet the intellectual challenge of uniting a massively underserved market and a magical technology was irresistible."}, {"15fc": "Today, the company is valued at ~$5 billion dollars. Today, Wirth uses the resources gained and honed building a dental business to passionately campaign against global warming."}, {"b633": "MailChimp"}, {"0fb4": "MailChimp co-founder Ben Chestnut ran a small web design shop in Atlanta and was faced with a client list that needed help with email marketing. He hated those commissions, but loved the steady paychecks that subsidized more creative work, so his team developed software to automate the process."}, {"fca6": "Over time, the MailChimp product took on a life of it’s own. The company figured out how to make HTML formatting accessible to everyone and its back-end engineers learned how to evade the stingiest of spam filters."}, {"a9f3": "Today, the company remains privately held, employs over 500 has a $400M run rate and has metrics that either meet or exceed those of Constant Contact, a competitor that was recently acquired for over a billion dollars."}, {"3bb1": "Moreover, Chestnut has used the profits generated to become the entrepreneurial anchor of Atlanta’s creative resurgence. Their product is intrinsically no more interesting than tax prep software, but the creative culture at the company appears to rival Etsy, Snap, and other startups that are usually cited by the “passionate” crowd."}, {"9769": "I don’t imagine these founders aspired to start businesses in video rental, orthodonture, or email deliverability as kids. The point is that passion can be found in a lot of places. We meet passionate entrepreneurs every day in categories like long haul trucking, mattress sales, and insoles. Innovative ideas can be found in any industry and a bit of critical detachment from a specific industry or product can be a good thing."}, {"7051": "Be passionate about your company and loyal to your team, but remember markets and product lines shift. Passion and enthusiasm can come from a love of find opportunities and executing on them, even if it’s garbage hauling or fixing teeth. By all means, if you’re Reed Hastings 2.0, start the next Netflix, but don’t let a label like “boring” be the thing that stops you from starting a billion dollar business in a “blah” market."}], "child": "1190_1\t1190_2\t1190_3\t1190_4"}