{"name": "1191", "parent": "", "content": "Seed Fundraising — How to Handle an Angel Investor Meeting Investor meetings are where rounds are raised. You may have great product, team and traction but you have to perform in the meeting to get a check. Here’s how to handle the angel investor meeting: Preparation Background Research — Investors will respond with more enthusiasm if you direct the conversation towards their interests. Look up the investor’s LinkedIn or bio, their investment portfolio and any writing they’ve done. You should also look for mutual friends to give them easy background references, for example “I see you know Cynthia, we used to work together at Google”. Prepare Questions — It’s important investors know you see them as more than just capital. Use your research to prepare questions to ask the investor — focusing on their process and value-adds. For example: “What was your approach to close sales in the early days at Acme Corp.?”, “How many investments do you make a year?”. The Pitch Preamble — Investors want to know you’re personable, as this influences HR and fundraising. Start with your prepared research on mutual friends and their background, e.g. “I saw you were a VP at Salesforce, what made you decide to invest in startups?”. If they ask you questions, be willing to tell a little of you and your team’s personal story. The Team is the top priority for most Angels. Pitch the Situation — The investor needs to understand why your business is special. If you meet at a quiet office with a big screen, take the opportunity to do your well-practiced pitch deck. If you’re at a coffee shop, pitch the key differentiators and try to move to something visual, like a demo or video, to offset the background noise. If it’s a walking meeting, emphasize the 1 or 2 key points, ideally with use cases, e.g. “A lot of our customers have an immediate need, our 1 minute setup usually wins the deal”. Q&A Their Questions — Investors will have questions to complete their knowledge of the business and test your understanding. Answer questions directly to satisfy the investor’s curiosity. If the questions are quick-fire, take the opportunity to demonstrate your knowledge without getting defensive. If the investor gives you more time, provide more background, ideally emphasizing your passion and the scale of the opportunity. For example: “Q: How is growth? A: Average over the last 6 months is 20% per month, we can maintain that rate for another year through our current channels”. Your Ask — Absent a forcing function, most angel investors will want to wait until your company has momentum before they invest. At the end of the meeting you should politely but directly ask “Would you be interested in investing in this round?”. If they are, they’ll want a few days to think and perhaps ask questions. Be sure to ask their usual check size and if they want to hold the space while they decide. These reservations reduce availability in the round, generating the momentum you need. Next steps — Angel investors want to be excited by potential investments. You can create this by following up with responses to their diligence requests ASAP. After that, follow up every 1–3 days with good news about the round or the company. For example: Hi Jane, Wanted to quickly share some great news, the team closed Hooli today and the contract should be signed next week. Let me know if you have any questions or if you’ve come to a decision? ThanksAsh Strong performance in investor meetings will be a requirement for any successful fundraising round. Use these suggestions to make sure you’re prepared to generate interest from angel investors. This article is part of a series on Seed Fundraising:1. How to Get a Meeting2. How to Build a Deck3. How to Handle an Angel Investor Meeting Thanks to Kaego Rust and Sean Byrnes for reading drafts of this. ", "title": "Seed Fundraising — How to Handle an Angel Investor Meeting", "sentences": [{"b5cb": "Seed Fundraising — How to Handle an Angel Investor Meeting"}, {"a096": "Investor meetings are where rounds are raised. You may have great product, team and traction but you have to perform in the meeting to get a check. Here’s how to handle the angel investor meeting:"}, {"961e": "Preparation"}, {"d664": "Background Research — Investors will respond with more enthusiasm if you direct the conversation towards their interests. Look up the investor’s LinkedIn or bio, their investment portfolio and any writing they’ve done. You should also look for mutual friends to give them easy background references, for example “I see you know Cynthia, we used to work together at Google”."}, {"9dc4": "Prepare Questions — It’s important investors know you see them as more than just capital. Use your research to prepare questions to ask the investor — focusing on their process and value-adds. For example: “What was your approach to close sales in the early days at Acme Corp.?”, “How many investments do you make a year?”."}, {"53fb": "The Pitch"}, {"883b": "Preamble — Investors want to know you’re personable, as this influences HR and fundraising. Start with your prepared research on mutual friends and their background, e.g. “I saw you were a VP at Salesforce, what made you decide to invest in startups?”. If they ask you questions, be willing to tell a little of you and your team’s personal story. The Team is the top priority for most Angels."}, {"efe9": "Pitch the Situation — The investor needs to understand why your business is special. If you meet at a quiet office with a big screen, take the opportunity to do your well-practiced pitch deck. If you’re at a coffee shop, pitch the key differentiators and try to move to something visual, like a demo or video, to offset the background noise. If it’s a walking meeting, emphasize the 1 or 2 key points, ideally with use cases, e.g. “A lot of our customers have an immediate need, our 1 minute setup usually wins the deal”."}, {"642e": "Q&A"}, {"81be": "Their Questions — Investors will have questions to complete their knowledge of the business and test your understanding. Answer questions directly to satisfy the investor’s curiosity. If the questions are quick-fire, take the opportunity to demonstrate your knowledge without getting defensive. If the investor gives you more time, provide more background, ideally emphasizing your passion and the scale of the opportunity. For example: “Q: How is growth? A: Average over the last 6 months is 20% per month, we can maintain that rate for another year through our current channels”."}, {"bb23": "Your Ask — Absent a forcing function, most angel investors will want to wait until your company has momentum before they invest. At the end of the meeting you should politely but directly ask “Would you be interested in investing in this round?”. If they are, they’ll want a few days to think and perhaps ask questions. Be sure to ask their usual check size and if they want to hold the space while they decide. These reservations reduce availability in the round, generating the momentum you need."}, {"aeca": "Next steps — Angel investors want to be excited by potential investments. You can create this by following up with responses to their diligence requests ASAP. After that, follow up every 1–3 days with good news about the round or the company. For example:"}, {"1738": "Hi Jane,"}, {"9194": "Wanted to quickly share some great news, the team closed Hooli today and the contract should be signed next week. Let me know if you have any questions or if you’ve come to a decision?"}, {"456b": "ThanksAsh"}, {"bf1e": "Strong performance in investor meetings will be a requirement for any successful fundraising round. Use these suggestions to make sure you’re prepared to generate interest from angel investors."}, {"12d3": "This article is part of a series on Seed Fundraising:1. How to Get a Meeting2. How to Build a Deck3. How to Handle an Angel Investor Meeting"}, {"acaa": "Thanks to Kaego Rust and Sean Byrnes for reading drafts of this."}], "child": "1191_1\t1191_21191_1\t1191_21191_1\t1191_2"}