{"name": "1192", "parent": "", "content": "Three Years In: $1B of Enterprise Value by Anu Duggal Female Founders Fund launched in 2014 with a very specific investment thesis - to invest in early-stage female-founded technology companies. Fast forward to today, the fund has twenty five active portfolio companies with female founders based between NYC, SF, and LA. As we celebrate three years of investing in entrepreneurial women and their ideas, it’s a good time to reflect on our journey thus far and our plans for the next phase of growth. Reflections from Fund I My thesis in starting Female Founders Fund was that the time had come for an exciting new wave of technology companies created by female founders with unique insights into consumer problems and opportunities. More and more women with experience at large technology ventures were leaving to apply their skill sets to new start-ups, but this was a demographic that was being largely ignored by the broader venture world. The goal was to build a firm at the center of this ecosystem, offering not just capital but a broader network of accessible operators, investors, and continuous support. We have focused on exceeding expectations as helpful investors with the ability to connect our founders to some of the most well-respected VC’s and successful female operators across the country. The broader vision for the fund was to replicate what the traditional venture industry has been doing for years: supporting each other as investors and entrepreneurs through a deep network. Getting Started Raising a fund focused on investing in female founders was a relatively new concept in 2013. Potential investors had questions around market size (were there enough great female founders to back?), venture-sized exit potential (proof points) and deal flow. We were lucky enough in Fund I to work with a fantastic group of LPs who believed in the vision - experienced female operators like the founders of Gilt, BirchBox, and StitchFix, and investors like Josh Kopelman, Brad Feld, Albert Wenger and David Bonderman. These LPs have been invaluable resources over the course of the past three years. Today, we’re proud to announce that our Fund I portfolio of 25 companies has built over $1B of enterprise value and raised over $400M of venture capital funding. In total, these companies led by female founders employ over 600 people in New York, San Francisco & Los Angeles. Our portfolio is comprised of primarily seed investments (84%) with a few opportunistic investments at later stages (16%). Of these investments, 80% have gone on to raise follow-on financing, of which 50% are past a Series A round, 25% are past a Series B, and 10% who have raised a Series C or greater. We’ve been fortunate to partner not just with incredible founders, but also great fund partners like Lightspeed, First Round, Andreessen Horowitz, General Catalyst, IVP, and more. These funds have led rounds and helped these companies scale and build real value. Our founders are in the top 1% of tech entrepreneurs in the country. In addition to building supportive environments and strong workplace cultures for their employees, they are solving compelling problems and creating opportunities around their areas of passion. Their businesses have touched over five million customers across the United States and abroad, ranging from college students looking for part-time work, to pregnant mothers looking for medical advice via video appointments. Some examples: Tala has issued one million loans totaling over $70M of credit in emerging markets — to first time borrowers who have previously had no access to capital. WayUp has enabled over three million college students to access part-time work opportunities and gain entry into the job market throughout and beyond their college years. Eloquii has opened up the world of fast fashion to the size 14+ market for the first time. Maven revolutionized the healthcare industry by offering women real-time video appointments with licensed nurse practitioners and psychologists; it even offers counseling to expectant mothers so they can make plans for their baby’s arrival and stay in the workforce. As a firm, we are founder-focused and have invested in areas that span across fintech, digital health, marketplaces, enterprise SaaS, vertical commerce and more. Over the last three years, we have seen a massive increase in both the breadth and depth of industries being disrupted by women, in areas like virtual reality, AI and other emerging technologies. True to the original thesis, many of the women we have backed came from the largest technology companies in the world and have taken these skill sets and applied them to solving problems and creating opportunities that they see in the workplace or as consumers. On deal flow: year after year, we have seen exponential growth in the number of technology companies being started by women, as well as the quality of founders. In 2017, at the fund level, deal flow will have increased 10X from 2014, and we expect that to continue to grow. Raising that next stage of institutional funding is incredibly important for the viability of a start-up. To track this, we launched an annual study in 2014 on the state of affairs for female founders raising institutional capital. This study is the first of its kind and has since been widely cited by the press. For the venture industry, there is good news: on an annual basis, we are seeing a steady increase in the numbers of women raising Series A and B rounds, specifically in NYC. Sutian Dong, Anu Duggal, Casey Taylor by Dani Fresh Our Team To do what we do, our team is small. Last year I was incredibly lucky to be joined by a second partner, Sutian Dong, formerly of FirstMark Capital. In the NYC ecosystem, Sutian is one of the few women who has spent more than five years at a top-tier venture fund and has brought with her a host of relationships. As a co-founder of Women in VC, she has built a community of over 300 women working in venture in the NYC, Bay Area, and LA communities. Casey Taylor joined our team officially last year to manage our community and platform initiatives. By running over 40 events a year and growing our F3 Mentor Network, we are proud to be providing more post-investment support to our founders than ever before. Observations There’s no doubt that we still have a long way to go to increase diversity in venture and technology. We have seen too many stories of bro-culture-gone-awry to ignore the rampant sexism in our industry. However, there have been positive developments in the last three years, including an increase in female partners and female VC activity - Jess Lee at Sequoia, Cyan Banister at Founders Fund, Sarah Tavel at Greylock, Kara Nortman at Upfront, and Jenny Lefcourt at Freestyle - all help these funds gain access to new and different deal flow channels. Female investors have also started venture funds, becoming founding GPs themselves - Aileen Lee at Cowboy, Theresia Gouw and Jennifer Fonstad at Aspect Ventures, and Kirsten Green at Forerunner. Overall, there are more women working in venture capital than ever before, both at the analyst/associate and partner levels. These women come with their own pipeline and deal flow channels, adding diversity to the more traditional VC firms. We’re excited to be at the forefront of a sea change in capitalizing on the real, tangible, and meaningful opportunities in investing in women. We remain very optimistic that investing in women will yield great returns for our LPs and prove to the industry that there is a lucrative opportunity in our thesis. ", "title": "Three Years In: $1B of Enterprise Value", "sentences": [{"e099": "Three Years In: $1B of Enterprise Value"}, {"96c4": "by Anu Duggal"}, {"0a90": "Female Founders Fund launched in 2014 with a very specific investment thesis - to invest in early-stage female-founded technology companies. Fast forward to today, the fund has twenty five active portfolio companies with female founders based between NYC, SF, and LA. As we celebrate three years of investing in entrepreneurial women and their ideas, it’s a good time to reflect on our journey thus far and our plans for the next phase of growth."}, {"a05c": "Reflections from Fund I"}, {"2fda": "My thesis in starting Female Founders Fund was that the time had come for an exciting new wave of technology companies created by female founders with unique insights into consumer problems and opportunities. More and more women with experience at large technology ventures were leaving to apply their skill sets to new start-ups, but this was a demographic that was being largely ignored by the broader venture world. The goal was to build a firm at the center of this ecosystem, offering not just capital but a broader network of accessible operators, investors, and continuous support. We have focused on exceeding expectations as helpful investors with the ability to connect our founders to some of the most well-respected VC’s and successful female operators across the country. The broader vision for the fund was to replicate what the traditional venture industry has been doing for years: supporting each other as investors and entrepreneurs through a deep network."}, {"43e9": "Getting Started"}, {"0831": "Raising a fund focused on investing in female founders was a relatively new concept in 2013. Potential investors had questions around market size (were there enough great female founders to back?), venture-sized exit potential (proof points) and deal flow. We were lucky enough in Fund I to work with a fantastic group of LPs who believed in the vision - experienced female operators like the founders of Gilt, BirchBox, and StitchFix, and investors like Josh Kopelman, Brad Feld, Albert Wenger and David Bonderman. These LPs have been invaluable resources over the course of the past three years."}, {"13f6": "Today, we’re proud to announce that our Fund I portfolio of 25 companies has built over $1B of enterprise value and raised over $400M of venture capital funding. In total, these companies led by female founders employ over 600 people in New York, San Francisco & Los Angeles. Our portfolio is comprised of primarily seed investments (84%) with a few opportunistic investments at later stages (16%). Of these investments, 80% have gone on to raise follow-on financing, of which 50% are past a Series A round, 25% are past a Series B, and 10% who have raised a Series C or greater. We’ve been fortunate to partner not just with incredible founders, but also great fund partners like Lightspeed, First Round, Andreessen Horowitz, General Catalyst, IVP, and more. These funds have led rounds and helped these companies scale and build real value."}, {"ecda": "Our founders are in the top 1% of tech entrepreneurs in the country. In addition to building supportive environments and strong workplace cultures for their employees, they are solving compelling problems and creating opportunities around their areas of passion. Their businesses have touched over five million customers across the United States and abroad, ranging from college students looking for part-time work, to pregnant mothers looking for medical advice via video appointments."}, {"5249": "Some examples:"}, {"c457": "Tala has issued one million loans totaling over $70M of credit in emerging markets — to first time borrowers who have previously had no access to capital."}, {"d0d4": "WayUp has enabled over three million college students to access part-time work opportunities and gain entry into the job market throughout and beyond their college years."}, {"e8b7": "Eloquii has opened up the world of fast fashion to the size 14+ market for the first time."}, {"4455": "Maven revolutionized the healthcare industry by offering women real-time video appointments with licensed nurse practitioners and psychologists; it even offers counseling to expectant mothers so they can make plans for their baby’s arrival and stay in the workforce."}, {"8e09": "As a firm, we are founder-focused and have invested in areas that span across fintech, digital health, marketplaces, enterprise SaaS, vertical commerce and more. Over the last three years, we have seen a massive increase in both the breadth and depth of industries being disrupted by women, in areas like virtual reality, AI and other emerging technologies. True to the original thesis, many of the women we have backed came from the largest technology companies in the world and have taken these skill sets and applied them to solving problems and creating opportunities that they see in the workplace or as consumers."}, {"e250": "On deal flow: year after year, we have seen exponential growth in the number of technology companies being started by women, as well as the quality of founders. In 2017, at the fund level, deal flow will have increased 10X from 2014, and we expect that to continue to grow."}, {"8295": "Raising that next stage of institutional funding is incredibly important for the viability of a start-up. To track this, we launched an annual study in 2014 on the state of affairs for female founders raising institutional capital. This study is the first of its kind and has since been widely cited by the press. For the venture industry, there is good news: on an annual basis, we are seeing a steady increase in the numbers of women raising Series A and B rounds, specifically in NYC."}, {"0f1e": "Sutian Dong, Anu Duggal, Casey Taylor by Dani Fresh"}, {"9ded": "Our Team"}, {"1971": "To do what we do, our team is small. Last year I was incredibly lucky to be joined by a second partner, Sutian Dong, formerly of FirstMark Capital. In the NYC ecosystem, Sutian is one of the few women who has spent more than five years at a top-tier venture fund and has brought with her a host of relationships. As a co-founder of Women in VC, she has built a community of over 300 women working in venture in the NYC, Bay Area, and LA communities. Casey Taylor joined our team officially last year to manage our community and platform initiatives. By running over 40 events a year and growing our F3 Mentor Network, we are proud to be providing more post-investment support to our founders than ever before."}, {"493a": "Observations"}, {"bbba": "There’s no doubt that we still have a long way to go to increase diversity in venture and technology. We have seen too many stories of bro-culture-gone-awry to ignore the rampant sexism in our industry. However, there have been positive developments in the last three years, including an increase in female partners and female VC activity - Jess Lee at Sequoia, Cyan Banister at Founders Fund, Sarah Tavel at Greylock, Kara Nortman at Upfront, and Jenny Lefcourt at Freestyle - all help these funds gain access to new and different deal flow channels. Female investors have also started venture funds, becoming founding GPs themselves - Aileen Lee at Cowboy, Theresia Gouw and Jennifer Fonstad at Aspect Ventures, and Kirsten Green at Forerunner. Overall, there are more women working in venture capital than ever before, both at the analyst/associate and partner levels. These women come with their own pipeline and deal flow channels, adding diversity to the more traditional VC firms."}, {"5860": "We’re excited to be at the forefront of a sea change in capitalizing on the real, tangible, and meaningful opportunities in investing in women. We remain very optimistic that investing in women will yield great returns for our LPs and prove to the industry that there is a lucrative opportunity in our thesis."}], "child": "1192_1"}