{"name": "1193", "parent": "", "content": "Why Your Life Looks Like a Spiral — and that’s okay “I thought I had that figured out already.” One of the biggest frustrations of my clients and managers is having to work on an area they thought was “finished.” I can relate. If I thought about how many times I’ve restarted a focus on my health, I’d stay stuck in the land of memories and lost opportunities. I’ve learned to think of life as a spiral. Eventually, we’ll circle back to everything. (And, in fact, there may be an advantage to iterating more often. Hold that thought.) Charlie Gilkey first introduced me to this concept in 2013, though I have to admit that I didn’t fully grasp it at the time. Or perhaps I was still on my first revolution of figuring things out. As I swam this morning, a bit slower and achier than the last few days, I was on the verge of discontent. Although the water was perfect and my morning was right on track, I thought back to how fit I was in 2014. I thought of where I would be if I’d never stopped swimming in those years in between. It took me a few laps to remember what happened. During the spring and summer of 2014, I was focused on upgrading the planning system we use in our Housekeeping department. I was getting to work at 6am, working on the daily breakout for 90 minutes, and then had a long break before our first morning meeting. With our new heated pool, it was the perfect swim time. By fall, Housekeeping was performing exceedingly well, and the summer intensity had passed. I stopped getting to work at 6am, and therefore, I stopped swimming. That part makes sense. It took me nearly three years to realize that swimming was missing from my ideal morning routine. Ouch. In March, I planned to go to a conference on the west coast. With travel time, I scheduled nearly a week off from the resort. But as the date got closer, I realized that I simply didn’t want to travel. And I already had a long list of things that I wanted to do. Why go to a conference to write a new list that I wouldn’t have time to execute on? So, I decided on a new approach — I’d stay home and have my own personal growth bootcamp. I’d get my morning routine polished up, and I’d get through several of those lists. In preparing for my “vacation,” I thought about when I’d enjoyed mornings the most. I immediately remembered that summer of swimming. I swam again on March 22, and I’ve been in the pool nearly every day since. It feels great and sets me up for success each day. But I don’t think that’s the real lesson I learned. I learned that I must take time to review and reflect more often. If I’d been doing that, it wouldn’t have taken me three years to realize what I was missing. That’s how we speed up the spiral. We prompt ourselves to recognize what’s going well in our lives, and the areas we think could be better. My clients will quickly recognize a set of daily questions we often use together: In my own life, I’m very consistent with reflection when things aren’t going well. But as I get back on track, I tend to let some habits slide. Now I know I’ll need to change that if I want to make it around the spiral more often than once every three years. How could you shorten your learning spiral? — — I believe that leadership is a choice to be a contagious force for the positive, and I’m committed to helping leaders live and serve at their best. If that sounds interesting to you, let’s connect. — — image credit: flickr/Khairul Nizam ", "title": "Why Your Life Looks Like a Spiral — and that’s okay", "sentences": [{"5b36": "Why Your Life Looks Like a Spiral — and that’s okay"}, {"7da5": "“I thought I had that figured out already.”"}, {"d57b": "One of the biggest frustrations of my clients and managers is having to work on an area they thought was “finished.”"}, {"f2ac": "I can relate. If I thought about how many times I’ve restarted a focus on my health, I’d stay stuck in the land of memories and lost opportunities."}, {"bac5": "I’ve learned to think of life as a spiral. Eventually, we’ll circle back to everything. (And, in fact, there may be an advantage to iterating more often. Hold that thought.)"}, {"818d": "Charlie Gilkey first introduced me to this concept in 2013, though I have to admit that I didn’t fully grasp it at the time. Or perhaps I was still on my first revolution of figuring things out."}, {"3ab5": "As I swam this morning, a bit slower and achier than the last few days, I was on the verge of discontent. Although the water was perfect and my morning was right on track, I thought back to how fit I was in 2014. I thought of where I would be if I’d never stopped swimming in those years in between."}, {"a7bf": "It took me a few laps to remember what happened. During the spring and summer of 2014, I was focused on upgrading the planning system we use in our Housekeeping department. I was getting to work at 6am, working on the daily breakout for 90 minutes, and then had a long break before our first morning meeting. With our new heated pool, it was the perfect swim time."}, {"5bb9": "By fall, Housekeeping was performing exceedingly well, and the summer intensity had passed. I stopped getting to work at 6am, and therefore, I stopped swimming. That part makes sense."}, {"463a": "It took me nearly three years to realize that swimming was missing from my ideal morning routine. Ouch."}, {"dde0": "In March, I planned to go to a conference on the west coast. With travel time, I scheduled nearly a week off from the resort. But as the date got closer, I realized that I simply didn’t want to travel. And I already had a long list of things that I wanted to do. Why go to a conference to write a new list that I wouldn’t have time to execute on?"}, {"638a": "So, I decided on a new approach — I’d stay home and have my own personal growth bootcamp. I’d get my morning routine polished up, and I’d get through several of those lists. In preparing for my “vacation,” I thought about when I’d enjoyed mornings the most. I immediately remembered that summer of swimming."}, {"8ed4": "I swam again on March 22, and I’ve been in the pool nearly every day since. It feels great and sets me up for success each day. But I don’t think that’s the real lesson I learned."}, {"f2a9": "I learned that I must take time to review and reflect more often. If I’d been doing that, it wouldn’t have taken me three years to realize what I was missing."}, {"0c04": "That’s how we speed up the spiral. We prompt ourselves to recognize what’s going well in our lives, and the areas we think could be better."}, {"8d5c": "My clients will quickly recognize a set of daily questions we often use together:"}, {"89f2": "In my own life, I’m very consistent with reflection when things aren’t going well. But as I get back on track, I tend to let some habits slide. Now I know I’ll need to change that if I want to make it around the spiral more often than once every three years."}, {"8146": "How could you shorten your learning spiral?"}, {"7122": "— —"}, {"4401": "I believe that leadership is a choice to be a contagious force for the positive, and I’m committed to helping leaders live and serve at their best. If that sounds interesting to you, let’s connect."}, {"fadd": "— —"}, {"8890": "image credit: flickr/Khairul Nizam"}], "child": "1193_1\t1193_2"}