{"name": "1197", "parent": "", "content": "Sheer Existence “It is not what you look at that matters, but what you see.” — Henry David Thoreau Yesterday, around lunchtime, during my five minute commute from one family business to another, I passed a man on foot, walking along the sidewalk that outlines a well-populated residential area in town. He was a familiar face, medium build, with combed-back hair, backpack, and a focused expression. His pace was smooth and intent, as if timed exactly to reach his destination. All of this I noticed in a glance, and I smiled. I realized suddenly as I passed that this man was a dynamic part of “my” world, that his merely walking by had affected me, even though I had never met him. I had seen him walking many times before, not every day, but enough that I would recognize him in the space of a breath. Unbeknownst to him, he had become part of my landscape, my world structure, and if he were to disappear suddenly, I would notice. The funny part is that he was simply being himself — walking by, not waving, not smiling, not even paying attention to the passing cars. Just walking, being with himself and his thoughts. And yet, this stranger had affected me by his sheer existence, and I found myself a shade happier, just from passing his familiar form. It is quite probable that I will never meet this person, but I am grateful for the thread of continuity his routine brings to mine and for the reminder that we are all connected to one another, regardless of whether or not we know each other or even interact. Our existence is all that is required to affect Life — no games to play, no prizes to win, no votes to garner — just being who we are, as we are, as fully as possible in any given moment. ", "title": "Sheer Existence", "sentences": [{"3d52": "Sheer Existence"}, {"18ae": "“It is not what you look at that matters, but what you see.” — Henry David Thoreau"}, {"eb60": "Yesterday, around lunchtime, during my five minute commute from one family business to another, I passed a man on foot, walking along the sidewalk that outlines a well-populated residential area in town. He was a familiar face, medium build, with combed-back hair, backpack, and a focused expression. His pace was smooth and intent, as if timed exactly to reach his destination. All of this I noticed in a glance, and I smiled."}, {"a5ec": "I realized suddenly as I passed that this man was a dynamic part of “my” world, that his merely walking by had affected me, even though I had never met him. I had seen him walking many times before, not every day, but enough that I would recognize him in the space of a breath. Unbeknownst to him, he had become part of my landscape, my world structure, and if he were to disappear suddenly, I would notice."}, {"c6dd": "The funny part is that he was simply being himself — walking by, not waving, not smiling, not even paying attention to the passing cars. Just walking, being with himself and his thoughts. And yet, this stranger had affected me by his sheer existence, and I found myself a shade happier, just from passing his familiar form."}, {"39b3": "It is quite probable that I will never meet this person, but I am grateful for the thread of continuity his routine brings to mine and for the reminder that we are all connected to one another, regardless of whether or not we know each other or even interact. Our existence is all that is required to affect Life — no games to play, no prizes to win, no votes to garner — just being who we are, as we are, as fully as possible in any given moment."}], "child": "1197_1"}