{"name": "1199", "parent": "", "content": "El Rey This week was a practice in restraint. Three family members fell ill within days of each other and by the end of the weekend, all three were in the hospital — the same hospital — doors down from one another. I was getting sporadic, and at times frantic, cryptic updates from across the country via phone, text and IM. All the while, work was full tilt and the compulsive forward motion of my children was unrelenting, but not all in the way one might expect. The kids were busy, but they were at their best: loving, patient — not just with me, but with one another — and affectionate in a way that I can only describe as generous, especially during a week when I was truly distracted. I made a conscious decision to stay put and not run off to California until I knew that I was truly needed. This was an unusual move for me, but it was one of a few weeks that I wasn’t traveling for work and I wanted to focus on my kids and give them some consistent Mom Time. I was determined to plug in. Be present. Mindful. In tune. It was all that it should be. I did drop offs. I picked up both kids from school, warmed by their surprised, gleeful faces when they saw me at the gate. I attended my eldest son’s school concert and watched him half-pretend to play the recorder (an instrument he detests), while making up silly dances to the songs he was playing for my pure amusement. My youngest child sang me a song he learned in school that I had never heard before. The simple, beautiful lyrics together with his sweet, still-baby voice made me cry. I set limits on my time at work and got home for dinner. It was a good week. All the while, my dreams were consistently active. Each night I was running barefoot through a forest, knowing I still had miles of ground to cover (like, 1000s of miles). In one sequence, I needed to get to Africa and I jumped up in the air and flew, cities beneath me, knowing that I would overshoot my destination. I landed in a baseball field, across the street from a stripmall. People were gathered outside the chainlink fence and the device that helped me fly had broken upon landing. How would I get back to where I needed to be (wherever that was)? The grass was wet, I was wearing PJs, and I wasn’t sure where I was supposed to go. I wasn’t panicked, but I was feeling lost, out of my element. I started to walk towards the fence and my husband appeared, glowing optimism, map in one hand, taking my hand in the other. And the dream ended. My actual week ends on a plane. I hopped it a few hours ago, hoping to get home in time to be with one of those family members who fell ill. The decline came on sudden, and was rapid. I wanted very much to be near him before he was gone. I learned in flight that I was too late. I didn’t overshoot this flight and my husband won’t be on the other side of it waiting with a map. My destination is pre-determined and if JetBlue has anything to do with it, I will be on time and on target. And though I’ve taken this exact flight tens of times, I’m not certain what I will arrive to. My family, certainly, will not be the same. And in some ways, neither will I. The person who has passed has always been — as far back and as long as I know. Up until today, I’ve been fortunate as an adult to never know what it is to lose someone like that. I’ll arrive home and I’ll be with my family, I’ll see them and he won’t be there, yet there he will be — I’ll find him through them and in them. That is what family is and that certainly is the family he created. I’ll miss the actual him, though. My grandfather was a mighty presence. You knew when he was in the room; he made sure of it, usually through a joke delivered in his booming voice at my grandmother’s expense. And she dished it right back. I will miss their quick banter. It could get a little edgy, but was always served up with sassy affection. There are few people who choose to see you only for the gifts that you bring into this world. My grandfather was one of those people. He was easy with me, always. I realize now that I counted on that. I regret that I didn’t spend more time simply being with him, and allowing that easiness to just be. When I was a kid he used to take me to his annual company picnic. One year, we competed in a shaving competition. I covered his face in shaving cream and the ladies that ran the picnic gave me a popsicle stick to “shave” my grandpa. There were other teams and the idea was the first to finish shaving their partner would win. I have no idea if we did, but I have some fantastic pictures of us that day competing. My grandpa sits totally compliant and at ease, covered in shaving cream. My sister and I are beside him, instruments raised, grinning proudly, prepared to go at it. He was a good sport. And my grandpa loved love. When I was younger, he followed my love life with more interest than I did. And boy, was he interested. At a family gathering we had at a park one year, I ran into an ex and we caught up for a few minutes. Out of the corner of my eye, I saw my grandfather appear out of nowhere. He was listening with profound interest, chuckling to himself. “Ay, Molly,” he said afterwards with a knowing smile. The ex was still interested and though I was long over it, I was enjoying entertaining the idea for a hot second and my grandfather knew it. I’m told he was quite adept at the “dance\" when he was young. I can only imagine. He clearly understood it well and delighted in its intricacies. So I land, back in my native California and will soon be en route to my grandparents’ house where my mom was raised and where I spent much of my childhood. I’ll be happy to be there, to celebrate my grandpa and his gifts and mourn the slow, easy days I had with him and the time we had together as a family. And I’ll be missing him among the family chatter, that booming voice and his widespread mischievous grin. Grandpa among the ruckus, stirring the pot occasionally, but mostly just being there, steady in his big Lazy-Boy, present and presiding, loving every minute of it. As I sit in my grandparents’ living room, across from that empty chair where he would hold court, I’m reminded of the first verse of that school song my little guy taught me earlier in the week: Which is the way the wind blows, over the stormy sea? Bringing a ship for father and a golden dream for me. ", "title": "El Rey", "sentences": [{"5fc1": "El Rey"}, {"21a0": "This week was a practice in restraint. Three family members fell ill within days of each other and by the end of the weekend, all three were in the hospital — the same hospital — doors down from one another. I was getting sporadic, and at times frantic, cryptic updates from across the country via phone, text and IM. All the while, work was full tilt and the compulsive forward motion of my children was unrelenting, but not all in the way one might expect. The kids were busy, but they were at their best: loving, patient — not just with me, but with one another — and affectionate in a way that I can only describe as generous, especially during a week when I was truly distracted. I made a conscious decision to stay put and not run off to California until I knew that I was truly needed. This was an unusual move for me, but it was one of a few weeks that I wasn’t traveling for work and I wanted to focus on my kids and give them some consistent Mom Time. I was determined to plug in. Be present. Mindful. In tune."}, {"4a22": "It was all that it should be. I did drop offs. I picked up both kids from school, warmed by their surprised, gleeful faces when they saw me at the gate. I attended my eldest son’s school concert and watched him half-pretend to play the recorder (an instrument he detests), while making up silly dances to the songs he was playing for my pure amusement. My youngest child sang me a song he learned in school that I had never heard before. The simple, beautiful lyrics together with his sweet, still-baby voice made me cry. I set limits on my time at work and got home for dinner. It was a good week."}, {"13c3": "All the while, my dreams were consistently active. Each night I was running barefoot through a forest, knowing I still had miles of ground to cover (like, 1000s of miles). In one sequence, I needed to get to Africa and I jumped up in the air and flew, cities beneath me, knowing that I would overshoot my destination. I landed in a baseball field, across the street from a stripmall. People were gathered outside the chainlink fence and the device that helped me fly had broken upon landing. How would I get back to where I needed to be (wherever that was)? The grass was wet, I was wearing PJs, and I wasn’t sure where I was supposed to go. I wasn’t panicked, but I was feeling lost, out of my element. I started to walk towards the fence and my husband appeared, glowing optimism, map in one hand, taking my hand in the other. And the dream ended."}, {"4b0c": "My actual week ends on a plane. I hopped it a few hours ago, hoping to get home in time to be with one of those family members who fell ill. The decline came on sudden, and was rapid. I wanted very much to be near him before he was gone. I learned in flight that I was too late."}, {"ee82": "I didn’t overshoot this flight and my husband won’t be on the other side of it waiting with a map. My destination is pre-determined and if JetBlue has anything to do with it, I will be on time and on target. And though I’ve taken this exact flight tens of times, I’m not certain what I will arrive to. My family, certainly, will not be the same. And in some ways, neither will I. The person who has passed has always been — as far back and as long as I know. Up until today, I’ve been fortunate as an adult to never know what it is to lose someone like that. I’ll arrive home and I’ll be with my family, I’ll see them and he won’t be there, yet there he will be — I’ll find him through them and in them. That is what family is and that certainly is the family he created."}, {"2473": "I’ll miss the actual him, though. My grandfather was a mighty presence. You knew when he was in the room; he made sure of it, usually through a joke delivered in his booming voice at my grandmother’s expense. And she dished it right back. I will miss their quick banter. It could get a little edgy, but was always served up with sassy affection."}, {"a035": "There are few people who choose to see you only for the gifts that you bring into this world. My grandfather was one of those people. He was easy with me, always. I realize now that I counted on that. I regret that I didn’t spend more time simply being with him, and allowing that easiness to just be."}, {"ee32": "When I was a kid he used to take me to his annual company picnic. One year, we competed in a shaving competition. I covered his face in shaving cream and the ladies that ran the picnic gave me a popsicle stick to “shave” my grandpa. There were other teams and the idea was the first to finish shaving their partner would win. I have no idea if we did, but I have some fantastic pictures of us that day competing. My grandpa sits totally compliant and at ease, covered in shaving cream. My sister and I are beside him, instruments raised, grinning proudly, prepared to go at it. He was a good sport."}, {"8c4a": "And my grandpa loved love. When I was younger, he followed my love life with more interest than I did. And boy, was he interested. At a family gathering we had at a park one year, I ran into an ex and we caught up for a few minutes. Out of the corner of my eye, I saw my grandfather appear out of nowhere. He was listening with profound interest, chuckling to himself. “Ay, Molly,” he said afterwards with a knowing smile. The ex was still interested and though I was long over it, I was enjoying entertaining the idea for a hot second and my grandfather knew it. I’m told he was quite adept at the “dance\" when he was young. I can only imagine. He clearly understood it well and delighted in its intricacies."}, {"fc91": "So I land, back in my native California and will soon be en route to my grandparents’ house where my mom was raised and where I spent much of my childhood. I’ll be happy to be there, to celebrate my grandpa and his gifts and mourn the slow, easy days I had with him and the time we had together as a family. And I’ll be missing him among the family chatter, that booming voice and his widespread mischievous grin. Grandpa among the ruckus, stirring the pot occasionally, but mostly just being there, steady in his big Lazy-Boy, present and presiding, loving every minute of it."}, {"5446": "As I sit in my grandparents’ living room, across from that empty chair where he would hold court, I’m reminded of the first verse of that school song my little guy taught me earlier in the week: Which is the way the wind blows, over the stormy sea? Bringing a ship for father and a golden dream for me."}], "child": "1199_1"}