{"name": "120", "parent": "", "content": "Four Ways to Soothe Your Hipster-Soccer Soul Sure, Juventus-Barcelona and Bayern Munich–Real Madrid could easily be championship pairings in another year, but the must-watch matchup of the Champions League quarterfinals is Borussia Dortmund vs. Monaco The Champions League quarterfinal draw played out perfectly. Not because we get to see the 26-time German champions Bayern Munich take on defending Champions League winners Real Madrid. And not because we get to see arguably the best attack in the world, Barcelona’s Lionel Messi, Luis Suárez, and Neymar, square off against the best defense in Juventus’s shape-shifting back line. No, it’s due to Borussia Dortmund and Monaco: a pairing that’s sure to have less talent than those other two — sorry, Leicester City and Atlético Madrid — but is guaranteed to produce high-scoring excitement. Here are four reasons why. 1. Goals, Goals, Goals, Etc. Monaco have a goal difference of plus-62 in Ligue 1 this season. Chelsea, the soon-to-be Premier League winners, have scored 65. Leonardo Jardim’s team has been incredibly potent this year, with a direct attack that moves at an electric pace. The two strikers, Kylian Mbappé and Radamel Falcao, are never in short supply of chances, as the system focuses on getting the ball to them as often as possible — especially in spaces behind the opposition defense. Granted, they have been quite lucky, with the forwards converting shots at an unprecedented clip of over 33 percent more chances than expected goals suggest, but nothing about Dortmund says they’ll be able to cool off Monaco’s hot streak. Barcelona’s Best Midfielder Plays for Bayern MunichEducated in Spain and brought to Germany by Pep Guardiola, Thiago is finally healthy — and he’s doing it alltheringer.com The German defense is inconsistent at best. They shut down Bayern Munich before the winter break as well as RB Leipzig just after. But recently, their off days come more frequently, as evidenced by this past Saturday’s 4–1 loss to Bayern. With the rate at which Monaco supply their strikers, the Dortmunder back line will be constantly tested and likely forced into mistakes. But it’s not like Thomas Tuchel’s side won’t punch back; per expected goals, their attack has actually been better than Monaco’s this season. 2. See All the Next Big Things A lot has been made about both Mbappé and Christian Pulisic recently, and for good reason. The former has exploded onto the scene with six goals in Monaco’s four games in March, while Pulisic is only 18, yet might already be America’s best player … ever? The Best American Soccer Player Is an 18-Year-Old From Hershey, PennsylvaniaAt this point, the only thing crazier than betting on Christian Pulisic is betting against himtheringer.com They’re not the only two talented kids who will take to the pitch Tuesday. Pulisic’s fellow winger, Ousmane Dembélé, is perhaps the most exciting 19-year-old in the world right now. He lacks consistency and his decision-making can leave a lot to be desired, but the pure speed of his dribbling has made a mockery of many Bundesliga defenders in his first full professional season. He’s a direct player who will run at his man wherever he is on the pitch and uses his capacity to change direction at high speeds to devastating effect. As the season has progressed, Tuchel has brought the winger into a more central role, where he has threatened with direct runs through gaps in midfield. Central midfielders, who are more accustomed to cutting out stray passes, simply don’t know how to deal with the forward running at them in full pace. Despite losing on aggregate, Manchester City showed how to create these gaps between Monaco’s two midfielders, and Tuchel may do the same. In Dortmund’s way, though, will be Monaco’s oldest first-choice midfielder: the 23-year-old Fabinho. The Brazilian is well-rounded, and spent most of his career as an attacking right-back, before he was moved into a central position toward the end of last season. Much like Nemanja Matic and N’Golo Kanté of Chelsea, Fabinho’s flexibility is what allows Monaco to play with just two in the middle. Nemanja Matic and N’Golo Kanté Are the Best Midfield Trio in the Premier LeagueIn Chelsea’s midfield, one plus one equals threetheringer.com At 6-foot-2, his enormous stride allows him to cover a great amount of space in defense, which means that the two attacking midfielders, Bernardo Silva (22 years old) and Thomas Lemar (21), can focus on what they do best. In the most lethal attack in Europe, Silva is the best attacker. He’s an excellent dribbler who can make incisive passes from in front of the opposition defensive line. He often attacks diagonally from the wing, cutting in behind the midfield line, looking to find the two strikers running behind the opposing center backs. Tasked with slowing down Silva will be Dortmund’s midfield pivot Julian Weigl, another crucial young player for Tuchel’s side at just 21. Key in helping his team bring the ball out of their own third, he maintains balance within the attack through incisive passes to break the midfield line and an intelligent positional game that links teammates. However, Monaco’s narrow press will pose a difficult challenge to the pivot’s influence. With a 4–2–2–2 shape, Silva and Thomas Lemar stay close to their strikers and central midfielders, rather than pushing to the touchline, making it easier for Monaco to cover the middle of the pitch. Both Bayer Leverkusen and RB Leipzig used this shape in their wins over Dortmund in the first half of the season. Their high presses, which emphasised blocking any passes into Weigl, were a deciding factor in shutting down the attack before it ever got started. 3. Who Doesn’t Love a Good Counterattack? Another of Dortmund’s frailties is their transition into defense after losing the ball. Unfortunately for them, attacking these moments is Monaco’s specialty. The side possesses pace in every position, and this comes to life when their opponent loses the ball with open spaces higher upfield. When this speed is housed by well-coordinated movements from the front four, they can cut up any team. Pep Guardiola and Manchester City learned this the hard way in the round of 16. They frequently struggled to break out of Monaco’s press, and if they did, there was always a chance that Mbappé and others would break into space left behind. Much like Manchester City, Dortmund’s expansive attacking play can leave them vulnerable. If their counterpress doesn’t quickly win the ball back, then the remainder of the defense can be left isolated with the midfield high up the pitch. Tuchel has taken steps toward remedying this, such as changing from a four-man defense to a three-back, but he hasn’t completely solved the problem. 4. They Make Wingers Cool Again With both teams possessing a raft of exciting wide forwards, the touchlines will host most of the attacking play — a tactical trend of the past few years in response to the narrow, packed-in defenses employed by the likes of Atletico and Leicester. For Monaco, the two attacking midfielders will tuck inside into the half-spaces between the center and flank, providing more room for attacking fullbacks Benjamin Mendy and Almamy Touré. From the left, Mendy specializes in low, fast-paced crosses as well as cutbacks. Instead of constantly lofting the ball into the air, these crosses arrive at the feet of Falcao and Co., allowing for much easier finishes. On the right, Touré doesn’t possess the offensive talents of Mendy, so the ball instead finds the feet of the attacking midfielder, Silva, more often. With his direct runs and through-ball-passing, the team attacks diagonally toward goal from that side. Radamel Falcao and the Power of the French Soccer SpaHaving trouble coping in England or Spain? Try France’s Ligue 1.theringer.com Since losing midfielders Henrikh Mkhitaryan to Manchester United and Ilkay Gündogan to Manchester City over the summer, Borussia Dortmund have adapted to their personnel and looked more to the wings to provide their attacking impetus. With the likes of Pulisic, Dembélé, and Turkish Emre Mor, also 19, as replacements, the focus has shifted from combinations in tight spaces to isolations closer to the touchline. The oft-injured-but-über-talented winger Marco Reus, a rare veteran in Dortmund’s attack, returned to training Monday and could also make a comeback for the tie. On Tuesday, the game between Barcelona and Juventus may as well be the final, and the winner of that tie will likely enter the semifinals as one of the favorites. Barça-Juve will be a snapshot of what world-class football looks like right now. But if you want to see what the future looks like — and if you want to have more fun — then you’ll tune into Dortmund-Monaco. ", "title": "Four Ways to Soothe Your Hipster-Soccer Soul", "sentences": [{"6ed4": "Four Ways to Soothe Your Hipster-Soccer Soul"}, {"844e": "Sure, Juventus-Barcelona and Bayern Munich–Real Madrid could easily be championship pairings in another year, but the must-watch matchup of the Champions League quarterfinals is Borussia Dortmund vs. Monaco"}, {"cc00": "The Champions League quarterfinal draw played out perfectly. Not because we get to see the 26-time German champions Bayern Munich take on defending Champions League winners Real Madrid. And not because we get to see arguably the best attack in the world, Barcelona’s Lionel Messi, Luis Suárez, and Neymar, square off against the best defense in Juventus’s shape-shifting back line. No, it’s due to Borussia Dortmund and Monaco: a pairing that’s sure to have less talent than those other two — sorry, Leicester City and Atlético Madrid — but is guaranteed to produce high-scoring excitement. Here are four reasons why."}, {"5c7f": "1. Goals, Goals, Goals, Etc."}, {"7e06": "Monaco have a goal difference of plus-62 in Ligue 1 this season. Chelsea, the soon-to-be Premier League winners, have scored 65. Leonardo Jardim’s team has been incredibly potent this year, with a direct attack that moves at an electric pace. The two strikers, Kylian Mbappé and Radamel Falcao, are never in short supply of chances, as the system focuses on getting the ball to them as often as possible — especially in spaces behind the opposition defense. Granted, they have been quite lucky, with the forwards converting shots at an unprecedented clip of over 33 percent more chances than expected goals suggest, but nothing about Dortmund says they’ll be able to cool off Monaco’s hot streak."}, {"1d9e": "Barcelona’s Best Midfielder Plays for Bayern MunichEducated in Spain and brought to Germany by Pep Guardiola, Thiago is finally healthy — and he’s doing it alltheringer.com"}, {"f242": "The German defense is inconsistent at best. They shut down Bayern Munich before the winter break as well as RB Leipzig just after. But recently, their off days come more frequently, as evidenced by this past Saturday’s 4–1 loss to Bayern. With the rate at which Monaco supply their strikers, the Dortmunder back line will be constantly tested and likely forced into mistakes. But it’s not like Thomas Tuchel’s side won’t punch back; per expected goals, their attack has actually been better than Monaco’s this season."}, {"399a": "2. See All the Next Big Things"}, {"e775": "A lot has been made about both Mbappé and Christian Pulisic recently, and for good reason. The former has exploded onto the scene with six goals in Monaco’s four games in March, while Pulisic is only 18, yet might already be America’s best player … ever?"}, {"c45e": "The Best American Soccer Player Is an 18-Year-Old From Hershey, PennsylvaniaAt this point, the only thing crazier than betting on Christian Pulisic is betting against himtheringer.com"}, {"6724": "They’re not the only two talented kids who will take to the pitch Tuesday. Pulisic’s fellow winger, Ousmane Dembélé, is perhaps the most exciting 19-year-old in the world right now. He lacks consistency and his decision-making can leave a lot to be desired, but the pure speed of his dribbling has made a mockery of many Bundesliga defenders in his first full professional season. He’s a direct player who will run at his man wherever he is on the pitch and uses his capacity to change direction at high speeds to devastating effect."}, {"fa13": "As the season has progressed, Tuchel has brought the winger into a more central role, where he has threatened with direct runs through gaps in midfield. Central midfielders, who are more accustomed to cutting out stray passes, simply don’t know how to deal with the forward running at them in full pace. Despite losing on aggregate, Manchester City showed how to create these gaps between Monaco’s two midfielders, and Tuchel may do the same."}, {"1477": "In Dortmund’s way, though, will be Monaco’s oldest first-choice midfielder: the 23-year-old Fabinho. The Brazilian is well-rounded, and spent most of his career as an attacking right-back, before he was moved into a central position toward the end of last season. Much like Nemanja Matic and N’Golo Kanté of Chelsea, Fabinho’s flexibility is what allows Monaco to play with just two in the middle."}, {"079b": "Nemanja Matic and N’Golo Kanté Are the Best Midfield Trio in the Premier LeagueIn Chelsea’s midfield, one plus one equals threetheringer.com"}, {"d755": "At 6-foot-2, his enormous stride allows him to cover a great amount of space in defense, which means that the two attacking midfielders, Bernardo Silva (22 years old) and Thomas Lemar (21), can focus on what they do best."}, {"ef6d": "In the most lethal attack in Europe, Silva is the best attacker. He’s an excellent dribbler who can make incisive passes from in front of the opposition defensive line. He often attacks diagonally from the wing, cutting in behind the midfield line, looking to find the two strikers running behind the opposing center backs."}, {"9d36": "Tasked with slowing down Silva will be Dortmund’s midfield pivot Julian Weigl, another crucial young player for Tuchel’s side at just 21. Key in helping his team bring the ball out of their own third, he maintains balance within the attack through incisive passes to break the midfield line and an intelligent positional game that links teammates."}, {"61be": "However, Monaco’s narrow press will pose a difficult challenge to the pivot’s influence. With a 4–2–2–2 shape, Silva and Thomas Lemar stay close to their strikers and central midfielders, rather than pushing to the touchline, making it easier for Monaco to cover the middle of the pitch. Both Bayer Leverkusen and RB Leipzig used this shape in their wins over Dortmund in the first half of the season. Their high presses, which emphasised blocking any passes into Weigl, were a deciding factor in shutting down the attack before it ever got started."}, {"c43c": "3. Who Doesn’t Love a Good Counterattack?"}, {"9f1e": "Another of Dortmund’s frailties is their transition into defense after losing the ball. Unfortunately for them, attacking these moments is Monaco’s specialty. The side possesses pace in every position, and this comes to life when their opponent loses the ball with open spaces higher upfield. When this speed is housed by well-coordinated movements from the front four, they can cut up any team."}, {"8f03": "Pep Guardiola and Manchester City learned this the hard way in the round of 16. They frequently struggled to break out of Monaco’s press, and if they did, there was always a chance that Mbappé and others would break into space left behind."}, {"b28e": "Much like Manchester City, Dortmund’s expansive attacking play can leave them vulnerable. If their counterpress doesn’t quickly win the ball back, then the remainder of the defense can be left isolated with the midfield high up the pitch. Tuchel has taken steps toward remedying this, such as changing from a four-man defense to a three-back, but he hasn’t completely solved the problem."}, {"a077": "4. They Make Wingers Cool Again"}, {"f9f9": "With both teams possessing a raft of exciting wide forwards, the touchlines will host most of the attacking play — a tactical trend of the past few years in response to the narrow, packed-in defenses employed by the likes of Atletico and Leicester. For Monaco, the two attacking midfielders will tuck inside into the half-spaces between the center and flank, providing more room for attacking fullbacks Benjamin Mendy and Almamy Touré. From the left, Mendy specializes in low, fast-paced crosses as well as cutbacks. Instead of constantly lofting the ball into the air, these crosses arrive at the feet of Falcao and Co., allowing for much easier finishes."}, {"d556": "On the right, Touré doesn’t possess the offensive talents of Mendy, so the ball instead finds the feet of the attacking midfielder, Silva, more often. With his direct runs and through-ball-passing, the team attacks diagonally toward goal from that side."}, {"ec77": "Radamel Falcao and the Power of the French Soccer SpaHaving trouble coping in England or Spain? Try France’s Ligue 1.theringer.com"}, {"5a59": "Since losing midfielders Henrikh Mkhitaryan to Manchester United and Ilkay Gündogan to Manchester City over the summer, Borussia Dortmund have adapted to their personnel and looked more to the wings to provide their attacking impetus. With the likes of Pulisic, Dembélé, and Turkish Emre Mor, also 19, as replacements, the focus has shifted from combinations in tight spaces to isolations closer to the touchline. The oft-injured-but-über-talented winger Marco Reus, a rare veteran in Dortmund’s attack, returned to training Monday and could also make a comeback for the tie."}, {"26d7": "On Tuesday, the game between Barcelona and Juventus may as well be the final, and the winner of that tie will likely enter the semifinals as one of the favorites. Barça-Juve will be a snapshot of what world-class football looks like right now. But if you want to see what the future looks like — and if you want to have more fun — then you’ll tune into Dortmund-Monaco."}], "child": "120_1\t120_2\t120_3\t120_4\t120_5\t120_6\t120_7"}