{"name": "1205", "parent": "", "content": "I’m falling for you In Bits and Pieces I’m falling for youIn bits and pieces.Parts of my heart yield to your presence I’m falling for youOne puzzle piece at a time I’m falling for youLike night follows the dayLike dawn follows the dusk I’m falling for youAnd I’m certain to scare youBecause you are newly freedFrom the tyrannyOf another I’m falling for youLike the breeze moves the treesLike the light of the sun stirs the leaves I’m falling for youIn the aftermath of the painof the rejection of one who was played I’m falling for youWith your kindness and your trustYour dedication and our lust I’m falling for youYou and your honestyYour children and your love so very wakenedYour dedication to truthAnd your pain I’m falling for youYour chocolate brown eyesAnd your response to my touchAnd mine to youThere was never so much I’m falling for youAre you falling for me?Will you let it be?Will you be with me? I’m falling for youIn a vacuum of trustI cannot bearI cannot hearThe lack of trust in your words I’m falling for youAnd I know that I mustRemove myself before I’m brokenAgain. I am certain that I’m falling for youAnd I must I mustBut I cannotBecause I’m falling for youMy love is doomedWhen you don’t trust ", "title": "I’m falling for you", "sentences": [{"b4bb": "I’m falling for you"}, {"fbad": "In Bits and Pieces"}, {"1329": "I’m falling for youIn bits and pieces.Parts of my heart yield to your presence"}, {"d3d8": "I’m falling for youOne puzzle piece at a time"}, {"f442": "I’m falling for youLike night follows the dayLike dawn follows the dusk"}, {"2ba1": "I’m falling for youAnd I’m certain to scare youBecause you are newly freedFrom the tyrannyOf another"}, {"e1a7": "I’m falling for youLike the breeze moves the treesLike the light of the sun stirs the leaves"}, {"07ae": "I’m falling for youIn the aftermath of the painof the rejection of one who was played"}, {"6149": "I’m falling for youWith your kindness and your trustYour dedication and our lust"}, {"7dd1": "I’m falling for youYou and your honestyYour children and your love so very wakenedYour dedication to truthAnd your pain"}, {"d50e": "I’m falling for youYour chocolate brown eyesAnd your response to my touchAnd mine to youThere was never so much"}, {"8325": "I’m falling for youAre you falling for me?Will you let it be?Will you be with me?"}, {"6041": "I’m falling for youIn a vacuum of trustI cannot bearI cannot hearThe lack of trust in your words"}, {"c801": "I’m falling for youAnd I know that I mustRemove myself before I’m brokenAgain. I am certain that"}, {"1e91": "I’m falling for youAnd I must I mustBut I cannotBecause"}, {"2cbd": "I’m falling for youMy love is doomedWhen you don’t trust"}], "child": "1205_1\t1205_2\t1205_3\t1205_4\t1205_5\t1205_6\t1205_7\t1205_8\t1205_9\t1205_10\t1205_11\t1205_12\t1205_13\t1205_14"}