{"name": "1206", "parent": "", "content": "Diary of an Introvert / Cassiopeia I wanted to love your scars, I really wanted, but you would not let me. That’s what I was thinking as cold air kicked in, slowing my walk on my way home. When I think of Cassiopeia I get shivers, and I realize they are shivers of love I’m ashamed of. Why? Her not wanting to see me again, even though she said her heart would never leave me, this is what I want to erase. I know I don’t have to measure my worthiness on someone else’s love, which became mine eventually. I love her and hate myself, feeling like a lonely carrier of emotions everyone around intentionally dropped. Every day I remember the last day, with her white dress and hair quickly turning into the finest of silks. She was all that I ever wanted, and I fail to understand what I did wrong. I begin to wonder that it could have been a dream, as this world knows no place for her soul. I was able to feel her to the depths of sensations, through her I wandered over thousands of galaxies, yet did I see her entire universe? Was she hiding a black hole in the corner of her mind? Maybe she held herself back to avoid my being dragged and obliterated by it. But don’t you understand Cassiopeia? I wanted to reach beneath your darkness, to see what’s on the opposite side. You know what I would find. You are so beautiful that your light would shine beneath everything bad you ever did, everything you hated, everything you were afraid of. I know that if I could take your hand again and look into your eyes you would see me for who I really am. I am the closest presence you’ll ever feel, I’m the rain that pours down and releases you from your cloudy thoughts. And then if you would let me hold you tight, you would feel that no one can reach you in the deep waters of the ocean. Just one kiss to summon the remnants of plain calmness. Can you let me stay? I still don’t remember if you were a dream, you look so shady Cassiopeia, my mind can’t grasp you that well anymore. Are you still there? I wonder if I’m becoming insane, since I can’t know if you ever existed in the first place, I feel you could be a projection of the love I don’t want to experience for myself. I put everything on you, is it why you said goodbye? I’ve contaminated your feelings with a sense of crushing, they could not bear it anymore. You defended as I attacked your void, precisely when you thought I could miss it. You must know that I really love you if I can hurt you that way, if I can rip your deepest. I did it so it could reattach again, in a new way you never thought possible. Is she real? I’m calling you. Can you tell me why we always meet when it’s dark? Sorry I never meant to be rude. Can I take you to see the dawn? Because you will realize you are the dawn, precisely when it’s getting lighter but you see, it’s still really dark. Then you will see how rare you are. But you lied to me when I took you there. You said that the sky would never leave me alone, but here I am now, shattered and willing to give up this Universe. You are just a tiny part of it, that is why I liked you so much, I could see your uniqueness and find myself into it. I am now convinced that it was all wasted energy and words that disappeared in the void. I spent years dreaming of a world with you, a world that was always tomorrow and never came. I’m getting tired, you know. I can’t reach myself, I can’t reach the others, I can’t hear the voices. I am limited and I counted on your vastness, but you gave me that amount in sadness. I know, I have already realized that you are me and I am you, so we are both screwed. I never dared, Cassiopeia, but now the end is knocking often at the door of my mind, more than I could ever imagine. I tried to look at you, but you turned your head and remained silent. I expected you to at least say “yes” or “no” as you are supposed to, but everything you do sounds like a “I don’t know” which is way worse for me. It keeps me dead. While society spins, skyscrapers grow, people walk, run, hold one another, kiss, I stand still like ice. There is no life in me, there is a knowledge and awareness that destroyed me. This is what you gave me because I asked for it. So why the lies with these gifts? You could have said the truth from the start, or deprived me of feelings. Because in the end, that’s what the sentence is all about, to feel and be unable to control it. It becomes an excess, and when unsatisfied it eats everything. I’m calling you again. Can you tell me why we always meet when it’s dark? I don’t care if I am rude. Can we wait all day and I take you see the dusk? So then you can see how rare it is what you did to me, to erase all the light there is and keeping me in that bloody red. I feel masochist to love you anyway. I hate myself for not loving you when I was a child. That was the worst mistake I could ever do. I fed you with anger and death, so when I grew up you turned everything against me. Yet do I deserve it until the last drop? Can’t we just sit in front of each other? Can you please listen to me when I say I’m sorry? You are the only one who can save my body and consciousness, because I don’t want them anymore, I wish this to be my final cycle so I can be up with you again. Are you real? Who am I talking to? Sometimes it feels I’m talking to myself and I’m having arguments where I want to end them screaming, and screaming, and screaming. I finally wish to lose my mind and become insane. Am I fooling myself every day? Is everything already written? Every step is a lie, but I only realize this after I took the step, it feels like going forward for nothing. I wanted to go forward for you, Cassiopeia. My arms are open, waiting for you to hug me, because you’re the only one left who has the strength to close the arms and hold me. I only want to know this. Will you hug me or will you let me go? These are my thoughts as I approach the door of my house. It’s 3 p.m., so I am sitting on the stairs outside. If you still care about me, come now. It’s cold, so you have two hours. ", "title": "Diary of an Introvert / Cassiopeia", "sentences": [{"3656": "Diary of an Introvert / Cassiopeia"}, {"9ba7": "I wanted to love your scars, I really wanted, but you would not let me. That’s what I was thinking as cold air kicked in, slowing my walk on my way home. When I think of Cassiopeia I get shivers, and I realize they are shivers of love I’m ashamed of. Why? Her not wanting to see me again, even though she said her heart would never leave me, this is what I want to erase. I know I don’t have to measure my worthiness on someone else’s love, which became mine eventually. I love her and hate myself, feeling like a lonely carrier of emotions everyone around intentionally dropped."}, {"0b09": "Every day I remember the last day, with her white dress and hair quickly turning into the finest of silks. She was all that I ever wanted, and I fail to understand what I did wrong. I begin to wonder that it could have been a dream, as this world knows no place for her soul. I was able to feel her to the depths of sensations, through her I wandered over thousands of galaxies, yet did I see her entire universe? Was she hiding a black hole in the corner of her mind? Maybe she held herself back to avoid my being dragged and obliterated by it. But don’t you understand Cassiopeia? I wanted to reach beneath your darkness, to see what’s on the opposite side."}, {"c314": "You know what I would find. You are so beautiful that your light would shine beneath everything bad you ever did, everything you hated, everything you were afraid of. I know that if I could take your hand again and look into your eyes you would see me for who I really am. I am the closest presence you’ll ever feel, I’m the rain that pours down and releases you from your cloudy thoughts. And then if you would let me hold you tight, you would feel that no one can reach you in the deep waters of the ocean. Just one kiss to summon the remnants of plain calmness. Can you let me stay?"}, {"fd52": "I still don’t remember if you were a dream, you look so shady Cassiopeia, my mind can’t grasp you that well anymore. Are you still there? I wonder if I’m becoming insane, since I can’t know if you ever existed in the first place, I feel you could be a projection of the love I don’t want to experience for myself. I put everything on you, is it why you said goodbye? I’ve contaminated your feelings with a sense of crushing, they could not bear it anymore. You defended as I attacked your void, precisely when you thought I could miss it. You must know that I really love you if I can hurt you that way, if I can rip your deepest. I did it so it could reattach again, in a new way you never thought possible. Is she real?"}, {"7492": "I’m calling you."}, {"d86f": "Can you tell me why we always meet when it’s dark? Sorry I never meant to be rude. Can I take you to see the dawn? Because you will realize you are the dawn, precisely when it’s getting lighter but you see, it’s still really dark. Then you will see how rare you are."}, {"fa32": "But you lied to me when I took you there. You said that the sky would never leave me alone, but here I am now, shattered and willing to give up this Universe. You are just a tiny part of it, that is why I liked you so much, I could see your uniqueness and find myself into it. I am now convinced that it was all wasted energy and words that disappeared in the void. I spent years dreaming of a world with you, a world that was always tomorrow and never came. I’m getting tired, you know. I can’t reach myself, I can’t reach the others, I can’t hear the voices. I am limited and I counted on your vastness, but you gave me that amount in sadness."}, {"c02f": "I know, I have already realized that you are me and I am you, so we are both screwed. I never dared, Cassiopeia, but now the end is knocking often at the door of my mind, more than I could ever imagine. I tried to look at you, but you turned your head and remained silent. I expected you to at least say “yes” or “no” as you are supposed to, but everything you do sounds like a “I don’t know” which is way worse for me. It keeps me dead. While society spins, skyscrapers grow, people walk, run, hold one another, kiss, I stand still like ice."}, {"ced7": "There is no life in me, there is a knowledge and awareness that destroyed me. This is what you gave me because I asked for it. So why the lies with these gifts? You could have said the truth from the start, or deprived me of feelings. Because in the end, that’s what the sentence is all about, to feel and be unable to control it. It becomes an excess, and when unsatisfied it eats everything."}, {"d403": "I’m calling you again."}, {"9935": "Can you tell me why we always meet when it’s dark? I don’t care if I am rude. Can we wait all day and I take you see the dusk? So then you can see how rare it is what you did to me, to erase all the light there is and keeping me in that bloody red. I feel masochist to love you anyway."}, {"c2f0": "I hate myself for not loving you when I was a child. That was the worst mistake I could ever do. I fed you with anger and death, so when I grew up you turned everything against me. Yet do I deserve it until the last drop? Can’t we just sit in front of each other? Can you please listen to me when I say I’m sorry? You are the only one who can save my body and consciousness, because I don’t want them anymore, I wish this to be my final cycle so I can be up with you again. Are you real? Who am I talking to?"}, {"0c74": "Sometimes it feels I’m talking to myself and I’m having arguments where I want to end them screaming, and screaming, and screaming. I finally wish to lose my mind and become insane. Am I fooling myself every day? Is everything already written? Every step is a lie, but I only realize this after I took the step, it feels like going forward for nothing. I wanted to go forward for you, Cassiopeia. My arms are open, waiting for you to hug me, because you’re the only one left who has the strength to close the arms and hold me. I only want to know this. Will you hug me or will you let me go?"}, {"90a5": "These are my thoughts as I approach the door of my house. It’s 3 p.m., so I am sitting on the stairs outside. If you still care about me, come now. It’s cold, so you have two hours."}], "child": "1206_1\t1206_2\t1206_3\t1206_4\t1206_5"}