{"name": "1208", "parent": "", "content": "Distracted from Distraction Courtesy of Shutterstock.com What are we doing here? I don’t mean in a metaphysical sense, as in, what is our place in the universe. More literally I mean, on a day to day basis, how am I living? What am I doing here, in this very moment? What are my priorities? To what false prophets do I bow? How many distractions do I manufacture every single day that keep me from doing the things I am called to do? And how many of those distractions do I let take the place of anything meaningful? What a tragedy to lose even one meaningful experience to distraction, and yet we willingly make the choice to do it repeatedly, every single day. For the most part these considerations of life and purpose always maintained their place in the realm of abstraction until, one day, I came home to find my father lying in the middle of the living room floor. Obviously, Dad’s death has led to a good amount of introspection. As I redefine my existence I must also re-contextualize the concept of life in general and, more specifically, my personal experience. Before Dad’s death, I had an incredibly narrow view of the world. I existed in a world where death was a possibility but never an option. People in my experience would die (later) but other people did die (now); death always befalling someone an emotionally safe distance away. Because death has been an abstraction it gave the illusion of security. I could balk at opportunities if they came at inconvenient times because I had years to recover from any of my mistakes. I could take my time. I could let things play out on their own. My world view was simple, in a pleasantly naïve way, due to this illusion of stasis. “I have time” is the greatest lie we can tell ourselves. Dad’s death, on the other hand, has ushered in a paradigm shift. The shattering of this heretofore pleasant equilibrium has fundamentally altered my consideration of the world. It’s like I have a previously unknown dimension to consider, a depth to accompany width and breadth that has always existed but never been accounted for. Before this event, the fear of someone losing their job topped the list on my hierarchy of fear simply because that was the worst thing I could anticipate feasibly happening. Sure, I knew the status quo could not be maintained indefinitely. But vaguely acknowledging some aspect of a situation will change at some point, without knowing what that change will be, its severity, and when it will take place, certainly doesn’t prepare you for the reality of it. Of all the pieces to be pulled, I never really thought it could be Dad simply because he was such a cornerstone of my reality…that seems silly in retrospect. But this improbable revision did happen, and now my world has changed. Having a new, deeper understanding of something approaching despair means it is easier to see how good seemingly mundane things really are, by comparison. Just like sea-level doesn’t seem that high until you stand at the lip of the Grand Canyon, your average day doesn’t seem that spectacular until you compare it to finding your dead Dad. All of a sudden dealing with office drama, or a car that keeps getting hit, or a dog that chews all things fabric doesn’t seem as important as it used to and is, consequently, less stressful. And as I (re)take stock of my life I can’t help but notice what we spend our lives pursuing. It appears the overwhelming majority of people define themselves through their work. Most people believe their job defines them simply because they spend so much time doing it, which makes perfect sense. You spend most of your waking life at your job and it’s natural to correlate time spent doing something with that thing’s impression on you. And so they get wrapped up in their assigned roles and lose their independence. They see spreadsheets as a comment on their character. They believe having a disagreement over an idea is an attack on their cognitive ability. They have forgotten how to think of themselves outside of what they do for money and confuse their careers with who they really are. And while all this is going on I can’t help but think to myself someone is going to find you lying on the ground one of these days, you can’t escape it, but you think whose job it is to fill out what form is worth yelling over, without the slightest sense of irony. You’ve got It, whatever It is, all wrong and you are so convinced you are doing it perfectly. I’m not saying I’ve got the answer. I don’t. I’m just as lost and confused as most people. I don’t know what my calling is as much as I know what it isn’t. But I do know, I need to find that calling and pursue it with a reckless abandon. Diagnosis is the first step in finding a cure, no? What’s more, and the liberating aspect to this terrifying scenario that is life is, there is no right or wrong answer to what that calling might be. Your calling does not have to be how your make your money. Those ideas aren’t mutually exclusive. Someone can find their peace through crafts while someone else may find it through playing sports. Whether we choose to sew sweaters for dogs or painstakingly recreate scale models of the Death Star, own your passions and be able to differentiate between that which defines you and everything else. Recently, I find myself not caring about almost anything. Not in the depressed, ennui sort of way where nothing is worth the energy to undertake. Quite the contrary. Because things seem so much less important I am no longer intimidated into submission, which in turn leads to more opportunity. I tried not to take myself too seriously and thought I succeeded for the most part. Now, I realize getting nervous for an interview, or before I played sports, or not telling a joke because I didn’t think people would find it funny, or not letting anyone read anything I have written for fear of their unflinching judgment, was nothing more than Ego. The decision to be anxious about every one of those things centered solely around my feelings of insecurity. If the interview doesn’t go well, what does that say about me as a person? If I don’t play well will people be disappointed in me? Will I look like an asshole? What if this hysterical joke is too offensive? Or not offensive enough? What if someone reads a story I have written and thinks I’m a weirdo? Who cares? Who gives a shit if some stranger doesn’t think I’m qualified for a job? Or I don’t play sports well? Or tell a joke that flops? Or have someone harshly criticize me? None of it matters because one day I will be the one lying on the floor with a black tongue and no one, especially me, will care about any of the shit that came before. So how can I tell I am doing something that brings me joy? I think it’s when I can do that thing for its own sake with no expectation of an outcome. I shouldn’t be playing sports, or writing, or telling jokes for any other reason than they make me happy. Ends have a tricky habit of not being the end. Take an exceptional athlete for example. From the time they are playing pee-wee football, through middle school, into high school, through college, until they sign their first rookie contract, every athlete is striving to one day play their sport professionally. Finally, you make the pros. All the two-a-days, the road work, the lifting, the sprints, sprained ankles, and torn tendons culminated in this moment. Your life’s work is now complete. Then you play your sport for an indeterminate amount of time. The average NFL career lasts three seasons but let’s assume you are the exception to the rule and get to play professional sports for seven years. You are now approaching thirty years of age and the goal you have worked for your entire life has now come and gone. You did everything that was expected of you, you excelled in your profession, you reached your end, and now what? The lights have faded, the money is gone, the fame is gone, and what are you left with? Not much more than when you first started. So you better have enjoyed those plyo-metrics and skill drills and broken noses because that was the reward. If you did all those things just to get to the pros, you have probably lead a fairly miserable life everyone else is envious of. But every morning you woke up sore was wretched because you hated the process. The process is what defines life, not the fruits the process might bear. The same idea holds true for writing, or cooking, or playing music, or researching corporate tax law. If you can’t find joy in the thing you are doing, even if you reach your goal every time you do it, your life will turn out to be a series of miserable successes. We don’t pursue our passions for the ends they promise, but for the journey they provide. ", "title": "Distracted from Distraction", "sentences": [{"f49a": "Distracted from Distraction"}, {"392d": "Courtesy of Shutterstock.com"}, {"6d25": "What are we doing here? I don’t mean in a metaphysical sense, as in, what is our place in the universe. More literally I mean, on a day to day basis, how am I living? What am I doing here, in this very moment? What are my priorities? To what false prophets do I bow? How many distractions do I manufacture every single day that keep me from doing the things I am called to do? And how many of those distractions do I let take the place of anything meaningful? What a tragedy to lose even one meaningful experience to distraction, and yet we willingly make the choice to do it repeatedly, every single day."}, {"1889": "For the most part these considerations of life and purpose always maintained their place in the realm of abstraction until, one day, I came home to find my father lying in the middle of the living room floor. Obviously, Dad’s death has led to a good amount of introspection. As I redefine my existence I must also re-contextualize the concept of life in general and, more specifically, my personal experience."}, {"b03b": "Before Dad’s death, I had an incredibly narrow view of the world. I existed in a world where death was a possibility but never an option. People in my experience would die (later) but other people did die (now); death always befalling someone an emotionally safe distance away. Because death has been an abstraction it gave the illusion of security. I could balk at opportunities if they came at inconvenient times because I had years to recover from any of my mistakes. I could take my time. I could let things play out on their own. My world view was simple, in a pleasantly naïve way, due to this illusion of stasis. “I have time” is the greatest lie we can tell ourselves."}, {"b21c": "Dad’s death, on the other hand, has ushered in a paradigm shift. The shattering of this heretofore pleasant equilibrium has fundamentally altered my consideration of the world. It’s like I have a previously unknown dimension to consider, a depth to accompany width and breadth that has always existed but never been accounted for."}, {"9ad1": "Before this event, the fear of someone losing their job topped the list on my hierarchy of fear simply because that was the worst thing I could anticipate feasibly happening. Sure, I knew the status quo could not be maintained indefinitely. But vaguely acknowledging some aspect of a situation will change at some point, without knowing what that change will be, its severity, and when it will take place, certainly doesn’t prepare you for the reality of it. Of all the pieces to be pulled, I never really thought it could be Dad simply because he was such a cornerstone of my reality…that seems silly in retrospect. But this improbable revision did happen, and now my world has changed."}, {"e2aa": "Having a new, deeper understanding of something approaching despair means it is easier to see how good seemingly mundane things really are, by comparison. Just like sea-level doesn’t seem that high until you stand at the lip of the Grand Canyon, your average day doesn’t seem that spectacular until you compare it to finding your dead Dad. All of a sudden dealing with office drama, or a car that keeps getting hit, or a dog that chews all things fabric doesn’t seem as important as it used to and is, consequently, less stressful. And as I (re)take stock of my life I can’t help but notice what we spend our lives pursuing."}, {"93f2": "It appears the overwhelming majority of people define themselves through their work. Most people believe their job defines them simply because they spend so much time doing it, which makes perfect sense. You spend most of your waking life at your job and it’s natural to correlate time spent doing something with that thing’s impression on you. And so they get wrapped up in their assigned roles and lose their independence. They see spreadsheets as a comment on their character. They believe having a disagreement over an idea is an attack on their cognitive ability. They have forgotten how to think of themselves outside of what they do for money and confuse their careers with who they really are. And while all this is going on I can’t help but think to myself someone is going to find you lying on the ground one of these days, you can’t escape it, but you think whose job it is to fill out what form is worth yelling over, without the slightest sense of irony. You’ve got It, whatever It is, all wrong and you are so convinced you are doing it perfectly."}, {"f13a": "I’m not saying I’ve got the answer. I don’t. I’m just as lost and confused as most people. I don’t know what my calling is as much as I know what it isn’t. But I do know, I need to find that calling and pursue it with a reckless abandon. Diagnosis is the first step in finding a cure, no? What’s more, and the liberating aspect to this terrifying scenario that is life is, there is no right or wrong answer to what that calling might be. Your calling does not have to be how your make your money. Those ideas aren’t mutually exclusive. Someone can find their peace through crafts while someone else may find it through playing sports. Whether we choose to sew sweaters for dogs or painstakingly recreate scale models of the Death Star, own your passions and be able to differentiate between that which defines you and everything else."}, {"77cf": "Recently, I find myself not caring about almost anything. Not in the depressed, ennui sort of way where nothing is worth the energy to undertake. Quite the contrary. Because things seem so much less important I am no longer intimidated into submission, which in turn leads to more opportunity. I tried not to take myself too seriously and thought I succeeded for the most part. Now, I realize getting nervous for an interview, or before I played sports, or not telling a joke because I didn’t think people would find it funny, or not letting anyone read anything I have written for fear of their unflinching judgment, was nothing more than Ego."}, {"b002": "The decision to be anxious about every one of those things centered solely around my feelings of insecurity. If the interview doesn’t go well, what does that say about me as a person? If I don’t play well will people be disappointed in me? Will I look like an asshole? What if this hysterical joke is too offensive? Or not offensive enough? What if someone reads a story I have written and thinks I’m a weirdo? Who cares? Who gives a shit if some stranger doesn’t think I’m qualified for a job? Or I don’t play sports well? Or tell a joke that flops? Or have someone harshly criticize me? None of it matters because one day I will be the one lying on the floor with a black tongue and no one, especially me, will care about any of the shit that came before."}, {"b23c": "So how can I tell I am doing something that brings me joy? I think it’s when I can do that thing for its own sake with no expectation of an outcome. I shouldn’t be playing sports, or writing, or telling jokes for any other reason than they make me happy."}, {"5dfb": "Ends have a tricky habit of not being the end."}, {"fe78": "Take an exceptional athlete for example. From the time they are playing pee-wee football, through middle school, into high school, through college, until they sign their first rookie contract, every athlete is striving to one day play their sport professionally. Finally, you make the pros. All the two-a-days, the road work, the lifting, the sprints, sprained ankles, and torn tendons culminated in this moment. Your life’s work is now complete. Then you play your sport for an indeterminate amount of time. The average NFL career lasts three seasons but let’s assume you are the exception to the rule and get to play professional sports for seven years. You are now approaching thirty years of age and the goal you have worked for your entire life has now come and gone."}, {"f68c": "You did everything that was expected of you, you excelled in your profession, you reached your end, and now what? The lights have faded, the money is gone, the fame is gone, and what are you left with? Not much more than when you first started. So you better have enjoyed those plyo-metrics and skill drills and broken noses because that was the reward. If you did all those things just to get to the pros, you have probably lead a fairly miserable life everyone else is envious of. But every morning you woke up sore was wretched because you hated the process. The process is what defines life, not the fruits the process might bear. The same idea holds true for writing, or cooking, or playing music, or researching corporate tax law. If you can’t find joy in the thing you are doing, even if you reach your goal every time you do it, your life will turn out to be a series of miserable successes."}, {"36b1": "We don’t pursue our passions for the ends they promise, but for the journey they provide."}], "child": "1208_1\t1208_2"}