{"sentences": [{"0a23": "This President Thinks Women Should Decorate The World, Not Run It"}, {"adef": "It’s wrong to touch a woman. It’s fine to touch an object."}, {"0dd2": "via http://sculptures.website/"}, {"f394": "We can’t swing at every pitch. It’s going to be a long four years (maybe) and we need to keep our strength up. He’s running a for-profit presidency staffed by rich, out-of-touch bigots and like…his kids. He’s embarrassing us in front of world leaders at best, provoking them at worst. He’s executive-ordering away the very notions our country was founded on. And while these things happen I try to remain calm and keep my faith that our democracy wont crumble like so many shortbread cookies just because this lying Star Wars hutt needed to make his dick feel bigger by running for President."}, {"130d": "But dammit if this guy isn’t insulting my gender right to its face on a regular basis. It’s not a guise, he’s not burlesquing his devaluation of women behind a feathery fan. It’s literally blatant sexism served to us in a taco bowl. I think we should hit a line drive full of his own bullshit right back into that smug, bloviating, arrogant, delusional, persimmon face."}, {"e71e": "It’s not that he proclaimed April Sexual Assault Awareness month eight years after President Obama did or 16 years after it was first observed nationally, with the pompous language you’d expect of a king in medieval times:"}, {"ad95": "From the official statement released by The White House 3/31/17."}, {"4325": "It’s not even the irony of this statement coming from a man who himself has been accused (and not just once, kids) of sexual harassment and assault. It’s not the stomach-turning, bullshittish nature of this statement coming out of the same mouth that said “grab ’em by the pussy” in jovial, casual conversation. It’s not even that he’s lived an actual lifetime soaked in derogatory, disgraceful, demeaning comments to and about women."}, {"e709": "What really lit my tampon string on fire, ladies, was the fact that when Bill O’Reilly sampled a morsel of the poopcake he deserves for dinner when his advertisers started pulling their ads from his show due to sexual harassment claims, the President who only days earlier stood by the statement above, said this, too:"}, {"73f8": "via The Daily Beast"}, {"0e26": "“Speaking in the Oval Office, Donald J. Trump praised Mr. O’Reilly as “a good person” and declared, “I don’t think Bill did anything wrong,” days after The New York Times reported that five women had received settlements after making harassment claims against him.” — The New York Times"}, {"6fbf": "Trump thinks O’Reilly, even in light of repeated accusations (maybe he only likes stories that are entirely made up?) is a “good person” who didn’t do “anything wrong.” Not that he didn’t do anything, but that he didn’t do anything wrong."}, {"1c00": "Our President, head of the executive branch of our government (though I’m pretty sure he thinks he rules them all like the one ring), thinks there’s nothing wrong with harassing women. He thinks there’s nothing wrong with grabbing them, kissing them, touching them when he wants to. Though if we grabbed, touched, or (vomit) kissed him without his express permission, there is actually federal legislation in place requiring the Secret Service to take action to protect him from us."}, {"0d76": "This Presidency will be marked by countless moments where we said things we didn’t think we’d ever have to say. Where things we knew to be good and true will be tested by the ignorant, the bigoted, and the inexperienced. At first I was horrified by these moments, but you know what, if that’s the game this shitbag wants to play, I’m in."}, {"5aa4": "Women are not objects. Women are not here on earth for your visual and sexual pleasure. Women are not ornamental niceties or tokens in place to give the impression you care about us. You’ll need actual policy to prove that. Women are equal in value to men. Women are equal in capability to men. (Women are actually superior in capability if we want to get specific here. Try creating new life on earth you disgusting sperm vessel.)"}, {"3d0f": "ANYWAY. This is a President who “proclaims” April Sexual Assault Awareness month and days later rolls back the previous administration’s workplace protections for women in companies with federal contracts. Meaning your tax dollars can now be awarded to companies where people can sexually harass whoever they want and have a much easier time getting away with it."}, {"1d40": "He’s telling us he thinks we’re worthless, he’s telling us to our face. Not with podium drivel where he declares himself better at everything than everyone, but in a way that’s far more true: with his actions. He’s showing us our place is on a pageant set, not on a ballot."}, {"42f7": "We don’t accept contradictory speech and actions from our loved ones, our friends, our coworkers. Don’t accept it from elected officials, either. Especially not this one. Keep talking, keep writing, keep taking action. He’s not the brightest flash in the photo pit, this guy, so we might have to repeat it a few times, maybe thousands of times. But his gig has a countdown clock, and our worth doesn’t:"}, {"8929": "Mr. President, you’ve done something wrong. Don’t say you’re sorry. Do your job."}], "content": "This President Thinks Women Should Decorate The World, Not Run It It’s wrong to touch a woman. It’s fine to touch an object. via http://sculptures.website/ We can’t swing at every pitch. It’s going to be a long four years (maybe) and we need to keep our strength up. He’s running a for-profit presidency staffed by rich, out-of-touch bigots and like…his kids. He’s embarrassing us in front of world leaders at best, provoking them at worst. He’s executive-ordering away the very notions our country was founded on. And while these things happen I try to remain calm and keep my faith that our democracy wont crumble like so many shortbread cookies just because this lying Star Wars hutt needed to make his dick feel bigger by running for President. But dammit if this guy isn’t insulting my gender right to its face on a regular basis. It’s not a guise, he’s not burlesquing his devaluation of women behind a feathery fan. It’s literally blatant sexism served to us in a taco bowl. I think we should hit a line drive full of his own bullshit right back into that smug, bloviating, arrogant, delusional, persimmon face. It’s not that he proclaimed April Sexual Assault Awareness month eight years after President Obama did or 16 years after it was first observed nationally, with the pompous language you’d expect of a king in medieval times: From the official statement released by The White House 3/31/17. It’s not even the irony of this statement coming from a man who himself has been accused (and not just once, kids) of sexual harassment and assault. It’s not the stomach-turning, bullshittish nature of this statement coming out of the same mouth that said “grab ’em by the pussy” in jovial, casual conversation. It’s not even that he’s lived an actual lifetime soaked in derogatory, disgraceful, demeaning comments to and about women. What really lit my tampon string on fire, ladies, was the fact that when Bill O’Reilly sampled a morsel of the poopcake he deserves for dinner when his advertisers started pulling their ads from his show due to sexual harassment claims, the President who only days earlier stood by the statement above, said this, too: via The Daily Beast “Speaking in the Oval Office, Donald J. Trump praised Mr. O’Reilly as “a good person” and declared, “I don’t think Bill did anything wrong,” days after The New York Times reported that five women had received settlements after making harassment claims against him.” — The New York Times Trump thinks O’Reilly, even in light of repeated accusations (maybe he only likes stories that are entirely made up?) is a “good person” who didn’t do “anything wrong.” Not that he didn’t do anything, but that he didn’t do anything wrong. Our President, head of the executive branch of our government (though I’m pretty sure he thinks he rules them all like the one ring), thinks there’s nothing wrong with harassing women. He thinks there’s nothing wrong with grabbing them, kissing them, touching them when he wants to. Though if we grabbed, touched, or (vomit) kissed him without his express permission, there is actually federal legislation in place requiring the Secret Service to take action to protect him from us. This Presidency will be marked by countless moments where we said things we didn’t think we’d ever have to say. Where things we knew to be good and true will be tested by the ignorant, the bigoted, and the inexperienced. At first I was horrified by these moments, but you know what, if that’s the game this shitbag wants to play, I’m in. Women are not objects. Women are not here on earth for your visual and sexual pleasure. Women are not ornamental niceties or tokens in place to give the impression you care about us. You’ll need actual policy to prove that. Women are equal in value to men. Women are equal in capability to men. (Women are actually superior in capability if we want to get specific here. Try creating new life on earth you disgusting sperm vessel.) ANYWAY. This is a President who “proclaims” April Sexual Assault Awareness month and days later rolls back the previous administration’s workplace protections for women in companies with federal contracts. Meaning your tax dollars can now be awarded to companies where people can sexually harass whoever they want and have a much easier time getting away with it. He’s telling us he thinks we’re worthless, he’s telling us to our face. Not with podium drivel where he declares himself better at everything than everyone, but in a way that’s far more true: with his actions. He’s showing us our place is on a pageant set, not on a ballot. We don’t accept contradictory speech and actions from our loved ones, our friends, our coworkers. Don’t accept it from elected officials, either. Especially not this one. Keep talking, keep writing, keep taking action. He’s not the brightest flash in the photo pit, this guy, so we might have to repeat it a few times, maybe thousands of times. But his gig has a countdown clock, and our worth doesn’t: Mr. President, you’ve done something wrong. Don’t say you’re sorry. Do your job. ", "parent": "", "title": "This President Thinks Women Should Decorate The World, Not Run It", "child": "121_1", "name": "121"}