{"name": "1212", "parent": "", "content": "Distant How My Heart Works Courtesy of KhenPokarten.org If you were to ask mewhen was the last time I was in love, I’d say — “Oh, just yesterday. the breeze from the treestucked me in last nightwhile I dreamed of new rulesand kicked about in my house-shoes.” But, if you were to ask mewhen was the last timeI fell for someone, I’dhave a harder time answering this.my lips would curl into a V, shift nervously and we’d end upon the wrong side of the question.I’d get upset. You’d want to knowwhy and I couldn’t provide theanswers to you. I just know. What I know. And what I know is I do not know ME yet. I thought I did. Yes, I used to be easier to deal with. Happenstance was a thing of culture, inevitable. Now, I am searching for odds and ends and tape doesn’t seem to hold them together. In pieces, I have found methods to my madness stuck in places I never thought to look, behind dusty doors that hide secrets not yet ripe enough to share. I thought I knew Me. I was sure of it. Until… There’s always someone, a cause. The deep that carries into the deep. A mountain welcoming all molehills. There’s always someone… And, that someone may not know they’re your someone. You may not know you’re theirs. The two of you, shy-in-wait, unable to speak what has already been spoken, so you make up stories as to what you are supposed to be, but leave out all of the reasons why you cannot be. Distant… Lovers… One opens a door to pauses and taps, unafraid to dance amongst the stars. The other wishes the door to remain closed. No need in getting hurt all over again. Who has time to heal? Work in the morning. Work at night. I am responsible. I keep up with my daily routine. I take my vitamins. I visit my physician every three to six months. She and her staff poke and prod. They make sure my levels are where they need to be for me to continue to live a vibrant life. I smile. I nod. I tell her I have gained 23 lbs. She looks at my digital chart, nods, smiles, takes in what I am saying. She asks me about the weight gain. I tell her about you. Then, I stop… She asks the same questions she asks every three to six months, “Are you depressed? How is work? Still stressed?” I lie. She will write a prescription, I will make it a ball and as soon as I am not within earshot, pitch it to the nearest wastebin. I do not need permission to feel.I do not need medication because I do. She will ask me at my next visit if I am still eating my leafy greens. If I am sticking with an exercise routine. If I have had any trouble with the medication. I will answer every question. I tell her of the gnawing painthat won’t let up. We discuss hot baths.salts, natural regimensthat will not harm my skin.She hands me a pamphletabout coping withloss. At that moment, I realize, I have not lost a thing. It is still in my heart. I cannot set it free. She does not understand. She is not in this body, wearing this skin, walking in these shoes. She smiles, she nods, she escorts me to the lab where the Phlebotomist does not even ask me, “Which arm would you prefer?” anymore. I just fling one out, hold my breath, and wait… I wait for her to tell me,“They will email you withyour results. If anything is wrong,Dr. So and So will call you.You’re used to this, though, aren’t you, Tre?” Yes. Yes, I am. I sit. I feel my heart pressing up against me.Fighting me more than it has before.But, I am stubborn.I let it have its way for a few seconds,then I lose control.I sing myself a lullabyand fall asleep assured thatthe next day will not be liketoday and it isn’t. Distant is the heart that does not remember how to love. Closer to a new beginning, this chapter almost finished, I write-in a different main character, someone whoRemembers that bumps in the road are not permanent. Together, we pump my heart back to a beating state and we move on. Author’s Note: For those of you who have participated and are participating in the Call for Submissions on *heart* work, I truly thank you. This got me back into the swing of things and I am most grateful. H. Nemesis Nyx, Sean Howard, JB, Alexainie, and Classical Sass, the love I have for you guys as a team and as individuals, knows no bounds. Y’all have my heart. ", "title": "Distant", "sentences": [{"e484": "Distant"}, {"b933": "How My Heart Works"}, {"98ac": "Courtesy of KhenPokarten.org"}, {"589f": "If you were to ask mewhen was the last time I was in love, I’d say — “Oh, just yesterday. the breeze from the treestucked me in last nightwhile I dreamed of new rulesand kicked about in my house-shoes.”"}, {"b0c8": "But, if you were to ask mewhen was the last timeI fell for someone, I’dhave a harder time answering this.my lips would curl into a V, shift nervously and we’d end upon the wrong side of the question.I’d get upset. You’d want to knowwhy and I couldn’t provide theanswers to you."}, {"3a12": "I just know. What I know. And what I know is I do not know ME yet. I thought I did. Yes, I used to be easier to deal with. Happenstance was a thing of culture, inevitable. Now, I am searching for odds and ends and tape doesn’t seem to hold them together. In pieces, I have found methods to my madness stuck in places I never thought to look, behind dusty doors that hide secrets not yet ripe enough to share. I thought I knew Me. I was sure of it."}, {"58f8": "Until…"}, {"ee30": "There’s always someone, a cause. The deep that carries into the deep. A mountain welcoming all molehills. There’s always someone… And, that someone may not know they’re your someone. You may not know you’re theirs. The two of you, shy-in-wait, unable to speak what has already been spoken, so you make up stories as to what you are supposed to be, but leave out all of the reasons why you cannot be."}, {"9bda": "Distant… Lovers…"}, {"5f59": "One opens a door to pauses and taps, unafraid to dance amongst the stars. The other wishes the door to remain closed. No need in getting hurt all over again. Who has time to heal? Work in the morning. Work at night."}, {"185a": "I am responsible. I keep up with my daily routine. I take my vitamins. I visit my physician every three to six months. She and her staff poke and prod. They make sure my levels are where they need to be for me to continue to live a vibrant life. I smile. I nod. I tell her I have gained 23 lbs. She looks at my digital chart, nods, smiles, takes in what I am saying. She asks me about the weight gain. I tell her about you."}, {"e517": "Then, I stop…"}, {"3b74": "She asks the same questions she asks every three to six months,"}, {"cad4": "“Are you depressed? How is work? Still stressed?”"}, {"dd96": "I lie."}, {"e5d0": "She will write a prescription, I will make it a ball and as soon as I am not within earshot, pitch it to the nearest wastebin."}, {"ad2b": "I do not need permission to feel.I do not need medication because I do."}, {"ad9c": "She will ask me at my next visit if I am still eating my leafy greens. If I am sticking with an exercise routine. If I have had any trouble with the medication. I will answer every question."}, {"bc56": "I tell her of the gnawing painthat won’t let up. We discuss hot baths.salts, natural regimensthat will not harm my skin.She hands me a pamphletabout coping withloss."}, {"9dec": "At that moment, I realize, I have not lost a thing. It is still in my heart. I cannot set it free. She does not understand. She is not in this body, wearing this skin, walking in these shoes. She smiles, she nods, she escorts me to the lab where the Phlebotomist does not even ask me, “Which arm would you prefer?” anymore. I just fling one out, hold my breath, and wait…"}, {"b937": "I wait for her to tell me,“They will email you withyour results. If anything is wrong,Dr. So and So will call you.You’re used to this, though, aren’t you, Tre?”"}, {"459f": "Yes. Yes, I am."}, {"e0c1": "I sit. I feel my heart pressing up against me.Fighting me more than it has before.But, I am stubborn.I let it have its way for a few seconds,then I lose control.I sing myself a lullabyand fall asleep assured thatthe next day will not be liketoday and it isn’t."}, {"d01c": "Distant is the heart that does not remember how to love. Closer to a new beginning, this chapter almost finished, I write-in a different main character, someone whoRemembers that bumps in the road are not permanent."}, {"2aa9": "Together, we pump my heart back to a beating state and we move on."}, {"80a7": "Author’s Note: For those of you who have participated and are participating in the Call for Submissions on *heart* work, I truly thank you. This got me back into the swing of things and I am most grateful. H. Nemesis Nyx, Sean Howard, JB, Alexainie, and Classical Sass, the love I have for you guys as a team and as individuals, knows no bounds. Y’all have my heart."}], "child": "1212_1\t1212_2\t1212_3\t1212_4\t1212_5\t1212_6\t1212_7\t1212_8\t1212_9\t1212_10\t1212_11\t1212_12\t1212_13\t1212_14\t1212_15\t1212_16\t1212_17\t1212_18\t1212_19\t1212_20\t1212_21\t1212_22\t1212_23\t1212_24\t1212_251212_1\t1212_2\t1212_3\t1212_4\t1212_5\t1212_6\t1212_7\t1212_8\t1212_9\t1212_10\t1212_11\t1212_12\t1212_13\t1212_14\t1212_15\t1212_16\t1212_17\t1212_18\t1212_19\t1212_20\t1212_21\t1212_22\t1212_23\t1212_24\t1212_25"}