{"name": "1213", "parent": "", "content": "Single in Chennai at 32 Of Compromises, Methods to “Fix” Me, Misogyny Pixabay I am 32, female and single, an outlier, an anomaly, an object of pity to some, an opportunity for others — that’s how society defines me — and only because of one factor — that I am single; at an age where almost all my peers and people much younger than me are married and have children. So, as a person, I’m a failure to them. This generally presents itself in two forms; one, asking me to compromise on my supposed “standards” and two, methods to “fix” me. Let’s take the first one — my “standards”. Arranged marriage is common here and although, I don’t fully believe in it (I think of it as blind dates set up by parents), I’d given in a few years earlier and agreed to go through that process. Just like how you would set your preferences in Tinder, you have to give a set of “standards” and the search would be based on this. So, the first thing, everyone tells me is, “You need to lower your standards. Compromise. And you will surely be married soon.” And once more, for what feels like the zillionth time, I explain what I want — (a) a like minded person (b) in Chennai (c) in my age group and preferably, tall. They look askance at me and say, “Is that all? Hmm… Then you need to compromise. This “like-minded” thing you’re saying… How would you know?” And then they give me a lecture on how all marriages are built on compromise. Next, they try to tell me that I should just move to wherever the prospective groom is. When I explain the reasons I have for staying in Chennai, they ask me to look for shorter people. Been there, done that, didn’t work for either party. Next, they say that I must be doing something wrong. And so it begins, the methods I must use to “fix” myself. One person said that I should get my skin bleached, so that I would be more “attractive”. Someone told me that my personality was a big minus, meaning that I was confident and assertive and that I should just listen and nod to everything. Another told me that I should lose weight and get a breast reduction, so I would be thinner and I’m at a healthy BMI. A person said that if I just quit my job, stay at home and do household chores, I could get married very quickly, because nothing is more attractive than a robot that mindlessly does chores. Some more things people say: I earn too much (I worked my ass off, for years, for what I’ve accomplished), I studied too much (post-grad), I work too much (how else do you succeed?), I am too tall (5'8\") and that I should maybe try to hunch a bit (I am confident and I will walk tall. I am not ashamed of my height.), I am not very sociable (I loathe large groups, small talk and gossip. I’m nearer the introverted end of the scale.), the misogyny continues incessantly. And almost everyone asks me to go to some temple, do some pooja or some other thing and to please my family, I do it too, even though I don’t believe in rituals. Frankly, I do it also because, it stops them from asking a million times, if I did what they asked. I have also gone on arranged blind dates and to date (pun unintended), not one has worked. One guy I met, said that I should quit my job because he was earning enough — even though and maybe because I was earning about thrice his salary. Another guy tried to tell me that I was sure to like him because, he had seen my photo and he liked me — after just a goddamn photo and a phone call where I found very little to talk to him about. And then there are those who think that because of my age, I’m desperate for company and try to sweet-talk me. One guy I vaguely remember from college messaged me asking if he could take me out on a date while proudly posting the next second about his two year marriage anniversary. And all the sleazy men who try to touch me, passing it off as an inadvertent gesture. I am so fucking tired of this misogyny, of people trying to “fix” me, to change me. I am not perfect, but neither do I need fixing. If, as they say, I give up everything, my confidence, my personality, my job, my aims, my desires — if I give everything up, everything I am; just for the chance to be with someone; isn’t that suicide? And a relationship where I am just a dead body, is it worth it? Fucking No. I’ll stay me. Thanks. I apologise for all the words within quotes. Otherwise, there would be too many expletives. To Tre, thank you for your words, your kindness, your encouragement. Thank you. ", "title": "Single in Chennai at 32", "sentences": [{"9aff": "Single in Chennai at 32"}, {"07e3": "Of Compromises, Methods to “Fix” Me, Misogyny"}, {"8e68": "Pixabay"}, {"41b7": "I am 32, female and single, an outlier, an anomaly, an object of pity to some, an opportunity for others — that’s how society defines me — and only because of one factor — that I am single; at an age where almost all my peers and people much younger than me are married and have children. So, as a person, I’m a failure to them."}, {"2d29": "This generally presents itself in two forms; one, asking me to compromise on my supposed “standards” and two, methods to “fix” me. Let’s take the first one — my “standards”. Arranged marriage is common here and although, I don’t fully believe in it (I think of it as blind dates set up by parents), I’d given in a few years earlier and agreed to go through that process. Just like how you would set your preferences in Tinder, you have to give a set of “standards” and the search would be based on this. So, the first thing, everyone tells me is, “You need to lower your standards. Compromise. And you will surely be married soon.”"}, {"42fd": "And once more, for what feels like the zillionth time, I explain what I want — (a) a like minded person (b) in Chennai (c) in my age group and preferably, tall. They look askance at me and say, “Is that all? Hmm… Then you need to compromise. This “like-minded” thing you’re saying… How would you know?” And then they give me a lecture on how all marriages are built on compromise. Next, they try to tell me that I should just move to wherever the prospective groom is. When I explain the reasons I have for staying in Chennai, they ask me to look for shorter people. Been there, done that, didn’t work for either party. Next, they say that I must be doing something wrong."}, {"5636": "And so it begins, the methods I must use to “fix” myself. One person said that I should get my skin bleached, so that I would be more “attractive”. Someone told me that my personality was a big minus, meaning that I was confident and assertive and that I should just listen and nod to everything. Another told me that I should lose weight and get a breast reduction, so I would be thinner and I’m at a healthy BMI. A person said that if I just quit my job, stay at home and do household chores, I could get married very quickly, because nothing is more attractive than a robot that mindlessly does chores."}, {"0669": "Some more things people say: I earn too much (I worked my ass off, for years, for what I’ve accomplished), I studied too much (post-grad), I work too much (how else do you succeed?), I am too tall (5'8\") and that I should maybe try to hunch a bit (I am confident and I will walk tall. I am not ashamed of my height.), I am not very sociable (I loathe large groups, small talk and gossip. I’m nearer the introverted end of the scale.), the misogyny continues incessantly."}, {"50c9": "And almost everyone asks me to go to some temple, do some pooja or some other thing and to please my family, I do it too, even though I don’t believe in rituals. Frankly, I do it also because, it stops them from asking a million times, if I did what they asked."}, {"fadc": "I have also gone on arranged blind dates and to date (pun unintended), not one has worked. One guy I met, said that I should quit my job because he was earning enough — even though and maybe because I was earning about thrice his salary. Another guy tried to tell me that I was sure to like him because, he had seen my photo and he liked me — after just a goddamn photo and a phone call where I found very little to talk to him about."}, {"f810": "And then there are those who think that because of my age, I’m desperate for company and try to sweet-talk me. One guy I vaguely remember from college messaged me asking if he could take me out on a date while proudly posting the next second about his two year marriage anniversary. And all the sleazy men who try to touch me, passing it off as an inadvertent gesture."}, {"b1a7": "I am so fucking tired of this misogyny, of people trying to “fix” me, to change me. I am not perfect, but neither do I need fixing. If, as they say, I give up everything, my confidence, my personality, my job, my aims, my desires — if I give everything up, everything I am; just for the chance to be with someone; isn’t that suicide? And a relationship where I am just a dead body, is it worth it?"}, {"d1f6": "Fucking No. I’ll stay me. Thanks."}, {"f4af": "I apologise for all the words within quotes. Otherwise, there would be too many expletives."}, {"20b4": "To Tre, thank you for your words, your kindness, your encouragement. Thank you."}], "child": "1213_1\t1213_2\t1213_3\t1213_4\t1213_5\t1213_6\t1213_7\t1213_8\t1213_9\t1213_10\t1213_11\t1213_12\t1213_13\t1213_14\t1213_15\t1213_16\t1213_17\t1213_18\t1213_19\t1213_20\t1213_21\t1213_22\t1213_23"}