{"name": "1215", "parent": "", "content": "How I Failed in My Parents’ Eyes I see it every time they look at me. Courtesy of Lateefa Spiker Failure.Disappointment. Or maybe it’s just grief for what they assume they’ve lost. You see, in their eyes, they’ve lost me. They’ve lost me to another world that they don’t or won’t understand. I was born and raised Muslim. I was supposed to stay Muslim, marry a Muslim man, (hopefully one they approved of) and raise Muslim children. Instead, I’ve renounced my faith in Islam, I’m dating a non-Muslim man (they definitely don’t approve of), and as for children, if I have any, they won’t be raised Muslim. For most of my life as a Muslim as a child, and then later as an adult, I always felt this suffocating panic that I wasn’t good enough. I was sure I was committing too many sins, and no matter what I did I felt this nagging guilt. No matter what I did, I felt that somehow I had failed. My parents were happy though, for the most part, because I was following the “straight path.” They had done their duty as parents, by raising a good Muslim daughter. Little did they know at the time that I was deeply unhappy. Praying the five obligatory prayers a day brought me no comfort, no peace, and I felt no connection to God. I felt more at peace doing yoga than performing the ritual I had memorized since the age of 5. It began slowly at first, but I felt myself slipping away. I found myself sitting on the prayer mat and simply thinking. Thinking of all the ways this religion didn’t make sense to me and how I felt more at peace simply meditating than having to perform a ritual that no longer meant anything to me. So I began to lie. Whenever my parents asked if I’d prayed, I’d lie. I simply go in my room and lie on my bed for five minutes pretending that all the while I had prayed. It didn’t make sense to me that a God who was merciful and understanding would want me to pray to him when the ritual left me feeling more empty than whole. You weren’t supposed to question too much, though. So I was left to look things up on my own. Finding out that all I had been taught over the years in private Islamic schools, were just the basics of Islam and not the history of it. There were other rules that were left out. Rules about how much actual rights I had as a woman. I had always been told Islam was a feminist religion, but how feminist could a religion possibly be that proclaimed a woman’s voice equaled half of a man’s in court. That a woman couldn’t leave the house without her husband’s permission. She didn’t have the right to divorce. Her portion of inheritance was less than a man’s. She wasn’t allowed to refuse her husband sex. In other words, she didn’t even have the right to her own body. How was I supposed to stay in a religion, that as a woman, gave me no voice? Yet, I still see it in their eyes. I failed them because I found out the truth. I failed them because I got out. I failed them because I decided to become my own person. I failed them because I gained independence. I failed them because I gained happiness and freedom. ", "title": "How I Failed in My Parents’ Eyes", "sentences": [{"817f": "How I Failed in My Parents’ Eyes"}, {"3b53": "I see it every time they look at me."}, {"e50a": "Courtesy of Lateefa Spiker"}, {"45dc": "Failure.Disappointment."}, {"2908": "Or maybe it’s just grief for what they assume they’ve lost. You see, in their eyes, they’ve lost me. They’ve lost me to another world that they don’t or won’t understand."}, {"4c2f": "I was born and raised Muslim. I was supposed to stay Muslim, marry a Muslim man, (hopefully one they approved of) and raise Muslim children. Instead, I’ve renounced my faith in Islam, I’m dating a non-Muslim man (they definitely don’t approve of), and as for children, if I have any, they won’t be raised Muslim."}, {"39dd": "For most of my life as a Muslim as a child, and then later as an adult, I always felt this suffocating panic that I wasn’t good enough. I was sure I was committing too many sins, and no matter what I did I felt this nagging guilt. No matter what I did, I felt that somehow I had failed."}, {"0d55": "My parents were happy though, for the most part, because I was following the “straight path.” They had done their duty as parents, by raising a good Muslim daughter. Little did they know at the time that I was deeply unhappy."}, {"f4db": "Praying the five obligatory prayers a day brought me no comfort, no peace, and I felt no connection to God. I felt more at peace doing yoga than performing the ritual I had memorized since the age of 5. It began slowly at first, but I felt myself slipping away. I found myself sitting on the prayer mat and simply thinking. Thinking of all the ways this religion didn’t make sense to me and how I felt more at peace simply meditating than having to perform a ritual that no longer meant anything to me."}, {"1cdb": "So I began to lie."}, {"e2ca": "Whenever my parents asked if I’d prayed, I’d lie. I simply go in my room and lie on my bed for five minutes pretending that all the while I had prayed. It didn’t make sense to me that a God who was merciful and understanding would want me to pray to him when the ritual left me feeling more empty than whole."}, {"d718": "You weren’t supposed to question too much, though. So I was left to look things up on my own. Finding out that all I had been taught over the years in private Islamic schools, were just the basics of Islam and not the history of it. There were other rules that were left out. Rules about how much actual rights I had as a woman. I had always been told Islam was a feminist religion, but how feminist could a religion possibly be that proclaimed a woman’s voice equaled half of a man’s in court. That a woman couldn’t leave the house without her husband’s permission. She didn’t have the right to divorce. Her portion of inheritance was less than a man’s. She wasn’t allowed to refuse her husband sex. In other words, she didn’t even have the right to her own body. How was I supposed to stay in a religion, that as a woman, gave me no voice?"}, {"5336": "Yet, I still see it in their eyes. I failed them because I found out the truth. I failed them because I got out. I failed them because I decided to become my own person. I failed them because I gained independence. I failed them because I gained happiness and freedom."}], "child": "1215_1\t1215_2\t1215_3\t1215_4\t1215_5"}