{"name": "1219", "parent": "", "content": "It’s my problem Finding space in marriage to dream and love more fully. My wife’s been out of town for a week and I’m going crazy. When we’re together, I long for space, just a little time for myself. But now I actually have a whole week alone and I don’t know what to do with myself. Of course I don’t tell her I need space. That’s the problem. Oh. Right. It’s my problem. Married in College These first five years of marriage, I’ve tried to love my wife well by spending more time with her. We got married in the middle of our junior fall semester — wedding on Friday, school on Tuesday! — and we both had jobs, so to say we struggled to find time for each other is putting it kindly. We were starved for time. To compensate, I vowed to myself when we graduated I would devote my spare time to her. I wanted to show her I loved her with all my broke self could afford— time. Lots of time. Twenty pounds and 4 years later, I’m still doing the same thing. The Problem Appears It was beneficial at first. At some point, though, the love turned into the hum-drum. I grew passive. I grew lazy. (“What do you wanna do tonight, honey?”) I tucked my aspirations away on the back shelf of our closet. I glanced at them once in a while, even took them down and fiddled with them on occasion. But I never felt the freedom to use them like I hoped. And hope deferred makes the heart sick. Finding Myself In my effort to please, to acquiesce to what I think she wants, I made myself too dependent on her every move. It’s caused me to be irritable. Touchy. Oversensitive and moody (beyond the typical introverted nature). I can tell it drains her more than revitalizes her, which is the opposite of what our relationship should do. My lack of self-awareness and honesty has made for an underwhelming, unsatisfied life for both of us. My self-imposed restrictions are not helping. I am limiting the joy of our marriage by undervaluing time alone to think, dream, pursue interests and hobbies. Time to be myself. It’s not her. It’s me. Finding Us As this week has gone on, my sweet wife has become increasingly giddy. I keep getting texts from her saying she misses me. I’m reminded just how dang cute my wife is. As difficult as it may be for me to initiate this conversation, I think some space between us will be a good thing. Time to shoot back some love emojis. Postscript: My wife read this, and the other night I asked her what she wanted to do to hang out — she gently reminded me of this post. Clearly, I am a work in progress. ", "title": "It’s my problem", "sentences": [{"4ad9": "It’s my problem"}, {"0676": "Finding space in marriage to dream and love more fully."}, {"8214": "My wife’s been out of town for a week and I’m going crazy."}, {"aa28": "When we’re together, I long for space, just a little time for myself. But now I actually have a whole week alone and I don’t know what to do with myself."}, {"b46a": "Of course I don’t tell her I need space. That’s the problem."}, {"8f91": "Oh. Right. It’s my problem."}, {"c304": "Married in College"}, {"bc88": "These first five years of marriage, I’ve tried to love my wife well by spending more time with her. We got married in the middle of our junior fall semester — wedding on Friday, school on Tuesday! — and we both had jobs, so to say we struggled to find time for each other is putting it kindly. We were starved for time."}, {"70ee": "To compensate, I vowed to myself when we graduated I would devote my spare time to her. I wanted to show her I loved her with all my broke self could afford— time. Lots of time."}, {"a247": "Twenty pounds and 4 years later, I’m still doing the same thing."}, {"5cdd": "The Problem Appears"}, {"2480": "It was beneficial at first. At some point, though, the love turned into the hum-drum. I grew passive. I grew lazy. (“What do you wanna do tonight, honey?”)"}, {"ad1f": "I tucked my aspirations away on the back shelf of our closet. I glanced at them once in a while, even took them down and fiddled with them on occasion. But I never felt the freedom to use them like I hoped."}, {"c807": "And hope deferred makes the heart sick."}, {"134c": "Finding Myself"}, {"edeb": "In my effort to please, to acquiesce to what I think she wants, I made myself too dependent on her every move."}, {"7a6a": "It’s caused me to be irritable. Touchy. Oversensitive and moody (beyond the typical introverted nature). I can tell it drains her more than revitalizes her, which is the opposite of what our relationship should do."}, {"92d6": "My lack of self-awareness and honesty has made for an underwhelming, unsatisfied life for both of us."}, {"02ea": "My self-imposed restrictions are not helping. I am limiting the joy of our marriage by undervaluing time alone to think, dream, pursue interests and hobbies. Time to be myself."}, {"709d": "It’s not her. It’s me."}, {"8e1e": "Finding Us"}, {"5262": "As this week has gone on, my sweet wife has become increasingly giddy. I keep getting texts from her saying she misses me. I’m reminded just how dang cute my wife is."}, {"5e5e": "As difficult as it may be for me to initiate this conversation, I think some space between us will be a good thing."}, {"0aac": "Time to shoot back some love emojis."}, {"72e3": "Postscript: My wife read this, and the other night I asked her what she wanted to do to hang out — she gently reminded me of this post. Clearly, I am a work in progress."}], "child": "1219_1\t1219_21219_1\t1219_2"}