{"name": "1221", "parent": "", "content": "Love Trumps Hate, a LOVE Story❤️. I breathed this today. Over and over. The past 8 days have been suffocating, for too many reason to write yet. Processing. Working through the pain-body (a term by Eckhart Tolle). I am love, that’s who I am. I show love by being present. Now I create, by writing. This is new. Creating with my truth, my words, from love and with love. This concept is all over my page. My friend, my best friend, my primal partner, my soul mate, the man I brain couple with… Our bond collapsed under the Trump spell. Our brain coupling dismantled last Wednesday morning. It was awful. Sadness, rage, defeat, anger, denial, kicked in the stomach (figuratively), walls were thrown up. You want to talk about walls? Walls were hoisted as fast as fuck. This doesn’t happen. We have no boundaries. We may be 1/2 a country away, but our bond is deep. It did though. It was exhausting. I shut down. He tried to reach me. He couldn’t get in. Then he shut down. I tried to reach him. I couldn’t get in. But today I surrendered — surrendered to the fact that I didn’t know how I felt anymore. Chrispy says, Let information settle, without seeking clarity, and answers will percolate to the top. Chrispy Baghat Singh So true. This quote has never steered me wrong. I sat back. I processed, I waited, I stayed present with my raging emotions, my confusion, my frustration. Eckhart Tolle would be proud. Be aware. Sit with your emotion. Don’t judge, just acknowledge, and be present. Then, suddenly, it came. A huge wave of clarity washed over me. Oh god, I love when that happens! I opened Medium. And there it was. First thing I saw. Thank you Universe! Thank you Greg McCain! DesperationIt is your body after allthat obsesses mebut your spirit before all elsekeeps me in your lifegloriouspublication.com There it was. We are not ready for a lightning strike. I sent this to him. Our walls crumbled. I love him. I’m in love with him. I am love. I show love through Presence. We surrender. I sprinkle love to myself, to him, to everyone, everywhere. Always. Love Trumps Hate. Love Wins. Have you had to overcome walls in the last week? Please click the ❤️and let’s lift each other up. FierceForce 💃🏼 ", "title": "Love Trumps Hate, a LOVE Story❤️.", "sentences": [{"ab72": "Love Trumps Hate, a LOVE Story❤️."}, {"93c6": "I breathed this today. Over and over."}, {"1aa6": "The past 8 days have been suffocating, for too many reason to write yet. Processing. Working through the pain-body (a term by Eckhart Tolle)."}, {"a078": "I am love, that’s who I am. I show love by being present. Now I create, by writing. This is new. Creating with my truth, my words, from love and with love. This concept is all over my page."}, {"bd8e": "My friend, my best friend, my primal partner, my soul mate, the man I brain couple with…"}, {"abe3": "Our bond collapsed under the Trump spell. Our brain coupling dismantled last Wednesday morning. It was awful. Sadness, rage, defeat, anger, denial, kicked in the stomach (figuratively), walls were thrown up. You want to talk about walls? Walls were hoisted as fast as fuck."}, {"d727": "This doesn’t happen. We have no boundaries. We may be 1/2 a country away, but our bond is deep. It did though. It was exhausting. I shut down. He tried to reach me. He couldn’t get in. Then he shut down. I tried to reach him. I couldn’t get in."}, {"a80f": "But today I surrendered — surrendered to the fact that I didn’t know how I felt anymore."}, {"b0c0": "Chrispy says,"}, {"8e90": "Let information settle, without seeking clarity, and answers will percolate to the top."}, {"40fb": "Chrispy Baghat Singh"}, {"872e": "So true. This quote has never steered me wrong."}, {"dd22": "I sat back. I processed, I waited, I stayed present with my raging emotions, my confusion, my frustration. Eckhart Tolle would be proud. Be aware. Sit with your emotion. Don’t judge, just acknowledge, and be present."}, {"81f2": "Then, suddenly, it came. A huge wave of clarity washed over me. Oh god, I love when that happens! I opened Medium. And there it was. First thing I saw. Thank you Universe! Thank you Greg McCain!"}, {"b367": "DesperationIt is your body after allthat obsesses mebut your spirit before all elsekeeps me in your lifegloriouspublication.com"}, {"c475": "There it was. We are not ready for a lightning strike. I sent this to him. Our walls crumbled. I love him. I’m in love with him. I am love. I show love through Presence. We surrender. I sprinkle love to myself, to him, to everyone, everywhere. Always."}, {"b3f2": "Love Trumps Hate."}, {"3adb": "Love Wins."}, {"257f": "Have you had to overcome walls in the last week? Please click the ❤️and let’s lift each other up."}, {"e1b6": "FierceForce 💃🏼"}], "child": "1221_1"}