{"name": "1222", "parent": "", "content": "What should we do when we don’t know what to say? On bystander intervention and kindness amazing art photography credit: Coral Cameron Francis It’s just after six on a Tuesday evening, and I am walking down the sidewalk with a coworker. We’re going out to dinner, to catch up after a long period of not seeing each other. Though tired, we are both in a good mood. We are approaching an empty bench; a woman is just sitting down at one end of it. As we get closer, I realize that although there are no tears on her cheeks, she is sobbing. Dry, hollow sobs. She’s holding a pack of cigarettes and a lighter in her hand, but she is too upset to smoke. I can feel my companion’s discomfort as he tries to ignore her. I don’t want to ignore her. Her sadness is so palpable it seems to be bringing the twilight down faster. I look at her sympathetically, wanting to sit with her. But I don’t know what to say, and I can also, somehow, sense that my colleague’s presence would not be welcome. I’m not sure my own would be, either. We leave her sitting there, alone, even though there is plenty of room on the bench. I regret this all through dinner. — Three days later, I still have not forgotten the woman. I rerun the scene in my head, trying out different opening lines — anything besides “Are you ok?” since obviously she is not. I want her to know that I see her. Eventually I settle on a solution that involves asking my coworker to walk on ahead without me and order himself a drink. Then I approach the woman and ask, “May I sit with you for a little while?” This seems best. I can sit at the other end of the bench, giving her both space and company. Or I can just move on, if she prefers to be alone. In this scenario, I am offering a noninvasive comfort. I can sit with her as long as she needs. We can speak or be silent, as she wishes. This is, to paraphrase Terry Bain, choosing kindness. In fact, it is acting on kindness. I decide this is the best solution. — Late in the afternoon the following day, as I get out of the shower, I hear shouting from outside my apartment. I go to the window, and see a couple arguing below. They are loud, but otherwise unremarkable. I keep an eye on them anyway, in case things escalate. A few minutes later, I see the woman start smacking at the man’s shoulders. He is much taller than she is. Her arms flap up to reach him like the angry wings of a bird. I start to get dressed, my nonintervention from earlier in the week still fresh in my mind. If “ [c]ourage and …compassion…are habits to practice,” as Linch Zhang writes, I want to start practicing. I try to think of what I will do. Something that will signal my attention and awareness, but not make a big scene. My mind is blank. The woman is grabbing his ear. At first he was holding up a forearm to half-heartedly ward her off, but now he seems limp. Thinking back on the conversations I’ve had with friends about bystander intervention, I realize that all of them have been about intervening in potential sexual assault situations at parties…or harassment situations at bus stops or on trains. We don’t talk about how to smoothly redirect an intimate public argument. I am determined to do something anyway. But before I can finish dressing, I see that the man and woman have moved away from each other and away from my building. They are on opposite sides of the parking lot. I am off the hook. I feel relieved. The violence is over, and I would have to run after them to catch them. My next hour is spent futilely searching online for how to use bystander intervention strategies to address situations like this. There is nothing. Frustrated, I give up on the experts. I realize that the couple wouldn’t need to know I had been watching them. I realize that I could act as though I was casually walking by and say, “Hey, how’s it going?” to demonstrate that I see them, that I am aware something is taking place. Hopefully, my presence would defuse the situation. I decide this might work. I look again online for information. I look specifically for information on how, as a white person, to intervene in an argument between Black people without being an asshole. I find nothing. My solution to this scenario is less satisfactory than my solution to the woman on the bench. It doesn’t address what to do if they keep fighting after I talk to them. But it’s the best I can come up with. I go for a walk and call a friend. The sun is setting as I describe the argument to her. In the park, I realize that the same couple is there. They are still at a distance from each other, but the distance is much smaller, and they are shouting again. I take a deep breath, adjusting my path so that eventually I will cross theirs. As I get closer, I realize they have a third person with them, mediating. Relieved, I walk on by. I tell my friend what has transpired. She suggests calling the police in future. I tell her that sometimes calling the police isn’t a good solution to intimate partner abuse, and that I’m extra cautious about calling the police on people of color. (What if they thought the man was the abuser? What if…?) She has a point, though, and I acknowledge it. Neither of us are sure what the best solution is. I tell her about the woman from earlier in the week. I tell her my heart is still aching. She says, “You’ll know what to do next time.” Later that night, I think about active kindness — about reaching out to people to let them know you’re there, even when you are strangers to each other. I think about, as Devika Pathak puts it, taking time to be kind. Unintentionally, I find myself practicing: “May I sit with you for a little while?” There’s plenty of room on the bench. — — Epilogue After writing this, I searched again for helpful information on bystander intervention during public abuse. I was more successful, finding some good resources, such as this wiki and this publication. My best find, however, wasn’t actually my own find. A friend sent me a link to a Google doc titled “What to do instead of calling the police.” I don’t know who is responsible for it, but it’s a valuable resource, and I am so glad to have stumbled across it. ", "title": "What should we do when we don’t know what to say? On bystander intervention and kindness", "sentences": [{"1ae0": "What should we do when we don’t know what to say? On bystander intervention and kindness"}, {"d42c": "amazing art photography credit: Coral Cameron Francis"}, {"4b38": "It’s just after six on a Tuesday evening, and I am walking down the sidewalk with a coworker. We’re going out to dinner, to catch up after a long period of not seeing each other. Though tired, we are both in a good mood."}, {"88d2": "We are approaching an empty bench; a woman is just sitting down at one end of it. As we get closer, I realize that although there are no tears on her cheeks, she is sobbing. Dry, hollow sobs. She’s holding a pack of cigarettes and a lighter in her hand, but she is too upset to smoke. I can feel my companion’s discomfort as he tries to ignore her."}, {"ddb2": "I don’t want to ignore her. Her sadness is so palpable it seems to be bringing the twilight down faster. I look at her sympathetically, wanting to sit with her. But I don’t know what to say, and I can also, somehow, sense that my colleague’s presence would not be welcome. I’m not sure my own would be, either."}, {"bc5e": "We leave her sitting there, alone, even though there is plenty of room on the bench."}, {"d9d7": "I regret this all through dinner."}, {"9fa2": "—"}, {"3677": "Three days later, I still have not forgotten the woman. I rerun the scene in my head, trying out different opening lines — anything besides “Are you ok?” since obviously she is not."}, {"4b2a": "I want her to know that I see her."}, {"3707": "Eventually I settle on a solution that involves asking my coworker to walk on ahead without me and order himself a drink. Then I approach the woman and ask, “May I sit with you for a little while?”"}, {"13f3": "This seems best. I can sit at the other end of the bench, giving her both space and company. Or I can just move on, if she prefers to be alone. In this scenario, I am offering a noninvasive comfort. I can sit with her as long as she needs. We can speak or be silent, as she wishes."}, {"1ea5": "This is, to paraphrase Terry Bain, choosing kindness. In fact, it is acting on kindness. I decide this is the best solution."}, {"d13f": "—"}, {"37de": "Late in the afternoon the following day, as I get out of the shower, I hear shouting from outside my apartment. I go to the window, and see a couple arguing below. They are loud, but otherwise unremarkable. I keep an eye on them anyway, in case things escalate."}, {"d6ae": "A few minutes later, I see the woman start smacking at the man’s shoulders. He is much taller than she is. Her arms flap up to reach him like the angry wings of a bird. I start to get dressed, my nonintervention from earlier in the week still fresh in my mind. If “ [c]ourage and …compassion…are habits to practice,” as Linch Zhang writes, I want to start practicing."}, {"7206": "I try to think of what I will do. Something that will signal my attention and awareness, but not make a big scene. My mind is blank. The woman is grabbing his ear. At first he was holding up a forearm to half-heartedly ward her off, but now he seems limp."}, {"b4e3": "Thinking back on the conversations I’ve had with friends about bystander intervention, I realize that all of them have been about intervening in potential sexual assault situations at parties…or harassment situations at bus stops or on trains. We don’t talk about how to smoothly redirect an intimate public argument."}, {"bdbc": "I am determined to do something anyway. But before I can finish dressing, I see that the man and woman have moved away from each other and away from my building. They are on opposite sides of the parking lot."}, {"4498": "I am off the hook."}, {"2437": "I feel relieved. The violence is over, and I would have to run after them to catch them."}, {"c8ee": "My next hour is spent futilely searching online for how to use bystander intervention strategies to address situations like this. There is nothing. Frustrated, I give up on the experts."}, {"5a10": "I realize that the couple wouldn’t need to know I had been watching them. I realize that I could act as though I was casually walking by and say, “Hey, how’s it going?” to demonstrate that I see them, that I am aware something is taking place."}, {"624b": "Hopefully, my presence would defuse the situation."}, {"0d9d": "I decide this might work."}, {"9ebb": "I look again online for information. I look specifically for information on how, as a white person, to intervene in an argument between Black people without being an asshole. I find nothing."}, {"0e39": "My solution to this scenario is less satisfactory than my solution to the woman on the bench. It doesn’t address what to do if they keep fighting after I talk to them. But it’s the best I can come up with."}, {"a280": "I go for a walk and call a friend. The sun is setting as I describe the argument to her."}, {"63fe": "In the park, I realize that the same couple is there. They are still at a distance from each other, but the distance is much smaller, and they are shouting again. I take a deep breath, adjusting my path so that eventually I will cross theirs. As I get closer, I realize they have a third person with them, mediating."}, {"3b20": "Relieved, I walk on by."}, {"e091": "I tell my friend what has transpired. She suggests calling the police in future. I tell her that sometimes calling the police isn’t a good solution to intimate partner abuse, and that I’m extra cautious about calling the police on people of color. (What if they thought the man was the abuser? What if…?) She has a point, though, and I acknowledge it. Neither of us are sure what the best solution is."}, {"6cf7": "I tell her about the woman from earlier in the week. I tell her my heart is still aching."}, {"e097": "She says, “You’ll know what to do next time.”"}, {"ee42": "Later that night, I think about active kindness — about reaching out to people to let them know you’re there, even when you are strangers to each other. I think about, as Devika Pathak puts it, taking time to be kind."}, {"a7c3": "Unintentionally, I find myself practicing:"}, {"87d4": "“May I sit with you for a little while?”"}, {"b4fc": "There’s plenty of room on the bench."}, {"3649": "—"}, {"a4c5": "—"}, {"6847": "Epilogue"}, {"d944": "After writing this, I searched again for helpful information on bystander intervention during public abuse. I was more successful, finding some good resources, such as this wiki and this publication. My best find, however, wasn’t actually my own find. A friend sent me a link to a Google doc titled “What to do instead of calling the police.” I don’t know who is responsible for it, but it’s a valuable resource, and I am so glad to have stumbled across it."}], "child": "1222_1\t1222_2\t1222_3\t1222_4"}