{"name": "1223", "parent": "", "content": "Seconds and Inches (and Occasionally, Votes*) (*if you want to know what I’m ACTUALLY trying to convey here, albeit poorly, head over to Elizabeth Warren’s post that I only just read. She did a much better job of explaining what I’m too exhausted to move from brain to page. That’s why they pay her the big(gish) bucks, after all. But, hey, stay for the cute baby polar bears. They’re here for a limited time only. #globalwarmingscience) News of the election results finally made it to the Arctic. This baby polar bear doesn’t know WHAT to think! (photo from weloveallanimals.com) Fellow liberal-type folks, just be aware. This article is not about what you might think and it may push some buttons. Honestly, if you had told me three days ago that I’d be writing it, I’d have suggested you have your medication changed. I just hope that I can write this with clarity and simplicity (Read: short and sweet) because it’s almost 5 a.m. I have not been able to sleep. Again. And during all that awake time, I thought about some stuff. I did some reading. I reminisced. I hadn’t thought about Corlotta in a month or so, but for some reason she was on my mind big time last night. Most prominent in my memory was the day she drove me to look at the spot where I’d totaled my car a few days earlier in a DUI. It was October 10, 2010. That’s my sobriety date: 10.10.10. That was coincidental, but kind of cool. Anyhow, we parked her car and walked over to where I’d wrecked. I had crossed the center line and crashed into the trees that had been planted on the sidewalk as barriers between traffic and Toys-r-Us. Thank God. Interspersed among the trees were metal poles that were about the same color and circumference as the little trees. The poles were made of much sturdier stuff. There was a pole about two inches to the right of the tree that had absorbed my impact. If I’d hit THAT, I wouldn’t be sitting here mid-insomnia writing to you about it. Corlotta looked at me and said, “Our lives are built upon seconds and inches. A few of one or the other either way, and we’re standing in a homeless camp, or jail, or worse. Of course, it can go the other way, too. But I don’t think that happens as easily.” She was right, of course. She’s ALWAYS right. I think of those words all the time: When I’m scared, or angry, or afraid to make a decision. Or when I realize I’ve gone the whole day without being grateful just to be breathing. When something bad happens to someone I personally care about, or when it happens to someone I don’t even know. When it finally ‘clicks’ for me that I am presenting myself as someone firmly grounded in solution even though pieces of me are definitely part of the problem. That last part is where I found myself last night. BUT FIRST, Time for a Commercial Break SPONSORED BY: More Polar Bears. Because there can never be too much cuteness. Moms? Note the look on the Mama Bear’s face. She can’t even with these three. (Polar bears rarely have multiples. She just got lucky.) I only have two, but I promise you I had that look on my face last night, for hours. Mama Polar Bear? I UNDERSTAND YOU. Credit: David Jenkins, taken at Wapusk National Park, Canada, 2016 Now, Back to Our Show Show logo. 2004–2015 Oops! Sorry about that. I got confused. No credit; Page is inactive… SO, I want to talk today about the things that money can’t buy. Because I’m horrified, just like many of you. And I’m afraid for the future; for my kids. So, I understand that horror,and that fear, and also the sense of betrayal and bewilderment you might be experiencing. And it’s okay to feel all of that. And it’s okay to assemble; to march in the streets in protest; to defend your position, and tell your side. I sure have been. But, when I told it I was forgetting something important. I forgot to listen to the other side. I’ve gotten so used to thinking of Drumpf supporters as something to be pitied for their minimal intelligence, or their lack of understanding of what electing Drumpf will mean, and all sorts of other negative things. But I realized today that “Drumpf Supporters” make up far more of the population than I originally guessed. I kept reading comments, and I saw that people were really mad, obviously. But I was saddened that instead of a dialogue about the pros and cons, the comments added up to one giant hate-fest. And we just don’t have that luxury anymore. One thing I heard from Drumpf voters more than anything else was complaining about how the Liberals are being kept by the media, in their own little bubble and hearing what the media wants them to hear, as often as they can. And I can sort of see that. Because, for years, I’ve said the same thing about Conservatives. And the more I read, the more similar the two parties became. I’ve been trying to listen even though I am triggered by anger and hatred, and the people who I personally know that voted for Drumpf DID NOT WANT TO DO IT. They don’t want to grab women by the pussy, or get rid of marriage equality, or force a woman to bring a baby to term against her will. Those people are out there, like they always have been. But if my community is any kind of a decent random sampling (probably not), people voted for Drumpf because to them, Hillary was the more frightening choice. They struggled, and they followed their conscience. How can I condemn them for that? It’s EXACTLY why I voted for Hillary. And she’s certainly not without blemishes of her own. They’re not Drumpf-sized, sure. To me, anyway. But as you know, not everyone feels that way. And the Bernie-or-Busters? I’m also seeing a lot of anger and frustration directed at this group. Things like: This what happens when you decide not to vote! So, see? Here’s the thing: A majority of Bernie Sanders supporters were educated. Many of them know the basic ins and outs of the political process. When they started a movement and decided not to vote, in effect, they were putting into motion the outcome that Bernie tried to avoid by not running as an Independent candidate. The votes that were going to go to Hillary would be split between Hillary and Bernie, giving Donald the win. So, “Hillary’s votes” were split between she and Bernie, anyway. Because those Bernie or Busters made a decision. They decided that it was time to send Washington a message that business as usual will no longer be tolerated. And you don’t send Washington a message by electing Hillary Clinton. She IS Washington. So we can probably stop trying to shame that group, because we aren’t telling them anything they didn’t already know. Anyway, what I learned from my reading today is that I should be paying close attention to my actions, even when I’m terrified, so that I don’t end up becoming that which I loathe: smug, arrogant, preachy (oops!), cruel, critical and accusatory of others without knowing their story, hateful, xenophobic, etc. etc. etc. DRUMPF IS ONE MAN He was elected by a country who has had enough. In many cases (though definitely not all), he was chosen on the ballot as the lesser of two evils, rather than the greater of two goods. That suggests to me that while racism, and sexism, and ageism are alive and kicking here, maybe there’s also more good than I had allowed myself to previously see. AND WE HAVE TO FOCUS ON THE GOOD Stay strong, friends. We’ve got this. ", "title": "Seconds and Inches (and Occasionally, Votes*)", "sentences": [{"c151": "Seconds and Inches (and Occasionally, Votes*)"}, {"c313": "(*if you want to know what I’m ACTUALLY trying to convey here, albeit poorly, head over to Elizabeth Warren’s post that I only just read. She did a much better job of explaining what I’m too exhausted to move from brain to page."}, {"b930": "That’s why they pay her the big(gish) bucks, after all. But, hey, stay for the cute baby polar bears. They’re here for a limited time only. #globalwarmingscience)"}, {"2b73": "News of the election results finally made it to the Arctic. This baby polar bear doesn’t know WHAT to think! (photo from weloveallanimals.com)"}, {"e373": "Fellow liberal-type folks, just be aware. This article is not about what you might think and it may push some buttons. Honestly, if you had told me three days ago that I’d be writing it, I’d have suggested you have your medication changed. I just hope that I can write this with clarity and simplicity (Read: short and sweet) because it’s almost 5 a.m."}, {"eee5": "I have not been able to sleep. Again. And during all that awake time, I thought about some stuff. I did some reading. I reminisced."}, {"8a13": "I hadn’t thought about Corlotta in a month or so, but for some reason she was on my mind big time last night. Most prominent in my memory was the day she drove me to look at the spot where I’d totaled my car a few days earlier in a DUI."}, {"3bbc": "It was October 10, 2010. That’s my sobriety date: 10.10.10. That was coincidental, but kind of cool."}, {"ef12": "Anyhow, we parked her car and walked over to where I’d wrecked. I had crossed the center line and crashed into the trees that had been planted on the sidewalk as barriers between traffic and Toys-r-Us."}, {"9b2d": "Thank God."}, {"256c": "Interspersed among the trees were metal poles that were about the same color and circumference as the little trees. The poles were made of much sturdier stuff. There was a pole about two inches to the right of the tree that had absorbed my impact. If I’d hit THAT, I wouldn’t be sitting here mid-insomnia writing to you about it."}, {"0f7a": "Corlotta looked at me and said,"}, {"e726": "“Our lives are built upon seconds and inches. A few of one or the other either way, and we’re standing in a homeless camp, or jail, or worse. Of course, it can go the other way, too. But I don’t think that happens as easily.”"}, {"de22": "She was right, of course. She’s ALWAYS right. I think of those words all the time: When I’m scared, or angry, or afraid to make a decision. Or when I realize I’ve gone the whole day without being grateful just to be breathing. When something bad happens to someone I personally care about, or when it happens to someone I don’t even know. When it finally ‘clicks’ for me that I am presenting myself as someone firmly grounded in solution even though pieces of me are definitely part of the problem."}, {"d23b": "That last part is where I found myself last night."}, {"a52e": "BUT FIRST, Time for a Commercial Break"}, {"b53c": "SPONSORED BY:"}, {"61ae": "More Polar Bears. Because there can never be too much cuteness."}, {"f2da": "Moms? Note the look on the Mama Bear’s face. She can’t even with these three. (Polar bears rarely have multiples. She just got lucky.) I only have two, but I promise you I had that look on my face last night, for hours."}, {"6001": "Mama Polar Bear? I UNDERSTAND YOU."}, {"1118": "Credit: David Jenkins, taken at Wapusk National Park, Canada, 2016"}, {"4756": "Now, Back to Our Show"}, {"2950": "Show logo. 2004–2015"}, {"ee53": "Oops! Sorry about that. I got confused."}, {"1fd5": "No credit; Page is inactive…"}, {"c64f": "SO, I want to talk today about the things that money can’t buy. Because I’m horrified, just like many of you. And I’m afraid for the future; for my kids. So, I understand that horror,and that fear, and also the sense of betrayal and bewilderment you might be experiencing."}, {"4f37": "And it’s okay to feel all of that. And it’s okay to assemble; to march in the streets in protest; to defend your position, and tell your side. I sure have been. But, when I told it I was forgetting something important."}, {"5f2b": "I forgot to listen to the other side."}, {"88ff": "I’ve gotten so used to thinking of Drumpf supporters as something to be pitied for their minimal intelligence, or their lack of understanding of what electing Drumpf will mean, and all sorts of other negative things. But I realized today that “Drumpf Supporters” make up far more of the population than I originally guessed."}, {"7488": "I kept reading comments, and I saw that people were really mad, obviously. But I was saddened that instead of a dialogue about the pros and cons, the comments added up to one giant hate-fest. And we just don’t have that luxury anymore."}, {"ae17": "One thing I heard from Drumpf voters more than anything else was complaining about how the Liberals are being kept by the media, in their own little bubble and hearing what the media wants them to hear, as often as they can. And I can sort of see that. Because, for years, I’ve said the same thing about Conservatives. And the more I read, the more similar the two parties became."}, {"1c19": "I’ve been trying to listen even though I am triggered by anger and hatred, and the people who I personally know that voted for Drumpf DID NOT WANT TO DO IT. They don’t want to grab women by the pussy, or get rid of marriage equality, or force a woman to bring a baby to term against her will. Those people are out there, like they always have been. But if my community is any kind of a decent random sampling (probably not), people voted for Drumpf because to them, Hillary was the more frightening choice. They struggled, and they followed their conscience."}, {"b4d7": "How can I condemn them for that? It’s EXACTLY why I voted for Hillary. And she’s certainly not without blemishes of her own."}, {"0664": "They’re not Drumpf-sized, sure. To me, anyway. But as you know, not everyone feels that way."}, {"5790": "And the Bernie-or-Busters?"}, {"7fec": "I’m also seeing a lot of anger and frustration directed at this group. Things like:"}, {"bf10": "This what happens when you decide not to vote!"}, {"40eb": "So, see? Here’s the thing: A majority of Bernie Sanders supporters were educated. Many of them know the basic ins and outs of the political process. When they started a movement and decided not to vote, in effect, they were putting into motion the outcome that Bernie tried to avoid by not running as an Independent candidate. The votes that were going to go to Hillary would be split between Hillary and Bernie, giving Donald the win."}, {"2e4d": "So, “Hillary’s votes” were split between she and Bernie, anyway. Because those Bernie or Busters made a decision. They decided that it was time to send Washington a message that business as usual will no longer be tolerated."}, {"dc6f": "And you don’t send Washington a message by electing Hillary Clinton. She IS Washington."}, {"eda9": "So we can probably stop trying to shame that group, because we aren’t telling them anything they didn’t already know."}, {"4dae": "Anyway, what I learned from my reading today is that I should be paying close attention to my actions, even when I’m terrified, so that I don’t end up becoming that which I loathe: smug, arrogant, preachy (oops!), cruel, critical and accusatory of others without knowing their story, hateful, xenophobic, etc. etc. etc."}, {"b42e": "DRUMPF IS ONE MAN"}, {"87a1": "He was elected by a country who has had enough. In many cases (though definitely not all), he was chosen on the ballot as the lesser of two evils, rather than the greater of two goods. That suggests to me that while racism, and sexism, and ageism are alive and kicking here, maybe there’s also more good than I had allowed myself to previously see."}, {"d9bb": "AND WE HAVE TO FOCUS ON THE GOOD"}, {"1b7e": "Stay strong, friends."}, {"1d4b": "We’ve got this."}], "child": "1223_1\t1223_2\t1223_3\t1223_4\t1223_5\t1223_6\t1223_71223_1\t1223_2\t1223_3\t1223_4\t1223_5\t1223_6\t1223_7"}