{"name": "1224", "parent": "", "content": "I Made Friends In Spite of Myself I was an introvert before it was cool. I was an introvert back when people thought introversion and shyness were the same thing. My teacher called my mom for a meeting when I was in third grade. She said I was too serious. I should learn to relax and play more with the other kids. I had one best friend and was totally happy spending every recess just the two of us. I’m also INTJ. The introvert’s introvert. We believe everything can be analyzed. Part of our introversion comes from the fact that people are hard. They’re squidgy organic bits with FEELINGS that I can’t reason out. When they won’t let me help them fix their feelings, we’re both left frustrated: me because I can’t solve the problem, them because I won’t listen to them talk about their feelings more. I like being at home. I spend all day interacting with colleagues in my day job. I married an extrovert and he makes me do stuff like talk to people and go places. That’s enough for me. For the longest time, I thought my social circle of non-family members and non-coworkers was a circle of zero, and I was cool with that. But then something happened. I made friends. Making friends once you’re out of school is hard. It’s even harder when you move away to a new city. Not having a pre-packaged group of people of a similar age and with similar life experiences means you have to work at friendships. You have to engage. Make small talk. Hang out. Get to know each other. Believe you have something to offer that makes you interesting. My introvert heart shudders just typing those things out. Imagine trying to do them. It took me ten years to make new friends. First they were people my husband knew. We’d go to birthday parties, and then they’d invite us over for drinks or board games. It was weird. Suddenly we were friends. They didn’t follow all those friend-making steps I listed above. They just decided we were going to be friends. It was just like the White Stripes said it would be. I know I sound like the worst kind of Sheldon Cooper wannabe right now. In a second I’ll be offering you all a warm beverage, but that’s how I saw it. And it’s not like I spent all my time wondering how this could happen. I’m not a robot. If it doesn’t compute, but these new friends are willing to stay up late playing Killer Bunnies or Settlers of Catan, I’m going to roll with it. Those friends didn’t really stick though. Once they started having kids, late night board game marathons went away. The thing about being a homebody, though, is you’ve got time to fill. If there aren’t kids in the picture, and you’re not up late plotting Meeple demise in Carcasonne, there’s time. Plus, my extrovert husband works a lot of evenings shifts. So I started looking for things to do. At first, I was all over the map. I volunteered with the city’s environmental corps. I took yoga. I tried to start a blog (three times). I got certified to teach fitness classes. I learned the practice of movement art therapy. I went back to creative writing after years away from it. It was writing where the friendships happened. Probably because it attracts a lot of introverts. It was slow at first. We met in formal classes. Then we started having dates in coffee shops to work on our individual projects; introverts alone together typing silently away. I enjoyed writing so much I was willing overlook the need for *shudder* small talk in those dates. And if the silences started to stretch, I could always resort to “so how’s your writing going?” It must have worked, because then those writer friends started inviting me to do other things. Community theatre. More birthday parties. Concerts. And doing those things meant I met more people who invited me to more things. At first it was weird, just like it had been before. Me? You’re asking me? We barely know each other. But they kept asking. And sometimes they went out of their way to ask. It was weird and flattering. My INTJ heart still doesn’t understand it, but I’m trying not to over-analyze the gift horse’s mouth, as it were. Am I ever going to be the friend these people call in the middle of the night when their kids are driving them crazy, or they lost their job? Maybe. But I’ll always going be the friend who wants to fix things, and not just listen, and that’s maybe not what they’re looking for. Being someone’s shoulder to cry on will always be an awkward fit. Sheldon and I have that in common at least, but you can have my spot on the couch if you want it. I’ll be a great friend when you want to start planning your career change though, or just if you need a buddy to try out that new Korean BBQ place downtown. I’ll come to your parties, as long as you don’t mind me gravitating to the other introverts on the couch, and I’ll schedule our writing dates with enthusiastic efficiency. Adulthood is weird. Making friends is weirder. It’s kind of nice though. Nice to have people who like the same stuff you do, and who look forward to seeing you again. Maybe Jack White was right after all. Allison Temple is an introvert and a romance writer. Don’t be shy about clicking that little green heart if you liked this article. If you want more, sign up for her mailing list to see more Medium posts, updates on what she’s working on, and more! ", "title": "I Made Friends In Spite of Myself", "sentences": [{"172b": "I Made Friends In Spite of Myself"}, {"e743": "I was an introvert before it was cool. I was an introvert back when people thought introversion and shyness were the same thing. My teacher called my mom for a meeting when I was in third grade. She said I was too serious. I should learn to relax and play more with the other kids. I had one best friend and was totally happy spending every recess just the two of us."}, {"96e2": "I’m also INTJ. The introvert’s introvert. We believe everything can be analyzed. Part of our introversion comes from the fact that people are hard. They’re squidgy organic bits with FEELINGS that I can’t reason out. When they won’t let me help them fix their feelings, we’re both left frustrated: me because I can’t solve the problem, them because I won’t listen to them talk about their feelings more."}, {"dbed": "I like being at home. I spend all day interacting with colleagues in my day job. I married an extrovert and he makes me do stuff like talk to people and go places. That’s enough for me. For the longest time, I thought my social circle of non-family members and non-coworkers was a circle of zero, and I was cool with that. But then something happened."}, {"550c": "I made friends."}, {"06f7": "Making friends once you’re out of school is hard. It’s even harder when you move away to a new city. Not having a pre-packaged group of people of a similar age and with similar life experiences means you have to work at friendships. You have to engage. Make small talk. Hang out. Get to know each other. Believe you have something to offer that makes you interesting."}, {"00d6": "My introvert heart shudders just typing those things out. Imagine trying to do them."}, {"83ca": "It took me ten years to make new friends. First they were people my husband knew. We’d go to birthday parties, and then they’d invite us over for drinks or board games. It was weird. Suddenly we were friends. They didn’t follow all those friend-making steps I listed above. They just decided we were going to be friends. It was just like the White Stripes said it would be."}, {"1631": "I know I sound like the worst kind of Sheldon Cooper wannabe right now. In a second I’ll be offering you all a warm beverage, but that’s how I saw it. And it’s not like I spent all my time wondering how this could happen. I’m not a robot. If it doesn’t compute, but these new friends are willing to stay up late playing Killer Bunnies or Settlers of Catan, I’m going to roll with it. Those friends didn’t really stick though. Once they started having kids, late night board game marathons went away."}, {"51b2": "The thing about being a homebody, though, is you’ve got time to fill. If there aren’t kids in the picture, and you’re not up late plotting Meeple demise in Carcasonne, there’s time. Plus, my extrovert husband works a lot of evenings shifts. So I started looking for things to do."}, {"4fda": "At first, I was all over the map. I volunteered with the city’s environmental corps. I took yoga. I tried to start a blog (three times). I got certified to teach fitness classes. I learned the practice of movement art therapy. I went back to creative writing after years away from it."}, {"67e4": "It was writing where the friendships happened. Probably because it attracts a lot of introverts. It was slow at first. We met in formal classes. Then we started having dates in coffee shops to work on our individual projects; introverts alone together typing silently away. I enjoyed writing so much I was willing overlook the need for *shudder* small talk in those dates. And if the silences started to stretch, I could always resort to “so how’s your writing going?”"}, {"d65a": "It must have worked, because then those writer friends started inviting me to do other things. Community theatre. More birthday parties. Concerts. And doing those things meant I met more people who invited me to more things."}, {"744a": "At first it was weird, just like it had been before. Me? You’re asking me? We barely know each other. But they kept asking. And sometimes they went out of their way to ask. It was weird and flattering. My INTJ heart still doesn’t understand it, but I’m trying not to over-analyze the gift horse’s mouth, as it were."}, {"3420": "Am I ever going to be the friend these people call in the middle of the night when their kids are driving them crazy, or they lost their job? Maybe. But I’ll always going be the friend who wants to fix things, and not just listen, and that’s maybe not what they’re looking for. Being someone’s shoulder to cry on will always be an awkward fit. Sheldon and I have that in common at least, but you can have my spot on the couch if you want it."}, {"bf09": "I’ll be a great friend when you want to start planning your career change though, or just if you need a buddy to try out that new Korean BBQ place downtown. I’ll come to your parties, as long as you don’t mind me gravitating to the other introverts on the couch, and I’ll schedule our writing dates with enthusiastic efficiency."}, {"a226": "Adulthood is weird. Making friends is weirder. It’s kind of nice though. Nice to have people who like the same stuff you do, and who look forward to seeing you again. Maybe Jack White was right after all."}, {"d0aa": "Allison Temple is an introvert and a romance writer. Don’t be shy about clicking that little green heart if you liked this article. If you want more, sign up for her mailing list to see more Medium posts, updates on what she’s working on, and more!"}], "child": "1224_1\t1224_2"}