{"name": "1225", "parent": "", "content": "Everything, everything Doubting my talents and path, A timely message from a friend,Saying nothing but — Keep doing what you’re doing In the darkness, depressed,I step out of the automated doors into the rain,The homeless man smiles right at me,As he starts singing my favourite song Running, pounding the path,Trying to clear my head and decideWhere to next, I look upThe street name becomes my next city Rushing around, a missed bus,Waiting impatiently for the nextI get on; tired, worn, doneA beautiful, unlikely conversation Trapped in my mind,Thoughts humming around, reverberatingEverything stops as the sky transforms,Nature’s canvas quiets the din Reassurance. All of these things are here to reassure — We are on the right path,That everything is as it should be,To have faith and take the next step Intrinsically connected. We are all intrinsically linked,Through a matrix of beautiful connectionsEverything affecting the other,Guiding us to who (not where) we are meant to be Pay attention. This is why we need to pay attention,To the signs, to natureEverything we desire is waiting,To be brought forth, if only we see Contribute. Though our ripples spread beyond the horizon,We can contribute to the wonder,When we step consciously, meaningfullyWe join in the dance Kind words. Never underestimate a kind word or gesture,If it’s written on your heart, send it out into the cosmosIt could be that very ripple,That moves another toward their destiny Everything, everything matters. ", "title": "Everything, everything", "sentences": [{"a570": "Everything, everything"}, {"30a2": "Doubting my talents and path, A timely message from a friend,Saying nothing but — Keep doing what you’re doing"}, {"5403": "In the darkness, depressed,I step out of the automated doors into the rain,The homeless man smiles right at me,As he starts singing my favourite song"}, {"ed0b": "Running, pounding the path,Trying to clear my head and decideWhere to next, I look upThe street name becomes my next city"}, {"5364": "Rushing around, a missed bus,Waiting impatiently for the nextI get on; tired, worn, doneA beautiful, unlikely conversation"}, {"2387": "Trapped in my mind,Thoughts humming around, reverberatingEverything stops as the sky transforms,Nature’s canvas quiets the din"}, {"98e3": "Reassurance."}, {"a498": "All of these things are here to reassure — We are on the right path,That everything is as it should be,To have faith and take the next step"}, {"483b": "Intrinsically connected."}, {"8afc": "We are all intrinsically linked,Through a matrix of beautiful connectionsEverything affecting the other,Guiding us to who (not where) we are meant to be"}, {"1215": "Pay attention."}, {"8a21": "This is why we need to pay attention,To the signs, to natureEverything we desire is waiting,To be brought forth, if only we see"}, {"4e88": "Contribute."}, {"9455": "Though our ripples spread beyond the horizon,We can contribute to the wonder,When we step consciously, meaningfullyWe join in the dance"}, {"73ff": "Kind words."}, {"97fb": "Never underestimate a kind word or gesture,If it’s written on your heart, send it out into the cosmosIt could be that very ripple,That moves another toward their destiny"}, {"70c9": "Everything, everything matters."}], "child": "1225_1"}