{"name": "1226", "parent": "", "content": "Connection what it means to me: a response to alto’s Collaboration of Souls II It’s not a case of there or not-there; it’s always there. You can’t switch it off.You can tune it out, but it’s still there. You can pretend it’s not, but it is. You can’t tone it down, defining it in physical terms of no relevance:it’s an electricity thing, it’s a magnetism thing, it’s a chemistry thing.It’s no thing at all. But that doesn’t mean it’s nothing. Oh, it’s something, alright. You can try to turn it into something it’s not:doll it up, or pare it back, or add a fine glimmer of mystery.It’s unchanged. Always has been. Always will be. You can’t segregate portions of it and assign those parts labelslike you try to do with people. It’s not like people. It doesn’t even lie or cheat or steal or war. It doesn’t do anything. It just is. You can feel its warmth and you can see its glow but you can’t contain it. It’s already got a home.You can try to make it mean something more—but how could it? It already means everything. Collaboration Of Souls IIConnection is not simply a bondgloriouspublication.com ", "title": "Connection", "sentences": [{"4e34": "Connection"}, {"2c8b": "what it means to me: a response to alto’s Collaboration of Souls II"}, {"429e": "It’s not a case of there or not-there; it’s always there. You can’t switch it off.You can tune it out, but it’s still there."}, {"b028": "You can pretend it’s not, but it is."}, {"8c3a": "You can’t tone it down, defining it in physical terms of no relevance:it’s an electricity thing, it’s a magnetism thing, it’s a chemistry thing.It’s no thing at all."}, {"91bf": "But that doesn’t mean it’s nothing. Oh, it’s something, alright."}, {"368b": "You can try to turn it into something it’s not:doll it up, or pare it back, or add a fine glimmer of mystery.It’s unchanged."}, {"6f03": "Always has been. Always will be."}, {"876e": "You can’t segregate portions of it and assign those parts labelslike you try to do with people. It’s not like people. It doesn’t even lie or cheat or steal or war. It doesn’t do anything."}, {"466e": "It just is."}, {"33f6": "You can feel its warmth and you can see its glow but you can’t contain it. It’s already got a home.You can try to make it mean something more—but how could it?"}, {"3e11": "It already means everything."}, {"59de": "Collaboration Of Souls IIConnection is not simply a bondgloriouspublication.com"}], "child": "1226_1\t1226_2\t1226_3\t1226_4\t1226_51226_1\t1226_2\t1226_3\t1226_4\t1226_5"}