{"name": "1228", "parent": "", "content": "Greetings From Hawaii Where I Went The Day After I Found Out You Cheated I found a chaise lounge by the Sheraton Pool. You have to have a wristband to get a towel and get poolside service. I needed to go to a straw hut across the lazy river to show my room key and get the stupid wristband. I didn’t want to lose the spot I found, but I didn’t have anything besides my clothes to mark my territory. I would have to take them off and leave them to not lose the chaise. I wasn’t planning on removing my cut offs and top today, but I had to make a decision: Was standing in front of countless strangers in my bathing suit worth claiming the chair? It wasn’t.It was such a mistake. I stood there feeling completely nakedI felt so exposed and so humiliated and disgusting. My body was the evidence of the things I’ve done to myself. I lost everything. And the map showing why, and how, was drawn out across my skin for everyone to see. I took a deep breath and said fuck it. I channeled some body language that I remember coming naturally when I was proud — parroting how a confident woman behaves. I pulled my bikini bottoms out of my ass,tightened my top, walked with my hips swinging, legs as long as I can make them, toes pointed, straight posture, shoulders back and head high. Trying to avoid eye contact with all the fucking people on the journey to the fucking hut and it fucking sucked. They make the people working at the wristband-hut say “aloha” to every person who approaches. The line is long and around the fifth time I hear “aloha” I laugh. It reminded me of being at CVS with you, buying you some deodorant for your trip then I think of your trip… I must have been still thinking of it the second time the woman said “aloha” to me. I apologized and shook my head to indicate to her that I was clearly daydreaming, and wasn’t intentionally ignoring her. I say “aloha,” and I “smile.” Or whatever I’m calling it now, the respectful thing where I show my teeth. Faking it so she doesn’t think the thoughts and images in my eyes are directed at her. She talks and I don’t care about what she is saying, but I do the thing with the teeth again and say thank you. I have the wristband and the striped towel that only members have, so now I won’t be kicked out. Not kicked out like the young couple with the plain towels and the baby named Paisley. I feel bad for them, so did the security guard and everyone around. We all intentionally didn’t turn our heads to watch them gather their things and leave. Oh great another baby. I need to get in the pool or do something. I stand up, again in just my bathing suit. Okay here I go again. Walking, chin up, tummy in, hiding in the I WANT TO DIE, I WANT TO DIE slouch… I make it to the steps and jump in before anyone sees. There are these really nice bean bags that float that you can use for free, you just have to find one. Again there are people scavenging for the open opportunity but I’m really lucky. Lucky haha what a stupid thing to think But I am really lucky and find one right away. Really lucky when it comes to chairs and bean bags. I’m gonna try something new and just do the fun stuff “normal people” do. I don’t remember the last time I floated around in a tube.But then I do, I remember, and I laugh about making that joke with the DVDs at the liquor store afterwards and wonder if you have that picture still. I shake my head again, literally, and look down at my body crumpled up in the float. I count all the other women in each spot on my leg or line in my stomach. I have to channel confident lady again or I’ll drown myself. This time I start to notice the people and let myself notice the way they notice me. I’m being ridiculous. I’m the worst I’ve ever looked, but the best looking person here. I feel like an asshole for thinking that but it’s true. I see all the men. They stare at me, through sunglasses, behind their wives backs, in covert body contortions, in honest smiles. One man listening to Bob Marley tipped his hat at me approvingly. It’s the bathing suit with the rasta colors. I let myself feel them look, it feels good but for the wrong reason. They are all exactly what I thought and I let myself see it. Everyone of them are awful and disgusting. I remember that the best looking woman in the pool doesn’t stand up against the sea of women out there in the world. So I think of those women, and look at these women. The old ones smile, the heavy ones snarl, the pretty ones look down at themselves, take a deep breath, and channel whatever they need to look back up. Everyone is sad and disgusting. I wish you were here and then dunk my head under water for thinking it. I go back to my chair, I need some water and lunch. Now there are two guys in the chairs next to me. I hate them already. They see me coming. They get excited. They smile. I don’t do the thing with the teeth I just say “hi” and lay down. I put a book over my stomach so they can’t see all of your mistakes on me. I put a book over my stomach so they can’t see all of your mistakes on me. My ahi poke bowl comes with soy sauce. My ahi poke bowl comes with soy sauce. I can’t eat soy sauce anymore since you pointed out the fruit flies that are always in the soy sauce bottles of the sushi restaurants we go to. I hate myself for eating. I go throw up. I go throw up. I come back and this time I do the teeth thing for the pigs. I realize I’m being mean so I stop hating them, they feel that I stopped hating them, so they engage. They ask how the poke was. I say it was alright and feel ashamed about throwing up. They ask if I want a drink and I say I don’t drink (now), but thanks. We do that thing you do when you meet someone new. You know. They are from Philly, which makes me think about getting slapped. They play baseball which makes me laugh out loud for the first time today. It’s hot. We are all three sweaty and they ask if I want to go in the water with them. I do. The attention is making me feel better, and I like that they don’t know me, which makes me think about how good this made you feel too. We float the river a few times around. I go down a water slide to seem fun and it actually is fun. I told them I’m from LA and decided that’s what I’ll say now. I’m not from San Francisco anymore. I’m from LA. They ask if I’m married and I say no. They aren’t either. They don’t ask if I have a BF which makes me think they have girlfriends so I go back to hating them. They like being seen with me, and switch off who engages more because they haven’t decided which one gets me. I feel bad for not telling them it’s neither and that I’m using them. Then I just decide to go for it and take what I wanted. I tell them everything. It takes over an hour. I stop for breaths to see if they are still listening. I wouldn’t have cared if they weren’t because it’s not about them, but they were: mouths dropped, eye contact, sympathy, gasps — it wasn’t fake. I finish and feel gross for doing something vulnerable with them, but good for getting what I needed. And it was with strangers so I can walk away and never care again what they think about it. We walk back to the chair in silence and sit down and I start laughing at myself and they start to console me. They tell me I’m wrong, not every man is like that. They tell me I’m beautiful. And it just makes me think of how you said that to the others, and how I can’t ever hear it again because it’s either a lie or that I’m beautiful but not beautiful enough. Their consoling feels empty and it makes me just want to talk to you. I tell them that and start to type this to you. They come back with a Mai-Ti and leave it by my side. They say “Just in case you change your mind, here you go” and they give me their room number and it makes me want to barf because there it is… I hate everyone but at least I got a tan… ", "title": "Greetings From Hawaii Where I Went The Day After I Found Out You Cheated", "sentences": [{"3717": "Greetings From Hawaii Where I Went The Day After I Found Out You Cheated"}, {"ba88": "I found a chaise lounge by the Sheraton Pool."}, {"5d5e": "You have to have a wristband to get a towel and get poolside service. I needed to go to a straw hut across the lazy river to show my room key and get the stupid wristband."}, {"8fbe": "I didn’t want to lose the spot I found, but I didn’t have anything besides my clothes to mark my territory. I would have to take them off and leave them to not lose the chaise."}, {"25c3": "I wasn’t planning on removing my cut offs and top today, but I had to make a decision: Was standing in front of countless strangers in my bathing suit worth claiming the chair?"}, {"3dfa": "It wasn’t.It was such a mistake."}, {"d324": "I stood there feeling completely nakedI felt so exposed and so humiliated and disgusting. My body was the evidence of the things I’ve done to myself."}, {"e635": "I lost everything. And the map showing why, and how, was drawn out across my skin for everyone to see."}, {"ac7b": "I took a deep breath and said fuck it."}, {"4745": "I channeled some body language that I remember coming naturally when I was proud — parroting how a confident woman behaves."}, {"4d5f": "I pulled my bikini bottoms out of my ass,tightened my top, walked with my hips swinging, legs as long as I can make them, toes pointed, straight posture, shoulders back and head high. Trying to avoid eye contact with all the fucking people on the journey to the fucking hut and it fucking sucked."}, {"dab6": "They make the people working at the wristband-hut say “aloha” to every person who approaches. The line is long and around the fifth time I hear “aloha” I laugh."}, {"83c1": "It reminded me of being at CVS with you, buying you some deodorant for your trip then I think of your trip…"}, {"f58e": "I must have been still thinking of it the second time the woman said “aloha” to me. I apologized and shook my head to indicate to her that I was clearly daydreaming, and wasn’t intentionally ignoring her."}, {"749d": "I say “aloha,” and I “smile.”"}, {"9993": "Or whatever I’m calling it now, the respectful thing where I show my teeth. Faking it so she doesn’t think the thoughts and images in my eyes are directed at her."}, {"ee5d": "She talks and I don’t care about what she is saying, but I do the thing with the teeth again and say thank you."}, {"7c03": "I have the wristband and the striped towel that only members have, so now I won’t be kicked out."}, {"72ae": "Not kicked out like the young couple with the plain towels and the baby named Paisley."}, {"45ce": "I feel bad for them, so did the security guard and everyone around. We all intentionally didn’t turn our heads to watch them gather their things and leave."}, {"d8d8": "Oh great another baby. I need to get in the pool or do something. I stand up, again in just my bathing suit."}, {"bb1a": "Okay here I go again."}, {"c8ad": "Walking, chin up, tummy in, hiding in the I WANT TO DIE, I WANT TO DIE slouch…"}, {"281b": "I make it to the steps and jump in before anyone sees."}, {"00d1": "There are these really nice bean bags that float that you can use for free, you just have to find one. Again there are people scavenging for the open opportunity but I’m really lucky."}, {"7335": "Lucky haha what a stupid thing to think"}, {"6cd3": "But I am really lucky and find one right away. Really lucky when it comes to chairs and bean bags."}, {"e541": "I’m gonna try something new and just do the fun stuff “normal people” do."}, {"8e5b": "I don’t remember the last time I floated around in a tube.But then I do, I remember, and I laugh about making that joke with the DVDs at the liquor store afterwards and wonder if you have that picture still."}, {"a331": "I shake my head again, literally, and look down at my body crumpled up in the float."}, {"d518": "I count all the other women in each spot on my leg or line in my stomach."}, {"3553": "I have to channel confident lady again or I’ll drown myself."}, {"1882": "This time I start to notice the people and let myself notice the way they notice me. I’m being ridiculous. I’m the worst I’ve ever looked, but the best looking person here."}, {"e5e1": "I feel like an asshole for thinking that but it’s true."}, {"a2f1": "I see all the men. They stare at me, through sunglasses, behind their wives backs, in covert body contortions, in honest smiles. One man listening to Bob Marley tipped his hat at me approvingly. It’s the bathing suit with the rasta colors."}, {"c9ab": "I let myself feel them look, it feels good but for the wrong reason."}, {"76ba": "They are all exactly what I thought and I let myself see it. Everyone of them are awful and disgusting."}, {"dbdf": "I remember that the best looking woman in the pool doesn’t stand up against the sea of women out there in the world. So I think of those women, and look at these women."}, {"b596": "The old ones smile, the heavy ones snarl, the pretty ones look down at themselves, take a deep breath, and channel whatever they need to look back up."}, {"6ab0": "Everyone is sad and disgusting."}, {"be3f": "I wish you were here and then dunk my head under water for thinking it."}, {"09e8": "I go back to my chair, I need some water and lunch."}, {"78cd": "Now there are two guys in the chairs next to me. I hate them already."}, {"59b0": "They see me coming. They get excited. They smile."}, {"8bdd": "I don’t do the thing with the teeth I just say “hi” and lay down. I put a book over my stomach so they can’t see all of your mistakes on me."}, {"5f58": "I put a book over my stomach so they can’t see all of your mistakes on me."}, {"e887": "My ahi poke bowl comes with soy sauce."}, {"247b": "My ahi poke bowl comes with soy sauce."}, {"6453": "I can’t eat soy sauce anymore since you pointed out the fruit flies that are always in the soy sauce bottles of the sushi restaurants we go to."}, {"1aff": "I hate myself for eating. I go throw up."}, {"40d2": "I go throw up."}, {"0394": "I come back and this time I do the teeth thing for the pigs."}, {"23dd": "I realize I’m being mean so I stop hating them, they feel that I stopped hating them, so they engage."}, {"1462": "They ask how the poke was. I say it was alright and feel ashamed about throwing up."}, {"ccb1": "They ask if I want a drink and I say I don’t drink (now), but thanks. We do that thing you do when you meet someone new. You know."}, {"5d9c": "They are from Philly, which makes me think about getting slapped. They play baseball which makes me laugh out loud for the first time today."}, {"b1c7": "It’s hot. We are all three sweaty and they ask if I want to go in the water with them. I do."}, {"f54e": "The attention is making me feel better, and I like that they don’t know me, which makes me think about how good this made you feel too."}, {"6a95": "We float the river a few times around. I go down a water slide to seem fun and it actually is fun. I told them I’m from LA and decided that’s what I’ll say now. I’m not from San Francisco anymore. I’m from LA."}, {"d900": "They ask if I’m married and I say no. They aren’t either. They don’t ask if I have a BF which makes me think they have girlfriends so I go back to hating them. They like being seen with me, and switch off who engages more because they haven’t decided which one gets me."}, {"2c50": "I feel bad for not telling them it’s neither and that I’m using them. Then I just decide to go for it and take what I wanted."}, {"7392": "I tell them everything."}, {"dbdb": "It takes over an hour. I stop for breaths to see if they are still listening. I wouldn’t have cared if they weren’t because it’s not about them, but they were: mouths dropped, eye contact, sympathy, gasps — it wasn’t fake."}, {"baa0": "I finish and feel gross for doing something vulnerable with them, but good for getting what I needed. And it was with strangers so I can walk away and never care again what they think about it."}, {"bf3a": "We walk back to the chair in silence and sit down and I start laughing at myself and they start to console me."}, {"ed54": "They tell me I’m wrong, not every man is like that. They tell me I’m beautiful."}, {"871d": "And it just makes me think of how you said that to the others, and how I can’t ever hear it again because it’s either a lie or that I’m beautiful but not beautiful enough."}, {"a890": "Their consoling feels empty and it makes me just want to talk to you."}, {"4f1e": "I tell them that and start to type this to you."}, {"40bf": "They come back with a Mai-Ti and leave it by my side. They say “Just in case you change your mind, here you go” and they give me their room number and it makes me want to barf because there it is…"}, {"3497": "I hate everyone but at least I got a tan…"}], "child": "1228_1\t1228_2\t1228_3\t1228_4"}