{"name": "123", "parent": "", "content": "The Blazers Won’t Win in Six, but So What? What’s Damian Lillard supposed to say, that his team will lose? Damian Lillard and the Trail Blazers battled their way into the NBA playoffs, winning 10 of 14 games down the stretch to finish one game ahead of the Nuggets for the eighth seed. (It’s almost like the Nuggets shouldn’t have traded Jusuf Nurkic to the Blazers in February.) Their reward? A matchup with the freakin’ Golden State Warriors, who somehow just made a 67-win season feel underwhelming. The Warriors won all four games this season against the Blazers and beat a better Portland team in five games in last year’s playoffs. But Lillard sparked a fire by saying he thinks his team can win in six games. There’s an obvious connection to be made with my personal favorite athlete prediction of all time. When Brandon Jennings and the 38–44 Bucks faced off against the defending champion Miami Heat in the first round of the 2013 playoffs, Jennings confidently told reporters he thought the Bucks would win in six. The Bucks got swept. There’s a major difference between Jennings’s prediction and Lillard’s. Jennings made his statement virtually unprompted — nobody asked him how many games he thought his team could win in — and continued to repeat his mantra, even when the Heat won the first two games of the series. Meanwhile, Lillard was asked whether he thought the Blazers would win in six or seven games and, while laughing, chose six. We really shouldn’t be making a big deal out of it. It’s like if somebody asked if you prefer the Big Mac or Whopper, you chose the Whopper, and a ton of blogs wrote posts about how your favorite food in the world is the Whopper and you’re unreasonable for trashing Big Macs. Some people accuse you of hating McNuggets. Your initial assessment was wrong — Big Macs are way, way, way better — but there’s no need for takes. Unfortunately, Lillard’s comment was about the Warriors, who have proved expert at turning the slightest slights into declarations of war. My guess is that Draymond Green has already tattooed “Blazers in six” on the inside of his lower lip. An 8-seed playing a 1-seed faces impending doom. Since the NBA switched to a 16-team playoff format in 1984, 63 of 68 1-seeds have won their first-round matchups: about 93 percent. Yes, that leaves five massive upsets, but a few of those underdogs had extenuating circumstances on their side. (The 1999 Knicks should not have been an 8-seed, and I will fight you if you disagree. Several of the Knicks might join.) And the Warriors are better than your average 1-seed: They won 14 more games than the 1-seeded Celtics in the Eastern Conference. “X in six” is an attempt at speaking an impossible result into potential reality. With athletes, we expect confidence — hell yeah, we’re going to win this series — or nonconfrontation — well, our opponent is a great team, and the series is going to be tough. “X in six” isn’t really either. It’s somebody who wants to sound brave, but, doesn’t want people to think they’re oblivious, so they say something that isn’t that ludicrous. Like, are we really saying Lillard is being too cocky? He’s predicting that his team is going to lose two games. The joy of “X in six” is that it’s an attempt at sounding reasonable when predicting the unreasonable. Most likely, the Blazers will lose, and perhaps we’ll be able to lightly roast Lillard for being a tad overconfident. Or maybe he’ll play the best basketball of his career for six games — or at least four of them — and do the damn thing, proving himself right, stunning the world as Ballin’ Nostradamus. Blazers in six. ", "title": "The Blazers Won’t Win in Six, but So What?", "sentences": [{"66e7": "The Blazers Won’t Win in Six, but So What?"}, {"f1b6": "What’s Damian Lillard supposed to say, that his team will lose?"}, {"bc28": "Damian Lillard and the Trail Blazers battled their way into the NBA playoffs, winning 10 of 14 games down the stretch to finish one game ahead of the Nuggets for the eighth seed. (It’s almost like the Nuggets shouldn’t have traded Jusuf Nurkic to the Blazers in February.)"}, {"ea0e": "Their reward? A matchup with the freakin’ Golden State Warriors, who somehow just made a 67-win season feel underwhelming. The Warriors won all four games this season against the Blazers and beat a better Portland team in five games in last year’s playoffs."}, {"b01c": "But Lillard sparked a fire by saying he thinks his team can win in six games."}, {"99bb": "There’s an obvious connection to be made with my personal favorite athlete prediction of all time. When Brandon Jennings and the 38–44 Bucks faced off against the defending champion Miami Heat in the first round of the 2013 playoffs, Jennings confidently told reporters he thought the Bucks would win in six. The Bucks got swept."}, {"90b6": "There’s a major difference between Jennings’s prediction and Lillard’s. Jennings made his statement virtually unprompted — nobody asked him how many games he thought his team could win in — and continued to repeat his mantra, even when the Heat won the first two games of the series."}, {"a6a7": "Meanwhile, Lillard was asked whether he thought the Blazers would win in six or seven games and, while laughing, chose six. We really shouldn’t be making a big deal out of it. It’s like if somebody asked if you prefer the Big Mac or Whopper, you chose the Whopper, and a ton of blogs wrote posts about how your favorite food in the world is the Whopper and you’re unreasonable for trashing Big Macs. Some people accuse you of hating McNuggets. Your initial assessment was wrong — Big Macs are way, way, way better — but there’s no need for takes. Unfortunately, Lillard’s comment was about the Warriors, who have proved expert at turning the slightest slights into declarations of war. My guess is that Draymond Green has already tattooed “Blazers in six” on the inside of his lower lip."}, {"0daa": "An 8-seed playing a 1-seed faces impending doom. Since the NBA switched to a 16-team playoff format in 1984, 63 of 68 1-seeds have won their first-round matchups: about 93 percent. Yes, that leaves five massive upsets, but a few of those underdogs had extenuating circumstances on their side. (The 1999 Knicks should not have been an 8-seed, and I will fight you if you disagree. Several of the Knicks might join.) And the Warriors are better than your average 1-seed: They won 14 more games than the 1-seeded Celtics in the Eastern Conference."}, {"ec31": "“X in six” is an attempt at speaking an impossible result into potential reality. With athletes, we expect confidence — hell yeah, we’re going to win this series — or nonconfrontation — well, our opponent is a great team, and the series is going to be tough. “X in six” isn’t really either. It’s somebody who wants to sound brave, but, doesn’t want people to think they’re oblivious, so they say something that isn’t that ludicrous. Like, are we really saying Lillard is being too cocky? He’s predicting that his team is going to lose two games. The joy of “X in six” is that it’s an attempt at sounding reasonable when predicting the unreasonable."}, {"5134": "Most likely, the Blazers will lose, and perhaps we’ll be able to lightly roast Lillard for being a tad overconfident. Or maybe he’ll play the best basketball of his career for six games — or at least four of them — and do the damn thing, proving himself right, stunning the world as Ballin’ Nostradamus."}, {"6a13": "Blazers in six."}], "child": "123_1\t123_2\t123_3\t123_4\t123_5\t123_6\t123_7"}