{"name": "1238", "parent": "", "content": "11 Writers Bringing Poetry to Life Poetry is what bridges our lived experiences and our ideals. It shows us what is possible while reminding us of what is. And yet, after all this, it still gets a bad rap! For those who think poetry is dying, or worse dead, check out these writers proving poetry is more alive than ever. Teaching My Mother How To Give Birth by Warsan Shire After months of secret collaboration, Warsan shocked friends and strangers alike when it was revealed that her poetry was adapted for Beyonce’s visual album “Lemonade”. This collection, published several years prior, is packed with intense, raw poetry that leaves no mystery as to how Queen Bey was so inspired by her. Don’t be deceived by its brevity; Warsan stretches each word to the extent of its meaning, giving you plenty to think about weeks after you complete the final line. Night Sky with Exit Wounds by Ocean Vuong A powerful debut collection, Night Sky with Exit Wounds is fearlessly honest. Vuong’s careful word choice and use of silence create vast, and sometimes desolate, landscapes. Describing his life as a refugee, to a country that now constantly waivers on accepting him, is bittersweet and bristles with feeling. Imaginary Vessels by Paisley Rekdal You may not have heard much about Paisley Rekdal, but now that’s changed! Clear and concise, Rekdal’s poetry is archly intelligent, lyrical, and full of contradictions. Imaginary Vessels relates being and identity to metaphorical personified “vessels” in poems the LA Times says “think as well as sing”. What could be more alive than poems that sing? Life on Mars by Tracy K. Smith Smith attentively combines sci-fi with poetry to create a collection well worth the recognition it has received. A New Yorker, Library Journal and Publishers Weekly Best Book of the Year (2011), Life on Mars is deceptively plain spoken while debating the source and meaning of dark matter and interplanetary travel and giving nods to pop icons like David Bowie. The poet talks of the loss of her father, once an engineer on the Hubble Telescope, but exists in a future where there are no real dangers. If you are “not really into poetry,” but want somewhere to start, this is a great beginning. There Are More Beautiful Things Than Beyonce by Morgan Parker An exquisite collection that examines black womanhood in contemporary American culture, There Are More Beautiful Things Than Beyonce analyzes pop-culture, politics, feminism, racism, and more. Parker’s words are multifaceted, magnetic, and unafraid, earning her a top spot on everyone’s to-watch (and to-read!) list. Catalog of Unabashed Gratitude by Ross Gay A celebration of life in all its stages and winner of the 2015 National Book Critics Circle Award for poetry, this collection is an abundant living joy. Escaping the dark tones that could hang over these poems, Gay offers comfort in knowing that all that causes sorrow, sadness and loss may also, with patience, heal us. Embrace the universe and all it has to offer in a book that Booklist calls “alive” and praises its embrace of the natural cycles of life. The Performance of Becoming Human by Daniel Borzutzky Acclaimed 2016 National Book Award Winner in poetry, The Performance of Being Human ignites our hearts with its surreal approach to very real issues. Plagued by violence and privatization of schools and police forces in his hometown of Chicago and his parents’ home country of Chile, Borzutzky brings to light these harsh truths in every line. In unveiling bitter realities, he also highlights those who may not be able to survive them. Watch Borzutsky perform one of his poems for maximum effect. Neon Soul by Alexandra Elle This new release comes from beloved author of Words From A Wanderer and Love In My Language. Elle speaks to where we are, where we’ve been, where we hope to someday be. Living as a young single mother, she celebrates her triumphs, not waiting for someone else to give praise to all her successes. Don’t be shy in experiencing the full range of what this collection will take you through. Shout with triumph, cry in realization, sit quietly and reflect. But most of all, feel. Let Them Eat Chaos by Kate Tempest Tempest prefaces this poem with a simple statement: “This poem was written to be read aloud.” Set to music on her album of the same name, this long poem is actually written for live performance. It focuses around seven neighbors in London who, despite their proximity, know nothing of each other until a storm draws them out into the street one night. Tempest challenges the forces of greed that divide us and pleads against self-involvement that leaves us indifferent to others. This is an electric performance, certainly one of the most powerful poetic statements of the year. Look: Poems by Solmaz Sharif What’s in a name, you ask? Everything. Conceptual, emotional, riveting, this debut collection and finalist for the National Book Award from Solmaz Sharif contemplates the costs of war and the insidious power of language. Revealing the violence used to manipulate words and sterilize emotion, Look asks us to evaluate our relationship with language reexamine the human life it contains. milk and honey by Rupi Kaur This emotionally poignant work fuses beautifully melancholic poetry with elegant line drawings in order to take the reader through the process of self discovery and healing after trauma. The work’s ubiquitous popularity is evidence of its ability to relate to women and girls coming of age everywhere. For more literary content, sign up for our Strand Insider newsletter. ", "title": "11 Writers Bringing Poetry to Life", "sentences": [{"c701": "11 Writers Bringing Poetry to Life"}, {"b5cb": "Poetry is what bridges our lived experiences and our ideals. It shows us what is possible while reminding us of what is. And yet, after all this, it still gets a bad rap! For those who think poetry is dying, or worse dead, check out these writers proving poetry is more alive than ever."}, {"8826": "Teaching My Mother How To Give Birth by Warsan Shire"}, {"4c6e": "After months of secret collaboration, Warsan shocked friends and strangers alike when it was revealed that her poetry was adapted for Beyonce’s visual album “Lemonade”. This collection, published several years prior, is packed with intense, raw poetry that leaves no mystery as to how Queen Bey was so inspired by her. Don’t be deceived by its brevity; Warsan stretches each word to the extent of its meaning, giving you plenty to think about weeks after you complete the final line."}, {"e894": "Night Sky with Exit Wounds by Ocean Vuong"}, {"d1c5": "A powerful debut collection, Night Sky with Exit Wounds is fearlessly honest. Vuong’s careful word choice and use of silence create vast, and sometimes desolate, landscapes. Describing his life as a refugee, to a country that now constantly waivers on accepting him, is bittersweet and bristles with feeling."}, {"cb51": "Imaginary Vessels by Paisley Rekdal"}, {"dd59": "You may not have heard much about Paisley Rekdal, but now that’s changed! Clear and concise, Rekdal’s poetry is archly intelligent, lyrical, and full of contradictions. Imaginary Vessels relates being and identity to metaphorical personified “vessels” in poems the LA Times says “think as well as sing”. What could be more alive than poems that sing?"}, {"4405": "Life on Mars by Tracy K. Smith"}, {"b39b": "Smith attentively combines sci-fi with poetry to create a collection well worth the recognition it has received. A New Yorker, Library Journal and Publishers Weekly Best Book of the Year (2011), Life on Mars is deceptively plain spoken while debating the source and meaning of dark matter and interplanetary travel and giving nods to pop icons like David Bowie. The poet talks of the loss of her father, once an engineer on the Hubble Telescope, but exists in a future where there are no real dangers. If you are “not really into poetry,” but want somewhere to start, this is a great beginning."}, {"ca48": "There Are More Beautiful Things Than Beyonce by Morgan Parker"}, {"37c5": "An exquisite collection that examines black womanhood in contemporary American culture, There Are More Beautiful Things Than Beyonce analyzes pop-culture, politics, feminism, racism, and more. Parker’s words are multifaceted, magnetic, and unafraid, earning her a top spot on everyone’s to-watch (and to-read!) list."}, {"202a": "Catalog of Unabashed Gratitude by Ross Gay"}, {"65c7": "A celebration of life in all its stages and winner of the 2015 National Book Critics Circle Award for poetry, this collection is an abundant living joy. Escaping the dark tones that could hang over these poems, Gay offers comfort in knowing that all that causes sorrow, sadness and loss may also, with patience, heal us. Embrace the universe and all it has to offer in a book that Booklist calls “alive” and praises its embrace of the natural cycles of life."}, {"b5bf": "The Performance of Becoming Human by Daniel Borzutzky"}, {"0526": "Acclaimed 2016 National Book Award Winner in poetry, The Performance of Being Human ignites our hearts with its surreal approach to very real issues. Plagued by violence and privatization of schools and police forces in his hometown of Chicago and his parents’ home country of Chile, Borzutzky brings to light these harsh truths in every line. In unveiling bitter realities, he also highlights those who may not be able to survive them. Watch Borzutsky perform one of his poems for maximum effect."}, {"c129": "Neon Soul by Alexandra Elle"}, {"8ce9": "This new release comes from beloved author of Words From A Wanderer and Love In My Language. Elle speaks to where we are, where we’ve been, where we hope to someday be. Living as a young single mother, she celebrates her triumphs, not waiting for someone else to give praise to all her successes. Don’t be shy in experiencing the full range of what this collection will take you through. Shout with triumph, cry in realization, sit quietly and reflect. But most of all, feel."}, {"c611": "Let Them Eat Chaos by Kate Tempest"}, {"9bc6": "Tempest prefaces this poem with a simple statement: “This poem was written to be read aloud.” Set to music on her album of the same name, this long poem is actually written for live performance. It focuses around seven neighbors in London who, despite their proximity, know nothing of each other until a storm draws them out into the street one night. Tempest challenges the forces of greed that divide us and pleads against self-involvement that leaves us indifferent to others. This is an electric performance, certainly one of the most powerful poetic statements of the year."}, {"c8fb": "Look: Poems by Solmaz Sharif"}, {"b3a0": "What’s in a name, you ask? Everything. Conceptual, emotional, riveting, this debut collection and finalist for the National Book Award from Solmaz Sharif contemplates the costs of war and the insidious power of language. Revealing the violence used to manipulate words and sterilize emotion, Look asks us to evaluate our relationship with language reexamine the human life it contains."}, {"8293": "milk and honey by Rupi Kaur"}, {"354b": "This emotionally poignant work fuses beautifully melancholic poetry with elegant line drawings in order to take the reader through the process of self discovery and healing after trauma. The work’s ubiquitous popularity is evidence of its ability to relate to women and girls coming of age everywhere."}, {"715c": "For more literary content, sign up for our Strand Insider newsletter."}], "child": "1238_1\t1238_21238_1\t1238_21238_1\t1238_2"}