{"name": "124", "parent": "", "content": "Steph Curry’s One-Week MVP Campaign Blitz The back-to-back winner of the award would like a word with you Sometimes we make up our mind about what kind of season an NBA player or team is having, and we just stick to it, no matter what happens late in the campaign. Take Steph Curry, for example. The two-time defending MVP spent the year rebounding from an embarrassing Finals collapse, adjusting to the arrival of a 6-foot-9 Reaper in his offense, and putting up one of the worst shooting nights ever by the very stroke that famed him (and a low-pressure system that threw off his shot). This time last year, he was being coronated as one of the game’s all-time greats. Now, he finds himself removed from the MVP conversation, left out as we debate the merits of a seemingly exclusive club of four — James Harden, Russell Westbrook, Kawhi Leonard, LeBron James. Where You Stand in the Westbrook-Harden MVP Debate Says a Lot About YouHow do you define “most valuable”?theringer.com Thankfully, Curry did not get the message about our fixed story lines. And as Exhibits A through K, he’d like to present this little 11-game winning streak on which he’s led the Warriors. In his past three games alone, Steph racked up wins against the Spurs, Rockets, and Wizards, averaging nearly 32 points and eight assists, during which he outplayed niche MVP front-runner Leonard, actual MVP front-runner Harden, and near-future MVP contender John Wall. Against San Antonio last Wednesday, Curry bought a fixer-upper bed-and-breakfast behind the arc, refurbishing the spot long enough to sink three 3s in the third set. His 13 points that quarter helped Golden State reclaim the lead and assert its Western Conference supremacy. He finished with 29 points and 11 assists in Golden State’s ninth consecutive win. Against the Rockets two days later, Curry filled up his highlight reel with dimes of every kind, showing off that endearing way his playmaking sometimes looks like the love child of luck and skill. Twenty-four points, five assists, seven rebounds, and two steals later, Curry led the team to its 10th straight. On Sunday, in a 139–115 Warriors win over Washington, this pregame shot at Oracle was a sign of things to come. An early 3-pointer was Curry’s most impressive, as he simultaneously faked Marcin Gortat out of knowing Polish altogether and whispered, “Komu pora, temu czas” (“When it’s your time, you have to go”), as the shot went down. RIP, Gortat, though it had to be you, as we all know you hate wearing black. After draining six from behind the arc in the first half for 22 points, Curry sunk a deep ball in the third quarter to pass 300 beyond-the-arc makes on the season, a league high. The guy trailing almost 50 3-pointers behind in second place is teammate Klay Thompson, which, ah, right: Splash Brothers. Welcome back. The team’s performance has had the same effervescence as last year’s regular-season Warriors, and Curry has played at his old MVP level. After losing five of seven in late February and early March and struggling to find his groove as the team shifted from no Durant to Durant (then back to no Durant), Curry’s concerns were bigger than his erasure from this year’s MVP running. Having Kevin Durant and Curry both in Oakland is obviously better than not, but Curry’s newfound success during KD’s absence does call attention to the Durantula in the room. Does having a KD-less court to preside over free up Steph? The thought has entered Steve Kerr’s mind. Jokes aside, Curry ended Sunday’s game with 42 points and eight assists on 68 percent shooting (64 percent from deep). Steph is rewriting the story of his season at the perfect time. ", "title": "Steph Curry’s One-Week MVP Campaign Blitz", "sentences": [{"c103": "Steph Curry’s One-Week MVP Campaign Blitz"}, {"6a32": "The back-to-back winner of the award would like a word with you"}, {"a796": "Sometimes we make up our mind about what kind of season an NBA player or team is having, and we just stick to it, no matter what happens late in the campaign. Take Steph Curry, for example. The two-time defending MVP spent the year rebounding from an embarrassing Finals collapse, adjusting to the arrival of a 6-foot-9 Reaper in his offense, and putting up one of the worst shooting nights ever by the very stroke that famed him (and a low-pressure system that threw off his shot). This time last year, he was being coronated as one of the game’s all-time greats. Now, he finds himself removed from the MVP conversation, left out as we debate the merits of a seemingly exclusive club of four — James Harden, Russell Westbrook, Kawhi Leonard, LeBron James."}, {"d413": "Where You Stand in the Westbrook-Harden MVP Debate Says a Lot About YouHow do you define “most valuable”?theringer.com"}, {"5403": "Thankfully, Curry did not get the message about our fixed story lines. And as Exhibits A through K, he’d like to present this little 11-game winning streak on which he’s led the Warriors."}, {"d9c0": "In his past three games alone, Steph racked up wins against the Spurs, Rockets, and Wizards, averaging nearly 32 points and eight assists, during which he outplayed niche MVP front-runner Leonard, actual MVP front-runner Harden, and near-future MVP contender John Wall."}, {"895e": "Against San Antonio last Wednesday, Curry bought a fixer-upper bed-and-breakfast behind the arc, refurbishing the spot long enough to sink three 3s in the third set. His 13 points that quarter helped Golden State reclaim the lead and assert its Western Conference supremacy. He finished with 29 points and 11 assists in Golden State’s ninth consecutive win."}, {"35e8": "Against the Rockets two days later, Curry filled up his highlight reel with dimes of every kind, showing off that endearing way his playmaking sometimes looks like the love child of luck and skill. Twenty-four points, five assists, seven rebounds, and two steals later, Curry led the team to its 10th straight."}, {"22d4": "On Sunday, in a 139–115 Warriors win over Washington, this pregame shot at Oracle was a sign of things to come. An early 3-pointer was Curry’s most impressive, as he simultaneously faked Marcin Gortat out of knowing Polish altogether and whispered, “Komu pora, temu czas” (“When it’s your time, you have to go”), as the shot went down. RIP, Gortat, though it had to be you, as we all know you hate wearing black."}, {"ca4f": "After draining six from behind the arc in the first half for 22 points, Curry sunk a deep ball in the third quarter to pass 300 beyond-the-arc makes on the season, a league high. The guy trailing almost 50 3-pointers behind in second place is teammate Klay Thompson, which, ah, right: Splash Brothers. Welcome back."}, {"a8a2": "The team’s performance has had the same effervescence as last year’s regular-season Warriors, and Curry has played at his old MVP level. After losing five of seven in late February and early March and struggling to find his groove as the team shifted from no Durant to Durant (then back to no Durant), Curry’s concerns were bigger than his erasure from this year’s MVP running. Having Kevin Durant and Curry both in Oakland is obviously better than not, but Curry’s newfound success during KD’s absence does call attention to the Durantula in the room. Does having a KD-less court to preside over free up Steph? The thought has entered Steve Kerr’s mind."}, {"b8ef": "Jokes aside, Curry ended Sunday’s game with 42 points and eight assists on 68 percent shooting (64 percent from deep). Steph is rewriting the story of his season at the perfect time."}], "child": "124_1\t124_2\t124_3\t124_4\t124_5\t124_6\t124_7\t124_8\t124_9\t124_10\t124_11\t124_12"}