{"name": "1251", "parent": "", "content": "Do We Really Want to Live Forever, Though? Slate discusses the “economic problems” with immortality. Since I’m guessing many of us may be carrying around our own set of dystopian fears right now, let’s push our individual concerns to the back of our minds so we can discuss one potential dystopia together: the looming threat of immortality. Slate Money on the Cost of Living ForeverListen to Episode No. 130 of Slate Money: On this episode of Slate Money, hosts Felix Salmon of Fusion; Cathy O'Neil…www.slate.com Today’s Slate Money podcast discusses all of the terrible things that might happen if we either live forever (an improbable, but possible, scenario) or significantly increase our lifespans (a more probable scenario). “There are really big problems with people living forever. Like, economic problems,” Felix Salmon explains. Let’s say we put a rich person in a cryogenic freezing chamber and keep that person there for 40 years. That person’s money is likely to earn a whole bunch of compound interest, making the rich person even richer and effectively locking that money up and keeping it out of the rest of the economy. If the rich person owned property, that property might be locked up as well. After all, the rich person is going to need a home to come back to after they unfreeze the head and attach it to either 1) a younger body or 2) a robot. I’m not sure I completely agree with this dire scenario, since there are certainly ways for both the rich person’s money and their property to continue to circulate in the larger economy even while their owner is on ice—endowments, letting heirs manage the finances, maybe renting out some of that property on Airbnb—but yes, freezing rich people is likely to freeze at least some of their wealth. Freezing rich people is also likely to freeze progress, even though people seem to think the opposite will happen. (This is the “if only they had frozen Steve Jobs” theory, which Slate references.) It’s like… nobody wants Iron Man 4. Tony Stark is a charismatic and innovative superhero and I certainly enjoyed the first couple of Iron Men and then I fell asleep during the third one, because Tony wasn’t doing anything new. He puts the Arc Reactor in, he takes the Arc Reactor out. He puts his suits together and he takes his suits apart. That’s what he’s all about. 👏 So yeah, now you know what I think of the potential terror of living forever, and I haven’t even started with my individual fears of, like, what would I do if they told me I could be immortal? Would I sign up for the cryofreezing thing, or would I remain steadfast to my original plan of dying and then getting turned into a cremain diamond that gets set in a piece of costume jewelry and donated to a community theater, which is seriously what I would like to happen after I die, please consider this a legitimate request? What about you? ", "title": "Do We Really Want to Live Forever, Though?", "sentences": [{"4729": "Do We Really Want to Live Forever, Though?"}, {"56f2": "Slate discusses the “economic problems” with immortality."}, {"6249": "Since I’m guessing many of us may be carrying around our own set of dystopian fears right now, let’s push our individual concerns to the back of our minds so we can discuss one potential dystopia together: the looming threat of immortality."}, {"32f4": "Slate Money on the Cost of Living ForeverListen to Episode No. 130 of Slate Money: On this episode of Slate Money, hosts Felix Salmon of Fusion; Cathy O'Neil…www.slate.com"}, {"a4ed": "Today’s Slate Money podcast discusses all of the terrible things that might happen if we either live forever (an improbable, but possible, scenario) or significantly increase our lifespans (a more probable scenario)."}, {"1c48": "“There are really big problems with people living forever. Like, economic problems,” Felix Salmon explains. Let’s say we put a rich person in a cryogenic freezing chamber and keep that person there for 40 years. That person’s money is likely to earn a whole bunch of compound interest, making the rich person even richer and effectively locking that money up and keeping it out of the rest of the economy."}, {"b197": "If the rich person owned property, that property might be locked up as well. After all, the rich person is going to need a home to come back to after they unfreeze the head and attach it to either 1) a younger body or 2) a robot."}, {"11d7": "I’m not sure I completely agree with this dire scenario, since there are certainly ways for both the rich person’s money and their property to continue to circulate in the larger economy even while their owner is on ice—endowments, letting heirs manage the finances, maybe renting out some of that property on Airbnb—but yes, freezing rich people is likely to freeze at least some of their wealth."}, {"5323": "Freezing rich people is also likely to freeze progress, even though people seem to think the opposite will happen. (This is the “if only they had frozen Steve Jobs” theory, which Slate references.) It’s like… nobody wants Iron Man 4. Tony Stark is a charismatic and innovative superhero and I certainly enjoyed the first couple of Iron Men and then I fell asleep during the third one, because Tony wasn’t doing anything new. He puts the Arc Reactor in, he takes the Arc Reactor out. He puts his suits together and he takes his suits apart. That’s what he’s all about. 👏"}, {"b73c": "So yeah, now you know what I think of the potential terror of living forever, and I haven’t even started with my individual fears of, like, what would I do if they told me I could be immortal? Would I sign up for the cryofreezing thing, or would I remain steadfast to my original plan of dying and then getting turned into a cremain diamond that gets set in a piece of costume jewelry and donated to a community theater, which is seriously what I would like to happen after I die, please consider this a legitimate request?"}, {"5f66": "What about you?"}], "child": "1251_1\t1251_2\t1251_3\t1251_4\t1251_5\t1251_6\t1251_7\t1251_8\t1251_9\t1251_10\t1251_11"}