{"name": "1256", "parent": "", "content": "{28} Today, I made $3. It’s the best $3 I ever made. Queer as a… When I put the paypal link at the end of yesterday’s post, it wasn’t with the expectation that anyone would use it; it was more to a) challenge myself to accept that my work has intrinsic value, maybe, to someone, and to b) do something that I think we all should consider doing. It didn’t seem right to come out and be all, “Hey we should all do this!” and then, you know. Not do it. So over the course of the day, a few people sent in a few dollars — the very first few dollars I’ve ever made from words. Possibly the only dollars I’ll ever make from words. And I have to tell you: I have had permagrin all day. I could not expect the rush of emotion I got. There were, I’ll admit, tears. I texted my mom when the first one rolled in and she texted back, “You’re a writer now.” Indeed. Ya’ll, if you never thought people value your words, please consider doing this. Not only because it’s a way to re-shape a community into one where people have an option to exchange real-life value for real-life words (rather than the somewhat hollow, content-driven mess the internet has quickly turned into), but because I don’t think, if you’ve never had the dollar for word exchange thing, you can imagine what it means. It means so much. To those who felt moved to drop a few bucks into my paypal account yesterday (I won’t call you out, but you know who you are), thank you. So much. Some day I’ll have better words than that, but today, please know how very much it meant to me. I still feel weird putting this at the end of posts, but I’m going to keep doing it because it’s so hard for me. Contribute if you wish, but definitely please consider putting your own link on your work. Your words have value. ❤ Pay Kimberley Saumell using PayPal.MeGo to paypal.me/ZeldaPinwheel and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me ", "title": "{28} Today, I made $3.", "sentences": [{"6b9d": "{28} Today, I made $3."}, {"0fe3": "It’s the best $3 I ever made."}, {"2427": "Queer as a…"}, {"84b6": "When I put the paypal link at the end of yesterday’s post, it wasn’t with the expectation that anyone would use it; it was more to a) challenge myself to accept that my work has intrinsic value, maybe, to someone, and to b) do something that I think we all should consider doing. It didn’t seem right to come out and be all, “Hey we should all do this!” and then, you know. Not do it."}, {"0d63": "So over the course of the day, a few people sent in a few dollars — the very first few dollars I’ve ever made from words. Possibly the only dollars I’ll ever make from words. And I have to tell you: I have had permagrin all day. I could not expect the rush of emotion I got. There were, I’ll admit, tears."}, {"9231": "I texted my mom when the first one rolled in and she texted back, “You’re a writer now.”"}, {"b82a": "Indeed."}, {"ed95": "Ya’ll, if you never thought people value your words, please consider doing this. Not only because it’s a way to re-shape a community into one where people have an option to exchange real-life value for real-life words (rather than the somewhat hollow, content-driven mess the internet has quickly turned into), but because I don’t think, if you’ve never had the dollar for word exchange thing, you can imagine what it means. It means so much."}, {"29bd": "To those who felt moved to drop a few bucks into my paypal account yesterday (I won’t call you out, but you know who you are), thank you. So much. Some day I’ll have better words than that, but today, please know how very much it meant to me."}, {"0526": "I still feel weird putting this at the end of posts, but I’m going to keep doing it because it’s so hard for me. Contribute if you wish, but definitely please consider putting your own link on your work. Your words have value. ❤"}, {"449f": "Pay Kimberley Saumell using PayPal.MeGo to paypal.me/ZeldaPinwheel and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "child": "1256_1\t1256_2"}