{"name": "1257", "parent": "", "content": "{27}Getting paid to write on Medium. It’s not how you think. Ok so please forgive the clickbait worthy title, but I’ve been thinking about this a lot since the whole Partnership/Member debacle unfolded. It’s been a much discussed topic here and elsewhere that artists of any ilk are very much undervalued. For writing in particular, the rise of clickbait and listicles and junk journalism is doing even more to undermine those who actually try to refine our skills and craft. Passion is not rewarded; clicks are. When Medium rolled out its Membership to some and Partnership to even fewer, I realized how true this really is. While certainly there are medium “superstars” who have hundreds of thousands of readers, there are many of us who have a few thousand — or even a few hundred — readers that nonetheless still bring readers to the site daily. Some of us are only readers, commenting occasionally, if ever, and simply recommending that others join the community to be exposed to thinkers, poets, and writers you won’t find anywhere else. And yet… And yet, Medium seems intent on rewarding those who create content that can be found, let’s face it, anywhere else on the internet. There are plenty of sites where you can find listicles and pseudo-inspirational crap for those days when you feel like you need a kick in the ass. I don’t know about you, but that’s not why I come here. The pieces that I’ve read and have haunted or inspired me have not been the ones that promise 37 Ways to Be More Productive Before 3:27 AM or 15 Ways to Make Your Asshole Smell Like Fine Wine — they have been heartfelt, heart wrenching, authentic pieces that were raw, unique, and relatable. I want more of this. I want to be able to, if I want to contribute five bucks to a writer, know that my money is going to the writer that inspired me — not the one that slammed out an article that’s been written fifteen times and is being passed around facebook every three days. I think, in a way, this was the thing Medium has completely misunderstood about its unique value. I think that this is where their attempts to monetize really missed the mark and actually caused a lot of us to feel alienated and kind of used. And then, I read this thought by Jim Reeves: This. Very few writers that I like ask for donations, even when I’m sure it might help them expand…medium.com What a brilliant thought! I don’t always have the extra money at the end of the month to commit to a monthly payment, but wouldn’t it be amazing to bookmark the piece that kept me awake at night or that kept coming back to me during a long drive and, when I had the extra money, send that writer a few bucks in thanks? Wouldn’t that be a unique service to provide — a way to support the actual writers we read? Shit, Medium could even slap a fee on the way PayPal does and still make money off of us if they wanted to, but could revolutionize this Facebook era trend where millions of us create content on sites for free and never have a chance at being compensated. However, since it is doubtful that medium will create such a program on their own, here’s what I propose: Set up a PayPal account. Figure out how to link it to your stories (I’m working on it), and do so. I know, I know — I have thought about this and felt (and still feel) uncomfortable doing it. I don’t know if what I have to offer is good enough to ask for compensation, and I know that most of the folks who are good enough to read my writing don’t have money to toss around. But I’ll tell you this, fellow writers: I value your words. So many of you have written the exact words I needed on a bad day, or given me inspiration on an uninspired one, or made me laugh on a joyless one. I know the green heart means the world, but if I could buy you a cup of coffee or a beer or the extra guacamole on your burrito, I would love to — even if it’s just once. Medium provided us the unique opportunity to create a community and we did. We found its true value, and in fact, created it ourselves. I’m not saying we should all throw money around, but let’s value ourselves, our work, our words enough to say, “Hey. If you’re here and you’re reading and you want to, here’s a way to support the writers that make this community special.” So. Listen. If you’re here and you’re reading and you want to, here’s a way to support the writers that make this community special. Pay Kimberley Saumell using PayPal.MeGo to paypal.me/ZeldaPinwheel and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me ", "title": "{27}Getting paid to write on Medium.", "sentences": [{"c2e2": "{27}Getting paid to write on Medium."}, {"2e67": "It’s not how you think."}, {"f296": "Ok so please forgive the clickbait worthy title, but I’ve been thinking about this a lot since the whole Partnership/Member debacle unfolded. It’s been a much discussed topic here and elsewhere that artists of any ilk are very much undervalued. For writing in particular, the rise of clickbait and listicles and junk journalism is doing even more to undermine those who actually try to refine our skills and craft. Passion is not rewarded; clicks are."}, {"24e6": "When Medium rolled out its Membership to some and Partnership to even fewer, I realized how true this really is. While certainly there are medium “superstars” who have hundreds of thousands of readers, there are many of us who have a few thousand — or even a few hundred — readers that nonetheless still bring readers to the site daily. Some of us are only readers, commenting occasionally, if ever, and simply recommending that others join the community to be exposed to thinkers, poets, and writers you won’t find anywhere else. And yet…"}, {"0d41": "And yet, Medium seems intent on rewarding those who create content that can be found, let’s face it, anywhere else on the internet. There are plenty of sites where you can find listicles and pseudo-inspirational crap for those days when you feel like you need a kick in the ass. I don’t know about you, but that’s not why I come here. The pieces that I’ve read and have haunted or inspired me have not been the ones that promise 37 Ways to Be More Productive Before 3:27 AM or 15 Ways to Make Your Asshole Smell Like Fine Wine — they have been heartfelt, heart wrenching, authentic pieces that were raw, unique, and relatable."}, {"3559": "I want more of this. I want to be able to, if I want to contribute five bucks to a writer, know that my money is going to the writer that inspired me — not the one that slammed out an article that’s been written fifteen times and is being passed around facebook every three days. I think, in a way, this was the thing Medium has completely misunderstood about its unique value. I think that this is where their attempts to monetize really missed the mark and actually caused a lot of us to feel alienated and kind of used."}, {"9629": "And then, I read this thought by Jim Reeves:"}, {"0ba3": "This. Very few writers that I like ask for donations, even when I’m sure it might help them expand…medium.com"}, {"f06a": "What a brilliant thought! I don’t always have the extra money at the end of the month to commit to a monthly payment, but wouldn’t it be amazing to bookmark the piece that kept me awake at night or that kept coming back to me during a long drive and, when I had the extra money, send that writer a few bucks in thanks? Wouldn’t that be a unique service to provide — a way to support the actual writers we read? Shit, Medium could even slap a fee on the way PayPal does and still make money off of us if they wanted to, but could revolutionize this Facebook era trend where millions of us create content on sites for free and never have a chance at being compensated."}, {"b142": "However, since it is doubtful that medium will create such a program on their own, here’s what I propose:"}, {"b46a": "Set up a PayPal account. Figure out how to link it to your stories (I’m working on it), and do so. I know, I know — I have thought about this and felt (and still feel) uncomfortable doing it. I don’t know if what I have to offer is good enough to ask for compensation, and I know that most of the folks who are good enough to read my writing don’t have money to toss around. But I’ll tell you this, fellow writers: I value your words. So many of you have written the exact words I needed on a bad day, or given me inspiration on an uninspired one, or made me laugh on a joyless one. I know the green heart means the world, but if I could buy you a cup of coffee or a beer or the extra guacamole on your burrito, I would love to — even if it’s just once."}, {"f05c": "Medium provided us the unique opportunity to create a community and we did. We found its true value, and in fact, created it ourselves. I’m not saying we should all throw money around, but let’s value ourselves, our work, our words enough to say, “Hey. If you’re here and you’re reading and you want to, here’s a way to support the writers that make this community special.”"}, {"a9e6": "So. Listen. If you’re here and you’re reading and you want to, here’s a way to support the writers that make this community special."}, {"ee77": "Pay Kimberley Saumell using PayPal.MeGo to paypal.me/ZeldaPinwheel and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "child": "1257_1\t1257_2\t1257_3\t1257_4\t1257_5\t1257_6\t1257_7\t1257_8\t1257_9\t1257_10\t1257_11\t1257_12\t1257_13\t1257_14\t1257_15\t1257_16\t1257_17"}