{"name": "1258", "parent": "", "content": "I have been obsessed with this Botticelli since I was a fetus. Or thereabouts. I definitely didn’t scream when we rounded the corner and saw it there all unabashed on the wall. (337) Value We have a problem with valuing work. Not only do we not value our own work, we refuse to value work from anyone if it doesn’t come packaged in a bracing blue and socially praised bow. We claim value based on arbitrary definitions of ‘necessity’ and the ever-fuckable fun zone of popularity. We are allowed the whim of our inclinations when it comes to supporting ‘work’ because support is indicative of character, not necessity. We are allowed the whim of popularity when it comes to supporting ‘work’ because trends are fun, but definitely, most absolutely assuredly, not moral. We are allowed the whim of merit when it comes to where our hard-earned dollars go, because privilege only factors for things not earned and we have all, in every possible way, earned our dollars. We can’t see that art is necessity. We don’t hear our own heart when fear knocks and we don’t cry alone, ever. We can’t fathom that the words that melt us for mere seconds, the seven chords that wreak shivers across our backs, the lilt in twelve easy eighth notes that simply stops time…will matter in ten minutes when our boss doesn’t see our fatigue, in an hour when our grandmother dies, in a week when we’re fired and can’t make the mortgage. We can’t grasp that the pulse that holds us, the phrase that keeps us whole, when our boss is shit, our lives fray, and our world sneers, is art. It always was and always is and always will be, and we can’t muster the courage it would take to let something fundamentally intangible be all that matters in a tangible world. It’s just too risky, even as it saves us. It’s just too unlikely, too un-measurable, too damn vulnerable, to be anything we’d invest in permanently. Even as it continues to hold our most broken selves, even as it makes real and visible our furthest reaches and fantastical wants. Even as it lifts us from our wallow, daily, minutely, infinitely; we just can’t. Pay Heejin Weisbrod using PayPal.MeGo to paypal.me/ClassicalSass and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me ", "title": "(337) Value", "sentences": [{"28d9": "I have been obsessed with this Botticelli since I was a fetus. Or thereabouts. I definitely didn’t scream when we rounded the corner and saw it there all unabashed on the wall."}, {"2acf": "(337) Value"}, {"b9c4": "We have a problem with valuing work. Not only do we not value our own work, we refuse to value work from anyone if it doesn’t come packaged in a bracing blue and socially praised bow. We claim value based on arbitrary definitions of ‘necessity’ and the ever-fuckable fun zone of popularity."}, {"8216": "We are allowed the whim of our inclinations when it comes to supporting ‘work’ because support is indicative of character, not necessity. We are allowed the whim of popularity when it comes to supporting ‘work’ because trends are fun, but definitely, most absolutely assuredly, not moral. We are allowed the whim of merit when it comes to where our hard-earned dollars go, because privilege only factors for things not earned and we have all, in every possible way, earned our dollars."}, {"35ad": "We can’t see that art is necessity. We don’t hear our own heart when fear knocks and we don’t cry alone, ever. We can’t fathom that the words that melt us for mere seconds, the seven chords that wreak shivers across our backs, the lilt in twelve easy eighth notes that simply stops time…will matter in ten minutes when our boss doesn’t see our fatigue, in an hour when our grandmother dies, in a week when we’re fired and can’t make the mortgage."}, {"455f": "We can’t grasp that the pulse that holds us, the phrase that keeps us whole, when our boss is shit, our lives fray, and our world sneers, is art. It always was and always is and always will be, and we can’t muster the courage it would take to let something fundamentally intangible be all that matters in a tangible world. It’s just too risky, even as it saves us. It’s just too unlikely, too un-measurable, too damn vulnerable, to be anything we’d invest in permanently. Even as it continues to hold our most broken selves, even as it makes real and visible our furthest reaches and fantastical wants. Even as it lifts us from our wallow, daily, minutely, infinitely; we just can’t."}, {"1091": "Pay Heejin Weisbrod using PayPal.MeGo to paypal.me/ClassicalSass and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "child": "1258_1\t1258_2"}