{"name": "126", "parent": "", "content": "The Five Stephen Curry 3s You Meet in Basketball Heaven From the Thermometer to the Apocalypto, we’re naming and cataloging the best Steph 3s Just inside the final two minutes of a still-kind-of-close game between the Warriors (107) and the Rockets (99) earlier this week, Steph Curry had the ball 5 feet behind the 3-point line and was staring down Clint Capela, a lovable and respectable center for the Rockets. Now, had the Rockets been able to force a stop there, they’d have been in a decent spot. They have the league’s second-most-potent offense, and they have James Harden, who is as deadly an offensive weapon as there has ever been, so the game would have certainly been in reach and even, potentially, winnable. (Harden actually ended up making a 3 on the very next play, which would’ve cut the lead to five with still over a minute and a half to play.) Steph, though, the bossiest of all the babies, made sure none of that came into play. He took a couple of dribbles to calculate all of the things he calculates, then pulled up. Capela did his very best to stop him, stretching his Gumby body as far toward Steph as physics would allow, but it made no difference. The ball zipped up into the sky before he could block it or deflect it or affect it in any way, and two seconds later it splashed through the net. Steph turned around, then angrily slapped at his own shooting arm several times, as though he were punishing it, as though he were admonishing it, as though it had offended him with how haphazard and hurtful it’d been to Capela, to the Rockets, to all of the city of Houston and its surrounding suburbs. There were, for sure, several better shots to take in that moment: Andre Iguodala stood all alone in the nearest corner, for example, and Draymond Green had Harden on him, so that was basically a guaranteed bucket. And the situation certainly allowed for the searching out of such options: There was plenty of time left on the shot clock, there was plenty of space behind Capela that he could wiggle his way into, etc. But Steph, sensing a potentially game-ending wound, opted to inflict it. He decided to end the game right there and right then. Steph Curry shoots 3s just like other NBA players shoot 3s, but he also does so on a bigger level, a broader level, a more nuanced level, a more complicated level. The 3 he hit on Capela wasn’t a regular 3. It was very clearly not that. It was a Mortal Wound 3: a 3 he shot not because it was necessary, but a 3 he shot because he wanted to kill. Steph Curry shoots many different types of 3s. Some, like the one I just mentioned, are extremely brutal, others less so. For example, he has a 3 that he likes to shoot earlier in the game to figure out whether it’s going to be one of those nights where he goes atomic. That one’s called The Thermometer 3, and it’s 10 percent devastating. He has one called The Our Father Who Art In Heaven 3, and that’s the one he shoots where he arcs the ball some 40 feet up in the air, like he did to Tyson Chandler in 2013. That one is 20 percent devastating. He has one called The Shallow-Grave 3 (30 percent devastating), one called The Enemy At The Gates 3 (40 percent devastating), and one called The GTFOH 3 that he seems to save up and use only against the Clippers … … and the Thunder … … and the Cavs … The are many, many, many Steph Curry 3s. We’ve already mentioned five of them. Let’s examine five other ones that he shoots regularly, and let’s give proper Devastation Scores, a description, and an example of each. Before we continue this, may I share some numbers with you? These all come via Mike Lynch at Basketball-Reference.com, and they are legit incredible: Five More Types of 3s That Steph Curry Shoots Name: The Thor Lifting His Hammer 3 Devastation Score: 50 percent devastating Description and Example: This is the 3 that, even though the results are entirely inconsequential, Steph shoots just to let you know that he can. A good example was that time against the Pacers in 2016 when, even though the buzzer had clearly already sounded and there was nothing to be gained by doing so, he flung the ball up at the rim from 65 feet away. The ball splashed in, then the camera cut to Steph and this was the face he was making: He looks very ho-hum; very bored; very What’s the big deal?; very So these are humans, huh?; very Why did Indiana even bother showing up?; very The universe is so much bigger than anyone besides me will ever truly know. Name: The “You want it to be one way” 3 Devastation Score: 60 percent devastating Description and Example: This is the 3 where you want it to be one way, but Steph shoots it to let you know it’s the other way. The most perfect example was that 3 at the end of the third quarter of Game 6 of the Western Conference semifinals against the Grizzlies in 2015. The Warriors led the series 3–2 and they were playing in Memphis. The game was close (73–68) and the Grizzlies had the ball with a chance to cut it to two or three. Also, remember, this was before the Warriors had won a championship, so most people didn’t quite understand how all the way terrifying that team was yet. There was a feeling that if Memphis could just squeak out a win in Game 6, their veteran leadership would prove the difference in a big, Big, BIG Game 7. Only Jeff Green dribbled the ball up the court in the final seconds, tried to shoot a 3 at the buzzer, had it blocked, and then everyone watched as Steph, who’d grabbed the loose ball, chest-passed a 75-foot shot at the buzzer toward the other rim that swished in. The Grizzlies were suddenly down eight, the crowd was stunned, and 12 game minutes later the Warriors were headed to the next round of the playoffs. The Grizzlies wanted it to be one way, but it was the other way. Name: The Public Embarrassment 3 Devastation Score: 70 percent devastating Description and Example: This is that 3 where, before Steph shoots it, he goes one-on-one against a person he has a particular and discernible dislike for and just puts ’em in a total torture chamber. There’s nastiness to this 3; there’s anger in it; it’s full of true condescension. It serves to score points for his team, absolutely, but mostly it serves to drain all of the hope and ambition out of the body of the defender, a way for Steph Curry to say, “You could never f*cking guard me,” even though Steph Curry would never, ever say, “You could never f*cking guard me.” The best example was at the end of Game 5 of the 2015 Finals, when he turned Matthew Dellavedova into a bag of wet spaghetti after LeBron said that Delly’s defense was the reason Steph struggled earlier in the series. (You’ll notice we’re jumping from 70 percent devastating to 90 percent devastating. The 80 percent devastating slot is occupied by The Mortal Wound 3.) Name: The Apocalypto 3 Devastation Score: 90 percent devastating Description and Example: This is the 3 Steph shoots where he toasts somewhere from three to five different defenders on his way to getting it off. The best example was when he did it during a March game against the Clippers in 2015. The Clips had successfully warded off that play the Warriors run where they toss the ball to Draymond at the corner of the free throw line and then he just pulls the legs off the defense, and so Andrew Bogut ended up with the ball out at the 3-point line, and the Clips were in a good spot defensively. Then Steph ran over, grabbed the ball from Bogut, and got busy. He dribbled through Matt Barnes, tossed it behind his back as he ziplined away from DeAndre Jordan, who was in front of him, and Chris Paul, who was behind him. He was in the middle of the fray by that point (even Spencer Hawes had stepped in to try to stop him), so he turned and retreated to the 3-point line at the top of the key. Rather than resetting the offense, though, he simply put both feet behind the line, turned back toward the rim, then shot a falling, off-balance 3 as Barnes, Paul, DeAndre, and Spencer all rolled around in the flames as their village burned to the ground behind them. Name: The “Bitch, you thought” 3 Devastation Score: 100 percent devastating Description and Example: This is the 3 Steph shoots where he snatches a win from the belly of his opponents. It is, duh, the most devastating of all of the different versions of 3s that he shoots. The best example was that 3 he hit over Tobias Harris to steal a game from the Magic, but actually the best example was that 3 he hit over Anthony Davis in Game 3 of the first round of the 2015 playoffs that tied the game that they eventually stole in overtime, but actually the best example was that 3 he hit over Andre Roberson to steal that game from the Thunder. Steph Curry shoots The “Bitch, you thought” 3 a lot, is what I’m trying to say, even though Steph Curry would also never, ever say, “Bitch, you thought,” either. ", "title": "The Five Stephen Curry 3s You Meet in Basketball Heaven", "sentences": [{"15a2": "The Five Stephen Curry 3s You Meet in Basketball Heaven"}, {"afba": "From the Thermometer to the Apocalypto, we’re naming and cataloging the best Steph 3s"}, {"a6e1": "Just inside the final two minutes of a still-kind-of-close game between the Warriors (107) and the Rockets (99) earlier this week, Steph Curry had the ball 5 feet behind the 3-point line and was staring down Clint Capela, a lovable and respectable center for the Rockets. Now, had the Rockets been able to force a stop there, they’d have been in a decent spot. They have the league’s second-most-potent offense, and they have James Harden, who is as deadly an offensive weapon as there has ever been, so the game would have certainly been in reach and even, potentially, winnable. (Harden actually ended up making a 3 on the very next play, which would’ve cut the lead to five with still over a minute and a half to play.) Steph, though, the bossiest of all the babies, made sure none of that came into play."}, {"dfcc": "He took a couple of dribbles to calculate all of the things he calculates, then pulled up. Capela did his very best to stop him, stretching his Gumby body as far toward Steph as physics would allow, but it made no difference. The ball zipped up into the sky before he could block it or deflect it or affect it in any way, and two seconds later it splashed through the net. Steph turned around, then angrily slapped at his own shooting arm several times, as though he were punishing it, as though he were admonishing it, as though it had offended him with how haphazard and hurtful it’d been to Capela, to the Rockets, to all of the city of Houston and its surrounding suburbs."}, {"1a24": "There were, for sure, several better shots to take in that moment: Andre Iguodala stood all alone in the nearest corner, for example, and Draymond Green had Harden on him, so that was basically a guaranteed bucket. And the situation certainly allowed for the searching out of such options: There was plenty of time left on the shot clock, there was plenty of space behind Capela that he could wiggle his way into, etc. But Steph, sensing a potentially game-ending wound, opted to inflict it. He decided to end the game right there and right then."}, {"0295": "Steph Curry shoots 3s just like other NBA players shoot 3s, but he also does so on a bigger level, a broader level, a more nuanced level, a more complicated level. The 3 he hit on Capela wasn’t a regular 3. It was very clearly not that. It was a Mortal Wound 3: a 3 he shot not because it was necessary, but a 3 he shot because he wanted to kill."}, {"abf0": "Steph Curry shoots many different types of 3s. Some, like the one I just mentioned, are extremely brutal, others less so. For example, he has a 3 that he likes to shoot earlier in the game to figure out whether it’s going to be one of those nights where he goes atomic. That one’s called The Thermometer 3, and it’s 10 percent devastating. He has one called The Our Father Who Art In Heaven 3, and that’s the one he shoots where he arcs the ball some 40 feet up in the air, like he did to Tyson Chandler in 2013. That one is 20 percent devastating. He has one called The Shallow-Grave 3 (30 percent devastating), one called The Enemy At The Gates 3 (40 percent devastating), and one called The GTFOH 3 that he seems to save up and use only against the Clippers …"}, {"8dac": "… and the Thunder …"}, {"ec57": "… and the Cavs …"}, {"cc56": "The are many, many, many Steph Curry 3s. We’ve already mentioned five of them. Let’s examine five other ones that he shoots regularly, and let’s give proper Devastation Scores, a description, and an example of each."}, {"5160": "Before we continue this, may I share some numbers with you? These all come via Mike Lynch at Basketball-Reference.com, and they are legit incredible:"}, {"ca5b": "Five More Types of 3s That Steph Curry Shoots"}, {"a65d": "Name: The Thor Lifting His Hammer 3"}, {"8e27": "Devastation Score: 50 percent devastating"}, {"54b7": "Description and Example: This is the 3 that, even though the results are entirely inconsequential, Steph shoots just to let you know that he can. A good example was that time against the Pacers in 2016 when, even though the buzzer had clearly already sounded and there was nothing to be gained by doing so, he flung the ball up at the rim from 65 feet away. The ball splashed in, then the camera cut to Steph and this was the face he was making:"}, {"6aad": "He looks very ho-hum; very bored; very What’s the big deal?; very So these are humans, huh?; very Why did Indiana even bother showing up?; very The universe is so much bigger than anyone besides me will ever truly know."}, {"e253": "Name: The “You want it to be one way” 3"}, {"67fd": "Devastation Score: 60 percent devastating"}, {"d71b": "Description and Example: This is the 3 where you want it to be one way, but Steph shoots it to let you know it’s the other way. The most perfect example was that 3 at the end of the third quarter of Game 6 of the Western Conference semifinals against the Grizzlies in 2015. The Warriors led the series 3–2 and they were playing in Memphis. The game was close (73–68) and the Grizzlies had the ball with a chance to cut it to two or three. Also, remember, this was before the Warriors had won a championship, so most people didn’t quite understand how all the way terrifying that team was yet. There was a feeling that if Memphis could just squeak out a win in Game 6, their veteran leadership would prove the difference in a big, Big, BIG Game 7. Only Jeff Green dribbled the ball up the court in the final seconds, tried to shoot a 3 at the buzzer, had it blocked, and then everyone watched as Steph, who’d grabbed the loose ball, chest-passed a 75-foot shot at the buzzer toward the other rim that swished in. The Grizzlies were suddenly down eight, the crowd was stunned, and 12 game minutes later the Warriors were headed to the next round of the playoffs. The Grizzlies wanted it to be one way, but it was the other way."}, {"59e7": "Name: The Public Embarrassment 3"}, {"6beb": "Devastation Score: 70 percent devastating"}, {"059b": "Description and Example: This is that 3 where, before Steph shoots it, he goes one-on-one against a person he has a particular and discernible dislike for and just puts ’em in a total torture chamber. There’s nastiness to this 3; there’s anger in it; it’s full of true condescension. It serves to score points for his team, absolutely, but mostly it serves to drain all of the hope and ambition out of the body of the defender, a way for Steph Curry to say, “You could never f*cking guard me,” even though Steph Curry would never, ever say, “You could never f*cking guard me.” The best example was at the end of Game 5 of the 2015 Finals, when he turned Matthew Dellavedova into a bag of wet spaghetti after LeBron said that Delly’s defense was the reason Steph struggled earlier in the series."}, {"84e6": "(You’ll notice we’re jumping from 70 percent devastating to 90 percent devastating. The 80 percent devastating slot is occupied by The Mortal Wound 3.)"}, {"3773": "Name: The Apocalypto 3"}, {"77de": "Devastation Score: 90 percent devastating"}, {"c775": "Description and Example: This is the 3 Steph shoots where he toasts somewhere from three to five different defenders on his way to getting it off. The best example was when he did it during a March game against the Clippers in 2015. The Clips had successfully warded off that play the Warriors run where they toss the ball to Draymond at the corner of the free throw line and then he just pulls the legs off the defense, and so Andrew Bogut ended up with the ball out at the 3-point line, and the Clips were in a good spot defensively. Then Steph ran over, grabbed the ball from Bogut, and got busy. He dribbled through Matt Barnes, tossed it behind his back as he ziplined away from DeAndre Jordan, who was in front of him, and Chris Paul, who was behind him. He was in the middle of the fray by that point (even Spencer Hawes had stepped in to try to stop him), so he turned and retreated to the 3-point line at the top of the key. Rather than resetting the offense, though, he simply put both feet behind the line, turned back toward the rim, then shot a falling, off-balance 3 as Barnes, Paul, DeAndre, and Spencer all rolled around in the flames as their village burned to the ground behind them."}, {"cb2a": "Name: The “Bitch, you thought” 3"}, {"a169": "Devastation Score: 100 percent devastating"}, {"42c9": "Description and Example: This is the 3 Steph shoots where he snatches a win from the belly of his opponents. It is, duh, the most devastating of all of the different versions of 3s that he shoots. The best example was that 3 he hit over Tobias Harris to steal a game from the Magic, but actually the best example was that 3 he hit over Anthony Davis in Game 3 of the first round of the 2015 playoffs that tied the game that they eventually stole in overtime, but actually the best example was that 3 he hit over Andre Roberson to steal that game from the Thunder. Steph Curry shoots The “Bitch, you thought” 3 a lot, is what I’m trying to say, even though Steph Curry would also never, ever say, “Bitch, you thought,” either."}], "child": "126_1\t126_2\t126_3\t126_4\t126_5\t126_6\t126_7\t126_8\t126_9\t126_10\t126_11\t126_12\t126_13\t126_14\t126_15\t126_16"}