{"name": "1260", "parent": "", "content": "How To Add Value To Your Life What are the most valuable things everyone should know? When I would stay up all night anxious and scared and afraid about money and love and life, I had no rules to live by. I expected too much. I was dishonest — with others and myself. I had to change. This is what I started to figure out over the past twenty years. It seems hard to follow the rules. But it isn’t. Life became infinitely easier and better. There’s always a Good Reason and a Real Reason My daughter tells me she wants to study at the library and work on her homework. Good reason. There’s boys at the library. Real reason. Almost everything people say to me has a good reason and a real reason. Happiness = Reality / Expectations. If I am 200 pounds I can change reality slowly. But I can change expectations lower in a second (I’m fine weighing 200 pounds but I’m going to start eating healthier). [ Related: The One Formula for Happiness Nobody Told Me ] Anger = Fear Clothed I’m angry at an ex. But what am I really scared of? Am I scared nobody will like me again? Am I scared that other people will wrong me and I will be powerless to stop with? An ex business partner is angry at me? Did I do something wrong? Or is he afraid because his wife cheated on him and now he thinks other partners will cheat him? Understanding the underlying fears that angry people have leads to mastery in life. The 5/25 Rule I’m borrowing this for the moment from Warren Buffett. Thank you, Warren for lending this rule to me. List the top 25 things you most want to accomplish in life. Now take the top 5, move them over *here*, and take the bottom 20 and move them over *there*. These 20 are still in the TOP 25 things you want to do in life. So they are special and important to you. Rule: NEVER look at those 20 again. Because you love them but they will always distract from the top 5. Some painful things can come out of this. I will never be a professional standup comedian. But that’s ok. It’s not in my top 5. Cal Newport, author of “Deep Work”, would call this “The Deep Work Rule” — do Deep Work versus Shallow Work. The 5×5 Rule I spent all my time hanging out with people who only valued money. This is what happened: I ended up valuing money too much. I lost it all. I stopped being creative. I started being arrogant. The road to recovery was: I had to start hanging out with a different group of people. The 5×5 rule is: Corollary: Stand next to the smartest person in the room. Persistence + Love = Abundance Everything in life is pretty difficult. Being born is difficult. And it starts there. When I wanted to write and public a book, I wrote 4 unpublishable novels, I wrote 40–50 short stories. I pitched and shot pilots for two different TV shows. I did years of research and work on the topic that eventually became my first published book. Now 18 books later I’m debating working on the 19th. The same is true for business, for love, for health. [ RELATED: Why You Should Not Buy Most of My Books ] The 1% Rule If something compounds at 1% a day, it will be 37 times better in a year. If something loses 1% a day, it will be 0.03% of what it was in a year. If I want to get better at golf, I should try to get 1% better every day. Then, in a year, I will be 37 times better. If I want to get better at being a loving person, try to be 1% more kind each day. I know it’s hard to quantify. It’s impossible. But the direction is what is important. It will all shake out in the end. This is the path to improvement any are of life. The ‘What I Liked As a Kid’ rule List the things you liked when you were 6, 8, 10, 14. I liked writing, science fiction, games, James Bond, The Force, etc. List at least ten things. Now list what you can do with those things as an adult. How did these loves age with you? If you do this every day, eventually you will find what you want to do as an adult. Is it every too late? It’s never too late. I’m 49 and I do some form of this exercise every day. Plus, Minus, Equal To learn anything. You have to find a: PLUS: a real or virtual mentor who can teach you. EQUALS: people who can challenge you MINUS: people you can teach, because teaching solidifies learning. Everyone is Irrational All of the Time Borrowing this from Scott Adams. Thanks Scott! He told me, “once I realized that everyone is irrational all of the time my life became a lot simpler.” People are programmed by their upbringing, their genetics, their educations, the desires of the people around them, their cognitive biases that date back millions of years. There’s no way to fight through that jungle of bias to come up with rational behavior. What this means: it’s no use assuming people will be rational towards us. It’s no use fighting for strong opinions. It’s no use telling people what to do or using rational arguments to get people to do what you would like them to do, even if it’s to treat you nicer. This is the argument for living by example. Even in life: Show and don’t tell. The 64/4 Rule If 20% of the effort creates 80% of the value (think of a job: 20% of the employees do 80% of the work), then square that. So now 20% of the 20% of the effort makes 80% of 80% of the value. So 4% of the work you do in life creates 64% of the benefits in your life. Find that 4%, be ok with only creating 64% of the benefits, and then use the other 96% each day to focus on things that you love. I do this. I have not maximized, for instance, the money I could make in life. But every day I do my top 5 things (see the 5/25 rule) and I gave away about 96% of my possessions because only the 4% were providing most of the value in my life. And now I have time to be creative every day, to be with people I love, to not worry about my material possessions, to spend time exploring this wonderful world we live in. The Self-Esteem Rule It’s really hard to have self-esteem. Everyone wants to take it from us. A boss, a teacher, a parent, a friend, a lover. But it’s hard to hold onto your own self-esteem, let alone have two. Never let someone else take care of your self-esteem. Even the partner you love the most. They can’t handle it. They have to deal with their own self-esteem. That’s a full time job. When you feel yourself giving the keys to your self-esteem to someone else, stop yourself. Say out loud, “I will not outsource my self-esteem”. Bring the Target Closer Thank you Tony Robbins for telling me this rule. When he was young he was asked to teach a class of marines how to shoot guns better. He was scared to death. He had never even shot a gun himself. So he studied dozens of expert shooters. He came up with one idea. He brought the target very close. They all shot bullseyes. Then he moved a bit further. And so on. His class had the best scores ever. A friend of mine was overwhelmed. He had a job, a commute, a wife, a family. But he wanted to write a thriller. It seems overwhelming. How can he write 400 pages with all this responsibility. So every day on the train to work he wrote a few paragraphs. In two years he had a thriller that went on to sell 100,000 copies. Now he’s the writer on a major TV show. Break a problem into smaller parts. List the parts. Break those parts down. List them. Do one thing. You just brought the target closer. The 1,000 Hour Rule (or “Idea Sex”). It took the Beatles, Einstein, Bobby Fischer, Mozart, Michael Jordan, etc 10,000 hours of work to be the best in the world at music, math, chess, etc. But the 10,000 hour rule can be beat. Spend 500 hours getting pretty good at one thing. Spend 500 hours getting pretty good at something else. Now you will be the best in the world at the intersection. Matt Berry was a screenwriter in Hollywood. He was also obsessed with sports. He quit being a screenwriter, started blogging about fantasy sports, and became the best in the world. Now he’s the ESPN anchor for Fantasy Sports. He’s #1 in the world. Mick Jagger had a charismatic stage presence. He also loved a music style started in America called “The Blues”. Nobody ever says he’s the best musician ever. But he combined the two and he created one of the most profitable and lasting bands in history. Elon Musk was one of many people who sold a company in the Internet boom of the 90s. He also became obsessed with reading about rocket science. He wasn’t the best. But he knew enough. Now he’s the founder of the first private space company in history. The 1000 Hour Rule is the #1 rule for success. The F+ Rule In school, my kids feel if they don’t get an A+ all of the time then they are doing poorly. Schools try to get kids to get A+ scores because their funding depends on it. This is ruining kids. In real life, if 51% of your decisions are mostly good, then you will be a massive success in life (in Baseball, of course, if only 30% of the time you hit safely to base then you are an all-star). If more than 70% of your decisions are good then you are probably a failure. You aren’t taking enough risks. 50–60% seems to be the right mix. Practice being wrong. Nobody Cares If You Are At The Party I always think if I don’t produce every day, people will get upset. I get upset at myself. But people care only when you have something great to offer. Nobody cares when you mess up. Everyone messes up. Nobody is ever thinking about you. They are worried about what you think of them. Create something good. Then come to the party. Positive Action > Feeling Gratitude Nothing wrong with gratitude. But there’s a lot of gratitude porn out there right now. It’s a good meditation: spend five minutes thinking of things you are grateful for. But even better, when I am feeling down, I think of three positive things I can do today that will make my life move forward. And then I do them. Every time I feel stressed or anxious, this is usually because I am worried irrationally (because all people are irrational) about something invisible happening in the future. Gratitude will band-aid those feelings. But taking positive actions, however small, will actually give me greater confidence that the future will be better than I imagined. Well Being = Good relationships + Improving Competence, + Freedom At the end of the day can you check the box on those three things? Did I improve my relationships? Did I improve my competence at some area I love. Did I do something to increase my feeling of freedom? If so, then this is the best indicator of future well-being. Happiness is fleeting and often beyond our control. We’re happy when we hit a goal. And then it disappears. But well-being is something we build up. A giant well we fill that we can draw on for the rest of our lives. The Hell Yeah Rule Thanks to Derek Sivers for always letting me take TOTAL credit for his ingenious rule. “If it’s not a HELL, YEAH, it’s a NO!” This is the way to say NO almost all of the time. This can also be called the “Life is too short” rule. And finally, Surrender A good poker player plays the hand he or she is dealt. Never complains and says, “I wish I was dealt an ace”. I can’t control my kids. My partners, My friends. The weather. Popular opinion. I can only do the best I can right now and then surrender the results. Once you release the bowling ball, your job is done. Once I give you a kiss to wake you up, the feeling you have when you open your eyes and look at me, is totally up to you. ➝ I read every response on Medium, so let me know what you think. ➝ Ask me a question on Quora or Twitter…I answer questions daily! ➝ To hear from me in the future, sign up for my newsletter. Or visit my website to read my FREE blog ", "title": "How To Add Value To Your Life", "sentences": [{"77e0": "How To Add Value To Your Life"}, {"26e6": "What are the most valuable things everyone should know?"}, {"da88": "When I would stay up all night anxious and scared and afraid about money and love and life, I had no rules to live by."}, {"3643": "I expected too much. I was dishonest — with others and myself."}, {"6d20": "I had to change. This is what I started to figure out over the past twenty years."}, {"6a3d": "It seems hard to follow the rules. But it isn’t. Life became infinitely easier and better."}, {"cca5": "There’s always a Good Reason and a Real Reason"}, {"ae3a": "My daughter tells me she wants to study at the library and work on her homework. Good reason."}, {"be13": "There’s boys at the library. Real reason."}, {"12ee": "Almost everything people say to me has a good reason and a real reason."}, {"86d5": "Happiness = Reality / Expectations."}, {"e59a": "If I am 200 pounds I can change reality slowly. But I can change expectations lower in a second (I’m fine weighing 200 pounds but I’m going to start eating healthier)."}, {"6e90": "[ Related: The One Formula for Happiness Nobody Told Me ]"}, {"668e": "Anger = Fear Clothed"}, {"6456": "I’m angry at an ex. But what am I really scared of? Am I scared nobody will like me again? Am I scared that other people will wrong me and I will be powerless to stop with?"}, {"4a2a": "An ex business partner is angry at me? Did I do something wrong? Or is he afraid because his wife cheated on him and now he thinks other partners will cheat him?"}, {"ca4b": "Understanding the underlying fears that angry people have leads to mastery in life."}, {"8243": "The 5/25 Rule"}, {"03cf": "I’m borrowing this for the moment from Warren Buffett. Thank you, Warren for lending this rule to me."}, {"f658": "List the top 25 things you most want to accomplish in life."}, {"7e55": "Now take the top 5, move them over *here*, and take the bottom 20 and move them over *there*."}, {"192d": "These 20 are still in the TOP 25 things you want to do in life. So they are special and important to you."}, {"1d42": "Rule: NEVER look at those 20 again. Because you love them but they will always distract from the top 5."}, {"d7a0": "Some painful things can come out of this. I will never be a professional standup comedian. But that’s ok. It’s not in my top 5."}, {"bdd2": "Cal Newport, author of “Deep Work”, would call this “The Deep Work Rule” — do Deep Work versus Shallow Work."}, {"a31d": "The 5×5 Rule"}, {"119b": "I spent all my time hanging out with people who only valued money. This is what happened: I ended up valuing money too much. I lost it all. I stopped being creative. I started being arrogant."}, {"447c": "The road to recovery was: I had to start hanging out with a different group of people."}, {"6425": "The 5×5 rule is:"}, {"ef01": "Corollary: Stand next to the smartest person in the room."}, {"5c97": "Persistence + Love = Abundance"}, {"0293": "Everything in life is pretty difficult. Being born is difficult. And it starts there."}, {"74bc": "When I wanted to write and public a book, I wrote 4 unpublishable novels, I wrote 40–50 short stories. I pitched and shot pilots for two different TV shows. I did years of research and work on the topic that eventually became my first published book."}, {"a0a5": "Now 18 books later I’m debating working on the 19th."}, {"92bd": "The same is true for business, for love, for health."}, {"7cb3": "[ RELATED: Why You Should Not Buy Most of My Books ]"}, {"a734": "The 1% Rule"}, {"13e8": "If something compounds at 1% a day, it will be 37 times better in a year."}, {"9f61": "If something loses 1% a day, it will be 0.03% of what it was in a year."}, {"2931": "If I want to get better at golf, I should try to get 1% better every day. Then, in a year, I will be 37 times better."}, {"632b": "If I want to get better at being a loving person, try to be 1% more kind each day."}, {"0125": "I know it’s hard to quantify. It’s impossible. But the direction is what is important. It will all shake out in the end."}, {"3f22": "This is the path to improvement any are of life."}, {"e6d8": "The ‘What I Liked As a Kid’ rule"}, {"6a5f": "List the things you liked when you were 6, 8, 10, 14."}, {"b4e9": "I liked writing, science fiction, games, James Bond, The Force, etc."}, {"f3ad": "List at least ten things."}, {"8887": "Now list what you can do with those things as an adult. How did these loves age with you?"}, {"e848": "If you do this every day, eventually you will find what you want to do as an adult."}, {"7321": "Is it every too late? It’s never too late. I’m 49 and I do some form of this exercise every day."}, {"a2f5": "Plus, Minus, Equal"}, {"b7c4": "To learn anything. You have to find a:"}, {"f2c0": "PLUS: a real or virtual mentor who can teach you."}, {"539d": "EQUALS: people who can challenge you"}, {"2ba5": "MINUS: people you can teach, because teaching solidifies learning."}, {"1202": "Everyone is Irrational All of the Time"}, {"711c": "Borrowing this from Scott Adams. Thanks Scott!"}, {"6a93": "He told me, “once I realized that everyone is irrational all of the time my life became a lot simpler.”"}, {"1de9": "People are programmed by their upbringing, their genetics, their educations, the desires of the people around them, their cognitive biases that date back millions of years."}, {"14ba": "There’s no way to fight through that jungle of bias to come up with rational behavior."}, {"8078": "What this means: it’s no use assuming people will be rational towards us. It’s no use fighting for strong opinions. It’s no use telling people what to do or using rational arguments to get people to do what you would like them to do, even if it’s to treat you nicer."}, {"e494": "This is the argument for living by example. Even in life: Show and don’t tell."}, {"5b96": "The 64/4 Rule"}, {"fa1b": "If 20% of the effort creates 80% of the value (think of a job: 20% of the employees do 80% of the work), then square that."}, {"c1dd": "So now 20% of the 20% of the effort makes 80% of 80% of the value."}, {"f6af": "So 4% of the work you do in life creates 64% of the benefits in your life."}, {"d000": "Find that 4%, be ok with only creating 64% of the benefits, and then use the other 96% each day to focus on things that you love."}, {"58cb": "I do this. I have not maximized, for instance, the money I could make in life. But every day I do my top 5 things (see the 5/25 rule) and I gave away about 96% of my possessions because only the 4% were providing most of the value in my life."}, {"4434": "And now I have time to be creative every day, to be with people I love, to not worry about my material possessions, to spend time exploring this wonderful world we live in."}, {"b7a6": "The Self-Esteem Rule"}, {"d715": "It’s really hard to have self-esteem. Everyone wants to take it from us. A boss, a teacher, a parent, a friend, a lover."}, {"156e": "But it’s hard to hold onto your own self-esteem, let alone have two."}, {"b163": "Never let someone else take care of your self-esteem. Even the partner you love the most."}, {"834b": "They can’t handle it. They have to deal with their own self-esteem. That’s a full time job."}, {"2065": "When you feel yourself giving the keys to your self-esteem to someone else, stop yourself. Say out loud, “I will not outsource my self-esteem”."}, {"7197": "Bring the Target Closer"}, {"e5f3": "Thank you Tony Robbins for telling me this rule."}, {"01e9": "When he was young he was asked to teach a class of marines how to shoot guns better. He was scared to death. He had never even shot a gun himself."}, {"da9d": "So he studied dozens of expert shooters."}, {"3ad1": "He came up with one idea. He brought the target very close. They all shot bullseyes. Then he moved a bit further. And so on. His class had the best scores ever."}, {"6db5": "A friend of mine was overwhelmed. He had a job, a commute, a wife, a family. But he wanted to write a thriller."}, {"6272": "It seems overwhelming. How can he write 400 pages with all this responsibility."}, {"62f2": "So every day on the train to work he wrote a few paragraphs. In two years he had a thriller that went on to sell 100,000 copies. Now he’s the writer on a major TV show."}, {"34c9": "Break a problem into smaller parts. List the parts. Break those parts down. List them. Do one thing. You just brought the target closer."}, {"9b09": "The 1,000 Hour Rule (or “Idea Sex”)."}, {"c7e9": "It took the Beatles, Einstein, Bobby Fischer, Mozart, Michael Jordan, etc 10,000 hours of work to be the best in the world at music, math, chess, etc."}, {"8f8e": "But the 10,000 hour rule can be beat."}, {"75a1": "Spend 500 hours getting pretty good at one thing. Spend 500 hours getting pretty good at something else."}, {"0964": "Now you will be the best in the world at the intersection."}, {"c4a2": "Matt Berry was a screenwriter in Hollywood. He was also obsessed with sports."}, {"fec1": "He quit being a screenwriter, started blogging about fantasy sports, and became the best in the world. Now he’s the ESPN anchor for Fantasy Sports. He’s #1 in the world."}, {"e34f": "Mick Jagger had a charismatic stage presence. He also loved a music style started in America called “The Blues”. Nobody ever says he’s the best musician ever."}, {"5e59": "But he combined the two and he created one of the most profitable and lasting bands in history."}, {"764e": "Elon Musk was one of many people who sold a company in the Internet boom of the 90s. He also became obsessed with reading about rocket science. He wasn’t the best. But he knew enough."}, {"dcde": "Now he’s the founder of the first private space company in history."}, {"5282": "The 1000 Hour Rule is the #1 rule for success."}, {"2023": "The F+ Rule"}, {"c6c4": "In school, my kids feel if they don’t get an A+ all of the time then they are doing poorly."}, {"fba2": "Schools try to get kids to get A+ scores because their funding depends on it. This is ruining kids."}, {"ed35": "In real life, if 51% of your decisions are mostly good, then you will be a massive success in life (in Baseball, of course, if only 30% of the time you hit safely to base then you are an all-star)."}, {"1e47": "If more than 70% of your decisions are good then you are probably a failure. You aren’t taking enough risks."}, {"675c": "50–60% seems to be the right mix. Practice being wrong."}, {"6c04": "Nobody Cares If You Are At The Party"}, {"9651": "I always think if I don’t produce every day, people will get upset. I get upset at myself."}, {"c9fe": "But people care only when you have something great to offer. Nobody cares when you mess up. Everyone messes up."}, {"86cd": "Nobody is ever thinking about you. They are worried about what you think of them."}, {"1a44": "Create something good. Then come to the party."}, {"c6a3": "Positive Action > Feeling Gratitude"}, {"79fb": "Nothing wrong with gratitude. But there’s a lot of gratitude porn out there right now. It’s a good meditation: spend five minutes thinking of things you are grateful for."}, {"639f": "But even better, when I am feeling down, I think of three positive things I can do today that will make my life move forward. And then I do them."}, {"cd70": "Every time I feel stressed or anxious, this is usually because I am worried irrationally (because all people are irrational) about something invisible happening in the future."}, {"4e8d": "Gratitude will band-aid those feelings. But taking positive actions, however small, will actually give me greater confidence that the future will be better than I imagined."}, {"7546": "Well Being = Good relationships + Improving Competence, + Freedom"}, {"1517": "At the end of the day can you check the box on those three things? Did I improve my relationships? Did I improve my competence at some area I love. Did I do something to increase my feeling of freedom?"}, {"798d": "If so, then this is the best indicator of future well-being."}, {"3fed": "Happiness is fleeting and often beyond our control. We’re happy when we hit a goal. And then it disappears."}, {"0b88": "But well-being is something we build up. A giant well we fill that we can draw on for the rest of our lives."}, {"1921": "The Hell Yeah Rule"}, {"b42f": "Thanks to Derek Sivers for always letting me take TOTAL credit for his ingenious rule."}, {"722e": "“If it’s not a HELL, YEAH, it’s a NO!”"}, {"7bd4": "This is the way to say NO almost all of the time."}, {"b7e6": "This can also be called the “Life is too short” rule."}, {"d9ab": "And finally,"}, {"b922": "Surrender"}, {"d656": "A good poker player plays the hand he or she is dealt. Never complains and says, “I wish I was dealt an ace”."}, {"d0d2": "I can’t control my kids. My partners, My friends. The weather. Popular opinion."}, {"5dac": "I can only do the best I can right now and then surrender the results. Once you release the bowling ball, your job is done."}, {"cc4d": "Once I give you a kiss to wake you up, the feeling you have when you open your eyes and look at me, is totally up to you."}, {"415e": "➝ I read every response on Medium, so let me know what you think."}, {"3cb5": "➝ Ask me a question on Quora or Twitter…I answer questions daily!"}, {"6295": "➝ To hear from me in the future, sign up for my newsletter. Or visit my website to read my FREE blog"}], "child": "1260_1\t1260_2\t1260_3\t1260_4\t1260_5\t1260_6\t1260_7\t1260_8\t1260_9\t1260_10\t1260_11\t1260_12\t1260_13\t1260_14\t1260_15\t1260_16\t1260_17\t1260_18\t1260_19\t1260_20\t1260_21\t1260_22\t1260_23\t1260_24\t1260_251260_1\t1260_2\t1260_3\t1260_4\t1260_5\t1260_6\t1260_7\t1260_8\t1260_9\t1260_10\t1260_11\t1260_12\t1260_13\t1260_14\t1260_15\t1260_16\t1260_17\t1260_18\t1260_19\t1260_20\t1260_21\t1260_22\t1260_23\t1260_24\t1260_251260_1\t1260_2\t1260_3\t1260_4\t1260_5\t1260_6\t1260_7\t1260_8\t1260_9\t1260_10\t1260_11\t1260_12\t1260_13\t1260_14\t1260_15\t1260_16\t1260_17\t1260_18\t1260_19\t1260_20\t1260_21\t1260_22\t1260_23\t1260_24\t1260_25"}