{"name": "1262", "parent": "", "content": "Here is what my team values (and how I found out) As a leader, it is critical for me to know exactly what my team values. Last summer, I became curious to better understand why people work at Polar and asked people “why are you here?”. I received blank stares initially and realized this is not an easy question to answer. So I developed a framework to help people answer this important question. I call it the Pentagon. The Pentagon framework has 5 categories that capture why someone may work at any organization. Here is a summary (and a more detailed explanation here): Over the past few weeks, everyone at Polar completed a simple one page template, which asked them to rank their top 3 values, share their level of satisfaction with each and describe what their expectations are. Here is the template if you want to use it with your team. This exercise in awareness has been incredible as it has helped me really understand what every single person on my team values (and their satisfaction and expectations). This is now part of our semi-annual review process. Below is a memo I shared with my team recently with the aggregate data and my take. And for those of you considering joining our team (see open roles here), this gives you a closer look at what people at Polar value… Memo to Polar team: Why YOU Are Here Thank you all for participating and sharing openly why you are here with us in the past few weeks. The purpose of the Pentagon framework is to increase awareness about why you are here, so that we can find opportunities that align with what you value. The Pentagon framework presents five distinct areas that you may value: mission & purpose, growth & development, people & community, recognition & compensation and wellness & balance. We asked everyone to select the top three that you value and rate your level of satisfaction. This was shared in confidence with your leader and myself. Here is a look at the aggregate results across all categories: WHY Score Taking a page out of the NPS (net promoter score) playbook, we calculated the WHY Score by taking the percentage of the “Very Satisfied” and “Slightly Satisfied” responses minus the percentage of both the “Slightly Unsatisfied” and “Very Unsatisfied” responses. Our WHY Score is 62%. Compared against industry NPS benchmarks, this is outstanding. But I’m going to reserve judgment for now and treat this as a baseline, which we will measure ourselves against as part of the next review process to see how we improve. What we value (most) Inherent in us doing this exercise is recognizing and even encouraging the diversity in values at Polar. Many of you shared how difficult it was for you to only choose three, however this was important to get a pulse check of what we value most. Here is the percentage of people who selected each value in their top three: Keep in mind that all of these bars can never all be 100%, they will always add up to 300% (an average of 60%, the line you see across). On average, we value Growth & Development by far the most, followed by Wellness & Balance and Recognition & Compensation. And once again, it is not that we do not value Mission & Purpose and People & Community, it’s that we value the other categories the most, on average. “All or nothing” values 69% of us selected Wellness & Balance in our top three, and 100% of this segment are Satisfied (i.e. a WHY Score of 100%). This was the only value that had no one Unsatisfied (of those that value it). I’m particularly proud of this! Furthermore, both Mission & Purpose (WHY Score: 75%) and People & Community (WHY Score: 87%) each only had one Unsatisfied ranking, everyone else who ranked those categories were Satisfied. High expectation values Now Compensation & Recognition is a unique value in that I do not expect everyone to be Very Satisfied at all times. There is a healthy tension that is most seen with this value in any company, and it is required to keep a balance. 91% of us value Growth & Development, which means the expectations are high. Over half of this group ranked Slightly Satisfied and a quarter as Very Satisfied. The diversity of expectations and definitions of Growth & Development is wide in this group (I read all the responses). Thematically, we are going to focus on this value the most given the diversity of requests and its consistent popularity. Success here is on each of you taking responsibility as a first step and thinking about your role “outside your box”. You cannot limit yourself to a small set of activities, you have to take on new responsibilities and find additional ways to contribute. This is how you will gain greater exposure, experience and expertise. Put differently, you are not going to grow doing the same thing, the same way, over and over again. Ranking matters We purposely asked you to not only pick your top three but also rank them. Interestingly enough, the WHY Scores were varied: Thank you Thank you for sharing openly with us why you are here. This starts a conversation, where your leader will share with you how aligned we are with your values. It is with greater awareness we have already begun a more deliberate and focused effort to find relevant opportunities and challenges for you. We will ask you again in six months to update this, as what you value will change or how you feel about what you value will surely change. Kunal Why are you here? The most important question for your career.Why do you work? This is often overlooked, underestimated and taken for granted.medium.com A look inside Polar — Kunal Gupta is the Founder & CEO of Polar. Follow his leadership blog at findfocus.today. At Polar, Kunal leads a talented team transforming the media publishing industry with technology. He is passionate about leadership and finding focus in a modern era. Connect with him on LinkedIn, Medium or Twitter. ", "title": "Here is what my team values (and how I found out)", "sentences": [{"3a0f": "Here is what my team values (and how I found out)"}, {"ebb0": "As a leader, it is critical for me to know exactly what my team values. Last summer, I became curious to better understand why people work at Polar and asked people “why are you here?”. I received blank stares initially and realized this is not an easy question to answer."}, {"222c": "So I developed a framework to help people answer this important question. I call it the Pentagon."}, {"a528": "The Pentagon framework has 5 categories that capture why someone may work at any organization. Here is a summary (and a more detailed explanation here):"}, {"ba4e": "Over the past few weeks, everyone at Polar completed a simple one page template, which asked them to rank their top 3 values, share their level of satisfaction with each and describe what their expectations are. Here is the template if you want to use it with your team."}, {"3552": "This exercise in awareness has been incredible as it has helped me really understand what every single person on my team values (and their satisfaction and expectations). This is now part of our semi-annual review process."}, {"9eb4": "Below is a memo I shared with my team recently with the aggregate data and my take. And for those of you considering joining our team (see open roles here), this gives you a closer look at what people at Polar value…"}, {"fa94": "Memo to Polar team: Why YOU Are Here"}, {"6562": "Thank you all for participating and sharing openly why you are here with us in the past few weeks. The purpose of the Pentagon framework is to increase awareness about why you are here, so that we can find opportunities that align with what you value."}, {"0947": "The Pentagon framework presents five distinct areas that you may value: mission & purpose, growth & development, people & community, recognition & compensation and wellness & balance. We asked everyone to select the top three that you value and rate your level of satisfaction. This was shared in confidence with your leader and myself."}, {"3b58": "Here is a look at the aggregate results across all categories:"}, {"f933": "WHY Score"}, {"90e8": "Taking a page out of the NPS (net promoter score) playbook, we calculated the WHY Score by taking the percentage of the “Very Satisfied” and “Slightly Satisfied” responses minus the percentage of both the “Slightly Unsatisfied” and “Very Unsatisfied” responses."}, {"b635": "Our WHY Score is 62%."}, {"576f": "Compared against industry NPS benchmarks, this is outstanding. But I’m going to reserve judgment for now and treat this as a baseline, which we will measure ourselves against as part of the next review process to see how we improve."}, {"3389": "What we value (most)"}, {"daae": "Inherent in us doing this exercise is recognizing and even encouraging the diversity in values at Polar. Many of you shared how difficult it was for you to only choose three, however this was important to get a pulse check of what we value most."}, {"cc88": "Here is the percentage of people who selected each value in their top three:"}, {"cac1": "Keep in mind that all of these bars can never all be 100%, they will always add up to 300% (an average of 60%, the line you see across)."}, {"4358": "On average, we value Growth & Development by far the most, followed by Wellness & Balance and Recognition & Compensation. And once again, it is not that we do not value Mission & Purpose and People & Community, it’s that we value the other categories the most, on average."}, {"b481": "“All or nothing” values"}, {"6dc7": "69% of us selected Wellness & Balance in our top three, and 100% of this segment are Satisfied (i.e. a WHY Score of 100%). This was the only value that had no one Unsatisfied (of those that value it). I’m particularly proud of this!"}, {"b55d": "Furthermore, both Mission & Purpose (WHY Score: 75%) and People & Community (WHY Score: 87%) each only had one Unsatisfied ranking, everyone else who ranked those categories were Satisfied."}, {"1244": "High expectation values"}, {"fd59": "Now Compensation & Recognition is a unique value in that I do not expect everyone to be Very Satisfied at all times. There is a healthy tension that is most seen with this value in any company, and it is required to keep a balance."}, {"be69": "91% of us value Growth & Development, which means the expectations are high. Over half of this group ranked Slightly Satisfied and a quarter as Very Satisfied. The diversity of expectations and definitions of Growth & Development is wide in this group (I read all the responses)."}, {"0bea": "Thematically, we are going to focus on this value the most given the diversity of requests and its consistent popularity. Success here is on each of you taking responsibility as a first step and thinking about your role “outside your box”. You cannot limit yourself to a small set of activities, you have to take on new responsibilities and find additional ways to contribute. This is how you will gain greater exposure, experience and expertise. Put differently, you are not going to grow doing the same thing, the same way, over and over again."}, {"4dca": "Ranking matters"}, {"cd22": "We purposely asked you to not only pick your top three but also rank them. Interestingly enough, the WHY Scores were varied:"}, {"d19d": "Thank you"}, {"fc13": "Thank you for sharing openly with us why you are here. This starts a conversation, where your leader will share with you how aligned we are with your values. It is with greater awareness we have already begun a more deliberate and focused effort to find relevant opportunities and challenges for you."}, {"3bf0": "We will ask you again in six months to update this, as what you value will change or how you feel about what you value will surely change."}, {"7e64": "Kunal"}, {"f357": "Why are you here? The most important question for your career.Why do you work? This is often overlooked, underestimated and taken for granted.medium.com"}, {"2c63": "A look inside Polar"}, {"7fbe": "— Kunal Gupta is the Founder & CEO of Polar. Follow his leadership blog at findfocus.today. At Polar, Kunal leads a talented team transforming the media publishing industry with technology. He is passionate about leadership and finding focus in a modern era. Connect with him on LinkedIn, Medium or Twitter."}], "child": "1262_11262_1"}