{"name": "1267", "parent": "", "content": "The Meaning of Life… Our Earth & Sun waiting for the next “now” “The most terrifying fact about the universe is not that it is hostile but that it is indifferent, but if we can come to terms with this indifference, then our existence as a species can have genuine meaning. However vast the darkness, we must supply our own light…” - Stanley Kubrick How do you write about what life MEANS? In my life, I have been told that life has NO meaning (except what we give it) and that living a “meaningful” life is the highest purpose to our existence on this etheric plane that we call “life”. Do I know what the meaning of life is? No, but I have a start… Here are some things I know I love my children more than they will ever know or comprehend. They know way more than I will ever know or comprehend. My children have already taught me way more than I will ever teach them. The only way to parent children is to keep them safe. They are responsible for their happiness. Empower their happiness. Keep them as safe as possible while letting them go to find their blue skies… It’s the letting go that is the toughest part and the most necessary. As arrogant, stupid and self-centered as I get and sound, I know that my life is not about me. Life is about being of service to others. I had a very privileged growing-up and I have been served and waited on. There is real power in being of service to others. Empowerment. Love. Compassion. Respect. However, what I have discovered is that the truest form of service is being transparent and anonymous. I borrowed this from the Jewish tradition of Tzedakah where one is empowering those in need no matter whether they need money, someone to perform a necessary task, someone to be a keen listener or give a swift kick in the butt. What the recipient is left with is contribution and empowerment — not feeling like a beggar or an outcast. One’s legacy or reputation has nothing to do with success. It has to do with the feeling and experience you leave people with when you interact with them whether it’s the person who pours your coffee, your family or your best friend. See “Tzedakah” above… For example: Henry Ford was very successful in his time and created numerous industrial and business structures we use even now. However, his reputation as a ruthless businessman and an antisemite pushed his vision of “peace through consumerism” aside. Money cannot buy you respect or love. Someone always has more money, talent, good looks and resources than you. Yup, always… Since you know that now, you can spend the time and resources you were going to spend on competing for THE MOST with spending time making a difference. People have marriage wrong. Once you are married, you and your partner do NOT go on automatic pilot. Actually, its just the opposite. Marriage is choosing your spouse everyday. You want them to know you’re making the choice and that the possibility of NOT choosing them exists. When you got married, you (probably) vowed to: “love, honor and cherish” them. However, the daily choice you make is the action you take that permits you to love without condition, honor and respect your partner above all and cherish them completely because you understand fully and deeply how much life would suck without them. For your spouse, there is no greater feeling than KNOWING you’ve been chosen. When you stop choosing the relationship ends. Truly. Choice also allows for you to be in the world seeing that there are great, gorgeous and amazing people out there. There are armies of sexy people. Have you walked the streets of New York City recently? That said, NONE of these anonymous sexy people have been chosen by you today. Your spouse has and they know it. Here’s the rub, to choose your spouse you have to choose yourself and bring real integrity to the conversation. No BS. This is why most people (like 98.7%) never choose anything. They don’t want or can’t handle the responsibility of it. Too bad. Choice rocks. Professional sports is more show business than show business. The facade of the hero doesn’t diminish the amazing accomplishments of these world-class competitors achieve on the field, court, ice, green, water or where ever. The issue is HOW it’s presented and marketed. It will take the athletes themselves to change this context so their performance will be seen as performance and not as a commodity. This revolution will be televised. The law is not about the search for justice. Law is about quantifying responsibility and placing a dollar amount on that responsibility. If the court decision is not ultimately money, then its about time; sometimes the time is served in jail; sometimes it is served in the prison we build for ourselves called regret. Someone always pays. Someone does the time. Beware starting legal proceedings with the idea that your situation is a “slam dunk” case. The court doesn’t want to know your STORY. The law isn’t about truth — its about what you can prove. Creativity is not talent. Creativity is a permission you give yourself to act on an idea. Talent is not innate. Being “creative” and “talented” usually involve an unbelievable amount of work, persistence, courage, patience and time so the onlookers, non-believers, haters, posers and the gawkers can call what you do “creative” and “talent”. It lets them sleep at night thinking you have something they cannot have. Here is the meaning of life: when the dust from our bones has been blown-away by a gentle breeze, no one living at that moment will know, care or remember that you or anyone you knew, loved, hated, fought with, fought for or died for even existed. Life happens now. In this moment. Once the moment is gone; its gone forever. We are but the dust in the wind (like the song!). The fact that the tiny little rock that we call Earth hurdles around the Sun at 62,000 miles an hour and even our rock and Sun will be dust too isn’t a huge or meaningful event. It will just happen. In that now. We make it complicated — but life is simple (not easy): Live now. Love now. Shine now. Fall now. Rise-up now. Express now. Work now. Sing now. Rock now. Cry now. Move now. Take a chance now. Scream now. Get up and Dance now. Fuck now. Kiss now. Hug now. Cuddle now. Turn up the Music now. Fight the fight now. Bucket list now. Pray now. Forgive now. Raise your Hand now. Run now. Celebrate now. Honor now. Surprise yourself now. Live. Just live. When? Now. Any waiting you are doing about anything that’s important to you is a waste of now. So, if fear is preventing you from taking action, consider that maybe that thing you’ve waited days, months, years or decades for really isn’t really that important. You’ve been hiding, pretending and suffering like an idiot. We act now. Life is now. You get to decide what now means to you… Now. Michael Whalen is a dad, husband, brother, son, friend, author, teacher, speaker, music maker and recovering ontologist who is 51 years young. He is grateful for his life and the opportunities he has been afforded to make a difference with others now. More information: www.michaelwhalen.com ", "title": "The Meaning of Life…", "sentences": [{"a126": "The Meaning of Life…"}, {"1a00": "Our Earth & Sun waiting for the next “now”"}, {"e6f0": "“The most terrifying fact about the universe is not that it is hostile but that it is indifferent, but if we can come to terms with this indifference, then our existence as a species can have genuine meaning. However vast the darkness, we must supply our own light…” - Stanley Kubrick"}, {"6f01": "How do you write about what life MEANS? In my life, I have been told that life has NO meaning (except what we give it) and that living a “meaningful” life is the highest purpose to our existence on this etheric plane that we call “life”."}, {"2430": "Do I know what the meaning of life is? No, but I have a start…"}, {"a9cc": "Here are some things I know"}, {"4130": "I love my children more than they will ever know or comprehend. They know way more than I will ever know or comprehend. My children have already taught me way more than I will ever teach them."}, {"86b5": "The only way to parent children is to keep them safe. They are responsible for their happiness. Empower their happiness. Keep them as safe as possible while letting them go to find their blue skies… It’s the letting go that is the toughest part and the most necessary."}, {"a2be": "As arrogant, stupid and self-centered as I get and sound, I know that my life is not about me. Life is about being of service to others. I had a very privileged growing-up and I have been served and waited on. There is real power in being of service to others. Empowerment. Love. Compassion. Respect. However, what I have discovered is that the truest form of service is being transparent and anonymous. I borrowed this from the Jewish tradition of Tzedakah where one is empowering those in need no matter whether they need money, someone to perform a necessary task, someone to be a keen listener or give a swift kick in the butt. What the recipient is left with is contribution and empowerment — not feeling like a beggar or an outcast."}, {"2469": "One’s legacy or reputation has nothing to do with success. It has to do with the feeling and experience you leave people with when you interact with them whether it’s the person who pours your coffee, your family or your best friend. See “Tzedakah” above… For example: Henry Ford was very successful in his time and created numerous industrial and business structures we use even now. However, his reputation as a ruthless businessman and an antisemite pushed his vision of “peace through consumerism” aside. Money cannot buy you respect or love."}, {"ab35": "Someone always has more money, talent, good looks and resources than you. Yup, always… Since you know that now, you can spend the time and resources you were going to spend on competing for THE MOST with spending time making a difference."}, {"c631": "People have marriage wrong. Once you are married, you and your partner do NOT go on automatic pilot. Actually, its just the opposite. Marriage is choosing your spouse everyday. You want them to know you’re making the choice and that the possibility of NOT choosing them exists. When you got married, you (probably) vowed to: “love, honor and cherish” them. However, the daily choice you make is the action you take that permits you to love without condition, honor and respect your partner above all and cherish them completely because you understand fully and deeply how much life would suck without them. For your spouse, there is no greater feeling than KNOWING you’ve been chosen. When you stop choosing the relationship ends. Truly. Choice also allows for you to be in the world seeing that there are great, gorgeous and amazing people out there. There are armies of sexy people. Have you walked the streets of New York City recently? That said, NONE of these anonymous sexy people have been chosen by you today. Your spouse has and they know it. Here’s the rub, to choose your spouse you have to choose yourself and bring real integrity to the conversation. No BS. This is why most people (like 98.7%) never choose anything. They don’t want or can’t handle the responsibility of it. Too bad. Choice rocks."}, {"379e": "Professional sports is more show business than show business. The facade of the hero doesn’t diminish the amazing accomplishments of these world-class competitors achieve on the field, court, ice, green, water or where ever. The issue is HOW it’s presented and marketed. It will take the athletes themselves to change this context so their performance will be seen as performance and not as a commodity. This revolution will be televised."}, {"4500": "The law is not about the search for justice. Law is about quantifying responsibility and placing a dollar amount on that responsibility. If the court decision is not ultimately money, then its about time; sometimes the time is served in jail; sometimes it is served in the prison we build for ourselves called regret. Someone always pays. Someone does the time. Beware starting legal proceedings with the idea that your situation is a “slam dunk” case. The court doesn’t want to know your STORY. The law isn’t about truth — its about what you can prove."}, {"9fae": "Creativity is not talent. Creativity is a permission you give yourself to act on an idea. Talent is not innate. Being “creative” and “talented” usually involve an unbelievable amount of work, persistence, courage, patience and time so the onlookers, non-believers, haters, posers and the gawkers can call what you do “creative” and “talent”. It lets them sleep at night thinking you have something they cannot have."}, {"fadb": "Here is the meaning of life: when the dust from our bones has been blown-away by a gentle breeze, no one living at that moment will know, care or remember that you or anyone you knew, loved, hated, fought with, fought for or died for even existed. Life happens now. In this moment. Once the moment is gone; its gone forever. We are but the dust in the wind (like the song!). The fact that the tiny little rock that we call Earth hurdles around the Sun at 62,000 miles an hour and even our rock and Sun will be dust too isn’t a huge or meaningful event. It will just happen. In that now."}, {"4c50": "We make it complicated — but life is simple (not easy):"}, {"9acc": "Live now. Love now. Shine now. Fall now. Rise-up now. Express now. Work now. Sing now. Rock now. Cry now. Move now. Take a chance now. Scream now. Get up and Dance now. Fuck now. Kiss now. Hug now. Cuddle now. Turn up the Music now. Fight the fight now. Bucket list now. Pray now. Forgive now. Raise your Hand now. Run now. Celebrate now. Honor now. Surprise yourself now. Live. Just live. When? Now."}, {"7e13": "Any waiting you are doing about anything that’s important to you is a waste of now. So, if fear is preventing you from taking action, consider that maybe that thing you’ve waited days, months, years or decades for really isn’t really that important. You’ve been hiding, pretending and suffering like an idiot."}, {"fde8": "We act now. Life is now. You get to decide what now means to you… Now."}, {"3819": "Michael Whalen is a dad, husband, brother, son, friend, author, teacher, speaker, music maker and recovering ontologist who is 51 years young. He is grateful for his life and the opportunities he has been afforded to make a difference with others now. More information: www.michaelwhalen.com"}], "child": "1267_11267_1"}