{"name": "127", "parent": "", "content": "Golden State’s Season As a Superteam Looking back at the Warriors’ year, off the court and under the microscope Let’s start with a simple truth: however you may have felt about the late-winter listlessness of the Golden State Warriors, spring has sprung. They have won their past eight, are first in offensive efficiency and second in defensive efficiency, and will end the season with the league’s best record. They are the first team to win 60 or more games three seasons in a row since those Chicago Bulls. This means that they are currently in the Top 1 of Objective-Best (Active) Basketball Teams. This is also the kind of hegemony you might expect from a superteam. So, no surprises there. Additionally, the Warriors are exhausting. Most superteams are. Superteams are constantly visible, which lends itself to some unfortunate public claims and some truly unfortunate cover spreads. But unlike the 2011 Miami Heat, who had a legitimate Apple keynote about a dynasty they eventually did not have, or the 2012 Lakers, who I cannot believe we took seriously, these 2017 Warriors seem uniquely exhausting. Not because the lion’s share of their offensive possessions end in wide-open shots, but because they seem to resent … well, everything. And that’s not really their fault. Golden State has a legion of writers following its every move, and constantly asking the Warriors what they think about, again, everything — other teams, other players, other sports, the president, and everything in between. And that constant spotlight has duly made the Warriors’ 2017 season weird. Or rather, weirder than it otherwise would’ve been. Steve Kerr 2020 When we talk about the NBA being character-driven, more often than not, we’re talking about players. If you weren’t somehow aware, you should know that Steve Kerr is both the best and most interesting thing about Golden State, which is weird in itself. You should also know that if you disagree with that assertion, it’s only because your internet connection is slower than mine: From the jump, Kerr has calmly waded into social issues. Disgust for police brutality, contempt for the travel ban, a full, uninterrupted two minutes of bewilderment in the wake of the election. And each time with impossible even-handedness, and the gentle understanding of an overly interested English teacher. You know, Steve Kerr should run for office, actually. I mean, he’s got zero qualifications or experience, but. “I Do What Massa Say” After a 103–102 loss to the Minnesota Timberwolves earlier this month, which occurred after a majority of Golden State’s stars were rested in a nationally televised game against the San Antonio Spurs, Andre Iguodala made, seemingly unprompted, some racial comments. (I had a really long, ugly-sounding laugh about this.) When it comes to these sorts of head-scratching sound bites, Iggy is generally playing a game only he understands, as Kerr would later point out. Anthony Slater, Warriors beat writer for the San Jose Mercury News, managed to get an explanation. Translated from its original twaddle-speak, Iguodala’s clarification meant … something about the breadth allowed by coaches, fans, and the media, for athletes to be real, self-determining people. How we contextualize pro athletes is always a topic worthy of discussion, but there might’ve been more direct ways to get that point across, though there can’t possibly have been many stranger. Draymond Green Being Draymond Green Draymond Green’s season started before it even began, with a penis picture snapped on the Snappychat, a scandal he impressively reframed as a false step in his ultimate ascension to greatness. He was subsequently offered $100,000 to star in a porno. That’s how his season started. Two things that everyone knows to be simultaneously true: Draymond is a walking hustle stat that powers the Warriors forward; Draymond is loud, roiling chaos that can, at best, be pointed in a general direction. That’s its own form of drama, whether it be intentionally pissing off Kevin Durant, burning poor old Paul Pierce to a crisp, or just straight up kicking dudes in the grill — or nether region — and then indicting the league’s definition of “unnatural movement.” A Guide to NBA Bulls**tPlayers, coaches, agents … they say some stuff. Sometimes it makes no sense. That’s the point. We’re here to help you…theringer.com JaVale McGee vs. Shaq It’s arguable that there is no Shaqtin’ a Fool without JaVale McGee, on account of McGee being amongst the least intentional players in league history. But no one much likes being the butt of the joke, let alone the same joke, for years. As Adi Joseph at For the Win explained, Shaq wins this beef on a technicality: the two met five times on the court between 2009 and 2010, and Shaq went a perfect 5–0. But in a vacuum, this is the most inventive use of the peanut emoji, ever. I love JaVale McGee, and if you had any sense, you would too. The Durant Appreciation Night That Never Was Kevin Durant was in OKC for the first nine years of his career and brought the franchise to the outskirts of the Land of Milk and Honey one and a half times. It’s reasonable to expect some sort of acknowledgement for that — a nice arena giveaway, maybe a little tribute video — and also reasonable to be upset about not receiving any, beyond some bromides from Thunder general manager Sam Presti ahead of his first return game. What is not reasonable, and maybe even risible, is the Warriors being reportedly “furious” on Durant’s behalf. Steph Awkwardly Squeezing Into a Villain Role July 4th was the Warriors’ notional heel-turn, what with adding a 7-foot grenade launcher to a team that had, a month prior, finished a historic regular season with 73 wins and missed repeating as champions by one measly, monumental collapse. But Steph Curry actually started the heel process in February of last year. Curry was well on his way to shattering the league record for most 3s in a season into tiny, obsolete pieces, when Oscar Robertson joined Stephen Jackson and Cedric Ceballos in a council of basketball elders harrumphing that the league isn’t what it used to be. The eternal wrangle of comparing generations is not only impractical — it’s usually pretty boring, too. And we could, you know, come to that conclusion on our own. Which is why Curry saying that he found the criticism from retired players “annoying,” was, indeed, annoying. This wasn’t the beginning of his tendency to gesture at something — I’m young and having fun and getting money and y’all are old and doing neither — without actually saying it, but it was the first time it was so noticeable. It happened again when he picked James Harden for MVP. Harden is having an impressive season on a team more successful than Russell Westbrook’s Thunder, and Curry is entitled to privilege that above a season-average triple-double. Russ clapped back with “Who is he?,” and Curry answered with his actions on the court. I can’t say for sure that what Curry really wanted to say was you only get half a bar, but: All fine, all aboveboard, except: this is not good villain behavior. This is good underdog behavior, which, unbeknownst to Curry, and the entire Warriors organization it feels like, they are not anymore. Someone Asked Klay Thompson to Sign a Toaster This is very on-brand for Klay Thompson. ", "title": "Golden State’s Season As a Superteam", "sentences": [{"c993": "Golden State’s Season As a Superteam"}, {"f907": "Looking back at the Warriors’ year, off the court and under the microscope"}, {"4c11": "Let’s start with a simple truth: however you may have felt about the late-winter listlessness of the Golden State Warriors, spring has sprung. They have won their past eight, are first in offensive efficiency and second in defensive efficiency, and will end the season with the league’s best record. They are the first team to win 60 or more games three seasons in a row since those Chicago Bulls. This means that they are currently in the Top 1 of Objective-Best (Active) Basketball Teams. This is also the kind of hegemony you might expect from a superteam. So, no surprises there."}, {"1339": "Additionally, the Warriors are exhausting. Most superteams are. Superteams are constantly visible, which lends itself to some unfortunate public claims and some truly unfortunate cover spreads. But unlike the 2011 Miami Heat, who had a legitimate Apple keynote about a dynasty they eventually did not have, or the 2012 Lakers, who I cannot believe we took seriously, these 2017 Warriors seem uniquely exhausting. Not because the lion’s share of their offensive possessions end in wide-open shots, but because they seem to resent … well, everything."}, {"1d14": "And that’s not really their fault. Golden State has a legion of writers following its every move, and constantly asking the Warriors what they think about, again, everything — other teams, other players, other sports, the president, and everything in between."}, {"733c": "And that constant spotlight has duly made the Warriors’ 2017 season weird. Or rather, weirder than it otherwise would’ve been."}, {"463e": "Steve Kerr 2020"}, {"4fc3": "When we talk about the NBA being character-driven, more often than not, we’re talking about players. If you weren’t somehow aware, you should know that Steve Kerr is both the best and most interesting thing about Golden State, which is weird in itself. You should also know that if you disagree with that assertion, it’s only because your internet connection is slower than mine:"}, {"b243": "From the jump, Kerr has calmly waded into social issues. Disgust for police brutality, contempt for the travel ban, a full, uninterrupted two minutes of bewilderment in the wake of the election. And each time with impossible even-handedness, and the gentle understanding of an overly interested English teacher."}, {"b649": "You know, Steve Kerr should run for office, actually. I mean, he’s got zero qualifications or experience, but."}, {"2361": "“I Do What Massa Say”"}, {"83d9": "After a 103–102 loss to the Minnesota Timberwolves earlier this month, which occurred after a majority of Golden State’s stars were rested in a nationally televised game against the San Antonio Spurs, Andre Iguodala made, seemingly unprompted, some racial comments. (I had a really long, ugly-sounding laugh about this.)"}, {"5075": "When it comes to these sorts of head-scratching sound bites, Iggy is generally playing a game only he understands, as Kerr would later point out. Anthony Slater, Warriors beat writer for the San Jose Mercury News, managed to get an explanation. Translated from its original twaddle-speak, Iguodala’s clarification meant … something about the breadth allowed by coaches, fans, and the media, for athletes to be real, self-determining people. How we contextualize pro athletes is always a topic worthy of discussion, but there might’ve been more direct ways to get that point across, though there can’t possibly have been many stranger."}, {"7332": "Draymond Green Being Draymond Green"}, {"19f7": "Draymond Green’s season started before it even began, with a penis picture snapped on the Snappychat, a scandal he impressively reframed as a false step in his ultimate ascension to greatness. He was subsequently offered $100,000 to star in a porno."}, {"a174": "That’s how his season started."}, {"1773": "Two things that everyone knows to be simultaneously true: Draymond is a walking hustle stat that powers the Warriors forward; Draymond is loud, roiling chaos that can, at best, be pointed in a general direction. That’s its own form of drama, whether it be intentionally pissing off Kevin Durant, burning poor old Paul Pierce to a crisp, or just straight up kicking dudes in the grill — or nether region — and then indicting the league’s definition of “unnatural movement.”"}, {"04f9": "A Guide to NBA Bulls**tPlayers, coaches, agents … they say some stuff. Sometimes it makes no sense. That’s the point. We’re here to help you…theringer.com"}, {"9efc": "JaVale McGee vs. Shaq"}, {"e797": "It’s arguable that there is no Shaqtin’ a Fool without JaVale McGee, on account of McGee being amongst the least intentional players in league history. But no one much likes being the butt of the joke, let alone the same joke, for years. As Adi Joseph at For the Win explained, Shaq wins this beef on a technicality: the two met five times on the court between 2009 and 2010, and Shaq went a perfect 5–0. But in a vacuum, this is the most inventive use of the peanut emoji, ever."}, {"f1aa": "I love JaVale McGee, and if you had any sense, you would too."}, {"b461": "The Durant Appreciation Night That Never Was"}, {"fac6": "Kevin Durant was in OKC for the first nine years of his career and brought the franchise to the outskirts of the Land of Milk and Honey one and a half times. It’s reasonable to expect some sort of acknowledgement for that — a nice arena giveaway, maybe a little tribute video — and also reasonable to be upset about not receiving any, beyond some bromides from Thunder general manager Sam Presti ahead of his first return game."}, {"ca2d": "What is not reasonable, and maybe even risible, is the Warriors being reportedly “furious” on Durant’s behalf."}, {"189d": "Steph Awkwardly Squeezing Into a Villain Role"}, {"59cf": "July 4th was the Warriors’ notional heel-turn, what with adding a 7-foot grenade launcher to a team that had, a month prior, finished a historic regular season with 73 wins and missed repeating as champions by one measly, monumental collapse. But Steph Curry actually started the heel process in February of last year."}, {"67f8": "Curry was well on his way to shattering the league record for most 3s in a season into tiny, obsolete pieces, when Oscar Robertson joined Stephen Jackson and Cedric Ceballos in a council of basketball elders harrumphing that the league isn’t what it used to be. The eternal wrangle of comparing generations is not only impractical — it’s usually pretty boring, too. And we could, you know, come to that conclusion on our own. Which is why Curry saying that he found the criticism from retired players “annoying,” was, indeed, annoying. This wasn’t the beginning of his tendency to gesture at something — I’m young and having fun and getting money and y’all are old and doing neither — without actually saying it, but it was the first time it was so noticeable."}, {"964f": "It happened again when he picked James Harden for MVP. Harden is having an impressive season on a team more successful than Russell Westbrook’s Thunder, and Curry is entitled to privilege that above a season-average triple-double. Russ clapped back with “Who is he?,” and Curry answered with his actions on the court. I can’t say for sure that what Curry really wanted to say was you only get half a bar, but:"}, {"d44b": "All fine, all aboveboard, except: this is not good villain behavior. This is good underdog behavior, which, unbeknownst to Curry, and the entire Warriors organization it feels like, they are not anymore."}, {"04c7": "Someone Asked Klay Thompson to Sign a Toaster"}, {"604e": "This is very on-brand for Klay Thompson."}], "child": "127_1\t127_2\t127_3\t127_4\t127_5\t127_6"}