{"name": "1274", "parent": "", "content": "Do You Have To Hit Rock Bottom to Rise Again Like a Phoenix Recently I discovered how ‘hitting rock bottom’ has become a new procrastination technique. People want to make changes in their life, but can’t be bothered to start because they’re too comfortable in their current lifestyle. So someone actually mentioned, “Maybe I need to hit rock bottom to change something about my life…” Look at Arianna Huffington. It took her collapsing from exhaustion to wake up and realize her life had to change. JK Rowling is another example of a writer whose life imploded before she focused on the most important work of her life. 1000 Awesome Things was a blog Neil Pasricha began after losing a friend to suicide and having his wife sit him down and tell him their relationship is not working. Now millennials are thinking, “This hitting rock bottom thing is cool. I’m waiting for my moment.” Image courtesy of Unsplash Maybe it’s motivated by JK Rowling’s Harvard speech about how rock bottom became the solid foundation on which she rebuilt her life, stripping away all the inessentials, etc… But let’s deconstruct it; what is it about hitting rock bottom that’s making people want to go there before steering their lives in a different direction? That thinking is quite errant for a couple of obvious reasons; Just because you’re not taking control over your life doesn’t mean you’re not in control of your life. Nobody’s going to live your life for you, and you only get one shot, whether you take it or not. The stakes are higher when that carpet is pulled from under you, so you won’t have the resources (financial/emotional/cognitive) to truly experiment, and you’ll still be stuck. If you think you don’t have time just log how many hours you spend complaining and watching TV. Your idea might be, if it’s not broken why fix it? To be honest with you, it doesn’t matter what you tell your parents/family…deep down inside each and every one of you knows when you’re not fine. You can feel it in your heart every morning when you’re facing the idea of getting up and going to work. It doesn’t matter what your CV says or how your life appears. When you’re not fine — and it’s broken — you do know. You really don’t need to hit rock bottom to start diverting your life to one filled with a certain level of fulfillment. All it takes is to switch off the TV, arm yourself with google, and start doing something. Don’t be a phoenix and wait to hit rock bottom before rising again. Be an eagle and start soaring today! What’s the simplest first step you can take today to make a difference in your life? Hit me up on twitter @ahechoes. Post as appears on blog; http://ahscribbles.com/hit-rock-bottom/ If you like this post, support the work by pressing on the green heart below. Get my ebook “Mine your inner resources” at a DISCOUNTED PRICE for the holidays on Kindle or as PDF. Also, check out my short story collection, “All Bleeding Stops and Other Short Stories from the Kenyan Coast” and visit my website http://ahscribbles.com/ to subscribe to the newsletter. ", "title": "Do You Have To Hit Rock Bottom to Rise Again Like a Phoenix", "sentences": [{"5cb6": "Do You Have To Hit Rock Bottom to Rise Again Like a Phoenix"}, {"f256": "Recently I discovered how ‘hitting rock bottom’ has become a new procrastination technique. People want to make changes in their life, but can’t be bothered to start because they’re too comfortable in their current lifestyle. So someone actually mentioned, “Maybe I need to hit rock bottom to change something about my life…”"}, {"e6a6": "Look at Arianna Huffington. It took her collapsing from exhaustion to wake up and realize her life had to change. JK Rowling is another example of a writer whose life imploded before she focused on the most important work of her life. 1000 Awesome Things was a blog Neil Pasricha began after losing a friend to suicide and having his wife sit him down and tell him their relationship is not working."}, {"b37b": "Now millennials are thinking, “This hitting rock bottom thing is cool. I’m waiting for my moment.”"}, {"5e20": "Image courtesy of Unsplash"}, {"80f1": "Maybe it’s motivated by JK Rowling’s Harvard speech about how rock bottom became the solid foundation on which she rebuilt her life, stripping away all the inessentials, etc…"}, {"eeeb": "But let’s deconstruct it; what is it about hitting rock bottom that’s making people want to go there before steering their lives in a different direction?"}, {"50c4": "That thinking is quite errant for a couple of obvious reasons;"}, {"fb34": "Just because you’re not taking control over your life doesn’t mean you’re not in control of your life. Nobody’s going to live your life for you, and you only get one shot, whether you take it or not."}, {"2846": "The stakes are higher when that carpet is pulled from under you, so you won’t have the resources (financial/emotional/cognitive) to truly experiment, and you’ll still be stuck."}, {"0656": "If you think you don’t have time just log how many hours you spend complaining and watching TV."}, {"4ec4": "Your idea might be, if it’s not broken why fix it? To be honest with you, it doesn’t matter what you tell your parents/family…deep down inside each and every one of you knows when you’re not fine. You can feel it in your heart every morning when you’re facing the idea of getting up and going to work. It doesn’t matter what your CV says or how your life appears. When you’re not fine — and it’s broken — you do know."}, {"0150": "You really don’t need to hit rock bottom to start diverting your life to one filled with a certain level of fulfillment. All it takes is to switch off the TV, arm yourself with google, and start doing something."}, {"676b": "Don’t be a phoenix and wait to hit rock bottom before rising again. Be an eagle and start soaring today! What’s the simplest first step you can take today to make a difference in your life? Hit me up on twitter @ahechoes."}, {"e0d3": "Post as appears on blog; http://ahscribbles.com/hit-rock-bottom/"}, {"2f26": "If you like this post, support the work by pressing on the green heart below."}, {"6c2a": "Get my ebook “Mine your inner resources” at a DISCOUNTED PRICE for the holidays on Kindle or as PDF."}, {"87aa": "Also, check out my short story collection, “All Bleeding Stops and Other Short Stories from the Kenyan Coast” and visit my website http://ahscribbles.com/ to subscribe to the newsletter."}], "child": "1274_1\t1274_2\t1274_3"}