{"name": "1279", "parent": "", "content": "Google Images Counting The Days Jimmy Brown burst into the house. He flung his school bag on the floor, pulled off his shoes and ran to the kitchen. “Mommy!” he called. “Mommy, where are you?” “Upstairs,” came his mother’s voice. “What’s the matter?” “Mommy, come down,” Jimmy cried. “I need to tell you something.” As he waited for his mother in the kitchen, Jimmy did an excited little hop and a skip and then a little pirouette. Then he went to the front door where he had flung down his bag and brought it into the kitchen. When his mother came downstairs, she saw Jimmy poring over a piece of paper, tongue sticking out, brow furrowed in concentration. “What’s that you have there, Jimmy?” his mother asked. “Mommy,” Jimmy jumped up to show her. “We are going to see a play. My teacher said so. It’s called ‘Goldilocks and the Three Bears’. Can I go?” Mommy took the piece of paper from Jimmy’s hand. “What is this?” she said. “You have to sign it and send it back to school along with $20. Can I go Mommy?” Mommy scanned the piece of paper and then turned to Jimmy. “I dunno, Jim. That’s pretty expensive for a play for kindergarten.” “Mommy, please,” Jimmy said, tears welling up in his eyes. “Everyone is going. Tom and Simon and Mick and….” “Alright, alright,” Mom said. “I’ll take a look at this form and see.” “Just don’t say no,” Jimmy whispered under his breath as his mom left the room. It was decided that evening that Jimmy would go. Mommy sent the money to his teacher at school the next day. Jimmy could not contain his excitement. It was the first time he was going on a school excursion. He could not wait. “Why doesn’t time pass?” he grumbled to himself as he sat in the kitchen that evening. “When will it be April 27th? How many days left, Mommy?” “It’s still two weeks away,” his mother laughed. “Well, I can’t wait,” Jimmy said glumly. “I’ll tell you what we can do,” said Mommy. “Why don’t we cross off days on the calendar till we reach April 27th?” “Cross off days on the calendar?” Jimmy said, his eyes big. “Well, when people are waiting for a special day, they mark days off on a calendar. That way they can keep track off the number of days left.” “I want to do that, Mommy,” Jimmy said, jumping up. “Okay, well, here’s the calendar,” Mommy took down the calendar hanging on the kitchen wall. It was a nice, colourful one with different animals for every month. January had had a small, fuzzy kitten wearing a winter cap. February had had a big, bouncy dog playing with a ball. March had had a small golden retriever looking out the window at the rain. And now April had some rabbits munching on lettuce leaves in a green field. Oh, it was a very pretty calendar. “Now, lets see,” said Mommy. “Today is April 12th. We have to reach April 27th. So tonight, just before you go to bed, you can make a big cross on April 12th. That means today is finished and then you can count the number of days that are left.” Jimmy pranced around the kitchen in his excitement. “Can I do it right now, Mommy? Can I? Can I?” “You have to wait till bed-time,” said Mommy, ruffling his hair as he bounced by her. That night Jimmy climbed up on the kitchen counter in his pyjamas. His mother let him take down the calendar himself. He counted up to the twelfth day and then, with his tongue sticking out, he made a big red cross over the number. He looked up at his mother proudly. “Count till the 27th,” she said. “Let’s see how many days are left.” Jimmy counted. “Fourteen days, mom.” “Good,” she said. “Now we’ll cross another day off tomorrow.” Soon there were only seven days left. Jimmy meticulously and diligently crossed out a day every night before he went to bed. Daddy laughed at how earnest he looked when he did it. Mommy counted the number of days left with him. Soon there was one day left. The play was tomorrow. Jimmy was very excited, it was all he could think about. On the morning of the play, Jimmy woke up with a scratchy throat and a high fever. He bravely got out of bed and dragged himself down to the kitchen calendar. He confirmed that today was the day and turned to his mother. “Mommy,” he said in a raspy voice. “Today’s the play.” Mommy took one look at him and whipped out her thermometer. She checked his temperature; pretty high. She looked at his hot little face and bloodshot eyes and ordered him back to bed. “But Mommy,” cried Jimmy. “It’s the day of the play. The calendar says so.” “Off to bed,” ordered Mommy. “I’ll be by with a cold compress.” Jimmy couldn’t stand it. He dragged his feet back to bed with a broken heart and a choked up throat. How horribly unfair! He stayed in bed, crying and being miserable. Mommy brought him some hot soup and the tablet to play with. But it was pointless. Nothing would console him. He had waited too hard and for too long. The disappointment was unbearable. Mommy and Daddy were both upset for him. He had crossed out the days so diligently and waited so patiently. It really wasn’t fair. “Jimmy,” Mommy said to him, when he woke up after his nap. “I’m so sorry you couldn’t go see the play. I know how much you wanted to go.” “It’s alright, Mommy,” said Jimmy, bravely. “It’s not your fault. It’s no one’s fault really. I just got sick.” His voice sort of broke at the end of the sentence but he didn’t cry. “You are a good boy,” said Mommy, kissing his feverish forehead. “I’ll make it up to you, I promise.” The next week, Daddy came home with a sealed envelope. He handed it to Jimmy and looked very mysterious. When Jimmy opened it, three tickets to Goldilocks and the Three Bears fell out. “And the best part is, you won’t have to cross any days off of the calendar, Jimmy,” said Daddy. “Because it’s tonight.” Jimmy stared at his father in glee. “I know you wanted to go with your friends,” said Daddy. “But that couldn’t be helped. You can go with Mummy and me and I’m sure you'll have as great a time as you would with your friends.” Jimmy stared at his parents adoringly. “I’ll probably have a better time with you guys anyway,” he mumbled. And then he did a little hop around the living room, the tickets in his hand. ", "title": "Counting The Days", "sentences": [{"6f73": "Google Images"}, {"13d0": "Counting The Days"}, {"6e6f": "Jimmy Brown burst into the house. He flung his school bag on the floor, pulled off his shoes and ran to the kitchen."}, {"800d": "“Mommy!” he called. “Mommy, where are you?”"}, {"5610": "“Upstairs,” came his mother’s voice. “What’s the matter?”"}, {"1094": "“Mommy, come down,” Jimmy cried. “I need to tell you something.”"}, {"740c": "As he waited for his mother in the kitchen, Jimmy did an excited little hop and a skip and then a little pirouette. Then he went to the front door where he had flung down his bag and brought it into the kitchen."}, {"2cd8": "When his mother came downstairs, she saw Jimmy poring over a piece of paper, tongue sticking out, brow furrowed in concentration."}, {"52a6": "“What’s that you have there, Jimmy?” his mother asked."}, {"607e": "“Mommy,” Jimmy jumped up to show her. “We are going to see a play. My teacher said so. It’s called ‘Goldilocks and the Three Bears’. Can I go?”"}, {"5967": "Mommy took the piece of paper from Jimmy’s hand. “What is this?” she said."}, {"565b": "“You have to sign it and send it back to school along with $20. Can I go Mommy?”"}, {"9d1a": "Mommy scanned the piece of paper and then turned to Jimmy. “I dunno, Jim. That’s pretty expensive for a play for kindergarten.”"}, {"0d73": "“Mommy, please,” Jimmy said, tears welling up in his eyes. “Everyone is going. Tom and Simon and Mick and….”"}, {"2155": "“Alright, alright,” Mom said. “I’ll take a look at this form and see.”"}, {"70f1": "“Just don’t say no,” Jimmy whispered under his breath as his mom left the room."}, {"2856": "It was decided that evening that Jimmy would go. Mommy sent the money to his teacher at school the next day. Jimmy could not contain his excitement. It was the first time he was going on a school excursion. He could not wait."}, {"67e0": "“Why doesn’t time pass?” he grumbled to himself as he sat in the kitchen that evening. “When will it be April 27th? How many days left, Mommy?”"}, {"aba3": "“It’s still two weeks away,” his mother laughed."}, {"0858": "“Well, I can’t wait,” Jimmy said glumly."}, {"40e1": "“I’ll tell you what we can do,” said Mommy. “Why don’t we cross off days on the calendar till we reach April 27th?”"}, {"eef5": "“Cross off days on the calendar?” Jimmy said, his eyes big."}, {"c232": "“Well, when people are waiting for a special day, they mark days off on a calendar. That way they can keep track off the number of days left.”"}, {"8d7d": "“I want to do that, Mommy,” Jimmy said, jumping up."}, {"ea68": "“Okay, well, here’s the calendar,” Mommy took down the calendar hanging on the kitchen wall. It was a nice, colourful one with different animals for every month. January had had a small, fuzzy kitten wearing a winter cap. February had had a big, bouncy dog playing with a ball. March had had a small golden retriever looking out the window at the rain. And now April had some rabbits munching on lettuce leaves in a green field. Oh, it was a very pretty calendar."}, {"cc81": "“Now, lets see,” said Mommy. “Today is April 12th. We have to reach April 27th. So tonight, just before you go to bed, you can make a big cross on April 12th. That means today is finished and then you can count the number of days that are left.”"}, {"f883": "Jimmy pranced around the kitchen in his excitement. “Can I do it right now, Mommy? Can I? Can I?”"}, {"d49e": "“You have to wait till bed-time,” said Mommy, ruffling his hair as he bounced by her."}, {"a5e6": "That night Jimmy climbed up on the kitchen counter in his pyjamas. His mother let him take down the calendar himself. He counted up to the twelfth day and then, with his tongue sticking out, he made a big red cross over the number."}, {"e709": "He looked up at his mother proudly. “Count till the 27th,” she said. “Let’s see how many days are left.”"}, {"c444": "Jimmy counted. “Fourteen days, mom.”"}, {"0049": "“Good,” she said. “Now we’ll cross another day off tomorrow.”"}, {"1234": "Soon there were only seven days left. Jimmy meticulously and diligently crossed out a day every night before he went to bed. Daddy laughed at how earnest he looked when he did it. Mommy counted the number of days left with him."}, {"1fe5": "Soon there was one day left. The play was tomorrow. Jimmy was very excited, it was all he could think about."}, {"1d76": "On the morning of the play, Jimmy woke up with a scratchy throat and a high fever. He bravely got out of bed and dragged himself down to the kitchen calendar. He confirmed that today was the day and turned to his mother."}, {"33bd": "“Mommy,” he said in a raspy voice. “Today’s the play.”"}, {"8ebd": "Mommy took one look at him and whipped out her thermometer. She checked his temperature; pretty high. She looked at his hot little face and bloodshot eyes and ordered him back to bed."}, {"f82d": "“But Mommy,” cried Jimmy. “It’s the day of the play. The calendar says so.”"}, {"289c": "“Off to bed,” ordered Mommy. “I’ll be by with a cold compress.”"}, {"c41e": "Jimmy couldn’t stand it. He dragged his feet back to bed with a broken heart and a choked up throat."}, {"b505": "How horribly unfair!"}, {"581e": "He stayed in bed, crying and being miserable. Mommy brought him some hot soup and the tablet to play with. But it was pointless. Nothing would console him. He had waited too hard and for too long. The disappointment was unbearable."}, {"f91e": "Mommy and Daddy were both upset for him. He had crossed out the days so diligently and waited so patiently. It really wasn’t fair."}, {"e2f4": "“Jimmy,” Mommy said to him, when he woke up after his nap. “I’m so sorry you couldn’t go see the play. I know how much you wanted to go.”"}, {"9131": "“It’s alright, Mommy,” said Jimmy, bravely. “It’s not your fault. It’s no one’s fault really. I just got sick.” His voice sort of broke at the end of the sentence but he didn’t cry."}, {"afd2": "“You are a good boy,” said Mommy, kissing his feverish forehead. “I’ll make it up to you, I promise.”"}, {"4fe0": "The next week, Daddy came home with a sealed envelope. He handed it to Jimmy and looked very mysterious. When Jimmy opened it, three tickets to Goldilocks and the Three Bears fell out."}, {"5775": "“And the best part is, you won’t have to cross any days off of the calendar, Jimmy,” said Daddy. “Because it’s tonight.”"}, {"78d3": "Jimmy stared at his father in glee."}, {"682f": "“I know you wanted to go with your friends,” said Daddy. “But that couldn’t be helped. You can go with Mummy and me and I’m sure you'll have as great a time as you would with your friends.”"}, {"5339": "Jimmy stared at his parents adoringly. “I’ll probably have a better time with you guys anyway,” he mumbled. And then he did a little hop around the living room, the tickets in his hand."}], "child": "1279_1\t1279_21279_1\t1279_21279_1\t1279_21279_1\t1279_2"}