{"name": "1281", "parent": "", "content": "Source Pipe Dreams, Schmipe Dreams The calendar hung above her desk, mocking her. She sat, staring at the blank screen, her hands resting on the keyboard. She had been sitting like this for hours, no, for weeks. Every morning, she jumped out of bed, made a pot of coffee, let the dog out and then she came in here to her den/study to…….sit. Staring at the blank screen. Of course that wasn’t the plan. The plan was to finish a novel, but in order to finish, one must actually start the damned thing. This dream of hers started at a very young age. She’d always had a knack for storytelling. On the school bus headed to and from school or on class field trips, her classmates always begged her to tell them a story. The words flowed so easily for her and everyone would sit, entranced, listening to every word. She enjoyed the attention, but more than that, she loved telling the stories. She would get lost in her own narration, waiting to see what would happen next. The story played out in her mind just as if she were sitting and watching it on television. As she grew older, she discovered that she enjoyed writing stories almost as much as she enjoyed telling them. In high school, all of her friends would groan when they were given a writing assignment, but as soon as the teacher gave the requirements, her mind would already be turning. She would have half of her paper written before the bell rang to dismiss class. She would also write short stories at home just for the fun of it and she dabbled in a little poetry here and there. Her love of writing followed her all through college, but after graduation, “real life” took over and she didn’t have much free time in which to indulge her passion. The next fifteen years were a whirlwind. She advanced in her career and became very successful. She fell in love, got married, got pregnant, miscarried, threw herself deeper into her work, fell out of love, divorced and woke up one morning to the realization that she was not happy with her life. Her life was work. She worked crazy, long hours that left little time for anything else. She had no social life and no downtime really, as she often brought work home with her as well. The truth was, she liked what she did for a living and she was great at it, but it brought her no actual joy. One evening, after a couple of glasses of wine, she sat pondering her situation. She realized that life was passing her by at an alarming rate of speed. Did she want things to stay just as they were for the rest of her life? No, she did not. So, what changes needed to be made? She thought about moving to a new city but staying in her current field of expertise. She thought about changes careers altogether. They were both possibilities, but would she be any happier? Then it hit her! She wanted to be a writer. She had always wanted to be a writer. She felt she had some real talent, but that didn’t necessarily mean anyone else would think so. She couldn’t just up and quit her job for some pipe dream that might not lead anywhere, could she? That’s when she made her decision. Her 40th birthday was looming on the horizon and she decided to give herself until then to write a book. If she hadn’t completed it, (or at least made a great deal of progress), by then, she would give up on her dream. That gave her six months to at the very least, come up with a completed rough draft. She took a leave of absence from her job and set out to make her dream happen. That was exactly four months and ten days ago, and here she sat, staring at the blinking cursor on the totally blank computer screen. It hadn’t always been blank. No, she had started many, many drafts. This story had been forming in her mind for many years although she had never before planned to put it in writing. The problem was, she was a perfectionist. She just could not type something without going back to read it and re-read it as she went along. This had, without fail, resulted in the drafts being deleted because they were “terrible”. All of that had brought her to this point. She was back to pondering her situation and had just about decided that this dream of hers actually was just a pipe dream that she should forget about. That’s when she looked up at the yearly calendar she had hung above her desk. She had used a red marker to circle her birthday, her deadline. She stared at the calendar for quite some time, just as she’d sat looking at the blank computer screen. She had less than two months to go. “Screw it!” she yelled out to the empty house. “Let’s do this thing!” That’s when she started typing. At first, she had to really fight the urge to stop and read what she had written so far. After she got going, she found herself lost in the story, just as she had all those years ago on the school trips. She typed feverishly, her fingers flying for hours without a break. When she finally stopped and looked around, she noticed that day had turned to night, and night was beginning to turn to day again. She glanced up at the calendar again and smiled. “I’ve got this.” She stretched her back and then she turned her eyes back to the computer and began to type again. ", "title": "Pipe Dreams, Schmipe Dreams", "sentences": [{"a03c": "Source"}, {"13d3": "Pipe Dreams, Schmipe Dreams"}, {"c292": "The calendar hung above her desk, mocking her. She sat, staring at the blank screen, her hands resting on the keyboard. She had been sitting like this for hours, no, for weeks. Every morning, she jumped out of bed, made a pot of coffee, let the dog out and then she came in here to her den/study to…….sit. Staring at the blank screen. Of course that wasn’t the plan. The plan was to finish a novel, but in order to finish, one must actually start the damned thing."}, {"047f": "This dream of hers started at a very young age. She’d always had a knack for storytelling. On the school bus headed to and from school or on class field trips, her classmates always begged her to tell them a story. The words flowed so easily for her and everyone would sit, entranced, listening to every word. She enjoyed the attention, but more than that, she loved telling the stories. She would get lost in her own narration, waiting to see what would happen next. The story played out in her mind just as if she were sitting and watching it on television."}, {"1511": "As she grew older, she discovered that she enjoyed writing stories almost as much as she enjoyed telling them. In high school, all of her friends would groan when they were given a writing assignment, but as soon as the teacher gave the requirements, her mind would already be turning. She would have half of her paper written before the bell rang to dismiss class. She would also write short stories at home just for the fun of it and she dabbled in a little poetry here and there. Her love of writing followed her all through college, but after graduation, “real life” took over and she didn’t have much free time in which to indulge her passion."}, {"b3cb": "The next fifteen years were a whirlwind. She advanced in her career and became very successful. She fell in love, got married, got pregnant, miscarried, threw herself deeper into her work, fell out of love, divorced and woke up one morning to the realization that she was not happy with her life. Her life was work. She worked crazy, long hours that left little time for anything else. She had no social life and no downtime really, as she often brought work home with her as well."}, {"14e7": "The truth was, she liked what she did for a living and she was great at it, but it brought her no actual joy. One evening, after a couple of glasses of wine, she sat pondering her situation. She realized that life was passing her by at an alarming rate of speed. Did she want things to stay just as they were for the rest of her life? No, she did not. So, what changes needed to be made? She thought about moving to a new city but staying in her current field of expertise. She thought about changes careers altogether. They were both possibilities, but would she be any happier? Then it hit her! She wanted to be a writer. She had always wanted to be a writer. She felt she had some real talent, but that didn’t necessarily mean anyone else would think so. She couldn’t just up and quit her job for some pipe dream that might not lead anywhere, could she?"}, {"ea77": "That’s when she made her decision. Her 40th birthday was looming on the horizon and she decided to give herself until then to write a book. If she hadn’t completed it, (or at least made a great deal of progress), by then, she would give up on her dream. That gave her six months to at the very least, come up with a completed rough draft. She took a leave of absence from her job and set out to make her dream happen."}, {"214c": "That was exactly four months and ten days ago, and here she sat, staring at the blinking cursor on the totally blank computer screen. It hadn’t always been blank. No, she had started many, many drafts. This story had been forming in her mind for many years although she had never before planned to put it in writing. The problem was, she was a perfectionist. She just could not type something without going back to read it and re-read it as she went along. This had, without fail, resulted in the drafts being deleted because they were “terrible”."}, {"f42b": "All of that had brought her to this point. She was back to pondering her situation and had just about decided that this dream of hers actually was just a pipe dream that she should forget about. That’s when she looked up at the yearly calendar she had hung above her desk. She had used a red marker to circle her birthday, her deadline. She stared at the calendar for quite some time, just as she’d sat looking at the blank computer screen. She had less than two months to go."}, {"d320": "“Screw it!” she yelled out to the empty house. “Let’s do this thing!”"}, {"a752": "That’s when she started typing. At first, she had to really fight the urge to stop and read what she had written so far. After she got going, she found herself lost in the story, just as she had all those years ago on the school trips. She typed feverishly, her fingers flying for hours without a break. When she finally stopped and looked around, she noticed that day had turned to night, and night was beginning to turn to day again. She glanced up at the calendar again and smiled."}, {"8619": "“I’ve got this.” She stretched her back and then she turned her eyes back to the computer and began to type again."}], "child": "1281_1\t1281_2\t1281_3\t1281_4\t1281_5"}