{"name": "1286", "parent": "", "content": "April Is The Cruellest Month* by Sarah Goldsmith Source Mary Ellen sat at the worn and shabby kitchen table, listening to the clock ticking her life away as her fingers idly wandered across the myriad of cuts and delves on the table’s surface. Her eyes flickered to the soot-stained calendar propped against the wall. She’d been counting off the days, making a small mark in the corner of each one on the chart. She couldn’t believe how long it was taking. It had dragged on for nearly four weeks and it would be May soon. She’d planned to be gone by then, off to a new life far away from all of this. She quite fancied living by the coast, leaving the fetid, smoky air of the mining town far behind her. A noise from upstairs caught her attention. She sighed heavily before rising from her chair and climbing the dark, narrow stairs. Her nose began to wrinkle in disgust as the stench from Jim’s bedroom assaulted her senses. How much longer could this hang on for? He was a big, strong man, but she was still surprised he’d managed to fight the illness for so long. She pushed the bedroom door open, turning her head away as the foul air barrelled into her like a wave of putrefaction. Anger rose in her chest as she took in the revolting sight before her. She’d only just changed the sheets and now they were soiled again. Jim’s pallid, sweating face loomed out of the sodden bedding. “Sorry, Mary Ellen.” “I’ve only just put clean sheets on the bed. I’ll have to do it all over again, now.” He looked sheepish. “I couldn’t help it, pet.” Jim tried to heave himself upright but succeeded only in collapsing into a fit of coughing and retching. She looked at him with disgust, not caring whether he saw it or not. This was not what her life was supposed to be. Mary Ellen helped Jim out of the bed, depositing him on a chair while she stripped the revolting sheets and replaced them with clean bedding. Her back aching, she let Jim lean on her as he clambered back into bed. “Can I have a glass of water, please, pet?” “Aye, I’ll fetch a fresh one when I’ve taken these downstairs,” she said, furious that she’d have to spend the rest of the day boiling and mangling the laundry again. “You’re a good girl, Mary Ellen. When I’m better, I’ll make it up to you. I’ll be the husband you deserve.” “Hush now, Jim. Save your strength,” she said sharply, feeling a glimmer of guilt when she saw the disappointment in his eyes that she hadn’t responded in a more wifely manner. She went downstairs, throwing the dirty sheets into the laundry basket. She needed air and so went outside to the communal yard they shared with five other families. She cursed her luck when she saw Mrs Campbell pegging out her still-dirty washing. “Hello, Mary Ellen, pet. How is he?” she asked, gesturing to the poky bedroom window where Jim lay within. Her eyes bulged with the prospect of tittle-tatter to share with her gaggle of gossips. Mary Ellen smiled weakly, hoping she looked like the worried wife everyone expected her to be. “Still no better, Mrs Campbell. But we’re hopeful.” “That’s right, pet, keep yer chin up. Does the doctor know what it is, pet?” “Not really, Mrs Campbell. Dr Thorpe said it’s a condition of the stomach. I really must get back to him. Good day, Mrs Campbell.” She went back inside, thinking uncharitable thoughts about the nosy Mrs Campbell. She poured fresh water into a glass, glaring at the calendar as she did so. How much longer did she have to wait? She paused, her eyes fixed on the calendar as she counted out the days. Sighing again, she knelt down on the floor and opened the cupboard door, rummaging around at the back of the cubbyhole until her fingers felt what they sought. The phial felt light in her hand as she brought it out of its hiding place. Just a little more of her tonic powder added to the water should help speed things along. Mary Ellen woke in the night to the most frightening sounds. She lay on her back, staring at the ceiling as she listened to the frantic screams from Jim’s bedroom. After a few moments, she left her bed, lit a candle and entered Jim’s room. He was writhing in the bed, his eyes rolling in terror and pain. When he saw her standing in the threshold, he reached out to her, a look of desperation on his face. “Hush now, Jim. Don’t fight it anymore.” She watched him as the lights in his eyes finally went out. Mary Ellen placed her ear against Jim’s chest, sitting back in satisfaction when she heard no life in his heart. She turned to the stained mirror on the makeshift dressing table and concentrated very hard until tears began to fall. Mary Ellen ran down the stairs, throwing the front door open, and began to shout for help. When her neighbours began to open their own front doors, she collapsed in a heap on the ground, begging them to help her poor Jim, screaming at them to fetch Dr Thorpe. Dr Thorpe arrived an hour later, irritated that his peaceful slumber had been interrupted. However, he softened when he saw the pretty young woman so clearly distressed at the passing of her husband. The good doctor had been impressed with the dedication Mary Ellen had shown in caring for her ill spouse. “What killed him, Dr Thorpe?” Mary Ellen asked, her face streaked prettily with tears. “A gastric fever, there have been several cases this month already. How cruel this April has been. But, it is a blessing that Jim is now at peace. What will you do, Mrs Robson?” “I have family along the coast, near Sunderland. I shall go to them. They’ll help me.” “Very wise, Mrs Robson,” the doctor said, although he would be sad to see the attractive girl leave the mining community. “I shall prepare the death certificate before you leave.” Mary Ellen packed up her few belongings and was ready to leave. Everyone had been so kind to her, but she was tired of playing the grieving widow and couldn’t wait to go. She’d hired a cart to take her and her few possessions to her new home, a small village on the coast. She glanced at the calendar, scarcely believing it was already 1870. So much had happened in just a few years. She’d had high hopes for this marriage, but here she was, widow for the third time. Her first marriage had started with such high hopes. She’d dreamed of a wonderful life with John, believing all his promises about how he’d look after her and give her the very best. But he let her down, proving to be a useless, lazy, workshy man who took her away from her family to live in a filthy hovel in a filthy town. They shared their lodgings with an army of cockroaches, bed bugs and lice, and she’d spent hours cleaning the place but no amount of carbolic soap would kill them. Eventually, she’d gone to Mr Dickman the chemist, signed the poisons register and bought arsenic to get rid of them. It wasn’t the only thing the poison got rid of. She’d forgotten all about the insurance policy her stepfather had convinced her to take out on her new husband until the insurance agent arrived with the payout. Her second marriage to Joseph was much better. He was a good, honest, hard-working man, but he began to make too many demands on her. Joseph expected her to care for his ailing parents, and grew angry when she wanted some time for herself. It was such a shame when he and his parents died so suddenly after a short battle with typhoid. Mary Ellen returned to her own family, a widow again, with a tidy sum from the insurance agents in her purse. She met Jim when she gained employment at the infirmary as an auxiliary nurse. He was a miner and had injured his hand at work. He’d fallen for her soothing ways and gentle voice and promised her a life away from the misery she saw on the hospital wards. But she hated life as a miner’s wife, the constant gossip from the other wives, having to live in each other’s pockets. And she loathed how every surface and every piece of cloth in the house was constantly covered in soot. She begged Jim to find work elsewhere, but he refused. She deserved better than what he could offer. And so now she was a widow again. Mary Ellen’s thoughts were interrupted by a knock at the door. She opened it cautiously, careful to show the world that she was the anxious, sorrowful widow in her black gown. “Mrs Robson? My name is Angus Jones. I’m from Jones and Thomas insurance agents. May I begin by saying how dreadfully sorry we are for your loss.” Mary Ellen invited the man in, ensuring he took note of how sad and forlorn she was. She sobbed daintily as he spoke and more forcefully when he handed over the payment. “Once again, Mrs Robson, I wish to offer my sincere condolences. If we can assist you in the future, we shall be happy to do so.” She closed the door and returned to the parlour, clutching the life insurance money to her chest. She looked around the dingy room, glad that she would soon be free of it. She wondered what her new life might bring. Maybe she’d be luckier with her next husband. Mary Ellen put her hand in the pocket of her gown, her fingers closing around the little bottle of her special tonic. She’d get it right next time. But she’d keep the arsenic, just in case. Mary Ellen sat huddled in her thin dress, a threadbare shawl around her frail shoulders. She stared at the tatty calendar on the wall, remembering a time when she’d longed for the days to pass. Now she dreaded the steady march of time. She shivered in the freezing cold room in which she sat and waited. How suddenly things had changed. She’d been careless, so sure was she that she could never be caught. She heard footsteps outside her door and she looked up, hope making her heart thump in her chest. The door opened and the prison governor stood before her, his face grave and stern. Mary Ellen stood up even though her legs threatened to buckle at any moment. “Has it come through?” “No, there will be no pardon,” he said, standing to one side as the prison chaplain entered her cell. “No! I’m innocent! You can’t do this!” The chaplain muttered his prayers as Mary Ellen was led from the condemned cell in which she had dwelt since the sentence of death had been passed. They walked along the corridor, out into the prison yard where the hangman’s noose awaited her. The air smelt of spring flowers and she could feel the warmth of the sun upon her face. “April,” she whispered. “The cruellest month of all.” *T.S Eliot, The Waste Ground Author’s note: Based loosely on Mary Ann Cotton, England’s first convicted female serial killer. ", "title": "April Is The Cruellest Month*", "sentences": [{"12b1": "April Is The Cruellest Month*"}, {"8e34": "by Sarah Goldsmith"}, {"a7a7": "Source"}, {"6bd3": "Mary Ellen sat at the worn and shabby kitchen table, listening to the clock ticking her life away as her fingers idly wandered across the myriad of cuts and delves on the table’s surface. Her eyes flickered to the soot-stained calendar propped against the wall. She’d been counting off the days, making a small mark in the corner of each one on the chart. She couldn’t believe how long it was taking. It had dragged on for nearly four weeks and it would be May soon. She’d planned to be gone by then, off to a new life far away from all of this. She quite fancied living by the coast, leaving the fetid, smoky air of the mining town far behind her."}, {"afc3": "A noise from upstairs caught her attention. She sighed heavily before rising from her chair and climbing the dark, narrow stairs. Her nose began to wrinkle in disgust as the stench from Jim’s bedroom assaulted her senses. How much longer could this hang on for? He was a big, strong man, but she was still surprised he’d managed to fight the illness for so long."}, {"232a": "She pushed the bedroom door open, turning her head away as the foul air barrelled into her like a wave of putrefaction. Anger rose in her chest as she took in the revolting sight before her. She’d only just changed the sheets and now they were soiled again. Jim’s pallid, sweating face loomed out of the sodden bedding."}, {"772f": "“Sorry, Mary Ellen.”"}, {"2e0d": "“I’ve only just put clean sheets on the bed. I’ll have to do it all over again, now.”"}, {"f81d": "He looked sheepish. “I couldn’t help it, pet.”"}, {"9b28": "Jim tried to heave himself upright but succeeded only in collapsing into a fit of coughing and retching. She looked at him with disgust, not caring whether he saw it or not. This was not what her life was supposed to be."}, {"8a83": "Mary Ellen helped Jim out of the bed, depositing him on a chair while she stripped the revolting sheets and replaced them with clean bedding. Her back aching, she let Jim lean on her as he clambered back into bed."}, {"715c": "“Can I have a glass of water, please, pet?”"}, {"11dd": "“Aye, I’ll fetch a fresh one when I’ve taken these downstairs,” she said, furious that she’d have to spend the rest of the day boiling and mangling the laundry again."}, {"a927": "“You’re a good girl, Mary Ellen. When I’m better, I’ll make it up to you. I’ll be the husband you deserve.”"}, {"b548": "“Hush now, Jim. Save your strength,” she said sharply, feeling a glimmer of guilt when she saw the disappointment in his eyes that she hadn’t responded in a more wifely manner."}, {"a4f1": "She went downstairs, throwing the dirty sheets into the laundry basket. She needed air and so went outside to the communal yard they shared with five other families. She cursed her luck when she saw Mrs Campbell pegging out her still-dirty washing."}, {"dad4": "“Hello, Mary Ellen, pet. How is he?” she asked, gesturing to the poky bedroom window where Jim lay within. Her eyes bulged with the prospect of tittle-tatter to share with her gaggle of gossips."}, {"fbfe": "Mary Ellen smiled weakly, hoping she looked like the worried wife everyone expected her to be."}, {"eefd": "“Still no better, Mrs Campbell. But we’re hopeful.”"}, {"3e1a": "“That’s right, pet, keep yer chin up. Does the doctor know what it is, pet?”"}, {"751b": "“Not really, Mrs Campbell. Dr Thorpe said it’s a condition of the stomach. I really must get back to him. Good day, Mrs Campbell.”"}, {"c906": "She went back inside, thinking uncharitable thoughts about the nosy Mrs Campbell. She poured fresh water into a glass, glaring at the calendar as she did so. How much longer did she have to wait? She paused, her eyes fixed on the calendar as she counted out the days. Sighing again, she knelt down on the floor and opened the cupboard door, rummaging around at the back of the cubbyhole until her fingers felt what they sought. The phial felt light in her hand as she brought it out of its hiding place. Just a little more of her tonic powder added to the water should help speed things along."}, {"a11d": "Mary Ellen woke in the night to the most frightening sounds. She lay on her back, staring at the ceiling as she listened to the frantic screams from Jim’s bedroom. After a few moments, she left her bed, lit a candle and entered Jim’s room. He was writhing in the bed, his eyes rolling in terror and pain. When he saw her standing in the threshold, he reached out to her, a look of desperation on his face."}, {"39c0": "“Hush now, Jim. Don’t fight it anymore.”"}, {"019a": "She watched him as the lights in his eyes finally went out. Mary Ellen placed her ear against Jim’s chest, sitting back in satisfaction when she heard no life in his heart. She turned to the stained mirror on the makeshift dressing table and concentrated very hard until tears began to fall."}, {"f821": "Mary Ellen ran down the stairs, throwing the front door open, and began to shout for help. When her neighbours began to open their own front doors, she collapsed in a heap on the ground, begging them to help her poor Jim, screaming at them to fetch Dr Thorpe."}, {"019c": "Dr Thorpe arrived an hour later, irritated that his peaceful slumber had been interrupted. However, he softened when he saw the pretty young woman so clearly distressed at the passing of her husband. The good doctor had been impressed with the dedication Mary Ellen had shown in caring for her ill spouse."}, {"5d2e": "“What killed him, Dr Thorpe?” Mary Ellen asked, her face streaked prettily with tears."}, {"287a": "“A gastric fever, there have been several cases this month already. How cruel this April has been. But, it is a blessing that Jim is now at peace. What will you do, Mrs Robson?”"}, {"2b4f": "“I have family along the coast, near Sunderland. I shall go to them. They’ll help me.”"}, {"5585": "“Very wise, Mrs Robson,” the doctor said, although he would be sad to see the attractive girl leave the mining community. “I shall prepare the death certificate before you leave.”"}, {"bb88": "Mary Ellen packed up her few belongings and was ready to leave. Everyone had been so kind to her, but she was tired of playing the grieving widow and couldn’t wait to go. She’d hired a cart to take her and her few possessions to her new home, a small village on the coast. She glanced at the calendar, scarcely believing it was already 1870. So much had happened in just a few years. She’d had high hopes for this marriage, but here she was, widow for the third time."}, {"c2f9": "Her first marriage had started with such high hopes. She’d dreamed of a wonderful life with John, believing all his promises about how he’d look after her and give her the very best. But he let her down, proving to be a useless, lazy, workshy man who took her away from her family to live in a filthy hovel in a filthy town. They shared their lodgings with an army of cockroaches, bed bugs and lice, and she’d spent hours cleaning the place but no amount of carbolic soap would kill them. Eventually, she’d gone to Mr Dickman the chemist, signed the poisons register and bought arsenic to get rid of them. It wasn’t the only thing the poison got rid of. She’d forgotten all about the insurance policy her stepfather had convinced her to take out on her new husband until the insurance agent arrived with the payout."}, {"814d": "Her second marriage to Joseph was much better. He was a good, honest, hard-working man, but he began to make too many demands on her. Joseph expected her to care for his ailing parents, and grew angry when she wanted some time for herself. It was such a shame when he and his parents died so suddenly after a short battle with typhoid. Mary Ellen returned to her own family, a widow again, with a tidy sum from the insurance agents in her purse."}, {"854e": "She met Jim when she gained employment at the infirmary as an auxiliary nurse. He was a miner and had injured his hand at work. He’d fallen for her soothing ways and gentle voice and promised her a life away from the misery she saw on the hospital wards. But she hated life as a miner’s wife, the constant gossip from the other wives, having to live in each other’s pockets. And she loathed how every surface and every piece of cloth in the house was constantly covered in soot. She begged Jim to find work elsewhere, but he refused. She deserved better than what he could offer. And so now she was a widow again."}, {"ba3a": "Mary Ellen’s thoughts were interrupted by a knock at the door. She opened it cautiously, careful to show the world that she was the anxious, sorrowful widow in her black gown."}, {"e1d1": "“Mrs Robson? My name is Angus Jones. I’m from Jones and Thomas insurance agents. May I begin by saying how dreadfully sorry we are for your loss.”"}, {"b6c9": "Mary Ellen invited the man in, ensuring he took note of how sad and forlorn she was. She sobbed daintily as he spoke and more forcefully when he handed over the payment."}, {"054c": "“Once again, Mrs Robson, I wish to offer my sincere condolences. If we can assist you in the future, we shall be happy to do so.”"}, {"65d5": "She closed the door and returned to the parlour, clutching the life insurance money to her chest. She looked around the dingy room, glad that she would soon be free of it. She wondered what her new life might bring. Maybe she’d be luckier with her next husband."}, {"0734": "Mary Ellen put her hand in the pocket of her gown, her fingers closing around the little bottle of her special tonic. She’d get it right next time. But she’d keep the arsenic, just in case."}, {"f05c": "Mary Ellen sat huddled in her thin dress, a threadbare shawl around her frail shoulders. She stared at the tatty calendar on the wall, remembering a time when she’d longed for the days to pass. Now she dreaded the steady march of time. She shivered in the freezing cold room in which she sat and waited. How suddenly things had changed. She’d been careless, so sure was she that she could never be caught. She heard footsteps outside her door and she looked up, hope making her heart thump in her chest. The door opened and the prison governor stood before her, his face grave and stern. Mary Ellen stood up even though her legs threatened to buckle at any moment."}, {"0683": "“Has it come through?”"}, {"b705": "“No, there will be no pardon,” he said, standing to one side as the prison chaplain entered her cell."}, {"824a": "“No! I’m innocent! You can’t do this!”"}, {"35c4": "The chaplain muttered his prayers as Mary Ellen was led from the condemned cell in which she had dwelt since the sentence of death had been passed. They walked along the corridor, out into the prison yard where the hangman’s noose awaited her."}, {"35d1": "The air smelt of spring flowers and she could feel the warmth of the sun upon her face."}, {"d55d": "“April,” she whispered. “The cruellest month of all.”"}, {"0dc7": "*T.S Eliot, The Waste Ground"}, {"0aef": "Author’s note: Based loosely on Mary Ann Cotton, England’s first convicted female serial killer."}], "child": "1286_1\t1286_21286_1\t1286_21286_1\t1286_21286_1\t1286_21286_1\t1286_21286_1\t1286_2"}