{"name": "1287", "parent": "", "content": "Let the Buyer Beware Source Every Christmas season, the braver residents of Norwich purchased a special gift for themselves. They visited the witch Celestia’s cottage, and they bought one of her handmade calendars. Celestia wove the covers from unicorn hair, painted each calendar using pigments made from powdered faerie wings, and stitched them together with threads taken from the garments of her magical ancestors. Those were the rumors, anyhow. But however the calendars were made, their pages were what mattered to the buyers. For Celestia’s calendars came already marked with significant upcoming dates in the lives of their purchasers. You might open your calendar on Christmas morning and learn that on July 18 of the upcoming year, you would meet your soulmate. Or you might discover that on September 10, you would bear, or sire, a child. (Of course, depending on one’s life circumstances, such a revelation could prove more awkward than thrilling.) Perhaps you would see nothing special marked for any month. This might be disappointing, but it was not necessarily the worst outcome. There was a type of calendar nobody ever wanted to get: One that was incomplete. For if a calendar broke off after a specific date, that meant only one thing. Celestia insisted that she simply made the calendars, and Fate imprinted them. She wrapped them herself before selling them, so there was no possibility of anyone picking through them in the hopes of finding an especially fortunate one. Let the buyer beware, she said. Some villagers simply refused to buy her calendars. It was best not to know these things in advance and simply accept life as it happened, they reasoned. But Celestia still made plenty of money. Daniel and his brother Graham had been buying Celestia’s calendars ever since they reached adulthood. Over the years, Daniel became increasingly less fond of this ritual. Graham’s calendars invariably promised wonderful things that always came to pass. He married a bright, beautiful woman. His business prospered. He and his wife had two well-behaved and lovely children. Daniel’s calendars showed him dismal things: the day he would lose his job, or the day that the love of his life would leave him for someone else. And those, too, happened just as they were written. He rather understandably lost all interest in purchasing another calendar and announced he wouldn’t be bothering with one this year, but Graham wouldn’t hear of it. “Brother, life will turn around for you eventually. And it’s good to know these things so you can plan for them.” Daniel thought that was awfully easy for Graham to say, but Graham would not be denied. The brothers made the trek to Celestia’s cottage and purchased their new calendars. Graham always invited Daniel to stay with his family for Christmas, as their parents had died several years prior and Daniel would otherwise be alone. It was a tradition to open their calendars on Christmas morning, but after Graham and his family went to bed on Christmas Eve, Daniel stole down to the Christmas tree and carefully unwrapped his calendar, trying not to crinkle the paper and alert anyone. When he opened his calendar, which was painted in hues of shimmering purple and blue, he felt it right away. Something was different. He discovered only too soon what the difference was: The calendar stopped on June 9th, and there were no more pages. Rage and terror fought a battle within Daniel’s soul. How could this be? He was barely thirty. He deserved far more time than this. Willing his hands to stop shaking, he found Graham’s calendar and unwrapped it. Graham’s calendar, painted in vivid silvers and golds, was complete, and it featured more money and more auspicious meetings for him, as if he hadn’t already had enough good fortune. It did note that he would suffer the painful loss of his brother on June 9th. Well, I’m thankful I’m considered a painful loss, said a sour voice inside Daniel’s head. And with that, rage won the battle. This was all deeply unfair. Graham had gotten so much already, and Daniel so little. Daniel had consumed a good bit of Graham’s fine wine at dinner that night, and perhaps that contributed to his next idea. He rewrapped the calendars and switched the name tags. He had no idea if this would work, but in his drunken and spiteful state, it seemed worth a try. Did it bother him that this act might be condemning his brother to death? If it did, he reasoned that his brother often seemed rather smug about all the good fortune he’d had. Now it was Daniel’s turn for a break. Christmas morning was a horribly sad affair after Graham unwrapped his calendar. He flipped through the purple and blue pages, turned as pale as milk when he came to the abbreviated June, and motioned for his wife Christina to join him in the kitchen, away from the children. But her howls of sorrow made the situation quite clear. Daniel thought to conceal his guilt by carrying on with the subtlety of a bad actor when Graham gave him the news. He collapsed to the floor, making the house shake and further upsetting Graham’s children. “There must be a terrible mistake, brother dear.” He delivered that line with particular conviction. And then, getting a bit carried away, he announced “Swap calendars with me! You’ve got so much more to live for than I do.” He felt like an idiot the second that one came out of his mouth, and he was more than a bit insulted by how long Graham seemed to consider that idea before shaking his head and saying that one’s fate simply couldn’t be changed so easily. That’s what you think, brother. Graham resolved to live the rest of his days with vigor and joy rather than cower in his home waiting for Death. June 9th came far too soon, and in the late afternoon, Graham’s favorite horse threw her master off after a sudden noise startled her. The impact killed Graham instantly. Daniel went to bed that night with no brother, but with his life. He had gotten away with the switch. Or so he believed at first. On the day after Graham’s death, Daniel thought he must be coming down with some peculiar illness. His stomach felt as if a knot of ice had formed in its center. The chill spread through Daniel’s body in defiance of the warm summer weather as the days progressed. It froze out his appetite. When Daniel looked at himself in the mirror to see if he had any visible signs of illness — pox marks or an oddly-colored tongue, perhaps — he realized he could barely see himself. He looked transparent, a mere shadowed outline. And after a few more days, nobody could see or hear Daniel at all. He still saw a faint reflection in the mirror and heard his own voice, but he could stand naked next to someone and shout swear words at the top of his lungs and get no reaction. He hadn’t died on June 9th, but he might as well have. Having no idea what else to do, he went to Celestia’s cottage, hoping that perhaps she could still see him and treat this bizarre affliction. The odors of sulfur and burnt wood wafted past Daniel as the ancient witch opened her door to him. She looked him up and down with filmy hazel eyes, raised a bushy eyebrow, and got straight to the point: “You switched with someone. Who was it?” “I did no such thing,” Daniel said. Celestia thwacked him on the arm with the spell book she held. “Don’t dare lie to me, idiot boy. There is only one way a body gets into the state you’re in right now. Who did you give your calendar to?” Daniel had the good sense to look at the wooden floor in shame. “My brother.” Celestia stared at him for a moment and then threw her head back and howled with bitter laughter. “And people call me wicked? My word.” Daniel’s ears burned. “Look, I know it was a terrible thing to do — “ “Oh, do you now?” That sent her off into more gales of hateful mirth. “But it’s done. He’s gone. Can’t you help me?” She let out one last great snort before fixing him with a look that froze his insides anew. “As I tell people year after year, I make the calendars. I’m not responsible for what they have in store for you. And if you attempt to cheat fate with sneaky tricks, you deserve what happens next. Even if I could fix you, I wouldn’t.” “But I can’t go on like this!” “You have no choice.” Celestia’s voice held no compassion. “Please,” Daniel said, his voice breaking. “I know I did an awful thing, but I’ll spend the rest of my life making it up to my brother’s family if only you undo this.” “Didn’t you hear me?” she snapped. “I can’t.” He didn’t believe her. “Then I’ll stay here and haunt you every day until you figure out a cure.” At that, she seized a gnarled wooden wand from her apron pocket. “The hell you will,” she said, blasting him straight out of the cottage with a great crackling red bolt of energy. He was unable to approach her home again. For years afterwards, he attempted to frighten off the people buying Celestia’s calendars. Sometimes a visitor would look around for a few seconds, as if they felt or heard something odd, but this was never enough to stop them. Graham’s family survived their devastating loss and lived happy lives. Daniel floats around Norwich to this day, with only the shades of others who attempted to cheat fate for company. With all the time he has had to reflect on the past, he wishes he had kept his own calendar. ", "title": "Let the Buyer Beware", "sentences": [{"7a87": "Let the Buyer Beware"}, {"ff38": "Source"}, {"78ae": "Every Christmas season, the braver residents of Norwich purchased a special gift for themselves. They visited the witch Celestia’s cottage, and they bought one of her handmade calendars."}, {"d4b5": "Celestia wove the covers from unicorn hair, painted each calendar using pigments made from powdered faerie wings, and stitched them together with threads taken from the garments of her magical ancestors."}, {"0f0e": "Those were the rumors, anyhow. But however the calendars were made, their pages were what mattered to the buyers. For Celestia’s calendars came already marked with significant upcoming dates in the lives of their purchasers."}, {"6d5a": "You might open your calendar on Christmas morning and learn that on July 18 of the upcoming year, you would meet your soulmate."}, {"361b": "Or you might discover that on September 10, you would bear, or sire, a child. (Of course, depending on one’s life circumstances, such a revelation could prove more awkward than thrilling.)"}, {"63e1": "Perhaps you would see nothing special marked for any month. This might be disappointing, but it was not necessarily the worst outcome."}, {"789d": "There was a type of calendar nobody ever wanted to get: One that was incomplete. For if a calendar broke off after a specific date, that meant only one thing."}, {"868b": "Celestia insisted that she simply made the calendars, and Fate imprinted them. She wrapped them herself before selling them, so there was no possibility of anyone picking through them in the hopes of finding an especially fortunate one. Let the buyer beware, she said."}, {"9209": "Some villagers simply refused to buy her calendars. It was best not to know these things in advance and simply accept life as it happened, they reasoned. But Celestia still made plenty of money."}, {"23fb": "Daniel and his brother Graham had been buying Celestia’s calendars ever since they reached adulthood. Over the years, Daniel became increasingly less fond of this ritual."}, {"2614": "Graham’s calendars invariably promised wonderful things that always came to pass. He married a bright, beautiful woman. His business prospered. He and his wife had two well-behaved and lovely children."}, {"e59c": "Daniel’s calendars showed him dismal things: the day he would lose his job, or the day that the love of his life would leave him for someone else. And those, too, happened just as they were written."}, {"100c": "He rather understandably lost all interest in purchasing another calendar and announced he wouldn’t be bothering with one this year, but Graham wouldn’t hear of it."}, {"9674": "“Brother, life will turn around for you eventually. And it’s good to know these things so you can plan for them.”"}, {"b8aa": "Daniel thought that was awfully easy for Graham to say, but Graham would not be denied. The brothers made the trek to Celestia’s cottage and purchased their new calendars."}, {"be61": "Graham always invited Daniel to stay with his family for Christmas, as their parents had died several years prior and Daniel would otherwise be alone. It was a tradition to open their calendars on Christmas morning, but after Graham and his family went to bed on Christmas Eve, Daniel stole down to the Christmas tree and carefully unwrapped his calendar, trying not to crinkle the paper and alert anyone."}, {"6bb4": "When he opened his calendar, which was painted in hues of shimmering purple and blue, he felt it right away. Something was different."}, {"c7ed": "He discovered only too soon what the difference was: The calendar stopped on June 9th, and there were no more pages."}, {"0791": "Rage and terror fought a battle within Daniel’s soul. How could this be? He was barely thirty. He deserved far more time than this."}, {"aadb": "Willing his hands to stop shaking, he found Graham’s calendar and unwrapped it."}, {"3100": "Graham’s calendar, painted in vivid silvers and golds, was complete, and it featured more money and more auspicious meetings for him, as if he hadn’t already had enough good fortune. It did note that he would suffer the painful loss of his brother on June 9th."}, {"f0c7": "Well, I’m thankful I’m considered a painful loss, said a sour voice inside Daniel’s head. And with that, rage won the battle. This was all deeply unfair. Graham had gotten so much already, and Daniel so little."}, {"ecf7": "Daniel had consumed a good bit of Graham’s fine wine at dinner that night, and perhaps that contributed to his next idea."}, {"b397": "He rewrapped the calendars and switched the name tags. He had no idea if this would work, but in his drunken and spiteful state, it seemed worth a try."}, {"6120": "Did it bother him that this act might be condemning his brother to death? If it did, he reasoned that his brother often seemed rather smug about all the good fortune he’d had."}, {"e358": "Now it was Daniel’s turn for a break."}, {"cd35": "Christmas morning was a horribly sad affair after Graham unwrapped his calendar. He flipped through the purple and blue pages, turned as pale as milk when he came to the abbreviated June, and motioned for his wife Christina to join him in the kitchen, away from the children. But her howls of sorrow made the situation quite clear."}, {"dff0": "Daniel thought to conceal his guilt by carrying on with the subtlety of a bad actor when Graham gave him the news. He collapsed to the floor, making the house shake and further upsetting Graham’s children."}, {"9392": "“There must be a terrible mistake, brother dear.” He delivered that line with particular conviction."}, {"3658": "And then, getting a bit carried away, he announced “Swap calendars with me! You’ve got so much more to live for than I do.”"}, {"2ad7": "He felt like an idiot the second that one came out of his mouth, and he was more than a bit insulted by how long Graham seemed to consider that idea before shaking his head and saying that one’s fate simply couldn’t be changed so easily."}, {"9745": "That’s what you think, brother."}, {"7431": "Graham resolved to live the rest of his days with vigor and joy rather than cower in his home waiting for Death. June 9th came far too soon, and in the late afternoon, Graham’s favorite horse threw her master off after a sudden noise startled her. The impact killed Graham instantly."}, {"6a98": "Daniel went to bed that night with no brother, but with his life. He had gotten away with the switch."}, {"c39e": "Or so he believed at first."}, {"cae9": "On the day after Graham’s death, Daniel thought he must be coming down with some peculiar illness. His stomach felt as if a knot of ice had formed in its center. The chill spread through Daniel’s body in defiance of the warm summer weather as the days progressed. It froze out his appetite."}, {"03b0": "When Daniel looked at himself in the mirror to see if he had any visible signs of illness — pox marks or an oddly-colored tongue, perhaps — he realized he could barely see himself. He looked transparent, a mere shadowed outline."}, {"9ad9": "And after a few more days, nobody could see or hear Daniel at all. He still saw a faint reflection in the mirror and heard his own voice, but he could stand naked next to someone and shout swear words at the top of his lungs and get no reaction."}, {"d1f8": "He hadn’t died on June 9th, but he might as well have."}, {"a449": "Having no idea what else to do, he went to Celestia’s cottage, hoping that perhaps she could still see him and treat this bizarre affliction."}, {"e11c": "The odors of sulfur and burnt wood wafted past Daniel as the ancient witch opened her door to him. She looked him up and down with filmy hazel eyes, raised a bushy eyebrow, and got straight to the point: “You switched with someone. Who was it?”"}, {"4586": "“I did no such thing,” Daniel said."}, {"d862": "Celestia thwacked him on the arm with the spell book she held."}, {"e56e": "“Don’t dare lie to me, idiot boy. There is only one way a body gets into the state you’re in right now. Who did you give your calendar to?”"}, {"c4de": "Daniel had the good sense to look at the wooden floor in shame. “My brother.”"}, {"5b46": "Celestia stared at him for a moment and then threw her head back and howled with bitter laughter."}, {"5c0a": "“And people call me wicked? My word.”"}, {"94dc": "Daniel’s ears burned. “Look, I know it was a terrible thing to do — “"}, {"1310": "“Oh, do you now?” That sent her off into more gales of hateful mirth."}, {"3843": "“But it’s done. He’s gone. Can’t you help me?”"}, {"bf0d": "She let out one last great snort before fixing him with a look that froze his insides anew."}, {"2b35": "“As I tell people year after year, I make the calendars. I’m not responsible for what they have in store for you. And if you attempt to cheat fate with sneaky tricks, you deserve what happens next. Even if I could fix you, I wouldn’t.”"}, {"4b0e": "“But I can’t go on like this!”"}, {"38db": "“You have no choice.” Celestia’s voice held no compassion."}, {"3408": "“Please,” Daniel said, his voice breaking. “I know I did an awful thing, but I’ll spend the rest of my life making it up to my brother’s family if only you undo this.”"}, {"bae7": "“Didn’t you hear me?” she snapped. “I can’t.”"}, {"1edc": "He didn’t believe her. “Then I’ll stay here and haunt you every day until you figure out a cure.”"}, {"63f8": "At that, she seized a gnarled wooden wand from her apron pocket."}, {"42e9": "“The hell you will,” she said, blasting him straight out of the cottage with a great crackling red bolt of energy. He was unable to approach her home again."}, {"09f5": "For years afterwards, he attempted to frighten off the people buying Celestia’s calendars. Sometimes a visitor would look around for a few seconds, as if they felt or heard something odd, but this was never enough to stop them."}, {"fc94": "Graham’s family survived their devastating loss and lived happy lives. Daniel floats around Norwich to this day, with only the shades of others who attempted to cheat fate for company."}, {"d86a": "With all the time he has had to reflect on the past, he wishes he had kept his own calendar."}], "child": "1287_1\t1287_2\t1287_31287_1\t1287_2\t1287_31287_1\t1287_2\t1287_3"}