{"name": "1288", "parent": "", "content": "Everybody Has A Day Paralee and Caroline get a free calendar and a brand new friendship Everybody has a date. One memorable day among all the others we’ll dance, plod, shimmy, trot or trudge through. It’s not a birthday or holiday. It sticks to us like the memory of our first kiss, if we are lucky, or our most devastating goodbye, if we are not. Our date appears on every complimentary calendar haphazardly stuck to the side of the fridge, but it never needs circling. Every breath we’ve taken from that day forward reminds us our lives, forever changed, are married to it, for better or worse, complete with its own private anniversary. Paralee’s date was a day in April, and absolutely the only day she forbade herself to forget as long as she lived, lest it come upon her again. Which, despite having anything to do with morbid superstition swaying the odds, it was quite impossible for actual events on this date to repeat themselves. This, however, did not prevent her from reliving the details of it every year thereafter. To its credit, April 28, 1958, was extraordinary, in that spring in all its swagger was predictably upon the hills and valleys surrounding her and Carl’s hometown and the suburb in which they resided was neatly cut up and looking like lime green icing on a Texas sheet cake sprinkled with mustard yellow and white daffodils. However, every year as winter grudgingly loosened its chilly grip on the porch thermometer and the ground began to thaw enough to play peekaboo with her perennials, Paralee began to watch the calendar with a wary eye and the inevitable weary heart. Knowing April 28th, was coming, as it always did, was not the same as being prepared for it. Paralee loathed this day. Each year, hopeful promises of reconciling fate and acceptance flattened along with her mood. Nothing could turn back the pages of history or the calendar to change what had happened that day, the day her and Carl’s hearts broke simultaneously into two separate and alienated halves. Each year after the dreadful day they had always watched the calendar together, observing the day, their day, in silent grief, each other’s solemn presence a grateful balm for the painful vacuum left by the loss of their only child. It was all the concession they could offer one another. “What day is it, Paralee?” Caroline asked absentmindedly, her nose buried in a borrowed copy of Fifty Shades of Grey. “How the hell should I know? Who gives a flying flapjack anyway, one day’s the same as the next, ain’t it?” Paralee huffed. “How about I get us one of ’em free calendars the Willows puts out every spring before they’s all gone?” Caroline suggested, lowering her book and studying Paralee. “Why the hell for?” Ain’t nobody ticking off the days until they break us out of this joint and we sure as hell ain’t gettin’ parole unless we die, so why do we need to look at a calendar?” Paralee groused. “Well, for one, I like knowing when they’re gonna be serving my favorite, meatloaf and mashed taters, and which night they’s having Butterscoth Bingo,” undaunted, Caroline gave her roommate her signature gummy grin. “I don’t want no dang calendar hanging up where I can see it, Caroline. Makes me feel like a useless convict,” Paralee growled, “only day I’m interested in is my last one, the day they roll me outta them glass double doors on a stretcher. Stamp me: ‘Return to Sender’!” “Oh, Paralee, don’t talk like that,” Caroline scolded, but knew well enough to leave it alone when Paralee’s mood turned darker than usual. She’d learned the hard way to scout out the currents and undertows always running beneath Paralee’s gruff exterior and she decided to trust her friend had her reasons for not wanting a calendar hanging up under her nose. This year wasn’t the first time someone had made a mistake and doubled the printing order for the Wilmington Willows annual calendar, and Mrs Montenegro was determined not to let them go to waste. She marched through the halls herself with an armload of them, stopping at every resident’s room to slip one under their door whether they wanted it or not. Montenegro decided if the surplus was out of her sight she could assume they’d come to good use. Caroline found their free calendar torn in two and chucked into the wastebasket, except for the month of April. The offending month had been extracted from between March and May like a rotten tooth. It laid on the floor in a crumpled ball where she assumed Paralee had tossed it. It didn’t take Agatha Christie to put two and two together. Caroline was certain something awful had happened to her friend in the month of April, but what? The door to their shared bathroom was closed, but Caroline could hear Paralee sniffing on the other side. She sat on her bed and waited. Five minutes turned into ten and ten into fifteen. Caroline had had plenty of time to work up her nerve, but instead her imagination worked her over and she found herself hopelessly tongue-tied by the time Paralee finally emerged. “What the hell, Caroline? Close your mouth before that last tooth falls out of your head from dry socket,” Paralee snapped. Caroline ignored Paralee’s put-off and looked her in the eye. “I, uh, I want you to know I’m here for you, Paralee. I know it won’t change nothin’ but I can listen if you wanna talk… about anything… anything at all,” Caroline coaxed, tenderly. She was holding the crumpled ball of April in her cupped hands like an offering. Paralee froze. She stared at the paper ball in Caroline’s hands; instead of the rejected month of April with its images of daffodils and sunshine, she saw April 28, 1958, the date she would never be permitted to forget. Her darkest day. It was the day her baby girl, Carla left them, the day she saw the light in Carl’s eyes for the last time, and the day love hid itself so deep in her own heart she was never sure it hadn’t gone completely. One day in which everything broke. Paralee’s shoulders slumped and she exhaled deeply toward the floor. “I suppose I’ve carried this burden alone long enough now, Caroline,” Paralee sighed. “If you’re gonna keep offering your friendship along with that goofy grin of yours, maybe it’s time to surrender and accept it.” And with a slightly grateful, if not a somewhat chary smile, Paralee began her story from the beginning... This is the 7th story in a coincidental series about two unlikely friends. Here are the other stories. The Price of FriendshipFeaturing Paralee and Caroline of The Wilting Willows Retirement Hometheweeklyknob.com I Hate GamesParalee turned around and wheeled herself from the day room so abruptly Caroline thought she might have a sudden case…theweeklyknob.com It Had To Be YouThe Annual Wilting Willows’ New Year’s Eve dance will begin in less than 28 hours. She thought they were stretching it…theweeklyknob.com Somebody Call The PlumberBy S Lynn Knighttheweeklyknob.com Of All The Things I’ve Lost, I Miss My Clicker The MostBy S Lynn Knighttheweeklyknob.com RedheadsBy S Lynn Knighttheweeklyknob.com Author’s Note: With every bit of my sincere thank you to The Weekly Knob community of writers and readers and especially to Aura Wilming, and Hex. One year, 52 issues of The Weekly Knob simply would not exist without each of you! ", "title": "Everybody Has A Day", "sentences": [{"b9ff": "Everybody Has A Day"}, {"f8be": "Paralee and Caroline get a free calendar and a brand new friendship"}, {"fe7d": "Everybody has a date. One memorable day among all the others we’ll dance, plod, shimmy, trot or trudge through. It’s not a birthday or holiday. It sticks to us like the memory of our first kiss, if we are lucky, or our most devastating goodbye, if we are not."}, {"0f50": "Our date appears on every complimentary calendar haphazardly stuck to the side of the fridge, but it never needs circling. Every breath we’ve taken from that day forward reminds us our lives, forever changed, are married to it, for better or worse, complete with its own private anniversary."}, {"802f": "Paralee’s date was a day in April, and absolutely the only day she forbade herself to forget as long as she lived, lest it come upon her again. Which, despite having anything to do with morbid superstition swaying the odds, it was quite impossible for actual events on this date to repeat themselves. This, however, did not prevent her from reliving the details of it every year thereafter."}, {"0ea7": "To its credit, April 28, 1958, was extraordinary, in that spring in all its swagger was predictably upon the hills and valleys surrounding her and Carl’s hometown and the suburb in which they resided was neatly cut up and looking like lime green icing on a Texas sheet cake sprinkled with mustard yellow and white daffodils."}, {"f3fb": "However, every year as winter grudgingly loosened its chilly grip on the porch thermometer and the ground began to thaw enough to play peekaboo with her perennials, Paralee began to watch the calendar with a wary eye and the inevitable weary heart. Knowing April 28th, was coming, as it always did, was not the same as being prepared for it."}, {"1eaf": "Paralee loathed this day."}, {"e0ed": "Each year, hopeful promises of reconciling fate and acceptance flattened along with her mood. Nothing could turn back the pages of history or the calendar to change what had happened that day, the day her and Carl’s hearts broke simultaneously into two separate and alienated halves. Each year after the dreadful day they had always watched the calendar together, observing the day, their day, in silent grief, each other’s solemn presence a grateful balm for the painful vacuum left by the loss of their only child. It was all the concession they could offer one another."}, {"b0a0": "“What day is it, Paralee?” Caroline asked absentmindedly, her nose buried in a borrowed copy of Fifty Shades of Grey."}, {"d796": "“How the hell should I know? Who gives a flying flapjack anyway, one day’s the same as the next, ain’t it?” Paralee huffed."}, {"31af": "“How about I get us one of ’em free calendars the Willows puts out every spring before they’s all gone?” Caroline suggested, lowering her book and studying Paralee."}, {"84cc": "“Why the hell for?” Ain’t nobody ticking off the days until they break us out of this joint and we sure as hell ain’t gettin’ parole unless we die, so why do we need to look at a calendar?” Paralee groused."}, {"d1a2": "“Well, for one, I like knowing when they’re gonna be serving my favorite, meatloaf and mashed taters, and which night they’s having Butterscoth Bingo,” undaunted, Caroline gave her roommate her signature gummy grin."}, {"482d": "“I don’t want no dang calendar hanging up where I can see it, Caroline. Makes me feel like a useless convict,” Paralee growled, “only day I’m interested in is my last one, the day they roll me outta them glass double doors on a stretcher. Stamp me: ‘Return to Sender’!”"}, {"da9e": "“Oh, Paralee, don’t talk like that,” Caroline scolded, but knew well enough to leave it alone when Paralee’s mood turned darker than usual. She’d learned the hard way to scout out the currents and undertows always running beneath Paralee’s gruff exterior and she decided to trust her friend had her reasons for not wanting a calendar hanging up under her nose."}, {"10f5": "This year wasn’t the first time someone had made a mistake and doubled the printing order for the Wilmington Willows annual calendar, and Mrs Montenegro was determined not to let them go to waste. She marched through the halls herself with an armload of them, stopping at every resident’s room to slip one under their door whether they wanted it or not. Montenegro decided if the surplus was out of her sight she could assume they’d come to good use."}, {"6983": "Caroline found their free calendar torn in two and chucked into the wastebasket, except for the month of April. The offending month had been extracted from between March and May like a rotten tooth. It laid on the floor in a crumpled ball where she assumed Paralee had tossed it."}, {"5b0a": "It didn’t take Agatha Christie to put two and two together. Caroline was certain something awful had happened to her friend in the month of April, but what?"}, {"fc65": "The door to their shared bathroom was closed, but Caroline could hear Paralee sniffing on the other side."}, {"f7a7": "She sat on her bed and waited. Five minutes turned into ten and ten into fifteen. Caroline had had plenty of time to work up her nerve, but instead her imagination worked her over and she found herself hopelessly tongue-tied by the time Paralee finally emerged."}, {"01b5": "“What the hell, Caroline? Close your mouth before that last tooth falls out of your head from dry socket,” Paralee snapped."}, {"fe22": "Caroline ignored Paralee’s put-off and looked her in the eye."}, {"9bb9": "“I, uh, I want you to know I’m here for you, Paralee. I know it won’t change nothin’ but I can listen if you wanna talk… about anything… anything at all,” Caroline coaxed, tenderly. She was holding the crumpled ball of April in her cupped hands like an offering."}, {"bcc2": "Paralee froze."}, {"0bba": "She stared at the paper ball in Caroline’s hands; instead of the rejected month of April with its images of daffodils and sunshine, she saw April 28, 1958, the date she would never be permitted to forget. Her darkest day. It was the day her baby girl, Carla left them, the day she saw the light in Carl’s eyes for the last time, and the day love hid itself so deep in her own heart she was never sure it hadn’t gone completely."}, {"3353": "One day in which everything broke."}, {"5d5a": "Paralee’s shoulders slumped and she exhaled deeply toward the floor."}, {"cfcc": "“I suppose I’ve carried this burden alone long enough now, Caroline,” Paralee sighed. “If you’re gonna keep offering your friendship along with that goofy grin of yours, maybe it’s time to surrender and accept it.”"}, {"3e1a": "And with a slightly grateful, if not a somewhat chary smile, Paralee began her story from the beginning..."}, {"7e3e": "This is the 7th story in a coincidental series about two unlikely friends. Here are the other stories."}, {"283c": "The Price of FriendshipFeaturing Paralee and Caroline of The Wilting Willows Retirement Hometheweeklyknob.com"}, {"149d": "I Hate GamesParalee turned around and wheeled herself from the day room so abruptly Caroline thought she might have a sudden case…theweeklyknob.com"}, {"e0be": "It Had To Be YouThe Annual Wilting Willows’ New Year’s Eve dance will begin in less than 28 hours. She thought they were stretching it…theweeklyknob.com"}, {"747e": "Somebody Call The PlumberBy S Lynn Knighttheweeklyknob.com"}, {"7a1a": "Of All The Things I’ve Lost, I Miss My Clicker The MostBy S Lynn Knighttheweeklyknob.com"}, {"8a7d": "RedheadsBy S Lynn Knighttheweeklyknob.com"}, {"de9f": "Author’s Note: With every bit of my sincere thank you to The Weekly Knob community of writers and readers and especially to Aura Wilming, and Hex. One year, 52 issues of The Weekly Knob simply would not exist without each of you!"}], "child": "1288_1\t1288_2\t1288_3\t1288_4\t1288_5\t1288_6\t1288_7\t1288_8\t1288_9\t1288_10\t1288_111288_1\t1288_2\t1288_3\t1288_4\t1288_5\t1288_6\t1288_7\t1288_8\t1288_9\t1288_10\t1288_111288_1\t1288_2\t1288_3\t1288_4\t1288_5\t1288_6\t1288_7\t1288_8\t1288_9\t1288_10\t1288_111288_1\t1288_2\t1288_3\t1288_4\t1288_5\t1288_6\t1288_7\t1288_8\t1288_9\t1288_10\t1288_111288_1\t1288_2\t1288_3\t1288_4\t1288_5\t1288_6\t1288_7\t1288_8\t1288_9\t1288_10\t1288_11"}