{"name": "129", "parent": "", "content": "Welcome to The Cocoon This is (not really) the future — where NBA players can rest, relax, and recreate, without ever leaving the watchful eye of their team. Step inside this brave new world and learn how the Warriors are changing the way players work … and play. The idea that would become The Cocoon began, like most things with the Warriors, with one of Jerry West’s stories. “We had just come off a two-week stretch playing seven of eight games on the road, and the players were exhausted,” team owner and CEO Joe Lacob tells me while squeezing peanut-butter-and-jelly mix out of an IV bag directly into his mouth. The sweet aroma of an elementary school cafeteria filled the office behind the loading dock at Oracle Arena. “One of the games was in New York City on Sunday afternoon, and to us it’s like nine in the morning. We got into the city on Friday night from Toronto, and of course our guys went out on the town.” The Warriors beat the Knicks by seven points that afternoon, but the game was more difficult than it should have been. “That’s what got us thinking about rest and travel and a better way to do both,” Lacob says. In his view, a basketball team exists on three discrete levels of reality. A team is a collection of players, in the same way that a machine is an assemblage of parts. That’s the structural level. A team is also the result of a plan or set of plans. This is the design level. Finally, a team is a collection of human beings with goals and desires that exist outside the stated objectives of the franchise. This is the motivational level. We often transition from one mode to another without considering the conceptual dissonance. For Lacob and the Warriors, the holy grail is anything that benefits the team from the structural, design, and motivational perspectives. “Oftentimes, a team and its players don’t necessarily want the same thing, even if they’re working toward the same goal. If Klay wants to get lit before a game, that doesn’t mean he’s not interested in scoring 40 and playing defense. But what if players could satisfy their biological motivations in ways that don’t hamper the team or our investment in them? What if you could be at the bar all night but also play hard the next day?” A few days after the road trip, Lacob and the Warriors brain trust got together at the team’s practice facility. An article about the “Tinder-ization” had recently been published and was being discussed. “Jerry doesn’t understand apps, so my son was explaining it to him,” Lacob says. “He was blown away.” West proceeded to tell the story of how the Lakers once lost Wilt Chamberlain for five days in Cincinnati. “Apparently,” Lacob says, peanut butter smeared across his chin, “Wilt was just short of 18,000.” 18,000 what? “You know.” Ah. “So he was, like, three away from 18, and I guess Wilt was very particular about stuff like this, and he never came back to the hotel. Jack Kent Cooke finally had to have the team leave without him.” In fact, Wilt expended so much energy on his amorous pursuits, West told the room, that if Instagram were available in 1968, when the Lakers acquired the legendary big man, the team would have won five titles instead of only one. “Sex is strenuous on its own without having to look for it,” Lacob says. “It took me two months to recover from having a three-way with the Larry O’Brien Trophy! Stilt was worn out before most games even started. And that’s when the light bulb went off.” Many were confused when the Warriors ownership group recently acquired VR Tango, a small Norwegian company specializing in disposable, virtual-reality-controllable sex toys for extremely tall individuals. Less publicized, but just as strange, was the team’s purchase of a medical-feeding-tube company and the hiring of a Japanese architectural firm closely associated with the construction of pod hotels and office spaces. But it was all part of a plan, the next step in Lacob’s stated goal to keep the Warriors light-years ahead of the competition by turning inefficiencies into strengths. “I think of it as the Three R’s,” Lacob tells me. “Rest, recreation, and whatever the third one is. I forget. The Spurs pioneered rest, and proved it could lengthen careers. Dating apps and social media made recreation easier to access. And every team in the league feeds its players peanut butter and jelly sandwiches. What if you could combine all those elements?” The result, after years of research, is the Hygge Tube. Or, as the players and staff call it, The Cocoon, an all-in-one rest, recreation, and sensory-deprivation shipping container that allows players, in a state of light unconsciousness, to ingest peanut-butter-and-jelly mix, simulate a night on the town, and even “have sex,” all while being transported to the team’s next game. The process works like this: After road games, players shower as normal and are given recovery smoothies that contain a fast-acting narcotic, synthesized from a species of poisonous blowfish. The drug works by blocking muscle receptors, thus paralyzing the subject while allowing him to stay more or less conscious. Players then enter their Cocoon. Each pod contains a feeding apparatus, virtual-reality goggles, and disposable stimulation sleeve. The pods are temperature controlled and loaded with individually tailored virtual scenarios that simulate partying on the road. There are simulations of nightclubs, dinner and drinks with friends, an Atlanta strip club tour, an evening at LIV with members of the Kardashian family, and so on. “We’re working on acquiring the rights to more celebrities,” Lacob says. “Our guys love that kind of stuff. The dead ones are easier than the living ones, so I’m trying to get our players interested in classic movies.” JaVale McGee’s VR program includes a four-hour loop of the Charles Barkley–Shaquille O’Neal fight. Steph Curry’s allegedly includes ordering pizza at home by himself and playing Rory McIlroy PGA Tour on PlayStation. “We invest so much in our players,” Lacob tells me. “Millions and millions. Dating apps are objectively better than hanging out in a club all night. But even that wasn’t a perfect system.” At the 2016 Summer Olympics in Brazil, Draymond Green’s gold-medal march was marred when he accidentally Snapchatted his penis. “He meant to send it by DM. So you see the problems that can occur,” Lacob says. With The Cocoon, there’s no danger of being outed by TMZ or getting a spot blown up on social media. “It’s whatever you want to do in there. Like Westworld, only you’re getting your full eight-hour sleep!” The pods are then loaded onto trucks or airplanes and shipped to wherever the Warriors play next. Each player’s pod is transported individually, at differing speeds. For instance, Curry and all the starters except for Zaza Pachulia are sent next-day air, while the bench is transported via ground. This way, a weather issue or engine trouble doesn’t affect the entire team. “We based that off packet-switching,” Lacob tells me, which is the system that allows the internet to work even when parts of it aren’t accessible. “It used to be a problem where the plane would strand the entire team. Now if the truck carrying James Michael McAdoo breaks down in Colorado — that’s not ideal, but we can play the game. No problem.” Has that ever happened? “Ian Clark got stuck in Tampa for a few days because of Hurricane Babar. By the time we got him back, his waste processors were almost full and The Cocoon’s battery was on 12 percent.” The Cocoons are kept at ground-level air pressure, and they monitor vital signs, which are sent via cell network to the Warriors’ health, nutrition, and virtual-recreation department. “There’s actually an app we made so we can track guys and everything,” Lacob says. He fishes his phone out of his pocket and turns it toward me, grinning. “See? Draymond Green. Still alive! And … out for delivery right now.” “It’s an amazing system,” Jerry West tells me over the phone. “I wish we had it when I was playing.” West says that many former players he’s spoken to, even those who have been critical of modern players who take games off for rest, feel the same way. “In my day, we flew commercial or took long bus trips. You could smoke in the main cabin then, and we drank on the flight. Charter flights were a huge step up. Teams understand not to let players drink on the plane. The Cocoon takes all the stress of travel out of the equation.” Lacob balls up the empty PB&J IV bag, throws it in the trash, and starts unbuttoning his shirt. A technician runs a diagnostic on one of the pods. A fresh stimulation sleeve is placed gingerly in The Cocoon. Lacob steps out of his shoes. I try to keep my cool at the sight of Lacob’s full-torso tribal tattoos. “Want to give it a try?” ", "title": "Welcome to The Cocoon", "sentences": [{"0542": "Welcome to The Cocoon"}, {"e702": "This is (not really) the future — where NBA players can rest, relax, and recreate, without ever leaving the watchful eye of their team. Step inside this brave new world and learn how the Warriors are changing the way players work … and play."}, {"cda0": "The idea that would become The Cocoon began, like most things with the Warriors, with one of Jerry West’s stories. “We had just come off a two-week stretch playing seven of eight games on the road, and the players were exhausted,” team owner and CEO Joe Lacob tells me while squeezing peanut-butter-and-jelly mix out of an IV bag directly into his mouth. The sweet aroma of an elementary school cafeteria filled the office behind the loading dock at Oracle Arena. “One of the games was in New York City on Sunday afternoon, and to us it’s like nine in the morning. We got into the city on Friday night from Toronto, and of course our guys went out on the town.”"}, {"66d2": "The Warriors beat the Knicks by seven points that afternoon, but the game was more difficult than it should have been. “That’s what got us thinking about rest and travel and a better way to do both,” Lacob says."}, {"db8c": "In his view, a basketball team exists on three discrete levels of reality. A team is a collection of players, in the same way that a machine is an assemblage of parts. That’s the structural level. A team is also the result of a plan or set of plans. This is the design level. Finally, a team is a collection of human beings with goals and desires that exist outside the stated objectives of the franchise. This is the motivational level."}, {"cc66": "We often transition from one mode to another without considering the conceptual dissonance. For Lacob and the Warriors, the holy grail is anything that benefits the team from the structural, design, and motivational perspectives. “Oftentimes, a team and its players don’t necessarily want the same thing, even if they’re working toward the same goal. If Klay wants to get lit before a game, that doesn’t mean he’s not interested in scoring 40 and playing defense. But what if players could satisfy their biological motivations in ways that don’t hamper the team or our investment in them? What if you could be at the bar all night but also play hard the next day?”"}, {"b8e9": "A few days after the road trip, Lacob and the Warriors brain trust got together at the team’s practice facility. An article about the “Tinder-ization” had recently been published and was being discussed. “Jerry doesn’t understand apps, so my son was explaining it to him,” Lacob says. “He was blown away.”"}, {"cc91": "West proceeded to tell the story of how the Lakers once lost Wilt Chamberlain for five days in Cincinnati."}, {"b329": "“Apparently,” Lacob says, peanut butter smeared across his chin, “Wilt was just short of 18,000.”"}, {"3bdd": "18,000 what?"}, {"6aa0": "“You know.”"}, {"d585": "Ah."}, {"2f60": "“So he was, like, three away from 18, and I guess Wilt was very particular about stuff like this, and he never came back to the hotel. Jack Kent Cooke finally had to have the team leave without him.” In fact, Wilt expended so much energy on his amorous pursuits, West told the room, that if Instagram were available in 1968, when the Lakers acquired the legendary big man, the team would have won five titles instead of only one. “Sex is strenuous on its own without having to look for it,” Lacob says. “It took me two months to recover from having a three-way with the Larry O’Brien Trophy! Stilt was worn out before most games even started. And that’s when the light bulb went off.”"}, {"3a1b": "Many were confused when the Warriors ownership group recently acquired VR Tango, a small Norwegian company specializing in disposable, virtual-reality-controllable sex toys for extremely tall individuals. Less publicized, but just as strange, was the team’s purchase of a medical-feeding-tube company and the hiring of a Japanese architectural firm closely associated with the construction of pod hotels and office spaces. But it was all part of a plan, the next step in Lacob’s stated goal to keep the Warriors light-years ahead of the competition by turning inefficiencies into strengths."}, {"6344": "“I think of it as the Three R’s,” Lacob tells me. “Rest, recreation, and whatever the third one is. I forget. The Spurs pioneered rest, and proved it could lengthen careers. Dating apps and social media made recreation easier to access. And every team in the league feeds its players peanut butter and jelly sandwiches. What if you could combine all those elements?”"}, {"cd86": "The result, after years of research, is the Hygge Tube. Or, as the players and staff call it, The Cocoon, an all-in-one rest, recreation, and sensory-deprivation shipping container that allows players, in a state of light unconsciousness, to ingest peanut-butter-and-jelly mix, simulate a night on the town, and even “have sex,” all while being transported to the team’s next game."}, {"9d84": "The process works like this: After road games, players shower as normal and are given recovery smoothies that contain a fast-acting narcotic, synthesized from a species of poisonous blowfish. The drug works by blocking muscle receptors, thus paralyzing the subject while allowing him to stay more or less conscious. Players then enter their Cocoon. Each pod contains a feeding apparatus, virtual-reality goggles, and disposable stimulation sleeve. The pods are temperature controlled and loaded with individually tailored virtual scenarios that simulate partying on the road. There are simulations of nightclubs, dinner and drinks with friends, an Atlanta strip club tour, an evening at LIV with members of the Kardashian family, and so on."}, {"4d3f": "“We’re working on acquiring the rights to more celebrities,” Lacob says. “Our guys love that kind of stuff. The dead ones are easier than the living ones, so I’m trying to get our players interested in classic movies.” JaVale McGee’s VR program includes a four-hour loop of the Charles Barkley–Shaquille O’Neal fight. Steph Curry’s allegedly includes ordering pizza at home by himself and playing Rory McIlroy PGA Tour on PlayStation."}, {"0012": "“We invest so much in our players,” Lacob tells me. “Millions and millions. Dating apps are objectively better than hanging out in a club all night. But even that wasn’t a perfect system.”"}, {"ad9f": "At the 2016 Summer Olympics in Brazil, Draymond Green’s gold-medal march was marred when he accidentally Snapchatted his penis. “He meant to send it by DM. So you see the problems that can occur,” Lacob says. With The Cocoon, there’s no danger of being outed by TMZ or getting a spot blown up on social media. “It’s whatever you want to do in there. Like Westworld, only you’re getting your full eight-hour sleep!”"}, {"faef": "The pods are then loaded onto trucks or airplanes and shipped to wherever the Warriors play next. Each player’s pod is transported individually, at differing speeds. For instance, Curry and all the starters except for Zaza Pachulia are sent next-day air, while the bench is transported via ground. This way, a weather issue or engine trouble doesn’t affect the entire team. “We based that off packet-switching,” Lacob tells me, which is the system that allows the internet to work even when parts of it aren’t accessible. “It used to be a problem where the plane would strand the entire team. Now if the truck carrying James Michael McAdoo breaks down in Colorado — that’s not ideal, but we can play the game. No problem.”"}, {"f58f": "Has that ever happened?"}, {"fc48": "“Ian Clark got stuck in Tampa for a few days because of Hurricane Babar. By the time we got him back, his waste processors were almost full and The Cocoon’s battery was on 12 percent.” The Cocoons are kept at ground-level air pressure, and they monitor vital signs, which are sent via cell network to the Warriors’ health, nutrition, and virtual-recreation department. “There’s actually an app we made so we can track guys and everything,” Lacob says."}, {"f7e6": "He fishes his phone out of his pocket and turns it toward me, grinning. “See? Draymond Green. Still alive! And … out for delivery right now.”"}, {"b0dc": "“It’s an amazing system,” Jerry West tells me over the phone. “I wish we had it when I was playing.” West says that many former players he’s spoken to, even those who have been critical of modern players who take games off for rest, feel the same way. “In my day, we flew commercial or took long bus trips. You could smoke in the main cabin then, and we drank on the flight. Charter flights were a huge step up. Teams understand not to let players drink on the plane. The Cocoon takes all the stress of travel out of the equation.”"}, {"66cf": "Lacob balls up the empty PB&J IV bag, throws it in the trash, and starts unbuttoning his shirt. A technician runs a diagnostic on one of the pods. A fresh stimulation sleeve is placed gingerly in The Cocoon. Lacob steps out of his shoes. I try to keep my cool at the sight of Lacob’s full-torso tribal tattoos. “Want to give it a try?”"}], "child": "129_1\t129_2\t129_3\t129_4\t129_5\t129_6\t129_7\t129_8\t129_9\t129_10\t129_11\t129_12\t129_13\t129_14\t129_15\t129_16\t129_17\t129_18\t129_19\t129_20\t129_21\t129_22\t129_23\t129_24\t129_25"}