{"name": "1290", "parent": "", "content": "The Big Calendar The year had come to an end and Carra set out to purchase something better to mark thenew year. The day she went calendar shopping, she knew it would revolutionize the way she managed her business, she just didn’t know it would take up so much space. Working at a desk that really wasn’t intended to be one, she should have expected what she ended up with. A calender the size of Timbuktu that simply did not fit her desk, yet really changed the way she laid out her schedule, planned her writing and finally made a difference in the life of her career. Now maybe when NaNoWriMo rolled around again, she thought, “I will be ready!” Plus, she could plan out her daily blog, different themes for each day, and all of her other self-imposed assignments. She had always used those dinky, standard sized calendars before, you know, the ones you got free from some insurance company or in the mail as part of a marketing campaign. She no longer cared about the scenic views they offered, or the cute little animals that adorned them. Sometimes she used the calender on her iPad or phone, but that simply wasn’t cutting the mustard. No, she needed something with lines, so she could write everything out and see what needed to be accomplished on a daily basis. Something she could make notes on, fill with appointments and list out daily tasks. As she strolled among the cluttered aisles at her favorite dollar chain store, fingering kitty covered calendars, day planners and other merchandise designed to help one keep track of time, she just kept thinking, “no, this isn’t exactly what I need.” The next thing she knew, she was at her favorite big box store, now on the hunt for something more massive in size. She went straight for the office supplies, yet could not find what she was looking for until she enlisted the aid of a store employee. There, on the one aisle she hadn’t looked, naturally, she saw the one she coveted. Oh happy day! She simply could not wait until she got her prize home. Would it fit? She didn’t know, but thought there was a good chance…it looked right, anyway. Now she would have the one tool she needed to make a difference in the way she managed her word count every day, among other things. As she walked through the garage door into the house, ripping the cellophane paper off of the shiny new calendar, she ran to her home office to see how it fit on her makeshift desk. Now, the calendar sits on the furniture, alone and lonely as Carra sits on an exercise ball, tv tray as a desk in a newfound effort to find a more comfortable typing position. Turns out the calendar was way too cumbersome for her to see what she had written down, unless she moved everything off of it, maybe now was the time to find a real desk. Still, it served it’s purpose, and she found that because of the newer, bigger calendar, she managed to write more every day, keep her thoughts organized, and plan out every day down to the minute almost, bringing her closer to having the career she always wanted. When the novel, series or award winning blog finally gets published, she will have her ginormous calendar to thank, for keeping her honest, helping her increase her word count, making sense of her busy days and having a place to aid her memory, for without it she would have been lost. Lost to unorganization, random thoughts, and many hours simply staring out the window, waiting for inspiration to strike. ", "title": "The Big Calendar", "sentences": [{"ec94": "The Big Calendar"}, {"c434": "The year had come to an end and Carra set out to purchase something better to mark thenew year. The day she went calendar shopping, she knew it would revolutionize the way she managed her business, she just didn’t know it would take up so much space."}, {"4675": "Working at a desk that really wasn’t intended to be one, she should have expected what she ended up with. A calender the size of Timbuktu that simply did not fit her desk, yet really changed the way she laid out her schedule, planned her writing and finally made a difference in the life of her career. Now maybe when NaNoWriMo rolled around again, she thought, “I will be ready!” Plus, she could plan out her daily blog, different themes for each day, and all of her other self-imposed assignments."}, {"4db9": "She had always used those dinky, standard sized calendars before, you know, the ones you got free from some insurance company or in the mail as part of a marketing campaign. She no longer cared about the scenic views they offered, or the cute little animals that adorned them. Sometimes she used the calender on her iPad or phone, but that simply wasn’t cutting the mustard. No, she needed something with lines, so she could write everything out and see what needed to be accomplished on a daily basis. Something she could make notes on, fill with appointments and list out daily tasks."}, {"3752": "As she strolled among the cluttered aisles at her favorite dollar chain store, fingering kitty covered calendars, day planners and other merchandise designed to help one keep track of time, she just kept thinking, “no, this isn’t exactly what I need.” The next thing she knew, she was at her favorite big box store, now on the hunt for something more massive in size. She went straight for the office supplies, yet could not find what she was looking for until she enlisted the aid of a store employee. There, on the one aisle she hadn’t looked, naturally, she saw the one she coveted."}, {"77b7": "Oh happy day! She simply could not wait until she got her prize home. Would it fit? She didn’t know, but thought there was a good chance…it looked right, anyway. Now she would have the one tool she needed to make a difference in the way she managed her word count every day, among other things. As she walked through the garage door into the house, ripping the cellophane paper off of the shiny new calendar, she ran to her home office to see how it fit on her makeshift desk."}, {"f708": "Now, the calendar sits on the furniture, alone and lonely as Carra sits on an exercise ball, tv tray as a desk in a newfound effort to find a more comfortable typing position. Turns out the calendar was way too cumbersome for her to see what she had written down, unless she moved everything off of it, maybe now was the time to find a real desk. Still, it served it’s purpose, and she found that because of the newer, bigger calendar, she managed to write more every day, keep her thoughts organized, and plan out every day down to the minute almost, bringing her closer to having the career she always wanted."}, {"c8f7": "When the novel, series or award winning blog finally gets published, she will have her ginormous calendar to thank, for keeping her honest, helping her increase her word count, making sense of her busy days and having a place to aid her memory, for without it she would have been lost. Lost to unorganization, random thoughts, and many hours simply staring out the window, waiting for inspiration to strike."}], "child": "1290_1\t1290_2"}