{"name": "1291", "parent": "", "content": "A Prompt Getaway Concluding A Hostage To Fortune* Collage by me (sources) Jenny glanced up at the calendar. Was it really two whole months since her aunt had disappeared without trace? Yes, the grid confirmed, it was, although without trace wasn’t quite the right phrase. Without anyone saying a dicky-bird would be more accurate. And Uncle Tom was supposed to be coming round for Sunday dinner again, although this time he was late. He had been a semi-permanent guest since his wife’s disappearance, as if he couldn’t fend for himself. And still, after all this time, nobody would talk about Aunt Katie, not a mention of her name. Jenny’s birthday card had been signed for the two of them by Uncle Tom. For something to do before her uncle arrived, Jenny opened a puzzle book. Change boy to man in three moves, she read. Bon? Was French allowed in these things? Probably not, she reflected, since not everyone was lucky enough to go to France for their holidays. No, it would be bay, and then ban and man. Too simple. She sighed, and looked up at the calendar again. It was still Sunday. “They’re here,” her father called from the dining-room. They? Jenny dropped the book and ran to look out through the front window. Yes, there on the drive was Uncle Tom’s car, and there in the passenger seat was her mysterious disappearing aunt, now reappeared. The dining-table was already set for five places. I shall demand an explanation, Jenny told herself. At the right time. “Hello, Jenny,” Uncle Tom said, bustling through the door. “Do you have a minute?” He was already twirling his watch on its chain in front of him. “Ah, no you don’t, because I have them all!” The watch popped into his waistcoat pocket. “One day she’ll get tired of that gag,” Jenny’s mother said behind her, “and then where will you be, favourite uncle?” “I’ll still be her favourite uncle,” said Tom. “They can’t take that away from me. Oh, no,” he went on in a cracked singing voice, “they caaant take that away from me!” “I could,” came the voice of Aunt Katie. “You just watch me.” Jenny grabbed her chance. “Hello Auntie,” she said. “Did you enjoy Europe?” “Europe?” Her aunt’s face was more surprised than amused as she glanced at each of the other adults in turn. “What have you been telling the girl?” “They said you were working in Europe,” Jenny put in, before she could be sidelined again. “But they didn’t say where, and Europe’s a big place.” “Yes it is,” said Aunt Katie. “And I’d tell you all about it, only my glass is empty.” “You haven’t got a glass,” said Jenny’s father. “And whose fault is that?” It was an incredible tale, Jenny thought as she listened. Aunt Katie was not a spy, she was almost certain. She had surely not been kidnapped and held for ransom. Her story of entrapment and escape was beyond belief. Wasn’t it? “I poked one of them in the eyes with the chopsticks, and hit the other round the head with the tyre iron,” her aunt was saying. “So he was down, but the first chased me round the room in a rage, until he fell over an artificial plant that I kicked out of the fireplace. That settled him. I tied them up together, there wasn’t much lying around I could use for that, I had to use a roll of clingfilm. I considered putting it all over their faces too, but I didn’t want to suffocate them, just cover their mouths so that they couldn’t raise an alarm too quickly.” “The chemicals in clingfilm would kill them if you left it there long enough,” Jenny’s father said, topping up his sister’s wine. “That’s true,” Aunt Katie agreed, “and this wasn’t even modern stuff, it was an old box of Saran Wrap, genuine American. God knows where they got it from in that neck of the woods. Is it even called that in the States any more? I doubt it. Anyway, I picked up my purse, which they had conveniently not yet ransacked, borrowed one of their bicycles to race down to the railway station, then caught the train to the airport and the first plane home.” She laughed. “With all the money.” “A hostage’s fortune,” said Jenny’s father. He too had a smirk that Jenny could not interpret. “Hm. I think we deserve another bottle.” “Indeed,” said his sister. “Oh — ” She reached into the large Duty Free bag that had been ostentatiously parked beside her throughout the narrative, and pulled out a teddy-bear. “Present for you,” she said, handing it to Jenny. “Sorry it couldn’t be here for your birthday, but by the calendar they use where I was, that’s not until tomorrow. And I’ll tell you something else,” Aunt Katie added, addressing the grownups, “I am never going there again.” “Never say ngurlignnnk,” Uncle Tom grinned. The celebration in the other room was becoming raucous. They are not going to tell me anything, Jenny told herself again. They never do. I might just as well try to solve word-puzzles as the ones they make up. At least with these I know there’s an answer. Although... She frowned at the puzzle-book. Change tree to logs in four moves. Most of these were easy, but not this one. Trés? “Having trouble?” asked Uncle Tom, picking up the book without waiting for an answer. “Tree to logs in four moves, ah… yes. Do you know what it is?” “I thought it might be French,” Jenny said. “Could be if you want,” her uncle said, “but you can do it in English. Shall I tell you?” Jenny nodded. Obviously, over a thing that didn’t matter a whit, he was going to tell her. Her uncle counted the steps off on his fingers. “Tree — chainsaw — hospital — call a wood merchant — logs.” His eyes had the old twinkle again. “Uncle!” Jenny snapped, finally exasperated with her entire extended family. “Is anyone ever going to explain anything without having to make a joke of it?” Uncle Tom grinned at her. “Not on my watch.” *Previous chapters: ", "title": "A Prompt Getaway", "sentences": [{"3480": "A Prompt Getaway"}, {"7668": "Concluding A Hostage To Fortune*"}, {"af26": "Collage by me (sources)"}, {"3fca": "Jenny glanced up at the calendar. Was it really two whole months since her aunt had disappeared without trace? Yes, the grid confirmed, it was, although without trace wasn’t quite the right phrase. Without anyone saying a dicky-bird would be more accurate. And Uncle Tom was supposed to be coming round for Sunday dinner again, although this time he was late. He had been a semi-permanent guest since his wife’s disappearance, as if he couldn’t fend for himself. And still, after all this time, nobody would talk about Aunt Katie, not a mention of her name. Jenny’s birthday card had been signed for the two of them by Uncle Tom."}, {"b056": "For something to do before her uncle arrived, Jenny opened a puzzle book. Change boy to man in three moves, she read. Bon? Was French allowed in these things? Probably not, she reflected, since not everyone was lucky enough to go to France for their holidays. No, it would be bay, and then ban and man. Too simple. She sighed, and looked up at the calendar again. It was still Sunday."}, {"a44f": "“They’re here,” her father called from the dining-room. They? Jenny dropped the book and ran to look out through the front window. Yes, there on the drive was Uncle Tom’s car, and there in the passenger seat was her mysterious disappearing aunt, now reappeared. The dining-table was already set for five places. I shall demand an explanation, Jenny told herself. At the right time."}, {"61b1": "“Hello, Jenny,” Uncle Tom said, bustling through the door. “Do you have a minute?” He was already twirling his watch on its chain in front of him. “Ah, no you don’t, because I have them all!” The watch popped into his waistcoat pocket."}, {"6fde": "“One day she’ll get tired of that gag,” Jenny’s mother said behind her, “and then where will you be, favourite uncle?”"}, {"7ee0": "“I’ll still be her favourite uncle,” said Tom. “They can’t take that away from me. Oh, no,” he went on in a cracked singing voice, “they caaant take that away from me!”"}, {"cb78": "“I could,” came the voice of Aunt Katie. “You just watch me.”"}, {"698b": "Jenny grabbed her chance. “Hello Auntie,” she said. “Did you enjoy Europe?”"}, {"cdad": "“Europe?” Her aunt’s face was more surprised than amused as she glanced at each of the other adults in turn. “What have you been telling the girl?”"}, {"1a76": "“They said you were working in Europe,” Jenny put in, before she could be sidelined again. “But they didn’t say where, and Europe’s a big place.”"}, {"c653": "“Yes it is,” said Aunt Katie. “And I’d tell you all about it, only my glass is empty.”"}, {"2953": "“You haven’t got a glass,” said Jenny’s father."}, {"6422": "“And whose fault is that?”"}, {"e626": "It was an incredible tale, Jenny thought as she listened. Aunt Katie was not a spy, she was almost certain. She had surely not been kidnapped and held for ransom. Her story of entrapment and escape was beyond belief. Wasn’t it?"}, {"1062": "“I poked one of them in the eyes with the chopsticks, and hit the other round the head with the tyre iron,” her aunt was saying. “So he was down, but the first chased me round the room in a rage, until he fell over an artificial plant that I kicked out of the fireplace. That settled him. I tied them up together, there wasn’t much lying around I could use for that, I had to use a roll of clingfilm. I considered putting it all over their faces too, but I didn’t want to suffocate them, just cover their mouths so that they couldn’t raise an alarm too quickly.”"}, {"3c53": "“The chemicals in clingfilm would kill them if you left it there long enough,” Jenny’s father said, topping up his sister’s wine."}, {"ba51": "“That’s true,” Aunt Katie agreed, “and this wasn’t even modern stuff, it was an old box of Saran Wrap, genuine American. God knows where they got it from in that neck of the woods. Is it even called that in the States any more? I doubt it. Anyway, I picked up my purse, which they had conveniently not yet ransacked, borrowed one of their bicycles to race down to the railway station, then caught the train to the airport and the first plane home.” She laughed. “With all the money.”"}, {"ed0a": "“A hostage’s fortune,” said Jenny’s father. He too had a smirk that Jenny could not interpret. “Hm. I think we deserve another bottle.”"}, {"4240": "“Indeed,” said his sister. “Oh — ” She reached into the large Duty Free bag that had been ostentatiously parked beside her throughout the narrative, and pulled out a teddy-bear. “Present for you,” she said, handing it to Jenny. “Sorry it couldn’t be here for your birthday, but by the calendar they use where I was, that’s not until tomorrow. And I’ll tell you something else,” Aunt Katie added, addressing the grownups, “I am never going there again.”"}, {"4be3": "“Never say ngurlignnnk,” Uncle Tom grinned."}, {"c9b7": "The celebration in the other room was becoming raucous. They are not going to tell me anything, Jenny told herself again. They never do. I might just as well try to solve word-puzzles as the ones they make up. At least with these I know there’s an answer. Although... She frowned at the puzzle-book. Change tree to logs in four moves. Most of these were easy, but not this one. Trés?"}, {"76ab": "“Having trouble?” asked Uncle Tom, picking up the book without waiting for an answer. “Tree to logs in four moves, ah… yes. Do you know what it is?”"}, {"d842": "“I thought it might be French,” Jenny said."}, {"20c0": "“Could be if you want,” her uncle said, “but you can do it in English. Shall I tell you?”"}, {"ec8b": "Jenny nodded. Obviously, over a thing that didn’t matter a whit, he was going to tell her."}, {"fe70": "Her uncle counted the steps off on his fingers. “Tree — chainsaw — hospital — call a wood merchant — logs.” His eyes had the old twinkle again."}, {"65ab": "“Uncle!” Jenny snapped, finally exasperated with her entire extended family. “Is anyone ever going to explain anything without having to make a joke of it?”"}, {"997e": "Uncle Tom grinned at her. “Not on my watch.”"}, {"4f2f": "*Previous chapters:"}], "child": "1291_1\t1291_2\t1291_3\t1291_41291_1\t1291_2\t1291_3\t1291_41291_1\t1291_2\t1291_3\t1291_41291_1\t1291_2\t1291_3\t1291_4"}