{"name": "1293", "parent": "", "content": "Gender Neutral Pronoun Consistency — Is This Still a Thing? We’re taking a stand on this controversial grammar issue! How many times have you written a sentence using a gender-neutral antecedent (the word a pronoun replaces) and stumbled? Which pronoun do you use — he or she? The Traditional Solution Until relatively recently, English grammarians asserted you use he as the gender-neutral pronoun with any antecedent. For example, if you use a non-gender-specific noun like “scientist,” “judge,” “astronaut,” or “engineer,” you use he as the accompanying pronoun in your sentence. Consider the following: Not to mention those nouns that have traditionally been associated more with women: Why it’s wrong This meant that millions of little girls were being subtly conditioned to believe that these were boys’ things because of the masculine constructs. Plus, all those actual female judges, scientists, astronauts, engineers, teachers and nurses found it rather annoying being referred to as “he”. Why should the male pronoun take precedence over the female? People tried to change Then there was the awkward period when a singular antecedent was followed by the phrase he or she, him or her, or the even more awkward s/he. But this just clogged up our sentences and made them even more frustrating and irritating to read. The world is coming around In 2015, Fowler’s Dictionary of Modern English Usage finally called people out on gender-neutral pronoun consistency. Here’s the gist of their conclusion: “From the earliest times until about the 1960s it was unquestionably acceptable to use the pronoun he (and him, himself, his) with indefinite reference to denote a person of either sex, especially after indefinite pronouns and determiners such as anybody, … every, etc., after gender-neutral nouns such as person … but alternative devices are now usually resorted to. When a gender-neutral pronoun or determiner … is needed, the options usually adopted are the plural forms they, their, themselves, etc., or he or she (his or her, etc.)” So, that means these options are valid: What are other professional writers doing? Newspaper reporters, those who are heavily invested in writing compelling, concise, and engaging prose, use they and their as the pronoun for a gender-neutral antecedent. Wikipedia lists several influential newspapers like the London Sunday Times, The Guardian and US News & World Report switching to they and their to express gender neutrality. Certain style guides like The Chicago Manual of Style recommend using they and their. Others suggest a rewrite to avoid these situations altogether. For example: We think this might be the best options when it’s possible. Rewrite the sentence so that the problem goes away. You are writers, aren’t you? Rewrite. Final thoughts The Chicago Manual of Style sums up the quandary best: “Gender bias … On the one hand, it is unacceptable to a great many reasonable readers to use the generic masculine pronoun (he in reference to no one in particular). On the other hand, it is unacceptable to a great many readers (often different readers) either to resort to non-traditional gimmicks to avoid the generic masculine (by using he/she or s/he, for example) or to use they as a kind of singular pronoun. Either way, credibility is lost with some readers.” We’re going to take a stand though: And if you just can’t face it, rewrite the sentence so that the problem goes away. You are writers, aren’t you? Rewrite. Let us know your opinion in the comments below. How do you handle gender-neutral inconsistencies when writing? Please share this with all the writers in your life and hit that ♥ button to spread it around even more. Originally published at prowritingaid.com. ", "title": "Gender Neutral Pronoun Consistency — Is This Still a Thing?", "sentences": [{"0786": "Gender Neutral Pronoun Consistency — Is This Still a Thing?"}, {"3587": "We’re taking a stand on this controversial grammar issue!"}, {"401f": "How many times have you written a sentence using a gender-neutral antecedent (the word a pronoun replaces) and stumbled? Which pronoun do you use — he or she?"}, {"4538": "The Traditional Solution"}, {"bfe4": "Until relatively recently, English grammarians asserted you use he as the gender-neutral pronoun with any antecedent."}, {"566a": "For example, if you use a non-gender-specific noun like “scientist,” “judge,” “astronaut,” or “engineer,” you use he as the accompanying pronoun in your sentence. Consider the following:"}, {"afe4": "Not to mention those nouns that have traditionally been associated more with women:"}, {"5056": "Why it’s wrong"}, {"a317": "This meant that millions of little girls were being subtly conditioned to believe that these were boys’ things because of the masculine constructs."}, {"a025": "Plus, all those actual female judges, scientists, astronauts, engineers, teachers and nurses found it rather annoying being referred to as “he”. Why should the male pronoun take precedence over the female?"}, {"f80a": "People tried to change"}, {"f096": "Then there was the awkward period when a singular antecedent was followed by the phrase he or she, him or her, or the even more awkward s/he."}, {"264a": "But this just clogged up our sentences and made them even more frustrating and irritating to read."}, {"ba50": "The world is coming around"}, {"d83d": "In 2015, Fowler’s Dictionary of Modern English Usage finally called people out on gender-neutral pronoun consistency. Here’s the gist of their conclusion:"}, {"3d9d": "“From the earliest times until about the 1960s it was unquestionably acceptable to use the pronoun he (and him, himself, his) with indefinite reference to denote a person of either sex, especially after indefinite pronouns and determiners such as anybody, … every, etc., after gender-neutral nouns such as person … but alternative devices are now usually resorted to. When a gender-neutral pronoun or determiner … is needed, the options usually adopted are the plural forms they, their, themselves, etc., or he or she (his or her, etc.)”"}, {"cb18": "So, that means these options are valid:"}, {"b98d": "What are other professional writers doing?"}, {"0e30": "Newspaper reporters, those who are heavily invested in writing compelling, concise, and engaging prose, use they and their as the pronoun for a gender-neutral antecedent. Wikipedia lists several influential newspapers like the London Sunday Times, The Guardian and US News & World Report switching to they and their to express gender neutrality."}, {"1d82": "Certain style guides like The Chicago Manual of Style recommend using they and their."}, {"c937": "Others suggest a rewrite to avoid these situations altogether. For example:"}, {"bbcd": "We think this might be the best options when it’s possible. Rewrite the sentence so that the problem goes away. You are writers, aren’t you? Rewrite."}, {"778c": "Final thoughts"}, {"bafb": "The Chicago Manual of Style sums up the quandary best:"}, {"0c53": "“Gender bias … On the one hand, it is unacceptable to a great many reasonable readers to use the generic masculine pronoun (he in reference to no one in particular). On the other hand, it is unacceptable to a great many readers (often different readers) either to resort to non-traditional gimmicks to avoid the generic masculine (by using he/she or s/he, for example) or to use they as a kind of singular pronoun. Either way, credibility is lost with some readers.”"}, {"59f6": "We’re going to take a stand though:"}, {"4122": "And if you just can’t face it, rewrite the sentence so that the problem goes away. You are writers, aren’t you? Rewrite."}, {"58e0": "Let us know your opinion in the comments below. How do you handle gender-neutral inconsistencies when writing?"}, {"4474": "Please share this with all the writers in your life and hit that ♥ button to spread it around even more."}, {"c212": "Originally published at prowritingaid.com."}], "child": "1293_1\t1293_2\t1293_3\t1293_4\t1293_5\t1293_6\t1293_7\t1293_8\t1293_9\t1293_10"}