{"name": "1294", "parent": "", "content": "Hitting a wall and burning out? The Scratchpad №20 There will be rough days. Ones that beg you not to turn to your work. There will be patches of time when you hit a wall. Extended moments where you feel spent and washed up. There will be delays in inspiration. As if nothing brilliant will ever come to you again. That will be it. The end of the road. Time to hang it up. Unless it’s not. You could choose to take the long way around. A detour is sometimes the best answer to tapping back into your creative spark. Getting away from the work at hand and leaving it be. It could be a day. It could be the better part of a year. Either is okay and there’s a time for both. The important part — and this can’t be missed — is setting a time to return to the table. A predetermined time to get back to it. Renewed, refreshed and ready to wrestle with the work you were sent to do. Failing to do so could mean getting too distracted and the unmotivated to ever return to your deep work. Burnout is real. Unless you are a superhero or some freak of creative nature the solution isn’t muscling through the mountain. So, take a break and enjoy the view on the long way around. Just don’t forget to set an alarm to bring you back. Editor’s Picks The Dandelion SowerThe owner of the duplex hates dandelions. He considers them a blasted nuisance, spreading all over his precious lawn…thecreative.cafe The Dandelion Sower This is a beautiful tiny tale from Louis Hart that paints the world into two distinct groups of people. I know which I want to be, yet fear some days I fall into the other category. How about you? The Unimportance of Being EarnestA Short Storythecreative.cafe The Unimportance of Being Earnest Wonderfully crafted. JD shows us both sides leading up to a love story — each as neurotic, self doubting and utterly human as the other. If nothing else, a pleasant reminder that everyone else questions themselves as much as I do. Jumping outThe kid turned 12. We sold the apartment in NY. And my dad kept jumping out of my purse. I intended to navigate this…thecreative.cafe Jumping Out I connect with this story on more than one level and love this quote from Katie Mitchell.. “Back when I should have been developing my pas de deux, I was busy snorting lines of Shakespeare and skydiving into Tennessee Williams. If only I’d been born under a lavender light. Instead, I was born a real girl who has to keep running to catch her train.” A Break-up LetterDear Fear,thecreative.cafe A Breakup Letter If you read 250 words today, this should be them. Lynne McLean Brown gives us a brief breakup letter with that pesky friend of ours…fear. More Brilliant Stories I’m not “good enough”.And I’m terrified that this might be the truth.thecreative.cafe I’m not “good enough” by Tiffany Yeung The HuntressA woman’s mouth is often bespoken as a bow,thecreative.cafe The Huntress by Ryan Wheeler High voltageWe interrupt this broadcast to narrowit downto that current that courses through your veins with the joltof a…thecreative.cafe High Voltage by Tyrone Graham Rebel MechanicI could smell engine oil when Darth Vader threw the Emperor down the pit.thecreative.cafe Rebel Mechanic by Steve Campbell A Journey from XS to MediumIf stepping into thirties was not traumatic in itself, it came with an extra shocker for me.thecreative.cafe A Journey from XS to Medium by Surabhi Gupta Don’t forget that I’m looking to add an editor to The Creative Cafe. If that interests you, email hi@thecreative.cafe for some of the details. That’s all for this week. The stories from the latest creative challenge will be posted next week along with a new prompt. Until then, I deeply hope the best for you and your week. Keep creating (or take that break if you need it),Jake ", "title": "Hitting a wall and burning out?", "sentences": [{"3dcc": "Hitting a wall and burning out?"}, {"82c7": "The Scratchpad №20"}, {"fe6d": "There will be rough days. Ones that beg you not to turn to your work."}, {"3942": "There will be patches of time when you hit a wall. Extended moments where you feel spent and washed up."}, {"3f12": "There will be delays in inspiration. As if nothing brilliant will ever come to you again."}, {"cdac": "That will be it. The end of the road. Time to hang it up."}, {"acc6": "Unless it’s not."}, {"374d": "You could choose to take the long way around. A detour is sometimes the best answer to tapping back into your creative spark. Getting away from the work at hand and leaving it be. It could be a day. It could be the better part of a year. Either is okay and there’s a time for both."}, {"3743": "The important part — and this can’t be missed — is setting a time to return to the table. A predetermined time to get back to it. Renewed, refreshed and ready to wrestle with the work you were sent to do. Failing to do so could mean getting too distracted and the unmotivated to ever return to your deep work."}, {"e842": "Burnout is real. Unless you are a superhero or some freak of creative nature the solution isn’t muscling through the mountain."}, {"26e4": "So, take a break and enjoy the view on the long way around. Just don’t forget to set an alarm to bring you back."}, {"ac33": "Editor’s Picks"}, {"9565": "The Dandelion SowerThe owner of the duplex hates dandelions. He considers them a blasted nuisance, spreading all over his precious lawn…thecreative.cafe"}, {"63f3": "The Dandelion Sower"}, {"a418": "This is a beautiful tiny tale from Louis Hart that paints the world into two distinct groups of people. I know which I want to be, yet fear some days I fall into the other category. How about you?"}, {"e9f0": "The Unimportance of Being EarnestA Short Storythecreative.cafe"}, {"503e": "The Unimportance of Being Earnest"}, {"e32c": "Wonderfully crafted. JD shows us both sides leading up to a love story — each as neurotic, self doubting and utterly human as the other. If nothing else, a pleasant reminder that everyone else questions themselves as much as I do."}, {"712a": "Jumping outThe kid turned 12. We sold the apartment in NY. And my dad kept jumping out of my purse. I intended to navigate this…thecreative.cafe"}, {"9239": "Jumping Out"}, {"c18e": "I connect with this story on more than one level and love this quote from Katie Mitchell.."}, {"6e80": "“Back when I should have been developing my pas de deux, I was busy snorting lines of Shakespeare and skydiving into Tennessee Williams. If only I’d been born under a lavender light. Instead, I was born a real girl who has to keep running to catch her train.”"}, {"9f13": "A Break-up LetterDear Fear,thecreative.cafe"}, {"0780": "A Breakup Letter"}, {"5e71": "If you read 250 words today, this should be them. Lynne McLean Brown gives us a brief breakup letter with that pesky friend of ours…fear."}, {"a6ad": "More Brilliant Stories"}, {"5715": "I’m not “good enough”.And I’m terrified that this might be the truth.thecreative.cafe"}, {"d0c0": "I’m not “good enough” by Tiffany Yeung"}, {"0f25": "The HuntressA woman’s mouth is often bespoken as a bow,thecreative.cafe"}, {"79c7": "The Huntress by Ryan Wheeler"}, {"ebb6": "High voltageWe interrupt this broadcast to narrowit downto that current that courses through your veins with the joltof a…thecreative.cafe"}, {"4e1a": "High Voltage by Tyrone Graham"}, {"d8d5": "Rebel MechanicI could smell engine oil when Darth Vader threw the Emperor down the pit.thecreative.cafe"}, {"d7e0": "Rebel Mechanic by Steve Campbell"}, {"04da": "A Journey from XS to MediumIf stepping into thirties was not traumatic in itself, it came with an extra shocker for me.thecreative.cafe"}, {"f074": "A Journey from XS to Medium by Surabhi Gupta"}, {"f6a7": "Don’t forget that I’m looking to add an editor to The Creative Cafe. If that interests you, email hi@thecreative.cafe for some of the details."}, {"a4bf": "That’s all for this week. The stories from the latest creative challenge will be posted next week along with a new prompt."}, {"7bf9": "Until then, I deeply hope the best for you and your week."}, {"514b": "Keep creating (or take that break if you need it),Jake"}], "child": "1294_1\t1294_2\t1294_3\t1294_41294_1\t1294_2\t1294_3\t1294_41294_1\t1294_2\t1294_3\t1294_4"}