{"name": "1295", "parent": "", "content": "Write Everything Writing on limited time. When you squeeze your writing into 15 minutes a day, 45 minutes on the weekend if you are lucky, you become very careful with what you write about. All the fluttering ideas and anecdotes that might humor you get shoved to the side. The ideas that aggravate you and have no solution get tossed. You consider your topics carefully, thinking them through as you unload the dishwasher, put away the folded laundry, mop the kitchen or tweeze a hair from your chin. You write in your head. You edit in your head. You prepare everything so that finally when you sit down to write, it is already there waiting to be typed. Each post or story has to have a purpose and that purpose has to be clear from the first word. There is no time for stream of thought, no time to chase a frivolous detail just for the fun of it. The writing is intense, purposeful and direct. And then you are done. Twelve minutes in and the commotion starts. The dog is barking. The phone rings. A child is intruding your space to announce that the internet is slow. Such problems these children have! And like children do, they blame you. “The internet is slow. I can’t play my game! Why do you always get the best internet!” “I don’t get the best internet, we all get the same internet.” “But yours is never slow!” “How do you know that? It might be slow and I just don’t go storming around to complain. I sit and wait for it to speed up.” “I never see you have to wait, you’re always working. You don’t have to wait.” “Maybe so,” I say, hating those words that they toss to me all the time. They are a matter of fact but they hurt, like a reminder of all my shortcomings. I am always working, always working and always behind. Never enough money, never enough time, never enough fun, never enough internet. “We use the internet differently.” I say. “You are on the internet superhighway with your games and videos. I’m on an internet country road. I stroll along writing then posting, then refreshing. No graphics, no action. I need less internet than you do.” I was speaking to myself. I was indulging in a little metaphor about my country road internet and feeling quite proud of my little creative moment. He was looking at me and thinking many thoughts he didn’t share, probably about how his mother always does this. Always tells these ridiculous things that don’t answer the question, that don’t make it better, that don’t fix the internet. He goes to the kitchen to eat Triskets and a peach that were put there from my “always working.” I go back to steal four or five more minutes of writing. But where was I? The interruption stole the momentum and time is up. I will have to finish in my next fifteen minute allowance tomorrow. But this week is different. I have a week with nothing at all to do but survive and write. I’ve arranged over many weeks to have my life managed by others for a week so I can disappear into a cute little bungalow house in an undisclosed location where no one can find me so that I might find myself and find my words and write. Okay, so I have a few errands to complete but that doesn’t sound romantic. It is romantic and exciting to think that all I have to do for a week is write, feed myself and not die. Which is, for the most part, all I really have to do. I could neglect the chores and the world wouldn’t stop. Everything else in my life is being taken care of by other people and all I have to do is take care of me. My coworkers are covering my workload. My mother is caring for my children, getting them to school, feeding them, reading them books, discussing the speed of the internet. My house and yard are cared for. My dog is cared for. All I have to do is care for myself, which honestly, after so much neglect for so many years is about the easiest thing to do. I need so little that I’m overwhelmed at even the thought having time to think about me. And besides me who I could go on ignoring if I choose, I’m here to write. I’m here to write everything. I’m going to write my little anecdotes and thoughts on my internet country road. I’m going to write my dumbest of jokes, my loftiest of ideas, my most trembling of fears (maybe, it sounds good to say that but I’m not sure I’ll really want to dig that deep ya know…). I’m going to write about my genius idea this morning upon waking without an alarm with nothing calling me in a hurry that I should sleep tonight with my head at the foot of the bed. Why, when we change our habits do we do things like schedule in an hour for exercise or meditation. We find things to fill and structure our time as if we need to calk the holes in our lives to make us strong again. But really what might heal us is more space, more head space. And if we need head space, why do we sleep with our head toward the wall, toward a barrier when we could sleep with our heads in the middle of the room, at the foot of the bed with the whole room open to our dreaming potential. It sounds as genius as it is crazy. So I will do it. I will do every crazy genius thing I can this week because for once, I am not fighting time, I am riding it. I have quiet and solitude and not a single concern to distract me from writing everything. Kitten Holiday is a writer, lover and free thinker based in North Carolina. She writes essays, humor, fiction and opinion on her blog Kitten Holiday. Kitten is famous in small circles, widely read by a couple of people and a total bad ass when time allows. Find out more about Kitten here and here and here and here. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "title": "Write Everything", "sentences": [{"1269": "Write Everything"}, {"136d": "Writing on limited time."}, {"0c96": "When you squeeze your writing into 15 minutes a day, 45 minutes on the weekend if you are lucky, you become very careful with what you write about. All the fluttering ideas and anecdotes that might humor you get shoved to the side. The ideas that aggravate you and have no solution get tossed. You consider your topics carefully, thinking them through as you unload the dishwasher, put away the folded laundry, mop the kitchen or tweeze a hair from your chin. You write in your head. You edit in your head. You prepare everything so that finally when you sit down to write, it is already there waiting to be typed."}, {"a384": "Each post or story has to have a purpose and that purpose has to be clear from the first word. There is no time for stream of thought, no time to chase a frivolous detail just for the fun of it. The writing is intense, purposeful and direct. And then you are done. Twelve minutes in and the commotion starts. The dog is barking. The phone rings. A child is intruding your space to announce that the internet is slow. Such problems these children have! And like children do, they blame you. “The internet is slow. I can’t play my game! Why do you always get the best internet!”"}, {"d4b9": "“I don’t get the best internet, we all get the same internet.”"}, {"7fc4": "“But yours is never slow!”"}, {"81cf": "“How do you know that? It might be slow and I just don’t go storming around to complain. I sit and wait for it to speed up.”"}, {"5f1c": "“I never see you have to wait, you’re always working. You don’t have to wait.”"}, {"0606": "“Maybe so,” I say, hating those words that they toss to me all the time. They are a matter of fact but they hurt, like a reminder of all my shortcomings. I am always working, always working and always behind. Never enough money, never enough time, never enough fun, never enough internet. “We use the internet differently.” I say. “You are on the internet superhighway with your games and videos. I’m on an internet country road. I stroll along writing then posting, then refreshing. No graphics, no action. I need less internet than you do.”"}, {"6b85": "I was speaking to myself. I was indulging in a little metaphor about my country road internet and feeling quite proud of my little creative moment. He was looking at me and thinking many thoughts he didn’t share, probably about how his mother always does this. Always tells these ridiculous things that don’t answer the question, that don’t make it better, that don’t fix the internet."}, {"3f9f": "He goes to the kitchen to eat Triskets and a peach that were put there from my “always working.” I go back to steal four or five more minutes of writing. But where was I? The interruption stole the momentum and time is up. I will have to finish in my next fifteen minute allowance tomorrow."}, {"a026": "But this week is different. I have a week with nothing at all to do but survive and write. I’ve arranged over many weeks to have my life managed by others for a week so I can disappear into a cute little bungalow house in an undisclosed location where no one can find me so that I might find myself and find my words and write."}, {"9084": "Okay, so I have a few errands to complete but that doesn’t sound romantic. It is romantic and exciting to think that all I have to do for a week is write, feed myself and not die. Which is, for the most part, all I really have to do. I could neglect the chores and the world wouldn’t stop. Everything else in my life is being taken care of by other people and all I have to do is take care of me."}, {"f9dd": "My coworkers are covering my workload. My mother is caring for my children, getting them to school, feeding them, reading them books, discussing the speed of the internet. My house and yard are cared for. My dog is cared for. All I have to do is care for myself, which honestly, after so much neglect for so many years is about the easiest thing to do. I need so little that I’m overwhelmed at even the thought having time to think about me. And besides me who I could go on ignoring if I choose, I’m here to write. I’m here to write everything."}, {"999f": "I’m going to write my little anecdotes and thoughts on my internet country road. I’m going to write my dumbest of jokes, my loftiest of ideas, my most trembling of fears (maybe, it sounds good to say that but I’m not sure I’ll really want to dig that deep ya know…)."}, {"1ebd": "I’m going to write about my genius idea this morning upon waking without an alarm with nothing calling me in a hurry that I should sleep tonight with my head at the foot of the bed. Why, when we change our habits do we do things like schedule in an hour for exercise or meditation. We find things to fill and structure our time as if we need to calk the holes in our lives to make us strong again. But really what might heal us is more space, more head space. And if we need head space, why do we sleep with our head toward the wall, toward a barrier when we could sleep with our heads in the middle of the room, at the foot of the bed with the whole room open to our dreaming potential. It sounds as genius as it is crazy. So I will do it."}, {"251a": "I will do every crazy genius thing I can this week because for once, I am not fighting time, I am riding it. I have quiet and solitude and not a single concern to distract me from writing everything."}, {"0c36": "Kitten Holiday is a writer, lover and free thinker based in North Carolina. She writes essays, humor, fiction and opinion on her blog Kitten Holiday. Kitten is famous in small circles, widely read by a couple of people and a total bad ass when time allows."}, {"e763": "Find out more about Kitten here and here and here and here."}, {"172b": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}], "child": "1295_1\t1295_2\t1295_3\t1295_41295_1\t1295_2\t1295_3\t1295_4"}