{"name": "130", "parent": "", "content": "The Padres Are Reinventing Losing GM A.J. Preller’s unprecedented 2017 roster is as unabashed a tanking declaration as we’ve seen from any recent rebuilder We’ve got to give the Padres this: They tried not to tank, perhaps harder than they should have. The team’s GM search in summer 2014 led to two finalists, then–Yankees executive Billy Eppler and then–Rangers executive A.J. Preller. The Padres could have hired Eppler, the San Diego native who espoused a conservative approach for what looked likely to be a sub-.500 team. The Eppler Padres probably would have operated not unlike the Eppler Angels have, building up the farm system, signing free agents to short-term deals, and either selling them or supplementing them depending on the vagaries of the uncertain season. Instead, Padres co-owner and executive chairman Ron Fowler hired Preller, who hoped to compete in the short term. Preller, whose expertise lay in scouting, devoted himself to trading prospects for established, if fading, stars, including Matt Kemp, Justin and Melvin Upton, and Craig Kimbrel. Preller’s plan was exciting and pushed the Padres closer to the spotlight than they’d been in several seasons, but a confluence of down years, homer-prone pitchers, and a roster that still had huge holes left the Padres worse off than they’d been before restocking. Not only were they stuck with 70-something wins for the fifth consecutive season in 2015, but their payroll was higher and their farm system was sunk. A 68-win season followed last year. By the grace of Dave Dombrowski and an $80-plus million investment in international and amateur talent, the Padres have restored their system to the point that it once again ranks in the top 10 in baseball, according to Baseball America, as it did before Preller’s early acquisitions plunged it. Since 2014, the Padres’ annual farm system ranking — which has gone from sixth to 14th to 25th and now back to ninth — has shifted by a major-league leading 35 places, reflecting Preller’s yo-yoing priorities. Save for satisfactory (but pricey) pickup Wil Myers, whom San Diego extended in January, the only relic of Preller’s 2014–15 transaction spree is the $31.5 million — nearly half of the Padres’ Opening Day payroll this year — that it will pay players who are no longer on the team. Essentially, the Padres are back where they were when Preller was hired, with two lost seasons and a lot of dead dollars to show for his attempt to take a shortcut. This time, they’re trying to follow the same slow path to the playoffs that paid off for the Astros and Cubs, punting in the short term at the major league level while stockpiling prospects. The Padres have five prospects in MLB.com’s top 100 and three in the top 40, led by Manuel Margot, the centerpiece of the (second) Kimbrel trade, who’s holding down center at Petco and off to an excellent start. The price of those prospects — and the legion of promising, lower-level players behind them — is that the Padres entered this season projected to be the worst team in baseball. Thus far, they’ve been outscored by 10 runs, although they’re running a 5–5 record. We know the way this works. We saw Houston lose 324 games in the span of three seasons, and the Cubs bottomed out at 61 wins. There’s no reason to think that the Padres’ rough patch will be worse than those two teams’, or that they won’t come out the other side stronger than they were before their rebuild began. But in one way, at least, the Padres are pioneering a new short-term tanking method, one that even Jeff Luhnow and Theo Epstein never tried. The Astros and Cubs were abysmal, but their players mostly had histories befitting big leaguers (albeit bad ones). The Padres, meanwhile, devoted 12 percent of their Opening Day roster to low-level minor leaguers whose uniforms and major-league-minimum salaries are all that separates them from A-ball. Meet Miguel Díaz, Allen Córdoba, and Luis Torrens, the Padres’ latest Rule 5 finds. Last Opening Day, the Padres carried Luis Perdomo and Jabari Blash, both products of the Rule 5 draft, an annual sweepstakes that allows teams to pluck away players whom their old organizations have left unprotected after four or five years on the farm. To keep their Rule 5 additions, the selecting team has to stash them on the major league roster all season; otherwise, they’re obligated to offer them back to their former team. The Padres kept Perdomo in the big leagues for all of last year, and they demoted but retained the rights to Blash when the Mariners declined to reclaim him. It’s not unheard of for a team to carry multiple Rule 5 guys; the 2003 Tigers carried three, although that 43–119 team — five wins worse than replacement level! — isn’t one any other team should be trying to emulate. But most Rule 5 picks have had relatively close brushes with the big leagues. Blash had reached Triple-A with his old organization, Seattle, while Perdomo had appeared at high-A in consecutive seasons with St. Louis. Díaz, Torrens, and Córdoba had topped out at A-ball, A-ball, and the rookie-class Appalachian League, respectively. By breaking camp with the big club, all three have skipped four or five levels. As one would imagine, it’s rare for a player to make his major league debut without having previously played above A-ball or in a high-level international league such as the NPB, the KBO, or Cuba’s Serie Nacional. In the 37 full seasons since 1980, 27 such players have debuted in the majors in April, according to some sifting of Baseball Prospectus data. No other team in that time has had more than one. During the “bonus baby” years of the 1940s, ’50s, and ’60s, some teams would carry a couple of players with no minor league track records, but what the Padres are doing may be unprecedented since the dark ages of baseball, before Branch Rickey brought farm teams into vogue. Despite the difficulty of vaulting almost directly to the majors, some fantastic careers have started this way. The list of 27 includes Johan Santana, Matt Williams, and Joakim Soria, among other players who went on to have lengthy stays in the majors. But even most of the long-term success stories were short-term failures: Santana, who’d previously peaked in A-ball, posted a 6.49 ERA with a 1.19 strikeout-to-walk ratio in his rookie season with the Twins, while Williams hit .188/.240/.339 in 84 games with the Giants. Collectively, the 27 minor leaguers masquerading as major leaguers averaged exactly 0.0 WAR in their first (and in some cases, last) tastes of the majors, with only Soria and Héctor Carrasco worth a win or more. Their origin stories range from Rule 5ers to prospects who were rushed for the wrong reasons. The Giants promoted Williams the year after drafting him third overall because they were “beset by injuries and infatuated with [his] potential.” The resulting struggles nearly drove Williams away from the game. How to Lose a Baseball Season in 10 DaysThe Blue Jays are 1–6, and the Diamondbacks are 7–2. Is it too early to panic or plan for the playoffs?theringer.com Having even one of these players is usually a sign that a team isn’t close to contention, because a club that’s fighting for every win can’t afford to hamstring itself with a player whose value lies in the future. Taken together, the teams in this time frame that started the season with a Rule 5 player who fit these qualifications recorded a .471 winning percentage. For the Padres to carry three is as unabashed a declaration of not intending to win as we’ve seen from any of the recent rebuilders. None of the three lucky lottery winners is a big-time prospect; Rule 5 draftees generally aren’t, because blue-chippers don’t last long without making a 40-man roster and thereby becoming ineligible for selection. Córdoba, a 21-year-old defense-first shortstop, is the only one ranked in the team’s top 30 this spring by Baseball America. Even he barely made it, ranking 29th, with a writeup that noted that he’s “nowhere near ready for the majors.” Torrens, 20, is a catcher — the Padres’ fourth catcher on the Opening Day squad, if you count pitcher-catcher-outfielder Christian Bethancourt. Last year Torrens hit .230/.348/.317 in 40 games in the South Atlantic League, roughly equivalent to .188/.287/.250 in the majors, according to Baseball Prospectus cofounder Clay Davenport’s statistical translations. Díaz, 22, is the best bet to contribute this season; a part-time starter in A-ball, he could be better in short bursts, even if his some of his opponents literally tear the cover off the ball. None of the three looks like the next Santana, but all the Padres have to lose is games that no one was expecting them to win. From the Padres’ perspective, the worst that can happen is that the three players struggle and get returned to their former teams. Of course, the premature promotions could hinder their development, but in any other scenario, they wouldn’t be Padres property — and odds are they would never have made the majors if they’d stayed with their old teams. Thus far, in limited playing time, they haven’t made Preller look too terrible, much as rival executives whom he’s rubbed the wrong way might wish they would: Córdoba is 2-for-6, Torrens is 0-for-4 with a walk, and Díaz has allowed one run in 4.1 innings while flashing a fastball that’s touched 98. “They all seem pretty composed for being so inexperienced,” says Dennis Lin, Padres beat writer for the San Diego Union-Tribune, via direct message. “Having more than one Rule 5 and a roadmap in Perdomo seems to have helped. There are also lots of Latin players around, which doesn’t hurt.” On a different type of team, the presence of three glorified low-level minor leaguers would rankle more experienced players. Then again, a different type of team wouldn’t carry three glorified low-level minor leaguers. “I’ve heard about a little grumbling about the roster construction from guys who might’ve been squeezed out, but nothing major,” Lin says. The Padres have the youngest hitters in baseball, so the three ultra-inexperienced rookies almost fit in. Even without considering a starting rotation composed of other clubs’ cast-offs, whose most accomplished member, Jered Weaver, throws a fastball that averages 84, the Padres are playing with three roster spots tied behind their backs. For now, their record isn’t embarrassing, but by carrying so many unqualified players, they’re in position to tank like no team has tanked before. Preller is nothing if not bold, whether he’s trying to win in the present or openly looking long term. Thanks to Rob McQuown of Baseball Prospectus for research assistance. ", "title": "The Padres Are Reinventing Losing", "sentences": [{"9d4f": "The Padres Are Reinventing Losing"}, {"809f": "GM A.J. Preller’s unprecedented 2017 roster is as unabashed a tanking declaration as we’ve seen from any recent rebuilder"}, {"7269": "We’ve got to give the Padres this: They tried not to tank, perhaps harder than they should have. The team’s GM search in summer 2014 led to two finalists, then–Yankees executive Billy Eppler and then–Rangers executive A.J. Preller. The Padres could have hired Eppler, the San Diego native who espoused a conservative approach for what looked likely to be a sub-.500 team. The Eppler Padres probably would have operated not unlike the Eppler Angels have, building up the farm system, signing free agents to short-term deals, and either selling them or supplementing them depending on the vagaries of the uncertain season."}, {"e48b": "Instead, Padres co-owner and executive chairman Ron Fowler hired Preller, who hoped to compete in the short term. Preller, whose expertise lay in scouting, devoted himself to trading prospects for established, if fading, stars, including Matt Kemp, Justin and Melvin Upton, and Craig Kimbrel. Preller’s plan was exciting and pushed the Padres closer to the spotlight than they’d been in several seasons, but a confluence of down years, homer-prone pitchers, and a roster that still had huge holes left the Padres worse off than they’d been before restocking. Not only were they stuck with 70-something wins for the fifth consecutive season in 2015, but their payroll was higher and their farm system was sunk. A 68-win season followed last year."}, {"8086": "By the grace of Dave Dombrowski and an $80-plus million investment in international and amateur talent, the Padres have restored their system to the point that it once again ranks in the top 10 in baseball, according to Baseball America, as it did before Preller’s early acquisitions plunged it. Since 2014, the Padres’ annual farm system ranking — which has gone from sixth to 14th to 25th and now back to ninth — has shifted by a major-league leading 35 places, reflecting Preller’s yo-yoing priorities."}, {"b33d": "Save for satisfactory (but pricey) pickup Wil Myers, whom San Diego extended in January, the only relic of Preller’s 2014–15 transaction spree is the $31.5 million — nearly half of the Padres’ Opening Day payroll this year — that it will pay players who are no longer on the team. Essentially, the Padres are back where they were when Preller was hired, with two lost seasons and a lot of dead dollars to show for his attempt to take a shortcut."}, {"0f22": "This time, they’re trying to follow the same slow path to the playoffs that paid off for the Astros and Cubs, punting in the short term at the major league level while stockpiling prospects. The Padres have five prospects in MLB.com’s top 100 and three in the top 40, led by Manuel Margot, the centerpiece of the (second) Kimbrel trade, who’s holding down center at Petco and off to an excellent start. The price of those prospects — and the legion of promising, lower-level players behind them — is that the Padres entered this season projected to be the worst team in baseball. Thus far, they’ve been outscored by 10 runs, although they’re running a 5–5 record."}, {"d57e": "We know the way this works. We saw Houston lose 324 games in the span of three seasons, and the Cubs bottomed out at 61 wins. There’s no reason to think that the Padres’ rough patch will be worse than those two teams’, or that they won’t come out the other side stronger than they were before their rebuild began. But in one way, at least, the Padres are pioneering a new short-term tanking method, one that even Jeff Luhnow and Theo Epstein never tried. The Astros and Cubs were abysmal, but their players mostly had histories befitting big leaguers (albeit bad ones). The Padres, meanwhile, devoted 12 percent of their Opening Day roster to low-level minor leaguers whose uniforms and major-league-minimum salaries are all that separates them from A-ball. Meet Miguel Díaz, Allen Córdoba, and Luis Torrens, the Padres’ latest Rule 5 finds."}, {"83de": "Last Opening Day, the Padres carried Luis Perdomo and Jabari Blash, both products of the Rule 5 draft, an annual sweepstakes that allows teams to pluck away players whom their old organizations have left unprotected after four or five years on the farm. To keep their Rule 5 additions, the selecting team has to stash them on the major league roster all season; otherwise, they’re obligated to offer them back to their former team. The Padres kept Perdomo in the big leagues for all of last year, and they demoted but retained the rights to Blash when the Mariners declined to reclaim him."}, {"c9eb": "It’s not unheard of for a team to carry multiple Rule 5 guys; the 2003 Tigers carried three, although that 43–119 team — five wins worse than replacement level! — isn’t one any other team should be trying to emulate. But most Rule 5 picks have had relatively close brushes with the big leagues. Blash had reached Triple-A with his old organization, Seattle, while Perdomo had appeared at high-A in consecutive seasons with St. Louis. Díaz, Torrens, and Córdoba had topped out at A-ball, A-ball, and the rookie-class Appalachian League, respectively. By breaking camp with the big club, all three have skipped four or five levels."}, {"e10f": "As one would imagine, it’s rare for a player to make his major league debut without having previously played above A-ball or in a high-level international league such as the NPB, the KBO, or Cuba’s Serie Nacional. In the 37 full seasons since 1980, 27 such players have debuted in the majors in April, according to some sifting of Baseball Prospectus data. No other team in that time has had more than one. During the “bonus baby” years of the 1940s, ’50s, and ’60s, some teams would carry a couple of players with no minor league track records, but what the Padres are doing may be unprecedented since the dark ages of baseball, before Branch Rickey brought farm teams into vogue."}, {"dbf2": "Despite the difficulty of vaulting almost directly to the majors, some fantastic careers have started this way. The list of 27 includes Johan Santana, Matt Williams, and Joakim Soria, among other players who went on to have lengthy stays in the majors. But even most of the long-term success stories were short-term failures: Santana, who’d previously peaked in A-ball, posted a 6.49 ERA with a 1.19 strikeout-to-walk ratio in his rookie season with the Twins, while Williams hit .188/.240/.339 in 84 games with the Giants. Collectively, the 27 minor leaguers masquerading as major leaguers averaged exactly 0.0 WAR in their first (and in some cases, last) tastes of the majors, with only Soria and Héctor Carrasco worth a win or more. Their origin stories range from Rule 5ers to prospects who were rushed for the wrong reasons. The Giants promoted Williams the year after drafting him third overall because they were “beset by injuries and infatuated with [his] potential.” The resulting struggles nearly drove Williams away from the game."}, {"c9de": "How to Lose a Baseball Season in 10 DaysThe Blue Jays are 1–6, and the Diamondbacks are 7–2. Is it too early to panic or plan for the playoffs?theringer.com"}, {"d863": "Having even one of these players is usually a sign that a team isn’t close to contention, because a club that’s fighting for every win can’t afford to hamstring itself with a player whose value lies in the future. Taken together, the teams in this time frame that started the season with a Rule 5 player who fit these qualifications recorded a .471 winning percentage. For the Padres to carry three is as unabashed a declaration of not intending to win as we’ve seen from any of the recent rebuilders."}, {"4a1e": "None of the three lucky lottery winners is a big-time prospect; Rule 5 draftees generally aren’t, because blue-chippers don’t last long without making a 40-man roster and thereby becoming ineligible for selection. Córdoba, a 21-year-old defense-first shortstop, is the only one ranked in the team’s top 30 this spring by Baseball America. Even he barely made it, ranking 29th, with a writeup that noted that he’s “nowhere near ready for the majors.” Torrens, 20, is a catcher — the Padres’ fourth catcher on the Opening Day squad, if you count pitcher-catcher-outfielder Christian Bethancourt. Last year Torrens hit .230/.348/.317 in 40 games in the South Atlantic League, roughly equivalent to .188/.287/.250 in the majors, according to Baseball Prospectus cofounder Clay Davenport’s statistical translations. Díaz, 22, is the best bet to contribute this season; a part-time starter in A-ball, he could be better in short bursts, even if his some of his opponents literally tear the cover off the ball."}, {"043b": "None of the three looks like the next Santana, but all the Padres have to lose is games that no one was expecting them to win. From the Padres’ perspective, the worst that can happen is that the three players struggle and get returned to their former teams. Of course, the premature promotions could hinder their development, but in any other scenario, they wouldn’t be Padres property — and odds are they would never have made the majors if they’d stayed with their old teams. Thus far, in limited playing time, they haven’t made Preller look too terrible, much as rival executives whom he’s rubbed the wrong way might wish they would: Córdoba is 2-for-6, Torrens is 0-for-4 with a walk, and Díaz has allowed one run in 4.1 innings while flashing a fastball that’s touched 98."}, {"2195": "“They all seem pretty composed for being so inexperienced,” says Dennis Lin, Padres beat writer for the San Diego Union-Tribune, via direct message. “Having more than one Rule 5 and a roadmap in Perdomo seems to have helped. There are also lots of Latin players around, which doesn’t hurt.”"}, {"dd6e": "On a different type of team, the presence of three glorified low-level minor leaguers would rankle more experienced players. Then again, a different type of team wouldn’t carry three glorified low-level minor leaguers. “I’ve heard about a little grumbling about the roster construction from guys who might’ve been squeezed out, but nothing major,” Lin says. The Padres have the youngest hitters in baseball, so the three ultra-inexperienced rookies almost fit in."}, {"b0b8": "Even without considering a starting rotation composed of other clubs’ cast-offs, whose most accomplished member, Jered Weaver, throws a fastball that averages 84, the Padres are playing with three roster spots tied behind their backs. For now, their record isn’t embarrassing, but by carrying so many unqualified players, they’re in position to tank like no team has tanked before. Preller is nothing if not bold, whether he’s trying to win in the present or openly looking long term."}, {"9101": "Thanks to Rob McQuown of Baseball Prospectus for research assistance."}], "child": "130_1\t130_2"}