{"name": "1303", "parent": "", "content": "A rookie’s guide to raising investment If you’re an entrepreneur with a business idea, and you’re starting to think about raising money, brace yourself. Raising investment is hard for all of us. For first-timers? It’s brutal. I wish I’d known then what I know now. So I’m sharing. Hope it helps. In April 2013, I wrote my first blog on starting up. I’d quit my job at the Guardian, learned how to code, and decided to go for it. Six months later, I released Picfair’s first beta into the wild. It was the thing I’d wanted to build for years: an open-to-all image marketplace, controlled by the photographers themselves, flipping a decades-old licensing model on its head. No more middlemen agencies taking 80% of photographers’ royalties — yep, that’s what Getty & Shutterstock take from photographers, if they’re lucky. A new generation of images, fairly, finally. Within a month of the beta launch, over 10,000 images had been uploaded to Picfair, by photographers in over 30 countries. Whoa. It’d even made a few sales. It felt like there was a small chance this wasn’t a crap idea. But I was on my own; writing emails during the day, and code at night. PANICKING IN MY UNDERWEAR Time for a quick confession to early Picfair photographers. I was emailing hundreds of them back and forth at the time, for months, as “we”. “We’re working on that feature – hold tight and we’ll let you know when it’s live.” We was me. At one stage I even referred an award-winning photographer to Picfair’s imaginary “Technical Department” and “Customer Support Department” to fix an issue she was having with a buggy uploader. I set up two new email addresses and conversed between them, CCing her in so she wouldn’t think it was just me, in my flat, in my underwear, panicking. Picfair’s first team photo. This is an actual slide from my investment pitch deck. This wasn’t sustainable. I was doing five jobs at the same time — and needed someone better than me in four of them. I needed investment. At the start of this post I described the process of raising money for the first time as brutal. In retrospect, this is painfully necessary. It shouldn’t be easy – convincing strangers to give you cash is a form of natural selection for companies and founders: if the idea isn’t right, or you’re not entirely, absolutely committed …. you probably won’t raise. I promised myself that I’d write up everything I learned, but only once I had the cash. Eventually, I got it, but the process that got me there was the steepest learning curve I’ve ever encountered. This post has been sitting in my Medium drafts ever since. If you’re reading this and you’re not one of the few newbie founders I’ve shared it with over the last few years, I guess I finally got round to publishing it. So here goes. If you’re raising your first round, the following won’t guarantee you a penny, but it might just help. RAISING CASH: WHEN AND HOW You should raise when you are most likely to get the money. The first time I tried, it was way too early, and I wasted a month of my time. Raising money is a massive pain in the ass: it involves a huge amount of time and emotional expenditure – none of which is directly building your business. So try to spend as little time as possible doing it. There’s actually a cumulative hierarchy — a rough ladder of achievement you can climb in order to get into a position that will make your first fund-raise easier. You do not need to have all of the following… but the closer you are to the top of the ladder, the easier — and quicker — it will be. In reverse order: • You have an idea. So does everyone. This means absolutely nothing. • You have a big idea. Marginally better. Your idea isn’t a neighbourhood idea, it’s a global idea. Your ceiling is high enough for an investor to imagine a big return, and you’re ambitious. Again though, see above: this still means nothing, just slightly less of a nothing. • You have a big idea, in a big broken industry, and know the industry very, very well. Ok, you’re becoming vaguely viable. The chances of you having spotted an opportunity are decent. Domain expertise is very handy indeed. • You have a big idea, in a big broken industry, you know the industry well, and you have previously worked in — or formed – a startup. Ok, this means it will take a lot less time to validate your idea, as you won’t be learning on the job. Whether you succeed or fail; it’ll be quick. • You have a big idea, in a big broken industry, you know the industry well, you have previously worked in — or formed – a startup, and you have a working product. Articulating your vision with a working product is infinitely better than simply describing what you intend to build. It also shows you have already busted some ass – either by convincing someone to join your company and build it; or by putting in some of your own money; or by convincing friends or family to front you some cash. In my case, I had learned to code and built it myself. • You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, and it has traction. Now you’re talking. Your idea not only exists, but there are real people in the real world who don’t think it’s crap. If this traction is growing quickly (see YC’s 7% rule)… you’re on to something. • You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, and you have a clear route to revenue and know exactly what you want to do to get there. [This is where I was, but without the startup experience] Some might say this isn’t essential, especially in the Valley: if you build it and they come, they’ll come with money later. The UK is different. Our investors are more risk-averse (I still don’t know whether this is a good thing or a bad thing). Either way, if you can explain where your revenue will come from very, very simply, you’re in good shape. • You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, and you have actual revenue. You have the hallowed “product-market fit”. You have proved the route to revenue is real, not imaginary. There is clear potential for scale. This is looking good. • You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, you have actual revenue, and you have a team in place, ready to scale it. Shut up and take my money. HOW MUCH DO I NEED TO RAISE? Some founders will say you should raise only as much as you need to get to the next incremental milestone. Raise £10k, prove something, raise £50k, prove something else, raise £100k, prove even more …. and so on. Your mind is always sharp, as you’re always about to die. In my opinion, this is a sadomasochist’s route. As a founder, your company needs you. It probably needs two of you. If you give it half of you, because the other half is permanently chasing cash, your company will die of neglect. Cash cannot defibrillate a dead company. So buy yourself a decent runway if you can. Give yourself enough time for you and a lean team to really make a go of it. You’re almost certainly going to need to raise again in the future – so do so from a position of strength. Back then, after speaking to a number of early-stage founders, I gradually picked up the following: In most cases if you’re initially budgeting for more than a £20k monthly burn, you’re probably being too indulgent. If it’s less than £5k, you probably aren’t giving yourself enough of a shot. If your runway is three years, you’re not moving fast enough. If it’s three months, you’ll barely get going. If you’re raising your first round in the UK, you’re probably looking at something in between £100k–500k. AT WHAT VALUATION? Valuations are silly the first time round. The valuation you set for your first raise is almost certainly not what your company is worth. Not even close. And they are almost entirely environmental. A seed-stage (i.e. first round) valuation in Europe is roughly half of what it would be in New York, which is half of what it would be in the Valley. Which proves just how much of a nonsense it is. The first time you raise money, most likely your valuation will work thusly: In order to pay for the runway I want, I need £X, and I’m willing to give away Y% of the company. Bingo: you’ve just reverse-engineered your valuation. If you want £200k and you’re willing to give away 20%: your valuation is £1m. Yep: a nonsense. Whether or not you get that valuation will depend on the position you’re raising from (see above), the opportunity your company entails, and how good you are at pitching. You won’t be able to prove that the company is worth your valuation in “bricks & mortar” terms; but can you convince your investors that one day it will be worth a lot, lot more than the valuation you’re presenting them with? HOW MUCH SHOULD YOU GIVE AWAY? There are two things to avoid here. Both involve the same consideration: This will almost certainly not be your last raise. If you give away a huge percentage of your company during your first round of funding, what have you got to play with when it comes to your second? A good investor should know this – and know that the founder (or founding team) needs to own enough of the company, through multiple rounds, to stay incentivised. Conversely, if you raise a lot of money straight away, and give away very little, you’ve just earned yourself a monster valuation, which isn’t necessarily a good thing. When you come to raise again, you’ll need to justify a higher valuation — otherwise, you’re essentially saying your company has made no progress. So, again, find a sweet spot. Your valuation should be big enough for the founding team to retain a chunky percentage through a couple of rounds (including this one), and not too big that it will make your next round impossible. — BORING CAVEATS: LONG STORY SHORT: in the UK you are probably raising straight equity investment rather than a convertible note, and the valuation you have in your head is the post-money valuation … i.e. the value of the company after you’ve added the cash you want to raise. — WHICH INVESTORS SHOULD I TARGET? You’ve worked out how much you want to raise, how much you’re willing to give away, and therefore your target valuation. Now where’s the money going to come from? Before you’ve put a pitch together, you need to work out who you’re going to take it to. • Incubators & accelerators There are a number of accelerator programmes across the UK, who offer a small amount of investment, desk space, a period of mentorship from experts, and a bit of exposure. Look up Seedcamp, Wayra, TechStars, Ignite100. On the one hand, these programmes provide an educational buffer zone in between an idea and the big bad world. On the other hand, the big bag world matters, and accelerators have a relatively poor track record for success. The one exception is YC — their hit rate is phenomenal. • Angels If you are raising money for the first time in the UK, for anything up to £500k, an “angel round” is probably what you are looking for. Angels are solo, non-institutional investors. Some are former founders who have sold a company, or have experience in the tech world and can offer a lot of value (introductions, advice, publicity). But many aren’t. Over the last few years, many traditional investors (i.e. “City types”) have become understandably interested in tech investment. They have cash. You need cash. Talk to them. Either way, in the UK they are eligible for SEIS & EIS tax relief. Forget the spurious formation of “Tech City” … this is best thing this government has done for the UK’s startup scene, by a mile. SEIS: if you are raising money for the first time and are less than nine months old, the first £150,000 of your raise will be eligible for SEIS. This means that any individual who invests within this allocation will get 50% of their investment returned as tax relief. For example, an eligible investor who subscribes for £50,000 worth of shares will only be £25,000 out of pocket after their next tax return. In essence: half price shares! EIS is the same as SEIS, but for rounds larger than £150,000, and at a 30% relief rate. When you are a fledgling company with very little to show for yourself, you are a huge risk. This tax relief incentivises risk – investment is always a gamble, but this makes it a discounted gamble. • Venture Capitalists (VCs) With my three month old company and zero experience of starting a business, I went straight to the biggest VC firms in the country, and was furious when they didn’t immediately write me a huge cheque. I’m terrible at being told no, so wasted a lot of energy getting a VC firm in on Picfair’s first round. It would have been fairly unprecedented for a first-time founder, which made me want it even more. In the end, I got an offer from a venture fund, and then decided against taking their money. If you are raising money for the first time, for your first company, you probably shouldn’t delve into VC territory. They understandably want a lot of protection (preferential shares, liquidity preferences, board seats) as they have their own investors to placate, and they generally only take part in rounds north of £2m (“Series A”) that are almost always a second/third/fourth raise. When the time is right, VC cash can jet-propel your business. When the time is right. HOW TO GET TO YOUR INVESTORS Once you’ve worked out how much you want, the valuation you’re aiming for, and what kind of investors you want, now you need to get to them. First, make a list: Now for the hard bit: setting up a meeting. LinkedIn is the best resource you have. Work out how you are connected to your target within your existing network. If there is someone between the two of you, ask them for an introduction. If the intermediary can introduce you to two or more people, take them out to lunch and then ask them for the intros once you’ve paid for the meal. An intro is infinitely more powerful than a cold email. When you finally email your target, keep it short. Who are you? What are you trying to do? How far have you got (preferably, in numbers and graphs)? How much are you raising? If you’ve got a deck (see below) already, send it. That’s pretty much it. And make sure you’ve done your homework. Before I started chasing Tom Hulme (now a Google Ventures partner), I’d read his entire blog, and watched every YouTube video he’d ever featured in. Before I first emailed Alexis Ohanian, Reddit’s co-founder, I read his book. A fake Guardian home page I sent Reddit founder Alexis Ohanian before he invested in Picfair The investor will probably not get back to you. They get these emails all the time. So wait a few days and email again. Then wait a few days and email again. For one of my investors, I finally got a meeting by emailing, then emailing again, then emailing again, then DMing him on Twitter, then commenting on his Foursquare check-in. Being a relentless pain in the ass is one of the core attributes of being a business founder (just ask my colleagues), so don’t worry about being a relentless pain in the ass. Nobody has ever raised hundreds of thousands of pounds by being coquettish. YOUR PITCH You have a meeting. You have half an hour with a millionaire. If it goes well, it could change the next few years of your life. YC founder Paul Graham has written an excellent blog on raising money, but, in my opinion, he gets one thing wrong: He says you should pitch the best people first – the investor you want the most, go straight to them. While this might work for a seasoned fundraiser on their second or third raise, it does not apply to a first-time fundraiser, as I was. Know this: your first pitch will stink. It took me four or five stinky pitches until I got it right. When a question floored me, I made sure I could answer the crap out of it next time round. When I didn’t have a number to hand in one pitch, I’d have 10 ready for the next one. The core ingredient: a slide deck (on PowerPoint, Keynote or Google Presentation etc.) with as few slides as possible. It shouldn’t take more than 15 minutes to present. There are hundreds of blogs out there about what you need to include, but if you can tick off most of the following, you’ll be in good shape: Another thing I gradually learned. The people you are talking to will mostly be highly intelligent and capable of understanding multiple levels of complexity and nuance. But by God they love a bullet point. Simplify it. Then simplify it some more. Take out the 200-word paragraph and make it into a diagram. Turn the four-page market analysis into a 10-second video. Then take the thing you’ve been thinking and dreaming about for a year and could write three books about … and condense it into a sentence. For example: “Picfair is AirBnb for Images.” COMMITMENT & LEADERS Now the dance begins. Investors are herd animals — they usually don’t want to jump without having others jumping alongside them. This is understandable: co-jumpers mentally mitigate their risk. What you want is for them to “commit”. Literally, you want them to say to you “I am committed for £X.” What this means is “if you fill your round, I will give you £X at the valuation you have presented me.” To get the ball rolling, you need one big commitment, ideally from someone who is willing to “lead”. This makes them the point person, who will put together the legal documents and corral the other investors. If you are raising £300,000 and a leader emerges who is willing to commit £100,000, you’re in good shape. Even if they are not willing to “lead” — you can do this yourself – it will still set you on your way. Bur remember: you still need to fill the rest of your round. If you don’t, it’s a different proposition for the investor, and you’ll probably need to reassess your valuation. But a big commitment makes things very simple. You have a deal. Now it’s time to take it to everyone else you have in play (they’ve probably been waiting for someone else to jump first). “We’re on. Person X has committed to Y at valuation Z. Are you in or out?” LAWYER UP You have not closed your round. You have no money in your bank. Find a lawyer to represent you. I used Orrick first time round, but there are plenty of other good ones with seed deal expertise out there — Sheridans, Nabarro, Taylor Wessing. Get them to cap the cost of the deal for you — this means you have a maximum cost, and will not get endlessly billed if the deal runs and runs. First up, you need a term sheet. You can either get a lawyer to draft this for you, or, if you have a “leader”, they can provide you with a term sheet for everyone else to agree on. A term sheet contains the “top lines” of your deal — a condensed version of the slurry of legal gumph to follow. Your term sheet will outline the major elements that you need to agree with your investors — things like the options pool, liquidation preferences, pre-emption rights, drag-along, the board of directors, founder vesting. You’ve probably never heard of these things before. Handily, Passion Capital have published a beautifully gumph-free version of their term sheet here, which covers all of the above. If the term sheet you are being offered varies radically from theirs, be worried. Expect some negotiation — especially if your round includes institutional investors (but if it’s your first round, it probably shouldn’t — see above). Once you have your term sheet signed by all parties, you’re still not done yet. Now for the slurry of legal gumph I mentioned earlier — the Articles of Association, Shareholders Agreement, Subscription Agreement, and any Founder Warranties. This can run into hundreds of pages, and will probably be the most boring thing you’ll ever read. Really, though, this is just the term sheet written out in horrifying, indemnifying length. Which isn’t to say you shouldn’t read it. I wanted to understand as much as possible, so nagged my lawyer incessantly to explain things to me when I didn’t understand them. We had capped a price, so I didn’t hold back. And finally, now for the limbo. There will be a delay of at least a few weeks as your investors cross-check the gumph with their lawyers, who might come back with minor amendments. If so, this requires another round of cross-check, and so on. But you’re oh so close. Once the gumph has been signed, the only thing left to do is to wire the money. Onwards … After I saw the final chunk of cash clear into Picfair’s bank account, I slept for 17 hours. And I hadn’t even done anything yet. But I could start up, properly. Within three weeks I’d replaced myself in four out of the five roles I was doing, and Team Picfair was working out of a very cliched shared workspace in Shoreditch. [I’d also lined up some press — your first raise is a very good opportunity for legitimate publicity, squeeze it as hard as you can.] Picfair’s first *actual* team photo: me (with stupid checked shirt) and four upgrades The last two and a half years have passed in hyperspeed … all of the energy I was putting into raising money is now going into building a business, and it requires twice as much. Picfair has raised two more rounds since I first sat down to write this, and, yep, we’re raising again right now. A lot has changed. We’re now a company of 12. Our library has grown to 4.5 million algorithmically-curated images uploaded by tens of thousands of emerging photographers in 135 countries, from the slums of Nairobi to the streets of Kabul to cowboy outposts in Texas. We’ve built the chicken, and now we’re chasing the egg — gradually pushing ourselves towards publishers and businesses across the globe. And it still feels like we’re only just getting started. — — — — — This post is intended as a template for newbies. If that’s you — I hope it helps, and good luck. Of course, there are many, many different ways to raise money. If you’ve done it yourself, or if you’re an investor yourself, I’m sure there will be various things above that you disagree with. You may be right. Either way, please post in the comments. Obligatory shill: if you’re a publisher or business looking for a new generation of images from across the globe, hit me up. ", "title": "A rookie’s guide to raising investment", "sentences": [{"021a": "A rookie’s guide to raising investment"}, {"d10d": "If you’re an entrepreneur with a business idea, and you’re starting to think about raising money, brace yourself. Raising investment is hard for all of us. For first-timers? It’s brutal."}, {"26bb": "I wish I’d known then what I know now. So I’m sharing. Hope it helps."}, {"2fef": "In April 2013, I wrote my first blog on starting up. I’d quit my job at the Guardian, learned how to code, and decided to go for it. Six months later, I released Picfair’s first beta into the wild. It was the thing I’d wanted to build for years: an open-to-all image marketplace, controlled by the photographers themselves, flipping a decades-old licensing model on its head. No more middlemen agencies taking 80% of photographers’ royalties — yep, that’s what Getty & Shutterstock take from photographers, if they’re lucky. A new generation of images, fairly, finally."}, {"7118": "Within a month of the beta launch, over 10,000 images had been uploaded to Picfair, by photographers in over 30 countries. Whoa. It’d even made a few sales. It felt like there was a small chance this wasn’t a crap idea."}, {"7bd6": "But I was on my own; writing emails during the day, and code at night."}, {"d61c": "PANICKING IN MY UNDERWEAR"}, {"d2d1": "Time for a quick confession to early Picfair photographers. I was emailing hundreds of them back and forth at the time, for months, as “we”. “We’re working on that feature – hold tight and we’ll let you know when it’s live.”"}, {"ce8c": "We was me."}, {"330c": "At one stage I even referred an award-winning photographer to Picfair’s imaginary “Technical Department” and “Customer Support Department” to fix an issue she was having with a buggy uploader. I set up two new email addresses and conversed between them, CCing her in so she wouldn’t think it was just me, in my flat, in my underwear, panicking."}, {"a6e3": "Picfair’s first team photo. This is an actual slide from my investment pitch deck."}, {"7f21": "This wasn’t sustainable. I was doing five jobs at the same time — and needed someone better than me in four of them."}, {"6284": "I needed investment."}, {"eb5b": "At the start of this post I described the process of raising money for the first time as brutal. In retrospect, this is painfully necessary. It shouldn’t be easy – convincing strangers to give you cash is a form of natural selection for companies and founders: if the idea isn’t right, or you’re not entirely, absolutely committed …. you probably won’t raise."}, {"40dc": "I promised myself that I’d write up everything I learned, but only once I had the cash. Eventually, I got it, but the process that got me there was the steepest learning curve I’ve ever encountered. This post has been sitting in my Medium drafts ever since. If you’re reading this and you’re not one of the few newbie founders I’ve shared it with over the last few years, I guess I finally got round to publishing it."}, {"144e": "So here goes. If you’re raising your first round, the following won’t guarantee you a penny, but it might just help."}, {"6958": "RAISING CASH: WHEN AND HOW"}, {"f80c": "You should raise when you are most likely to get the money."}, {"76a9": "The first time I tried, it was way too early, and I wasted a month of my time. Raising money is a massive pain in the ass: it involves a huge amount of time and emotional expenditure – none of which is directly building your business. So try to spend as little time as possible doing it."}, {"80ee": "There’s actually a cumulative hierarchy — a rough ladder of achievement you can climb in order to get into a position that will make your first fund-raise easier. You do not need to have all of the following… but the closer you are to the top of the ladder, the easier — and quicker — it will be."}, {"49b6": "In reverse order:"}, {"1c17": "• You have an idea."}, {"9849": "So does everyone. This means absolutely nothing."}, {"6fdf": "• You have a big idea."}, {"d967": "Marginally better. Your idea isn’t a neighbourhood idea, it’s a global idea. Your ceiling is high enough for an investor to imagine a big return, and you’re ambitious. Again though, see above: this still means nothing, just slightly less of a nothing."}, {"dbcd": "• You have a big idea, in a big broken industry, and know the industry very, very well."}, {"6dcb": "Ok, you’re becoming vaguely viable. The chances of you having spotted an opportunity are decent. Domain expertise is very handy indeed."}, {"05a1": "• You have a big idea, in a big broken industry, you know the industry well, and you have previously worked in — or formed – a startup."}, {"8c77": "Ok, this means it will take a lot less time to validate your idea, as you won’t be learning on the job. Whether you succeed or fail; it’ll be quick."}, {"b2a0": "• You have a big idea, in a big broken industry, you know the industry well, you have previously worked in — or formed – a startup, and you have a working product."}, {"496d": "Articulating your vision with a working product is infinitely better than simply describing what you intend to build. It also shows you have already busted some ass – either by convincing someone to join your company and build it; or by putting in some of your own money; or by convincing friends or family to front you some cash. In my case, I had learned to code and built it myself."}, {"7fed": "• You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, and it has traction."}, {"1ea1": "Now you’re talking. Your idea not only exists, but there are real people in the real world who don’t think it’s crap. If this traction is growing quickly (see YC’s 7% rule)… you’re on to something."}, {"8a9b": "• You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, and you have a clear route to revenue and know exactly what you want to do to get there. [This is where I was, but without the startup experience]"}, {"e4d0": "Some might say this isn’t essential, especially in the Valley: if you build it and they come, they’ll come with money later. The UK is different. Our investors are more risk-averse (I still don’t know whether this is a good thing or a bad thing). Either way, if you can explain where your revenue will come from very, very simply, you’re in good shape."}, {"1669": "• You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, and you have actual revenue."}, {"f6c8": "You have the hallowed “product-market fit”. You have proved the route to revenue is real, not imaginary. There is clear potential for scale. This is looking good."}, {"99a6": "• You have a big idea, in a big broken industry, you know the industry well, you have also previously worked in — or formed – a startup, you also have a working product, it has traction, you have actual revenue, and you have a team in place, ready to scale it."}, {"9bd0": "Shut up and take my money."}, {"8d6f": "HOW MUCH DO I NEED TO RAISE?"}, {"70c5": "Some founders will say you should raise only as much as you need to get to the next incremental milestone. Raise £10k, prove something, raise £50k, prove something else, raise £100k, prove even more …. and so on. Your mind is always sharp, as you’re always about to die."}, {"c95f": "In my opinion, this is a sadomasochist’s route. As a founder, your company needs you. It probably needs two of you. If you give it half of you, because the other half is permanently chasing cash, your company will die of neglect. Cash cannot defibrillate a dead company."}, {"eca2": "So buy yourself a decent runway if you can. Give yourself enough time for you and a lean team to really make a go of it. You’re almost certainly going to need to raise again in the future – so do so from a position of strength."}, {"873f": "Back then, after speaking to a number of early-stage founders, I gradually picked up the following: In most cases if you’re initially budgeting for more than a £20k monthly burn, you’re probably being too indulgent. If it’s less than £5k, you probably aren’t giving yourself enough of a shot. If your runway is three years, you’re not moving fast enough. If it’s three months, you’ll barely get going. If you’re raising your first round in the UK, you’re probably looking at something in between £100k–500k."}, {"2cf0": "AT WHAT VALUATION?"}, {"1e04": "Valuations are silly the first time round. The valuation you set for your first raise is almost certainly not what your company is worth. Not even close."}, {"2bbf": "And they are almost entirely environmental. A seed-stage (i.e. first round) valuation in Europe is roughly half of what it would be in New York, which is half of what it would be in the Valley. Which proves just how much of a nonsense it is."}, {"9e78": "The first time you raise money, most likely your valuation will work thusly: In order to pay for the runway I want, I need £X, and I’m willing to give away Y% of the company. Bingo: you’ve just reverse-engineered your valuation. If you want £200k and you’re willing to give away 20%: your valuation is £1m. Yep: a nonsense."}, {"24b1": "Whether or not you get that valuation will depend on the position you’re raising from (see above), the opportunity your company entails, and how good you are at pitching. You won’t be able to prove that the company is worth your valuation in “bricks & mortar” terms; but can you convince your investors that one day it will be worth a lot, lot more than the valuation you’re presenting them with?"}, {"7d1a": "HOW MUCH SHOULD YOU GIVE AWAY?"}, {"7987": "There are two things to avoid here. Both involve the same consideration: This will almost certainly not be your last raise."}, {"f5ed": "If you give away a huge percentage of your company during your first round of funding, what have you got to play with when it comes to your second? A good investor should know this – and know that the founder (or founding team) needs to own enough of the company, through multiple rounds, to stay incentivised."}, {"9454": "Conversely, if you raise a lot of money straight away, and give away very little, you’ve just earned yourself a monster valuation, which isn’t necessarily a good thing. When you come to raise again, you’ll need to justify a higher valuation — otherwise, you’re essentially saying your company has made no progress."}, {"f83b": "So, again, find a sweet spot. Your valuation should be big enough for the founding team to retain a chunky percentage through a couple of rounds (including this one), and not too big that it will make your next round impossible."}, {"5b2b": "—"}, {"5cb8": "BORING CAVEATS:"}, {"16cf": "LONG STORY SHORT: in the UK you are probably raising straight equity investment rather than a convertible note, and the valuation you have in your head is the post-money valuation … i.e. the value of the company after you’ve added the cash you want to raise."}, {"1925": "—"}, {"a95a": "WHICH INVESTORS SHOULD I TARGET?"}, {"9146": "You’ve worked out how much you want to raise, how much you’re willing to give away, and therefore your target valuation. Now where’s the money going to come from? Before you’ve put a pitch together, you need to work out who you’re going to take it to."}, {"de30": "• Incubators & accelerators"}, {"bd3a": "There are a number of accelerator programmes across the UK, who offer a small amount of investment, desk space, a period of mentorship from experts, and a bit of exposure. Look up Seedcamp, Wayra, TechStars, Ignite100. On the one hand, these programmes provide an educational buffer zone in between an idea and the big bad world. On the other hand, the big bag world matters, and accelerators have a relatively poor track record for success. The one exception is YC — their hit rate is phenomenal."}, {"017f": "• Angels"}, {"e156": "If you are raising money for the first time in the UK, for anything up to £500k, an “angel round” is probably what you are looking for. Angels are solo, non-institutional investors. Some are former founders who have sold a company, or have experience in the tech world and can offer a lot of value (introductions, advice, publicity). But many aren’t. Over the last few years, many traditional investors (i.e. “City types”) have become understandably interested in tech investment. They have cash. You need cash. Talk to them."}, {"1eca": "Either way, in the UK they are eligible for SEIS & EIS tax relief. Forget the spurious formation of “Tech City” … this is best thing this government has done for the UK’s startup scene, by a mile."}, {"7f02": "SEIS: if you are raising money for the first time and are less than nine months old, the first £150,000 of your raise will be eligible for SEIS. This means that any individual who invests within this allocation will get 50% of their investment returned as tax relief. For example, an eligible investor who subscribes for £50,000 worth of shares will only be £25,000 out of pocket after their next tax return. In essence: half price shares! EIS is the same as SEIS, but for rounds larger than £150,000, and at a 30% relief rate."}, {"3e08": "When you are a fledgling company with very little to show for yourself, you are a huge risk. This tax relief incentivises risk – investment is always a gamble, but this makes it a discounted gamble."}, {"839b": "• Venture Capitalists (VCs)"}, {"ee5d": "With my three month old company and zero experience of starting a business, I went straight to the biggest VC firms in the country, and was furious when they didn’t immediately write me a huge cheque. I’m terrible at being told no, so wasted a lot of energy getting a VC firm in on Picfair’s first round. It would have been fairly unprecedented for a first-time founder, which made me want it even more. In the end, I got an offer from a venture fund, and then decided against taking their money."}, {"ae54": "If you are raising money for the first time, for your first company, you probably shouldn’t delve into VC territory. They understandably want a lot of protection (preferential shares, liquidity preferences, board seats) as they have their own investors to placate, and they generally only take part in rounds north of £2m (“Series A”) that are almost always a second/third/fourth raise. When the time is right, VC cash can jet-propel your business."}, {"9870": "When the time is right."}, {"9e8d": "HOW TO GET TO YOUR INVESTORS"}, {"21ee": "Once you’ve worked out how much you want, the valuation you’re aiming for, and what kind of investors you want, now you need to get to them."}, {"ebdb": "First, make a list:"}, {"4601": "Now for the hard bit: setting up a meeting."}, {"ee87": "LinkedIn is the best resource you have. Work out how you are connected to your target within your existing network. If there is someone between the two of you, ask them for an introduction. If the intermediary can introduce you to two or more people, take them out to lunch and then ask them for the intros once you’ve paid for the meal. An intro is infinitely more powerful than a cold email."}, {"27ea": "When you finally email your target, keep it short. Who are you? What are you trying to do? How far have you got (preferably, in numbers and graphs)? How much are you raising? If you’ve got a deck (see below) already, send it. That’s pretty much it."}, {"821c": "And make sure you’ve done your homework. Before I started chasing Tom Hulme (now a Google Ventures partner), I’d read his entire blog, and watched every YouTube video he’d ever featured in. Before I first emailed Alexis Ohanian, Reddit’s co-founder, I read his book."}, {"be3b": "A fake Guardian home page I sent Reddit founder Alexis Ohanian before he invested in Picfair"}, {"16fc": "The investor will probably not get back to you. They get these emails all the time. So wait a few days and email again. Then wait a few days and email again. For one of my investors, I finally got a meeting by emailing, then emailing again, then emailing again, then DMing him on Twitter, then commenting on his Foursquare check-in."}, {"1d4c": "Being a relentless pain in the ass is one of the core attributes of being a business founder (just ask my colleagues), so don’t worry about being a relentless pain in the ass. Nobody has ever raised hundreds of thousands of pounds by being coquettish."}, {"64e6": "YOUR PITCH"}, {"cbf0": "You have a meeting. You have half an hour with a millionaire. If it goes well, it could change the next few years of your life."}, {"58a4": "YC founder Paul Graham has written an excellent blog on raising money, but, in my opinion, he gets one thing wrong: He says you should pitch the best people first – the investor you want the most, go straight to them. While this might work for a seasoned fundraiser on their second or third raise, it does not apply to a first-time fundraiser, as I was."}, {"f08a": "Know this: your first pitch will stink."}, {"0254": "It took me four or five stinky pitches until I got it right. When a question floored me, I made sure I could answer the crap out of it next time round. When I didn’t have a number to hand in one pitch, I’d have 10 ready for the next one."}, {"ddee": "The core ingredient: a slide deck (on PowerPoint, Keynote or Google Presentation etc.) with as few slides as possible. It shouldn’t take more than 15 minutes to present. There are hundreds of blogs out there about what you need to include, but if you can tick off most of the following, you’ll be in good shape:"}, {"b94e": "Another thing I gradually learned. The people you are talking to will mostly be highly intelligent and capable of understanding multiple levels of complexity and nuance. But by God they love a bullet point. Simplify it. Then simplify it some more. Take out the 200-word paragraph and make it into a diagram. Turn the four-page market analysis into a 10-second video. Then take the thing you’ve been thinking and dreaming about for a year and could write three books about … and condense it into a sentence. For example: “Picfair is AirBnb for Images.”"}, {"8db8": "COMMITMENT & LEADERS"}, {"8911": "Now the dance begins. Investors are herd animals — they usually don’t want to jump without having others jumping alongside them. This is understandable: co-jumpers mentally mitigate their risk."}, {"6581": "What you want is for them to “commit”. Literally, you want them to say to you “I am committed for £X.” What this means is “if you fill your round, I will give you £X at the valuation you have presented me.”"}, {"d48e": "To get the ball rolling, you need one big commitment, ideally from someone who is willing to “lead”. This makes them the point person, who will put together the legal documents and corral the other investors. If you are raising £300,000 and a leader emerges who is willing to commit £100,000, you’re in good shape. Even if they are not willing to “lead” — you can do this yourself – it will still set you on your way. Bur remember: you still need to fill the rest of your round. If you don’t, it’s a different proposition for the investor, and you’ll probably need to reassess your valuation."}, {"de82": "But a big commitment makes things very simple. You have a deal. Now it’s time to take it to everyone else you have in play (they’ve probably been waiting for someone else to jump first)."}, {"8775": "“We’re on. Person X has committed to Y at valuation Z. Are you in or out?”"}, {"a500": "LAWYER UP"}, {"2bcb": "You have not closed your round. You have no money in your bank."}, {"2094": "Find a lawyer to represent you. I used Orrick first time round, but there are plenty of other good ones with seed deal expertise out there — Sheridans, Nabarro, Taylor Wessing. Get them to cap the cost of the deal for you — this means you have a maximum cost, and will not get endlessly billed if the deal runs and runs."}, {"8fdb": "First up, you need a term sheet. You can either get a lawyer to draft this for you, or, if you have a “leader”, they can provide you with a term sheet for everyone else to agree on."}, {"880a": "A term sheet contains the “top lines” of your deal — a condensed version of the slurry of legal gumph to follow. Your term sheet will outline the major elements that you need to agree with your investors — things like the options pool, liquidation preferences, pre-emption rights, drag-along, the board of directors, founder vesting."}, {"94ef": "You’ve probably never heard of these things before. Handily, Passion Capital have published a beautifully gumph-free version of their term sheet here, which covers all of the above. If the term sheet you are being offered varies radically from theirs, be worried. Expect some negotiation — especially if your round includes institutional investors (but if it’s your first round, it probably shouldn’t — see above)."}, {"4c77": "Once you have your term sheet signed by all parties, you’re still not done yet. Now for the slurry of legal gumph I mentioned earlier — the Articles of Association, Shareholders Agreement, Subscription Agreement, and any Founder Warranties. This can run into hundreds of pages, and will probably be the most boring thing you’ll ever read. Really, though, this is just the term sheet written out in horrifying, indemnifying length."}, {"9d15": "Which isn’t to say you shouldn’t read it. I wanted to understand as much as possible, so nagged my lawyer incessantly to explain things to me when I didn’t understand them. We had capped a price, so I didn’t hold back."}, {"20a7": "And finally, now for the limbo. There will be a delay of at least a few weeks as your investors cross-check the gumph with their lawyers, who might come back with minor amendments. If so, this requires another round of cross-check, and so on. But you’re oh so close."}, {"87b1": "Once the gumph has been signed, the only thing left to do is to wire the money."}, {"08a3": "Onwards …"}, {"1cb2": "After I saw the final chunk of cash clear into Picfair’s bank account, I slept for 17 hours. And I hadn’t even done anything yet."}, {"6bf0": "But I could start up, properly. Within three weeks I’d replaced myself in four out of the five roles I was doing, and Team Picfair was working out of a very cliched shared workspace in Shoreditch. [I’d also lined up some press — your first raise is a very good opportunity for legitimate publicity, squeeze it as hard as you can.]"}, {"314d": "Picfair’s first *actual* team photo: me (with stupid checked shirt) and four upgrades"}, {"7863": "The last two and a half years have passed in hyperspeed … all of the energy I was putting into raising money is now going into building a business, and it requires twice as much."}, {"0d10": "Picfair has raised two more rounds since I first sat down to write this, and, yep, we’re raising again right now. A lot has changed. We’re now a company of 12. Our library has grown to 4.5 million algorithmically-curated images uploaded by tens of thousands of emerging photographers in 135 countries, from the slums of Nairobi to the streets of Kabul to cowboy outposts in Texas. We’ve built the chicken, and now we’re chasing the egg — gradually pushing ourselves towards publishers and businesses across the globe."}, {"65a8": "And it still feels like we’re only just getting started."}, {"c610": "— — — — —"}, {"de05": "This post is intended as a template for newbies. If that’s you — I hope it helps, and good luck."}, {"066e": "Of course, there are many, many different ways to raise money. If you’ve done it yourself, or if you’re an investor yourself, I’m sure there will be various things above that you disagree with. You may be right. Either way, please post in the comments."}, {"ca0b": "Obligatory shill: if you’re a publisher or business looking for a new generation of images from across the globe, hit me up."}], "child": "1303_1\t1303_2"}