{"name": "1305", "parent": "", "content": "Profit Profit is Unavoidable When the tech bubble collapsed in 2000–2001, I was 8 years old. Too preoccupied with mastering the new art of multiplication to bother myself with the silly stock games the adults were engaged in. I’ve racked my brain, but I have no distinct recollection of this stock market crash from my childhood. That’s probably why, a decade later, while studying finance in college, I couldn’t quite understand how people could have been so foolish. Why would anyone invest blindly in a business that was earning no profits? Didn’t they realize that earnings were the only true source of return for an equity investor? Professors would describe how people were convinced that the Internet had changed the game, the rules were different, and earnings were secondary. They used terms like “herd mentality” and “madness of the crowds” as if the entire country had fallen under some sort of mass hypnosis. It was quite a spooky depiction. I remember scoffing, thinking that I would never allow myself to be fooled by fancy rhetoric. How I would always remember that profits were unavoidable. A few weeks ago (two years after graduation) you would have found me preaching the gospel of Uber with evangelical zeal. I was convinced that Uber was building a global monopoly and, once they introduced UberPOOL, would render car ownership obsolete. I did this despite knowing that Uber was (allegedly) burning piles of investor cash and was facing extremely heavy local competition in many of their foreign markets. It didn’t matter, the audacity of their vision was intoxicating and talking about it made me feel smart. I recently came across an interview that forced me to remember what I had forgotten. The interviewee, David Heinemeier Hansson, is right. If you’re willing to buy dollar bills for $1.40 each, you’ll get a lot of dollars. But making millions of dollars in revenue doesn’t matter if you’re spending tens of millions to get it. In fact, this type of Robin Hood capitalism, taking money from wealthy investors to subsidize consumers, is not just unsustainable, it is destructive. Investing in loss making businesses quickly turns into a game of hot potato. “Exits” become more important than profits because profits seem so far away. This game of exits always collapses. The company continues to reach higher and higher valuations as more and more people pile into it. Finally, when everyone who wants to be invested has invested, they turn around and find that there is no one to sell to. If there are no profits that investors can derive a return from, panic usually ensues. There is no doubt that venture capital is being used to further interesting new technologies, but without profits, how do we know those technologies are truly valuable? The companies can’t keep producing the technology by constantly running losses. Eventually, they’ll have to start charging customers. It will be interesting to see how valuable consumers, who are used to subsidized software now, will find these technologies then. Companies with useful technologies will fail that probably wouldn’t have had to if they had managed consumer expectations better. And the capital that is spent won’t come back. Unfortunately (for my ego), I don’t think my viewpoint is all that contrarian. After the recent turmoil in the markets, concern about unicorn valuations seems to be rising (Bill Gurley has been talking about heady valuations for a while now). But now that I have finally experienced what it is like to get swept up by mass enthusiasm, I find myself equally amazed by the quiet power of profits and the ease with which we can forget it. The fancy words change. This time around they were “network effects” and “winner-take-all dynamics”. Last time they were probably different and next time they will probably be different. But they’re purpose will be the same: to draw your gaze away from the importance of bringing in more than you spend. Profit is Fundamental After my recent, private epiphany, I can’t help but think about profit in an almost reverential way. Time and again, people ignore its importance and every time the need to earn a profit eventually asserts its necessity, leaving people scrambling in its wake. I believe that profit is something much more fundamental than a clever incentive to induce competition and innovation and produce economic surpluses. In a world of scarce resources, profit is the reward that Nature assigns to those who can make better use of those resources. What is everyone in a society working towards? What does it mean to be a “contributing member of society”? Why do people lose their minds when the Chinese economy grows at 5% as opposed to 10%? I believe the answer is in the quaint little phrase “quality of life”. To contribute to society means to, in some way of our choosing, contribute to the improvement in the overall quality of life. Economic growth is a rough measure for an improvement in quality of life. “Improvement in the quality of life” is synonymous with “making better use of scarce resources.” And “making better use of scarce resources” is achieved through “technological progress.” I believe that profit, at a fundamental level, is the delta in quality of life that comes from technological progress. It is more than revenue minus expenses. That is just a way to measure it using money. But profit must be about more than money, otherwise only humans would be able to produce it. Humans don’t have a monopoly on technological innovation. Birds employ a marvelous piece of technological innovation in the form of nests. Building a nest in a tree has costs (expenses) including the time and effort it takes to gather sticks and bind them together. But nests have huge payoffs (revenue) like keeping offspring safe from predators and the elements. This greatly reduces anxiety for the parents, allowing them to fly away for long periods of time to collect food. Reduced anxiety is an improvement in the quality of life. That is the profit and it is a great thing. Just ask turtles. Humans have an enormous capacity for innovation, which is why we have a better quality of life than any animal on the planet. Money is one of our most powerful technological innovations. It allows us to measure profit and to transfer technology easily between each other. If all the birds on a tropical island got together one day and decided to assign some imaginary value to pebbles, pretty soon there would be a seagull buying branches for two pebbles from some forest bird and selling them to other seagull for three. That leftover pebble is the financial measure of profit, which is simply a signal that what the seagull is doing is sustainable. The real profit is not having to fly around all day looking for branches; being able to buy some fish from the pelican next door with that extra pebble, and not have to go hunting. Profit seeking is not a feature of capitalism, it is much older than that. If it were a feature of capitalism, then technological progress would have only started with the fall of feudalism. Profit is the thing that everyone is after, including the people who get stuck in the hot potato game of “exits”, improving quality of life in whatever way they define it. Financial profits are the signal that a company can sustainably create the real improvements in quality of life that its owners are looking for. This is why it is inextricable from any investment analysis, it is the whole point of investment in the first place. Capital is a scarce resource. When it’s not put to use to earn profits, it gets burned. ", "title": "Profit", "sentences": [{"1421": "Profit"}, {"6668": "Profit is Unavoidable"}, {"5fe8": "When the tech bubble collapsed in 2000–2001, I was 8 years old. Too preoccupied with mastering the new art of multiplication to bother myself with the silly stock games the adults were engaged in. I’ve racked my brain, but I have no distinct recollection of this stock market crash from my childhood. That’s probably why, a decade later, while studying finance in college, I couldn’t quite understand how people could have been so foolish. Why would anyone invest blindly in a business that was earning no profits? Didn’t they realize that earnings were the only true source of return for an equity investor? Professors would describe how people were convinced that the Internet had changed the game, the rules were different, and earnings were secondary. They used terms like “herd mentality” and “madness of the crowds” as if the entire country had fallen under some sort of mass hypnosis. It was quite a spooky depiction. I remember scoffing, thinking that I would never allow myself to be fooled by fancy rhetoric. How I would always remember that profits were unavoidable."}, {"7ca4": "A few weeks ago (two years after graduation) you would have found me preaching the gospel of Uber with evangelical zeal. I was convinced that Uber was building a global monopoly and, once they introduced UberPOOL, would render car ownership obsolete. I did this despite knowing that Uber was (allegedly) burning piles of investor cash and was facing extremely heavy local competition in many of their foreign markets. It didn’t matter, the audacity of their vision was intoxicating and talking about it made me feel smart."}, {"80da": "I recently came across an interview that forced me to remember what I had forgotten. The interviewee, David Heinemeier Hansson, is right. If you’re willing to buy dollar bills for $1.40 each, you’ll get a lot of dollars. But making millions of dollars in revenue doesn’t matter if you’re spending tens of millions to get it. In fact, this type of Robin Hood capitalism, taking money from wealthy investors to subsidize consumers, is not just unsustainable, it is destructive. Investing in loss making businesses quickly turns into a game of hot potato. “Exits” become more important than profits because profits seem so far away. This game of exits always collapses. The company continues to reach higher and higher valuations as more and more people pile into it. Finally, when everyone who wants to be invested has invested, they turn around and find that there is no one to sell to. If there are no profits that investors can derive a return from, panic usually ensues."}, {"1bf6": "There is no doubt that venture capital is being used to further interesting new technologies, but without profits, how do we know those technologies are truly valuable? The companies can’t keep producing the technology by constantly running losses. Eventually, they’ll have to start charging customers. It will be interesting to see how valuable consumers, who are used to subsidized software now, will find these technologies then. Companies with useful technologies will fail that probably wouldn’t have had to if they had managed consumer expectations better. And the capital that is spent won’t come back."}, {"6b27": "Unfortunately (for my ego), I don’t think my viewpoint is all that contrarian. After the recent turmoil in the markets, concern about unicorn valuations seems to be rising (Bill Gurley has been talking about heady valuations for a while now). But now that I have finally experienced what it is like to get swept up by mass enthusiasm, I find myself equally amazed by the quiet power of profits and the ease with which we can forget it. The fancy words change. This time around they were “network effects” and “winner-take-all dynamics”. Last time they were probably different and next time they will probably be different. But they’re purpose will be the same: to draw your gaze away from the importance of bringing in more than you spend."}, {"bc73": "Profit is Fundamental"}, {"88e4": "After my recent, private epiphany, I can’t help but think about profit in an almost reverential way. Time and again, people ignore its importance and every time the need to earn a profit eventually asserts its necessity, leaving people scrambling in its wake. I believe that profit is something much more fundamental than a clever incentive to induce competition and innovation and produce economic surpluses. In a world of scarce resources, profit is the reward that Nature assigns to those who can make better use of those resources."}, {"5dd0": "What is everyone in a society working towards? What does it mean to be a “contributing member of society”? Why do people lose their minds when the Chinese economy grows at 5% as opposed to 10%? I believe the answer is in the quaint little phrase “quality of life”. To contribute to society means to, in some way of our choosing, contribute to the improvement in the overall quality of life. Economic growth is a rough measure for an improvement in quality of life. “Improvement in the quality of life” is synonymous with “making better use of scarce resources.” And “making better use of scarce resources” is achieved through “technological progress.” I believe that profit, at a fundamental level, is the delta in quality of life that comes from technological progress."}, {"5509": "It is more than revenue minus expenses. That is just a way to measure it using money. But profit must be about more than money, otherwise only humans would be able to produce it. Humans don’t have a monopoly on technological innovation. Birds employ a marvelous piece of technological innovation in the form of nests. Building a nest in a tree has costs (expenses) including the time and effort it takes to gather sticks and bind them together. But nests have huge payoffs (revenue) like keeping offspring safe from predators and the elements. This greatly reduces anxiety for the parents, allowing them to fly away for long periods of time to collect food. Reduced anxiety is an improvement in the quality of life. That is the profit and it is a great thing. Just ask turtles."}, {"19ae": "Humans have an enormous capacity for innovation, which is why we have a better quality of life than any animal on the planet. Money is one of our most powerful technological innovations. It allows us to measure profit and to transfer technology easily between each other. If all the birds on a tropical island got together one day and decided to assign some imaginary value to pebbles, pretty soon there would be a seagull buying branches for two pebbles from some forest bird and selling them to other seagull for three. That leftover pebble is the financial measure of profit, which is simply a signal that what the seagull is doing is sustainable. The real profit is not having to fly around all day looking for branches; being able to buy some fish from the pelican next door with that extra pebble, and not have to go hunting."}, {"6dbb": "Profit seeking is not a feature of capitalism, it is much older than that. If it were a feature of capitalism, then technological progress would have only started with the fall of feudalism. Profit is the thing that everyone is after, including the people who get stuck in the hot potato game of “exits”, improving quality of life in whatever way they define it. Financial profits are the signal that a company can sustainably create the real improvements in quality of life that its owners are looking for. This is why it is inextricable from any investment analysis, it is the whole point of investment in the first place. Capital is a scarce resource. When it’s not put to use to earn profits, it gets burned."}], "child": "1305_1\t1305_2\t1305_3"}