{"name": "1306", "parent": "", "content": "The dawn of a new Australian space industry — we just invested in nano-satellite startup Fleet Imagine a network of tiny nano-satellites that deliver a global backhaul service for the Internet of Things; a scalable, ubiquitous network that connects everything, for free. It’s a huge mission and one that could change the way mining, agriculture, transport, logistics, oil and gas industries operate. That’s the mission of Fleet. We’re thrilled to announce them as Blackbird’s second investment of 2017 and to be joining them on a journey into low earth orbit. Smartphones in space A decade ago the notion of building a global data network with universal coverage of the earth’s surface would have required billions of dollars of capital expenditure from the world’s largest telecommunications companies. Today, it is conceivable that a global network can be started and the concept proven by a startup with the use of a few million dollars. That is due to two things: 1) dramatic improvement in cost and performance of smartphone components making it possible to produce low cost tiny satellites (cubesats) and 2) the pioneering of low cost rockets to get the cubesats into space. This means a global data network is now something well within the realm of a venture backed startup — and one from Australia. Fleet is on a mission to launch the network in two years, making available a low speed and low power data connection to IoT customers from industries like oil and gas and agriculture in remote areas. The initial IoT applications can handle high latency, with 3–6 satellite passes a day offering ample opportunities for sensors to send their data. As the network of satellites grows, this latency will come down to minutes or seconds. Why we think this is important As the traditional high cost satellite and telco industries struggle with aging infrastructure, they have focused more and more on high cost, high bandwidth applications. We think that Fleet has the potential to disrupt this model, providing ultra cheap connectivity for low bandwidth applications for completely different customers, something the big providers are not geared up to provide due to their high cost structure. Fleet is led by Flavia Tata Nardini, an aerospace engineer based in Adelaide who launched satellites into space with the European Space Agency. She is joined by Matt Tetlow, who has led space missions and is the lead of SUSat, one of the first Australian satellites flying in lower earth orbit (LEO), and Matt Pearson, who founded Honcho — a business registration company that has bootstrapped to nearly 100 employees. The grit and hustle of the team impressed us as we’ve got to know them over the last few months. With just $75k in capital prior to this investment, and 18 months under their belt, they will have essentially launched an alpha version in space and tested the satellite on high flying balloons. The misunderstood At Blackbird we seek out the misunderstood — products and markets that at face value would seem an impossible task with small amounts of capital. The reinvention of the space industry, and the proliferation of cheap electronics and sensors by virtue of billions of smartphones being manufactured, means that existing business problems can now be solved using space-based solutions. This is why we were so excited to meet Flavia and the team and why we’ve chosen to make Fleet our second investment of 2017. To the moon 🚀 ", "title": "The dawn of a new Australian space industry — we just invested in nano-satellite startup Fleet", "sentences": [{"411f": "The dawn of a new Australian space industry — we just invested in nano-satellite startup Fleet"}, {"19cd": "Imagine a network of tiny nano-satellites that deliver a global backhaul service for the Internet of Things; a scalable, ubiquitous network that connects everything, for free."}, {"3f0a": "It’s a huge mission and one that could change the way mining, agriculture, transport, logistics, oil and gas industries operate."}, {"3cb5": "That’s the mission of Fleet. We’re thrilled to announce them as Blackbird’s second investment of 2017 and to be joining them on a journey into low earth orbit."}, {"964d": "Smartphones in space"}, {"d2c0": "A decade ago the notion of building a global data network with universal coverage of the earth’s surface would have required billions of dollars of capital expenditure from the world’s largest telecommunications companies."}, {"59fb": "Today, it is conceivable that a global network can be started and the concept proven by a startup with the use of a few million dollars. That is due to two things: 1) dramatic improvement in cost and performance of smartphone components making it possible to produce low cost tiny satellites (cubesats) and 2) the pioneering of low cost rockets to get the cubesats into space."}, {"523a": "This means a global data network is now something well within the realm of a venture backed startup — and one from Australia."}, {"28ac": "Fleet is on a mission to launch the network in two years, making available a low speed and low power data connection to IoT customers from industries like oil and gas and agriculture in remote areas. The initial IoT applications can handle high latency, with 3–6 satellite passes a day offering ample opportunities for sensors to send their data. As the network of satellites grows, this latency will come down to minutes or seconds."}, {"9888": "Why we think this is important"}, {"2a61": "As the traditional high cost satellite and telco industries struggle with aging infrastructure, they have focused more and more on high cost, high bandwidth applications. We think that Fleet has the potential to disrupt this model, providing ultra cheap connectivity for low bandwidth applications for completely different customers, something the big providers are not geared up to provide due to their high cost structure."}, {"5975": "Fleet is led by Flavia Tata Nardini, an aerospace engineer based in Adelaide who launched satellites into space with the European Space Agency. She is joined by Matt Tetlow, who has led space missions and is the lead of SUSat, one of the first Australian satellites flying in lower earth orbit (LEO), and Matt Pearson, who founded Honcho — a business registration company that has bootstrapped to nearly 100 employees."}, {"25de": "The grit and hustle of the team impressed us as we’ve got to know them over the last few months. With just $75k in capital prior to this investment, and 18 months under their belt, they will have essentially launched an alpha version in space and tested the satellite on high flying balloons."}, {"049c": "The misunderstood"}, {"c9a3": "At Blackbird we seek out the misunderstood — products and markets that at face value would seem an impossible task with small amounts of capital."}, {"35ec": "The reinvention of the space industry, and the proliferation of cheap electronics and sensors by virtue of billions of smartphones being manufactured, means that existing business problems can now be solved using space-based solutions."}, {"5367": "This is why we were so excited to meet Flavia and the team and why we’ve chosen to make Fleet our second investment of 2017."}, {"bcfe": "To the moon 🚀"}], "child": "1306_1\t1306_2"}