{"name": "131", "parent": "", "content": "The Other Tradition Unlike Any Other What’s really happening at Jordan Spieth and Rickie Fowler’s annual bro-cation? Drowned out in the populist roars for Sergio Garcia’s triumph at the Masters on Sunday was one undeniable truth: Jordan Spieth and Rickie Fowler — good friends, in contention, with momentum, playing together in the penultimate pairing — completely and utterly crapped the bed. They were a combined seven over par; Spieth fell prey yet again to the water on the 12th hole, while Fowler bogeyed the final three holes to match his playing partner’s fall out of the top 10. As the Garcia–Justin Rose battle made its way up the 17th, Nantz kicked it over to Dottie Pepper in the cabin with Spieth for the post-round interview. Fans watching the telecast at home surely could have set Spieth’s Rolex to what was coming: a glum Jordan, disappointed he hadn’t seized upon his moment of redemption, lamenting a slow start and another meltdown on 12. To Win the Masters, Sergio Garcia Beat His Greatest Foe: HimselfAnd now he finally has his major championshiptheringer.com Only they got the complete opposite. Spieth was downright giddy. He conceded he was out of the tournament early in the round, and spoke happily of how he’d fought back after his usual swimming expedition on the 12th hole to make some birdies. He was thrilled with his iron play, just a little off on his distances. He sounded at that moment like — god forbid — Sergio Garcia after his previous 73 majors. Like he didn’t care. Indeed, rewatching the handshake between Fowler and Spieth on 18 after Rickie putt out for his third bogey in a row, the two were smiling, chest-patting, and bro-fiving. What the hell? If you look closely at the video of that high five on 18, you can make out Fowler saying the word “Baker’s.” As in, the Baker’s Bay Golf and Ocean Club on Great Guana Cay in the Bahamas, the superexclusive playground for Michael Jordan, Ben Affleck, Cindy Crawford, Elle MacPherson, Tom Brady, J-Rod, and more, where Fowler owns one of the fewer than 300 residences on the property. In what has become The Other Tradition Unlike Any Other, Fowler and Spieth, along with rising stars Justin Thomas and Smylie Kaufman, make a beeline for Baker’s Bay after the Masters for “spring break” — a week off before returning to the grind of the PGA Tour. In sync with the blooming azaleas at Augusta, Rickie Fowler’s Snapchat comes alive to document the whole damn thing. No wonder they walked off the 18th green like they were headed to a party. They were. I’ve been a lucky and unworthy guest at Baker’s Bay a few times, as recently as three weeks ago. I follow the PGA Tour like a maniac. So I’ve been dissecting video from Fowler and Justin Thomas’s Snapchats frame-by-frame like the a-hole who robbed Lexi Thompson of her recent LPGA major. The boys are down there for the whole week — there’s surely more to come. But these are the biggest takeaways from Rickie and JT’s ridiculous Snapchat stories so far: 1. They’re playing the Bizarro Masters. It’s as if they had a violent allergic reaction to the prim and proper traditions at Augusta and decided to do everything exactly the opposite for a week. They’re riding in carts, playing in bathing suits — shirtless and barefoot — drinking, dancing, throwing clubs, and running all over the course. They’re blasting everything from old-school rap to the new Chainsmokers album. (This is all not only sanctioned but encouraged at Baker’s Bay.) Any one of these things would result in a massive fine from the PGA Tour. And that’s why it’s so fun to watch. We never get to see them play golf like the rest of us. What clothing they are wearing is doused in Casamigos branding, (Baker’s Bay is owned by one of the partners in the tequila brand; it is exclusive and ever present throughout the resort.) It’s the antithesis of the experience at Augusta, where patrons are offered brand-free beverages identified only as “domestic beer” and “import beer.” When are Puma and Under Armour going to send the subtle note to Rickie’s and Jordan’s agents complaining that they’re wearing fishing hats? 2. Jordan and Rickie are still playing like crap. As they read out the scorecard, both Spieth and Fowler were losing big. The guys staged an intervention on camera to try to help Jordan actually get a chance to hit a second shot on the par-3 17th, because he’s been out of bounds off the tee every time. Twice we saw Spieth deep in the bushes, including an impenetrable cluster 40 yards left of the other guys on the par-5 seventh hole. I’m a 14-handicapper with a dead Dr. Snappy hook off the tee. I lost 24 balls on that course over a long weekend. I WAS NEVER THAT FAR LEFT. Let’s hope these guys can round their games into shape for the Texas swing of the tour. 3. They’re boozing hard. We see them indulging in cocktails from styrofoam cups on the boat ride over (the move at Baker’s Bay), as they head to the course, and off the first tee. Then the video focuses mostly on golf, even as the cadence of the guys’ speech slows and slurs from a Spanish-speaking-soccer-announcer to Verne Lundquist–on-the-16th-at-Augusta with each passing hole. Insiders can tell you why. If you look closely at the course map, you’ll notice a structure nestled between the fourth and 16th greens. This is, in my estimation, one of the most magical places on earth. It’s called the Sip Sip, and it is stocked with just about any food or drink your heart could possibly desire. There’s every candy imaginable. There are premade sandwiches and fruit cups, noodles bowls, nachos, snacks, cheese plates, and mini hot dogs. There’s a frozen-margarita machine and a soft-serve ice cream sundae bar. There’s a bartender manning a full bar and a grill master making tacos, sliders, and other mouthwatering treats. It’s all free. You have at least three opportunities to go to the Sip Sip in an 18-hole round. Trust me, you always go to the Sip Sip. And you never leave the Sip Sip without a drink. If that’s not enough, the driveable par-4 eighth hole (where we see Justin Thomas fade one deep into the vegetation) ends at the beach, where a separate beach bar awaits. It’s a tradition that each golfer does a shot of — you guessed it — Casamigos tequila before moving onto the ninth hole. So it’s no surprise that we see Thomas hitting backwards out of a bunker on 9, followed by him lying face down on the roof of Rickie’s cart on 10. By the time they get to 18, Thomas is hitting a five-wood out of a bunker into a bush. 4. Who’s that girl? If you focused too hard on JT peering down from the roof of the cart, you probably missed the accidental video capture of a woman walking onto the green on 10 to grab her golf ball. There are no hints at her whereabouts anywhere else in their Snapchat stories. These are some of the most eligible guys on the planet. Inquiring minds want to know: Who is this woman? Has Fowler finally found a girlfriend after being the 25th wheel at the Ryder Cup? I assume TMZ already has a couple of guys with cameras in rubber zodiac boats circling the place, so we’re gonna get an answer soon. 5. These guys do not bet like Phil Mickelson. As Spieth updates us on the score, he announces that Rickie and Jordan are down “60,” while Thomas is up “100” and Smylie “80.” How do we know they aren’t speaking in thousands? Check out Smylie’s PGA Tour profile — he’s only made $44,676 this year and has fewer FedEx Cup points than my brother. If Rickie made him pay for his share of the private jet down there, Smylie is underwater in 2017. He’s not playing for big cheddar. Let’s just say that if he doesn’t pick up the pace a bit, his invite might “accidentally” show up in Thomas Pieters’ inbox next year. 6. Short shorts are back, apparently. Let’s all pray to Arnie’s ghost that these guys don’t become the Michigan Fab Five for golf. It looks like they had a bulk order of extra tight print shorts from Vineyard Vines shipped directly to Butler Cabin. There is nothing more jarring than a pro-golfer tan, until you see a pro-golfer tan on a pro golfer wearing shorts. I am suddenly a huge supporter of the PGA Tour’s requirement that all players wear pants. 7. Our best young golfers are not exactly iconic athletic specimens. With all the shirtless cavorting, you’d think these guys would do a few push-ups. What happened to the fitness era ushered in by Tiger? Jason Day and Sergio look jacked. Dustin Johnson is 6-foot-4. These guys look less defined than Romo in his Mavs jersey. (Baker’s Bay has a great gym, fellas!) The boys Snapchatted their breakfast Wednesday morning, and guess what they were having? Bowls of Froot Loops and Lucky Charms. These two things might be related. 8. Smylie Kaufman had to ice down his elbows because he dabbed too much yesterday. Again, Smylie’s status as a regular on this trip is very tenuous. He’s essentially a drummer in Pearl Jam. 9. Snapchat’s advertising model makes sense now. One of the challenges faced by both Facebook and Twitter is how to best monetize the famous people who use their services. At Twitter, we never felt right about putting ads directly on a famous person’s profile page. So while you see an ad in your feed every 25 tweets or so, when Donald Trump is firing off his latest missive, there isn’t really a way for Twitter to run ads directly against that activity. But Snapchat is video focused. At the end of every Snapchat story update I’ve watched, I’ve seen an ad. And that means the Snapchat ad sales team can go to advertisers and give them a way to associate their brand with a specific famous person. Should I advertise on Keeping Up with the Kardashians that airs once a week, or on Kim’s Snapchat story that she updates and you check multiple times a day? It looks like brands are starting to vote for the latter, and that’s promising news for Snapchat. 10. Life goals: Get a personalized Snapchat filter. I can’t even tell who’s who beyond Rickie and his stache in that filter, but needless to say Snapchat didn’t offer up something like this to me when I was down there with my friends. With verification on Twitter and Instagram now becoming democratized, a personalized Snapchat filter is the new ultimate social status symbol. While you’re hard at work, Fowler, Spieth, Thomas, and Kaufman are living it up right now. It’s easy to start thinking that life isn’t always fair. But if a trip to Baker’s Bay can help these guys get over their Masters agony in seconds, surely living vicariously through their Snapchat stories can get us through to the weekend. They’ve given us a gift. Open it. Nathan Hubbard is an unpaid intern for The Ringer. He was previously CEO of Ticketmaster, head of commerce and global media for Twitter, and a touring singer-songwriter. His next project is currently in stealth. ", "title": "The Other Tradition Unlike Any Other", "sentences": [{"5914": "The Other Tradition Unlike Any Other"}, {"ad3e": "What’s really happening at Jordan Spieth and Rickie Fowler’s annual bro-cation?"}, {"9e22": "Drowned out in the populist roars for Sergio Garcia’s triumph at the Masters on Sunday was one undeniable truth: Jordan Spieth and Rickie Fowler — good friends, in contention, with momentum, playing together in the penultimate pairing — completely and utterly crapped the bed. They were a combined seven over par; Spieth fell prey yet again to the water on the 12th hole, while Fowler bogeyed the final three holes to match his playing partner’s fall out of the top 10. As the Garcia–Justin Rose battle made its way up the 17th, Nantz kicked it over to Dottie Pepper in the cabin with Spieth for the post-round interview. Fans watching the telecast at home surely could have set Spieth’s Rolex to what was coming: a glum Jordan, disappointed he hadn’t seized upon his moment of redemption, lamenting a slow start and another meltdown on 12."}, {"0a75": "To Win the Masters, Sergio Garcia Beat His Greatest Foe: HimselfAnd now he finally has his major championshiptheringer.com"}, {"8507": "Only they got the complete opposite. Spieth was downright giddy. He conceded he was out of the tournament early in the round, and spoke happily of how he’d fought back after his usual swimming expedition on the 12th hole to make some birdies. He was thrilled with his iron play, just a little off on his distances. He sounded at that moment like — god forbid — Sergio Garcia after his previous 73 majors. Like he didn’t care. Indeed, rewatching the handshake between Fowler and Spieth on 18 after Rickie putt out for his third bogey in a row, the two were smiling, chest-patting, and bro-fiving. What the hell?"}, {"25ee": "If you look closely at the video of that high five on 18, you can make out Fowler saying the word “Baker’s.” As in, the Baker’s Bay Golf and Ocean Club on Great Guana Cay in the Bahamas, the superexclusive playground for Michael Jordan, Ben Affleck, Cindy Crawford, Elle MacPherson, Tom Brady, J-Rod, and more, where Fowler owns one of the fewer than 300 residences on the property. In what has become The Other Tradition Unlike Any Other, Fowler and Spieth, along with rising stars Justin Thomas and Smylie Kaufman, make a beeline for Baker’s Bay after the Masters for “spring break” — a week off before returning to the grind of the PGA Tour. In sync with the blooming azaleas at Augusta, Rickie Fowler’s Snapchat comes alive to document the whole damn thing. No wonder they walked off the 18th green like they were headed to a party. They were."}, {"035e": "I’ve been a lucky and unworthy guest at Baker’s Bay a few times, as recently as three weeks ago. I follow the PGA Tour like a maniac. So I’ve been dissecting video from Fowler and Justin Thomas’s Snapchats frame-by-frame like the a-hole who robbed Lexi Thompson of her recent LPGA major. The boys are down there for the whole week — there’s surely more to come. But these are the biggest takeaways from Rickie and JT’s ridiculous Snapchat stories so far:"}, {"b639": "1. They’re playing the Bizarro Masters."}, {"e993": "It’s as if they had a violent allergic reaction to the prim and proper traditions at Augusta and decided to do everything exactly the opposite for a week. They’re riding in carts, playing in bathing suits — shirtless and barefoot — drinking, dancing, throwing clubs, and running all over the course. They’re blasting everything from old-school rap to the new Chainsmokers album. (This is all not only sanctioned but encouraged at Baker’s Bay.) Any one of these things would result in a massive fine from the PGA Tour. And that’s why it’s so fun to watch. We never get to see them play golf like the rest of us. What clothing they are wearing is doused in Casamigos branding, (Baker’s Bay is owned by one of the partners in the tequila brand; it is exclusive and ever present throughout the resort.) It’s the antithesis of the experience at Augusta, where patrons are offered brand-free beverages identified only as “domestic beer” and “import beer.” When are Puma and Under Armour going to send the subtle note to Rickie’s and Jordan’s agents complaining that they’re wearing fishing hats?"}, {"dac7": "2. Jordan and Rickie are still playing like crap."}, {"9513": "As they read out the scorecard, both Spieth and Fowler were losing big. The guys staged an intervention on camera to try to help Jordan actually get a chance to hit a second shot on the par-3 17th, because he’s been out of bounds off the tee every time. Twice we saw Spieth deep in the bushes, including an impenetrable cluster 40 yards left of the other guys on the par-5 seventh hole. I’m a 14-handicapper with a dead Dr. Snappy hook off the tee. I lost 24 balls on that course over a long weekend. I WAS NEVER THAT FAR LEFT. Let’s hope these guys can round their games into shape for the Texas swing of the tour."}, {"abd3": "3. They’re boozing hard."}, {"0c0e": "We see them indulging in cocktails from styrofoam cups on the boat ride over (the move at Baker’s Bay), as they head to the course, and off the first tee. Then the video focuses mostly on golf, even as the cadence of the guys’ speech slows and slurs from a Spanish-speaking-soccer-announcer to Verne Lundquist–on-the-16th-at-Augusta with each passing hole. Insiders can tell you why. If you look closely at the course map, you’ll notice a structure nestled between the fourth and 16th greens. This is, in my estimation, one of the most magical places on earth. It’s called the Sip Sip, and it is stocked with just about any food or drink your heart could possibly desire. There’s every candy imaginable. There are premade sandwiches and fruit cups, noodles bowls, nachos, snacks, cheese plates, and mini hot dogs. There’s a frozen-margarita machine and a soft-serve ice cream sundae bar. There’s a bartender manning a full bar and a grill master making tacos, sliders, and other mouthwatering treats. It’s all free. You have at least three opportunities to go to the Sip Sip in an 18-hole round. Trust me, you always go to the Sip Sip. And you never leave the Sip Sip without a drink. If that’s not enough, the driveable par-4 eighth hole (where we see Justin Thomas fade one deep into the vegetation) ends at the beach, where a separate beach bar awaits. It’s a tradition that each golfer does a shot of — you guessed it — Casamigos tequila before moving onto the ninth hole. So it’s no surprise that we see Thomas hitting backwards out of a bunker on 9, followed by him lying face down on the roof of Rickie’s cart on 10. By the time they get to 18, Thomas is hitting a five-wood out of a bunker into a bush."}, {"ac10": "4. Who’s that girl?"}, {"90c9": "If you focused too hard on JT peering down from the roof of the cart, you probably missed the accidental video capture of a woman walking onto the green on 10 to grab her golf ball. There are no hints at her whereabouts anywhere else in their Snapchat stories. These are some of the most eligible guys on the planet. Inquiring minds want to know: Who is this woman? Has Fowler finally found a girlfriend after being the 25th wheel at the Ryder Cup? I assume TMZ already has a couple of guys with cameras in rubber zodiac boats circling the place, so we’re gonna get an answer soon."}, {"1b7e": "5. These guys do not bet like Phil Mickelson."}, {"d04c": "As Spieth updates us on the score, he announces that Rickie and Jordan are down “60,” while Thomas is up “100” and Smylie “80.” How do we know they aren’t speaking in thousands? Check out Smylie’s PGA Tour profile — he’s only made $44,676 this year and has fewer FedEx Cup points than my brother. If Rickie made him pay for his share of the private jet down there, Smylie is underwater in 2017. He’s not playing for big cheddar. Let’s just say that if he doesn’t pick up the pace a bit, his invite might “accidentally” show up in Thomas Pieters’ inbox next year."}, {"4f03": "6. Short shorts are back, apparently."}, {"59ef": "Let’s all pray to Arnie’s ghost that these guys don’t become the Michigan Fab Five for golf. It looks like they had a bulk order of extra tight print shorts from Vineyard Vines shipped directly to Butler Cabin. There is nothing more jarring than a pro-golfer tan, until you see a pro-golfer tan on a pro golfer wearing shorts. I am suddenly a huge supporter of the PGA Tour’s requirement that all players wear pants."}, {"1068": "7. Our best young golfers are not exactly iconic athletic specimens."}, {"7fc2": "With all the shirtless cavorting, you’d think these guys would do a few push-ups. What happened to the fitness era ushered in by Tiger? Jason Day and Sergio look jacked. Dustin Johnson is 6-foot-4. These guys look less defined than Romo in his Mavs jersey. (Baker’s Bay has a great gym, fellas!) The boys Snapchatted their breakfast Wednesday morning, and guess what they were having? Bowls of Froot Loops and Lucky Charms. These two things might be related."}, {"a751": "8. Smylie Kaufman had to ice down his elbows because he dabbed too much yesterday."}, {"25a6": "Again, Smylie’s status as a regular on this trip is very tenuous. He’s essentially a drummer in Pearl Jam."}, {"1fc9": "9. Snapchat’s advertising model makes sense now."}, {"e2b4": "One of the challenges faced by both Facebook and Twitter is how to best monetize the famous people who use their services. At Twitter, we never felt right about putting ads directly on a famous person’s profile page. So while you see an ad in your feed every 25 tweets or so, when Donald Trump is firing off his latest missive, there isn’t really a way for Twitter to run ads directly against that activity. But Snapchat is video focused. At the end of every Snapchat story update I’ve watched, I’ve seen an ad. And that means the Snapchat ad sales team can go to advertisers and give them a way to associate their brand with a specific famous person. Should I advertise on Keeping Up with the Kardashians that airs once a week, or on Kim’s Snapchat story that she updates and you check multiple times a day? It looks like brands are starting to vote for the latter, and that’s promising news for Snapchat."}, {"1c7c": "10. Life goals: Get a personalized Snapchat filter."}, {"a8e1": "I can’t even tell who’s who beyond Rickie and his stache in that filter, but needless to say Snapchat didn’t offer up something like this to me when I was down there with my friends. With verification on Twitter and Instagram now becoming democratized, a personalized Snapchat filter is the new ultimate social status symbol."}, {"0f9b": "While you’re hard at work, Fowler, Spieth, Thomas, and Kaufman are living it up right now. It’s easy to start thinking that life isn’t always fair. But if a trip to Baker’s Bay can help these guys get over their Masters agony in seconds, surely living vicariously through their Snapchat stories can get us through to the weekend. They’ve given us a gift. Open it."}, {"439c": "Nathan Hubbard is an unpaid intern for The Ringer. He was previously CEO of Ticketmaster, head of commerce and global media for Twitter, and a touring singer-songwriter. His next project is currently in stealth."}], "child": "131_1\t131_2\t131_3\t131_4"}