{"name": "1316", "parent": "", "content": "VC Interest Piqued In Healthcare At Sapphire Ventures, we aim to proactively research spaces as we search for new investments. Most recently, we have been taking a closer look at early-stage healthcare investments. Below is some of the data we reviewed during a recent analysis on healthcare showing the investment and exit environment, as well as performance dynamics that make healthcare seem attractive from an investment perspective. Unless otherwise noted, healthcare figures include both healthcare IT and life sciences combined. This first chart depicts the portion of healthcare dollars invested in venture capital relative to total dollars invested for all of venture capital. Since 2010, roughly one-third of all venture dollars invested per year goes to healthcare investments, with more than $15 billion invested per year over the last three years. Source: NVCA, SVB, Rock Health, Sapphire Ventures However, not all of these dollars invested in healthcare come from healthcare-only funds. According to our data, healthcare funds raise less capital per year than what flows into healthcare investments. Roughly one-fifth of the total dollars raised per year is for healthcare-only funds, increasing from just over $2 billion raised in 2010 to over $7 billion in 2015 and another $7 billion in 2016. Source: NVCA, SVB, Rock Health, Sapphire Ventures Going one layer deeper, we notice that the amount invested in biopharma and healthcare IT has risen quite dramatically in recent years, while dollars into devices and dx/tools has stagnated. Source: SVB, Rock Health, Sapphire Ventures Similarly, the number of deals within the categories of healthcare tracks closely to the trends in dollars invested. Source: Pitchbook, Sapphire Ventures Focusing on healthcare IT, investors with at least one deal per year in healthcare increased more than fourfold to over 500 investors in 2016, up from just over 125 investors in 2011. Despite the high headline number of unique investors in healthcare IT today, there are far fewer firms actively investing. Specifically, only 32 firms invested in four or more healthcare IT deals in 2016. Moreover, a number of these “active” venture firms are strategic, meaning that there are even fewer healthcare IT-dedicated firms looking for financially-oriented returns. Source: Rock Health So why is there so much recent activity in healthcare investing? In addition to structural reasons (need for lower costs and more efficient processes) and regulatory reasons (ACA, HITECH Act), the renewed interest in healthcare may be driven in part by attractive investment returns with almost $100 billion in distributions from VC-backed healthcare investments over the last four years since 2012. Attractive performance tends to draw more participants into a space. Source: SVB, Rock Health, Pitchbook, Sapphire Ventures On the M&A front, biopharma still seems to hold a lion’s share of the exit value. Healthcare IT is still waiting on outsized M&A returns, though the amount per annum has generally increased, especially since 2012. Source: SVB, Pitchbook, Sapphire Ventures For public market listings, biopharma also dominates the majority of value created. Similar to M&A, healthcare IT and services have recently seen a cohort of larger companies going public. Source: SVB, Pitchbook, Sapphire Ventures As a performance metric for LPs, healthcare IT returns are distributed faster to LPs than general IT returns. That is, LPs may get their money back faster when investing in top-performing venture-backed healthcare IT with relatively similar IRR performance.[1] Source: Pitchbook [1] DPI: Total fund cash and stock distributions over called capital. Stock distributions valued at date of distribution. IRR: Internal rate of return of fund cash flows, net of fees. DPI and IRR performance does not reflect performance of Sapphire Ventures. Disclosures: The information set forth herein is not intended to constitute investment advice and under no circumstances should any information provided herein be used or considered as an offer to sell or a solicitation of an offer to buy an interest in any investment fund managed by Sapphire Ventures. Sapphire Ventures does not solicit or make its services available to the public and none of the funds are currently open to new investors. Past performance is not indicative of future performance. Any portfolio companies referred to above do not necessarily represent all of the investments made or recommended by Sapphire Ventures, and were not selected based on the return on Sapphire Ventures’ investment in them. It should not be assumed that any specific investments identified and discussed herein were or will be profitable. Not all investments made by Sapphire Ventures will be profitable or will equal the performance of any of the companies identified above. ", "title": "VC Interest Piqued In Healthcare", "sentences": [{"6c7b": "VC Interest Piqued In Healthcare"}, {"9b8c": "At Sapphire Ventures, we aim to proactively research spaces as we search for new investments. Most recently, we have been taking a closer look at early-stage healthcare investments."}, {"c30b": "Below is some of the data we reviewed during a recent analysis on healthcare showing the investment and exit environment, as well as performance dynamics that make healthcare seem attractive from an investment perspective. Unless otherwise noted, healthcare figures include both healthcare IT and life sciences combined."}, {"6a73": "This first chart depicts the portion of healthcare dollars invested in venture capital relative to total dollars invested for all of venture capital. Since 2010, roughly one-third of all venture dollars invested per year goes to healthcare investments, with more than $15 billion invested per year over the last three years."}, {"2cd5": "Source: NVCA, SVB, Rock Health, Sapphire Ventures"}, {"5b43": "However, not all of these dollars invested in healthcare come from healthcare-only funds. According to our data, healthcare funds raise less capital per year than what flows into healthcare investments. Roughly one-fifth of the total dollars raised per year is for healthcare-only funds, increasing from just over $2 billion raised in 2010 to over $7 billion in 2015 and another $7 billion in 2016."}, {"7997": "Source: NVCA, SVB, Rock Health, Sapphire Ventures"}, {"a1f9": "Going one layer deeper, we notice that the amount invested in biopharma and healthcare IT has risen quite dramatically in recent years, while dollars into devices and dx/tools has stagnated."}, {"75d1": "Source: SVB, Rock Health, Sapphire Ventures"}, {"963d": "Similarly, the number of deals within the categories of healthcare tracks closely to the trends in dollars invested."}, {"bcbb": "Source: Pitchbook, Sapphire Ventures"}, {"223e": "Focusing on healthcare IT, investors with at least one deal per year in healthcare increased more than fourfold to over 500 investors in 2016, up from just over 125 investors in 2011. Despite the high headline number of unique investors in healthcare IT today, there are far fewer firms actively investing. Specifically, only 32 firms invested in four or more healthcare IT deals in 2016. Moreover, a number of these “active” venture firms are strategic, meaning that there are even fewer healthcare IT-dedicated firms looking for financially-oriented returns."}, {"ac92": "Source: Rock Health"}, {"544f": "So why is there so much recent activity in healthcare investing? In addition to structural reasons (need for lower costs and more efficient processes) and regulatory reasons (ACA, HITECH Act), the renewed interest in healthcare may be driven in part by attractive investment returns with almost $100 billion in distributions from VC-backed healthcare investments over the last four years since 2012. Attractive performance tends to draw more participants into a space."}, {"3c84": "Source: SVB, Rock Health, Pitchbook, Sapphire Ventures"}, {"82cb": "On the M&A front, biopharma still seems to hold a lion’s share of the exit value. Healthcare IT is still waiting on outsized M&A returns, though the amount per annum has generally increased, especially since 2012."}, {"d21b": "Source: SVB, Pitchbook, Sapphire Ventures"}, {"62cc": "For public market listings, biopharma also dominates the majority of value created. Similar to M&A, healthcare IT and services have recently seen a cohort of larger companies going public."}, {"462c": "Source: SVB, Pitchbook, Sapphire Ventures"}, {"1d4a": "As a performance metric for LPs, healthcare IT returns are distributed faster to LPs than general IT returns. That is, LPs may get their money back faster when investing in top-performing venture-backed healthcare IT with relatively similar IRR performance.[1]"}, {"47b2": "Source: Pitchbook"}, {"b607": "[1] DPI: Total fund cash and stock distributions over called capital. Stock distributions valued at date of distribution. IRR: Internal rate of return of fund cash flows, net of fees. DPI and IRR performance does not reflect performance of Sapphire Ventures."}, {"0e6c": "Disclosures:"}, {"ffa8": "The information set forth herein is not intended to constitute investment advice and under no circumstances should any information provided herein be used or considered as an offer to sell or a solicitation of an offer to buy an interest in any investment fund managed by Sapphire Ventures. Sapphire Ventures does not solicit or make its services available to the public and none of the funds are currently open to new investors. Past performance is not indicative of future performance."}, {"8e9b": "Any portfolio companies referred to above do not necessarily represent all of the investments made or recommended by Sapphire Ventures, and were not selected based on the return on Sapphire Ventures’ investment in them. It should not be assumed that any specific investments identified and discussed herein were or will be profitable. Not all investments made by Sapphire Ventures will be profitable or will equal the performance of any of the companies identified above."}], "child": "1316_11316_1"}