{"name": "132", "parent": "", "content": "The Snapchat Generation Saved the Toronto Maple Leafs Last season, the Leafs finished dead last in the NHL standings. Then they drafted Auston Matthews. Led by the 19-year-old rookie, a young Toronto team is back in the playoffs and rejuvenating one of the league’s oldest franchises. It has been a year of milestones for Auston Matthews. In February, the sneaker enthusiast secured a pair of Adidas Yeezy Boost 350 v2 Zebras, celebrating the moment by sharing his grails on social media. Life couldn’t get any better. Later that day, the Toronto Maple Leafs rookie went out and dazzled the Air Canada Centre with a two-goal performance against the Montreal Canadiens, becoming the first Leafs rookie to reach 30 goals since 1989. Not bad for a Saturday. It’s hard to tell which accomplishment was more difficult. Thanks in part to Matthews’s electric season — he finished with an even 40 goals, leading all rookies — the reborn Maple Leafs have in one year gone from being dead last in the NHL to a playoff team. On Thursday, when Toronto takes the ice for its first-round opener against the Eastern Conference top-seed Washington Capitals, it will do so with a collection of young forwards who have combined for the third most points in NHL history by a team’s rookie crop. The Leafs’ offensive Big Three includes their last three first-round picks: Matthews (2016, no. 1 overall), center Mitch Marner (2015, no. 4), and winger William Nylander (2014, no. 8). Call it memes on ice. The kids have not only reversed the decline of a storied Original Six club, they’ve done so while rocking Harambe sweaters, dabbing on beaches, and having trap anthems recorded in their honor. When Toronto was losing, such precocity might have been met with public admonition. The young Leafs, however, have found the tonic to protect against such criticism: winning. Which NHL Team Do We Want to Win the 2017 Stanley Cup?Picking seven teams not named the Blackhawks that could take home the Stanley Cup — or at least make the playoffs funtheringer.com To be reborn, you first need to die. The Leafs’ deterioration began four years ago, at the conclusion of their most recent playoff appearance. Against the Boston Bruins in the 2013 opening round, Toronto fought back from a 3–1 series deficit only to crumble in Game 7 — losing a 4–1 third-period lead in the cruelest way possible. The Leafs and their fans were traumatized, and the malaise spread into the next season, when Toronto posted a winning record but failed to make the playoffs. It was a return to mediocrity for the franchise, which prior to 2013 had gone seven straight seasons without qualifying for the postseason. The nosedive accelerated in 2014–15; Toronto fired coach Randy Carlyle in January and won only six times in regulation over its final 51 games, ending up with the fourth-worst record in the NHL. With futility came fan frustration. At a home game two weeks after Carlyle was fired, several fans threw their Leafs jerseys onto the ice. To make matters worse, the Leafs weren’t even good at failing — in finishing fourth in the lottery, Toronto missed out on drafting Connor McDavid or Jack Eichel. The angst seeped into the media, where the tenuous relationship between the city and top scorer Phil Kessel boiled over. After the 2015 season, the Leafs traded Kessel, in many ways the avatar of both Toronto’s 2013 playoff collapse and the team’s subsequent decline, to the Pittsburgh Penguins. On his way out, his time in Toronto was capped with a Toronto Sun column alleging Kessel made daily stops to a hot dog stand and that the organization “couldn’t stand having him around anymore.” Behind the scenes of the turmoil, however, there were beginning to be signs of light. Team president Brendan Shanahan, who was hired before the 2014–15 season, was working on a plan. In Shanahan’s first draft, the Leafs used the eighth pick of the first round to select Nylander. The following May, Shanahan hired highly esteemed former Detroit head coach Mike Babcock, the winner of a Stanley Cup (Red Wings, 2008) and two Olympic golds (Canada, 2010 and 2014). In the 2015 draft — the McDavid-Eichel one — the Leafs picked fourth and grabbed Marner. One month later, Shanahan hired three-time Cup winner Lou Lamoriello to be the Leafs’ new general manager. At the 2016 trade deadline, Shanahan and Lamoriello jettisoned the contract of defenseman and team captain Dion Phaneuf via trade to Ottawa, clearing long-term cap space. In Babcock’s first season, the Leafs sunk to the very bottom of the NHL. Recordwise, it was the worst season in their century-long history — but somehow it felt better than the year before. With the Shanny-Lou-Babcock triumvirate in place, there was newfound hope. This time Toronto had failed the right way. In the 2016 draft lottery, the Leafs won the first overall pick and the right to select Auston Matthews. The savior of Toronto hockey spent his formative years in the desert. Matthews, whose mother is from Mexico, grew up in Scottsdale and played his first hockey at Ozzie Ice in Phoenix, a complex with two undersized rinks that could accommodate only three-on-three games. As a child, he had to adjust to playing with the puck in tight spaces. “He learned how to stickhandle in a phone booth, then all of a sudden he was put out in a full sheet of ice,” said his father, Brian Matthews. “You’ve just got that much more time to react and execute.” At age 17, Matthews broke the United States National Team Development Program single-season goals record, previously shared by Kessel and Patrick Kane. The following year, with every major college and Canadian junior program begging him to join, he shocked everyone and turned pro, electing to play overseas in Switzerland. His goal was to be as prepared for the NHL as possible before entering the draft. The 2016 first-overall pick left little doubt about his readiness when, in his first career NHL game, he scored four times against the Ottawa Senators. The goals continued to come for Matthews, who broke the single-season franchise record for rookies set by Wendel Clark. The Leafs’ other rookie stars have also made this season memorable. Nylander — the son of retired NHL player Michael — shows the guile of a grizzled veteran on Matthews’s right wing, spacing the ice and wielding a wicked shot that whistles off his stick. Marner, a center turned right-winger, creates space in crowded areas that makes it seem like defenders are trying to avoid him. Along with scoring from James van Riemsdyk and Nazem Kadri, the rookie Big Three will need to produce to compensate for Toronto’s less-than-stellar defense if the Leafs are to stand a chance against Washington. But as heavy underdogs, Toronto is playing with house money. The direction of the franchise is no longer a question; today the only debate is about whether or not Maple Leafs players will be permitted to grow playoff beards given Lamoriello’s past no-facial-hair policy. In Shanahan’s estimation, it’s a question of anatomy, not autonomy. “They’re allowed to,” said the Leafs president. “The question is, can they?” ", "title": "The Snapchat Generation Saved the Toronto Maple Leafs", "sentences": [{"ddae": "The Snapchat Generation Saved the Toronto Maple Leafs"}, {"043c": "Last season, the Leafs finished dead last in the NHL standings. Then they drafted Auston Matthews. Led by the 19-year-old rookie, a young Toronto team is back in the playoffs and rejuvenating one of the league’s oldest franchises."}, {"1233": "It has been a year of milestones for Auston Matthews."}, {"c1c2": "In February, the sneaker enthusiast secured a pair of Adidas Yeezy Boost 350 v2 Zebras, celebrating the moment by sharing his grails on social media. Life couldn’t get any better."}, {"548b": "Later that day, the Toronto Maple Leafs rookie went out and dazzled the Air Canada Centre with a two-goal performance against the Montreal Canadiens, becoming the first Leafs rookie to reach 30 goals since 1989. Not bad for a Saturday. It’s hard to tell which accomplishment was more difficult."}, {"b23b": "Thanks in part to Matthews’s electric season — he finished with an even 40 goals, leading all rookies — the reborn Maple Leafs have in one year gone from being dead last in the NHL to a playoff team. On Thursday, when Toronto takes the ice for its first-round opener against the Eastern Conference top-seed Washington Capitals, it will do so with a collection of young forwards who have combined for the third most points in NHL history by a team’s rookie crop. The Leafs’ offensive Big Three includes their last three first-round picks: Matthews (2016, no. 1 overall), center Mitch Marner (2015, no. 4), and winger William Nylander (2014, no. 8)."}, {"61ec": "Call it memes on ice. The kids have not only reversed the decline of a storied Original Six club, they’ve done so while rocking Harambe sweaters, dabbing on beaches, and having trap anthems recorded in their honor. When Toronto was losing, such precocity might have been met with public admonition. The young Leafs, however, have found the tonic to protect against such criticism: winning."}, {"4be3": "Which NHL Team Do We Want to Win the 2017 Stanley Cup?Picking seven teams not named the Blackhawks that could take home the Stanley Cup — or at least make the playoffs funtheringer.com"}, {"ed12": "To be reborn, you first need to die. The Leafs’ deterioration began four years ago, at the conclusion of their most recent playoff appearance. Against the Boston Bruins in the 2013 opening round, Toronto fought back from a 3–1 series deficit only to crumble in Game 7 — losing a 4–1 third-period lead in the cruelest way possible. The Leafs and their fans were traumatized, and the malaise spread into the next season, when Toronto posted a winning record but failed to make the playoffs. It was a return to mediocrity for the franchise, which prior to 2013 had gone seven straight seasons without qualifying for the postseason."}, {"e838": "The nosedive accelerated in 2014–15; Toronto fired coach Randy Carlyle in January and won only six times in regulation over its final 51 games, ending up with the fourth-worst record in the NHL. With futility came fan frustration. At a home game two weeks after Carlyle was fired, several fans threw their Leafs jerseys onto the ice. To make matters worse, the Leafs weren’t even good at failing — in finishing fourth in the lottery, Toronto missed out on drafting Connor McDavid or Jack Eichel."}, {"fa00": "The angst seeped into the media, where the tenuous relationship between the city and top scorer Phil Kessel boiled over. After the 2015 season, the Leafs traded Kessel, in many ways the avatar of both Toronto’s 2013 playoff collapse and the team’s subsequent decline, to the Pittsburgh Penguins. On his way out, his time in Toronto was capped with a Toronto Sun column alleging Kessel made daily stops to a hot dog stand and that the organization “couldn’t stand having him around anymore.”"}, {"00a5": "Behind the scenes of the turmoil, however, there were beginning to be signs of light. Team president Brendan Shanahan, who was hired before the 2014–15 season, was working on a plan. In Shanahan’s first draft, the Leafs used the eighth pick of the first round to select Nylander. The following May, Shanahan hired highly esteemed former Detroit head coach Mike Babcock, the winner of a Stanley Cup (Red Wings, 2008) and two Olympic golds (Canada, 2010 and 2014). In the 2015 draft — the McDavid-Eichel one — the Leafs picked fourth and grabbed Marner. One month later, Shanahan hired three-time Cup winner Lou Lamoriello to be the Leafs’ new general manager. At the 2016 trade deadline, Shanahan and Lamoriello jettisoned the contract of defenseman and team captain Dion Phaneuf via trade to Ottawa, clearing long-term cap space."}, {"0188": "In Babcock’s first season, the Leafs sunk to the very bottom of the NHL. Recordwise, it was the worst season in their century-long history — but somehow it felt better than the year before. With the Shanny-Lou-Babcock triumvirate in place, there was newfound hope."}, {"e204": "This time Toronto had failed the right way. In the 2016 draft lottery, the Leafs won the first overall pick and the right to select Auston Matthews."}, {"55a1": "The savior of Toronto hockey spent his formative years in the desert. Matthews, whose mother is from Mexico, grew up in Scottsdale and played his first hockey at Ozzie Ice in Phoenix, a complex with two undersized rinks that could accommodate only three-on-three games. As a child, he had to adjust to playing with the puck in tight spaces. “He learned how to stickhandle in a phone booth, then all of a sudden he was put out in a full sheet of ice,” said his father, Brian Matthews. “You’ve just got that much more time to react and execute.”"}, {"55ca": "At age 17, Matthews broke the United States National Team Development Program single-season goals record, previously shared by Kessel and Patrick Kane. The following year, with every major college and Canadian junior program begging him to join, he shocked everyone and turned pro, electing to play overseas in Switzerland. His goal was to be as prepared for the NHL as possible before entering the draft."}, {"4155": "The 2016 first-overall pick left little doubt about his readiness when, in his first career NHL game, he scored four times against the Ottawa Senators. The goals continued to come for Matthews, who broke the single-season franchise record for rookies set by Wendel Clark."}, {"c0ba": "The Leafs’ other rookie stars have also made this season memorable. Nylander — the son of retired NHL player Michael — shows the guile of a grizzled veteran on Matthews’s right wing, spacing the ice and wielding a wicked shot that whistles off his stick. Marner, a center turned right-winger, creates space in crowded areas that makes it seem like defenders are trying to avoid him."}, {"6296": "Along with scoring from James van Riemsdyk and Nazem Kadri, the rookie Big Three will need to produce to compensate for Toronto’s less-than-stellar defense if the Leafs are to stand a chance against Washington. But as heavy underdogs, Toronto is playing with house money."}, {"b4fc": "The direction of the franchise is no longer a question; today the only debate is about whether or not Maple Leafs players will be permitted to grow playoff beards given Lamoriello’s past no-facial-hair policy. In Shanahan’s estimation, it’s a question of anatomy, not autonomy."}, {"3b3c": "“They’re allowed to,” said the Leafs president. “The question is, can they?”"}], "child": "132_1\t132_2\t132_3\t132_4"}