{"name": "1321", "parent": "", "content": "Venture Capital In 2017 Is When The Rubber Hits The Road For Returns This story was originally featured on TechCrunch on January 18, 2017 In the United States, VC funds raised a whopping $40.6 billion in 2016[1]. It was the largest year for VC fundraising since 2000 when the venture industry raked in a jaw dropping $101.4 billion[1]. Yet the 2016 exit market was a mixed bag. Despite many forecasting (hoping?) that herds of unicorns would enter the public market in 2016, the IPO market was lackluster at best. There were only 31 U.S. VC-backed IPOs, down from 76 in 2015 and 121 in 2014[2] (by far the highest number of offerings in recent history). For first time since 2008, not a single IPO in 2016 saw more than $250 million raised, and only four offerings raised more than $100 million[1]. For the IT sector specifically, there were only 14 tech IPOs in 2016, down from 19 in 2015[1]. To say that the VC-backed IPO market slowed over the past two years would be an understatement. What drove this? The IPO market was not uniformly shut. Rather we believe some private VC- backed companies shied away from going public for fear of a chilly reception. The market went from valuing growth to looking for sustainable business metrics, which not all VC-backed companies felt that they had to get the valuations they wanted. M&A activity in tech, on the other hand, dwarfed IPO returns due to multiple mega deals thanks to PE and strategic investors. In 2016, of the 513 VC-backed tech exits in the United States, 499 were M&A events. These M&A exits represent $56.7 billion, versus the mere $9.6 billion exit value from the year’s 14 tech IPOs[1]. So, what does all of this then mean for 2017? Less money overall will be raised by venture funds this year than in 2016 Ok, I admit this one is a bit of a gimme given the $40.6 billion of capital raised in the United States combined with the big league names that closed new “mega” funds (funds of over $500 million) in 2016–24 in total, including Accel, Andreessen Horowitz, Battery Ventures, Founders Fund, General Catalyst, Greylock, Kleiner Perkins Caufied & Byers, Lightspeed Venture Partners, Norwest, Sapphire Ventures, Spark Capital, TCV, Thrive Capital, and the list goes on[1]. A number of notable VC names did not raise in 2016 and could raise 2017 (e.g., Benchmark, CRV, NEA and Sequoia among others). Notwithstanding this it’s hard to see how this year could repeat the total volume of dollars raised in 2016. There simply aren’t enough established brand names still on deck to raise large funds and it is very very hard for first time funds to raise a mega fund. Some investors think 2017 could harken back to the old days when the industry raised as little as $15 billion. For those keeping track we haven’t seen a figure like that since 2009 and 2010 when $16 billion and $13 billion were raised respectively. Fundraising will still be a game of haves and have-nots And the haves in 2017 will be those VCs that have had realized exits. Given last year’s tepid exit market and the rise of down to flat rounds in the private market, LPs will be watching the public stock markets this year with great interest. LPs will increasingly insist on realized returns (aka exits) to differentiate between the haves and have nots. Raising funds based on unrealized returns was fairly commonplace in 2016. This might not be sufficient going forward in 2017 and even tougher for funds coming back in 2018. More first-time funds will be raised 2016 hit an historic low, with only 42 first-time funds that closed, compared to 94 in 2015[1]. Fundraising can also take a while; especially for new(er) managers it can take anywhere from 12 to 24+ months before a close. All signs point to a backlog. Thus, I expect the number of first-time funds to go up in 2017 as managers who started raising in 2016, and a handful of those beginning to raise this year, will close their funds in the next 12 months. That said, I don’t anticipate 2017 to return to the halcyon days of 2014 when 120 first-time funds were raised. There is a notable noise to signal challenge for LPs given the hundreds of microfunds raised over the past few years coupled with LPs’ desire to see how the fund managers they have backed in the past few years mature before adding new funds to their respective portfolios. Buckle up, valuations will be a bumpy ride Many startups raised toward the end of 2015 when fundraising was still heavily focused on “growth” versus “metrics”. Therefore, they didn’t need to come back for more capital in 2016. But they will this year, and what sort of reception should they expect? Like most things in life (sigh), it’ll depend on who you are. On the supply side, there’s a lot of money sitting in venture funds waiting to be invested. A lot. Some funds raised in 2016 have yet to start investing. Plus many funds that were actively investing in 2016 slowed their pacing meaning this year they’ll be looking to put their money to work. That said, if the exit market remains tepid and interest rates rise, then later-stage and cross-over investors that supported the “private IPO” market will continue to be motivated to take their toys and go elsewhere. This could keep the pressure on valuations and venture investors who are hunting for companies hitting milestones/metrics. On the flip side, if the exit market opens up (which everyone I’ve spoken to fervently hopes it will) and IPOs kick off again, then VCs who are sitting on an abundance of capital will all be eager to invest their dollars. And this could cause bidding wars and push valuations up. The net-net? Expect continued high valuations for the best assets — how high will depend on how frothy the market becomes. For some second-tier assets, we foresee continued valuation pressure leading to continued down or flat rounds along with more recaps unless there is a significant positive change in the exit markets. M&A exits will keep climbing both in volume and value For tech companies looking to exit the private market, the prospect of getting acquired may well be more promising than going public (and trading low) or raising a down round. With record amounts of cash on corporate balance sheets (potentially even more if corporations are motivated to repatriate off shore funds by the incoming administration) and significant dry powder in PE funds, there are lots of reasons to believe both corporations and PE shops will continue to acquire IT assets. Moreover, we believe non-traditional buyers will keep jumping into the game of acquiring mature startups in hopes of getting an edge on innovation (e.g. Walmart, GM, Unilever). In fact, at the end of 2016, non-tech acquirers became more common than tech companies in deals for $1 billion+ startups. All this to say, there’s lots of interest and supply for tech M&A — which is never a bad thing. Lastly we are keeping our eye on secondary sales If there is insufficient liquidity in 2017, met by a growing demand for exits to lay the groundwork for future venture fund fundraising, then stay tuned for a growing secondary market with private equity and dedicated secondary funds as willing buyers. The secondary market has already become a new reality for entrepreneurs, and we believe it will become so for venture funds as well. [1] Pitchbook data as of 12/31/2016, Sapphire Ventures analysis[2] Pitchbook 2016 US PE & VC IPO Trends Report ", "title": "Venture Capital In 2017 Is When The Rubber Hits The Road For Returns", "sentences": [{"41ca": "Venture Capital In 2017 Is When The Rubber Hits The Road For Returns"}, {"9bc5": "This story was originally featured on TechCrunch on January 18, 2017"}, {"3ded": "In the United States, VC funds raised a whopping $40.6 billion in 2016[1]. It was the largest year for VC fundraising since 2000 when the venture industry raked in a jaw dropping $101.4 billion[1]. Yet the 2016 exit market was a mixed bag."}, {"a82d": "Despite many forecasting (hoping?) that herds of unicorns would enter the public market in 2016, the IPO market was lackluster at best. There were only 31 U.S. VC-backed IPOs, down from 76 in 2015 and 121 in 2014[2] (by far the highest number of offerings in recent history). For first time since 2008, not a single IPO in 2016 saw more than $250 million raised, and only four offerings raised more than $100 million[1]."}, {"7449": "For the IT sector specifically, there were only 14 tech IPOs in 2016, down from 19 in 2015[1]. To say that the VC-backed IPO market slowed over the past two years would be an understatement. What drove this?"}, {"5542": "The IPO market was not uniformly shut. Rather we believe some private VC- backed companies shied away from going public for fear of a chilly reception. The market went from valuing growth to looking for sustainable business metrics, which not all VC-backed companies felt that they had to get the valuations they wanted."}, {"2b2c": "M&A activity in tech, on the other hand, dwarfed IPO returns due to multiple mega deals thanks to PE and strategic investors. In 2016, of the 513 VC-backed tech exits in the United States, 499 were M&A events. These M&A exits represent $56.7 billion, versus the mere $9.6 billion exit value from the year’s 14 tech IPOs[1]."}, {"f41e": "So, what does all of this then mean for 2017?"}, {"d995": "Less money overall will be raised by venture funds this year than in 2016"}, {"3e06": "Ok, I admit this one is a bit of a gimme given the $40.6 billion of capital raised in the United States combined with the big league names that closed new “mega” funds (funds of over $500 million) in 2016–24 in total, including Accel, Andreessen Horowitz, Battery Ventures, Founders Fund, General Catalyst, Greylock, Kleiner Perkins Caufied & Byers, Lightspeed Venture Partners, Norwest, Sapphire Ventures, Spark Capital, TCV, Thrive Capital, and the list goes on[1]."}, {"ecb8": "A number of notable VC names did not raise in 2016 and could raise 2017 (e.g., Benchmark, CRV, NEA and Sequoia among others). Notwithstanding this it’s hard to see how this year could repeat the total volume of dollars raised in 2016. There simply aren’t enough established brand names still on deck to raise large funds and it is very very hard for first time funds to raise a mega fund."}, {"48b7": "Some investors think 2017 could harken back to the old days when the industry raised as little as $15 billion. For those keeping track we haven’t seen a figure like that since 2009 and 2010 when $16 billion and $13 billion were raised respectively."}, {"29b7": "Fundraising will still be a game of haves and have-nots"}, {"5634": "And the haves in 2017 will be those VCs that have had realized exits. Given last year’s tepid exit market and the rise of down to flat rounds in the private market, LPs will be watching the public stock markets this year with great interest. LPs will increasingly insist on realized returns (aka exits) to differentiate between the haves and have nots. Raising funds based on unrealized returns was fairly commonplace in 2016. This might not be sufficient going forward in 2017 and even tougher for funds coming back in 2018."}, {"1453": "More first-time funds will be raised"}, {"e10f": "2016 hit an historic low, with only 42 first-time funds that closed, compared to 94 in 2015[1]. Fundraising can also take a while; especially for new(er) managers it can take anywhere from 12 to 24+ months before a close. All signs point to a backlog."}, {"03c7": "Thus, I expect the number of first-time funds to go up in 2017 as managers who started raising in 2016, and a handful of those beginning to raise this year, will close their funds in the next 12 months. That said, I don’t anticipate 2017 to return to the halcyon days of 2014 when 120 first-time funds were raised. There is a notable noise to signal challenge for LPs given the hundreds of microfunds raised over the past few years coupled with LPs’ desire to see how the fund managers they have backed in the past few years mature before adding new funds to their respective portfolios."}, {"2beb": "Buckle up, valuations will be a bumpy ride"}, {"398d": "Many startups raised toward the end of 2015 when fundraising was still heavily focused on “growth” versus “metrics”. Therefore, they didn’t need to come back for more capital in 2016. But they will this year, and what sort of reception should they expect?"}, {"fa81": "Like most things in life (sigh), it’ll depend on who you are. On the supply side, there’s a lot of money sitting in venture funds waiting to be invested. A lot. Some funds raised in 2016 have yet to start investing. Plus many funds that were actively investing in 2016 slowed their pacing meaning this year they’ll be looking to put their money to work."}, {"e1ff": "That said, if the exit market remains tepid and interest rates rise, then later-stage and cross-over investors that supported the “private IPO” market will continue to be motivated to take their toys and go elsewhere. This could keep the pressure on valuations and venture investors who are hunting for companies hitting milestones/metrics. On the flip side, if the exit market opens up (which everyone I’ve spoken to fervently hopes it will) and IPOs kick off again, then VCs who are sitting on an abundance of capital will all be eager to invest their dollars. And this could cause bidding wars and push valuations up."}, {"523a": "The net-net? Expect continued high valuations for the best assets — how high will depend on how frothy the market becomes. For some second-tier assets, we foresee continued valuation pressure leading to continued down or flat rounds along with more recaps unless there is a significant positive change in the exit markets."}, {"b7fb": "M&A exits will keep climbing both in volume and value"}, {"c021": "For tech companies looking to exit the private market, the prospect of getting acquired may well be more promising than going public (and trading low) or raising a down round. With record amounts of cash on corporate balance sheets (potentially even more if corporations are motivated to repatriate off shore funds by the incoming administration) and significant dry powder in PE funds, there are lots of reasons to believe both corporations and PE shops will continue to acquire IT assets."}, {"2977": "Moreover, we believe non-traditional buyers will keep jumping into the game of acquiring mature startups in hopes of getting an edge on innovation (e.g. Walmart, GM, Unilever). In fact, at the end of 2016, non-tech acquirers became more common than tech companies in deals for $1 billion+ startups."}, {"45b4": "All this to say, there’s lots of interest and supply for tech M&A — which is never a bad thing."}, {"9d11": "Lastly we are keeping our eye on secondary sales"}, {"c422": "If there is insufficient liquidity in 2017, met by a growing demand for exits to lay the groundwork for future venture fund fundraising, then stay tuned for a growing secondary market with private equity and dedicated secondary funds as willing buyers. The secondary market has already become a new reality for entrepreneurs, and we believe it will become so for venture funds as well."}, {"2958": "[1] Pitchbook data as of 12/31/2016, Sapphire Ventures analysis[2] Pitchbook 2016 US PE & VC IPO Trends Report"}], "child": "1321_1\t1321_2\t1321_3"}