{"name": "133", "parent": "", "content": "Don’t Worry About O.J. Howard’s Numbers The 2017 tight end class put together one of the most impressive combines in the past 20 years. Even though none of this year’s prospects have particularly impressive receiving stats, NFL teams should pay for potential. When he stomped through the NFL combine like it was an elementary school field day, O.J. Howard confirmed what many already suspected: He’s the sort of physical marvel that we don’t often see playing tight end. A former five-star recruit, the Alabama product has a combination of traits that forces scouts to take a cold shower, and the combine carved that notion into stone. At 251 pounds, the 6-foot-6 Howard posted a 4.51 in the 40-yard dash — a full 0.3 seconds faster than expected at his size and the best weight-adjusted time of the entire weekend, according to Chase Stuart. His 121-inch broad jump puts him in the 86th percentile at his position since 1999, and his 6.85 seconds in the three-cone drill placed him in the 92nd. In the 60-yard shuttle, only two tight ends over the past 17 years — Harvard’s Ben Braunecker (2016) and Oklahoma’s James Hanna (2012) — posted better times than Howard’s 11.46 seconds. In short, Howard took the measuring stick that is the combine and snapped it over his knee. Howard is all but guaranteed to hear his name called two weeks from today during the first round of the NFL draft, but in trying to project exactly how high he’ll go, Howard’s production with the Crimson Tide (or lack thereof) is a complicating factor. By this point, nearly every prognostication the internet has to offer puts Howard in the first half of the first round. In version 3.0 of his mock draft this week, our own Danny Kelly had Howard going 14th overall to Philadelphia. If Howard does end up coming off the board that early, he’d be just the sixth tight end since 2000 to be drafted in the top 15. Shift that to the top 10, and the group shrinks even more. Since Vernon Davis went sixth overall after his historic combine showing in 2006, only Detroit’s Eric Ebron has cracked the first 10 picks. As teams consider snagging Howard in the range normally reserved for potential superstars, they have to ask themselves why a player with his gifts caught only 45 passes during his final year in college. The Ringer’s 2017 NFL Mock Draft, Version 3.0Jamal Adams and Malik Hooker might be two of the best prospects, but is a safety ever worth a top-five pick?theringer.com What’s odd about the apparent gap between Howard’s staggering athletic profile and his lack of college impact is that in this draft, it isn’t odd at all. The 2017 tight end class is — comfortably — the most physically talented group in two decades. Their average (!) 40-yard dash time of 4.66 seconds is the best since 2003. According to Mockdraftable’s database, 62 tight ends since 1999 have run the 40 in less than 4.65 seconds; eight of them did it this year. Go to the broad jump, and things get even more ridiculous. Nine of the top 50 (and six of the top 15) jumps in that span came from this year’s class. This isn’t about players getting gradually more athletic over time, either. In 2016, the Giants’ Jerell Adams ran a combine-best 4.64 for tight ends in the 40; this year, seven players bested that mark. However you slice it, the 2017 group is an outlier when it comes to performance testing. The question now, starting with Howard and trickling down, is how well those tests translate to NFL production — and how much college stats even matter in projecting professional success. While Howard’s production at Alabama and the college stats from the rest of the class seem less than stellar, they might not actually be that disappointing compared to other high-level tight end prospects from previous years. Looking at some of the numbers for recent first-round tight ends, I’d contend that Howard’s overall impact for the Tide is close to what we typically see at the position. (Getty Images) Howard caught 45 passes last season at Alabama, but with all the disparate offensive systems in college football, it’s better to consider what that number represents in relation to the team’s receiving production as a whole. Including the handful of completions from two backup QBs, the Tide completed 265 passes in 2016, which means a 16.9 percent reception share for Howard. That’s lower than any of his first-round contemporaries, but not that much lower. Ebron caught 21.9 percent of North Carolina’s passes during this final season in Chapel Hill. Dustin Keller, the 30th overall pick by the Jets in 2008, caught 68 passes in his senior season at Purdue, but for the pass-happy Boilermakers, that meant only 18.4 percent of the total receptions. Jermaine Gresham’s 66 catches for the prolific 2008 Sooners barely cracked one-fifth of Sam Bradford’s completion total (20.1 percent), and in 2006, Greg Olsen snagged only 18.8 percent of Miami’s receptions. If we move beyond highly drafted (and for the most part, underperforming) tight ends and start inspecting the numbers for the guys who’ve actually produced in the league, the stats are similar. Jordan Reed’s output during his final year at Florida was almost identical to Howard’s junior season with the Tide: 45 catches for 559 yards and three touchdowns. For the quarterback-needy Gators, that reception total made up 24.5 percent of Florida’s total completions. Travis Kelce also finished his final collegiate season with 45 catches, good for 21.4 percent of Cincinnati’s receptions. Back issues caused Rob Gronkowski to miss three games during his last season at Arizona, but when he was on the field, Gronk’s 47 catches accounted for 17.7 percent of Arizona’s receiving production. These numbers are obviously higher than Howard’s share of Alabama’s work, but they’re similar to what many other tight end prospects did at the collegiate level. The Biggest Draft Need for All 32 NFL TeamsFree agency filled a bunch of holes across the league, but it also created some, too. Just ask Jerry Jones.theringer.com In college offenses, even the most talented tight end prospects typically hover between 20 and 25 percent of their team’s total receiving production. Even if Howard falls slightly below that threshold, he is still within shouting distance, and the college production of his scary-athletic draft mates puts them right in that 20–25 percent range. South Alabama’s Gerald Everett, who ran the 40 in 4.62 seconds and leapt an incredible 126 inches in the broad jump (95th percentile among tight ends), caught 21 percent of his team’s receptions last season. Ole Miss product Evan Engram, who, among tight ends, ran a combine-best 4.42 in the 40, was at 21.8 percent. Potential first-round pick David Njoku from Miami checked in slightly worse than Howard, at 16.3 percent. As a group, the players who ran roughshod through this year’s combine caught at least 40 passes and showed up on the field in a comparable way to tight ends we’ve seen in the past. The main exception happens to be one of my favorite prospects in this year’s draft. Howard, Engram, and Njoku were expected to wow in Indianapolis, so when they did, the response was akin to the scouting version of a polite but restrained golf clap. With a few exceptions, George Kittle wasn’t considered a challenger to that group, athletically. That view lasted about as long as it took him to finish his 40. Kittle was a straight-up monster on the turf in Indy. The Iowa tight end’s 4.52 in the 40 was the 15th-fastest at the position since ’99. Kittle’s 132-inch broad jump put him in the 98th percentile among all tight ends. We have no reason to think this dude isn’t from the future. Crowning the NFL Draft of the GenerationThe star-studded 2007 and 2011 draft classes are far and away the best in recent NFL history. Which one is superior?theringer.com For those of us who aren’t draftniks — and even for many who are — Kittle’s clinic sent people scurrying to both his college box scores and the film to figure out who the hell this guy is. The answer involves a fascinating set of variables. On the season, Kittle hauled in 22 receptions. In terms of total production, that sets him apart from the other top tight ends in this class, but Kittle suffered a foot injury that caused him to miss four of Iowa’s 13 games. When he was on the field for the ground-and-pound Hawkeyes, his 22 catches made up 17.1 percent of the team’s receptions, which puts him right in line with both Howard and Njoku. So in terms of athletic profile and production, Kittle compares to just about every other terrifying prospect in this class. That leaves blocking as the main area left to evaluate. Oh, hello. Check out the rest of that thread. I’ll wait here a minute. At 6-foot-4 and 247 pounds, Kittle doesn’t have the prototype length for an in-line tight end, but he sure has the attitude for it. He seems to derive a perverse enjoyment out of leaving cartoon imprints of defenders in the turf. For a guy who moves as well as he does, there’s a rare level of willingness and effort to knock people around. Like so many of the players in this class, Kittle checks enough boxes to create plenty of intrigue. Other tight ends have destroyed the combine, but isn’t hasn’t always translated to NFL success. The best example for how tantalizing but ultimately frustrating a set of jaw-dropping physical traits can be is probably Jared Cook, who the Titans took in the third round of the 2009 draft. Cook, who caught 37 passes for 573 yards during his final season at South Carolina, looked like the Terminator during his weekend at the combine. At 6-foot-5 and 246 pounds, he tore off a 4.5 in the 40, posted a LeBronesque 41-inch vertical leap, and exploded for a 123-inch broad jump (91st percentile). When he’s running around in shorts, Cook is the type of player who makes evaluators salivate, but in eight NFL seasons, his on-field impact has never quite lined up with his special set of tools. Cook’s playoff showing with the Packers last season (18 catches for 229 yards and two touchdowns in three games) was the highlight of his career and helped to earn him a two-year, $10.6 million contract with the Raiders this offseason. But the one-year, $2.75 million deal he signed with Green Bay last offseason was indicative of where his value stood before spending time with Aaron Rodgers. The Pros and Cons of the Star Running Backs in This DraftInitial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and the extremely underrated Alvin…theringer.com Beyond Cook, there are plenty of other examples that prove being big and fast doesn’t guarantee success for NFL tight ends. James Hanna, one of those two players since ’99 to post a better time than Howard in the 60-yard shuttle, wrecked the combine, posting scores in the 89th percentile or better in every speed and explosion test. Before missing the entire 2016 season with a knee injury, he had 33 receptions in four seasons. Denver’s Virgil Green tore up the testing in 2011. In six seasons, he’s never caught more than 22 passes. Rob Housler was a combine monster out of FAU that same year; he’s been on three teams since coming into the league. According to Mockdraftable, the player most physically similar to Housler in its database is the recently retired Jordan Cameron. His showing in Indianapolis was downright absurd, with times in the 40, 20-yard shuttle, and three-cone drill that rival any that a tight end has had in the past 20 years. In his lone season of college football at USC, the former basketball player caught just 16 passes, but before his career was lost to concussions, Cameron developed into a more than capable NFL tight end who eventually caught 157 more passes in the league than he caught during his entire college career. For Jimmy Graham, who hauled in 17 collegiate passes, that gap currently sits at 482. Graham and Cameron are clearly exceptions who spent most of their time on campus playing hoops, but the point stands: There isn’t a minimum amount college production required for a tight end to succeed in the NFL. Even for players who took a more traditional route, status as the no. 1 receiving option on a college team or a couple of 75-catch seasons under your belt is by no means necessary to become an All-Pro option. Reed’s nearly identical line to Howard’s during their last seasons in college is the most encouraging example. Howard and the rest of his draft mates have entered elite company with their physical traits, and those skills — along with whatever position-specific talents they bring to the table — are considerably more relevant than the numbers they put up in the collegiate ranks. If teams believe that Howard (or anyone else in this group) is special, a reception total should be the last thing that scares them off. ", "title": "Don’t Worry About O.J. Howard’s Numbers", "sentences": [{"9290": "Don’t Worry About O.J. Howard’s Numbers"}, {"2c55": "The 2017 tight end class put together one of the most impressive combines in the past 20 years. Even though none of this year’s prospects have particularly impressive receiving stats, NFL teams should pay for potential."}, {"c399": "When he stomped through the NFL combine like it was an elementary school field day, O.J. Howard confirmed what many already suspected: He’s the sort of physical marvel that we don’t often see playing tight end. A former five-star recruit, the Alabama product has a combination of traits that forces scouts to take a cold shower, and the combine carved that notion into stone."}, {"c556": "At 251 pounds, the 6-foot-6 Howard posted a 4.51 in the 40-yard dash — a full 0.3 seconds faster than expected at his size and the best weight-adjusted time of the entire weekend, according to Chase Stuart. His 121-inch broad jump puts him in the 86th percentile at his position since 1999, and his 6.85 seconds in the three-cone drill placed him in the 92nd. In the 60-yard shuttle, only two tight ends over the past 17 years — Harvard’s Ben Braunecker (2016) and Oklahoma’s James Hanna (2012) — posted better times than Howard’s 11.46 seconds. In short, Howard took the measuring stick that is the combine and snapped it over his knee."}, {"1d42": "Howard is all but guaranteed to hear his name called two weeks from today during the first round of the NFL draft, but in trying to project exactly how high he’ll go, Howard’s production with the Crimson Tide (or lack thereof) is a complicating factor. By this point, nearly every prognostication the internet has to offer puts Howard in the first half of the first round. In version 3.0 of his mock draft this week, our own Danny Kelly had Howard going 14th overall to Philadelphia. If Howard does end up coming off the board that early, he’d be just the sixth tight end since 2000 to be drafted in the top 15. Shift that to the top 10, and the group shrinks even more. Since Vernon Davis went sixth overall after his historic combine showing in 2006, only Detroit’s Eric Ebron has cracked the first 10 picks. As teams consider snagging Howard in the range normally reserved for potential superstars, they have to ask themselves why a player with his gifts caught only 45 passes during his final year in college."}, {"1630": "The Ringer’s 2017 NFL Mock Draft, Version 3.0Jamal Adams and Malik Hooker might be two of the best prospects, but is a safety ever worth a top-five pick?theringer.com"}, {"c90d": "What’s odd about the apparent gap between Howard’s staggering athletic profile and his lack of college impact is that in this draft, it isn’t odd at all. The 2017 tight end class is — comfortably — the most physically talented group in two decades. Their average (!) 40-yard dash time of 4.66 seconds is the best since 2003. According to Mockdraftable’s database, 62 tight ends since 1999 have run the 40 in less than 4.65 seconds; eight of them did it this year. Go to the broad jump, and things get even more ridiculous. Nine of the top 50 (and six of the top 15) jumps in that span came from this year’s class. This isn’t about players getting gradually more athletic over time, either. In 2016, the Giants’ Jerell Adams ran a combine-best 4.64 for tight ends in the 40; this year, seven players bested that mark. However you slice it, the 2017 group is an outlier when it comes to performance testing. The question now, starting with Howard and trickling down, is how well those tests translate to NFL production — and how much college stats even matter in projecting professional success."}, {"f5d7": "While Howard’s production at Alabama and the college stats from the rest of the class seem less than stellar, they might not actually be that disappointing compared to other high-level tight end prospects from previous years. Looking at some of the numbers for recent first-round tight ends, I’d contend that Howard’s overall impact for the Tide is close to what we typically see at the position."}, {"cd9a": "(Getty Images)"}, {"e934": "Howard caught 45 passes last season at Alabama, but with all the disparate offensive systems in college football, it’s better to consider what that number represents in relation to the team’s receiving production as a whole. Including the handful of completions from two backup QBs, the Tide completed 265 passes in 2016, which means a 16.9 percent reception share for Howard. That’s lower than any of his first-round contemporaries, but not that much lower. Ebron caught 21.9 percent of North Carolina’s passes during this final season in Chapel Hill. Dustin Keller, the 30th overall pick by the Jets in 2008, caught 68 passes in his senior season at Purdue, but for the pass-happy Boilermakers, that meant only 18.4 percent of the total receptions. Jermaine Gresham’s 66 catches for the prolific 2008 Sooners barely cracked one-fifth of Sam Bradford’s completion total (20.1 percent), and in 2006, Greg Olsen snagged only 18.8 percent of Miami’s receptions."}, {"dd27": "If we move beyond highly drafted (and for the most part, underperforming) tight ends and start inspecting the numbers for the guys who’ve actually produced in the league, the stats are similar. Jordan Reed’s output during his final year at Florida was almost identical to Howard’s junior season with the Tide: 45 catches for 559 yards and three touchdowns. For the quarterback-needy Gators, that reception total made up 24.5 percent of Florida’s total completions. Travis Kelce also finished his final collegiate season with 45 catches, good for 21.4 percent of Cincinnati’s receptions. Back issues caused Rob Gronkowski to miss three games during his last season at Arizona, but when he was on the field, Gronk’s 47 catches accounted for 17.7 percent of Arizona’s receiving production. These numbers are obviously higher than Howard’s share of Alabama’s work, but they’re similar to what many other tight end prospects did at the collegiate level."}, {"962c": "The Biggest Draft Need for All 32 NFL TeamsFree agency filled a bunch of holes across the league, but it also created some, too. Just ask Jerry Jones.theringer.com"}, {"a13e": "In college offenses, even the most talented tight end prospects typically hover between 20 and 25 percent of their team’s total receiving production. Even if Howard falls slightly below that threshold, he is still within shouting distance, and the college production of his scary-athletic draft mates puts them right in that 20–25 percent range. South Alabama’s Gerald Everett, who ran the 40 in 4.62 seconds and leapt an incredible 126 inches in the broad jump (95th percentile among tight ends), caught 21 percent of his team’s receptions last season. Ole Miss product Evan Engram, who, among tight ends, ran a combine-best 4.42 in the 40, was at 21.8 percent. Potential first-round pick David Njoku from Miami checked in slightly worse than Howard, at 16.3 percent. As a group, the players who ran roughshod through this year’s combine caught at least 40 passes and showed up on the field in a comparable way to tight ends we’ve seen in the past."}, {"f91e": "The main exception happens to be one of my favorite prospects in this year’s draft. Howard, Engram, and Njoku were expected to wow in Indianapolis, so when they did, the response was akin to the scouting version of a polite but restrained golf clap. With a few exceptions, George Kittle wasn’t considered a challenger to that group, athletically. That view lasted about as long as it took him to finish his 40. Kittle was a straight-up monster on the turf in Indy. The Iowa tight end’s 4.52 in the 40 was the 15th-fastest at the position since ’99. Kittle’s 132-inch broad jump put him in the 98th percentile among all tight ends. We have no reason to think this dude isn’t from the future."}, {"0270": "Crowning the NFL Draft of the GenerationThe star-studded 2007 and 2011 draft classes are far and away the best in recent NFL history. Which one is superior?theringer.com"}, {"8cb1": "For those of us who aren’t draftniks — and even for many who are — Kittle’s clinic sent people scurrying to both his college box scores and the film to figure out who the hell this guy is. The answer involves a fascinating set of variables. On the season, Kittle hauled in 22 receptions. In terms of total production, that sets him apart from the other top tight ends in this class, but Kittle suffered a foot injury that caused him to miss four of Iowa’s 13 games. When he was on the field for the ground-and-pound Hawkeyes, his 22 catches made up 17.1 percent of the team’s receptions, which puts him right in line with both Howard and Njoku."}, {"bde3": "So in terms of athletic profile and production, Kittle compares to just about every other terrifying prospect in this class. That leaves blocking as the main area left to evaluate."}, {"73e1": "Oh, hello. Check out the rest of that thread. I’ll wait here a minute."}, {"75ae": "At 6-foot-4 and 247 pounds, Kittle doesn’t have the prototype length for an in-line tight end, but he sure has the attitude for it. He seems to derive a perverse enjoyment out of leaving cartoon imprints of defenders in the turf. For a guy who moves as well as he does, there’s a rare level of willingness and effort to knock people around."}, {"2f19": "Like so many of the players in this class, Kittle checks enough boxes to create plenty of intrigue."}, {"b946": "Other tight ends have destroyed the combine, but isn’t hasn’t always translated to NFL success."}, {"2314": "The best example for how tantalizing but ultimately frustrating a set of jaw-dropping physical traits can be is probably Jared Cook, who the Titans took in the third round of the 2009 draft. Cook, who caught 37 passes for 573 yards during his final season at South Carolina, looked like the Terminator during his weekend at the combine. At 6-foot-5 and 246 pounds, he tore off a 4.5 in the 40, posted a LeBronesque 41-inch vertical leap, and exploded for a 123-inch broad jump (91st percentile). When he’s running around in shorts, Cook is the type of player who makes evaluators salivate, but in eight NFL seasons, his on-field impact has never quite lined up with his special set of tools. Cook’s playoff showing with the Packers last season (18 catches for 229 yards and two touchdowns in three games) was the highlight of his career and helped to earn him a two-year, $10.6 million contract with the Raiders this offseason. But the one-year, $2.75 million deal he signed with Green Bay last offseason was indicative of where his value stood before spending time with Aaron Rodgers."}, {"7809": "The Pros and Cons of the Star Running Backs in This DraftInitial scouting impressions of Leonard Fournette, Dalvin Cook, Christian McCaffrey, and the extremely underrated Alvin…theringer.com"}, {"d1d9": "Beyond Cook, there are plenty of other examples that prove being big and fast doesn’t guarantee success for NFL tight ends. James Hanna, one of those two players since ’99 to post a better time than Howard in the 60-yard shuttle, wrecked the combine, posting scores in the 89th percentile or better in every speed and explosion test. Before missing the entire 2016 season with a knee injury, he had 33 receptions in four seasons. Denver’s Virgil Green tore up the testing in 2011. In six seasons, he’s never caught more than 22 passes. Rob Housler was a combine monster out of FAU that same year; he’s been on three teams since coming into the league."}, {"3392": "According to Mockdraftable, the player most physically similar to Housler in its database is the recently retired Jordan Cameron. His showing in Indianapolis was downright absurd, with times in the 40, 20-yard shuttle, and three-cone drill that rival any that a tight end has had in the past 20 years. In his lone season of college football at USC, the former basketball player caught just 16 passes, but before his career was lost to concussions, Cameron developed into a more than capable NFL tight end who eventually caught 157 more passes in the league than he caught during his entire college career. For Jimmy Graham, who hauled in 17 collegiate passes, that gap currently sits at 482."}, {"382e": "Graham and Cameron are clearly exceptions who spent most of their time on campus playing hoops, but the point stands: There isn’t a minimum amount college production required for a tight end to succeed in the NFL. Even for players who took a more traditional route, status as the no. 1 receiving option on a college team or a couple of 75-catch seasons under your belt is by no means necessary to become an All-Pro option. Reed’s nearly identical line to Howard’s during their last seasons in college is the most encouraging example."}, {"df47": "Howard and the rest of his draft mates have entered elite company with their physical traits, and those skills — along with whatever position-specific talents they bring to the table — are considerably more relevant than the numbers they put up in the collegiate ranks. If teams believe that Howard (or anyone else in this group) is special, a reception total should be the last thing that scares them off."}], "child": "133_1\t133_2\t133_3\t133_4"}