{"name": "1338", "parent": "", "content": "What’s Happening To SaaS Valuations? A look at the state of the public markets and how they may impact private SaaS companies We’ve all heard it at this point. The market has changed, the tides have turned. Sloppy growth is out. Profits and efficient growth are in. In the land of SaaS, the average multiple across all SaaS companies has been cut by half since the all-time high in 2014. Public SaaS forward revenue multiples up to April 5, 2016. Source: S&P Capital IQ, Sapphire Ventures Analysis But what’s going on behind the scenes? It’s now been well over a decade since SaaS business models first became widespread, and the line in the chart above reflects an index of SaaS companies all with varying degrees of growth, profitability, and other dynamics. Let’s take a look at growth specifically, and see how the market was rewarding it before the latest drop. Below is a chart from July 2015, when the NASDAQ was at its most recent high: Source: S&P Capital IQ, Sapphire Ventures Analysis Across the board, there was a strong correlation* between revenue growth and revenue multiple assigned. I won’t bother showing the graph charting multiples against profitability, or any kind of efficiency metric, as there was no discernible correlation. The truth is in many cases in 2015, the market rewarded growth regardless of how sustainably it was acquired. Since then, the average SaaS multiple has fallen by 30 percent, but not everyone was affected equally. It’s true the whole stock market (beyond tech) is down from the high, but looking closer at what’s happened we can start to fact-check what folks are saying about the rebalancing of growth versus profits. Below I’ve charted public SaaS companies’ revenue multiples at the July 2015 NASDAQ peak on the y-axis, and how much they’ve fallen since then on the x-axis. The dots are color coded to discern between profitable versus not profitable, and fast growing versus slow growing. Below that are the aggregate changes of the groups. Source: S&P Capital IQ, Sapphire Ventures Analysis The medians for each group before and after. Source: S&P Capital IQ, Sapphire Ventures Analysis There are various conclusions one can draw from the different buckets, but what jumps out most is that it looks like the premium for growth has been cut substantially: the growth buckets (blue and red) saw a much more dramatic drop in multiples compared to their not-growing counterparts. For companies that earn positive profits, fast growers now command a multiple only 14 percent higher (+0.6x) than their non-growing counterparts, compared to nearly 50 percent higher (+2.3x) last July. For those that do not earn profits, the change is even more substantial: the multiple is around 100 percent higher (+2.2x) for fast-growers, but was about 200 percent higher (+4.3x) last year. The Fast Growing and Not Profitable (red) bucket is most relevant to us as private SaaS investors given the companies we invest in operate most often with that profile. In that group, multiples have come down by almost 40 percent since the July peak, and the companies now trade at a discount to companies who generate profits but are not growing fast. In other words, public investors are putting more weight on the bottom line versus growing the top line than they did before. Since the private, venture-backed counterparts of these companies are often growing even faster and losing money to an even greater extent than their public cousins, one could even argue that private market multiples might be slashed to an even greater degree. So what does this mean for the private financing environment, which eventually looks to the public market for what to do? Given the precipitous fall in the “red” bucket, I think this all but confirms folks’ opinions that sloppy growth will no longer earn companies extra points. All else held equal, I believe that growth will continue to garner some premium, but not nearly to the extent it once did. Companies that demonstrate sustainable unit economics and a credible path to profitability will attract capital at better valuations than their peers growing at unsustainable rates. I’m excited to see what the next few years will hold, as I believe this new restraint will cause the best-run companies to prosper. It’s been tough for many companies to compete over the last several years, as abundant capital raised the price of practically everything for them: acquiring customers, hiring talent, renting an office, etc. It feels to me like the quest for growth at all costs became an irresistible phenomenon, making it easy for folks to ignore burn, unit economics, and other important business metrics — while unfortunately pulling in those who dared to resist for fear of being brute-forced by the competition. But as the public markets and venture capitalists may tell you, it’s looking like those days are now over. *Based on an R-squared of 0.4931. Disclosures: Information provided reflects Sapphire Ventures’ views as of a particular time. Such views are subject to change without notice. While Sapphire Ventures has used reasonable efforts to obtain information from reliable sources, we make no representations or warranties as to the accuracy, reliability or completeness of third party information presented herein. Unless otherwise indicated, market analysis and conclusions are based on opinions or assumptions that Sapphire Ventures considers to be reasonable. The statements contained herein that are not historical facts are forward-looking statements. The forward-looking statements are based on current expectations, beliefs, assumptions, estimates, and projections about the industry and markets. Forward-looking statements contained herein are not guarantees of future performance and involve certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Sapphire Ventures is under no obligation, and does not intend, to update any forward-looking statements to reflect changes in the underlying assumptions or factors, new information, future events, or other changes. The information set forth herein is not intended to constitute investment advice and under no circumstances should any information provided herein be considered as an offer to sell or a solicitation of an offer to buy an interest in any investment fund. ", "title": "What’s Happening To SaaS Valuations?", "sentences": [{"07ac": "What’s Happening To SaaS Valuations?"}, {"ad3a": "A look at the state of the public markets and how they may impact private SaaS companies"}, {"87d7": "We’ve all heard it at this point. The market has changed, the tides have turned. Sloppy growth is out. Profits and efficient growth are in. In the land of SaaS, the average multiple across all SaaS companies has been cut by half since the all-time high in 2014."}, {"f4a8": "Public SaaS forward revenue multiples up to April 5, 2016. Source: S&P Capital IQ, Sapphire Ventures Analysis"}, {"7a5d": "But what’s going on behind the scenes? It’s now been well over a decade since SaaS business models first became widespread, and the line in the chart above reflects an index of SaaS companies all with varying degrees of growth, profitability, and other dynamics."}, {"32f4": "Let’s take a look at growth specifically, and see how the market was rewarding it before the latest drop. Below is a chart from July 2015, when the NASDAQ was at its most recent high:"}, {"68ae": "Source: S&P Capital IQ, Sapphire Ventures Analysis"}, {"c6dc": "Across the board, there was a strong correlation* between revenue growth and revenue multiple assigned. I won’t bother showing the graph charting multiples against profitability, or any kind of efficiency metric, as there was no discernible correlation. The truth is in many cases in 2015, the market rewarded growth regardless of how sustainably it was acquired."}, {"053a": "Since then, the average SaaS multiple has fallen by 30 percent, but not everyone was affected equally. It’s true the whole stock market (beyond tech) is down from the high, but looking closer at what’s happened we can start to fact-check what folks are saying about the rebalancing of growth versus profits. Below I’ve charted public SaaS companies’ revenue multiples at the July 2015 NASDAQ peak on the y-axis, and how much they’ve fallen since then on the x-axis. The dots are color coded to discern between profitable versus not profitable, and fast growing versus slow growing. Below that are the aggregate changes of the groups."}, {"a0a9": "Source: S&P Capital IQ, Sapphire Ventures Analysis"}, {"a402": "The medians for each group before and after. Source: S&P Capital IQ, Sapphire Ventures Analysis"}, {"3f14": "There are various conclusions one can draw from the different buckets, but what jumps out most is that it looks like the premium for growth has been cut substantially: the growth buckets (blue and red) saw a much more dramatic drop in multiples compared to their not-growing counterparts. For companies that earn positive profits, fast growers now command a multiple only 14 percent higher (+0.6x) than their non-growing counterparts, compared to nearly 50 percent higher (+2.3x) last July. For those that do not earn profits, the change is even more substantial: the multiple is around 100 percent higher (+2.2x) for fast-growers, but was about 200 percent higher (+4.3x) last year."}, {"98c9": "The Fast Growing and Not Profitable (red) bucket is most relevant to us as private SaaS investors given the companies we invest in operate most often with that profile. In that group, multiples have come down by almost 40 percent since the July peak, and the companies now trade at a discount to companies who generate profits but are not growing fast. In other words, public investors are putting more weight on the bottom line versus growing the top line than they did before. Since the private, venture-backed counterparts of these companies are often growing even faster and losing money to an even greater extent than their public cousins, one could even argue that private market multiples might be slashed to an even greater degree."}, {"075a": "So what does this mean for the private financing environment, which eventually looks to the public market for what to do? Given the precipitous fall in the “red” bucket, I think this all but confirms folks’ opinions that sloppy growth will no longer earn companies extra points. All else held equal, I believe that growth will continue to garner some premium, but not nearly to the extent it once did. Companies that demonstrate sustainable unit economics and a credible path to profitability will attract capital at better valuations than their peers growing at unsustainable rates."}, {"f4b6": "I’m excited to see what the next few years will hold, as I believe this new restraint will cause the best-run companies to prosper. It’s been tough for many companies to compete over the last several years, as abundant capital raised the price of practically everything for them: acquiring customers, hiring talent, renting an office, etc. It feels to me like the quest for growth at all costs became an irresistible phenomenon, making it easy for folks to ignore burn, unit economics, and other important business metrics — while unfortunately pulling in those who dared to resist for fear of being brute-forced by the competition. But as the public markets and venture capitalists may tell you, it’s looking like those days are now over."}, {"ac6a": "*Based on an R-squared of 0.4931."}, {"7c32": "Disclosures:"}, {"88da": "Information provided reflects Sapphire Ventures’ views as of a particular time. Such views are subject to change without notice. While Sapphire Ventures has used reasonable efforts to obtain information from reliable sources, we make no representations or warranties as to the accuracy, reliability or completeness of third party information presented herein. Unless otherwise indicated, market analysis and conclusions are based on opinions or assumptions that Sapphire Ventures considers to be reasonable."}, {"b3cd": "The statements contained herein that are not historical facts are forward-looking statements. The forward-looking statements are based on current expectations, beliefs, assumptions, estimates, and projections about the industry and markets. Forward-looking statements contained herein are not guarantees of future performance and involve certain risks, uncertainties, and assumptions that are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Sapphire Ventures is under no obligation, and does not intend, to update any forward-looking statements to reflect changes in the underlying assumptions or factors, new information, future events, or other changes."}, {"caf1": "The information set forth herein is not intended to constitute investment advice and under no circumstances should any information provided herein be considered as an offer to sell or a solicitation of an offer to buy an interest in any investment fund."}], "child": "1338_1\t1338_2\t1338_3\t1338_4\t1338_5\t1338_61338_1\t1338_2\t1338_3\t1338_4\t1338_5\t1338_6"}