{"name": "134", "parent": "", "content": "Malcolm Jenkins on What Effect Trump Will Have on the NFL The current administration can put some of the league’s players in a challenging position Eight-year NFL veteran Malcolm Jenkins is a former Pro Bowler, a Super Bowl champion, and an activist. He’s one of the players who protested during the national anthem, following Colin Kaepernick’s lead throughout the season. But the NFL — like the country — is in a different place now than it was in the fall of 2016. Jenkins joined Kevin Clark on The Ringer NFL Show to discuss how his outspokenness has been handled by the Eagles and how the new Trump administration could affect the NFL. Jenkins has been outspoken not only during the national anthem, but in interviews and on Twitter as well. When asked about whether he’s received any pushback from the team, Jenkins responded: “I personally didn’t. And I think it’s because of who I am on the team. There is a little bit more trust in my thoughtfulness, but I know it wasn’t the same for every player. There are teams like the Dolphins where the owner has the organization rise [for the anthem], there’s teams like San Francisco who backed Colin Kaepernick fully and matched his donation of a million dollars [to local charities]. Then there’s other ones who, I won’t put any names to it, are really good friends with our president and are on the opposite end of that. So, it’s hard for me to tell guys on different teams in different positions how to navigate this environment, because it changes depending on which team you’re on.” He also addressed how the 2016 election will reverberate in the NFL and what the Trump presidency means. “Now you have a president who, so far, has not mentioned anything about criminal justice reform, has talked about stop-and-frisk, has talked about sending more police to Chicago, [has made] more executive orders to back and support police without doing anything to back and support communities, [and] has talked about cutting the budget that includes community and police relationship-building. Because that’s the direction that this administration is going, there is a huge push to wake people out right now. Before he redoes everything that’s been put in place, and we take steps back and then things get worse.” When it comes to Trump, would Jenkins join a team whose owner supports the White House? Jenkins doesn’t see that kind of protest as effective: “I mean, business is business. It’s kind of a trend right now that, ‘If you don’t agree with [my] philosophy, I cannot support or I can’t even sit in the same room with you.’ I think that’s a bad precedent to set. But I will not go to a team that will not allow me to use my voice and use my right to free speech. That I will not do. If you had somebody who is forcing their will and their status upon you to suppress you, then that’s totally different. And so far, we haven’t heard any of that or haven’t had any hard evidence, but just like I know I might not support this president, I can’t knock other people who do. What I can do is sit down and talk and listen to why they do and what concerns they have and vice versa.” Listen to the full podcast here. This transcript has been edited and condensed. ", "title": "Malcolm Jenkins on What Effect Trump Will Have on the NFL", "sentences": [{"f69a": "Malcolm Jenkins on What Effect Trump Will Have on the NFL"}, {"111d": "The current administration can put some of the league’s players in a challenging position"}, {"802c": "Eight-year NFL veteran Malcolm Jenkins is a former Pro Bowler, a Super Bowl champion, and an activist. He’s one of the players who protested during the national anthem, following Colin Kaepernick’s lead throughout the season. But the NFL — like the country — is in a different place now than it was in the fall of 2016. Jenkins joined Kevin Clark on The Ringer NFL Show to discuss how his outspokenness has been handled by the Eagles and how the new Trump administration could affect the NFL."}, {"e858": "Jenkins has been outspoken not only during the national anthem, but in interviews and on Twitter as well. When asked about whether he’s received any pushback from the team, Jenkins responded:"}, {"4207": "“I personally didn’t. And I think it’s because of who I am on the team. There is a little bit more trust in my thoughtfulness, but I know it wasn’t the same for every player. There are teams like the Dolphins where the owner has the organization rise [for the anthem], there’s teams like San Francisco who backed Colin Kaepernick fully and matched his donation of a million dollars [to local charities]. Then there’s other ones who, I won’t put any names to it, are really good friends with our president and are on the opposite end of that. So, it’s hard for me to tell guys on different teams in different positions how to navigate this environment, because it changes depending on which team you’re on.”"}, {"be18": "He also addressed how the 2016 election will reverberate in the NFL and what the Trump presidency means."}, {"1b8b": "“Now you have a president who, so far, has not mentioned anything about criminal justice reform, has talked about stop-and-frisk, has talked about sending more police to Chicago, [has made] more executive orders to back and support police without doing anything to back and support communities, [and] has talked about cutting the budget that includes community and police relationship-building. Because that’s the direction that this administration is going, there is a huge push to wake people out right now. Before he redoes everything that’s been put in place, and we take steps back and then things get worse.”"}, {"4002": "When it comes to Trump, would Jenkins join a team whose owner supports the White House? Jenkins doesn’t see that kind of protest as effective:"}, {"020e": "“I mean, business is business. It’s kind of a trend right now that, ‘If you don’t agree with [my] philosophy, I cannot support or I can’t even sit in the same room with you.’ I think that’s a bad precedent to set. But I will not go to a team that will not allow me to use my voice and use my right to free speech. That I will not do. If you had somebody who is forcing their will and their status upon you to suppress you, then that’s totally different. And so far, we haven’t heard any of that or haven’t had any hard evidence, but just like I know I might not support this president, I can’t knock other people who do. What I can do is sit down and talk and listen to why they do and what concerns they have and vice versa.”"}, {"9714": "Listen to the full podcast here. This transcript has been edited and condensed."}], "child": "134_1"}