{"name": "1346", "parent": "", "content": "Medium’s New Funding Round We are pleased to announce that Medium recently raised $57 million in capital. The round was led by new partner Andreessen Horowitz with significant participation from Google Ventures and Greylock Partners, who also led our Series A. We are also fortunate to count Obvious Ventures, The Chernin Group, and a number of our Series A angels as investors this round. And, of course, Ev, who founded Medium and remains our majority shareholder. This investment strengthens Medium for the foreseeable future and allows us to continue, heads down, running hard to fully realize our vision. Medium was created in 2012 and opened to the public in October of 2013. Since the beginning, we have offered a simple and elegant writing tool combined with a network centered around participation. Less than two years later, Medium is home to well-known influencers and regular contributors, as well as people who don’t write consistently but have discovered Medium as the place to share thoughtful insights, entertaining perspectives, and moving human stories with the world. More than 20,000 people write on Medium each week, and their words are enjoyed, considered, and debated by millions. Many digital media companies are trapped in a negative cycle. Distribution happens primarily through networks that optimize clickthrough over quality, forcing creators to learn content and marketing parlor tricks instead of allowing them to focus on creating fresh perspectives. This has left a large and influential audience underserved. It has forced advertisers to look elsewhere for deeper engagement. And it has frustrated individual writers and organized media brands alike. At Medium we operate in a fundamentally different way. We don’t focus on pageviews, unique visitors, or click metrics. We don’t litter the platform with ads that are low quality, high clutter. We don’t tolerate bad behavior in the community. And we don’t violate people’s privacy. We aim to surface quality. Every action on Medium is shared with our network, meaning everyone is an influencer. Whether you post, highlight, recommend, or respond — Medium helps you move other people, see issues through a different lens, change minds, and inspire action. We are confident this is the best model for both creators and audience in the long run. When we set out to raise capital, we looked for advisers who love our product and will help us identify and seize big opportunities. We were immediately attracted to a16z and GV. Ben Horowitz has exceptional perspective on company building, both as an operator and an investor. M.G. Siegler — in addition to being one of our favorite writers on Medium — has deep expertise on the intersection of technology and media. And we are fortunate to continue our great relationship with David Sze, Josh Elman, and the rest of the team at Greylock, whose advice and support has been invaluable these past two years. With this round we aim to make Medium the dominant pipeline for connecting quality content and conversation. As a reader you will find all of the best stories and ideas on the internet, personalized for your interests and made richer by the activity of your Medium network. As a creator you will find Medium the best place to build a voice, develop your own audience, and create value for yourself and others. We have big plans. We are hosting an event on October 7 to announce some exciting new product features and partnerships. After that event we will share the presentation here, on our publication. But don’t wait until then to tell us your thoughts. You can reach us at yourfriends@medium.com or, even faster, respond below. ", "title": "Medium’s New Funding Round", "sentences": [{"1b45": "Medium’s New Funding Round"}, {"4595": "We are pleased to announce that Medium recently raised $57 million in capital. The round was led by new partner Andreessen Horowitz with significant participation from Google Ventures and Greylock Partners, who also led our Series A. We are also fortunate to count Obvious Ventures, The Chernin Group, and a number of our Series A angels as investors this round. And, of course, Ev, who founded Medium and remains our majority shareholder. This investment strengthens Medium for the foreseeable future and allows us to continue, heads down, running hard to fully realize our vision."}, {"ca1c": "Medium was created in 2012 and opened to the public in October of 2013. Since the beginning, we have offered a simple and elegant writing tool combined with a network centered around participation. Less than two years later, Medium is home to well-known influencers and regular contributors, as well as people who don’t write consistently but have discovered Medium as the place to share thoughtful insights, entertaining perspectives, and moving human stories with the world. More than 20,000 people write on Medium each week, and their words are enjoyed, considered, and debated by millions."}, {"303d": "Many digital media companies are trapped in a negative cycle. Distribution happens primarily through networks that optimize clickthrough over quality, forcing creators to learn content and marketing parlor tricks instead of allowing them to focus on creating fresh perspectives. This has left a large and influential audience underserved. It has forced advertisers to look elsewhere for deeper engagement. And it has frustrated individual writers and organized media brands alike."}, {"2aa7": "At Medium we operate in a fundamentally different way. We don’t focus on pageviews, unique visitors, or click metrics. We don’t litter the platform with ads that are low quality, high clutter. We don’t tolerate bad behavior in the community. And we don’t violate people’s privacy."}, {"d24f": "We aim to surface quality. Every action on Medium is shared with our network, meaning everyone is an influencer. Whether you post, highlight, recommend, or respond — Medium helps you move other people, see issues through a different lens, change minds, and inspire action. We are confident this is the best model for both creators and audience in the long run."}, {"8053": "When we set out to raise capital, we looked for advisers who love our product and will help us identify and seize big opportunities. We were immediately attracted to a16z and GV. Ben Horowitz has exceptional perspective on company building, both as an operator and an investor. M.G. Siegler — in addition to being one of our favorite writers on Medium — has deep expertise on the intersection of technology and media. And we are fortunate to continue our great relationship with David Sze, Josh Elman, and the rest of the team at Greylock, whose advice and support has been invaluable these past two years."}, {"6946": "With this round we aim to make Medium the dominant pipeline for connecting quality content and conversation. As a reader you will find all of the best stories and ideas on the internet, personalized for your interests and made richer by the activity of your Medium network. As a creator you will find Medium the best place to build a voice, develop your own audience, and create value for yourself and others."}, {"db4f": "We have big plans."}, {"e424": "We are hosting an event on October 7 to announce some exciting new product features and partnerships. After that event we will share the presentation here, on our publication."}, {"50a3": "But don’t wait until then to tell us your thoughts. You can reach us at yourfriends@medium.com or, even faster, respond below."}], "child": "1346_1\t1346_2\t1346_3\t1346_4\t1346_5\t1346_6\t1346_7\t1346_8\t1346_9\t1346_10\t1346_11\t1346_12\t1346_13\t1346_14\t1346_15\t1346_16\t1346_17\t1346_18\t1346_19\t1346_20\t1346_21\t1346_22\t1346_231346_1\t1346_2\t1346_3\t1346_4\t1346_5\t1346_6\t1346_7\t1346_8\t1346_9\t1346_10\t1346_11\t1346_12\t1346_13\t1346_14\t1346_15\t1346_16\t1346_17\t1346_18\t1346_19\t1346_20\t1346_21\t1346_22\t1346_231346_1\t1346_2\t1346_3\t1346_4\t1346_5\t1346_6\t1346_7\t1346_8\t1346_9\t1346_10\t1346_11\t1346_12\t1346_13\t1346_14\t1346_15\t1346_16\t1346_17\t1346_18\t1346_19\t1346_20\t1346_21\t1346_22\t1346_231346_1\t1346_2\t1346_3\t1346_4\t1346_5\t1346_6\t1346_7\t1346_8\t1346_9\t1346_10\t1346_11\t1346_12\t1346_13\t1346_14\t1346_15\t1346_16\t1346_17\t1346_18\t1346_19\t1346_20\t1346_21\t1346_22\t1346_23"}