{"name": "1347", "parent": "", "content": "Why your startup idea isn’t big enough for some VCs The one, simple equation that every VC knows. Venture Capital functions with a power law where the majority of a fund’s returns come from a small percentage of investments. Because of this, VCs need to know if a single investment can return the entire fund. As Bill Gurley famously said “Venture capital is not even a home run business. It’s a grand slam business.” This is where the Return The Fund (RTF) analysis comes into play. http://www.sethlevine.com/archives/2014/08/venture-outcomes-are-even-more-skewed-than-you-think.html If we assume an exit distribution where over 60% of a fund’s investments are 0–2x their money, with the remainder falling somewhere between 2–5x, a “unicorn” type 10x+ outcome can put a venture fund into the desired 3x fund returns that puts them among the top performers in VC. Your 1–3 investments that “return the fund” and probably even more (the grand slam), is what will make or break you, while the other 2x-5x investments create additional alpha. The math for a RTF analysis is pretty simple: Fund Size / % owned at exit = Minimum Viable Exit To show how this works, let’s take the hottest new deep learning, autonomous vehicle startup built on the blockchain, XY.ai, as an example. XY.ai is raising a $2M seed round at a $10M post-money valuation (selling 20% of their company). VC Fund A is a $50M seed fund investing $1M So in order to pass the RTF analysis, VC Fund A must believe that XY.ai will exit for at least $500M and more realistically $625M. Now let’s look at a larger fund model. VC Fund B is a $250M seed + series A fund investing $1M in XY.ai. For more data of equity ownership at exits check out EquityZen’s Path to IPO. As an investor, the difference between a company exiting for $500M vs. $2.5B is not trivial. Less than 10% of all VC-backed exits in 2016 were $500M+, per CB Insights. Jet.com was the only US-based VC-backed tech company to exit for over $2.5B. As a founder, this trickles down to thinking about their potential investor’s philosophy. While some businesses are best built to exit in the hundreds of millions of dollars, larger funds could push startups through their natural inflection/exit points in order to go for broke and hit a grand slam that is very unlikely to occur. While the RTF analysis is a good barometer for investments, it is indeed just one data point in the larger diligence process. It is a quick way to gut check ownership and investment size, and also allows investors to think about how they will need to build their positions over time. But while this thought process is generally useful, like all things in startups, there are outliers. For further reading + data on investment processes and exits, see below: The Investment Memo - NextView VenturesVC evaluation of seed-stage startups can seem arbitrary or imitative at times. Internally, the scarcity of tangible…nextviewventures.com Convertible and SAFE NotesAngel/seed rounds used to be done via priced equity securities, either common or preferred. Then, starting about ten…avc.com The Babe Ruth Effect in Venture Capital\"How to hit home runs: I swing as hard as I can, and I try to swing right through the ball... The harder you grip the…cdixon.org Power Laws in VentureThe more rightward-skewed the distribution is, whether Pareto-Levy, log normal, or some related form, the more…reactionwheel.net Analyzing $100 Million Tech Exits in Asia, Europe and the USLooking at data around $100M+ exits across the United States, Asia, and Europe since 2011. Among venture-backed exits…www.cbinsights.com Brains or a Bull Market? It's a Good Time to Be a Venture CapitalistThe number of venture capitalists investing in billion dollar exits is increasing. By a lot. Has the surge of billion…www.cbinsights.com Which Venture Capital Firms Are Consistently In The Largest Tech Exits?Three VC firms - Sequoia, NEA, and Accel - are consistently in the top 5 when it comes to participation in the 100…www.cbinsights.com ", "title": "Why your startup idea isn’t big enough for some VCs", "sentences": [{"34d5": "Why your startup idea isn’t big enough for some VCs"}, {"ae93": "The one, simple equation that every VC knows."}, {"4922": "Venture Capital functions with a power law where the majority of a fund’s returns come from a small percentage of investments. Because of this, VCs need to know if a single investment can return the entire fund. As Bill Gurley famously said “Venture capital is not even a home run business. It’s a grand slam business.” This is where the Return The Fund (RTF) analysis comes into play."}, {"1d90": "http://www.sethlevine.com/archives/2014/08/venture-outcomes-are-even-more-skewed-than-you-think.html"}, {"5f8e": "If we assume an exit distribution where over 60% of a fund’s investments are 0–2x their money, with the remainder falling somewhere between 2–5x, a “unicorn” type 10x+ outcome can put a venture fund into the desired 3x fund returns that puts them among the top performers in VC. Your 1–3 investments that “return the fund” and probably even more (the grand slam), is what will make or break you, while the other 2x-5x investments create additional alpha."}, {"eb5a": "The math for a RTF analysis is pretty simple:"}, {"7573": "Fund Size / % owned at exit = Minimum Viable Exit"}, {"dc74": "To show how this works, let’s take the hottest new deep learning, autonomous vehicle startup built on the blockchain, XY.ai, as an example."}, {"9751": "XY.ai is raising a $2M seed round at a $10M post-money valuation (selling 20% of their company)."}, {"199f": "VC Fund A is a $50M seed fund investing $1M"}, {"ea92": "So in order to pass the RTF analysis, VC Fund A must believe that XY.ai will exit for at least $500M and more realistically $625M."}, {"54c5": "Now let’s look at a larger fund model."}, {"6b9d": "VC Fund B is a $250M seed + series A fund investing $1M in XY.ai."}, {"83db": "For more data of equity ownership at exits check out EquityZen’s Path to IPO."}, {"62e4": "As an investor, the difference between a company exiting for $500M vs. $2.5B is not trivial. Less than 10% of all VC-backed exits in 2016 were $500M+, per CB Insights. Jet.com was the only US-based VC-backed tech company to exit for over $2.5B."}, {"678f": "As a founder, this trickles down to thinking about their potential investor’s philosophy. While some businesses are best built to exit in the hundreds of millions of dollars, larger funds could push startups through their natural inflection/exit points in order to go for broke and hit a grand slam that is very unlikely to occur."}, {"5d29": "While the RTF analysis is a good barometer for investments, it is indeed just one data point in the larger diligence process. It is a quick way to gut check ownership and investment size, and also allows investors to think about how they will need to build their positions over time. But while this thought process is generally useful, like all things in startups, there are outliers."}, {"43cc": "For further reading + data on investment processes and exits, see below:"}, {"80e1": "The Investment Memo - NextView VenturesVC evaluation of seed-stage startups can seem arbitrary or imitative at times. Internally, the scarcity of tangible…nextviewventures.com"}, {"6b9b": "Convertible and SAFE NotesAngel/seed rounds used to be done via priced equity securities, either common or preferred. Then, starting about ten…avc.com"}, {"fd47": "The Babe Ruth Effect in Venture Capital\"How to hit home runs: I swing as hard as I can, and I try to swing right through the ball... The harder you grip the…cdixon.org"}, {"c4dc": "Power Laws in VentureThe more rightward-skewed the distribution is, whether Pareto-Levy, log normal, or some related form, the more…reactionwheel.net"}, {"0d6d": "Analyzing $100 Million Tech Exits in Asia, Europe and the USLooking at data around $100M+ exits across the United States, Asia, and Europe since 2011. Among venture-backed exits…www.cbinsights.com"}, {"cf30": "Brains or a Bull Market? It's a Good Time to Be a Venture CapitalistThe number of venture capitalists investing in billion dollar exits is increasing. By a lot. Has the surge of billion…www.cbinsights.com"}, {"1004": "Which Venture Capital Firms Are Consistently In The Largest Tech Exits?Three VC firms - Sequoia, NEA, and Accel - are consistently in the top 5 when it comes to participation in the 100…www.cbinsights.com"}], "child": "1347_1\t1347_2\t1347_3\t1347_4\t1347_5\t1347_6\t1347_7\t1347_8\t1347_9\t1347_10\t1347_11\t1347_12\t1347_13\t1347_14\t1347_151347_1\t1347_2\t1347_3\t1347_4\t1347_5\t1347_6\t1347_7\t1347_8\t1347_9\t1347_10\t1347_11\t1347_12\t1347_13\t1347_14\t1347_15"}