{"name": "1349", "parent": "", "content": "Patrick Collison has a Few Questions for Tyler Subscribe to the podcast: iTunes / SoundCloud / Stitcher / RSS A few months ago, Tyler asked Patrick Collison, CEO of Stripe, to be on the show. Patrick agreed, but only under the condition that he would do the interviewing. Thus, what follows is the conversation Patrick wanted to have with Tyler, not the one you wanted to have. Happily Patrick stayed true to the spirit of Conversations with Tyler, and their dialogue covers a wide range of topics including the benefits of diverse monocultures, the state of macroeconomics, Donald Trump, the amazing and eclectic economics faculty at George Mason University, Peter Thiel, Brian Eno, Thomas Schelling, why Twitter is underrated, and — most pressing of all — why Marginal Revolution is so strange looking. Listen to the full conversation Read the full transcript This conversation was recorded at Stripe’s San Fransisco office in late January 2017. PATRICK COLLISON: Thank you all very much for coming. I would typically start out with a lengthy introduction of the speaker’s various accomplishments and things that make them notable and noteworthy. But Tyler told me that de rigueur in these conversations is to keep them to 90 minutes. So I don’t think I can really go far down that list in this case. Suffice it to say that you’ve published 15 books? Is that the right count? TYLER COWEN: I don’t know; I’ve no idea. [laughter] COWEN: I think it’s more! [laughs] Patrick’s research stack for Tyler COLLISON: Well, he’s published at least the number of books in the stack here, along with — actually, I think, second from the top is his new book, which is about to come out, which I trust you’ve all preordered on Amazon. I won’t be offended, or I’m sure Tyler won’t be offended, if you all take out your phone and go ahead and order it right now: The Complacent Class; I highly recommend it. And published more than 60 papers, obviously: the author of The Great Stagnation, which I think was the work that really brought you to top of mind, at least here in Silicon Valley. Tyler has visited every US state with the exception of Alaska, I just learned. And then, I think, really most impressively and noteworthy of all, Bloomberg Businessweek named him “America’s hottest economist” back . . . I think, was it two, three years ago? COWEN: It was before I worked for them. [laughter] COLLISON: Before he worked for them and before the era of fake news. COWEN: [laughs] COLLISON: So you can all trust it. It’s out of this conversation. COWEN: My mother put it on her Facebook page. On Paul Romer and the last thirty years of macroeconomics COLLISON: [laughs] So, the first thing I wanted to ask you about is, you’re an economist, at least originally. And Paul Romer, who’s now, of course, the chief economist at the World Bank, he opened his most recent paper with the assertion that for the last 30 years, macroeconomics has been going backwards. And I looked into this and I realized that Tyler got his PhD exactly 30 years ago. I don’t necessarily want to imply anything causal, but do you agree with Paul? COWEN: [laughs] I don’t agree with Paul. I think we understand credit crunches much better than we used to. We understand the structure of asset returns and when and why risk matters, compared to earlier times. Models where you have multiple equilibria, where more than one thing can happen, we understand better. I don’t think we’ve solved any ability to predict business cycles or market crashes or Great Recessions. In that sense, there’s not progress, but I think the best theories often imply they’re intrinsically difficult to predict. So I think we ask much better questions, and on that particular issue of science, I’m much more optimistic than is Paul Romer. COLLISON: What do you think of the paper itself and the claims in it? COWEN: I thought the paper was quite a polemic. Writing a polemic can be useful. It attracts attention. It jolts people out of their “dogmatic slumbers,” to use the old philosophical term. But that said, a lot of the debate ended up being about either Paul Romer or a particular group of macroeconomists, rather than about what macroeconomics should do. So I think a central question for macroeconomics is economic growth. I think our understanding of the determinants of growth, just like our understanding of how well science does, is extremely poor. Much of that is ultimately cultural, and bridging economic and cultural ideas we’re very bad at. And I think macro has neglected that centrally important topic. That would be my main critique of macro. But it would be phrased more gently than Paul’s. COLLISON: I would take it that’s partially because of your differences in temperament and not just the differences in belief structure. COWEN: Yes. But Paul — when I talk with him, he has a very gentle temperament. So I don’t actually have a good theory of Paul. I get on with him very well; I enjoy exchanging ideas with him. But sometimes he’s a firebrand when he writes. COLLISON: I want to dig in on this question, where you just mentioned how we have much better models now, but you touched on this notion of our predictive ability. And it seems to me that the old joke about economists, where economics is the field where you can win the Nobel Prize for proving or for showing x, and then later, you can go on to win it for showing that x is in fact false. And the Nobel Prize in ’74, when Myrdal and Hayek shared it, was evidence for this. But the thing I wanted to ask you is how much progress you think is actually possible here. We’re still having the debate as to what exactly is the nature of the relationship between interest rates and inflation. Right? COWEN: Sure. COLLISON: And does one drive the other? And in which direction? What’s the nature of the comovement, and so on? Or was the Washington Consensus correct? Is the Washington Consensus correct? How much freedom around the movement of capital should there be in developing nations, and so on? What’s the right policy to adopt if you’re a developing country? And it seems to me that . . . well, I won’t answer what it seems to me. I’ll ask you the question, To what degree do you have confidence that economics will ever get to durable answers to these questions, and what do you imagine the version of the Paul Romer paper in 30 years to look like? COWEN: Frank Knight once said something wise, maybe overstated, but he said, “The main function of economics was to offset the stupid theorizing of other people.” So it’s very useful as a form of discipline. And economics is a way of thinking — it’s very useful for inoculating you against other kinds of mistakes, even though in some ways, it may be a mistake itself. But I would say, in macro, we’re very good at retrodiction. If you look at the Great Recession, and you try to trace when and where were the bad mortgages made, and which banks held them, and when did they go bad, we can trace that with a level of detail and care, that, say, we couldn’t have done for the 1979-1982 recession. And that’s a scientific advance. But in terms of control, we believed in the great moderation; we were wrong. Now we’re probably wrong again. You have people like Jeremy Stein, who are convinced the Fed shouldn’t be holding rates down, people like Paul Krugman, who are more or less convinced they should have been. And given that we cannot rerun alternate histories, I don’t think statistics simply getting better will ever settle a lot of these key questions. So economics will always be hovering between art and science. COLLISON: Will it always be retrodictive, or does it become predictive at some point? COWEN: I don’t think it will be predictive any time soon, not in our lifetimes. Not on a lot of important issues. There’s plenty of micro where it’s predictive. So people who work at Uber, they have a dataset and they can now answer questions with that. That works pretty well. COLLISON: OK, on what basis should we then be making macroeconomic decisions? COWEN: Well, we have to make macroeconomic decisions. To do nothing is also a macroeconomic decision. COLLISON: Right. [laughs] COWEN: I think the notion of having a Federal Reserve System that is predictable and tries to keep the nominal flow of purchasing power growing at some steady rate, we know that something like that is close to the best we can do in a fairly impressionistic way. And that’s really important. People didn’t know that in 1929. It’s a huge victory for the contemporary world. COLLISON: So do you think that, from a forward-looking standpoint, we should try to come up with some very minimal set of stable rules along the lines of what you just mentioned? And after that, the, again, forward-looking predictive efforts we’ve done most of as much as we are likely to be able to do, and everything after that is filling in the details on what happened, ex post. COWEN: I agree with that, but I would add another caveat. If you have a good rule, you have to wonder if all systems — including the US Constitution — all systems in the world eventually can be gamed. It could be your macro rule would be good for a long time, but it could be gamed if only through people figuring out how to use politics to distort or lie about the indicators. So I’m not sure there’s an eternal solution, but I think there are policy semi-solutions that at least are good for 20 or 30 years. COLLISON: You’re touching on this notion that maybe economics is a lot of post-hoc illustrative power. COWEN: Yes. On culture and economics COLLISON: Uncertain how much predictive power it has. You’ve written a lot about how the study of economics has influenced your appreciation for the arts, and for literature, and for food, and all of the rest. You haven’t written as much about the influence in the reverse direction. How has your appreciation for and study of the arts influenced your study of economics? And is this a version of that? COWEN: This is a version of that. Here would be a simple example: If you think about Renaissance Florence, at its peak, its population, arguably, was between 60,000 and 80,000 people. And there were surrounding areas; you could debate the number. But they had some really quite remarkable achievements that have stood the test of time and lasted, and today have very high market value. Now, in very naive theories of economics, that shouldn’t be possible. People in Renaissance Florence, they didn’t produce a refrigerator that we’re still using or a tech company that we still consult. But there’s something different about, say, the visual arts, where that was possible, and it was done with small numbers. So there’s something about the inputs to some kinds of production we don’t understand. I would suggest if we’re trying to figure out, like what makes Silicon Valley work, actually, by studying how they did what they did in the Florentine Renaissance is highly important. You learn what are the missing inputs that make for other kinds of miracles. Ireland and writing would be another example. COLLISON: [laughs] What fraction of tenured economists in the US do you think would agree with your take on the predictive power of macroeconomics? COWEN: There’s really a sharp distinction here between people who do macro and people who don’t. So those who don’t are typically pretty cynical, but I think they’re actually too cynical. Macro is the favored whipping boy of a lot of economists. And the public is always upset at the macroeconomy, so you’ll always find an audience for this. But I think macro is slightly underrated. But then in macro, you have too many people who are simply too arrogant. They think they’re working on God’s chosen method in different ways. And that’s wrong also; it’s much more pluralistic than that. You’re just grabbing parts of the elephant in a fairly blind way, I think. COLLISON: What field outside of economics has the most to say about macroeconomics? COWEN: Well, if you’re discounting statistics or econometrics, I think psychology. Some form of social psychology. COLLISON: You mean, along the lines of . . . COWEN: Why there’s contagion of beliefs, why beliefs move together, why people move to fear and panic. COLLISON: Yep, yep, the behavioral stuff? COWEN: That’s right. COLLISON: Yeah. What are the, say, top two most underinvested areas of economics today? COWEN: Culture and economics, for me, is by far the most underinvested. I still think randomized control trials, they’re expensive, but you do actually learn things from them, which are probably true. That’s remarkable. [laughter] COWEN: They contain actual knowledge. Now, it’s true the questions you can ask are narrower, but it seems odd to turn down the reward of actual knowledge, right? [laughs] COLLISON: You recently linked to the new book whose title is escaping me — you’ll probably remember it — on the series of interviews on random control trials in economics. And there’s all these questions about to what degree they have external validity and so on. Do you think the critics are overstating the case? COWEN: One of the main criticisms is, if you do randomized control trials, you’re studying something like, “Well, does paying mothers to bring their children in for vaccines work in getting the mothers to bring the children in?” You’re not asking big-picture questions of political economy. But big-picture questions of political economy — they can be very hard to control. There’s no one who can steer, say, what will happen with India or Kenya, but you can change some policy regarding, “Do you reward mothers for bringing their children in for vaccinations?” You know the subtitle of our blog, “Small Steps Toward a Much Better World”: there’s something to that. We can make a lot of these small steps. It’s also related to the correct attitude about management. A lot of good management is doing very small things and not always some grand philosophy. So I think this is actually still underrated. COLLISON: You said that culture is one of the most underinvested areas. COWEN: Yes. COLLISON: And you’ve written several books about culture, but among them Creative Destruction, and this is, at least as I read it, on the face of it, a defense of the effects of globalization on culture, right? And that while globalization might cause a decrease in across-country cultural diversity, we shouldn’t look at it at some God’s eye view, objective level. We should instead be focused on the individual, the subjective, and the operative level of diversity. Here in San Francisco, we see the fruits of all that globalization, right? But you also say in the book, you do acknowledge the point, that there might be a decrease in total global cultural diversity as a consequence of globalization. If you think culture is so important and so underinvested in and so understudied, is it not too hasty to advocate for a force that’s producing a net reduction in the quantity of it in the world? COWEN: Well, there are multiple readings of a number of my books. And I would say, when you’re looking at the globalization of culture, we’ve engaged in a rather significant cashing-in exercise. Say you have a very small community, Inuit in Canada or artists in Bali, they’re very small in number. And until they’re in some way reached by larger, richer cultures they can trade with, in many instances, they’re not that creative. They have some tradition, but it’s not fully mobilized. Then there’s this intense cultural interchange, and it’s very fruitful. There’s a flowering, there’s more commercial sale. Top creators come to be, more genres are defined. There’s more diversity within the Balinese world or within Inuit sculpture, say. But eventually, that peters out as the smaller communities are absorbed by larger ones. Over the last century, we’ve done an unprecedented amount of this cashing in, by having smaller cultures obliterated. Now, one way to look at it is, well, they’re there and if you never touch them, that’s a shame. Is there an optimal rate of cashing in? I’m not sure that’s a variable you can control. But I think along some critical dimensions, our next century will be less creative than the last because we’ve cashed in on such a large number of small groups. And I worry about this with Ireland, too, a place you’re familiar with. The Irish literary tradition flowers, arguably, in the first half of the 20th century. COLLISON: Right. COWEN: And I worry now that people in Ireland hear too much American English, too much English English, and that style of writing, talking, joking, limericks, is becoming somewhat less distinct. Still many wonderful writers from Ireland, but again, it’s like an optimal stock depletion problem, and maybe we’ve pressed on the button a little too hard. COLLISON: The transaction costs should be higher? COWEN: Should be. But again, it’s a hard variable to control. With the tech world, in some ways, the tech world might be growing too quickly. People very quickly shift to Facebook, and that allows them to do much more socializing. And that, in some ways, actually limits the diversity of the world. They’re happier individually, but that’s another instance of cashing in that actually may not be socially optimal. COLLISON: Is it that you believe that we can’t do anything about this, and so we should appreciate the consequences as best we can and make the best of it? Or you think that we should not do anything about this? COWEN: As an individual, there are definitely things you can do. You can be quirkier. You can be eccentric. You can partake in some networks rather than others, and subsidize things that otherwise might have their stocks depleted too quickly. At the macro level, it’s hard to steer. The Nassim Taleb case — that free trade gives you too much monoculture — I take it seriously at an intellectual level. But the amount by which you would need to cut off trade to really create separately existing independent parts of the world that would give us greater protection against existential risk, it seems you would literally need to go back to 1500 to do that. And that’s not feasible; it wouldn’t be desirable. But I think he’s getting at a tradeoff that a lot of the rest of us aren’t sufficiently willing to admit. That in some ways, we’re investing in literally a monoculture of diversity. And that’s a little dangerous. Like every city has restaurants. I saw a Guam restaurant on Mission [Street] when I was walking today. I ate at a Cambodian restaurant. Two days before, I was at Mandalay, a Burmese restaurant. And many cities have these. And we call it “diversity,” but we have to be careful also not to just be fooling ourselves. COLLISON: So is connectivity the worst thing that ever happened to global culture? COWEN: You need connectivity. Today’s world has much longer life expectancy, people are happier, they’re better off, we produce more things. But there’s a danger in connectivity. And the extreme acceleration of connectivity through tech, I would say, is a huge, non-controlled experiment that we need to be a little cautious about. COLLISON: You wrote with Derek Parfit back in the early ’90s about how our intuitions about the discount rate we should have for the future are wrong. The discount rate should be much lower, and we should care way more about people in the distant future. And if you believe that, shouldn’t that, on this particular cultural point, cause you even more concern? Because 500, 1,000, 5,000 years’ time, we’re not just slightly but enormously decreasing the amount of culture that they can expect. COWEN: But keep in mind, if you don’t mine the stocks of these smaller diverse cultures, their outputs deteriorate and decay. So there’s so much from the past we’ll never have a clue about because it’s gone, and we never “exploited” it. That’s most of the culture, completely a closed book to us. If we’re worried about the future, you actually want to do exploitation plus preservation. Now, maybe we haven’t done enough preservation. But it doesn’t steer you away from the exploitation, caring a lot about the very distant future. COLLISON: You point out that Taleb says that the things we’ll have to do in order to counteract this effect will be so totalitarian that they’re not really even worth taking seriously. On the micro level, or on the local level, is there anything we can do to . . . perhaps we can’t solve it, but we can reduce the effect somewhat? COWEN: Well, spend less time on Facebook. Use Google in funny ways. Right? Be careful — COLLISON: Should we just use Bing? COWEN: Well, Bing is too much like Google. Simply being a weirdo with Google will suffice, I think. Be careful how you use Netflix streaming. If what’s streaming on Netflix is your filter, you are part of the problem, I would say. COLLISON: But these are all actions for the individuals. I mean, us as a society, are there any policies we can enact or that we ought to follow? COWEN: Well, our main policies toward the arts, more and more, have to do with copyright, patent, and intellectual property. I think, for the most part, those are too strict. We could improve them, and we’d get more creativity and more borrowing. But I don’t think, at the margin, those changes, good though they may be, will have a major impact on this issue. Just the core: How do ordinary people spend most of their time? That’s the big driver here. Other than having drastic changes in policy, I think most of what we have to do are these small steps at the individual level toward the much better world. And more randomization. Think more carefully about physical space. When I was growing up, I would drive my car into a town, maybe Philadelphia, with my friend, Dan Klein. First thing we would do is get to a telephone booth. Remember those? And like evil people, we’d rip out the pages for used bookstores and then drive around and try to find them. And we would find them by basically yelling out the window and asking people where some street might be. COLLISON: [laughs] COWEN: And that seems horribly inefficient. COLLISON: It does. COWEN: But I think keeping a memory of why those odd, bizarre practices have some efficient elements when thought of as search algorithms. Preserving that knowledge is very important. And I think people who write or think or communicate with others can do that. COLLISON: Would this all suggest that we should be even sadder than we are in the decline of various languages around the world? COWEN: Yes . . . COLLISON: Spoken language. COWEN: We should try to preserve them when we can. Nahuatl is actually my favorite language when I hear it, and it still has well over a million speakers. It’s not in immediate danger, but I would predict, in less than 200 years, it will be gone. Gaelic has made somewhat of a comeback, but it’s still up in the air, perhaps. COLLISON: On this point, would you write the same book today? COWEN: Not the same book. But when I reread that book, I think I capture the multiple layers of how globalization is dynamic and creative and welfare enhancing, but dangerous and stock depleting and giving us this funny monoculture of extreme diversity, patting ourselves on the back, but all being a bit diverse in the same way. I think that’s in the book, and I’m happy about that. We love to play at diversity theater. COLLISON: Say more. COWEN: That’s one thing striking to me about the current world. You need different kinds of representation. But the kind of moves you make to get there often create a monoculture of its own. And you see this when you compare the coasts to other parts of America. I once wrote a blog post saying, “Well, there’s a lot more diversity amongst supporters of Trump than supporters of Hillary Clinton.” This got me in a lot of trouble. People wrote to me, outraged, “How can that be?” But there’s many kinds of diversity. For instance, a simple principle is, our correct point of view will be less diverse than people who are wrong because there are many more ways to be wrong. [laughter] I once wrote a blog post saying, “Well, there’s a lot more diversity amongst supporters of Trump than supporters of Hillary Clinton.” This got me in a lot of trouble. People wrote to me, outraged, “How can that be?” But there’s many kinds of diversity. For instance, a simple principle is, our correct point of view will be less diverse than people who are wrong because there are many more ways to be wrong. COWEN: If you’re completely right about something, that’s a way in which you’re not very diverse, even if you sort of feel you’re religiously, ethnically, otherwise more diverse. So whether the kinds of diversity that matter are the kinds that are elevated in current American political discourse, that’s so taken for granted, especially on the coasts. And I think, actually, most of America doesn’t necessarily agree with that. On diverse monocultures COLLISON: Can you say a bit more about the concept of diversity with regard to culture or ideas or whatever? In particular, do you think diversity in some particular directions or some particular kinds of diversity matter more than others, or are you just for more heterogeneity in the broadest sense? COWEN: Well, let’s try thinking about highly creative groups because we’re in the Bay Area. There’s some way in which they need to share something that’s quite common: common language. Language in the broad sense of the term and a common framework. In the sciences, the great co-authorships, they’re very often people who are alike, and not completely different. It’s a little counterintuitive, but I think that’s true. But at the same time you want an optimal insulation from too many other frameworks. You don’t want to be obsessed with all problems. You don’t want all the knowledge of the ancient Mesopotamians in your head. Whatever people know a thousand years from now will only distract you. A lot of what the Bay Area does is make you non-diverse by focusing your attention on this semi-diverse monoculture. And the monoculture part of it is what’s effective. It’s like Renaissance Florence, where they didn’t think too hard about China or what was going on in Sweden. They had a particular set of problems based on satisfying a certain set of patrons; integrating the Christian religion, but with clever twists and being somewhat Straussian; having a positive sense of life; realizing they were rediscovering antiquity; using a shade of blue that had this wonderful, beautiful glow; and at the same time, having a kind of cynical commercial attitude about their own art, which they knew was done for money and profit. That blend was just perfect, and you didn’t want it destroyed by these outside elements. COLLISON: Are successful clusters places with the right kind of diverse monoculture? COWEN: Yes. And the right kinds of implicit barriers to too much outside influence. But they also tend to be stimulated by some major outside influences, such as in the Renaissance, rediscovering technologies from China and the Arabic world, rediscovering antiquity — a huge prod. Just like here, part of the prod is Moore’s Law. My goodness, what can we do now? And we’re going to exhaust all those possibilities as quickly as we can. So you need the prod. You need the insulation. You need the common language. You need the barriers. You need to be weird and have a theory of your own weirdness that’s different from what your own weirdness actually is because you’re, too, looking at it from the inside. And this area has that. It’s great. It’s inspiring. On universal basic income COLLISON: I want to actually get back to the topic of weirdness a little bit later on, but quickly, before we shift focus from Silicon Valley, many in Silicon Valley are talking about the idea of universal basic income and what we do when the robots take all of our jobs. And I think you were initially a supporter of it, and then you changed your mind. COWEN: Correct. COLLISON: Can you describe why you changed your mind, and also whether you think some kind of negative tax or sort of expanded version of the earned income tax credit — is that an adequate replacement for it, or do we need something further still? COWEN: This is my worry with the universal basic income. It does make logical sense, especially as we get wealthier. But it, for me, was a kind of formative experience, about 2009, in response to the financial crisis. One of the better policies would have been mortgage cramdowns and write-offs for many afflicted people, and many economists agreed with this. Larry Summers pushed it. But politically, it proved impossible. People didn’t hate all of the bailouts as much as they claimed, but they hated the idea of the person next door getting a break that they didn’t get, when they had, in their own mind, worked harder and paid all their bills. And that proved impossible. So the notion of the kind of asymmetric treatments of neighbors, what kind of politics it would engender, post-Brexit, post-Trump — COLLISON: But it won’t be asymmetric; everyone will get it. COWEN: It depends how you do it, right? But in essence, the people who work more are being taxed more to pay for the whole system, so on net, they’re getting less from having the system. COLLISON: Isn’t that to some degree the case today? Do you think it just becomes more flagrant in a UBI world? COWEN: It works today precisely because it’s not transparent. [laughter] COWEN: And how many people, even economists, can explain to you how the earned income tax credit works, whether it matters, number of children, whether or not you’re married, who bears the final incidence. Even very few PhD economists could explain that incorrectly, much less correctly. [laughter] [The earned income taxed credit] works today precisely because it’s not transparent. And how many people, even economists, can’t explain to you how the earned income tax credit works, whether it matters, number of children, whether or not you’re married, who bears the final incidents. Even very few PhD economists could explain that incorrectly, much less correctly. COLLISON: But wait — COWEN: So many of the sustainable structures of the contemporary world have to become nontransparent. COLLISON: Do we just need a sufficiently obfuscated version of the UBI and then we’re fine? COWEN: We call it “disability insurance.” [laughter] COWEN: And as it works now, it’s not working. But I think we’ll actually evolve disability insurance, in some way, to become an obfuscated form of a partial universal basic income. And it won’t be enough, it won’t work that well. We’ll combine that with the earned income tax credit and some other policies, and it still won’t be that wonderful, but that’s what we’ll do. COLLISON: There’s various debates as to whether there should be some absolute floor or whether we should preserve the property that some level of work is required in order for there to be any income, more along the lines of the earned income credit. Do you think that matters? COWEN: I think the symbolic values of society rewards matter a great deal, more than I thought. If you have a universal basic income, it’s like you’re putting up a sign for immigrants, “This is the kind of country we are.” For me, selection of immigrants is very important. We don’t think about it enough. By having a lot of inequality, you’re putting up another kind of sign for immigrants: “Life here is tough. And if you live here, well, tough is tough.” But on the other hand, you’re building a stronger cluster of creativity and a stronger group. And it might be better to have the signs without UBI, less transparency about how you help people, and a variety of ethics that on the face are not entirely defensible. But when you view them as an advertising campaign for your immigrant-rich country, with more to come, you’re getting more productive people who will also help the rest of the world more. Keep in mind, US generates public goods for the whole world, just like Stripe and Atlas do, so you’re never optimizing for “What’s best for this country?” You want to optimize for “What makes this country the most creative?” And that’s different than just making us happy. We’re doomed to be the somewhat screwed up, unjust, not-quite-happy-maybe-more-mentally-ill country. And we’re the Atlas, in some other sense, partly carrying some of the world on our shoulders. COLLISON: I’m glad we’re recording this so we can later put forward that conception of America. COWEN: [laughs] On signaling and immigration policy COLLISON: You mentioned immigrants. COWEN: Yes. COLLISON: Michael Clemens and Lant Pritchett, all the open border stuff and the trillion-dollar bills lying on the sidewalk, and so on. What do you make of it? COWEN: I think they’re wrong, and Michael himself, as I read him, moved away from that view. My basic view: I’m pro-immigration. I think we should and can take in more people, both high-skilled and low-skilled. But there is some point where your politics is no longer sustainable. I don’t feel, in this country, even with what’s happened, that we’re at that point, but it places a real check on open borders. A United States with open borders, I think, politically, would be unworkable in less than 10 years, even though it makes economic sense. It gets back to this optimal degree of insulation. There’s a political culture here, which requires a certain common language, common set of delusion, common set of myths, common set of things we understand. This country does it pretty well, not perfectly, and I don’t think open borders is compatible with that. I think it would kill the goose laying the golden egg. So I favor much more immigration, but not unrestricted immigration. I also think infrastructure would be a problem. COLLISON: If you could put forward any immigration policy tomorrow, what would your policy be, for the US in particular? COWEN: It depends how constrained I am. But just taking what we have and increasing all of the numbers. I think my own ability to judge, what kind of visas should there be more of? How do we manage the quotas? Should the preference be for family members? I’m a little more skeptical than most academics about the Australian and Canadian systems for this country. I think they work great for Australia and Canada. But for the United States, they would bring in too many high-paid professionals in service sectors that don’t bring that many productivity gains. Having more advanced-degree professionals isn’t what we want. We want people who produce public goods in the United States, and that’s not really what dentists are. Maybe Australia wants more dentists. We want more engineers, creators, dreamers, artists, eccentrics. Our immigration policy should reflect that, and in some ways, maybe be more random or appear more nonsensical. So again, all the people who say — COLLISON: I think it largely succeeds at that. COWEN: We do! [laughs] On Trump, and the probability Tyler will vote for him in 2020 COLLISON: This touches, at least obliquely, on the political status quo. And Brian Eno, who I think you’re a fan of . . . COWEN: Absolutely. Another Green World, it’s one of my favorite albums. COLLISON: He said in an interview today that he is pleased about Brexit and Trump because they may be the kick up the arse that we need. ‘This is a proper crash and a chance to really rethink,’ but that it’s good news. Do you agree? COWEN: Not as stated. But there is a reworded version that I would agree with. Let me say, I’m already very clearly on record as not supporting either Brexit or Trump, for reasons which are more or less the standard reasons. But if you think all systems can be gamed and are in some ways not sustainable, when you crack into the wall, there is an optimal time for that, and you want to do it when other parts of your society and institutions are still healthy enough. So you can make a case, this shock has come at a time when we still can respond in a positive way. I don’t know how to prove or disprove that proposition. I think it’s quite possibly true. In that sense, it’s lowered my optimism. But my optimism about the mere election, given that the election is possible, I’m not as worried as a lot of people. I think there’s a chance it turns out to be a course correction that we needed, which is distinct from supporting the event itself. Maybe that’s what Brian meant. By the way, I’ve sent him an email asking to interview him, and for three months I haven’t heard back, but we’ll see. COLLISON: [laughs] If it turns out to have been a good thing, and let’s say, as assessed 20 years from now, why will that have been the case? COWEN: It could be there’s something about the diverse monoculture of the American coasts that wasn’t as good as we thought, wasn’t as stable as we thought, and was more resented than we thought. Certainly, the latter seems to be true. If the strategy was to double down on the progressive vision, bring in more immigrants, have a permanent Democratic majority, and remake America in the progressive ideal and be a larger Canada, possibly, that was the path we were on. Quite possibly, that was a bad idea. And again, I don’t prefer the way maybe we’re getting off that path, but if we were going to get off it anyway, this might be the least painful way, at least possibly. I worry a great deal about the associated risks. But again, I don’t rule that scenario out. COLLISON: What do you think that the probability is that you will vote for Trump in 2020? COWEN: Zero. [laughter] COLLISON: Even if one of these versions comes to pass? COWEN: I don’t think I would know by then. I find it unaesthetic, and just my temperament: I’m not attracted to people who are either bullies or who pretend they’re bullies. And just that mood affiliation, I don’t want. Nothing’s “probability zero” but I won’t make the assessment in an instrumentally rational way. So, it’s pretty close to zero. COLLISON: Obviously, Trump is in the throes of making all sorts of, at least by traditional standards, unconventional appointments. If he created the new role of Czar of Great Stagnation–Ending and asked you to take the job, what would your policies be? COWEN: My policy would be, tell him to give that job to Peter Thiel. [laughter] COWEN: And he’s done it. I think a lot of the Trump appointments actually are excellent or might turn out to be excellent: at the FCC, possibly at the FDA. Education has possible upsides, though I don’t think it will really change much. I think there’s a good chance Rex Tillerson turns out to be quite good. Now, what it’s like to be a good appointee without proper support from the executive branch? We’re going to run that experiment. It could all go badly. [laughter] COWEN: But I also think [Stephen] Bannon is very smart and it’s quite possible the strategy is, “We’re going to appoint a bunch of people who are really just different and talented but not political, and give them all free rein, and we know 80 percent of them will fail, but a bunch might do good things.” We saw the Obama model be a unifier, hope and change, appoint academic, smart people who love Obama and Obama loves them. And they’re loyal to him, and there’s a semi-well-functioning White House. That didn’t actually change many things, whether you agree with all the programs or not. So that’s their immediate experience, and they’re going to try to do everything different. As a social scientist, I find this fascinating. But the notion that two or three of the agencies could come out of this much better, and a few, much worse — I worry the most about the Fed and the EPA. But I think a lot of them are very smart, talented, able people, and we’ll see what they’re able to do. COLLISON: The case is often made that the EPA doesn’t matter a great deal because it’s economics that determines what happens on the climate front. Coal plants are becoming uneconomic, and China is canceling plans to the build them, and solar is crashing in price, and so forth. Given all of that, why do you think the EPA really matters? COWEN: I don’t think we know how much the EPA matters, but I don’t see any reason to deliberately do bad things with it. [laughter] COWEN: And it seems quite likely that’s what will happen. But I think you’re completely correct, that the major factor in, say, climate change, it could just be luck. Do we invent something cheap enough that the whole world wants to do it? And the political battles may not go down in history as that big of a thing. I know they feel important and there’s good guys, there’s bad guys, there’s symbolic whatever on the line. I’ve said I think a carbon tax would be a good idea. You’ve got to tax something; why not do that? But that all said, it’s probably not the main thing, and a carbon tax is, in many ways, an overrated idea. Getting science and the tech world to work better is probably higher impact. Because US, if the rest of the world grows, we become a less and less important polluter. We need something cheap enough that everyone is going to do it — Africa, Vietnam. So it really has got to be pretty good. And that’s up to all of you. On Schelling and the most important issue in the world COLLISON: There’s a lot of discussion about all sorts of tail risks, especially geopolitical risks, that we could face for the next four years. Your PhD advisor was Thomas Schelling. COWEN: Correct. COLLISON: How would Schelling have looked at today? And are there any ways in which your views about this, the probability of extreme tail risks and how we should approach and handle them, differ to what you expect he would have thought? COWEN: I had a long conversation with Schelling about a year ago. He passed away just this year. I asked him some of these questions. One of his big influences on me was simply to get me to see nuclear weapons will always be the most important issue in the world, no matter what else you might think. It’s very interesting: you go back, read people right after World War II . . . COLLISON: Why is that, given all the putative cyber warfare and pathogenic weapons and all these other catastrophic macro events that we think could occur? COWEN: There’s a chance pathogenic weapons could become more important at some future point, but for now, it’s still nuclear weapons. A lot of people have them. They’ve been used, twice, by us. They might become much easier to acquire. They can be launched by mistake. The institutions surrounding them are not always well designed. North Korea is a particularly hard-to-understand case that might be highly dangerous. So the notion that nuclear weapons are always the most important issue — this also gets back to your Trump question — you want, especially from this country, a lot of predictability. And I worry right now that the risk premium — especially in Asia, which does not have Western Europe’s built-up antiwar tradition — that we’re underestimating that risk premium. I don’t see it in asset prices. I think it’s simply poorly understood. I don’t have a prediction, but it’s my single biggest worry, that the South China Sea and northeast Asia are less stable than we think. COLLISON: Is there any way in which your outlook differs to Schelling’s? COWEN: Schelling himself, his own thoughts, went through several phases. But he thought what was remarkable is how much the world has sustained a taboo against nuclear weapons use. He thought this was a very strong and highly enduring norm that is still with us. He gave a whole talk on this, it’s still online. And he gave talks on this, actually, in Iran, I think about seven or eight years ago. They’re very interesting, to hear Schelling addressing an audience of Iranians. I’m not convinced the taboo is that strong. It’s certainly the case no one has used them. But whether it’s mere self-interest or whether there’s actually a norm and taboo with independent force, I’m not convinced by his arguments. And that’s made me a little more pessimistic. COLLISON: To close off on this topic, you’ve said that this broader phenomenon of Donald Trump and his election is making us all stupider. Can you expand on that? COWEN: Well, I think it’s made the Left more stupider than the Right. Whenever the party elected is objectionable, the people in opposition become stupider, as pretty much a rule. They become more emotional, and they attack the worst versions of the ideas they’re against, when I think they should pick and choose more, and should move more toward the center, and try to bring more Americans along. The important thing now is to give people who are Trump supporters an open path into not being Trump supporters, and being something else. A lot of the rhetoric isn’t doing that. I thought the marches went pretty well, from that point of view. They were very broad, very American. That, to me, was very encouraging. But a lot of the intellectual Left, I feel, has become polarized and is doing the opposite. On economics clusters COLLISON: I want to ask you about the set of people that you work with. COWEN: Sure. They’re all dear friends, so I’m totally biased. COLLISON: [laughs] The group that you’ve helped assemble at George Mason [University]. I’m talking about people like Arnold Kling and Robin Hanson and Bryan Caplan and Alex Tabarrok and so on. How did that happen? Because there’s such interesting commonalities between them, and they represent such a large fraction of interesting ideas. And somehow, so many of them are in the same place. COWEN: They’re all inquiring, they all have broader interests, they all feel economists should be able to speak to real people. They all, in varying ways, have some kind of libertarian bent, albeit with a lot of diversity. Some of it is, George Mason has long been a school willing to take a lot of chances. And we’ve had the Mercatus Center, the Public Choice Center, the Experimental Economics Group. We’ve invested in these Florentine-like clusters of people who are different, and been willing to make huge bets on them, and see that through consistently and have determination, and stick with our strategy. COLLISON: Was it obviously a good decision to hire them at the point where you did? COWEN: No. Of course not. COLLISON: What were you looking for? What made it clear to you? COWEN: Well, I voted on each of these hires. I voted for them. For a lot of them, I was on the hiring committee. Robin Hanson’s a good example. When we hired Robin, he was much older than a typical assistant professor would be. And of course, we don’t practice age discrimination, and neither does anyone else, but . . . [laughter] COWEN: Robin was going to have a tough time being hired. And I gave Robin some of my papers to read. He came in. He was a little, actually, obnoxious to me. Though he’s one of the nicest people you’d ever want to meet. He sent me back comments on my papers, that they were all wrong. [laughter] COWEN: There was no preliminary politeness: ‘I thought this was interesting, but…’ I thought this was great. So I thought, “We need to hire Robin. Robin is different.” And Robin wrote papers I thought were crazy, but he clearly also was a genius. I pushed very hard to hire Robin, and he made a good impression on a lot of other people. He’s been with us ever since. COLLISON: Were the papers in fact all wrong? COWEN: Robin’s criticisms were all good points. But they weren’t entirely wrong. [laughter] COLLISON: [laughs] So, if you had to somehow force yourself to reduce these people to a single strand of commonality between them — you mentioned some of the shared characteristics, but what’s the fundamental thing that links them? COWEN: I think about this quite a bit. It’s some mix of how one processes information, and the willingness to be analytical about many things, and to take your beliefs in one area and at least try them out on all other areas. What I find depressing about a lot of academia is you have people who think very scientifically about their research, but then their life is just something totally different. Or they talk about politics, and they’ll be just like anyone else, not very analytical or very scientific. So the idea that, if you believe something, at least try to see it through: What else does it imply? What else does it imply for all other things I believe in life? And then allow that to have feedback into your research. I think that’s what we all have in common at the most fundamental level. What I find depressing about a lot of academia is you have people who think very scientifically about their research, but then their life is just something totally different. Or they talk about politics, and they’ll be just like anyone else, and not very analytical or very scientific. So the idea that, if you believe something, at least try to see it through, “What else does it imply? What else does it imply for all other things I believe in life?” And then, allow that to have feedback into your research. COLLISON: In what ways should there be more such clusters? COWEN: In economics and academia, there are some other clusters. You had one at UMass Amherst, which isn’t quite what it used to be. You had one at Notre Dame. Those were more heterodox left-wing clusters. There’s a group called INET, backed by George Soros, that’s trying to create more of these. I think that’s a very positive endeavor. I would like there to be a few departments that are still some version of Marxist, other heterodox views. I’d like there to be more departments that specialize in experimental economics, other methods. But you have too many people trying to just move up in the rankings and be number 23, which isn’t necessarily that glorious, rather than be number one or two along some stranger dimension. COLLISON: If we go home and we all conclude that we should ourselves become part of some movement to help create more of these heterodox clusters, is the characteristic you’re just describing about trying to extrapolate views to other ostensibly unrelated areas, is that the thing you should be trying to do even outside of economics? Or is there some underlying thing that’s the right guiding principle when you’re trying to create non-economic heterodox clusters? COWEN: No, I think it’s a fairly universal principle. But it gets back to these smaller cultures, like the Inuit. They tend to be absorbed precisely because they’re smaller in number. Today, there is no unique Florentine style of painting; it’s long, long since gone, for centuries. So you have to replenish them. But we now have this thing, tech and connectivity, and that’s outracing the kind of counter-tactics to keep certain things weird. You create some niche groups by bringing people together, but there’s also a homogenizing effect. It’s so quick, so rapid, so powerful. What’s going to win that race? I’m not sure. But I fear a bit how quickly it’s going and how hard it is to steer. On religion as cultural capital COLLISON: We’ll come back to that. You’ve often argued, contrary to the prevailing trend in the US and in Europe, that society should become more religious. COWEN: Sure. COLLISON: It would be a good thing if that happened. Why do you believe that? And what’s the crux of your disagreement with the supposed expert opinion that holds the opposite position? COWEN: Well, first, let me say, I am myself a nonbeliever. You could say I’m an agnostic, but tending toward nonbelief. But it seems to me, religion is a very special form of cultural capital. It’s people’s most fundamental beliefs about the world. People will believe in something. And for much of the West, I see Christianity, and to some extent, Judaism, as having had a very special role. The notion that we should just cash in on that and all become secular, and not be sure what we believe in — I see a great danger in that. If you visit a place like England, where church attendance is remarkably low, people are extremely secular, that strikes me as unhealthy. Secular societies tend to fall into much lower birth rates. They don’t reproduce themselves. That’s one of the most damning things you can imagine, actually, about a society. Religion, even adjusting for income, has predictive power over the birth rate. It’s one reason why America still has a stable or a typically growing population, along with immigration. And American religion has stayed remarkably strong for our level of income. It seems almost obvious to me that’s a positive. This paper by Jon Gruber using instrumental variables — religion tends to make lives better: more social capital, more cooperation. But that’s, I think, secondary to the bigger-picture question: What do people believe in? Do those beliefs encourage self-replication of the basic society or not? And America’s doing a good job on that, mostly because of religion. COLLISON: Is religion one of the few remaining sources of durable cultural diversity in an increasingly connected world? COWEN: It is. And there’s something fundamentally strange about religion, but in a rewarding way. My next interview — it’s actually on Thursday — I’m interviewing a rabbi. So I’ve been re-studying the Bible. And the Bible’s one of the most beautiful, strange, and open-to-multiple-interpretation books that there is. And it’s one of the books you can learn the most reading and rereading and rereading. I’ve been finding this very rewarding. You look at parts of the culture. Like today, Shakespeare and Jane Austen, they’re much more popular. But our knowledge of the past gets thinner. Those secondary figures seem to be getting lost. A small number of things get elevated: maybe it’s the Beatles from the 1960s music, Shakespeare. But, say, a lot of the Russian novelists seem to be falling away. People don’t seem to read Nietzsche as much as they did in the ’60s or ’70s. So there’s a centralization of what we take from the past because the present is so crowded. COLLISON: Michel Houellebecq’s Submission was one of your favorite books in 2015. COWEN: Yes. COLLISON: This is a book about a country that in fact reversed this trend towards increased secularism. What did the book mean to you? COWEN: Submission is, in my view, a fundamentally Straussian work. That is, it has secret meanings. It has to be read in the European context. Typically, it’s regarded as Houellebecq being anti-Islam. He said some things in public that are somewhat outrageous on the issue. But I think actually he’s envying Islam and the Muslims in France for the fact that they believe in something. Writing like Jonathan Swift, it’s a criticism of contemporary France that we don’t believe in things enough anymore. And here’s a dynamic element in our society — maybe in some ways, we dislike it, but we actually ought to learn from it. And it’s about the weaknesses of his own class, the French intellectual class that he comes from. I thought it was spot on. COLLISON: Are you in favor of not just more religiosity but more religions? COWEN: I’m not against them. But of course, it’s hard to start them . . . [laughter] COWEN: In ways that are sustainable. I find it very interesting to study relatively recent developments, such as Mormonism. It feels funny to people that somehow when you have religious narratives that are recent, they sound weirder than ones that are old. But that’s quite arbitrary. Possibly, I’m more of a fan of monotheism than religion per se. I agree with [Georg] Hegel’s remarks on polytheism that may not be conducive to political order. I’d say that’s still an uncertain question, but it’s a worry I have. And as [David] Hume pointed out, monotheism itself breaks down into partial polytheism because people want multiple things to worship, to pray to, to talk to. So it’s not a stable balance. On the aesthetics of Marginal Revolution and other important issues of the blogosphere COLLISON: [laughs] Why did you start Marginal Revolution? COWEN: Alex Tabarrok came into my office, and he said, “Tyler, we have to write an economics textbook.” And I said, “Alex, first, we need to write a blog and become better known, and then we’ll write an economics textbook.” [laughter] COWEN: I’m not sure what Alex thought at that point. I think he felt he was just humoring me, and that he really wanted that we write the textbook. I don’t know. I’ll ask him. We did the blog and that went very well. But it even took a few years before it really took off. We started, I think 2003, I’m not sure. But I think persistence and determination for something you enjoy and believe in is very important. It’s related to your remarks on religion. And I like doing it. We just kept on doing it and thought, “If we have something to say, giving it away for free ought to lead to something. And if we don’t have something to say, giving it away for free ought to tell us we suck. Full steam ahead.” And I think that’s a good attitude to have. We just kept on doing it and thought, “If we have something to say, giving it away for free ought to lead to something. And if we don’t have something to say, giving it away for free ought to tell us we suck. Full steam ahead.” And I think that’s a good attitude to have. COLLISON: Why does it look so strange? COWEN: Does it look strange, Marginal Revolution? COLLISON: Yeah. It looks old. [laughter] COWEN: It is old. It has that funny green color because that was originally the shade of green that George Mason had. And I think, Alex, who did the visual design . . . But I’ve been the one saying we need to keep it. He took the green to stand in for George Mason. And I think green, so often, is an ugly color. COLLISON: I like green. COWEN: Well, you would like green. [laughter] COWEN: But I thought the notion that we would deliberately choose an ugly color was a good idea. It would imply the merits of the enterprise had to be elsewhere. [laughter] COWEN: All the places that look nicer, they’re usually connected to advertising. We always wanted to signal we’re not about ads, it’s about the ideas, and that we’re retro. Now, we’ve been doing it a long time — I feel it ought to look retro. COLLISON: Have the ways in which it’s been valuable for you changed over the years? COWEN: Absolutely. When I started it, hardly anyone read it. When I started, I thought, “If 5,000 people read it, this would be something remarkable.” That happened pretty quickly, so, for me it was enough. I actually think 5 people’s enough. And at times, like during the financial crisis, over 100,000 people were reading it on a given day, plus RSS feeds. I’m not sure how many total. And that seemed absurd. But 10 years ago, it was a way to connect with younger people. And now, the young are much less likely to read, and it’s a way to connect with older people and wealthier people and better-connected people. COLLISON: You just need to start the Snapchat version. COWEN: Yes. [laughs] Maybe we will someday. COLLISON: What kinds of blogs should there be more of in the world? COWEN: Single-issue blogs on issues of importance. If you take something like penal reform, an underrated cause. Prisons, I think, are barbaric, but it’s not an easy problem to solve. There’s not a quick fix. Some people do need to be constrained in some way. The idea that there should be more blogs that track that and persistently deliver the message, “Something is wrong here.” Issues of animal welfare on blogs. Economics on blogs is doing pretty well and has for a while. It’s one of the healthier parts of the blogosphere. It’s very hard to blog philosophy. Maybe someone will figure it out. I tend to think it usually doesn’t work. Current events works. Partisan politics works. But single-issue blogs — maybe they’re not profitable, but I think, socially, they could have a big positive impact. COLLISON: Why do economics blogs work better than other fields? Other academic fields especially. COWEN: Economics has a common language, getting back to the point about what makes for good clusters. COLLISON: But don’t other fields? COWEN: More than other social science fields. We have microeconomics. You can put an argument into micro and all economists can grasp it, and anyone who knows some economics can make some sense of it. And we have an empirical side. The empirical results of economics, a lot of them, you can communicate in a sentence, and often to nonspecialists. So both the common framework and some empirical element, even if you’re a little skeptical about both. They’re there as a first offering, even if you end up mocking them. Sociology doesn’t have the common framework, philosophy, the empirical element is tough to find. In analytic and continental philosophy, the arguments take so long. Economic arguments, if they’re good, they don’t take that long. I might be wrong, but if an argument takes 10 pages, it’s almost certainly too complicated. On the question everyone has for Tyler COLLISON: Right, right. I think many of us are here so we can ask the question, “How do you read so much?” [laughter] COWEN: By reading a lot. If I read fiction, I don’t read fiction much faster than most people. Maybe a little faster, but within the normal bounds. If you just read a lot of books, you find most books aren’t very interesting. You can focus on what’s important and actually get a lot read. So, I’ll pick up a book, put it down. Someone says, “How long did it take you to read that book?” And I’ll say, “Fifty-two years,” because I’ve been reading since I was three, and that’s the correct answer. People don’t get that. It took me 52 years to read that book. So I’m not a fast reader. I’m a very, very slow reader. You’re just mis-measuring the unit if you think I read something quickly. [laughs] So, like I’ll pick up a book, put it down. Someone says, “How long did it take you to read that book?” And I’ll say, “52 years.” Because I’ve been reading since I was three. And that’s the correct answer. People don’t get that. “It took me 52 years to read that book.” So I’m not a fast reader. I’m a very, very slow reader. You’re just mis-measuring the unit if you think I read something quickly. COLLISON: I remember you commented in an interview a couple of years ago that you discard a lot of books. Are we all making a huge mistake by finishing so many books? COWEN: If you finish them. I’m not convinced you all do. [laughter] COWEN: So there’s data from Kindle on this. [laughter] COWEN: And whether it’s cheery or depressing, you can debate. Now, you might be more willing to finish a physical book because it has an embodiment, maybe it’s more vivid, or maybe by buying it, you made a greater commitment, as opposed to having 400 unread things on your Kindle. But serious readers probably finish too many books and sit through too many movies. It’s a biological intuition. Be loyal to things, which is a good intuition. But if you can selectively discard it for parts of your intellectual life without discarding it for your personal life, great. COLLISON: Does this Kindle data about our median inability to finish books, does this suggest anything deficient in the artifact of the book itself? Should it be otherwise? COWEN: There are probably too many books. It depends what your goal is. If your goal is simply to learn something, so often, reading a blog post is better than reading a book. Even if the book is, of course, much longer. Books embody knowledge, they store knowledge, they certify knowledge. Those are important, I’m not anti-book. But as a means of communicating knowledge, once you’ve read a certain number of key, earthquake, worldview-shattering books, books are way overrated. They’re actually a pretty weak, impotent way of learning new things. COLLISON: Is there something between blogs and books that you think ought to exist that does not? COWEN: PDF? I don’t know. [laughs] I’m so often disappointed in those. Books that really change your mind are the best way to learn. But there’s only so many of those. There’s depletion of the stock, and you age. And after that, travel, and then meeting clusters of people. You talk to them, and you learn areas by meeting them, and toss in some books. And you should read more and more in clusters, pick an area from a time in history and read in that, rather than reading a book. COLLISON: Do you have any heuristics for getting better at more quickly finding, identifying books that are likely to change our minds? COWEN: Email me. [laughs] Or read Marginal Revolution. I can’t have a better heuristic than what I say in other contexts. COLLISON: But how do you do it? You can’t email yourself. Well, you can email yourself, but I’m not sure how effective it is. [laughter] COWEN: I sometimes say my business model is, I respond or at least try to respond to every email I receive. I don’t quite hit 100 percent. COLLISON: Well, that sounds very dangerous if you ever do email yourself. [laughter] COWEN: I email myself names of restaurants, but I don’t respond to those. That’s why it’s not 100 percent. But I feel if my responses show the right temperament, that people will tell me everything I need to know. And I think that’s worked pretty well. So email’s underrated, in my worldview. On things under- and overrated COLLISON: Well, on that note, I wanted to ask you about a couple of things and whether they are in fact over- or underrated. COWEN: Sure. COLLISON: Starting out with something that obviously has a lot of popularity here: effective altruism. COWEN: It’s overrated by the people who know what it is. It’s underrated by the entire rest of the world. COLLISON: Can you expand on the former? COWEN: A lot of giving is not very rational. Whether that’s good or bad, it’s a fact. And if you try to make it too rational in a particular way, a very culturally specific way, you’ll simply end up with less giving. And then also, a lot of the particular targets of effective altruism, I’m not sure, are bad ideas. So somewhere like Harvard, it has a huge endowment, it’s super non- or even anti-egalitarian. But it’s nonetheless a self-replicating cluster of creativity. And if you’re a rich person, Harvard was your alma mater, and you give them a million dollars, is that a bad idea? I don’t know, but effective altruists tend to be quite sure it’s a bad idea. I think there’s too much pretense of knowledge in the movement as it is. But that said, relative to the people just making mistakes, it’s way, way, way underrated. So I’m actually a big fan of it, in a public sense. COLLISON: How about flying cars? COWEN: Flying cars, I think, will be dangerous for a long time. And I don’t know why you need to fly and then drive. So you can fly and then Uber or taxi, and you separate the flight and the car. Until I hear a good reason why the integration is so important, you can carry your iPad from one to the other and have a pretty integrated experience. So I’d much rather have the 140 characters. [laughs] COLLISON: Well, that was going to be my next question: 140 characters, over- or underrated? COWEN: You mean, Twitter itself? Or the characters? COLLISON: Both. COWEN: I don’t think they should relax the rule as they’ve done in a number of ways. Tweets are too long. There are too many photos. There ought to be like a Pigouvian tax on putting photos and subtweets in your tweets and threads. I favor a nonzero amount, not like the old rules, but it definitely should be limited and taxed with micropayments. And I think that would make Twitter better and quicker. COLLISON: We agree. COWEN: But mostly, I’m a Twitter fan, and rules really matter for their own sake. So, yes, 140 characters plus. COLLISON: And Twitter itself, over- or underrated? COWEN: Underrated, and I think Trump has shown how powerful it is. Again, you don’t have to agree with his tweets, but it’s woken the world up that Twitter is not just some inferior Facebook that never was going to turn out to be anything. It’s extraordinarily powerful. People in Iran have known this for a long time. It will stay important and powerful. I think it’s still very, very underrated, actually. As a commercial venture, I couldn’t say, but it’s a force for shaping society. COLLISON: You use Twitter but not Facebook. Why is that? COWEN: Partly my time is limited, but the Facebook page, to me, is too confusing. It’s like William James’s “buzzing, blooming confusion.” And they always change it, and I get a headache. It’s like trying to work a very complicated microwave oven. [laughter] COWEN: And I can’t really work a simple microwave that well. I’m sensitive to the complexity of the visual field. But that said, if you have broadcasts to larger numbers, would you prefer the smaller number, the closed-gated thing that’s not searchable? I don’t see why I would. And I worry, at the social level, Facebook is subsidizing sociability too much. A function, say, that used to be served by music when you’re in the seventh grade — “This is the band I like” — it’s now served by social media. It’s pulling away a lot of hidden, deep, implied subsidies to culture, and our culture is in some ways weaker because we’re happier and more sociable. I don’t like that. [laughter] COLLISON: Is Facebook net good or bad for the world? COWEN: We don’t know yet. If you’re a utilitarian focused on happiness, it’s very likely good. But if you’re a [John Maynard] Keynes-like person, who cares about the aesthetic worth of the most significant contributions, and you want to see another Led Zeppelin come to pass, then it’s probably bad. And I have a bit of that in me. COLLISON: Silicon Valley, over- or underrated? COWEN: What Silicon Valley means, I’ve become confused by. If you say “the Bay Area,” I think it’s been overrated up until quite recently. A lot of it was just better leisure, and now, it’s really starting to be integrated with the physical structure of things, and it’s probably quite a bit underrated. The diversity of business is possible here, I think, it’s just getting going. I would say definitely underrated, looking forward. COLLISON: Why does the term confuse you? COWEN: Well, you’re not in Silicon Valley, are you? COLLISON: Do you mean geographically? COWEN: If you say “Bay Area,” I feel more comfortable with my answer. COLLISON: [laughs] Washington, DC. COWEN: As a city to live in, it’s underrated. I think its weather is underrated. As an intellectual and media capital, it’s one of the most stimulating places to be. It’s still highly livable. We live half an hour outside of Washington when there’s no traffic, ha-ha, and still have deer and fox on our lawn every morning at 6:30 a.m. That’s amazing. There’s great ethnic food and no major downside, except for the fact you’re not in Silicon Valley. [laughter] COWEN: The Bay Area, sorry. [laughter] COLLISON: That’s a subjective experience of living in DC. COWEN: Of course. COLLISON: What about the broader phenomenon of DC? COWEN: The work ethic there is pretty strong. The level of talent, it’s very much a monoculture. It’s the ultimate company town, but I think those are creative. I think it’s a creative city, typically, in destructive ways. I have highly mixed feelings about that. I don’t think the surrounding counties should be as wealthy as they are. On net, I’d rather see government be much smaller and civil liberties be more respected. So I have a love-hate relationship with Washington. I’d never want to live in the city. I’ve always lived in suburbs. Northern Virginia, I love much more than DC. And I go to Washington, it feels like a strange, bizarre place, but still acutely aware of its connection to the ancient world, which hardly anywhere else in America has, and that’s really important. It’s done something nowhere else in the world has, and it’s still the single most important place in what is an improving world. COLLISON: Stability. COWEN: Stability is underrated, but there’s also status quo bias, so this is tricky. I think the Western world takes stability for granted because we’ve had so much of it for so long. And our basic model, as in macroeconomics, you overweight your last 20 or 30 years. Since, let’s say — the election of Ronald Reagan, end of the Cold War, fall of the Berlin Wall — so many good things have happened. It’s mostly been stable, and the worst predictions haven’t come true. I think that’s exactly what makes this a dangerous point in time — that we’re not geared toward the kind of risk taking, imaginative thinking we need to stop this from being the next 1910. COLLISON: Can you say more on that? COWEN: I see a creeping deterioration of the belief in individual liberty as an important idea, rule of law, cosmopolitanism, just general respect and decency, even in some very good, nice countries. And this is one of them. I see that as getting weaker. I think it’s maybe a smaller move than a lot of the worriers are saying. But still, even when the trend is in that direction at all, it could have a self-fulfilling momentum. And that’s much more dangerous than a lot of people realize. Brexit, I’m not sure will be a big deal, economically speaking, but it’s a strong negative from a cultural point of view. That Turkey has fallen apart the way it has, that some of the Middle East is still up in flames, that Russia and China are much less free than some number of years ago. Those, to me, are major, major negatives at a cultural level, not tangible, that we’re underrating its importance. COLLISON: Restrictive urban construction and land use regulations. COWEN: They’re terrible. We should allow much more building. Much more of this country should be like Houston and parts of Texas. But that said, I’ve become a slight contrarian on this lately. I wonder if the Bay Area isn’t the one place in the world where building restrictions might make some sense because most of you want the restrictions. Even if not you in the room, you out there in this area. So removing the restrictions would be a tax. It would be great for the people who moved in. But if you’re all producing these amazing global public goods, and the federal government is going to raise taxes on you anyway, I promise this. I don’t care who wins the next five elections, your taxes are going up. State, city, local, whatever. And then we put this new tax on you and you all are the Atlases out there. I don’t know if loosening building here would tax your productivity or increase it. But I’d at least consider the notion. This is the one place in the world where we shouldn’t loosen building restrictions. COLLISON: Can you apply that argument in reverse? Do you think Silicon Valley would be better off if it had half the population? COWEN: I don’t live here. I don’t know how bad the traffic is, and I suspect the people who are the most productive have workarounds. They can afford to live where they want, for instance. COLLISON: I think a lot of us spend a lot of time in traffic. COWEN: But it seems to me, it’s a pretty finely honed structure. It’s evolved the way it has and to cut it in half or shrink it, it’s probably a big mistake. COLLISON: Just to make sure I understand, you’re saying the tax would be the other people around us? Our personal experiences of the area would somehow be diminished? COWEN: The general culture would change; it would be less intense. It would be like taking Florentine Renaissance and injecting into it 50,000 people from Naples. Nothing against Naples. I love Naples, in fact, more than Florence. But I suspect that would have been a mistake back then. So I worry, if you have too many people move into this uniquely weird, diverse monoculture, you could wreck it. Just a cautionary note, I’m agnostic, but I’ve started having this worry lately. COLLISON: Do you generally believe in the idea of increasing returns to scale of knowledge clusters? COWEN: Yes, absolutely. But again, you need funny kinds of insulation, too. It’s having both that makes a place special. So you don’t want a completely open system. You want a rhetoric that, “Oh, it’s all so open and incredibly fantastic . . .” [laughter] COWEN: But that it absolutely isn’t at the same time. [laughter] COWEN: And I feel that every time I come here. It’s great. COLLISON: Contrarianism. [laughter] COWEN: Overrated. COLLISON: [laughs] COWEN: That’s the Straussian answer. [laughter] COLLISON: Are we still in the Great Stagnation? COWEN: Probably, but the last year, I’ve seen a lot of signs — partial signs — we’re getting out of it. The last year, wage growth was pretty strong, and I hadn’t been expecting that. I wouldn’t change my mind based on one year of data, but one year is a lot more than nothing. What I see on the ground in terms of integrating, better manipulation of information with actual real world processes. And I’ve seen, again — not last year but I think four out of the last five years — healthcare costs have behaved in a somewhat sane manner. That’s been a big driver of living-standard and productivity problems. I’m not sure that we’ll stay on the right track, but I’ve seen four or five pretty encouraging signs. So I now hold the view, there’s a 30 percent chance we’re on the verge, right now, of climbing out of the Great Stagnation. COLLISON: Can you say more on the second point you mentioned there? The particular kinds of technological change that you’re seeing? COWEN: If all tech is, is spinning information more rapidly, it’s wonderful for the infovores: academics, journalists, tech people. But a lot of people are actually just as happy watching network TV with three channels and Mary Tyler Moore. Maybe they like Facebook a bit more, but the real advantage is when you can ease how molecules impact your body. If driverless cars really scale, as I think they will, many commutes will be much better. That’s a lot less frustration for people. Right there, I would say, “Great Stagnation is over.” It’s not a slam dunk. I think there are more obstacles to them than you read about it in the popular press, but I think it’s highly likely we get it within the next 20 years in some manner. COLLISON: Uber and self-driving cars and Airbnb and a bunch of these technology companies that are doing things in the real world, or some of these new biotech companies and so forth, they were all around two or three years ago, so why weren’t you more optimistic back then? COWEN: AI, in the broad sense of that term, seems to have developed more quickly than people thought. And even in 2011, I wrote a book saying, “AI will develop more quickly than we think.” My book, Average Is Over. And since then, it’s developed more quickly than I thought. [laughter] COWEN: And how many different problems you can apply that to? We still don’t know. But each time, we seem to be positively surprised, and we’re still on that positive surprise curve. COLLISON: What are you watching to tell whether or not we have in fact exited the Great Stagnation? COWEN: I think the best way would be not to view any media at all. And write down on a given day, “What molecules impacted my body?” People, they’re upset about Trump. Obviously, there are risks, things that are bad, but it’s also a healthy exercise. Write down each day, “The Trump molecules, did they impact my body today?” And in some ways, they will. But it’s a very different perspective. So if you stop reading about tech and AI and whatever, and just write down a bit on this. Keep a molecules diary. That’s when you’ll know — when your molecules diary gets really exciting. COLLISON: [laughs] I’ll, for the moment, leave it at that. Do you want to take maybe three or four questions from the audience here? We have a microphone over here. Q&A AUDIENCE MEMBER: Hi, Tyler. My question was, a lot of us look at issues or read about issues and then think, “Oh, what would Tyler Cowen think about this?” and go to your blog and try to pass off your views as our own. [laughter] COWEN: That’s not scalable. [laughs] AUDIENCE MEMBER: I was wondering, who is that person for you, a sort of economist’s economist, if you will? COWEN: I think the important thing about the contemporary world is how you manipulate your networks in your clusters. I don’t think any one person is very good on Twitter, no matter how smart or clever they may be. And I don’t think any one blogger is very good at all. So there’s a kind of embedded algorithm in blogs, Twitter, other social media. If you’re really good at reading the system, that’s when you learn things. That’s extremely powerful. And every day, I try to train, retrain myself in reading the system. And I feel that’s a skill I’ve become pretty good at. But I’m always working on it every single day. That’s the one thing, I’m always, “How can I improve this?” obsessively. I guess that would be my advice, to downgrade the individuals and try to understand properties of these systems better. AUDIENCE MEMBER: Hi. I grew up in the Rust Belt, and I’ve watched a lot of large companies, tech companies, come in and try to build hubs — technology hubs — in those areas. And invariably, they move in and then five years later, they close down. If they can’t be tech clusters, what can they be? Or maybe they can be tech clusters and they’re just doing it wrong. What should they do? COWEN: I think the final number of tech clusters will be quite small: the Bay Area and several parts of China, Israel being a much smaller but still potent one. I think it will shock people how few tech clusters develop. Because it’s a fragile ecosystem. It’s about project evaluation, its closeness to the number of major financial centers, and there are relatively few of those. Now you’re asking, “What will those areas become?” Well, empty, I hope. But I understand the transitional problems, and I think one thing you’ll see from the Trump administration is a big redistribution of income back to those regions. And it will actually solve some problems. In the longer run, I’m not sure how that will work out. When you want to neglect a region and have it empty, and when you want to try to keep it going, that’s a tough call. But I think we’re going to see big changes, like with Medicaid. There’ll be block grants, perhaps, given out on a formula that rewards Rust Belt states. AUDIENCE MEMBER: I wanted to connect two points that came up tonight. First, you are the original, or the pinnacle, of an infovore. I estimate that you process about a kilo of books a year, and at the same time, you also have a great social circle. So, how would you say friendship adds something besides the information feed of talking to people like Robin Hanson? What’s the friendship better than, say, reading literature about Robin Hanson? COWEN: It’s very important to keep yourself engaged and motivated. And for me, a good rule of friends is to really try to be myself and be willing to be weird, if it’s even weird, and let people self-select around that, to some extent. And that’s worked well for me, more than trying to make friends. Friends tell you when you’re completely off the mark. It’s companionship, common sense of purpose. It’s really, really important to be working with people at least you have friendly ties with. Even if they don’t feel like you’re friends with a capital F, in the sense that a Russian would use that word. AUDIENCE MEMBER: Hey. I was talking with a friend of mine about possible next start-ups that we could start, and we’re thinking about starting a religion. Something maybe vaguely Taoist, compatible with modern science, but hopefully something that gives people a sense of purpose, religious community, hopefully increases happiness. I loved hearing your thoughts earlier. Do you have any tips or any ideas? [laughter] COLLISON: Make it monotheistic, apparently. COWEN: I think you need to stop smiling if you’re going to start a religion. [laughter] COWEN: There’s a severity to it, some of which might be feigned. It’s quite difficult to pull off in the contemporary world. So I think my advice — I don’t give that much advice — but maybe my advice is not to do it. [laughter] COWEN: The entry barriers are high. And the religions we have are quite rich and well developed. And what you would have to be to succeed, I suspect, is someone who wouldn’t be at this talk. [laughter] AUDIENCE MEMBER: What’s the next great political party that doesn’t exist yet? COWEN: In the United States? AUDIENCE MEMBER: Yes. COWEN: I think America will have its current two-party system for a very long time to come. The barriers to a third party are very high. The Trump experience shows how flexible parties are, whether one likes that or not. I think the Democrats will do their own version of this, in exactly what direction, I’m not sure. But my prediction is no major new or third party here for the foreseeable future. How long was our last new party? My goodness, you’re going back into the 19th century. COLLISON: One more question. AUDIENCE MEMBER: My question’s two-folded, so it stays as one question. [laughs] COLLISON: One more person. COWEN: [laughs] AUDIENCE MEMBER: At the beginning, you were talking about basic income and how it won’t be feasible. Do you think that if we ever did get into a world where this was a thing, then perhaps it would increase culture and creativity because people now have all this free time to use? Or do you think it would just end up going to waste? That’s the first half, so it stays as one. COWEN: Sure. AUDIENCE MEMBER: And the second part is, you were also talking about AI in the broader sense, and how it’s developing rapidly, and how it’s a bigger thing than we thought it would be. Do you think we have a future where our creativity and culture stems from AI and things they imagine and build? COWEN: In reverse order. First, in chess, so much of the creativity already stems from AI, computers playing chess. I’ve listened to computer-composed music, art. I don’t think it’s impressive yet, but I don’t rule it out by any means. So I think, at some point, those molecules will impinge on me. Guaranteed annual income — I could imagine that working pretty well in countries like Australia and Denmark, smaller markets where life is already less harsh in some ways, and there’s more collaboration, and the work ethic is understood differently to begin with, and they have more cohesion than the United States. But I am an American exceptionalist. We have this unique vision, a kind of extreme Puritanism, adopting personal projects that are work based and obsessively seeing them through in a determined way that I think is so special that, say, I never felt when I lived in New Zealand, a wonderful country. They can do UBI. But I don’t want it here. I’d rather keep that culture. I think it will do the world more good. And I think it also means we never will adopt UBI, or not any time soon. On Silicon Valley’s mood affiliation COLLISON: You write a lot about mood affiliation and the problems within it. And you write about this despite the fact that, I think, you believe that cognitive biases are themselves overrated. Can you, just for the folks here, quickly describe your current take on mood affiliation and what it is? And then, what is something that people here don’t believe and really don’t want to hear because of our own sort of collective Bay Area/Silicon Valley mood affiliation? COWEN: Mood affiliation was a concept I first coined to refer to people who judge arguments by the mood of the argument. There are some writers — maybe they’ll remain nameless — but they’re optimistic. If an argument is optimistic, they think the argument is more likely to be correct: “Well, things have been getting better.” I’m not saying that carries no weight, but be a very strict Bayesian, not just because the mood feels comfortable. A lot of very contemporary partisan debate is really about moods. If you feel someone is not condemning something with the right mood, you’ll reject the attached substantive claim. So a lot of the exercise I do on the blog is trying to teach myself how to detach and how to unbundle things, and inter-temporally substitute moods and contain bundles of optimistic, pessimistic, condemning, approving, tolerant, intolerant — whatever moods — at multiple levels at the same time, in some way. The Bay Area strikes me as having a lot of pearl clutching and a reputation for thinking it’s more tolerant than it is, and I think that’s true of both coasts. I think, in general, all cultures are oblivious. And America, in particular its coasts, tend to think, “We’re the cosmopolitan side of American culture.” And I really don’t believe that. I think you’re a uniquely brilliant, twisted, inward-looking, diverse monoculture, and I’m very glad you are. COLLISON: [laughs] Wait, wait, wait. You’ve already accused us of that. I want something that you, yourself believe or are quite confident is true but that, again, we don’t want to hear. COWEN: Well, that’s really the main lecture I want to give. Religion is underrated. I think, in general, people in California overrate the efficacy of government. I think libertarians underrate it. But if we’re in California, I guess I can’t not make that point. And you have unique advantages here. You have the cluster. So there’s a lot of things you can do and get away with that don’t work in a more general way, like raising the minimum wage to some level. That cluster gives you enormous rents. The world is not built out of clusters like that, so I would just say, be careful about overgeneralizing from your experience here. But so many things, we’re like, “I’m sure my view is right; California’s wrong.” I don’t think that’s the right way to go about it. I would say, “Oh, I like Southern California better than I like it here.” Maybe that’s unacceptable. I think Los Angeles is the greatest city in the world. I’d love to live there; it has the best ethnic food. There’s something about it, the way it’s a cosmopolitan city, sense of openness. Someone once said, “What’s real there is so phony and what’s phony is so real.” It’s always surprising me, and I love their diverse monoculture. My favorite part of this country. COLLISON: [laughs] Tyler Cowen, thank you very much. COWEN: Thank you, Patrick. ", "title": "Patrick Collison has a Few Questions for Tyler", "sentences": [{"3697": "Patrick Collison has a Few Questions for Tyler"}, {"3e53": "Subscribe to the podcast: iTunes / SoundCloud / Stitcher / RSS"}, {"947f": "A few months ago, Tyler asked Patrick Collison, CEO of Stripe, to be on the show. Patrick agreed, but only under the condition that he would do the interviewing. Thus, what follows is the conversation Patrick wanted to have with Tyler, not the one you wanted to have."}, {"7d8a": "Happily Patrick stayed true to the spirit of Conversations with Tyler, and their dialogue covers a wide range of topics including the benefits of diverse monocultures, the state of macroeconomics, Donald Trump, the amazing and eclectic economics faculty at George Mason University, Peter Thiel, Brian Eno, Thomas Schelling, why Twitter is underrated, and — most pressing of all — why Marginal Revolution is so strange looking."}, {"c588": "Listen to the full conversation"}, {"d1bf": "Read the full transcript"}, {"0214": "This conversation was recorded at Stripe’s San Fransisco office in late January 2017."}, {"4068": "PATRICK COLLISON: Thank you all very much for coming. I would typically start out with a lengthy introduction of the speaker’s various accomplishments and things that make them notable and noteworthy. But Tyler told me that de rigueur in these conversations is to keep them to 90 minutes. So I don’t think I can really go far down that list in this case. Suffice it to say that you’ve published 15 books? Is that the right count?"}, {"484b": "TYLER COWEN: I don’t know; I’ve no idea."}, {"c5d8": "[laughter]"}, {"9e1a": "COWEN: I think it’s more! [laughs]"}, {"0e3c": "Patrick’s research stack for Tyler"}, {"77fa": "COLLISON: Well, he’s published at least the number of books in the stack here, along with — actually, I think, second from the top is his new book, which is about to come out, which I trust you’ve all preordered on Amazon. I won’t be offended, or I’m sure Tyler won’t be offended, if you all take out your phone and go ahead and order it right now: The Complacent Class; I highly recommend it. And published more than 60 papers, obviously: the author of The Great Stagnation, which I think was the work that really brought you to top of mind, at least here in Silicon Valley."}, {"8980": "Tyler has visited every US state with the exception of Alaska, I just learned. And then, I think, really most impressively and noteworthy of all, Bloomberg Businessweek named him “America’s hottest economist” back . . . I think, was it two, three years ago?"}, {"ed3e": "COWEN: It was before I worked for them."}, {"6c36": "[laughter]"}, {"16d1": "COLLISON: Before he worked for them and before the era of fake news."}, {"4892": "COWEN: [laughs]"}, {"d6fc": "COLLISON: So you can all trust it. It’s out of this conversation."}, {"dacf": "COWEN: My mother put it on her Facebook page."}, {"7680": "On Paul Romer and the last thirty years of macroeconomics"}, {"4e39": "COLLISON: [laughs] So, the first thing I wanted to ask you about is, you’re an economist, at least originally. And Paul Romer, who’s now, of course, the chief economist at the World Bank, he opened his most recent paper with the assertion that for the last 30 years, macroeconomics has been going backwards. And I looked into this and I realized that Tyler got his PhD exactly 30 years ago. I don’t necessarily want to imply anything causal, but do you agree with Paul?"}, {"7644": "COWEN: [laughs] I don’t agree with Paul. I think we understand credit crunches much better than we used to. We understand the structure of asset returns and when and why risk matters, compared to earlier times. Models where you have multiple equilibria, where more than one thing can happen, we understand better."}, {"ca3f": "I don’t think we’ve solved any ability to predict business cycles or market crashes or Great Recessions. In that sense, there’s not progress, but I think the best theories often imply they’re intrinsically difficult to predict. So I think we ask much better questions, and on that particular issue of science, I’m much more optimistic than is Paul Romer."}, {"1c9e": "COLLISON: What do you think of the paper itself and the claims in it?"}, {"0d36": "COWEN: I thought the paper was quite a polemic. Writing a polemic can be useful. It attracts attention. It jolts people out of their “dogmatic slumbers,” to use the old philosophical term. But that said, a lot of the debate ended up being about either Paul Romer or a particular group of macroeconomists, rather than about what macroeconomics should do."}, {"9c00": "So I think a central question for macroeconomics is economic growth. I think our understanding of the determinants of growth, just like our understanding of how well science does, is extremely poor. Much of that is ultimately cultural, and bridging economic and cultural ideas we’re very bad at. And I think macro has neglected that centrally important topic. That would be my main critique of macro. But it would be phrased more gently than Paul’s."}, {"5806": "COLLISON: I would take it that’s partially because of your differences in temperament and not just the differences in belief structure."}, {"e032": "COWEN: Yes. But Paul — when I talk with him, he has a very gentle temperament. So I don’t actually have a good theory of Paul. I get on with him very well; I enjoy exchanging ideas with him. But sometimes he’s a firebrand when he writes."}, {"606e": "COLLISON: I want to dig in on this question, where you just mentioned how we have much better models now, but you touched on this notion of our predictive ability. And it seems to me that the old joke about economists, where economics is the field where you can win the Nobel Prize for proving or for showing x, and then later, you can go on to win it for showing that x is in fact false. And the Nobel Prize in ’74, when Myrdal and Hayek shared it, was evidence for this."}, {"5fa8": "But the thing I wanted to ask you is how much progress you think is actually possible here. We’re still having the debate as to what exactly is the nature of the relationship between interest rates and inflation. Right?"}, {"203b": "COWEN: Sure."}, {"5a1f": "COLLISON: And does one drive the other? And in which direction? What’s the nature of the comovement, and so on? Or was the Washington Consensus correct? Is the Washington Consensus correct? How much freedom around the movement of capital should there be in developing nations, and so on? What’s the right policy to adopt if you’re a developing country?"}, {"3101": "And it seems to me that . . . well, I won’t answer what it seems to me. I’ll ask you the question, To what degree do you have confidence that economics will ever get to durable answers to these questions, and what do you imagine the version of the Paul Romer paper in 30 years to look like?"}, {"03e8": "COWEN: Frank Knight once said something wise, maybe overstated, but he said, “The main function of economics was to offset the stupid theorizing of other people.” So it’s very useful as a form of discipline. And economics is a way of thinking — it’s very useful for inoculating you against other kinds of mistakes, even though in some ways, it may be a mistake itself. But I would say, in macro, we’re very good at retrodiction. If you look at the Great Recession, and you try to trace when and where were the bad mortgages made, and which banks held them, and when did they go bad, we can trace that with a level of detail and care, that, say, we couldn’t have done for the 1979-1982 recession. And that’s a scientific advance."}, {"1fd0": "But in terms of control, we believed in the great moderation; we were wrong. Now we’re probably wrong again. You have people like Jeremy Stein, who are convinced the Fed shouldn’t be holding rates down, people like Paul Krugman, who are more or less convinced they should have been. And given that we cannot rerun alternate histories, I don’t think statistics simply getting better will ever settle a lot of these key questions. So economics will always be hovering between art and science."}, {"19d6": "COLLISON: Will it always be retrodictive, or does it become predictive at some point?"}, {"f0af": "COWEN: I don’t think it will be predictive any time soon, not in our lifetimes. Not on a lot of important issues. There’s plenty of micro where it’s predictive. So people who work at Uber, they have a dataset and they can now answer questions with that. That works pretty well."}, {"de0a": "COLLISON: OK, on what basis should we then be making macroeconomic decisions?"}, {"109c": "COWEN: Well, we have to make macroeconomic decisions. To do nothing is also a macroeconomic decision."}, {"b95d": "COLLISON: Right. [laughs]"}, {"b88a": "COWEN: I think the notion of having a Federal Reserve System that is predictable and tries to keep the nominal flow of purchasing power growing at some steady rate, we know that something like that is close to the best we can do in a fairly impressionistic way. And that’s really important. People didn’t know that in 1929. It’s a huge victory for the contemporary world."}, {"66ad": "COLLISON: So do you think that, from a forward-looking standpoint, we should try to come up with some very minimal set of stable rules along the lines of what you just mentioned? And after that, the, again, forward-looking predictive efforts we’ve done most of as much as we are likely to be able to do, and everything after that is filling in the details on what happened, ex post."}, {"46e1": "COWEN: I agree with that, but I would add another caveat. If you have a good rule, you have to wonder if all systems — including the US Constitution — all systems in the world eventually can be gamed. It could be your macro rule would be good for a long time, but it could be gamed if only through people figuring out how to use politics to distort or lie about the indicators. So I’m not sure there’s an eternal solution, but I think there are policy semi-solutions that at least are good for 20 or 30 years."}, {"c369": "COLLISON: You’re touching on this notion that maybe economics is a lot of post-hoc illustrative power."}, {"781d": "COWEN: Yes."}, {"905a": "On culture and economics"}, {"5dfd": "COLLISON: Uncertain how much predictive power it has. You’ve written a lot about how the study of economics has influenced your appreciation for the arts, and for literature, and for food, and all of the rest. You haven’t written as much about the influence in the reverse direction. How has your appreciation for and study of the arts influenced your study of economics? And is this a version of that?"}, {"096b": "COWEN: This is a version of that. Here would be a simple example: If you think about Renaissance Florence, at its peak, its population, arguably, was between 60,000 and 80,000 people. And there were surrounding areas; you could debate the number. But they had some really quite remarkable achievements that have stood the test of time and lasted, and today have very high market value. Now, in very naive theories of economics, that shouldn’t be possible. People in Renaissance Florence, they didn’t produce a refrigerator that we’re still using or a tech company that we still consult."}, {"723f": "But there’s something different about, say, the visual arts, where that was possible, and it was done with small numbers. So there’s something about the inputs to some kinds of production we don’t understand. I would suggest if we’re trying to figure out, like what makes Silicon Valley work, actually, by studying how they did what they did in the Florentine Renaissance is highly important. You learn what are the missing inputs that make for other kinds of miracles."}, {"4f33": "Ireland and writing would be another example."}, {"5502": "COLLISON: [laughs] What fraction of tenured economists in the US do you think would agree with your take on the predictive power of macroeconomics?"}, {"0134": "COWEN: There’s really a sharp distinction here between people who do macro and people who don’t. So those who don’t are typically pretty cynical, but I think they’re actually too cynical. Macro is the favored whipping boy of a lot of economists. And the public is always upset at the macroeconomy, so you’ll always find an audience for this. But I think macro is slightly underrated. But then in macro, you have too many people who are simply too arrogant. They think they’re working on God’s chosen method in different ways. And that’s wrong also; it’s much more pluralistic than that. You’re just grabbing parts of the elephant in a fairly blind way, I think."}, {"9a12": "COLLISON: What field outside of economics has the most to say about macroeconomics?"}, {"9c10": "COWEN: Well, if you’re discounting statistics or econometrics, I think psychology. Some form of social psychology."}, {"8b47": "COLLISON: You mean, along the lines of . . ."}, {"d7e5": "COWEN: Why there’s contagion of beliefs, why beliefs move together, why people move to fear and panic."}, {"c1ec": "COLLISON: Yep, yep, the behavioral stuff?"}, {"0356": "COWEN: That’s right."}, {"edd7": "COLLISON: Yeah. What are the, say, top two most underinvested areas of economics today?"}, {"ec4a": "COWEN: Culture and economics, for me, is by far the most underinvested. I still think randomized control trials, they’re expensive, but you do actually learn things from them, which are probably true. That’s remarkable."}, {"ca53": "[laughter]"}, {"ba7f": "COWEN: They contain actual knowledge. Now, it’s true the questions you can ask are narrower, but it seems odd to turn down the reward of actual knowledge, right? [laughs]"}, {"a01c": "COLLISON: You recently linked to the new book whose title is escaping me — you’ll probably remember it — on the series of interviews on random control trials in economics. And there’s all these questions about to what degree they have external validity and so on. Do you think the critics are overstating the case?"}, {"d068": "COWEN: One of the main criticisms is, if you do randomized control trials, you’re studying something like, “Well, does paying mothers to bring their children in for vaccines work in getting the mothers to bring the children in?” You’re not asking big-picture questions of political economy. But big-picture questions of political economy — they can be very hard to control. There’s no one who can steer, say, what will happen with India or Kenya, but you can change some policy regarding, “Do you reward mothers for bringing their children in for vaccinations?”"}, {"df18": "You know the subtitle of our blog, “Small Steps Toward a Much Better World”: there’s something to that. We can make a lot of these small steps. It’s also related to the correct attitude about management. A lot of good management is doing very small things and not always some grand philosophy. So I think this is actually still underrated."}, {"7277": "COLLISON: You said that culture is one of the most underinvested areas."}, {"1c66": "COWEN: Yes."}, {"9d4b": "COLLISON: And you’ve written several books about culture, but among them Creative Destruction, and this is, at least as I read it, on the face of it, a defense of the effects of globalization on culture, right? And that while globalization might cause a decrease in across-country cultural diversity, we shouldn’t look at it at some God’s eye view, objective level. We should instead be focused on the individual, the subjective, and the operative level of diversity."}, {"cce5": "Here in San Francisco, we see the fruits of all that globalization, right? But you also say in the book, you do acknowledge the point, that there might be a decrease in total global cultural diversity as a consequence of globalization. If you think culture is so important and so underinvested in and so understudied, is it not too hasty to advocate for a force that’s producing a net reduction in the quantity of it in the world?"}, {"d0f2": "COWEN: Well, there are multiple readings of a number of my books. And I would say, when you’re looking at the globalization of culture, we’ve engaged in a rather significant cashing-in exercise. Say you have a very small community, Inuit in Canada or artists in Bali, they’re very small in number. And until they’re in some way reached by larger, richer cultures they can trade with, in many instances, they’re not that creative. They have some tradition, but it’s not fully mobilized. Then there’s this intense cultural interchange, and it’s very fruitful. There’s a flowering, there’s more commercial sale. Top creators come to be, more genres are defined. There’s more diversity within the Balinese world or within Inuit sculpture, say."}, {"4fde": "But eventually, that peters out as the smaller communities are absorbed by larger ones. Over the last century, we’ve done an unprecedented amount of this cashing in, by having smaller cultures obliterated. Now, one way to look at it is, well, they’re there and if you never touch them, that’s a shame. Is there an optimal rate of cashing in? I’m not sure that’s a variable you can control. But I think along some critical dimensions, our next century will be less creative than the last because we’ve cashed in on such a large number of small groups. And I worry about this with Ireland, too, a place you’re familiar with. The Irish literary tradition flowers, arguably, in the first half of the 20th century."}, {"6894": "COLLISON: Right."}, {"4237": "COWEN: And I worry now that people in Ireland hear too much American English, too much English English, and that style of writing, talking, joking, limericks, is becoming somewhat less distinct. Still many wonderful writers from Ireland, but again, it’s like an optimal stock depletion problem, and maybe we’ve pressed on the button a little too hard."}, {"e67e": "COLLISON: The transaction costs should be higher?"}, {"f429": "COWEN: Should be. But again, it’s a hard variable to control. With the tech world, in some ways, the tech world might be growing too quickly. People very quickly shift to Facebook, and that allows them to do much more socializing. And that, in some ways, actually limits the diversity of the world. They’re happier individually, but that’s another instance of cashing in that actually may not be socially optimal."}, {"6e51": "COLLISON: Is it that you believe that we can’t do anything about this, and so we should appreciate the consequences as best we can and make the best of it? Or you think that we should not do anything about this?"}, {"89ff": "COWEN: As an individual, there are definitely things you can do. You can be quirkier. You can be eccentric. You can partake in some networks rather than others, and subsidize things that otherwise might have their stocks depleted too quickly. At the macro level, it’s hard to steer."}, {"1b22": "The Nassim Taleb case — that free trade gives you too much monoculture — I take it seriously at an intellectual level. But the amount by which you would need to cut off trade to really create separately existing independent parts of the world that would give us greater protection against existential risk, it seems you would literally need to go back to 1500 to do that. And that’s not feasible; it wouldn’t be desirable."}, {"e3ca": "But I think he’s getting at a tradeoff that a lot of the rest of us aren’t sufficiently willing to admit. That in some ways, we’re investing in literally a monoculture of diversity. And that’s a little dangerous."}, {"2e23": "Like every city has restaurants. I saw a Guam restaurant on Mission [Street] when I was walking today. I ate at a Cambodian restaurant. Two days before, I was at Mandalay, a Burmese restaurant. And many cities have these. And we call it “diversity,” but we have to be careful also not to just be fooling ourselves."}, {"6a9b": "COLLISON: So is connectivity the worst thing that ever happened to global culture?"}, {"eb48": "COWEN: You need connectivity. Today’s world has much longer life expectancy, people are happier, they’re better off, we produce more things. But there’s a danger in connectivity. And the extreme acceleration of connectivity through tech, I would say, is a huge, non-controlled experiment that we need to be a little cautious about."}, {"7cbf": "COLLISON: You wrote with Derek Parfit back in the early ’90s about how our intuitions about the discount rate we should have for the future are wrong. The discount rate should be much lower, and we should care way more about people in the distant future. And if you believe that, shouldn’t that, on this particular cultural point, cause you even more concern? Because 500, 1,000, 5,000 years’ time, we’re not just slightly but enormously decreasing the amount of culture that they can expect."}, {"6e75": "COWEN: But keep in mind, if you don’t mine the stocks of these smaller diverse cultures, their outputs deteriorate and decay. So there’s so much from the past we’ll never have a clue about because it’s gone, and we never “exploited” it. That’s most of the culture, completely a closed book to us. If we’re worried about the future, you actually want to do exploitation plus preservation. Now, maybe we haven’t done enough preservation. But it doesn’t steer you away from the exploitation, caring a lot about the very distant future."}, {"9283": "COLLISON: You point out that Taleb says that the things we’ll have to do in order to counteract this effect will be so totalitarian that they’re not really even worth taking seriously. On the micro level, or on the local level, is there anything we can do to . . . perhaps we can’t solve it, but we can reduce the effect somewhat?"}, {"b7d4": "COWEN: Well, spend less time on Facebook. Use Google in funny ways. Right? Be careful —"}, {"2955": "COLLISON: Should we just use Bing?"}, {"374e": "COWEN: Well, Bing is too much like Google. Simply being a weirdo with Google will suffice, I think. Be careful how you use Netflix streaming. If what’s streaming on Netflix is your filter, you are part of the problem, I would say."}, {"a6c7": "COLLISON: But these are all actions for the individuals. I mean, us as a society, are there any policies we can enact or that we ought to follow?"}, {"77db": "COWEN: Well, our main policies toward the arts, more and more, have to do with copyright, patent, and intellectual property. I think, for the most part, those are too strict. We could improve them, and we’d get more creativity and more borrowing. But I don’t think, at the margin, those changes, good though they may be, will have a major impact on this issue. Just the core: How do ordinary people spend most of their time? That’s the big driver here. Other than having drastic changes in policy, I think most of what we have to do are these small steps at the individual level toward the much better world."}, {"395b": "And more randomization. Think more carefully about physical space. When I was growing up, I would drive my car into a town, maybe Philadelphia, with my friend, Dan Klein. First thing we would do is get to a telephone booth. Remember those? And like evil people, we’d rip out the pages for used bookstores and then drive around and try to find them. And we would find them by basically yelling out the window and asking people where some street might be."}, {"8a65": "COLLISON: [laughs]"}, {"3064": "COWEN: And that seems horribly inefficient."}, {"b5e5": "COLLISON: It does."}, {"ef74": "COWEN: But I think keeping a memory of why those odd, bizarre practices have some efficient elements when thought of as search algorithms. Preserving that knowledge is very important. And I think people who write or think or communicate with others can do that."}, {"4d41": "COLLISON: Would this all suggest that we should be even sadder than we are in the decline of various languages around the world?"}, {"c213": "COWEN: Yes . . ."}, {"ad68": "COLLISON: Spoken language."}, {"a818": "COWEN: We should try to preserve them when we can. Nahuatl is actually my favorite language when I hear it, and it still has well over a million speakers. It’s not in immediate danger, but I would predict, in less than 200 years, it will be gone. Gaelic has made somewhat of a comeback, but it’s still up in the air, perhaps."}, {"906a": "COLLISON: On this point, would you write the same book today?"}, {"4fc2": "COWEN: Not the same book. But when I reread that book, I think I capture the multiple layers of how globalization is dynamic and creative and welfare enhancing, but dangerous and stock depleting and giving us this funny monoculture of extreme diversity, patting ourselves on the back, but all being a bit diverse in the same way. I think that’s in the book, and I’m happy about that. We love to play at diversity theater."}, {"a312": "COLLISON: Say more."}, {"23c8": "COWEN: That’s one thing striking to me about the current world. You need different kinds of representation. But the kind of moves you make to get there often create a monoculture of its own. And you see this when you compare the coasts to other parts of America."}, {"a1f7": "I once wrote a blog post saying, “Well, there’s a lot more diversity amongst supporters of Trump than supporters of Hillary Clinton.” This got me in a lot of trouble. People wrote to me, outraged, “How can that be?” But there’s many kinds of diversity. For instance, a simple principle is, our correct point of view will be less diverse than people who are wrong because there are many more ways to be wrong."}, {"9737": "[laughter]"}, {"6ae9": "I once wrote a blog post saying, “Well, there’s a lot more diversity amongst supporters of Trump than supporters of Hillary Clinton.” This got me in a lot of trouble. People wrote to me, outraged, “How can that be?” But there’s many kinds of diversity. For instance, a simple principle is, our correct point of view will be less diverse than people who are wrong because there are many more ways to be wrong."}, {"1c61": "COWEN: If you’re completely right about something, that’s a way in which you’re not very diverse, even if you sort of feel you’re religiously, ethnically, otherwise more diverse. So whether the kinds of diversity that matter are the kinds that are elevated in current American political discourse, that’s so taken for granted, especially on the coasts. And I think, actually, most of America doesn’t necessarily agree with that."}, {"13ed": "On diverse monocultures"}, {"17c5": "COLLISON: Can you say a bit more about the concept of diversity with regard to culture or ideas or whatever? In particular, do you think diversity in some particular directions or some particular kinds of diversity matter more than others, or are you just for more heterogeneity in the broadest sense?"}, {"dde6": "COWEN: Well, let’s try thinking about highly creative groups because we’re in the Bay Area. There’s some way in which they need to share something that’s quite common: common language. Language in the broad sense of the term and a common framework."}, {"a4b6": "In the sciences, the great co-authorships, they’re very often people who are alike, and not completely different. It’s a little counterintuitive, but I think that’s true. But at the same time you want an optimal insulation from too many other frameworks. You don’t want to be obsessed with all problems. You don’t want all the knowledge of the ancient Mesopotamians in your head. Whatever people know a thousand years from now will only distract you. A lot of what the Bay Area does is make you non-diverse by focusing your attention on this semi-diverse monoculture. And the monoculture part of it is what’s effective."}, {"c741": "It’s like Renaissance Florence, where they didn’t think too hard about China or what was going on in Sweden. They had a particular set of problems based on satisfying a certain set of patrons; integrating the Christian religion, but with clever twists and being somewhat Straussian; having a positive sense of life; realizing they were rediscovering antiquity; using a shade of blue that had this wonderful, beautiful glow; and at the same time, having a kind of cynical commercial attitude about their own art, which they knew was done for money and profit. That blend was just perfect, and you didn’t want it destroyed by these outside elements."}, {"fa1b": "COLLISON: Are successful clusters places with the right kind of diverse monoculture?"}, {"6bba": "COWEN: Yes. And the right kinds of implicit barriers to too much outside influence. But they also tend to be stimulated by some major outside influences, such as in the Renaissance, rediscovering technologies from China and the Arabic world, rediscovering antiquity — a huge prod."}, {"9ca0": "Just like here, part of the prod is Moore’s Law. My goodness, what can we do now? And we’re going to exhaust all those possibilities as quickly as we can. So you need the prod. You need the insulation. You need the common language. You need the barriers. You need to be weird and have a theory of your own weirdness that’s different from what your own weirdness actually is because you’re, too, looking at it from the inside. And this area has that. It’s great. It’s inspiring."}, {"15a8": "On universal basic income"}, {"6921": "COLLISON: I want to actually get back to the topic of weirdness a little bit later on, but quickly, before we shift focus from Silicon Valley, many in Silicon Valley are talking about the idea of universal basic income and what we do when the robots take all of our jobs. And I think you were initially a supporter of it, and then you changed your mind."}, {"f188": "COWEN: Correct."}, {"2846": "COLLISON: Can you describe why you changed your mind, and also whether you think some kind of negative tax or sort of expanded version of the earned income tax credit — is that an adequate replacement for it, or do we need something further still?"}, {"bbe9": "COWEN: This is my worry with the universal basic income. It does make logical sense, especially as we get wealthier. But it, for me, was a kind of formative experience, about 2009, in response to the financial crisis. One of the better policies would have been mortgage cramdowns and write-offs for many afflicted people, and many economists agreed with this. Larry Summers pushed it."}, {"6089": "But politically, it proved impossible. People didn’t hate all of the bailouts as much as they claimed, but they hated the idea of the person next door getting a break that they didn’t get, when they had, in their own mind, worked harder and paid all their bills. And that proved impossible. So the notion of the kind of asymmetric treatments of neighbors, what kind of politics it would engender, post-Brexit, post-Trump —"}, {"83c1": "COLLISON: But it won’t be asymmetric; everyone will get it."}, {"f21c": "COWEN: It depends how you do it, right? But in essence, the people who work more are being taxed more to pay for the whole system, so on net, they’re getting less from having the system."}, {"4b87": "COLLISON: Isn’t that to some degree the case today? Do you think it just becomes more flagrant in a UBI world?"}, {"7f8d": "COWEN: It works today precisely because it’s not transparent."}, {"2d4f": "[laughter]"}, {"e685": "COWEN: And how many people, even economists, can explain to you how the earned income tax credit works, whether it matters, number of children, whether or not you’re married, who bears the final incidence. Even very few PhD economists could explain that incorrectly, much less correctly."}, {"ca91": "[laughter]"}, {"d20c": "[The earned income taxed credit] works today precisely because it’s not transparent. And how many people, even economists, can’t explain to you how the earned income tax credit works, whether it matters, number of children, whether or not you’re married, who bears the final incidents. Even very few PhD economists could explain that incorrectly, much less correctly."}, {"a8a0": "COLLISON: But wait —"}, {"7674": "COWEN: So many of the sustainable structures of the contemporary world have to become nontransparent."}, {"da70": "COLLISON: Do we just need a sufficiently obfuscated version of the UBI and then we’re fine?"}, {"5777": "COWEN: We call it “disability insurance.”"}, {"2f55": "[laughter]"}, {"532b": "COWEN: And as it works now, it’s not working. But I think we’ll actually evolve disability insurance, in some way, to become an obfuscated form of a partial universal basic income. And it won’t be enough, it won’t work that well. We’ll combine that with the earned income tax credit and some other policies, and it still won’t be that wonderful, but that’s what we’ll do."}, {"83c4": "COLLISON: There’s various debates as to whether there should be some absolute floor or whether we should preserve the property that some level of work is required in order for there to be any income, more along the lines of the earned income credit. Do you think that matters?"}, {"9240": "COWEN: I think the symbolic values of society rewards matter a great deal, more than I thought. If you have a universal basic income, it’s like you’re putting up a sign for immigrants, “This is the kind of country we are.” For me, selection of immigrants is very important. We don’t think about it enough. By having a lot of inequality, you’re putting up another kind of sign for immigrants: “Life here is tough. And if you live here, well, tough is tough.”"}, {"ad67": "But on the other hand, you’re building a stronger cluster of creativity and a stronger group. And it might be better to have the signs without UBI, less transparency about how you help people, and a variety of ethics that on the face are not entirely defensible. But when you view them as an advertising campaign for your immigrant-rich country, with more to come, you’re getting more productive people who will also help the rest of the world more."}, {"52c1": "Keep in mind, US generates public goods for the whole world, just like Stripe and Atlas do, so you’re never optimizing for “What’s best for this country?” You want to optimize for “What makes this country the most creative?” And that’s different than just making us happy. We’re doomed to be the somewhat screwed up, unjust, not-quite-happy-maybe-more-mentally-ill country. And we’re the Atlas, in some other sense, partly carrying some of the world on our shoulders."}, {"9d5c": "COLLISON: I’m glad we’re recording this so we can later put forward that conception of America."}, {"f3e8": "COWEN: [laughs]"}, {"bb1e": "On signaling and immigration policy"}, {"5dfb": "COLLISON: You mentioned immigrants."}, {"8ae1": "COWEN: Yes."}, {"e2f4": "COLLISON: Michael Clemens and Lant Pritchett, all the open border stuff and the trillion-dollar bills lying on the sidewalk, and so on. What do you make of it?"}, {"d0f4": "COWEN: I think they’re wrong, and Michael himself, as I read him, moved away from that view. My basic view: I’m pro-immigration. I think we should and can take in more people, both high-skilled and low-skilled. But there is some point where your politics is no longer sustainable. I don’t feel, in this country, even with what’s happened, that we’re at that point, but it places a real check on open borders."}, {"2cac": "A United States with open borders, I think, politically, would be unworkable in less than 10 years, even though it makes economic sense. It gets back to this optimal degree of insulation. There’s a political culture here, which requires a certain common language, common set of delusion, common set of myths, common set of things we understand. This country does it pretty well, not perfectly, and I don’t think open borders is compatible with that. I think it would kill the goose laying the golden egg. So I favor much more immigration, but not unrestricted immigration. I also think infrastructure would be a problem."}, {"d90c": "COLLISON: If you could put forward any immigration policy tomorrow, what would your policy be, for the US in particular?"}, {"c8b5": "COWEN: It depends how constrained I am. But just taking what we have and increasing all of the numbers. I think my own ability to judge, what kind of visas should there be more of? How do we manage the quotas? Should the preference be for family members?"}, {"b10d": "I’m a little more skeptical than most academics about the Australian and Canadian systems for this country. I think they work great for Australia and Canada. But for the United States, they would bring in too many high-paid professionals in service sectors that don’t bring that many productivity gains."}, {"30d0": "Having more advanced-degree professionals isn’t what we want. We want people who produce public goods in the United States, and that’s not really what dentists are. Maybe Australia wants more dentists. We want more engineers, creators, dreamers, artists, eccentrics. Our immigration policy should reflect that, and in some ways, maybe be more random or appear more nonsensical. So again, all the people who say —"}, {"ab70": "COLLISON: I think it largely succeeds at that."}, {"f69d": "COWEN: We do! [laughs]"}, {"b1c6": "On Trump, and the probability Tyler will vote for him in 2020"}, {"03cb": "COLLISON: This touches, at least obliquely, on the political status quo. And Brian Eno, who I think you’re a fan of . . ."}, {"367b": "COWEN: Absolutely. Another Green World, it’s one of my favorite albums."}, {"c854": "COLLISON: He said in an interview today that he is pleased about Brexit and Trump because they may be the kick up the arse that we need. ‘This is a proper crash and a chance to really rethink,’ but that it’s good news. Do you agree?"}, {"f84e": "COWEN: Not as stated. But there is a reworded version that I would agree with. Let me say, I’m already very clearly on record as not supporting either Brexit or Trump, for reasons which are more or less the standard reasons. But if you think all systems can be gamed and are in some ways not sustainable, when you crack into the wall, there is an optimal time for that, and you want to do it when other parts of your society and institutions are still healthy enough."}, {"6445": "So you can make a case, this shock has come at a time when we still can respond in a positive way. I don’t know how to prove or disprove that proposition. I think it’s quite possibly true. In that sense, it’s lowered my optimism. But my optimism about the mere election, given that the election is possible, I’m not as worried as a lot of people. I think there’s a chance it turns out to be a course correction that we needed, which is distinct from supporting the event itself."}, {"db43": "Maybe that’s what Brian meant. By the way, I’ve sent him an email asking to interview him, and for three months I haven’t heard back, but we’ll see."}, {"a4b1": "COLLISON: [laughs] If it turns out to have been a good thing, and let’s say, as assessed 20 years from now, why will that have been the case?"}, {"63b2": "COWEN: It could be there’s something about the diverse monoculture of the American coasts that wasn’t as good as we thought, wasn’t as stable as we thought, and was more resented than we thought. Certainly, the latter seems to be true."}, {"0ac3": "If the strategy was to double down on the progressive vision, bring in more immigrants, have a permanent Democratic majority, and remake America in the progressive ideal and be a larger Canada, possibly, that was the path we were on."}, {"8404": "Quite possibly, that was a bad idea. And again, I don’t prefer the way maybe we’re getting off that path, but if we were going to get off it anyway, this might be the least painful way, at least possibly. I worry a great deal about the associated risks. But again, I don’t rule that scenario out."}, {"8dab": "COLLISON: What do you think that the probability is that you will vote for Trump in 2020?"}, {"8c20": "COWEN: Zero."}, {"9822": "[laughter]"}, {"17bf": "COLLISON: Even if one of these versions comes to pass?"}, {"857d": "COWEN: I don’t think I would know by then. I find it unaesthetic, and just my temperament: I’m not attracted to people who are either bullies or who pretend they’re bullies. And just that mood affiliation, I don’t want. Nothing’s “probability zero” but I won’t make the assessment in an instrumentally rational way. So, it’s pretty close to zero."}, {"aaea": "COLLISON: Obviously, Trump is in the throes of making all sorts of, at least by traditional standards, unconventional appointments. If he created the new role of Czar of Great Stagnation–Ending and asked you to take the job, what would your policies be?"}, {"3e04": "COWEN: My policy would be, tell him to give that job to Peter Thiel."}, {"b103": "[laughter]"}, {"6e1b": "COWEN: And he’s done it. I think a lot of the Trump appointments actually are excellent or might turn out to be excellent: at the FCC, possibly at the FDA. Education has possible upsides, though I don’t think it will really change much. I think there’s a good chance Rex Tillerson turns out to be quite good. Now, what it’s like to be a good appointee without proper support from the executive branch? We’re going to run that experiment. It could all go badly."}, {"3250": "[laughter]"}, {"85c8": "COWEN: But I also think [Stephen] Bannon is very smart and it’s quite possible the strategy is, “We’re going to appoint a bunch of people who are really just different and talented but not political, and give them all free rein, and we know 80 percent of them will fail, but a bunch might do good things.”"}, {"934a": "We saw the Obama model be a unifier, hope and change, appoint academic, smart people who love Obama and Obama loves them. And they’re loyal to him, and there’s a semi-well-functioning White House. That didn’t actually change many things, whether you agree with all the programs or not. So that’s their immediate experience, and they’re going to try to do everything different. As a social scientist, I find this fascinating."}, {"6654": "But the notion that two or three of the agencies could come out of this much better, and a few, much worse — I worry the most about the Fed and the EPA. But I think a lot of them are very smart, talented, able people, and we’ll see what they’re able to do."}, {"d74a": "COLLISON: The case is often made that the EPA doesn’t matter a great deal because it’s economics that determines what happens on the climate front. Coal plants are becoming uneconomic, and China is canceling plans to the build them, and solar is crashing in price, and so forth. Given all of that, why do you think the EPA really matters?"}, {"4ced": "COWEN: I don’t think we know how much the EPA matters, but I don’t see any reason to deliberately do bad things with it."}, {"6972": "[laughter]"}, {"b9e7": "COWEN: And it seems quite likely that’s what will happen. But I think you’re completely correct, that the major factor in, say, climate change, it could just be luck. Do we invent something cheap enough that the whole world wants to do it? And the political battles may not go down in history as that big of a thing. I know they feel important and there’s good guys, there’s bad guys, there’s symbolic whatever on the line."}, {"e14d": "I’ve said I think a carbon tax would be a good idea. You’ve got to tax something; why not do that? But that all said, it’s probably not the main thing, and a carbon tax is, in many ways, an overrated idea. Getting science and the tech world to work better is probably higher impact. Because US, if the rest of the world grows, we become a less and less important polluter. We need something cheap enough that everyone is going to do it — Africa, Vietnam. So it really has got to be pretty good. And that’s up to all of you."}, {"8165": "On Schelling and the most important issue in the world"}, {"4346": "COLLISON: There’s a lot of discussion about all sorts of tail risks, especially geopolitical risks, that we could face for the next four years. Your PhD advisor was Thomas Schelling."}, {"1d04": "COWEN: Correct."}, {"34a5": "COLLISON: How would Schelling have looked at today? And are there any ways in which your views about this, the probability of extreme tail risks and how we should approach and handle them, differ to what you expect he would have thought?"}, {"7ce9": "COWEN: I had a long conversation with Schelling about a year ago. He passed away just this year. I asked him some of these questions. One of his big influences on me was simply to get me to see nuclear weapons will always be the most important issue in the world, no matter what else you might think. It’s very interesting: you go back, read people right after World War II . . ."}, {"7e70": "COLLISON: Why is that, given all the putative cyber warfare and pathogenic weapons and all these other catastrophic macro events that we think could occur?"}, {"a7ac": "COWEN: There’s a chance pathogenic weapons could become more important at some future point, but for now, it’s still nuclear weapons. A lot of people have them. They’ve been used, twice, by us. They might become much easier to acquire. They can be launched by mistake. The institutions surrounding them are not always well designed. North Korea is a particularly hard-to-understand case that might be highly dangerous."}, {"c243": "So the notion that nuclear weapons are always the most important issue — this also gets back to your Trump question — you want, especially from this country, a lot of predictability. And I worry right now that the risk premium — especially in Asia, which does not have Western Europe’s built-up antiwar tradition — that we’re underestimating that risk premium. I don’t see it in asset prices. I think it’s simply poorly understood. I don’t have a prediction, but it’s my single biggest worry, that the South China Sea and northeast Asia are less stable than we think."}, {"c9f1": "COLLISON: Is there any way in which your outlook differs to Schelling’s?"}, {"4b22": "COWEN: Schelling himself, his own thoughts, went through several phases. But he thought what was remarkable is how much the world has sustained a taboo against nuclear weapons use. He thought this was a very strong and highly enduring norm that is still with us. He gave a whole talk on this, it’s still online. And he gave talks on this, actually, in Iran, I think about seven or eight years ago. They’re very interesting, to hear Schelling addressing an audience of Iranians."}, {"32cc": "I’m not convinced the taboo is that strong. It’s certainly the case no one has used them. But whether it’s mere self-interest or whether there’s actually a norm and taboo with independent force, I’m not convinced by his arguments. And that’s made me a little more pessimistic."}, {"4a69": "COLLISON: To close off on this topic, you’ve said that this broader phenomenon of Donald Trump and his election is making us all stupider. Can you expand on that?"}, {"749d": "COWEN: Well, I think it’s made the Left more stupider than the Right. Whenever the party elected is objectionable, the people in opposition become stupider, as pretty much a rule. They become more emotional, and they attack the worst versions of the ideas they’re against, when I think they should pick and choose more, and should move more toward the center, and try to bring more Americans along."}, {"344f": "The important thing now is to give people who are Trump supporters an open path into not being Trump supporters, and being something else. A lot of the rhetoric isn’t doing that. I thought the marches went pretty well, from that point of view. They were very broad, very American. That, to me, was very encouraging. But a lot of the intellectual Left, I feel, has become polarized and is doing the opposite."}, {"9f70": "On economics clusters"}, {"5903": "COLLISON: I want to ask you about the set of people that you work with."}, {"2c04": "COWEN: Sure. They’re all dear friends, so I’m totally biased."}, {"7588": "COLLISON: [laughs] The group that you’ve helped assemble at George Mason [University]. I’m talking about people like Arnold Kling and Robin Hanson and Bryan Caplan and Alex Tabarrok and so on. How did that happen? Because there’s such interesting commonalities between them, and they represent such a large fraction of interesting ideas. And somehow, so many of them are in the same place."}, {"26dc": "COWEN: They’re all inquiring, they all have broader interests, they all feel economists should be able to speak to real people. They all, in varying ways, have some kind of libertarian bent, albeit with a lot of diversity."}, {"99b0": "Some of it is, George Mason has long been a school willing to take a lot of chances. And we’ve had the Mercatus Center, the Public Choice Center, the Experimental Economics Group. We’ve invested in these Florentine-like clusters of people who are different, and been willing to make huge bets on them, and see that through consistently and have determination, and stick with our strategy."}, {"d0c6": "COLLISON: Was it obviously a good decision to hire them at the point where you did?"}, {"4bb4": "COWEN: No. Of course not."}, {"72c7": "COLLISON: What were you looking for? What made it clear to you?"}, {"b26b": "COWEN: Well, I voted on each of these hires. I voted for them. For a lot of them, I was on the hiring committee. Robin Hanson’s a good example. When we hired Robin, he was much older than a typical assistant professor would be. And of course, we don’t practice age discrimination, and neither does anyone else, but . . ."}, {"cbd1": "[laughter]"}, {"effd": "COWEN: Robin was going to have a tough time being hired. And I gave Robin some of my papers to read. He came in. He was a little, actually, obnoxious to me. Though he’s one of the nicest people you’d ever want to meet. He sent me back comments on my papers, that they were all wrong."}, {"cdda": "[laughter]"}, {"475e": "COWEN: There was no preliminary politeness: ‘I thought this was interesting, but…’ I thought this was great. So I thought, “We need to hire Robin. Robin is different.” And Robin wrote papers I thought were crazy, but he clearly also was a genius. I pushed very hard to hire Robin, and he made a good impression on a lot of other people. He’s been with us ever since."}, {"c59a": "COLLISON: Were the papers in fact all wrong?"}, {"14d6": "COWEN: Robin’s criticisms were all good points. But they weren’t entirely wrong."}, {"b704": "[laughter]"}, {"d8c0": "COLLISON: [laughs] So, if you had to somehow force yourself to reduce these people to a single strand of commonality between them — you mentioned some of the shared characteristics, but what’s the fundamental thing that links them?"}, {"d3d5": "COWEN: I think about this quite a bit. It’s some mix of how one processes information, and the willingness to be analytical about many things, and to take your beliefs in one area and at least try them out on all other areas."}, {"5cce": "What I find depressing about a lot of academia is you have people who think very scientifically about their research, but then their life is just something totally different. Or they talk about politics, and they’ll be just like anyone else, not very analytical or very scientific. So the idea that, if you believe something, at least try to see it through: What else does it imply? What else does it imply for all other things I believe in life? And then allow that to have feedback into your research. I think that’s what we all have in common at the most fundamental level."}, {"867c": "What I find depressing about a lot of academia is you have people who think very scientifically about their research, but then their life is just something totally different. Or they talk about politics, and they’ll be just like anyone else, and not very analytical or very scientific. So the idea that, if you believe something, at least try to see it through, “What else does it imply? What else does it imply for all other things I believe in life?” And then, allow that to have feedback into your research."}, {"97b4": "COLLISON: In what ways should there be more such clusters?"}, {"d9f4": "COWEN: In economics and academia, there are some other clusters. You had one at UMass Amherst, which isn’t quite what it used to be. You had one at Notre Dame. Those were more heterodox left-wing clusters. There’s a group called INET, backed by George Soros, that’s trying to create more of these. I think that’s a very positive endeavor. I would like there to be a few departments that are still some version of Marxist, other heterodox views. I’d like there to be more departments that specialize in experimental economics, other methods."}, {"0858": "But you have too many people trying to just move up in the rankings and be number 23, which isn’t necessarily that glorious, rather than be number one or two along some stranger dimension."}, {"5f1e": "COLLISON: If we go home and we all conclude that we should ourselves become part of some movement to help create more of these heterodox clusters, is the characteristic you’re just describing about trying to extrapolate views to other ostensibly unrelated areas, is that the thing you should be trying to do even outside of economics? Or is there some underlying thing that’s the right guiding principle when you’re trying to create non-economic heterodox clusters?"}, {"42bc": "COWEN: No, I think it’s a fairly universal principle. But it gets back to these smaller cultures, like the Inuit. They tend to be absorbed precisely because they’re smaller in number. Today, there is no unique Florentine style of painting; it’s long, long since gone, for centuries. So you have to replenish them."}, {"e7bb": "But we now have this thing, tech and connectivity, and that’s outracing the kind of counter-tactics to keep certain things weird. You create some niche groups by bringing people together, but there’s also a homogenizing effect. It’s so quick, so rapid, so powerful. What’s going to win that race? I’m not sure. But I fear a bit how quickly it’s going and how hard it is to steer."}, {"8b3c": "On religion as cultural capital"}, {"4374": "COLLISON: We’ll come back to that. You’ve often argued, contrary to the prevailing trend in the US and in Europe, that society should become more religious."}, {"40ae": "COWEN: Sure."}, {"8bcb": "COLLISON: It would be a good thing if that happened. Why do you believe that? And what’s the crux of your disagreement with the supposed expert opinion that holds the opposite position?"}, {"c601": "COWEN: Well, first, let me say, I am myself a nonbeliever. You could say I’m an agnostic, but tending toward nonbelief. But it seems to me, religion is a very special form of cultural capital. It’s people’s most fundamental beliefs about the world. People will believe in something. And for much of the West, I see Christianity, and to some extent, Judaism, as having had a very special role. The notion that we should just cash in on that and all become secular, and not be sure what we believe in — I see a great danger in that."}, {"85c3": "If you visit a place like England, where church attendance is remarkably low, people are extremely secular, that strikes me as unhealthy. Secular societies tend to fall into much lower birth rates. They don’t reproduce themselves. That’s one of the most damning things you can imagine, actually, about a society."}, {"b95a": "Religion, even adjusting for income, has predictive power over the birth rate. It’s one reason why America still has a stable or a typically growing population, along with immigration. And American religion has stayed remarkably strong for our level of income. It seems almost obvious to me that’s a positive."}, {"d7e9": "This paper by Jon Gruber using instrumental variables — religion tends to make lives better: more social capital, more cooperation. But that’s, I think, secondary to the bigger-picture question: What do people believe in? Do those beliefs encourage self-replication of the basic society or not? And America’s doing a good job on that, mostly because of religion."}, {"4b46": "COLLISON: Is religion one of the few remaining sources of durable cultural diversity in an increasingly connected world?"}, {"4c47": "COWEN: It is. And there’s something fundamentally strange about religion, but in a rewarding way. My next interview — it’s actually on Thursday — I’m interviewing a rabbi. So I’ve been re-studying the Bible. And the Bible’s one of the most beautiful, strange, and open-to-multiple-interpretation books that there is. And it’s one of the books you can learn the most reading and rereading and rereading. I’ve been finding this very rewarding."}, {"6545": "You look at parts of the culture. Like today, Shakespeare and Jane Austen, they’re much more popular. But our knowledge of the past gets thinner. Those secondary figures seem to be getting lost. A small number of things get elevated: maybe it’s the Beatles from the 1960s music, Shakespeare. But, say, a lot of the Russian novelists seem to be falling away. People don’t seem to read Nietzsche as much as they did in the ’60s or ’70s. So there’s a centralization of what we take from the past because the present is so crowded."}, {"6aab": "COLLISON: Michel Houellebecq’s Submission was one of your favorite books in 2015."}, {"8fe9": "COWEN: Yes."}, {"7de2": "COLLISON: This is a book about a country that in fact reversed this trend towards increased secularism. What did the book mean to you?"}, {"d0f5": "COWEN: Submission is, in my view, a fundamentally Straussian work. That is, it has secret meanings. It has to be read in the European context. Typically, it’s regarded as Houellebecq being anti-Islam. He said some things in public that are somewhat outrageous on the issue."}, {"d238": "But I think actually he’s envying Islam and the Muslims in France for the fact that they believe in something. Writing like Jonathan Swift, it’s a criticism of contemporary France that we don’t believe in things enough anymore. And here’s a dynamic element in our society — maybe in some ways, we dislike it, but we actually ought to learn from it. And it’s about the weaknesses of his own class, the French intellectual class that he comes from. I thought it was spot on."}, {"4270": "COLLISON: Are you in favor of not just more religiosity but more religions?"}, {"132b": "COWEN: I’m not against them. But of course, it’s hard to start them . . ."}, {"31c6": "[laughter]"}, {"d100": "COWEN: In ways that are sustainable. I find it very interesting to study relatively recent developments, such as Mormonism. It feels funny to people that somehow when you have religious narratives that are recent, they sound weirder than ones that are old. But that’s quite arbitrary."}, {"8280": "Possibly, I’m more of a fan of monotheism than religion per se. I agree with [Georg] Hegel’s remarks on polytheism that may not be conducive to political order. I’d say that’s still an uncertain question, but it’s a worry I have. And as [David] Hume pointed out, monotheism itself breaks down into partial polytheism because people want multiple things to worship, to pray to, to talk to. So it’s not a stable balance."}, {"35ee": "On the aesthetics of Marginal Revolution and other important issues of the blogosphere"}, {"d7f9": "COLLISON: [laughs] Why did you start Marginal Revolution?"}, {"0e00": "COWEN: Alex Tabarrok came into my office, and he said, “Tyler, we have to write an economics textbook.” And I said, “Alex, first, we need to write a blog and become better known, and then we’ll write an economics textbook.”"}, {"9690": "[laughter]"}, {"2f74": "COWEN: I’m not sure what Alex thought at that point. I think he felt he was just humoring me, and that he really wanted that we write the textbook. I don’t know. I’ll ask him."}, {"08af": "We did the blog and that went very well. But it even took a few years before it really took off. We started, I think 2003, I’m not sure. But I think persistence and determination for something you enjoy and believe in is very important. It’s related to your remarks on religion. And I like doing it. We just kept on doing it and thought, “If we have something to say, giving it away for free ought to lead to something. And if we don’t have something to say, giving it away for free ought to tell us we suck. Full steam ahead.” And I think that’s a good attitude to have."}, {"b568": "We just kept on doing it and thought, “If we have something to say, giving it away for free ought to lead to something. And if we don’t have something to say, giving it away for free ought to tell us we suck. Full steam ahead.” And I think that’s a good attitude to have."}, {"5761": "COLLISON: Why does it look so strange?"}, {"1ef1": "COWEN: Does it look strange, Marginal Revolution?"}, {"de60": "COLLISON: Yeah. It looks old."}, {"e246": "[laughter]"}, {"354e": "COWEN: It is old. It has that funny green color because that was originally the shade of green that George Mason had. And I think, Alex, who did the visual design . . ."}, {"b6ad": "But I’ve been the one saying we need to keep it. He took the green to stand in for George Mason. And I think green, so often, is an ugly color."}, {"4779": "COLLISON: I like green."}, {"7677": "COWEN: Well, you would like green."}, {"0d4a": "[laughter]"}, {"fae1": "COWEN: But I thought the notion that we would deliberately choose an ugly color was a good idea. It would imply the merits of the enterprise had to be elsewhere."}, {"2860": "[laughter]"}, {"3702": "COWEN: All the places that look nicer, they’re usually connected to advertising. We always wanted to signal we’re not about ads, it’s about the ideas, and that we’re retro. Now, we’ve been doing it a long time — I feel it ought to look retro."}, {"3d7f": "COLLISON: Have the ways in which it’s been valuable for you changed over the years?"}, {"a3bc": "COWEN: Absolutely. When I started it, hardly anyone read it. When I started, I thought, “If 5,000 people read it, this would be something remarkable.” That happened pretty quickly, so, for me it was enough. I actually think 5 people’s enough. And at times, like during the financial crisis, over 100,000 people were reading it on a given day, plus RSS feeds. I’m not sure how many total. And that seemed absurd. But 10 years ago, it was a way to connect with younger people. And now, the young are much less likely to read, and it’s a way to connect with older people and wealthier people and better-connected people."}, {"d2ff": "COLLISON: You just need to start the Snapchat version."}, {"1045": "COWEN: Yes. [laughs] Maybe we will someday."}, {"641f": "COLLISON: What kinds of blogs should there be more of in the world?"}, {"6fc7": "COWEN: Single-issue blogs on issues of importance. If you take something like penal reform, an underrated cause. Prisons, I think, are barbaric, but it’s not an easy problem to solve. There’s not a quick fix. Some people do need to be constrained in some way. The idea that there should be more blogs that track that and persistently deliver the message, “Something is wrong here.”"}, {"f4d8": "Issues of animal welfare on blogs. Economics on blogs is doing pretty well and has for a while. It’s one of the healthier parts of the blogosphere. It’s very hard to blog philosophy. Maybe someone will figure it out. I tend to think it usually doesn’t work. Current events works. Partisan politics works. But single-issue blogs — maybe they’re not profitable, but I think, socially, they could have a big positive impact."}, {"4194": "COLLISON: Why do economics blogs work better than other fields? Other academic fields especially."}, {"b27d": "COWEN: Economics has a common language, getting back to the point about what makes for good clusters."}, {"c4d8": "COLLISON: But don’t other fields?"}, {"0320": "COWEN: More than other social science fields. We have microeconomics. You can put an argument into micro and all economists can grasp it, and anyone who knows some economics can make some sense of it. And we have an empirical side. The empirical results of economics, a lot of them, you can communicate in a sentence, and often to nonspecialists. So both the common framework and some empirical element, even if you’re a little skeptical about both. They’re there as a first offering, even if you end up mocking them."}, {"a829": "Sociology doesn’t have the common framework, philosophy, the empirical element is tough to find. In analytic and continental philosophy, the arguments take so long. Economic arguments, if they’re good, they don’t take that long. I might be wrong, but if an argument takes 10 pages, it’s almost certainly too complicated."}, {"0341": "On the question everyone has for Tyler"}, {"668d": "COLLISON: Right, right. I think many of us are here so we can ask the question, “How do you read so much?”"}, {"ff2f": "[laughter]"}, {"6e74": "COWEN: By reading a lot. If I read fiction, I don’t read fiction much faster than most people. Maybe a little faster, but within the normal bounds. If you just read a lot of books, you find most books aren’t very interesting. You can focus on what’s important and actually get a lot read."}, {"f9c0": "So, I’ll pick up a book, put it down. Someone says, “How long did it take you to read that book?” And I’ll say, “Fifty-two years,” because I’ve been reading since I was three, and that’s the correct answer. People don’t get that. It took me 52 years to read that book. So I’m not a fast reader. I’m a very, very slow reader. You’re just mis-measuring the unit if you think I read something quickly. [laughs]"}, {"ba36": "So, like I’ll pick up a book, put it down. Someone says, “How long did it take you to read that book?” And I’ll say, “52 years.” Because I’ve been reading since I was three. And that’s the correct answer. People don’t get that. “It took me 52 years to read that book.” So I’m not a fast reader. I’m a very, very slow reader. You’re just mis-measuring the unit if you think I read something quickly."}, {"e189": "COLLISON: I remember you commented in an interview a couple of years ago that you discard a lot of books. Are we all making a huge mistake by finishing so many books?"}, {"de5f": "COWEN: If you finish them. I’m not convinced you all do."}, {"b9c2": "[laughter]"}, {"9c4d": "COWEN: So there’s data from Kindle on this."}, {"978c": "[laughter]"}, {"d85a": "COWEN: And whether it’s cheery or depressing, you can debate. Now, you might be more willing to finish a physical book because it has an embodiment, maybe it’s more vivid, or maybe by buying it, you made a greater commitment, as opposed to having 400 unread things on your Kindle."}, {"95b8": "But serious readers probably finish too many books and sit through too many movies. It’s a biological intuition. Be loyal to things, which is a good intuition. But if you can selectively discard it for parts of your intellectual life without discarding it for your personal life, great."}, {"3345": "COLLISON: Does this Kindle data about our median inability to finish books, does this suggest anything deficient in the artifact of the book itself? Should it be otherwise?"}, {"6d16": "COWEN: There are probably too many books. It depends what your goal is. If your goal is simply to learn something, so often, reading a blog post is better than reading a book. Even if the book is, of course, much longer. Books embody knowledge, they store knowledge, they certify knowledge. Those are important, I’m not anti-book. But as a means of communicating knowledge, once you’ve read a certain number of key, earthquake, worldview-shattering books, books are way overrated. They’re actually a pretty weak, impotent way of learning new things."}, {"cc5d": "COLLISON: Is there something between blogs and books that you think ought to exist that does not?"}, {"4f61": "COWEN: PDF? I don’t know. [laughs] I’m so often disappointed in those."}, {"2701": "Books that really change your mind are the best way to learn. But there’s only so many of those. There’s depletion of the stock, and you age. And after that, travel, and then meeting clusters of people. You talk to them, and you learn areas by meeting them, and toss in some books. And you should read more and more in clusters, pick an area from a time in history and read in that, rather than reading a book."}, {"bd6c": "COLLISON: Do you have any heuristics for getting better at more quickly finding, identifying books that are likely to change our minds?"}, {"a65e": "COWEN: Email me. [laughs]"}, {"ff0c": "Or read Marginal Revolution. I can’t have a better heuristic than what I say in other contexts."}, {"a97d": "COLLISON: But how do you do it? You can’t email yourself. Well, you can email yourself, but I’m not sure how effective it is."}, {"27be": "[laughter]"}, {"879f": "COWEN: I sometimes say my business model is, I respond or at least try to respond to every email I receive. I don’t quite hit 100 percent."}, {"1f7f": "COLLISON: Well, that sounds very dangerous if you ever do email yourself."}, {"ae64": "[laughter]"}, {"d762": "COWEN: I email myself names of restaurants, but I don’t respond to those. That’s why it’s not 100 percent."}, {"ec5c": "But I feel if my responses show the right temperament, that people will tell me everything I need to know. And I think that’s worked pretty well. So email’s underrated, in my worldview."}, {"afb6": "On things under- and overrated"}, {"058a": "COLLISON: Well, on that note, I wanted to ask you about a couple of things and whether they are in fact over- or underrated."}, {"190b": "COWEN: Sure."}, {"bea3": "COLLISON: Starting out with something that obviously has a lot of popularity here: effective altruism."}, {"1ab1": "COWEN: It’s overrated by the people who know what it is. It’s underrated by the entire rest of the world."}, {"fa93": "COLLISON: Can you expand on the former?"}, {"03c2": "COWEN: A lot of giving is not very rational. Whether that’s good or bad, it’s a fact. And if you try to make it too rational in a particular way, a very culturally specific way, you’ll simply end up with less giving. And then also, a lot of the particular targets of effective altruism, I’m not sure, are bad ideas. So somewhere like Harvard, it has a huge endowment, it’s super non- or even anti-egalitarian. But it’s nonetheless a self-replicating cluster of creativity. And if you’re a rich person, Harvard was your alma mater, and you give them a million dollars, is that a bad idea? I don’t know, but effective altruists tend to be quite sure it’s a bad idea."}, {"9b89": "I think there’s too much pretense of knowledge in the movement as it is. But that said, relative to the people just making mistakes, it’s way, way, way underrated. So I’m actually a big fan of it, in a public sense."}, {"c8ff": "COLLISON: How about flying cars?"}, {"0a9e": "COWEN: Flying cars, I think, will be dangerous for a long time. And I don’t know why you need to fly and then drive. So you can fly and then Uber or taxi, and you separate the flight and the car. Until I hear a good reason why the integration is so important, you can carry your iPad from one to the other and have a pretty integrated experience. So I’d much rather have the 140 characters. [laughs]"}, {"e4d5": "COLLISON: Well, that was going to be my next question: 140 characters, over- or underrated?"}, {"5ea4": "COWEN: You mean, Twitter itself? Or the characters?"}, {"1af3": "COLLISON: Both."}, {"cc15": "COWEN: I don’t think they should relax the rule as they’ve done in a number of ways. Tweets are too long. There are too many photos. There ought to be like a Pigouvian tax on putting photos and subtweets in your tweets and threads. I favor a nonzero amount, not like the old rules, but it definitely should be limited and taxed with micropayments. And I think that would make Twitter better and quicker."}, {"a455": "COLLISON: We agree."}, {"1fc6": "COWEN: But mostly, I’m a Twitter fan, and rules really matter for their own sake. So, yes, 140 characters plus."}, {"cff5": "COLLISON: And Twitter itself, over- or underrated?"}, {"a751": "COWEN: Underrated, and I think Trump has shown how powerful it is. Again, you don’t have to agree with his tweets, but it’s woken the world up that Twitter is not just some inferior Facebook that never was going to turn out to be anything. It’s extraordinarily powerful. People in Iran have known this for a long time. It will stay important and powerful. I think it’s still very, very underrated, actually. As a commercial venture, I couldn’t say, but it’s a force for shaping society."}, {"7f21": "COLLISON: You use Twitter but not Facebook. Why is that?"}, {"b2e9": "COWEN: Partly my time is limited, but the Facebook page, to me, is too confusing. It’s like William James’s “buzzing, blooming confusion.” And they always change it, and I get a headache. It’s like trying to work a very complicated microwave oven."}, {"c07c": "[laughter]"}, {"ad57": "COWEN: And I can’t really work a simple microwave that well. I’m sensitive to the complexity of the visual field. But that said, if you have broadcasts to larger numbers, would you prefer the smaller number, the closed-gated thing that’s not searchable? I don’t see why I would."}, {"72ee": "And I worry, at the social level, Facebook is subsidizing sociability too much. A function, say, that used to be served by music when you’re in the seventh grade — “This is the band I like” — it’s now served by social media. It’s pulling away a lot of hidden, deep, implied subsidies to culture, and our culture is in some ways weaker because we’re happier and more sociable. I don’t like that."}, {"c3de": "[laughter]"}, {"0f97": "COLLISON: Is Facebook net good or bad for the world?"}, {"da30": "COWEN: We don’t know yet. If you’re a utilitarian focused on happiness, it’s very likely good. But if you’re a [John Maynard] Keynes-like person, who cares about the aesthetic worth of the most significant contributions, and you want to see another Led Zeppelin come to pass, then it’s probably bad. And I have a bit of that in me."}, {"ca9e": "COLLISON: Silicon Valley, over- or underrated?"}, {"3115": "COWEN: What Silicon Valley means, I’ve become confused by. If you say “the Bay Area,” I think it’s been overrated up until quite recently. A lot of it was just better leisure, and now, it’s really starting to be integrated with the physical structure of things, and it’s probably quite a bit underrated. The diversity of business is possible here, I think, it’s just getting going. I would say definitely underrated, looking forward."}, {"7c05": "COLLISON: Why does the term confuse you?"}, {"5366": "COWEN: Well, you’re not in Silicon Valley, are you?"}, {"6883": "COLLISON: Do you mean geographically?"}, {"7d68": "COWEN: If you say “Bay Area,” I feel more comfortable with my answer."}, {"bb69": "COLLISON: [laughs] Washington, DC."}, {"6d00": "COWEN: As a city to live in, it’s underrated. I think its weather is underrated. As an intellectual and media capital, it’s one of the most stimulating places to be. It’s still highly livable. We live half an hour outside of Washington when there’s no traffic, ha-ha, and still have deer and fox on our lawn every morning at 6:30 a.m. That’s amazing. There’s great ethnic food and no major downside, except for the fact you’re not in Silicon Valley."}, {"526b": "[laughter]"}, {"a7da": "COWEN: The Bay Area, sorry."}, {"e125": "[laughter]"}, {"dfd9": "COLLISON: That’s a subjective experience of living in DC."}, {"fc33": "COWEN: Of course."}, {"fff9": "COLLISON: What about the broader phenomenon of DC?"}, {"ca68": "COWEN: The work ethic there is pretty strong. The level of talent, it’s very much a monoculture. It’s the ultimate company town, but I think those are creative. I think it’s a creative city, typically, in destructive ways. I have highly mixed feelings about that. I don’t think the surrounding counties should be as wealthy as they are. On net, I’d rather see government be much smaller and civil liberties be more respected."}, {"8211": "So I have a love-hate relationship with Washington. I’d never want to live in the city. I’ve always lived in suburbs. Northern Virginia, I love much more than DC. And I go to Washington, it feels like a strange, bizarre place, but still acutely aware of its connection to the ancient world, which hardly anywhere else in America has, and that’s really important. It’s done something nowhere else in the world has, and it’s still the single most important place in what is an improving world."}, {"87dd": "COLLISON: Stability."}, {"57f9": "COWEN: Stability is underrated, but there’s also status quo bias, so this is tricky. I think the Western world takes stability for granted because we’ve had so much of it for so long. And our basic model, as in macroeconomics, you overweight your last 20 or 30 years."}, {"0aa6": "Since, let’s say — the election of Ronald Reagan, end of the Cold War, fall of the Berlin Wall — so many good things have happened. It’s mostly been stable, and the worst predictions haven’t come true. I think that’s exactly what makes this a dangerous point in time — that we’re not geared toward the kind of risk taking, imaginative thinking we need to stop this from being the next 1910."}, {"d013": "COLLISON: Can you say more on that?"}, {"f8ac": "COWEN: I see a creeping deterioration of the belief in individual liberty as an important idea, rule of law, cosmopolitanism, just general respect and decency, even in some very good, nice countries. And this is one of them. I see that as getting weaker. I think it’s maybe a smaller move than a lot of the worriers are saying. But still, even when the trend is in that direction at all, it could have a self-fulfilling momentum. And that’s much more dangerous than a lot of people realize."}, {"a203": "Brexit, I’m not sure will be a big deal, economically speaking, but it’s a strong negative from a cultural point of view. That Turkey has fallen apart the way it has, that some of the Middle East is still up in flames, that Russia and China are much less free than some number of years ago. Those, to me, are major, major negatives at a cultural level, not tangible, that we’re underrating its importance."}, {"d1c5": "COLLISON: Restrictive urban construction and land use regulations."}, {"a962": "COWEN: They’re terrible. We should allow much more building. Much more of this country should be like Houston and parts of Texas. But that said, I’ve become a slight contrarian on this lately. I wonder if the Bay Area isn’t the one place in the world where building restrictions might make some sense because most of you want the restrictions. Even if not you in the room, you out there in this area. So removing the restrictions would be a tax. It would be great for the people who moved in."}, {"3f85": "But if you’re all producing these amazing global public goods, and the federal government is going to raise taxes on you anyway, I promise this. I don’t care who wins the next five elections, your taxes are going up. State, city, local, whatever. And then we put this new tax on you and you all are the Atlases out there. I don’t know if loosening building here would tax your productivity or increase it. But I’d at least consider the notion. This is the one place in the world where we shouldn’t loosen building restrictions."}, {"f179": "COLLISON: Can you apply that argument in reverse? Do you think Silicon Valley would be better off if it had half the population?"}, {"24ee": "COWEN: I don’t live here. I don’t know how bad the traffic is, and I suspect the people who are the most productive have workarounds. They can afford to live where they want, for instance."}, {"b50c": "COLLISON: I think a lot of us spend a lot of time in traffic."}, {"679f": "COWEN: But it seems to me, it’s a pretty finely honed structure. It’s evolved the way it has and to cut it in half or shrink it, it’s probably a big mistake."}, {"b5fe": "COLLISON: Just to make sure I understand, you’re saying the tax would be the other people around us? Our personal experiences of the area would somehow be diminished?"}, {"4615": "COWEN: The general culture would change; it would be less intense. It would be like taking Florentine Renaissance and injecting into it 50,000 people from Naples. Nothing against Naples. I love Naples, in fact, more than Florence. But I suspect that would have been a mistake back then. So I worry, if you have too many people move into this uniquely weird, diverse monoculture, you could wreck it. Just a cautionary note, I’m agnostic, but I’ve started having this worry lately."}, {"d324": "COLLISON: Do you generally believe in the idea of increasing returns to scale of knowledge clusters?"}, {"abec": "COWEN: Yes, absolutely. But again, you need funny kinds of insulation, too. It’s having both that makes a place special. So you don’t want a completely open system. You want a rhetoric that, “Oh, it’s all so open and incredibly fantastic . . .”"}, {"bad0": "[laughter]"}, {"8221": "COWEN: But that it absolutely isn’t at the same time."}, {"2283": "[laughter]"}, {"fc73": "COWEN: And I feel that every time I come here. It’s great."}, {"e13f": "COLLISON: Contrarianism."}, {"a1d4": "[laughter]"}, {"6a44": "COWEN: Overrated."}, {"aa20": "COLLISON: [laughs]"}, {"8477": "COWEN: That’s the Straussian answer."}, {"bb7d": "[laughter]"}, {"a797": "COLLISON: Are we still in the Great Stagnation?"}, {"7b7f": "COWEN: Probably, but the last year, I’ve seen a lot of signs — partial signs — we’re getting out of it. The last year, wage growth was pretty strong, and I hadn’t been expecting that. I wouldn’t change my mind based on one year of data, but one year is a lot more than nothing."}, {"18ab": "What I see on the ground in terms of integrating, better manipulation of information with actual real world processes. And I’ve seen, again — not last year but I think four out of the last five years — healthcare costs have behaved in a somewhat sane manner. That’s been a big driver of living-standard and productivity problems. I’m not sure that we’ll stay on the right track, but I’ve seen four or five pretty encouraging signs. So I now hold the view, there’s a 30 percent chance we’re on the verge, right now, of climbing out of the Great Stagnation."}, {"ef64": "COLLISON: Can you say more on the second point you mentioned there? The particular kinds of technological change that you’re seeing?"}, {"a56e": "COWEN: If all tech is, is spinning information more rapidly, it’s wonderful for the infovores: academics, journalists, tech people. But a lot of people are actually just as happy watching network TV with three channels and Mary Tyler Moore. Maybe they like Facebook a bit more, but the real advantage is when you can ease how molecules impact your body."}, {"418d": "If driverless cars really scale, as I think they will, many commutes will be much better. That’s a lot less frustration for people. Right there, I would say, “Great Stagnation is over.” It’s not a slam dunk. I think there are more obstacles to them than you read about it in the popular press, but I think it’s highly likely we get it within the next 20 years in some manner."}, {"81cd": "COLLISON: Uber and self-driving cars and Airbnb and a bunch of these technology companies that are doing things in the real world, or some of these new biotech companies and so forth, they were all around two or three years ago, so why weren’t you more optimistic back then?"}, {"6d68": "COWEN: AI, in the broad sense of that term, seems to have developed more quickly than people thought. And even in 2011, I wrote a book saying, “AI will develop more quickly than we think.” My book, Average Is Over. And since then, it’s developed more quickly than I thought."}, {"cfe8": "[laughter]"}, {"6e37": "COWEN: And how many different problems you can apply that to? We still don’t know. But each time, we seem to be positively surprised, and we’re still on that positive surprise curve."}, {"da2a": "COLLISON: What are you watching to tell whether or not we have in fact exited the Great Stagnation?"}, {"50ca": "COWEN: I think the best way would be not to view any media at all. And write down on a given day, “What molecules impacted my body?” People, they’re upset about Trump. Obviously, there are risks, things that are bad, but it’s also a healthy exercise. Write down each day, “The Trump molecules, did they impact my body today?” And in some ways, they will. But it’s a very different perspective. So if you stop reading about tech and AI and whatever, and just write down a bit on this. Keep a molecules diary. That’s when you’ll know — when your molecules diary gets really exciting."}, {"e55d": "COLLISON: [laughs] I’ll, for the moment, leave it at that. Do you want to take maybe three or four questions from the audience here? We have a microphone over here."}, {"91d3": "Q&A"}, {"313c": "AUDIENCE MEMBER: Hi, Tyler. My question was, a lot of us look at issues or read about issues and then think, “Oh, what would Tyler Cowen think about this?” and go to your blog and try to pass off your views as our own."}, {"cd73": "[laughter]"}, {"d944": "COWEN: That’s not scalable. [laughs]"}, {"9638": "AUDIENCE MEMBER: I was wondering, who is that person for you, a sort of economist’s economist, if you will?"}, {"9ca5": "COWEN: I think the important thing about the contemporary world is how you manipulate your networks in your clusters. I don’t think any one person is very good on Twitter, no matter how smart or clever they may be. And I don’t think any one blogger is very good at all. So there’s a kind of embedded algorithm in blogs, Twitter, other social media."}, {"514b": "If you’re really good at reading the system, that’s when you learn things. That’s extremely powerful. And every day, I try to train, retrain myself in reading the system. And I feel that’s a skill I’ve become pretty good at. But I’m always working on it every single day. That’s the one thing, I’m always, “How can I improve this?” obsessively. I guess that would be my advice, to downgrade the individuals and try to understand properties of these systems better."}, {"b038": "AUDIENCE MEMBER: Hi. I grew up in the Rust Belt, and I’ve watched a lot of large companies, tech companies, come in and try to build hubs — technology hubs — in those areas. And invariably, they move in and then five years later, they close down. If they can’t be tech clusters, what can they be? Or maybe they can be tech clusters and they’re just doing it wrong. What should they do?"}, {"c15c": "COWEN: I think the final number of tech clusters will be quite small: the Bay Area and several parts of China, Israel being a much smaller but still potent one. I think it will shock people how few tech clusters develop. Because it’s a fragile ecosystem. It’s about project evaluation, its closeness to the number of major financial centers, and there are relatively few of those."}, {"052e": "Now you’re asking, “What will those areas become?” Well, empty, I hope. But I understand the transitional problems, and I think one thing you’ll see from the Trump administration is a big redistribution of income back to those regions. And it will actually solve some problems."}, {"0ace": "In the longer run, I’m not sure how that will work out. When you want to neglect a region and have it empty, and when you want to try to keep it going, that’s a tough call. But I think we’re going to see big changes, like with Medicaid. There’ll be block grants, perhaps, given out on a formula that rewards Rust Belt states."}, {"3fdc": "AUDIENCE MEMBER: I wanted to connect two points that came up tonight. First, you are the original, or the pinnacle, of an infovore. I estimate that you process about a kilo of books a year, and at the same time, you also have a great social circle. So, how would you say friendship adds something besides the information feed of talking to people like Robin Hanson? What’s the friendship better than, say, reading literature about Robin Hanson?"}, {"66ab": "COWEN: It’s very important to keep yourself engaged and motivated. And for me, a good rule of friends is to really try to be myself and be willing to be weird, if it’s even weird, and let people self-select around that, to some extent. And that’s worked well for me, more than trying to make friends."}, {"0d8a": "Friends tell you when you’re completely off the mark. It’s companionship, common sense of purpose. It’s really, really important to be working with people at least you have friendly ties with. Even if they don’t feel like you’re friends with a capital F, in the sense that a Russian would use that word."}, {"f35f": "AUDIENCE MEMBER: Hey. I was talking with a friend of mine about possible next start-ups that we could start, and we’re thinking about starting a religion. Something maybe vaguely Taoist, compatible with modern science, but hopefully something that gives people a sense of purpose, religious community, hopefully increases happiness. I loved hearing your thoughts earlier. Do you have any tips or any ideas?"}, {"175b": "[laughter]"}, {"28bf": "COLLISON: Make it monotheistic, apparently."}, {"b6c2": "COWEN: I think you need to stop smiling if you’re going to start a religion."}, {"6fa4": "[laughter]"}, {"306b": "COWEN: There’s a severity to it, some of which might be feigned. It’s quite difficult to pull off in the contemporary world. So I think my advice — I don’t give that much advice — but maybe my advice is not to do it."}, {"8ea1": "[laughter]"}, {"7bf6": "COWEN: The entry barriers are high. And the religions we have are quite rich and well developed. And what you would have to be to succeed, I suspect, is someone who wouldn’t be at this talk."}, {"33a1": "[laughter]"}, {"4e06": "AUDIENCE MEMBER: What’s the next great political party that doesn’t exist yet?"}, {"926b": "COWEN: In the United States?"}, {"0e9d": "AUDIENCE MEMBER: Yes."}, {"1912": "COWEN: I think America will have its current two-party system for a very long time to come. The barriers to a third party are very high. The Trump experience shows how flexible parties are, whether one likes that or not. I think the Democrats will do their own version of this, in exactly what direction, I’m not sure. But my prediction is no major new or third party here for the foreseeable future. How long was our last new party? My goodness, you’re going back into the 19th century."}, {"6a7d": "COLLISON: One more question."}, {"5846": "AUDIENCE MEMBER: My question’s two-folded, so it stays as one question. [laughs]"}, {"60a0": "COLLISON: One more person."}, {"7a5a": "COWEN: [laughs]"}, {"425b": "AUDIENCE MEMBER: At the beginning, you were talking about basic income and how it won’t be feasible. Do you think that if we ever did get into a world where this was a thing, then perhaps it would increase culture and creativity because people now have all this free time to use? Or do you think it would just end up going to waste? That’s the first half, so it stays as one."}, {"0d7d": "COWEN: Sure."}, {"48e2": "AUDIENCE MEMBER: And the second part is, you were also talking about AI in the broader sense, and how it’s developing rapidly, and how it’s a bigger thing than we thought it would be. Do you think we have a future where our creativity and culture stems from AI and things they imagine and build?"}, {"f9e5": "COWEN: In reverse order. First, in chess, so much of the creativity already stems from AI, computers playing chess. I’ve listened to computer-composed music, art. I don’t think it’s impressive yet, but I don’t rule it out by any means. So I think, at some point, those molecules will impinge on me."}, {"6e73": "Guaranteed annual income — I could imagine that working pretty well in countries like Australia and Denmark, smaller markets where life is already less harsh in some ways, and there’s more collaboration, and the work ethic is understood differently to begin with, and they have more cohesion than the United States."}, {"7beb": "But I am an American exceptionalist. We have this unique vision, a kind of extreme Puritanism, adopting personal projects that are work based and obsessively seeing them through in a determined way that I think is so special that, say, I never felt when I lived in New Zealand, a wonderful country. They can do UBI. But I don’t want it here. I’d rather keep that culture. I think it will do the world more good. And I think it also means we never will adopt UBI, or not any time soon."}, {"9e4c": "On Silicon Valley’s mood affiliation"}, {"78b1": "COLLISON: You write a lot about mood affiliation and the problems within it. And you write about this despite the fact that, I think, you believe that cognitive biases are themselves overrated. Can you, just for the folks here, quickly describe your current take on mood affiliation and what it is? And then, what is something that people here don’t believe and really don’t want to hear because of our own sort of collective Bay Area/Silicon Valley mood affiliation?"}, {"6d69": "COWEN: Mood affiliation was a concept I first coined to refer to people who judge arguments by the mood of the argument. There are some writers — maybe they’ll remain nameless — but they’re optimistic. If an argument is optimistic, they think the argument is more likely to be correct: “Well, things have been getting better.” I’m not saying that carries no weight, but be a very strict Bayesian, not just because the mood feels comfortable."}, {"d39c": "A lot of very contemporary partisan debate is really about moods. If you feel someone is not condemning something with the right mood, you’ll reject the attached substantive claim. So a lot of the exercise I do on the blog is trying to teach myself how to detach and how to unbundle things, and inter-temporally substitute moods and contain bundles of optimistic, pessimistic, condemning, approving, tolerant, intolerant — whatever moods — at multiple levels at the same time, in some way."}, {"a09f": "The Bay Area strikes me as having a lot of pearl clutching and a reputation for thinking it’s more tolerant than it is, and I think that’s true of both coasts. I think, in general, all cultures are oblivious. And America, in particular its coasts, tend to think, “We’re the cosmopolitan side of American culture.” And I really don’t believe that. I think you’re a uniquely brilliant, twisted, inward-looking, diverse monoculture, and I’m very glad you are."}, {"8056": "COLLISON: [laughs] Wait, wait, wait. You’ve already accused us of that. I want something that you, yourself believe or are quite confident is true but that, again, we don’t want to hear."}, {"7f2d": "COWEN: Well, that’s really the main lecture I want to give. Religion is underrated. I think, in general, people in California overrate the efficacy of government. I think libertarians underrate it. But if we’re in California, I guess I can’t not make that point. And you have unique advantages here. You have the cluster. So there’s a lot of things you can do and get away with that don’t work in a more general way, like raising the minimum wage to some level. That cluster gives you enormous rents."}, {"c298": "The world is not built out of clusters like that, so I would just say, be careful about overgeneralizing from your experience here. But so many things, we’re like, “I’m sure my view is right; California’s wrong.” I don’t think that’s the right way to go about it."}, {"bf56": "I would say, “Oh, I like Southern California better than I like it here.” Maybe that’s unacceptable. I think Los Angeles is the greatest city in the world. I’d love to live there; it has the best ethnic food. There’s something about it, the way it’s a cosmopolitan city, sense of openness. Someone once said, “What’s real there is so phony and what’s phony is so real.” It’s always surprising me, and I love their diverse monoculture. My favorite part of this country."}, {"9973": "COLLISON: [laughs] Tyler Cowen, thank you very much."}, {"6983": "COWEN: Thank you, Patrick."}], "child": "1349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_251349_1\t1349_2\t1349_3\t1349_4\t1349_5\t1349_6\t1349_7\t1349_8\t1349_9\t1349_10\t1349_11\t1349_12\t1349_13\t1349_14\t1349_15\t1349_16\t1349_17\t1349_18\t1349_19\t1349_20\t1349_21\t1349_22\t1349_23\t1349_24\t1349_25"}