{"name": "135", "parent": "", "content": "How Not to Beat Real Madrid, Bayern Munich Edition Against Cristiano Ronaldo and Co., combining a missed penalty and a red card is a recipe for disaster In the first half of Wednesday’s Champions League quarterfinal against Real Madrid, Bayern Munich looked invincible. Cristiano Ronaldo, Karim Benzema, and Gareth Bale were stranded in Bayern’s collective pocket; Arjen Robben tormented Marcelo down the right wing; and Arturo Vidal bagged a powerful header in the 25th minute to give the hosts a 1–0 lead in the first leg. It seemed like Bayern would cruise to a win. But there’s no margin for error against the defending European champs — and after Vidal’s goal, FC Hollywood couldn’t get out of their own way. Late in the first half, when Bayern won a questionable penalty — read: It wasn’t a penalty — Vidal stepped up to take it and presumably put the game away. The Chilean hit the ball about as hard as he could, and it ended up in in the 25th row. About 45 minutes later, Real Madrid were taking a 2–1 victory back to Spain. Going into halftime, Bayern led with 10 shots to Madrid’s seven — and this is a Madrid team that shoots more than almost any other side in Europe. The Germans also had 56 percent of the possession in the first half, but when the final whistle blew, Madrid had won the shots battle 23–13 and ended up with more than half of the possession share. Madrid scoring at least one goal is about as close to a guarantee as there is in sports. Coming into the match, they had scored in 52 consecutive games, and it took only 90 seconds in the second half for Ronaldo to score the first goal of his brace. Shortly after, Javi Martínez picked up two yellow cards in three minutes and left Bayern with 10 men for the final 30 minutes of the match. Hot take: Ronaldo is good and you can’t lose a man for a half hour and expect him not to score. Despite Manuel Neuer making the most saves he’s ever made in a Champions League game, the inevitable came. Between the 73rd and 77th minutes, Madrid had six shots with Ronaldo’s second coming in the 77th minute. With that goal, Ronaldo became the first player in history to score 100 goals in UEFA club competition. But more importantly, Zinedine Zidane’s team heads back to the Santiago Bernabeu with a one-goal lead and two away goals. With the win, Madrid became the first team to beat Bayern Munich at home in the Champions League since … Real Madrid beat them at home in the Champions League in 2014. And now, instead of going to Spain with a two-goal advantage, Bayern has to score more than once and beat Madrid in a place they’ve lost only once in the past year. ", "title": "How Not to Beat Real Madrid, Bayern Munich Edition", "sentences": [{"d26d": "How Not to Beat Real Madrid, Bayern Munich Edition"}, {"7ad7": "Against Cristiano Ronaldo and Co., combining a missed penalty and a red card is a recipe for disaster"}, {"7f3b": "In the first half of Wednesday’s Champions League quarterfinal against Real Madrid, Bayern Munich looked invincible. Cristiano Ronaldo, Karim Benzema, and Gareth Bale were stranded in Bayern’s collective pocket; Arjen Robben tormented Marcelo down the right wing; and Arturo Vidal bagged a powerful header in the 25th minute to give the hosts a 1–0 lead in the first leg."}, {"f43a": "It seemed like Bayern would cruise to a win. But there’s no margin for error against the defending European champs — and after Vidal’s goal, FC Hollywood couldn’t get out of their own way."}, {"4b11": "Late in the first half, when Bayern won a questionable penalty — read: It wasn’t a penalty — Vidal stepped up to take it and presumably put the game away. The Chilean hit the ball about as hard as he could, and it ended up in in the 25th row. About 45 minutes later, Real Madrid were taking a 2–1 victory back to Spain."}, {"31e8": "Going into halftime, Bayern led with 10 shots to Madrid’s seven — and this is a Madrid team that shoots more than almost any other side in Europe. The Germans also had 56 percent of the possession in the first half, but when the final whistle blew, Madrid had won the shots battle 23–13 and ended up with more than half of the possession share."}, {"c224": "Madrid scoring at least one goal is about as close to a guarantee as there is in sports. Coming into the match, they had scored in 52 consecutive games, and it took only 90 seconds in the second half for Ronaldo to score the first goal of his brace."}, {"619a": "Shortly after, Javi Martínez picked up two yellow cards in three minutes and left Bayern with 10 men for the final 30 minutes of the match."}, {"d0f3": "Hot take: Ronaldo is good and you can’t lose a man for a half hour and expect him not to score. Despite Manuel Neuer making the most saves he’s ever made in a Champions League game, the inevitable came. Between the 73rd and 77th minutes, Madrid had six shots with Ronaldo’s second coming in the 77th minute."}, {"96fd": "With that goal, Ronaldo became the first player in history to score 100 goals in UEFA club competition. But more importantly, Zinedine Zidane’s team heads back to the Santiago Bernabeu with a one-goal lead and two away goals."}, {"2255": "With the win, Madrid became the first team to beat Bayern Munich at home in the Champions League since … Real Madrid beat them at home in the Champions League in 2014. And now, instead of going to Spain with a two-goal advantage, Bayern has to score more than once and beat Madrid in a place they’ve lost only once in the past year."}], "child": "135_1\t135_2\t135_3\t135_4"}