{"name": "1350", "parent": "", "content": "The True Story of How we Built a Micro VC Fund The lessons learned building Innovation Nest Fund I 5 years ago Marek Kapturkiewicz and I founded the micro VC fund Innovation Nest and we started to invest in startups. Today it is a very special moment as Fund I has just finished its investing and Innovation Nest Fund II starts to invest. Last 5 years were filled with thousands of meetings, emails, rational arguments, number crunching, intuitional guesses, it was 5 years of hopes and disillusions, hard work and, after all, great fun. In total, we invested in 25 companies, 4 of them are stars and 9 of them are promising companies that with reasonable probability will become stars soon. The fair value of the existing portfolio shows net IRR of 16.4% and in the next years we hope that some of stars will become supernovas. I would like to share our story of building Innovation Nest. Why we founded Innovation Nest At the beginning there was an observation and a dream and from them the investment thesis of Fund I emerged. We started in Poland and the observation was that the problem with the Polish market was the local angle among entrepreneurs and investors. From nineties there was a vivid tech scene, companies like Onet and WP were founded, one of them, Allegro, became a unicorn — but all these activities were local. The dream was that the next generation of entrepreneurs will build global companies. The observation and the dream combined implied the investment thesis: Innovation Nest invests in local entrepreneurs building companies beyond the local niche. Silicon Valley Cinderella OK, so we started on a local, provincial market and wanted to invest in startups that will conquer the world. The stretch was tremendous: the dream as far reaching as Silicon Valley on one hand and provincial Poland on the other. Pretty romantic, isn’t it? Well, as ex-entrepreneurs we embraced problems as opportunities fortunately with a bit of blissful ignorance. We saw the challenge and we came with a solution — let us learn from Silicon Valley how to become good investors. We did as we said. Coming to Bay Area with startups was mind blowing for the companies and for us. Though the experience was always a roller-coaster, it was fairly consistent: One of the companies we invested in and assisted in the jump to Silicon Valley was UXPin. After a bumpy road, the whole team with Marcin Treder, their amazing leader, made it. UXPin became a company that made a successful jump over the big water with such investors as Gil Penchina, Freestyle.vc and Andreessen Horowitz at seed stage and True Ventures leading Round A. As investors we have made it with UXPin as well — the UXPin’s success was our success story and a great learning curve. Dark Ages Though UXPin became the first star in our portfolio, dark ages came three years after the first investment of Innovation Nest. Marek Kapturkiewicz and I love the first stage of startup growth when there is a dream and an entrepreneur in a factual or metaphorical garage. From the very beginning of Innovation Nest we run workshops for entrepreneurs, Steve Blank became our idol and we had two batches of an acceleration program. But the truth was brutal — on average the growth of companies was two times slower than we assumed it would be. The end of year 3 and the beginning of year 4 is the most difficult time for pre-seed and seed funds. In front of your eyes large part of companies you invested in collapse, the signs of strength in the remaining part are still weak and the next fundraising is approaching at much faster speed than you would like. Thankfully, at that time we had already a third partner, Marcin, who forced us to rethink the assumptions about the investment stage. A couple of investments in companies at revenue stage combined with a steady growth of portfolio make us go through the dark ages to much brighter future. But we experienced on ourselves that VC is a long-term game: It takes ages for startups to grow from a pre-revenue stage to become the market leader. Kraków and startup community We are based in Kraków, Poland. Today starting investing with Fund II all over Europe, I can honestly say, though I admit that some may think that I am biased, that Kraków is one of the startup centers that is seriously underestimated. Kraków, though small, has several startups founded in last 5 years that are in Round A or Round B growth stage. These companies are: Brainly, Base CRM (technically a US company but most of employees and most of founders are based in Kraków), Estimote, Kontakt.io, Silvair, Elmodis, Salesmanago, Gamedesire, Codewise. Five years ago when we started the fund and all these companies were at early stage. We were lucky to grow as an investor in such an amazing community. It is time to grow up In the year 4 we rethought the way how we worked and we decided to implement several lessons that we learned in Silicon Valley. The main learnings will seem pretty obvious or even naive in Bay Area but for us it was a hard process to adopt them as Innovation Nest values. They are as follows: Get big Get big is our our mantra. First, VC model does not work for small exits (I mean under $100m) and second, small growth is small fun. Therefore we started to look for companies that: (1) sell in a niche on a big enough market (2) have a product today that has a fairly solid competitive advantage (3) have leaders that are likely to survive the change of magnitude in company operations. There are various investors’ profile and our choice was to stick to this classic Silicon Valley venture capital model. Pro-active entrepreneurs and re-active investors At the early stage, if investors have to impose their decisions on entrepreneurs, it means that they pick the wrong team and also if entrepreneurs do not exploit investors’ experience and network, it means that they are not the right team. We assume that the role of the investor on an early stage is to support not to demand. Network of know-how and well oiled cogs A venture capital firm is a knowledge organization. Amount and quality of knowledge that is gathered by partners, the VC team and the network and the ability to use and leverage that knowledge for the benefit if the portfolio companies constitute the main factor of success. Each time when I observe how it works in Silicon Valley — the quality of network, depth of knowledge and speed of meaningful interactions — I am equally impressed. The Innovation Nest’ goal is to build such a culture. 2% / 98% rule A startup has to be good in just two areas: (1) innovation and (2) execution. The point is that the first, though vitally important, is very narrow in scope (metaphorically it is 2% of activity). The second, that consists primarily of best existing practices, is a dominant element of startup activity (metaphorical 98%). 2% innovation and 98% of best practices — a very sharp innovation combined with an excellent execution. Clusters and the thesis We always wanted to know and understand the markets where companies operate — for two reasons: to be good investors and to be able to help. Therefore as former entrepreneurs we were diving into a market where each of the companies in our portfolio operated. Doing that we observed a snowball effect: each time we started to work with a company that was similar to one or more companies from our portfolio, our contribution as an investor became more valuable. The clusters of companies and clusters of our knowledge were emerging gradually. The first cluster comprised of B2B software companies that provided a solution for a specific process. It started with UXPin followed by Infermedica, GetRiver, Landingi, Picodi, Survicate, Growbots (Fund II investment) and Perdoo (Fund II investment). The second cluster contained companies that are software solutions for a specific industries: Perfect Gym, Wayman, Flowbox. The next one was a surprise for us — Industrial and Commercial IOT. After investing in Fogger.io, more companies: Elmodis, iGrid, Estimote (Fund II investment) and Silvair (Fund II investment) joined our portfolio. The last cluster is under construction and it crosses the clusters already mentioned— developers facing products: NewByteOrder, Infermedica, Fogger and Estimote (Fund II investment). To make a long story short: We are strong believers in thesis-driven investors who build knowledge around specific themes. What we started in Fund I gets even stronger in Innovation Nest Fund II. Team Managing the Innovation Nest team is like riding a rodeo on the top of Kościelec in Tatra mountains (have a look on a picture above to see how Kościelec looks like) and I am proud that we did it: the group of great people with huge personalities, work as a team. Let me mention a couple of them: It is my privilege to work with all of them. Thanks On behalf of Innovation Nest team I would like to thank two co-investors: Gil Penchina and Dave Samuel (Freestyle.vc). They are top-tier early stage investors, we were lucky to learn from them. I would like to thank Fadi Bishara and Blackbox.vc for help, support and hospitality. We would like to thank Peter Berger who initially helped us a lot in Silicon Valley and Ela Madej who joined us in 2015 and was instrumental to the strategy change. I would like to thank dozens of mentors who helped us and our portfolio companies. The list is too long to publish it here. Thanks. Enjoying the view from half way up. From rags to riches Though the portfolio companies have a long and winding road ahead, the quality and value of the portfolio today show that we did a good job over the last 5 years. Personally I am proud of it. ", "title": "The True Story of How we Built a Micro VC Fund", "sentences": [{"4da3": "The True Story of How we Built a Micro VC Fund"}, {"3efe": "The lessons learned building Innovation Nest Fund I"}, {"0e51": "5 years ago Marek Kapturkiewicz and I founded the micro VC fund Innovation Nest and we started to invest in startups."}, {"2e0b": "Today it is a very special moment as Fund I has just finished its investing and Innovation Nest Fund II starts to invest."}, {"f0f4": "Last 5 years were filled with thousands of meetings, emails, rational arguments, number crunching, intuitional guesses, it was 5 years of hopes and disillusions, hard work and, after all, great fun."}, {"3c66": "In total, we invested in 25 companies, 4 of them are stars and 9 of them are promising companies that with reasonable probability will become stars soon. The fair value of the existing portfolio shows net IRR of 16.4% and in the next years we hope that some of stars will become supernovas."}, {"c931": "I would like to share our story of building Innovation Nest."}, {"53e9": "Why we founded Innovation Nest"}, {"ab04": "At the beginning there was an observation and a dream and from them the investment thesis of Fund I emerged. We started in Poland and the observation was that the problem with the Polish market was the local angle among entrepreneurs and investors."}, {"d40f": "From nineties there was a vivid tech scene, companies like Onet and WP were founded, one of them, Allegro, became a unicorn — but all these activities were local."}, {"4916": "The dream was that the next generation of entrepreneurs will build global companies. The observation and the dream combined implied the investment thesis:"}, {"828a": "Innovation Nest invests in local entrepreneurs building companies beyond the local niche."}, {"ee4c": "Silicon Valley Cinderella"}, {"bf52": "OK, so we started on a local, provincial market and wanted to invest in startups that will conquer the world. The stretch was tremendous: the dream as far reaching as Silicon Valley on one hand and provincial Poland on the other. Pretty romantic, isn’t it?"}, {"eea5": "Well, as ex-entrepreneurs we embraced problems as opportunities fortunately with a bit of blissful ignorance. We saw the challenge and we came with a solution — let us learn from Silicon Valley how to become good investors. We did as we said."}, {"9122": "Coming to Bay Area with startups was mind blowing for the companies and for us. Though the experience was always a roller-coaster, it was fairly consistent:"}, {"b2f0": "One of the companies we invested in and assisted in the jump to Silicon Valley was UXPin. After a bumpy road, the whole team with Marcin Treder, their amazing leader, made it."}, {"a12a": "UXPin became a company that made a successful jump over the big water with such investors as Gil Penchina, Freestyle.vc and Andreessen Horowitz at seed stage and True Ventures leading Round A."}, {"33b7": "As investors we have made it with UXPin as well — the UXPin’s success was our success story and a great learning curve."}, {"f26f": "Dark Ages"}, {"4e84": "Though UXPin became the first star in our portfolio, dark ages came three years after the first investment of Innovation Nest. Marek Kapturkiewicz and I love the first stage of startup growth when there is a dream and an entrepreneur in a factual or metaphorical garage. From the very beginning of Innovation Nest we run workshops for entrepreneurs, Steve Blank became our idol and we had two batches of an acceleration program."}, {"3f10": "But the truth was brutal — on average the growth of companies was two times slower than we assumed it would be."}, {"917d": "The end of year 3 and the beginning of year 4 is the most difficult time for pre-seed and seed funds. In front of your eyes large part of companies you invested in collapse, the signs of strength in the remaining part are still weak and the next fundraising is approaching at much faster speed than you would like."}, {"c20d": "Thankfully, at that time we had already a third partner, Marcin, who forced us to rethink the assumptions about the investment stage. A couple of investments in companies at revenue stage combined with a steady growth of portfolio make us go through the dark ages to much brighter future."}, {"1c9d": "But we experienced on ourselves that VC is a long-term game:"}, {"131c": "It takes ages for startups to grow from a pre-revenue stage to become the market leader."}, {"7f53": "Kraków and startup community"}, {"291d": "We are based in Kraków, Poland. Today starting investing with Fund II all over Europe, I can honestly say, though I admit that some may think that I am biased, that Kraków is one of the startup centers that is seriously underestimated."}, {"153f": "Kraków, though small, has several startups founded in last 5 years that are in Round A or Round B growth stage."}, {"a911": "These companies are: Brainly, Base CRM (technically a US company but most of employees and most of founders are based in Kraków), Estimote, Kontakt.io, Silvair, Elmodis, Salesmanago, Gamedesire, Codewise."}, {"b6af": "Five years ago when we started the fund and all these companies were at early stage. We were lucky to grow as an investor in such an amazing community."}, {"e063": "It is time to grow up"}, {"54eb": "In the year 4 we rethought the way how we worked and we decided to implement several lessons that we learned in Silicon Valley. The main learnings will seem pretty obvious or even naive in Bay Area but for us it was a hard process to adopt them as Innovation Nest values. They are as follows:"}, {"55cd": "Get big"}, {"b228": "Get big is our our mantra. First, VC model does not work for small exits (I mean under $100m) and second, small growth is small fun. Therefore we started to look for companies that:"}, {"57b3": "(1) sell in a niche on a big enough market (2) have a product today that has a fairly solid competitive advantage (3) have leaders that are likely to survive the change of magnitude in company operations."}, {"f633": "There are various investors’ profile and our choice was to stick to this classic Silicon Valley venture capital model."}, {"7417": "Pro-active entrepreneurs and re-active investors"}, {"c024": "At the early stage, if investors have to impose their decisions on entrepreneurs, it means that they pick the wrong team and also if entrepreneurs do not exploit investors’ experience and network, it means that they are not the right team. We assume that the role of the investor on an early stage is to support not to demand."}, {"d881": "Network of know-how and well oiled cogs"}, {"f98a": "A venture capital firm is a knowledge organization. Amount and quality of knowledge that is gathered by partners, the VC team and the network and the ability to use and leverage that knowledge for the benefit if the portfolio companies constitute the main factor of success."}, {"b1a1": "Each time when I observe how it works in Silicon Valley — the quality of network, depth of knowledge and speed of meaningful interactions — I am equally impressed. The Innovation Nest’ goal is to build such a culture."}, {"ebe6": "2% / 98% rule"}, {"8f5f": "A startup has to be good in just two areas: (1) innovation and (2) execution."}, {"ccc9": "The point is that the first, though vitally important, is very narrow in scope (metaphorically it is 2% of activity)."}, {"e884": "The second, that consists primarily of best existing practices, is a dominant element of startup activity (metaphorical 98%)."}, {"936d": "2% innovation and 98% of best practices — a very sharp innovation combined with an excellent execution."}, {"3041": "Clusters and the thesis"}, {"616a": "We always wanted to know and understand the markets where companies operate — for two reasons: to be good investors and to be able to help. Therefore as former entrepreneurs we were diving into a market where each of the companies in our portfolio operated."}, {"5c7e": "Doing that we observed a snowball effect: each time we started to work with a company that was similar to one or more companies from our portfolio, our contribution as an investor became more valuable."}, {"1004": "The clusters of companies and clusters of our knowledge were emerging gradually. The first cluster comprised of B2B software companies that provided a solution for a specific process. It started with UXPin followed by Infermedica, GetRiver, Landingi, Picodi, Survicate, Growbots (Fund II investment) and Perdoo (Fund II investment)."}, {"6452": "The second cluster contained companies that are software solutions for a specific industries: Perfect Gym, Wayman, Flowbox."}, {"9d0b": "The next one was a surprise for us — Industrial and Commercial IOT. After investing in Fogger.io, more companies: Elmodis, iGrid, Estimote (Fund II investment) and Silvair (Fund II investment) joined our portfolio."}, {"3b40": "The last cluster is under construction and it crosses the clusters already mentioned— developers facing products: NewByteOrder, Infermedica, Fogger and Estimote (Fund II investment)."}, {"773f": "To make a long story short:"}, {"0bf7": "We are strong believers in thesis-driven investors who build knowledge around specific themes. What we started in Fund I gets even stronger in Innovation Nest Fund II."}, {"c3a6": "Team"}, {"66b4": "Managing the Innovation Nest team is like riding a rodeo on the top of Kościelec in Tatra mountains (have a look on a picture above to see how Kościelec looks like) and I am proud that we did it: the group of great people with huge personalities, work as a team."}, {"1036": "Let me mention a couple of them:"}, {"3d73": "It is my privilege to work with all of them."}, {"0a66": "Thanks"}, {"3af2": "On behalf of Innovation Nest team I would like to thank two co-investors: Gil Penchina and Dave Samuel (Freestyle.vc). They are top-tier early stage investors, we were lucky to learn from them."}, {"ef1b": "I would like to thank Fadi Bishara and Blackbox.vc for help, support and hospitality. We would like to thank Peter Berger who initially helped us a lot in Silicon Valley and Ela Madej who joined us in 2015 and was instrumental to the strategy change."}, {"9888": "I would like to thank dozens of mentors who helped us and our portfolio companies. The list is too long to publish it here. Thanks."}, {"4308": "Enjoying the view from half way up."}, {"90b0": "From rags to riches"}, {"8883": "Though the portfolio companies have a long and winding road ahead, the quality and value of the portfolio today show that we did a good job over the last 5 years. Personally I am proud of it."}], "child": "1350_1"}