{"name": "1351", "parent": "", "content": "What the Women’s March Cost One Founder After an entrepreneur Instagrammed images in solidarity with recent protests, her investors responded with a shocking demand On January 21, millions of people around the world marched in the name of women’s rights. Tracy Heller wasn’t able to join them because she was visiting a friend who had a death in the family, but she was determined to show her support. So, with the help of a social media intern who attended, she posted a handful of photos from the gathering on her company’s Instagram page with signs featuring common slogans like “The Future Is Female” and “Love Trumps Hate.” Aside from being topical, the images were on-brand for her company. Heller founded Brooklyn Born — an online retailer that sells stylish crib sheets and textiles made of organic cotton — with the intent of building a brand that celebrates women. When she started the business in September 2016, she sourced a female-owned-and-operated factory in India to manufacture her products, worked with a handful of female consultants to develop the startup, and hired local female designers to create her prints. She also launched a blog named Real Moms Real Talk on her company’s site, where she interviews friends who discuss the difficulties of transitioning into motherhood. “I felt very strongly that we support [the march] on our social media, because we’re a woman-owned company whose whole purpose for being is about supporting women and talking about women,” says Heller, who is 31 and runs the company out of her Brooklyn apartment. After posting the images, Heller received a message from an investor. “We noticed on the Brooklyn Born Instagram account that a couple of political posts were made and wanted to express our unbiased opinion on the matter,” began the email, which Heller provided to The Ringer. Heller had met this man — whom she declined to name for this story for fear of legal retribution, and who did not respond to The Ringer’s multiple requests for comment — through a mutual friend. The investor and two other male partners had given money to a Manhattan bar owned by a man who was dating a friend of Heller; the investors were part of an angel investing group that also funds a variety of early-stage tech and retail companies. Heller and the investor were introduced at an anniversary party, where she pitched him the business. After continuing the conversation via email, the investor and his partners agreed to contribute a small sum of money to Brooklyn Born in October 2016, with the understanding that they’d be passive investors who wouldn’t take on adviser roles. The note after the Women’s March marked a reversal of that promise. “In today’s political climate where there is a large amount of animosity between parties and their supporters that seems to grow daily, it seems even more critical for businesses to stay neutral so that no customers are ‘turned off’ to their products,” the investor wrote. A back-and-forth followed, culminating in a tense phone call, Heller says. She agreed to be more thoughtful about what she posted to her company’s feed going forward, but her investor wouldn’t budge until she took down a previous post that featured Hillary Clinton and one showing the “Love Trumps Hate” sign, which he referred to as “political propaganda.” In a follow-up email, he said that if Heller refused to remove the images, he and his partners would demand their money back. “If we would have known this is the direction you were going to take Brooklyn Born then we would have not invested,” he wrote to Heller. “I took issue with having these three men, with their small investment checks, try to bully me and demand that I remove posts or else,” Heller says. “That’s just not kosher, that’s just not really acceptable.” Heller consulted an adviser on her board, who had listened in on one of the phone calls. The contract Heller had with the investors, which she provided to The Ringer, didn’t allow them to pull their money based on a few stray Instagram posts. But even so, she was faced with the decision of whether or not to keep these men as a part of a business she had started for the purpose of uplifting — rather than silencing — women. Both sides hired lawyers, says Heller. Though Heller’s experience is an especially jarring example of soliciting in the investment world, it did not happen in a vacuum. Startup founders shop for funding from a mélange of investors, who can come and go at different stages of a company’s gestation. Broadly, founders have the option of raising money from family and friends, rich people with money to spare (more formally known as angel investors), or a venture capital firm. There are upsides and downsides to all options. For one, friends and family don’t always have deep pockets. But when it comes to procuring money from strangers, angel investors are often more accessible to new entrepreneurs than VC firms, which typically know more about the area of business they’re funding. The former has tended to be somewhat riskier, particularly in the last five to 10 years, as buzz around the VC industry has drawn increased participation from less experienced financiers, says Josh Lerner, a professor of investment banking at Harvard Business School. Even if some angel investors may be experienced corporate executives, former entrepreneurs, or VCs who are investing on the side, others may be deeply unfamiliar with the investing world at large. “You have this very high-end, very sophisticated group of people, and then there’s the proverbial doctors and dentists, who are investing on the basis of who they run into at the country club,” Lerner says. “In many cases being much less sophisticated in how they accept the deal, how much value they can add to the company, and the like. So it’s very much a mixed bag in terms of angel money.” That element of inexperience can translate to strained investor relations, or less professional behavior, says Erin Shipley, a cofounder at the Helm Fund, a seed-stage VC investment group that focuses on female-founded companies. “I have heard of plenty of instances of bad behavior in a fundraising context that female founders have experienced, but I think it’s important to keep in mind that there are a lot of different investor profiles that fund private companies at this point,” she says. “There can be a difference in the way an institutional venture fund would treat a founder they invest in, [from the way] an individual who had put money into a company … might feel more emboldened [to treat a founder].” In some cases, the option to seek the support of a more institutional venture fund isn’t an option. Barriers in raising funds can be so hard to overcome that “quality money” — money from groups who will also act as advisers — just isn’t as available to companies led by CEOs who are women and/or nonwhite. “There’s this strong pattern that sociologists like to call homophily, which is that you tend to like people who are like yourself,” says Lerner. “That means for minority or women entrepreneurs the challenges of raising venture money is very daunting, and in many cases they end up turning to angel money instead.” Tracy Heller with the owner of the factory that makes Brooklyn Born products (Courtesy Tracy Heller) Heller’s experience is at the heart of a significant problem in the entrepreneurial community: Despite making up half the world’s population, it’s much harder for women to find investors in a male-dominated culture of venture capitalists. A 2016 TechCrunch survey found that just 7 percent of partners at top-100 venture firms are women. That gender gap is directly reflected in the startup world. About 38 percent of new businesses are started by women, but only between 2 and 6 percent of those founders receive VC funding, said Ethan Mollick, an assistant professor of management at the University of Pennsylvania’s Wharton School. Last year, Bloomberg surveyed 890 U.S. startups founded between 2009 and 2015 that had received at least $20 million in VC and other equity funding. Only 7 percent of the founders on their list were woman. And those female founders’ companies received an average of $77 million, compared with the $100 million given to male-led startups. These statistics are often illustrated by female entrepreneurs’ horrifying tales of pitching male potential investors — take, for example, the VC who was bold enough to suggest revamping a product meant to test period blood to instead evaluate testosterone levels. But the story of Brooklyn Born’s Instagram account is also about the complicated territory female founders are forced to navigate even after securing funds. “It’s not uncommon for male investors, no matter the stake they have, to put inappropriate pressure on female founders,” says Emily Best, the founder and CEO of Seed&Spark, a crowdfunding company for underrepresented filmmakers. To complicate this dynamic, the tech industry has been increasingly embroiled in political controversies (see: Uber), spurring a new movement of corporate activism. In the process of funding her own startup, Best says she encountered instances of bullying similar to Heller’s related to both her gender and the political stances she expressed on behalf of her company. From a structural standpoint, when startup founders accept money from an individual or firm, the terms of the deal rarely allow for the money to be pulled later on. The greater risk is simply being stuck with an investor who feels emboldened enough to manipulate or harass. To avoid being pressured by investors, Best suggests that female entrepreneurs carefully vet potential investors before accepting their money. In some cases, she’s turned away prestigious firms because a partner lacked listening skills or felt Best wanted too much control over her company. Though she calls her current male investors “her greatest champions,” she says she went through a lot to settle on the right people. “Our experience has been that we’re told we don’t know what we’re doing by some guys who haven’t bothered to find out what we’re doing and don’t know,” she says. “We’ve just learned to fucking take it. Sit there, listen, and just wait for them to go away. We don’t follow up on that investment deal, we just walk away.” One female startup founder, who asked to remain anonymous for fear of retribution, recently experienced a similarly controlling dynamic with several male investors from an angel group. After receiving their investment for her now one-and-a-half-year-old software company, she began fielding what she calls “condescending messages” from several men within the group. The founder says that they referred to her as a “cheerleader” rather than a CEO and often told her she was too young to run her business properly. These comments continued for a year, until finally the investors demanded higher equity in the company, without the offer for more investment. When the founder refused, she says they wrote her an email in which they threatened to “ruin her” if she did not comply. She attempted to ignore their comments, until, she says, another male investor who witnessed their behavior stepped in, called them out, and bought out their shares. “It’s not something I think about too much, because sometimes it feels hard to differentiate between sexism and people not liking you,” she says. “But ultimately it came to a head when another investor said that they were clearly treating me like a stupid woman.” The difficulties faced by female entrepreneurs are not lost on Heller. “The fact that I ended up with investors who then turned out to be sort of misogynist is unfortunate,” she says. “I wish there were more options for women out there to get money from people who understand what they’re doing and why they’re doing it. While my situation is pretty unheard of — having investors demand their money back — it does speak to this larger issue.” Heller decided that even though she had already spent some of the investors’ money, she was better off returning the remaining amount and severing ties with them. After three weeks of arguing, Heller says they finally settled: She gave them back 82 percent of their investment. Though she’s not currently fundraising, she’s considering a crowdfund to make up for the loss. “Those things are a little bit up in the air,” she says. “But I’m going to continue to run my business.” For now, Heller is happy to have walked away without having to worry whether something she publishes on social media will be considered too political. Fittingly, she celebrated the resolution with an Instagram post that no investor could censor: ", "title": "What the Women’s March Cost One Founder", "sentences": [{"2d4b": "What the Women’s March Cost One Founder"}, {"ca6f": "After an entrepreneur Instagrammed images in solidarity with recent protests, her investors responded with a shocking demand"}, {"7325": "On January 21, millions of people around the world marched in the name of women’s rights. Tracy Heller wasn’t able to join them because she was visiting a friend who had a death in the family, but she was determined to show her support. So, with the help of a social media intern who attended, she posted a handful of photos from the gathering on her company’s Instagram page with signs featuring common slogans like “The Future Is Female” and “Love Trumps Hate.”"}, {"8ac7": "Aside from being topical, the images were on-brand for her company. Heller founded Brooklyn Born — an online retailer that sells stylish crib sheets and textiles made of organic cotton — with the intent of building a brand that celebrates women. When she started the business in September 2016, she sourced a female-owned-and-operated factory in India to manufacture her products, worked with a handful of female consultants to develop the startup, and hired local female designers to create her prints. She also launched a blog named Real Moms Real Talk on her company’s site, where she interviews friends who discuss the difficulties of transitioning into motherhood."}, {"1aee": "“I felt very strongly that we support [the march] on our social media, because we’re a woman-owned company whose whole purpose for being is about supporting women and talking about women,” says Heller, who is 31 and runs the company out of her Brooklyn apartment."}, {"af6c": "After posting the images, Heller received a message from an investor. “We noticed on the Brooklyn Born Instagram account that a couple of political posts were made and wanted to express our unbiased opinion on the matter,” began the email, which Heller provided to The Ringer. Heller had met this man — whom she declined to name for this story for fear of legal retribution, and who did not respond to The Ringer’s multiple requests for comment — through a mutual friend. The investor and two other male partners had given money to a Manhattan bar owned by a man who was dating a friend of Heller; the investors were part of an angel investing group that also funds a variety of early-stage tech and retail companies. Heller and the investor were introduced at an anniversary party, where she pitched him the business. After continuing the conversation via email, the investor and his partners agreed to contribute a small sum of money to Brooklyn Born in October 2016, with the understanding that they’d be passive investors who wouldn’t take on adviser roles. The note after the Women’s March marked a reversal of that promise. “In today’s political climate where there is a large amount of animosity between parties and their supporters that seems to grow daily, it seems even more critical for businesses to stay neutral so that no customers are ‘turned off’ to their products,” the investor wrote."}, {"68c4": "A back-and-forth followed, culminating in a tense phone call, Heller says. She agreed to be more thoughtful about what she posted to her company’s feed going forward, but her investor wouldn’t budge until she took down a previous post that featured Hillary Clinton and one showing the “Love Trumps Hate” sign, which he referred to as “political propaganda.” In a follow-up email, he said that if Heller refused to remove the images, he and his partners would demand their money back. “If we would have known this is the direction you were going to take Brooklyn Born then we would have not invested,” he wrote to Heller."}, {"9111": "“I took issue with having these three men, with their small investment checks, try to bully me and demand that I remove posts or else,” Heller says. “That’s just not kosher, that’s just not really acceptable.”"}, {"d56e": "Heller consulted an adviser on her board, who had listened in on one of the phone calls. The contract Heller had with the investors, which she provided to The Ringer, didn’t allow them to pull their money based on a few stray Instagram posts. But even so, she was faced with the decision of whether or not to keep these men as a part of a business she had started for the purpose of uplifting — rather than silencing — women. Both sides hired lawyers, says Heller."}, {"b1cc": "Though Heller’s experience is an especially jarring example of soliciting in the investment world, it did not happen in a vacuum. Startup founders shop for funding from a mélange of investors, who can come and go at different stages of a company’s gestation. Broadly, founders have the option of raising money from family and friends, rich people with money to spare (more formally known as angel investors), or a venture capital firm. There are upsides and downsides to all options. For one, friends and family don’t always have deep pockets. But when it comes to procuring money from strangers, angel investors are often more accessible to new entrepreneurs than VC firms, which typically know more about the area of business they’re funding. The former has tended to be somewhat riskier, particularly in the last five to 10 years, as buzz around the VC industry has drawn increased participation from less experienced financiers, says Josh Lerner, a professor of investment banking at Harvard Business School. Even if some angel investors may be experienced corporate executives, former entrepreneurs, or VCs who are investing on the side, others may be deeply unfamiliar with the investing world at large."}, {"5006": "“You have this very high-end, very sophisticated group of people, and then there’s the proverbial doctors and dentists, who are investing on the basis of who they run into at the country club,” Lerner says. “In many cases being much less sophisticated in how they accept the deal, how much value they can add to the company, and the like. So it’s very much a mixed bag in terms of angel money.”"}, {"e51f": "That element of inexperience can translate to strained investor relations, or less professional behavior, says Erin Shipley, a cofounder at the Helm Fund, a seed-stage VC investment group that focuses on female-founded companies."}, {"0618": "“I have heard of plenty of instances of bad behavior in a fundraising context that female founders have experienced, but I think it’s important to keep in mind that there are a lot of different investor profiles that fund private companies at this point,” she says. “There can be a difference in the way an institutional venture fund would treat a founder they invest in, [from the way] an individual who had put money into a company … might feel more emboldened [to treat a founder].”"}, {"ca50": "In some cases, the option to seek the support of a more institutional venture fund isn’t an option. Barriers in raising funds can be so hard to overcome that “quality money” — money from groups who will also act as advisers — just isn’t as available to companies led by CEOs who are women and/or nonwhite."}, {"8bee": "“There’s this strong pattern that sociologists like to call homophily, which is that you tend to like people who are like yourself,” says Lerner. “That means for minority or women entrepreneurs the challenges of raising venture money is very daunting, and in many cases they end up turning to angel money instead.”"}, {"27ca": "Tracy Heller with the owner of the factory that makes Brooklyn Born products (Courtesy Tracy Heller)"}, {"6a77": "Heller’s experience is at the heart of a significant problem in the entrepreneurial community: Despite making up half the world’s population, it’s much harder for women to find investors in a male-dominated culture of venture capitalists. A 2016 TechCrunch survey found that just 7 percent of partners at top-100 venture firms are women. That gender gap is directly reflected in the startup world. About 38 percent of new businesses are started by women, but only between 2 and 6 percent of those founders receive VC funding, said Ethan Mollick, an assistant professor of management at the University of Pennsylvania’s Wharton School. Last year, Bloomberg surveyed 890 U.S. startups founded between 2009 and 2015 that had received at least $20 million in VC and other equity funding. Only 7 percent of the founders on their list were woman. And those female founders’ companies received an average of $77 million, compared with the $100 million given to male-led startups. These statistics are often illustrated by female entrepreneurs’ horrifying tales of pitching male potential investors — take, for example, the VC who was bold enough to suggest revamping a product meant to test period blood to instead evaluate testosterone levels."}, {"9907": "But the story of Brooklyn Born’s Instagram account is also about the complicated territory female founders are forced to navigate even after securing funds. “It’s not uncommon for male investors, no matter the stake they have, to put inappropriate pressure on female founders,” says Emily Best, the founder and CEO of Seed&Spark, a crowdfunding company for underrepresented filmmakers. To complicate this dynamic, the tech industry has been increasingly embroiled in political controversies (see: Uber), spurring a new movement of corporate activism."}, {"962a": "In the process of funding her own startup, Best says she encountered instances of bullying similar to Heller’s related to both her gender and the political stances she expressed on behalf of her company. From a structural standpoint, when startup founders accept money from an individual or firm, the terms of the deal rarely allow for the money to be pulled later on. The greater risk is simply being stuck with an investor who feels emboldened enough to manipulate or harass. To avoid being pressured by investors, Best suggests that female entrepreneurs carefully vet potential investors before accepting their money. In some cases, she’s turned away prestigious firms because a partner lacked listening skills or felt Best wanted too much control over her company. Though she calls her current male investors “her greatest champions,” she says she went through a lot to settle on the right people."}, {"52b2": "“Our experience has been that we’re told we don’t know what we’re doing by some guys who haven’t bothered to find out what we’re doing and don’t know,” she says. “We’ve just learned to fucking take it. Sit there, listen, and just wait for them to go away. We don’t follow up on that investment deal, we just walk away.”"}, {"2218": "One female startup founder, who asked to remain anonymous for fear of retribution, recently experienced a similarly controlling dynamic with several male investors from an angel group. After receiving their investment for her now one-and-a-half-year-old software company, she began fielding what she calls “condescending messages” from several men within the group. The founder says that they referred to her as a “cheerleader” rather than a CEO and often told her she was too young to run her business properly."}, {"5e0b": "These comments continued for a year, until finally the investors demanded higher equity in the company, without the offer for more investment. When the founder refused, she says they wrote her an email in which they threatened to “ruin her” if she did not comply. She attempted to ignore their comments, until, she says, another male investor who witnessed their behavior stepped in, called them out, and bought out their shares."}, {"869c": "“It’s not something I think about too much, because sometimes it feels hard to differentiate between sexism and people not liking you,” she says. “But ultimately it came to a head when another investor said that they were clearly treating me like a stupid woman.”"}, {"9513": "The difficulties faced by female entrepreneurs are not lost on Heller."}, {"d2f9": "“The fact that I ended up with investors who then turned out to be sort of misogynist is unfortunate,” she says. “I wish there were more options for women out there to get money from people who understand what they’re doing and why they’re doing it. While my situation is pretty unheard of — having investors demand their money back — it does speak to this larger issue.”"}, {"b444": "Heller decided that even though she had already spent some of the investors’ money, she was better off returning the remaining amount and severing ties with them. After three weeks of arguing, Heller says they finally settled: She gave them back 82 percent of their investment. Though she’s not currently fundraising, she’s considering a crowdfund to make up for the loss."}, {"9df6": "“Those things are a little bit up in the air,” she says. “But I’m going to continue to run my business.”"}, {"c444": "For now, Heller is happy to have walked away without having to worry whether something she publishes on social media will be considered too political. Fittingly, she celebrated the resolution with an Instagram post that no investor could censor:"}], "child": "1351_1\t1351_2\t1351_3\t1351_4\t1351_5\t1351_6\t1351_7\t1351_8\t1351_9\t1351_10\t1351_11\t1351_12\t1351_13\t1351_14\t1351_15\t1351_16\t1351_17\t1351_18\t1351_19"}