{"name": "1352", "parent": "", "content": "Is “Food-Tech” the Future of Food? by Dana Perls, senior food and technology campaigner Today in San Francisco at the Future Food-Tech conference, multinational food and agrichemical corporations, Silicon Valley investors, PR companies, big ag astroturf groups, and biotech startups are gathering to map out the future of our food system — and attract investment into this sector. Companies ranging from PepsiCo to Cargill are in attendance and Vladimir Putin’s former PR Firm Ketchum is a gold partner. Conspicuously absent from the roster of speakers are experts on regenerative farming, consumer groups, food justice groups and others with a big stake in the future of our food system. So, what does this “food-tech” future look like? According to the conference website, it’s about “innovation and investment from farm to fork,” but based on the program, it appears this “future” is more likely to be “from lab to fork.” You may have heard about the new meatless “Impossible Burger,” Cargill’s new stevia made from synthetic biology, or the GMO apple owned by Intrexon. All of these products make use of new, experimental genetic engineering techniques that are raising many questions for consumers, farmers and environmentalists. These new genetically engineered (GE) foods — which some call “GMOs 2.0” — are quickly entering our food system. The techniques involve new methods of genetically engineering organisms like algae to produce replacements for plant and animal-based food ingredients, or engineering DNA to turn genes on or off, or delete them altogether. You might also hear phrases like “fermentation,” synthetic biology or gene editing, but these new ingredients all involve genetic engineering — and they are almost never labeled as such. These new GE ingredients are slipping onto the market before regulations can catch up with any safety or environmental assessments or oversight. Whereas first generation genetically engineered ingredients found on our supermarket shelves are mostly from GE corn, soy and canola, engineered to withstand massive doses of toxic herbicides, a new synbio database shows that there are hundreds of new GE ingredients on or about to enter the market. Before we embrace this “food-tech” vision of the future, we need to ask some important questions about the new wave of genetically engineered foods. The Arctic Apple, which has been genetically engineered not to brown. Photo credit: Okanagan Specialty Fruits via The Washington Post What’s really in these products? On the surface, the Impossible Burger’s goal to reduce meat consumption sounds important. There are urgent problems with animal factory farming. But at a time when consumers are pushing for more sustainably produced real food, are these biotech products the right answer? While the Impossible Burger has received glowing press coverage for its “plant-based” product, the specifics about what’s actually in it has been less than clear. The Impossible Burger’s key ingredient, synbio heme, is a hemoprotein produced by genetically engineered yeast, and according to the Washington Post, is what gives the burger a meat flavor. But Impossible Foods doesn’t say what the “plant blood” — the key selling point for the Impossible Burger — actually is, nor does it provide any clear data on safety assessment or environmental impact. This is common among many new synbio startups. While we and many in the environmental and animal welfare community are fully in support of reducing unsustainable meat consumption, in an era where consumers are increasingly demanding transparency and “real” food and running full speed away from processed, industrial food, it would seem that non-GMO, organic, plant-based meat alternatives that carry less inherent risks are a wiser direction. Are these products safe? Any change to genes can have unintended impacts on an organism, species or ecosystem. That’s why safety studies are so important. While there are suggested assessments and regulations being proposed for the USDA, they are riddled with loopholes that would allow many gene-edited foods to slip through the regulatory cracks. The World Health Organization states that it is not possible to make blanket safety statements about GMOs — they must be decided on a case-by-case basis. Without such studies, we are operating largely in the dark in making major decisions about our food system. Companies introducing these new GMOs to the market are essentially self-regulated and are asking consumers to blindly trust them. But given their experience with the first generation of GMOS, will consumers feel them worthy of their trust? Given the history of problems and failed promises that have arisen with first-generation GMOs, we should be wary of unleashing a wave of new genetically engineered foods without due diligence in conducting rigorous, independent and transparent pre-market safety assessment. Where is the data about sustainability? Just as we heard decades of failed promises about first-generation GMOs, we are hearing similar claims about GMOs 2.0 without any supporting data. TerraVia, producer of Thrive cooking oil, made using GE algae raised in vats with feedstocks such as sugar cane or GMO corn, claims its product is sustainable. But where’s the data? What is the environmental footprint of the feedstock required to feed the GE algae? What is the overall lifecycle impact of this product? How are the GE ingredients contained? These are some questions that must be answered transparently before these products can reasonably claim the halo of sustainability. Organic, sustainable food. Photo via Flickr Creative Commons. Where are the labels? Investors and companies are excited to use new genetic engineering techniques, but are doing everything they can to pull the wool over consumers’ eyes. Some of their new products are even being mislabeled as non-GMO or natural, despite being derived from genetically engineered organisms and grown in a lab. These companies are letting transparency fall by the wayside while they focus on marketing their products. Will the Impossible Burger tell customers that the secret ingredient is a protein derived from genetic engineering? Polls consistently show that consumers want GMOs to be labeled as such on the packaging, but so far, companies selling products with new GMOs are staying silent, including Impossible Foods. Will consumers trust companies like PepsiCo that spent heavily to keep them in the dark on whether they are eating first generation GMOs? And will companies promoting the next generation of GMOs learn that they can’t hide the truth about what they are feeding people? Does anyone want these products? Are consumers asking for apples that don’t rot, or burgers with genetically engineered plant blood? Market data shows that consumers want to know where their food is coming from and how it’s produced. As Beth Kowitt wrote in Fortune magazine in 2015, “It’s pretty simple what people want now: simplicity… less of the ingredients they can’t actually picture in their head.” Do we really want to produce our food with patented, gene-edited fungi or algae, fed with chemical-intensive, environmentally destructive feedstocks such as GMO corn or sugarcane, and made in labs? Or do we want to move towards a food system based on transparency and truly regenerative, organic agriculture that is sustainable and healthy for farmers, farmworkers, our planet, and consumers? Environmental harm caused by industrial farming costs the world $3 trillion each year according to the United Nations Food and Agriculture Organization, from soil erosion and depletion of water resources to oceanic “dead zones” associated with synthetic fertilizer run-off and generation of major greenhouse gas emissions. Instead of investing in risky new food technologies that are potential problems masquerading as solutions, shouldn’t we be investing in proven, beneficial, regenerative agriculture and transparent, organic food that consumers are actually demanding? A series of expert consensus reports over the past decade affirm that ecological approaches to farming are fundamental to feeding all people, now and into the future. What do we want the future of our food system to look like, and shouldn’t we all have a say in that? ", "title": "Is “Food-Tech” the Future of Food?", "sentences": [{"4477": "Is “Food-Tech” the Future of Food?"}, {"0b71": "by Dana Perls, senior food and technology campaigner"}, {"3853": "Today in San Francisco at the Future Food-Tech conference, multinational food and agrichemical corporations, Silicon Valley investors, PR companies, big ag astroturf groups, and biotech startups are gathering to map out the future of our food system — and attract investment into this sector. Companies ranging from PepsiCo to Cargill are in attendance and Vladimir Putin’s former PR Firm Ketchum is a gold partner. Conspicuously absent from the roster of speakers are experts on regenerative farming, consumer groups, food justice groups and others with a big stake in the future of our food system."}, {"9678": "So, what does this “food-tech” future look like? According to the conference website, it’s about “innovation and investment from farm to fork,” but based on the program, it appears this “future” is more likely to be “from lab to fork.”"}, {"da51": "You may have heard about the new meatless “Impossible Burger,” Cargill’s new stevia made from synthetic biology, or the GMO apple owned by Intrexon."}, {"3a17": "All of these products make use of new, experimental genetic engineering techniques that are raising many questions for consumers, farmers and environmentalists."}, {"4ea0": "These new genetically engineered (GE) foods — which some call “GMOs 2.0” — are quickly entering our food system. The techniques involve new methods of genetically engineering organisms like algae to produce replacements for plant and animal-based food ingredients, or engineering DNA to turn genes on or off, or delete them altogether. You might also hear phrases like “fermentation,” synthetic biology or gene editing, but these new ingredients all involve genetic engineering — and they are almost never labeled as such."}, {"2774": "These new GE ingredients are slipping onto the market before regulations can catch up with any safety or environmental assessments or oversight. Whereas first generation genetically engineered ingredients found on our supermarket shelves are mostly from GE corn, soy and canola, engineered to withstand massive doses of toxic herbicides, a new synbio database shows that there are hundreds of new GE ingredients on or about to enter the market."}, {"ed8c": "Before we embrace this “food-tech” vision of the future, we need to ask some important questions about the new wave of genetically engineered foods."}, {"0e63": "The Arctic Apple, which has been genetically engineered not to brown. Photo credit: Okanagan Specialty Fruits via The Washington Post"}, {"fe8b": "What’s really in these products?"}, {"cf81": "On the surface, the Impossible Burger’s goal to reduce meat consumption sounds important. There are urgent problems with animal factory farming. But at a time when consumers are pushing for more sustainably produced real food, are these biotech products the right answer?"}, {"bf02": "While the Impossible Burger has received glowing press coverage for its “plant-based” product, the specifics about what’s actually in it has been less than clear. The Impossible Burger’s key ingredient, synbio heme, is a hemoprotein produced by genetically engineered yeast, and according to the Washington Post, is what gives the burger a meat flavor. But Impossible Foods doesn’t say what the “plant blood” — the key selling point for the Impossible Burger — actually is, nor does it provide any clear data on safety assessment or environmental impact. This is common among many new synbio startups."}, {"7b81": "While we and many in the environmental and animal welfare community are fully in support of reducing unsustainable meat consumption, in an era where consumers are increasingly demanding transparency and “real” food and running full speed away from processed, industrial food, it would seem that non-GMO, organic, plant-based meat alternatives that carry less inherent risks are a wiser direction."}, {"60f6": "Are these products safe?"}, {"bf45": "Any change to genes can have unintended impacts on an organism, species or ecosystem. That’s why safety studies are so important. While there are suggested assessments and regulations being proposed for the USDA, they are riddled with loopholes that would allow many gene-edited foods to slip through the regulatory cracks."}, {"2b79": "The World Health Organization states that it is not possible to make blanket safety statements about GMOs — they must be decided on a case-by-case basis. Without such studies, we are operating largely in the dark in making major decisions about our food system."}, {"a9d9": "Companies introducing these new GMOs to the market are essentially self-regulated and are asking consumers to blindly trust them."}, {"a4f4": "But given their experience with the first generation of GMOS, will consumers feel them worthy of their trust?"}, {"b435": "Given the history of problems and failed promises that have arisen with first-generation GMOs, we should be wary of unleashing a wave of new genetically engineered foods without due diligence in conducting rigorous, independent and transparent pre-market safety assessment."}, {"3b79": "Where is the data about sustainability?"}, {"72ec": "Just as we heard decades of failed promises about first-generation GMOs, we are hearing similar claims about GMOs 2.0 without any supporting data. TerraVia, producer of Thrive cooking oil, made using GE algae raised in vats with feedstocks such as sugar cane or GMO corn, claims its product is sustainable."}, {"65b4": "But where’s the data? What is the environmental footprint of the feedstock required to feed the GE algae? What is the overall lifecycle impact of this product? How are the GE ingredients contained? These are some questions that must be answered transparently before these products can reasonably claim the halo of sustainability."}, {"c816": "Organic, sustainable food. Photo via Flickr Creative Commons."}, {"d319": "Where are the labels?"}, {"86a9": "Investors and companies are excited to use new genetic engineering techniques, but are doing everything they can to pull the wool over consumers’ eyes. Some of their new products are even being mislabeled as non-GMO or natural, despite being derived from genetically engineered organisms and grown in a lab."}, {"696b": "These companies are letting transparency fall by the wayside while they focus on marketing their products. Will the Impossible Burger tell customers that the secret ingredient is a protein derived from genetic engineering? Polls consistently show that consumers want GMOs to be labeled as such on the packaging, but so far, companies selling products with new GMOs are staying silent, including Impossible Foods. Will consumers trust companies like PepsiCo that spent heavily to keep them in the dark on whether they are eating first generation GMOs? And will companies promoting the next generation of GMOs learn that they can’t hide the truth about what they are feeding people?"}, {"0c53": "Does anyone want these products?"}, {"1dc9": "Are consumers asking for apples that don’t rot, or burgers with genetically engineered plant blood? Market data shows that consumers want to know where their food is coming from and how it’s produced."}, {"306a": "As Beth Kowitt wrote in Fortune magazine in 2015, “It’s pretty simple what people want now: simplicity… less of the ingredients they can’t actually picture in their head.”"}, {"b61e": "Do we really want to produce our food with patented, gene-edited fungi or algae, fed with chemical-intensive, environmentally destructive feedstocks such as GMO corn or sugarcane, and made in labs? Or do we want to move towards a food system based on transparency and truly regenerative, organic agriculture that is sustainable and healthy for farmers, farmworkers, our planet, and consumers?"}, {"4756": "Environmental harm caused by industrial farming costs the world $3 trillion each year according to the United Nations Food and Agriculture Organization, from soil erosion and depletion of water resources to oceanic “dead zones” associated with synthetic fertilizer run-off and generation of major greenhouse gas emissions. Instead of investing in risky new food technologies that are potential problems masquerading as solutions, shouldn’t we be investing in proven, beneficial, regenerative agriculture and transparent, organic food that consumers are actually demanding? A series of expert consensus reports over the past decade affirm that ecological approaches to farming are fundamental to feeding all people, now and into the future."}, {"2153": "What do we want the future of our food system to look like, and shouldn’t we all have a say in that?"}], "child": "1352_1\t1352_2\t1352_3\t1352_4\t1352_5\t1352_6\t1352_7\t1352_8\t1352_9\t1352_10\t1352_11\t1352_12\t1352_13\t1352_14\t1352_15\t1352_16\t1352_17"}