{"name": "1358", "parent": "", "content": "Facebook’s News Literacy Advice Is Harmful to News Literacy Sometime yesterday, Facebook rolled out the largest media literacy campaign in the history of the world. Unfortunately, most of what it contained was bad advice. Here’s how Facebook wants you to tell truth from fiction on the web: Asleep yet? Scrolling and scanning? Bored out of your mind? There Is No Evidence Any of This Works Those who have followed my work here and elsewhere will recognize that this is the “checklist” approach to news literacy: look at an article and then see how closely the article displays the attributes of a fake story. Here’s the research that shows that approach works: Yeah. There’s actually no evidence that this approach works. And conversely, there’s quite a lot history that shows this model does not work. We actually already trained a generation of students with variants of this method. Sometimes we called it CRAAP. In K-12, it often went by the name of RADCAB. There are dozens of other variations, but they all look basically like this. And it failed. It failed for a number of reasons, but four of the biggest are these: There’s more bizarre stuff in the advice, which seems to have been developed before the more recent incarnations of fake news. The idea that multiple sources mean anything in a world of cut-and-paste clickbait is odd. Fake stories spread faster than real stories, and get copied more places. There’s the “Look at the URL” advice, which is the one good tip in the bunch, but sadly amusing since the entity hiding the URL in the first place is Facebook: If you really want people to look at the URL, maybe don’t make it the least noticeable item on the card? There’s the timeline thing, where I’m just imagining a person about to repost an article pulling out some graph paper, stroking their chin and saying, “Hmm, let’s plot these dates in sequence and see if it’s a plausible timeline.” Get Off the Page and Ask the Web This is all ridiculous advice, and it actually is the precise opposite of what experts do. Expert fact-checkers don’t count misspellings or rely on the site’s about page to tell them the truth. You don’t go to the about page of a truly fake site and find a page that says “Site written by Macedonian teens and promoted by a Russian botnet.” INT. APARTMENT (MACEDONIA) TEEN ONE puts the finishing touches on the latest story linking Al Franken to a notorious smuggling ring. TEEN ONEThey’ll never suspect this site is fake! TEEN TWOI know! What’s your address again, for the About page? Expert fact-checkers don’t look at the site because they don’t trust the site. As we’ve said many times before, fact-checkers do the opposite of what Facebook is recommending here. They get off the page. They stop looking at what the page says about itself, and start learning what the network says about the page or claim. They look up the site in Wikipedia, or the cited experts in Google Scholar. They use the power of the network to check stuff on the network. This Facebook advice? It’s indistinguishable, for the most part, from what you would have told students in 1995. And beyond the ineffectiveness of it, it has potential to do real harm. It was precisely these impulses — to judge resources by look and feel and what they say about themselves — that propagandists played on so expertly in 2016. The history of technology is that the fakers are going to get even better at these things next time around. Yet the Facebook advice doesn’t even seem to realize how good they got at this in 2016. There are better ways to do this. I’ve talked about them elsewhere, but briefly we have to show students and citizens how to effectively use networked approaches to check claims on the web. This sniff-test heuristic ain’t gonna cut it. If you’re interested in alternative, web-native approaches to news literacy, you can try my new, completely free and open-source book Web Literacy for Student Fact-Checkers. You should also read Sam Wineburg and Sarah McGrew’s Why Students Can’t Google Their Way to Truth, and the results of their Stanford study which showed that the major deficits of students with regard to news analysis were issues of web literacy and use. ", "title": "Facebook’s News Literacy Advice Is Harmful to News Literacy", "sentences": [{"eb95": "Facebook’s News Literacy Advice Is Harmful to News Literacy"}, {"4225": "Sometime yesterday, Facebook rolled out the largest media literacy campaign in the history of the world."}, {"755a": "Unfortunately, most of what it contained was bad advice."}, {"88f8": "Here’s how Facebook wants you to tell truth from fiction on the web:"}, {"47ea": "Asleep yet? Scrolling and scanning? Bored out of your mind?"}, {"5a38": "There Is No Evidence Any of This Works"}, {"14ce": "Those who have followed my work here and elsewhere will recognize that this is the “checklist” approach to news literacy: look at an article and then see how closely the article displays the attributes of a fake story."}, {"c4b7": "Here’s the research that shows that approach works:"}, {"2a33": "Yeah. There’s actually no evidence that this approach works. And conversely, there’s quite a lot history that shows this model does not work. We actually already trained a generation of students with variants of this method. Sometimes we called it CRAAP. In K-12, it often went by the name of RADCAB. There are dozens of other variations, but they all look basically like this."}, {"f413": "And it failed. It failed for a number of reasons, but four of the biggest are these:"}, {"00ae": "There’s more bizarre stuff in the advice, which seems to have been developed before the more recent incarnations of fake news. The idea that multiple sources mean anything in a world of cut-and-paste clickbait is odd. Fake stories spread faster than real stories, and get copied more places."}, {"0dd1": "There’s the “Look at the URL” advice, which is the one good tip in the bunch, but sadly amusing since the entity hiding the URL in the first place is Facebook:"}, {"d89c": "If you really want people to look at the URL, maybe don’t make it the least noticeable item on the card?"}, {"21dd": "There’s the timeline thing, where I’m just imagining a person about to repost an article pulling out some graph paper, stroking their chin and saying, “Hmm, let’s plot these dates in sequence and see if it’s a plausible timeline.”"}, {"c25a": "Get Off the Page and Ask the Web"}, {"685a": "This is all ridiculous advice, and it actually is the precise opposite of what experts do. Expert fact-checkers don’t count misspellings or rely on the site’s about page to tell them the truth. You don’t go to the about page of a truly fake site and find a page that says “Site written by Macedonian teens and promoted by a Russian botnet.”"}, {"72a5": "INT. APARTMENT (MACEDONIA)"}, {"95ec": "TEEN ONE puts the finishing touches on the latest story linking Al Franken to a notorious smuggling ring."}, {"fa7c": "TEEN ONEThey’ll never suspect this site is fake!"}, {"b420": "TEEN TWOI know! What’s your address again, for the About page?"}, {"1d19": "Expert fact-checkers don’t look at the site because they don’t trust the site. As we’ve said many times before, fact-checkers do the opposite of what Facebook is recommending here. They get off the page. They stop looking at what the page says about itself, and start learning what the network says about the page or claim. They look up the site in Wikipedia, or the cited experts in Google Scholar. They use the power of the network to check stuff on the network."}, {"634d": "This Facebook advice? It’s indistinguishable, for the most part, from what you would have told students in 1995. And beyond the ineffectiveness of it, it has potential to do real harm. It was precisely these impulses — to judge resources by look and feel and what they say about themselves — that propagandists played on so expertly in 2016."}, {"1558": "The history of technology is that the fakers are going to get even better at these things next time around. Yet the Facebook advice doesn’t even seem to realize how good they got at this in 2016."}, {"d0b1": "There are better ways to do this. I’ve talked about them elsewhere, but briefly we have to show students and citizens how to effectively use networked approaches to check claims on the web. This sniff-test heuristic ain’t gonna cut it."}, {"a571": "If you’re interested in alternative, web-native approaches to news literacy, you can try my new, completely free and open-source book Web Literacy for Student Fact-Checkers."}, {"c744": "You should also read Sam Wineburg and Sarah McGrew’s Why Students Can’t Google Their Way to Truth, and the results of their Stanford study which showed that the major deficits of students with regard to news analysis were issues of web literacy and use."}], "child": "1358_1\t1358_2\t1358_3\t1358_4"}