{"name": "1359", "parent": "", "content": "So…is it Me?? Or do I need to get my eyes checked?? Okay, so I’m scrolling along on Twitter, and I’m curious to see what people say on there who are hardcore conservatives ( one should ALWAYS see what the other is up to) and I fall upon this twitter feed, here is a screenshot… Okay..see the first tweet where Trump says Michael Flynn should ask for immunity? Then the next tweet says that Michael Flynn asking for immunity through his lawyer ( which I both heard on MSNBC and CNN) is debunked as Fake News? Is it me?? This story also ran in The Independent news source over in the U.K., which also runs the story in it’s United States affiliate… A lawyer's explanation of Michael Flynn's immunity request is utterly chillingMichael Flynn's unusual immunity request suggests the Trump administration has been involved in a \"criminal conspiracy\",…www.independent.co.uk The Independent is FAR from fake news. Can someone please explain this to me? I mean, if Trump tells Michael to seek immunity, and he does it, how in the HELL is this FAKE NEWS?!?!? ", "title": "So…is it Me??", "sentences": [{"ed88": "So…is it Me??"}, {"d917": "Or do I need to get my eyes checked??"}, {"890b": "Okay, so I’m scrolling along on Twitter, and I’m curious to see what people say on there who are hardcore conservatives ( one should ALWAYS see what the other is up to) and I fall upon this twitter feed, here is a screenshot…"}, {"9791": "Okay..see the first tweet where Trump says Michael Flynn should ask for immunity?"}, {"5bc4": "Then the next tweet says that Michael Flynn asking for immunity through his lawyer ( which I both heard on MSNBC and CNN) is debunked as Fake News?"}, {"6396": "Is it me??"}, {"97f6": "This story also ran in The Independent news source over in the U.K., which also runs the story in it’s United States affiliate…"}, {"cc9b": "A lawyer's explanation of Michael Flynn's immunity request is utterly chillingMichael Flynn's unusual immunity request suggests the Trump administration has been involved in a \"criminal conspiracy\",…www.independent.co.uk"}, {"4b32": "The Independent is FAR from fake news. Can someone please explain this to me?"}, {"6db1": "I mean, if Trump tells Michael to seek immunity, and he does it, how in the HELL is this FAKE NEWS?!?!?"}], "child": "1359_1\t1359_2"}