{"name": "136", "parent": "", "content": "Which NHL Team Do We Want to Win the 2017 Stanley Cup? Ringer staffers pick the seven teams not named the Blackhawks or Penguins that could take home the Stanley Cup — or at least make the playoffs fun Hellooooo and welcome to the greatest time of the year: the start of the Stanley Cup playoffs. Games begin on Wednesday, and the story lines are rich: prodigies are everywhere; curses can be broken; and congratulations are in order to Canada, which has five teams in the postseason this year instead of the whopping zero it had last year With the puck drop rapidly approaching, Ringer staffers made their extremely logical, level-headed choices for which teams they’d like to see hoist the Cup. (Sorry, Hawks fans, your team isn’t one of them.) Columbus Blue Jackets Katie Baker: The New York Rangers should be my obvious pick to win the Stanley Cup. No one wants to see Henrik Lundqvist’s long-delayed coronation as much as I do. (OK, John McEnroe, maybe.) But they’ve burned me too many times before — advancing just far enough to make my soul retreat; being just good enough for the inevitable loss to feel incredibly bad. So, in the spirit of “If I can’t have it, no one will,” I’ll instead pull for the outcome that I believe will annoy the largest number of kind-of-humorless hockey people. Which is why I’m kinda pulling for the Trollumbus Blue Jackets. Coach John Tortorella has burned so many bridges over the years with his bullheaded style and misguided philosophies (particularly in Vancouver) that I’d thoroughly enjoy seeing him become a two-time Cup winner just for the lulz — as an Eli Manning enthusiast, I know how that works. Brandon Dubinsky is one of the best-worst pests in the league; Scott Hartnell called Trump a #legend (See, I’m even trolling myself!); goalie Sergei Bobrovsky’s supremacy could be a bitter pill to swallow for the Russophobes. And the Blue Jackets’ path to the final would be a doozy: beating the Pittsburgh Penguins in the first round — league crisis! — and then taking on the winner of Leafs-Caps. Imagine how angry Toronto fans would be if their team upset favored Washington in the first round only to lose to dumb ol’ Lumbus? I can already taste the salty tweets about TV ratings and bandwagon fans. Oh, there’s also the cannon. People haaaaaaaaate that thing. Their anger is my sweet nectar. I hope the cannon gets its name on the Cup. Go, Lumbus, go. (New York Rangers, just look what you’ve driven me to.) Send the Stanley Cup to Columbus AlreadyThe unexpected ecstasy of rooting for the NHL’s Blue Jackets, the team that suddenly never losestheringer.com Mark Titus: It’s no secret that America seems to be getting more divided with each passing day, which is why I believe history will look back on the playoff run the Columbus Blue Jackets are about to go on as the singular moment that saved our country. I mean, just think about the two things that all Americans can agree on when it comes to hockey: (1) Canada’s Stanley Cup drought is one of the funniest things in sports, and (2) Sidney Crosby is a wuss. With that in mind, it’s a wonder that someone could cheer for any playoff team but the Blue Jackets. For starters, they get to do the honors of sending Crosby home in the first round this year. More importantly, while nothing says American hockey quite like cheering against Canada in the playoffs, rooting for the Blue Jackets comes pretty damn close. They’re underdogs from an unheralded part of the country; six of their top eight point-getters are from the U.S., and their leading scorer is a 5-foot-8 former sixth-round draft pick; they’re the only NHL team with both a red, white, and blue color scheme and stars and stripes in their logo; and their coach is the winningest American coach in NHL history. Oh, and I almost forgot: The name “Blue Jackets” pays homage to the Union Army, which, as you may remember, was a group of young men who ultimately brought a polarized America back together. So yeah, go ahead and cheer for the Penguins or Blackhawks or whatever sorry-ass team it is that you support. I’m not saying I’m better than you; it’s just that I can’t sit back and pretend that the only thing at stake in these playoffs is a shiny trophy carried by a nerd wearing white gloves. That’s why I’m pulling for the one team that can (and will) inspire and reunite our great country — the Columbus Blue Jackets. Washington Capitals Michael Baumann: Here’s a partial list of teams that won’t win the Cup this year if Washington does, and why that’s a good thing: But this isn’t just about playing defense; this is about Alexander Ovechkin. The best goalscorer since, I don’t even know — a young Jaromir Jagr? Mario? — has suffered through 12 years of the slings and arrows specific to the gleeful Cherry-istic xenophobia of North American hockey culture, and suddenly, the graying Ovechkin is closer to the end than the beginning. Does he need a title to cement his place as one of the greatest players of all time? Absolutely not. But it’d be nice to see him — and Washington’s cue-ballish and unassuming, but nonetheless accomplished head coach Barry Trotz — shut the haters up. The (Annually) Impending Heartbreak of Being a Washington Capitals FanThe Caps are the NHL’s best team. Naturally, their fans are terrified.theringer.com Calgary Flames Donnie Kwak: Hockey needs assholes. Stars are born in the postseason, the cliché goes — sure — but it’s the assholes who make the playoffs more compelling. (The “a”-word you’ll hear commentators use to describe an asshole is “agitator.”) Matthew Tkachuk is a left wing for the Calgary Flames, and he is an asshole. You recognize the surname, surely, because Matthew is the 19-year-old son of Keith Tkachuk, a surly power forward who scored 1,065 points in his NHL career. (Dad was kind of an asshole, too.) In his rookie season, Matthew was one of only 14 players in the league to register over 100 penalty minutes. More impressively, he finished fifth on the Flames in points, with 13 goals and 35 assists. So, Tkachuk is an asshole who can play — which actually makes him more of an asshole. The younger Tkachuk cemented his asshole status in March when he was suspended for two games for throwing this vicious elbow to the grill of Kings star defenseman Drew Doughty. Afterward Doughty called Tkachuk a “pretty dirty player,” to which the rookie responded by scorching his elder: “I expected more from him, honestly, than to go right to the media and start complaining after a loss.” When the Flames played L.A. 10 days later, Tkachuk basically said “bring it” to the entire Kings team. Theatrics, and much postgame consternation, ensued: Now imagine this level of precocious assholeishness over a seven-game series with Anaheim, against the likes of veteran assholes Ryan Kesler and Corey Perry. My die-hard hockey affiliation has already been established on this site, but in the West, I want to see this young asshole go as far as possible. Minnesota Wild Megan Schuster: The Wild just wrapped up their best regular season in franchise history: 49 wins, 106 points, and 21 players who didn’t get the mumps (we’re looking at the positives here, right?). All in all, their outlook is good heading into Round 1 of the playoffs against the St. Louis Blues. But there is cause to be concerned about the Wild — and no, it’s not because of the Boudreau playoff curse. It’s because the 6-foot-6 force of nature that led his team to 12 straight wins and was an early Vezina Trophy favorite is fighting through a slump. Devan Dubnyk’s early numbers (.946 save percentage through one third of the season) were incredible, though, as many thought, they proved unsustainable. In the month of March, Dubnyk’s save percentage dropped to .889 and his GAA was 2.94. His team lost 11 of the 14 games he played in, and Bruce Boudreau went so far as to bring up Alex Stalock from the Wild’s AHL affiliate to give Dubnyk a two-game break. But even with Dubnyk’s slight regression toward the mean, he finished the season with the second-best GAA and save percentage of his career. After his brief hiatus, he is 3–0 in the month of April and looks to once again be The Guy for the Wild. Dubnyk has had a roller coaster of a ride through the NHL, and this latest slump is nothing compared to being shipped around the league for years before finally winding up in Minnesota. His teammates appear to have complete confidence in him, and if the Wild finally manage to break through in the playoffs, there’s no doubt their goaltender will have had something to do with it. Edmonton Oilers Andrew Gruttadaro: Since Wayne Gretzky left Edmonton in 1988, the Oilers haven’t had much go their way. Sure, they won the Stanley Cup the next year and made it to the Finals in ’06, but there aren’t many highlights in between. And in the past seven years they’ve had more first-overall picks than first-round playoff appearances. Taylor Hall, Ryan Nugent-Hopkins, and Nail Yakupov were all supposed to turn the franchise around, yet Hall and Yakupov are gone and the Nuge is more “solid NHLer” than savior. But finally, a real franchise player arrived in the form of 2015 no. 1 overall pick Connor McDavid, the heir apparent to Sidney Crosby and a 20-year-old who is everything all those other first-round picks were supposed to be. On the strength of McDavid’s 100-point regular season, the Oilers are back in the playoffs for the first time in a decade. As a Buffalo Sabres fan, it’s hard for me to root for Edmonton (Buffalo literally spent two years tanking to get McDavid, only to lose a f**king lottery), but you know what? It’s time the old gods died. This is Connor McDavid’s league now, and I want to see him rip the Cup from the hands of Crosby and Patrick Kane this postseason. Anaheim Ducks Paolo Uggetti: Since their last Stanley Cup victory in 2007, the Ducks have made the playoffs in all but two of the past 10 postseasons, only to be eliminated each year before reaching the finals. But no stretch has been as heartbreaking as these past four seasons: the Ducks have blown four straight 3–2 leads in every kind of playoff series. 2012–13: The Ducks battled the Red Wings in a seven-game series that featured four overtime games — three of which the Ducks lost, including the decisive Game 7. 2013–14: Facing the L.A. Kings in the second round, the Ducks went down 2–0 to start the series, won three straight to take a 3–2 lead, only to lose games 6 and 7. 2014–15: Anaheim made it to the Western Conference finals in 2015 but lost to the eventual Stanley Cup winners, the Chicago Blackhawks, in a series that featured three overtime thrillers. 2015–16: The Ducks exited the playoffs quickly, losing in the first round to the Nashville Predators, their fourth straight blown 3–2 series lead. There are plenty of teams with more tortured fan bases, longer title droughts, and even perhaps more legitimate claims to hoisting Lord Stanley’s trophy. But this year’s Anaheim team is a worthy contender. I’ve watched them twice in person and they look like a well-oiled machine readying to surge into overdrive come playoff time. They’ve won 13 of their past 17, clinched their fifth straight division title, and, more importantly, they’re now led by the coach who helped them reach the mountaintop a decade ago. It’s all happening. New York Rangers Rubie Edmondson: With apologies to my family and friends (Blackhawks lifers) and husband (our home overflows with obscure Devils memorabilia), there’s nothing I want more than to see the Rangers bring the Cup back to New York City. It’s been far too long since a new banner was raised in the Garden. In the 10 years since I adopted Manhattan as my hometown, teams with “New York” in front of their names have not fared especially well. Of the two Giants Super Bowl victories, the ’08 win managed to generate some excitement — how could it not? — but the ’12 fete was as mundane as the concrete walls of MetLife Stadium. The Yankees notched another World Series win in ’09 (snooze!), the Mets came tantalizingly close, and the Jets … Jets’d. Meanwhile, the Knicks haven’t so much as sniffed a conference final, and the Rangers have seemingly been teetering on the brink for years. Those two fandoms occupy a piece of New Yorkers in a way that the Jets and Giants (Jersey) or Yankees and Mets (outer boroughs) simply can’t — they play in the physical heart of Manhattan, at Madison Square Garden. There’s something about that iconic setting that inspires chills in even the most hardened of city dwellers. New York may not be Hockeytown, but the atmosphere during the Rangers’ run to the Finals in 2014 was electric. The Garden needs a championship, the Rangers are our best bet to win one, and I can’t wait to scream in the streets of Midtown when it happens. As the beautiful cherry atop the sundae: The “Henrik Lundqvist needs a ring to be a Hall of Famer” argument is asinine, and it’d be grand to erase any question of America’s Swedish Boyfriend’s HHoF status. ", "title": "Which NHL Team Do We Want to Win the 2017 Stanley Cup?", "sentences": [{"b380": "Which NHL Team Do We Want to Win the 2017 Stanley Cup?"}, {"807b": "Ringer staffers pick the seven teams not named the Blackhawks or Penguins that could take home the Stanley Cup — or at least make the playoffs fun"}, {"6b79": "Hellooooo and welcome to the greatest time of the year: the start of the Stanley Cup playoffs. Games begin on Wednesday, and the story lines are rich: prodigies are everywhere; curses can be broken; and congratulations are in order to Canada, which has five teams in the postseason this year instead of the whopping zero it had last year With the puck drop rapidly approaching, Ringer staffers made their extremely logical, level-headed choices for which teams they’d like to see hoist the Cup. (Sorry, Hawks fans, your team isn’t one of them.)"}, {"afbf": "Columbus Blue Jackets"}, {"a66d": "Katie Baker: The New York Rangers should be my obvious pick to win the Stanley Cup. No one wants to see Henrik Lundqvist’s long-delayed coronation as much as I do. (OK, John McEnroe, maybe.) But they’ve burned me too many times before — advancing just far enough to make my soul retreat; being just good enough for the inevitable loss to feel incredibly bad. So, in the spirit of “If I can’t have it, no one will,” I’ll instead pull for the outcome that I believe will annoy the largest number of kind-of-humorless hockey people. Which is why I’m kinda pulling for the Trollumbus Blue Jackets."}, {"2af8": "Coach John Tortorella has burned so many bridges over the years with his bullheaded style and misguided philosophies (particularly in Vancouver) that I’d thoroughly enjoy seeing him become a two-time Cup winner just for the lulz — as an Eli Manning enthusiast, I know how that works. Brandon Dubinsky is one of the best-worst pests in the league; Scott Hartnell called Trump a #legend (See, I’m even trolling myself!); goalie Sergei Bobrovsky’s supremacy could be a bitter pill to swallow for the Russophobes. And the Blue Jackets’ path to the final would be a doozy: beating the Pittsburgh Penguins in the first round — league crisis! — and then taking on the winner of Leafs-Caps. Imagine how angry Toronto fans would be if their team upset favored Washington in the first round only to lose to dumb ol’ Lumbus? I can already taste the salty tweets about TV ratings and bandwagon fans."}, {"488d": "Oh, there’s also the cannon. People haaaaaaaaate that thing. Their anger is my sweet nectar. I hope the cannon gets its name on the Cup. Go, Lumbus, go. (New York Rangers, just look what you’ve driven me to.)"}, {"9859": "Send the Stanley Cup to Columbus AlreadyThe unexpected ecstasy of rooting for the NHL’s Blue Jackets, the team that suddenly never losestheringer.com"}, {"a6e0": "Mark Titus: It’s no secret that America seems to be getting more divided with each passing day, which is why I believe history will look back on the playoff run the Columbus Blue Jackets are about to go on as the singular moment that saved our country. I mean, just think about the two things that all Americans can agree on when it comes to hockey: (1) Canada’s Stanley Cup drought is one of the funniest things in sports, and (2) Sidney Crosby is a wuss. With that in mind, it’s a wonder that someone could cheer for any playoff team but the Blue Jackets. For starters, they get to do the honors of sending Crosby home in the first round this year. More importantly, while nothing says American hockey quite like cheering against Canada in the playoffs, rooting for the Blue Jackets comes pretty damn close. They’re underdogs from an unheralded part of the country; six of their top eight point-getters are from the U.S., and their leading scorer is a 5-foot-8 former sixth-round draft pick; they’re the only NHL team with both a red, white, and blue color scheme and stars and stripes in their logo; and their coach is the winningest American coach in NHL history."}, {"36ff": "Oh, and I almost forgot: The name “Blue Jackets” pays homage to the Union Army, which, as you may remember, was a group of young men who ultimately brought a polarized America back together. So yeah, go ahead and cheer for the Penguins or Blackhawks or whatever sorry-ass team it is that you support. I’m not saying I’m better than you; it’s just that I can’t sit back and pretend that the only thing at stake in these playoffs is a shiny trophy carried by a nerd wearing white gloves. That’s why I’m pulling for the one team that can (and will) inspire and reunite our great country — the Columbus Blue Jackets."}, {"0f84": "Washington Capitals"}, {"424b": "Michael Baumann: Here’s a partial list of teams that won’t win the Cup this year if Washington does, and why that’s a good thing:"}, {"56ca": "But this isn’t just about playing defense; this is about Alexander Ovechkin. The best goalscorer since, I don’t even know — a young Jaromir Jagr? Mario? — has suffered through 12 years of the slings and arrows specific to the gleeful Cherry-istic xenophobia of North American hockey culture, and suddenly, the graying Ovechkin is closer to the end than the beginning. Does he need a title to cement his place as one of the greatest players of all time? Absolutely not. But it’d be nice to see him — and Washington’s cue-ballish and unassuming, but nonetheless accomplished head coach Barry Trotz — shut the haters up."}, {"d7a7": "The (Annually) Impending Heartbreak of Being a Washington Capitals FanThe Caps are the NHL’s best team. Naturally, their fans are terrified.theringer.com"}, {"b0c6": "Calgary Flames"}, {"450d": "Donnie Kwak: Hockey needs assholes. Stars are born in the postseason, the cliché goes — sure — but it’s the assholes who make the playoffs more compelling. (The “a”-word you’ll hear commentators use to describe an asshole is “agitator.”)"}, {"4c11": "Matthew Tkachuk is a left wing for the Calgary Flames, and he is an asshole. You recognize the surname, surely, because Matthew is the 19-year-old son of Keith Tkachuk, a surly power forward who scored 1,065 points in his NHL career. (Dad was kind of an asshole, too.)"}, {"e011": "In his rookie season, Matthew was one of only 14 players in the league to register over 100 penalty minutes. More impressively, he finished fifth on the Flames in points, with 13 goals and 35 assists. So, Tkachuk is an asshole who can play — which actually makes him more of an asshole."}, {"9356": "The younger Tkachuk cemented his asshole status in March when he was suspended for two games for throwing this vicious elbow to the grill of Kings star defenseman Drew Doughty. Afterward Doughty called Tkachuk a “pretty dirty player,” to which the rookie responded by scorching his elder: “I expected more from him, honestly, than to go right to the media and start complaining after a loss.” When the Flames played L.A. 10 days later, Tkachuk basically said “bring it” to the entire Kings team. Theatrics, and much postgame consternation, ensued:"}, {"a07d": "Now imagine this level of precocious assholeishness over a seven-game series with Anaheim, against the likes of veteran assholes Ryan Kesler and Corey Perry. My die-hard hockey affiliation has already been established on this site, but in the West, I want to see this young asshole go as far as possible."}, {"4458": "Minnesota Wild"}, {"ca8e": "Megan Schuster: The Wild just wrapped up their best regular season in franchise history: 49 wins, 106 points, and 21 players who didn’t get the mumps (we’re looking at the positives here, right?). All in all, their outlook is good heading into Round 1 of the playoffs against the St. Louis Blues. But there is cause to be concerned about the Wild — and no, it’s not because of the Boudreau playoff curse. It’s because the 6-foot-6 force of nature that led his team to 12 straight wins and was an early Vezina Trophy favorite is fighting through a slump."}, {"9ea7": "Devan Dubnyk’s early numbers (.946 save percentage through one third of the season) were incredible, though, as many thought, they proved unsustainable. In the month of March, Dubnyk’s save percentage dropped to .889 and his GAA was 2.94. His team lost 11 of the 14 games he played in, and Bruce Boudreau went so far as to bring up Alex Stalock from the Wild’s AHL affiliate to give Dubnyk a two-game break. But even with Dubnyk’s slight regression toward the mean, he finished the season with the second-best GAA and save percentage of his career. After his brief hiatus, he is 3–0 in the month of April and looks to once again be The Guy for the Wild."}, {"820a": "Dubnyk has had a roller coaster of a ride through the NHL, and this latest slump is nothing compared to being shipped around the league for years before finally winding up in Minnesota. His teammates appear to have complete confidence in him, and if the Wild finally manage to break through in the playoffs, there’s no doubt their goaltender will have had something to do with it."}, {"cb00": "Edmonton Oilers"}, {"0a19": "Andrew Gruttadaro: Since Wayne Gretzky left Edmonton in 1988, the Oilers haven’t had much go their way. Sure, they won the Stanley Cup the next year and made it to the Finals in ’06, but there aren’t many highlights in between. And in the past seven years they’ve had more first-overall picks than first-round playoff appearances. Taylor Hall, Ryan Nugent-Hopkins, and Nail Yakupov were all supposed to turn the franchise around, yet Hall and Yakupov are gone and the Nuge is more “solid NHLer” than savior. But finally, a real franchise player arrived in the form of 2015 no. 1 overall pick Connor McDavid, the heir apparent to Sidney Crosby and a 20-year-old who is everything all those other first-round picks were supposed to be."}, {"2040": "On the strength of McDavid’s 100-point regular season, the Oilers are back in the playoffs for the first time in a decade. As a Buffalo Sabres fan, it’s hard for me to root for Edmonton (Buffalo literally spent two years tanking to get McDavid, only to lose a f**king lottery), but you know what? It’s time the old gods died. This is Connor McDavid’s league now, and I want to see him rip the Cup from the hands of Crosby and Patrick Kane this postseason."}, {"a8a3": "Anaheim Ducks"}, {"9d5b": "Paolo Uggetti: Since their last Stanley Cup victory in 2007, the Ducks have made the playoffs in all but two of the past 10 postseasons, only to be eliminated each year before reaching the finals. But no stretch has been as heartbreaking as these past four seasons: the Ducks have blown four straight 3–2 leads in every kind of playoff series."}, {"d83d": "2012–13: The Ducks battled the Red Wings in a seven-game series that featured four overtime games — three of which the Ducks lost, including the decisive Game 7."}, {"254e": "2013–14: Facing the L.A. Kings in the second round, the Ducks went down 2–0 to start the series, won three straight to take a 3–2 lead, only to lose games 6 and 7."}, {"7bb8": "2014–15: Anaheim made it to the Western Conference finals in 2015 but lost to the eventual Stanley Cup winners, the Chicago Blackhawks, in a series that featured three overtime thrillers."}, {"2572": "2015–16: The Ducks exited the playoffs quickly, losing in the first round to the Nashville Predators, their fourth straight blown 3–2 series lead."}, {"7cdf": "There are plenty of teams with more tortured fan bases, longer title droughts, and even perhaps more legitimate claims to hoisting Lord Stanley’s trophy. But this year’s Anaheim team is a worthy contender. I’ve watched them twice in person and they look like a well-oiled machine readying to surge into overdrive come playoff time. They’ve won 13 of their past 17, clinched their fifth straight division title, and, more importantly, they’re now led by the coach who helped them reach the mountaintop a decade ago. It’s all happening."}, {"b3bf": "New York Rangers"}, {"3d83": "Rubie Edmondson: With apologies to my family and friends (Blackhawks lifers) and husband (our home overflows with obscure Devils memorabilia), there’s nothing I want more than to see the Rangers bring the Cup back to New York City. It’s been far too long since a new banner was raised in the Garden."}, {"ff7d": "In the 10 years since I adopted Manhattan as my hometown, teams with “New York” in front of their names have not fared especially well. Of the two Giants Super Bowl victories, the ’08 win managed to generate some excitement — how could it not? — but the ’12 fete was as mundane as the concrete walls of MetLife Stadium. The Yankees notched another World Series win in ’09 (snooze!), the Mets came tantalizingly close, and the Jets … Jets’d."}, {"5132": "Meanwhile, the Knicks haven’t so much as sniffed a conference final, and the Rangers have seemingly been teetering on the brink for years. Those two fandoms occupy a piece of New Yorkers in a way that the Jets and Giants (Jersey) or Yankees and Mets (outer boroughs) simply can’t — they play in the physical heart of Manhattan, at Madison Square Garden. There’s something about that iconic setting that inspires chills in even the most hardened of city dwellers. New York may not be Hockeytown, but the atmosphere during the Rangers’ run to the Finals in 2014 was electric. The Garden needs a championship, the Rangers are our best bet to win one, and I can’t wait to scream in the streets of Midtown when it happens."}, {"8497": "As the beautiful cherry atop the sundae: The “Henrik Lundqvist needs a ring to be a Hall of Famer” argument is asinine, and it’d be grand to erase any question of America’s Swedish Boyfriend’s HHoF status."}], "child": "136_1\t136_2\t136_3\t136_4\t136_5\t136_6\t136_7\t136_8\t136_9\t136_10\t136_11\t136_12\t136_13"}