{"name": "1363", "parent": "", "content": "The Parties Are Finished You are correct. The two party system only made moderate sense at its best. It has been thoroughly broken since elements of the Republican Party decided to destroy our government. It was fine advocating small government and representing rich people when most rich people were only moderately richer than other people. Then they decided that wasn’t good enough when the Democratic Party decided that black people would help them win and went for it. Turd blossom seeds were spread by Ronnie Reagan to poison the land and it did. And the people that mattered were millionaires. And the Democratic Party saw it and wanted to become millionaires, too. At least the party leaders. Screw the others. Well scraps could be thrown but I mean, who gives a shit about lots of people. The security guards have trouble keeping them out of the flower beds. And then the Republican millionaires became billionaires and discovered that racists overlapped with religionist bigots who lived next door to serious gun lickers who needed something hard to show other people and none of them ever asked any questions once you got them pointed and barking. A match made in heaven. So the people that mattered all became filthy rich. Who could complain? But, meanwhile, radical capitalism that had been allowed to run flat out with no socialist controls began to come apart and no one knew why. Only the craziest had the answer and that answer was faster, faster. And then it was mine, mine. Things then became very dark, the fascists arrived and it was too late. . . So please explain how selecting one of the parties that failed will save us from the people those parties empowered? It seems to me the only reasonable action is to demand that the broken systems be completely replaced by making sure that they cannot work. Maintain our governmental bodies but completely deny the political parasite that has taken over its head. Deny all political change and recognize only the status quo. Deny Trump. Deny Congress. Deny until the system collapses. Is there any other way? ", "title": "The Parties Are Finished", "sentences": [{"eae7": "The Parties Are Finished"}, {"d2ee": "You are correct. The two party system only made moderate sense at its best. It has been thoroughly broken since elements of the Republican Party decided to destroy our government. It was fine advocating small government and representing rich people when most rich people were only moderately richer than other people. Then they decided that wasn’t good enough when the Democratic Party decided that black people would help them win and went for it. Turd blossom seeds were spread by Ronnie Reagan to poison the land and it did. And the people that mattered were millionaires. And the Democratic Party saw it and wanted to become millionaires, too. At least the party leaders. Screw the others. Well scraps could be thrown but I mean, who gives a shit about lots of people. The security guards have trouble keeping them out of the flower beds. And then the Republican millionaires became billionaires and discovered that racists overlapped with religionist bigots who lived next door to serious gun lickers who needed something hard to show other people and none of them ever asked any questions once you got them pointed and barking. A match made in heaven. So the people that mattered all became filthy rich. Who could complain?"}, {"5dd0": "But, meanwhile, radical capitalism that had been allowed to run flat out with no socialist controls began to come apart and no one knew why. Only the craziest had the answer and that answer was faster, faster. And then it was mine, mine. Things then became very dark, the fascists arrived and it was too late. . ."}, {"c0c7": "So please explain how selecting one of the parties that failed will save us from the people those parties empowered? It seems to me the only reasonable action is to demand that the broken systems be completely replaced by making sure that they cannot work. Maintain our governmental bodies but completely deny the political parasite that has taken over its head. Deny all political change and recognize only the status quo. Deny Trump. Deny Congress. Deny until the system collapses. Is there any other way?"}], "child": "1363_1\t1363_2"}