{"name": "1374", "parent": "", "content": "Why Facts Can Never Defeat Post Truth Politics Exposing Trump’s lies is irrelevant since truth for him is besides the point. There is a better way. Source A significant amount of chatter has been generated around this ‘post-truth’ era we all are apparently living in now. Dictionaries have anointed it as the word of the year. The sales of Orwell’s 1984 has been cited as evidence for popular interest in the subject. Conferences of philosophers, historians and journalists have been held around the world to deal with this ‘new’ challenge which all intellectuals face. The question however is not whether we are in a post-truth era but when have human beings ever lived in a society where facts have been revered in politics and personal beliefs? If we sense that something has changed in our polity, then it’s definitely not represented by a president lying on camera or his spokesperson citing ‘alternate facts’. The symptoms of this revolution are seen in the public’s response to lies and their apathy towards truth. The driver of this tectonic shift is not one person but the whole system of media and journalism. He Stole My Money, I Made Him KingA story of demonetization and the triumph of Narendra Modi.medium.com BREAKING NEWS BROKE THE NEWS The supposed ‘coup’ of lies on all mainstream discourses is not just a fashion fad but the end result of a media movement which started with television. 24 hours TV news with its incessant need for both content and viewers adopted a very specific model of electronic communication in the 1970s. This same model has transfigured into the monstrosity we now call as the fake news network. In this model, the audience is defined as a reactive subject and the main goal of any media outlet is that of snatching attention and clutching on to it until the advertisements end. This forms a loop where the media, especially news channels, package and select content to arouse people’s limbic systems and in return they are rewarded with TRPs and higher ad revenues. Since anger or anguish is the easiest and strongest emotion to elicit in people, negative news or outrageous claims now form the bulk of any TV content. Be it daily soaps, debates or even ‘historical’ documentaries about aliens, almost all of them employ an outrage loop designed to stimulate our reptilian brains. THE INDUSTRIAL BULLSHIT COMPLEX The rise of social media and wider penetration of the world wide web created new roles for the mass audiences who were usually voiceless. The anonymity and the absence of any social consequences granted by the internet provided a fertile ground for the expression of outrage which was earlier limited to the living room. Theoretically, these messages shared on the internet are public and freely accessible. However the algorithmic framework made sure that only people who would agree with it, or vehemently oppose it would generally see it. This echo-chamber technique perfected by facebook both distilled and intensified the outrage model invented by TV networks. Hence, far from being a challenge to MSM, social media is it’s perfect partner in terms of the end goal media owners seek to achieve — sustained attentions and ad revenues. Trump says Mexicans are rapists, TV channels go run it all day, the audience quickly run back to their echo-chambers, ranting and seamlessly validating each others worldviews. In the end everyone makes mountains of money. So where exactly is the problem? The real post-truth crisis starts when people eventually realize that the system will not only work without any real journalism, but it will work better. If journalism is all about reporting the truth, and truth is inconvenient for the hype machine, then it makes logical sense to divorce news from truth altogether. Breitbart, along with the whole network of fake news outlets, thus are the most evolved forms of main stream media instead of being their mortal enemies. They are most blatant and honest about their goal to generate outrage in their audience. The fact that they have massacred journalistic ethics does not make any dent on the reputation because they make money from eyeballs not truth. They are in the business of bollocks and their readers love it. The shift here is not from journalism to lying, but from Truth to bullshit. This distinction is absolutely important in order to defeat the Bullshit complex. A liar is a person who knows the truth but consciously conveys information which contradicts it. A merchant of BS is not even concerned about facts or truth at all. He does not need to know it, he doesn’t need to refute it, all he needs is to induce the desired effect on his audience. Bullshit is far more dangerous towards truth because exposing contradictions, revealing facts and even using logic does not cause any harm to it. Like the outrage loop, bullshit targets our limbic brain to induce feelings about truth, aptly called as ‘truthiness’. More importantly a person can bullshit even when he is speaking the Truth. Hence when Trump, Putin or Modi are stating facts they are still dishing out piles of horse manure. What is important here is not precisely the content of communication, but the intent behind it, the effects which are induced and the strategies used to achieve this. THE ANTIDOTE Journalism, where people act as transparent mirrors of Truth, where facts and opinions are separate and lying means instant death is perfect for countering falsities. However, it is completely impotent against bullshit. Passive presentation of facts barely make a difference since bullshit is not countering them but seeking to make them irrelevant. When Modi talks about head transplants in vedic India or when Trump states that Obama is not an American, they are simply disregarding every criteria of Truth. This constant disregard and contradiction either confuses the audience or employs their selective attention to make themselves more appealing. Truth is thus rendered absolutely useless in political discourse. The work of journalism then, in order to counter this, is not to reveal facts but strategies, patterns and scripts bullshitters are using. This kind of journalism has to move away from the conception of a reactive audience, obsessed with breaking news, having short attention spans and forgetting events as soon as the debate ends. This new journalism has to envisage a reflective reader and has to move beyond current events towards a long term analysis. Most importantly, the new journalism doesn’t need to reveal facts, but expose discourses. When I speak of discourses, I refer to a very specific definition often used in social science research. Discourse here means: 1) A mode of organizing knowledge, ideas or experience that is rooted in language and its concrete contexts (as history or institutions). 2) A particular way of talking about and understanding the world or some of its aspects. In these definitions, the power of language is supposed to be not just descriptive but primarily constructive. We form the world in our minds as we talk about it, which in turn directs our actions. This is specially true for identities. Thus, when Putin is talked of as the strongest leader in the western civilization or Trump says he will make America great again, they are constructing their identities along with a worldview. This process is an interactive and dynamic one. People draw on discourses and produce new ones continuously. The work of discursive journalism is to mark out the discursive strategies used in a particular context, study its effects and suggest some counter strategies and possibilities of challenging and transforming them. Only this kind of long term, analytical, research oriented endeavor can hope to defeat post-truth politics and its sudden omnipresence around the world. This publication is an attempt to construct such a kind of journalism. Over the next few months, we will work on certain projects where we will understand how various agents used various discourses to achieve different effects in a particular event. Our first project will analyze the demonetization policy undertaken by the Modi government in India in the month of November, 2016. After this we will take up Trump’s presidency and Brexit as our next projects. If you want to connect with this project or have some suggestions regarding the topics we should look into kindly use this form. If you want to subscribe via email use this form: The DiscursiveThe Discursive Email Formseepurl.com ", "title": "Why Facts Can Never Defeat Post Truth Politics", "sentences": [{"785e": "Why Facts Can Never Defeat Post Truth Politics"}, {"1e92": "Exposing Trump’s lies is irrelevant since truth for him is besides the point. There is a better way."}, {"ce2b": "Source"}, {"b0ac": "A significant amount of chatter has been generated around this ‘post-truth’ era we all are apparently living in now. Dictionaries have anointed it as the word of the year. The sales of Orwell’s 1984 has been cited as evidence for popular interest in the subject. Conferences of philosophers, historians and journalists have been held around the world to deal with this ‘new’ challenge which all intellectuals face."}, {"f1e5": "The question however is not whether we are in a post-truth era but when have human beings ever lived in a society where facts have been revered in politics and personal beliefs?"}, {"9774": "If we sense that something has changed in our polity, then it’s definitely not represented by a president lying on camera or his spokesperson citing ‘alternate facts’. The symptoms of this revolution are seen in the public’s response to lies and their apathy towards truth. The driver of this tectonic shift is not one person but the whole system of media and journalism."}, {"70e2": "He Stole My Money, I Made Him KingA story of demonetization and the triumph of Narendra Modi.medium.com"}, {"c435": "BREAKING NEWS BROKE THE NEWS"}, {"bf0a": "The supposed ‘coup’ of lies on all mainstream discourses is not just a fashion fad but the end result of a media movement which started with television. 24 hours TV news with its incessant need for both content and viewers adopted a very specific model of electronic communication in the 1970s. This same model has transfigured into the monstrosity we now call as the fake news network."}, {"1717": "In this model, the audience is defined as a reactive subject and the main goal of any media outlet is that of snatching attention and clutching on to it until the advertisements end."}, {"a34b": "This forms a loop where the media, especially news channels, package and select content to arouse people’s limbic systems and in return they are rewarded with TRPs and higher ad revenues. Since anger or anguish is the easiest and strongest emotion to elicit in people, negative news or outrageous claims now form the bulk of any TV content. Be it daily soaps, debates or even ‘historical’ documentaries about aliens, almost all of them employ an outrage loop designed to stimulate our reptilian brains."}, {"3f0b": "THE INDUSTRIAL BULLSHIT COMPLEX"}, {"2bae": "The rise of social media and wider penetration of the world wide web created new roles for the mass audiences who were usually voiceless. The anonymity and the absence of any social consequences granted by the internet provided a fertile ground for the expression of outrage which was earlier limited to the living room. Theoretically, these messages shared on the internet are public and freely accessible. However the algorithmic framework made sure that only people who would agree with it, or vehemently oppose it would generally see it. This echo-chamber technique perfected by facebook both distilled and intensified the outrage model invented by TV networks. Hence, far from being a challenge to MSM, social media is it’s perfect partner in terms of the end goal media owners seek to achieve — sustained attentions and ad revenues."}, {"c006": "Trump says Mexicans are rapists, TV channels go run it all day, the audience quickly run back to their echo-chambers, ranting and seamlessly validating each others worldviews. In the end everyone makes mountains of money."}, {"6219": "So where exactly is the problem?"}, {"5331": "The real post-truth crisis starts when people eventually realize that the system will not only work without any real journalism, but it will work better."}, {"b55d": "If journalism is all about reporting the truth, and truth is inconvenient for the hype machine, then it makes logical sense to divorce news from truth altogether. Breitbart, along with the whole network of fake news outlets, thus are the most evolved forms of main stream media instead of being their mortal enemies. They are most blatant and honest about their goal to generate outrage in their audience. The fact that they have massacred journalistic ethics does not make any dent on the reputation because they make money from eyeballs not truth. They are in the business of bollocks and their readers love it."}, {"0325": "The shift here is not from journalism to lying, but from Truth to bullshit. This distinction is absolutely important in order to defeat the Bullshit complex. A liar is a person who knows the truth but consciously conveys information which contradicts it. A merchant of BS is not even concerned about facts or truth at all. He does not need to know it, he doesn’t need to refute it, all he needs is to induce the desired effect on his audience."}, {"827e": "Bullshit is far more dangerous towards truth because exposing contradictions, revealing facts and even using logic does not cause any harm to it. Like the outrage loop, bullshit targets our limbic brain to induce feelings about truth, aptly called as ‘truthiness’. More importantly a person can bullshit even when he is speaking the Truth. Hence when Trump, Putin or Modi are stating facts they are still dishing out piles of horse manure. What is important here is not precisely the content of communication, but the intent behind it, the effects which are induced and the strategies used to achieve this."}, {"ac9f": "THE ANTIDOTE"}, {"66cf": "Journalism, where people act as transparent mirrors of Truth, where facts and opinions are separate and lying means instant death is perfect for countering falsities. However, it is completely impotent against bullshit. Passive presentation of facts barely make a difference since bullshit is not countering them but seeking to make them irrelevant."}, {"e771": "When Modi talks about head transplants in vedic India or when Trump states that Obama is not an American, they are simply disregarding every criteria of Truth. This constant disregard and contradiction either confuses the audience or employs their selective attention to make themselves more appealing. Truth is thus rendered absolutely useless in political discourse."}, {"5cff": "The work of journalism then, in order to counter this, is not to reveal facts but strategies, patterns and scripts bullshitters are using."}, {"df24": "This kind of journalism has to move away from the conception of a reactive audience, obsessed with breaking news, having short attention spans and forgetting events as soon as the debate ends."}, {"7240": "This new journalism has to envisage a reflective reader and has to move beyond current events towards a long term analysis."}, {"547f": "Most importantly, the new journalism doesn’t need to reveal facts, but expose discourses."}, {"9b3f": "When I speak of discourses, I refer to a very specific definition often used in social science research."}, {"ffc1": "Discourse here means:"}, {"b98a": "1) A mode of organizing knowledge, ideas or experience that is rooted in language and its concrete contexts (as history or institutions)."}, {"3829": "2) A particular way of talking about and understanding the world or some of its aspects."}, {"22d9": "In these definitions, the power of language is supposed to be not just descriptive but primarily constructive. We form the world in our minds as we talk about it, which in turn directs our actions. This is specially true for identities. Thus, when Putin is talked of as the strongest leader in the western civilization or Trump says he will make America great again, they are constructing their identities along with a worldview. This process is an interactive and dynamic one. People draw on discourses and produce new ones continuously."}, {"c094": "The work of discursive journalism is to mark out the discursive strategies used in a particular context, study its effects and suggest some counter strategies and possibilities of challenging and transforming them."}, {"e548": "Only this kind of long term, analytical, research oriented endeavor can hope to defeat post-truth politics and its sudden omnipresence around the world."}, {"5c24": "This publication is an attempt to construct such a kind of journalism. Over the next few months, we will work on certain projects where we will understand how various agents used various discourses to achieve different effects in a particular event."}, {"94e8": "Our first project will analyze the demonetization policy undertaken by the Modi government in India in the month of November, 2016. After this we will take up Trump’s presidency and Brexit as our next projects."}, {"b4cb": "If you want to connect with this project or have some suggestions regarding the topics we should look into kindly use this form."}, {"7093": "If you want to subscribe via email use this form:"}, {"1ef8": "The DiscursiveThe Discursive Email Formseepurl.com"}], "child": "1374_11374_11374_11374_1"}