{"name": "1375", "parent": "", "content": "Post-Truth politics — a systems thinking view ‘Post-truth’ or ‘post-fact’ politics is a popular theory to describe how Brexit and President Trump achieved the seemingly impossible. Since June, Google searches for the term have doubled on the previous year. In April a book was published on the topic — ‘Lies, Incorporated: The World of Post-Truth Politics’. Unfortunately this term is an oversimplification that is likely to exacerbate the political divides within these countries. The Post-Truth Theory The theory broadly suggests that the public no longer care about advice from mainstream politicians, media and associated experts. Instead they favor the rhetoric of the less qualified, who pedal whichever message will win them votes, regardless of authenticity and without research. Validity of fact is no longer a concern for the public, or for those who create the messages. “People in this country have had enough of experts” Michael Gove in a Sky News interview, June 3rd 2016 The popularity of the post-truth politics theory has increased (or been made possible) in the last decade as technology has eased the production and distribution of information. The Guardian described this tech disruption in a well timed article this week. A Simple Narrative Though tech disruption and distrust of the mainstream play linked roles, the post-truth theory is a simplification; a neat and coherent story that allows us to make sense of something we don’t understand. Creation of a narrative to summarise a complex issue is a tool people employ regularly as a shortcut to fully understanding something. We don’t realise we do it, and most of the time it’s a useful tool. Social sciences refer to it as ‘mental framing’. Yet if we summarise the views of millions of diverse perspectives and reasons into one theory, that theory should be well-considered. This is especially true if the individuals the theory aims to explain may feel insulted and threatened by it. So let’s consider answering some basic questions about it: These questions are not aiming to convince a post-truth theorist against their views, but to suggest there may be more to it. On a matter of such significance, it is vital that we analyse the system and environment more deeply. A Systems Problem In July this year, The American Interest published an interesting essay that attempts to understand the moral psychology of those who support Brexit and Trump. Compared to the post-truth theory this article differs in the boundaries it draws for analysis. Where post-truth considers only the “bad voters”, “bad politicians” and technology, this article includes the mainstream media, politicians and the Remain/Not Trump voters. Every argument has two sides; post-truth theory considers just one perspective. This seems to be a systems problem and with post -truth theory we have drawn our boundaries too narrowly. Although the analysis may seem correct for that area within the system, we need to consider the whole system in order to gain a fuller appreciation of the problem. Without doing this, our understanding is limited at best, or incorrect at worst. The political disruptions of 2016 are both large and complex in their nature. There will be no exact answer, but many looping and linking theories that require analysis and thinking. Let’s do this thinking instead of positing and sharing ill-conceived, alienating theories. ", "title": "Post-Truth politics — a systems thinking view", "sentences": [{"6047": "Post-Truth politics — a systems thinking view"}, {"05ea": "‘Post-truth’ or ‘post-fact’ politics is a popular theory to describe how Brexit and President Trump achieved the seemingly impossible. Since June, Google searches for the term have doubled on the previous year. In April a book was published on the topic — ‘Lies, Incorporated: The World of Post-Truth Politics’. Unfortunately this term is an oversimplification that is likely to exacerbate the political divides within these countries."}, {"4652": "The Post-Truth Theory"}, {"d156": "The theory broadly suggests that the public no longer care about advice from mainstream politicians, media and associated experts. Instead they favor the rhetoric of the less qualified, who pedal whichever message will win them votes, regardless of authenticity and without research. Validity of fact is no longer a concern for the public, or for those who create the messages."}, {"5fb4": "“People in this country have had enough of experts”"}, {"bf86": "Michael Gove in a Sky News interview, June 3rd 2016"}, {"4a6e": "The popularity of the post-truth politics theory has increased (or been made possible) in the last decade as technology has eased the production and distribution of information. The Guardian described this tech disruption in a well timed article this week."}, {"8bff": "A Simple Narrative"}, {"141e": "Though tech disruption and distrust of the mainstream play linked roles, the post-truth theory is a simplification; a neat and coherent story that allows us to make sense of something we don’t understand. Creation of a narrative to summarise a complex issue is a tool people employ regularly as a shortcut to fully understanding something. We don’t realise we do it, and most of the time it’s a useful tool. Social sciences refer to it as ‘mental framing’. Yet if we summarise the views of millions of diverse perspectives and reasons into one theory, that theory should be well-considered. This is especially true if the individuals the theory aims to explain may feel insulted and threatened by it. So let’s consider answering some basic questions about it:"}, {"0510": "These questions are not aiming to convince a post-truth theorist against their views, but to suggest there may be more to it. On a matter of such significance, it is vital that we analyse the system and environment more deeply."}, {"cc13": "A Systems Problem"}, {"ecdd": "In July this year, The American Interest published an interesting essay that attempts to understand the moral psychology of those who support Brexit and Trump. Compared to the post-truth theory this article differs in the boundaries it draws for analysis. Where post-truth considers only the “bad voters”, “bad politicians” and technology, this article includes the mainstream media, politicians and the Remain/Not Trump voters. Every argument has two sides; post-truth theory considers just one perspective."}, {"2191": "This seems to be a systems problem and with post -truth theory we have drawn our boundaries too narrowly. Although the analysis may seem correct for that area within the system, we need to consider the whole system in order to gain a fuller appreciation of the problem. Without doing this, our understanding is limited at best, or incorrect at worst."}, {"1fe9": "The political disruptions of 2016 are both large and complex in their nature. There will be no exact answer, but many looping and linking theories that require analysis and thinking. Let’s do this thinking instead of positing and sharing ill-conceived, alienating theories."}], "child": "1375_1\t1375_2\t1375_3\t1375_4"}