{"name": "1376", "parent": "", "content": "Daily Wire’s John Nolte Has Just Told Us That He Thinks the Truth is Expendable And he really, really, really wants us to believe him, so I think we should. I offer the following response not as a competing political analyst or current events expert, but as a reader. I said in a recent article that it is the job of the media to keep the White House accountable, and it is the job of the American readership to keep the media accountable. The job of the media is to serve its readership by providing relevant news and well-reasoned analysis by qualified commentators. What I am about to say should require no credentials beyond “concerned citizen” and “insulted reader”. I hope the Daily Wire is paying attention. John Nolte, formerly of Breitbart News and currently of the Daily Wire, published a doozy of an article yesterday with this inspirational title: “Five Reasons I Don’t Care If Trump Lies”. Response to Ben Shapiro: Five Reasons I Don't Care If Donald Trump LiesLet me first acknowledge Ben Shapiro's Sunday piece about those who excuse from Donald Trump what they never would from…www.dailywire.com This was in response to a piece by Ben Shapiro calling out the political right’s hypocrisy in defending the blatant lies of White House Press Secretary Sean Spicer as regards the crowd size an the Inauguration. 'But Obama!' and 'Trump's Doing Some Good Things!' Aren't Excuses For Trump LyingOver the weekend, all hell broke loose when President Donald Trump made a series of statements that were factually…www.dailywire.com Holding a position that you don’t care if the President lies to the American people is so inane that it really should not even merit an answer, but the Daily Wire published it, so I have to assume that they don’t understand this. I think Nolte is probably smart enough to be aware of just how stupid this position is, but he is also smart enough to know that stupid sells, and unethical enough to take advantage of it. But if you’re going to live by the stupid, you’ve got to die by the stupid, so we’re going to take him at his word here. Mr. Nolte absolved me of any obligation to give him the benefit of the doubt within his first paragraph: On this particular subject, I have been very clear since the beginning, since The Donald stepped out onto the political stage. And for the hard of hearing, let me put it this way… I DO NOT CARE IF DONALD TRUMP LIES. Just in case that wasn’t perfectly clear, let me say it again: I DO NOT CARE IF DONALD TRUMP LIES. Like I said, he really, really wants us to believe him about this. Coming from a member of the media (yes, Mr. Nolte, you too are a member of the media and subject to the responsibilities implied by that role), there can really be no explanation that follows these words that would justify them. But let’s go through his five points anyway, because as bad as the title makes it look, his reasons make it even worse. (I don’t really want to copy and paste Nolte’s entire article into this piece, so to some extent I will have to paraphrase his five points, but I do encourage you to click the link and read the entire thing so that you can judge for yourself whether or not I am misrepresenting his words.) The mainstream media is a lying propaganda machine out to destroy Trump. So… …out of some misguided sense of virtue we’re supposed to surrender part of the arsenal? In politics, lying is a tactic, and if you don’t use that tactic, you’re screwed. Yes, Mr. Nolte, I intend to keep my “misguided sense of virtue” intact, even if you seem weirdly fixated with convincing us that you won’t. If media personalities are going to overlook dishonesty in politicians simply because the letter after their name corresponds with the party that that writer is registered with, I’m not really sure what the point of media is in the first place. If all I can expect from the Right-wing media is to hear them fawning all over Trump no matter what he does or says, I might as well throw Nolte and the Daily Wire in the trash, because I could do that with or without their help, if I were a party-worshiping sycophant (which I’m not). 2. Do you want to win or lose? Ok, I’m not sure how this is even a point, since it’s actually a question, but I think what he’s trying to say here is that winning is more important than the truth. Let me just put it like this… How exactly is it a virtue to lose like a gentleman when your personal freedom and the fate of your country is at stake? Yes, because the road to freedom is paved with the blood of media members willing to give public officials a pass on blatant, provable falsehoods to the American people in the name of party loyalty. I’m beginning to wonder exactly what game it is that Nolte is trying to win. 3. Politics Is War Yes, politics is war. It is not war-war. Should Trump ever cross the line into illegality, violence, or the endorsing/excusing of violence … I’ll speak up as loudly as anyone. Leaving aside that “War-War” would make a great name for Jar-Jar Binks’ long-lost, evil twin, the gist of this point seems to be “ethical rules are expendable in politics, just like they are expendable in war”. But then, after spending the last 500 words unabashedly defending the position that he will overlook the President’s lies because that’s what it takes to “win”, he expects us to believe that he would not overlook “illegality, violence, or the endorsing/excusing of violence”. Give me one reason to believe him — and if your answer is “because he’s a Republican”, you may want to consider the possibility that you are in a cult, and seek help. Nolte’s position has rendered him irredeemably untrustworthy, and to me as a reader, untrustworthy equals useless. Nolte is not a journalist, he is a political commentator, but trust is important in this role as well, because he is asking me to consider and be persuaded by his opinion, and in this piece he is letting me know that he will knowingly, deliberately leave relevant facts out of his analysis in order to manipulate me into believing whatever the current party line is. This renders all future opinions from him null and void in my book. 4. There’s a difference between bull**** and lying This point mostly consists of quoting New York Time’s Kyle Smith’s explanation of a concept he refers to as “The Bulls*** Zone”: Bulls — — t is airy, meaningless drivel, the stuff that campaigns are made of. Or it’s a misleading oversimplification with hidden qualifiers. Not only do we forgive bulls — — t, we like it. … In short, we expect politicians to lie and exaggerate what they can do or what they intend to do. Yes, I think we’re all old enough to realize that politicians tend to be full of … stuffing. But that is exactly why the burden is on the media to hold them to some kind of standard of honesty. Isn’t that what Trump’s movement was supposed to be all about? Not letting elitist politicians get away with saying one thing on the campaign trail and doing another when they got into office? 5. The media is the only issue Nolte goes on to portray the mainstream media as an enemy so bad, so powerful, that no ethical sacrifice is too great to offer in the pursuit of defeating it: There is no higher moral value than the total and complete defeat of our national media. [emph. mine] After literally making the destruction of the mainstream media paramount over every single moral value, he then asks us to believe the following: In closing, let me be very clear about one thing… I will not lie. Oh, I will make mistakes… But I will never intentionally lie to you or to anyone else. Exactly how stupid do you think your readers are? Do you really want to sound this logically compromised, or is it just a cry for help? If that’s what it would take to defeat the mainstream media propaganda machine, why wouldn’t you lie? You just told us that there was no higher moral value that could trump the prime directive of demolishing the mainstream media. You just spent the last twenty paragraphs explaining to us how little you value the truth and why you think you are justified in doing so. You’ve shown us exactly where you stand. But you want us to believe that you have personal integrity, just because you say you do? It doesn’t work that way, bucko. This is insulting. This is trash. It does not deserve a place on any respectable news source’s pages, and it certainly doesn’t deserve a place in front of any intelligent reader. Nolte should be fired from the Daily Wire and the door slammed on him by every single other news outlet that wants to be considered viable over this article. This goes far beyond simply admitting a bias. When a media member does not even care to hide that he will choose partisanship over fact, he should be done in the news industry. Period. If the Daily Wire wants to be considered a completely untrustworthy, Right-wing propaganda fake news machine that will make the mainstream media look like chicken feed, I would advise them to keep giving garbage like this a platform. If they want my readership, I would advise them to give Mr. Nolte a pink slip. Nolte is dead wrong in his idea that the solution to a hypocritical, fact-ignoring media is to answer it with a competing media that is equally hypocritical and fact-ignoring. The real solution is exactly the concept that he is so very ready to throw away: someone has to take the moral high ground. Someone has to stop pointing fingers and make the truth the priority instead of partisanship. Someone has to step up to rebuild trust between the media and the people. This does not get any better until someone does — and Nolte’s article shows that it is about to get much, much worse. ", "title": "Daily Wire’s John Nolte Has Just Told Us That He Thinks the Truth is Expendable", "sentences": [{"ba87": "Daily Wire’s John Nolte Has Just Told Us That He Thinks the Truth is Expendable"}, {"47d4": "And he really, really, really wants us to believe him, so I think we should."}, {"82d8": "I offer the following response not as a competing political analyst or current events expert, but as a reader. I said in a recent article that it is the job of the media to keep the White House accountable, and it is the job of the American readership to keep the media accountable. The job of the media is to serve its readership by providing relevant news and well-reasoned analysis by qualified commentators. What I am about to say should require no credentials beyond “concerned citizen” and “insulted reader”. I hope the Daily Wire is paying attention."}, {"2fd0": "John Nolte, formerly of Breitbart News and currently of the Daily Wire, published a doozy of an article yesterday with this inspirational title: “Five Reasons I Don’t Care If Trump Lies”."}, {"1be4": "Response to Ben Shapiro: Five Reasons I Don't Care If Donald Trump LiesLet me first acknowledge Ben Shapiro's Sunday piece about those who excuse from Donald Trump what they never would from…www.dailywire.com"}, {"d4e2": "This was in response to a piece by Ben Shapiro calling out the political right’s hypocrisy in defending the blatant lies of White House Press Secretary Sean Spicer as regards the crowd size an the Inauguration."}, {"253a": "'But Obama!' and 'Trump's Doing Some Good Things!' Aren't Excuses For Trump LyingOver the weekend, all hell broke loose when President Donald Trump made a series of statements that were factually…www.dailywire.com"}, {"2052": "Holding a position that you don’t care if the President lies to the American people is so inane that it really should not even merit an answer, but the Daily Wire published it, so I have to assume that they don’t understand this. I think Nolte is probably smart enough to be aware of just how stupid this position is, but he is also smart enough to know that stupid sells, and unethical enough to take advantage of it. But if you’re going to live by the stupid, you’ve got to die by the stupid, so we’re going to take him at his word here. Mr. Nolte absolved me of any obligation to give him the benefit of the doubt within his first paragraph:"}, {"4476": "On this particular subject, I have been very clear since the beginning, since The Donald stepped out onto the political stage. And for the hard of hearing, let me put it this way…"}, {"e822": "I DO NOT CARE IF DONALD TRUMP LIES."}, {"3668": "Just in case that wasn’t perfectly clear, let me say it again:"}, {"2b6c": "I DO NOT CARE IF DONALD TRUMP LIES."}, {"ed32": "Like I said, he really, really wants us to believe him about this."}, {"eb38": "Coming from a member of the media (yes, Mr. Nolte, you too are a member of the media and subject to the responsibilities implied by that role), there can really be no explanation that follows these words that would justify them. But let’s go through his five points anyway, because as bad as the title makes it look, his reasons make it even worse."}, {"4b4b": "(I don’t really want to copy and paste Nolte’s entire article into this piece, so to some extent I will have to paraphrase his five points, but I do encourage you to click the link and read the entire thing so that you can judge for yourself whether or not I am misrepresenting his words.)"}, {"5fef": "The mainstream media is a lying propaganda machine out to destroy Trump. So…"}, {"6907": "…out of some misguided sense of virtue we’re supposed to surrender part of the arsenal?"}, {"944b": "In politics, lying is a tactic, and if you don’t use that tactic, you’re screwed."}, {"f84f": "Yes, Mr. Nolte, I intend to keep my “misguided sense of virtue” intact, even if you seem weirdly fixated with convincing us that you won’t."}, {"262a": "If media personalities are going to overlook dishonesty in politicians simply because the letter after their name corresponds with the party that that writer is registered with, I’m not really sure what the point of media is in the first place. If all I can expect from the Right-wing media is to hear them fawning all over Trump no matter what he does or says, I might as well throw Nolte and the Daily Wire in the trash, because I could do that with or without their help, if I were a party-worshiping sycophant (which I’m not)."}, {"1d4d": "2. Do you want to win or lose?"}, {"fdac": "Ok, I’m not sure how this is even a point, since it’s actually a question, but I think what he’s trying to say here is that winning is more important than the truth."}, {"3e4f": "Let me just put it like this…"}, {"dc07": "How exactly is it a virtue to lose like a gentleman when your personal freedom and the fate of your country is at stake?"}, {"b2fe": "Yes, because the road to freedom is paved with the blood of media members willing to give public officials a pass on blatant, provable falsehoods to the American people in the name of party loyalty. I’m beginning to wonder exactly what game it is that Nolte is trying to win."}, {"ef01": "3. Politics Is War"}, {"79f3": "Yes, politics is war. It is not war-war. Should Trump ever cross the line into illegality, violence, or the endorsing/excusing of violence … I’ll speak up as loudly as anyone."}, {"710c": "Leaving aside that “War-War” would make a great name for Jar-Jar Binks’ long-lost, evil twin, the gist of this point seems to be “ethical rules are expendable in politics, just like they are expendable in war”. But then, after spending the last 500 words unabashedly defending the position that he will overlook the President’s lies because that’s what it takes to “win”, he expects us to believe that he would not overlook “illegality, violence, or the endorsing/excusing of violence”."}, {"604f": "Give me one reason to believe him — and if your answer is “because he’s a Republican”, you may want to consider the possibility that you are in a cult, and seek help. Nolte’s position has rendered him irredeemably untrustworthy, and to me as a reader, untrustworthy equals useless. Nolte is not a journalist, he is a political commentator, but trust is important in this role as well, because he is asking me to consider and be persuaded by his opinion, and in this piece he is letting me know that he will knowingly, deliberately leave relevant facts out of his analysis in order to manipulate me into believing whatever the current party line is. This renders all future opinions from him null and void in my book."}, {"2815": "4. There’s a difference between bull**** and lying"}, {"c6e8": "This point mostly consists of quoting New York Time’s Kyle Smith’s explanation of a concept he refers to as “The Bulls*** Zone”:"}, {"62a2": "Bulls — — t is airy, meaningless drivel, the stuff that campaigns are made of. Or it’s a misleading oversimplification with hidden qualifiers. Not only do we forgive bulls — — t, we like it. …"}, {"db98": "In short, we expect politicians to lie and exaggerate what they can do or what they intend to do. Yes, I think we’re all old enough to realize that politicians tend to be full of … stuffing. But that is exactly why the burden is on the media to hold them to some kind of standard of honesty. Isn’t that what Trump’s movement was supposed to be all about? Not letting elitist politicians get away with saying one thing on the campaign trail and doing another when they got into office?"}, {"1a7f": "5. The media is the only issue"}, {"879d": "Nolte goes on to portray the mainstream media as an enemy so bad, so powerful, that no ethical sacrifice is too great to offer in the pursuit of defeating it:"}, {"9edb": "There is no higher moral value than the total and complete defeat of our national media. [emph. mine]"}, {"cfa5": "After literally making the destruction of the mainstream media paramount over every single moral value, he then asks us to believe the following:"}, {"a082": "In closing, let me be very clear about one thing…"}, {"2570": "I will not lie."}, {"f043": "Oh, I will make mistakes… But I will never intentionally lie to you or to anyone else."}, {"20f8": "Exactly how stupid do you think your readers are? Do you really want to sound this logically compromised, or is it just a cry for help? If that’s what it would take to defeat the mainstream media propaganda machine, why wouldn’t you lie? You just told us that there was no higher moral value that could trump the prime directive of demolishing the mainstream media. You just spent the last twenty paragraphs explaining to us how little you value the truth and why you think you are justified in doing so. You’ve shown us exactly where you stand. But you want us to believe that you have personal integrity, just because you say you do?"}, {"fcec": "It doesn’t work that way, bucko."}, {"c16e": "This is insulting. This is trash. It does not deserve a place on any respectable news source’s pages, and it certainly doesn’t deserve a place in front of any intelligent reader."}, {"6c6c": "Nolte should be fired from the Daily Wire and the door slammed on him by every single other news outlet that wants to be considered viable over this article. This goes far beyond simply admitting a bias. When a media member does not even care to hide that he will choose partisanship over fact, he should be done in the news industry. Period."}, {"712f": "If the Daily Wire wants to be considered a completely untrustworthy, Right-wing propaganda fake news machine that will make the mainstream media look like chicken feed, I would advise them to keep giving garbage like this a platform. If they want my readership, I would advise them to give Mr. Nolte a pink slip."}, {"714b": "Nolte is dead wrong in his idea that the solution to a hypocritical, fact-ignoring media is to answer it with a competing media that is equally hypocritical and fact-ignoring. The real solution is exactly the concept that he is so very ready to throw away: someone has to take the moral high ground. Someone has to stop pointing fingers and make the truth the priority instead of partisanship. Someone has to step up to rebuild trust between the media and the people. This does not get any better until someone does — and Nolte’s article shows that it is about to get much, much worse."}], "child": "1376_1\t1376_2\t1376_3\t1376_4\t1376_5\t1376_6\t1376_7\t1376_8\t1376_9\t1376_10\t1376_11\t1376_12\t1376_13\t1376_14"}