{"name": "1378", "parent": "", "content": "Media spreads propaganda about Trump’s business empire Trump tweets, and the media dutifully amplifies his message. The public is being badly misled. CREDIT: AP Photo/Evan Vucci In a series of tweets this morning, Trump announced that he would be giving up operational control of his sprawling multi-national business empire. From both a legal and ethical perspective, this is a meaningless move. The concern is not Trump’s “operation” of his business, it’s his ownership. If Trump retains ownership in his business empire, he will be the beneficiary of a stream of payments from foreign governments. This will place him in violation of the Constitution on the first day of his presidency, according to bipartisan experts, including George W. Bush’s Chief Ethics Counsel. Electoral College must reject Trump unless he sells his business, top lawyers for Bush and Obama…Ethics lawyers for the last two presidents are in agreement.thinkprogress.org That’s why the only way to actually resolve the legal and ethical conflicts his businesses create is to sell his businesses and turn the cash over to a neutral third party. This is the actual definition of a “blind trust,” a mechanism used by presidents for decades to avoid conflicts. Absent actual divestment, Trump is in not “leaving” his business empire in any meaningful way. Nevertheless, local and national media have ignored this reality and simply parroted Trump’s propaganda. A sampling from Twitter: Trump is taking advantage of a well-established media norm— if the president-elect says something, it’s news. The systemic media failure of the Trump transitionTrump’s masterful manipulation.thinkprogress.org This president-elect, however, seems determined to deliberately mislead the media. If the media does not adjust — and quickly — the pubic will continue to be misinformed. ", "title": "Media spreads propaganda about Trump’s business empire", "sentences": [{"5fa0": "Media spreads propaganda about Trump’s business empire"}, {"bdb8": "Trump tweets, and the media dutifully amplifies his message. The public is being badly misled."}, {"d036": "CREDIT: AP Photo/Evan Vucci"}, {"3976": "In a series of tweets this morning, Trump announced that he would be giving up operational control of his sprawling multi-national business empire."}, {"27dc": "From both a legal and ethical perspective, this is a meaningless move. The concern is not Trump’s “operation” of his business, it’s his ownership."}, {"0258": "If Trump retains ownership in his business empire, he will be the beneficiary of a stream of payments from foreign governments. This will place him in violation of the Constitution on the first day of his presidency, according to bipartisan experts, including George W. Bush’s Chief Ethics Counsel."}, {"3606": "Electoral College must reject Trump unless he sells his business, top lawyers for Bush and Obama…Ethics lawyers for the last two presidents are in agreement.thinkprogress.org"}, {"59f1": "That’s why the only way to actually resolve the legal and ethical conflicts his businesses create is to sell his businesses and turn the cash over to a neutral third party. This is the actual definition of a “blind trust,” a mechanism used by presidents for decades to avoid conflicts."}, {"0523": "Absent actual divestment, Trump is in not “leaving” his business empire in any meaningful way."}, {"362b": "Nevertheless, local and national media have ignored this reality and simply parroted Trump’s propaganda. A sampling from Twitter:"}, {"c8ea": "Trump is taking advantage of a well-established media norm— if the president-elect says something, it’s news."}, {"e544": "The systemic media failure of the Trump transitionTrump’s masterful manipulation.thinkprogress.org"}, {"a0bf": "This president-elect, however, seems determined to deliberately mislead the media. If the media does not adjust — and quickly — the pubic will continue to be misinformed."}], "child": "1378_1\t1378_2\t1378_3\t1378_4\t1378_5\t1378_6\t1378_7"}