{"name": "1381", "parent": "", "content": "Indoctrination? Paranoia? Fine Art America It’s not paranoia if they really are out to get you… Once again (I’ve lost track of how many days) the following appears on the right hand side of my news feed, repeated three times, in line: Feminism 2.0On intersectionality and the future of feminism. Go to the profile of Sam RiedelWhat Trans Women Have Is Far More Complicated Than ‘Male Privilege’Sam Riedel Go to the profile of Holly WoodHow Men Failed the Women’s Strike Before it Even StartedHolly Wood Go to the profile of Emma LindsayThis Whole “Are Trans Women Real Women?” Thing is GrossEmma Lindsay Again, let me say I have no more interest in reading about feminism or intersectionality than I do about skeet shooting, bath soaps, or “the Resistance.” And yet here is is. Again. Makes me wonder if I’ve been singled out for indoctrination or if it is just technical incompetence. Either way Medium, you have my five bucks, please fix this! ", "title": "Indoctrination? Paranoia?", "sentences": [{"a48b": "Indoctrination? Paranoia?"}, {"5b6e": "Fine Art America"}, {"781c": "It’s not paranoia if they really are out to get you…"}, {"3526": "Once again (I’ve lost track of how many days) the following appears on the right hand side of my news feed, repeated three times, in line:"}, {"c3e4": "Feminism 2.0On intersectionality and the future of feminism."}, {"12da": "Go to the profile of Sam RiedelWhat Trans Women Have Is Far More Complicated Than ‘Male Privilege’Sam Riedel"}, {"493b": "Go to the profile of Holly WoodHow Men Failed the Women’s Strike Before it Even StartedHolly Wood"}, {"1d1f": "Go to the profile of Emma LindsayThis Whole “Are Trans Women Real Women?” Thing is GrossEmma Lindsay"}, {"b61b": "Again, let me say I have no more interest in reading about feminism or intersectionality than I do about skeet shooting, bath soaps, or “the Resistance.”"}, {"f7ce": "And yet here is is. Again."}, {"55f0": "Makes me wonder if I’ve been singled out for indoctrination or if it is just technical incompetence."}, {"76d1": "Either way Medium, you have my five bucks, please fix this!"}], "child": "1381_1\t1381_2\t1381_3\t1381_4\t1381_5\t1381_6\t1381_7\t1381_8\t1381_9\t1381_10\t1381_11\t1381_12"}