{"name": "1383", "parent": "", "content": "Donald Trump and The Definition of Insanity 58,000 mental health professionals say Donald Trump is too unstable to be president. Here’s a deep dive into the diagnosis and what could happen because of it. (tl;dr here) Albert Einstein is famously quoted: “The definition of insanity is doing the same thing over and over and expecting something to change.” This is not, of course, the actual definition of insanity. It also turns out Einstein never said this. It actually comes from an Alcoholics Anonymous pamphlet from the 1980s. Which is apropos, because nearly 60,000 mental health professionals have diagnosed President Donald Trump with a type of insanity that is often compared to an alcoholic’s lack of honesty and impulse control. Sparked by Change.org petitions by a top former Johns Hopkins professor and a California congresswoman, the psychiatric community has declared that Trump suffers from “Malignant Narcissism.” What is that exactly? Does Trump actually suffer from it? If so, what does that mean? With the help of some concerned psychologists, we’ve broken the answers down. Psychologists say that Trump’s condition is a combination of mental disorders that cause one to distort reality and make violent, impulsive decisions. These disorders form, according to the doctor who coined the term Malignant Narcissism in the 1960s, “the most severe pathology and the root of the most vicious destructiveness.” (Full criteria below.) This is the first time in history that so many mental health professionals have collectively diagnosed a living individual. Their conclusion, based on the hundreds of hours of Trump’s on-camera dialogue and off-the-cuff public speaking, is alarming because it says that our current president is too mentally disturbed to fulfill his office. To be clear: Being a standard deviation or two away from the norm when it comes to one’s psychology does not automatically make a person dangerous, bad, or unable to do a job. Millions of people have depression, anxiety, or mild mania and still function well. Abraham Lincoln went through depression, after all. Unfortunately, unlike many other mental disorders, Malignant Narcissism makes its sufferers actively dangerous to other people. It’s more akin to delusional schizophrenia than it is to anxiousness. In diagnosing Donald trump, mental health pros are breaking with a decades-old precedent. After Barry Goldwater won a 1969 defamation lawsuit when psychiatrists called him crazy in Fact magazine, the psychiatric community put in place a “Goldwater Rule” in their ethics handbook that forbids diagnosing public figures. So why are psychologists breaking with tradition now? A big problem during the Goldwater scenario was that there weren’t objective criteria for diagnosing mental health conditions at the time. Therapists used all sorts of jargon and their best judgment—but they were all over the place. Since then, however, the community has put in place official, objective standards in their bible, the Diagnostic and Statistical Manual of Mental Disorders (DSM for short). This makes it possible to unanimously agree on diagnoses. The real reason for breaking with the code, however, is principle. Someone in power with Malignant Narcissism is likely to get people killed, and psychologists who know this feel morally obligated to speak up. This has legal precedent in a court case called Tarasoff vs Regents, in which the murder of a woman could have been prevented if the killer’s psychotherapist had warned her or police that the man might kill her. This resulted in The Tarasoff Rule: “When a therapist determines, or pursuant to the standards of his profession, should determine, that his patient presents a serious danger of violence to another, he incurs an obligation to use reasonable care to protect the intended victim against such danger.” In Judaism, there is a principle called “Pikuach Nefesh” which says that it’s okay to break a rule in order to save a human life. Many in the mental health community believe that Donald Trump’s psychosis is that kind of a life-or-death situation, and that since he sees no mental health doctor, the Tarasoff Rule should supersede the Goldwater Rule. Thousands of psychologists feel morally justified in this. (And some even are saying it is immoral to not speak up.) In addition to the mental health community, senators and congresspeople from both parties have expressed concern about Trump’s mental health. Whether they are right or not has enormous implications. “I genuinely do not think this is a mentally healthy president.” — Eliot Cohen, US State Department under George W. Bush Decoding Donald Trump’s Mental Condition Malignant Narcissism, according to John D. Gartner, one of the country’s top psychologists, is basically a combination of three mental illnesses — Anti-social Personality Disorder, Paranoid Personality Disorder, and Narcissistic Personality Disorder — plus sadism, or the enjoyment of inflicting pain. “The concept was developed by a famed psychologist named Erich Fromm, who escaped Nazi Germany, as a way to describe evil,” Gartner says. “He used it to describe Hitler.” That’s pretty scary. And unfortunately, the assertion that Trump has it is not something that can be chalked up to politics. “Even though I disagree with everything he stands for, I would be immensely relieved to have a president Pence. He’s conservative; he’s not crazy,” Gartner told me. Paul Ryan? He’d be great, too. “Martin Luther King famously said the arc of history is long, but it bends towards justice. If we hit a traffic jam on the way to social progress, we’ll still get there,” Gartner said. “But if we’re all dead from a nuclear war, we won’t.” Which is exactly what someone with Malignant Narcissism might start. Gartner, who taught personality disorders at Johns Hopkins University for 28 years and explained Bill Clinton’s mental issues in the book In Search of Bill Clinton: A Psychological Biography, says Trump’s illness might be called “Dictator Personality Disorder.” Malignant Narcissism often coincides with mild mania — the ability to consistently stay up all night obsessing on a project — which helps sufferers achieve high career status despite their cruel tendencies. Trump exhibits this, too. “I’ve been a specialist in personality disorders for 35 years,” Gartner says. “Trump is the most severe case I’ve seen in my career.” The DSM is clear about what constitutes the three personality disorders that add up to Malignant Narcissism. Here they are broken down: Now let’s take a look at Donald Trump’s behavior — from the public record — against the criteria: Antisocial Personality Disorder Trump exhibits 6 of the 7 of the traits of Antisocial Personality Disorder. You only need to have 3 to be given the diagnosis: Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder Failure to conform to social norms with respect to lawful behaviors Trump consistently qualifies for this one. Here’s an abridged list: This list goes on, but the above are plenty enough to check this box. Deceitfulness: Repeated lying, use of aliases, or conning others for personal profit or pleasure The list of Trump’s public lies is extensive and well-known. Politifact has tracked his public statements and found that Trump says things that are completely and demonstrably false more than he says things that are true or even half-true. His use of aliases is less well-known. Here’s a report, which includes audio, of him pretending to be his own publicist — “John Barron” or “John Miller,” depending on the decade — and bragging about how great he is. See the above Trump University for evidence of one of his business instances of conning others for profit. Impulsivity, or failure to plan ahead According to Pew, most Americans think Trump is too impulsive. Here are a few recent examples: Irritability and aggressiveness Trump’s irritability is well documented. He’s proud of his aggressiveness (he even has a book called Time To Get Tough), which we repeatedly see in his debates, interviews, and tweets that he calls “smackdowns.” He encouraged his followers to be aggressive and violent during his campaign. And most recently from the White House: Trump treats his staff badly. Here’s a list of 23 aggressive things he’s said in recent memory. Reckless disregard for safety of self or others This one there’s not much (clinical) evidence of so far. Consistent irresponsibility, as indicated by repeated failure to sustain consistent work behavior or honor financial obligations Trump’s having not honored his financial obligations is well documented. Here’s a recent report on the hundreds of contractors and workers he ripped off as a hotel developer. He’s declared bankruptcy six times and walked away from his debts over and over. The list of his failed business ventures is extensive due to inconsistent management behavior. His work behavior as president and a candidate before that has been inconsistent. During the campaign, he switched to “acting presidential” several times and could only keep it up for a few days at a time. Lack of remorse, or being indifferent to or rationalizing having hurt, mistreated, or stolen from another Trump’s 8 books are full of insults toward everyone from models to celebrities to random private citizens. He relishes tearing people down on Twitter, and refused to apologize for insulting the parents of a dead U.S. soldier, or to the black community for his racist campaign against Barack Obama’s citizenship. In fact, here’s a list that Mashable put together of all the times Trump refused to apologize for things. Paranoid Personality Disorder Trump exhibits at least 5 out of the 7 qualifications for Paranoid Personality Disorder. Only 4 are needed for a diagnosis: Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder Suspects that others are exploiting, harming, or deceiving him During his presidential campaign, Trump repeatedly accused the media of being biased against him. He claimed, with no evidence, that the election was going to be rigged against him. Since then, he’s accused the parks department, Republicans, and the intelligence community of trying to tear him, his daughter, and the validity of his election down. He made up a story that 3–5 million people illegally voted against him. These accusations have proven to be overblown or bogus. Preoccupied with doubts about the loyalty of friends or associates It’s hard to get Trump’s trust, and easy to get him to fire you for perceived disloyalty. He doesn’t trust his staff, except for a few in the inner circle. He doesn’t trust the intelligence agents who work for him. Federal workers don’t trust him to not spy on them. And it didn’t look like he trusted his wife to vote for him: How much this preoccupies him is hard to say. But Trump is reported to be as paranoid in this area as Nixon, who was quite paranoid. Reluctant to confide in others Trump is mostly paranoid of people he sees as outside of his circle of trust. He’s keeping top officials out of his inner circle and elevating a few loyalists to lofty places. But he has a close circle of confidants that he shares information with (Bannon, Conway, Kushner, etc.). So it would be hard to conclude that he qualifies for this one. Reads hidden demeaning or threatening meanings into benign remarks or events Trump believes in various conspiracy theories based on vague information from tiny corners of the Internet (falsehoods like Barack Obama’s not being born in the US, Hilary Clinton using performance-enhancing drugs for the debates, Ted Cruz’s father assassinating JFK, etc.), which is the definition of finding hidden meanings in benign events. His favorite writer is conspiracy theorist Alex Jones, who among other things helped get the “9/11 was an inside job” conspiracy theory going. Additionally, his overreactions to the petty — like Sean Spicer being played by a woman on SNL or the size of his inauguration crowd — betray a paranoia of anything he perceives as a threat to his image. The classic case of this is his weird defensiveness about the size of his hands. Persistently bears grudges Trump readily admits to this one. “When people treat me unfairly, I don’t let them forget it,” he said. Here’s an abridged list of people and organizations Trump has had public grudges with: His staff had to take his Twitter access away from him in the final days of the election because they worried his obsession with Twitter vengeance might jeopardize the election. As Trump communication aide Omarosa Manigault says, “Mr. Trump has a long memory and we’re keeping a list.” Perceives attacks on his character or reputation and is quick to react angrily or counterattack See the above list of grudges. Trump is infamous for publicly lashing out at people for slights big and small, from Meryl Streep to random blue collar workers. The New York Times put together this handy list of 307 people, places, and things Trump has insulted. Here’s an example of a counterattack for a slight from his own party: Has recurrent suspicions, without justification, regarding fidelity of spouse or sexual partner There’s not enough public information to conclude anything on this one. Narcissistic Personality Disorder This one is perhaps the most obvious and heavily documented. Trump surpasses the minimum of 5, exhibiting at least 9 of the signs: Donald Trump’s diagnostic scorecard for Narcissistic Personality Disorder Grandiose sense of self-importance Exaggerates achievements and talents — check. (Size of election win, size of inauguration crowd, number of jobs saved in Carrier negotiation, and so on.) Expects to be recognized as superior — check. Expects recognition without commensurate achievements — check. Politifact has a whole list of Trump’s such tall tales here. But we’ll let the following quotations by Donald Trump himself clinch this and the next two checkboxes: Preoccupied with fantasies of unlimited success, power, brilliance; Believes he is “special” and unique “Nobody knows more about taxes than I do, maybe in the history of the world.” “No one has more respect for women than me.” “I have the best temperament or certainly one of the best temperaments of anybody that’s ever run for the office of president. Ever.” “Look, I know more about renewables than any human being on earth.” “I’m the best thing that’s ever happened to the Secret Service.” “I write a book called The Art of the Deal, the #1 selling business book of all time.” “Nobody reads the Bible more than me.” “No one has done more for people with disabilities than me.” “I am the least racist person you’ve ever encountered.” “I’m the most successful person ever to run for the presidency, by far. Nobody’s ever been more successful than me.” Requires excessive adoration Trump’s ego-stoking “victory tour,” obsession with ratings before and after entering politics, and fixation on the size of his electoral win, inauguration crowd, and his (false) claim of having received the biggest standing ovation ever easily check this one off. Has a sense of entitlement He certainly grew up with a silver spoon, but it’s unclear how entitled he thinks he is, in the clinical definition. So no check for this one. Interpersonally exploitative This post on Medium by my colleague Brad Hamilton (editor of The Contently Foundation and former investigations editor at New York Post) recounts how Trump exploited several people, including Brad, in order to get publicity for his golf course one time. This type of behavior, to use a regrettable pun, is par for him. Trump’s own books talk a lot about his strategies for exploiting people. Lacks empathy We covered the evidence for this one pretty thoroughly earlier. Trump is not remorseful about his hurting people. He’s dismissive of many people’s pain — even pain he’s caused them — while simultaneously claiming that “no one understands” them better than he does. Often envious of others or believes that others are envious of him Trump’s been jealous of his senior adviser being put on the cover of Time Magazine, his running-mate having a great debate performance, and the fact that Jay-Z and Beyonce performed for Clinton instead of him. And he claims that Republicans are “jealous as hell” that Russian president Vladimir Putin likes him. Arrogant: haughty behaviors or attitudes We’ve now thoroughly established this one. But here are a few more quotes by Mr. Trump that remove any doubt about his arrogrance: “My IQ is one of the highest — and you all know it! Please don’t feel so stupid or insecure; it’s not your fault.” “I think the only difference between me and the other candidates is that I’m more honest and my women are more beautiful.” “All of the women on The Apprentice flirted with me — consciously or unconsciously. That’s to be expected.” “Nobody builds walls better than me, believe me.” From Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder Sadism Trump has been a bully since he was a child. We’ve already gone over some of his well-documented history of relishing humiliating people and groups weaker than himself. This is classic sadism. The court deposition by Trump’s ex-wife, recounted in Harry Hurt’s biography Lost Tycoon, paints a disturbing picture of a sadistic episode where Trump pulls his wife’s hair out and violates her to make himself feel better after a painful surgery: Manipulation Many politicians could be categorized as manipulative. Trump is not a typical politician, but he literally wrote books on manipulation. His history and tactics of manipulation — from his followers to opponents to the media — are well-documented. Use of projection When Trump defends accusations of racism by calling someone else a racist, that’s psychological projection. He does this sort of thing all the time. One of the most surprising moments of Trump’s presidential debates with Hillary Clinton was the time she accused him of being a Russian puppet, and he automatically projected the accusation — with nothing close to evidence — directly back on her: Here’s Donald Trump’s scorecard for Malignant Narcissism: There is no question. Donald Trump suffers from Malignant Narcissism. No other president has come close to this disorder. Manipulation is a common trait among politicians. It’s part of the definition of politics. Bill Clinton could be deceitful. George W. Bush showed some reckless tendencies (DUIs, etc.). Barack Obama could be private and a touch arrogant. But none of them remotely qualify as mentally ill. Trump, on the other hand, over-qualifies. Says Dr. Gartner, “If I wanted to take out the DSM and say, ‘I want to create a Frankenstein monster — I want to create the most dangerous leader that could possibly be imagined — and I had a free hand to mix and match any set of diagnoses and symptoms, I couldn’t improve on Donald Trump.” So what now? We need President Trump to undergo a psychiatric evaluation. If he refuses to do so, that’s bad news. Refusal itself could be validation of his personality disorder. People with personality disorders generally won’t consider that they might not be all right, whereas mentally healthy people will generally want to know if they have a problem. And if Trump can be persuaded to sit down for an objective psychiatric evaluation—not from a doctor under his employ—there’s a high probability that he will be diagnosed with the mental illnesses we’ve discussed. Which will mean that he is not healthy enough to be president. The 25th Amendment of the Constitution says that the vice president and a majority of the president’s cabinet can vote to remove the president for being “unable to discharge the powers and duties of his office.” This was put into place after Kennedy was shot, in case a president becomes too ill, injured, or mentally unwell to perform. Removing Trump would be tough because his cabinet is made of people who he’s chosen himself. There’s no restraining hand to stop him. However, if the cabinet did decide to listen to the psychiatric community and remove Trump, someone with Malignant Narcissism like him would likely not go quietly. With his back to the wall, there’s no way to predict what a sadistic, antisocial, paranoid narcissist in command of special forces, a Twitter army, and nuclear codes will do. But the danger of not removing him is very clear. “We’ve had presidents with psychological disorders,” Gartner points out. Lincoln had depression, after all. “But this is unique. We’re not just talking about mental illness, we’re talking about the worst possible mental illness.” Shane Snow is a journalist, speaker, and entrepreneur in New York City. If you liked this one, check out my recent post on fixing the health care system: Trickle-Down Health Care. ", "title": "Donald Trump and The Definition of Insanity", "sentences": [{"c8df": "Donald Trump and The Definition of Insanity"}, {"0fe8": "58,000 mental health professionals say Donald Trump is too unstable to be president. Here’s a deep dive into the diagnosis and what could happen because of it. (tl;dr here)"}, {"2556": "Albert Einstein is famously quoted: “The definition of insanity is doing the same thing over and over and expecting something to change.”"}, {"a8c1": "This is not, of course, the actual definition of insanity. It also turns out Einstein never said this. It actually comes from an Alcoholics Anonymous pamphlet from the 1980s."}, {"ed4d": "Which is apropos, because nearly 60,000 mental health professionals have diagnosed President Donald Trump with a type of insanity that is often compared to an alcoholic’s lack of honesty and impulse control. Sparked by Change.org petitions by a top former Johns Hopkins professor and a California congresswoman, the psychiatric community has declared that Trump suffers from “Malignant Narcissism.”"}, {"1714": "What is that exactly? Does Trump actually suffer from it? If so, what does that mean? With the help of some concerned psychologists, we’ve broken the answers down."}, {"0194": "Psychologists say that Trump’s condition is a combination of mental disorders that cause one to distort reality and make violent, impulsive decisions. These disorders form, according to the doctor who coined the term Malignant Narcissism in the 1960s, “the most severe pathology and the root of the most vicious destructiveness.” (Full criteria below.)"}, {"59ec": "This is the first time in history that so many mental health professionals have collectively diagnosed a living individual. Their conclusion, based on the hundreds of hours of Trump’s on-camera dialogue and off-the-cuff public speaking, is alarming because it says that our current president is too mentally disturbed to fulfill his office."}, {"b26f": "To be clear: Being a standard deviation or two away from the norm when it comes to one’s psychology does not automatically make a person dangerous, bad, or unable to do a job. Millions of people have depression, anxiety, or mild mania and still function well. Abraham Lincoln went through depression, after all."}, {"897b": "Unfortunately, unlike many other mental disorders, Malignant Narcissism makes its sufferers actively dangerous to other people. It’s more akin to delusional schizophrenia than it is to anxiousness."}, {"416a": "In diagnosing Donald trump, mental health pros are breaking with a decades-old precedent. After Barry Goldwater won a 1969 defamation lawsuit when psychiatrists called him crazy in Fact magazine, the psychiatric community put in place a “Goldwater Rule” in their ethics handbook that forbids diagnosing public figures."}, {"2cfb": "So why are psychologists breaking with tradition now?"}, {"3690": "A big problem during the Goldwater scenario was that there weren’t objective criteria for diagnosing mental health conditions at the time. Therapists used all sorts of jargon and their best judgment—but they were all over the place. Since then, however, the community has put in place official, objective standards in their bible, the Diagnostic and Statistical Manual of Mental Disorders (DSM for short). This makes it possible to unanimously agree on diagnoses."}, {"0248": "The real reason for breaking with the code, however, is principle. Someone in power with Malignant Narcissism is likely to get people killed, and psychologists who know this feel morally obligated to speak up. This has legal precedent in a court case called Tarasoff vs Regents, in which the murder of a woman could have been prevented if the killer’s psychotherapist had warned her or police that the man might kill her. This resulted in The Tarasoff Rule: “When a therapist determines, or pursuant to the standards of his profession, should determine, that his patient presents a serious danger of violence to another, he incurs an obligation to use reasonable care to protect the intended victim against such danger.”"}, {"fbe7": "In Judaism, there is a principle called “Pikuach Nefesh” which says that it’s okay to break a rule in order to save a human life. Many in the mental health community believe that Donald Trump’s psychosis is that kind of a life-or-death situation, and that since he sees no mental health doctor, the Tarasoff Rule should supersede the Goldwater Rule. Thousands of psychologists feel morally justified in this. (And some even are saying it is immoral to not speak up.)"}, {"5d77": "In addition to the mental health community, senators and congresspeople from both parties have expressed concern about Trump’s mental health. Whether they are right or not has enormous implications."}, {"b906": "“I genuinely do not think this is a mentally healthy president.” — Eliot Cohen, US State Department under George W. Bush"}, {"f990": "Decoding Donald Trump’s Mental Condition"}, {"4a7b": "Malignant Narcissism, according to John D. Gartner, one of the country’s top psychologists, is basically a combination of three mental illnesses — Anti-social Personality Disorder, Paranoid Personality Disorder, and Narcissistic Personality Disorder — plus sadism, or the enjoyment of inflicting pain."}, {"2d06": "“The concept was developed by a famed psychologist named Erich Fromm, who escaped Nazi Germany, as a way to describe evil,” Gartner says. “He used it to describe Hitler.”"}, {"aa3a": "That’s pretty scary. And unfortunately, the assertion that Trump has it is not something that can be chalked up to politics."}, {"5cfa": "“Even though I disagree with everything he stands for, I would be immensely relieved to have a president Pence. He’s conservative; he’s not crazy,” Gartner told me. Paul Ryan? He’d be great, too."}, {"f45f": "“Martin Luther King famously said the arc of history is long, but it bends towards justice. If we hit a traffic jam on the way to social progress, we’ll still get there,” Gartner said. “But if we’re all dead from a nuclear war, we won’t.”"}, {"1b28": "Which is exactly what someone with Malignant Narcissism might start."}, {"37b2": "Gartner, who taught personality disorders at Johns Hopkins University for 28 years and explained Bill Clinton’s mental issues in the book In Search of Bill Clinton: A Psychological Biography, says Trump’s illness might be called “Dictator Personality Disorder.” Malignant Narcissism often coincides with mild mania — the ability to consistently stay up all night obsessing on a project — which helps sufferers achieve high career status despite their cruel tendencies. Trump exhibits this, too."}, {"4ad9": "“I’ve been a specialist in personality disorders for 35 years,” Gartner says. “Trump is the most severe case I’ve seen in my career.”"}, {"f64f": "The DSM is clear about what constitutes the three personality disorders that add up to Malignant Narcissism. Here they are broken down:"}, {"5827": "Now let’s take a look at Donald Trump’s behavior — from the public record — against the criteria:"}, {"3773": "Antisocial Personality Disorder"}, {"c9d1": "Trump exhibits 6 of the 7 of the traits of Antisocial Personality Disorder. You only need to have 3 to be given the diagnosis:"}, {"f02e": "Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder"}, {"5837": "Failure to conform to social norms with respect to lawful behaviors"}, {"5b41": "Trump consistently qualifies for this one. Here’s an abridged list:"}, {"8e21": "This list goes on, but the above are plenty enough to check this box."}, {"6376": "Deceitfulness: Repeated lying, use of aliases, or conning others for personal profit or pleasure"}, {"45a9": "The list of Trump’s public lies is extensive and well-known. Politifact has tracked his public statements and found that Trump says things that are completely and demonstrably false more than he says things that are true or even half-true."}, {"fc73": "His use of aliases is less well-known. Here’s a report, which includes audio, of him pretending to be his own publicist — “John Barron” or “John Miller,” depending on the decade — and bragging about how great he is."}, {"e6dc": "See the above Trump University for evidence of one of his business instances of conning others for profit."}, {"3bce": "Impulsivity, or failure to plan ahead"}, {"7745": "According to Pew, most Americans think Trump is too impulsive. Here are a few recent examples:"}, {"3fbd": "Irritability and aggressiveness"}, {"0060": "Trump’s irritability is well documented. He’s proud of his aggressiveness (he even has a book called Time To Get Tough), which we repeatedly see in his debates, interviews, and tweets that he calls “smackdowns.”"}, {"7534": "He encouraged his followers to be aggressive and violent during his campaign. And most recently from the White House: Trump treats his staff badly. Here’s a list of 23 aggressive things he’s said in recent memory."}, {"acc2": "Reckless disregard for safety of self or others"}, {"6e60": "This one there’s not much (clinical) evidence of so far."}, {"10fe": "Consistent irresponsibility, as indicated by repeated failure to sustain consistent work behavior or honor financial obligations"}, {"0a8b": "Trump’s having not honored his financial obligations is well documented. Here’s a recent report on the hundreds of contractors and workers he ripped off as a hotel developer. He’s declared bankruptcy six times and walked away from his debts over and over. The list of his failed business ventures is extensive due to inconsistent management behavior."}, {"1f55": "His work behavior as president and a candidate before that has been inconsistent. During the campaign, he switched to “acting presidential” several times and could only keep it up for a few days at a time."}, {"f947": "Lack of remorse, or being indifferent to or rationalizing having hurt, mistreated, or stolen from another"}, {"70ac": "Trump’s 8 books are full of insults toward everyone from models to celebrities to random private citizens. He relishes tearing people down on Twitter, and refused to apologize for insulting the parents of a dead U.S. soldier, or to the black community for his racist campaign against Barack Obama’s citizenship. In fact, here’s a list that Mashable put together of all the times Trump refused to apologize for things."}, {"8ab7": "Paranoid Personality Disorder"}, {"8394": "Trump exhibits at least 5 out of the 7 qualifications for Paranoid Personality Disorder. Only 4 are needed for a diagnosis:"}, {"bb89": "Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder"}, {"51c4": "Suspects that others are exploiting, harming, or deceiving him"}, {"4327": "During his presidential campaign, Trump repeatedly accused the media of being biased against him. He claimed, with no evidence, that the election was going to be rigged against him."}, {"e959": "Since then, he’s accused the parks department, Republicans, and the intelligence community of trying to tear him, his daughter, and the validity of his election down. He made up a story that 3–5 million people illegally voted against him."}, {"6abe": "These accusations have proven to be overblown or bogus."}, {"4ad2": "Preoccupied with doubts about the loyalty of friends or associates"}, {"801d": "It’s hard to get Trump’s trust, and easy to get him to fire you for perceived disloyalty. He doesn’t trust his staff, except for a few in the inner circle. He doesn’t trust the intelligence agents who work for him. Federal workers don’t trust him to not spy on them. And it didn’t look like he trusted his wife to vote for him:"}, {"0ad9": "How much this preoccupies him is hard to say. But Trump is reported to be as paranoid in this area as Nixon, who was quite paranoid."}, {"eda9": "Reluctant to confide in others"}, {"addc": "Trump is mostly paranoid of people he sees as outside of his circle of trust. He’s keeping top officials out of his inner circle and elevating a few loyalists to lofty places. But he has a close circle of confidants that he shares information with (Bannon, Conway, Kushner, etc.). So it would be hard to conclude that he qualifies for this one."}, {"3d3f": "Reads hidden demeaning or threatening meanings into benign remarks or events"}, {"5113": "Trump believes in various conspiracy theories based on vague information from tiny corners of the Internet (falsehoods like Barack Obama’s not being born in the US, Hilary Clinton using performance-enhancing drugs for the debates, Ted Cruz’s father assassinating JFK, etc.), which is the definition of finding hidden meanings in benign events. His favorite writer is conspiracy theorist Alex Jones, who among other things helped get the “9/11 was an inside job” conspiracy theory going."}, {"24ec": "Additionally, his overreactions to the petty — like Sean Spicer being played by a woman on SNL or the size of his inauguration crowd — betray a paranoia of anything he perceives as a threat to his image. The classic case of this is his weird defensiveness about the size of his hands."}, {"7a68": "Persistently bears grudges"}, {"7c21": "Trump readily admits to this one. “When people treat me unfairly, I don’t let them forget it,” he said. Here’s an abridged list of people and organizations Trump has had public grudges with:"}, {"4bc1": "His staff had to take his Twitter access away from him in the final days of the election because they worried his obsession with Twitter vengeance might jeopardize the election. As Trump communication aide Omarosa Manigault says, “Mr. Trump has a long memory and we’re keeping a list.”"}, {"c3a5": "Perceives attacks on his character or reputation and is quick to react angrily or counterattack"}, {"0811": "See the above list of grudges. Trump is infamous for publicly lashing out at people for slights big and small, from Meryl Streep to random blue collar workers. The New York Times put together this handy list of 307 people, places, and things Trump has insulted."}, {"e328": "Here’s an example of a counterattack for a slight from his own party:"}, {"d279": "Has recurrent suspicions, without justification, regarding fidelity of spouse or sexual partner"}, {"0b18": "There’s not enough public information to conclude anything on this one."}, {"c4e6": "Narcissistic Personality Disorder"}, {"2ec2": "This one is perhaps the most obvious and heavily documented. Trump surpasses the minimum of 5, exhibiting at least 9 of the signs:"}, {"29ae": "Donald Trump’s diagnostic scorecard for Narcissistic Personality Disorder"}, {"0846": "Grandiose sense of self-importance"}, {"d9ba": "Exaggerates achievements and talents — check. (Size of election win, size of inauguration crowd, number of jobs saved in Carrier negotiation, and so on.)"}, {"b155": "Expects to be recognized as superior — check. Expects recognition without commensurate achievements — check."}, {"e32b": "Politifact has a whole list of Trump’s such tall tales here. But we’ll let the following quotations by Donald Trump himself clinch this and the next two checkboxes:"}, {"7d0e": "Preoccupied with fantasies of unlimited success, power, brilliance; Believes he is “special” and unique"}, {"fcf4": "“Nobody knows more about taxes than I do, maybe in the history of the world.”"}, {"9ce4": "“No one has more respect for women than me.”"}, {"4d8e": "“I have the best temperament or certainly one of the best temperaments of anybody that’s ever run for the office of president. Ever.”"}, {"03cd": "“Look, I know more about renewables than any human being on earth.”"}, {"d4e3": "“I’m the best thing that’s ever happened to the Secret Service.”"}, {"b682": "“I write a book called The Art of the Deal, the #1 selling business book of all time.”"}, {"cb0c": "“Nobody reads the Bible more than me.”"}, {"c2aa": "“No one has done more for people with disabilities than me.”"}, {"16b5": "“I am the least racist person you’ve ever encountered.”"}, {"088f": "“I’m the most successful person ever to run for the presidency, by far. Nobody’s ever been more successful than me.”"}, {"250d": "Requires excessive adoration"}, {"4fe0": "Trump’s ego-stoking “victory tour,” obsession with ratings before and after entering politics, and fixation on the size of his electoral win, inauguration crowd, and his (false) claim of having received the biggest standing ovation ever easily check this one off."}, {"a770": "Has a sense of entitlement"}, {"2cf1": "He certainly grew up with a silver spoon, but it’s unclear how entitled he thinks he is, in the clinical definition. So no check for this one."}, {"7a7b": "Interpersonally exploitative"}, {"8793": "This post on Medium by my colleague Brad Hamilton (editor of The Contently Foundation and former investigations editor at New York Post) recounts how Trump exploited several people, including Brad, in order to get publicity for his golf course one time. This type of behavior, to use a regrettable pun, is par for him. Trump’s own books talk a lot about his strategies for exploiting people."}, {"eec0": "Lacks empathy"}, {"91fe": "We covered the evidence for this one pretty thoroughly earlier. Trump is not remorseful about his hurting people. He’s dismissive of many people’s pain — even pain he’s caused them — while simultaneously claiming that “no one understands” them better than he does."}, {"29d5": "Often envious of others or believes that others are envious of him"}, {"5f40": "Trump’s been jealous of his senior adviser being put on the cover of Time Magazine, his running-mate having a great debate performance, and the fact that Jay-Z and Beyonce performed for Clinton instead of him. And he claims that Republicans are “jealous as hell” that Russian president Vladimir Putin likes him."}, {"4fa3": "Arrogant: haughty behaviors or attitudes"}, {"c541": "We’ve now thoroughly established this one. But here are a few more quotes by Mr. Trump that remove any doubt about his arrogrance:"}, {"c335": "“My IQ is one of the highest — and you all know it! Please don’t feel so stupid or insecure; it’s not your fault.”"}, {"d50a": "“I think the only difference between me and the other candidates is that I’m more honest and my women are more beautiful.”"}, {"c87d": "“All of the women on The Apprentice flirted with me — consciously or unconsciously. That’s to be expected.”"}, {"813f": "“Nobody builds walls better than me, believe me.”"}, {"8d88": "From Donald Trump’s diagnostic scorecard for Antisocial Personality Disorder"}, {"1004": "Sadism"}, {"1882": "Trump has been a bully since he was a child. We’ve already gone over some of his well-documented history of relishing humiliating people and groups weaker than himself. This is classic sadism."}, {"f208": "The court deposition by Trump’s ex-wife, recounted in Harry Hurt’s biography Lost Tycoon, paints a disturbing picture of a sadistic episode where Trump pulls his wife’s hair out and violates her to make himself feel better after a painful surgery:"}, {"ec7b": "Manipulation"}, {"db5b": "Many politicians could be categorized as manipulative. Trump is not a typical politician, but he literally wrote books on manipulation. His history and tactics of manipulation — from his followers to opponents to the media — are well-documented."}, {"30df": "Use of projection"}, {"33a2": "When Trump defends accusations of racism by calling someone else a racist, that’s psychological projection. He does this sort of thing all the time. One of the most surprising moments of Trump’s presidential debates with Hillary Clinton was the time she accused him of being a Russian puppet, and he automatically projected the accusation — with nothing close to evidence — directly back on her:"}, {"e307": "Here’s Donald Trump’s scorecard for Malignant Narcissism:"}, {"e7df": "There is no question. Donald Trump suffers from Malignant Narcissism."}, {"b31b": "No other president has come close to this disorder. Manipulation is a common trait among politicians. It’s part of the definition of politics. Bill Clinton could be deceitful. George W. Bush showed some reckless tendencies (DUIs, etc.). Barack Obama could be private and a touch arrogant. But none of them remotely qualify as mentally ill."}, {"8191": "Trump, on the other hand, over-qualifies. Says Dr. Gartner,"}, {"4007": "“If I wanted to take out the DSM and say, ‘I want to create a Frankenstein monster — I want to create the most dangerous leader that could possibly be imagined — and I had a free hand to mix and match any set of diagnoses and symptoms, I couldn’t improve on Donald Trump.”"}, {"902b": "So what now?"}, {"9649": "We need President Trump to undergo a psychiatric evaluation. If he refuses to do so, that’s bad news. Refusal itself could be validation of his personality disorder. People with personality disorders generally won’t consider that they might not be all right, whereas mentally healthy people will generally want to know if they have a problem."}, {"2b11": "And if Trump can be persuaded to sit down for an objective psychiatric evaluation—not from a doctor under his employ—there’s a high probability that he will be diagnosed with the mental illnesses we’ve discussed. Which will mean that he is not healthy enough to be president."}, {"46f7": "The 25th Amendment of the Constitution says that the vice president and a majority of the president’s cabinet can vote to remove the president for being “unable to discharge the powers and duties of his office.” This was put into place after Kennedy was shot, in case a president becomes too ill, injured, or mentally unwell to perform."}, {"74e6": "Removing Trump would be tough because his cabinet is made of people who he’s chosen himself. There’s no restraining hand to stop him."}, {"89d6": "However, if the cabinet did decide to listen to the psychiatric community and remove Trump, someone with Malignant Narcissism like him would likely not go quietly. With his back to the wall, there’s no way to predict what a sadistic, antisocial, paranoid narcissist in command of special forces, a Twitter army, and nuclear codes will do."}, {"23de": "But the danger of not removing him is very clear. “We’ve had presidents with psychological disorders,” Gartner points out. Lincoln had depression, after all. “But this is unique. We’re not just talking about mental illness, we’re talking about the worst possible mental illness.”"}, {"5b96": "Shane Snow is a journalist, speaker, and entrepreneur in New York City."}, {"fd81": "If you liked this one, check out my recent post on fixing the health care system: Trickle-Down Health Care."}], "child": "1383_1\t1383_2\t1383_3\t1383_4\t1383_5\t1383_6\t1383_7\t1383_8\t1383_9\t1383_10\t1383_11\t1383_12\t1383_13\t1383_14\t1383_15\t1383_16\t1383_17\t1383_18\t1383_19\t1383_20\t1383_21\t1383_22\t1383_23\t1383_24\t1383_251383_1\t1383_2\t1383_3\t1383_4\t1383_5\t1383_6\t1383_7\t1383_8\t1383_9\t1383_10\t1383_11\t1383_12\t1383_13\t1383_14\t1383_15\t1383_16\t1383_17\t1383_18\t1383_19\t1383_20\t1383_21\t1383_22\t1383_23\t1383_24\t1383_25"}