{"name": "1389", "parent": "", "content": "Back to the Rulebook, Americans. “Da Rules” from the Fairly Odd Movie. Look, Americans, it’s time to get over ourselves. No more liberals “trolling” Trump supporters or Trump supporters “shutting down” liberals. No more unjustified righteous indignation. No more scapegoating. No more self-perpetuating bubbles of agreement where no progress is made. No more hating people based on labels we arbitrarily assign to them. No. More. I, like many, have been disgusted by what “the other side” has been producing in terms of half-truths and slanted perspectives. But as time goes on and people get more angry and more frustrated, it become easier to see that both “sides” are becoming equally guilty of these errors. And let me clarify that I am talking about people outside of the government itself at this point. I am talking about “the common man.” I don’t want to step into the discussion of what The White House or POTUS or The Supreme Court are doing in this article, but instead focus on the citizens. I am also not talking about media organizations directly, because with such organizations there is a question of motive. So let us assume that we are talking about people who legitimately want to know the “truth” and promote what they believe to be right. We need to be critical consumers and producers of information. In the end, this all comes back down to logical arguments. Unfortunately, Americans are proving to be wholly incompetent when it comes to having such arguments. So let’s review some basic do’s and don’ts of logical argument. I am relying on Anthony Weston’s “A Rulebook for Arguments” for this list, using the headings he uses in his chapters. If you haven’t read the book, I highly recommend it. DO’s: Weston goes on to describe the basic forms of argument, but we won’t go into that here. What about the DON’Ts? We call those “logical fallacies.” This is where the real fun begins. DON’Ts: Regardless of your political slant, you can no doubt find examples of how “the other side” has used any of the 18 fallacies above to try and win an argument. But I want you to work a little harder and see how people whose views align with your own have also used these fallacies. Once you can do that, you are one step closer to being able to recognize when you do it in your own arguments. Thus endeth today’s lesson. ", "title": "Back to the Rulebook, Americans.", "sentences": [{"f44b": "Back to the Rulebook, Americans."}, {"f6a4": "“Da Rules” from the Fairly Odd Movie."}, {"b122": "Look, Americans, it’s time to get over ourselves."}, {"1293": "No more liberals “trolling” Trump supporters or Trump supporters “shutting down” liberals. No more unjustified righteous indignation. No more scapegoating. No more self-perpetuating bubbles of agreement where no progress is made. No more hating people based on labels we arbitrarily assign to them."}, {"7908": "No. More."}, {"4e84": "I, like many, have been disgusted by what “the other side” has been producing in terms of half-truths and slanted perspectives. But as time goes on and people get more angry and more frustrated, it become easier to see that both “sides” are becoming equally guilty of these errors."}, {"9e84": "And let me clarify that I am talking about people outside of the government itself at this point. I am talking about “the common man.” I don’t want to step into the discussion of what The White House or POTUS or The Supreme Court are doing in this article, but instead focus on the citizens. I am also not talking about media organizations directly, because with such organizations there is a question of motive. So let us assume that we are talking about people who legitimately want to know the “truth” and promote what they believe to be right."}, {"1544": "We need to be critical consumers and producers of information. In the end, this all comes back down to logical arguments. Unfortunately, Americans are proving to be wholly incompetent when it comes to having such arguments."}, {"42d8": "So let’s review some basic do’s and don’ts of logical argument. I am relying on Anthony Weston’s “A Rulebook for Arguments” for this list, using the headings he uses in his chapters. If you haven’t read the book, I highly recommend it."}, {"d3a2": "DO’s:"}, {"e6f8": "Weston goes on to describe the basic forms of argument, but we won’t go into that here."}, {"5284": "What about the DON’Ts? We call those “logical fallacies.” This is where the real fun begins."}, {"c507": "DON’Ts:"}, {"7ddc": "Regardless of your political slant, you can no doubt find examples of how “the other side” has used any of the 18 fallacies above to try and win an argument. But I want you to work a little harder and see how people whose views align with your own have also used these fallacies. Once you can do that, you are one step closer to being able to recognize when you do it in your own arguments."}, {"d64d": "Thus endeth today’s lesson."}], "child": "1389_1\t1389_2"}