{"name": "139", "parent": "", "content": "MVP So Far: Connor McDavid Connor McDavid. Image via Twitter We’ve reached the midway point of the NHL season, and there have been some great story lines so far. One of the most interesting has been the discussion surrounding who is most deserving of MVP consideration. As it stands, it seems there are at least two favorites. Even if some people don’t want to hear another option other than Sidney Crosby, the truth is that 20-year-old Connor McDavid is absolutely worthy of consideration. I will preface this by saying that Crosby is very much a part of the discussion because of his outstanding performance this year. He leads the NHL in a plethora of scoring categories, including goals and goals per game. He is healthy and has enhanced the play of the guys around him, which has put the Penguins in great position to defend their title. What’s not to like about Crosby’s performance thus far? But young Connor McDavid remains a part of the conversation with his performance so far as well, and with good reason. McDavid leads the league in points at 54 through 47 games and though Crosby has had a better average, there is more to this discussion than numbers. McDavid truly is the player most valuable to his team, and here’s why. Skills McDavid has shown blistering speed and silky smooth hands in what is actually his first full season in the NHL (barring injury). The numbers have reflected the incredible skill we see on the ice. As of January 18, McDavid leads the league in points and assists per game, as well as the individual stats themselves. McDavid has shown consistency in this area as he has maintained a similar output through the same number of games as he had a season ago, which is impressive for someone so young. We saw amazing highlight reels during the NHL Draft and knew the type of player we should expect to see, but it’s hard to know which players will assimilate to the NHL style. McDavid has proven that he can adapt and has quickly become one of the most prolific players in the game right now. It’s easy to see this level of skill. “McSavior” is easily one of the fastest skaters in the game and is just plain exciting to watch. His skills spoke for themselves before the draft last year and continue to prove that the Oilers have the best young player in the game. Leadership Prior to the start of the season, Connor McDavid was named the captain of the Edmonton Oilers, becoming the youngest player in the history of the sport to gain that honor. While a title that has previously been given to Oilers greats like Wayne Gretzky and Ryan Smyth carries a ton of weight, the teenage captain has taken it in stride. His numbers have remained steadily consistent and he paces the league in points scored. Beyond that, and perhaps most importantly, McDavid leaves his flashiness on the ice. Following in the footsteps of people like Crosby, young Connor has maintained his professionalism and stayed in the headlines for only the right reasons, something players twice his age haven’t always been able to do. McDavid has proven that he deserves the honor and has carried himself like a captain this season. Without a doubt, the best mark of this is the way he improves the players around him, which he has done with adept playmaking. Perhaps the most obvious display of this is in the success of his linemate Patrick Maroon. Maroon has already blown away his previous career high in goals, having amassed 18 so far. With McDavid on his flank, even a mediocre player like Patrick Maroon has found a way to be a positive contributor. Captain Connor also holds Corsi and Fenwick percentages of over 56 each, a robust number for any player, but especially a player so young. He has enabled his team to control the puck more and generate more scoring chances, regardless of whether he’s the one scoring the goals or not. These numbers are even higher than Crosby’s despite the fact that Pittsburgh, as a team, generates higher possession stats than Edmonton. McDavid is leading his team in more ways than one. Impact Perhaps McDavid’s most important quality is the impact he’s had on his team and on the franchise overall. His impact this season through his skill and leadership are one thing. But of the four first-overall picks the team has had since 2010, he’s the only one who has seemed completely untouchable. Hall and Yakupov are gone. While Ryan Nugent-Hopkins continues to play in Edmonton, his name has resurfaced time and again in trade talks. Yet there has never been any doubt about McDavid. They’ve fully backed this young man, and so far it’s paying off. McDavid’s ability to turn this franchise around says even more about his greatness. Since Peter Chiarelli became the GM of this team, a lot of significant changes have occurred. Most notable was the trade of Taylor Hall to the Devils this off-season for Adam Larsson. The Oilers also traded Yakupov to free up cap space. With this new monetary flexibility, Chiarelli was able to sign Kris Russell and Milan Lucic, who distinctly named one reason for joining Edmonton: The McDavid Factor. Lucic: It basically came down to the McDavid factor - Sportsnet.caNewest Oiler Milan Lucic says the deciding factor to sign was Connor McDavid, but also says he's ready to provide the…www.sportsnet.ca Despite the fact that Edmonton has been a team at the bottom of the conference for years, the attraction of playing alongside a phenom like Connor McDavid has attracted some of the league’s most desirable free agents to play for the Oilers. The result? The Oilers are second in their division and are in the playoff hunt later than they have been in years. The McDavid Factor is real. It may be debatable, but Connor McDavid should be considered a front-runner for MVP. It’s important to remember that this is not a career award, because surely that would eliminate McDavid from contention. Rather, it is an award for the player most valuable this season. Previous accolades don’t matter in determining the winner in this case. Plus, McDavid’s youth is an argument in his favor. To be able to find this level of consistency and dominance at only 20 years old is more than just a little impressive. Sure, Crosby has been doing it longer. But McDavid is doing it now, right out of the gate, and less than 100 games into his career. Crosby needed no previous résumé when he won his first awards, and neither does McDavid. Yes, my friends. The McDavid Factor is very, very real. The Hart Memorial Trophy is given to “the player judged to be most valuable to his team.” That player is Connor McDavid. ", "title": "MVP So Far: Connor McDavid", "sentences": [{"4244": "MVP So Far: Connor McDavid"}, {"9ad5": "Connor McDavid. Image via Twitter"}, {"c39b": "We’ve reached the midway point of the NHL season, and there have been some great story lines so far. One of the most interesting has been the discussion surrounding who is most deserving of MVP consideration. As it stands, it seems there are at least two favorites. Even if some people don’t want to hear another option other than Sidney Crosby, the truth is that 20-year-old Connor McDavid is absolutely worthy of consideration."}, {"5755": "I will preface this by saying that Crosby is very much a part of the discussion because of his outstanding performance this year. He leads the NHL in a plethora of scoring categories, including goals and goals per game. He is healthy and has enhanced the play of the guys around him, which has put the Penguins in great position to defend their title. What’s not to like about Crosby’s performance thus far?"}, {"2c3e": "But young Connor McDavid remains a part of the conversation with his performance so far as well, and with good reason. McDavid leads the league in points at 54 through 47 games and though Crosby has had a better average, there is more to this discussion than numbers. McDavid truly is the player most valuable to his team, and here’s why."}, {"9421": "Skills"}, {"5d30": "McDavid has shown blistering speed and silky smooth hands in what is actually his first full season in the NHL (barring injury). The numbers have reflected the incredible skill we see on the ice. As of January 18, McDavid leads the league in points and assists per game, as well as the individual stats themselves. McDavid has shown consistency in this area as he has maintained a similar output through the same number of games as he had a season ago, which is impressive for someone so young. We saw amazing highlight reels during the NHL Draft and knew the type of player we should expect to see, but it’s hard to know which players will assimilate to the NHL style. McDavid has proven that he can adapt and has quickly become one of the most prolific players in the game right now."}, {"b27b": "It’s easy to see this level of skill. “McSavior” is easily one of the fastest skaters in the game and is just plain exciting to watch. His skills spoke for themselves before the draft last year and continue to prove that the Oilers have the best young player in the game."}, {"6489": "Leadership"}, {"f67a": "Prior to the start of the season, Connor McDavid was named the captain of the Edmonton Oilers, becoming the youngest player in the history of the sport to gain that honor. While a title that has previously been given to Oilers greats like Wayne Gretzky and Ryan Smyth carries a ton of weight, the teenage captain has taken it in stride. His numbers have remained steadily consistent and he paces the league in points scored. Beyond that, and perhaps most importantly, McDavid leaves his flashiness on the ice. Following in the footsteps of people like Crosby, young Connor has maintained his professionalism and stayed in the headlines for only the right reasons, something players twice his age haven’t always been able to do. McDavid has proven that he deserves the honor and has carried himself like a captain this season."}, {"8bd5": "Without a doubt, the best mark of this is the way he improves the players around him, which he has done with adept playmaking. Perhaps the most obvious display of this is in the success of his linemate Patrick Maroon. Maroon has already blown away his previous career high in goals, having amassed 18 so far. With McDavid on his flank, even a mediocre player like Patrick Maroon has found a way to be a positive contributor. Captain Connor also holds Corsi and Fenwick percentages of over 56 each, a robust number for any player, but especially a player so young. He has enabled his team to control the puck more and generate more scoring chances, regardless of whether he’s the one scoring the goals or not. These numbers are even higher than Crosby’s despite the fact that Pittsburgh, as a team, generates higher possession stats than Edmonton. McDavid is leading his team in more ways than one."}, {"7ed2": "Impact"}, {"8fa3": "Perhaps McDavid’s most important quality is the impact he’s had on his team and on the franchise overall. His impact this season through his skill and leadership are one thing. But of the four first-overall picks the team has had since 2010, he’s the only one who has seemed completely untouchable. Hall and Yakupov are gone. While Ryan Nugent-Hopkins continues to play in Edmonton, his name has resurfaced time and again in trade talks. Yet there has never been any doubt about McDavid. They’ve fully backed this young man, and so far it’s paying off. McDavid’s ability to turn this franchise around says even more about his greatness."}, {"4bec": "Since Peter Chiarelli became the GM of this team, a lot of significant changes have occurred. Most notable was the trade of Taylor Hall to the Devils this off-season for Adam Larsson. The Oilers also traded Yakupov to free up cap space. With this new monetary flexibility, Chiarelli was able to sign Kris Russell and Milan Lucic, who distinctly named one reason for joining Edmonton: The McDavid Factor."}, {"8364": "Lucic: It basically came down to the McDavid factor - Sportsnet.caNewest Oiler Milan Lucic says the deciding factor to sign was Connor McDavid, but also says he's ready to provide the…www.sportsnet.ca"}, {"83b6": "Despite the fact that Edmonton has been a team at the bottom of the conference for years, the attraction of playing alongside a phenom like Connor McDavid has attracted some of the league’s most desirable free agents to play for the Oilers. The result? The Oilers are second in their division and are in the playoff hunt later than they have been in years. The McDavid Factor is real."}, {"79be": "It may be debatable, but Connor McDavid should be considered a front-runner for MVP. It’s important to remember that this is not a career award, because surely that would eliminate McDavid from contention. Rather, it is an award for the player most valuable this season. Previous accolades don’t matter in determining the winner in this case. Plus, McDavid’s youth is an argument in his favor. To be able to find this level of consistency and dominance at only 20 years old is more than just a little impressive. Sure, Crosby has been doing it longer. But McDavid is doing it now, right out of the gate, and less than 100 games into his career. Crosby needed no previous résumé when he won his first awards, and neither does McDavid."}, {"1c54": "Yes, my friends. The McDavid Factor is very, very real. The Hart Memorial Trophy is given to “the player judged to be most valuable to his team.” That player is Connor McDavid."}], "child": "139_1"}