{"name": "1390", "parent": "", "content": "Porque eu larguei a comunicação Talvez o texto mais difícil de escrever (pra mim né). Já faz uns 3 meses que eu escolhi sair da minha “agência de propaganda” e tô dirigindo pro Uber desde então. Vou resumir minha carreira ao máximo e logo vou pra parte que eu reclamo. Se não quiser ler a minha biografia, vai rolando até tu ler “PARA AQUI” um pouco maior. Vai ser fácil de achar. Quando eu tinha 15 anos, ainda no Ensino Médio, eu consegui um estágio trabalhando com Social Media. Bem no início do boom. Aí, quando eu tinha 17 recém-feitos entrei pra uma agência “grande” como Assistente de Redação. Logo ganhei um prêmio de melhor redator numa competição da faculdade. Aí fui promovido e ganhei um setor de comunicação online quase só pra mim. Nessa aí eu e meu dupla ganhamos Colunistas e entramos pro Anuário da ARP. PREMIOS NEAM CARA Respira. Aí uns 6 meses depois consegui ir pra uma agência BEM grande do RS, trabalhando com um cliente GIGANTESCO (worldwide shit). Aí logo recebi proposta pra voltar pra agência “grande”. Ali, com 2o anos, virei Gerente de Conteúdo. 3 meses como gerente e fui pra uma multinacional atrás de uma promessa que acabou não decolando. No fim da caminhada na multinacional, abri uma empresa que ia trabalhar com Marketing Político nas eleições municipais de 2016. Deu tudo certo. Elegemos todos nossos clientes importantes. Um deles, candidato a prefeito, começou a campanha com 3% e foi eleito com 41%. PARA AQUI — FIM DA BIOGRAFIA Eu decidi sair “da comunicação” logo depois disso. Recusei empregos de agências, freelas de conteúdo, freelas de marketing. Tudo. Não faço mais. Honestamente, eu larguei porque cansei do teatro. Quando eu tava dentro de agência, o cliente parecia cagar pro meu trampo. O cliente queria saber do negócio dele. Pra ele se não convertia em número imediatamente, não valia. Pra ele ou tinha que ser “legal” ou tinha que “funcionar”. Mas nenhuma das duas palavras traduzia. O que é legal pra ti? Não tinha resposta. O que funciona pra ti? … Mas beleza. Indefinições acontecem. Eu pensei que talvez rolaria mudar a mentalidade do cliente se eu tivesse dentro. Lá foi o retardado e não deu muito certo. A agência não consegue ver o negócio e só quer fazer coisas “legais” ou que “funcionem”. Percebeu o problema? Quando eu tava no cliente, via coisas legais. Muitas coisas legais. Mas que só tinham saído da agência porque a dupla lá queria prêmio. Quando eu tava no cliente, via coisas que funcionariam. Mas funcionariam nas métricas toscas de impressão/pageview/interação do Facebook/Google/Whatever. O que eu fiz? Desisti, porque não sou brasileiro. Mas até hoje não dei a minha opinião sobre o assunto pra ninguém. Mas lá vai: eu acho que o problema da comunicação é a terceirização. Na minha opinião, a dependência de agência fudeu com a comunicação. Deixa eu me explicar melhor: pra mim, a profissão de “publicitário” é burra — fazendo amigos em cada frase, né? Se eu tivesse um negócio que vende geladeiras, todo mundo que me ajuda a vender mais geladeiras precisa trabalhar com geladeiras. Um publicitário não tá no BUSINESS de vender geladeira. Ele tá no BUSINESS de criar propaganda. Ele não tá nem aí pras geladeiras. E é bem natural na verdade. Não tinha como ser diferente. Ele passa o dia inteiro dentro de uma agência cheia de gente sedenta por prêmios. Todos ali querem prêmios. Uns tentando vender geladeira, outros tentando vender sofá e um terceiro grupo querendo vender chinelinho. As vezes as mesmas pessoas precisam vender os 3 no mesmo dia. Mas e como faz pra vender? Com campanhas, ué. Foi o que disseram na faculdade. Um problema de comunicação nem sempre é resolvido com campanhas. Mas é sempre o que sai da agência. Todo problema é resolvido com uma campanhazinha. Com um conceito desdobrado em 100 peças. Com um slogan aplicado em 50 anúncios. Com a ID aplicada em xícara, moleskine pra convenção de vendas e uma hashtag. Mas vocês não acharam que eu ia terminar o texto aqui né? Preciso pelo menos sugerir alguma coisa (por mais furado que seja). Minha ideia: a comunicação toda deveria ser feita dentro da empresa. Eu produzo a geladeira. Eu sei como ela funciona. Eu sei o que meus clientes precisam saber. Eu sou o pai das minhas geladeiras. A General Electric tem uma abordagem parecida com isso — mas não necessariamente com geladeiras. Eles criaram um setor editorial, com uma revista dentro da empresa. Se a empresa acha que a solução pra ajudar a vender tá fora da empresa, tem algo errado. Se a agência acha que vai resolver o problema de comunicação de uma empresa olhando de fora, tá mentindo. Toda empresa tem uma alma, uma personalidade. E essa personalidade não sobrevive ao telefone sem fio com a agência. Muita gente fala que o formato tradicional de agência tá morto mas o formato novo ninguém sabe. Eu tenho uma sugestão: formato nenhum. Acabamos com a mentalidade de “AGENCIAMENTO DE MÍDIA” e discutimos qual a função de quem pensa a comunicação. Vender é muito diferente de criar conteúdo pra marca. A mesma pessoa fazer as duas coisas é burrice. Não tem nada errado em procurar gente de fora pra ajudar dentro. Mas então contrata um consultor, não um agenciador. Eu realmente acho que se organizar direitinho, todo mundo transa. Mas se tiver esses agenciadores no meio, vai sobrar gente com o pau na mão — e normalmente são os próprios agenciadores. E aí? Concorda? Discorda? Deixa uma resposta aí! Se curtiu, ajuda a divulgar essa ideia. Compartilha, recomenda… Obrigado por ter lido até aqui. Se tiver um tempo, dá uma conferida no meu canal. Tenho produzido algumas coisinhas lá também! ", "title": "Porque eu larguei a comunicação", "sentences": [{"ed2a": "Porque eu larguei a comunicação"}, {"b6e4": "Talvez o texto mais difícil de escrever (pra mim né)."}, {"e99f": "Já faz uns 3 meses que eu escolhi sair da minha “agência de propaganda” e tô dirigindo pro Uber desde então. Vou resumir minha carreira ao máximo e logo vou pra parte que eu reclamo. Se não quiser ler a minha biografia, vai rolando até tu ler “PARA AQUI” um pouco maior. Vai ser fácil de achar."}, {"08a9": "Quando eu tinha 15 anos, ainda no Ensino Médio, eu consegui um estágio trabalhando com Social Media. Bem no início do boom."}, {"eb89": "Aí, quando eu tinha 17 recém-feitos entrei pra uma agência “grande” como Assistente de Redação. Logo ganhei um prêmio de melhor redator numa competição da faculdade. Aí fui promovido e ganhei um setor de comunicação online quase só pra mim. Nessa aí eu e meu dupla ganhamos Colunistas e entramos pro Anuário da ARP."}, {"8b24": "PREMIOS NEAM CARA"}, {"b278": "Respira."}, {"07c2": "Aí uns 6 meses depois consegui ir pra uma agência BEM grande do RS, trabalhando com um cliente GIGANTESCO (worldwide shit). Aí logo recebi proposta pra voltar pra agência “grande”. Ali, com 2o anos, virei Gerente de Conteúdo. 3 meses como gerente e fui pra uma multinacional atrás de uma promessa que acabou não decolando."}, {"271d": "No fim da caminhada na multinacional, abri uma empresa que ia trabalhar com Marketing Político nas eleições municipais de 2016. Deu tudo certo. Elegemos todos nossos clientes importantes. Um deles, candidato a prefeito, começou a campanha com 3% e foi eleito com 41%."}, {"ed35": "PARA AQUI — FIM DA BIOGRAFIA"}, {"d94e": "Eu decidi sair “da comunicação” logo depois disso. Recusei empregos de agências, freelas de conteúdo, freelas de marketing. Tudo. Não faço mais."}, {"2a51": "Honestamente, eu larguei porque cansei do teatro."}, {"91d4": "Quando eu tava dentro de agência, o cliente parecia cagar pro meu trampo. O cliente queria saber do negócio dele. Pra ele se não convertia em número imediatamente, não valia. Pra ele ou tinha que ser “legal” ou tinha que “funcionar”. Mas nenhuma das duas palavras traduzia."}, {"c53b": "O que é legal pra ti?"}, {"7a5b": "Não tinha resposta."}, {"ba3c": "O que funciona pra ti?"}, {"9b15": "…"}, {"fb7e": "Mas beleza. Indefinições acontecem. Eu pensei que talvez rolaria mudar a mentalidade do cliente se eu tivesse dentro."}, {"0f94": "Lá foi o retardado e não deu muito certo."}, {"596c": "A agência não consegue ver o negócio e só quer fazer coisas “legais” ou que “funcionem”."}, {"ace6": "Percebeu o problema?"}, {"8e8c": "Quando eu tava no cliente, via coisas legais. Muitas coisas legais. Mas que só tinham saído da agência porque a dupla lá queria prêmio."}, {"631e": "Quando eu tava no cliente, via coisas que funcionariam. Mas funcionariam nas métricas toscas de impressão/pageview/interação do Facebook/Google/Whatever."}, {"ec1a": "O que eu fiz? Desisti, porque não sou brasileiro. Mas até hoje não dei a minha opinião sobre o assunto pra ninguém."}, {"8679": "Mas lá vai: eu acho que o problema da comunicação é a terceirização."}, {"3337": "Na minha opinião, a dependência de agência fudeu com a comunicação."}, {"d4e4": "Deixa eu me explicar melhor: pra mim, a profissão de “publicitário” é burra — fazendo amigos em cada frase, né?"}, {"e6ee": "Se eu tivesse um negócio que vende geladeiras, todo mundo que me ajuda a vender mais geladeiras precisa trabalhar com geladeiras."}, {"4bea": "Um publicitário não tá no BUSINESS de vender geladeira. Ele tá no BUSINESS de criar propaganda. Ele não tá nem aí pras geladeiras."}, {"33a3": "E é bem natural na verdade. Não tinha como ser diferente. Ele passa o dia inteiro dentro de uma agência cheia de gente sedenta por prêmios. Todos ali querem prêmios."}, {"781a": "Uns tentando vender geladeira, outros tentando vender sofá e um terceiro grupo querendo vender chinelinho. As vezes as mesmas pessoas precisam vender os 3 no mesmo dia."}, {"4139": "Mas e como faz pra vender? Com campanhas, ué. Foi o que disseram na faculdade."}, {"84d3": "Um problema de comunicação nem sempre é resolvido com campanhas. Mas é sempre o que sai da agência."}, {"b39d": "Todo problema é resolvido com uma campanhazinha. Com um conceito desdobrado em 100 peças. Com um slogan aplicado em 50 anúncios. Com a ID aplicada em xícara, moleskine pra convenção de vendas e uma hashtag."}, {"1a6a": "Mas vocês não acharam que eu ia terminar o texto aqui né? Preciso pelo menos sugerir alguma coisa (por mais furado que seja)."}, {"84a8": "Minha ideia: a comunicação toda deveria ser feita dentro da empresa. Eu produzo a geladeira. Eu sei como ela funciona. Eu sei o que meus clientes precisam saber. Eu sou o pai das minhas geladeiras. A General Electric tem uma abordagem parecida com isso — mas não necessariamente com geladeiras. Eles criaram um setor editorial, com uma revista dentro da empresa."}, {"182c": "Se a empresa acha que a solução pra ajudar a vender tá fora da empresa, tem algo errado. Se a agência acha que vai resolver o problema de comunicação de uma empresa olhando de fora, tá mentindo."}, {"0e28": "Toda empresa tem uma alma, uma personalidade. E essa personalidade não sobrevive ao telefone sem fio com a agência."}, {"fb71": "Muita gente fala que o formato tradicional de agência tá morto mas o formato novo ninguém sabe."}, {"d157": "Eu tenho uma sugestão: formato nenhum. Acabamos com a mentalidade de “AGENCIAMENTO DE MÍDIA” e discutimos qual a função de quem pensa a comunicação. Vender é muito diferente de criar conteúdo pra marca. A mesma pessoa fazer as duas coisas é burrice. Não tem nada errado em procurar gente de fora pra ajudar dentro. Mas então contrata um consultor, não um agenciador."}, {"ba8c": "Eu realmente acho que se organizar direitinho, todo mundo transa. Mas se tiver esses agenciadores no meio, vai sobrar gente com o pau na mão — e normalmente são os próprios agenciadores."}, {"07fb": "E aí? Concorda? Discorda? Deixa uma resposta aí!"}, {"1b13": "Se curtiu, ajuda a divulgar essa ideia. Compartilha, recomenda…"}, {"6002": "Obrigado por ter lido até aqui."}, {"8919": "Se tiver um tempo, dá uma conferida no meu canal. Tenho produzido algumas coisinhas lá também!"}], "child": "1390_1\t1390_2\t1390_31390_1\t1390_2\t1390_31390_1\t1390_2\t1390_3"}