{"name": "1391", "parent": "", "content": "Sobre ser millennial, ter crises existenciais e ficar de boa. Eu decidi ser publicitária aos 11 anos. Nem veterinária, nem médica, nem professora. Publicitária. O que me levou a tomar essa decisão, tão nova, é uma anedota que mais envergonha que acrescenta, então deixa pra lá. Enfim. Me orgulhava de ter sido uma pessoa tão decidida. Um prodígio. Aos 12 anos, já tinha todo o meu plano de vida traçado: Estudar > me formar > trabalhar > ficar rica. Era basicamente isso. Até uns 16 fui acrescentando coisas como: ir morar em São Paulo, trabalhar numa grande agência, ir morar no exterior, casar, ter filhos, ter uma licença maternidade infinita porque eu seria tão importante que poderia fazer meus horários tudo, e assim vai. Bem millennial mesmo. Não demorou muitos anos de faculdade até eu cair na real. Essa coisa da gente acreditar que é especial e que vai ganhar o mundo é o que fode com o nosso cérebro. O que começa como um empurrão pra vencer na vida, acaba virando um assunto mal- resolvido pra uma sessão de terapia e uma crônica Síndrome do Impostor. Ouso dizer que 90% dos publicitários que eu conheço — com quem estudei ou trabalhei — já passaram por uma crise existencial daquelas que fazem a gente querer se esconder debaixo da mesa, voltar pro útero da mãe, ter passado na fila-pro-dom-em-exatas mais uma 3 vezes pra ver se dá jeito. Eu presidi esse clubinho por uns tempos: tava frustrada, questionando as minhas escolhas, numa bad das bravas, revendo tudo que havia dentro de mim. Me sentia um cordeio de sacrifício de Santanás trabalhando a favor do capitalismo. Basicamente, eu acordava todos os dias me sentindo a pessoa mais inútil que já pisou na Terra discutindo o engajamento num post de Facebook enquanto tenho amigos salvando vidas. VIDAS. Sabe? Se o médico não faz o trampo direito ALGUÉM MORRE. MORRE!!!! “Caralho, que que eu to fazendo com a minha vida?” era o letreiro em neon pink e verde que piscava na minha cabeça todo dia antes de dormir. Pra algumas pessoas que já passaram por isso, essa é a hora de ler aquele textão maravilhoso sobre “O FULANO QUE LARGOU O TRABALHO E FOI VIVER DE VOLUNTÁRIO NA ÁFRICA” ou “A FULANINHA QUE TROCOU A PROFISSÃO X (geralmente é publicitário, né? quase sempre é publicitário!) PARA SER O QUE SEMPRE SONHOU”. Pra mim não. Lembra que eu disse que tinha escolhido ser publicitária aos 11 anos. Pois é. Eu escolhi ser publicitária aos 11 anos. E só isso. Eu não tinha, não tive — e a essa altura, sejamos honestos — nunca mais terei um FUCKING. PLANO. B. Comigo não tinha segunda opção, não tinha essa de largar a profissão pra viver a minha vocação. E QUANDO VOCÊ TÁ VIVENDO O SEU SONHO E TÁ UMA MERDA? Ninguém me contou que tinha isso! Não tem pra onde correr. Me conformei que ia viver o resto da vida carregando esse fardo, tendo que viver com a consequência das minhas escolhas WHY GOD WHY, e segue o baile. na vdd eu tava assim Até que um dia, scrollando a timeline buscando o sentido da vida, eu vi uma frase que era mais ou menos assim: “Lembre-se que um dia você desejou estar exatamente onde está hoje” Isso fez tanto sentido pra mim que transformou a minha relação com as minhas escolhas. Resgatar na memória — ainda que pareça estar láááááá no fundo — o que fez eu me interessar e, mais tarde, me apaixonar pela minha profissão é o que faz eu acordar de manhã e estar disposta a fazer o meu melhor, ainda que isso custe muitas horas de sono e alguns olhares de reprovação. E essa é a lição do dia: quando você estiver se sentindo decepcionada, frustrada, arrasada, desgraçada da cabeça: pare, respire e lembre do porquê você chegou até aqui. Se for preciso, faça uma lista. E o mais importante: se cerque de pessoas que despertem esse sentimento em você. De pessoas que te lembrem que fazer o que você faz pode ser sensacional se você quiser. Resgate seus ídolos da infância, reveja aquele filme que marcou a sua vida, aquela série que moldou o seu caráter, se debruce na história daquela personagem que é sua musa, rodeie-se de coisas que te lembrem constantemente que é possível conviver bem com as suas escolhas e que viver o seu sonho depende do que você faz com ele. Tente valorizar aqueles minutos em que tudo parece valer a pena. Tem dias que vai parecer fácil, tem dias que vai parecer impossível. Se você leu até aqui esperando uma conclusão, eu sinto muito. Mas tamo tudo no mesmo barco, ficando bem. Um dia de cada vez. ", "title": "Sobre ser millennial, ter crises existenciais e ficar de boa.", "sentences": [{"0ff6": "Sobre ser millennial, ter crises existenciais e ficar de boa."}, {"516d": "Eu decidi ser publicitária aos 11 anos."}, {"7e6b": "Nem veterinária, nem médica, nem professora. Publicitária."}, {"959b": "O que me levou a tomar essa decisão, tão nova, é uma anedota que mais envergonha que acrescenta, então deixa pra lá."}, {"2f83": "Enfim."}, {"831e": "Me orgulhava de ter sido uma pessoa tão decidida. Um prodígio. Aos 12 anos, já tinha todo o meu plano de vida traçado:"}, {"75d8": "Estudar > me formar > trabalhar > ficar rica."}, {"a2f7": "Era basicamente isso."}, {"9686": "Até uns 16 fui acrescentando coisas como: ir morar em São Paulo, trabalhar numa grande agência, ir morar no exterior, casar, ter filhos, ter uma licença maternidade infinita porque eu seria tão importante que poderia fazer meus horários tudo, e assim vai. Bem millennial mesmo."}, {"a284": "Não demorou muitos anos de faculdade até eu cair na real."}, {"5009": "Essa coisa da gente acreditar que é especial e que vai ganhar o mundo é o que fode com o nosso cérebro. O que começa como um empurrão pra vencer na vida, acaba virando um assunto mal- resolvido pra uma sessão de terapia e uma crônica Síndrome do Impostor."}, {"f679": "Ouso dizer que 90% dos publicitários que eu conheço — com quem estudei ou trabalhei — já passaram por uma crise existencial daquelas que fazem a gente querer se esconder debaixo da mesa, voltar pro útero da mãe, ter passado na fila-pro-dom-em-exatas mais uma 3 vezes pra ver se dá jeito. Eu presidi esse clubinho por uns tempos: tava frustrada, questionando as minhas escolhas, numa bad das bravas, revendo tudo que havia dentro de mim. Me sentia um cordeio de sacrifício de Santanás trabalhando a favor do capitalismo."}, {"8be0": "Basicamente, eu acordava todos os dias me sentindo a pessoa mais inútil que já pisou na Terra discutindo o engajamento num post de Facebook enquanto tenho amigos salvando vidas. VIDAS. Sabe? Se o médico não faz o trampo direito ALGUÉM MORRE. MORRE!!!!"}, {"0093": "“Caralho, que que eu to fazendo com a minha vida?” era o letreiro em neon pink e verde que piscava na minha cabeça todo dia antes de dormir."}, {"771f": "Pra algumas pessoas que já passaram por isso, essa é a hora de ler aquele textão maravilhoso sobre “O FULANO QUE LARGOU O TRABALHO E FOI VIVER DE VOLUNTÁRIO NA ÁFRICA” ou “A FULANINHA QUE TROCOU A PROFISSÃO X (geralmente é publicitário, né? quase sempre é publicitário!) PARA SER O QUE SEMPRE SONHOU”."}, {"c4a6": "Pra mim não."}, {"0f0f": "Lembra que eu disse que tinha escolhido ser publicitária aos 11 anos. Pois é. Eu escolhi ser publicitária aos 11 anos. E só isso. Eu não tinha, não tive — e a essa altura, sejamos honestos — nunca mais terei um FUCKING. PLANO. B. Comigo não tinha segunda opção, não tinha essa de largar a profissão pra viver a minha vocação. E QUANDO VOCÊ TÁ VIVENDO O SEU SONHO E TÁ UMA MERDA? Ninguém me contou que tinha isso! Não tem pra onde correr."}, {"d9a6": "Me conformei que ia viver o resto da vida carregando esse fardo, tendo que viver com a consequência das minhas escolhas WHY GOD WHY, e segue o baile."}, {"81cc": "na vdd eu tava assim"}, {"04d2": "Até que um dia, scrollando a timeline buscando o sentido da vida, eu vi uma frase que era mais ou menos assim:"}, {"853d": "“Lembre-se que um dia você desejou estar exatamente onde está hoje”"}, {"f052": "Isso fez tanto sentido pra mim que transformou a minha relação com as minhas escolhas. Resgatar na memória — ainda que pareça estar láááááá no fundo — o que fez eu me interessar e, mais tarde, me apaixonar pela minha profissão é o que faz eu acordar de manhã e estar disposta a fazer o meu melhor, ainda que isso custe muitas horas de sono e alguns olhares de reprovação."}, {"807a": "E essa é a lição do dia: quando você estiver se sentindo decepcionada, frustrada, arrasada, desgraçada da cabeça: pare, respire e lembre do porquê você chegou até aqui. Se for preciso, faça uma lista. E o mais importante: se cerque de pessoas que despertem esse sentimento em você. De pessoas que te lembrem que fazer o que você faz pode ser sensacional se você quiser."}, {"f718": "Resgate seus ídolos da infância, reveja aquele filme que marcou a sua vida, aquela série que moldou o seu caráter, se debruce na história daquela personagem que é sua musa, rodeie-se de coisas que te lembrem constantemente que é possível conviver bem com as suas escolhas e que viver o seu sonho depende do que você faz com ele."}, {"da08": "Tente valorizar aqueles minutos em que tudo parece valer a pena."}, {"2001": "Tem dias que vai parecer fácil, tem dias que vai parecer impossível. Se você leu até aqui esperando uma conclusão, eu sinto muito. Mas tamo tudo no mesmo barco, ficando bem. Um dia de cada vez."}], "child": "1391_1"}