{"name": "1404", "parent": "", "content": "Tribes, Flocks, and Single Servings — The Evolution of Digital Behavior Mapping Intimacy and Engagement in Online Communities I’ve been thinking a lot about the relationships we form online. One of my favorite things to do is to deep-dive within various online communities, exploring their culture, rituals, and habits. From obscure fandoms and hobby groups to lifestyle forums and hashtag movements, I’m always fascinated by the ever-changing nature of our online interactions. As our online behavior becomes more complex, I’ve found the term “online community” to be an inadequate and limiting way to describe the pockets of activity that I was seeing. I started playing around with different frameworks to help me spot emerging trends and behaviors. After several iterations, I decided to concentrate on the two elements that were consistently the most useful: Engagement Length and Intimacy Level. I focused on these two elements because they were actions that weren’t limited to a specific platform. Different groups use various social networks in different ways and calling something “a Facebook group” or “A message board” was not an accurate representation of the intent or purpose of that particular community. Digital spaces also possess an inherent fluidity that allows groups to evolve over time, and I wanted to be able to map that change as well. I created a framework that has been helping me capture the spaces that I’m tracking. It’s still evolving so it might change as I continue to use it, but for now it’s been very useful. Here are the categories that I’ve been using so far: TRIBES: High Intimacy/Long Term Engagement This represents an online community with a deep and vibrant digital culture. There’s a shared history, unique vocabulary (group-specific acronyms/memes/inside jokes). There is a longevity to the community that exists even if there is a frequent level of membership churn. Participants are highly engaged and active. A good example of tribes would be very active fandoms where participants know each other (online), Gaming Guilds, and Facebook groups that are focused on a specific value or activity that is not time-specific (like a book club or fitness support group). This also includes networks like The Thousand Network and Summit Series that bridge the gaps between online and offline spaces as well. ECOSYSTEMS: Low Intimacy/Long Term Engagement Long-term engagement without the accompanying intimacy falls into the next quadrant, ecosystems. Ecosystems are the broadest base of digital platforms. They provide the space to capture engagement but aren’t directed or anchored by a specific goal or value. This is where I believe social networks in general fit in. I would consider my Twitter feed to fall within this category: I am connected to a lot of people, I’ve been on the platform for a few years, but I wouldn’t categorize my engagement as being highly intimate. Some people will argue that Facebook is more of a tribe, and that I would say it depends on usage. I think it was originally intended to be a tribe-based platform, but with friend lists now reaching the thousands, it has evolved into an ecosystem that supports various tribes in the form of groups and pages. It does depend on usage — if you have cultivated a small and intimate list of friends then it could serve as your tribe, and that could be mapped accordingly. FLOCKS: High Intimacy/Short Term Engagement Flocks represent short, intense busts of high intimacy interactions. They are most often characterized by current events that trigger an emotional response from the public. During a Flock, a collective and temporary movement is created online as users share, comment, and create content based on the subject matter. The initial swell eventually dissipates and stops being discussed all together. I should note that the emotional response doesn’t always have to be serious! These interactions are categorized by an intense but temporary alignment with a collective audience. The most common manifestation of a Flock is usually through the use of a time-sensitive hashtag that goes viral. Last year, some of the most popular flocks that were spotted included: Another characteristic of a Flock are memes that are created in response to these events. A good example of this is the frenzy that erupted when Leo DiCaprio finally won a Best Actor Oscar. SINGLE SERVINGS: Low Intimacy/Short Term Engagement These digital spaces focus on exchanges that are transactional in nature and usually only occur once, leading to a low level of digital intimacy. Most common versions of these include review-based sites like Trip Advisor or Yelp, and digital sales platforms like Etsy or eBay. Understanding the Continuum For me, the most interesting part is the overlap and changes that occur on this map. For example, #blacklivesmatter started as a Flock (through the use of #Ferguson, #Charleston, and #BaltimoreProtests hashtags) and is now transitioning closer and closer to the Tribe stage as people start to form relationships and build movements around this civil rights cause. Another interesting example is the r/relationships subreddit where users post about their problems and ask for advice from the community. Despite the anonymity, the posts are usually very intimate and revealing, however the interaction itself is quite transactional. There is some continuity with people posting updates after they’ve received advice, but usually people vanish afterwards, and some even delete their post. So despite the perceived high intimacy, the norm of creating a “throw away” (an account that you create just to post in this forum, versus the main account that you use on the site) would indicate that this is a Single Serve. I’ll be posting more of my findings and research in the upcoming weeks as I continue to refine and tweak this framework, and would love to hear your thoughts. If you’ve found the above interesting, please consider spreading the word! And you might also enjoy my monthly newsletter where I share research from my current projects, as well as talk about digital culture, creativity, productivity, and tech. Here’s one I wrote about Leo’s Oscar Meme frenzy. And one about Abe Lincoln’s use of the world Hustle. Happy reading! ", "title": "Tribes, Flocks, and Single Servings — The Evolution of Digital Behavior", "sentences": [{"7161": "Tribes, Flocks, and Single Servings — The Evolution of Digital Behavior"}, {"22cf": "Mapping Intimacy and Engagement in Online Communities"}, {"4ec5": "I’ve been thinking a lot about the relationships we form online. One of my favorite things to do is to deep-dive within various online communities, exploring their culture, rituals, and habits. From obscure fandoms and hobby groups to lifestyle forums and hashtag movements, I’m always fascinated by the ever-changing nature of our online interactions."}, {"9b04": "As our online behavior becomes more complex, I’ve found the term “online community” to be an inadequate and limiting way to describe the pockets of activity that I was seeing. I started playing around with different frameworks to help me spot emerging trends and behaviors. After several iterations, I decided to concentrate on the two elements that were consistently the most useful: Engagement Length and Intimacy Level."}, {"5d8d": "I focused on these two elements because they were actions that weren’t limited to a specific platform. Different groups use various social networks in different ways and calling something “a Facebook group” or “A message board” was not an accurate representation of the intent or purpose of that particular community. Digital spaces also possess an inherent fluidity that allows groups to evolve over time, and I wanted to be able to map that change as well."}, {"2a33": "I created a framework that has been helping me capture the spaces that I’m tracking. It’s still evolving so it might change as I continue to use it, but for now it’s been very useful."}, {"20ee": "Here are the categories that I’ve been using so far:"}, {"604f": "TRIBES: High Intimacy/Long Term Engagement"}, {"1756": "This represents an online community with a deep and vibrant digital culture. There’s a shared history, unique vocabulary (group-specific acronyms/memes/inside jokes). There is a longevity to the community that exists even if there is a frequent level of membership churn. Participants are highly engaged and active."}, {"6c65": "A good example of tribes would be very active fandoms where participants know each other (online), Gaming Guilds, and Facebook groups that are focused on a specific value or activity that is not time-specific (like a book club or fitness support group). This also includes networks like The Thousand Network and Summit Series that bridge the gaps between online and offline spaces as well."}, {"4abd": "ECOSYSTEMS: Low Intimacy/Long Term Engagement"}, {"70db": "Long-term engagement without the accompanying intimacy falls into the next quadrant, ecosystems. Ecosystems are the broadest base of digital platforms. They provide the space to capture engagement but aren’t directed or anchored by a specific goal or value. This is where I believe social networks in general fit in. I would consider my Twitter feed to fall within this category: I am connected to a lot of people, I’ve been on the platform for a few years, but I wouldn’t categorize my engagement as being highly intimate."}, {"4df2": "Some people will argue that Facebook is more of a tribe, and that I would say it depends on usage. I think it was originally intended to be a tribe-based platform, but with friend lists now reaching the thousands, it has evolved into an ecosystem that supports various tribes in the form of groups and pages. It does depend on usage — if you have cultivated a small and intimate list of friends then it could serve as your tribe, and that could be mapped accordingly."}, {"98d1": "FLOCKS: High Intimacy/Short Term Engagement"}, {"8f36": "Flocks represent short, intense busts of high intimacy interactions. They are most often characterized by current events that trigger an emotional response from the public. During a Flock, a collective and temporary movement is created online as users share, comment, and create content based on the subject matter. The initial swell eventually dissipates and stops being discussed all together."}, {"f811": "I should note that the emotional response doesn’t always have to be serious! These interactions are categorized by an intense but temporary alignment with a collective audience."}, {"2e44": "The most common manifestation of a Flock is usually through the use of a time-sensitive hashtag that goes viral. Last year, some of the most popular flocks that were spotted included:"}, {"e858": "Another characteristic of a Flock are memes that are created in response to these events. A good example of this is the frenzy that erupted when Leo DiCaprio finally won a Best Actor Oscar."}, {"8b2c": "SINGLE SERVINGS: Low Intimacy/Short Term Engagement"}, {"b4c2": "These digital spaces focus on exchanges that are transactional in nature and usually only occur once, leading to a low level of digital intimacy. Most common versions of these include review-based sites like Trip Advisor or Yelp, and digital sales platforms like Etsy or eBay."}, {"6b55": "Understanding the Continuum"}, {"03a3": "For me, the most interesting part is the overlap and changes that occur on this map. For example, #blacklivesmatter started as a Flock (through the use of #Ferguson, #Charleston, and #BaltimoreProtests hashtags) and is now transitioning closer and closer to the Tribe stage as people start to form relationships and build movements around this civil rights cause."}, {"a11e": "Another interesting example is the r/relationships subreddit where users post about their problems and ask for advice from the community. Despite the anonymity, the posts are usually very intimate and revealing, however the interaction itself is quite transactional. There is some continuity with people posting updates after they’ve received advice, but usually people vanish afterwards, and some even delete their post. So despite the perceived high intimacy, the norm of creating a “throw away” (an account that you create just to post in this forum, versus the main account that you use on the site) would indicate that this is a Single Serve."}, {"e314": "I’ll be posting more of my findings and research in the upcoming weeks as I continue to refine and tweak this framework, and would love to hear your thoughts."}, {"6105": "If you’ve found the above interesting, please consider spreading the word! And you might also enjoy my monthly newsletter where I share research from my current projects, as well as talk about digital culture, creativity, productivity, and tech. Here’s one I wrote about Leo’s Oscar Meme frenzy. And one about Abe Lincoln’s use of the world Hustle. Happy reading!"}], "child": "1404_1\t1404_2\t1404_3\t1404_4\t1404_5\t1404_6\t1404_7\t1404_8\t1404_9\t1404_10\t1404_11\t1404_12\t1404_13\t1404_14\t1404_15\t1404_16\t1404_17\t1404_18\t1404_19\t1404_20\t1404_21\t1404_22\t1404_23\t1404_24\t1404_25"}