{"name": "1407", "parent": "", "content": "Today I became CEO. My name is Alexander Edem and I used to be the digital marketing team lead over at Amplify Digital Agency, a performance driven digital marketing agency based in Lagos, Nigeria. I want to share my story in part to act as a sort of release and closure for me and in part to help anyone else struggling with the same issues that I struggled with. I quit my finance job in 2012, to begin work on fulfilling my dreams of starting a digital marketing agency, that dream started on a positive note when I teamed up with two of my friends to start SocialBees a social/digital marketing agency, at the time we were lucky to be able to land a couple of high profile jobs, but we lacked the structure and discipline that it took to build and scale a proper digital agency. We went our separate ways a year later, but remained very close friends till date, helping each other out wherever help was needed. I went on to start Amplify Digital Agency with a burning desire to be the digital marketing agency of choice for leading brands both in Nigeria and across Africa, beyond that I wanted to be able to build a company that had at its core the ability to churn out creative work as well as be a model workplace for employees, my vision was and still is for a company that puts the well-being and success of its employees over every other thing. This was a tall order, especially in a business environment like Nigeria as other entrepreneurs can attest to. Our growth started out slowly but surely and we won a couple of accounts, in particular a big account that helped us in building the structures that would grow the agency, from a team of just three at the start to a 10 man team at some point. In 2016, the Nigerian economy was hit by a recession in Q3 and Q4, being in the marketing and advertising industry, this industry was the first to feel the brunt of the recession with clients cutting back on marketing budgets and a lot of other businesses just not willing to allocate budgets for digital marketing. There began a period of real struggle within the agency, making payroll, covering other outstanding overheads as well as a daily constant struggle for winning new clients so as to better the financial position of the company. I coped quite well in the few months that this began, but I became extremely irritated and easily angered as the months wore on. I had made a silent vow to myself at the beginning of this journey to run a company that never owed its employees a month’s wage and I fully intended to meet this obligation I had made to myself. Our rough patch continued and then we began to lose employees, one after the other, because we struggled to make payroll I had not been able to keep my promise to team members on increasing their salaries and bringing in other non-monetary perks, this was coupled with the fact that we were just not closing on new accounts, we had existing agreements also expire without the client renewing them and things were generally not looking up for us. I am ordinarily a very creative, resilient and incredibly optimistic person, but six or seven months after this started I was at my wits end. Team morale was at its lowest and when at one point even the only intern we had resigned to go somewhere else I knew we were in a deep hole, the next month another employee called to say she was taking up a new role, she had been offered a good package and she was taking it, at this point I was very well near depression, I had rent to make on the business premises that we occupied and I had to cut salaries in half to be able to make payroll, this wasn’t what I envisioned at the start of this journey and I really took a hit. I was ok with struggling to make payroll and focusing on winning new clients but when employees starting leaving it made me feel like I had failed the agency and myself. Things came to a head when just last night, in the midst of reviewing strategies, and thinking about new ways to grow the company another key staff sent me a message that I had been dreading, he wanted to talk to me about something, he was leaving too. May I point out at this point that my wife is eight weeks pregnant with our first child, I was home with her trying to help her with the nausea and dizziness she was experiencing. Something snapped that night after receiving the message of yet another resignation, I took my car keys, told my wife I was going out and just drove out, I can still remember her voice pleading with me to tell her where I was going at this time of the night. I drove aimlessly for up to three or four hours, my mind blank, I felt like a failure, cars honked behind me as I was lost in thought, Lagos drivers are notoriously impatient, even on a good day, and they just had no time for someone with a blank stare, driving at 10km/hr. on an 80km/hr. highway. Weeks back in Lagos we had two or three episodes of people who were depressed taking their own lives by jumping from the bridge, whilst I had absolutely no suicidal thoughts, I realized just how fragile the human mind can be and that there really was a very thin line between being sane and going into depression. In my case, I was lucky to have a strong family support system, a belief in the infinitely perfect laws of GOD in creation as well as knowledge of the workings of these laws and a beautiful and loving wife, I wasn’t going down that road, but I was the lucky one, many other people aren’t so lucky. I came home after about four hours to a very worried wife, who couldn’t sleep a wink. That night I realized just how intertwined all of our lives really were and the impact that decisions you make can have on the people around you, whether they be your wife, your Boss or your colleagues. I finally slept off that night only after watching Kung Fu Panda 3; I needed something to keep my mind off its destructive path. I woke up this morning, April 12th, 2017 with a determination that I didn’t know I had in me. The first thing I did, was to utter the most soul shattering prayer for help that I have ever uttered in my life, that type of prayer that moves you at your very core. I also did other things; I sent my wife a message apologizing for my behavior the night before and making a pledge to be fully present for her and our unborn child, physically and mentally. #NoExcuses #NoQuestionsAsked I sent two mails to my team, the first was a message wishing the latest employee to exit well and working on team morale to calm everyone down, the other mail was my strategic blueprint to get us to recovery and back to growth for the agency. The most important part of the second email on strategy was the focus on the employee both in terms of benefits and general well being, you see I have learnt that the most important asset that every company has is its employees, there would be some that will stay during times of turbulence and there are others that will go, the most important thing however was to keep focus on the underlying reasons why you started the company in the first place. We have three core values at the agency Simplicity, Fearless Creativity and Relentless Will and I believe it is time to get back to those basics and to rediscover ourselves, I’m grateful to everyone of our past employees that left, because they have taught me the importance of taking care of your own, fighting for them and YES going above and beyond for them. I also encourage new digital talents to seek us out; you will not only have a creative workplace to put your best ideas forward, but you will have a boss who will push, motivate and mentor you and most importantly who will stand with you when the chips are down. Yesterday, I was head of digital marketing at Amplify Digital Agency, when I stood up today after my morning prayers I became the CEO. Before. All of the problems still stare me in the face, the fact that we need to win new accounts, the fact that we need to make payroll and make rent payments, but this morning something changed inside of me, a recommitment to my vision and ideals for starting this out in the first place and a profound appreciation for the people that work within the agency as well as the realization of the magnitude of the responsibility which I owe to them. I will fight, I will claw and I will go to war if I have to, but I will never quit on myself or on my team. To success! ", "title": "Today I became CEO.", "sentences": [{"9325": "Today I became CEO."}, {"98d4": "My name is Alexander Edem and I used to be the digital marketing team lead over at Amplify Digital Agency, a performance driven digital marketing agency based in Lagos, Nigeria."}, {"82db": "I want to share my story in part to act as a sort of release and closure for me and in part to help anyone else struggling with the same issues that I struggled with."}, {"8db0": "I quit my finance job in 2012, to begin work on fulfilling my dreams of starting a digital marketing agency, that dream started on a positive note when I teamed up with two of my friends to start SocialBees a social/digital marketing agency, at the time we were lucky to be able to land a couple of high profile jobs, but we lacked the structure and discipline that it took to build and scale a proper digital agency."}, {"7ceb": "We went our separate ways a year later, but remained very close friends till date, helping each other out wherever help was needed. I went on to start Amplify Digital Agency with a burning desire to be the digital marketing agency of choice for leading brands both in Nigeria and across Africa, beyond that I wanted to be able to build a company that had at its core the ability to churn out creative work as well as be a model workplace for employees, my vision was and still is for a company that puts the well-being and success of its employees over every other thing. This was a tall order, especially in a business environment like Nigeria as other entrepreneurs can attest to."}, {"2888": "Our growth started out slowly but surely and we won a couple of accounts, in particular a big account that helped us in building the structures that would grow the agency, from a team of just three at the start to a 10 man team at some point."}, {"b326": "In 2016, the Nigerian economy was hit by a recession in Q3 and Q4, being in the marketing and advertising industry, this industry was the first to feel the brunt of the recession with clients cutting back on marketing budgets and a lot of other businesses just not willing to allocate budgets for digital marketing."}, {"ad70": "There began a period of real struggle within the agency, making payroll, covering other outstanding overheads as well as a daily constant struggle for winning new clients so as to better the financial position of the company. I coped quite well in the few months that this began, but I became extremely irritated and easily angered as the months wore on. I had made a silent vow to myself at the beginning of this journey to run a company that never owed its employees a month’s wage and I fully intended to meet this obligation I had made to myself."}, {"8d7e": "Our rough patch continued and then we began to lose employees, one after the other, because we struggled to make payroll I had not been able to keep my promise to team members on increasing their salaries and bringing in other non-monetary perks, this was coupled with the fact that we were just not closing on new accounts, we had existing agreements also expire without the client renewing them and things were generally not looking up for us. I am ordinarily a very creative, resilient and incredibly optimistic person, but six or seven months after this started I was at my wits end."}, {"db56": "Team morale was at its lowest and when at one point even the only intern we had resigned to go somewhere else I knew we were in a deep hole, the next month another employee called to say she was taking up a new role, she had been offered a good package and she was taking it, at this point I was very well near depression, I had rent to make on the business premises that we occupied and I had to cut salaries in half to be able to make payroll, this wasn’t what I envisioned at the start of this journey and I really took a hit. I was ok with struggling to make payroll and focusing on winning new clients but when employees starting leaving it made me feel like I had failed the agency and myself."}, {"367b": "Things came to a head when just last night, in the midst of reviewing strategies, and thinking about new ways to grow the company another key staff sent me a message that I had been dreading, he wanted to talk to me about something, he was leaving too. May I point out at this point that my wife is eight weeks pregnant with our first child, I was home with her trying to help her with the nausea and dizziness she was experiencing. Something snapped that night after receiving the message of yet another resignation, I took my car keys, told my wife I was going out and just drove out, I can still remember her voice pleading with me to tell her where I was going at this time of the night."}, {"560e": "I drove aimlessly for up to three or four hours, my mind blank, I felt like a failure, cars honked behind me as I was lost in thought, Lagos drivers are notoriously impatient, even on a good day, and they just had no time for someone with a blank stare, driving at 10km/hr. on an 80km/hr. highway. Weeks back in Lagos we had two or three episodes of people who were depressed taking their own lives by jumping from the bridge, whilst I had absolutely no suicidal thoughts, I realized just how fragile the human mind can be and that there really was a very thin line between being sane and going into depression. In my case, I was lucky to have a strong family support system, a belief in the infinitely perfect laws of GOD in creation as well as knowledge of the workings of these laws and a beautiful and loving wife, I wasn’t going down that road, but I was the lucky one, many other people aren’t so lucky."}, {"5b14": "I came home after about four hours to a very worried wife, who couldn’t sleep a wink. That night I realized just how intertwined all of our lives really were and the impact that decisions you make can have on the people around you, whether they be your wife, your Boss or your colleagues. I finally slept off that night only after watching Kung Fu Panda 3; I needed something to keep my mind off its destructive path."}, {"9fcc": "I woke up this morning, April 12th, 2017 with a determination that I didn’t know I had in me. The first thing I did, was to utter the most soul shattering prayer for help that I have ever uttered in my life, that type of prayer that moves you at your very core."}, {"ea2f": "I also did other things; I sent my wife a message apologizing for my behavior the night before and making a pledge to be fully present for her and our unborn child, physically and mentally. #NoExcuses #NoQuestionsAsked"}, {"7f03": "I sent two mails to my team, the first was a message wishing the latest employee to exit well and working on team morale to calm everyone down, the other mail was my strategic blueprint to get us to recovery and back to growth for the agency. The most important part of the second email on strategy was the focus on the employee both in terms of benefits and general well being, you see I have learnt that the most important asset that every company has is its employees, there would be some that will stay during times of turbulence and there are others that will go, the most important thing however was to keep focus on the underlying reasons why you started the company in the first place."}, {"ead8": "We have three core values at the agency Simplicity, Fearless Creativity and Relentless Will and I believe it is time to get back to those basics and to rediscover ourselves, I’m grateful to everyone of our past employees that left, because they have taught me the importance of taking care of your own, fighting for them and YES going above and beyond for them. I also encourage new digital talents to seek us out; you will not only have a creative workplace to put your best ideas forward, but you will have a boss who will push, motivate and mentor you and most importantly who will stand with you when the chips are down."}, {"c3c9": "Yesterday, I was head of digital marketing at Amplify Digital Agency, when I stood up today after my morning prayers I became the CEO."}, {"7698": "Before."}, {"b572": "All of the problems still stare me in the face, the fact that we need to win new accounts, the fact that we need to make payroll and make rent payments, but this morning something changed inside of me, a recommitment to my vision and ideals for starting this out in the first place and a profound appreciation for the people that work within the agency as well as the realization of the magnitude of the responsibility which I owe to them."}, {"4a3d": "I will fight, I will claw and I will go to war if I have to, but I will never quit on myself or on my team."}, {"ccf9": "To success!"}], "child": "1407_1\t1407_2\t1407_3\t1407_4"}