{"name": "1418", "parent": "", "content": "Save the bats, boycott organic On Saturday the CDC released a statement indicating that “a limited number of cases of Organic Marketside Spring Mix” had been recalled due to the discovery of a dead bat by two people in Florida. The bat was sent to the CDC rabies lab for laboratory testing because bats in the United States sometimes have been found to have this disease. The deteriorated condition of the bat did not allow for CDC to definitively rule out whether this bat had rabies. While food recalls happen all the time for a multitude of reasons, there is evidence to suggest that organic products are four to eight times more likely to be recalled. Bacterial contamination especially appears to be a concern. But what about bats? One report from the United Kingdom showed that organic farms are 60 percent more likely to show bat activity. This is not necessarily a bad thing of course. Writing for Forbes Judy Stone explains: Bats are unjustly vilified. Bats are actually pretty fascinating little animals and do a world of good for people, as well as the environment. For example, they are voracious mosquito eaters, as well as devouring agricultural pests. Bats are also essential in pollinating some flowers, and in dispersing seed through their droppings. Many organic farmers looking to incorporate natural forms of pest control even have bat houses near their crops. Steve Tennes with the Organic Farming Research Foundation gives one example: Codling moth is the most destructive fruit pest for apples and pears across the United States and Canada. Bats can potentially act as a natural predator that could reduce codling moth populations. There is little doubt that organic farms will have more biodiversity than conventional. Part of the reason organic food has an increased cost is the loss of yield to pests. Organic farmers just don’t have access to the tools that conventional farmers do. But that yield loss makes the gains of biodiversity on organic farms irrelevant. If yields are increased then farmers are able to produce more food on less land, preserving biodiversity off of the farm. This is the often overlooked benefit to modern industrial farming. According to data from the United States Department of Agriculture, in 1910 the United States had 754 million acres of forest, and in 2012 this had risen to 766 million acres. The population has tripled during that time period. A report by Jesse Ausubel for the Society of American Foresters explains how modern agriculture played a major role: If farmers lift yields 1 percent per year and population grows by 2 percent per year while diet remains steady, land must be cleared for crops. If farmers lift yields 2 percent per year and population grows 1 percent per year, land is spared. For centuries, globally, land cropped expanded, and cropland per person even rose as people sought more proteins and calories. China’s brilliant yields were five times those of the crude farming of America and most of the rest of the world. But 50 years ago, rapidly lifting the specific productivity of land, the world’s farmers stopped plowing up Nature. While the investigation is currently under way to determine just how the dead bat ended up in the salad bag, the incident should open a new discussion as to what is really best for bats. The US Fish and Wildlife Service offers a list of ways to help the bat population. Number 2 on the list is to reduce pesticides. As organic farming uses pesticides, is building bat houses (number 5 on the list) near crops really best for the bats? Perhaps what is really best for them is number 3, promote natural bat habitats. What better way to do that than increasing the amount of forest land by reducing the amount of land needed for farming? Something the organic movement has failed to do. Don’t forget to hit the heart and help others discover this on Medium! ", "title": "Save the bats, boycott organic", "sentences": [{"c8bd": "Save the bats, boycott organic"}, {"15c3": "On Saturday the CDC released a statement indicating that “a limited number of cases of Organic Marketside Spring Mix” had been recalled due to the discovery of a dead bat by two people in Florida."}, {"4367": "The bat was sent to the CDC rabies lab for laboratory testing because bats in the United States sometimes have been found to have this disease. The deteriorated condition of the bat did not allow for CDC to definitively rule out whether this bat had rabies."}, {"b433": "While food recalls happen all the time for a multitude of reasons, there is evidence to suggest that organic products are four to eight times more likely to be recalled. Bacterial contamination especially appears to be a concern."}, {"4607": "But what about bats? One report from the United Kingdom showed that organic farms are 60 percent more likely to show bat activity. This is not necessarily a bad thing of course. Writing for Forbes Judy Stone explains:"}, {"e347": "Bats are unjustly vilified. Bats are actually pretty fascinating little animals and do a world of good for people, as well as the environment. For example, they are voracious mosquito eaters, as well as devouring agricultural pests. Bats are also essential in pollinating some flowers, and in dispersing seed through their droppings."}, {"ac7a": "Many organic farmers looking to incorporate natural forms of pest control even have bat houses near their crops. Steve Tennes with the Organic Farming Research Foundation gives one example:"}, {"1ce2": "Codling moth is the most destructive fruit pest for apples and pears across the United States and Canada. Bats can potentially act as a natural predator that could reduce codling moth populations."}, {"8632": "There is little doubt that organic farms will have more biodiversity than conventional. Part of the reason organic food has an increased cost is the loss of yield to pests. Organic farmers just don’t have access to the tools that conventional farmers do."}, {"5701": "But that yield loss makes the gains of biodiversity on organic farms irrelevant. If yields are increased then farmers are able to produce more food on less land, preserving biodiversity off of the farm. This is the often overlooked benefit to modern industrial farming."}, {"ad85": "According to data from the United States Department of Agriculture, in 1910 the United States had 754 million acres of forest, and in 2012 this had risen to 766 million acres. The population has tripled during that time period."}, {"4bd6": "A report by Jesse Ausubel for the Society of American Foresters explains how modern agriculture played a major role:"}, {"c28c": "If farmers lift yields 1 percent per year and population grows by 2 percent per year while diet remains steady, land must be cleared for crops. If farmers lift yields 2 percent per year and population grows 1 percent per year, land is spared. For centuries, globally, land cropped expanded, and cropland per person even rose as people sought more proteins and calories. China’s brilliant yields were five times those of the crude farming of America and most of the rest of the world. But 50 years ago, rapidly lifting the specific productivity of land, the world’s farmers stopped plowing up Nature."}, {"a029": "While the investigation is currently under way to determine just how the dead bat ended up in the salad bag, the incident should open a new discussion as to what is really best for bats. The US Fish and Wildlife Service offers a list of ways to help the bat population."}, {"b02e": "Number 2 on the list is to reduce pesticides. As organic farming uses pesticides, is building bat houses (number 5 on the list) near crops really best for the bats?"}, {"c23f": "Perhaps what is really best for them is number 3, promote natural bat habitats. What better way to do that than increasing the amount of forest land by reducing the amount of land needed for farming? Something the organic movement has failed to do."}, {"dc96": "Don’t forget to hit the heart and help others discover this on Medium!"}], "child": "1418_1\t1418_2"}