{"name": "1422", "parent": "", "content": "We’re Listening Your feedback is helping shape the new eatsa We rolled out the new eatsa, including an updated ordering experience, upgraded food choices, and new pricing one week ago. Our goal, over time, is to help make eatsa feel more like your own personal chef, with extensive food options, personalized features, and priced, just for you. We have started delivering that experience with additional food options, an interface to help discover and personalize food, and lower prices for our most regular guests while still delivering on speed, taste, and affordability. We have received a lot of valuable feedback and are making daily changes based on that feedback. Thank you for using your voice to let us know how we’re doing, including what we’re executing well, and what still needs improvement. We hear you, are listening and quickly iterating to deliver the best food service experience ever. Your feedback On Monday, we received feedback from nearly one in every 12 guests regarding the new eatsa experience but by the end of the week that number decreased to around one in every 30. Negative feedback declined by 70% over the course of the week because we listened to your comments and made changes daily to improve the experience. What we’ve done with that feedback Daily Personalized List of Choices Most guests want to see a simple set of choices to make quick decisions. Now, when you swipe your card, you are brought directly to a list of eight personalized bowl choices that change daily. What’s old is new again Some guests miss the previous eatsa bowl choices they have come to know and love. Now, you can tap “Our Classic Bowls” to find and order new versions of our classic eatsa bowls. Visibility of options Some guests have expressed the desire to see all of our food choices so we have made all cuisine types accessible. This will be particularly fun once we roll out the new eatsa app, as you can play around and see the full breadth of our new offerings. Top Rated Bowls Some guests are creatures of habit and want to easily access past favorites every time they visit. By tapping “Your Top Rated”, you can now view what you have previously ranked well. Every time you order, rate your bowl (1–5). Your top rated bowls will now be one tap away from ordering. We will continue to work hard to simplify the eatsa experience and make it easy to use and understand. We are trying to do something very hard and appreciate your patience as we make changes to expose the variety of options, while keeping things simple. Our mission remains constant. We aim to make nutritious, sustainable food accessible and appealing to all. The eatsa experience will continue to adapt as we listen to what guests want and need. The new eatsa app will be available in a few weeks, so hang tight as we make enhancements before launching. We welcome the feedback and wouldn’t be able to improve if it weren’t for your evaluation of the new eatsa. Please reach out to us at hello@eatsa.com. We want to hear from you! ", "title": "We’re Listening", "sentences": [{"ccd9": "We’re Listening"}, {"c5dd": "Your feedback is helping shape the new eatsa"}, {"e951": "We rolled out the new eatsa, including an updated ordering experience, upgraded food choices, and new pricing one week ago. Our goal, over time, is to help make eatsa feel more like your own personal chef, with extensive food options, personalized features, and priced, just for you. We have started delivering that experience with additional food options, an interface to help discover and personalize food, and lower prices for our most regular guests while still delivering on speed, taste, and affordability."}, {"6ff0": "We have received a lot of valuable feedback and are making daily changes based on that feedback. Thank you for using your voice to let us know how we’re doing, including what we’re executing well, and what still needs improvement. We hear you, are listening and quickly iterating to deliver the best food service experience ever."}, {"147c": "Your feedback"}, {"7e56": "On Monday, we received feedback from nearly one in every 12 guests regarding the new eatsa experience but by the end of the week that number decreased to around one in every 30. Negative feedback declined by 70% over the course of the week because we listened to your comments and made changes daily to improve the experience."}, {"41c5": "What we’ve done with that feedback"}, {"ce2b": "Daily Personalized List of Choices"}, {"6e76": "Most guests want to see a simple set of choices to make quick decisions. Now, when you swipe your card, you are brought directly to a list of eight personalized bowl choices that change daily."}, {"f48a": "What’s old is new again"}, {"84f0": "Some guests miss the previous eatsa bowl choices they have come to know and love. Now, you can tap “Our Classic Bowls” to find and order new versions of our classic eatsa bowls."}, {"ee0d": "Visibility of options"}, {"5844": "Some guests have expressed the desire to see all of our food choices so we have made all cuisine types accessible. This will be particularly fun once we roll out the new eatsa app, as you can play around and see the full breadth of our new offerings."}, {"a749": "Top Rated Bowls"}, {"8a3b": "Some guests are creatures of habit and want to easily access past favorites every time they visit. By tapping “Your Top Rated”, you can now view what you have previously ranked well. Every time you order, rate your bowl (1–5). Your top rated bowls will now be one tap away from ordering."}, {"90d4": "We will continue to work hard to simplify the eatsa experience and make it easy to use and understand. We are trying to do something very hard and appreciate your patience as we make changes to expose the variety of options, while keeping things simple."}, {"f1c2": "Our mission remains constant. We aim to make nutritious, sustainable food accessible and appealing to all. The eatsa experience will continue to adapt as we listen to what guests want and need. The new eatsa app will be available in a few weeks, so hang tight as we make enhancements before launching. We welcome the feedback and wouldn’t be able to improve if it weren’t for your evaluation of the new eatsa. Please reach out to us at hello@eatsa.com. We want to hear from you!"}], "child": "1422_1\t1422_2\t1422_3\t1422_4\t1422_5\t1422_6\t1422_7\t1422_8"}