{"name": "1424", "parent": "", "content": "Feed a Billion is workign to address world hunger (Stock photo via 123rf.com) Hunger Games Two unlikely entrepreneurs are teaming up to serve 1 billion meals to the world’s starving — in less than four years. How? Every day nearly 22,000 people die from hunger, one every four seconds. One in nine souls survives each day without enough food — almost 800 million people worldwide are undernourished, 42 million of them in America. Hunger is as old as the human condition. For most of the first 200,000 or so years that humans have been around, it was largely an issue of scarcity and hunting skills. But even with 20,000 years of farming behind us, the gnawing problem persists. The challenge isn’t a shortage of food. Thanks to innovations in efficient agriculture, the world produces 17% more food per capita than it needs. Instead, the lingering hurdles are poverty, poor distribution, and conflict. Throw on top of that donor fatigue — “What, another crisis I have to worry about?” — and it’s easy to understand why no one has solved the problem. So why would two otherwise successful entrepreneurs bother to take on such an intractable crisis? “Because it’s better than if we do nothing,” says Jason Sisneros, 45. “You step into the world of nonprofit and people are not business-minded. They set themselves up to fail. We’re looking to innovate.” Blunt and bullet-headed, Sisneros has bought, turned around, and sold dozens of companies, losing a few in the process, and turning those hard-knocks lessons into a consulting company that starts its process of working with clients and potential acquisitions with a tough-minded three-day management course he calls the Deep Dive. Sisneros is something of a drill sergeant with a tender penchant for hopeless causes. “We have to do something,” adds Ambuj “A.J.” Jain, a 56-year-old former insurance executive who is putting together an investment fund in Atlanta, called 2 Pillars. “We may not solve the problem of hunger, but if we don’t start, how do we get to the ultimate solution?” Jain’s approach is lower-key, but no less passionate. Miss J. Alexander, judge for America’s Top Model, with Jason Sisneros, FAB CEO (Image courtesy of Feed a Billion) Sisneros and Jain have joined forces in a project called Feed A Billion (FAB). Its goal is to serve a billion meals by Nov. 20, 2020 — not to give out one meal per person but to develop a system to feed tens of millions of people on a consistent basis. They’re working with a handful of nonprofit organizations in the U.S., India, and Kenya to distribute the food. Here’s how it works. You can donate directly to the site (www.feedabillion.org), knowing that every dollar you contribute buys and delivers 10 meals; $24 feeds a family of four for a month. Or you can activate the wallets of corporate sponsors via social media campaigns. A “like” of FAB’s Facebook page triggers one donated meal; sharing the page unleashes ten meals. Every meal paid for by an individual or a company is matched by celebrity life strategist and philanthropist Tony Robbins, who helped inspire the drive. FAB did a beta test in November 2016. A small Las Vegas startup called Live Bearded, which sells grooming products, conducted a month-long social media campaign on behalf of Feed A Billion. Impressive results: a 121% jump in beard-care sales that month (on a 28% rise in promotional costs), generating 55,000 donated meals. Live Bearded has since signed up for an official sponsorship. So have Green Ingredient, an organic restaurant in El Paso, Tex., and Mainstream Electric, Heating & Cooling in Post Falls, Idaho. Officially launched last May, FAB had delivered 1.3 million meals, with another 3 million committed, by early March. Not a bad debut. But at that rate, how can Jain and Sisneros hope to come close to their self-appointed goal? Don’t underestimate their conviction and grit. Sisneros and Jain make an odd couple. They’re temperamental contrasts, men who grew up half a world away from each other. But each has struggled for his achievements, wrestling with personal demons and professional challenges. Both have been humbled by failures that forced them to reinvent themselves a few times, drawing on deep resources for rebounding. And they both found a common purpose through Tony Robbins. Jain grew up in Muzaffarnagar, India, a relatively small city northeast of New Delhi, the son of a homemaker and a father who ran a family-owned cardboard business. “We were not wealthy, but we didn’t grow up with scarcity,” Jain recalls. His mom taught him about love and abundance through food; she was a wonderful cook. From his father he learned about integrity and honoring commitments by taking care of his employees until an unsustainable debt load forced him to shutter the business 25 years ago. Jain excelled in school, even without trying very hard. The more he learned of America in magazines and movies, the more he fantasized about moving to the States. He got that chance after getting a B.Com. at University of Allahabad and an M.Com. at Delhi School of Economics before applying for the MBA program at University of Buffalo. He earned his keep with a research assistantship — and nearly lost it because he wasn’t applying himself. “I wish I could say I knew what I wanted to do with my life, but I didn’t,” says Jain. “I just knew I was meant to do something.” Chided by his advisor, he poured on the work and ended up getting a doctorate. By the time he got a teaching job at Southern Methodist University, Jain had married an American woman. After a few years, he felt stuck: “I was 32. I’d published in good journals, got teaching awards — I’d done it all in academics. What do I could now?” Life intervened. Jain’s wife gave birth to a boy with situs inversus totalis, a rare condition in which the internal organs are reversed from their normal positions. “It was a very difficult time for all of us,” Jain remembers. “My 4-year-old daughter couldn’t go near or touch her brother.” The family coped with the new situation. But not long after, Jain got an offer to move from Dallas to Indianapolis and join Resort Condominiums International (RCI), at the time a big player in timeshare vacation exchanges. “It was a very important job with a huge budget and a lot of people all over the world,” says Jain. “But I was very insecure. I started to question who I was.” Worse, RCI, by then a division of hotel franchisor HFS, was spun off to settle an anti-monopoly complaint by the Federal Trade Commission against a new acquirer, CUC International. As a result, Jain’s substantial shares lost most of their value. Time to start over. Jain poured himself into his first startup. Raising money from friends and contacts within the race-car industry, he launched Ultimate Race Vacation, an online site that offered package deals and tickets to events like the Indy 500, as well as information on races, cars, and drivers. After topping out a ridiculous $200 million valuation on revenue of $36,000, the business wiped out, along with the dot-com boom. Jain blames himself for poorly managing the process. He lost everything, including some close friendships. As his finances collapsed, so did Jain’s marriage. With bills to pay, along with alimony and private school tuitions for his kids, he started to ignore calls from companies and collection agencies that dunned him for $154,000 in debt. He went so far as to download papers for bankruptcy. But he couldn’t pull the trigger. “An inner voice told me, ‘Don’t do it.’” A good thing: Declaring bankruptcy would have prevented him from serving as an officer of an insurance company. Slowly, he began renegotiating his debt with creditors. Jain’s career picked up a new thread in Atlanta, when he joined American Safety Insurance Holdings, which offered specialty coverage to small and mid-sized companies. The next decade brought rare stability and success. Jain rose to become chief underwriting officer and helped increase revenue tenfold. He also met his second wife, a school principal. But when American Safety sold itself to Fairfax Financial Holdings in late 2013, Jain found himself on the street again. “I was used to being a very busy guy — not sitting around reading the Wall Street Journal for six hours a day with nobody to talk to,” he says. Two business friends started talking about Tony Robbins’ seminars. So did Jain’s wife, who had read Awaken the Giant Within, Robbins’ bestseller. He decided to attend a seminar to see what the fuss was about. “I was amazed to see more than 5,000 people all participating, jumping up and down,” he recalls. “No one was talking on their cellphones, nobody was texting. I saw a level of engagement, of performance I’d never seen before.” He and his wife became Platinum Partners. Membership is limited to 250 people who pay $75,000 a year to have access to Robbins and go with him on adventure trips to places like Bora Bora, Egypt’s Pyramids, and the Great Wall of China. It was through the partnership that FAB was born. “Tony encouraged me to share my idea of a billion individual acts of kindness at an event last year,” Jain remembers. “I asked him to match 400 million meals. He gave me a hug and said, ‘Let’s do it.’ He helped me see that the best way to be is to serve: It’s not about me; it’s what I can do for others.” In May 2016, Jain had incorporated FAB as a 501(c)3. He was giving his own money to support nonprofit organizations throughout different regions of the globe, including the U.S. But by August, he realized the approach wasn’t sustainable or scalable. So he reached out to another Platinum Partner, who was running a couple dozen businesses under the holding company Anton Jae Global. In his element — AJ Jain advancing Feed a Billion with the help of philanthropic-minded celebrities such as Halle Berry (Image Courtesy of City Summit and Gala 2017) Jason Sisneros had been the top trainer for Tony Robbins over four consecutive years. When Jain reached out, he was vacationing in Greece. At first Sisneros hesitated. Then he said yes, but insisted, “You’ve gotta listen to me.” During one of his three-day Deep Dives, he tore apart everything Jain had put together. “Charities are either really good at raising money and not so good at turning that money into outcomes and impact — or they’re really good at outcomes and not so good at raising funds,” says Sisneros. He created a model that tries to succeed at both goals. The key is relying on company sponsors, giving them two clear incentives: Donating meals to FAB helps them feel they were doing their part for corporate social responsibility; encouraging Facebook fans, particularly millennials, to engage gives companies a much better bang for their advertising dollar, which can be written off. So far, FAB has chosen to distribute meals through just three non-governmental organizations it has carefully vetted: Feeding America, SERV International, and Akshaya Patra. “We look at hunger as a business opportunity,” says Sisneros — even though he and Jain aren’t making a nickel off the campaign and don’t intend to. (In fact, their own bank accounts are lighter by a few tens of thousands of dollars, thanks to fees for attorneys, accountants, and regulatory filings.) Given his upbringing, Sisneros is an unlikely candidate to become the key advisor to Feed A Billion. Given what he has made of his life, he was inevitably cast for the role. Born to a teenage mother out of wedlock, Sisneros was raised in an abusive home straight out of a fairy tale nightmare. His adopted father routinely beat him at the slightest provocation, or none at all, starting when he was a little kid in the Denver area. He sometimes got a respite from his grandparents, who grabbed him away for a weekend or so — only to get slapped around on his return. Sisneros believes his adopted father provided muscle for a gang doing large-scale drug deals. To stay ahead of the law, he constantly moved his family to small towns like Conda, Idaho and Ordway, Colo., picking up spare jobs (ironically, one was working at a center for troubled youths) and doing work for the gang. His mother tried to protect him and got slapped around for her trouble. Once she grabbed Sisneros and his brother and fled Durango, Colo. Sisneros says his adopted father, John C. Armintrout, found out she had left and called them up, threatening to kill his grandparents and aunt unless they all returned. Calls to the cops, Sisneros says, did little to stop Armintrout, who spent no more than a couple of weeks in jail — and did no time even after he rammed the VW Bug carrying Sisneros and his mother off the road. “He was associated with people who had ‘influence’ over police and judges,” Sisneros recalls. How did Sisneros survive? He read whatever he could get his hands on — and lost himself in the Bible, Jack London adventures, C.S. Lewis fantasies. “I loved stories about knights and dragons, fighting bad guys,” he says. “I imagined I was somebody who was chivalrous and would die to save his maiden and the kingdom.” And he started pumping iron with a set his grandfather had given him and learning to wrestle in school. He wanted to be able to stand up to his adopted father, even if he promised himself he would never fight back. Eventually, this untenable situation reached a breaking point. When Sisneros was 16, Armintrout bought a wreck — a green Honda Civic hatchback — for $250 and told him he could have it if he could get it running. It was less as a gift than a challenge and a taunt since he knew Sisneros couldn’t handle a screwdriver and that the car was a hopeless heap. But the kid had it towed to his friend whose father knew something about cars, and the three of them eventually got the Honda running. Sisneros rode the car triumphantly up his driveway and got out. Armintrout knocked him down and kicked him out of the house. Now on his own, Sisneros became more of a dragon than a white knight. Like his adopted father, he took odd jobs and dealt drugs on the side. His particular forte: collecting money from reluctant debtors. There was still one more showdown with his adopted father. Sisneros went back to his mom’s house to retrieve some of his things and, down in the basement, founds holes in a wall that suggested the height of his mother’s head and shoulders. He called out to her, but got no answer. Then he phoned the police, who found his mother beaten and bloody. As the cops walked out with Armintrout, he whispered to Sisneros, “You’re dead.” He and his mother went into protective custody. That wasn’t the end of it. Armintrout posted bail and broke into their home, cut the gas pipes and scattered combustible material so that opening a door or window would spark an explosion. After the neighbors reported the smell of gas, a warrant went out for Armintrout’s arrest. Eluding authorities, he tracked down Sisneros and his mom in their protective custody apartment and, gun drawn, knocked on the door. Finger pressed to his lips he told Sisneros, “Come with me. I’m gonna kill you, but I’m not gonna do anything to your mom.” When they drove out to Rifle Gap State Park, Armintrout told him to get out of the car and start walking. “I’m thinking, ‘This is it. I’m 17 and I’m gonna die here,’” Sisneros recalls. But Armintrout shocked him by turning back to his truck and heading for town. “I thought, ‘Oh, man, he’s going back to get my mom.’” Sisneros ran eight or 10 miles before being picked up along the route and delivered to the house. His mother was alive. Armintrout was charged with arson with intent and attempted murder. Sentenced to 31 years, he served 18 years before being killed in a car crash. None of this put Sisneros on the path to saving damsels in distress. “I joined ‘the family business,’” he says acidly. “I dealt drugs and beat people up.” He got a woman pregnant after a one-night stand. The day his son was born, Sisneros was in the middle of a drug deal in Denver that went bad. Someone sank a knife into his chest, just missing his heart. “Something popped into my head about the sins of the father visited on his children,” he remembers. “I thought, ‘I have to stop doing what I’m doing.’” That day his gang life ended — he had the standing and toughness so that his drug compadres wouldn’t mess with him. But he had no idea of his next move. He married and started a series of low-paying jobs peeling logs for cabins and working in a mine, then apprenticing for laying carpet. Putting in five years of sweat equity, Sisneros finally found a measure of prosperity, buying a home for his mother, a big house and boat for himself, and taking long vacations. But by the time he acquired the carpet company from his partner, he discovered that he’d bought a business on the edge of bankruptcy; two of his startups (a gym and a small real-estate company) also failed. He had panic attacks. His wife left him. Faced with a mortgage he couldn’t service and subcontractors and suppliers he couldn’t pay, Sisneros sold off what he could to satisfy his debts and took his new second wife and her kids with him to southern California. A change of scenery didn’t cure him. As his panic attacks worsened, he drank more. His money ran down; his second wife ran off with the kids. “I went to the Dana Point pier and slept on the beach,” Sisneros says. “three months later I said to myself, ‘I think you get to call yourself a homeless man now.’” Taking himself to a shelter sponsored by Pastor Rick Warren’s Saddleback Church, Sisneros had his first meal in days: a black-speckled head of cauliflower and a few mushy bananas. He rejected an offered Bible, but accepted a second book: Awaken the Giant Within by Tony Robbins. “That was the beginning of my turning point,” says Sisneros. “Some days my brain was so scrambled I couldn’t read.” But Robbins’ message began to break through: You can blame everybody else in the world for your misery, but it’s all really on you — and if you own up to your worst situation, you can also change your life for the better. Little by little, that is. In one of those road-to-Damascus coincidences, Sisneros was walking the streets of San Juan Capistrano one day when he saw a poster advertising a Tony Robbins event in Chicago. With tickets, round-trip airfare, and hotel, he figured he’d need $900. “It might as well have been a million bucks,” Sisneros thought. To raise the money, he broke a promise to himself and did one more drug deal. Once at the seminar, he went down the old path one larcenous step further in order to get close to Robbins. “I had a wallet full of worthless credit cards. It cost $12,000 to join Mastery University, go up onstage, and shake Tony’s hand.” So he surrendered a card, knowing it would bounce. “When I got onstage I pulled Tony in and said, ‘I’m gonna pay you back for this.’ He looked at me and said, ‘I believe you.’ He probably didn’t remember me two seconds later.” But Sisneros left with a renewed sense of purpose. Back in San Juan Capistrano, he picked up some pants, shirts, shoes, and a tie at second-hand store, and got a job selling cars for a Ford dealership. He started an online auto business with a friend that went nowhere. Meantime, though, he made good on the 12 grand to Tony Robbins and attended a life mastery course in Vieques, Puerto Rico. At dinner there one night, he sat next to Loren Slocum, the wife of Shore Slocum who was Robbins’ first employee, and shared his life story with her. She immediately called Robbins and found out he had two job openings: one in the call center; the other, as a field sales rep. Sisneros didn’t want to deal with phones, but he was terrified of public speaking. “‘Don’t be a pussy,’” Loren Slocum told him. That was an unexpected slap — but it knocked some sense into him. Sisneros got the field-sales script, memorized it, and auditioned for the job. When it came time to present, he panicked and drew a complete blank. But he started talking about what Robbins meant to him and how he was trying to turn his life around. He got the job, went on the road, and became a top producer. While traveling with Robbins, he took executives to lunch and grilled them about their successes and setbacks. And he constantly reflected about his own experiences, trying to turn his long list of mistakes and failures into lessons that businesses might find useful. Out of this emerged a template for restructuring companies based on a couple of basic questions (How can I add massive value to my clients and teammates right now? What business are we really in?) and a resolute focus on desired outcomes (What are we trying to achieve?). That’s the essence of Sisneros’ three-day Deep Dive, which he has applied to the many companies he has consulted with. “I’ve taken all the concepts from books, talking to businesses, and my own trials and errors,” he says. “The system increases cash flow, solves culture problems, and produces predictable and sustainable income.” It has worked for the three-dozen or so companies he has acquired for Anton Jae, which include companies in janitorial and food services, car washes, solar panels, real-estate development, an animation firm, and health clubs. Now he’s bringing that discipline to Feed A Billion. When it comes to charities, he asks, “What is the key performance indicator of success?” Sisneros notes that the world long ago solved the ability to produce and store food effectively. Its biggest problem is distribution. “Why can Amazon deliver something in a couple of hours, but we can’t deliver food to people who need it in Africa or India?” he asks. Adds Abuj Jain: “When you go outside the U.S., the infrastructure for delivery often doesn’t exist.” In many places, you have to deal with warlords and corrupt officials. That makes the challenge of finding the right organization to partner with all the more daunting. What about groups like Oxfam, CARE, and Save the Children that have been doing this kind of work for years? Sisneros and Jain point out that if they were so good at their mission, widespread hunger wouldn’t exist. That’s why they’re anxious to create a new model — building awareness of hunger through social media and finding innovative ways to distribute food. Still, the challenge seems close to impossible. FAB has only three small corporate sponsors and has taken but the first of a thousand steps toward its goal of a billion meals. “We’re relentless,” says Sisneros. “This is about kids who did nothing wrong except get born. They’re hungry, they’re living with learning disabilities, and they die.” As Mother Teresa once said, speaking about spiritual as well as bodily needs, “If you can’t feed a hundred people, then feed just one.” That’s stubborn courage. Call to Action This article was developed in conjunction with Dr. Tom Post, Ph.D, SVP of Content Strategy for SnappConner PR. Since February 2017, SnappConner PR has led the press communication for Feed a Billion. Readers who would like more information about the FAB program, its partnerships, or ways to be involved can reach out directly to www.FeedABillion.org. ", "title": "Hunger Games", "sentences": [{"9287": "Feed a Billion is workign to address world hunger (Stock photo via 123rf.com)"}, {"0452": "Hunger Games"}, {"2ee6": "Two unlikely entrepreneurs are teaming up to serve 1 billion meals to the world’s starving — in less than four years. How?"}, {"637e": "Every day nearly 22,000 people die from hunger, one every four seconds. One in nine souls survives each day without enough food — almost 800 million people worldwide are undernourished, 42 million of them in America."}, {"238a": "Hunger is as old as the human condition. For most of the first 200,000 or so years that humans have been around, it was largely an issue of scarcity and hunting skills. But even with 20,000 years of farming behind us, the gnawing problem persists."}, {"fbba": "The challenge isn’t a shortage of food. Thanks to innovations in efficient agriculture, the world produces 17% more food per capita than it needs. Instead, the lingering hurdles are poverty, poor distribution, and conflict. Throw on top of that donor fatigue — “What, another crisis I have to worry about?” — and it’s easy to understand why no one has solved the problem."}, {"4696": "So why would two otherwise successful entrepreneurs bother to take on such an intractable crisis?"}, {"5c9f": "“Because it’s better than if we do nothing,” says Jason Sisneros, 45. “You step into the world of nonprofit and people are not business-minded. They set themselves up to fail. We’re looking to innovate.” Blunt and bullet-headed, Sisneros has bought, turned around, and sold dozens of companies, losing a few in the process, and turning those hard-knocks lessons into a consulting company that starts its process of working with clients and potential acquisitions with a tough-minded three-day management course he calls the Deep Dive. Sisneros is something of a drill sergeant with a tender penchant for hopeless causes."}, {"040d": "“We have to do something,” adds Ambuj “A.J.” Jain, a 56-year-old former insurance executive who is putting together an investment fund in Atlanta, called 2 Pillars. “We may not solve the problem of hunger, but if we don’t start, how do we get to the ultimate solution?” Jain’s approach is lower-key, but no less passionate."}, {"ab03": "Miss J. Alexander, judge for America’s Top Model, with Jason Sisneros, FAB CEO (Image courtesy of Feed a Billion)"}, {"976f": "Sisneros and Jain have joined forces in a project called Feed A Billion (FAB). Its goal is to serve a billion meals by Nov. 20, 2020 — not to give out one meal per person but to develop a system to feed tens of millions of people on a consistent basis. They’re working with a handful of nonprofit organizations in the U.S., India, and Kenya to distribute the food."}, {"9eb7": "Here’s how it works. You can donate directly to the site (www.feedabillion.org), knowing that every dollar you contribute buys and delivers 10 meals; $24 feeds a family of four for a month. Or you can activate the wallets of corporate sponsors via social media campaigns. A “like” of FAB’s Facebook page triggers one donated meal; sharing the page unleashes ten meals. Every meal paid for by an individual or a company is matched by celebrity life strategist and philanthropist Tony Robbins, who helped inspire the drive."}, {"176c": "FAB did a beta test in November 2016. A small Las Vegas startup called Live Bearded, which sells grooming products, conducted a month-long social media campaign on behalf of Feed A Billion. Impressive results: a 121% jump in beard-care sales that month (on a 28% rise in promotional costs), generating 55,000 donated meals. Live Bearded has since signed up for an official sponsorship. So have Green Ingredient, an organic restaurant in El Paso, Tex., and Mainstream Electric, Heating & Cooling in Post Falls, Idaho."}, {"e9f5": "Officially launched last May, FAB had delivered 1.3 million meals, with another 3 million committed, by early March. Not a bad debut. But at that rate, how can Jain and Sisneros hope to come close to their self-appointed goal?"}, {"fec3": "Don’t underestimate their conviction and grit."}, {"d39a": "Sisneros and Jain make an odd couple. They’re temperamental contrasts, men who grew up half a world away from each other. But each has struggled for his achievements, wrestling with personal demons and professional challenges. Both have been humbled by failures that forced them to reinvent themselves a few times, drawing on deep resources for rebounding. And they both found a common purpose through Tony Robbins."}, {"0056": "Jain grew up in Muzaffarnagar, India, a relatively small city northeast of New Delhi, the son of a homemaker and a father who ran a family-owned cardboard business. “We were not wealthy, but we didn’t grow up with scarcity,” Jain recalls. His mom taught him about love and abundance through food; she was a wonderful cook. From his father he learned about integrity and honoring commitments by taking care of his employees until an unsustainable debt load forced him to shutter the business 25 years ago. Jain excelled in school, even without trying very hard. The more he learned of America in magazines and movies, the more he fantasized about moving to the States."}, {"2b48": "He got that chance after getting a B.Com. at University of Allahabad and an M.Com. at Delhi School of Economics before applying for the MBA program at University of Buffalo. He earned his keep with a research assistantship — and nearly lost it because he wasn’t applying himself. “I wish I could say I knew what I wanted to do with my life, but I didn’t,” says Jain. “I just knew I was meant to do something.” Chided by his advisor, he poured on the work and ended up getting a doctorate. By the time he got a teaching job at Southern Methodist University, Jain had married an American woman. After a few years, he felt stuck: “I was 32. I’d published in good journals, got teaching awards — I’d done it all in academics. What do I could now?”"}, {"8608": "Life intervened. Jain’s wife gave birth to a boy with situs inversus totalis, a rare condition in which the internal organs are reversed from their normal positions. “It was a very difficult time for all of us,” Jain remembers. “My 4-year-old daughter couldn’t go near or touch her brother.” The family coped with the new situation. But not long after, Jain got an offer to move from Dallas to Indianapolis and join Resort Condominiums International (RCI), at the time a big player in timeshare vacation exchanges. “It was a very important job with a huge budget and a lot of people all over the world,” says Jain. “But I was very insecure. I started to question who I was.” Worse, RCI, by then a division of hotel franchisor HFS, was spun off to settle an anti-monopoly complaint by the Federal Trade Commission against a new acquirer, CUC International. As a result, Jain’s substantial shares lost most of their value."}, {"8dc6": "Time to start over. Jain poured himself into his first startup. Raising money from friends and contacts within the race-car industry, he launched Ultimate Race Vacation, an online site that offered package deals and tickets to events like the Indy 500, as well as information on races, cars, and drivers. After topping out a ridiculous $200 million valuation on revenue of $36,000, the business wiped out, along with the dot-com boom. Jain blames himself for poorly managing the process. He lost everything, including some close friendships."}, {"0526": "As his finances collapsed, so did Jain’s marriage. With bills to pay, along with alimony and private school tuitions for his kids, he started to ignore calls from companies and collection agencies that dunned him for $154,000 in debt. He went so far as to download papers for bankruptcy. But he couldn’t pull the trigger. “An inner voice told me, ‘Don’t do it.’” A good thing: Declaring bankruptcy would have prevented him from serving as an officer of an insurance company. Slowly, he began renegotiating his debt with creditors."}, {"0338": "Jain’s career picked up a new thread in Atlanta, when he joined American Safety Insurance Holdings, which offered specialty coverage to small and mid-sized companies. The next decade brought rare stability and success. Jain rose to become chief underwriting officer and helped increase revenue tenfold. He also met his second wife, a school principal."}, {"bd6d": "But when American Safety sold itself to Fairfax Financial Holdings in late 2013, Jain found himself on the street again. “I was used to being a very busy guy — not sitting around reading the Wall Street Journal for six hours a day with nobody to talk to,” he says."}, {"41dc": "Two business friends started talking about Tony Robbins’ seminars. So did Jain’s wife, who had read Awaken the Giant Within, Robbins’ bestseller. He decided to attend a seminar to see what the fuss was about. “I was amazed to see more than 5,000 people all participating, jumping up and down,” he recalls. “No one was talking on their cellphones, nobody was texting. I saw a level of engagement, of performance I’d never seen before.” He and his wife became Platinum Partners. Membership is limited to 250 people who pay $75,000 a year to have access to Robbins and go with him on adventure trips to places like Bora Bora, Egypt’s Pyramids, and the Great Wall of China."}, {"84d1": "It was through the partnership that FAB was born. “Tony encouraged me to share my idea of a billion individual acts of kindness at an event last year,” Jain remembers. “I asked him to match 400 million meals. He gave me a hug and said, ‘Let’s do it.’ He helped me see that the best way to be is to serve: It’s not about me; it’s what I can do for others.”"}, {"a3bd": "In May 2016, Jain had incorporated FAB as a 501(c)3. He was giving his own money to support nonprofit organizations throughout different regions of the globe, including the U.S. But by August, he realized the approach wasn’t sustainable or scalable. So he reached out to another Platinum Partner, who was running a couple dozen businesses under the holding company Anton Jae Global."}, {"7f2a": "In his element — AJ Jain advancing Feed a Billion with the help of philanthropic-minded celebrities such as Halle Berry (Image Courtesy of City Summit and Gala 2017)"}, {"0073": "Jason Sisneros had been the top trainer for Tony Robbins over four consecutive years. When Jain reached out, he was vacationing in Greece. At first Sisneros hesitated. Then he said yes, but insisted, “You’ve gotta listen to me.” During one of his three-day Deep Dives, he tore apart everything Jain had put together. “Charities are either really good at raising money and not so good at turning that money into outcomes and impact — or they’re really good at outcomes and not so good at raising funds,” says Sisneros."}, {"049a": "He created a model that tries to succeed at both goals. The key is relying on company sponsors, giving them two clear incentives: Donating meals to FAB helps them feel they were doing their part for corporate social responsibility; encouraging Facebook fans, particularly millennials, to engage gives companies a much better bang for their advertising dollar, which can be written off. So far, FAB has chosen to distribute meals through just three non-governmental organizations it has carefully vetted: Feeding America, SERV International, and Akshaya Patra."}, {"fa75": "“We look at hunger as a business opportunity,” says Sisneros — even though he and Jain aren’t making a nickel off the campaign and don’t intend to. (In fact, their own bank accounts are lighter by a few tens of thousands of dollars, thanks to fees for attorneys, accountants, and regulatory filings.)"}, {"b9be": "Given his upbringing, Sisneros is an unlikely candidate to become the key advisor to Feed A Billion. Given what he has made of his life, he was inevitably cast for the role."}, {"9ed1": "Born to a teenage mother out of wedlock, Sisneros was raised in an abusive home straight out of a fairy tale nightmare. His adopted father routinely beat him at the slightest provocation, or none at all, starting when he was a little kid in the Denver area. He sometimes got a respite from his grandparents, who grabbed him away for a weekend or so — only to get slapped around on his return. Sisneros believes his adopted father provided muscle for a gang doing large-scale drug deals. To stay ahead of the law, he constantly moved his family to small towns like Conda, Idaho and Ordway, Colo., picking up spare jobs (ironically, one was working at a center for troubled youths) and doing work for the gang."}, {"f0cc": "His mother tried to protect him and got slapped around for her trouble. Once she grabbed Sisneros and his brother and fled Durango, Colo. Sisneros says his adopted father, John C. Armintrout, found out she had left and called them up, threatening to kill his grandparents and aunt unless they all returned. Calls to the cops, Sisneros says, did little to stop Armintrout, who spent no more than a couple of weeks in jail — and did no time even after he rammed the VW Bug carrying Sisneros and his mother off the road. “He was associated with people who had ‘influence’ over police and judges,” Sisneros recalls."}, {"312c": "How did Sisneros survive? He read whatever he could get his hands on — and lost himself in the Bible, Jack London adventures, C.S. Lewis fantasies. “I loved stories about knights and dragons, fighting bad guys,” he says. “I imagined I was somebody who was chivalrous and would die to save his maiden and the kingdom.” And he started pumping iron with a set his grandfather had given him and learning to wrestle in school. He wanted to be able to stand up to his adopted father, even if he promised himself he would never fight back."}, {"ec2e": "Eventually, this untenable situation reached a breaking point. When Sisneros was 16, Armintrout bought a wreck — a green Honda Civic hatchback — for $250 and told him he could have it if he could get it running. It was less as a gift than a challenge and a taunt since he knew Sisneros couldn’t handle a screwdriver and that the car was a hopeless heap. But the kid had it towed to his friend whose father knew something about cars, and the three of them eventually got the Honda running. Sisneros rode the car triumphantly up his driveway and got out. Armintrout knocked him down and kicked him out of the house."}, {"532d": "Now on his own, Sisneros became more of a dragon than a white knight. Like his adopted father, he took odd jobs and dealt drugs on the side. His particular forte: collecting money from reluctant debtors."}, {"8fdb": "There was still one more showdown with his adopted father."}, {"5930": "Sisneros went back to his mom’s house to retrieve some of his things and, down in the basement, founds holes in a wall that suggested the height of his mother’s head and shoulders. He called out to her, but got no answer. Then he phoned the police, who found his mother beaten and bloody. As the cops walked out with Armintrout, he whispered to Sisneros, “You’re dead.” He and his mother went into protective custody."}, {"7fa9": "That wasn’t the end of it. Armintrout posted bail and broke into their home, cut the gas pipes and scattered combustible material so that opening a door or window would spark an explosion. After the neighbors reported the smell of gas, a warrant went out for Armintrout’s arrest. Eluding authorities, he tracked down Sisneros and his mom in their protective custody apartment and, gun drawn, knocked on the door. Finger pressed to his lips he told Sisneros, “Come with me. I’m gonna kill you, but I’m not gonna do anything to your mom.” When they drove out to Rifle Gap State Park, Armintrout told him to get out of the car and start walking. “I’m thinking, ‘This is it. I’m 17 and I’m gonna die here,’” Sisneros recalls."}, {"06e4": "But Armintrout shocked him by turning back to his truck and heading for town. “I thought, ‘Oh, man, he’s going back to get my mom.’” Sisneros ran eight or 10 miles before being picked up along the route and delivered to the house. His mother was alive. Armintrout was charged with arson with intent and attempted murder. Sentenced to 31 years, he served 18 years before being killed in a car crash."}, {"da6a": "None of this put Sisneros on the path to saving damsels in distress. “I joined ‘the family business,’” he says acidly. “I dealt drugs and beat people up.” He got a woman pregnant after a one-night stand. The day his son was born, Sisneros was in the middle of a drug deal in Denver that went bad. Someone sank a knife into his chest, just missing his heart. “Something popped into my head about the sins of the father visited on his children,” he remembers. “I thought, ‘I have to stop doing what I’m doing.’” That day his gang life ended — he had the standing and toughness so that his drug compadres wouldn’t mess with him. But he had no idea of his next move."}, {"e89e": "He married and started a series of low-paying jobs peeling logs for cabins and working in a mine, then apprenticing for laying carpet. Putting in five years of sweat equity, Sisneros finally found a measure of prosperity, buying a home for his mother, a big house and boat for himself, and taking long vacations. But by the time he acquired the carpet company from his partner, he discovered that he’d bought a business on the edge of bankruptcy; two of his startups (a gym and a small real-estate company) also failed. He had panic attacks. His wife left him. Faced with a mortgage he couldn’t service and subcontractors and suppliers he couldn’t pay, Sisneros sold off what he could to satisfy his debts and took his new second wife and her kids with him to southern California."}, {"0224": "A change of scenery didn’t cure him. As his panic attacks worsened, he drank more. His money ran down; his second wife ran off with the kids. “I went to the Dana Point pier and slept on the beach,” Sisneros says. “three months later I said to myself, ‘I think you get to call yourself a homeless man now.’” Taking himself to a shelter sponsored by Pastor Rick Warren’s Saddleback Church, Sisneros had his first meal in days: a black-speckled head of cauliflower and a few mushy bananas. He rejected an offered Bible, but accepted a second book: Awaken the Giant Within by Tony Robbins."}, {"47ad": "“That was the beginning of my turning point,” says Sisneros. “Some days my brain was so scrambled I couldn’t read.” But Robbins’ message began to break through: You can blame everybody else in the world for your misery, but it’s all really on you — and if you own up to your worst situation, you can also change your life for the better."}, {"fc99": "Little by little, that is. In one of those road-to-Damascus coincidences, Sisneros was walking the streets of San Juan Capistrano one day when he saw a poster advertising a Tony Robbins event in Chicago. With tickets, round-trip airfare, and hotel, he figured he’d need $900. “It might as well have been a million bucks,” Sisneros thought. To raise the money, he broke a promise to himself and did one more drug deal. Once at the seminar, he went down the old path one larcenous step further in order to get close to Robbins. “I had a wallet full of worthless credit cards. It cost $12,000 to join Mastery University, go up onstage, and shake Tony’s hand.” So he surrendered a card, knowing it would bounce. “When I got onstage I pulled Tony in and said, ‘I’m gonna pay you back for this.’ He looked at me and said, ‘I believe you.’ He probably didn’t remember me two seconds later.”"}, {"c796": "But Sisneros left with a renewed sense of purpose. Back in San Juan Capistrano, he picked up some pants, shirts, shoes, and a tie at second-hand store, and got a job selling cars for a Ford dealership. He started an online auto business with a friend that went nowhere. Meantime, though, he made good on the 12 grand to Tony Robbins and attended a life mastery course in Vieques, Puerto Rico. At dinner there one night, he sat next to Loren Slocum, the wife of Shore Slocum who was Robbins’ first employee, and shared his life story with her."}, {"bd64": "She immediately called Robbins and found out he had two job openings: one in the call center; the other, as a field sales rep. Sisneros didn’t want to deal with phones, but he was terrified of public speaking. “‘Don’t be a pussy,’” Loren Slocum told him. That was an unexpected slap — but it knocked some sense into him. Sisneros got the field-sales script, memorized it, and auditioned for the job. When it came time to present, he panicked and drew a complete blank. But he started talking about what Robbins meant to him and how he was trying to turn his life around. He got the job, went on the road, and became a top producer."}, {"23bf": "While traveling with Robbins, he took executives to lunch and grilled them about their successes and setbacks. And he constantly reflected about his own experiences, trying to turn his long list of mistakes and failures into lessons that businesses might find useful. Out of this emerged a template for restructuring companies based on a couple of basic questions (How can I add massive value to my clients and teammates right now? What business are we really in?) and a resolute focus on desired outcomes (What are we trying to achieve?)."}, {"d5a8": "That’s the essence of Sisneros’ three-day Deep Dive, which he has applied to the many companies he has consulted with. “I’ve taken all the concepts from books, talking to businesses, and my own trials and errors,” he says. “The system increases cash flow, solves culture problems, and produces predictable and sustainable income.” It has worked for the three-dozen or so companies he has acquired for Anton Jae, which include companies in janitorial and food services, car washes, solar panels, real-estate development, an animation firm, and health clubs."}, {"5890": "Now he’s bringing that discipline to Feed A Billion. When it comes to charities, he asks, “What is the key performance indicator of success?” Sisneros notes that the world long ago solved the ability to produce and store food effectively. Its biggest problem is distribution. “Why can Amazon deliver something in a couple of hours, but we can’t deliver food to people who need it in Africa or India?” he asks."}, {"b5fd": "Adds Abuj Jain: “When you go outside the U.S., the infrastructure for delivery often doesn’t exist.” In many places, you have to deal with warlords and corrupt officials. That makes the challenge of finding the right organization to partner with all the more daunting."}, {"1dae": "What about groups like Oxfam, CARE, and Save the Children that have been doing this kind of work for years? Sisneros and Jain point out that if they were so good at their mission, widespread hunger wouldn’t exist."}, {"a77c": "That’s why they’re anxious to create a new model — building awareness of hunger through social media and finding innovative ways to distribute food."}, {"9b9c": "Still, the challenge seems close to impossible. FAB has only three small corporate sponsors and has taken but the first of a thousand steps toward its goal of a billion meals. “We’re relentless,” says Sisneros. “This is about kids who did nothing wrong except get born. They’re hungry, they’re living with learning disabilities, and they die.”"}, {"054c": "As Mother Teresa once said, speaking about spiritual as well as bodily needs, “If you can’t feed a hundred people, then feed just one.”"}, {"a259": "That’s stubborn courage."}, {"576c": "Call to Action"}, {"45ba": "This article was developed in conjunction with Dr. Tom Post, Ph.D, SVP of Content Strategy for SnappConner PR. Since February 2017, SnappConner PR has led the press communication for Feed a Billion. Readers who would like more information about the FAB program, its partnerships, or ways to be involved can reach out directly to www.FeedABillion.org."}], "child": "1424_1\t1424_2"}