{"name": "1426", "parent": "", "content": "Next Stop…the University of Kentucky! I’m excited to announce I will be an Adjunct Instructor this Spring in the Gatton College of Business & Economics at the University of Kentucky. I will be teaching an Introduction to Social Entrepreneurship course. A ton of headway has been made in Kentucky as it pertains to the cause of social entrepreneurship and impact investing but we still have a long way to go. That is why it is even more exciting to be joining (in a small way) the team at the University of Kentucky as they also announced just recently Nate Morris of Rubicon Global as an Entrepreneur-In-Residence with the goal to establish a Center for Social Entrepreneurship. Hopefully soon, Kentucky will be a national leader in creative strategies for solving community and environmental problems. For those of you that have taught this type of course before… I would love to hear your thoughts on resources and/or case studies. It is intended to be a highly practical semester so any and all suggestions are welcome! ", "title": "Next Stop…the University of Kentucky!", "sentences": [{"ac95": "Next Stop…the University of Kentucky!"}, {"c542": "I’m excited to announce I will be an Adjunct Instructor this Spring in the Gatton College of Business & Economics at the University of Kentucky. I will be teaching an Introduction to Social Entrepreneurship course."}, {"12bc": "A ton of headway has been made in Kentucky as it pertains to the cause of social entrepreneurship and impact investing but we still have a long way to go. That is why it is even more exciting to be joining (in a small way) the team at the University of Kentucky as they also announced just recently Nate Morris of Rubicon Global as an Entrepreneur-In-Residence with the goal to establish a Center for Social Entrepreneurship. Hopefully soon, Kentucky will be a national leader in creative strategies for solving community and environmental problems."}, {"6831": "For those of you that have taught this type of course before…"}, {"b5cb": "I would love to hear your thoughts on resources and/or case studies. It is intended to be a highly practical semester so any and all suggestions are welcome!"}], "child": "1426_1"}