{"name": "1431", "parent": "", "content": "That First YouTube Video So last year my partner and I decided that in order to move our project forward, we would need a community. A community of people who we could share our idea’s and experiences with and a community where we could learn from others with similar goals, passions and interests. We are in the (slow) process of creating an innovative educational game that will support both ESL teachers and learners. Right now it seems like a deep deep pool, where although it’s all sparkly at the top with the sun reflecting off the water, that thought creeps in that you don’t know what’s down there, you don’t know how deep it is, and you don’t know if your feet will ever be able to touch the ground. Scary right? Well, that’s kinda what I also though when my partner suggested that the best place to find a community would be on YouTube. A great idea, except it’s ME who’s supposed to do the talking. The thought of sending out a video into the great abyss that is the internet was petrifying. I struggled with the thought of it for weeks. I kept putting it off, kept trying to record something and then deleting it as quickly as possible in fear that my phone might upload it on it’s own and that would be the end. Of everything. Terribly dramatic yes. In my first few video’s I couldn’t even make eye contact with the green little light on the camera. But I was convinced about the idea. And I did want it done. I think I had to get to that moment when I was just so frustrated with my incompetence that I sat down at my laptop, moved the window that showed a reflection of my face to the bottom of the screen so that I wouldn’t have to look at myself, and just started talking. I managed to say what I wanted from start to finish for the first time without stopping and deleting and I uploaded it to our shared googledrive to get feedback from my partner and my best friend and we decided to go with it. My best friend took out some of the longer pauses and “umm’s” and it was ready to be very consciously uploaded to the interwebs. Aaaah! It’s not great. I know it isn’t. Lighting, visibility etc. But I broke past something I thought I’d never have the courage to do. Of course I don’t know if I’d have done it without people backing me up on it. But the first one is done and I know the next one can be so much better! And most importantly, I WANT to do the second one. It was scary. But getting something done, is pretty darn satisfying. If you’d like to see what the outcome was you’re welcome to have a look and a laugh. And maybe some of the tips I give can come in handy to you when it comes to approaching kids. And of course your support would be very welcome, so if you like it, a thumbs up would make me very happy. :) I still don’t know how to choose my own thumbnail, and not the one YouTube gives you. And no, I’m not sneezing, or crying. Have a great day! Thank you for reading my rambles! If you have any comments, suggestions or tips, it would mean so much to me to hear from you. :) ", "title": "That First YouTube Video", "sentences": [{"9346": "That First YouTube Video"}, {"f38e": "So last year my partner and I decided that in order to move our project forward, we would need a community. A community of people who we could share our idea’s and experiences with and a community where we could learn from others with similar goals, passions and interests."}, {"d129": "We are in the (slow) process of creating an innovative educational game that will support both ESL teachers and learners. Right now it seems like a deep deep pool, where although it’s all sparkly at the top with the sun reflecting off the water, that thought creeps in that you don’t know what’s down there, you don’t know how deep it is, and you don’t know if your feet will ever be able to touch the ground. Scary right?"}, {"9ebb": "Well, that’s kinda what I also though when my partner suggested that the best place to find a community would be on YouTube. A great idea, except it’s ME who’s supposed to do the talking. The thought of sending out a video into the great abyss that is the internet was petrifying. I struggled with the thought of it for weeks. I kept putting it off, kept trying to record something and then deleting it as quickly as possible in fear that my phone might upload it on it’s own and that would be the end. Of everything. Terribly dramatic yes."}, {"62dc": "In my first few video’s I couldn’t even make eye contact with the green little light on the camera."}, {"eb64": "But I was convinced about the idea. And I did want it done. I think I had to get to that moment when I was just so frustrated with my incompetence that I sat down at my laptop, moved the window that showed a reflection of my face to the bottom of the screen so that I wouldn’t have to look at myself, and just started talking. I managed to say what I wanted from start to finish for the first time without stopping and deleting and I uploaded it to our shared googledrive to get feedback from my partner and my best friend and we decided to go with it. My best friend took out some of the longer pauses and “umm’s” and it was ready to be very consciously uploaded to the interwebs. Aaaah!"}, {"5ef6": "It’s not great. I know it isn’t. Lighting, visibility etc. But I broke past something I thought I’d never have the courage to do. Of course I don’t know if I’d have done it without people backing me up on it. But the first one is done and I know the next one can be so much better! And most importantly, I WANT to do the second one. It was scary. But getting something done, is pretty darn satisfying."}, {"0ae6": "If you’d like to see what the outcome was you’re welcome to have a look and a laugh. And maybe some of the tips I give can come in handy to you when it comes to approaching kids. And of course your support would be very welcome, so if you like it, a thumbs up would make me very happy. :)"}, {"8856": "I still don’t know how to choose my own thumbnail, and not the one YouTube gives you. And no, I’m not sneezing, or crying."}, {"6fdc": "Have a great day!"}, {"d09b": "Thank you for reading my rambles! If you have any comments, suggestions or tips, it would mean so much to me to hear from you. :)"}], "child": "1431_11431_1"}