{"name": "1435", "parent": "", "content": "When the Wheels Came Off Not To Get All “Freakonomics” Or Anything — But The Nation’s Woes Are Because We Can’t Fucking Smoke Anywhere Anymore. Look, I get it. Smoking is disgusting. Gives you Coal Miner’s Lung, and your teeth drop out of your head, turns your fingers all yellow — yaddayaddayadda. But I can also tell you this: it is the single most effective means yet devised by the mind of man to preempt my abiding desire to murder you. It is the single greatest means yet found to insulate the volcanic vent that is my brain in repose so it releases a steady stream of toxic steam instead of shudder-pumping orange molten rock-jaculate all over the place. On my best, most serene days, I am one traffic altercation away from from that hallway hammer-fight scene in Oldboy (no, dummy, not the remake). For decades, the narcotizing effect of my medication, readily available at any gas station, put a cork in the mayhem. A long, long corridor of ruptured organs and bone-shards. Or some secondhand smoke. I haven’t smoked for a long-ass time, now. Like fifteen years. And seven months. And nine days. Give or take. But like every ex-smoker (yes, yes — we’ve knuckled under to tell you that we “don’t even miss it” and “can’t even stand the smell anymore” — BUT NONE OF US FUCKING MEANS IT — any one of us would enroll TODAY in some kind of Early Withdrawal Organ Donation program where you could just carve hunks off of us in exchange for the chance to smoke in peace) I have pledged to Pull a Sinatra. He had to quit. Destroying his voice, blahblah. But when he turned 70, he started again. This is the only reason I intend to live to the age of 70. And yes, I have “children,” or whatever, and a “wife” who “loves me” — I have “lots to live for” — on paper. Light up, you no-good sons of bitches. Pull a Sinatra. But really. When you scrape off that thin, fucking brittle, fucking useless veneer of Civility and Restraint, my head is a Frothing Cauldron of Blistering Hatreds, Suspicions Extending Into Infinity Along Every Axis, and Heart-Hammering Terrors of Every Description. The ONLY remedy — if any one of you idiots so much as murmurs the word “yoga” I will cut you in half lengthwise — I have ever found to offer fleeting relief is the blessed state of interstitial being permitted by lighting up a cigarette and drawing that Alleviating Goodness as deep into my lungs as a single breath would permit. If you say “vaping” to me, I will lop off your idiot hands and sew them onto the lab monkey that ushers in the decades-overdue Planet of the Apes we were promised. And if you say “marijuana” to me, I will cocoon you in packing tape and drop you in the Drop Box for Time Traveling Hippies to ship you back to fucking Haight-Ashbury in sixty-fucking-seven — WHICH DOES NOT WORK, OBVIOUSLY, SO YOU WILL ASPHYXIATE IN THERE. But if you’ve wondered lately “How in the shit did we wake up in the world of The Purge?” I’ll tell you: you Health Nazi Lung-stapo assholes have marginalized and sequestered people like me to such a fucking degree that instead of self-medicating as Your So-Called God intended, otherwise why would he have made the Unerring Perfection of the Tobacco Plant in the first fucking place, or imbued humans with the Only Fucking Wisdom They Have Ever Demonstrated to cultivate that shit? I mean, YES, the fucking class warfare the GOP’s been waging for 40 years is a contributor, and SURE, the race war Bannon’s looking to kick off in the next few months is pretty big, no doubt. Likewise the nuking dipshits in the Senate, and the regulatory agencies recently rebranded as various chapters of the Dept. of Unchecked Plunder. TO SAY NOTHING OF PEPSI’S TONE DEAFNESS. But do not discount the impact of you fucking fuckers not letting us smoke anyplace. If you look along the leeward wall of any office park when the snows are blowing horizontal, or outside any loading dock in the pissing rain, you will find us — valiantly puffing away so as not to open all your fucking heads like so many pomegranates. Our concern for YOU prompts us to poison OURSELVES. And, instead of being a little bit fucking grateful that we are not in a Sustained Campaign of Liberating Your Idiot Tongues From the Prison of Your Mouths, you shun us. You drive us outside, into the Indifferent and Chastening Embrace of the Elements. WHEN WE ARE CLEARLY NOT OUTDOOR PEOPLE IN THE FIRST FUCKING PLACE. The clock of our culture, which currently stands at like a quarter to Hunger Games was set by you. You fucking fuckers, with your admonishments, with your wholesale rebuke of us — it is you who have moved the hands of that clock toward our mutual immolation. We just wanted to sit at our fucking desks like civilized fucking people, inhaling the overwhelming majority of the poison FOR YOU UNTHANKFUL FUCK BUCKETS. All we asked in return — for us to refrain from Purge-bashing your heads in with a 9-iron so they detonate like a honeydew with a grenade tucked inside — was to breathe in a LITTLE bit of slow-acting poison along with us. But could you fucking do it? No. You couldn’t. You miserly fucking dickholes. You Michelob Ultra fascists with your narrow waists and your active lifestyles, you fertility goddess fuckwads with your Concern For the Children, you public health wonks intent on Extending Our Lifespans For No Good Goddamn Reason — all of you. Now look at us. We’re all like an ass-hair away from meat-cleavering our way through the fucking office till the SWAT team rappels down the side of the fucking building and mows us down. You happy? You helicopter-parenting sons of bitches? We’re done for. All of us. And it’s your fucking fault. Now nobody talk to me for the next 19 goddamn years. You can find longer essays, satire, fiction, and info on the workshops I teach in Chicago on my site: ianbelknap.com — also, check out the WRITE CLUB podcast ", "title": "When the Wheels Came Off", "sentences": [{"bbe1": "When the Wheels Came Off"}, {"dd69": "Not To Get All “Freakonomics” Or Anything — But The Nation’s Woes Are Because We Can’t Fucking Smoke Anywhere Anymore."}, {"e056": "Look, I get it. Smoking is disgusting. Gives you Coal Miner’s Lung, and your teeth drop out of your head, turns your fingers all yellow — yaddayaddayadda."}, {"2d18": "But I can also tell you this: it is the single most effective means yet devised by the mind of man to preempt my abiding desire to murder you. It is the single greatest means yet found to insulate the volcanic vent that is my brain in repose so it releases a steady stream of toxic steam instead of shudder-pumping orange molten rock-jaculate all over the place. On my best, most serene days, I am one traffic altercation away from from that hallway hammer-fight scene in Oldboy (no, dummy, not the remake). For decades, the narcotizing effect of my medication, readily available at any gas station, put a cork in the mayhem."}, {"ab16": "A long, long corridor of ruptured organs and bone-shards. Or some secondhand smoke."}, {"ceac": "I haven’t smoked for a long-ass time, now. Like fifteen years. And seven months. And nine days. Give or take."}, {"83c9": "But like every ex-smoker (yes, yes — we’ve knuckled under to tell you that we “don’t even miss it” and “can’t even stand the smell anymore” — BUT NONE OF US FUCKING MEANS IT — any one of us would enroll TODAY in some kind of Early Withdrawal Organ Donation program where you could just carve hunks off of us in exchange for the chance to smoke in peace) I have pledged to Pull a Sinatra. He had to quit. Destroying his voice, blahblah. But when he turned 70, he started again. This is the only reason I intend to live to the age of 70. And yes, I have “children,” or whatever, and a “wife” who “loves me” — I have “lots to live for” — on paper."}, {"f657": "Light up, you no-good sons of bitches. Pull a Sinatra."}, {"f920": "But really. When you scrape off that thin, fucking brittle, fucking useless veneer of Civility and Restraint, my head is a Frothing Cauldron of Blistering Hatreds, Suspicions Extending Into Infinity Along Every Axis, and Heart-Hammering Terrors of Every Description. The ONLY remedy — if any one of you idiots so much as murmurs the word “yoga” I will cut you in half lengthwise — I have ever found to offer fleeting relief is the blessed state of interstitial being permitted by lighting up a cigarette and drawing that Alleviating Goodness as deep into my lungs as a single breath would permit."}, {"64a2": "If you say “vaping” to me, I will lop off your idiot hands and sew them onto the lab monkey that ushers in the decades-overdue Planet of the Apes we were promised. And if you say “marijuana” to me, I will cocoon you in packing tape and drop you in the Drop Box for Time Traveling Hippies to ship you back to fucking Haight-Ashbury in sixty-fucking-seven — WHICH DOES NOT WORK, OBVIOUSLY, SO YOU WILL ASPHYXIATE IN THERE."}, {"96ee": "But if you’ve wondered lately “How in the shit did we wake up in the world of The Purge?” I’ll tell you: you Health Nazi Lung-stapo assholes have marginalized and sequestered people like me to such a fucking degree that instead of self-medicating as Your So-Called God intended, otherwise why would he have made the Unerring Perfection of the Tobacco Plant in the first fucking place, or imbued humans with the Only Fucking Wisdom They Have Ever Demonstrated to cultivate that shit?"}, {"0100": "I mean, YES, the fucking class warfare the GOP’s been waging for 40 years is a contributor, and SURE, the race war Bannon’s looking to kick off in the next few months is pretty big, no doubt. Likewise the nuking dipshits in the Senate, and the regulatory agencies recently rebranded as various chapters of the Dept. of Unchecked Plunder. TO SAY NOTHING OF PEPSI’S TONE DEAFNESS. But do not discount the impact of you fucking fuckers not letting us smoke anyplace."}, {"26ef": "If you look along the leeward wall of any office park when the snows are blowing horizontal, or outside any loading dock in the pissing rain, you will find us — valiantly puffing away so as not to open all your fucking heads like so many pomegranates. Our concern for YOU prompts us to poison OURSELVES. And, instead of being a little bit fucking grateful that we are not in a Sustained Campaign of Liberating Your Idiot Tongues From the Prison of Your Mouths, you shun us. You drive us outside, into the Indifferent and Chastening Embrace of the Elements. WHEN WE ARE CLEARLY NOT OUTDOOR PEOPLE IN THE FIRST FUCKING PLACE."}, {"c6d4": "The clock of our culture, which currently stands at like a quarter to Hunger Games was set by you. You fucking fuckers, with your admonishments, with your wholesale rebuke of us — it is you who have moved the hands of that clock toward our mutual immolation. We just wanted to sit at our fucking desks like civilized fucking people, inhaling the overwhelming majority of the poison FOR YOU UNTHANKFUL FUCK BUCKETS. All we asked in return — for us to refrain from Purge-bashing your heads in with a 9-iron so they detonate like a honeydew with a grenade tucked inside — was to breathe in a LITTLE bit of slow-acting poison along with us. But could you fucking do it? No. You couldn’t. You miserly fucking dickholes."}, {"ced6": "You Michelob Ultra fascists with your narrow waists and your active lifestyles, you fertility goddess fuckwads with your Concern For the Children, you public health wonks intent on Extending Our Lifespans For No Good Goddamn Reason — all of you. Now look at us. We’re all like an ass-hair away from meat-cleavering our way through the fucking office till the SWAT team rappels down the side of the fucking building and mows us down."}, {"3152": "You happy? You helicopter-parenting sons of bitches? We’re done for. All of us. And it’s your fucking fault. Now nobody talk to me for the next 19 goddamn years."}, {"d873": "You can find longer essays, satire, fiction, and info on the workshops I teach in Chicago on my site: ianbelknap.com — also, check out the WRITE CLUB podcast"}], "child": "1435_1\t1435_2\t1435_3\t1435_4\t1435_5\t1435_6\t1435_7\t1435_8\t1435_9\t1435_10\t1435_11\t1435_12\t1435_13\t1435_14\t1435_15\t1435_16\t1435_17\t1435_18\t1435_19\t1435_20\t1435_21\t1435_22\t1435_23\t1435_24\t1435_25"}