{"name": "1445", "parent": "", "content": "How to Replace Your Self-Doubt With Unshakeable Confidence A guide from Harvard Psychologist and TED Talk star Amy Cuddy. We’ve all had those paralyzing moments where our palms are sweating more than a marathon runner and our heart is hammering at a million times a minute. You’ve also probably bitten the bullet and pushed those feelings down just enough to get through a presentation or take on a terrifying new venture… only to have them pop up again next time. But what if you could tell that nagging voice in your head — the one that says “you can’t do it” or instills fear in your heart — to just shut up, right now?What if you could harness that relieved feeling after doing a presentation before you got on stage? Look no further than Harvard Psychology Professor and TED Talk star Amy Cuddy. She extensively studied why certain people are able to take more risks and have the confident demeanor that landed them more business deals and job offers. She found that everything from their body language to simple daily thoughts allowed them to rapidly evaporate fear in the moment and replace it with belief in their fantastic abilities. Her TED talk (which has been viewed over 30 million times) and book “Presence: Bringing Your Boldest Self to Your Biggest Challenges,” offeractionable and surprisingly easy steps to trick your brain to conquer your fears. Check out her advice on how to reprogram your brain to ditch fear and replace it with positivity and confidence: “Don’t fake it till you make it. Fake it till you become.” ― Amy Cuddy Early in her college career, Cuddy suffered a severe head injury in a car accident, and doctors said she would struggle to fully regain her mental capacity and finish her undergraduate degree. When she faced gigantic feelings of inadequacy, Cuddy’s professor advised her to fake the feeling of fitting in until she actually felt like she did. We’ve all heard the phrase “fake it ‘till you make it” in passing, and maybe even rolled our eyes to it, but the professor was onto something: numerous studies back up the fact that “faking it” actually improves your chances of making (or becoming) it, from dressing up for the job you want to simply smiling to become happier. And it’s a self-perpetuating cycle — the more you “pretend” to know what you’re doing, the more you actually know what you’re doing, boosting your confidence even further. So if you think you don’t have the skills or knowledge to get it done, go ahead and pretend that you do. What you eventually know you can do will completely surprise you. Focus on Mindfulness, Not Perfection Cuddy also highly recommended mindfulness as a way to evaporate fear and boost self-confidence. According to Harvard Business Review, it’s a way to “learn to stay present, participate in regulating our own nervous system, and eventually, develop new, more free and helpful ways of interacting.” This is done by “noticing we are provoked,” like when you start sweating and feel your heart rate go up. Then, when you’re completely aware of every (manageable) thing happening to your body; you’re making a choice to be “put and present, to be curious and explore your experience.” Basically, instead of sweating and blindly feeling like the world’s going to collapse, you pay attention to the situation at hand, and say “hey, I feel a little jittery, and my body is nervous, but I’m going to be okay”. Beyond this, Cuddy notes you should be mindful of what you have influence over, and what you don’t, and only focus on the things you can change. Stephen Hawking once said, “One of the basic rules of the universe is that nothing is perfect. Perfection simply doesn’t exist.” If Mother Nature hasn’t figured it out yet, then neither will you. There are a million and a half things that will be completely out of your control every day, no matter how much effort you put in — so ignore what’s outside of your influence, and you’ll find confidence that you can conquer the rest. Pretend you’re a superhero “We convince ourselves, and that allows us to convince others.” — Amy Cuddy Your body language can make you look more confident, or in some of our cases, can make you look like you have no idea what you’re doing. What you may not realize is that standing tall not only makes you look confident, but it releases a surge of chemicals that make you feel more confident. On the other hand, if you hunch over or look down frequently, you’ll come across as insecure or depressed. Cuddy breaks these stances down between expansive and contractive poses. Pay attention to what poses your body naturally goes into, then make a conscious effort to open up and display your confident self. One body language change she recommends you try making is the classicWonder Woman pose with your arms out and posed on your hips. By standing like a superhero, you won’t only feel like one, but people will think you’re a Wonder (Wo)man and have their attention glued to you. Also, importantly, pay attention to how much you use your smartphone in stressful situations. It automatically puts you in a contractive position, not to mention studies link excessive phone usage to fear and less confidence! Remember, there’s nothing wrong with fear as long as you use it as a driver to push yourself forward, rather than letting it hold you back. Vanquish your insecurities by using your presence of mind to focus and project confidence. From there, it’s up to you to make the rest happen. Do you have any tips for becoming more confident and less fearful? I want to hear them — leave a comment or reach out to me on Twitter! ", "title": "How to Replace Your Self-Doubt With Unshakeable Confidence", "sentences": [{"f07f": "How to Replace Your Self-Doubt With Unshakeable Confidence"}, {"b015": "A guide from Harvard Psychologist and TED Talk star Amy Cuddy."}, {"0017": "We’ve all had those paralyzing moments where our palms are sweating more than a marathon runner and our heart is hammering at a million times a minute."}, {"4c34": "You’ve also probably bitten the bullet and pushed those feelings down just enough to get through a presentation or take on a terrifying new venture… only to have them pop up again next time."}, {"1704": "But what if you could tell that nagging voice in your head — the one that says “you can’t do it” or instills fear in your heart — to just shut up, right now?What if you could harness that relieved feeling after doing a presentation before you got on stage?"}, {"45b7": "Look no further than Harvard Psychology Professor and TED Talk star Amy Cuddy. She extensively studied why certain people are able to take more risks and have the confident demeanor that landed them more business deals and job offers."}, {"cf2b": "She found that everything from their body language to simple daily thoughts allowed them to rapidly evaporate fear in the moment and replace it with belief in their fantastic abilities."}, {"2994": "Her TED talk (which has been viewed over 30 million times) and book “Presence: Bringing Your Boldest Self to Your Biggest Challenges,” offeractionable and surprisingly easy steps to trick your brain to conquer your fears."}, {"becf": "Check out her advice on how to reprogram your brain to ditch fear and replace it with positivity and confidence:"}, {"97b2": "“Don’t fake it till you make it. Fake it till you become.” ― Amy Cuddy"}, {"786c": "Early in her college career, Cuddy suffered a severe head injury in a car accident, and doctors said she would struggle to fully regain her mental capacity and finish her undergraduate degree. When she faced gigantic feelings of inadequacy, Cuddy’s professor advised her to fake the feeling of fitting in until she actually felt like she did."}, {"322b": "We’ve all heard the phrase “fake it ‘till you make it” in passing, and maybe even rolled our eyes to it, but the professor was onto something: numerous studies back up the fact that “faking it” actually improves your chances of making (or becoming) it, from dressing up for the job you want to simply smiling to become happier."}, {"6ecb": "And it’s a self-perpetuating cycle — the more you “pretend” to know what you’re doing, the more you actually know what you’re doing, boosting your confidence even further."}, {"8911": "So if you think you don’t have the skills or knowledge to get it done, go ahead and pretend that you do. What you eventually know you can do will completely surprise you."}, {"ea9d": "Focus on Mindfulness, Not Perfection"}, {"eca2": "Cuddy also highly recommended mindfulness as a way to evaporate fear and boost self-confidence."}, {"d4bb": "According to Harvard Business Review, it’s a way to “learn to stay present, participate in regulating our own nervous system, and eventually, develop new, more free and helpful ways of interacting.”"}, {"86ff": "This is done by “noticing we are provoked,” like when you start sweating and feel your heart rate go up. Then, when you’re completely aware of every (manageable) thing happening to your body; you’re making a choice to be “put and present, to be curious and explore your experience.”"}, {"72e8": "Basically, instead of sweating and blindly feeling like the world’s going to collapse, you pay attention to the situation at hand, and say “hey, I feel a little jittery, and my body is nervous, but I’m going to be okay”."}, {"3015": "Beyond this, Cuddy notes you should be mindful of what you have influence over, and what you don’t, and only focus on the things you can change."}, {"e168": "Stephen Hawking once said, “One of the basic rules of the universe is that nothing is perfect. Perfection simply doesn’t exist.”"}, {"6700": "If Mother Nature hasn’t figured it out yet, then neither will you."}, {"66fe": "There are a million and a half things that will be completely out of your control every day, no matter how much effort you put in — so ignore what’s outside of your influence, and you’ll find confidence that you can conquer the rest."}, {"2f24": "Pretend you’re a superhero"}, {"7d02": "“We convince ourselves, and that allows us to convince others.” — Amy Cuddy"}, {"9288": "Your body language can make you look more confident, or in some of our cases, can make you look like you have no idea what you’re doing."}, {"2c58": "What you may not realize is that standing tall not only makes you look confident, but it releases a surge of chemicals that make you feel more confident."}, {"c17d": "On the other hand, if you hunch over or look down frequently, you’ll come across as insecure or depressed. Cuddy breaks these stances down between expansive and contractive poses. Pay attention to what poses your body naturally goes into, then make a conscious effort to open up and display your confident self."}, {"0444": "One body language change she recommends you try making is the classicWonder Woman pose with your arms out and posed on your hips. By standing like a superhero, you won’t only feel like one, but people will think you’re a Wonder (Wo)man and have their attention glued to you."}, {"7e7e": "Also, importantly, pay attention to how much you use your smartphone in stressful situations. It automatically puts you in a contractive position, not to mention studies link excessive phone usage to fear and less confidence!"}, {"026d": "Remember, there’s nothing wrong with fear as long as you use it as a driver to push yourself forward, rather than letting it hold you back. Vanquish your insecurities by using your presence of mind to focus and project confidence. From there, it’s up to you to make the rest happen."}, {"26d3": "Do you have any tips for becoming more confident and less fearful? I want to hear them — leave a comment or reach out to me on Twitter!"}], "child": "1445_1\t1445_2\t1445_3\t1445_4\t1445_5\t1445_6\t1445_7\t1445_8\t1445_9\t1445_10\t1445_11\t1445_12"}