{"name": "1447", "parent": "", "content": "Be Bored, I Dare You… We are less bored than our ancestors were, but we are more afraid of boredom. We have come to know, or rather to believe, that boredom is not part of the natural lot of man, but can be avoided by a sufficiently vigorous pursuit of excitement. — Bertrand Russell Today, in our cult of productivity, boredom is often viewed as utterly inexcusable — a sin — only committed by the lazy or unsuccessful. Yet it is a vital emotion that helps you cultivate creativity, contemplation, and stillness. It is essential for the mind to be bored. A couple of weeks back I deleted several apps from my phone: Twitter, Instagram, Gmail, Facebook, among others, in an attempt to force myself to be bored. I’m trying to let go of the things that I would usually use to ‘fill the space.’ I want to learn to be okay with just being. Here is the list of things I let go of to find more boredom in the everyday: Why? Because distractions are a crutch, a mental habit, a refuge for the mind. They help us hide from difficult emotions, the present moment, and the fear of not being busy. You might be thinking, “What’s wrong with a little distraction, a little mental break?” I don’t believe there is anything wrong with letting your mind rest, but I believe we should be more aware of our constant need to take ourselves out of the present moment. We are constantly on the lookout for an escape from life. I did not do this to be more productive. I am doing this to give my brain some much-needed rest. I am doing this to force myself to be bored. It has been hard, but some of my best insights have come from being mindfully bored, watching my thoughts, and observing my surroundings. Here is your excuse to be bored! Go Deeper I do not expect you to delete all of the apps on your phone today (although that would be awesome), but I want you to become aware of your unconscious response to boredom. Eliminate Sunday Scaries Are you ready to wake up to your life, lower your anxiety, and find more happiness in your life? If so, sign up for my private Sunday Scaries email newsletter! I’ll be sending you a weekly email of actionable insights, inspiration, and practical wisdom that will assist you in decreasing stress, increasing focus, and finding more happiness. If you are ready to take back control of your life and start living above stress and overwhelm… Sign Up Here! One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. ", "title": "Be Bored, I Dare You…", "sentences": [{"71a9": "Be Bored, I Dare You…"}, {"bc92": "We are less bored than our ancestors were, but we are more afraid of boredom. We have come to know, or rather to believe, that boredom is not part of the natural lot of man, but can be avoided by a sufficiently vigorous pursuit of excitement. — Bertrand Russell"}, {"113c": "Today, in our cult of productivity, boredom is often viewed as utterly inexcusable — a sin — only committed by the lazy or unsuccessful. Yet it is a vital emotion that helps you cultivate creativity, contemplation, and stillness. It is essential for the mind to be bored."}, {"c41c": "A couple of weeks back I deleted several apps from my phone: Twitter, Instagram, Gmail, Facebook, among others, in an attempt to force myself to be bored. I’m trying to let go of the things that I would usually use to ‘fill the space.’ I want to learn to be okay with just being."}, {"b6e6": "Here is the list of things I let go of to find more boredom in the everyday:"}, {"eaf9": "Why?"}, {"d460": "Because distractions are a crutch, a mental habit, a refuge for the mind. They help us hide from difficult emotions, the present moment, and the fear of not being busy."}, {"1b71": "You might be thinking, “What’s wrong with a little distraction, a little mental break?”"}, {"4ac4": "I don’t believe there is anything wrong with letting your mind rest, but I believe we should be more aware of our constant need to take ourselves out of the present moment. We are constantly on the lookout for an escape from life."}, {"3030": "I did not do this to be more productive. I am doing this to give my brain some much-needed rest. I am doing this to force myself to be bored. It has been hard, but some of my best insights have come from being mindfully bored, watching my thoughts, and observing my surroundings."}, {"08e6": "Here is your excuse to be bored!"}, {"5621": "Go Deeper"}, {"4d89": "I do not expect you to delete all of the apps on your phone today (although that would be awesome), but I want you to become aware of your unconscious response to boredom."}, {"e0e8": "Eliminate Sunday Scaries"}, {"b773": "Are you ready to wake up to your life, lower your anxiety, and find more happiness in your life?"}, {"59d0": "If so, sign up for my private Sunday Scaries email newsletter!"}, {"02e0": "I’ll be sending you a weekly email of actionable insights, inspiration, and practical wisdom that will assist you in decreasing stress, increasing focus, and finding more happiness."}, {"f7e9": "If you are ready to take back control of your life and start living above stress and overwhelm…"}, {"7086": "Sign Up Here!"}, {"e284": "One last thing…"}, {"1fec": "If you liked this article, click the💚 below so other people will see it here on Medium."}], "child": "1447_1\t1447_2\t1447_3\t1447_4\t1447_5\t1447_6\t1447_7\t1447_8\t1447_9\t1447_10\t1447_11\t1447_12\t1447_13\t1447_14\t1447_15\t1447_16\t1447_17\t1447_18\t1447_19\t1447_20\t1447_21\t1447_22\t1447_23\t1447_24\t1447_25"}