{"name": "1448", "parent": "", "content": "Working From Home: 3 Morning Rituals for a More Productive Day It’s been 2 years since I left the rat race and I will never go back, at least not willingly. While my stint in it was short, I am forever thankful that I happened upon the incredible world of the virtual entrepreneur and built a solid career for myself. While working from home, hanging out with my dog and never having to sit in traffic is amazing, it can definitely take its toll on you in unexpected ways if you’re not paying attention. What you do within the first couple of hours of waking up can make or break your day. A healthy, productive morning will set you up for success and help to increase your productivity, especially if you’re among the work from home crowd. So here are the three morning rituals that help me to get a better start to the day. Hydrate Your Brain After a long night of sleep, especially if you live in a dry climate, your body craves hydration first thing in the morning. Just imagine not drinking anything for the next 8 hours, you would probably feel awful and start to experience some of the nasty signs of dehydration that affect both your body and your mind. Since our brains are 73% water , they need hydration in order to focus and assimilate information. Drinking water first thing in the morning will not only help to rehydrate your body, it will help to jumpstart your brain function and set you up for a more productive day. Since there’s some yucky stuff in our tap water that I know I don’t want to be drinking, I prefer to drink, filtered water often times with a little lemon, first thing in the morning. It tastes better than plain water and I know I’m flushing out my system and feeding my brain with the purest water I can get my hands on. Plus, adding a little lemon not only helps it taste better, but it gives it a little boost of vitamin C! No Devices Working from home, especially when you don’t really have a set schedule to follow, means that you can work anytime and anywhere. While I love the freedom that gives me, I am really working on keeping a better schedule and not letting a computer screen be the first thing I see in the morning and the last thing I see at night. I know it’s weird, but I love what I do and I get excited about emails, projects and new assignments, so I find myself staring at device way too much. Many days I get straight out of bed, walk over to my computer and immediately start working. Sometimes I grab my phone as soon as I open my eyes and immediately start checking social media or reading the news. I know I’m not only the only one that does this, but that definitely doesn’t make it OK. Grabbing a device as soon as you wake up is not the way to start your day. When we start our day buried in our phones and computers we are bombarding our brains with information overload, inhibiting our ability to focus and stripping us of our ability to “just be”. We check our devices enough throughout the day, so committing to not turning on your phone or computer for the first hour of two of your morning will definitely help you to have a more relaxed morning and hopefully a more productive day. Move I know, you’ve heard it over and over again, exercising in the morning is an amazing way to start your day, and can set you up for a better and more productive day. Like I said before, many times I get out of bed and immediately sit down at my computer to work, still in my pajamas. Sometimes I will end up sitting there for hours before I realize what’s happening. The next thing I know it’s noon, I’m still wearing my pajamas and have been sitting in the same spot for way too long. On the days when I’ve managed to wake up early and get out of the house to exercise, I have much more productive days because I’ve started the day out on a better foot. Exercising first thing in the morning gives you energy that propels you throughout the day, energizing both your mind and your body. When you work at home, often alone, this can be one of the most important things you do everyday. When I start my day with exercise instead of sitting in my pajamas until noon (sometimes later), I have a much more productive day. ", "title": "Working From Home: 3 Morning Rituals for a More Productive Day", "sentences": [{"6d57": "Working From Home: 3 Morning Rituals for a More Productive Day"}, {"a57b": "It’s been 2 years since I left the rat race and I will never go back, at least not willingly. While my stint in it was short, I am forever thankful that I happened upon the incredible world of the virtual entrepreneur and built a solid career for myself. While working from home, hanging out with my dog and never having to sit in traffic is amazing, it can definitely take its toll on you in unexpected ways if you’re not paying attention."}, {"348e": "What you do within the first couple of hours of waking up can make or break your day. A healthy, productive morning will set you up for success and help to increase your productivity, especially if you’re among the work from home crowd."}, {"1836": "So here are the three morning rituals that help me to get a better start to the day."}, {"d4ec": "Hydrate Your Brain"}, {"6726": "After a long night of sleep, especially if you live in a dry climate, your body craves hydration first thing in the morning. Just imagine not drinking anything for the next 8 hours, you would probably feel awful and start to experience some of the nasty signs of dehydration that affect both your body and your mind. Since our brains are 73% water , they need hydration in order to focus and assimilate information. Drinking water first thing in the morning will not only help to rehydrate your body, it will help to jumpstart your brain function and set you up for a more productive day."}, {"ed00": "Since there’s some yucky stuff in our tap water that I know I don’t want to be drinking, I prefer to drink, filtered water often times with a little lemon, first thing in the morning. It tastes better than plain water and I know I’m flushing out my system and feeding my brain with the purest water I can get my hands on. Plus, adding a little lemon not only helps it taste better, but it gives it a little boost of vitamin C!"}, {"4c53": "No Devices"}, {"7c35": "Working from home, especially when you don’t really have a set schedule to follow, means that you can work anytime and anywhere. While I love the freedom that gives me, I am really working on keeping a better schedule and not letting a computer screen be the first thing I see in the morning and the last thing I see at night. I know it’s weird, but I love what I do and I get excited about emails, projects and new assignments, so I find myself staring at device way too much. Many days I get straight out of bed, walk over to my computer and immediately start working. Sometimes I grab my phone as soon as I open my eyes and immediately start checking social media or reading the news. I know I’m not only the only one that does this, but that definitely doesn’t make it OK."}, {"f364": "Grabbing a device as soon as you wake up is not the way to start your day. When we start our day buried in our phones and computers we are bombarding our brains with information overload, inhibiting our ability to focus and stripping us of our ability to “just be”. We check our devices enough throughout the day, so committing to not turning on your phone or computer for the first hour of two of your morning will definitely help you to have a more relaxed morning and hopefully a more productive day."}, {"1dd8": "Move"}, {"95bb": "I know, you’ve heard it over and over again, exercising in the morning is an amazing way to start your day, and can set you up for a better and more productive day. Like I said before, many times I get out of bed and immediately sit down at my computer to work, still in my pajamas. Sometimes I will end up sitting there for hours before I realize what’s happening. The next thing I know it’s noon, I’m still wearing my pajamas and have been sitting in the same spot for way too long. On the days when I’ve managed to wake up early and get out of the house to exercise, I have much more productive days because I’ve started the day out on a better foot."}, {"7c46": "Exercising first thing in the morning gives you energy that propels you throughout the day, energizing both your mind and your body. When you work at home, often alone, this can be one of the most important things you do everyday. When I start my day with exercise instead of sitting in my pajamas until noon (sometimes later), I have a much more productive day."}], "child": "1448_1\t1448_2\t1448_3"}