{"name": "1449", "parent": "", "content": "All Natural Depression Face Masks People often think depression looks a certain way — crying, sad, or, just finished crying. But it’s oh so much more than that! depression is chock-full of devastating layers. It runs deep and steady. I have an undercurrent of depression running through me at all times. Sometimes it’s more pronounced, other times it’s more Crouching Depression, Hidden Depression. But it’s always there. I’m still shocked that depressed people get told “but you don’t look depressed” because honestly how goddamn dare you. Who are you to say whether somebody looks depressed or not? Please acquaint yourself with the life-changing magic of shutting the fuck up. The only person who’s qualified to tell me whether I look depressed or not, is the guy who puts out the rotisserie chicken at my local Safeway. The idea that something so deeply rooted in a person’s mind would only be identifiable via their face is absurd. You can’t recognize depression in someone just by looking at them, because guess what? We look JUST. LIKE. YOU. MWHAHAHAH! Isn’t that terrifying, non-depressed people? It’s impossible to tell who’s depressed and who’s not. We walk among you, like Invasion Of The Body Snatchers. Each of us a perfect copy of a person, only devoid of human emotion. We apply different facial expressions out of habit, not because we feel, but because we want to appear as though we do. We wear these face masks for a multitude of reasons — to gain acceptance, to shield from shame, or to achieve an even, healthy glow. Personally, I make a concerted effort to not look depressed in public, for the same reason I put on make-up, sure I do it to lie to other people, but it’s mostly to lie to myself. For those of you still unconvinced, allow me to present some of my lesser-known All Natural Depression Face Masks: Extremely HappyAn absolute staple. I have been donning Extremely Happy for years and, even though it’s torturous to wear, it will make you feel like part of society even though you’re dying inside! And isn’t that what’s truly important? Societal acceptance! Extremely Happy — It’s the LBD (little black depression) for your face. On Point ProfessionalWho says you can’t be depressed AND good at your job? Probably most employers! On Point Professional can be worn by anyone who works for a living. Inspire your coworkers with a face that says “I get shit done!” and a mind that says “My mental condition is deteriorating and I can’t make it stop!”. For those of you who work from home, don’t worry! You can wear On Point Professional all the time, or just on those rare occasions when you venture out the house because you want to make sure strangers on the street know you have a job because it’s very important to impress people you don’t (and will never) know. Very important. Sheer BoredomBoredom? How can you be bored when you have all this depression to be getting on with? What’s your secret?! I’ll tell you — It’s a two-in-one look! That’s right, Sheer Boredom blends seamlessly with your depression. Think depression can only be worn with Crying? Think again! Sheer Boredom is one of the most popular depression looks to date. So what are you waiting for? Death? Me too! Court Jester I love this look because it’s long-lasting and helps protect from any real feelings. Unlike Extremely Happy, Court Jester is so easy to wear you’ll forget you’re wearing it! That is until you’re alone and you have to take it off. Then it will hit you, hard. All those thoughts and feelings you thought you’d shielded yourself from by doing fun bits at parties, they’re here now. It’s just you, and them, and silence…….Until the next social event or after-work drinks or dinner party! Put Court Jester back on and let the laughter feed you! Haha! Who’s laughing now?! Not you! Iridescent IndifferenceWithout a doubt, the coolest look of the bunch. Iridescent Indifference’s unique numbing agent makes you look like a nonplussed, French New Wave film on the outside, while you continue to feel dead on the inside. You look at other people and wonder how and why they can be into any activity. You convince yourself that you’re too cool for that shit, which maybe works for a while. Then you realize, at least these people have shit they care about. You don’t even have shit you don’t care about. But at least you have Iridescent Indifference! Cool on the outside, nothing on the inside! There you have it, just a few of my classic looks. If these don’t resonate with you, then dig around and see what you find or don’t because it’s horrifying! Also, save your “I don’t experience this” comments. I wrote this about my condition, not yours. Hope this helps! But remember, if in doubt, keep your mouth shut. This story was commissioned by Zova to help raise awareness for depression as part of World Health Day 2017. Do your part, share this story with the official World Health Day #letstalk hashtag. ", "title": "All Natural Depression Face Masks", "sentences": [{"3305": "All Natural Depression Face Masks"}, {"6bf2": "People often think depression looks a certain way — crying, sad, or, just finished crying. But it’s oh so much more than that! depression is chock-full of devastating layers. It runs deep and steady. I have an undercurrent of depression running through me at all times. Sometimes it’s more pronounced, other times it’s more Crouching Depression, Hidden Depression. But it’s always there."}, {"504b": "I’m still shocked that depressed people get told “but you don’t look depressed” because honestly how goddamn dare you. Who are you to say whether somebody looks depressed or not? Please acquaint yourself with the life-changing magic of shutting the fuck up. The only person who’s qualified to tell me whether I look depressed or not, is the guy who puts out the rotisserie chicken at my local Safeway."}, {"28fd": "The idea that something so deeply rooted in a person’s mind would only be identifiable via their face is absurd. You can’t recognize depression in someone just by looking at them, because guess what? We look JUST. LIKE. YOU. MWHAHAHAH! Isn’t that terrifying, non-depressed people? It’s impossible to tell who’s depressed and who’s not. We walk among you, like Invasion Of The Body Snatchers. Each of us a perfect copy of a person, only devoid of human emotion. We apply different facial expressions out of habit, not because we feel, but because we want to appear as though we do. We wear these face masks for a multitude of reasons — to gain acceptance, to shield from shame, or to achieve an even, healthy glow."}, {"127a": "Personally, I make a concerted effort to not look depressed in public, for the same reason I put on make-up, sure I do it to lie to other people, but it’s mostly to lie to myself."}, {"2a37": "For those of you still unconvinced, allow me to present some of my lesser-known All Natural Depression Face Masks:"}, {"5aa7": "Extremely HappyAn absolute staple. I have been donning Extremely Happy for years and, even though it’s torturous to wear, it will make you feel like part of society even though you’re dying inside! And isn’t that what’s truly important? Societal acceptance! Extremely Happy — It’s the LBD (little black depression) for your face."}, {"3b15": "On Point ProfessionalWho says you can’t be depressed AND good at your job? Probably most employers! On Point Professional can be worn by anyone who works for a living. Inspire your coworkers with a face that says “I get shit done!” and a mind that says “My mental condition is deteriorating and I can’t make it stop!”. For those of you who work from home, don’t worry! You can wear On Point Professional all the time, or just on those rare occasions when you venture out the house because you want to make sure strangers on the street know you have a job because it’s very important to impress people you don’t (and will never) know. Very important."}, {"8b76": "Sheer BoredomBoredom? How can you be bored when you have all this depression to be getting on with? What’s your secret?! I’ll tell you — It’s a two-in-one look! That’s right, Sheer Boredom blends seamlessly with your depression. Think depression can only be worn with Crying? Think again! Sheer Boredom is one of the most popular depression looks to date. So what are you waiting for? Death? Me too!"}, {"5fff": "Court Jester I love this look because it’s long-lasting and helps protect from any real feelings. Unlike Extremely Happy, Court Jester is so easy to wear you’ll forget you’re wearing it! That is until you’re alone and you have to take it off. Then it will hit you, hard. All those thoughts and feelings you thought you’d shielded yourself from by doing fun bits at parties, they’re here now. It’s just you, and them, and silence…….Until the next social event or after-work drinks or dinner party! Put Court Jester back on and let the laughter feed you! Haha! Who’s laughing now?! Not you!"}, {"9e16": "Iridescent IndifferenceWithout a doubt, the coolest look of the bunch. Iridescent Indifference’s unique numbing agent makes you look like a nonplussed, French New Wave film on the outside, while you continue to feel dead on the inside. You look at other people and wonder how and why they can be into any activity. You convince yourself that you’re too cool for that shit, which maybe works for a while. Then you realize, at least these people have shit they care about. You don’t even have shit you don’t care about. But at least you have Iridescent Indifference! Cool on the outside, nothing on the inside!"}, {"05af": "There you have it, just a few of my classic looks. If these don’t resonate with you, then dig around and see what you find or don’t because it’s horrifying! Also, save your “I don’t experience this” comments. I wrote this about my condition, not yours."}, {"a0ba": "Hope this helps! But remember, if in doubt, keep your mouth shut."}, {"e96d": "This story was commissioned by Zova to help raise awareness for depression as part of World Health Day 2017. Do your part, share this story with the official World Health Day #letstalk hashtag."}], "child": "1449_1\t1449_2\t1449_3\t1449_4\t1449_5\t1449_6\t1449_7\t1449_8\t1449_9\t1449_10\t1449_11\t1449_12\t1449_13\t1449_14\t1449_15\t1449_16"}