{"name": "1450", "parent": "", "content": "10 Small but Smart Decisions to Influence the Theme of Your Life Are you game for it? Image Credit Pixabay.com “I believe the biggest themes of life are put into the best focus when held up against the very sharp light of mortality.” — Mitch Albom Since life is lived one day at a time.We often forget that “Life is really short”. We act like mortals in all that we fear and act like immortals in all that we desire. Considering a lifespan of 75 years, one has 657,000 hours in total.With 7 hours of sleep daily, the person sleeps for about 200,000 hours.Hours one is awake — 457,000 hours Research says that we spend about 46% of our wake up time thinking about things we are not doing at that moment. This takes away about 215,000 hours. So we are effectively left with 242,000 hours i.e. 28 years to live. Shouldn’t we spend this relatively small amount of time in making those smart choices that has potential to influence the broader theme of our life? 1.Your support system should always get the priority it deserves “If you think the ocean isn’t important, imagine Earth without it. Mars comes to mind. No ocean, no life support system.” — Sylvia Earle There are only a handful of people who really do care about you. Make sure you stay close to them. They are your primary support system, so continuous emotional investment in them should always figure among your topmost priorities. They’re the ones who were always there for you when you were all alone. Anytime you turned around, you will always find them behind you. Image courtesy of Unsplash 2. Invest into a habit of daily learning “As long as I’m learning every day of my life, I will never feel old. Never. And I don’t feel old; I feel in my head and in my heart — I don’t know, ageless!” — Pat Mitchell If possible Learn at least one new thing a day. This could just be one word from a new language, a trivia, a historical incident, a new scientific fact, a unique strategy or anything else that might excite you. Once you translate this into a habit, your journey to become an awesome person would get more effortless. 3. Even the smartest person in the room doesn't have all the answers “You don’t have to have all the answers all the time. But the best thing to know is what you don’t know.” — Christine Quinn When in doubt, the best strategy is to simply respond with “I never thought about it, Let me think.” If you choose to do so nobody is going to question your intellect and label you as an incompetent. Because deep inside we all know that we don’t always have all the right answer to every query. So instead of rushing to an answer, tell the person that you need just a little time to think it in detail. This gesture succeeds in projecting you as someone who is a bit thoughtful while giving you invaluable time to respond accordingly. 4. You are not the center of this universe “I guess real maturity, which most of us never achieve, is when you realize that you’re not the center of the universe.” — Katherine Paterson Extremely sorry to disappoint you but the truth is — most people just don’t care about you. You simply don’t figure in their universe. Of course if you happen to be a celebrity of any sort then this may not apply to you, but for most mere mortals like us there is absolutely no point in worrying about what other people think of you. At the same time all the constructive feedback coming from people who are emotionally invested in you and really do care about you should get your undivided attention. Your entire focus should be on — being the best possible version of yourself. 5. Learn to pace yourself “Life is a marathon, not a sprint; pace yourself accordingly.” — Amby Burfoot There is absolutely no harm in slowing down once a while. No one is disputing your lifetime objective of making a dent in the universe. However your mad rush in reaching your goal should never kill all the fun associated with the journey. There is nothing special waiting for you once you reach your final destination. So you can always afford to take a deep breath and slow down. Slowing the pace will always give you an invaluable opportunity to reassess your current situation and adapt accordingly: course correction. 6. Stop judging people for who they are, and what they do “Stop judging others by what you see. Because what you see is what they want you to see.” — Anonymous Simply, because you aren't privy to every detail of their journey and life struggles. So please refrain from making a total ass of yourself. Get rid of this default habit of judging people on face value. I know… it’s kind of tough to make any drastic changes in your default habit, yet you need to really push yourself hard to make it an integral part of your newly acquired habit. 7. Figure out your why “There are two great days in a person’s life — the day we are born and the day we discover why.” — William Barclay In fact it’s such an intimidating question that we often try to push it under the carpet as long as we can. Why is it so important? If you can successfully figure out your “WHY” then it would serve as a lifelong fuel for your motivation. You would stop looking for inspiration anymore. Whether it’s becoming a millionaire or achieving a celebrity status or making an ultimate dent in the universe, figuring out your why is going to be critical in propelling your work to the next level. 8. Don’t ever stop yourself from experimenting “Experimenting with your own life is the most fundamental medium you have.” — Natalie Jeremijenko You are so afraid of failure that you refrain from trying new things. But if you never try, you’ll never know what’s on the other side. You need to leave the comfort of the shore to explore new horizons. So what are you waiting for? Want to explore a new career? Want to learn a new language? Wish to explore a completely different country and culture? Want to start your own business? Just start with one step at a time. Test some water and then take the plunge. 9. Focus on doing a few things exceptionally well “Be a yardstick of quality. Some people aren’t used to an environment where excellence is expected.” — Steve Jobs Once you accept that you just can’t do everything, you will start focusing on few things important to you. Things you are really passionate about. You can simply get more done in life if you just focus on one thing and try your level best to do it really well. It takes a whole lot of sacrifices to achieve anything special in life. Be always relentless in your pursuit of excellence; meanwhile don’t forget to enjoy the view of your journey. 10. Start taking care of your health right now “A man too busy to take care of his health is like a mechanic too busy to take care of his tools.” — Anonymous And I mean right now…no more delays. The way you treat your body has a holistic effect on your long-term well-being. Once your body obtains the complete adulthood, it’s on a continuous path of decay. If you keep neglecting few of the obvious signs, the speed at which the body keeps disintegrating gains unwarranted momentum. So developing an early habit of healthy eating and regular exercising should get the top most priority without any excuses. If you liked this article, click the💚 below so other people could find it here on Medium. Originally published in http://studentlifemadeeasy.com/10-small-but-smart-decisions-to-transform-your-life/ ", "title": "10 Small but Smart Decisions to Influence the Theme of Your Life", "sentences": [{"06ad": "10 Small but Smart Decisions to Influence the Theme of Your Life"}, {"e3cd": "Are you game for it?"}, {"f103": "Image Credit Pixabay.com"}, {"8b7f": "“I believe the biggest themes of life are put into the best focus when held up against the very sharp light of mortality.” — Mitch Albom"}, {"9fc6": "Since life is lived one day at a time.We often forget that “Life is really short”."}, {"a367": "We act like mortals in all that we fear and act like immortals in all that we desire."}, {"b8ab": "Considering a lifespan of 75 years, one has 657,000 hours in total.With 7 hours of sleep daily, the person sleeps for about 200,000 hours.Hours one is awake — 457,000 hours"}, {"2827": "Research says that we spend about 46% of our wake up time thinking about things we are not doing at that moment. This takes away about 215,000 hours. So we are effectively left with 242,000 hours i.e. 28 years to live."}, {"242d": "Shouldn’t we spend this relatively small amount of time in making those smart choices that has potential to influence the broader theme of our life?"}, {"9781": "1.Your support system should always get the priority it deserves"}, {"9ed3": "“If you think the ocean isn’t important, imagine Earth without it. Mars comes to mind. No ocean, no life support system.” — Sylvia Earle"}, {"2453": "There are only a handful of people who really do care about you. Make sure you stay close to them."}, {"70da": "They are your primary support system, so continuous emotional investment in them should always figure among your topmost priorities."}, {"cbf9": "They’re the ones who were always there for you when you were all alone. Anytime you turned around, you will always find them behind you."}, {"57d4": "Image courtesy of Unsplash"}, {"88a7": "2. Invest into a habit of daily learning"}, {"c032": "“As long as I’m learning every day of my life, I will never feel old. Never. And I don’t feel old; I feel in my head and in my heart — I don’t know, ageless!” — Pat Mitchell"}, {"976e": "If possible Learn at least one new thing a day. This could just be one word from a new language, a trivia, a historical incident, a new scientific fact, a unique strategy or anything else that might excite you."}, {"20da": "Once you translate this into a habit, your journey to become an awesome person would get more effortless."}, {"4adc": "3. Even the smartest person in the room doesn't have all the answers"}, {"1401": "“You don’t have to have all the answers all the time. But the best thing to know is what you don’t know.” — Christine Quinn"}, {"7c31": "When in doubt, the best strategy is to simply respond with “I never thought about it, Let me think.” If you choose to do so nobody is going to question your intellect and label you as an incompetent."}, {"c673": "Because deep inside we all know that we don’t always have all the right answer to every query. So instead of rushing to an answer, tell the person that you need just a little time to think it in detail."}, {"7876": "This gesture succeeds in projecting you as someone who is a bit thoughtful while giving you invaluable time to respond accordingly."}, {"d7a6": "4. You are not the center of this universe"}, {"0de4": "“I guess real maturity, which most of us never achieve, is when you realize that you’re not the center of the universe.” — Katherine Paterson"}, {"2f7e": "Extremely sorry to disappoint you but the truth is — most people just don’t care about you. You simply don’t figure in their universe."}, {"0455": "Of course if you happen to be a celebrity of any sort then this may not apply to you, but for most mere mortals like us there is absolutely no point in worrying about what other people think of you."}, {"a1ae": "At the same time all the constructive feedback coming from people who are emotionally invested in you and really do care about you should get your undivided attention."}, {"d5d9": "Your entire focus should be on — being the best possible version of yourself."}, {"1779": "5. Learn to pace yourself"}, {"f31d": "“Life is a marathon, not a sprint; pace yourself accordingly.” — Amby Burfoot"}, {"0a04": "There is absolutely no harm in slowing down once a while."}, {"53e1": "No one is disputing your lifetime objective of making a dent in the universe. However your mad rush in reaching your goal should never kill all the fun associated with the journey."}, {"4f87": "There is nothing special waiting for you once you reach your final destination. So you can always afford to take a deep breath and slow down."}, {"6d3b": "Slowing the pace will always give you an invaluable opportunity to reassess your current situation and adapt accordingly: course correction."}, {"4da3": "6. Stop judging people for who they are, and what they do"}, {"5122": "“Stop judging others by what you see. Because what you see is what they want you to see.” — Anonymous"}, {"ea5b": "Simply, because you aren't privy to every detail of their journey and life struggles. So please refrain from making a total ass of yourself."}, {"87d1": "Get rid of this default habit of judging people on face value."}, {"7071": "I know… it’s kind of tough to make any drastic changes in your default habit, yet you need to really push yourself hard to make it an integral part of your newly acquired habit."}, {"f0e3": "7. Figure out your why"}, {"1dab": "“There are two great days in a person’s life — the day we are born and the day we discover why.” — William Barclay"}, {"d403": "In fact it’s such an intimidating question that we often try to push it under the carpet as long as we can."}, {"0fab": "Why is it so important?"}, {"125f": "If you can successfully figure out your “WHY” then it would serve as a lifelong fuel for your motivation. You would stop looking for inspiration anymore."}, {"1071": "Whether it’s becoming a millionaire or achieving a celebrity status or making an ultimate dent in the universe, figuring out your why is going to be critical in propelling your work to the next level."}, {"2d8f": "8. Don’t ever stop yourself from experimenting"}, {"7c46": "“Experimenting with your own life is the most fundamental medium you have.” — Natalie Jeremijenko"}, {"4776": "You are so afraid of failure that you refrain from trying new things."}, {"9459": "But if you never try, you’ll never know what’s on the other side. You need to leave the comfort of the shore to explore new horizons."}, {"bf59": "So what are you waiting for?"}, {"410a": "Want to explore a new career? Want to learn a new language? Wish to explore a completely different country and culture? Want to start your own business?"}, {"3e05": "Just start with one step at a time. Test some water and then take the plunge."}, {"f824": "9. Focus on doing a few things exceptionally well"}, {"91df": "“Be a yardstick of quality. Some people aren’t used to an environment where excellence is expected.” — Steve Jobs"}, {"a701": "Once you accept that you just can’t do everything, you will start focusing on few things important to you. Things you are really passionate about."}, {"8025": "You can simply get more done in life if you just focus on one thing and try your level best to do it really well."}, {"4050": "It takes a whole lot of sacrifices to achieve anything special in life. Be always relentless in your pursuit of excellence; meanwhile don’t forget to enjoy the view of your journey."}, {"2c11": "10. Start taking care of your health right now"}, {"d878": "“A man too busy to take care of his health is like a mechanic too busy to take care of his tools.” — Anonymous"}, {"acca": "And I mean right now…no more delays. The way you treat your body has a holistic effect on your long-term well-being."}, {"f4e2": "Once your body obtains the complete adulthood, it’s on a continuous path of decay. If you keep neglecting few of the obvious signs, the speed at which the body keeps disintegrating gains unwarranted momentum."}, {"9cef": "So developing an early habit of healthy eating and regular exercising should get the top most priority without any excuses."}, {"4cb2": "If you liked this article, click the💚 below so other people could find it here on Medium."}, {"108a": "Originally published in http://studentlifemadeeasy.com/10-small-but-smart-decisions-to-transform-your-life/"}], "child": "1450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_21450_1\t1450_2"}