{"name": "1461", "parent": "", "content": "Conquer your fears I always loved flying. It makes your life easier and makes you reach your destination faster. Right? And everyone prefers that. But what would life be if you suddenly realize that you cannot fly, or at least not alone. The very thought of it makes you feel crippled. Flying was the most natural thing to do for me when I was in India, as I used to prefer taking a flight to visit home, which used to be every three months or so. It was faster, comfortable and I loved it. A couple of years back, for an ear infection, the doctor advised me to go for an MRI. I went inside the MRI machine and came back a completely different person. It is difficult to explain someone what claustrophobia feels like, and I don’t blame them because it is indeed difficult to imagine how someone can feel claustrophobic in absolutely normal situations. My husband and I spent countless weekends just getting my mind re-trained on the basics, that these situations are perfectly normal and not claustrophobic, we took multiple train rides back and forth to make me comfortable with them. We spent hours talking about it and making me feel comfortable with life situations. We tried avoiding situations that made me feel uncomfortable and then gradually exposed me to them, when I was ready. Thankfully, because of a supporting husband, I almost got rid of my claustrophobia. The only thing that remained was taking a flight alone. I just could never gather enough courage to do it. My husband and I visited India recently, and took flights together, I was completely at ease and this was a perfect scenario for me. I was at peace because I knew he was going to be there with me going to and coming back from India. But I was wrong. Unfortunately, because of some turn of events, I got to know that I would have to return to the US alone. I was absolutely shell-shocked. I didn’t know how I would be able to fly alone. I became numb, I didn’t know how, how exactly I will reach the US. I spent a couple of days being numb and then realized that it is not going to help. I was shaking but I closed my eyes and told myself that I need to do this, this is probably the perfect chance for me to conquer my fears, that I am going to do it and I will be okay. And then I completely stopped thinking about it. Fear of a fear is greater than the fear itself. I did not think about the flight until I was inside the aircraft, I did not think about claustrophobia and it didn’t bother me. It was incredible to know that the more importance you give to your fears the stronger they become. I reached US with zero fear. The short domestic flight was a bumpy ride but I am pretty sure that everyone inside the aircraft was equally uneasy about that one. I cannot possibly explain the joy I felt when I reached home. The fear that I was harboring for years was suddenly gone, I had conquered my fear. And the strategy was simple, I just stopped giving it importance. Now I feel empowered and more importantly, free. I have never felt better. If you are dealing with claustrophobia, please feel free to reach out to me and I would be more than happy to help you in any way I possibly can. If I can conquer it, so can you :) ", "title": "Conquer your fears", "sentences": [{"805b": "Conquer your fears"}, {"80e3": "I always loved flying. It makes your life easier and makes you reach your destination faster. Right? And everyone prefers that. But what would life be if you suddenly realize that you cannot fly, or at least not alone. The very thought of it makes you feel crippled."}, {"c7de": "Flying was the most natural thing to do for me when I was in India, as I used to prefer taking a flight to visit home, which used to be every three months or so. It was faster, comfortable and I loved it."}, {"99a2": "A couple of years back, for an ear infection, the doctor advised me to go for an MRI. I went inside the MRI machine and came back a completely different person."}, {"ee84": "It is difficult to explain someone what claustrophobia feels like, and I don’t blame them because it is indeed difficult to imagine how someone can feel claustrophobic in absolutely normal situations. My husband and I spent countless weekends just getting my mind re-trained on the basics, that these situations are perfectly normal and not claustrophobic, we took multiple train rides back and forth to make me comfortable with them. We spent hours talking about it and making me feel comfortable with life situations. We tried avoiding situations that made me feel uncomfortable and then gradually exposed me to them, when I was ready. Thankfully, because of a supporting husband, I almost got rid of my claustrophobia. The only thing that remained was taking a flight alone. I just could never gather enough courage to do it."}, {"f204": "My husband and I visited India recently, and took flights together, I was completely at ease and this was a perfect scenario for me. I was at peace because I knew he was going to be there with me going to and coming back from India. But I was wrong. Unfortunately, because of some turn of events, I got to know that I would have to return to the US alone. I was absolutely shell-shocked. I didn’t know how I would be able to fly alone. I became numb, I didn’t know how, how exactly I will reach the US. I spent a couple of days being numb and then realized that it is not going to help."}, {"c46e": "I was shaking but I closed my eyes and told myself that I need to do this, this is probably the perfect chance for me to conquer my fears, that I am going to do it and I will be okay. And then I completely stopped thinking about it. Fear of a fear is greater than the fear itself. I did not think about the flight until I was inside the aircraft, I did not think about claustrophobia and it didn’t bother me. It was incredible to know that the more importance you give to your fears the stronger they become."}, {"622f": "I reached US with zero fear. The short domestic flight was a bumpy ride but I am pretty sure that everyone inside the aircraft was equally uneasy about that one."}, {"c273": "I cannot possibly explain the joy I felt when I reached home. The fear that I was harboring for years was suddenly gone, I had conquered my fear. And the strategy was simple, I just stopped giving it importance. Now I feel empowered and more importantly, free. I have never felt better."}, {"3d15": "If you are dealing with claustrophobia, please feel free to reach out to me and I would be more than happy to help you in any way I possibly can. If I can conquer it, so can you :)"}], "child": "1461_1"}