{"name": "1481", "parent": "", "content": "Ich habe eine idea…(I have an idea) I woke up this morning to the Morning News and had to turn it off, as I did falling asleep with the Evening News. Why? The proliferation of mainstream media’s reports focused on negative highlights dominating these first and last messages of each and every day, ranging from Presidential mayhem to elders being mugged on the streets to children being abducted to catastrophe upon catastrophe, death after death…life after life — is numbing us from hearing our own soul-speak. My idea is that we feed ourselves with love-energy at the beginning and end of each day…this musing has prompted to replay an exercise from my Creative Writing class at Franklin High School, where our first story assignment was to create Utopia on 10–15 pages. Utopia 101 — Daily News (media presentation & intended ingestión) The Love Channel — This multi media broadcast network presents live stream and audio programming for main stream media at time slots that correlate with today’s Morning, Evening and Nightly newscasts on television and radio. The Love Channel, in addition to correspondents reporting on uplifting events & observations, will include segments on Mind-Body-Spirit Medicine with interactive talks on movement, meditation and how to eat to live (Food as Medicine). This will promote deeper sleep and calmer beginnings of our day’s engagements. The Doom & Gloom Channel — This multi media broadcast network presents live stream and audio programming for main stream media at time slots that correlate with today’s Mid-day newscasts on television and radio. Doom & Gloom will present programming similar to the current “shock them till you numb them” format. So your infusion of doom & gloom will have an active afternoon of upright hours to process and release the inspired anxiety. So that’s my idea for the day, what’s yours? ", "title": "Ich habe eine idea…(I have an idea)", "sentences": [{"bcad": "Ich habe eine idea…(I have an idea)"}, {"c74f": "I woke up this morning to the Morning News and had to turn it off, as I did falling asleep with the Evening News. Why?"}, {"5f2a": "The proliferation of mainstream media’s reports focused on negative highlights dominating these first and last messages of each and every day, ranging from Presidential mayhem to elders being mugged on the streets to children being abducted to catastrophe upon catastrophe, death after death…life after life — is numbing us from hearing our own soul-speak."}, {"c974": "My idea is that we feed ourselves with love-energy at the beginning and end of each day…this musing has prompted to replay an exercise from my Creative Writing class at Franklin High School, where our first story assignment was to create Utopia on 10–15 pages."}, {"5301": "Utopia 101 — Daily News (media presentation & intended ingestión)"}, {"ba32": "The Love Channel — This multi media broadcast network presents live stream and audio programming for main stream media at time slots that correlate with today’s Morning, Evening and Nightly newscasts on television and radio. The Love Channel, in addition to correspondents reporting on uplifting events & observations, will include segments on Mind-Body-Spirit Medicine with interactive talks on movement, meditation and how to eat to live (Food as Medicine). This will promote deeper sleep and calmer beginnings of our day’s engagements."}, {"65fe": "The Doom & Gloom Channel — This multi media broadcast network presents live stream and audio programming for main stream media at time slots that correlate with today’s Mid-day newscasts on television and radio. Doom & Gloom will present programming similar to the current “shock them till you numb them” format. So your infusion of doom & gloom will have an active afternoon of upright hours to process and release the inspired anxiety."}, {"d991": "So that’s my idea for the day, what’s yours?"}], "child": "1481_1\t1481_2"}