{"name": "1482", "parent": "", "content": "Epitome of “More-ness” aka the “More-ness Monster” The “More-ness” of Privilege White people are not afraid to ask for more. Also, in direct correlation, white people are not afraid to take, if what is asked for is not sufficient, or not meeting the standards of their request. They ask for more time, more money, more land, more food. I waited in line for Chipotle on a rather sunny Thursday afternoon, and saw a woman so daring in her asking — asking for more mild, more peppers, for a taste of chorizo. So inclined to ask for more she single-handedly held up the line to do so. She was exercising her right not just as a human, but as an American, white woman human. And, rightfully so. This is the American apple pie-esque fortitude one can only hope to dream of. I, meager self, stood in line and asked “why do I not ask for more?” And if that request is not met, why do I cower into my halfway cubicle desk like the hamster in the wheel? Why do I not demand even the littlest of things? This idea of the fear of “the ask”, this harkens back to a time when asking for more hog, or more time alone with your partner on the other plantation, was a whooping, a beating, a punishment, a hanging. What is it about them, white persons, that makes them impervious to failure? It is indoctrinated in them from youth. History has given them the authority. They can look in school books and texts that show explicitly how, without fail, in every single possible instance known to man, they have taken without asking, taken, still after being denied, and see “no” not as a finality, but as a mere speed bump to a resounding, and more than likely defiant, “yes”. It is a sad thing when a history of a people, can marked by a taking less than approach, as settling for what is leftover, when what has been laid out has been deemed sufficient enough by the powers that be, better known as the “oppressor”. Far often than not, the oppressor is wealthy and white, and the oppressed are poor minorities. In this modern day caste system called “democracy” there are indeed winners and losers, givers and takers; the land in which this nation was built upon was taken, taken and stolen from the hands and grips of an indigenous people already claiming the grounds as there own. “Taking” is historically a white privilege, it lives as early on as the spice trade, through the transatlanic slave trade, to present day fashion shows, with theft and appropriation on full display. What stops me from asking for “more”? What makes me add “please?” to end of my “more’s”? I am constantly in rooms with men, white men, who don’t cower, who do not just say “more”, but require it, silently; who stand firm in their more-ness — “more” is their birthright. Questioning their “why more’ may undoubtedly lead to a more profound “why not?”, followed by a gang of applause from the Steve Bannon/Sean Spicer type. Privilege, its essence, is ending police brutality with a Pepsi can. In my own life, I have to ask myself what keeps me from asking for more — more money, more cheese on a burrito bowl, more time? The “more can be extended to “better” — better schools, better food options, better jobs. This can be compounded to “bigger” — bigger home, bigger stake-hold of the American dream, bigger paycheck. More times than not, taking what America says is already there to be took, is a service only allotted to a select few. This idea of upward mobility, that is redeemable and supposedly mine as well, this fantasy of the “American Dream” which feels more like a relic of the “Leave it To beaver” days than an actual call-to-action for those looking for a way out of squalor, feels more myth than tangible reality. My mother gave me lessons, but no tools — my mother meant well, my mother is amazing, strong, hard-working, a beautiful mind, spirit and soul who worked the night shift at Jacobi Hospital in the Bronx to give her children this American dream so often spoken about by radical leftists and right winged idea pushers, all clinging to this ideal fairy tale where we are all saved by the prince charming of bootstraps and hard work. But, my mother was a single mother, with a veteran for a husband suffering from his own PTSD trauma from Vietnam, another way the American dream gives back to those who serve it’s conquests -mental health disorders, a poor social security structure for ailing veterans who come home, and hospital bills and lack of proper treatment at times. My mother raised three Black boys during the Regan era, in the midst of the crack epidemic in the Bronx (still one of the poorest urban areas in the country). There will be the lot who will ask “why so many children” spouting whatever catchy phrase Rush Limbaugh spews, always tied with a ribbon of racism at its fringes; to them I see, would you ask if she not Black? My mother gave us lessons “be a leader, not a follower”, “follow your dreams”, “shoot for the stars”. In theory, these sayings are powerful, and can give one born disadvantaged (“Black” should be able to get you the blue disabled parking pass for life) the strength and will to overcome the challenges and setbacks that arise when one is born into a structure meant to keep a certain segment of the population disillusioned and disenfranchised. however, without the tools, without the learnings and know-how for integrating the rhetoric of “you can do it” into your life, without knowing how to properly convert tutelage to manifestation, without having someone show you how to fish, a fishing rod is just a stick to be admired. I once found myself in a room with others I would consider to be my equals. Salary and pay aside, we were all creatives, all writers. Some with different titles than others, but all writers nonetheless. Sitting in this space, in this room with cubicles with windows and doors, various water options, an almost finished recording studio for a very important Hip-Hop legend and lyricist, in a space with comfy sofa seats, I was asked about my social media following, how had I built such a massive body of followers. And I casually humbled myself to utter the word, “luck”. Not hard work, a masterful pen, a working knowledge of culture and countless hours learning the in’s and out’s of communication and social media communities. No. I said luck, to this room of white faces, because it is easier to downplay my accomplishments than acknowledge the work needed to get to where I am, presently. No one likes an “uppity nigger”, you are taught early and often; you are taught to refrain from boasting and braggadocio behavior, the same behavior Hollywood stars are praised for (i.e. — think any action filled blockbuster with a white lead), the same behavior the likes of Lebron James and Cam Newton are ridiculed for. The fear of more, of asking, rather demanding more, the expectancy that you receive more, because you are deserving of more, is a trait not inherently Black. Its is not something that is taught or groomed early on. But, all habits, all practices take just that…practice. The next time I am in the room, seated at the table, I will speak my more-ness into all the corners, all the spaces, all the mouths and lines in the walls, to the backs of heads, to the eyes and ears of those willing to listen, or those too scared to acknowledge the power that ownership of truth represents. That is a privilege, a privilege all my own. ", "title": "The “More-ness” of Privilege", "sentences": [{"7f69": "Epitome of “More-ness” aka the “More-ness Monster”"}, {"32b6": "The “More-ness” of Privilege"}, {"7d79": "White people are not afraid to ask for more. Also, in direct correlation, white people are not afraid to take, if what is asked for is not sufficient, or not meeting the standards of their request. They ask for more time, more money, more land, more food. I waited in line for Chipotle on a rather sunny Thursday afternoon, and saw a woman so daring in her asking — asking for more mild, more peppers, for a taste of chorizo. So inclined to ask for more she single-handedly held up the line to do so. She was exercising her right not just as a human, but as an American, white woman human. And, rightfully so. This is the American apple pie-esque fortitude one can only hope to dream of. I, meager self, stood in line and asked “why do I not ask for more?” And if that request is not met, why do I cower into my halfway cubicle desk like the hamster in the wheel? Why do I not demand even the littlest of things?"}, {"b50d": "This idea of the fear of “the ask”, this harkens back to a time when asking for more hog, or more time alone with your partner on the other plantation, was a whooping, a beating, a punishment, a hanging. What is it about them, white persons, that makes them impervious to failure? It is indoctrinated in them from youth. History has given them the authority. They can look in school books and texts that show explicitly how, without fail, in every single possible instance known to man, they have taken without asking, taken, still after being denied, and see “no” not as a finality, but as a mere speed bump to a resounding, and more than likely defiant, “yes”."}, {"00f4": "It is a sad thing when a history of a people, can marked by a taking less than approach, as settling for what is leftover, when what has been laid out has been deemed sufficient enough by the powers that be, better known as the “oppressor”. Far often than not, the oppressor is wealthy and white, and the oppressed are poor minorities. In this modern day caste system called “democracy” there are indeed winners and losers, givers and takers; the land in which this nation was built upon was taken, taken and stolen from the hands and grips of an indigenous people already claiming the grounds as there own. “Taking” is historically a white privilege, it lives as early on as the spice trade, through the transatlanic slave trade, to present day fashion shows, with theft and appropriation on full display."}, {"c774": "What stops me from asking for “more”? What makes me add “please?” to end of my “more’s”? I am constantly in rooms with men, white men, who don’t cower, who do not just say “more”, but require it, silently; who stand firm in their more-ness — “more” is their birthright. Questioning their “why more’ may undoubtedly lead to a more profound “why not?”, followed by a gang of applause from the Steve Bannon/Sean Spicer type. Privilege, its essence, is ending police brutality with a Pepsi can. In my own life, I have to ask myself what keeps me from asking for more — more money, more cheese on a burrito bowl, more time? The “more can be extended to “better” — better schools, better food options, better jobs. This can be compounded to “bigger” — bigger home, bigger stake-hold of the American dream, bigger paycheck. More times than not, taking what America says is already there to be took, is a service only allotted to a select few. This idea of upward mobility, that is redeemable and supposedly mine as well, this fantasy of the “American Dream” which feels more like a relic of the “Leave it To beaver” days than an actual call-to-action for those looking for a way out of squalor, feels more myth than tangible reality."}, {"7a53": "My mother gave me lessons, but no tools — my mother meant well, my mother is amazing, strong, hard-working, a beautiful mind, spirit and soul who worked the night shift at Jacobi Hospital in the Bronx to give her children this American dream so often spoken about by radical leftists and right winged idea pushers, all clinging to this ideal fairy tale where we are all saved by the prince charming of bootstraps and hard work. But, my mother was a single mother, with a veteran for a husband suffering from his own PTSD trauma from Vietnam, another way the American dream gives back to those who serve it’s conquests -mental health disorders, a poor social security structure for ailing veterans who come home, and hospital bills and lack of proper treatment at times. My mother raised three Black boys during the Regan era, in the midst of the crack epidemic in the Bronx (still one of the poorest urban areas in the country). There will be the lot who will ask “why so many children” spouting whatever catchy phrase Rush Limbaugh spews, always tied with a ribbon of racism at its fringes; to them I see, would you ask if she not Black?"}, {"0d3c": "My mother gave us lessons “be a leader, not a follower”, “follow your dreams”, “shoot for the stars”. In theory, these sayings are powerful, and can give one born disadvantaged (“Black” should be able to get you the blue disabled parking pass for life) the strength and will to overcome the challenges and setbacks that arise when one is born into a structure meant to keep a certain segment of the population disillusioned and disenfranchised. however, without the tools, without the learnings and know-how for integrating the rhetoric of “you can do it” into your life, without knowing how to properly convert tutelage to manifestation, without having someone show you how to fish, a fishing rod is just a stick to be admired."}, {"f9df": "I once found myself in a room with others I would consider to be my equals. Salary and pay aside, we were all creatives, all writers. Some with different titles than others, but all writers nonetheless. Sitting in this space, in this room with cubicles with windows and doors, various water options, an almost finished recording studio for a very important Hip-Hop legend and lyricist, in a space with comfy sofa seats, I was asked about my social media following, how had I built such a massive body of followers. And I casually humbled myself to utter the word, “luck”. Not hard work, a masterful pen, a working knowledge of culture and countless hours learning the in’s and out’s of communication and social media communities. No. I said luck, to this room of white faces, because it is easier to downplay my accomplishments than acknowledge the work needed to get to where I am, presently. No one likes an “uppity nigger”, you are taught early and often; you are taught to refrain from boasting and braggadocio behavior, the same behavior Hollywood stars are praised for (i.e. — think any action filled blockbuster with a white lead), the same behavior the likes of Lebron James and Cam Newton are ridiculed for. The fear of more, of asking, rather demanding more, the expectancy that you receive more, because you are deserving of more, is a trait not inherently Black. Its is not something that is taught or groomed early on."}, {"c26b": "But, all habits, all practices take just that…practice. The next time I am in the room, seated at the table, I will speak my more-ness into all the corners, all the spaces, all the mouths and lines in the walls, to the backs of heads, to the eyes and ears of those willing to listen, or those too scared to acknowledge the power that ownership of truth represents. That is a privilege, a privilege all my own."}], "child": "1482_1\t1482_2\t1482_3\t1482_4\t1482_5\t1482_6\t1482_7\t1482_8\t1482_9\t1482_10\t1482_11\t1482_12\t1482_13\t1482_14\t1482_15\t1482_16\t1482_17\t1482_18\t1482_19\t1482_20\t1482_21\t1482_22"}