{"name": "1483", "parent": "", "content": "How Sean Spicer Should Quit 9 Blaze-Of-Glory Ideas (That Have Nothing To Do With Hitler) Poor Sean Spicer. He wants to be out of a job so badly. But what’s a guy to do when you can’t get fired for telling a room full of journalists that Hitler didn’t gas “his own people”? Answer: you have to get creative. Despite our differences, everyone can relate to being stuck in a terrible job, so we want to help Sean Spicer. Here are nine sure-fire ways for the Press Secretary to make a dramatic exit and start a new life somewhere out of the spotlight (or on Fox & Friends, whichever). 1. The Mary Poppins Pull a giant umbrella from your giant suit and float away. 2. Chocolate Revenge Make reporters watch you eat an entire chocolate cake on the podium. Offer some to Glenn Thrush then say “PSYCH, BITCH” and finish cake in one bite. 3. The Differential Bring out a stack of papers. Explain that you are BIGGER and the stack of papers is SMALLER… look around the room meaningfully, leave. 4. The Switcheroo Wear a gray suit and “Press” hat, take a seat amidst reporters. Wait silently and when “Spicer” doesn’t show, scream “I’m a journalist, I don’t have time for this!” and walk out. 5. The Unimaginary Friend Bring a rat to the podium with you and only take questions from it. When someone finally asks why you’re taking questions from a rat, gasp and say, “You see him, too?” Run. 6. The Up Tie 100 balloons to podium, fly away. 7. Reverse Stripper Yell “SURPRISE!”, get inside a giant cake and wait until someone wheels you out of the room. 8. Three Words: Carrie Prom Scene 9. Viking Funeral Put your podium on a boat and shove it out into the Lincoln Memorial reflecting pool. Borrow a bow and arrow from Bannon’s office and light it up. Take your place in the halls of Valhalla. Or maybe just a consulting firm. ", "title": "How Sean Spicer Should Quit", "sentences": [{"911e": "How Sean Spicer Should Quit"}, {"f9de": "9 Blaze-Of-Glory Ideas (That Have Nothing To Do With Hitler)"}, {"7e7c": "Poor Sean Spicer. He wants to be out of a job so badly. But what’s a guy to do when you can’t get fired for telling a room full of journalists that Hitler didn’t gas “his own people”? Answer: you have to get creative."}, {"3290": "Despite our differences, everyone can relate to being stuck in a terrible job, so we want to help Sean Spicer. Here are nine sure-fire ways for the Press Secretary to make a dramatic exit and start a new life somewhere out of the spotlight (or on Fox & Friends, whichever)."}, {"0eec": "1. The Mary Poppins"}, {"2604": "Pull a giant umbrella from your giant suit and float away."}, {"9599": "2. Chocolate Revenge"}, {"0270": "Make reporters watch you eat an entire chocolate cake on the podium. Offer some to Glenn Thrush then say “PSYCH, BITCH” and finish cake in one bite."}, {"ccc7": "3. The Differential"}, {"b38f": "Bring out a stack of papers. Explain that you are BIGGER and the stack of papers is SMALLER… look around the room meaningfully, leave."}, {"1f93": "4. The Switcheroo"}, {"cfeb": "Wear a gray suit and “Press” hat, take a seat amidst reporters. Wait silently and when “Spicer” doesn’t show, scream “I’m a journalist, I don’t have time for this!” and walk out."}, {"61b2": "5. The Unimaginary Friend"}, {"f619": "Bring a rat to the podium with you and only take questions from it. When someone finally asks why you’re taking questions from a rat, gasp and say, “You see him, too?” Run."}, {"a42a": "6. The Up"}, {"b977": "Tie 100 balloons to podium, fly away."}, {"b559": "7. Reverse Stripper"}, {"a0a3": "Yell “SURPRISE!”, get inside a giant cake and wait until someone wheels you out of the room."}, {"19b8": "8. Three Words: Carrie Prom Scene"}, {"4aa4": "9. Viking Funeral"}, {"fee4": "Put your podium on a boat and shove it out into the Lincoln Memorial reflecting pool. Borrow a bow and arrow from Bannon’s office and light it up. Take your place in the halls of Valhalla. Or maybe just a consulting firm."}], "child": "1483_1\t1483_2\t1483_3\t1483_4\t1483_5\t1483_6\t1483_7"}