{"name": "1484", "parent": "", "content": "Truth In Satire Sean Spicer Calls Stalin’s Barbaric Siberian Gulags “Secluded Spa Resorts” Clumsy remark follows earlier gaffe referring to Hitler’s concentration camps as “Holocaust centers” Just when you thought that White House Press Secretary Sean Spicer was starting to hit his stride, he rammed his foot back in his mouth with a series of offensive remarks that caused a national uproar and drew renewed outcries for his dismissal. In his first clumsy gaffe earlier this week, the beleaguered Spicer suggested that Hitler was not such a bad guy compared to Bashar al-Assad of Syria, and went on to awkwardly refer to Nazi death camps as gentile-sounding “Holocaust centers.” The following day, favorably comparing Russian dictator Joseph Stalin to Vladimir Putin, he gracelessly called the ruthless strongman’s Siberian gulags, where tens of thousands died in incredibly harsh conditions, “secluded spa resorts.” Yesterday saw another one-two punch of stunning verbal blunders when Spicer referred to Kim Jong Un’s hard labor camps in North Korea — where prisoners smash rocks for up to 14 hours a day — interesting “archaeological digs,” and the former Shah of Iran’s notorious Evin Prison, a brutal hell on earth by all accounts, a “must-see vacation destination.” Called out by the White House press corps for his jaw-dropping series of embarrassing bloopers, Spicer said, “I screwed up, plain and simple — especially with it being Passover week, with our Secretary of State visiting Moscow, with a U.S. nuclear sub sitting provocatively off the coast of the Korean Peninsula, and President Trump determined to put Iran back in its place. As press secretary, I just have to learn to keep my mouth shut whenever the mainstream media asks me a question.” Spicer added that in the future he will not step behind the lectern during daily press briefings, preferring to let White House reporters make up his answers for him, “which in the end, will probably get me in a lot less trouble.” **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. — AI ", "title": "Sean Spicer Calls Stalin’s Barbaric Siberian Gulags “Secluded Spa Resorts”", "sentences": [{"14b2": "Truth In Satire"}, {"7dbf": "Sean Spicer Calls Stalin’s Barbaric Siberian Gulags “Secluded Spa Resorts”"}, {"3e81": "Clumsy remark follows earlier gaffe referring to Hitler’s concentration camps as “Holocaust centers”"}, {"beea": "Just when you thought that White House Press Secretary Sean Spicer was starting to hit his stride, he rammed his foot back in his mouth with a series of offensive remarks that caused a national uproar and drew renewed outcries for his dismissal."}, {"0c7b": "In his first clumsy gaffe earlier this week, the beleaguered Spicer suggested that Hitler was not such a bad guy compared to Bashar al-Assad of Syria, and went on to awkwardly refer to Nazi death camps as gentile-sounding “Holocaust centers.”"}, {"7266": "The following day, favorably comparing Russian dictator Joseph Stalin to Vladimir Putin, he gracelessly called the ruthless strongman’s Siberian gulags, where tens of thousands died in incredibly harsh conditions, “secluded spa resorts.”"}, {"e12b": "Yesterday saw another one-two punch of stunning verbal blunders when Spicer referred to Kim Jong Un’s hard labor camps in North Korea — where prisoners smash rocks for up to 14 hours a day — interesting “archaeological digs,” and the former Shah of Iran’s notorious Evin Prison, a brutal hell on earth by all accounts, a “must-see vacation destination.”"}, {"058a": "Called out by the White House press corps for his jaw-dropping series of embarrassing bloopers, Spicer said, “I screwed up, plain and simple — especially with it being Passover week, with our Secretary of State visiting Moscow, with a U.S. nuclear sub sitting provocatively off the coast of the Korean Peninsula, and President Trump determined to put Iran back in its place. As press secretary, I just have to learn to keep my mouth shut whenever the mainstream media asks me a question.”"}, {"e16f": "Spicer added that in the future he will not step behind the lectern during daily press briefings, preferring to let White House reporters make up his answers for him, “which in the end, will probably get me in a lot less trouble.”"}, {"d1a8": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"e537": "— AI"}], "child": "1484_1\t1484_2\t1484_3\t1484_4\t1484_5\t1484_6\t1484_7\t1484_8\t1484_9\t1484_10\t1484_11\t1484_12\t1484_13\t1484_14\t1484_15"}