{"name": "1485", "parent": "", "content": "Prioritizing Economics is Crippling the U.S. Economy “It is often assumed that an economy of private enterprise has an automatic bias toward innovation, but this is not so. It has a bias only toward profit.” — Eric Hobsbawm The first time I arrived in the United States as more than a tourist was in September 2008, to begin graduate school. It was a fateful time to land in the country: within weeks, the US financial system began to melt down. In seeking to understand quite how this had happened, a term began to be used that I wasn’t very familiar with. Moral hazard: In economics, moral hazard occurs when one person takes more risks because someone else bears the cost of those risks. (Wikipedia) A lot of people were soon exposed to the idea of moral hazard. Whereas I was fortunate to be learning about it in academic setting, many others were learning about it as a consequence of their livelihoods disappearing. Whether it was the collateralization of subprime assets by the banks — bundling up questionable loans and then offloading them (the banking equivalent of hot potato); or the realization by bankers that the Federal Government wouldn’t allow the financial system to fail (and therefore would bail them and their “too big to fail” friends out) — it seemed any way you looked at the Great Recession, moral hazard was everywhere. Unsurprisingly, people were getting pretty mad at those that had exploited it. Something about blaming the bankers didn’t quite square with the talk of moral hazard, however. Of course, there was no doubt that the bankers had profited in a circumstance in which they should not have. But here’s the thing: weren’t they acting in an entirely rational way? If that question doesn’t stop you in your tracks — then read it again. The most powerful financial organizations in the world were, for some perverse reason, being incentivized to behave in a way that ultimately caused a global financial meltdown. How did this happen? And was it a one-off, or symptomatic of a deeper sickness? In 1990, American economist William Baumol published a paper called Entrepreneurship: Productive, Unproductive, and Destructive. In it, Baumol — frustrated with the idea that entrepreneurship was this quixotic thing that waxed and waned for unexplained reasons — set out to get the bottom of why it was that in some circumstances it flourished; in others, it seemed to wither. He reached the most unexpected of conclusions. Rather than entrepreneurship arising and disappearing as if by magic — Baumol realized we’d simply been categorizing things incorrectly. Whereas the traditional view of the entrepreneur was of folks developing innovations and creating new markets, Baumol countered that entrepreneurs are simply “persons who are ingenious and creative in finding ways that add to their own wealth, power, and prestige”. When you take that view of things, suddenly you realize: it doesn’t matter where you are… there are entrepreneurs all around you. It’s just they don’t always conform with our traditional stereotypes of what an “entrepreneur” is. And herein lies the first of Baumol’s two great insights: There is such a thing as bad entrepreneurship. If entrepreneurs are “ingenious and creative folks pursuing wealth, power, prestige”, then they will pursue those goals in whatever way makes most sense. That might mean starting a company in a garage in Silicon Valley — which is the image that “entrepreneurship” typically calls to mind. But it doesn’t need to be so grand — it also includes starting a small business in your local community. Baumol calls this productive entrepreneurship. At the other end of the scale, you’ll find people getting rich off others’ misery — destructive entrepreneurship. Traditionally, you might not associate people like this with the word “entrepreneur” — but they absolutely are. The category in between these two might get much less in the way of headlines, but for our purposes, is actually much more interesting; that is, unproductive entrepreneurship. Unproductive entrepreneurship isn’t illegal, but let’s just say nobody’s going to be putting flowers outside your business when you die, either. Think: lobbying, playing games with tax avoidance, and good old fashioned regulatory capture. When the entrepreneur of this variety wins, the rest of us do not. In fact, more often than not — we lose. In sum: productive entrepreneurs focus first on growing the pie; unproductive entrepreneurs are focused first on dividing the pie; and destructive entrepreneurs are really only interested in stealing the pie. The trillion dollar question then becomes: what determines the type of entrepreneurship you get? It’s here that we get to Baumol’s second, and perhaps most important, insight: How the entrepreneur acts at a given time and place depends heavily on the rules of the game — the reward structure in the economy — that happen to prevail. The rules of the game determine the kind of entrepreneurship you get. Looking at the American economy today from afar, it doesn’t seem there’s much of a problem at all. In fact, it appears to be doing really quite well: the S&P500 has been hitting all time highs. Corporate profits are doing much the same. But look a little deeper, and worrying signs begin to emerge. The biggest hint that something is wrong is when you dig deeper into firm profitability. Profits are increasingly concentrating. For example: the share of profits by the largest four firms in almost every industry inside the US has increased dramatically in the past fifteen years. Source: theeconomist.com In part, this is being driven by corporate concentration. Since 2008, $10 trillion of mergers have taken place in the United States — one of the largest rounds in the country’s history. Given that competition is the cornerstone of a market economy, this is not a good thing. But it’s not just concentration that has resulted in profits at the top going up so much. Lobbying spend doubled in the period depicted in the above chart, from 1997 to 2012. Again, if you think that the executives spending all that money are doing so rationally — and the level of profitability of their firms certainly suggests that they are — then that money is buying them something. To begin with, it’s probably having an outsized impact on their ability to merge in the first place. But that’s not all. There’s a strong case to be made that all that political capture — and the regulation (or in some instances, lack of it) that results — makes it harder for competitors to threaten incumbents. This is a tried and true method for incumbents to stave off disruptors. And that’s before you get into the increased reliance on intagibles like patents — again, which play heavily to the advantages of big incumbents. They’re the only ones, for example, who are properly resourced to fight a patent battle in court. All this sums up to the lowest level of small business creation since the 1970s. Perhaps even more troubling — for the first time since researchers started collecting the data — the rate of business death now exceeds the rate of business creation. Lobbying. Merging to reduce competition. Buying regulation to stifle disruptive threats. Competing in court rather than out in the market. Sounds an awful lot like Baumol’s unproductive entrepreneurship, doesn’t it? It would be tempting to think that, given that so much of this is a question of economics, that the answer must lie in the same field. But there’s a case to be made that these problems aren’t being drive by lack of economics — but rather, by too much economics. Ironically, it was another economist, David Moss, who made that case. Moss spent the past five years doing a deep dive on American democracy, with a view to understanding whether what we’re seeing in the political sphere right now really is different to what has happened in the past. Encouragingly, the history of political tension runs deep throughout American history. These heated debates and deeped political divides are nothing new. But it was far from all good news. In reviewing hundreds of years of policy debates, Moss began to notice that something very fundamental had changed. Up until (roughly) the end of World War 2, almost all policy were organized around a central theme: impact on democracy. The question would be asked: what was this going to mean for our democracy? From both sides of the political spectrum, there was a common commitment to strengthening and preserving democratic ideals. But, starting around the time of the Great Depression in the 1930s, and taking full effect by roughly the end of the 1940s, that changed. No longer was the focus on democracy. Economic growth pushed it the background. One example that Moss cites to show this evolution is broadcast regulation. The first time Congress dealt with this issue was in the mid-1920s — right after the first commercial radio broadcast in 1920. While there were all manner of technical and economic elements to the policy debate that happened, at the heart of the debate, was an intense focus on the implications for society. This cut across both sides of politics: what would be the impact of this new technology, and the industry that was springing up around it, on American democracy? There was broad recognition in Congress that if anyone managed to gain complete radio dominance in a town, city, region or country, then they would have a lock on political discourse in that region. Because the policy debate focused on impact on democracy, Congress recognized this could happen. And it feared it. As a result, spectrum was retained under Government control, and was licensed out to private parties. Fast forward to the 1960s, and a very different debate was happening on allocation of spectrum. It had the same technical and economic elements as in the 1920s — which, of course, is no bad thing. But the nature of the change was stark. The focus on the impact of democracy had largely disappeared. It had been crowded out entirely by the economic focus. When I heard Moss talk about this, he was at pains to say that this was his impression from researching the history of all these policy debates. But he did attempt to provide a quantification of the effect. Recognizing that it’s far from perfect, he used Google’s ngram tool to look at how “economy” (including it’s old world spelling, “oeconomy”) compared to usage in literature of the words “republic” and “democracy”. The timelines match Moss’s impression of the policy debates. There is an important, and somewhat counter-intutitive insight here: the best way to keep an economy healthy isn’t by prioritizing the economy. It’s by prioritizing democracy. This focus on democracy is what keeps destructive and unproductive entrepreneurship at bay. When wealthy special interests come knocking on governmental doors — and given the nature of entrepreneurs, those knocks will happen, accompanied by promises of campaign contributions in exchange for favorable policy— on what basis do policy makers make their decision of what to do? I genuinely believe that most actors on both sides of this equation — in business, and in government — are good people. They’re motivated to do good. But they have a set of forces working on them to behave in a certain way in such a situation. The business leaders? That’s easy. They’re looking to profit. They’ll do so however they can, within the rules of the game. There are two levers implicit in that statement: play the game as it stands. Or change the rules. And the policy-makers? Well, they’re looking to get re-elected. With that as the goal, their criteria for judging whether a policy is worth pursuing is two-fold. First, how are voters going to react? Because if they don’t like this, and they change their vote… well I’m out of office. But second — if voters don’t care, is this going to help me get re-elected? Well, here’s a representative from one of the pillars of our economy saying this will help them out. This means I’m helping the economy, right? And it doesn’t seem to be hurting anyone (of course, you can’t hear the silent screams of a disruptive business that will never be created as a result of bad policy). And to top it off — here’s this big pile of money I need to help get re-elected — so I can keep helping the country! What’s been missing for the past seventy years is the test of: “is this good for democracy?”. When this is applied — well, corporate leaders would be a little more reluctant to just buy their next set of quarterly earnings from Capitol Hill. Instead, they’d do it the hard way — through competition (which, as a happy side-effect, benefits society). And regulators? Well, they’d make sure the rules of the game were skewed towards productive entrepreneurship. If they were doing this now, the state of our corporate regulation would probably look a bit more like radio back in the 1920s… and a lot less like the oligopolistic airline industry that, through merger after anti-competitive merger, are now making so many billions of dollars in profit that their neglect of the customer has descended to this: Stepping back further, there’s an even broader point worth making: the importance of an objective function. Or, put differently: what matters most? It seems counter-intuitive that the best way to keep an economy healthy is to deprioritize the economy. But that’s exactly what needs to happen. So much of what is going wrong right now in America’s economy can be traced to the priorities being all wrong. In fact, it works the same way inside a business as it does inside an economy. The insight that Clayton Christensen had in regards to disruption is that what you focus on determines your fate. There is no doubting that profit is incredibly important to any company. But when it rises from “necessary but not sufficient” to “prime objective” in a manager’s brain, then a company will invariably leave itself prone to being disrupted. The entity will behave in a way that will almost always bring about its own demise. Recognizing this — and reversing it — was perhaps one of the greatest insights of one of the greatest business leaders in history: Steve Jobs. “My passion has been to build an enduring company where people were motivated to make great products. The products, not the profits, were the motivation. Sculley flipped these priorities to where the goal was to make money. It’s a subtle difference, but it ends up meaning everything.” Jobs was right: that subtle differences does end up meaning everything. If you look at the big difference between rich and poor countries, it isn’t resource endowments or exceptionalism or anything else like that. It’s one thing: the effectiveness and stability of the political system over time. That’s how the rules of Baumol’s game get set. That’s what determines whether you get destructive, unproductive, or productive entrepreneurship. And that comes from a focus on democracy. Looking around America today, it seems to have been lost. If you liked this, click the 💚 below so other people will see it here on Medium. You might also enjoy Exponent, the podcast that Ben Thompson and I co-host. ", "title": "Prioritizing Economics is Crippling the U.S. Economy", "sentences": [{"97a1": "Prioritizing Economics is Crippling the U.S. Economy"}, {"de85": "“It is often assumed that an economy of private enterprise has an automatic bias toward innovation, but this is not so. It has a bias only toward profit.” — Eric Hobsbawm"}, {"854a": "The first time I arrived in the United States as more than a tourist was in September 2008, to begin graduate school. It was a fateful time to land in the country: within weeks, the US financial system began to melt down."}, {"d10d": "In seeking to understand quite how this had happened, a term began to be used that I wasn’t very familiar with."}, {"3b6e": "Moral hazard: In economics, moral hazard occurs when one person takes more risks because someone else bears the cost of those risks. (Wikipedia)"}, {"d7ff": "A lot of people were soon exposed to the idea of moral hazard. Whereas I was fortunate to be learning about it in academic setting, many others were learning about it as a consequence of their livelihoods disappearing."}, {"d050": "Whether it was the collateralization of subprime assets by the banks — bundling up questionable loans and then offloading them (the banking equivalent of hot potato); or the realization by bankers that the Federal Government wouldn’t allow the financial system to fail (and therefore would bail them and their “too big to fail” friends out) — it seemed any way you looked at the Great Recession, moral hazard was everywhere."}, {"3302": "Unsurprisingly, people were getting pretty mad at those that had exploited it."}, {"9060": "Something about blaming the bankers didn’t quite square with the talk of moral hazard, however. Of course, there was no doubt that the bankers had profited in a circumstance in which they should not have."}, {"7923": "But here’s the thing: weren’t they acting in an entirely rational way?"}, {"f4ab": "If that question doesn’t stop you in your tracks — then read it again. The most powerful financial organizations in the world were, for some perverse reason, being incentivized to behave in a way that ultimately caused a global financial meltdown."}, {"9369": "How did this happen?"}, {"b01f": "And was it a one-off, or symptomatic of a deeper sickness?"}, {"ea46": "In 1990, American economist William Baumol published a paper called Entrepreneurship: Productive, Unproductive, and Destructive. In it, Baumol — frustrated with the idea that entrepreneurship was this quixotic thing that waxed and waned for unexplained reasons — set out to get the bottom of why it was that in some circumstances it flourished; in others, it seemed to wither."}, {"7062": "He reached the most unexpected of conclusions."}, {"a7ac": "Rather than entrepreneurship arising and disappearing as if by magic — Baumol realized we’d simply been categorizing things incorrectly. Whereas the traditional view of the entrepreneur was of folks developing innovations and creating new markets, Baumol countered that entrepreneurs are simply “persons who are ingenious and creative in finding ways that add to their own wealth, power, and prestige”."}, {"cb43": "When you take that view of things, suddenly you realize: it doesn’t matter where you are… there are entrepreneurs all around you. It’s just they don’t always conform with our traditional stereotypes of what an “entrepreneur” is. And herein lies the first of Baumol’s two great insights:"}, {"5e68": "There is such a thing as bad entrepreneurship."}, {"6963": "If entrepreneurs are “ingenious and creative folks pursuing wealth, power, prestige”, then they will pursue those goals in whatever way makes most sense. That might mean starting a company in a garage in Silicon Valley — which is the image that “entrepreneurship” typically calls to mind. But it doesn’t need to be so grand — it also includes starting a small business in your local community. Baumol calls this productive entrepreneurship."}, {"06c9": "At the other end of the scale, you’ll find people getting rich off others’ misery — destructive entrepreneurship. Traditionally, you might not associate people like this with the word “entrepreneur” — but they absolutely are."}, {"5de5": "The category in between these two might get much less in the way of headlines, but for our purposes, is actually much more interesting; that is, unproductive entrepreneurship. Unproductive entrepreneurship isn’t illegal, but let’s just say nobody’s going to be putting flowers outside your business when you die, either. Think: lobbying, playing games with tax avoidance, and good old fashioned regulatory capture. When the entrepreneur of this variety wins, the rest of us do not. In fact, more often than not — we lose."}, {"0bdd": "In sum: productive entrepreneurs focus first on growing the pie; unproductive entrepreneurs are focused first on dividing the pie; and destructive entrepreneurs are really only interested in stealing the pie."}, {"ead8": "The trillion dollar question then becomes: what determines the type of entrepreneurship you get? It’s here that we get to Baumol’s second, and perhaps most important, insight:"}, {"3891": "How the entrepreneur acts at a given time and place depends heavily on the rules of the game — the reward structure in the economy — that happen to prevail."}, {"3df4": "The rules of the game determine the kind of entrepreneurship you get."}, {"afe9": "Looking at the American economy today from afar, it doesn’t seem there’s much of a problem at all. In fact, it appears to be doing really quite well: the S&P500 has been hitting all time highs. Corporate profits are doing much the same."}, {"cb16": "But look a little deeper, and worrying signs begin to emerge."}, {"74e3": "The biggest hint that something is wrong is when you dig deeper into firm profitability. Profits are increasingly concentrating. For example: the share of profits by the largest four firms in almost every industry inside the US has increased dramatically in the past fifteen years."}, {"7826": "Source: theeconomist.com"}, {"8400": "In part, this is being driven by corporate concentration. Since 2008, $10 trillion of mergers have taken place in the United States — one of the largest rounds in the country’s history."}, {"6005": "Given that competition is the cornerstone of a market economy, this is not a good thing."}, {"cc97": "But it’s not just concentration that has resulted in profits at the top going up so much. Lobbying spend doubled in the period depicted in the above chart, from 1997 to 2012. Again, if you think that the executives spending all that money are doing so rationally — and the level of profitability of their firms certainly suggests that they are — then that money is buying them something. To begin with, it’s probably having an outsized impact on their ability to merge in the first place."}, {"c967": "But that’s not all."}, {"5702": "There’s a strong case to be made that all that political capture — and the regulation (or in some instances, lack of it) that results — makes it harder for competitors to threaten incumbents. This is a tried and true method for incumbents to stave off disruptors. And that’s before you get into the increased reliance on intagibles like patents — again, which play heavily to the advantages of big incumbents. They’re the only ones, for example, who are properly resourced to fight a patent battle in court."}, {"3e1d": "All this sums up to the lowest level of small business creation since the 1970s. Perhaps even more troubling — for the first time since researchers started collecting the data — the rate of business death now exceeds the rate of business creation."}, {"f55d": "Lobbying. Merging to reduce competition. Buying regulation to stifle disruptive threats. Competing in court rather than out in the market."}, {"8c0b": "Sounds an awful lot like Baumol’s unproductive entrepreneurship, doesn’t it?"}, {"b777": "It would be tempting to think that, given that so much of this is a question of economics, that the answer must lie in the same field. But there’s a case to be made that these problems aren’t being drive by lack of economics — but rather, by too much economics."}, {"d5ee": "Ironically, it was another economist, David Moss, who made that case. Moss spent the past five years doing a deep dive on American democracy, with a view to understanding whether what we’re seeing in the political sphere right now really is different to what has happened in the past."}, {"fcd3": "Encouragingly, the history of political tension runs deep throughout American history. These heated debates and deeped political divides are nothing new."}, {"5b24": "But it was far from all good news."}, {"6a9c": "In reviewing hundreds of years of policy debates, Moss began to notice that something very fundamental had changed. Up until (roughly) the end of World War 2, almost all policy were organized around a central theme: impact on democracy. The question would be asked: what was this going to mean for our democracy? From both sides of the political spectrum, there was a common commitment to strengthening and preserving democratic ideals."}, {"05ae": "But, starting around the time of the Great Depression in the 1930s, and taking full effect by roughly the end of the 1940s, that changed."}, {"951d": "No longer was the focus on democracy. Economic growth pushed it the background."}, {"30b9": "One example that Moss cites to show this evolution is broadcast regulation. The first time Congress dealt with this issue was in the mid-1920s — right after the first commercial radio broadcast in 1920."}, {"31cc": "While there were all manner of technical and economic elements to the policy debate that happened, at the heart of the debate, was an intense focus on the implications for society. This cut across both sides of politics: what would be the impact of this new technology, and the industry that was springing up around it, on American democracy?"}, {"b1db": "There was broad recognition in Congress that if anyone managed to gain complete radio dominance in a town, city, region or country, then they would have a lock on political discourse in that region. Because the policy debate focused on impact on democracy, Congress recognized this could happen. And it feared it. As a result, spectrum was retained under Government control, and was licensed out to private parties."}, {"7191": "Fast forward to the 1960s, and a very different debate was happening on allocation of spectrum. It had the same technical and economic elements as in the 1920s — which, of course, is no bad thing. But the nature of the change was stark. The focus on the impact of democracy had largely disappeared. It had been crowded out entirely by the economic focus."}, {"d645": "When I heard Moss talk about this, he was at pains to say that this was his impression from researching the history of all these policy debates. But he did attempt to provide a quantification of the effect. Recognizing that it’s far from perfect, he used Google’s ngram tool to look at how “economy” (including it’s old world spelling, “oeconomy”) compared to usage in literature of the words “republic” and “democracy”."}, {"c096": "The timelines match Moss’s impression of the policy debates."}, {"2dde": "There is an important, and somewhat counter-intutitive insight here: the best way to keep an economy healthy isn’t by prioritizing the economy."}, {"55cd": "It’s by prioritizing democracy."}, {"ff61": "This focus on democracy is what keeps destructive and unproductive entrepreneurship at bay. When wealthy special interests come knocking on governmental doors — and given the nature of entrepreneurs, those knocks will happen, accompanied by promises of campaign contributions in exchange for favorable policy— on what basis do policy makers make their decision of what to do? I genuinely believe that most actors on both sides of this equation — in business, and in government — are good people. They’re motivated to do good. But they have a set of forces working on them to behave in a certain way in such a situation."}, {"19a4": "The business leaders? That’s easy. They’re looking to profit. They’ll do so however they can, within the rules of the game. There are two levers implicit in that statement: play the game as it stands. Or change the rules."}, {"4d22": "And the policy-makers? Well, they’re looking to get re-elected. With that as the goal, their criteria for judging whether a policy is worth pursuing is two-fold. First, how are voters going to react? Because if they don’t like this, and they change their vote… well I’m out of office."}, {"a783": "But second — if voters don’t care, is this going to help me get re-elected? Well, here’s a representative from one of the pillars of our economy saying this will help them out. This means I’m helping the economy, right? And it doesn’t seem to be hurting anyone (of course, you can’t hear the silent screams of a disruptive business that will never be created as a result of bad policy). And to top it off — here’s this big pile of money I need to help get re-elected — so I can keep helping the country!"}, {"0219": "What’s been missing for the past seventy years is the test of: “is this good for democracy?”. When this is applied — well, corporate leaders would be a little more reluctant to just buy their next set of quarterly earnings from Capitol Hill. Instead, they’d do it the hard way — through competition (which, as a happy side-effect, benefits society)."}, {"81a0": "And regulators? Well, they’d make sure the rules of the game were skewed towards productive entrepreneurship. If they were doing this now, the state of our corporate regulation would probably look a bit more like radio back in the 1920s… and a lot less like the oligopolistic airline industry that, through merger after anti-competitive merger, are now making so many billions of dollars in profit that their neglect of the customer has descended to this:"}, {"7792": "Stepping back further, there’s an even broader point worth making: the importance of an objective function. Or, put differently: what matters most? It seems counter-intuitive that the best way to keep an economy healthy is to deprioritize the economy. But that’s exactly what needs to happen. So much of what is going wrong right now in America’s economy can be traced to the priorities being all wrong."}, {"09bd": "In fact, it works the same way inside a business as it does inside an economy. The insight that Clayton Christensen had in regards to disruption is that what you focus on determines your fate."}, {"0860": "There is no doubting that profit is incredibly important to any company. But when it rises from “necessary but not sufficient” to “prime objective” in a manager’s brain, then a company will invariably leave itself prone to being disrupted. The entity will behave in a way that will almost always bring about its own demise. Recognizing this — and reversing it — was perhaps one of the greatest insights of one of the greatest business leaders in history: Steve Jobs."}, {"ff1d": "“My passion has been to build an enduring company where people were motivated to make great products. The products, not the profits, were the motivation. Sculley flipped these priorities to where the goal was to make money. It’s a subtle difference, but it ends up meaning everything.”"}, {"8bb4": "Jobs was right: that subtle differences does end up meaning everything. If you look at the big difference between rich and poor countries, it isn’t resource endowments or exceptionalism or anything else like that. It’s one thing: the effectiveness and stability of the political system over time. That’s how the rules of Baumol’s game get set. That’s what determines whether you get destructive, unproductive, or productive entrepreneurship. And that comes from a focus on democracy."}, {"765d": "Looking around America today, it seems to have been lost."}, {"95d1": "If you liked this, click the 💚 below so other people will see it here on Medium."}, {"8076": "You might also enjoy Exponent, the podcast that Ben Thompson and I co-host."}], "child": "1485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_51485_1\t1485_2\t1485_3\t1485_4\t1485_5"}