{"name": "1486", "parent": "", "content": "Bill O’Reilly is going on vacation and he may never come back Tonight’s show “could be his last.” CREDIT: AP Photo/Pablo Martinez Monsivais On Tuesday night’s O’Reilly Factor, Bill O’Reilly announced he was taking a vacation. The announcement comes in the midst of a massive advertiser exodus following revelations that he and Fox News paid millions of dollars to five women who said they were sexually harassed by O’Reilly. O’Reilly said that he booked this vacation “last fall” and that he often takes vacation “around this time of the year.” He is reportedly scheduled to return in on April 24. But Gabriel Sherman, a journalist for New York Magazine who literally wrote the book on Fox News, reports that “tonight’s show could be his last.” According to Sherman’s sources, lawyers for Fox News “are currently doing a ‘deep dive’ investigation into O’Reilly’s behavior.” Sherman also reports that James Murdoch, the CEO of 21st Century Fox, wants O’Reilly gone. Murdoch forced out longtime Fox News CEO Roger Ailes last summer over allegations of sexual misconduct. O’Reilly has not addressed the new allegations of sexual harassment on his show. Fox News, with the exception of a lukewarm statement to the New York Times, has also largely remained silent. Silence, however, has not stemmed the controversy. So far, at least 77 advertisers have publicly announced they will no longer air commercials during O’Reilly’s show. The number of ads on the show has dramatically declined and large national brands have been replaced with ads for Elvis gospel albums and catheters. Lawyer Lisa Bloom, who represents one of O’Reilly’s accusers, said earlier this week that she expects more women to come forward. ", "title": "Bill O’Reilly is going on vacation and he may never come back", "sentences": [{"00ed": "Bill O’Reilly is going on vacation and he may never come back"}, {"b357": "Tonight’s show “could be his last.”"}, {"7219": "CREDIT: AP Photo/Pablo Martinez Monsivais"}, {"0f03": "On Tuesday night’s O’Reilly Factor, Bill O’Reilly announced he was taking a vacation. The announcement comes in the midst of a massive advertiser exodus following revelations that he and Fox News paid millions of dollars to five women who said they were sexually harassed by O’Reilly."}, {"aecc": "O’Reilly said that he booked this vacation “last fall” and that he often takes vacation “around this time of the year.” He is reportedly scheduled to return in on April 24."}, {"626b": "But Gabriel Sherman, a journalist for New York Magazine who literally wrote the book on Fox News, reports that “tonight’s show could be his last.” According to Sherman’s sources, lawyers for Fox News “are currently doing a ‘deep dive’ investigation into O’Reilly’s behavior.”"}, {"104b": "Sherman also reports that James Murdoch, the CEO of 21st Century Fox, wants O’Reilly gone. Murdoch forced out longtime Fox News CEO Roger Ailes last summer over allegations of sexual misconduct."}, {"5088": "O’Reilly has not addressed the new allegations of sexual harassment on his show. Fox News, with the exception of a lukewarm statement to the New York Times, has also largely remained silent. Silence, however, has not stemmed the controversy."}, {"7cce": "So far, at least 77 advertisers have publicly announced they will no longer air commercials during O’Reilly’s show. The number of ads on the show has dramatically declined and large national brands have been replaced with ads for Elvis gospel albums and catheters."}, {"8d87": "Lawyer Lisa Bloom, who represents one of O’Reilly’s accusers, said earlier this week that she expects more women to come forward."}], "child": "1486_1\t1486_2\t1486_3\t1486_4\t1486_5\t1486_6\t1486_7\t1486_8\t1486_9\t1486_10\t1486_11\t1486_12\t1486_13\t1486_14\t1486_15\t1486_16\t1486_17\t1486_18\t1486_19"}