{"name": "1490", "parent": "", "content": "Truth In Satire Bannon And Kushner Meet To Bury Hatchet, End Up Splitting Skulls Leaked transcript of “peace talks” between two Trump senior advisers suggests continued vitriol and animosity The nasty infighting between Steve Bannon and Jared Kushner got so ugly at the White House last week, President Trump had to intervene personally — with daughter and paramour Ivanka at his side. President Trump stepped in to broker the peace between his squabbling advisers, but White House insiders say his legendary dealmaking skills may have fallen short. After a series of lengthy discussions over the weekend, brokered by the self-professed “world’s greatest dealmaker,” the Trump administration reported that the two senior advisers had kissed and made up. But a leaked transcript suggests that the feud may not be over. Judge for yourself: President Trump: Now, listen, you two, this squabbling is making me look like a lousy leader and a disorganized schmuck. Knock it off and start playing nice with each other! Jared Kusher: But he called me a ‘cuck’ and a ‘globalist.’ Trump: Steve, don’t call Jared a cock and an obelisk anymore. Steve Bannon: I called him a cuck, not a cock. And a globalist, not an obelisk. He’s a “cuckservative” because he’s a cuckolded political wimp who won’t embrace true alt-right conservatism. And he’s a globalist because he’s trying to push the Zionist message of tolerance and diversity on this administration instead of the doctrines of white supremacy and nationalism. So I’m right on both counts. Trump: Well, I do kind of agree with Steve on the cuckold part, Jared. I see your mamby-pambying around my daughter and I wince. No pussy grabbing, no smacking her around to get her in line—she’s never going to respect you if you don’t rough her up. Ivanka: Daddy, that’s horrible! Trump: Be quiet, sweetie, just go back to playing with your hair. Kushner: All I know is that calling someone a globalist is a thinly veiled, anti-Semitic slur, and I won’t stand for it. Trump: Is that true, Steve? Bannon: Yeah, it’s true. And besides being a wonderkike, Jared’s also a blue diaper baby — a fucking Democrat! Deny it, you little gefilthy fish. Kushner: That’s a lie! I’m as much a Republican as the president is. Right, Dad? Trump: Uh, let’s not go there. Look, I’m gonna allow the globalist thing, because the Zionist piece sounds accurate to me. And you can taunt Jared from time to time with ‘kike, ‘hymie,’ or ‘Jew boy,’ Steve — God knows, I do. But I don’t want to hear you calling him a Democrat any more. That’s just a low blow, understood? Bannon: Kike, hymie, Zionist, Jew-boy…all good. Democrat…off limits. But if you check his voting records for the past 15 years, you’ll see that he’s a lifelong donkey licker. Ivanka: Daddy, don’t let that awful man call Jared a donkey licker, that’s horrible! President Trump said his daughter, Ivanka, was a strong voice in settling the Kushner-Bannon civil war until she had to run out for a hair appointment. Trump: Ivanka, leaf through the photos in your fashion magazines and let the men talk. Steve, no more donkey licker, okay? Now, Jared, I want you to clear the air with Steve. What are your gripes? Kushner: You mean besides the fact that he’s a fanatical ideologue, a vicious anti-Semite, an anarchist who welcomes an apocalyptic world-ending war, and someone who I disagree with on every policy issue from health care and immigration to taxes and trade? Okay, how about the fact that his open facial sores ooze all over my Brooks Brothers suits whenever his blood pressure goes up, which is like every time the second hand hits the twelve?! Trump: Ugh, oozing sores, someone get me a trash can, I think I’m going to puke. (President Trump is heard on the audiotape retching into a receptacle of some kind, then asks for a glass of water and resumes.) Okay, Steve, this is getting disgusting. I’ve talked to you before about those skin boils and abscesses. Either you see a dermatologist next week or you’re out. Got that? I’m also going to suggest that you see a shrink. Your inner rage is boiling to the surface and manifesting as skin lesions. That’s a real thing, I saw it on Oprah. You need to work on your anger issues. Bannon: Yes, sir, I’m sorry about the facial eruptions. I thought the Clearasil would take care of it, but it hasn’t worked. Trump: Alright, now shake hands the two of you, and get back to work. And no more bickering — when you quarrel, I can’t hear the goddamn television. Okay, get out of here and go make America great again! Ivanka: What should I do Daddy? Trump: You’re already doing an amazing job, angel. You just keep looking through those beauty magazines, see you if you can find Daddy a more presidential hair gel. (The hushed voices of Bannon and Kushner are then heard, picked up by several hallway listening devices, as the two are exiting the Oval Office.) Bannon: I’m going to get you, you pathetic little pantywaisted, blue-diapered, Jew-boy! Kushner: Bring it on, you deviant, anti-Semitic slime bag full of leaking pustules! **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. — AI ", "title": "Bannon And Kushner Meet To Bury Hatchet, End Up Splitting Skulls", "sentences": [{"c52f": "Truth In Satire"}, {"1e6e": "Bannon And Kushner Meet To Bury Hatchet, End Up Splitting Skulls"}, {"5f0b": "Leaked transcript of “peace talks” between two Trump senior advisers suggests continued vitriol and animosity"}, {"8a83": "The nasty infighting between Steve Bannon and Jared Kushner got so ugly at the White House last week, President Trump had to intervene personally — with daughter and paramour Ivanka at his side."}, {"a302": "President Trump stepped in to broker the peace between his squabbling advisers, but White House insiders say his legendary dealmaking skills may have fallen short."}, {"4968": "After a series of lengthy discussions over the weekend, brokered by the self-professed “world’s greatest dealmaker,” the Trump administration reported that the two senior advisers had kissed and made up."}, {"04ee": "But a leaked transcript suggests that the feud may not be over."}, {"9bfd": "Judge for yourself:"}, {"1d5c": "President Trump: Now, listen, you two, this squabbling is making me look like a lousy leader and a disorganized schmuck. Knock it off and start playing nice with each other!"}, {"3407": "Jared Kusher: But he called me a ‘cuck’ and a ‘globalist.’"}, {"72ec": "Trump: Steve, don’t call Jared a cock and an obelisk anymore."}, {"0c2e": "Steve Bannon: I called him a cuck, not a cock. And a globalist, not an obelisk. He’s a “cuckservative” because he’s a cuckolded political wimp who won’t embrace true alt-right conservatism. And he’s a globalist because he’s trying to push the Zionist message of tolerance and diversity on this administration instead of the doctrines of white supremacy and nationalism. So I’m right on both counts."}, {"0116": "Trump: Well, I do kind of agree with Steve on the cuckold part, Jared. I see your mamby-pambying around my daughter and I wince. No pussy grabbing, no smacking her around to get her in line—she’s never going to respect you if you don’t rough her up."}, {"d728": "Ivanka: Daddy, that’s horrible!"}, {"7798": "Trump: Be quiet, sweetie, just go back to playing with your hair."}, {"182d": "Kushner: All I know is that calling someone a globalist is a thinly veiled, anti-Semitic slur, and I won’t stand for it."}, {"d038": "Trump: Is that true, Steve?"}, {"c432": "Bannon: Yeah, it’s true. And besides being a wonderkike, Jared’s also a blue diaper baby — a fucking Democrat! Deny it, you little gefilthy fish."}, {"97ad": "Kushner: That’s a lie! I’m as much a Republican as the president is. Right, Dad?"}, {"7010": "Trump: Uh, let’s not go there. Look, I’m gonna allow the globalist thing, because the Zionist piece sounds accurate to me. And you can taunt Jared from time to time with ‘kike, ‘hymie,’ or ‘Jew boy,’ Steve — God knows, I do. But I don’t want to hear you calling him a Democrat any more. That’s just a low blow, understood?"}, {"63e6": "Bannon: Kike, hymie, Zionist, Jew-boy…all good. Democrat…off limits. But if you check his voting records for the past 15 years, you’ll see that he’s a lifelong donkey licker."}, {"cac4": "Ivanka: Daddy, don’t let that awful man call Jared a donkey licker, that’s horrible!"}, {"bd07": "President Trump said his daughter, Ivanka, was a strong voice in settling the Kushner-Bannon civil war until she had to run out for a hair appointment."}, {"bb76": "Trump: Ivanka, leaf through the photos in your fashion magazines and let the men talk. Steve, no more donkey licker, okay? Now, Jared, I want you to clear the air with Steve. What are your gripes?"}, {"80f0": "Kushner: You mean besides the fact that he’s a fanatical ideologue, a vicious anti-Semite, an anarchist who welcomes an apocalyptic world-ending war, and someone who I disagree with on every policy issue from health care and immigration to taxes and trade? Okay, how about the fact that his open facial sores ooze all over my Brooks Brothers suits whenever his blood pressure goes up, which is like every time the second hand hits the twelve?!"}, {"7ff8": "Trump: Ugh, oozing sores, someone get me a trash can, I think I’m going to puke. (President Trump is heard on the audiotape retching into a receptacle of some kind, then asks for a glass of water and resumes.) Okay, Steve, this is getting disgusting. I’ve talked to you before about those skin boils and abscesses. Either you see a dermatologist next week or you’re out. Got that? I’m also going to suggest that you see a shrink. Your inner rage is boiling to the surface and manifesting as skin lesions. That’s a real thing, I saw it on Oprah. You need to work on your anger issues."}, {"2aa6": "Bannon: Yes, sir, I’m sorry about the facial eruptions. I thought the Clearasil would take care of it, but it hasn’t worked."}, {"8043": "Trump: Alright, now shake hands the two of you, and get back to work. And no more bickering — when you quarrel, I can’t hear the goddamn television. Okay, get out of here and go make America great again!"}, {"aa43": "Ivanka: What should I do Daddy?"}, {"f851": "Trump: You’re already doing an amazing job, angel. You just keep looking through those beauty magazines, see you if you can find Daddy a more presidential hair gel."}, {"c36a": "(The hushed voices of Bannon and Kushner are then heard, picked up by several hallway listening devices, as the two are exiting the Oval Office.)"}, {"93b2": "Bannon: I’m going to get you, you pathetic little pantywaisted, blue-diapered, Jew-boy!"}, {"b980": "Kushner: Bring it on, you deviant, anti-Semitic slime bag full of leaking pustules!"}, {"5570": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"e537": "— AI"}], "child": "1490_1\t1490_2\t1490_3\t1490_4\t1490_5\t1490_6\t1490_7\t1490_8\t1490_9\t1490_10\t1490_11\t1490_12\t1490_13\t1490_14\t1490_15\t1490_16\t1490_17\t1490_18\t1490_19\t1490_20\t1490_21\t1490_22\t1490_23\t1490_24\t1490_25"}