{"name": "1491", "parent": "", "content": "20 Worst Things President Trump Could Say To The Visiting Chinese Leader The world is holding its breath as the Insulter-in-Chief meets Asia’s most powerful president President Xi Jinping of China will arrive in Florida on Thursday to meet with President Trump at his Mar-A-Lago estate for two days of high level talks. But Trump administration officials are said to be concerned about the president’s potential for making careless verbal gaffs and tweeting cultural insults that could lead to an international incident. Senior staff has gone so far as to hand Mr. Trump a list of things he should not say in the company of President Jinping. That confidential White House memo to the president is reprinted below: Mr. President, Please study the statements below, then summarily discard them from your memory. Don’t say them. Don’t even think them. The world is counting on you, sir: **** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post, or at least one I liked writing a whole lot. — AI ", "title": "20 Worst Things President Trump Could Say To The Visiting Chinese Leader", "sentences": [{"bc9f": "20 Worst Things President Trump Could Say To The Visiting Chinese Leader"}, {"1ebe": "The world is holding its breath as the Insulter-in-Chief meets Asia’s most powerful president"}, {"0d28": "President Xi Jinping of China will arrive in Florida on Thursday to meet with President Trump at his Mar-A-Lago estate for two days of high level talks."}, {"c166": "But Trump administration officials are said to be concerned about the president’s potential for making careless verbal gaffs and tweeting cultural insults that could lead to an international incident."}, {"849e": "Senior staff has gone so far as to hand Mr. Trump a list of things he should not say in the company of President Jinping."}, {"2322": "That confidential White House memo to the president is reprinted below:"}, {"7f77": "Mr. President, Please study the statements below, then summarily discard them from your memory. Don’t say them. Don’t even think them. The world is counting on you, sir:"}, {"9027": "****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment."}, {"25a5": "And click here for my most popular post, or at least one I liked writing a whole lot."}, {"e537": "— AI"}], "child": "1491_1\t1491_2\t1491_3\t1491_4\t1491_5\t1491_6\t1491_7\t1491_8\t1491_9\t1491_10\t1491_11\t1491_12\t1491_13\t1491_14\t1491_15\t1491_16\t1491_17\t1491_18\t1491_19\t1491_20\t1491_21\t1491_22\t1491_23\t1491_24"}