{"name": "1492", "parent": "", "content": "Homeland just did us all a National Service This show got a lot better after working its way through the original plot arc. Exposing primetime audiences to Office of Policy Coordination (OPC) sins long since forgotten, if ever known at all. Shining a light into one of the darkest corners of the permawarstate. OPC was the ultimate revolving door. Unifying the whole of government approach to psyops, counterinsurgency, propaganda, perception management, psychological warfare, and paramilitarism. Office of Policy Coordination True crime historian Jay Robert Nash coined the only lazy internet citation there is in his out of print 1997 book Spies: a Narrative Encyclopedia of Dirty Tricks and Double Dealing from Biblical Times to Today: “OPC was staffed by reckless adventurers. Many agents were former OSS and thrived on outlandish missions, the more impossible the better. One of the first covert operations conducted by OPC was to spread unrest in Communist countries. To that end, OPC agents went into Albania to start a revolution. “Their operation was a dismal failure and most of the agents were captured. It was later claimed that the British intelligence agent turned double spy for Moscow, Kim Philby, was responsible for identifying many of the OPC agents to the Albanian secret service. “Critical of OPC were CIA agents in that agency’s Office of Special Operations who planned dirty tricks, assassinations, and about the same thing that OPC was attempting to accomplish. When OPC was dismantled in 1952, many of its agents were absorbed by the CIA’s Special Operations department, which acted in the same kind of irresponsible manner. “Most of these agents were fired for creating the disaster that became known as the Bay of Pigs, a covert operation designed to unseat Cuban Communist dictator Fidel Castro, but one that completely backfired and cost CIA director Allen Dulles his job.” Admittedly idiotic spy melodrama Homeland has done the nation a service by thrusting OPC into the mainstream this season. As the deep state entity hellbent on overthrowing a popularly elected president in order to plunge a fragile America back into the forever war. Or as the show’s zionist superspy Saul Berenson puts it: “It’s what we did in Nicaragua, Chile, and the Congo; back to Iran in the 1950s…It does not end well for the elected regime.” Because OPC is one of the most haunting and alarming tales of our recent history. And one that goes a long way toward explaining and addressing Americans’ plaintive naivety about why the rest of the world hates us. OPC, OPS (Office of Public Safety), and OPD (Office of Public Diplomacy) is why. Entities authorizing corruptive CIA covers in the diplomatic service that created a legacy of distrust and skepticism jeopardizing U.S. foreign policy to this very day. Making the world safe for democracy, but dangerous for America. Office of Public Safety USAID memorial wall. Bad taste to include erstwhile hillbilly sheriff of Richmond, IN and OPS torture trainer Dan Mitrione among them. He likely had it coming after training the Brazilian, Dominican, and Uruguayan secret polices in enhanced interrogation techniques. And the more you dabble down the OPC rabbithole, the darker the linkages become. After being absorbed by CIA in 1952, its worst elements go on to form the kernel of a new generation of antidemocratic, heinous state terror bullshit known as the Office of Public Safety (OPS). OPS plays key roles not only in known historical intrigues like Uruguayan marxist Tupamaros revolutionaries’ abduction and execution of ostensible USAID “police trainer” Dan Mitrione. But also behind the curtain in even more sinister, nefarious contexts like JFK, MKUltra, and Jonestown. When other countries pull this shit, it’s a travesty scandalizing us all at the Russians’ or arabs’ gall. But when we do, it’s epic heroism to be immortalized in unthinking, jingoistic myth. To paraphrase great American Dick Nixon: if America does it, it must be ok! Like it? Click something. I integrate commenters’ insights into new pieces. So thanks for the ideas too:) If I may be so bold, you might also like one of these. ", "title": "Homeland just did us all a National Service", "sentences": [{"7b88": "Homeland just did us all a National Service"}, {"25c8": "This show got a lot better after working its way through the original plot arc."}, {"5220": "Exposing primetime audiences to Office of Policy Coordination (OPC) sins long since forgotten, if ever known at all. Shining a light into one of the darkest corners of the permawarstate."}, {"bb2b": "OPC was the ultimate revolving door. Unifying the whole of government approach to psyops, counterinsurgency, propaganda, perception management, psychological warfare, and paramilitarism."}, {"1d90": "Office of Policy Coordination"}, {"162e": "True crime historian Jay Robert Nash coined the only lazy internet citation there is in his out of print 1997 book Spies: a Narrative Encyclopedia of Dirty Tricks and Double Dealing from Biblical Times to Today:"}, {"8c5e": "“OPC was staffed by reckless adventurers. Many agents were former OSS and thrived on outlandish missions, the more impossible the better. One of the first covert operations conducted by OPC was to spread unrest in Communist countries. To that end, OPC agents went into Albania to start a revolution."}, {"bc83": "“Their operation was a dismal failure and most of the agents were captured. It was later claimed that the British intelligence agent turned double spy for Moscow, Kim Philby, was responsible for identifying many of the OPC agents to the Albanian secret service."}, {"4db0": "“Critical of OPC were CIA agents in that agency’s Office of Special Operations who planned dirty tricks, assassinations, and about the same thing that OPC was attempting to accomplish. When OPC was dismantled in 1952, many of its agents were absorbed by the CIA’s Special Operations department, which acted in the same kind of irresponsible manner."}, {"9684": "“Most of these agents were fired for creating the disaster that became known as the Bay of Pigs, a covert operation designed to unseat Cuban Communist dictator Fidel Castro, but one that completely backfired and cost CIA director Allen Dulles his job.”"}, {"773c": "Admittedly idiotic spy melodrama Homeland has done the nation a service by thrusting OPC into the mainstream this season. As the deep state entity hellbent on overthrowing a popularly elected president in order to plunge a fragile America back into the forever war."}, {"7eb7": "Or as the show’s zionist superspy Saul Berenson puts it: “It’s what we did in Nicaragua, Chile, and the Congo; back to Iran in the 1950s…It does not end well for the elected regime.”"}, {"de98": "Because OPC is one of the most haunting and alarming tales of our recent history. And one that goes a long way toward explaining and addressing Americans’ plaintive naivety about why the rest of the world hates us."}, {"36b4": "OPC, OPS (Office of Public Safety), and OPD (Office of Public Diplomacy) is why. Entities authorizing corruptive CIA covers in the diplomatic service that created a legacy of distrust and skepticism jeopardizing U.S. foreign policy to this very day."}, {"b441": "Making the world safe for democracy, but dangerous for America."}, {"b03d": "Office of Public Safety"}, {"9572": "USAID memorial wall. Bad taste to include erstwhile hillbilly sheriff of Richmond, IN and OPS torture trainer Dan Mitrione among them. He likely had it coming after training the Brazilian, Dominican, and Uruguayan secret polices in enhanced interrogation techniques."}, {"8437": "And the more you dabble down the OPC rabbithole, the darker the linkages become. After being absorbed by CIA in 1952, its worst elements go on to form the kernel of a new generation of antidemocratic, heinous state terror bullshit known as the Office of Public Safety (OPS)."}, {"4d0e": "OPS plays key roles not only in known historical intrigues like Uruguayan marxist Tupamaros revolutionaries’ abduction and execution of ostensible USAID “police trainer” Dan Mitrione. But also behind the curtain in even more sinister, nefarious contexts like JFK, MKUltra, and Jonestown."}, {"a77f": "When other countries pull this shit, it’s a travesty scandalizing us all at the Russians’ or arabs’ gall. But when we do, it’s epic heroism to be immortalized in unthinking, jingoistic myth."}, {"6f42": "To paraphrase great American Dick Nixon: if America does it, it must be ok!"}, {"ff0f": "Like it? Click something. I integrate commenters’ insights into new pieces. So thanks for the ideas too:) If I may be so bold, you might also like one of these."}], "child": "1492_1"}