{"name": "1494", "parent": "", "content": "Truth In Satire Jared And Ivanka’s First Date: The Transcript Match.com releases bombshell tape of lurid “deal spiel” between Trump’s daughter and NY real estate scion Back in 2007, Ivanka Trump, eager to recreate her father’s success on The Apprentice, was in talks with Match.com about developing a reality TV show based on her dating life. Tentatively titled Dating Daddy’s Little Girl the show never aired because Ms. Trump and Mr. Kushner struck a mutually beneficial marital deal quickly. Ivanka wearing her little French number to create the impression that she’s sophisticated and cultured when she’s actually as crude, lewd, and rude as her licentious father. But the riveting Match.com audiotapes recorded that night still exist, as do the transcripts, which the dating site released on Monday. This is how the conversation between Ms. Trump and Mr. Kushner unfolded about 20 minutes into their date, after the two exchanged pleasantries at the chic Japanese restaurant, Nobu, in New York City’s Tribeca district: Ivanka: Listen, Jared, I don’t know exactly how to put this but Daddy needs a Jew. Jared: Excuse me? Ivanka: I said Daddy needs a bona fide Jew in his inner circle, because he wants to make a serious run for the presidency in 2016, and if it’s going to be successful he needs to have a real Jewish person around to make him look, you know, not so anti-Semitic, Waspy clansman. Jared: Ivanka, that’s not only insulting to me as an orthodox Jew, it’s incredibly calculating and frighteningly Machiavellian. I’m not here to be your father’s token Jew, a Hebrew puppet that he can exploit to achieve his political goals. Ivanka: Oh, don’t start moralizing at me, mister. Your father went to jail for blackmailing his own sister, for Christ’s sake. Your family has about as much integrity as the Corleones if they were Yiddiots instead of Italians. And sorry about saying Christ before, but hey, your people did kill him. Jared: Ivanka, if you don’t stop all these Jewish slurs and insults I’m going to have to leave. This is not okay! Ivanka: Just hold your hymie pants for a second and listen to what I have to say before you start going all bagel-dog on me. Jared: Ugh, there you go again, I can’t have you… Jared has been going along with the grand plan of the Trump clan despite some slight misgivings as an Orthodox Jew in dealing with a notoriously Jew-hating Vladimir Putin. Ivanka: Shut up and listen, dreidl boy. Daddy’s got it all figured out with this huge, incredible plan. First, he’s making Donnie Jr. take up hunting so he’ll look like some kind of NRA gun nut. Then he has Eric walking around acting like an imbecile to attract the under-educated Christian right. My job is to marry a high profile snipcock so we have someone to keep the Jew York mainstream media mollified while Daddy gets his political machinery in place. If we all complete our assigned tasks, Daddy says he’ll definitely be President of the United States in 2016. Jared: Ivanka, this is sick. Really sick. If you and your family think you can manipulate the American voter like this… Ivanka: Hey, did I say you could speak yet, no, so snap it shut, shylock. Okay, here’s the deal — if you and I get married, you’ll be in line for an influential White House advisory position and your family will get a shitload of sweet real estate deals out of it. Early in their relationship, Ivanka kept her hand up the back of Jared’s shirt so she could work him like a hand puppet in any direction she wanted to go. Jared: Uh, no I won’t get a White House position because that is called nepotism and it is illegal in the American system of government. And my family can’t benefit financially from your father becoming president — like that would ever happen anyway — because that’s called political patronage and/or unjust enrichment, and both are also illegal. Ivanka: Oh, Jesus, Jared, can you really be so naive, you and those matzah-gobbler dimples of yours? First of all, Daddy isn’t going it alone. He’s got this semi-psychotic, white supremacist, political genius guy from Breitbart News who’s ready to help us out. Second, he’s been talking to Vladimir Putin about financing the whole deal and interfering in our presidential election to boot — so no matter who Daddy faces he’ll win the election. Even if he were to face FDR all whiny in his wheelchair, Daddy would still win. And sorry about that Jesus thing twice, but you know, the Jews really did kill him. Jared: Yeah, I heard you the first time about Jesus. Look, you and your “Daddy” are in total la-la land, Ivanka. And whether your father runs as a Democrat or a Republican, neither party trusts the Russians so that would just be political suicide. Wait, does your father even know what party he’ll be… Donald Trump says he learned early from his father that Jews aren’t real people “otherwise I would have taken him under my wing like he was one of my own sons — he’s truly one of the nicest koshies I’ve ever done business with.” Ivanka: Doesn’t matter. Both parties are filled with pliable political idiots, so Daddy will decide which team of bozos he’ll join when the time comes. Jared: Doesn’t work like that, Ivanka, he needs to build a solid platform of liberal or conservative positions over years, even decades, or no one will take him seriously. He can’t just flip-flop on issues based on personal whim at a moment’s notice. People will think he’s untrustworthy, erratic, even insane, and he’ll destroy any chance of electability. Ivanka: Yeah, yeah, yeah, you know as much about the political power game as those shnozzles running Israel. Jewpidity rules over there—haha, I just made that up, putting Jewish and stupidity together. Haha. Anyway, Daddy and I and my brothers are going for this big time. And we need you, Jared. Did I mention that you would personally pocket $500 million working behind the scenes on some negotiation stuff? Jared: What stuff? Ivanka: Like probably Russia stuff, because who would believe that Putin would work closely with a penny-chaser? No one. So that will throw everyone off the scent. Jared: Russians hate Jews, Ivanka, and Jews hate Russians. I won’t do it. Ivanka: Five. Hundred. Million. Dollars. Jared: There isn’t enough money in the world… Ivanka: That’s just the beginning, Goldberg. Once Daddy settles into the Oval and starts working directly with the Russian oligarchs, we’ll all be skimming additional millions off the top every week. I might use the money to get into fashion, Donnie Jr. wants to open a bunch of bars, and Eric is thinking of investing in driverless cars. Daddy says we’ll all be able to realize our dreams now. Jared: Driverless cars, what the…? But, no, absolutely not, Ivanka, you can’t just buy me. I do have some honor left. Ivanka: Like I said, Horvitz, that’s just the start. Daddy’s got a plan to actually sell the whole of the United States to Russia. And if he pulls it off, we’re talking two or three trillion, with a “T,” maybe even more, split six ways. Jared: Trillion? You did say trillion?… Okay, so let’s just say I wanted in…what would I have to do next? Ivanka: We get out of this joint, go back to my place, you grab my pussy, and then you fuck me. Jared: Ivanka, please, we’re on a first date, take it down a notch. Ivanka: Oh, brother, why are all you cliptips such sexual pussies? Look, you’re going to take off my clothes and give it to me hard, like Daddy does. We need to start making humans, Jared, so Daddy has heirs to continue our dynasty. Jared: Trillions? You’re sure about that, right? Ivanka: Trillions. Jared: Well, okay…I guess. Ivanka: Trust me, Jewbacca, someday you’ll be just as corrupt as me and Daddy. And almost as wealthy. ***** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post. — AI ", "title": "Jared And Ivanka’s First Date: The Transcript", "sentences": [{"be1a": "Truth In Satire"}, {"85da": "Jared And Ivanka’s First Date: The Transcript"}, {"1084": "Match.com releases bombshell tape of lurid “deal spiel” between Trump’s daughter and NY real estate scion"}, {"5233": "Back in 2007, Ivanka Trump, eager to recreate her father’s success on The Apprentice, was in talks with Match.com about developing a reality TV show based on her dating life."}, {"5d98": "Tentatively titled Dating Daddy’s Little Girl the show never aired because Ms. Trump and Mr. Kushner struck a mutually beneficial marital deal quickly."}, {"ccd0": "Ivanka wearing her little French number to create the impression that she’s sophisticated and cultured when she’s actually as crude, lewd, and rude as her licentious father."}, {"8d37": "But the riveting Match.com audiotapes recorded that night still exist, as do the transcripts, which the dating site released on Monday."}, {"f74d": "This is how the conversation between Ms. Trump and Mr. Kushner unfolded about 20 minutes into their date, after the two exchanged pleasantries at the chic Japanese restaurant, Nobu, in New York City’s Tribeca district:"}, {"a768": "Ivanka: Listen, Jared, I don’t know exactly how to put this but Daddy needs a Jew."}, {"0db9": "Jared: Excuse me?"}, {"172e": "Ivanka: I said Daddy needs a bona fide Jew in his inner circle, because he wants to make a serious run for the presidency in 2016, and if it’s going to be successful he needs to have a real Jewish person around to make him look, you know, not so anti-Semitic, Waspy clansman."}, {"f910": "Jared: Ivanka, that’s not only insulting to me as an orthodox Jew, it’s incredibly calculating and frighteningly Machiavellian. I’m not here to be your father’s token Jew, a Hebrew puppet that he can exploit to achieve his political goals."}, {"52e8": "Ivanka: Oh, don’t start moralizing at me, mister. Your father went to jail for blackmailing his own sister, for Christ’s sake. Your family has about as much integrity as the Corleones if they were Yiddiots instead of Italians. And sorry about saying Christ before, but hey, your people did kill him."}, {"173c": "Jared: Ivanka, if you don’t stop all these Jewish slurs and insults I’m going to have to leave. This is not okay!"}, {"0c48": "Ivanka: Just hold your hymie pants for a second and listen to what I have to say before you start going all bagel-dog on me."}, {"01b1": "Jared: Ugh, there you go again, I can’t have you…"}, {"bf0a": "Jared has been going along with the grand plan of the Trump clan despite some slight misgivings as an Orthodox Jew in dealing with a notoriously Jew-hating Vladimir Putin."}, {"08b5": "Ivanka: Shut up and listen, dreidl boy. Daddy’s got it all figured out with this huge, incredible plan. First, he’s making Donnie Jr. take up hunting so he’ll look like some kind of NRA gun nut. Then he has Eric walking around acting like an imbecile to attract the under-educated Christian right. My job is to marry a high profile snipcock so we have someone to keep the Jew York mainstream media mollified while Daddy gets his political machinery in place. If we all complete our assigned tasks, Daddy says he’ll definitely be President of the United States in 2016."}, {"d0c4": "Jared: Ivanka, this is sick. Really sick. If you and your family think you can manipulate the American voter like this…"}, {"0dc8": "Ivanka: Hey, did I say you could speak yet, no, so snap it shut, shylock. Okay, here’s the deal — if you and I get married, you’ll be in line for an influential White House advisory position and your family will get a shitload of sweet real estate deals out of it."}, {"4669": "Early in their relationship, Ivanka kept her hand up the back of Jared’s shirt so she could work him like a hand puppet in any direction she wanted to go."}, {"2c5c": "Jared: Uh, no I won’t get a White House position because that is called nepotism and it is illegal in the American system of government. And my family can’t benefit financially from your father becoming president — like that would ever happen anyway — because that’s called political patronage and/or unjust enrichment, and both are also illegal."}, {"900b": "Ivanka: Oh, Jesus, Jared, can you really be so naive, you and those matzah-gobbler dimples of yours? First of all, Daddy isn’t going it alone. He’s got this semi-psychotic, white supremacist, political genius guy from Breitbart News who’s ready to help us out. Second, he’s been talking to Vladimir Putin about financing the whole deal and interfering in our presidential election to boot — so no matter who Daddy faces he’ll win the election. Even if he were to face FDR all whiny in his wheelchair, Daddy would still win. And sorry about that Jesus thing twice, but you know, the Jews really did kill him."}, {"710a": "Jared: Yeah, I heard you the first time about Jesus. Look, you and your “Daddy” are in total la-la land, Ivanka. And whether your father runs as a Democrat or a Republican, neither party trusts the Russians so that would just be political suicide. Wait, does your father even know what party he’ll be…"}, {"7c5c": "Donald Trump says he learned early from his father that Jews aren’t real people “otherwise I would have taken him under my wing like he was one of my own sons — he’s truly one of the nicest koshies I’ve ever done business with.”"}, {"73e7": "Ivanka: Doesn’t matter. Both parties are filled with pliable political idiots, so Daddy will decide which team of bozos he’ll join when the time comes."}, {"3f32": "Jared: Doesn’t work like that, Ivanka, he needs to build a solid platform of liberal or conservative positions over years, even decades, or no one will take him seriously. He can’t just flip-flop on issues based on personal whim at a moment’s notice. People will think he’s untrustworthy, erratic, even insane, and he’ll destroy any chance of electability."}, {"9cf4": "Ivanka: Yeah, yeah, yeah, you know as much about the political power game as those shnozzles running Israel. Jewpidity rules over there—haha, I just made that up, putting Jewish and stupidity together. Haha. Anyway, Daddy and I and my brothers are going for this big time. And we need you, Jared. Did I mention that you would personally pocket $500 million working behind the scenes on some negotiation stuff?"}, {"38ee": "Jared: What stuff?"}, {"fa46": "Ivanka: Like probably Russia stuff, because who would believe that Putin would work closely with a penny-chaser? No one. So that will throw everyone off the scent."}, {"8d68": "Jared: Russians hate Jews, Ivanka, and Jews hate Russians. I won’t do it."}, {"2543": "Ivanka: Five. Hundred. Million. Dollars."}, {"f299": "Jared: There isn’t enough money in the world…"}, {"72d8": "Ivanka: That’s just the beginning, Goldberg. Once Daddy settles into the Oval and starts working directly with the Russian oligarchs, we’ll all be skimming additional millions off the top every week. I might use the money to get into fashion, Donnie Jr. wants to open a bunch of bars, and Eric is thinking of investing in driverless cars. Daddy says we’ll all be able to realize our dreams now."}, {"52e5": "Jared: Driverless cars, what the…? But, no, absolutely not, Ivanka, you can’t just buy me. I do have some honor left."}, {"e151": "Ivanka: Like I said, Horvitz, that’s just the start. Daddy’s got a plan to actually sell the whole of the United States to Russia. And if he pulls it off, we’re talking two or three trillion, with a “T,” maybe even more, split six ways."}, {"2165": "Jared: Trillion? You did say trillion?… Okay, so let’s just say I wanted in…what would I have to do next?"}, {"2f19": "Ivanka: We get out of this joint, go back to my place, you grab my pussy, and then you fuck me."}, {"18e6": "Jared: Ivanka, please, we’re on a first date, take it down a notch."}, {"49ad": "Ivanka: Oh, brother, why are all you cliptips such sexual pussies? Look, you’re going to take off my clothes and give it to me hard, like Daddy does. We need to start making humans, Jared, so Daddy has heirs to continue our dynasty."}, {"ef20": "Jared: Trillions? You’re sure about that, right?"}, {"281c": "Ivanka: Trillions."}, {"53e0": "Jared: Well, okay…I guess."}, {"2f10": "Ivanka: Trust me, Jewbacca, someday you’ll be just as corrupt as me and Daddy. And almost as wealthy."}, {"37d0": "*****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post."}, {"1d64": "— AI"}], "child": "1494_1\t1494_2\t1494_3\t1494_4\t1494_5\t1494_6\t1494_7\t1494_8\t1494_9\t1494_10\t1494_11\t1494_12\t1494_13\t1494_14\t1494_15\t1494_16\t1494_17\t1494_18\t1494_19\t1494_20\t1494_21\t1494_22"}