{"name": "1495", "parent": "", "content": "Does Mitch McConnell Have Teeth? The people have a right to know The short answer is no, Mitch McConnell does not have teeth. I am quite sure of this because in every photo or video clip I have seen of him, his mouth looks exactly like my Grandpa Henry’s after he removed his dentures at night and dropped them into a water glass. Neither turtles nor Mitch McConnell have teeth, hence the amazing likeness as well as the spot-on nickname, Mister McTurtle. In addition, we hear reports from the Senate dining room that Mr. McConnell orders the same dishes daily: applesauce for breakfast, mashed potatoes for lunch, and Gerber Ham & Ham Gravy for dinner with a glass of apple-prune juice. Any dentist will tell you that this the diet of a man with no teeth. It is also worth noting that Kentucky state employees do not receive dental as part of their health care coverage. So maybe Senator McConnell, as a younger man, got rotten teeth and just let them fall out for lack of affordable dental care. If you look closely at this photo, you can see Mr. McConnell’s false teeth cooling in a glass of iced tea in front of him. A more likely scenario is that the senator, as a boy growing up in rural Alabama and Georgia, was dirt poor. So he probably knocked out his teeth regularly to collect a buck from the tooth fairy. After he got his $32 allotment, he was still dirt poor and he had no teeth. Living dirt poor sucks. So now you can certainly see that evidence is rapidly mounting in favor of my assertion that Mitch McConnell has no teeth. But we can explore this question even further from a slightly different angle: Do you see teeth? I don’t see teeth. In fact, in this photo Mr. McConnell is hanging out with other men with no teeth. Maybe they have some sort of toothless Senate club going on? All agree that Mr. McConnell is an ineffective Senate Majority Leader. When he tries to muster GOP faithfuls in the Senate, they turn their backs on him. When he attempts to get a bill passed or advance important legislation, he fails. Eight years ago, when he declared that his top priority was to make Barack Obama a one-term president…well, we know how that turned out. His astonishingly poor track record as Senate leader has fueled the creation of several unflattering expressions in Washington regarding Mr. McConnell. For example, people routinely refer to his leadership as “lacking teeth.” Or, that his political influence “has no bite.” Other folks on the Hill say, “don’t nuzzle my arm with your wet gums, Mitch, that’s gross.” All these revealing phrases again point to the fact that Mitch McConnell doesn’t have teeth. Forget the teeth, what the hell is happening below the senator’s chin?! Looks like a total reptilian metamorphisis. Now, a lot of people who study the absence of choppers in Mr. McConnell’s mouth are also drawn to related questions about the Senator. For instance, does he have a spine? Is he equipped with testicles? And does he have a stomach for prolonged Senate fights? First, there is ample evidence, particularly of late, that Mitch McConnell is somehow able to stand and walk despite the lack of a backbone. While spineless Republican politicians have never been in short supply in Washington, they seem to be everywhere after this most recent presidential election. Without a spine, it is very difficult for the senator to stand for too long at one time. Here, he is propping himself on a column pedestal outside of the Capitol building. Second, when faced with many opportunities to reject the lunatic ravings of our deranged new president, and assert himself as a reasonable voice in the Republican party, a leader with a modicum of sanity, morality and integrity, Mr. McConnell has turned tail and run. This points overwhelmingly to the presence of an empty space between his legs where most men keep their cojones. Finally, does he have the stomach to face up to dangerous forces within his own party willing to bring this country down? I don’t believe so. People who have seen Mr. McConnell showering in the Senate locker room say that his stomach is a sickly color — “yellow-bellied,” is the term they use. This could be caused by a condition similar to jaundice that may also cause the senator to be lily-livered and chicken-hearted. I appreciate the opportunity to present all available evidence regarding Senator Mitch McConnell and I think that we can now state conclusively that he has no teeth, no spine, no guts, and no nuts. ***** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post. — AI ", "title": "Does Mitch McConnell Have Teeth?", "sentences": [{"eeb3": "Does Mitch McConnell Have Teeth?"}, {"0c95": "The people have a right to know"}, {"6c2c": "The short answer is no, Mitch McConnell does not have teeth."}, {"8be8": "I am quite sure of this because in every photo or video clip I have seen of him, his mouth looks exactly like my Grandpa Henry’s after he removed his dentures at night and dropped them into a water glass."}, {"6c97": "Neither turtles nor Mitch McConnell have teeth, hence the amazing likeness as well as the spot-on nickname, Mister McTurtle."}, {"cfb6": "In addition, we hear reports from the Senate dining room that Mr. McConnell orders the same dishes daily: applesauce for breakfast, mashed potatoes for lunch, and Gerber Ham & Ham Gravy for dinner with a glass of apple-prune juice. Any dentist will tell you that this the diet of a man with no teeth."}, {"bd9a": "It is also worth noting that Kentucky state employees do not receive dental as part of their health care coverage. So maybe Senator McConnell, as a younger man, got rotten teeth and just let them fall out for lack of affordable dental care."}, {"d59f": "If you look closely at this photo, you can see Mr. McConnell’s false teeth cooling in a glass of iced tea in front of him."}, {"eb23": "A more likely scenario is that the senator, as a boy growing up in rural Alabama and Georgia, was dirt poor. So he probably knocked out his teeth regularly to collect a buck from the tooth fairy. After he got his $32 allotment, he was still dirt poor and he had no teeth. Living dirt poor sucks."}, {"9343": "So now you can certainly see that evidence is rapidly mounting in favor of my assertion that Mitch McConnell has no teeth."}, {"c782": "But we can explore this question even further from a slightly different angle:"}, {"e8ab": "Do you see teeth? I don’t see teeth. In fact, in this photo Mr. McConnell is hanging out with other men with no teeth. Maybe they have some sort of toothless Senate club going on?"}, {"808b": "All agree that Mr. McConnell is an ineffective Senate Majority Leader. When he tries to muster GOP faithfuls in the Senate, they turn their backs on him. When he attempts to get a bill passed or advance important legislation, he fails. Eight years ago, when he declared that his top priority was to make Barack Obama a one-term president…well, we know how that turned out."}, {"65d2": "His astonishingly poor track record as Senate leader has fueled the creation of several unflattering expressions in Washington regarding Mr. McConnell. For example, people routinely refer to his leadership as “lacking teeth.” Or, that his political influence “has no bite.” Other folks on the Hill say, “don’t nuzzle my arm with your wet gums, Mitch, that’s gross.”"}, {"362b": "All these revealing phrases again point to the fact that Mitch McConnell doesn’t have teeth."}, {"4e27": "Forget the teeth, what the hell is happening below the senator’s chin?! Looks like a total reptilian metamorphisis."}, {"3ba2": "Now, a lot of people who study the absence of choppers in Mr. McConnell’s mouth are also drawn to related questions about the Senator."}, {"aa76": "For instance, does he have a spine? Is he equipped with testicles? And does he have a stomach for prolonged Senate fights?"}, {"be1e": "First, there is ample evidence, particularly of late, that Mitch McConnell is somehow able to stand and walk despite the lack of a backbone. While spineless Republican politicians have never been in short supply in Washington, they seem to be everywhere after this most recent presidential election."}, {"d79e": "Without a spine, it is very difficult for the senator to stand for too long at one time. Here, he is propping himself on a column pedestal outside of the Capitol building."}, {"6578": "Second, when faced with many opportunities to reject the lunatic ravings of our deranged new president, and assert himself as a reasonable voice in the Republican party, a leader with a modicum of sanity, morality and integrity, Mr. McConnell has turned tail and run. This points overwhelmingly to the presence of an empty space between his legs where most men keep their cojones."}, {"8124": "Finally, does he have the stomach to face up to dangerous forces within his own party willing to bring this country down? I don’t believe so. People who have seen Mr. McConnell showering in the Senate locker room say that his stomach is a sickly color — “yellow-bellied,” is the term they use. This could be caused by a condition similar to jaundice that may also cause the senator to be lily-livered and chicken-hearted."}, {"29b6": "I appreciate the opportunity to present all available evidence regarding Senator Mitch McConnell and I think that we can now state conclusively that he has no teeth, no spine, no guts, and no nuts."}, {"cf11": "*****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post."}, {"1d64": "— AI"}], "child": "1495_1\t1495_2\t1495_3\t1495_4\t1495_5\t1495_6\t1495_7\t1495_8\t1495_9\t1495_10\t1495_11\t1495_12\t1495_13\t1495_14\t1495_15\t1495_16\t1495_17\t1495_18\t1495_19\t1495_20\t1495_21\t1495_22\t1495_23\t1495_24\t1495_25"}