{"name": "1496", "parent": "", "content": "Trump Will Resign By The Summer — Here’s How It’s Going To Happen A prediction so logical, so entirely plausible, you’ll be feeling more positive by the time you finish reading this post Mark your calendars, people. The Great White Dope will leave the presidency of his own accord by the summer. It will happen in August, to be more precise. On August 18th, if you need to send out invitations for the resignation party. You think you’ve got a headache, Herr Hopeless? We’ve been wracked with a national migraine for months. Why am I so sure about this bold, yet infinitely plausible prediction? Two reasons. One, I’m a New Yorker. I’ve lived on the same avenue as Donald Trump for about the same number of years (but downtown where the landscape is a truer blue). For decades, I’ve watched this sleaze monkey operate, noted the many twisted expressions of his delusional self-importance, cataloged his rich history of lying, cheating, and exploiting the less fortunate and, like all New Yorkers (as noted in this post), I’ve learned to deeply dislike and vigilantly avoid this bloated ass clown like he’s hiding the Black Plague under his toupee. Second reason, and I apologize for this in advance, Donald and I share the same birthday. June 14th. Flag Day. Used to be a nice, low-key, patriotic holiday — July 4th’s less flamboyant cousin. Now, June 14th will be forever marked with an ugly orange Trump stain. That said, the shared birth date does gives me a kind of extra extrasensory, astrological insight into the workings of the man’s maleficent mind and ginormous ego (which I’ve written about here). So you see, I know him. I know him really well. But enough preamble, here’s how this historic resignation is going to unfold: JANUARY 20th–MARCH 31st: PRESIDENT TRUMP REALIZES HOW MUCH HE HATES THE JOB. His first 60 days in office have been a nightmare. His Muslim ban gets shot down by the courts. His Obamacare repeal and replacement blows up. Mexico isn’t going along with paying for the wall. The Trump rally on Wall Street fizzles. Russian meddling in our election threatens to undermine the legitimacy of his presidency. He has pissed off longstanding allies and provoked trigger-happy enemies. And his approval numbers are the lowest in history. Most important to President Prima Donald, all the people he thought would be kissing his ass by now, the only audience of admirers he ever cared about — Hollywood celebrities, television stars, and wealthy media moguls — hate his guts. They stayed away from his inauguration, won’t return his calls, and avoid being seen in public with him like he’s their imbecile half-brother. Add to that insult, the only people left who sort of like him are those who he has a long history of assiduously ignoring: the under-educated, underemployed, underfunded, underprivileged, and underachieving underdogs. It’s all adding up to be a gigantic bust. With Commander Combover now the butt of every late night joke and easily the most illustrious laughingstock in American history. And, of course, in Mr. Yella Fella’s thin-membraned mind, this cannot continue. Thus, the stage is set. APRIL 1st–APRIL 23rd: THE FBI, NSA, CIA AND HOUSE SELECT COMMITTEE ON INTELLIGENCE START CLOSING IN ON HIM. Pissed off for being thrown under the bus, Paul Manafort speaks publicly before Congress, and privately to the Feds, and not only are Bannon, Sessions, Flynn, Tillerson, and Ross credibly linked to Putin and the Russian plan to interfere with our presidential election, so is Trump’s son-in-law Jared Kushner. As the rising heat causes rivulets of perspiration to run down his pancake makeup, Trump begins to panic. He starts to lose sleep and the sleep deprivation causes him to become more erratic, eat more Cheetos, and send out even more absurd and abrasive predawn tweets. In a flurry of messages during a few short days in mid-April, he calls one key Senate ally a “walking wimp weasel,” accuses Michele Obama of dissing Melania on Inauguration Day, disses Melania for being an absentee FLOTUS, and is heard on leaked recordings calling Benjamin Netanyahu of Israel a “slimy hymie.” The blow back from all this is fast, furious, and crippling. Trump realizes that he not only hates being president, he also sucks at it. He starts talking to Bannon about “options.” The plot thickens. APRIL 24th–MAY 29th: IN A DESPERATE ATTEMPT TO DISTRACT THE AMERICAN PUBLIC FROM THE INEVITABILITY OF A TREASON INDICTMENT, TRUMP SPREADS DIVORCE RUMORS. He’s seen it work on dozens of reality TV shows, including his own — if you want to get the public’s undivided attention while drawing scrutiny away from something you’d prefer to hide…create a scandal. And so he does. With help from Bannon, Trump and his daughter Ivanka develop an elaborate scheme to plant rumors about Melania having an affair with a billionaire movie producer (“Fuck those Hollywood hacks, let them suck this,” says the president behind closed, but heavily wiretapped doors). The president then feigns heartbreak to curry favor with cuckolded men and sympathetic women. The Christian right declares outrage over Melania’s alleged infidelity. Even Arnold Schwarzenegger issues a statement condemning the First Lady’s indiscretions and supporting the president. By Memorial Day, a tearful President Trump says that he sadly must begin divorce proceedings against Melania, that the court case will likely last all summer, and that it will certainly be as riveting as OJ’s, with even higher ratings, so no one should leave their TV sets until autumn. He assures the public that he’ll do his best to keep them informed about all POTUS-FLOTUS divorce developments on a minute-by-minute basis and further announces that the cackling, crazy-haired television commentator Nancy Grace will be delivering additional play-by-play. The nation is voyeuristically focused on his marital soap opera and quickly forgets about the Russians in its own backyard. Trump thinks his devious plan is working. Until… MAY 30th–JUNE 14th: PUTIN RELEASES THE INFAMOUS GOLDEN SHOWER VIDEO. Any goodwill that Trump has garnered playing the aggrieved husband goes out the window when the Russians decide his presidency is quickly unraveling, his usefulness is coming to an end, and the smartest option is to hasten his demise. And, that’s when we see him, fully naked on our television sets — a pasty, drooling, flesh cake of a man, a corpulent slug with his meticulous ridiculous hair-rug in place, lying under an alternating stream of warm liquid delivered by a fit foursome of nubile Russian prostitutes. If there is any doubt this is our very own pre-president receiving a Slavic sun shower, those doubts are erased when he looks up at the lithe ladies and announces, “I’m going to make all of you winners in my Miss Universe pageant, would you like that?” Trump’s Flag Day birthday present is a $6-billion-dollar counter-divorce action from a vindicated Melania. And the vise closes tighter. JUNE 15th–JULY 20th: IF YOU CAN’T DISTRACT THE PEOPLE WITH A SEX SCANDAL AND A MESSY DIVORCE PLAYED OUT ON THE NATIONAL STAGE, SCARE THE SHIT OUT OF THEM BY DECLARING A STATE OF EMERGENCY AND MARTIAL LAW. If you thought Bannon was diabolical in the administration’s first 100 days, wait till you see what he cooks up by midsummer with the president’s blessing. Things are going so badly for Trumpty Dumpty at this point, impeachment is looking like a mild slap on the wrist. People in the streets are yelling, “LOCK HIM UP!” as it becomes apparent that he, and most in his inner circle, are about to be sanctioned, condemned, and indicted for serious crimes that start with colluding with the enemy, extend to fixing an election, touch on embezzling billions of dollars from the national treasury, and land firmly on treason…with murder tossed in after a few Putin-style poisonings and roof tossings occur at Trump’s Washington, D.C. hotel. Saving his presidency and, more important to Trump, his honor, legacy, and ability to indiscriminately grab pussy till the end of his days, now becomes a “do-or-die” mission. Enter “The Unprecedented National Emergency.” This isn’t some quaint, Cheney-created, color-coded threat level. We’re talking about…ALIEN INVASION! You think that’s preposterous, right, that now I’m just being comical and absurd? Really? Need I remind you that this is the same paranoid, possibly mentally ill president who accused his predecessor of personally bugging his office at Trump Tower with absolutely no proof at all? Knowing that, you still think faking an alien takeover is too heavy-handed and asinine for The Lyin’ King and his Dr. Evil sidekick? Are you sure? Consider this — the kind of crimes committed against this country by Trump, the size of which America has never seen before, would have to be met with an urgent existential threat to fully absorb the resources and attention of all the nation’s intelligence organizations, law enforcement agencies, local police forces, even the military. And that’s where planet-threatening aliens come in. On or around July 4th (that’s right, Independence Day), the White House starts leaking rumors that a fleet of unidentified spacecraft seems to have entered our solar system. Despite denials from NASA, Russia’s Roscosmos, and space agencies and astronomical observatories around the world, the Trump administration insists that there is a potential extraterrestrial invasion underway. All eyes, worldwide, turn slowly from their television sets, iPhones, and Instagram accounts to the heavens. Trump tweets on July 10th: Just saw intel no one else allowed to see — UFO’s headed directly for Earth’s orbit. No hoax, not fake news. For real! TRUST ME!” On July 12th, he tweets: Spacemen (and women) almost here. Good thing I have nukes ready. Keep eyes skyward, don’t look at what I’m doing down here. On July 15th, as panic fills the streets of every city in America and most of the world, he ramps up the fear: Just told Maddog Mattis to position intercontinental missiles. If E.T. lands here we’ll nuke ’em. Good thing you didn’t imprison me now, right? Suddenly, no one is thinking about Trump’s long list of heinous crimes — not with the Klingons at our orbital doorstep. And that’s the moment when the venom-spitting Steve Bannon instructs Hair Fuhrer to deploy the ultimate presidential weapon: Martial Law. JULY 21st–July 28th: JUST WHEN YOU THINK YOU’RE OUT OF THE WOODS AND HOME FREE, HAVING PULLED THE ULTIMATE SCAM ON AN ENTIRE NATION, YOU’RE RAMMED UP THE ASS BY AN OLD SAILOR WHO’S BEEN WAITING PATIENTLY TO EVEN THE SCORE. With Martial Law in place, and the imminent arrival of hive-minded bloboids with death rays sending paroxysms of terror across the nation, Trump and company are feeling quite smug in the Oval Office while issuing countless executive orders “needed to protect the country during this time of exceptional crisis,” simultaneously tightening their iron chokehold on American democracy. But this is not where my plausible prediction ends. No, no, no. On or around July 28th, George Herbert Walker Bush — former WWII Navy flyer and 41st President of the United States, who is, yes, still alive — makes a formal appeal to the White House that he be allowed to address the nation about the alien invasion from his summer home in Kennebunkport, ME. Trump, assuming Bush, a fellow Republican and former CIA Director, will support his crisis-driven, autocratic security measures, approves the old soldier’s request for a national address. Here’s what he will say: “My fellow Americans. I love this country, and I don’t want to see it, or its host planet Earth, destroyed by extraterrestrials. Luckily, that’s not going to happen — not today, or tomorrow, or in the next century — because there are no aliens coming. It’s total bullshit. For the past seven months you’ve been lied to and jerked around by this mango-colored monstrosity of a human being who calls himself your president and somehow stumbled into the White House. (At this point, the White House tries to kill the satellite feed to Kennebunkport, but Bush has already received assurances from his old allies at the CIA and NSA that they’ve neutralized any White House interference.) I want to assure you that Mr. Trump and his accomplices have fabricated this alien invasion story to deflect attention away from his massive misdeeds and miscarriages of justice, his treasonous conduct against this country, and his incredibly poor diet. Furthermore, I have been working behind the scenes with congressmen and senators from both parties to ensure that any further executive orders from the White House be nullified and the influence of President Trump be neutralized. The Martial Law decree will also be lifted. Criminal charges against the short-fingered vulgarian will be filed immediately, and Putin’s papaya-flavored pawn will not be allowed to conduct business as usual or command the nation’s armed forces going forward — I have those assurances from my friends at the Pentagon. The day will come, my friends, when this nation sees the end of its rise as a great democratic stronghold and respected world power — but that time isn’t now, isn’t soon, and certainly isn’t on my watch. This is former President George Bush, saying goodnight and God bless.” JULY 29th–AUGUST 17th: A CRASH COURSE IN SPINNING AN EPIC LIE TO MAKE YOURSELF LOOK GOOD AND YOUR COUNTRY LOOK BAD. With the entire house of cards crashing down around him in the days after the elder Bush’s address, Trumplethinskin is desperate to find an “honorable” way out of his malignant predicament. On August 12th, he goes on national television and declares that “old man Bush is a nice former president but totally senile and playing with a pouch full of loose marbles.” He also doubles down on his alien fabrications, saying that the latest satellite pictures indicate that the alien spaceships are sneakily parked behind the moon where we can’t see them, but could come out at any moment and present a dire threat to all earthly life as well as a comeback season for The Celebrity Apprentice. In an unhinged rage, the president says that no one is listening to him even though he’s the only one who can save the country and the world. He says that the mainstream media is out to get him and won’t let him operate without impunity. He declares that the government has broken down, that the system is totally unfixable, and that he has tried everything he can to make the country great again but is getting no cooperation. Sean Spicer runs in at this point with what the president says are the latest satellite images of the alien invaders. On closer inspection, these appear to be slightly-altered endoscopy photos from an esophageal exam. Nevertheless, the president presents them as definitive proof of an extraterrestrial breach. The Tangerine Tornado finishes by saying that he will be flying to Mar-A-Lago for the weekend and will be considering what else can be done to protect life on the planet while he plays a few rounds of golf. AUGUST 18th: THE RESIGNATION. Upon returning to Washington after his 33rd trip to Mar-A-Lago since becoming president, Mr. Trump is besieged by up to 10 million protesters surging against the gates of the White House. As Adolf Twitler leaves Washington for the last time, he’ll give photographers one final opportunity to snap pictures of his impossibly small hands. He takes to the airwaves again to announce that, just as he thought, Washington is “filled with nothing but a bunch of tight-ass paper pushers who don’t have the slightest clue how to run a successful business operation. Sad. If this is the kind of government the people want, instead of letting me make America a world-class corrupt power, well then, there’s nothing more for me to do here. It’s hopeless. I have told Mike Pence that I’m handing in my resignation and returning to New York.” The president continues, saying, “If anyone wants to know what I’ll be doing going forward, I’m excited to announce that I’ll be working with Steve Bannon, Roger Ailes, and some very good people, no, great people in the non-fake press world to create a really incredible new TV network that we’ll be calling Trump International Media or TIM. But not tiny TIM. This is going to be huge. I’m inviting my friends in show business to send me proposals now as we’d like to have some great shows on the air for the new fall season. Thank you America and God bless me.” As the president stands to leave the Oval Office, he is arrested by FBI agents and taken to an undisclosed location along with 15 other senior White House officials, including a barefoot Kellyanne Conway who is asked not to put her smelly feet up on the metal benches of the federal paddy wagon. Another of those taken into custody, suspected Russian cyborg Stephen Miller, explodes upon being lifted into an armored FBI transport van. Two agents are severely injured after being hit by shrapnel from Miller’s splintered titanium body, but survive. And the country is ultimately saved. God bless America. ***** If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post. Many of these biting Trump nicknames came from a collective name rant here. Love all these Medium reader contributions! Thank you! — AI ", "title": "Trump Will Resign By The Summer — Here’s How It’s Going To Happen", "sentences": [{"8283": "Trump Will Resign By The Summer — Here’s How It’s Going To Happen"}, {"5ab7": "A prediction so logical, so entirely plausible, you’ll be feeling more positive by the time you finish reading this post"}, {"5335": "Mark your calendars, people. The Great White Dope will leave the presidency of his own accord by the summer. It will happen in August, to be more precise. On August 18th, if you need to send out invitations for the resignation party."}, {"84c7": "You think you’ve got a headache, Herr Hopeless? We’ve been wracked with a national migraine for months."}, {"1906": "Why am I so sure about this bold, yet infinitely plausible prediction? Two reasons."}, {"1e81": "One, I’m a New Yorker. I’ve lived on the same avenue as Donald Trump for about the same number of years (but downtown where the landscape is a truer blue)."}, {"c915": "For decades, I’ve watched this sleaze monkey operate, noted the many twisted expressions of his delusional self-importance, cataloged his rich history of lying, cheating, and exploiting the less fortunate and, like all New Yorkers (as noted in this post), I’ve learned to deeply dislike and vigilantly avoid this bloated ass clown like he’s hiding the Black Plague under his toupee."}, {"e2d4": "Second reason, and I apologize for this in advance, Donald and I share the same birthday. June 14th. Flag Day."}, {"a2bb": "Used to be a nice, low-key, patriotic holiday — July 4th’s less flamboyant cousin. Now, June 14th will be forever marked with an ugly orange Trump stain."}, {"7c00": "That said, the shared birth date does gives me a kind of extra extrasensory, astrological insight into the workings of the man’s maleficent mind and ginormous ego (which I’ve written about here)."}, {"4edd": "So you see, I know him. I know him really well."}, {"10fd": "But enough preamble, here’s how this historic resignation is going to unfold:"}, {"c310": "JANUARY 20th–MARCH 31st: PRESIDENT TRUMP REALIZES HOW MUCH HE HATES THE JOB. His first 60 days in office have been a nightmare. His Muslim ban gets shot down by the courts. His Obamacare repeal and replacement blows up. Mexico isn’t going along with paying for the wall. The Trump rally on Wall Street fizzles. Russian meddling in our election threatens to undermine the legitimacy of his presidency. He has pissed off longstanding allies and provoked trigger-happy enemies. And his approval numbers are the lowest in history."}, {"7314": "Most important to President Prima Donald, all the people he thought would be kissing his ass by now, the only audience of admirers he ever cared about — Hollywood celebrities, television stars, and wealthy media moguls — hate his guts. They stayed away from his inauguration, won’t return his calls, and avoid being seen in public with him like he’s their imbecile half-brother."}, {"9b20": "Add to that insult, the only people left who sort of like him are those who he has a long history of assiduously ignoring: the under-educated, underemployed, underfunded, underprivileged, and underachieving underdogs."}, {"a763": "It’s all adding up to be a gigantic bust. With Commander Combover now the butt of every late night joke and easily the most illustrious laughingstock in American history."}, {"96d1": "And, of course, in Mr. Yella Fella’s thin-membraned mind, this cannot continue."}, {"9f8c": "Thus, the stage is set."}, {"6c4a": "APRIL 1st–APRIL 23rd: THE FBI, NSA, CIA AND HOUSE SELECT COMMITTEE ON INTELLIGENCE START CLOSING IN ON HIM. Pissed off for being thrown under the bus, Paul Manafort speaks publicly before Congress, and privately to the Feds, and not only are Bannon, Sessions, Flynn, Tillerson, and Ross credibly linked to Putin and the Russian plan to interfere with our presidential election, so is Trump’s son-in-law Jared Kushner."}, {"a24b": "As the rising heat causes rivulets of perspiration to run down his pancake makeup, Trump begins to panic. He starts to lose sleep and the sleep deprivation causes him to become more erratic, eat more Cheetos, and send out even more absurd and abrasive predawn tweets."}, {"8d4c": "In a flurry of messages during a few short days in mid-April, he calls one key Senate ally a “walking wimp weasel,” accuses Michele Obama of dissing Melania on Inauguration Day, disses Melania for being an absentee FLOTUS, and is heard on leaked recordings calling Benjamin Netanyahu of Israel a “slimy hymie.”"}, {"15ca": "The blow back from all this is fast, furious, and crippling. Trump realizes that he not only hates being president, he also sucks at it."}, {"cc58": "He starts talking to Bannon about “options.”"}, {"7a6f": "The plot thickens."}, {"3d3c": "APRIL 24th–MAY 29th: IN A DESPERATE ATTEMPT TO DISTRACT THE AMERICAN PUBLIC FROM THE INEVITABILITY OF A TREASON INDICTMENT, TRUMP SPREADS DIVORCE RUMORS. He’s seen it work on dozens of reality TV shows, including his own — if you want to get the public’s undivided attention while drawing scrutiny away from something you’d prefer to hide…create a scandal."}, {"9d22": "And so he does."}, {"1336": "With help from Bannon, Trump and his daughter Ivanka develop an elaborate scheme to plant rumors about Melania having an affair with a billionaire movie producer (“Fuck those Hollywood hacks, let them suck this,” says the president behind closed, but heavily wiretapped doors)."}, {"f7c4": "The president then feigns heartbreak to curry favor with cuckolded men and sympathetic women. The Christian right declares outrage over Melania’s alleged infidelity. Even Arnold Schwarzenegger issues a statement condemning the First Lady’s indiscretions and supporting the president."}, {"503b": "By Memorial Day, a tearful President Trump says that he sadly must begin divorce proceedings against Melania, that the court case will likely last all summer, and that it will certainly be as riveting as OJ’s, with even higher ratings, so no one should leave their TV sets until autumn. He assures the public that he’ll do his best to keep them informed about all POTUS-FLOTUS divorce developments on a minute-by-minute basis and further announces that the cackling, crazy-haired television commentator Nancy Grace will be delivering additional play-by-play."}, {"852a": "The nation is voyeuristically focused on his marital soap opera and quickly forgets about the Russians in its own backyard."}, {"029f": "Trump thinks his devious plan is working."}, {"05c0": "Until…"}, {"8683": "MAY 30th–JUNE 14th: PUTIN RELEASES THE INFAMOUS GOLDEN SHOWER VIDEO. Any goodwill that Trump has garnered playing the aggrieved husband goes out the window when the Russians decide his presidency is quickly unraveling, his usefulness is coming to an end, and the smartest option is to hasten his demise."}, {"6270": "And, that’s when we see him, fully naked on our television sets — a pasty, drooling, flesh cake of a man, a corpulent slug with his meticulous ridiculous hair-rug in place, lying under an alternating stream of warm liquid delivered by a fit foursome of nubile Russian prostitutes."}, {"4172": "If there is any doubt this is our very own pre-president receiving a Slavic sun shower, those doubts are erased when he looks up at the lithe ladies and announces, “I’m going to make all of you winners in my Miss Universe pageant, would you like that?”"}, {"8767": "Trump’s Flag Day birthday present is a $6-billion-dollar counter-divorce action from a vindicated Melania."}, {"517e": "And the vise closes tighter."}, {"20fa": "JUNE 15th–JULY 20th: IF YOU CAN’T DISTRACT THE PEOPLE WITH A SEX SCANDAL AND A MESSY DIVORCE PLAYED OUT ON THE NATIONAL STAGE, SCARE THE SHIT OUT OF THEM BY DECLARING A STATE OF EMERGENCY AND MARTIAL LAW. If you thought Bannon was diabolical in the administration’s first 100 days, wait till you see what he cooks up by midsummer with the president’s blessing."}, {"2848": "Things are going so badly for Trumpty Dumpty at this point, impeachment is looking like a mild slap on the wrist. People in the streets are yelling, “LOCK HIM UP!” as it becomes apparent that he, and most in his inner circle, are about to be sanctioned, condemned, and indicted for serious crimes that start with colluding with the enemy, extend to fixing an election, touch on embezzling billions of dollars from the national treasury, and land firmly on treason…with murder tossed in after a few Putin-style poisonings and roof tossings occur at Trump’s Washington, D.C. hotel."}, {"c26c": "Saving his presidency and, more important to Trump, his honor, legacy, and ability to indiscriminately grab pussy till the end of his days, now becomes a “do-or-die” mission."}, {"34dd": "Enter “The Unprecedented National Emergency.”"}, {"f026": "This isn’t some quaint, Cheney-created, color-coded threat level. We’re talking about…ALIEN INVASION!"}, {"bab1": "You think that’s preposterous, right, that now I’m just being comical and absurd? Really? Need I remind you that this is the same paranoid, possibly mentally ill president who accused his predecessor of personally bugging his office at Trump Tower with absolutely no proof at all?"}, {"8f8a": "Knowing that, you still think faking an alien takeover is too heavy-handed and asinine for The Lyin’ King and his Dr. Evil sidekick?"}, {"f96c": "Are you sure?"}, {"5ceb": "Consider this — the kind of crimes committed against this country by Trump, the size of which America has never seen before, would have to be met with an urgent existential threat to fully absorb the resources and attention of all the nation’s intelligence organizations, law enforcement agencies, local police forces, even the military."}, {"5791": "And that’s where planet-threatening aliens come in."}, {"cf20": "On or around July 4th (that’s right, Independence Day), the White House starts leaking rumors that a fleet of unidentified spacecraft seems to have entered our solar system. Despite denials from NASA, Russia’s Roscosmos, and space agencies and astronomical observatories around the world, the Trump administration insists that there is a potential extraterrestrial invasion underway."}, {"b74f": "All eyes, worldwide, turn slowly from their television sets, iPhones, and Instagram accounts to the heavens."}, {"d23e": "Trump tweets on July 10th:"}, {"e198": "Just saw intel no one else allowed to see — UFO’s headed directly for Earth’s orbit. No hoax, not fake news. For real! TRUST ME!”"}, {"4bf9": "On July 12th, he tweets:"}, {"ab68": "Spacemen (and women) almost here. Good thing I have nukes ready. Keep eyes skyward, don’t look at what I’m doing down here."}, {"16b3": "On July 15th, as panic fills the streets of every city in America and most of the world, he ramps up the fear:"}, {"4e9f": "Just told Maddog Mattis to position intercontinental missiles. If E.T. lands here we’ll nuke ’em. Good thing you didn’t imprison me now, right?"}, {"06ba": "Suddenly, no one is thinking about Trump’s long list of heinous crimes — not with the Klingons at our orbital doorstep."}, {"a91b": "And that’s the moment when the venom-spitting Steve Bannon instructs Hair Fuhrer to deploy the ultimate presidential weapon: Martial Law."}, {"b6b2": "JULY 21st–July 28th: JUST WHEN YOU THINK YOU’RE OUT OF THE WOODS AND HOME FREE, HAVING PULLED THE ULTIMATE SCAM ON AN ENTIRE NATION, YOU’RE RAMMED UP THE ASS BY AN OLD SAILOR WHO’S BEEN WAITING PATIENTLY TO EVEN THE SCORE. With Martial Law in place, and the imminent arrival of hive-minded bloboids with death rays sending paroxysms of terror across the nation, Trump and company are feeling quite smug in the Oval Office while issuing countless executive orders “needed to protect the country during this time of exceptional crisis,” simultaneously tightening their iron chokehold on American democracy."}, {"97f1": "But this is not where my plausible prediction ends. No, no, no."}, {"c1d8": "On or around July 28th, George Herbert Walker Bush — former WWII Navy flyer and 41st President of the United States, who is, yes, still alive — makes a formal appeal to the White House that he be allowed to address the nation about the alien invasion from his summer home in Kennebunkport, ME."}, {"b7eb": "Trump, assuming Bush, a fellow Republican and former CIA Director, will support his crisis-driven, autocratic security measures, approves the old soldier’s request for a national address."}, {"f981": "Here’s what he will say:"}, {"6a44": "“My fellow Americans. I love this country, and I don’t want to see it, or its host planet Earth, destroyed by extraterrestrials."}, {"a8fc": "Luckily, that’s not going to happen — not today, or tomorrow, or in the next century — because there are no aliens coming. It’s total bullshit."}, {"922e": "For the past seven months you’ve been lied to and jerked around by this mango-colored monstrosity of a human being who calls himself your president and somehow stumbled into the White House."}, {"20df": "(At this point, the White House tries to kill the satellite feed to Kennebunkport, but Bush has already received assurances from his old allies at the CIA and NSA that they’ve neutralized any White House interference.)"}, {"432e": "I want to assure you that Mr. Trump and his accomplices have fabricated this alien invasion story to deflect attention away from his massive misdeeds and miscarriages of justice, his treasonous conduct against this country, and his incredibly poor diet."}, {"789e": "Furthermore, I have been working behind the scenes with congressmen and senators from both parties to ensure that any further executive orders from the White House be nullified and the influence of President Trump be neutralized. The Martial Law decree will also be lifted."}, {"4913": "Criminal charges against the short-fingered vulgarian will be filed immediately, and Putin’s papaya-flavored pawn will not be allowed to conduct business as usual or command the nation’s armed forces going forward — I have those assurances from my friends at the Pentagon."}, {"dce7": "The day will come, my friends, when this nation sees the end of its rise as a great democratic stronghold and respected world power — but that time isn’t now, isn’t soon, and certainly isn’t on my watch."}, {"202f": "This is former President George Bush, saying goodnight and God bless.”"}, {"8b90": "JULY 29th–AUGUST 17th: A CRASH COURSE IN SPINNING AN EPIC LIE TO MAKE YOURSELF LOOK GOOD AND YOUR COUNTRY LOOK BAD. With the entire house of cards crashing down around him in the days after the elder Bush’s address, Trumplethinskin is desperate to find an “honorable” way out of his malignant predicament."}, {"9bf2": "On August 12th, he goes on national television and declares that “old man Bush is a nice former president but totally senile and playing with a pouch full of loose marbles.”"}, {"79e6": "He also doubles down on his alien fabrications, saying that the latest satellite pictures indicate that the alien spaceships are sneakily parked behind the moon where we can’t see them, but could come out at any moment and present a dire threat to all earthly life as well as a comeback season for The Celebrity Apprentice."}, {"bddc": "In an unhinged rage, the president says that no one is listening to him even though he’s the only one who can save the country and the world. He says that the mainstream media is out to get him and won’t let him operate without impunity. He declares that the government has broken down, that the system is totally unfixable, and that he has tried everything he can to make the country great again but is getting no cooperation."}, {"ca7c": "Sean Spicer runs in at this point with what the president says are the latest satellite images of the alien invaders. On closer inspection, these appear to be slightly-altered endoscopy photos from an esophageal exam. Nevertheless, the president presents them as definitive proof of an extraterrestrial breach."}, {"d758": "The Tangerine Tornado finishes by saying that he will be flying to Mar-A-Lago for the weekend and will be considering what else can be done to protect life on the planet while he plays a few rounds of golf."}, {"823f": "AUGUST 18th: THE RESIGNATION. Upon returning to Washington after his 33rd trip to Mar-A-Lago since becoming president, Mr. Trump is besieged by up to 10 million protesters surging against the gates of the White House."}, {"e54b": "As Adolf Twitler leaves Washington for the last time, he’ll give photographers one final opportunity to snap pictures of his impossibly small hands."}, {"ee75": "He takes to the airwaves again to announce that, just as he thought, Washington is “filled with nothing but a bunch of tight-ass paper pushers who don’t have the slightest clue how to run a successful business operation. Sad. If this is the kind of government the people want, instead of letting me make America a world-class corrupt power, well then, there’s nothing more for me to do here. It’s hopeless. I have told Mike Pence that I’m handing in my resignation and returning to New York.”"}, {"524b": "The president continues, saying, “If anyone wants to know what I’ll be doing going forward, I’m excited to announce that I’ll be working with Steve Bannon, Roger Ailes, and some very good people, no, great people in the non-fake press world to create a really incredible new TV network that we’ll be calling Trump International Media or TIM. But not tiny TIM. This is going to be huge. I’m inviting my friends in show business to send me proposals now as we’d like to have some great shows on the air for the new fall season. Thank you America and God bless me.”"}, {"d170": "As the president stands to leave the Oval Office, he is arrested by FBI agents and taken to an undisclosed location along with 15 other senior White House officials, including a barefoot Kellyanne Conway who is asked not to put her smelly feet up on the metal benches of the federal paddy wagon."}, {"8f87": "Another of those taken into custody, suspected Russian cyborg Stephen Miller, explodes upon being lifted into an armored FBI transport van. Two agents are severely injured after being hit by shrapnel from Miller’s splintered titanium body, but survive."}, {"6a72": "And the country is ultimately saved."}, {"be5e": "God bless America."}, {"805b": "*****"}, {"1aa5": "If you liked this post, please click the heart, comment, and/or follow me. I read every comment. And click here for my most popular post."}, {"b592": "Many of these biting Trump nicknames came from a collective name rant here. Love all these Medium reader contributions! Thank you!"}, {"1d64": "— AI"}], "child": "1496_1\t1496_2\t1496_3\t1496_4\t1496_5\t1496_6\t1496_7\t1496_8\t1496_9\t1496_10\t1496_11\t1496_12\t1496_13\t1496_14\t1496_15\t1496_16\t1496_17\t1496_18\t1496_19\t1496_20\t1496_21\t1496_22\t1496_23"}