{"name": "1497", "parent": "", "content": "About What Happened Last Night… “The end of the republic has never looked better,” — joked Barack Obama at the The White House correspondents dinner at the end of April. Because I’m a man, I hadn’t cried during a political event of any kind — until Hillary Clinton’s concession speech. I’m husband to an immigrant wife. What kind of world will our child be born into? It was like waking up from the worst nightmare, trying very hard to piece the facts forward. Did last night really happen? It’s the-student-becomes-the-master-at-8pm-every-week-night-on-NBC bullshit. Brian Williams’ voice soothed us — as if it was the other person in the hospital waiting room crayoning ‘Highlights’ while we waited for the cancer diagnosis. Almost all night, Trump University led the Electoral College. Whats next? I don’t normally email Extra NewsFeed readers — email has been especially costly lately — but “we now all feel the way Rudy Giuliani looks,” — said The Late Show. It was nice to laugh. It made it real to laugh. I don’t want to laugh. What followed Trump’s racism, sexism, fascism, and inciting of violence was 58,000,000+ votes. He successful branded each competitor’s name with the adjective of choice, ending in “CROOKED.” Enough bought in. She won the popular vote: 59,000,000+ votes. Not enough bought in. Pride aside, everyone can relate to the other side of Trump; the side where the louder voice can change your name. I remember the months as a tenth grader when a certain group of high school seniors would greet me with “fuck off Smooke.” To change the sound of what refers to you. Crooked. Should we really be surprised? The bully wins. “I’ve gotta’ use some Tic Tacs, just in case I start kissing her,” — said Trump to Bush. “You know I’m automatically attracted to beautiful — I just start kissing them. It’s like a magnet. Just kiss. I don’t even wait. And when you’re a star they let you do it. You can do anything… Grab them by the pussy. You can do anything.” …Ladies and gentleman, that is now the leader of the free world… well before he becomes leader of the free world, he must overcome allegations of fraud in the court of law & how-many-can-you-keep-track-of allegations of sexual assault… Is a Trump Presidency really going to be that different than yesterday’s power? Last century many citizens in Italy, Germany, and Russia — to name a few — probably assured themselves with similar questions they didn’t want the other answers to. Maybe, the presidency is just one job — we tell ourselves. And I appreciate the Anil Dash’s and Brad Feld’s of the world reminding us to ‘get back to work.’ Make better what we can make better. But the new anxiety is real because we elected it. The sun will rise no matter who’s in power, the lame duck assured us. We can’t get away from our sentiment by moving from one place to another. Although, so many seem to think so the Canadian immigration site crashed last night. Republican or Democrat, the right to live in America is not something that should be determined by race, orientation or religion. But with a deportation force on the horizon, who knows how who will be categorized… Will the next knock on the door try to steal my wife? My child? Your neighbor? What this country voted for yesterday is what this country voted for yesterday. As they say in politics, ‘the show must go on.’ With hope for the newsfeed, David Smooke ", "title": "About What Happened Last Night…", "sentences": [{"7dd6": "About What Happened Last Night…"}, {"2282": "“The end of the republic has never looked better,” — joked Barack Obama at the The White House correspondents dinner at the end of April."}, {"f94f": "Because I’m a man, I hadn’t cried during a political event of any kind — until Hillary Clinton’s concession speech. I’m husband to an immigrant wife. What kind of world will our child be born into?"}, {"1d3b": "It was like waking up from the worst nightmare, trying very hard to piece the facts forward. Did last night really happen? It’s the-student-becomes-the-master-at-8pm-every-week-night-on-NBC bullshit. Brian Williams’ voice soothed us — as if it was the other person in the hospital waiting room crayoning ‘Highlights’ while we waited for the cancer diagnosis. Almost all night, Trump University led the Electoral College. Whats next? I don’t normally email Extra NewsFeed readers — email has been especially costly lately — but “we now all feel the way Rudy Giuliani looks,” — said The Late Show. It was nice to laugh. It made it real to laugh. I don’t want to laugh."}, {"e1a1": "What followed Trump’s racism, sexism, fascism, and inciting of violence was 58,000,000+ votes. He successful branded each competitor’s name with the adjective of choice, ending in “CROOKED.” Enough bought in. She won the popular vote: 59,000,000+ votes. Not enough bought in. Pride aside, everyone can relate to the other side of Trump; the side where the louder voice can change your name. I remember the months as a tenth grader when a certain group of high school seniors would greet me with “fuck off Smooke.” To change the sound of what refers to you. Crooked. Should we really be surprised? The bully wins."}, {"81b7": "“I’ve gotta’ use some Tic Tacs, just in case I start kissing her,” — said Trump to Bush. “You know I’m automatically attracted to beautiful — I just start kissing them. It’s like a magnet. Just kiss. I don’t even wait. And when you’re a star they let you do it. You can do anything… Grab them by the pussy. You can do anything.”"}, {"ec63": "…Ladies and gentleman, that is now the leader of the free world… well before he becomes leader of the free world, he must overcome allegations of fraud in the court of law & how-many-can-you-keep-track-of allegations of sexual assault…"}, {"7ef7": "Is a Trump Presidency really going to be that different than yesterday’s power? Last century many citizens in Italy, Germany, and Russia — to name a few — probably assured themselves with similar questions they didn’t want the other answers to. Maybe, the presidency is just one job — we tell ourselves. And I appreciate the Anil Dash’s and Brad Feld’s of the world reminding us to ‘get back to work.’ Make better what we can make better. But the new anxiety is real because we elected it. The sun will rise no matter who’s in power, the lame duck assured us. We can’t get away from our sentiment by moving from one place to another. Although, so many seem to think so the Canadian immigration site crashed last night."}, {"0ec8": "Republican or Democrat, the right to live in America is not something that should be determined by race, orientation or religion. But with a deportation force on the horizon, who knows how who will be categorized… Will the next knock on the door try to steal my wife? My child? Your neighbor?"}, {"57bf": "What this country voted for yesterday is what this country voted for yesterday. As they say in politics, ‘the show must go on.’"}, {"0563": "With hope for the newsfeed,"}, {"9daa": "David Smooke"}], "child": "1497_1\t1497_2"}