{"name": "1505", "parent": "", "content": "It’s the Russians, Sisters The War Room, a documentary about the 1992 Bill Clinton campaign, runs 96 minutes long and contains 2 seconds featuring the 20-year-old me. I’m standing on a desk, surrounded by staffers gathered to hear James Carville rally the troops for the last time before the presidential election. In the months leading up to that moment, Carville’s pithy expression “The Economy, Stupid,” served as the campaign mantra, encapsulating and elevating a deep, visceral concern shared by countless Americans across the country. I thought about “The Economy, Stupid” when I read that organizers of the Women’s March named March 8 as the date for “A Day without a Woman” General Strike. For some, the slogan evokes how significantly our nation depends on women and our labor. For this President — defied by a woman acting attorney general and mocked by a woman assuming the guise of his press secretary — “A Day without a Woman” might sound entirely appealing. I’m not privy to the inner circle of the Women’s March leadership, but as a loyal foot solider in their army, I’m listening for a rallying cry that unites us across divisions and beckons those beyond our immediate circle to our side. It’s become increasingly clear that such a rallying cry involves Russia. CNN recently announced that several aspects of an intelligence dossier linking President Trump to Russia had been corroborated. Last Monday, National Security Advisor Michael Flynn resigned his position after covering up the true nature of his conversations with the Russian ambassador before the inauguration. Last Tuesday, it was reported that Russia secretly launched a cruise missile in direct violation of a landmark arms control treaty. Last Tuesday, it was also revealed that several of the President’s campaign aides had repeated contacts with Russian intelligence officers before the election. Last Thursday, during a 77-minute, stream-of-consciousness press conference, the President insisted: “I have nothing to do with Russia. I told you, I have no deals there, I have no anything.” Those of us who joined the Women’s March on January 21 and those of us who plan to participate in the General Strike do so on behalf of a variety of urgent, critical causes. This President appears to care about none of them. We move the needle on our individual issues by first forming a massive, united front and this front is formed by calling upon, embracing and emboldening all who vigorously support our country and are prepared to defend it against enemies or detractors. The majority of Americans want to get to the bottom of Russian interference in our election and we share a common concern about the President’s undisclosed financial interests, which could be inextricably linked to Moscow. These sentiments transcend gender, race and party lines and speak to our deepest values of freedom and fairness. They would translate well into primary objectives for the Women’s March General Strike and those objectives would be clear, measurable and unequivocal: We call for an immediate, bi-partisan, independent Congressional investigation into the President’s ties to Russia. We call upon Congress to compel the President to immediately release his tax returns. The President’s enigmatic deference to Russia alarms and invigorates influential members from both parties in Congress. John McCain, Chairman of the Senate Armed Services Committee, supports an investigation into Russia’s hacking of our election and is an outspoken proponent of maintaining Russian sanctions. Ron Wyden, ranking Democratic member of the Senate Finance Committee, has introduced a bill to require the President to release his tax returns. Yet despite the public uproar over Michael Flynn’s resignation and the revelation that the President’s aides communicated with Russian intelligence during the election, Congress has refused to launch a bi-partisan, independent “select committee” investigation into ties between Russia and the White House. Elected leaders of all stripes say that protecting our country is of paramount importance. Americans from all walks of life expect our elected leaders to do their part to keep us safe. The Women’s March General Strike provides us a historic moment to call upon all patriots in office to vigorously support our country and to defend us against our enemies. Twenty-five years ago, “The Economy, Stupid” captured in a single phrase the anxiety many Americans felt about the overall direction of the country. Today our anxiety is different and infinitely more acute. It’s the Russians, Sisters. It’s the Russians. ", "title": "It’s the Russians, Sisters", "sentences": [{"6bcf": "It’s the Russians, Sisters"}, {"0106": "The War Room, a documentary about the 1992 Bill Clinton campaign, runs 96 minutes long and contains 2 seconds featuring the 20-year-old me. I’m standing on a desk, surrounded by staffers gathered to hear James Carville rally the troops for the last time before the presidential election."}, {"4e1d": "In the months leading up to that moment, Carville’s pithy expression “The Economy, Stupid,” served as the campaign mantra, encapsulating and elevating a deep, visceral concern shared by countless Americans across the country."}, {"1b92": "I thought about “The Economy, Stupid” when I read that organizers of the Women’s March named March 8 as the date for “A Day without a Woman” General Strike. For some, the slogan evokes how significantly our nation depends on women and our labor. For this President — defied by a woman acting attorney general and mocked by a woman assuming the guise of his press secretary — “A Day without a Woman” might sound entirely appealing."}, {"bacd": "I’m not privy to the inner circle of the Women’s March leadership, but as a loyal foot solider in their army, I’m listening for a rallying cry that unites us across divisions and beckons those beyond our immediate circle to our side."}, {"5ddb": "It’s become increasingly clear that such a rallying cry involves Russia."}, {"18b5": "CNN recently announced that several aspects of an intelligence dossier linking President Trump to Russia had been corroborated. Last Monday, National Security Advisor Michael Flynn resigned his position after covering up the true nature of his conversations with the Russian ambassador before the inauguration. Last Tuesday, it was reported that Russia secretly launched a cruise missile in direct violation of a landmark arms control treaty. Last Tuesday, it was also revealed that several of the President’s campaign aides had repeated contacts with Russian intelligence officers before the election. Last Thursday, during a 77-minute, stream-of-consciousness press conference, the President insisted: “I have nothing to do with Russia. I told you, I have no deals there, I have no anything.”"}, {"814b": "Those of us who joined the Women’s March on January 21 and those of us who plan to participate in the General Strike do so on behalf of a variety of urgent, critical causes. This President appears to care about none of them."}, {"f32d": "We move the needle on our individual issues by first forming a massive, united front and this front is formed by calling upon, embracing and emboldening all who vigorously support our country and are prepared to defend it against enemies or detractors."}, {"9b61": "The majority of Americans want to get to the bottom of Russian interference in our election and we share a common concern about the President’s undisclosed financial interests, which could be inextricably linked to Moscow."}, {"1129": "These sentiments transcend gender, race and party lines and speak to our deepest values of freedom and fairness. They would translate well into primary objectives for the Women’s March General Strike and those objectives would be clear, measurable and unequivocal:"}, {"78ab": "We call for an immediate, bi-partisan, independent Congressional investigation into the President’s ties to Russia."}, {"f0ce": "We call upon Congress to compel the President to immediately release his tax returns."}, {"fb91": "The President’s enigmatic deference to Russia alarms and invigorates influential members from both parties in Congress. John McCain, Chairman of the Senate Armed Services Committee, supports an investigation into Russia’s hacking of our election and is an outspoken proponent of maintaining Russian sanctions. Ron Wyden, ranking Democratic member of the Senate Finance Committee, has introduced a bill to require the President to release his tax returns."}, {"0fbf": "Yet despite the public uproar over Michael Flynn’s resignation and the revelation that the President’s aides communicated with Russian intelligence during the election, Congress has refused to launch a bi-partisan, independent “select committee” investigation into ties between Russia and the White House."}, {"cc2b": "Elected leaders of all stripes say that protecting our country is of paramount importance. Americans from all walks of life expect our elected leaders to do their part to keep us safe."}, {"a050": "The Women’s March General Strike provides us a historic moment to call upon all patriots in office to vigorously support our country and to defend us against our enemies."}, {"ce99": "Twenty-five years ago, “The Economy, Stupid” captured in a single phrase the anxiety many Americans felt about the overall direction of the country. Today our anxiety is different and infinitely more acute."}, {"8390": "It’s the Russians, Sisters."}, {"4e37": "It’s the Russians."}], "child": "1505_1"}