{"name": "1507", "parent": "", "content": "Merci Donald Trump ! Samedi 21 janvier, chaude journée à Washington DC et dans d’autres capitales. Donald Trump a été investi President of the United states of America hier et depuis “les femmes” sont entrées avec puissance dans l’espace public. Dans les rues, pancartes à la main, elles vitupérent contre l’animal que certains se sont offerts comme président. Propulsé à la tête d’une administration hyper structurée, l’homme qui fait peur à tout le monde est soupçonné d’avoir dans son viseur les femmes — “les pussys”. Langage grossier donc, propositions farfelues voire iniques ( volonté d’interdire, voire de pénaliser l’avortement), considération relativement bas de plafond (“Si Ivanka n’était pas ma fille, je sortirais avec elle”), l’homme n’est pas avare de petites perles. Tout ce qu’il peut faire pour hérisser les féministes en accord avec la doctrine, il le tente. Et ça marche. Pourtant, Contrepoints, le relayait au moment de son élection : 53% des femmes blanches ont voté pour Donald Trump et les chiffres vont encore plus loin, 59% des femmes non diplômées ont voté pour le boss du bullshit game. En tout, 42% des femmes américaines (contre 54% pour Hillary) ont offert leur voix à Trump. Pour nuancer le propos, notons que seules 51% des femmes blanches se sont déplacées en novembre pour faire valoir leur droit. Mais le Président est conspué par l’intelligentsia et les médias qui lui reprochent son machisme. Pour continuer à disserter sur Trump et son rapport aux femmes, prenons cet exemple extrait du site Madame Figaro : 09/11/2016 — Madame Figaro online Le titre laisse songeur. Doit-on comprendre qu’au 21ème siècle, les femmes devraient restées dans leur canapé à boire du thé ? La lecture plus attentive de la citation révèle pourtant une idée qui, loin d’être misogyne, tient plutôt du bon sens. En effet, la phrase exacte est : “Si vous faites du business vous-même, je pense que c’est une très mauvaise idée de faire travailler votre épouse pour vous”. Enfin, Donald Trump, n’aurait-il pas là proposé une idée digne et émancipatrice ? Loin de refuser à sa femme l’accès au monde du travail, il semble préconiser son autonomie. Liberté mon amour Ces petits éléments servent à nuancer le discours dominant à l’égard de Trump et à ouvrir la voie à une réflexion décalée. Comme beaucoup, je regrette déjà le swag d’Obama, son ouverture à toutes les différences, le cool de Michelle et son combat en faveur de l’éducation. Néanmoins, je célèbre ce que je vois : l’opportunité d’une resistance à l’autorité absolu que représente l’Etat, et plébiscite un mouvement plus global et surtout non-genré. Je réfute la nécessité d’une lutte unique des femmes contre le dominateur blanc et milite plutôt pour une lutte en faveur des libertés. Cette grande tendance à la “sororité” me tend. Elle implique une unité de sexe et de genre qui me déplait. Et surtout, je ne cesse d’avoir en tête le roman de Robert Merle, “Les Hommes protégés”. En 1974, ce roman de science-fiction propulse le lecteur dans un monde dirigé par les femmes. Le féminisme est devenue un machisme. Le héros, un scientifique, qui cherche à découvrir le vaccin qui sauvera les hommes (décimés par un virus), contemple et commente cette nouvelle hiérarchie des genres. La conclusion large de cette histoire ? Les femmes ne sont pas plus tendres que les hommes et le pouvoir peut rendre tout un chacune dictatrice et bourreau. Donald Trump révèle grâce au ressentiment qu’il provoque le danger de voir un homme posséder tous les pouvoirs. Ainsi, le fond du problème n’est pas une question de genre ou de sexe ou de couleur de peau, mais plutôt une question de droit et donc de liberté. Le motif de ces manifestations est en grande partie une inquiétude vive quant à ce que Donald Trump pourrait leur faire maintenant qu’il détient le pouvoir. Si l’homme est à la tête de l’Etat, il ne dirige ni nos pensées, ni nos actes. Il ne pourra déterminer nos modes de vie, nos relations, notre liberté si nous sommes conscients de notre pouvoir de résistance aux institutions. L’élection de Trump, ne pourrait-elle pas sonner le glas de notre soumission totale à l’Etat (et son représentant ultime) et annoncer une ère où chacun prend ses responsabilités et choisit l’autorité morale qu’il juge légitime? Au lieu d’une lutte des femmes et des minorités contre un homme et sa pratique supposée du pouvoir, n’est-ce pas l’occasion d’une lutte contre l’Etat? Une lutte pour plus d’autonomie. Shepard Fairey L’Etat n’est pas tout, et nous pouvons faire avec mais aussi contre et sans lui. La nouvelle est belle puisqu’elle mène au mouvement #Womensmarch, à l’action. Elle inspire, aussi, le monde de l’art, précurseur de toutes les révolutions. En témoigne l’oeuvre de Shepard Fairey. Celui qui il y a huit ans choisissait de célébrer l’arrivée de Barack Obama avec sa célèbre affiche HOPE (2008), met aujourd’hui en valeur les différences et les femmes. Ce n’est plus un Homme unique mis en avant mais bien “we the people”. Un appel, qui sonne comme un avertissement. Cette dynamique laisse espérer notre émancipation. Celle qui permettra à notre liberté de ne plus être un monopole d’Etat. Les femmes, on l’a vu, n’ont été qu’une courte majorité à se déplacer pour voter. Aujourd’hui pourtant, elles marchent et dirigent ce mouvement qui s’empare des rues et électrise (un peu) l’espace public. Le vote n’est pas le seul acte par lequel nous contractons nos droits. Les droits naturels priment, d’ailleurs, sur la fiction qui nous fait tout abandonner au profit de la sécurité. Mais lorsque l’Etat n’est plus capable de nous protéger, le contrat social est cassé. Ne demeure que notre aspiration, d’individu (libre), à survivre (résister). En élisant ce personnage étonnant et controversé les américains écrivent une page d’Histoire et nous inspirent de nouveau. Acceptons notre capacité à l’autonomie. Acceptons de dire non à l’Etat quand il dépasse ses prérogatives. Courons vers la liberté ! ", "title": "Merci Donald Trump !", "sentences": [{"750d": "Merci Donald Trump !"}, {"83bd": "Samedi 21 janvier, chaude journée à Washington DC et dans d’autres capitales. Donald Trump a été investi President of the United states of America hier et depuis “les femmes” sont entrées avec puissance dans l’espace public. Dans les rues, pancartes à la main, elles vitupérent contre l’animal que certains se sont offerts comme président. Propulsé à la tête d’une administration hyper structurée, l’homme qui fait peur à tout le monde est soupçonné d’avoir dans son viseur les femmes — “les pussys”."}, {"ba4c": "Langage grossier donc, propositions farfelues voire iniques ( volonté d’interdire, voire de pénaliser l’avortement), considération relativement bas de plafond (“Si Ivanka n’était pas ma fille, je sortirais avec elle”), l’homme n’est pas avare de petites perles. Tout ce qu’il peut faire pour hérisser les féministes en accord avec la doctrine, il le tente. Et ça marche."}, {"aac9": "Pourtant, Contrepoints, le relayait au moment de son élection : 53% des femmes blanches ont voté pour Donald Trump et les chiffres vont encore plus loin, 59% des femmes non diplômées ont voté pour le boss du bullshit game. En tout, 42% des femmes américaines (contre 54% pour Hillary) ont offert leur voix à Trump. Pour nuancer le propos, notons que seules 51% des femmes blanches se sont déplacées en novembre pour faire valoir leur droit."}, {"b42d": "Mais le Président est conspué par l’intelligentsia et les médias qui lui reprochent son machisme. Pour continuer à disserter sur Trump et son rapport aux femmes, prenons cet exemple extrait du site Madame Figaro :"}, {"1aa8": "09/11/2016 — Madame Figaro online"}, {"634b": "Le titre laisse songeur. Doit-on comprendre qu’au 21ème siècle, les femmes devraient restées dans leur canapé à boire du thé ? La lecture plus attentive de la citation révèle pourtant une idée qui, loin d’être misogyne, tient plutôt du bon sens. En effet, la phrase exacte est : “Si vous faites du business vous-même, je pense que c’est une très mauvaise idée de faire travailler votre épouse pour vous”. Enfin, Donald Trump, n’aurait-il pas là proposé une idée digne et émancipatrice ? Loin de refuser à sa femme l’accès au monde du travail, il semble préconiser son autonomie."}, {"097b": "Liberté mon amour"}, {"2186": "Ces petits éléments servent à nuancer le discours dominant à l’égard de Trump et à ouvrir la voie à une réflexion décalée. Comme beaucoup, je regrette déjà le swag d’Obama, son ouverture à toutes les différences, le cool de Michelle et son combat en faveur de l’éducation. Néanmoins, je célèbre ce que je vois : l’opportunité d’une resistance à l’autorité absolu que représente l’Etat, et plébiscite un mouvement plus global et surtout non-genré."}, {"fefb": "Je réfute la nécessité d’une lutte unique des femmes contre le dominateur blanc et milite plutôt pour une lutte en faveur des libertés. Cette grande tendance à la “sororité” me tend. Elle implique une unité de sexe et de genre qui me déplait. Et surtout, je ne cesse d’avoir en tête le roman de Robert Merle, “Les Hommes protégés”. En 1974, ce roman de science-fiction propulse le lecteur dans un monde dirigé par les femmes. Le féminisme est devenue un machisme. Le héros, un scientifique, qui cherche à découvrir le vaccin qui sauvera les hommes (décimés par un virus), contemple et commente cette nouvelle hiérarchie des genres. La conclusion large de cette histoire ? Les femmes ne sont pas plus tendres que les hommes et le pouvoir peut rendre tout un chacune dictatrice et bourreau."}, {"e13c": "Donald Trump révèle grâce au ressentiment qu’il provoque le danger de voir un homme posséder tous les pouvoirs."}, {"00db": "Ainsi, le fond du problème n’est pas une question de genre ou de sexe ou de couleur de peau, mais plutôt une question de droit et donc de liberté. Le motif de ces manifestations est en grande partie une inquiétude vive quant à ce que Donald Trump pourrait leur faire maintenant qu’il détient le pouvoir. Si l’homme est à la tête de l’Etat, il ne dirige ni nos pensées, ni nos actes. Il ne pourra déterminer nos modes de vie, nos relations, notre liberté si nous sommes conscients de notre pouvoir de résistance aux institutions. L’élection de Trump, ne pourrait-elle pas sonner le glas de notre soumission totale à l’Etat (et son représentant ultime) et annoncer une ère où chacun prend ses responsabilités et choisit l’autorité morale qu’il juge légitime? Au lieu d’une lutte des femmes et des minorités contre un homme et sa pratique supposée du pouvoir, n’est-ce pas l’occasion d’une lutte contre l’Etat? Une lutte pour plus d’autonomie."}, {"050a": "Shepard Fairey"}, {"bdde": "L’Etat n’est pas tout, et nous pouvons faire avec mais aussi contre et sans lui. La nouvelle est belle puisqu’elle mène au mouvement #Womensmarch, à l’action. Elle inspire, aussi, le monde de l’art, précurseur de toutes les révolutions. En témoigne l’oeuvre de Shepard Fairey. Celui qui il y a huit ans choisissait de célébrer l’arrivée de Barack Obama avec sa célèbre affiche HOPE (2008), met aujourd’hui en valeur les différences et les femmes. Ce n’est plus un Homme unique mis en avant mais bien “we the people”. Un appel, qui sonne comme un avertissement."}, {"4387": "Cette dynamique laisse espérer notre émancipation. Celle qui permettra à notre liberté de ne plus être un monopole d’Etat."}, {"e771": "Les femmes, on l’a vu, n’ont été qu’une courte majorité à se déplacer pour voter. Aujourd’hui pourtant, elles marchent et dirigent ce mouvement qui s’empare des rues et électrise (un peu) l’espace public. Le vote n’est pas le seul acte par lequel nous contractons nos droits. Les droits naturels priment, d’ailleurs, sur la fiction qui nous fait tout abandonner au profit de la sécurité. Mais lorsque l’Etat n’est plus capable de nous protéger, le contrat social est cassé. Ne demeure que notre aspiration, d’individu (libre), à survivre (résister)."}, {"ff58": "En élisant ce personnage étonnant et controversé les américains écrivent une page d’Histoire et nous inspirent de nouveau. Acceptons notre capacité à l’autonomie. Acceptons de dire non à l’Etat quand il dépasse ses prérogatives."}, {"3d4d": "Courons vers la liberté !"}], "child": "1507_1\t1507_2"}