{"name": "1510", "parent": "", "content": "A simple guide to how you can throw sand in the Trump administration’s gears You can resist from the comfort of your own desk. CREDIT: AP Photo/Evan Vucci We’re just over a week into the Trump administration. For those of us hoping to push back, the flood of bad news and blatant lies have been overwhelming. We can push back, however. And we can push back in ways that actually make it harder for bad people to make bad law. If there is one action most of us have heard about from every progressive corner lately, it’s the “call your member of Congress” one. Tell your Senators not to confirm terrible nominees. Tell your member of Congress not to repeal Obamacare. But there’s another way law is made in Washington called “rulemaking.” And unlike members of Congress, who may choose to ignore your call, the people engaged in rulemaking actually have to listen to you if you complain about a proposed rule in the proper way. Many laws announce a broad policy goal, then instruct a federal agency to fill in the details of how this goal will be achieved. During the Obama administration, agencies made rules to fight global warming, to protect LGBT Americans, to expand the number of workers who receive overtime pay, and to allow women to obtain birth control without a co-payment. All of these rules, and more, are now in jeopardy thanks to the Trump administration. Regulations are often the conservatives’ bogeyman, and the Trump administration has been eyeing certain regulations since the election. Make no mistake, many conservatives would like to undermine the rulemaking process entirely. But for now, it still exists. And conservatives intend to focus on dismantling the regulations they don’t like one by one. (Just days after the election, Breitbart bragged that net neutrality, currently protected by regulation, would be “dead” under Trump.) So liberals must go into protective mode. One way we can do that is by deluging the Trump administration with comments on their proposed rules — including their efforts to roll back progressive regulations pushed by the Obama administration. These comments can slow down the rulemaking process and potentially even make Trump era rules vulnerable to a court challenge. So if you are looking for a new way to resist Trump and all that he stands for, here’s what you need to know. What are regulations? Regulations are essentially a more granular type of law. After legislation makes its way through Congress and to the president’s desk for signature, it’s official. Then what? The legislative branch (Congress) makes the laws while the executive branch (the president plus the executive agencies) execute those laws. But legislation on a complicated issue doesn’t contain every detail the executive branch needs to fully execute the law. Executive agencies have to stay within the bounds of the laws passed by Congress and signed by the president, but they typically have quite a bit of discretion in how exactly they effectuate the law’s purpose. Let’s take an example law that lots of us know: the Endangered Species Act. The Act itself makes it federal law to identify and protect endangered species and their environments. The Act then gives the Department of the Interior — specifically a couple agencies within Interior, the United States Fish and Wildlife Service and the National Oceanic and Atmospheric Administration — the discretion to set standards and then determine what species or ecosystems are endangered. And the public can have a say in that! How are regulations created specifically? Not surprisingly, there’s a law that says it’s okay for agencies to make regulations — the Administrative Procedure Act (APA) enacted way back in 1946. The APA outlines some requirements for that process, federal rulemaking. First, regulations must be shared with the public before formal adoption. So once the agency has a draft of its proposed regulation, the draft is published in the Federal Register. But most importantly for today’s political climate, the agency also must allow the public to participate in rulemaking. In practice, this means that the public can comment on draft rules, and also review much of the information or data used by the agency to come up with the draft rule. Then the agency must consider to what the public says, especially when the public points out flaws in the agency’s reasoning or an unconsidered impact of the regulation. After every comment has been reviewed, the agency publishes its final, sometimes amended, rule in the Federal Register again, and it is codified through publication in the Code of Federal Regulations (CFR). (For the nerdier among you, more info about this whole process can be found here.) So where do you come in? If you want to comment on a draft regulation, then you need to know it’s out there and you need to know how to comment. Unfortunately, I haven’t found a clearinghouse for all proposed regulations that the left might care about. (Someone should get on that!) But at least for right now, the government has a great site (www.regulations.gov) that helps you find proposed regulations, including the ones receiving the most attention. On the front page is a “trending” list and a search function that allows you to search by topic. You can also browse “featured” regulations by topic, although there are no guarantees on how the featuring will continue to be done. The site makes it easy to comment with a click, and track what happens next. You can even search on the front page by topic. Many issue-focused organizations track the rulemaking process for their particular issues and even have platforms allowing individuals to submit public comments through the organization’s website. The Sierra Club set up a page for its supporters submit public comments, with sample language, related to the Dakota Access Pipeline’s (DAPL) Environmental Impact Study (EIS). (Environmental Impact Studies aren’t quite the same thing as regulations, but they follow a parallel notice and comment process with the public.) Comments are technically open on this the pipeline’s EIS, even though online commenting through regulations.gov is turned off. But because the notice period is open, the public still has to be given some way to submit comments — so if scroll down the EIS notice page a bit further you’ll find the email and snail mail addresses (under “Addresses”) where comments can be sent. Don’t forget that approach in the future even when you see a big “Comments Not Accepted” tag at the top of the page. All of this means it’s critical to sign up for the email lists for the organizations championing the causes most important to you. We can all get overwhelmed with requests to sign petitions, but watch out for calls to submit a comment about proposed regulations. That is a request to put your voice on the permanent record where — unlike petitions — it must be reviewed. And if you aren’t hearing about regulations from organizations, call those organizations and ask for the information. Ask for it to be part of their action alerts. What do you say in your comment? The same things that make a difference in any kind of discussion make a difference when it comes to comments. Facts, analysis, personal impact. The government currently has a list of tips available, which also will hopefully stick around, including: “When possible, support your comment with substantive data, facts, and/or expert opinions. You may also provide personal experience in your comment, as may be appropriate.” And here’s one that even conservatives should love: “Comments on the economic effects of rules that include quantitative and qualitative data are especially helpful.” Attractive short-term plans are often prohibitively expensive when considered from a long-term perspective. But like anything, the number of voices matters. More people speaking up just to say, “This is important,” means a better chance those voices get heard completely. And let’s face it, we’re going to see all kinds of critical issues tackled (or untackled) by agencies these next four years — climate change, food safety, clean water, net neutrality, healthcare access, workers’ wages. The list goes on and on. So let’s get started. Katherine Minarik is a lawyer based in Chicago. ", "title": "A simple guide to how you can throw sand in the Trump administration’s gears", "sentences": [{"e185": "A simple guide to how you can throw sand in the Trump administration’s gears"}, {"e3a1": "You can resist from the comfort of your own desk."}, {"7de6": "CREDIT: AP Photo/Evan Vucci"}, {"c1e9": "We’re just over a week into the Trump administration. For those of us hoping to push back, the flood of bad news and blatant lies have been overwhelming. We can push back, however. And we can push back in ways that actually make it harder for bad people to make bad law."}, {"4159": "If there is one action most of us have heard about from every progressive corner lately, it’s the “call your member of Congress” one. Tell your Senators not to confirm terrible nominees. Tell your member of Congress not to repeal Obamacare. But there’s another way law is made in Washington called “rulemaking.” And unlike members of Congress, who may choose to ignore your call, the people engaged in rulemaking actually have to listen to you if you complain about a proposed rule in the proper way."}, {"0376": "Many laws announce a broad policy goal, then instruct a federal agency to fill in the details of how this goal will be achieved. During the Obama administration, agencies made rules to fight global warming, to protect LGBT Americans, to expand the number of workers who receive overtime pay, and to allow women to obtain birth control without a co-payment. All of these rules, and more, are now in jeopardy thanks to the Trump administration."}, {"08fb": "Regulations are often the conservatives’ bogeyman, and the Trump administration has been eyeing certain regulations since the election. Make no mistake, many conservatives would like to undermine the rulemaking process entirely. But for now, it still exists. And conservatives intend to focus on dismantling the regulations they don’t like one by one. (Just days after the election, Breitbart bragged that net neutrality, currently protected by regulation, would be “dead” under Trump.) So liberals must go into protective mode."}, {"f822": "One way we can do that is by deluging the Trump administration with comments on their proposed rules — including their efforts to roll back progressive regulations pushed by the Obama administration. These comments can slow down the rulemaking process and potentially even make Trump era rules vulnerable to a court challenge. So if you are looking for a new way to resist Trump and all that he stands for, here’s what you need to know."}, {"0681": "What are regulations?"}, {"23e4": "Regulations are essentially a more granular type of law. After legislation makes its way through Congress and to the president’s desk for signature, it’s official. Then what? The legislative branch (Congress) makes the laws while the executive branch (the president plus the executive agencies) execute those laws. But legislation on a complicated issue doesn’t contain every detail the executive branch needs to fully execute the law. Executive agencies have to stay within the bounds of the laws passed by Congress and signed by the president, but they typically have quite a bit of discretion in how exactly they effectuate the law’s purpose."}, {"7528": "Let’s take an example law that lots of us know: the Endangered Species Act. The Act itself makes it federal law to identify and protect endangered species and their environments. The Act then gives the Department of the Interior — specifically a couple agencies within Interior, the United States Fish and Wildlife Service and the National Oceanic and Atmospheric Administration — the discretion to set standards and then determine what species or ecosystems are endangered. And the public can have a say in that!"}, {"1a65": "How are regulations created specifically?"}, {"9610": "Not surprisingly, there’s a law that says it’s okay for agencies to make regulations — the Administrative Procedure Act (APA) enacted way back in 1946. The APA outlines some requirements for that process, federal rulemaking. First, regulations must be shared with the public before formal adoption. So once the agency has a draft of its proposed regulation, the draft is published in the Federal Register."}, {"f859": "But most importantly for today’s political climate, the agency also must allow the public to participate in rulemaking. In practice, this means that the public can comment on draft rules, and also review much of the information or data used by the agency to come up with the draft rule. Then the agency must consider to what the public says, especially when the public points out flaws in the agency’s reasoning or an unconsidered impact of the regulation."}, {"4aac": "After every comment has been reviewed, the agency publishes its final, sometimes amended, rule in the Federal Register again, and it is codified through publication in the Code of Federal Regulations (CFR). (For the nerdier among you, more info about this whole process can be found here.)"}, {"ea1a": "So where do you come in?"}, {"d7f7": "If you want to comment on a draft regulation, then you need to know it’s out there and you need to know how to comment. Unfortunately, I haven’t found a clearinghouse for all proposed regulations that the left might care about. (Someone should get on that!) But at least for right now, the government has a great site (www.regulations.gov) that helps you find proposed regulations, including the ones receiving the most attention. On the front page is a “trending” list and a search function that allows you to search by topic. You can also browse “featured” regulations by topic, although there are no guarantees on how the featuring will continue to be done. The site makes it easy to comment with a click, and track what happens next. You can even search on the front page by topic."}, {"c638": "Many issue-focused organizations track the rulemaking process for their particular issues and even have platforms allowing individuals to submit public comments through the organization’s website. The Sierra Club set up a page for its supporters submit public comments, with sample language, related to the Dakota Access Pipeline’s (DAPL) Environmental Impact Study (EIS). (Environmental Impact Studies aren’t quite the same thing as regulations, but they follow a parallel notice and comment process with the public.) Comments are technically open on this the pipeline’s EIS, even though online commenting through regulations.gov is turned off. But because the notice period is open, the public still has to be given some way to submit comments — so if scroll down the EIS notice page a bit further you’ll find the email and snail mail addresses (under “Addresses”) where comments can be sent. Don’t forget that approach in the future even when you see a big “Comments Not Accepted” tag at the top of the page."}, {"2e61": "All of this means it’s critical to sign up for the email lists for the organizations championing the causes most important to you. We can all get overwhelmed with requests to sign petitions, but watch out for calls to submit a comment about proposed regulations. That is a request to put your voice on the permanent record where — unlike petitions — it must be reviewed. And if you aren’t hearing about regulations from organizations, call those organizations and ask for the information. Ask for it to be part of their action alerts."}, {"6e41": "What do you say in your comment?"}, {"dd56": "The same things that make a difference in any kind of discussion make a difference when it comes to comments. Facts, analysis, personal impact. The government currently has a list of tips available, which also will hopefully stick around, including: “When possible, support your comment with substantive data, facts, and/or expert opinions. You may also provide personal experience in your comment, as may be appropriate.” And here’s one that even conservatives should love: “Comments on the economic effects of rules that include quantitative and qualitative data are especially helpful.” Attractive short-term plans are often prohibitively expensive when considered from a long-term perspective."}, {"b81b": "But like anything, the number of voices matters. More people speaking up just to say, “This is important,” means a better chance those voices get heard completely. And let’s face it, we’re going to see all kinds of critical issues tackled (or untackled) by agencies these next four years — climate change, food safety, clean water, net neutrality, healthcare access, workers’ wages. The list goes on and on. So let’s get started."}, {"601f": "Katherine Minarik is a lawyer based in Chicago."}], "child": "1510_1\t1510_2\t1510_3\t1510_4\t1510_5\t1510_6\t1510_7\t1510_8\t1510_9\t1510_10\t1510_11\t1510_12\t1510_13\t1510_14\t1510_15\t1510_16\t1510_17\t1510_18\t1510_19\t1510_20\t1510_21\t1510_22\t1510_23\t1510_24\t1510_251510_1\t1510_2\t1510_3\t1510_4\t1510_5\t1510_6\t1510_7\t1510_8\t1510_9\t1510_10\t1510_11\t1510_12\t1510_13\t1510_14\t1510_15\t1510_16\t1510_17\t1510_18\t1510_19\t1510_20\t1510_21\t1510_22\t1510_23\t1510_24\t1510_25"}