{"name": "1515", "parent": "", "content": "Special Elections matter: here’s why It’s time to take lay the foundation for change On November 9, 2016, Democrats ceased to have majority representation in any branch of the Federal government. If progressives have any hope of evening the playing field, we need to start our local campaigns now. Republicans have always made state rights their rallying cry, and it is time that we start focusing on them as well. Now more than ever we need to ensure that our state politics represents and protects people’s interests. At a recent Democratic forum in Baltimore, Maryland, Connecticut Governor Dannel Malloy spoke about the importance of state legislatures and governorships in the upcoming 2020 census, when district maps will be adjusted to allow for proportional representation. Whoever is in control state-wide during this time will be able to create more favorable districts for maximizing the number of representatives from their party, a process known as gerrymandering. Over the past 10 years, Republicans have not only increased the number of states in their control, but have also been able to gerrymander districts to their advantage at all levels. During private meetings with his constituents, the sole Republican Representative in Maryland stated that he is not worried about loss of access to healthcare in the state. As a doctor, and a supporter of Trumpcare, he claimed that he was not concerned with plans to remove federal protections for patients because the Democratic state legislature has such a good record of taking care of its citizens. Ironically, if the state legislature no longer had a filibuster proof Democratic majority, his Republican colleagues in the state legislature, along with the Republican governor, would be sure to make cuts to programs that protect Maryland citizens. That state level elected officials are willing to take up the slack left by cuts to Federal programs is crucial. The founding fathers purposely put in checks and balances at the federal level. A president can do a lot of damage, but he also needs a willing congress and judicial branch of government. States were purposely given a lot of autonomy as well. By design, smaller or less populated states were a given a lot of extra say via the US Senate to ensure that they could maintain their rights. This has been both a blessing and a curse. While strongly progressive states are able to push for access to affordable healthcare and other progressive priorities locally, states divided or in largely Republican control have been left behind or have even regressed, passing laws such as blocking minimum wage hikes and discriminating against transgender and LGBT individuals. State government also allows for checks and balances within its own various branches: executive, judicial and legislative. In Maryland, for example, despite a Republican governor, a Democratic majority house recently gave increased authority to our Democratic attorney general to bring lawsuits without permission of the governor. Thus, he was able to join other states in battling the unconstitutional immigration ban in the courts. By engaging with state government and pushing for progressive change in any of the three branches, we are able, as progressives, to minimize regressive policies. City elections can determine what dog breeds you have, whether or not you can grow a garden in your yard, where you can park, how well local businesses do, even what color you can paint your house. Our liberties are made or broken in city hall. Engaging at the local level, with the counties and municipalities that are the backbone of our communities, is equally as important. Frankly, your city’s government is just as likely to impact your day to day life as the president or congress. Mayors and council members enact rules and ordinances that directly impact what you do. City elections can determine what dog breeds you have, whether or not you can grow a garden in your yard, where you can park, how well local businesses do, even what color you can paint your house. Our liberties are made or broken in city hall. Our highest aspirations start with a culture of caring in the lowest offices. At this level, a small number of people can make a huge impact. School boards and parent associations can promote a vision of inclusiveness and fairness in our schools. Citizens can join advisory committees to work with city and county officials to focus on environmentally friendly ways of doing business. Municipal elections are often completely ignored by most citizens, and a handful of votes can make the difference in a tight race. County races in my local area have had incumbents elected repeatedly with not a single challenger from the opposing party, despite nearly equal numbers of voters from both parties. Raising the level of engagement at this level could easily boost the presence and awareness of progressive ideals and policies, which in turn could affect statewide district elections and eventually our representation at the federal level. In a “post-feminism” era, we need to begin taking seriously the adage that the “personal is political.” In fact, personal involvement, whether it is participating in town hall meetings or canvassing and talking to your neighbors, is what we need most in today’s politics. With national leaders going down an uncertain path, more than ever we need face to face local discussions so that our citizens and politicians get to know each other personally. On a recent Saturday, my seven year old daughter and I sat down to chat with our US representative at his local district office. While we many not agree on certain policies and agendas, we made a personal connection talking about our family’s concerns, and he graciously insisted he would reply to my daughter’s hand-written note. Perhaps our representative will think twice about making decisions that affect us, now that he knows us personally. Edited by Katherine Sylwester and Garth Hughes-Odgers Special elections are condensed, low-turnout affairs that allow for surprise upsets. In special elections, the most organized local party tends to prevail. By paying attention to these races, Democrats can can begin rebuilding their electoral strength at the state and national level. Find out if you have an upcoming election in your district. upcoming electionsThese are the elections happening this year with seats that have a chance of being flipped or need to be protected.www.flippable.or ", "title": "Special Elections matter: here’s why", "sentences": [{"6cc7": "Special Elections matter: here’s why"}, {"e03a": "It’s time to take lay the foundation for change"}, {"f171": "On November 9, 2016, Democrats ceased to have majority representation in any branch of the Federal government. If progressives have any hope of evening the playing field, we need to start our local campaigns now. Republicans have always made state rights their rallying cry, and it is time that we start focusing on them as well. Now more than ever we need to ensure that our state politics represents and protects people’s interests."}, {"e071": "At a recent Democratic forum in Baltimore, Maryland, Connecticut Governor Dannel Malloy spoke about the importance of state legislatures and governorships in the upcoming 2020 census, when district maps will be adjusted to allow for proportional representation. Whoever is in control state-wide during this time will be able to create more favorable districts for maximizing the number of representatives from their party, a process known as gerrymandering. Over the past 10 years, Republicans have not only increased the number of states in their control, but have also been able to gerrymander districts to their advantage at all levels."}, {"9576": "During private meetings with his constituents, the sole Republican Representative in Maryland stated that he is not worried about loss of access to healthcare in the state. As a doctor, and a supporter of Trumpcare, he claimed that he was not concerned with plans to remove federal protections for patients because the Democratic state legislature has such a good record of taking care of its citizens. Ironically, if the state legislature no longer had a filibuster proof Democratic majority, his Republican colleagues in the state legislature, along with the Republican governor, would be sure to make cuts to programs that protect Maryland citizens. That state level elected officials are willing to take up the slack left by cuts to Federal programs is crucial."}, {"3d0c": "The founding fathers purposely put in checks and balances at the federal level. A president can do a lot of damage, but he also needs a willing congress and judicial branch of government. States were purposely given a lot of autonomy as well. By design, smaller or less populated states were a given a lot of extra say via the US Senate to ensure that they could maintain their rights. This has been both a blessing and a curse. While strongly progressive states are able to push for access to affordable healthcare and other progressive priorities locally, states divided or in largely Republican control have been left behind or have even regressed, passing laws such as blocking minimum wage hikes and discriminating against transgender and LGBT individuals."}, {"4d76": "State government also allows for checks and balances within its own various branches: executive, judicial and legislative. In Maryland, for example, despite a Republican governor, a Democratic majority house recently gave increased authority to our Democratic attorney general to bring lawsuits without permission of the governor. Thus, he was able to join other states in battling the unconstitutional immigration ban in the courts. By engaging with state government and pushing for progressive change in any of the three branches, we are able, as progressives, to minimize regressive policies."}, {"10cb": "City elections can determine what dog breeds you have, whether or not you can grow a garden in your yard, where you can park, how well local businesses do, even what color you can paint your house. Our liberties are made or broken in city hall."}, {"9af4": "Engaging at the local level, with the counties and municipalities that are the backbone of our communities, is equally as important. Frankly, your city’s government is just as likely to impact your day to day life as the president or congress. Mayors and council members enact rules and ordinances that directly impact what you do. City elections can determine what dog breeds you have, whether or not you can grow a garden in your yard, where you can park, how well local businesses do, even what color you can paint your house. Our liberties are made or broken in city hall."}, {"ad2e": "Our highest aspirations start with a culture of caring in the lowest offices. At this level, a small number of people can make a huge impact. School boards and parent associations can promote a vision of inclusiveness and fairness in our schools. Citizens can join advisory committees to work with city and county officials to focus on environmentally friendly ways of doing business. Municipal elections are often completely ignored by most citizens, and a handful of votes can make the difference in a tight race. County races in my local area have had incumbents elected repeatedly with not a single challenger from the opposing party, despite nearly equal numbers of voters from both parties. Raising the level of engagement at this level could easily boost the presence and awareness of progressive ideals and policies, which in turn could affect statewide district elections and eventually our representation at the federal level."}, {"565d": "In a “post-feminism” era, we need to begin taking seriously the adage that the “personal is political.” In fact, personal involvement, whether it is participating in town hall meetings or canvassing and talking to your neighbors, is what we need most in today’s politics. With national leaders going down an uncertain path, more than ever we need face to face local discussions so that our citizens and politicians get to know each other personally."}, {"feb6": "On a recent Saturday, my seven year old daughter and I sat down to chat with our US representative at his local district office. While we many not agree on certain policies and agendas, we made a personal connection talking about our family’s concerns, and he graciously insisted he would reply to my daughter’s hand-written note. Perhaps our representative will think twice about making decisions that affect us, now that he knows us personally."}, {"0db1": "Edited by Katherine Sylwester and Garth Hughes-Odgers"}, {"f815": "Special elections are condensed, low-turnout affairs that allow for surprise upsets. In special elections, the most organized local party tends to prevail. By paying attention to these races, Democrats can can begin rebuilding their electoral strength at the state and national level. Find out if you have an upcoming election in your district."}, {"572c": "upcoming electionsThese are the elections happening this year with seats that have a chance of being flipped or need to be protected.www.flippable.or"}], "child": "1515_11515_1"}