{"name": "1520", "parent": "", "content": "I went to Huddersfield to talk about local democracy for two days and haven’t stopped thinking about it since. (Photo: Anthony McKeown) Last month I went to my first Not Westminster event. I’ve blogged about the workshop we ran with my day job hat on here, but this is more of a personal reflection on the best (and only) 48 hours I’ve ever spent talking about local democracy. I found out about Not Westminster last year when I was still a councillor in Hackney, picking up on twitter that one of the workshops was focussing on a ‘failed’ licensing consultation that had recently taken place in the borough. I soon became immersed in the mine of information, slides, snippets and videos on the site — and came to appreciate (from afar) that this was a great group of people committed to bringing new ideas and energy to local democracy. I stood down as a councillor a few months later. After seven years, I needed a break (and my evenings back for the first time since my mid-twenties) but I didn’t stop caring about local government. This involves having fairly regular and unstructured thoughts along the lines of: There are so many good ideas, tips and tools for creative engagement between councils, councillors and residents — how do we make these the norm rather than the exception? What can we learn from examples of co-design that have worked in practice, and be bolder and braver in how we shape the future in local areas? I want a member of the public to go to their council website and understand what decisions are being made, and know exactly how they can get involved. Why are Full Council meetings so dull? I could go on. I’m now on the outside, which makes figuring out what contribution to sensibly make a bit harder. But one thing I’m certain about — Not Westminster has given me motivation and enthusiasm again at just the right time: “If we want a stronger local democracy we all need to get involved in making it happen.” I’m probably in the ‘ex-council folk finding it hard to let go’ category. Many Not Westminster 2017 participants have already blogged about the event, but I couldn’t resist a rather lengthy top ten: (Photo: Anthony McKeown) 1) Day 1 and designing practical experiments introduced me to the hack ethic and it’s liberating call to do rather than talk. Unfortunately, I love to think, write random things on post it notes, and then talk and think a bit more. But that didn’t matter! The group I was in focussed on how to make the policy process more engaging for residents — we built a shopping centre out of cardboard, dissected the policy cycle, and the questions that residents might have at different stages of difficult decisions. We clarified what the issue is, and ended with a willingness to explore what a one stop policy shop on a council website might look like in practice. That’s one thing on my list above ticked off already… 2) It’s really hard to build a structure out of spaghetti and balance a marshmellow on the top. However, for newcomers to the Not Westminster network, this was a lovely way to break down some initial barriers and start to get to know people. 3) One of my favourite ideas that came out of Day 1 was a video clip summarising council business. John produced a sample in an hour. I’ve always been a bit sceptical about live streaming council meetings, as having been present at far too many, I wonder who would willingly decide to watch one when there’s Netflix to compete with. However, I do appreciate the importance of transparency. The potential of the video summary is in communicating useful bits of information in a snappier and more accessible format, showing the people involved rather than an institution. (Photo: Anthony McKeown) 4) The Pecha Kucha format is brilliant. I loved the fact that I spent my Friday night sipping a craft ale and listening to the history of local government one minute, and a father’s conversation with his 14 year old daughter about local democracy the next. I might start doing all my presentations in the future as 20 x 20s slides. 5) I’d never been to Huddersfield before despite a large part of my grandfather’s side of the family having lived there. It has a fascinating heritage, and I discovered a very nice font whilst devising my own version of the radical walking tour. The Democracy Commission has engaged over 1000 local people in designing a healthy democracy for the future, which is all the evidence I need that there is something special happening in Kirklees. (Photo: Anthony McKeown) 6) On Day 2, Social Life took one of the workshops on a walk to understand the ‘feeling of a place’. We explored our reactions at three different points to understand the influence of the built environment. This is something that every councillor and officer working at neighbourhood level should do. You think you know your patch, but take the time, stop, think and listen and I guarantee you’ll notice something different. 7) As others have highlighted, if you do one thing after reading this, watch Emily Warrilow talk aboutJo Cox, 24 mins into the morning session here. This was about friendship, a tragedy and heartbreak — but also a political awakening. As one of the organisers tweeted, ‘If Emily is anything to go by, the future is bright’. (Photo: Anthony McKeown) 8) There were presentations on INLOGOV’s 21st Century Councillor research and DMU’s councillor commission. This work (and the emerging LGIU/Fawcett Local Government Commission) has helped restore my faith that the changing role of the councillor is now well documented and understood. But what do we do next to better support councillors in their roles? I get a bit frustrated when people say councillors need to embrace social media and communicate more effectively with residents. There’s so much more to it than that. 9) Did anyone have time to make use of the nap room? The day just flew past in a flurry of workshops, contributing to live notes, grabbing some sandwiches and staring at owls on a map to see where everyone had come from. 10) I want to continue to share (and borrow!) ideas and focus on what next. Thanks to everyone who organised Not Westminster. Talking about local democracy is beautiful. Just look at Anthony’s photos, and you’ll understand. ", "title": "I went to Huddersfield to talk about local democracy for two days and haven’t stopped thinking about it since.", "sentences": [{"5da9": "I went to Huddersfield to talk about local democracy for two days and haven’t stopped thinking about it since."}, {"9869": "(Photo: Anthony McKeown)"}, {"d3a8": "Last month I went to my first Not Westminster event. I’ve blogged about the workshop we ran with my day job hat on here, but this is more of a personal reflection on the best (and only) 48 hours I’ve ever spent talking about local democracy."}, {"3e31": "I found out about Not Westminster last year when I was still a councillor in Hackney, picking up on twitter that one of the workshops was focussing on a ‘failed’ licensing consultation that had recently taken place in the borough. I soon became immersed in the mine of information, slides, snippets and videos on the site — and came to appreciate (from afar) that this was a great group of people committed to bringing new ideas and energy to local democracy."}, {"9b89": "I stood down as a councillor a few months later. After seven years, I needed a break (and my evenings back for the first time since my mid-twenties) but I didn’t stop caring about local government. This involves having fairly regular and unstructured thoughts along the lines of:"}, {"8149": "There are so many good ideas, tips and tools for creative engagement between councils, councillors and residents — how do we make these the norm rather than the exception?"}, {"e5b9": "What can we learn from examples of co-design that have worked in practice, and be bolder and braver in how we shape the future in local areas?"}, {"3875": "I want a member of the public to go to their council website and understand what decisions are being made, and know exactly how they can get involved."}, {"4836": "Why are Full Council meetings so dull?"}, {"3713": "I could go on."}, {"5663": "I’m now on the outside, which makes figuring out what contribution to sensibly make a bit harder. But one thing I’m certain about — Not Westminster has given me motivation and enthusiasm again at just the right time: “If we want a stronger local democracy we all need to get involved in making it happen.” I’m probably in the ‘ex-council folk finding it hard to let go’ category."}, {"4b11": "Many Not Westminster 2017 participants have already blogged about the event, but I couldn’t resist a rather lengthy top ten:"}, {"1c19": "(Photo: Anthony McKeown)"}, {"2394": "1) Day 1 and designing practical experiments introduced me to the hack ethic and it’s liberating call to do rather than talk. Unfortunately, I love to think, write random things on post it notes, and then talk and think a bit more. But that didn’t matter! The group I was in focussed on how to make the policy process more engaging for residents — we built a shopping centre out of cardboard, dissected the policy cycle, and the questions that residents might have at different stages of difficult decisions. We clarified what the issue is, and ended with a willingness to explore what a one stop policy shop on a council website might look like in practice. That’s one thing on my list above ticked off already…"}, {"0b5e": "2) It’s really hard to build a structure out of spaghetti and balance a marshmellow on the top. However, for newcomers to the Not Westminster network, this was a lovely way to break down some initial barriers and start to get to know people."}, {"4358": "3) One of my favourite ideas that came out of Day 1 was a video clip summarising council business. John produced a sample in an hour. I’ve always been a bit sceptical about live streaming council meetings, as having been present at far too many, I wonder who would willingly decide to watch one when there’s Netflix to compete with. However, I do appreciate the importance of transparency. The potential of the video summary is in communicating useful bits of information in a snappier and more accessible format, showing the people involved rather than an institution."}, {"22d0": "(Photo: Anthony McKeown)"}, {"4bae": "4) The Pecha Kucha format is brilliant. I loved the fact that I spent my Friday night sipping a craft ale and listening to the history of local government one minute, and a father’s conversation with his 14 year old daughter about local democracy the next. I might start doing all my presentations in the future as 20 x 20s slides."}, {"0ea0": "5) I’d never been to Huddersfield before despite a large part of my grandfather’s side of the family having lived there. It has a fascinating heritage, and I discovered a very nice font whilst devising my own version of the radical walking tour. The Democracy Commission has engaged over 1000 local people in designing a healthy democracy for the future, which is all the evidence I need that there is something special happening in Kirklees."}, {"d14b": "(Photo: Anthony McKeown)"}, {"940a": "6) On Day 2, Social Life took one of the workshops on a walk to understand the ‘feeling of a place’. We explored our reactions at three different points to understand the influence of the built environment. This is something that every councillor and officer working at neighbourhood level should do. You think you know your patch, but take the time, stop, think and listen and I guarantee you’ll notice something different."}, {"6736": "7) As others have highlighted, if you do one thing after reading this, watch Emily Warrilow talk aboutJo Cox, 24 mins into the morning session here. This was about friendship, a tragedy and heartbreak — but also a political awakening. As one of the organisers tweeted, ‘If Emily is anything to go by, the future is bright’."}, {"e129": "(Photo: Anthony McKeown)"}, {"e14d": "8) There were presentations on INLOGOV’s 21st Century Councillor research and DMU’s councillor commission. This work (and the emerging LGIU/Fawcett Local Government Commission) has helped restore my faith that the changing role of the councillor is now well documented and understood. But what do we do next to better support councillors in their roles? I get a bit frustrated when people say councillors need to embrace social media and communicate more effectively with residents. There’s so much more to it than that."}, {"171f": "9) Did anyone have time to make use of the nap room? The day just flew past in a flurry of workshops, contributing to live notes, grabbing some sandwiches and staring at owls on a map to see where everyone had come from."}, {"b3b4": "10) I want to continue to share (and borrow!) ideas and focus on what next. Thanks to everyone who organised Not Westminster. Talking about local democracy is beautiful. Just look at Anthony’s photos, and you’ll understand."}], "child": "1520_1"}