{"name": "1522", "parent": "", "content": "Global finance, global tax -The Tobin tax — Here, we will try to find a way to ensure a real world-development. Today, the development of southern countries is organized by several global institutions which represent the interests of a few powers. The action of the United Nations is deeply dependent of the victorious powers of the World-War 2, notably by the weight of the Security Council and its oligarchic organization. The Bretton-Wood Institutions (BWI = IMF and World-Bank), which manage the South-debt, are also controlled by Western countries, with a higher weight of the United-States (veto by controlling 17.6% of votes). Therefore, any aid is tied aid and reproduce the global hierarchy. One way to ensure a more neutral and efficient development of the South is to democratize the global institutions. It would mean to give more financial independence to the United Nations, with own resources, and to create other sources of funding for the aid. In 1972, the American economist James Tobin proposed a Currency Transaction Tax (CTT) in order to stabilize the volatile world market and to increase the autonomy of the States. As he identified in the capitalist economist market a tendency to increase debt and speculation, leading to crises, poverty and further inequalities, his proposal of CTT would, first of all, soften these defects. As no national financial economy is devoid of any tax system, it would appear legitimate that the unifying global financial system would have a global tax system. With the expansion of foreign market, the CTT would also provide new solutions for debt and development. The CTT must be as low as possible to not block the investments and the expansion of foreign market. Without being a serious barrier for free-trade and implementing an equitable treatment of all economic actors, it could be the condition for a sustainable and durable economic system. Several scholars have proposed different systems to manage this CTT. For instance, Heikki Patomäki proposed the CTTOrganization: The proposal of a CTTO implementing and managing the “tobin tax” is advocated by many networked and North American coalitions. It is on the agenda of many parliaments in Europe, such as the European parliament. The first attempt to realize this CTT cannot be universal, as it would encounter the opposition of the actors who have the most interest to preserve the status quo, such as the United-States and the BWI. It would need at least the European Union to make the system global. Then, it would be followed by the southern countries. Finally, the globalization of the market would make it universal. However, as democratically managed, there is no guarantee that the funds would be used for global development. Also, the main targets within the financial system remain the tax havens, which would dodge the “tobin tax” as they have always done for the national taxes. The Currency Transaction Tax is not the only proposal to democratically contribute to global development. The authors have also proposed pollution taxes, arm sales tax, tax on telecommunications, etc. As many ideas to democratize the world governance and to contribute more efficiently to global development. FOLLOW POLITICAL ARENAS ON MEDIUM.COM FOLLOW POLITICAL ARENAS ON FACEBOOK.COM FOLLOW POLITICAL ARENAS ON TWITTER Heikki Patomäki, Teivo Teivainen, A Possible World: Democratic Transformation of Global Institutions, London, 2004. ", "title": "Global finance, global tax", "sentences": [{"990a": "Global finance, global tax"}, {"16a3": "-The Tobin tax —"}, {"7942": "Here, we will try to find a way to ensure a real world-development. Today, the development of southern countries is organized by several global institutions which represent the interests of a few powers. The action of the United Nations is deeply dependent of the victorious powers of the World-War 2, notably by the weight of the Security Council and its oligarchic organization. The Bretton-Wood Institutions (BWI = IMF and World-Bank), which manage the South-debt, are also controlled by Western countries, with a higher weight of the United-States (veto by controlling 17.6% of votes). Therefore, any aid is tied aid and reproduce the global hierarchy."}, {"e6e7": "One way to ensure a more neutral and efficient development of the South is to democratize the global institutions. It would mean to give more financial independence to the United Nations, with own resources, and to create other sources of funding for the aid."}, {"a628": "In 1972, the American economist James Tobin proposed a Currency Transaction Tax (CTT) in order to stabilize the volatile world market and to increase the autonomy of the States. As he identified in the capitalist economist market a tendency to increase debt and speculation, leading to crises, poverty and further inequalities, his proposal of CTT would, first of all, soften these defects."}, {"e1d9": "As no national financial economy is devoid of any tax system, it would appear legitimate that the unifying global financial system would have a global tax system. With the expansion of foreign market, the CTT would also provide new solutions for debt and development."}, {"f470": "The CTT must be as low as possible to not block the investments and the expansion of foreign market. Without being a serious barrier for free-trade and implementing an equitable treatment of all economic actors, it could be the condition for a sustainable and durable economic system. Several scholars have proposed different systems to manage this CTT. For instance, Heikki Patomäki proposed the CTTOrganization:"}, {"724b": "The proposal of a CTTO implementing and managing the “tobin tax” is advocated by many networked and North American coalitions. It is on the agenda of many parliaments in Europe, such as the European parliament. The first attempt to realize this CTT cannot be universal, as it would encounter the opposition of the actors who have the most interest to preserve the status quo, such as the United-States and the BWI. It would need at least the European Union to make the system global. Then, it would be followed by the southern countries. Finally, the globalization of the market would make it universal."}, {"ef92": "However, as democratically managed, there is no guarantee that the funds would be used for global development. Also, the main targets within the financial system remain the tax havens, which would dodge the “tobin tax” as they have always done for the national taxes."}, {"bd00": "The Currency Transaction Tax is not the only proposal to democratically contribute to global development. The authors have also proposed pollution taxes, arm sales tax, tax on telecommunications, etc. As many ideas to democratize the world governance and to contribute more efficiently to global development."}, {"d158": "FOLLOW POLITICAL ARENAS ON MEDIUM.COM"}, {"39c8": "FOLLOW POLITICAL ARENAS ON FACEBOOK.COM"}, {"22ca": "FOLLOW POLITICAL ARENAS ON TWITTER"}, {"b871": "Heikki Patomäki, Teivo Teivainen, A Possible World: Democratic Transformation of Global Institutions, London, 2004."}], "child": "1522_1"}