{"name": "1523", "parent": "", "content": "Sean Spicer praises Hitler for his restraint, falsely claims he never gassed his own people His comments echo Holocaust deniers. CREDIT: MSNBC screengrab During his Tuesday news conference, White House Press Secretary Sean Spicer compared Hitler favorably with Syrian President Bashar al-Assad. Referring to the recent sarin gas attack on Syrian civilians, Spicer said, “You had someone as despicable as Hitler, who didn’t even sink to using chemical weapons.” But it’s well established that millions of people died in Nazi gas chambers during World War II. Casting skepticism upon that fact is a hallmark of Holocaust deniers. Spicer’s comparison of Assad and Hitler comes on the heels of a number of right-wing sites doing the same. Later during his news conference, Spicer was given a chance to clarify his comments. But instead of backing down, he made things worse. “I think when you come to sarin gas, [Hitler] was not using the gas on his own people the same way that Assad is doing,” Spicer said. “He brought them into, um, the Holocaust center — I understand that. But I’m saying in the way Assad used them where he went into towns, dropped them down into the middle of towns, it was brought — the use of it — and I appreciate the clarification, that was not the intent.” Spicer’s “clarification” overlooked the fact that hundreds of thousands of Germans, at least, were killed in gas chambers by the Nazis. Spicer’s praise of Nazi Germany for its relative restraint in using chemical weapons comes less than two months after he clashed with the Anne Frank Center over whether President Trump’s belated condemnation of anti-Semitism was sufficient. During the early weeks of his presidency, Trump repeatedly passed up easy opportunities to denounce the surge in anti-Semitic violence that accompanied his campaign and ascension to the presidency. On January 27, Trump commemorated International Holocaust Remembrance Day with a statement that didn’t mention Jews or any other targeted group. That omission drew a rebuke from Jonathan Greenblatt, CEO of the Anti-Defamation League, which previously criticized Trump for playing upon anti-Semitic tropes during the campaign. Shortly after Spicer’s news conference wrapped up, the US Holocaust Museum appeared to subtweet Spicer by posting footage of what American forces saw when they liberated the largest concentration camp on German soil. UPDATE: As his remarks were received with widespread condemnation, Spicer released a statement representing another attempt to clarify what he said. But the hole keeps getting deeper. Spicer’s latest statement doesn’t explain why the distinction between “the tactic of using airplanes” and gas chambers matters. And by referring to Assad’s victims as “innocent people,” Spicer seems to be suggesting that Holocaust victims don’t fall into that category. UPDATE II: Spicer has released yet another statement in an attempt to walk back his remarks. It’s very similar to the previous one, but instead of using the term “innocent people” at the end, this time he opts for “population centers.” UPDATE III: For the third time in less than an hour, Spicer has released a new statement trying to walk back his praise of Hitler’s restraint when it comes to using chemical weapons. This one is the same as the second, but with this sentence added at the end: “Any attack on innocent people is reprehensible and inexcusable.” It makes one wonder: if all attacks on innocent people are inexcusable, then why was Spicer comparing Hitler and Assad in the first place? Meanwhile, the Anne Frank Center is calling for Spicer to be fired. UPDATE IV: During an appearance on Wolf Blitzer’s CNN show on Wednesday evening, Spicer finally stopped digging and offered a direct apology for his Hitler comments. But the press secretary gaffed during his apology by characterizing Trump’s military strike in Syria as an attempt to “destabilize the region.” “It was my blunder… and I came out to make sure that we stay focused on what the president is doing and his decisive action,” Spicer said. “I needed to make sure that I clarified and was not in any way, shape, or form any more of a distraction from the president’s decisive action in Syria and the attempts he is making to destabilize the region.” ", "title": "Sean Spicer praises Hitler for his restraint, falsely claims he never gassed his own people", "sentences": [{"45c2": "Sean Spicer praises Hitler for his restraint, falsely claims he never gassed his own people"}, {"e66a": "His comments echo Holocaust deniers."}, {"4037": "CREDIT: MSNBC screengrab"}, {"9463": "During his Tuesday news conference, White House Press Secretary Sean Spicer compared Hitler favorably with Syrian President Bashar al-Assad."}, {"d737": "Referring to the recent sarin gas attack on Syrian civilians, Spicer said, “You had someone as despicable as Hitler, who didn’t even sink to using chemical weapons.”"}, {"5f2c": "But it’s well established that millions of people died in Nazi gas chambers during World War II. Casting skepticism upon that fact is a hallmark of Holocaust deniers."}, {"24e4": "Spicer’s comparison of Assad and Hitler comes on the heels of a number of right-wing sites doing the same."}, {"4f40": "Later during his news conference, Spicer was given a chance to clarify his comments. But instead of backing down, he made things worse."}, {"835e": "“I think when you come to sarin gas, [Hitler] was not using the gas on his own people the same way that Assad is doing,” Spicer said. “He brought them into, um, the Holocaust center — I understand that. But I’m saying in the way Assad used them where he went into towns, dropped them down into the middle of towns, it was brought — the use of it — and I appreciate the clarification, that was not the intent.”"}, {"8028": "Spicer’s “clarification” overlooked the fact that hundreds of thousands of Germans, at least, were killed in gas chambers by the Nazis."}, {"51b6": "Spicer’s praise of Nazi Germany for its relative restraint in using chemical weapons comes less than two months after he clashed with the Anne Frank Center over whether President Trump’s belated condemnation of anti-Semitism was sufficient. During the early weeks of his presidency, Trump repeatedly passed up easy opportunities to denounce the surge in anti-Semitic violence that accompanied his campaign and ascension to the presidency."}, {"cf51": "On January 27, Trump commemorated International Holocaust Remembrance Day with a statement that didn’t mention Jews or any other targeted group. That omission drew a rebuke from Jonathan Greenblatt, CEO of the Anti-Defamation League, which previously criticized Trump for playing upon anti-Semitic tropes during the campaign."}, {"e27c": "Shortly after Spicer’s news conference wrapped up, the US Holocaust Museum appeared to subtweet Spicer by posting footage of what American forces saw when they liberated the largest concentration camp on German soil."}, {"9ede": "UPDATE: As his remarks were received with widespread condemnation, Spicer released a statement representing another attempt to clarify what he said."}, {"aab0": "But the hole keeps getting deeper."}, {"e8b0": "Spicer’s latest statement doesn’t explain why the distinction between “the tactic of using airplanes” and gas chambers matters. And by referring to Assad’s victims as “innocent people,” Spicer seems to be suggesting that Holocaust victims don’t fall into that category."}, {"540d": "UPDATE II: Spicer has released yet another statement in an attempt to walk back his remarks. It’s very similar to the previous one, but instead of using the term “innocent people” at the end, this time he opts for “population centers.”"}, {"d005": "UPDATE III: For the third time in less than an hour, Spicer has released a new statement trying to walk back his praise of Hitler’s restraint when it comes to using chemical weapons."}, {"2cf4": "This one is the same as the second, but with this sentence added at the end: “Any attack on innocent people is reprehensible and inexcusable.”"}, {"72a6": "It makes one wonder: if all attacks on innocent people are inexcusable, then why was Spicer comparing Hitler and Assad in the first place?"}, {"398a": "Meanwhile, the Anne Frank Center is calling for Spicer to be fired."}, {"6163": "UPDATE IV: During an appearance on Wolf Blitzer’s CNN show on Wednesday evening, Spicer finally stopped digging and offered a direct apology for his Hitler comments."}, {"c45e": "But the press secretary gaffed during his apology by characterizing Trump’s military strike in Syria as an attempt to “destabilize the region.”"}, {"8fb5": "“It was my blunder… and I came out to make sure that we stay focused on what the president is doing and his decisive action,” Spicer said. “I needed to make sure that I clarified and was not in any way, shape, or form any more of a distraction from the president’s decisive action in Syria and the attempts he is making to destabilize the region.”"}], "child": "1523_1\t1523_2\t1523_3\t1523_4\t1523_5\t1523_6\t1523_7\t1523_8\t1523_9\t1523_10\t1523_11\t1523_12\t1523_13\t1523_14\t1523_15\t1523_16\t1523_17\t1523_18\t1523_19\t1523_20\t1523_21\t1523_22\t1523_23\t1523_24\t1523_251523_1\t1523_2\t1523_3\t1523_4\t1523_5\t1523_6\t1523_7\t1523_8\t1523_9\t1523_10\t1523_11\t1523_12\t1523_13\t1523_14\t1523_15\t1523_16\t1523_17\t1523_18\t1523_19\t1523_20\t1523_21\t1523_22\t1523_23\t1523_24\t1523_251523_1\t1523_2\t1523_3\t1523_4\t1523_5\t1523_6\t1523_7\t1523_8\t1523_9\t1523_10\t1523_11\t1523_12\t1523_13\t1523_14\t1523_15\t1523_16\t1523_17\t1523_18\t1523_19\t1523_20\t1523_21\t1523_22\t1523_23\t1523_24\t1523_251523_1\t1523_2\t1523_3\t1523_4\t1523_5\t1523_6\t1523_7\t1523_8\t1523_9\t1523_10\t1523_11\t1523_12\t1523_13\t1523_14\t1523_15\t1523_16\t1523_17\t1523_18\t1523_19\t1523_20\t1523_21\t1523_22\t1523_23\t1523_24\t1523_251523_1\t1523_2\t1523_3\t1523_4\t1523_5\t1523_6\t1523_7\t1523_8\t1523_9\t1523_10\t1523_11\t1523_12\t1523_13\t1523_14\t1523_15\t1523_16\t1523_17\t1523_18\t1523_19\t1523_20\t1523_21\t1523_22\t1523_23\t1523_24\t1523_25"}