{"name": "1524", "parent": "", "content": "139 lawmakers support Trump’s refugee ban and also support bombing Syria Most of them said they supported the bombing for humanitarian reasons. By Adrienne Mahsa Varkiani, Laurel Raymond, Diana Ofosu, and Joshua Eaton Last week, President Donald Trump ordered a missile strike on a Syrian airbase after Syrian dictator Bashar al-Assad killed civilians with chemical weapons. The Turkish health ministry, after examining victims of the Assad regime’s attack, confirmed that it was carried out with the banned nerve agent Sarin. Syrian Opposition health officials and humanitarian groups on the ground estimated the death toll at 70–100 people. Many of the dead were children. Trump cited their deaths repeatedly while explaining his decision to attack the Assad regime. “Assad choked out the lives of helpless men, women, and children. It was a slow and brutal death for so many,” he said, according to press pool reports. “Even beautiful babies were cruelly murdered at this very barbaric attack. No child of God should ever suffer such horror.” The president ordered the attack from Mar-A-Lago, his private club in Florida, and could not stream his comments due to technical restrictions. But Trump — much like the lawmakers now publicly praising his decision to retaliate against Assad — has not always displayed this level of concern for the people suffering over the course of Syria’s six-year war. Trump has tried, twice, to stop Syrians from entering the United States. In the first version of his Muslim ban executive order, he temporarily suspended visas for Syrian citizens and suspended Syrian refugee resettlement indefinitely. After that ban was struck down by the courts, he tried once more, again suspending visas and refugee resettlement for Syrians. Trump apparently doesn’t see a contradiction between condemning Assad’s brutality and turning away those who flee it. And he’s not the only one. Many lawmakers in Congress rushed to condemn Assad’s latest attack and applaud Trump’s action — while also supporting Trump’s proposal to ban all Syrian refugees from the United States. ThinkProgress reviewed the statements of every member of Congress to gather their previous statements on Trump’s Muslim ban, as well as their recent responses to the Sarin attack and Trump’s retaliatory airstrikes. 139 members of Congress expressed support for at least one version of Trump’s ban as well as for his airstrikes on the Assad regime’s al-Shayrat airbase last week. An additional 28 members of Congress did not make clear statements on Trump’s ban, but supported his airstrikes. The vast majority of those who applauded the bombings did so as a measured response to a humanitarian tragedy, and did not acknowledge the hypocrisy in simultaneously backing a ban on refugees fleeing a war zone. Take Rep. Dennis Ross (R-FL), who tweeted this on Thursday: But when Trump proposed to ban Syrian refugees — including those babies and children —Ross called it “long overdue.” Or Rep. Steve Knight (R-CA), who said in a statement last Thursday that “time and again, Bashar al-Assad has proven to be monstrously cruel to his own people. This recent sarin gas attack is further evidence that his disregard for international law and human decency has no place in the modern world.” In January, Knight came out in support of Trump’s ban. And in 2015, when President Obama proposed increasing the United States’ intake of Syrian refugees, Knight called it an “existential” question that went against “the best interest of the American people.” Rep. Jacki Walorski (R-IN), tweeted that “tonight’s U.S. military airstrikes on targets in Syria send a clear message that America will not stand for such atrocities.” In 2015, she commended then-Governor Mike Pence for suspending the resettlement of Syrian refugees to Indiana. There’s also Rep. Steve Scalise (R-LA), who tweeted Friday morning, “The United States sent a clear message that we will not tolerate the slaughter of innocent citizens by the Assad regime.” While defending the Muslim ban on CNN in January, he specifically called it the “Syria ban.” ThinkProgress only looked at members of Congress who supported or did not make clear statements condemning Trump’s ban on refugees. Both versions of his ban call for a 120 day suspension of all refugee resettlement, as well as a 90 day ban on visas for Syrian nationals. We focused on the responses to Trump’s recent ban, because while the courts have temporarily halted the latest ban, it may still become reality. The number of Congress members who have previously expressed broad support for halting Syrian refugees and also supported Trump’s recent airstrikes is likely far higher. In 2015, 289 Representatives voted to toughen the already rigorous screening for refugees from Iraq and Syria. Under the bill, refugees would only be allowed to enter the country if the FBI, Department of Homeland Security, and Director of National Intelligence all agreed that a refugee posed no threat to the United States, which would make entry nearly impossible. The bill’s supporters included 47 Democrats, and vocal backers of Assad, like Rep. Tulsi Gabbard (D-HI). A number of Senators, including Mitch McConnell (R-KY) and Heidi Heitkamp (D-ND), also expressed support for the tougher screening progress. Many of these members of Congress also expressed support for Trump’s airstrikes in Syria. Speaking to press in Mar-A-Lago last Thursday, Sean Spicer attempted to reconcile Trump’s stance on Syrian refugees with his framing of the attack on Assad as humanitarian, saying that Trump supports setting up “safe zones” so that Syrians can safely stay in their country. Trump has never given details as to how he would actually set up such safe zones, nor has he made them a policy priority for his administration. His administration’s foreign policy approach towards Syria is still largely incoherent, and he is still looking to ban Syrian refugees from the United States. You can see ThinkProgress’ full data and links to the lawmakers’ statements set here. The list of the lawmakers who support both a version of the Muslim ban and the airstrikes — the vast majority of whom couched their support in terms of humanitarian outrage — is as follows: Alabama Sen. Richard Shelby Sen. Luther Strange Rep. Bradley Byrne Rep. Roger Aderholt Alaska Sen. Dan Sullivan Rep. Don Young Arizona Sen. John McCain Rep. Martha McSally Rep. Andy Biggs Rep. Trent Franks Arkansas Sen. John Boozman Sen. Tom Cotton Rep. French Hill Rep. Steve Womack Rep. Bruce Westerman California Rep. Doug LaMalfa Rep. Kevin McCarthy Rep. Steve Knight Rep. Ed Royce Rep. Ken Calvert Rep. Darrell Issa Rep. Paul Cook Colorado Sen. Cory Gardner Rep. Doug Lamborn Florida Rep. Matt Gaetz Rep. Dennis Ross Rep. Vern Buchanan Rep. Brian Mast Rep. Francis Rooney Rep. Neal Dunn Rep. Mario Díaz-Balart Rep. Carlos Curbelo Rep. Ted Yoho Rep. John Rutherford Georgia Sen. David Perdue Sen. Johnny Isakson Rep. Buddy Carter Rep. Barry Loudermilk Rep. Drew Ferguson Rep. Doug Collins Illinois Rep. Mike Bost Rep. Rodney Davis Rep. Darin LaHood Indiana Rep. Jackie Walorski Rep. Todd Rokita Rep. Luke Messer Rep. Larry Bucshon Iowa Sen. Chuck Grassley Rep. Rod Blum Rep. Steve King Kansas Rep. Roger Marshall Kentucky Rep. Andy Barr Louisiana Sen. John N. Kennedy Rep. Steve Scalise Rep. Clay Higgins Rep. Mike Johnson Rep. Ralph Abraham Rep. Garret Graves Maine Sen. Susan Collins Rep. Bruce Poliquin Maryland Rep. Andy Harris Michigan Rep. Jack Bergman Rep. Paul Mitchell Rep. David Trott Rep. Tim Walberg Mississippi Rep. Trent Kelly Missouri Sen. Roy Blunt Rep. Vicky Hartzler Rep. Sam Graves Montana Sen. Steve Daines Nebraska Sen. Deb Fischer Rep. Jeff Fortenberry Rep. Don Bacon New Jersey Rep. Frank LoBiondo Rep. Tom MacArthur Rep. Chris Smith Rep. Leonard Lance New York Rep. Lee Zeldin Rep. John Faso Rep. Peter King Rep. Claudia Tenney Rep. Tom Reed Rep. John Katko Rep. Chris Collins North Carolina Sen. Thom Tillis Rep. Ted Budd Rep. Mark Walker Rep. David Rouzer Ohio Rep. Brad Wenstrup Rep. Bill Johnson Oklahoma Sen. Jim Inhofe Rep. Tom Cole Pennsylvania Sen. Pat Toomey Rep. Lou Barletta Rep. Lloyd Smucker Rep. Mike Kelly Rep. Scott Perry Rep. Bill Shuster South Carolina Sen. Lindsey Graham Rep. Joe Wilson Rep. Jeff Duncan South Dakota Rep. Mike Rounds Tennessee Sen. Bob Corker Sen. Lamar Alexander Rep. Phil Roe Rep. Jimmy Duncan Rep. Chuck Fleischmann Rep. Diane Black Rep. David Kustoff Texas Rep. Louie Gohmert Rep. Kay Granger Rep. Jodey Arrington Rep. Ted Poe Rep. Lamar S. Smith Rep. Pete Olson Rep. Roger Williams Rep. Michael Burgess Rep. Blake Farenthold Rep. Pete Sessions Rep. Brian Babin Rep. John Ratcliffe Rep. Jeb Hensarling Rep. John Culberson Rep. Kevin Brady Utah Sen. Orrin Hatch Rep. Chris Stewart Rep. Jason Chaffetz Rep. Mia Love Virginia Rep. Rob Wittman Rep. Scott Taylor Rep. Dave Brat Washington Rep. Cathy McMorris Rodgers West Virginia Sen. Shelley Moore Capito Rep. David McKinley Rep. Alex Mooney Wisconsin Sen. Ron Johnson Rep. Paul Ryan Rep. Glenn Grothman Wyoming Rep. Liz Cheney ", "title": "139 lawmakers support Trump’s refugee ban and also support bombing Syria", "sentences": [{"773a": "139 lawmakers support Trump’s refugee ban and also support bombing Syria"}, {"e576": "Most of them said they supported the bombing for humanitarian reasons."}, {"c107": "By Adrienne Mahsa Varkiani, Laurel Raymond, Diana Ofosu, and Joshua Eaton"}, {"dab1": "Last week, President Donald Trump ordered a missile strike on a Syrian airbase after Syrian dictator Bashar al-Assad killed civilians with chemical weapons."}, {"694a": "The Turkish health ministry, after examining victims of the Assad regime’s attack, confirmed that it was carried out with the banned nerve agent Sarin. Syrian Opposition health officials and humanitarian groups on the ground estimated the death toll at 70–100 people. Many of the dead were children."}, {"8955": "Trump cited their deaths repeatedly while explaining his decision to attack the Assad regime."}, {"c18f": "“Assad choked out the lives of helpless men, women, and children. It was a slow and brutal death for so many,” he said, according to press pool reports. “Even beautiful babies were cruelly murdered at this very barbaric attack. No child of God should ever suffer such horror.”"}, {"5c49": "The president ordered the attack from Mar-A-Lago, his private club in Florida, and could not stream his comments due to technical restrictions."}, {"08b1": "But Trump — much like the lawmakers now publicly praising his decision to retaliate against Assad — has not always displayed this level of concern for the people suffering over the course of Syria’s six-year war."}, {"ec68": "Trump has tried, twice, to stop Syrians from entering the United States. In the first version of his Muslim ban executive order, he temporarily suspended visas for Syrian citizens and suspended Syrian refugee resettlement indefinitely. After that ban was struck down by the courts, he tried once more, again suspending visas and refugee resettlement for Syrians."}, {"43e5": "Trump apparently doesn’t see a contradiction between condemning Assad’s brutality and turning away those who flee it. And he’s not the only one. Many lawmakers in Congress rushed to condemn Assad’s latest attack and applaud Trump’s action — while also supporting Trump’s proposal to ban all Syrian refugees from the United States."}, {"2acc": "ThinkProgress reviewed the statements of every member of Congress to gather their previous statements on Trump’s Muslim ban, as well as their recent responses to the Sarin attack and Trump’s retaliatory airstrikes."}, {"a123": "139 members of Congress expressed support for at least one version of Trump’s ban as well as for his airstrikes on the Assad regime’s al-Shayrat airbase last week. An additional 28 members of Congress did not make clear statements on Trump’s ban, but supported his airstrikes."}, {"8aef": "The vast majority of those who applauded the bombings did so as a measured response to a humanitarian tragedy, and did not acknowledge the hypocrisy in simultaneously backing a ban on refugees fleeing a war zone."}, {"abf8": "Take Rep. Dennis Ross (R-FL), who tweeted this on Thursday:"}, {"3522": "But when Trump proposed to ban Syrian refugees — including those babies and children —Ross called it “long overdue.”"}, {"d9da": "Or Rep. Steve Knight (R-CA), who said in a statement last Thursday that “time and again, Bashar al-Assad has proven to be monstrously cruel to his own people. This recent sarin gas attack is further evidence that his disregard for international law and human decency has no place in the modern world.”"}, {"d52c": "In January, Knight came out in support of Trump’s ban. And in 2015, when President Obama proposed increasing the United States’ intake of Syrian refugees, Knight called it an “existential” question that went against “the best interest of the American people.”"}, {"7ead": "Rep. Jacki Walorski (R-IN), tweeted that “tonight’s U.S. military airstrikes on targets in Syria send a clear message that America will not stand for such atrocities.” In 2015, she commended then-Governor Mike Pence for suspending the resettlement of Syrian refugees to Indiana."}, {"6388": "There’s also Rep. Steve Scalise (R-LA), who tweeted Friday morning, “The United States sent a clear message that we will not tolerate the slaughter of innocent citizens by the Assad regime.” While defending the Muslim ban on CNN in January, he specifically called it the “Syria ban.”"}, {"21c1": "ThinkProgress only looked at members of Congress who supported or did not make clear statements condemning Trump’s ban on refugees. Both versions of his ban call for a 120 day suspension of all refugee resettlement, as well as a 90 day ban on visas for Syrian nationals. We focused on the responses to Trump’s recent ban, because while the courts have temporarily halted the latest ban, it may still become reality."}, {"1d31": "The number of Congress members who have previously expressed broad support for halting Syrian refugees and also supported Trump’s recent airstrikes is likely far higher. In 2015, 289 Representatives voted to toughen the already rigorous screening for refugees from Iraq and Syria. Under the bill, refugees would only be allowed to enter the country if the FBI, Department of Homeland Security, and Director of National Intelligence all agreed that a refugee posed no threat to the United States, which would make entry nearly impossible. The bill’s supporters included 47 Democrats, and vocal backers of Assad, like Rep. Tulsi Gabbard (D-HI). A number of Senators, including Mitch McConnell (R-KY) and Heidi Heitkamp (D-ND), also expressed support for the tougher screening progress. Many of these members of Congress also expressed support for Trump’s airstrikes in Syria."}, {"c31d": "Speaking to press in Mar-A-Lago last Thursday, Sean Spicer attempted to reconcile Trump’s stance on Syrian refugees with his framing of the attack on Assad as humanitarian, saying that Trump supports setting up “safe zones” so that Syrians can safely stay in their country."}, {"ac66": "Trump has never given details as to how he would actually set up such safe zones, nor has he made them a policy priority for his administration. His administration’s foreign policy approach towards Syria is still largely incoherent, and he is still looking to ban Syrian refugees from the United States."}, {"891f": "You can see ThinkProgress’ full data and links to the lawmakers’ statements set here."}, {"5bab": "The list of the lawmakers who support both a version of the Muslim ban and the airstrikes — the vast majority of whom couched their support in terms of humanitarian outrage — is as follows:"}, {"2f01": "Alabama"}, {"deaf": "Sen. Richard Shelby"}, {"6a37": "Sen. Luther Strange"}, {"c40f": "Rep. Bradley Byrne"}, {"752c": "Rep. Roger Aderholt"}, {"c5bc": "Alaska"}, {"46b9": "Sen. Dan Sullivan"}, {"8f16": "Rep. Don Young"}, {"d6a7": "Arizona"}, {"06a3": "Sen. John McCain"}, {"7d45": "Rep. Martha McSally"}, {"a24c": "Rep. Andy Biggs"}, {"f87b": "Rep. Trent Franks"}, {"0d04": "Arkansas"}, {"ad87": "Sen. John Boozman"}, {"1726": "Sen. Tom Cotton"}, {"3ae4": "Rep. French Hill"}, {"410d": "Rep. Steve Womack"}, {"7eff": "Rep. Bruce Westerman"}, {"8668": "California"}, {"bcf3": "Rep. Doug LaMalfa"}, {"5643": "Rep. Kevin McCarthy"}, {"f680": "Rep. Steve Knight"}, {"c01b": "Rep. Ed Royce"}, {"fc2c": "Rep. Ken Calvert"}, {"981b": "Rep. Darrell Issa"}, {"f266": "Rep. Paul Cook"}, {"a2cb": "Colorado"}, {"0fe1": "Sen. Cory Gardner"}, {"5310": "Rep. Doug Lamborn"}, {"06bb": "Florida"}, {"6dde": "Rep. Matt Gaetz"}, {"40e7": "Rep. Dennis Ross"}, {"0b96": "Rep. Vern Buchanan"}, {"b640": "Rep. Brian Mast"}, {"503c": "Rep. Francis Rooney"}, {"6b25": "Rep. Neal Dunn"}, {"4943": "Rep. Mario Díaz-Balart"}, {"a45e": "Rep. Carlos Curbelo"}, {"c4d3": "Rep. Ted Yoho"}, {"7d81": "Rep. John Rutherford"}, {"07b9": "Georgia"}, {"de3a": "Sen. David Perdue"}, {"40cf": "Sen. Johnny Isakson"}, {"d105": "Rep. Buddy Carter"}, {"d23a": "Rep. Barry Loudermilk"}, {"cbea": "Rep. Drew Ferguson"}, {"de57": "Rep. Doug Collins"}, {"94be": "Illinois"}, {"2ff3": "Rep. Mike Bost"}, {"c933": "Rep. Rodney Davis"}, {"f36e": "Rep. Darin LaHood"}, {"1ccc": "Indiana"}, {"d671": "Rep. Jackie Walorski"}, {"b7a6": "Rep. Todd Rokita"}, {"fdcf": "Rep. Luke Messer"}, {"1217": "Rep. Larry Bucshon"}, {"fc98": "Iowa"}, {"4d17": "Sen. Chuck Grassley"}, {"8535": "Rep. Rod Blum"}, {"b1e8": "Rep. Steve King"}, {"ff7d": "Kansas"}, {"bf70": "Rep. Roger Marshall"}, {"5d65": "Kentucky"}, {"4e8e": "Rep. Andy Barr"}, {"96e0": "Louisiana"}, {"56a0": "Sen. John N. Kennedy"}, {"4ca0": "Rep. Steve Scalise"}, {"faf8": "Rep. Clay Higgins"}, {"0646": "Rep. Mike Johnson"}, {"93ba": "Rep. Ralph Abraham"}, {"281a": "Rep. Garret Graves"}, {"efd0": "Maine"}, {"d60e": "Sen. Susan Collins"}, {"408c": "Rep. Bruce Poliquin"}, {"f761": "Maryland"}, {"2d96": "Rep. Andy Harris"}, {"3399": "Michigan"}, {"a6ba": "Rep. Jack Bergman"}, {"e683": "Rep. Paul Mitchell"}, {"1c23": "Rep. David Trott"}, {"82a7": "Rep. Tim Walberg"}, {"a674": "Mississippi"}, {"4d8a": "Rep. Trent Kelly"}, {"2c42": "Missouri"}, {"08b7": "Sen. Roy Blunt"}, {"5404": "Rep. Vicky Hartzler"}, {"fbdd": "Rep. Sam Graves"}, {"9939": "Montana"}, {"029e": "Sen. Steve Daines"}, {"6d64": "Nebraska"}, {"b7ac": "Sen. Deb Fischer"}, {"d6ec": "Rep. Jeff Fortenberry"}, {"b6dd": "Rep. Don Bacon"}, {"e69e": "New Jersey"}, {"e4ad": "Rep. Frank LoBiondo"}, {"9fe1": "Rep. Tom MacArthur"}, {"31a0": "Rep. Chris Smith"}, {"a92b": "Rep. Leonard Lance"}, {"a912": "New York"}, {"7add": "Rep. Lee Zeldin"}, {"6d1d": "Rep. John Faso"}, {"115f": "Rep. Peter King"}, {"823d": "Rep. Claudia Tenney"}, {"519a": "Rep. Tom Reed"}, {"1404": "Rep. John Katko"}, {"4951": "Rep. Chris Collins"}, {"451d": "North Carolina"}, {"a4e2": "Sen. Thom Tillis"}, {"3b23": "Rep. Ted Budd"}, {"af74": "Rep. Mark Walker"}, {"d4aa": "Rep. David Rouzer"}, {"d2e7": "Ohio"}, {"3a80": "Rep. Brad Wenstrup"}, {"6e71": "Rep. Bill Johnson"}, {"7fb3": "Oklahoma"}, {"39ed": "Sen. Jim Inhofe"}, {"cf98": "Rep. Tom Cole"}, {"e242": "Pennsylvania"}, {"17fb": "Sen. Pat Toomey"}, {"5556": "Rep. Lou Barletta"}, {"cbf4": "Rep. Lloyd Smucker"}, {"d63c": "Rep. Mike Kelly"}, {"e8e5": "Rep. Scott Perry"}, {"deef": "Rep. Bill Shuster"}, {"39c2": "South Carolina"}, {"1b96": "Sen. Lindsey Graham"}, {"0e6a": "Rep. Joe Wilson"}, {"a996": "Rep. Jeff Duncan"}, {"96bd": "South Dakota"}, {"bcfc": "Rep. Mike Rounds"}, {"544c": "Tennessee"}, {"63c8": "Sen. Bob Corker"}, {"4e54": "Sen. Lamar Alexander"}, {"3670": "Rep. Phil Roe"}, {"bac0": "Rep. Jimmy Duncan"}, {"76db": "Rep. Chuck Fleischmann"}, {"8d87": "Rep. Diane Black"}, {"9eba": "Rep. David Kustoff"}, {"a0d4": "Texas"}, {"6dc5": "Rep. Louie Gohmert"}, {"92f2": "Rep. Kay Granger"}, {"d108": "Rep. Jodey Arrington"}, {"c565": "Rep. Ted Poe"}, {"b4cb": "Rep. Lamar S. Smith"}, {"fda5": "Rep. Pete Olson"}, {"4d84": "Rep. Roger Williams"}, {"3bbe": "Rep. Michael Burgess"}, {"6162": "Rep. Blake Farenthold"}, {"8bc9": "Rep. Pete Sessions"}, {"203d": "Rep. Brian Babin"}, {"d474": "Rep. John Ratcliffe"}, {"235f": "Rep. Jeb Hensarling"}, {"22fc": "Rep. John Culberson"}, {"cb7d": "Rep. Kevin Brady"}, {"77a1": "Utah"}, {"406c": "Sen. Orrin Hatch"}, {"ec41": "Rep. Chris Stewart"}, {"1316": "Rep. Jason Chaffetz"}, {"a633": "Rep. Mia Love"}, {"69fa": "Virginia"}, {"b70b": "Rep. Rob Wittman"}, {"80d2": "Rep. Scott Taylor"}, {"e7c6": "Rep. Dave Brat"}, {"bffe": "Washington"}, {"ab0a": "Rep. Cathy McMorris Rodgers"}, {"8b86": "West Virginia"}, {"fb17": "Sen. Shelley Moore Capito"}, {"5886": "Rep. David McKinley"}, {"24f5": "Rep. Alex Mooney"}, {"01be": "Wisconsin"}, {"82a4": "Sen. Ron Johnson"}, {"5830": "Rep. Paul Ryan"}, {"e97f": "Rep. Glenn Grothman"}, {"c551": "Wyoming"}, {"8e6e": "Rep. Liz Cheney"}], "child": "1524_1\t1524_2\t1524_3"}