{"name": "1525", "parent": "", "content": "New military adviser Ivanka Trump reportedly convinced her father to bomb Syria “I’m sure she said: ‘Listen, this is horrible stuff.’” In this file photo made from the footage taken from Russian Defense Ministry official web site Friday, April 7, 2017, an aerial view shows shelters for aircraft at a Syrian airbase after it was hit by US strike in Syria. CREDIT: (Russian Defense Ministry Press Service Photo via AP, File) Ivanka Trump — an official government employee without military experience but with her own White House office— reportedly influenced President Donald Trump’s decision to strike against Syrian dictator Bashar al-Assad last week, according to her brother Eric Trump. Trump authorized a U.S. missile attack on a Syrian airbase on Friday in response to a chemical weapons attack allegedly committed by the Assad regime that killed scores of people, including more than 30 children. “Ivanka is a mother of three kids and she has influence. I’m sure she said: ‘Listen, this is horrible stuff,’” Eric Trump told The Telegraph. “My father will act in times like that,” Eric Trump added. “And by the way, he was anti doing anything with Syria two years ago. Then a leader gasses their own people, women and children. At some point America is the global leader and the world’s superpower has to come forward and act and they did with a lot of support of our allies and I think that’s a great thing.” Eric Trump, the 33-year-old son of the president, told the publication that his father had been “deeply affected” by photos of chemically-burned children being sprayed down in the wake of the attack. “It was horrible,” Eric Trump said. “These guys are savages and I’m glad he responded the way he responded.” Ivanka’s ability to influence her father on a U.S.-authorized military air strike that itself reportedly killed four children has been condoned by the Trump family. Ivanka does not have a military background nor any explicit knowledge of the Middle East, but is advising her father on a military strike anyway. Similarly, her husband Jared Kushner, a New York City real estate developer, has been tasked with the personal responsibility of negotiating peace talks between Israel and Palestine, brokering diplomacy with Mexico and China, and reforming the criminal justice system. Eric Trump called her influence a “beautiful thing.” Is that nepotism? Absolutely. Is that also a beautiful thing? Absolutely. Family business is a beautiful thing. The same applies for Ivanka. Ivanka is by his side in Washington. President Trump previously said that nepotism “is the way the world works.” Last week, President Trump blamed both the Assad regime and his predecessor Barack Obama for failing to act when the Syrian dictator crossed a “red line” in 2013. Trump failed to condemn the Assad-supporting Russian government. He campaigned on the pledge to improve relations between the two countries. Eric Trump also said that the strike proved Trump associates did not collude with Russia to interfere with the presidential election. “If there was anything that [the strike on] Syria did, it was to validate the fact that there is no Russia tie,” he said. A Pentagon official, however, said that Russian forces were notified in advance of the strike. Pentagon spokesman Captain Jeff Davis said in an official statement: “Russian forces were notified in advance of the strike using the established deconfliction line. U.S. military planners took precautions to minimize risk to Russian or Syrian personnel located at the airfield.” Syrian armed forces also received an advance warning “hours” before the strike, prompting them to move “a number of airplanes” at several military points. The Shayrat airbase, struck by 59 Tomahawk missiles authorized by the Trump administration, remained operational after the strike. Secretary of State Rex Tillerson is set to visit Moscow on Tuesday. ", "title": "New military adviser Ivanka Trump reportedly convinced her father to bomb Syria", "sentences": [{"3584": "New military adviser Ivanka Trump reportedly convinced her father to bomb Syria"}, {"3ac3": "“I’m sure she said: ‘Listen, this is horrible stuff.’”"}, {"61ae": "In this file photo made from the footage taken from Russian Defense Ministry official web site Friday, April 7, 2017, an aerial view shows shelters for aircraft at a Syrian airbase after it was hit by US strike in Syria. CREDIT: (Russian Defense Ministry Press Service Photo via AP, File)"}, {"d092": "Ivanka Trump — an official government employee without military experience but with her own White House office— reportedly influenced President Donald Trump’s decision to strike against Syrian dictator Bashar al-Assad last week, according to her brother Eric Trump."}, {"c7d8": "Trump authorized a U.S. missile attack on a Syrian airbase on Friday in response to a chemical weapons attack allegedly committed by the Assad regime that killed scores of people, including more than 30 children."}, {"3a84": "“Ivanka is a mother of three kids and she has influence. I’m sure she said: ‘Listen, this is horrible stuff,’” Eric Trump told The Telegraph."}, {"fe03": "“My father will act in times like that,” Eric Trump added. “And by the way, he was anti doing anything with Syria two years ago. Then a leader gasses their own people, women and children. At some point America is the global leader and the world’s superpower has to come forward and act and they did with a lot of support of our allies and I think that’s a great thing.”"}, {"6034": "Eric Trump, the 33-year-old son of the president, told the publication that his father had been “deeply affected” by photos of chemically-burned children being sprayed down in the wake of the attack."}, {"5376": "“It was horrible,” Eric Trump said. “These guys are savages and I’m glad he responded the way he responded.”"}, {"e231": "Ivanka’s ability to influence her father on a U.S.-authorized military air strike that itself reportedly killed four children has been condoned by the Trump family. Ivanka does not have a military background nor any explicit knowledge of the Middle East, but is advising her father on a military strike anyway. Similarly, her husband Jared Kushner, a New York City real estate developer, has been tasked with the personal responsibility of negotiating peace talks between Israel and Palestine, brokering diplomacy with Mexico and China, and reforming the criminal justice system. Eric Trump called her influence a “beautiful thing.”"}, {"b5f0": "Is that nepotism? Absolutely. Is that also a beautiful thing? Absolutely. Family business is a beautiful thing. The same applies for Ivanka. Ivanka is by his side in Washington."}, {"67ed": "President Trump previously said that nepotism “is the way the world works.”"}, {"3674": "Last week, President Trump blamed both the Assad regime and his predecessor Barack Obama for failing to act when the Syrian dictator crossed a “red line” in 2013. Trump failed to condemn the Assad-supporting Russian government. He campaigned on the pledge to improve relations between the two countries."}, {"8155": "Eric Trump also said that the strike proved Trump associates did not collude with Russia to interfere with the presidential election."}, {"9657": "“If there was anything that [the strike on] Syria did, it was to validate the fact that there is no Russia tie,” he said."}, {"585d": "A Pentagon official, however, said that Russian forces were notified in advance of the strike."}, {"aa76": "Pentagon spokesman Captain Jeff Davis said in an official statement: “Russian forces were notified in advance of the strike using the established deconfliction line. U.S. military planners took precautions to minimize risk to Russian or Syrian personnel located at the airfield.”"}, {"a68a": "Syrian armed forces also received an advance warning “hours” before the strike, prompting them to move “a number of airplanes” at several military points. The Shayrat airbase, struck by 59 Tomahawk missiles authorized by the Trump administration, remained operational after the strike."}, {"f015": "Secretary of State Rex Tillerson is set to visit Moscow on Tuesday."}], "child": "1525_1\t1525_2\t1525_3\t1525_4\t1525_5\t1525_6\t1525_7\t1525_8\t1525_9\t1525_10\t1525_11\t1525_12\t1525_13\t1525_14\t1525_15\t1525_16"}