{"name": "1526", "parent": "", "content": "Report: U.S. intelligence received warnings from allies about Trump and Russia Analysts saw evidence of interactions between Trump associates and Russian agents, according to the Guardian. CREDIT: AP Photo/Alastair Grant Members of the British intelligence agency GCHQ knew about “suspicious” contact between associates of President Donald Trump and Russian operatives as early as 2015, the Guardian reported on Thursday, citing a source with links to British intelligence. “GCHQ first became aware in late 2015 of suspicious ‘interactions’ between figures connected to Trump and known or suspected Russian agents, a source close to UK intelligence said,” according to the Guardian exclusive. “This intelligence was passed to the US as part of a routine exchange of information, they added.” Agencies from other countries, including Germany, reportedly shared additional intelligence with the United States through the first half of 2016, the Guardian said, citing “sources.” The UK and U.S. — along with Canada, Australia, and New Zealand — are members of an intelligence-sharing coalition known as “Five Eyes.” Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org The report comes less than a month after White House Press Secretary Sean Spicer suggested that GCHQ might have spied on Trump Tower during the 2016 presidential campaign at the behest of former President Barack Obama. Spicer later had to apologize to the U.K. government for the false allegation. GCHQ isn’t the only British agency caught up in the unfurling Trump-Russia scandal. A former MI6 operative, Christopher Steele, has been identified as the author of the infamous dossier that reported potentially explosive — albeit mostly unverified — allegations against both Trump associates and Trump himself, regarding their supposed complicity in Russian sabotage of the 2016 presidential election. The Senate Intelligence Committee has asked Steele to testify as part of its investigation into the allegations. ", "title": "Report: U.S. intelligence received warnings from allies about Trump and Russia", "sentences": [{"0580": "Report: U.S. intelligence received warnings from allies about Trump and Russia"}, {"cd03": "Analysts saw evidence of interactions between Trump associates and Russian agents, according to the Guardian."}, {"d816": "CREDIT: AP Photo/Alastair Grant"}, {"bc8e": "Members of the British intelligence agency GCHQ knew about “suspicious” contact between associates of President Donald Trump and Russian operatives as early as 2015, the Guardian reported on Thursday, citing a source with links to British intelligence."}, {"f1c8": "“GCHQ first became aware in late 2015 of suspicious ‘interactions’ between figures connected to Trump and known or suspected Russian agents, a source close to UK intelligence said,” according to the Guardian exclusive. “This intelligence was passed to the US as part of a routine exchange of information, they added.”"}, {"9512": "Agencies from other countries, including Germany, reportedly shared additional intelligence with the United States through the first half of 2016, the Guardian said, citing “sources.” The UK and U.S. — along with Canada, Australia, and New Zealand — are members of an intelligence-sharing coalition known as “Five Eyes.”"}, {"d3d0": "Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org"}, {"ebd4": "The report comes less than a month after White House Press Secretary Sean Spicer suggested that GCHQ might have spied on Trump Tower during the 2016 presidential campaign at the behest of former President Barack Obama. Spicer later had to apologize to the U.K. government for the false allegation."}, {"d24e": "GCHQ isn’t the only British agency caught up in the unfurling Trump-Russia scandal. A former MI6 operative, Christopher Steele, has been identified as the author of the infamous dossier that reported potentially explosive — albeit mostly unverified — allegations against both Trump associates and Trump himself, regarding their supposed complicity in Russian sabotage of the 2016 presidential election. The Senate Intelligence Committee has asked Steele to testify as part of its investigation into the allegations."}], "child": "1526_1\t1526_2\t1526_3\t1526_4\t1526_5\t1526_6\t1526_7"}