{"name": "1527", "parent": "", "content": "Don’t be fooled by Trump’s latest ‘pivot’ Team Bannon might not be steering Sino-American diplomacy, but they’re winning on immigration policy. President Donald Trump’s White House Senior Advisers Steve Bannon, center, and Stephen Miller, right at Andrews Air Force Base, Md., Monday, March 20, 2017. CREDIT: AP Photo/Andrew Harnik This week, the press decided that “President Bannon” is a lame duck. Speaking to the New York Post on Tuesday, President Donald Trump pointedly demurred when asked if he has confidence in his closest adviser, former Breitbart Media boss Steve Bannon. The following day, he seemed to reject Bannonism as a foreign policy doctrine when he signaled his support for NATO and declined to label China a currency manipulator. As Bannon’s influence within the White House has apparently waned, news reports suggest that Jared Kushner — Trump’s son-in-law and human deus ex machina — is now steering administration policy in a less nationalist, more conventional direction. There is some truth to that narrative, but it ignores the extent to which the White House is still pursuing an agenda that is fully compatible with the ideology that Breitbart Media started espousing under Bannon’s leadership. Trump’s new postures toward NATO, Russia, Syria, and China are only partial rejections of Bannon-esque white nationalist ideology. The central concern of that ideology is immigration, and its chief proponents in the Trump administration include Bannon, senior adviser Stephen Miller, and Attorney General Jeff Sessions. According to New York Times Magazine’s Emily Bazelon, these three men see immigration as “a galvanizing issue, lying at the center of their apparent vision for reshaping the United States by tethering it to its European and Christian origins.” The more vocal white supremacists agree. Richard Spencer, for example, has said he supports “a break on all immigration, particularly non-European immigration, for a 50 year period.” As Rep. Steve King (R-IA) — a longtime anti-immigrant demagogue and friend to European crypto-fascist movements — put it: “We can’t restore our civilization with somebody else’s babies.” Klan members and other explicitly racist groups applauded King for that observation. It’s a view that continues to find expression in White House immigration policy, all this talk of a Trump “pivot” away from white nationalism aside. After all, no matter what happens to Bannon, Jeff Sessions appears securely ensconced at the Department of Justice. In fact, even as Trump was warming up to Chinese President Xi Jinping, Sessions was touring the southern border and announcing plans to dramatically increase prosecutions for “transportation or harboring of aliens.” A federal prosecutor told the Daily Beast that Sessions’ plans are “fucking horrifying.” “The things they want us to do are so horrifying — they want to do harboring cases of three or more people,” said the prosecutor. “So if you’re illegal and you bring your family over, then you’re ‘harboring’ your kid and your wife, and you can go to jail.” At the same time, the Department of Homeland Security is reportedly hard at work on plans to assemble a new deportation force and free up space in detention centers to incarcerate tens of thousands of undocumented immigrants. This despite the fact that border crossings are at a nearly two-decade low. Unlike with the administration’s misbegotten Muslim immigration ban —spearheaded, incidentally, by Stephen Miller — White House officials have not made the mistake of explicitly saying these anti-immigrant initiatives are meant to exclude certain ethnic groups from the United States. But Sessions’ Tuesday speech at the border tipped his hand somewhat; his prepared remarks said that border enforcement was meant to prevent “filth” from coming into the country, though he skipped that line during delivery. ", "title": "Don’t be fooled by Trump’s latest ‘pivot’", "sentences": [{"e507": "Don’t be fooled by Trump’s latest ‘pivot’"}, {"99e8": "Team Bannon might not be steering Sino-American diplomacy, but they’re winning on immigration policy."}, {"e11a": "President Donald Trump’s White House Senior Advisers Steve Bannon, center, and Stephen Miller, right at Andrews Air Force Base, Md., Monday, March 20, 2017. CREDIT: AP Photo/Andrew Harnik"}, {"b6e8": "This week, the press decided that “President Bannon” is a lame duck."}, {"5fa1": "Speaking to the New York Post on Tuesday, President Donald Trump pointedly demurred when asked if he has confidence in his closest adviser, former Breitbart Media boss Steve Bannon. The following day, he seemed to reject Bannonism as a foreign policy doctrine when he signaled his support for NATO and declined to label China a currency manipulator. As Bannon’s influence within the White House has apparently waned, news reports suggest that Jared Kushner — Trump’s son-in-law and human deus ex machina — is now steering administration policy in a less nationalist, more conventional direction."}, {"9a48": "There is some truth to that narrative, but it ignores the extent to which the White House is still pursuing an agenda that is fully compatible with the ideology that Breitbart Media started espousing under Bannon’s leadership. Trump’s new postures toward NATO, Russia, Syria, and China are only partial rejections of Bannon-esque white nationalist ideology."}, {"d9e3": "The central concern of that ideology is immigration, and its chief proponents in the Trump administration include Bannon, senior adviser Stephen Miller, and Attorney General Jeff Sessions. According to New York Times Magazine’s Emily Bazelon, these three men see immigration as “a galvanizing issue, lying at the center of their apparent vision for reshaping the United States by tethering it to its European and Christian origins.”"}, {"fd7c": "The more vocal white supremacists agree. Richard Spencer, for example, has said he supports “a break on all immigration, particularly non-European immigration, for a 50 year period.” As Rep. Steve King (R-IA) — a longtime anti-immigrant demagogue and friend to European crypto-fascist movements — put it: “We can’t restore our civilization with somebody else’s babies.”"}, {"dbce": "Klan members and other explicitly racist groups applauded King for that observation. It’s a view that continues to find expression in White House immigration policy, all this talk of a Trump “pivot” away from white nationalism aside."}, {"5c29": "After all, no matter what happens to Bannon, Jeff Sessions appears securely ensconced at the Department of Justice. In fact, even as Trump was warming up to Chinese President Xi Jinping, Sessions was touring the southern border and announcing plans to dramatically increase prosecutions for “transportation or harboring of aliens.” A federal prosecutor told the Daily Beast that Sessions’ plans are “fucking horrifying.”"}, {"f98a": "“The things they want us to do are so horrifying — they want to do harboring cases of three or more people,” said the prosecutor. “So if you’re illegal and you bring your family over, then you’re ‘harboring’ your kid and your wife, and you can go to jail.”"}, {"54c8": "At the same time, the Department of Homeland Security is reportedly hard at work on plans to assemble a new deportation force and free up space in detention centers to incarcerate tens of thousands of undocumented immigrants. This despite the fact that border crossings are at a nearly two-decade low."}, {"3e0d": "Unlike with the administration’s misbegotten Muslim immigration ban —spearheaded, incidentally, by Stephen Miller — White House officials have not made the mistake of explicitly saying these anti-immigrant initiatives are meant to exclude certain ethnic groups from the United States. But Sessions’ Tuesday speech at the border tipped his hand somewhat; his prepared remarks said that border enforcement was meant to prevent “filth” from coming into the country, though he skipped that line during delivery."}], "child": "1527_1\t1527_2\t1527_3\t1527_4"}