{"name": "1528", "parent": "", "content": "What is the United States’ Strategy in Syria? It’s not clear what the recent missile strikes will accomplish On April 6, American Tomahawk missiles struck Shayrat airfield in Syria. Days earlier, Syrian aircraft taking off from Shayrat launched a chemical weapons attack on the rebel-held town of Khan Sheikhoun that killed at least 80 civilians, including 26 children. The Syrian civil war broke out over six years ago, and this is the first time the United States deliberately attacked the government of Bashar al-Assad. It’s a significant change in American policy, but it’s not clear what the United States expects the strikes to accomplish, nor whether the Trump administration has any long-term strategy for Syria. (CNN) Announcing the strikes, President Trump lamented the suffering in Khan Sheikhoun and argued that It is in this vital national security interest of the United States to prevent and deter the spread and use of deadly chemical weapons. Spread, maybe — if chemical weapons proliferate, terrorists could find them easier to acquire — but not use. Every state knows a chemical attack against the United States or one of its allies would be met with a devastating military response. Assad gassing Syrian civilians doesn’t change that. The argument against use is humanitarian. Nerve gas — including the sarin used in Khan Sheikhoun — is especially nasty, and humanity has decided it crosses a line. The taboo against chemical weapons has largely held since the Geneva Protocol outlawed them in 1925, and there’s a reasonable argument the world’s predominant power should enforce that norm by imposing a cost upon regimes that violate it. That way any government knows it will pay a price if it uses poison gas. However, the strike was very limited. According to Pentagon Spokesman Jeff Davis: Russian forces were notified in advance of the strike using the established deconfliction line. U.S. military planners took precautions to minimize risk to Russian or Syrian personnel located at the airfield. Some Trump critics will take this as further evidence of collusion with Russia. But it’s normal communication for unallied militaries operating in the same area, and in line with an agreement struck under Obama to avoid conflict between the two great powers. Starting a war with Russia was not the goal of the strikes. However, the part about minimizing risk to Syrian personnel stands out. The United States fired 59 highly accurate, million-dollar missiles to damage some runways and blow up some airplanes. According to the governor of Homs, the Syrian province containing Shayrat airbase, the strikes killed five Syrian military personnel and eight civilians who live nearby, but those numbers remain unconfirmed. According to the London-based Syrian Observatory for Human Rights, two Syrian jets took off from the base less than 24 hours later. If the point was to deter further attacks on civilians, or at least chemical attacks, by communicating to Assad he’ll pay a hefty price, something this small probably won’t do it. American National Interest There are realpolitik arguments for intervening in Syria. Using force sends a signal to Russia, Iran, Turkey, Saudi Arabia, and other local actors that the United States intends to influence the outcome. And stabilizing the country would eliminate a recruitment tool and potential safe haven for terrorists, and alleviate the refugee crisis. It would have been better if Obama did this in 2013. That year, Assad’s forces launched chemical attacks that killed almost 1,500 civilians, including over 400 children. It obviously violated the “red line” Obama drew in 2012, and attacking regime targets could have tipped the civil war towards the rebels. Doing so would have brought numerous challenges, but it also would have short-circuited the protracted state-v.-rebels stage of the conflict that has killed hundreds of thousands, empowered transnational terrorists, and created a flood of migrants straining Middle Eastern and European nations. I made this argument in greater detail here: Aleppo is Part of Obama’s LegacyThe United States could have prevented the massacre. But every alternative would have been costly.arcdigital.media Obama chose not to attack, cutting a deal with Russia to remove Assad’s chemical weapons. Shortly after, the window of opportunity closed. Jihadists came to dominate the rebellion, not least because Assad’s forces focused on non-jihadist rebels to force the world into a me-or-the-terrorists decision. In September 2015, Russia intervened, helping the government gain ground. With the fall of Aleppo in late 2016, it appeared near certain Assad would remain in power. In a mid-2016 interview with The Atlantic’s Jeffrey Goldberg, Obama described the decision not to intervene in Syria as one of the best of his presidency. He argued he overcame the foreign policy establishment’s misguided obsession with credibility, kept the United States out of another Middle East quagmire, and removed Assad’s chemical arsenal without firing a shot. From the perspective of April 2017, all three of those appear to be failures. By declining to attack even after threatening to do so, Obama signaled he would never use force in Syria. That changed Russia’s decision calculus. If America would match any Russian action, intervening would drain Russia’s resources without keeping its ally in power. But with Obama staying out, Russia believed it could achieve its goal at an acceptable cost. ISIS’ rapid advance into Iraq, and the collapse of the Iraqi military in Mosul, prompted Obama to send troops into the region. As efforts to train anti-ISIS fighters in Syria fell flat, he began deploying Americans to help the assault on Raqqa, ISIS’ Syrian capital. By the end of Obama’s tenure, about 5,000 American military personnel were on the ground in Iraq and Syria. What if the U.S. Invaded Syria and Nobody Noticed?The media should be covering this morearcdigital.media Now the sarin attack in Khan Sheikhoun shows the deal to remove Assad’s chemical weapons failed as well. As Obama’s defenders point out, he sought permission from Congress to attack Syria, but Congress refused. However, it’s unclear how many genuinely disagreed, how many were reflexively opposing Obama, and how many just didn’t want the responsibility. Both Democrats and Republicans objected, and some surely thought attacking would be a bad idea. But given how many Republicans subsequently criticized Obama for failing to enforce his red line, at least some of their opposition was political. Primarily, Members of Congress want the President to shoulder all responsibility for using force abroad. If it goes well, the president will get the credit, but if it goes poorly, political opponents will attack anyone who voted for it. For example, voting for the Iraq war became a political liability for many politicians, including Hillary Clinton. That’s why the United States is fighting ISIS under the 2001 Authorization of Military Force, even though almost everyone agrees it’s a stretch to say ISIS counts as an organization that “planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001.” A majority in Congress clearly thinks the U.S. should be fighting ISIS. They just don’t want to pass a new authorization because abdicating responsibility serves their political interest. So it’s true Congress would not give Obama permission to attack Syria in 2013, but he didn’t need to ask for it. Under the War Powers Resolution (1973), the president can legally order the military to use force abroad without congressional permission, but has to cease the effort after 90 days if Congress doesn’t authorize it. The Obama administration knew this, and could do a nose count and see Congress wasn’t going to give permission. A sustained military effort is more likely to succeed with widespread domestic support, but once a mission is underway, Congress becomes more likely to see authorization as supporting the troops, rather than initiating military action, changing Members’ political calculus. Obama could have done it if he wanted. He chose not to. Trump attacked without asking permission first. The problem is, the circumstances in Syria are very different. When announcing the strikes, Trump said: I call on all civilized nations to join us in seeking to end the slaughter and bloodshed in Syria, and also to end terrorism of all kinds and all types. It’s hard to disagree with those goals in the abstract. But a pinprick that damages one Syrian airfield isn’t going to achieve them. And there’s no sign the Trump administration has a concrete strategy, or wants to spend the resources necessary to bring a lasting end to the conflict. When Assad was in trouble, Obama had the opportunity to push him over the edge. Now, thanks to Russian and Iranian support, Assad’s in a stronger position, and attacking him could prolong the civil war, rather than bring about its conclusion. Trump’s Credibility The administration’s position on Syria has vacillated wildly, with different officials sometimes saying different things. The current line is anti-Assad. The president was somewhat ambiguous, saying “he’s there and I guess he’s running things, so something should happen.” Secretary of State Rex Tillerson was more forceful, stating “it would seem there would be no role for him to govern the Syrian people.” Senate Majority Leader Mitch McConnell gave the clearest statement: “I don’t see how there can possibly be any settlement in Syria that includes Bashar al-Assad.” It appears the United States under Trump is returning to the stance it held under Obama: Assad must go. However, as with Obama, they don’t seem to have a plan to get there. The entire reason Russia and Iran are in Syria is to keep Assad in power, and every previous attempt to bridge that divide has gotten nowhere. American involvement could change the calculus for all involved, but only if it is significant and sustained. The United States would have to make it clear it will forcibly prevent Assad from reestablishing full control and will work to reverse the regime’s recent gains, giving Russia and Iran no choice but to cut a deal. One attack on one airport doesn’t get close to that, and it’s unlikely the American people, or even the Trump administration, want to devote the time and resources necessary to pull it off. One big problem is the administration lacks credibility. War is politics by other means, and credibility empowers threats and promises to achieve the goals of force without having to use it. Many have noted how Trump’s decision to bomb Syria sharply contrasts with his public statements (i.e. tweets) from 2013. This one’s aged poorly: This one’s even worse: But, as with every political statement Trump made before running for president, his primary goals were to make Obama look bad and attract attention. Nothing about his public pronouncements reflected deep strategic thought. But even if we dismiss all of Trump’s pre-candidacy statements, there’s still the problem of his rapid shifts as president and the lack of coordination among administration officials. Trump ran as an isolationist — or at least a non-interventionist — and in his inaugural address, he criticized previous presidents for spending money on overseas conflicts, promising an “America first” foreign policy. Trump expressed a desire to work with Russia in Syria, and parroted Russia’s claim that the world’s choice is between Assad and terrorists. In it’s first few months, the administration’s official position reversed Obama’s call for Assad to leave power. On March 31, Press Secretary Sean Spicer answered a question about Syria’s future with this: With respect to Assad, there is a political reality that we have to accept. Secretary of State Rex Tillerson and U.N. Ambassador Nikki Haley made similar comments. Tillerson: I think the longer term status of President Assad will be decided by the Syrian people. Haley: Our priority is no longer to sit and focus on getting Assad out. On April 4, Syria launched the chemical attack on Khan Sheikhoun. Trump critics blamed the administration, arguing that statements accepting Assad’s rule emboldened the dictator. That’s unlikely. Americans often assume foreign leaders make decisions primarily in response to the United States, but many times local considerations are paramount. Perhaps the best example is Saddam Hussein hiding the fact that Iraq did not have an active nuclear weapons program in 2002. Many Americans assumed he was defying the United States, but he was mostly afraid of looking weak to Iran. Similarly, Assad’s main calculus was probably local. He has defeated most non-ISIS rebels, but Khan Sheikhoun remained a holdout. A chemical attack could break their spirit, and send a message to anyone thinking of rebelling in the future. Additionally, the Syrian military is stretched thin. Though Assad has killed thousands of civilians with conventional means, gas is relatively cheap and easy to deploy. Though Trump did not cause the chemical attack, the administration’s immediate response was consistent with a non-interventionist position. The president focused his criticisms on Obama and the “red line,” and Press Secretary Sean Spicer said it would be “rather silly not acknowledging the political realities that exist in Syria.” The next day, on April 5, Haley sharply criticized Syria at the UN, rhetorically asking: How many more children have to die before Russia cares? Trump claimed the gas attack had a big impact on him, changing his attitude towards Syria and Assad (though it doesn’t seem to have altered his opinion of Syrian refugees). On April 6, American missiles struck Shayrat airfield. But after the attacks, Tillerson indicated America’s position on Syria remained consistent: I would not in any way attempt to extrapolate that to a change in our policy. Now, only two days later, the administration says Assad should go and calls Russia complicit in the chemical attack. If handled properly, America’s show of force could communicate the United States will remain involved, and not allow others to dictate events as it did under Obama. Following the strikes with a tightly coordinated diplomatic push might increase the chances of a negotiated end to the Syrian civil war. Americans reasonably fear war with Russia, but Russians fear war with the United States at least as much. Trump, Spicer, Tillerson, and Haley all appear on the same page now, but who knows how long that will last. Given the rapid shift in policy, the varied statements coming from different officials, and the president’s history of inconsistency and falsehoods, other countries will doubt the latest position. For example, they could assume Trump wanted to seem like he’s doing something, but will not follow through, especially on the newfound antagonism with Russia. For threats and promises to shape other countries’ behavior, they have to be credible. Other countries need to believe that if they don’t do what you want, you’ll carry through on your threat, and if they do what you ask, you’ll follow through on your promises. But, after the last year, no national leader trusts the word of Donald J. Trump. ", "title": "What is the United States’ Strategy in Syria?", "sentences": [{"d1ef": "What is the United States’ Strategy in Syria?"}, {"59a0": "It’s not clear what the recent missile strikes will accomplish"}, {"25d5": "On April 6, American Tomahawk missiles struck Shayrat airfield in Syria. Days earlier, Syrian aircraft taking off from Shayrat launched a chemical weapons attack on the rebel-held town of Khan Sheikhoun that killed at least 80 civilians, including 26 children."}, {"bf68": "The Syrian civil war broke out over six years ago, and this is the first time the United States deliberately attacked the government of Bashar al-Assad. It’s a significant change in American policy, but it’s not clear what the United States expects the strikes to accomplish, nor whether the Trump administration has any long-term strategy for Syria."}, {"3aac": "(CNN)"}, {"7127": "Announcing the strikes, President Trump lamented the suffering in Khan Sheikhoun and argued that"}, {"cbb5": "It is in this vital national security interest of the United States to prevent and deter the spread and use of deadly chemical weapons."}, {"b7fe": "Spread, maybe — if chemical weapons proliferate, terrorists could find them easier to acquire — but not use."}, {"f1c1": "Every state knows a chemical attack against the United States or one of its allies would be met with a devastating military response. Assad gassing Syrian civilians doesn’t change that."}, {"34dd": "The argument against use is humanitarian. Nerve gas — including the sarin used in Khan Sheikhoun — is especially nasty, and humanity has decided it crosses a line. The taboo against chemical weapons has largely held since the Geneva Protocol outlawed them in 1925, and there’s a reasonable argument the world’s predominant power should enforce that norm by imposing a cost upon regimes that violate it. That way any government knows it will pay a price if it uses poison gas."}, {"e830": "However, the strike was very limited. According to Pentagon Spokesman Jeff Davis:"}, {"3b9c": "Russian forces were notified in advance of the strike using the established deconfliction line. U.S. military planners took precautions to minimize risk to Russian or Syrian personnel located at the airfield."}, {"b853": "Some Trump critics will take this as further evidence of collusion with Russia. But it’s normal communication for unallied militaries operating in the same area, and in line with an agreement struck under Obama to avoid conflict between the two great powers. Starting a war with Russia was not the goal of the strikes."}, {"aad1": "However, the part about minimizing risk to Syrian personnel stands out."}, {"5867": "The United States fired 59 highly accurate, million-dollar missiles to damage some runways and blow up some airplanes. According to the governor of Homs, the Syrian province containing Shayrat airbase, the strikes killed five Syrian military personnel and eight civilians who live nearby, but those numbers remain unconfirmed."}, {"cba5": "According to the London-based Syrian Observatory for Human Rights, two Syrian jets took off from the base less than 24 hours later."}, {"6c6b": "If the point was to deter further attacks on civilians, or at least chemical attacks, by communicating to Assad he’ll pay a hefty price, something this small probably won’t do it."}, {"7b12": "American National Interest"}, {"c65d": "There are realpolitik arguments for intervening in Syria. Using force sends a signal to Russia, Iran, Turkey, Saudi Arabia, and other local actors that the United States intends to influence the outcome. And stabilizing the country would eliminate a recruitment tool and potential safe haven for terrorists, and alleviate the refugee crisis."}, {"c25c": "It would have been better if Obama did this in 2013. That year, Assad’s forces launched chemical attacks that killed almost 1,500 civilians, including over 400 children. It obviously violated the “red line” Obama drew in 2012, and attacking regime targets could have tipped the civil war towards the rebels."}, {"8491": "Doing so would have brought numerous challenges, but it also would have short-circuited the protracted state-v.-rebels stage of the conflict that has killed hundreds of thousands, empowered transnational terrorists, and created a flood of migrants straining Middle Eastern and European nations."}, {"bed4": "I made this argument in greater detail here:"}, {"4b9b": "Aleppo is Part of Obama’s LegacyThe United States could have prevented the massacre. But every alternative would have been costly.arcdigital.media"}, {"abda": "Obama chose not to attack, cutting a deal with Russia to remove Assad’s chemical weapons."}, {"20f5": "Shortly after, the window of opportunity closed. Jihadists came to dominate the rebellion, not least because Assad’s forces focused on non-jihadist rebels to force the world into a me-or-the-terrorists decision. In September 2015, Russia intervened, helping the government gain ground. With the fall of Aleppo in late 2016, it appeared near certain Assad would remain in power."}, {"824b": "In a mid-2016 interview with The Atlantic’s Jeffrey Goldberg, Obama described the decision not to intervene in Syria as one of the best of his presidency. He argued he overcame the foreign policy establishment’s misguided obsession with credibility, kept the United States out of another Middle East quagmire, and removed Assad’s chemical arsenal without firing a shot."}, {"b8d9": "From the perspective of April 2017, all three of those appear to be failures."}, {"d0c7": "By declining to attack even after threatening to do so, Obama signaled he would never use force in Syria. That changed Russia’s decision calculus. If America would match any Russian action, intervening would drain Russia’s resources without keeping its ally in power. But with Obama staying out, Russia believed it could achieve its goal at an acceptable cost."}, {"9cfd": "ISIS’ rapid advance into Iraq, and the collapse of the Iraqi military in Mosul, prompted Obama to send troops into the region. As efforts to train anti-ISIS fighters in Syria fell flat, he began deploying Americans to help the assault on Raqqa, ISIS’ Syrian capital. By the end of Obama’s tenure, about 5,000 American military personnel were on the ground in Iraq and Syria."}, {"c486": "What if the U.S. Invaded Syria and Nobody Noticed?The media should be covering this morearcdigital.media"}, {"f418": "Now the sarin attack in Khan Sheikhoun shows the deal to remove Assad’s chemical weapons failed as well."}, {"15d0": "As Obama’s defenders point out, he sought permission from Congress to attack Syria, but Congress refused."}, {"19f1": "However, it’s unclear how many genuinely disagreed, how many were reflexively opposing Obama, and how many just didn’t want the responsibility. Both Democrats and Republicans objected, and some surely thought attacking would be a bad idea. But given how many Republicans subsequently criticized Obama for failing to enforce his red line, at least some of their opposition was political."}, {"1420": "Primarily, Members of Congress want the President to shoulder all responsibility for using force abroad. If it goes well, the president will get the credit, but if it goes poorly, political opponents will attack anyone who voted for it. For example, voting for the Iraq war became a political liability for many politicians, including Hillary Clinton."}, {"7db3": "That’s why the United States is fighting ISIS under the 2001 Authorization of Military Force, even though almost everyone agrees it’s a stretch to say ISIS counts as an organization that “planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001.” A majority in Congress clearly thinks the U.S. should be fighting ISIS. They just don’t want to pass a new authorization because abdicating responsibility serves their political interest."}, {"9377": "So it’s true Congress would not give Obama permission to attack Syria in 2013, but he didn’t need to ask for it. Under the War Powers Resolution (1973), the president can legally order the military to use force abroad without congressional permission, but has to cease the effort after 90 days if Congress doesn’t authorize it."}, {"3dbc": "The Obama administration knew this, and could do a nose count and see Congress wasn’t going to give permission. A sustained military effort is more likely to succeed with widespread domestic support, but once a mission is underway, Congress becomes more likely to see authorization as supporting the troops, rather than initiating military action, changing Members’ political calculus."}, {"836f": "Obama could have done it if he wanted. He chose not to."}, {"822b": "Trump attacked without asking permission first. The problem is, the circumstances in Syria are very different."}, {"d68a": "When announcing the strikes, Trump said:"}, {"0c59": "I call on all civilized nations to join us in seeking to end the slaughter and bloodshed in Syria, and also to end terrorism of all kinds and all types."}, {"4031": "It’s hard to disagree with those goals in the abstract. But a pinprick that damages one Syrian airfield isn’t going to achieve them. And there’s no sign the Trump administration has a concrete strategy, or wants to spend the resources necessary to bring a lasting end to the conflict."}, {"0323": "When Assad was in trouble, Obama had the opportunity to push him over the edge. Now, thanks to Russian and Iranian support, Assad’s in a stronger position, and attacking him could prolong the civil war, rather than bring about its conclusion."}, {"ac7c": "Trump’s Credibility"}, {"169f": "The administration’s position on Syria has vacillated wildly, with different officials sometimes saying different things."}, {"0701": "The current line is anti-Assad. The president was somewhat ambiguous, saying “he’s there and I guess he’s running things, so something should happen.” Secretary of State Rex Tillerson was more forceful, stating “it would seem there would be no role for him to govern the Syrian people.” Senate Majority Leader Mitch McConnell gave the clearest statement: “I don’t see how there can possibly be any settlement in Syria that includes Bashar al-Assad.”"}, {"00d7": "It appears the United States under Trump is returning to the stance it held under Obama: Assad must go. However, as with Obama, they don’t seem to have a plan to get there. The entire reason Russia and Iran are in Syria is to keep Assad in power, and every previous attempt to bridge that divide has gotten nowhere."}, {"410e": "American involvement could change the calculus for all involved, but only if it is significant and sustained. The United States would have to make it clear it will forcibly prevent Assad from reestablishing full control and will work to reverse the regime’s recent gains, giving Russia and Iran no choice but to cut a deal. One attack on one airport doesn’t get close to that, and it’s unlikely the American people, or even the Trump administration, want to devote the time and resources necessary to pull it off."}, {"8a17": "One big problem is the administration lacks credibility. War is politics by other means, and credibility empowers threats and promises to achieve the goals of force without having to use it."}, {"4dfb": "Many have noted how Trump’s decision to bomb Syria sharply contrasts with his public statements (i.e. tweets) from 2013."}, {"48eb": "This one’s aged poorly:"}, {"3de8": "This one’s even worse:"}, {"49e9": "But, as with every political statement Trump made before running for president, his primary goals were to make Obama look bad and attract attention. Nothing about his public pronouncements reflected deep strategic thought."}, {"80f4": "But even if we dismiss all of Trump’s pre-candidacy statements, there’s still the problem of his rapid shifts as president and the lack of coordination among administration officials."}, {"399e": "Trump ran as an isolationist — or at least a non-interventionist — and in his inaugural address, he criticized previous presidents for spending money on overseas conflicts, promising an “America first” foreign policy. Trump expressed a desire to work with Russia in Syria, and parroted Russia’s claim that the world’s choice is between Assad and terrorists."}, {"bec8": "In it’s first few months, the administration’s official position reversed Obama’s call for Assad to leave power. On March 31, Press Secretary Sean Spicer answered a question about Syria’s future with this:"}, {"7fc4": "With respect to Assad, there is a political reality that we have to accept."}, {"5724": "Secretary of State Rex Tillerson and U.N. Ambassador Nikki Haley made similar comments."}, {"b8bc": "Tillerson:"}, {"5aa9": "I think the longer term status of President Assad will be decided by the Syrian people."}, {"5c92": "Haley:"}, {"d285": "Our priority is no longer to sit and focus on getting Assad out."}, {"c405": "On April 4, Syria launched the chemical attack on Khan Sheikhoun. Trump critics blamed the administration, arguing that statements accepting Assad’s rule emboldened the dictator."}, {"2035": "That’s unlikely. Americans often assume foreign leaders make decisions primarily in response to the United States, but many times local considerations are paramount. Perhaps the best example is Saddam Hussein hiding the fact that Iraq did not have an active nuclear weapons program in 2002. Many Americans assumed he was defying the United States, but he was mostly afraid of looking weak to Iran."}, {"488b": "Similarly, Assad’s main calculus was probably local. He has defeated most non-ISIS rebels, but Khan Sheikhoun remained a holdout. A chemical attack could break their spirit, and send a message to anyone thinking of rebelling in the future. Additionally, the Syrian military is stretched thin. Though Assad has killed thousands of civilians with conventional means, gas is relatively cheap and easy to deploy."}, {"5b54": "Though Trump did not cause the chemical attack, the administration’s immediate response was consistent with a non-interventionist position. The president focused his criticisms on Obama and the “red line,” and Press Secretary Sean Spicer said it would be “rather silly not acknowledging the political realities that exist in Syria.”"}, {"c132": "The next day, on April 5, Haley sharply criticized Syria at the UN, rhetorically asking:"}, {"8f73": "How many more children have to die before Russia cares?"}, {"761e": "Trump claimed the gas attack had a big impact on him, changing his attitude towards Syria and Assad (though it doesn’t seem to have altered his opinion of Syrian refugees). On April 6, American missiles struck Shayrat airfield."}, {"bfe9": "But after the attacks, Tillerson indicated America’s position on Syria remained consistent:"}, {"a564": "I would not in any way attempt to extrapolate that to a change in our policy."}, {"7293": "Now, only two days later, the administration says Assad should go and calls Russia complicit in the chemical attack."}, {"31e4": "If handled properly, America’s show of force could communicate the United States will remain involved, and not allow others to dictate events as it did under Obama. Following the strikes with a tightly coordinated diplomatic push might increase the chances of a negotiated end to the Syrian civil war. Americans reasonably fear war with Russia, but Russians fear war with the United States at least as much."}, {"4df1": "Trump, Spicer, Tillerson, and Haley all appear on the same page now, but who knows how long that will last. Given the rapid shift in policy, the varied statements coming from different officials, and the president’s history of inconsistency and falsehoods, other countries will doubt the latest position. For example, they could assume Trump wanted to seem like he’s doing something, but will not follow through, especially on the newfound antagonism with Russia."}, {"32ca": "For threats and promises to shape other countries’ behavior, they have to be credible. Other countries need to believe that if they don’t do what you want, you’ll carry through on your threat, and if they do what you ask, you’ll follow through on your promises."}, {"1537": "But, after the last year, no national leader trusts the word of Donald J. Trump."}], "child": "1528_1\t1528_2\t1528_3\t1528_4\t1528_5\t1528_6\t1528_7\t1528_8\t1528_9\t1528_10\t1528_11\t1528_12\t1528_13\t1528_14\t1528_15\t1528_16\t1528_17\t1528_18"}