{"name": "1529", "parent": "", "content": "The White House won’t confirm if Trump authorized the ‘mother of all bombs’ in Afghanistan “Did the president not know about the MOAB strike?” The United States dropped its largest non-nuclear bomb in Afghanistan, known as the “Massive Ordnance Air Blast” or the “Mother of All Bombs,” on Thursday. This is the first-ever combat use of the bomb, which weighs 21,000 pounds. But the White House won’t confirm if the president even knew of the bombing, let alone authorized it. CNN first reported the bombing in Nangarhar, a province in the east of Afghanistan, bordering Pakistan. Pentagon spokesman Adam Stump told CNN that the giant bomb was “dropped by an MC-130 aircraft, stationed in Afghanistan and operated by Air Force Special Operations Command.” White House Press Secretary Sean Spicer confirmed the CNN report on Thursday afternoon, claiming in a press conference that the U.S. military “targeted a system of tunnels and caves that ISIS fighters used to move around freely.” He did not give more details about the bombing — including whether the president authorized it. As Spicer was wrapping up the press conference, a reporter asked him whether Trump authorized the bombing, but Spicer left without answering the question. “Very quickly, did the president not know about the MOAB strike?” a reporter asked. Spicer then turned and walked away. “Can I take your answer to mean he didn’t authorize it?” another asked. Spicer still didn’t answer. Watch: It’s not clear why Spicer couldn’t give a mere yes or no answer to the commander-in-chief authorizing such a huge bombing. This also isn’t the first time this has happened. Last month, Spicer used incredibly passive language to describe Trump’s role in sending 400 U.S. marines to Syria. When asked how involved Trump was in that decision, Spicer said: “Obviously the president was made aware of that. This is something that was done in consultation. He understands the regional issues that need to be addressed there.” Bilal Sarwary, an Afghan journalist, said on Twitter that the bomb hit a series of tunnels that had been targeted by U.S. airstrikes in the past week, and it left at least 20 fighters dead. The U.S. war in Afghanistan is the longest war in U.S. history, stretching into its 16th year. It’s not clear why the administration chose to use this bomb, who authorized its use, or whether the administration has any answers as to how to end the conflict. The Trump administration’s foreign policy has been completely incoherent. Also on Thursday, the U.S.-led coalition in Syria accidentally bombed and killed Syrian forces fighting ISIS. The Washington Post called it “the worst confirmed friendly-fire incident” in the almost three-year war against ISIS. This administration has also killed an astonishing number of civilians abroad in a short amount of time. Last month, a U.S. airstrike in Mosul killed 200 civilians, and it took almost a week for the government to acknowledge it was responsible. U.S.-led attacks in Syria in the span of two weeks last month also killed at least 79 people. And Trump authorized a deadly U.S. raid in Yemen just five days into office, which killed at least 23 Yemeni civilians, including children. UPDATE: After Spicer refused to comment on whether the president authorized the bombing, a reporter asked Trump whether or not he did so. “Everybody knows exactly what happened,” Trump said later Thursday afternoon. “What I do is I authorize my military. We have the greatest military in the world and they’ve done a job, as usual.” He did not give any more details. ", "title": "The White House won’t confirm if Trump authorized the ‘mother of all bombs’ in Afghanistan", "sentences": [{"8e63": "The White House won’t confirm if Trump authorized the ‘mother of all bombs’ in Afghanistan"}, {"6277": "“Did the president not know about the MOAB strike?”"}, {"c440": "The United States dropped its largest non-nuclear bomb in Afghanistan, known as the “Massive Ordnance Air Blast” or the “Mother of All Bombs,” on Thursday. This is the first-ever combat use of the bomb, which weighs 21,000 pounds. But the White House won’t confirm if the president even knew of the bombing, let alone authorized it."}, {"3997": "CNN first reported the bombing in Nangarhar, a province in the east of Afghanistan, bordering Pakistan. Pentagon spokesman Adam Stump told CNN that the giant bomb was “dropped by an MC-130 aircraft, stationed in Afghanistan and operated by Air Force Special Operations Command.”"}, {"e8b2": "White House Press Secretary Sean Spicer confirmed the CNN report on Thursday afternoon, claiming in a press conference that the U.S. military “targeted a system of tunnels and caves that ISIS fighters used to move around freely.” He did not give more details about the bombing — including whether the president authorized it."}, {"4f40": "As Spicer was wrapping up the press conference, a reporter asked him whether Trump authorized the bombing, but Spicer left without answering the question."}, {"961b": "“Very quickly, did the president not know about the MOAB strike?” a reporter asked. Spicer then turned and walked away."}, {"ed87": "“Can I take your answer to mean he didn’t authorize it?” another asked. Spicer still didn’t answer."}, {"f302": "Watch:"}, {"d2ff": "It’s not clear why Spicer couldn’t give a mere yes or no answer to the commander-in-chief authorizing such a huge bombing."}, {"dd79": "This also isn’t the first time this has happened. Last month, Spicer used incredibly passive language to describe Trump’s role in sending 400 U.S. marines to Syria. When asked how involved Trump was in that decision, Spicer said:"}, {"b50c": "“Obviously the president was made aware of that. This is something that was done in consultation. He understands the regional issues that need to be addressed there.”"}, {"56f9": "Bilal Sarwary, an Afghan journalist, said on Twitter that the bomb hit a series of tunnels that had been targeted by U.S. airstrikes in the past week, and it left at least 20 fighters dead."}, {"b7eb": "The U.S. war in Afghanistan is the longest war in U.S. history, stretching into its 16th year. It’s not clear why the administration chose to use this bomb, who authorized its use, or whether the administration has any answers as to how to end the conflict."}, {"5062": "The Trump administration’s foreign policy has been completely incoherent. Also on Thursday, the U.S.-led coalition in Syria accidentally bombed and killed Syrian forces fighting ISIS. The Washington Post called it “the worst confirmed friendly-fire incident” in the almost three-year war against ISIS."}, {"410d": "This administration has also killed an astonishing number of civilians abroad in a short amount of time. Last month, a U.S. airstrike in Mosul killed 200 civilians, and it took almost a week for the government to acknowledge it was responsible. U.S.-led attacks in Syria in the span of two weeks last month also killed at least 79 people. And Trump authorized a deadly U.S. raid in Yemen just five days into office, which killed at least 23 Yemeni civilians, including children."}, {"858a": "UPDATE:"}, {"c250": "After Spicer refused to comment on whether the president authorized the bombing, a reporter asked Trump whether or not he did so."}, {"f71b": "“Everybody knows exactly what happened,” Trump said later Thursday afternoon. “What I do is I authorize my military. We have the greatest military in the world and they’ve done a job, as usual.”"}, {"668c": "He did not give any more details."}], "child": "1529_1\t1529_2\t1529_3\t1529_4\t1529_5\t1529_6\t1529_7\t1529_8\t1529_9\t1529_10\t1529_11\t1529_12\t1529_131529_1\t1529_2\t1529_3\t1529_4\t1529_5\t1529_6\t1529_7\t1529_8\t1529_9\t1529_10\t1529_11\t1529_12\t1529_13"}