{"name": "1530", "parent": "", "content": "Rex Tillerson is wading into a diplomatic minefield on his Russia visit This should be fun. U.S. Secretary of State Rex Tillerson steps out of a plane upon arrival in Moscow’s Vnukovo airport, Russia, Tuesday, April 11, 2017. CREDIT: AP Photo/ Ivan Sekretarev By E.A. Crunden and Adrienne Mahsa Varkiani When Secretary of State Rex Tillerson departed for Moscow on Tuesday, he walked into a potential hinge point for U.S.-Russia diplomacy. Though President Donald Trump entered office promising warmer relations with his counterpart Vladimir Putin, last week’s U.S. strike against a Syrian airbase appears to have abruptly brought them back down to a chill. That means Tillerson, a former Exxon CEO with little to no diplomatic experience, will have his work cut out for him. The Kremlin has already said that Putin will not meet with Tillerson, despite once granting the diplomat the Russian Order of Friendship. Instead, Tillerson will likely be limited to discussions with Foreign Minister Sergei Lavrov and other top aides. A Kremlin spokesperson told Reuters that Putin might meet with Tillerson if it is deemed necessary. Here are some of the thorniest topics Tillerson is likely to broach with Lavrov during those talks. Human rights violations In the time since Putin took office, his regime has curtailed freedom of expression and allegedly assassinated political dissidents and journalists. Russia’s North Caucasus region has long been a source of turmoil for the country. Human Rights Watch has spent around two decades monitoring the area’s abuses, with specific emphasis on Chechnya and Dagestan, both of which have suffered under brutally repressive local governments. Of particular contemporary relevance is Chechnya, which is under the rule of Ramzan Kadyrov, a close Putin ally. Kadyrov has been accused of numerous human rights violations, including the torture and murder of his political opponents. A leading Russian opposition paper recently claimed that Chechen authorities were arresting and killing queer men, and several sources have gone so far as to claim that queer men are being sent to “concentration camps.” Alvi Karimov, a spokesman for Kaydrov, dismissed the claims out of hand — on the grounds that queer people do not exist. “You cannot arrest or repress people who just don’t exist in the republic,” he told the Interfax news agency. “If there were such people in Chechnya, the law-enforcement organs wouldn’t need to have anything to do with them because their relatives would send them somewhere from which there is no returning.” The Trump administration has sent mixed signals on LGBTQ rights, skewing negative. However, the current situation in Chechnya offers an opportunity to bring up Russia’s general attitudes towards its queer citizens. In 2013 the nation passed a law banning “gay propaganda,” and in 2016 the co-author of a Kremlin-backed study on HIV/AIDS suggested that the best protection against the virus was to “be in a heterosexual family where both partners are loyal to each other.” Syria Trump’s decision last week to order a missile strike on a Syrian airbase went over poorly with Russia. A close ally of Syrian dictator Bashar al-Assad, Russia has worked to safeguard the regime at all costs, providing military power and significant support. Soon after the strike, the Kremlin condemned the assault, and indicated that it would impact U.S-Russia relations. “[The action is] an aggression against a sovereign state in violation of the norms of international law, and under a trumped-up pretext at that,” Dmitry Peskov, a Kremlin representative, said at the time. In response to the strike, Russia froze an agreement with the United States guaranteeing that both nations would coordinate strikes over Syria, thereby avoiding direct collisions between aircraft carriers. Tensions with Russia have spiked significantly since the incident. On Tuesday, the Trump administration accused Russia of helping Syria to cover up the chemical weapons attack that prompted the strike. Trump, who once indicated that he was uninterested in removing Assad from power, has now done an about-face. As an ally, Russia has leverage with Assad, something that could prove valuable if the United States is serious about pushing for an end to the war. But while Tillerson has signaled he will urge Putin to distance himself from Assad, the Russian government has indicated that won’t happen. The 2016 U.S. election The U.S. intelligence community is still investigating Russian interference in the 2016 U.S. election. In July of last year, Wikileaks published emails from several key Democratic National Committee (DNC) staff members, as well as other sources, like John Podesta, Democratic nominee Hillary Clinton’s campaign manager. Wikileaks did not identify its source, but a hacker who goes by the name of “Guccifer 2.0” took credit for the leak. Since then, the U.S. intelligence community has confirmed that Guccifer 2.0 is linked to the Russian government, which intervened to help Trump win the election. The full investigations are still ongoing. Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org On Sunday, Tillerson suggested that Russia “needs to confront” its own interference in the U.S. election, as well as elections in Europe. “We will continue to talk with them about how this undermines any hope of improving relations, not just with the United States,” Tillerson said on ABC’s This Week, “but it’s pretty evident that they are taking similar tactics into electoral processes throughout Europe, and so they’re really undermining any hope for improved relations with many European countries as well.” It’s not clear just how much Tillerson will push those he speaks with for answers — especially given that both Congress and the Federal Bureau of Investigation are investigating allegations that members of Trump’s presidential campaign and administration might have tried to assist Russia’s attempts to sway the 2016 election. Tillerson, too, did business with Russian-owned companies Gazprom and Rosneft while he was CEO of ExxonMobil. Ukraine Russia’s relationship with Ukraine is a historically tense one, but the dynamic has grown more strained in recent years. In 2014, Russia annexed Crimea, a region of Ukraine. And pro-Russia separatists in eastern Ukraine have clashed with government troops repeatedly over the past few years, with the Ukrainian government accusing Russia of funding the separatists. More than 10,000 people have died in the violence, which has seen a resurgence this year. The Obama administration condemned the annexation of Crimea, but was oftentimes hesitant to press Russia on the issue. Trump, for his part, has sent mixed messages. Initially tepid on the topic, he weakened pro-Ukraine language in the GOP platform and expressed an openness to relaxing sanctions on Russia, a shift away from Obama-era policy. But after the dismissal of former National Security Advisor Michael Flynn (following revelations that he had conducted backchannel discussions about sanctions with Russian officials), the Trump administration seemed to reverse course. U.S. Ambassador Nikki Haley soundly criticized Russia in her first appearance at the U.N. Security Council, and asserted that sanctions would remain in place until Russian troops withdrew from Crimea. Trump himself has used similar language. Taking a swing at the Obama administration, he said in February that Crimea was “taken” by Russia and that the peninsula must be returned to Ukraine — something that is unlikely to go over well with Russia. Iran The Trump administration is clear in its anti-Iran position. Less than a month into Trump’s presidency, the White House banned all Iranian nationals from the country and declared that Iran was “on notice.” Russia and Iran have enjoyed generally warmer relations under Putin, and the two countries view Assad as an ally in the Syrian conflict. Both governments loudly condemned the U.S. strike last week. The Trump administration has said that Russia should distance itself from Iran. On Tuesday, Tillerson suggested that Russia would have to choose between close relations with Iran or the United States and “other Western countries.” “I think it’s also worth thinking about Russia has really aligned itself with the Assad regime, the Iranians, and Hizballah,” Tillerson said. “Is that a — is that a long-term alliance that serves Russia’s interest, or would Russia prefer to realign with the United States, with other Western countries and Middle East countries who are seeking to resolve the Syrian crisis?” It’s not clear this pressure will work. Or at least it’s “certainly not going to go anywhere now,” Alex Vatanka, an Iran expert at the Middle East Institute, told the Washington Post. Instead, “the opposite result has been achieved.” This piece has been updated with the news that Tillerson could meet Putin on Wednesday. ", "title": "Rex Tillerson is wading into a diplomatic minefield on his Russia visit", "sentences": [{"8341": "Rex Tillerson is wading into a diplomatic minefield on his Russia visit"}, {"fa94": "This should be fun."}, {"67c7": "U.S. Secretary of State Rex Tillerson steps out of a plane upon arrival in Moscow’s Vnukovo airport, Russia, Tuesday, April 11, 2017. CREDIT: AP Photo/ Ivan Sekretarev"}, {"e246": "By E.A. Crunden and Adrienne Mahsa Varkiani"}, {"17df": "When Secretary of State Rex Tillerson departed for Moscow on Tuesday, he walked into a potential hinge point for U.S.-Russia diplomacy. Though President Donald Trump entered office promising warmer relations with his counterpart Vladimir Putin, last week’s U.S. strike against a Syrian airbase appears to have abruptly brought them back down to a chill."}, {"347c": "That means Tillerson, a former Exxon CEO with little to no diplomatic experience, will have his work cut out for him. The Kremlin has already said that Putin will not meet with Tillerson, despite once granting the diplomat the Russian Order of Friendship. Instead, Tillerson will likely be limited to discussions with Foreign Minister Sergei Lavrov and other top aides. A Kremlin spokesperson told Reuters that Putin might meet with Tillerson if it is deemed necessary."}, {"5252": "Here are some of the thorniest topics Tillerson is likely to broach with Lavrov during those talks."}, {"c6a6": "Human rights violations"}, {"451d": "In the time since Putin took office, his regime has curtailed freedom of expression and allegedly assassinated political dissidents and journalists."}, {"31d9": "Russia’s North Caucasus region has long been a source of turmoil for the country. Human Rights Watch has spent around two decades monitoring the area’s abuses, with specific emphasis on Chechnya and Dagestan, both of which have suffered under brutally repressive local governments. Of particular contemporary relevance is Chechnya, which is under the rule of Ramzan Kadyrov, a close Putin ally. Kadyrov has been accused of numerous human rights violations, including the torture and murder of his political opponents. A leading Russian opposition paper recently claimed that Chechen authorities were arresting and killing queer men, and several sources have gone so far as to claim that queer men are being sent to “concentration camps.”"}, {"6f60": "Alvi Karimov, a spokesman for Kaydrov, dismissed the claims out of hand — on the grounds that queer people do not exist."}, {"9342": "“You cannot arrest or repress people who just don’t exist in the republic,” he told the Interfax news agency. “If there were such people in Chechnya, the law-enforcement organs wouldn’t need to have anything to do with them because their relatives would send them somewhere from which there is no returning.”"}, {"4b6b": "The Trump administration has sent mixed signals on LGBTQ rights, skewing negative. However, the current situation in Chechnya offers an opportunity to bring up Russia’s general attitudes towards its queer citizens. In 2013 the nation passed a law banning “gay propaganda,” and in 2016 the co-author of a Kremlin-backed study on HIV/AIDS suggested that the best protection against the virus was to “be in a heterosexual family where both partners are loyal to each other.”"}, {"85bc": "Syria"}, {"de80": "Trump’s decision last week to order a missile strike on a Syrian airbase went over poorly with Russia. A close ally of Syrian dictator Bashar al-Assad, Russia has worked to safeguard the regime at all costs, providing military power and significant support. Soon after the strike, the Kremlin condemned the assault, and indicated that it would impact U.S-Russia relations."}, {"7365": "“[The action is] an aggression against a sovereign state in violation of the norms of international law, and under a trumped-up pretext at that,” Dmitry Peskov, a Kremlin representative, said at the time."}, {"4e0f": "In response to the strike, Russia froze an agreement with the United States guaranteeing that both nations would coordinate strikes over Syria, thereby avoiding direct collisions between aircraft carriers. Tensions with Russia have spiked significantly since the incident."}, {"983a": "On Tuesday, the Trump administration accused Russia of helping Syria to cover up the chemical weapons attack that prompted the strike. Trump, who once indicated that he was uninterested in removing Assad from power, has now done an about-face."}, {"1c0f": "As an ally, Russia has leverage with Assad, something that could prove valuable if the United States is serious about pushing for an end to the war. But while Tillerson has signaled he will urge Putin to distance himself from Assad, the Russian government has indicated that won’t happen."}, {"07b7": "The 2016 U.S. election"}, {"63e6": "The U.S. intelligence community is still investigating Russian interference in the 2016 U.S. election."}, {"6334": "In July of last year, Wikileaks published emails from several key Democratic National Committee (DNC) staff members, as well as other sources, like John Podesta, Democratic nominee Hillary Clinton’s campaign manager. Wikileaks did not identify its source, but a hacker who goes by the name of “Guccifer 2.0” took credit for the leak. Since then, the U.S. intelligence community has confirmed that Guccifer 2.0 is linked to the Russian government, which intervened to help Trump win the election. The full investigations are still ongoing."}, {"0315": "Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org"}, {"28a5": "On Sunday, Tillerson suggested that Russia “needs to confront” its own interference in the U.S. election, as well as elections in Europe."}, {"452b": "“We will continue to talk with them about how this undermines any hope of improving relations, not just with the United States,” Tillerson said on ABC’s This Week, “but it’s pretty evident that they are taking similar tactics into electoral processes throughout Europe, and so they’re really undermining any hope for improved relations with many European countries as well.”"}, {"fc34": "It’s not clear just how much Tillerson will push those he speaks with for answers — especially given that both Congress and the Federal Bureau of Investigation are investigating allegations that members of Trump’s presidential campaign and administration might have tried to assist Russia’s attempts to sway the 2016 election. Tillerson, too, did business with Russian-owned companies Gazprom and Rosneft while he was CEO of ExxonMobil."}, {"e298": "Ukraine"}, {"daae": "Russia’s relationship with Ukraine is a historically tense one, but the dynamic has grown more strained in recent years. In 2014, Russia annexed Crimea, a region of Ukraine. And pro-Russia separatists in eastern Ukraine have clashed with government troops repeatedly over the past few years, with the Ukrainian government accusing Russia of funding the separatists. More than 10,000 people have died in the violence, which has seen a resurgence this year."}, {"6e56": "The Obama administration condemned the annexation of Crimea, but was oftentimes hesitant to press Russia on the issue. Trump, for his part, has sent mixed messages. Initially tepid on the topic, he weakened pro-Ukraine language in the GOP platform and expressed an openness to relaxing sanctions on Russia, a shift away from Obama-era policy."}, {"5e80": "But after the dismissal of former National Security Advisor Michael Flynn (following revelations that he had conducted backchannel discussions about sanctions with Russian officials), the Trump administration seemed to reverse course. U.S. Ambassador Nikki Haley soundly criticized Russia in her first appearance at the U.N. Security Council, and asserted that sanctions would remain in place until Russian troops withdrew from Crimea. Trump himself has used similar language. Taking a swing at the Obama administration, he said in February that Crimea was “taken” by Russia and that the peninsula must be returned to Ukraine — something that is unlikely to go over well with Russia."}, {"67f7": "Iran"}, {"533c": "The Trump administration is clear in its anti-Iran position. Less than a month into Trump’s presidency, the White House banned all Iranian nationals from the country and declared that Iran was “on notice.”"}, {"e6ed": "Russia and Iran have enjoyed generally warmer relations under Putin, and the two countries view Assad as an ally in the Syrian conflict. Both governments loudly condemned the U.S. strike last week."}, {"c8df": "The Trump administration has said that Russia should distance itself from Iran. On Tuesday, Tillerson suggested that Russia would have to choose between close relations with Iran or the United States and “other Western countries.”"}, {"c6f4": "“I think it’s also worth thinking about Russia has really aligned itself with the Assad regime, the Iranians, and Hizballah,” Tillerson said. “Is that a — is that a long-term alliance that serves Russia’s interest, or would Russia prefer to realign with the United States, with other Western countries and Middle East countries who are seeking to resolve the Syrian crisis?”"}, {"93c2": "It’s not clear this pressure will work. Or at least it’s “certainly not going to go anywhere now,” Alex Vatanka, an Iran expert at the Middle East Institute, told the Washington Post. Instead, “the opposite result has been achieved.”"}, {"bf93": "This piece has been updated with the news that Tillerson could meet Putin on Wednesday."}], "child": "1530_1"}