{"name": "1531", "parent": "", "content": "Trump’s tough talk on China suddenly evaporates He called them the “world champions” of currency manipulation just 10 days ago. President Donald Trump speaks during a bilateral meeting with Chinese President Xi Jinping at Mar-a-Lago, Friday, April 7, 2017. CREDIT: AP Photo/Alex Brandon Candidate Trump repeatedly promised to hold China accountable and penalize the country for being a “currency manipulator.” But less than three months after his inauguration, President Trump publicly announced he won’t follow through after all. In an interview with the Wall Street Journal, Trump said the dollar was getting too strong because he inspires confidence, and though a strong dollar makes it hard to compete with countries that manipulate their currency, he will not accuse China of currency manipulation. “I think our dollar is getting too strong, and partially that’s my fault because people have confidence in me. But that’s hurting — that will hurt ultimately,” he added. “Look, there’s some very good things about a strong dollar, but usually speaking the best thing about it is that it sounds good.” He continued, “It’s very, very hard to compete when you have a strong dollar and other countries are devaluing their currency.” Mr. Trump said the reason he has changed his mind on one of his signature campaign promises is that China hasn’t been manipulating its currency for months and because taking the step now could jeopardize his talks with Beijing on confronting the threat of North Korea. “They’re not currency manipulators,” Mr. Trump said. The Treasury Department is due to release a report on currency manipulation soon, according to the Washington Post, and experts have noticed that China is intervening to raise the value of its currency, not to suppress it. On April 2 of this year, ten days before the Wall Street Journal interview was released, Trump called China the “world champions” of currency manipulation and devaluations in an interview with the Financial Times. Screenshot from the Financial Times interview But Trump made labeling China a currency manipulator a signature campaign issue and a regular applause line at rallies. It became a central part of his trade policy. Candidate Trump said that on his first day in office, “I will direct my Secretary of the Treasury to label China a currency manipulator. China is a currency manipulator.” Not only did this amount to one of 34 “Day One” promises Trump broke after being sworn into office, but Wednesday’s news makes clear that the promise will remain broken on Day 100. Last September, Trump told the Economic Club of New York that not only would he tell his Treasury Secretary to label China a currency manipulator, he would also apply tariffs to such countries: I’m going to instruct my Treasury Secretary to label China, and I like China, they’re my tenant, they buy condos all the time, they’re just fine, but you know what, they’re a currency manipulator and we’re going to apply tariffs to any country that devalues its currency to gain an unfair advantage over the United States. In August of 2015, he said that the the Chinese delegation would receive a McDonald’s hamburger (“probably a double size Big Mac”) instead of a state dinner in retaliation for currency manipulation. “Because you can’t continue to devalue,” Trump said on Fox News. In February of 2016 Trump said, “and if they don’t stop devaluing we’re going to have to charge them a tax on the goods coming in.” And after winning the Florida primary, Trump waxed economical about trade policy: Can I tell you what’s going to happen? When China thinks you mean it, when think they you mean it, they’re going to stop manipulating the currency and you won’t have to do anything, and you might even have free trade. Currency manipulation is a legitimate issue to address when it comes to trade policy. As ThinkProgress’ Bryce Covert reported in March of last year: Key for [Robert Scott, senior economist and director of trade and manufacturing at the left-leaning Economic Policy Institute] is tackling China’s currency manipulation and any other countries that may be artificially holding down the values of their currencies. If China’s policies keep the value of the yuan lower than where it would be without intervention, that makes it cheaper for the goods and services they price in that cheaper currency for other countries to buy. “It acts like a subsidy to everything that China and other countries export to the U.S.,” he said, and it “acts like a tax on all U.S. exports to China and to every country where we compete with China in the world.” After news broke that Trump would not be labeling China a currency manipulator and would also like to see a weaker dollar, the value of the dollar fell sharply, before regaining some of its losses. Promises, and words, matter. ", "title": "Trump’s tough talk on China suddenly evaporates", "sentences": [{"7fde": "Trump’s tough talk on China suddenly evaporates"}, {"5307": "He called them the “world champions” of currency manipulation just 10 days ago."}, {"43d0": "President Donald Trump speaks during a bilateral meeting with Chinese President Xi Jinping at Mar-a-Lago, Friday, April 7, 2017. CREDIT: AP Photo/Alex Brandon"}, {"31d4": "Candidate Trump repeatedly promised to hold China accountable and penalize the country for being a “currency manipulator.” But less than three months after his inauguration, President Trump publicly announced he won’t follow through after all."}, {"df0f": "In an interview with the Wall Street Journal, Trump said the dollar was getting too strong because he inspires confidence, and though a strong dollar makes it hard to compete with countries that manipulate their currency, he will not accuse China of currency manipulation."}, {"ccb0": "“I think our dollar is getting too strong, and partially that’s my fault because people have confidence in me. But that’s hurting — that will hurt ultimately,” he added. “Look, there’s some very good things about a strong dollar, but usually speaking the best thing about it is that it sounds good.”"}, {"8568": "He continued, “It’s very, very hard to compete when you have a strong dollar and other countries are devaluing their currency.”"}, {"b627": "Mr. Trump said the reason he has changed his mind on one of his signature campaign promises is that China hasn’t been manipulating its currency for months and because taking the step now could jeopardize his talks with Beijing on confronting the threat of North Korea."}, {"3c59": "“They’re not currency manipulators,” Mr. Trump said."}, {"7732": "The Treasury Department is due to release a report on currency manipulation soon, according to the Washington Post, and experts have noticed that China is intervening to raise the value of its currency, not to suppress it."}, {"6fea": "On April 2 of this year, ten days before the Wall Street Journal interview was released, Trump called China the “world champions” of currency manipulation and devaluations in an interview with the Financial Times."}, {"25f9": "Screenshot from the Financial Times interview"}, {"a065": "But Trump made labeling China a currency manipulator a signature campaign issue and a regular applause line at rallies. It became a central part of his trade policy."}, {"67ea": "Candidate Trump said that on his first day in office, “I will direct my Secretary of the Treasury to label China a currency manipulator. China is a currency manipulator.”"}, {"3968": "Not only did this amount to one of 34 “Day One” promises Trump broke after being sworn into office, but Wednesday’s news makes clear that the promise will remain broken on Day 100."}, {"811c": "Last September, Trump told the Economic Club of New York that not only would he tell his Treasury Secretary to label China a currency manipulator, he would also apply tariffs to such countries:"}, {"be92": "I’m going to instruct my Treasury Secretary to label China, and I like China, they’re my tenant, they buy condos all the time, they’re just fine, but you know what, they’re a currency manipulator and we’re going to apply tariffs to any country that devalues its currency to gain an unfair advantage over the United States."}, {"0cd2": "In August of 2015, he said that the the Chinese delegation would receive a McDonald’s hamburger (“probably a double size Big Mac”) instead of a state dinner in retaliation for currency manipulation. “Because you can’t continue to devalue,” Trump said on Fox News."}, {"572d": "In February of 2016 Trump said, “and if they don’t stop devaluing we’re going to have to charge them a tax on the goods coming in.”"}, {"f3db": "And after winning the Florida primary, Trump waxed economical about trade policy:"}, {"0260": "Can I tell you what’s going to happen? When China thinks you mean it, when think they you mean it, they’re going to stop manipulating the currency and you won’t have to do anything, and you might even have free trade."}, {"a3c5": "Currency manipulation is a legitimate issue to address when it comes to trade policy. As ThinkProgress’ Bryce Covert reported in March of last year:"}, {"93d4": "Key for [Robert Scott, senior economist and director of trade and manufacturing at the left-leaning Economic Policy Institute] is tackling China’s currency manipulation and any other countries that may be artificially holding down the values of their currencies. If China’s policies keep the value of the yuan lower than where it would be without intervention, that makes it cheaper for the goods and services they price in that cheaper currency for other countries to buy. “It acts like a subsidy to everything that China and other countries export to the U.S.,” he said, and it “acts like a tax on all U.S. exports to China and to every country where we compete with China in the world.”"}, {"123d": "After news broke that Trump would not be labeling China a currency manipulator and would also like to see a weaker dollar, the value of the dollar fell sharply, before regaining some of its losses."}, {"ff6f": "Promises, and words, matter."}], "child": "1531_1\t1531_2\t1531_3\t1531_4\t1531_5"}