{"name": "1532", "parent": "", "content": "NatSec adviser says “we’re prepared to do more” as Russia hints current U.S. strategy could mean war Trump’s top national security adviser Lt. Gen. H.R. McMaster suggests Russia had to know Syria was plotting chemical attack. President Donald Trump, right, listens as Army Lt. Gen. H.R. McMaster, left, talks at Trump’s Mar-a-Lago estate in Palm Beach, Fla. in February. CREDIT: AP Photo/Susan Walsh In his first interview as President Donald Trump’s top national security adviser, Lt. Gen. H.R. McMaster on Sunday backed the U.S. missile attack on Syria last week, saying “we’re prepared to do more,” even as Russian officials hint that current U.S. strategy could mean war. McMaster told Fox News Sunday host Chris Wallace the “president acted decisively” and that while the strike wasn’t meant to take out all of Syria’s capabilities, “it was a strong signal that the U.S. will not stand idly by.” When Wallace asked what the United States will do if Russia defends its interests in Syria, mentioning Russian Prime Minister Dmitry Medvedev’s comments Friday that the U.S. missile strike in Syria put the two countries “on the verge of a military clash,” McMaster stood firm on his position that Russia is “part of the problem” and should become “part of the solution.” “This is part of the problem with Syria, Russia’s sponsorship of [Syrian President Bashar al-Assad’s] murderous regime. If we would want to appeal rationally to Russia,” McMaster said. “This is a great opportunity for the Russian leadership to reevaluate what they are doing. Why they are supporting a regime that is committing mass murder against its own people. So, Russia could be part of the solution. Right now I think everyone in the world sees Russia as part of the problem.” McMaster continued, insinuating that he believed Russia had to be knowledgeable of Syria’s plan to launch a chemical attack. “I think what we should do is ask Russia how could it be, if you have advisors at that airfield, that you didn’t know that the Syrian Air Force was preparing and executing a mass murder attack with chemical weapons? I think we ought to ask them that question.” The U.S. military strategy on Syria has complicated Trump’s attempt to warm relations with Russia. McMaster said “the president is determined to do everything he can to advance American interests” and Secretary of State Rex Tillerson is scheduled to meet with Russian officials this week in Moscow. Voice of America reported Sunday that a scheduled meeting with Russian President Vladimir Putin has been cancelled. But for Russia or any other nation, McMaster said, supporting Syria’s regime isn’t in its best interest, and Russia ultimately decides the kind of relationship it wants with the United States. “It can be whatever they wanted to be,” McMaster said. “Do they want to be a relationship in which we can find areas of cooperation that are in our mutual interest? How was it in anyone’s interest that this conflict in Syria and this catastrophe in the greater Middle East continue?” ", "title": "NatSec adviser says “we’re prepared to do more” as Russia hints current U.S. strategy could mean war", "sentences": [{"485b": "NatSec adviser says “we’re prepared to do more” as Russia hints current U.S. strategy could mean war"}, {"e459": "Trump’s top national security adviser Lt. Gen. H.R. McMaster suggests Russia had to know Syria was plotting chemical attack."}, {"692e": "President Donald Trump, right, listens as Army Lt. Gen. H.R. McMaster, left, talks at Trump’s Mar-a-Lago estate in Palm Beach, Fla. in February. CREDIT: AP Photo/Susan Walsh"}, {"8c50": "In his first interview as President Donald Trump’s top national security adviser, Lt. Gen. H.R. McMaster on Sunday backed the U.S. missile attack on Syria last week, saying “we’re prepared to do more,” even as Russian officials hint that current U.S. strategy could mean war."}, {"7933": "McMaster told Fox News Sunday host Chris Wallace the “president acted decisively” and that while the strike wasn’t meant to take out all of Syria’s capabilities, “it was a strong signal that the U.S. will not stand idly by.”"}, {"e69c": "When Wallace asked what the United States will do if Russia defends its interests in Syria, mentioning Russian Prime Minister Dmitry Medvedev’s comments Friday that the U.S. missile strike in Syria put the two countries “on the verge of a military clash,” McMaster stood firm on his position that Russia is “part of the problem” and should become “part of the solution.”"}, {"c269": "“This is part of the problem with Syria, Russia’s sponsorship of [Syrian President Bashar al-Assad’s] murderous regime. If we would want to appeal rationally to Russia,” McMaster said. “This is a great opportunity for the Russian leadership to reevaluate what they are doing. Why they are supporting a regime that is committing mass murder against its own people. So, Russia could be part of the solution. Right now I think everyone in the world sees Russia as part of the problem.”"}, {"5415": "McMaster continued, insinuating that he believed Russia had to be knowledgeable of Syria’s plan to launch a chemical attack."}, {"c483": "“I think what we should do is ask Russia how could it be, if you have advisors at that airfield, that you didn’t know that the Syrian Air Force was preparing and executing a mass murder attack with chemical weapons? I think we ought to ask them that question.”"}, {"0683": "The U.S. military strategy on Syria has complicated Trump’s attempt to warm relations with Russia. McMaster said “the president is determined to do everything he can to advance American interests” and Secretary of State Rex Tillerson is scheduled to meet with Russian officials this week in Moscow. Voice of America reported Sunday that a scheduled meeting with Russian President Vladimir Putin has been cancelled."}, {"f44d": "But for Russia or any other nation, McMaster said, supporting Syria’s regime isn’t in its best interest, and Russia ultimately decides the kind of relationship it wants with the United States."}, {"d18b": "“It can be whatever they wanted to be,” McMaster said. “Do they want to be a relationship in which we can find areas of cooperation that are in our mutual interest? How was it in anyone’s interest that this conflict in Syria and this catastrophe in the greater Middle East continue?”"}], "child": "1532_1\t1532_2\t1532_3"}