{"name": "1533", "parent": "", "content": "CIA Director Pompeo denounces Wikileaks, forgets he used them to attack Hillary Clinton How convenient. During a speech at The Center for Strategic and International Studies on Thursday, CIA Director Mike Pompeo denounced Wikileaks, saying the organization “walks like a hostile intelligence service and talks like a hostile intelligence service.” “It’s time to call out Wikileaks for what it is — a non-state hostile intelligence service often abetted by state actors like Russia,” he said. Pompeo went on to discuss the U.S. intelligence community’s conclusion “that Russian military intelligence — the GRU — had used Wikileaks to release data of U.S. victims that the GRU had obtained through cyber operations against the Democratic National Committee.” But during the presidential campaign, Pompeo — then a Republican U.S. representative from Kansas — tweeted out an article about hacked Democratic National Committee emails to attack Democrats. “Need further proof that the fix was in from Pres. Obama on down? BUSTED: 19,252 Emails from DNC Leaked by Wikileaks,” Pompeo’s since-deleted July 24 tweet read. Pompeo was grilled about that tweet during his confirmation hearing to become CIA director. Though he touted the hacked emails published by Wikileaks in July, Pompeo told Sen. Angus King (I-ME) he “never believed that Wikileaks was a credible source of information.” But Pompeo should’ve known better than to publish that tweet on July 24. The Washington Post first linked Russian hackers to the DNC hack on June 14, with hacked DNC emails first appearing online the next day. Wikileaks itself published 20,000 hacked DNC emails on July 22, just ahead of the Democratic National Convention — but none of that apparently caused Pompeo to second guess amplifying their work two days later. Pompeo’s comments on Thursday are also uncomfortable in light of Trump’s effusive praise for Wikileaks on the campaign trail. During a rally in October in Pennsylvania, Trump said “I love Wikileaks!” while the crowd chanted, “Lock her up!” “It’s amazing how nothing is secret today when you talk about the internet,” Trump added, before reading aloud the contents of emails hacked from the Clinton campaign and leaked to Wikileaks. Trump mentioned Wikileaks 164 times during the last month of the election. Nonetheless, in January Trump said the information published by Wikileaks had “absolutely no effect on the outcome of the election.” Since his inauguration, Trump has repeatedly downplayed the scandal surrounding his administration’s ties with Russia and asserted that people should instead focus on leakers who make his administration look bad. While the extent of the Trump campaign’s possible collusion with Russian hackers remains unclear, in March news broke that Roger Stone, a longtime Trump confidant and adviser, exchanged direct messages on Twitter with Guccifer 2.0 — an account the U.S. intelligence community believes was used as a front for hackers directed by the Russian government. In an August 17 message, Guccifer 2.0 offered to help Stone. “i’m pleased to say that u r great man,” Guccifer 2.0 wrote to Stone. “please tell me if i can help u anyhow. it would be a great pleasure to me.” Wikileaks served Pompeo’s purposes while he was trying to bring down Hillary Clinton, but the situation has changed now that he’s running the CIA. In March, WikiLeaks published “thousands of pages describing sophisticated software tools and techniques used by the [CIA] to break into smartphones, computers and even Internet-connected televisions,” the New York Times reported. UPDATE: Wikileaks trolled Pompeo for amplifying their leaks during the campaign before turning against them as CIA director. ", "title": "CIA Director Pompeo denounces Wikileaks, forgets he used them to attack Hillary Clinton", "sentences": [{"fd23": "CIA Director Pompeo denounces Wikileaks, forgets he used them to attack Hillary Clinton"}, {"5e1f": "How convenient."}, {"e548": "During a speech at The Center for Strategic and International Studies on Thursday, CIA Director Mike Pompeo denounced Wikileaks, saying the organization “walks like a hostile intelligence service and talks like a hostile intelligence service.”"}, {"351b": "“It’s time to call out Wikileaks for what it is — a non-state hostile intelligence service often abetted by state actors like Russia,” he said."}, {"854f": "Pompeo went on to discuss the U.S. intelligence community’s conclusion “that Russian military intelligence — the GRU — had used Wikileaks to release data of U.S. victims that the GRU had obtained through cyber operations against the Democratic National Committee.”"}, {"9558": "But during the presidential campaign, Pompeo — then a Republican U.S. representative from Kansas — tweeted out an article about hacked Democratic National Committee emails to attack Democrats."}, {"2f1b": "“Need further proof that the fix was in from Pres. Obama on down? BUSTED: 19,252 Emails from DNC Leaked by Wikileaks,” Pompeo’s since-deleted July 24 tweet read."}, {"8f91": "Pompeo was grilled about that tweet during his confirmation hearing to become CIA director. Though he touted the hacked emails published by Wikileaks in July, Pompeo told Sen. Angus King (I-ME) he “never believed that Wikileaks was a credible source of information.”"}, {"9fa7": "But Pompeo should’ve known better than to publish that tweet on July 24. The Washington Post first linked Russian hackers to the DNC hack on June 14, with hacked DNC emails first appearing online the next day. Wikileaks itself published 20,000 hacked DNC emails on July 22, just ahead of the Democratic National Convention — but none of that apparently caused Pompeo to second guess amplifying their work two days later."}, {"8ef5": "Pompeo’s comments on Thursday are also uncomfortable in light of Trump’s effusive praise for Wikileaks on the campaign trail."}, {"c7ef": "During a rally in October in Pennsylvania, Trump said “I love Wikileaks!” while the crowd chanted, “Lock her up!”"}, {"f69a": "“It’s amazing how nothing is secret today when you talk about the internet,” Trump added, before reading aloud the contents of emails hacked from the Clinton campaign and leaked to Wikileaks."}, {"9711": "Trump mentioned Wikileaks 164 times during the last month of the election."}, {"8953": "Nonetheless, in January Trump said the information published by Wikileaks had “absolutely no effect on the outcome of the election.”"}, {"3c5c": "Since his inauguration, Trump has repeatedly downplayed the scandal surrounding his administration’s ties with Russia and asserted that people should instead focus on leakers who make his administration look bad."}, {"5a09": "While the extent of the Trump campaign’s possible collusion with Russian hackers remains unclear, in March news broke that Roger Stone, a longtime Trump confidant and adviser, exchanged direct messages on Twitter with Guccifer 2.0 — an account the U.S. intelligence community believes was used as a front for hackers directed by the Russian government."}, {"d302": "In an August 17 message, Guccifer 2.0 offered to help Stone."}, {"8527": "“i’m pleased to say that u r great man,” Guccifer 2.0 wrote to Stone. “please tell me if i can help u anyhow. it would be a great pleasure to me.”"}, {"6683": "Wikileaks served Pompeo’s purposes while he was trying to bring down Hillary Clinton, but the situation has changed now that he’s running the CIA."}, {"26fe": "In March, WikiLeaks published “thousands of pages describing sophisticated software tools and techniques used by the [CIA] to break into smartphones, computers and even Internet-connected televisions,” the New York Times reported."}, {"8011": "UPDATE: Wikileaks trolled Pompeo for amplifying their leaks during the campaign before turning against them as CIA director."}], "child": "1533_11533_1"}