{"name": "1534", "parent": "", "content": "Trump won’t let reality stop him from lying about Susan Rice Despite overwhelming evidence to the contrary, Trump still wants you to believe he was a victim of inappropriate surveillance. CREDIT: Fox Business screengrab On Tuesday evening, CNN reported that both Republican and Democratic sources say the intelligence reports House Intelligence Committee Chairman Devin Nunes (R-CA) touted in a clumsy attempt to validate President Trump’s accusation that President Obama wiretapped him are nothingburgers. On March 22, Nunes said that while there was no indication unlawful survaillance of Trump transition officials occurred, the reports in question were concerning to him because U.S. citizens’ identities were revealed, or “unmasked,” in them. Subsequent reports indicated former national security adviser Susan Rice requested the unmasking. The totally phony Susan Rice story, explainedThe former national security advisor’s surveillance activity is neither illegal or unethical.thinkprogress.org Early this month, Trump went as far as to tell the New York Times that he thought Rice had committed a crime. “I think it’s going to be the biggest story,” Trump said. “It’s such an important story for our country and the world. It is one of the big stories of our time.” Rice, however, denied any wrongdoing. During an MSNBC interview, she explained that she was just doing her job. “There were occasions when I would receive a report in which a U.S. person was referred to, name not provided, just a U.S. person, and sometimes in that context in order to understand the importance of that report, and assess its significance, it was necessary to find out or request the information as to who that U.S. official was,” she said. CNN’s report vindicates Rice. The intelligence reports in question, which lawmakers and staff recently had a chance to review at NSA headquarters in Fort Meade, Maryland, were described by “normal and appropriate” by one congressional intelligence source CNN spoke with. “And another source said there’s ‘absolutely’ no smoking gun in the reports, urging the White House to declassify them to make clear there was nothing alarming in the documents,” CNN reports. In short, Nunes had no good reason to be concerned in the first place, and Trump had no good reason to cite Nunes’ concern about the intelligence reports as somehow validating his reckless, evidence-free accusation. Nonetheless, during a Fox Business interview that aired Wednesday morning, Trump was still suggesting some sort of inappropriate surveillance occurred and that Nunes’ intelligence reports validated him. “When you look at Susan Rice and what’s going on, and so many people are coming up to me and apologizing now,” Trump said. “They’re saying, ‘you were right when you said that.’ Perhaps I didn’t know how right I was because nobody knew the extent of it.” Trump again characterized the Rice story as “such a big story, and I’m sure it will continue forward, but what they did is horrible.” In other words, even though the notion that Trump and his inner-circle were victims of inappropriate surveillance has now been debunked, don’t expect the president to stop lying about it anytime soon. Meanwhile, the Washington Post broke news on Tuesday night that the FBI secured a secret warrant to monitor communications from Trump foreign policy adviser Carter Page last summer. That story emerged on the same day the Associated Press reported that newly obtained financial records confirm former Trump campaign chairman Paul Manafort received at least $1.2 million in secret payments from a pro-Russian Ukrainian political party. Those stories are the latest indication among many that the intelligence community actually had good reason to be concerned about the relationship between the Trump campaign and Russian officials. ", "title": "Trump won’t let reality stop him from lying about Susan Rice", "sentences": [{"9d0d": "Trump won’t let reality stop him from lying about Susan Rice"}, {"3b67": "Despite overwhelming evidence to the contrary, Trump still wants you to believe he was a victim of inappropriate surveillance."}, {"afd4": "CREDIT: Fox Business screengrab"}, {"024e": "On Tuesday evening, CNN reported that both Republican and Democratic sources say the intelligence reports House Intelligence Committee Chairman Devin Nunes (R-CA) touted in a clumsy attempt to validate President Trump’s accusation that President Obama wiretapped him are nothingburgers."}, {"7a94": "On March 22, Nunes said that while there was no indication unlawful survaillance of Trump transition officials occurred, the reports in question were concerning to him because U.S. citizens’ identities were revealed, or “unmasked,” in them. Subsequent reports indicated former national security adviser Susan Rice requested the unmasking."}, {"1691": "The totally phony Susan Rice story, explainedThe former national security advisor’s surveillance activity is neither illegal or unethical.thinkprogress.org"}, {"87dc": "Early this month, Trump went as far as to tell the New York Times that he thought Rice had committed a crime."}, {"3bdf": "“I think it’s going to be the biggest story,” Trump said. “It’s such an important story for our country and the world. It is one of the big stories of our time.”"}, {"e53b": "Rice, however, denied any wrongdoing. During an MSNBC interview, she explained that she was just doing her job."}, {"9936": "“There were occasions when I would receive a report in which a U.S. person was referred to, name not provided, just a U.S. person, and sometimes in that context in order to understand the importance of that report, and assess its significance, it was necessary to find out or request the information as to who that U.S. official was,” she said."}, {"0fa9": "CNN’s report vindicates Rice. The intelligence reports in question, which lawmakers and staff recently had a chance to review at NSA headquarters in Fort Meade, Maryland, were described by “normal and appropriate” by one congressional intelligence source CNN spoke with."}, {"15fa": "“And another source said there’s ‘absolutely’ no smoking gun in the reports, urging the White House to declassify them to make clear there was nothing alarming in the documents,” CNN reports."}, {"f622": "In short, Nunes had no good reason to be concerned in the first place, and Trump had no good reason to cite Nunes’ concern about the intelligence reports as somehow validating his reckless, evidence-free accusation."}, {"7474": "Nonetheless, during a Fox Business interview that aired Wednesday morning, Trump was still suggesting some sort of inappropriate surveillance occurred and that Nunes’ intelligence reports validated him."}, {"d79c": "“When you look at Susan Rice and what’s going on, and so many people are coming up to me and apologizing now,” Trump said. “They’re saying, ‘you were right when you said that.’ Perhaps I didn’t know how right I was because nobody knew the extent of it.”"}, {"775b": "Trump again characterized the Rice story as “such a big story, and I’m sure it will continue forward, but what they did is horrible.” In other words, even though the notion that Trump and his inner-circle were victims of inappropriate surveillance has now been debunked, don’t expect the president to stop lying about it anytime soon."}, {"2243": "Meanwhile, the Washington Post broke news on Tuesday night that the FBI secured a secret warrant to monitor communications from Trump foreign policy adviser Carter Page last summer. That story emerged on the same day the Associated Press reported that newly obtained financial records confirm former Trump campaign chairman Paul Manafort received at least $1.2 million in secret payments from a pro-Russian Ukrainian political party."}, {"9757": "Those stories are the latest indication among many that the intelligence community actually had good reason to be concerned about the relationship between the Trump campaign and Russian officials."}], "child": "1534_1\t1534_2\t1534_3\t1534_4\t1534_5\t1534_6\t1534_7\t1534_8\t1534_9\t1534_10\t1534_11\t1534_12\t1534_13\t1534_14\t1534_15\t1534_16\t1534_17\t1534_18\t1534_19\t1534_20\t1534_21\t1534_22"}