{"name": "1535", "parent": "", "content": "Federal judge found probable cause that Trump adviser was acting as a Russian agent Carter Page maintains he did nothing wrong. Carter Page, a former foreign policy adviser of U.S. President-elect Donald Trump, speaks at a news conference at RIA Novosti news agency in Moscow, Russia, Monday, Dec. 12, 2016. Page said he was in Moscow on a visit to meet with businessmen and politicians. CREDIT: AP Photo/Pavel Golovkin The FBI secured a secret warrant to monitor communications from Trump foreign policy adviser Carter Page last summer, the Washington Post reports. The warrant, secured under the Federal Intelligence Surveillance Act (FISA), means the FBI convinced a federal judge that there was probable cause to believe that Page was acting as an “agent of a foreign power”—in this case, Russia. 50 U.S. Code § 1801 The Trump campaign has sought to minimize Page’s role. But when asked to name his “foreign policy team” in an interview with the Washington Post last March, Trump volunteered Page’s name. He was one of just four individuals that Trump mentioned. BuzzFeed recently reported that Page “met with and passed documents to a Russian intelligence operative in New York City in 2013.” According to FBI Director Jim Comey, there is an ongoing FBI investigation into whether Trump associates colluded with Russia in their efforts to interfere with the presidential election. CNN and the New York Times have reported that there were frequent contacts between Trump associates and Russian operatives during the campaign. Page has denied any wrongdoing, and he volunteered to testify before the House Intelligence Committee. He said he served as a Trump adviser until September 2016 and resigned because “these stories kept coming out.” In July, he traveled to Moscow in a trip authorized by the campaign. While there, Page delivered a speech harshly critical of U.S. policy toward Russia. “Washington and other western capitals have impeded potential progress through their often hypocritical focus on ideas such democratization, inequality, corruption, and regime change,” Page said. Page acknowledged meeting the Russian ambassador during the Republican convention in Cleveland and giving him a business card. He did not previously disclose the meeting “out of respect for privacy for Ambassador Kislyak.” When asked how he gained his position in the Trump campaign, Page refused to answer. He also refused to say whether he’s been contacted by the FBI. Page told the Washington Post that news of the FISA warrant “confirms all of my suspicions about unjustified, politically motivated government surveillance.” He then compared himself to MLK, Jr. ", "title": "Federal judge found probable cause that Trump adviser was acting as a Russian agent", "sentences": [{"9173": "Federal judge found probable cause that Trump adviser was acting as a Russian agent"}, {"eb0f": "Carter Page maintains he did nothing wrong."}, {"6196": "Carter Page, a former foreign policy adviser of U.S. President-elect Donald Trump, speaks at a news conference at RIA Novosti news agency in Moscow, Russia, Monday, Dec. 12, 2016. Page said he was in Moscow on a visit to meet with businessmen and politicians. CREDIT: AP Photo/Pavel Golovkin"}, {"fe94": "The FBI secured a secret warrant to monitor communications from Trump foreign policy adviser Carter Page last summer, the Washington Post reports."}, {"7d17": "The warrant, secured under the Federal Intelligence Surveillance Act (FISA), means the FBI convinced a federal judge that there was probable cause to believe that Page was acting as an “agent of a foreign power”—in this case, Russia."}, {"4e8a": "50 U.S. Code § 1801"}, {"d785": "The Trump campaign has sought to minimize Page’s role. But when asked to name his “foreign policy team” in an interview with the Washington Post last March, Trump volunteered Page’s name. He was one of just four individuals that Trump mentioned."}, {"d523": "BuzzFeed recently reported that Page “met with and passed documents to a Russian intelligence operative in New York City in 2013.”"}, {"dd38": "According to FBI Director Jim Comey, there is an ongoing FBI investigation into whether Trump associates colluded with Russia in their efforts to interfere with the presidential election."}, {"940c": "CNN and the New York Times have reported that there were frequent contacts between Trump associates and Russian operatives during the campaign."}, {"000c": "Page has denied any wrongdoing, and he volunteered to testify before the House Intelligence Committee. He said he served as a Trump adviser until September 2016 and resigned because “these stories kept coming out.”"}, {"4247": "In July, he traveled to Moscow in a trip authorized by the campaign. While there, Page delivered a speech harshly critical of U.S. policy toward Russia. “Washington and other western capitals have impeded potential progress through their often hypocritical focus on ideas such democratization, inequality, corruption, and regime change,” Page said."}, {"7af5": "Page acknowledged meeting the Russian ambassador during the Republican convention in Cleveland and giving him a business card. He did not previously disclose the meeting “out of respect for privacy for Ambassador Kislyak.”"}, {"6386": "When asked how he gained his position in the Trump campaign, Page refused to answer. He also refused to say whether he’s been contacted by the FBI."}, {"a75a": "Page told the Washington Post that news of the FISA warrant “confirms all of my suspicions about unjustified, politically motivated government surveillance.” He then compared himself to MLK, Jr."}], "child": "1535_1\t1535_2\t1535_3\t1535_4\t1535_5"}