{"name": "1536", "parent": "", "content": "Republican now leading Russia probe has a history of making wild claims in defense of Trump The new Devin Nunes is a lot like the old Devin Nunes. Rep. Mike Conaway, R-Texas, at a House Permanent Select Committee on Intelligence hearing on June 18, 2013. CREDIT: AP Photo/Charles Dharapak On Thursday, House Intelligence Committee Chair Devin Nunes (R-CA) announced he was stepping down from the investigation into Russian meddling in the election. Nunes blamed “accusations” by “several leftwing activist groups” for triggering an actually-very-real investigation into Nunes’ alleged improper handling of intelligence. His chosen replacement? Rep. Mike Conaway (R-TX), a senior member of the committee, and a strong Trump supporter during the campaign. That support has not waned since Trump was elected and could cause problems for someone taking over an investigation marred by accusations of collusion with the White House. Conaway, who is now charged with investigating Russian meddling in the 2016 election, compared Russian cyber attacks on Democrats to Mexican entertainers energizing Democratic voters. He told the Dallas Morning News in January: Harry Reid and the Democrats brought in Mexican soap opera stars, singers and entertainers who had immense influence in those communities into Las Vegas, to entertain, get out the vote and so forth. Those are foreign actors, foreign people, influencing the vote in Nevada. You don’t hear the Democrats screaming and saying one word about that. Asked if this was really the same as Russian email hacking of private information to support one candidate, Conaway said, “Sure it is, it’s foreign influence. If we’re worried about foreign influence, let’s have the whole story.” He pointed to the Democratic electoral success in Nevada in 2016, saying the Mexican singers who campaigned there “are monster in the Hispanic community.” “He knows there’s a big difference between Vicente Fernandez performing at a Hillary Clinton event and Vladimir Putin ordering interference with our elections,” fellow Intelligence Committee member Rep. Joaquin Castro (D-TX) said in response. “The intelligence community has indicated that Vladimir Putin essentially ordered cyberwarfare, and nothing else compares to that.” Prior to the election, Conaway hewed to the traditional Republican position more critical of Russian aggression, stating on his congressional website in 2014 that Putin is a “megalomaniac” and that his aggressive actions were “unacceptable.” Since the election, Conaway’s website has been quiet when it comes to Russian actions against the United States. Conaway: “That might work on Saturday afternoon when my wife’s [Texas Tech] Red Raiders are playing the Texas Longhorns — she really likes the Red Raiders. … The logic is that because [Putin] really didn’t like presidential candidate Clinton that he automatically liked Trump? That assessment is based on what?” Comey: “It’s based on more than that, but part of it … is the logic. Whoever the Red Raiders are playing, you want the Red Raiders to win, by definition you want their opponents to lose.” Conaway: “I know, but this says … [Russia] wanted both of them, her to lose and him to win.” Comey: “They’re inseparable. It’s a two-person thing.” Conaway: “I’m just wondering when you decided [Russia] wanted him to win.” Comey: “Well, logically, when they wanted her to lose.” Conaway stuck with Trump after the Access Hollywood video of him bragging about groping women surfaced and roiled the campaign. He told the Abilene Reporter-News on October 13 that Trump’s comments were “horrible, awful, and he’s probably embarrassed,” but noted that “no candidate is perfect.” The reason Trump didn’t lose Conaway’s support? “It’s a binary choice, Clinton or Trump. … He (Trump) is still the one I’m supporting. I refuse to do anything that would help Hillary become president.” Conaway’s wife, Suzanne, was also not fazed by the Access Hollywood tape, telling CNN in October that she still supported Trump and traveling the country in a “Women Stump for Trump” bus tour. She dismissed the accounts of Trump sexually assaulting women as “unsubstantiated allegations.” During the 2016 election, Conaway served on the executive board of the Trump campaign’s Agriculture Advisory Committee. After Trump’s widely-panned inaugural address that angrily described “American carnage,” Rep. Conaway told the San Angelo Standard-Times that Trump’s detractors should be hopeful, because “success brings a lot of healing.” He said he thought the speech “appealed to a broad swath of both sides, people who feel they have not been represented in the White House,” and was “excited to be able to work with the White House for the first time in eight years.” When millions of people demonstrated against Trump the day after inauguration, Conaway’s response was to criticize the foul language that appeared on some protesters’ signs. “There was a taint to that march that just cut me to the core,” he said at a later event at the Agriculture Department. “Women carrying signs and wearing costumes in the foulest, nastiest, crudest, crassest manner possible, talking about female body parts.” Conaway was aware that the reason many people made signs of that nature was in direct response to Trump’s own foul boasting, but Conaway found more fault with the signs. “The trigger for that obviously was Mr. Trump’s exchange with Billy Bush, which should never have happened, it was never excused in a private conversation, but now it’s perfectly all right to carry signs as badges of honor across this nation’s capital,” Conaway concluded. House Republicans cancel all hearings on Russian investigation, blame DemocratsNunes and Gowdy say Democrats are obstructing things. They aren’t.thinkprogress.org Trump gets Conaway’s benefit of the doubt in national security matters, too. Conaway said that Trump’s accusation that Obama wiretapped him was understandable because Trump is “not someone who’s spent a lot of his career talking about intelligence issues and police investigations, those kinds of things.” Speaker Paul Ryan (R-WI) said Nunes “continues to have [his] trust” amid the Ethics investigation and also said he was “confident” that Conaway would “follow the facts wherever they lead.” Conaway will have Reps Trey Gowdy (R-SC), and Tom Rooney (R-FL) as deputies to assist him in the probe. Ranking member Rep. Adam Schiff (D-CA) called Nunes’ move a “fresh opportunity to move forward in the unified and nonpartisan way that an investigation of this seriousness demands.” He said he looked forward to partnering with Conaway “and putting our investigation fully back on track.” ", "title": "Republican now leading Russia probe has a history of making wild claims in defense of Trump", "sentences": [{"9db0": "Republican now leading Russia probe has a history of making wild claims in defense of Trump"}, {"e4f3": "The new Devin Nunes is a lot like the old Devin Nunes."}, {"6ced": "Rep. Mike Conaway, R-Texas, at a House Permanent Select Committee on Intelligence hearing on June 18, 2013. CREDIT: AP Photo/Charles Dharapak"}, {"273b": "On Thursday, House Intelligence Committee Chair Devin Nunes (R-CA) announced he was stepping down from the investigation into Russian meddling in the election. Nunes blamed “accusations” by “several leftwing activist groups” for triggering an actually-very-real investigation into Nunes’ alleged improper handling of intelligence."}, {"596a": "His chosen replacement? Rep. Mike Conaway (R-TX), a senior member of the committee, and a strong Trump supporter during the campaign. That support has not waned since Trump was elected and could cause problems for someone taking over an investigation marred by accusations of collusion with the White House."}, {"cf96": "Conaway, who is now charged with investigating Russian meddling in the 2016 election, compared Russian cyber attacks on Democrats to Mexican entertainers energizing Democratic voters. He told the Dallas Morning News in January:"}, {"2ac3": "Harry Reid and the Democrats brought in Mexican soap opera stars, singers and entertainers who had immense influence in those communities into Las Vegas, to entertain, get out the vote and so forth. Those are foreign actors, foreign people, influencing the vote in Nevada. You don’t hear the Democrats screaming and saying one word about that."}, {"0955": "Asked if this was really the same as Russian email hacking of private information to support one candidate, Conaway said, “Sure it is, it’s foreign influence. If we’re worried about foreign influence, let’s have the whole story.” He pointed to the Democratic electoral success in Nevada in 2016, saying the Mexican singers who campaigned there “are monster in the Hispanic community.”"}, {"25ec": "“He knows there’s a big difference between Vicente Fernandez performing at a Hillary Clinton event and Vladimir Putin ordering interference with our elections,” fellow Intelligence Committee member Rep. Joaquin Castro (D-TX) said in response. “The intelligence community has indicated that Vladimir Putin essentially ordered cyberwarfare, and nothing else compares to that.”"}, {"b728": "Prior to the election, Conaway hewed to the traditional Republican position more critical of Russian aggression, stating on his congressional website in 2014 that Putin is a “megalomaniac” and that his aggressive actions were “unacceptable.” Since the election, Conaway’s website has been quiet when it comes to Russian actions against the United States."}, {"bd2b": "Conaway: “That might work on Saturday afternoon when my wife’s [Texas Tech] Red Raiders are playing the Texas Longhorns — she really likes the Red Raiders. … The logic is that because [Putin] really didn’t like presidential candidate Clinton that he automatically liked Trump? That assessment is based on what?”"}, {"d12b": "Comey: “It’s based on more than that, but part of it … is the logic. Whoever the Red Raiders are playing, you want the Red Raiders to win, by definition you want their opponents to lose.”"}, {"f0a1": "Conaway: “I know, but this says … [Russia] wanted both of them, her to lose and him to win.”"}, {"7740": "Comey: “They’re inseparable. It’s a two-person thing.”"}, {"7d7d": "Conaway: “I’m just wondering when you decided [Russia] wanted him to win.”"}, {"3acd": "Comey: “Well, logically, when they wanted her to lose.”"}, {"d780": "Conaway stuck with Trump after the Access Hollywood video of him bragging about groping women surfaced and roiled the campaign. He told the Abilene Reporter-News on October 13 that Trump’s comments were “horrible, awful, and he’s probably embarrassed,” but noted that “no candidate is perfect.”"}, {"28b5": "The reason Trump didn’t lose Conaway’s support? “It’s a binary choice, Clinton or Trump. … He (Trump) is still the one I’m supporting. I refuse to do anything that would help Hillary become president.”"}, {"1f93": "Conaway’s wife, Suzanne, was also not fazed by the Access Hollywood tape, telling CNN in October that she still supported Trump and traveling the country in a “Women Stump for Trump” bus tour. She dismissed the accounts of Trump sexually assaulting women as “unsubstantiated allegations.”"}, {"7c04": "During the 2016 election, Conaway served on the executive board of the Trump campaign’s Agriculture Advisory Committee."}, {"cb72": "After Trump’s widely-panned inaugural address that angrily described “American carnage,” Rep. Conaway told the San Angelo Standard-Times that Trump’s detractors should be hopeful, because “success brings a lot of healing.” He said he thought the speech “appealed to a broad swath of both sides, people who feel they have not been represented in the White House,” and was “excited to be able to work with the White House for the first time in eight years.”"}, {"87a9": "When millions of people demonstrated against Trump the day after inauguration, Conaway’s response was to criticize the foul language that appeared on some protesters’ signs."}, {"699f": "“There was a taint to that march that just cut me to the core,” he said at a later event at the Agriculture Department. “Women carrying signs and wearing costumes in the foulest, nastiest, crudest, crassest manner possible, talking about female body parts.” Conaway was aware that the reason many people made signs of that nature was in direct response to Trump’s own foul boasting, but Conaway found more fault with the signs. “The trigger for that obviously was Mr. Trump’s exchange with Billy Bush, which should never have happened, it was never excused in a private conversation, but now it’s perfectly all right to carry signs as badges of honor across this nation’s capital,” Conaway concluded."}, {"310a": "House Republicans cancel all hearings on Russian investigation, blame DemocratsNunes and Gowdy say Democrats are obstructing things. They aren’t.thinkprogress.org"}, {"9fc9": "Trump gets Conaway’s benefit of the doubt in national security matters, too. Conaway said that Trump’s accusation that Obama wiretapped him was understandable because Trump is “not someone who’s spent a lot of his career talking about intelligence issues and police investigations, those kinds of things.”"}, {"c990": "Speaker Paul Ryan (R-WI) said Nunes “continues to have [his] trust” amid the Ethics investigation and also said he was “confident” that Conaway would “follow the facts wherever they lead.” Conaway will have Reps Trey Gowdy (R-SC), and Tom Rooney (R-FL) as deputies to assist him in the probe."}, {"5cff": "Ranking member Rep. Adam Schiff (D-CA) called Nunes’ move a “fresh opportunity to move forward in the unified and nonpartisan way that an investigation of this seriousness demands.” He said he looked forward to partnering with Conaway “and putting our investigation fully back on track.”"}], "child": "1536_1\t1536_2\t1536_3\t1536_4\t1536_5"}