{"name": "1537", "parent": "", "content": "Nunes steps down from Russia probe, hands reins to another Trump loyalist Nunes is now under investigation himself. House Intelligence Committee Chairman Rep. Devin Nunes, R-Calif., arrives for a closed-door GOP strategy session on Capitol Hill in Washington, Tuesday, April 4, 2017. CREDIT: AP Photo/J. Scott Applewhite Congressman Devin Nunes (R-CA) announced Thursday that he is stepping down from his role in the House Intelligence Committee’s investigation into alleged ties between President Donald Trump’s campaign and Russian operatives. Nunes, who is the chairman of the committee, said that he will retain his post but will hand leadership of the investigation over to Reps. Mike Conaway (R-TX), Trey Gowdy (R-SC), and Tom Rooney (R-FL). Nunes’ leadership of the investigation into the Trump campaign has long been controversial. A longtime Trump ally, Nunes also served as a member of the president’s transition team. While leading the investigation into the president, Nunes agreed to make phone calls to the press on his behalf, leading to more questions about his partiality. And on March 22, Nunes held a press conference claiming to have evidence that some members of the Trump team were surveilled — evidence he has failed to produce, has not revealed his sources for, and hadn’t shared with other members of the House Intelligence Committee before telling the press. President Trump immediately took the bizarre announcement as vindication of his baseless claim that he was “wiretapped” by former President Barack Obama. Two days earlier, bother FBI director James Comey and NSA Director Mike Rodgers said they didn’t know of any information backing up the president’s accusation. The totally phony Susan Rice story, explainedThe former national security advisor’s surveillance activity is neither illegal or unethical.thinkprogress.org And despite Trump’s claims of vindication, Nunes’ announcement actually didn’t actually reference anything illegal — but in revealing it, he himself may have unethically revealed intelligence without authorization. He is now under investigation by the bipartisan House Ethics Committee, which he cited as his reason for recusal. His tone, however, was unrepentant. “Several leftwing activist groups have filed accusations against me with the Office of Congressional Ethics. The charges are entirely false and politically motivated, and are being leveled just as the American people are beginning to learn the truth about the improper unmasking of the identities of U.S. citizens and other abuses of power,” he said. While Nunes claimed that the investigation was a frivolous charge triggered by outside groups, the matter is far more serious. He is under a so-called “18(a)” investigation, reports The Daily Beast, which was not triggered by outside groups. The House Committee on Ethics also put out a statement saying that the investigation was internally triggered, a direct contrast to Nunes’ characterization. “The Committee has determined to investigate these allegations in order to fulfill its institutional obligation, under House Rule X, clause 11(g)(4), to investigate certain allegations of unauthorized disclosures of classified information, and to determine if there has been any violation of the Code of Official Conduct,” the statement reads. The ethics investigation has subpoena power and may also spread to other top individuals, delving into what Nunes told President Trump and Speaker of the House Paul Ryan. Rep. Adam Schiff (D-CA), the ranking member on the Intelligence Committee, has been openly critical of Nunes following his March 22 press conference. He applauded Nunes’ decision. “I know this was not an easy decision for the Chairman, with whom I have worked well for many years. He did so in the best interests of the committee and I respect that decision,” he said in a statement. “The important work of investigating the Russian involvement in our election never subsided, but we have a fresh opportunity to move forward in the unified and nonpartisan way that an investigation of this seriousness demands.” Nunes designated Conaway as his lead successor, with Gowdy and Rooney as deputies. Conaway, like Nunes, is a Trump loyalist — one who was a member of the very campaign he will now be in charge of investigating. Conaway was a member of Trump’s Agriculture Advisory Committee, which Trump announced in August 2016. In January, Conaway gave his view on the Russian election hacking to The Dallas Morning News — and compared it to Mexican entertainers campaigning for Hillary Clinton. “Harry Reid and the Democrats brought in Mexican soap opera stars, singers and entertainers who had immense influence in those communities into Las Vegas, to entertain, get out the vote and so forth,” Conaway told the local paper. “Those are foreign actors, foreign people, influencing the vote in Nevada. You don’t hear the Democrats screaming and saying one word about that.” He then told the paper he considered it on par with the Russian election hacking. “It’s foreign influence. If we’re worried about foreign influence, let’s have the whole story,” he said. Now, Conaway will be in charge of the investigation. This post has been updated with further context about Rep. Conaway. ", "title": "Nunes steps down from Russia probe, hands reins to another Trump loyalist", "sentences": [{"fea7": "Nunes steps down from Russia probe, hands reins to another Trump loyalist"}, {"701c": "Nunes is now under investigation himself."}, {"f16c": "House Intelligence Committee Chairman Rep. Devin Nunes, R-Calif., arrives for a closed-door GOP strategy session on Capitol Hill in Washington, Tuesday, April 4, 2017. CREDIT: AP Photo/J. Scott Applewhite"}, {"5930": "Congressman Devin Nunes (R-CA) announced Thursday that he is stepping down from his role in the House Intelligence Committee’s investigation into alleged ties between President Donald Trump’s campaign and Russian operatives."}, {"10e6": "Nunes, who is the chairman of the committee, said that he will retain his post but will hand leadership of the investigation over to Reps. Mike Conaway (R-TX), Trey Gowdy (R-SC), and Tom Rooney (R-FL)."}, {"1889": "Nunes’ leadership of the investigation into the Trump campaign has long been controversial. A longtime Trump ally, Nunes also served as a member of the president’s transition team. While leading the investigation into the president, Nunes agreed to make phone calls to the press on his behalf, leading to more questions about his partiality."}, {"67f1": "And on March 22, Nunes held a press conference claiming to have evidence that some members of the Trump team were surveilled — evidence he has failed to produce, has not revealed his sources for, and hadn’t shared with other members of the House Intelligence Committee before telling the press."}, {"4fdb": "President Trump immediately took the bizarre announcement as vindication of his baseless claim that he was “wiretapped” by former President Barack Obama. Two days earlier, bother FBI director James Comey and NSA Director Mike Rodgers said they didn’t know of any information backing up the president’s accusation."}, {"af0c": "The totally phony Susan Rice story, explainedThe former national security advisor’s surveillance activity is neither illegal or unethical.thinkprogress.org"}, {"dc45": "And despite Trump’s claims of vindication, Nunes’ announcement actually didn’t actually reference anything illegal — but in revealing it, he himself may have unethically revealed intelligence without authorization. He is now under investigation by the bipartisan House Ethics Committee, which he cited as his reason for recusal. His tone, however, was unrepentant."}, {"4b85": "“Several leftwing activist groups have filed accusations against me with the Office of Congressional Ethics. The charges are entirely false and politically motivated, and are being leveled just as the American people are beginning to learn the truth about the improper unmasking of the identities of U.S. citizens and other abuses of power,” he said."}, {"8fe4": "While Nunes claimed that the investigation was a frivolous charge triggered by outside groups, the matter is far more serious. He is under a so-called “18(a)” investigation, reports The Daily Beast, which was not triggered by outside groups. The House Committee on Ethics also put out a statement saying that the investigation was internally triggered, a direct contrast to Nunes’ characterization."}, {"f763": "“The Committee has determined to investigate these allegations in order to fulfill its institutional obligation, under House Rule X, clause 11(g)(4), to investigate certain allegations of unauthorized disclosures of classified information, and to determine if there has been any violation of the Code of Official Conduct,” the statement reads."}, {"2a9e": "The ethics investigation has subpoena power and may also spread to other top individuals, delving into what Nunes told President Trump and Speaker of the House Paul Ryan."}, {"2c5d": "Rep. Adam Schiff (D-CA), the ranking member on the Intelligence Committee, has been openly critical of Nunes following his March 22 press conference. He applauded Nunes’ decision."}, {"30fe": "“I know this was not an easy decision for the Chairman, with whom I have worked well for many years. He did so in the best interests of the committee and I respect that decision,” he said in a statement. “The important work of investigating the Russian involvement in our election never subsided, but we have a fresh opportunity to move forward in the unified and nonpartisan way that an investigation of this seriousness demands.”"}, {"9019": "Nunes designated Conaway as his lead successor, with Gowdy and Rooney as deputies. Conaway, like Nunes, is a Trump loyalist — one who was a member of the very campaign he will now be in charge of investigating. Conaway was a member of Trump’s Agriculture Advisory Committee, which Trump announced in August 2016."}, {"db69": "In January, Conaway gave his view on the Russian election hacking to The Dallas Morning News — and compared it to Mexican entertainers campaigning for Hillary Clinton."}, {"cf74": "“Harry Reid and the Democrats brought in Mexican soap opera stars, singers and entertainers who had immense influence in those communities into Las Vegas, to entertain, get out the vote and so forth,” Conaway told the local paper. “Those are foreign actors, foreign people, influencing the vote in Nevada. You don’t hear the Democrats screaming and saying one word about that.”"}, {"2b0a": "He then told the paper he considered it on par with the Russian election hacking. “It’s foreign influence. If we’re worried about foreign influence, let’s have the whole story,” he said."}, {"c843": "Now, Conaway will be in charge of the investigation."}, {"725a": "This post has been updated with further context about Rep. Conaway."}], "child": "1537_1\t1537_2\t1537_3\t1537_4\t1537_5"}