{"name": "1538", "parent": "", "content": "Congressman on intelligence committee predicts Trump aides will ‘end up in jail’ over Russia ties “That’s pretty shocking to hear.” Castro questions FBI Director James Comey during the committee’s hearing on allegations of Russian interference in the 2016 U.S. presidential election. CREDIT: AP Photo/J. Scott Applewhite Rep. Joaquin Castro (D-TX), a member of the House Intelligence Committee, appeared on CNN on Tuesday to discuss the ongoing investigation of possible collusion between associates of President Donald Trump and Russia intended to influence the 2016 presidential election. Castro told host Wolf Blitzer that based on what he has seen, “my impression is, I wouldn’t be surprised, after all of this is said and done, that some people end up in jail.” As a member of the intelligence committee, Castro has seen more evidence associated with the issue than most members of Congress. Pressed by Blitzer as to whether he has seen “hard evidence of collusion” or could confirm the people in question advised Trump during the campaign or currently work for the administration, Castro said he couldn’t comment further, but reiterated his previous prediction. “As you can imagine, Wolf, I’ll have to comment on that later. But again… my impression is that people will probably be charged and I think people will probably go to jail,” the congressman said. The House Intelligence Committee’s investigation into the matter has become a sideshow of its own — stalled by reports claiming the committee chair, Rep. Devin Nunes (R-CA), was coordinating with the White House. Nunes ignored calls to step aside and abruptly canceled all scheduled committee hearings, blaming the delay on Democrats. According to Rep. Peter King (R-NY), members of the committee have finally “agreed to bring in key figures who worked with the Trump campaign and were in communication with Russian officials.” Rep. Adam Schiff (D-CA), the ranking Democratic member of the committee, said he and Nunes were “near agreement” on a witness list. Schiff said he would also need documents from some witnesses prior to their appearance. Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org Three individuals associated with the Trump campaign have agreed to voluntarily testify: Paul Manafort, Carter Page, and Roger Stone. Former National Security Adviser Michael Flynn has agreed to appear only if he receives criminal immunity. The Senate Intelligence Committee is conducting its own investigation into possible Russian meddling in the election, and FBI Director James Comey confirmed last month that his agency is also looking into the matter. ", "title": "Congressman on intelligence committee predicts Trump aides will ‘end up in jail’ over Russia ties", "sentences": [{"457e": "Congressman on intelligence committee predicts Trump aides will ‘end up in jail’ over Russia ties"}, {"198d": "“That’s pretty shocking to hear.”"}, {"53ed": "Castro questions FBI Director James Comey during the committee’s hearing on allegations of Russian interference in the 2016 U.S. presidential election. CREDIT: AP Photo/J. Scott Applewhite"}, {"422b": "Rep. Joaquin Castro (D-TX), a member of the House Intelligence Committee, appeared on CNN on Tuesday to discuss the ongoing investigation of possible collusion between associates of President Donald Trump and Russia intended to influence the 2016 presidential election."}, {"06b2": "Castro told host Wolf Blitzer that based on what he has seen, “my impression is, I wouldn’t be surprised, after all of this is said and done, that some people end up in jail.”"}, {"aede": "As a member of the intelligence committee, Castro has seen more evidence associated with the issue than most members of Congress."}, {"1c04": "Pressed by Blitzer as to whether he has seen “hard evidence of collusion” or could confirm the people in question advised Trump during the campaign or currently work for the administration, Castro said he couldn’t comment further, but reiterated his previous prediction. “As you can imagine, Wolf, I’ll have to comment on that later. But again… my impression is that people will probably be charged and I think people will probably go to jail,” the congressman said."}, {"60f4": "The House Intelligence Committee’s investigation into the matter has become a sideshow of its own — stalled by reports claiming the committee chair, Rep. Devin Nunes (R-CA), was coordinating with the White House. Nunes ignored calls to step aside and abruptly canceled all scheduled committee hearings, blaming the delay on Democrats."}, {"2283": "According to Rep. Peter King (R-NY), members of the committee have finally “agreed to bring in key figures who worked with the Trump campaign and were in communication with Russian officials.” Rep. Adam Schiff (D-CA), the ranking Democratic member of the committee, said he and Nunes were “near agreement” on a witness list. Schiff said he would also need documents from some witnesses prior to their appearance."}, {"a86f": "Unraveling Trump’s tangled ties to the KremlinConfused by the allegations against Trump? Here’s what we know so far.thinkprogress.org"}, {"9087": "Three individuals associated with the Trump campaign have agreed to voluntarily testify: Paul Manafort, Carter Page, and Roger Stone. Former National Security Adviser Michael Flynn has agreed to appear only if he receives criminal immunity."}, {"382b": "The Senate Intelligence Committee is conducting its own investigation into possible Russian meddling in the election, and FBI Director James Comey confirmed last month that his agency is also looking into the matter."}], "child": "1538_1\t1538_2\t1538_3\t1538_4\t1538_5\t1538_6\t1538_7\t1538_8\t1538_9\t1538_10\t1538_11\t1538_12\t1538_13\t1538_14\t1538_15"}