{"name": "1539", "parent": "", "content": "Montana Republicans are fighting to make it harder to vote in special Congressional election They claim vote-by-mail would help Democrats. Barb Kearney-Schupp deposits her vote-by-mail ballot in a collection box, Thursday, Nov. 3, 2016, at Seattle Central College in Seattle. CREDIT: AP Photo/Ted S. Warren Republican lawmakers in Montana really don’t want Democrats to be able to vote for the state’s next congressman. The state will elect a new at-large lawmaker to the U.S. House of Representatives in a special election on May 25 — the seat was left vacant when President Trump named former Rep. Ryan Zinke (R-MT) to lead the Department of the Interior. Because the election was unplanned and not in the state’s budget, lawmakers from both parties came together this year with clerks from nearly every county to recommend that the state conduct the election by mail. Allowing voters to cast ballots through the mail, they found, would save the state up to $750,000. But a bitter partisan battle in the legislature — which Democrats are labeling a voter suppression tactic — has prevented the state from putting this plan into action. Now, state lawmakers have just a few days to decide if mail-in ballots will go out to voters across the state, making it significantly easier and most cost-effective for voters to select their next representative. This last chance comes thanks to thanks to a move by Democratic Gov. Steve Bullock, who resurrected the failed effort when he inserted a vote-by-mail provision into a separate bill that the legislature can consider. Emboldened Republicans push state-level voting restrictionsEfforts in Michigan, New Hampshire, Utah and Texas to roll back voting rights may go unchallenged if Sessions becomes…thinkprogress.org The issue dates back to early this year, when Republican state senator Steve Fitzpatrick took the lead and introduced a bill to call for a mail-only election. “This bill is the fiscally responsible thing to do at this time, it’s the fiscally conservative thing to do,” Fitzpatrick said. Not all Republicans agreed. Just before the bill moved out of the Senate, Montana state Republican Chairman Rep. Jeff Essmann issued an “emergency report” warning that vote by mail would make it easier for Democrats to cast ballots. “All mail ballots give the Democrats an inherent advantage in close elections due to their ability to organize large numbers of unpaid college students and members of public employee unions to gather ballots by going door to door,” Essmann wrote. The state party leader added that “George Soros backed groups are organizing to manipulate our special election.” While Essmann’s argument didn’t come up during the Senate’s debate, other GOP members spoke out about the possibility of voter fraud and the need to accommodate people who like to travel to polling places. Ultimately, the bill passed in the Senate when Fitzpatrick assured the legislature that a majority of Montanans already vote by mail each election. But when the bill moved to the state House of Representatives, the story changed. When Democrats forced a vote in late March, concerned that time was running out to print and mail ballots, Republicans voted along party lines to table the issue. One Republican who still supported vote by mail, Rep. Geraldine Custer (R), led an effort to “blast” the bill out of the Judiciary Committee anyway, but it failed to garner the necessary 60 votes. This week, Bullock brought the issue back into consideration when he issued an “amendatory veto,” essentially adding language to a separate election law bill that would allow the legislature to once again consider enacting vote-by-mail before time runs out ahead of the May 25 election. Neither legislative body has a set a date for a vote. State Republicans — who have stopped talking to the press about the issue — may be hoping to run out the clock. Democratic candidate Rob Quist, who hopes to win Zinke’s seat in May, is encouraging his Republican opponent, Greg Gianforte, to join him in pushing the state legislature to approve the measure. “If my opponent is committed to strengthening the right to vote and protecting the hard-earned dollars of Montana taxpayers, then he will join me in urging elected leaders in Helena to do the right thing,” Quist said in a statement. “Let’s not let partisan politics get in the way of a commonsense proposal to encourage voter participation in May’s election.” Shane Scanlon, a spokesperson for Gianforte, told ThinkProgress that the candidate believes that whether or not the election is conducting by mail is a “decision that needs to be made by the legislature.” This story has been updated with comment from Gianforte’s campaign. ", "title": "Montana Republicans are fighting to make it harder to vote in special Congressional election", "sentences": [{"dc0e": "Montana Republicans are fighting to make it harder to vote in special Congressional election"}, {"d897": "They claim vote-by-mail would help Democrats."}, {"bd3d": "Barb Kearney-Schupp deposits her vote-by-mail ballot in a collection box, Thursday, Nov. 3, 2016, at Seattle Central College in Seattle. CREDIT: AP Photo/Ted S. Warren"}, {"e953": "Republican lawmakers in Montana really don’t want Democrats to be able to vote for the state’s next congressman."}, {"00b4": "The state will elect a new at-large lawmaker to the U.S. House of Representatives in a special election on May 25 — the seat was left vacant when President Trump named former Rep. Ryan Zinke (R-MT) to lead the Department of the Interior."}, {"8d09": "Because the election was unplanned and not in the state’s budget, lawmakers from both parties came together this year with clerks from nearly every county to recommend that the state conduct the election by mail. Allowing voters to cast ballots through the mail, they found, would save the state up to $750,000."}, {"8b5b": "But a bitter partisan battle in the legislature — which Democrats are labeling a voter suppression tactic — has prevented the state from putting this plan into action."}, {"607e": "Now, state lawmakers have just a few days to decide if mail-in ballots will go out to voters across the state, making it significantly easier and most cost-effective for voters to select their next representative."}, {"4c72": "This last chance comes thanks to thanks to a move by Democratic Gov. Steve Bullock, who resurrected the failed effort when he inserted a vote-by-mail provision into a separate bill that the legislature can consider."}, {"6ac1": "Emboldened Republicans push state-level voting restrictionsEfforts in Michigan, New Hampshire, Utah and Texas to roll back voting rights may go unchallenged if Sessions becomes…thinkprogress.org"}, {"712e": "The issue dates back to early this year, when Republican state senator Steve Fitzpatrick took the lead and introduced a bill to call for a mail-only election. “This bill is the fiscally responsible thing to do at this time, it’s the fiscally conservative thing to do,” Fitzpatrick said."}, {"4965": "Not all Republicans agreed. Just before the bill moved out of the Senate, Montana state Republican Chairman Rep. Jeff Essmann issued an “emergency report” warning that vote by mail would make it easier for Democrats to cast ballots."}, {"06b8": "“All mail ballots give the Democrats an inherent advantage in close elections due to their ability to organize large numbers of unpaid college students and members of public employee unions to gather ballots by going door to door,” Essmann wrote. The state party leader added that “George Soros backed groups are organizing to manipulate our special election.”"}, {"dfaa": "While Essmann’s argument didn’t come up during the Senate’s debate, other GOP members spoke out about the possibility of voter fraud and the need to accommodate people who like to travel to polling places. Ultimately, the bill passed in the Senate when Fitzpatrick assured the legislature that a majority of Montanans already vote by mail each election."}, {"8af1": "But when the bill moved to the state House of Representatives, the story changed. When Democrats forced a vote in late March, concerned that time was running out to print and mail ballots, Republicans voted along party lines to table the issue. One Republican who still supported vote by mail, Rep. Geraldine Custer (R), led an effort to “blast” the bill out of the Judiciary Committee anyway, but it failed to garner the necessary 60 votes."}, {"94cc": "This week, Bullock brought the issue back into consideration when he issued an “amendatory veto,” essentially adding language to a separate election law bill that would allow the legislature to once again consider enacting vote-by-mail before time runs out ahead of the May 25 election."}, {"54bd": "Neither legislative body has a set a date for a vote. State Republicans — who have stopped talking to the press about the issue — may be hoping to run out the clock."}, {"72a0": "Democratic candidate Rob Quist, who hopes to win Zinke’s seat in May, is encouraging his Republican opponent, Greg Gianforte, to join him in pushing the state legislature to approve the measure."}, {"63ce": "“If my opponent is committed to strengthening the right to vote and protecting the hard-earned dollars of Montana taxpayers, then he will join me in urging elected leaders in Helena to do the right thing,” Quist said in a statement. “Let’s not let partisan politics get in the way of a commonsense proposal to encourage voter participation in May’s election.”"}, {"d1f5": "Shane Scanlon, a spokesperson for Gianforte, told ThinkProgress that the candidate believes that whether or not the election is conducting by mail is a “decision that needs to be made by the legislature.”"}, {"921a": "This story has been updated with comment from Gianforte’s campaign."}], "child": "1539_1\t1539_2\t1539_3\t1539_4\t1539_5\t1539_6\t1539_7"}