{"name": "1540", "parent": "", "content": "Trump administration invents new story to support claims of massive voter fraud Sarah Huckabee Sanders told a completely fictional voter fraud story from her home state of Arkansas. CREDIT: MSNBC/Screenshot President Donald Trump continues to claim, without evidence, that there was massive voter fraud in the 2016 election — and that but for that fraud he would have won the popular vote. Sunday afternoon, White House Deputy Press Secretary Sarah Huckabee Sanders shared some new “information,” which she said supported the president’s position. “Look, I don’t know how many different voters voted illegally, but I do know that they exist,” Sanders told MSNBC. “In my home state of Arkansas, there was a judge that was caught with I think roughly 180 ballots sitting on his kitchen table, so to pretend like voter fraud isn’t something real and doesn’t exist is laughable.” There is no evidence anywhere of Sanders’ story about the Arkansas judge. What it seems she may have been referring to was a story about 160 absentee ballots in Hot Springs, Arkansas that hadn’t yet been counted the day after the election. They weren’t on a kitchen table; they were in the vault where they were supposed to be. They never went uncounted, and they didn’t even change the outcome of the very tight mayor’s race. The votes were legal and were counted according to procedure. Trump has repeatedly claimed that there were some three to five million votes cast illegally, a “belief” that he has maintained without providing anything to substantiate it. His latest claim is that thousands of Massachusetts residents were bused to New Hampshire to vote against him there. Trump Senior Policy Adviser Stephen Miller similarly defended this unfounded New Hampshire story Sunday morning on ABC’s This Week. “This morning on this show is not the venue for me to lay out all the evidence,” he said, “but I can tell you this: voter fraud is a serious problem in this country.” Host George Stephanopoulos suggested Miller should return when he actually has evidence to back up his claims. Ellen Weintraub, a member of the Federal Election Commission, called on Trump this week to “immediately share his evidence with the public and with the appropriate law-enforcement authorities so that his allegations may be investigated promptly and thoroughly.” So far, it is not forthcoming. UPDATE: This post has been updated to include the story Sanders was likely referring to. It previously cited this as a possible point of reference: The closest thing even resembling her tall tale is a story about one Illinois election judge who sent in an absentee ballot in her late husband’s name. He had received the absentee ballot before he died, so she submitted it, not knowing that it was wrong to do so. It was caught before the election, meaning it had no impact on the outcome — and even if it hadn’t been caught, it still would have only been one vote, and a vote that would have been cast legally had he not died until after the election. It wasn’t 180 votes, it wasn’t in Arkansas, and in no way was it evidence of other voter fraud schemes. In fact, Arkansas election officials were confident that voter fraud was unlikely to occur. ", "title": "Trump administration invents new story to support claims of massive voter fraud", "sentences": [{"ad17": "Trump administration invents new story to support claims of massive voter fraud"}, {"ce1d": "Sarah Huckabee Sanders told a completely fictional voter fraud story from her home state of Arkansas."}, {"87e5": "CREDIT: MSNBC/Screenshot"}, {"3f79": "President Donald Trump continues to claim, without evidence, that there was massive voter fraud in the 2016 election — and that but for that fraud he would have won the popular vote. Sunday afternoon, White House Deputy Press Secretary Sarah Huckabee Sanders shared some new “information,” which she said supported the president’s position."}, {"04f7": "“Look, I don’t know how many different voters voted illegally, but I do know that they exist,” Sanders told MSNBC. “In my home state of Arkansas, there was a judge that was caught with I think roughly 180 ballots sitting on his kitchen table, so to pretend like voter fraud isn’t something real and doesn’t exist is laughable.”"}, {"e03a": "There is no evidence anywhere of Sanders’ story about the Arkansas judge. What it seems she may have been referring to was a story about 160 absentee ballots in Hot Springs, Arkansas that hadn’t yet been counted the day after the election. They weren’t on a kitchen table; they were in the vault where they were supposed to be. They never went uncounted, and they didn’t even change the outcome of the very tight mayor’s race. The votes were legal and were counted according to procedure."}, {"8a71": "Trump has repeatedly claimed that there were some three to five million votes cast illegally, a “belief” that he has maintained without providing anything to substantiate it. His latest claim is that thousands of Massachusetts residents were bused to New Hampshire to vote against him there."}, {"b3c7": "Trump Senior Policy Adviser Stephen Miller similarly defended this unfounded New Hampshire story Sunday morning on ABC’s This Week. “This morning on this show is not the venue for me to lay out all the evidence,” he said, “but I can tell you this: voter fraud is a serious problem in this country.”"}, {"d6fd": "Host George Stephanopoulos suggested Miller should return when he actually has evidence to back up his claims."}, {"80a4": "Ellen Weintraub, a member of the Federal Election Commission, called on Trump this week to “immediately share his evidence with the public and with the appropriate law-enforcement authorities so that his allegations may be investigated promptly and thoroughly.” So far, it is not forthcoming."}, {"07d7": "UPDATE: This post has been updated to include the story Sanders was likely referring to. It previously cited this as a possible point of reference:"}, {"138a": "The closest thing even resembling her tall tale is a story about one Illinois election judge who sent in an absentee ballot in her late husband’s name. He had received the absentee ballot before he died, so she submitted it, not knowing that it was wrong to do so. It was caught before the election, meaning it had no impact on the outcome — and even if it hadn’t been caught, it still would have only been one vote, and a vote that would have been cast legally had he not died until after the election. It wasn’t 180 votes, it wasn’t in Arkansas, and in no way was it evidence of other voter fraud schemes. In fact, Arkansas election officials were confident that voter fraud was unlikely to occur."}], "child": "1540_1\t1540_2\t1540_3\t1540_4\t1540_5\t1540_6\t1540_7\t1540_8\t1540_9\t1540_10\t1540_11\t1540_12\t1540_13\t1540_14\t1540_15\t1540_16\t1540_17\t1540_18\t1540_19\t1540_20\t1540_21\t1540_22\t1540_23\t1540_241540_1\t1540_2\t1540_3\t1540_4\t1540_5\t1540_6\t1540_7\t1540_8\t1540_9\t1540_10\t1540_11\t1540_12\t1540_13\t1540_14\t1540_15\t1540_16\t1540_17\t1540_18\t1540_19\t1540_20\t1540_21\t1540_22\t1540_23\t1540_24"}