{"name": "1541", "parent": "", "content": "State elections chiefs warn against eliminating agency that protects elections from hacking House Republicans voted to eliminate the Election Assistance Commission. John Walker, 88, places his completed ballot into a machine after voting in the general election, Tuesday, Nov. 8, 2016, in Miami Shores, Fla. CREDIT: AP Photo/Lynne Sladky House Republicans voted this week to eliminate the Election Assistance Commission (EAC), the only federal agency specifically tasked with helping states protect elections from hacking. The vote split down party lines, with the three Democrats on the committee voting to save the commission and six Republicans voting to terminate it. Rep. Jamie Raskin (D-MD), who voted against the legislation, told ThinkProgress it’s likely that the full House will follow through with eliminating the agency, as protecting elections has become a partisan issue in Washington. But elsewhere in the country, things are different. While a majority of elections administrators across the country are Republicans, a number of them told ThinkProgress that they disagree with Congress’ move to scrap the EAC, and said their states would suffer without the agency. The House just moved toward eliminating the agency that protects elections from hackingA committee voted to terminate the Election Assistance Commission.thinkprogress.org “Essentially what you’re taking is one of the few agencies in the federal government that actually functions properly,” Colorado’s Republican Secretary of State Wayne Williams told ThinkProgress. “They’ve done a very good job… I specifically favor and have voted in favor of continuing the EAC.” After the last national election was plagued with foreign interference, many elections chiefs noted that Congress’ move is poorly timed. They said they have relied on the agency’s expertise on voting technology and security, and they have benefited from its guidelines for updating voting equipment. While many countries have a single body that administers elections, the United States relies on each state to have its own systems in place to ensure that elections are secure and accessible. If Congress were to eliminate the EAC, states would likely once again be left on their own to administer elections. For evidence of how that worked out before the agency was formed, look no further than the 2000 presidential election, when Florida’s faulty election system resulted in a recount that decided the outcome. ThinkProgress reached out to all 50 secretaries of state or elections chiefs (secretaries of state administer elections in most states, but not all) to ask if they support the elimination of the EAC, which was formed as part of the post-2000 election Help America Vote Act of 2002. “What you’re taking is one of the few agencies in the federal government that actually functions properly.” While the organization that represents all secretaries of state passed a resolution in 2015 calling for Congress to eliminate the EAC, the vote was far from unanimous, and many told ThinkProgress the agency is needed now more than ever. Five state elections chiefs — from California, Colorado, Virginia, Rhode Island, and Minnesota—told ThinkProgress they do not support the EAC Termination Act. “It would be a big loss and a big setback to election administration to get rid of the EAC,” said Edgardo Cortés, Virginia’s nonpartisan elections commissioner. “It still has a very important purpose and we should focus on making that agency stronger and how we can improve it instead of getting rid of it and leaving state and local elections administrators without that resource.” Cortés and California Secretary of State Alex Padilla both said that they are concerned about cybersecurity issues, and that it’s helpful to have a bipartisan, elections-focused group like the EAC at the table with the Department of Homeland Security when the government is looking into how to protect voting systems from outside influence. “The timing couldn’t be worse,” Padilla told ThinkProgress. “There is genuine concern about the integrity of our elections.” Williams, a moderate Republican from Colorado, is not concerned about potential hacking of elections, but said he favors keeping the EAC for its core function of modernizing and standardizing voting machines, a view shared by Rhode Island Secretary of State Nellie Gorbea. “Given the outdated condition of many election systems across our country, states should not be deprived of this federal resource,” she told ThinkProgress in a statement. Others pointed out the hypocrisy of President Trump’s baseless calls for an investigation into millions of fraudulent votes while his party dismantles the one agency tasked with keeping elections fair. “With the House Committee’s action, it seems like they’re working hard to implement the president’s vision on making it tougher to register to vote and to cast a ballot,” Padilla said. Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org But not all officials said they would necessarily miss the EAC. Some, like Washington’s Republican Secretary of State Kim Wyman, said they’d be satisfied if the EAC were eliminated and its functions moved over to the Federal Election Commission. “From the Voluntary Voting System Guidelines to the Technical Guidelines Development Committee, Washington has depended on the EAC to assist our office to improve our election systems,” Wyman told ThinkProgress in a statement. “If the EAC is eliminated, I would encourage Congress to move these responsibilities to another agency, such as the FEC, to ensure states have access to the work of these important committees.” But others noted that the FEC’s staff is focused on campaign finance, a subject matter distinct from election modernization. “The commissioners there have proven they can work together in a bipartisan way to get things done that are important for election administrators.” “There’s really no other agency that would be able to take this on and have the level of expertise that the staff there has and that the commissioners have,” Cortés, a former EAC staff member, said about the agency. “The commissioners there have proven they can work together in a bipartisan way to get things done that are important for election administrators, and we’re just not going to see that somewhere else.” Still, elections chiefs from Iowa and Maine told ThinkProgress they support Congress’ move to scrap the EAC. Maine’s Secretary of State Matthew Dunlap told ThinkProgress in a statement that now that the EAC’s original goals have been completed, the commission should be dissolved. “We have found the EAC to be helpful in conducting dependable certification of elections equipment, as well as providing guidance in the elections process,” he said. “However, we share the concerns outlined in the National Association of Secretaries of State resolution regarding the EAC, that the commission was evolving into a regulatory body that would impede each state’s independent oversight of its election process.” Secretaries of state from North Dakota, Oklahoma, Florida, and Connecticut declined to comment on the ongoing efforts to eliminate the EAC, and all other state administrators did not respond to requests for comment. The National Association of Secretaries of State will be meeting in Washington, D.C. next week, when there will likely be intense debate on the future of the agency. This story has been updated with additional responses from state elections chiefs. ", "title": "State elections chiefs warn against eliminating agency that protects elections from hacking", "sentences": [{"9f20": "State elections chiefs warn against eliminating agency that protects elections from hacking"}, {"111e": "House Republicans voted to eliminate the Election Assistance Commission."}, {"85d0": "John Walker, 88, places his completed ballot into a machine after voting in the general election, Tuesday, Nov. 8, 2016, in Miami Shores, Fla. CREDIT: AP Photo/Lynne Sladky"}, {"9fec": "House Republicans voted this week to eliminate the Election Assistance Commission (EAC), the only federal agency specifically tasked with helping states protect elections from hacking. The vote split down party lines, with the three Democrats on the committee voting to save the commission and six Republicans voting to terminate it."}, {"c4f9": "Rep. Jamie Raskin (D-MD), who voted against the legislation, told ThinkProgress it’s likely that the full House will follow through with eliminating the agency, as protecting elections has become a partisan issue in Washington."}, {"e01b": "But elsewhere in the country, things are different. While a majority of elections administrators across the country are Republicans, a number of them told ThinkProgress that they disagree with Congress’ move to scrap the EAC, and said their states would suffer without the agency."}, {"d089": "The House just moved toward eliminating the agency that protects elections from hackingA committee voted to terminate the Election Assistance Commission.thinkprogress.org"}, {"18b2": "“Essentially what you’re taking is one of the few agencies in the federal government that actually functions properly,” Colorado’s Republican Secretary of State Wayne Williams told ThinkProgress. “They’ve done a very good job… I specifically favor and have voted in favor of continuing the EAC.”"}, {"6850": "After the last national election was plagued with foreign interference, many elections chiefs noted that Congress’ move is poorly timed. They said they have relied on the agency’s expertise on voting technology and security, and they have benefited from its guidelines for updating voting equipment."}, {"5170": "While many countries have a single body that administers elections, the United States relies on each state to have its own systems in place to ensure that elections are secure and accessible. If Congress were to eliminate the EAC, states would likely once again be left on their own to administer elections."}, {"3a3e": "For evidence of how that worked out before the agency was formed, look no further than the 2000 presidential election, when Florida’s faulty election system resulted in a recount that decided the outcome."}, {"8cf2": "ThinkProgress reached out to all 50 secretaries of state or elections chiefs (secretaries of state administer elections in most states, but not all) to ask if they support the elimination of the EAC, which was formed as part of the post-2000 election Help America Vote Act of 2002."}, {"4658": "“What you’re taking is one of the few agencies in the federal government that actually functions properly.”"}, {"7fba": "While the organization that represents all secretaries of state passed a resolution in 2015 calling for Congress to eliminate the EAC, the vote was far from unanimous, and many told ThinkProgress the agency is needed now more than ever."}, {"85d9": "Five state elections chiefs — from California, Colorado, Virginia, Rhode Island, and Minnesota—told ThinkProgress they do not support the EAC Termination Act."}, {"83f4": "“It would be a big loss and a big setback to election administration to get rid of the EAC,” said Edgardo Cortés, Virginia’s nonpartisan elections commissioner. “It still has a very important purpose and we should focus on making that agency stronger and how we can improve it instead of getting rid of it and leaving state and local elections administrators without that resource.”"}, {"14cd": "Cortés and California Secretary of State Alex Padilla both said that they are concerned about cybersecurity issues, and that it’s helpful to have a bipartisan, elections-focused group like the EAC at the table with the Department of Homeland Security when the government is looking into how to protect voting systems from outside influence."}, {"5a7f": "“The timing couldn’t be worse,” Padilla told ThinkProgress. “There is genuine concern about the integrity of our elections.”"}, {"5a51": "Williams, a moderate Republican from Colorado, is not concerned about potential hacking of elections, but said he favors keeping the EAC for its core function of modernizing and standardizing voting machines, a view shared by Rhode Island Secretary of State Nellie Gorbea."}, {"c379": "“Given the outdated condition of many election systems across our country, states should not be deprived of this federal resource,” she told ThinkProgress in a statement."}, {"cf87": "Others pointed out the hypocrisy of President Trump’s baseless calls for an investigation into millions of fraudulent votes while his party dismantles the one agency tasked with keeping elections fair."}, {"2c6f": "“With the House Committee’s action, it seems like they’re working hard to implement the president’s vision on making it tougher to register to vote and to cast a ballot,” Padilla said."}, {"6a18": "Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org"}, {"d316": "But not all officials said they would necessarily miss the EAC. Some, like Washington’s Republican Secretary of State Kim Wyman, said they’d be satisfied if the EAC were eliminated and its functions moved over to the Federal Election Commission."}, {"7187": "“From the Voluntary Voting System Guidelines to the Technical Guidelines Development Committee, Washington has depended on the EAC to assist our office to improve our election systems,” Wyman told ThinkProgress in a statement. “If the EAC is eliminated, I would encourage Congress to move these responsibilities to another agency, such as the FEC, to ensure states have access to the work of these important committees.”"}, {"726e": "But others noted that the FEC’s staff is focused on campaign finance, a subject matter distinct from election modernization."}, {"f492": "“The commissioners there have proven they can work together in a bipartisan way to get things done that are important for election administrators.”"}, {"d06f": "“There’s really no other agency that would be able to take this on and have the level of expertise that the staff there has and that the commissioners have,” Cortés, a former EAC staff member, said about the agency. “The commissioners there have proven they can work together in a bipartisan way to get things done that are important for election administrators, and we’re just not going to see that somewhere else.”"}, {"e0f1": "Still, elections chiefs from Iowa and Maine told ThinkProgress they support Congress’ move to scrap the EAC. Maine’s Secretary of State Matthew Dunlap told ThinkProgress in a statement that now that the EAC’s original goals have been completed, the commission should be dissolved. “We have found the EAC to be helpful in conducting dependable certification of elections equipment, as well as providing guidance in the elections process,” he said. “However, we share the concerns outlined in the National Association of Secretaries of State resolution regarding the EAC, that the commission was evolving into a regulatory body that would impede each state’s independent oversight of its election process.”"}, {"3fbd": "Secretaries of state from North Dakota, Oklahoma, Florida, and Connecticut declined to comment on the ongoing efforts to eliminate the EAC, and all other state administrators did not respond to requests for comment. The National Association of Secretaries of State will be meeting in Washington, D.C. next week, when there will likely be intense debate on the future of the agency."}, {"6bdf": "This story has been updated with additional responses from state elections chiefs."}], "child": "1541_1\t1541_2\t1541_3\t1541_4\t1541_5"}