{"name": "1542", "parent": "", "content": "The House just moved toward eliminating the agency that protects elections from hacking A committee voted to terminate the Election Assistance Commission. Just months after an election plagued with foreign influence, a Republican-controlled House committee voted Tuesday to eliminate the independent, bipartisan agency tasked with helping states secure their voting systems. The Committee on House Administration voted 6–3, along party lines, to move forward with the Election Assistance Commission Termination Act, legislation that would eliminate the only agency responsible for making sure voting machines cannot be hacked. The Election Assistance Commission (EAC) was formed in the wake of the disastrous 2000 election to administer federal help to states to update and improve their voting systems. In recent years, the agency has worked to ensure that elections are accessible to those with disabilities, allocated funds for innovative election technology, and studied and reported election best practices, among other roles. Thomas Hicks, one of three commissioners currently on the EAC, told ThinkProgress that eliminating the agency would be “a huge mistake.” “It’s the only agency that deals with the administration of elections,” he said. “We touch 8,000 jurisdictions across the country, from voter registration to the counting of ballots... My read of the [termination] bill is that it just eliminates the agency but doesn’t move the responsibilities around.” In a preliminary vote Tuesday, the House committee decided to bring the issue to the entire chamber for a vote. Rep. Gregg Harper (R-MS), the chairman of the committee, argued that the EAC was formed as a temporary agency, and that the issues it was designed to address have been resolved. But a number of voting rights organizations have pushed back on that claim. Before Tuesday’s vote, the Brennan Center for Justice wrote a letter to Harper and the ranking Democratic member of the House committee, urging them to vote against the EAC termination legislation. “A lot of Americans are expressing concerns right now about the security of the election system and their confidence in the election system,” said Tomas Lopez, counsel with the Brennan Center’s Democracy Program. “The EAC is exactly the kind of place that can actually address the concerns that people have.” A group of 38 organizations and individuals, including the League of Women Voters and the NAACP, also wrote a letter urging the committee to oppose the legislation, and to instead strengthen the EAC and provide it with the additional staff it needs. At full capacity, the EAC should have four commissioners working to respond to election issues. While Russian hacking appears to have been a problem unique to the 2016 election, Hicks said that every election brings new challenges, which speaks to the need for the EAC. “In 2012, it was long lines, and the agency was not actually up and running,” he said, referring to the almost four-year period ending in December 2014 when the EAC had no commissioners. “The president had to use an executive order to have an outside commission look at these problems, when I think that’s something our agency was formed to do,” he said. That three-year period was not the only time the agency has been criticized for inaction, and Hicks admitted that the EAC is not perfect. But he said that given its ongoing work, it’s vital that the agency is allowed to continue functioning. Currently, the EAC is working to update the Voluntary Voting System Guidelines, a set of set of requirements that states can use to check that their voting systems are functional, accessible, and secure. Without those requirements, states would suffer, Hicks said. “Even though it’s voluntary, 47 out of 50 states use some form of it,” he said. The guidelines have not been updated since 2007, Hicks added, pointing out how far technology has come in the last decade. “We really need to be working on that,” he said. “That’s a huge issue that needs to be dealt with.” The legislation will now move to the full Republican-controlled House, whose GOP members have in the past been opponents of legislation that would make it easier to vote. ", "title": "The House just moved toward eliminating the agency that protects elections from hacking", "sentences": [{"41fb": "The House just moved toward eliminating the agency that protects elections from hacking"}, {"fd95": "A committee voted to terminate the Election Assistance Commission."}, {"6634": "Just months after an election plagued with foreign influence, a Republican-controlled House committee voted Tuesday to eliminate the independent, bipartisan agency tasked with helping states secure their voting systems."}, {"6af8": "The Committee on House Administration voted 6–3, along party lines, to move forward with the Election Assistance Commission Termination Act, legislation that would eliminate the only agency responsible for making sure voting machines cannot be hacked."}, {"be7b": "The Election Assistance Commission (EAC) was formed in the wake of the disastrous 2000 election to administer federal help to states to update and improve their voting systems. In recent years, the agency has worked to ensure that elections are accessible to those with disabilities, allocated funds for innovative election technology, and studied and reported election best practices, among other roles."}, {"9a81": "Thomas Hicks, one of three commissioners currently on the EAC, told ThinkProgress that eliminating the agency would be “a huge mistake.”"}, {"7949": "“It’s the only agency that deals with the administration of elections,” he said. “We touch 8,000 jurisdictions across the country, from voter registration to the counting of ballots... My read of the [termination] bill is that it just eliminates the agency but doesn’t move the responsibilities around.”"}, {"77e5": "In a preliminary vote Tuesday, the House committee decided to bring the issue to the entire chamber for a vote. Rep. Gregg Harper (R-MS), the chairman of the committee, argued that the EAC was formed as a temporary agency, and that the issues it was designed to address have been resolved."}, {"7205": "But a number of voting rights organizations have pushed back on that claim. Before Tuesday’s vote, the Brennan Center for Justice wrote a letter to Harper and the ranking Democratic member of the House committee, urging them to vote against the EAC termination legislation."}, {"7436": "“A lot of Americans are expressing concerns right now about the security of the election system and their confidence in the election system,” said Tomas Lopez, counsel with the Brennan Center’s Democracy Program. “The EAC is exactly the kind of place that can actually address the concerns that people have.”"}, {"9dbc": "A group of 38 organizations and individuals, including the League of Women Voters and the NAACP, also wrote a letter urging the committee to oppose the legislation, and to instead strengthen the EAC and provide it with the additional staff it needs. At full capacity, the EAC should have four commissioners working to respond to election issues."}, {"41e2": "While Russian hacking appears to have been a problem unique to the 2016 election, Hicks said that every election brings new challenges, which speaks to the need for the EAC."}, {"1eb8": "“In 2012, it was long lines, and the agency was not actually up and running,” he said, referring to the almost four-year period ending in December 2014 when the EAC had no commissioners."}, {"e2be": "“The president had to use an executive order to have an outside commission look at these problems, when I think that’s something our agency was formed to do,” he said."}, {"ea40": "That three-year period was not the only time the agency has been criticized for inaction, and Hicks admitted that the EAC is not perfect. But he said that given its ongoing work, it’s vital that the agency is allowed to continue functioning."}, {"3fb8": "Currently, the EAC is working to update the Voluntary Voting System Guidelines, a set of set of requirements that states can use to check that their voting systems are functional, accessible, and secure. Without those requirements, states would suffer, Hicks said."}, {"ab6a": "“Even though it’s voluntary, 47 out of 50 states use some form of it,” he said."}, {"893d": "The guidelines have not been updated since 2007, Hicks added, pointing out how far technology has come in the last decade. “We really need to be working on that,” he said. “That’s a huge issue that needs to be dealt with.”"}, {"5f03": "The legislation will now move to the full Republican-controlled House, whose GOP members have in the past been opponents of legislation that would make it easier to vote."}], "child": "1542_1\t1542_2\t1542_3\t1542_4\t1542_5\t1542_6\t1542_7\t1542_8\t1542_9\t1542_10"}