{"name": "1543", "parent": "", "content": "The GOP has turned against democracy, and Neil Gorsuch is their champion The fundamental question of our era is whether elections will still matter. CREDIT: AP Photo/Carolyn Kaster “Authoritarianism” is one of the most misunderstood words in America today. As Cornell government professor Thomas Pepinsky writes, authoritarian nations rarely resemble Nazi Germany. People don’t necessarily live in fear of a secret police, or even fear that there will be consequences for dissent. Rather, the dividing line between democracy and authoritarianism comes down to something much more basic: “you know that you are no longer living in a democracy because the elections in which you are participating no longer can yield political change.” By this definition, there is a thick cord of authoritarianism winding its way around the Republican Party. Think of the gerrymanders. The voter suppression laws. The voter purges. The lawsuits asking courts to toss out ballots. None of these cancel elections outright, or even prevent most Democrats from participating in elections. But they make it much less likely that voters who are dissatisfied with Republican governance can bring about political change. No non-incumbent Republican president has won the popular vote since 1988. Democracy is not on the GOP’s side, and it knows it. The judiciary plays a major role in the GOP’s authoritarian designs. Republicans on the Supreme Court waved their hand at gerrymanders. They gutted a key provision of the Voting Rights Act. They give their blessing to voter suppression. Bush v. Gore happened. Yet there is also another, deeper effort to use the courts to subvert democracy — and this is where Donald Trump’s Supreme Court nominee, Judge Neil Gorsuch, is likely to shine. Gorsuch is one of the nation’s leading spokespeople for an effort to consolidate power with the judiciary at the very moment that Republicans are likely to seize control of the courts for another generation. The obsession There are two ways to prevent elections from yielding political change. One is to rig — or, at least, put a thumb on the scale — in favor of one political coalition. That’s what can be accomplished through gerrymandering, voter ID laws, and other efforts to suppress the vote. The other method is to change the rules of governance: to strip away Congress’ power to enact progressive legislation while allowing conservative legislation to move forward, or to rework the levers of power in such a way that one party doesn’t really have the opportunity to govern even when they do win elections. In the United States, Republicans use both of these tactics to maximize their own power and minimize the power of their opposition. Consider what America was like under President Obama — or what it would have been like in the alternative universe where the winner of the popular vote got to be the next president in 2016. Thanks to a combination of gerrymandering and geographic factors that give Republicans an advantage in legislative races, the GOP has a near-lock on the House of Representatives. Indeed, in 2012, Democratic House candidates outperformed Republican candidates by nearly 1.4 million votes. Yet Republicans still captured a solid majority in the House. Without a realistic shot of capturing both houses of Congress — and thereby earning the power to legislate — Democrats had to turn to federal agencies’ existing power to regulate to achieve any significant policy victories. President Obama’s most ambitious move to combat climate change wasn’t any bill that he signed into law; it was a package of regulations drafted by the Environmental Protection Agency pursuant to authority Congress gave it many years ago in the Clean Air Act. His administration also pushed out regulations providing that more workers should receive overtime pay and ensuring that insurance plans cover birth control (among other things). Republicans were not the least bit happy that the Obama administration was able to regulate despite the GOP’s hold on the House, and many of the most sophisticated actors within the party began looking for ways to hobble regulatory agencies. For the Federalist Society, an influential conservative legal group whose members include two sitting justices and a bevy of other judges, this effort became an obsession. The Society’s final national lawyer convention before the 2016 election featured a maze of proposals — some legislative, some constitutional, and some landing somewhere in between — seeking to limit federal agencies’ ability to regulate. Which is where Neil Gorsuch enters this story. Enter the judge Judge Gorsuch is, for the most part, a fairly conventional Republican judge. He’s viewed the rights of LGBT people narrowly and the rights of religious conservatives expansively. He’s fought to cut off state funding for Planned Parenthood. He’s railed against “American liberals” who rely “on judges and lawyers rather than elected leaders and the ballot box, as the primary means of effecting their social agenda on everything from gay marriage to assisted suicide to the use of vouchers for private-school education.” Yet, despite Gorsuch’s rhetorical commitment to judicial restraint, he is one of the judiciary’s leading proponents of expanding judicial power at the expense of federal agencies. He would prefer to consolidate power in the one unelected branch of government at the very moment when Republicans are about to gain a stranglehold on that branch. Gorsuch’s signature proposal is overruling the Supreme Court’s decision in Chevron v. Natural Resources Defense Council, an idea that is also popular in many corners of the Federalist Society. Who is Neil Gorsuch?What you need to know about Trump’s extraordinarily conservative nominee for the Supreme Court.thinkprogress.org Chevron is one of the most significant and most widely cited Supreme Court cases of the last half-century. In a nutshell, Chevron provides that when an agency regulates, courts will defer to the agency if the law permitting such a regulation is ambiguous. Only if the law fairly clearly does not permit the agency to act as it has acted will the courts strike the new regulation down. As the Court explained in Chevron, such deference makes sense for two reasons. Since “judges are not experts” in the fields regulated by agencies, they are more likely to make a hash of a policy matter if they insert themselves into it. Better to reserve judicial review for cases where agencies clearly exceed their lawful authority. Additionally, Chevron recognizes that agencies have far more legitimacy to make policy in a democracy than courts. “While agencies are not directly accountable to the people,” the Court explained, “the Chief Executive is.” Thus, “it is entirely appropriate for this political branch of the Government” to set policy, rather than leaving such questions to judges who will never face an electorate. As a practical matter, this means that agencies tend to deregulate during Republican administrations and push more aggressive environmental, labor, and anti-discrimination rules during Democratic administrations. And the courts will defer to both left and right-leaning administrations when deciding whether to allow these regulations to remain in effect. Gorsuch, however, indicated that he would overrule Chevron, writing that the seminal decision that forms the basis for more than three decades of administrative law “seems more than a little difficult to square with the Constitution of the framers’ design.” Eliminating Chevron would immediately raise the — already very high — stakes surrounding control of the Supreme Court. Without Chevron, the party that controls the Court would gain broad power to frustrate presidents of the opposite party. And, if Gorsuch is confirmed, it is likely that Republicans will control the Supreme Court for decades. A decision overruling Chevron also would need to be understood in terms of the GOP’s efforts to gerrymander the House of Representatives. Democratic presidents would be left with little chance of gaining control of Congress — even if a majority of the electorate wants Democrats to be in charge of the legislature — and far less ability to use the power already granted to them by existing laws. Elections would still happen, but there would be little chance that they could yield progressive political change. The battle to save the Earth from Scalia’s ghostThe Obama administration’s most ambitious effort to fight climate change hangs in the balance.thinkprogress.org There is some evidence, moreover, that Gorsuch supports even more sweeping efforts to strip agencies of their ability to regulate. Many federal laws announce a broad framework intended to solve a particular policy problem, but then instruct the agencies to create regulations that detail the specifics of how this framework will operate. The Clean Air Act, for example, requires the EPA administrator to determine “the degree of emission limitation achievable through the application of the best system of emission reduction” that can be achieved in a cost effective way, and then instructs the EPA to develop regulations that cause power plans to achieve this level of emission reduction. Based on this delegation of power, the Obama administration developed its Clean Power Plan. These relatively broad delegations allow agencies to respond to new technologies and to apply the most recent scientific findings without having to seek a new act of Congress every time the state of the art changes. In a 2015 opinion, however, Gorsuch indicated that he would like to revive the nondelegation doctrine, a largely defunct doctrine limiting Congress’ ability to delegate power to agencies in this way. Admittedly, Gorsuch’s opinion does not lay out specifically when he would invoke this doctrine, and it is possible that he may only want to limit Congress’ ability to delegate criminal regulatory power to agencies. Nevertheless, his willingness to invoke this sleeping doctrine in any context suggests that he may have extraordinarily ambitious plans to rework the balance of power among the three branches of government. The fifth vote Gorsuch does not have an especially thick record on voting rights and gerrymandering, so there is no way to know for sure how he will rule on individual challenges to voter suppression laws or gerrymandered maps. Nevertheless, every other Republican on the Supreme Court has been unwilling to disturb partisan gerrymanders (although Justice Kennedy has held out the possibility that he could strike down some, hypothetical gerrymander someday). Every single Republican justice rejected a challenge to voter ID laws, one of the most common forms of voter suppression. Every single Republican voted to reinstate North Carolina’s omnibus voter suppression law, most likely the most aggressive law of its kind since Jim Crow. Right now, there are four Republicans on the Supreme Court. Gorsuch will be the fifth. And he will restore the majority that Republicans need to control the Court’s decisions. It is unlikely, to say the least, that a Republican president — and, more importantly, this Republican president’s advisers in the Federalist Society, who played a major role in picking Gorsuch — would have selected a Supreme Court nominee who does not support the GOP’s full agenda on voting and redistricting. They have put too much work into manipulating the electoral process, and there is simply too much at stake if a justice goes rogue and starts implementing free and fair elections. Gorsuch, in other words, is likely a vote for both prongs of the GOP’s anti-democratic agenda. He is likely to wave his hand at laws that make it more difficult for Democrats to win elections, and then hobble the power of Democrats to govern if they somehow overcome these laws. ", "title": "The GOP has turned against democracy, and Neil Gorsuch is their champion", "sentences": [{"841f": "The GOP has turned against democracy, and Neil Gorsuch is their champion"}, {"b777": "The fundamental question of our era is whether elections will still matter."}, {"de58": "CREDIT: AP Photo/Carolyn Kaster"}, {"7820": "“Authoritarianism” is one of the most misunderstood words in America today."}, {"f2a6": "As Cornell government professor Thomas Pepinsky writes, authoritarian nations rarely resemble Nazi Germany. People don’t necessarily live in fear of a secret police, or even fear that there will be consequences for dissent. Rather, the dividing line between democracy and authoritarianism comes down to something much more basic: “you know that you are no longer living in a democracy because the elections in which you are participating no longer can yield political change.”"}, {"1703": "By this definition, there is a thick cord of authoritarianism winding its way around the Republican Party."}, {"67c1": "Think of the gerrymanders. The voter suppression laws. The voter purges. The lawsuits asking courts to toss out ballots. None of these cancel elections outright, or even prevent most Democrats from participating in elections. But they make it much less likely that voters who are dissatisfied with Republican governance can bring about political change."}, {"ceb6": "No non-incumbent Republican president has won the popular vote since 1988. Democracy is not on the GOP’s side, and it knows it."}, {"b244": "The judiciary plays a major role in the GOP’s authoritarian designs. Republicans on the Supreme Court waved their hand at gerrymanders. They gutted a key provision of the Voting Rights Act. They give their blessing to voter suppression. Bush v. Gore happened."}, {"ecb2": "Yet there is also another, deeper effort to use the courts to subvert democracy — and this is where Donald Trump’s Supreme Court nominee, Judge Neil Gorsuch, is likely to shine. Gorsuch is one of the nation’s leading spokespeople for an effort to consolidate power with the judiciary at the very moment that Republicans are likely to seize control of the courts for another generation."}, {"ca8d": "The obsession"}, {"cd1e": "There are two ways to prevent elections from yielding political change. One is to rig — or, at least, put a thumb on the scale — in favor of one political coalition. That’s what can be accomplished through gerrymandering, voter ID laws, and other efforts to suppress the vote."}, {"838e": "The other method is to change the rules of governance: to strip away Congress’ power to enact progressive legislation while allowing conservative legislation to move forward, or to rework the levers of power in such a way that one party doesn’t really have the opportunity to govern even when they do win elections."}, {"ac32": "In the United States, Republicans use both of these tactics to maximize their own power and minimize the power of their opposition."}, {"27a4": "Consider what America was like under President Obama — or what it would have been like in the alternative universe where the winner of the popular vote got to be the next president in 2016. Thanks to a combination of gerrymandering and geographic factors that give Republicans an advantage in legislative races, the GOP has a near-lock on the House of Representatives."}, {"054f": "Indeed, in 2012, Democratic House candidates outperformed Republican candidates by nearly 1.4 million votes. Yet Republicans still captured a solid majority in the House."}, {"9b9d": "Without a realistic shot of capturing both houses of Congress — and thereby earning the power to legislate — Democrats had to turn to federal agencies’ existing power to regulate to achieve any significant policy victories."}, {"0f68": "President Obama’s most ambitious move to combat climate change wasn’t any bill that he signed into law; it was a package of regulations drafted by the Environmental Protection Agency pursuant to authority Congress gave it many years ago in the Clean Air Act. His administration also pushed out regulations providing that more workers should receive overtime pay and ensuring that insurance plans cover birth control (among other things)."}, {"1b78": "Republicans were not the least bit happy that the Obama administration was able to regulate despite the GOP’s hold on the House, and many of the most sophisticated actors within the party began looking for ways to hobble regulatory agencies. For the Federalist Society, an influential conservative legal group whose members include two sitting justices and a bevy of other judges, this effort became an obsession. The Society’s final national lawyer convention before the 2016 election featured a maze of proposals — some legislative, some constitutional, and some landing somewhere in between — seeking to limit federal agencies’ ability to regulate."}, {"1ad9": "Which is where Neil Gorsuch enters this story."}, {"04c8": "Enter the judge"}, {"25a2": "Judge Gorsuch is, for the most part, a fairly conventional Republican judge. He’s viewed the rights of LGBT people narrowly and the rights of religious conservatives expansively. He’s fought to cut off state funding for Planned Parenthood. He’s railed against “American liberals” who rely “on judges and lawyers rather than elected leaders and the ballot box, as the primary means of effecting their social agenda on everything from gay marriage to assisted suicide to the use of vouchers for private-school education.”"}, {"8a20": "Yet, despite Gorsuch’s rhetorical commitment to judicial restraint, he is one of the judiciary’s leading proponents of expanding judicial power at the expense of federal agencies. He would prefer to consolidate power in the one unelected branch of government at the very moment when Republicans are about to gain a stranglehold on that branch."}, {"8806": "Gorsuch’s signature proposal is overruling the Supreme Court’s decision in Chevron v. Natural Resources Defense Council, an idea that is also popular in many corners of the Federalist Society."}, {"7d9f": "Who is Neil Gorsuch?What you need to know about Trump’s extraordinarily conservative nominee for the Supreme Court.thinkprogress.org"}, {"ed17": "Chevron is one of the most significant and most widely cited Supreme Court cases of the last half-century. In a nutshell, Chevron provides that when an agency regulates, courts will defer to the agency if the law permitting such a regulation is ambiguous. Only if the law fairly clearly does not permit the agency to act as it has acted will the courts strike the new regulation down."}, {"f81c": "As the Court explained in Chevron, such deference makes sense for two reasons. Since “judges are not experts” in the fields regulated by agencies, they are more likely to make a hash of a policy matter if they insert themselves into it. Better to reserve judicial review for cases where agencies clearly exceed their lawful authority."}, {"9d9b": "Additionally, Chevron recognizes that agencies have far more legitimacy to make policy in a democracy than courts. “While agencies are not directly accountable to the people,” the Court explained, “the Chief Executive is.” Thus, “it is entirely appropriate for this political branch of the Government” to set policy, rather than leaving such questions to judges who will never face an electorate."}, {"0b50": "As a practical matter, this means that agencies tend to deregulate during Republican administrations and push more aggressive environmental, labor, and anti-discrimination rules during Democratic administrations. And the courts will defer to both left and right-leaning administrations when deciding whether to allow these regulations to remain in effect."}, {"b9fb": "Gorsuch, however, indicated that he would overrule Chevron, writing that the seminal decision that forms the basis for more than three decades of administrative law “seems more than a little difficult to square with the Constitution of the framers’ design.”"}, {"65ba": "Eliminating Chevron would immediately raise the — already very high — stakes surrounding control of the Supreme Court. Without Chevron, the party that controls the Court would gain broad power to frustrate presidents of the opposite party. And, if Gorsuch is confirmed, it is likely that Republicans will control the Supreme Court for decades."}, {"c6c6": "A decision overruling Chevron also would need to be understood in terms of the GOP’s efforts to gerrymander the House of Representatives. Democratic presidents would be left with little chance of gaining control of Congress — even if a majority of the electorate wants Democrats to be in charge of the legislature — and far less ability to use the power already granted to them by existing laws. Elections would still happen, but there would be little chance that they could yield progressive political change."}, {"1ace": "The battle to save the Earth from Scalia’s ghostThe Obama administration’s most ambitious effort to fight climate change hangs in the balance.thinkprogress.org"}, {"fadf": "There is some evidence, moreover, that Gorsuch supports even more sweeping efforts to strip agencies of their ability to regulate. Many federal laws announce a broad framework intended to solve a particular policy problem, but then instruct the agencies to create regulations that detail the specifics of how this framework will operate."}, {"b532": "The Clean Air Act, for example, requires the EPA administrator to determine “the degree of emission limitation achievable through the application of the best system of emission reduction” that can be achieved in a cost effective way, and then instructs the EPA to develop regulations that cause power plans to achieve this level of emission reduction. Based on this delegation of power, the Obama administration developed its Clean Power Plan."}, {"69ea": "These relatively broad delegations allow agencies to respond to new technologies and to apply the most recent scientific findings without having to seek a new act of Congress every time the state of the art changes."}, {"1b04": "In a 2015 opinion, however, Gorsuch indicated that he would like to revive the nondelegation doctrine, a largely defunct doctrine limiting Congress’ ability to delegate power to agencies in this way. Admittedly, Gorsuch’s opinion does not lay out specifically when he would invoke this doctrine, and it is possible that he may only want to limit Congress’ ability to delegate criminal regulatory power to agencies. Nevertheless, his willingness to invoke this sleeping doctrine in any context suggests that he may have extraordinarily ambitious plans to rework the balance of power among the three branches of government."}, {"a3dd": "The fifth vote"}, {"3b38": "Gorsuch does not have an especially thick record on voting rights and gerrymandering, so there is no way to know for sure how he will rule on individual challenges to voter suppression laws or gerrymandered maps."}, {"a16d": "Nevertheless, every other Republican on the Supreme Court has been unwilling to disturb partisan gerrymanders (although Justice Kennedy has held out the possibility that he could strike down some, hypothetical gerrymander someday). Every single Republican justice rejected a challenge to voter ID laws, one of the most common forms of voter suppression. Every single Republican voted to reinstate North Carolina’s omnibus voter suppression law, most likely the most aggressive law of its kind since Jim Crow."}, {"e7fa": "Right now, there are four Republicans on the Supreme Court. Gorsuch will be the fifth. And he will restore the majority that Republicans need to control the Court’s decisions."}, {"0ade": "It is unlikely, to say the least, that a Republican president — and, more importantly, this Republican president’s advisers in the Federalist Society, who played a major role in picking Gorsuch — would have selected a Supreme Court nominee who does not support the GOP’s full agenda on voting and redistricting. They have put too much work into manipulating the electoral process, and there is simply too much at stake if a justice goes rogue and starts implementing free and fair elections."}, {"6831": "Gorsuch, in other words, is likely a vote for both prongs of the GOP’s anti-democratic agenda. He is likely to wave his hand at laws that make it more difficult for Democrats to win elections, and then hobble the power of Democrats to govern if they somehow overcome these laws."}], "child": "1543_1\t1543_2\t1543_3\t1543_4\t1543_5\t1543_6\t1543_7\t1543_8\t1543_9\t1543_10"}