{"name": "1544", "parent": "", "content": "Trump promised an official voter fraud investigation, then delegated it to a guy on Twitter There is no credible evidence of significant patterns of voter fraud in the U.S. President Donald Trump spent a lot of his first week in office re-litigating his election victory. In one of his first meetings with Congress, he claimed — without evidence — that 3 to 5 million illegal votes cost him the popular vote, which he lost by nearly 3 million to Democratic candidate Hillary Clinton. Quickly, some observers pointed out that if Trump genuinely believed that to be true, he would be derelict in his duty if he didn’t order a massive voter fraud investigation. So Trump promised one. He repeated the promise to ABC’s David Muir in an interview on Wednesday: “We’re gonna launch an investigation to find out. And then the next time — and I will say this, of those votes cast, none of ’em come to me. None of ’em come to me. They would all be for the other side. None of ’em come to me,” said President Trump. The official announcement came on Thursday via Sean Spicer: President Trump would be signing an executive order on voter fraud that day. “It will be a follow up on the announcement yesterday of his commitment to better understand voter fraud, faulty registration, et cetera,” Spicer told reporters aboard Air Force One. Within a day of the promised official investigation, however, Trump backed off. Instead of promising an official government action, he pointed to a Gregg Phillips — the source of the two unverified tweets in November that seem to have set Trump off on his “3–5 million” vote spree. Months later, Phillips has yet to show anyone evidence for his claim, or explain how he arrived at his 3 million number. Now, Phillips is at the center of an investigation into what would be — if his claims were true — the largest incidence of voter fraud in U.S. history, evidence that would shake the foundations of the country’s democracy. And President Trump is putting this investigation in the hands of a volunteer voter-fraud activist, and shining a spotlight on whatever he finds. The trajectory of the unverified ‘3 million vote’ claim On November 13th, Phillips tweeted this: Phillips notably claimed that he “verified” the illegal votes four days before any states certified their election results (Vermont was the first). Nonetheless, his tweet went viral in certain right-wing spheres. InfoWars, a well-known conspiracy site that has also claimed that the Sandy Hook Massacre was a hoax and 9/11 was an inside job, wrote up Phillips’ Tweet as a claim and argued that all those votes went to Hillary Clinton. Then popular right-wing aggregator Drudge Report picked up InfoWars’ article (which, incidentally cites “Greg Phillips of the VoteFraud.org organization.” That URL now goes to Election Night Gatekeepers, who say they’d “never heard of” Phillips before Drudge started sending them traffic by the thousands). Then, Trump started repeating the claim. Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org To recap: In the span of a week, “3 million illegal votes” went from an unverified tweet, to an Infowars article, to Drudge report, to the President-elect’s new favorite talking point. Now it’s January, and Trump is still fixated on the fact that he lost the popular vote, and using Phillips’ “3 million votes” to back up his personal theory that he didn’t. As CNN’s Brian Stelter pointed out, Trump’s tweet about waiting for Phillips’ report came about 45 minutes after Phillips was on CNN, where the host grilled him. There is no credible evidence of voter fraud on a massive or even significant scale in the United States, so any official government investigation would be extremely unlikely to find any. Phillips is the only one claims to have evidence of any sort to back Trump up. No one has seen any of the data Phillips claims to have been using, nor the algorithm he and his team are using. Phillips stressed to The Daily Beast that he and his team are all volunteers. He made his claim based on a database collected by the conservative vote-monitoring group True the Vote (which was the subject of a congressional investigation for voter suppression in 2012). The head of that group told The Daily Beast that his original tweet was “based on his independent analysis.” Phillips may well be conducting an investigation into voter fraud. But it is not the credible, official government investigation Trump implied was coming. Yet Trump is suggesting he will take Phillips’ investigation as truth and possibly use it to form policy — or, at the very least, drive headlines. The Trump bait and switch The trajectory of this story fits into what has become a well worn pattern when it comes to Trump media coverage. When Spicer first announced the voter fraud investigation, the headlines rolled out: “Trump to sign executive action on voter fraud,” read CBS. “Trump considers executive order on voter fraud,” read CNN. Then, Thursday night, the executive order was unceremoniously pulled. “The president got back a little late and he got jammed up on some meetings that needed to occur, and so we’re going to roll all that into Friday and Saturday,” Spicer said. It’s possible that Trump will return to his executive order on voter fraud, and launch an expensive and potentially damaging investigation. But Spicer’s comments were also vague — “all that” could refer to any executive orders, and its unclear that they will actually include the promised investigation. The details of the Carrier deal have finally been released. Trump exaggerated big league.Trump ignored the United Steelworkers, handed a big tax break to management, then claimed an exaggerated victory.thinkprogress.org In either case, Trump promised to sign an executive order on voter fraud on Thursday — then didn’t deliver. This was largely overlooked by the media: Most outlets folded the new development into their earlier articles, but retained the headlines promising the investigation. This cycle often shows up in Trump’s media strategy: First, he makes a claim — such as his inflation of the amount of jobs Carrier would be retaining in Indiana. The press reports the claim, spawning headlines that reiterate his unverified statement. Then, hours or days later, the actual details come out, often showing that his claim was wrong or exaggerated. But it’s too late — his false statement is already out there. The news cycle has moved on, and even when reporters do come back to fact check the details, Trump’s supporters are still likely to believe his earlier statement. On his first day in office, Trump broke 34 promisesThe new president made 36 promises about his first day, but kept only two of them.thinkprogress.org It’s a remarkably effective strategy for Trump; it enables him to build hype with bluster and create the impression that he’s engaged in a flurry of activity, fulfilling all of his promises. In reality, Trump isn’t (thus far) living up to the huge policy plans he promised — during his campaign, for example, he promised to accomplish 36 specific things on his first day. He fulfilled two of those promises. Trump’s voter fraud investigation is another example. It may be that we will still see an executive order on a voter fraud investigation; perhaps it really was just delayed. But in any case, Trump already has the headlines he wanted, and somewhere down the line, Phillips may deliver the data. How accurate or official that data will be is another story entirely. ", "title": "Trump promised an official voter fraud investigation, then delegated it to a guy on Twitter", "sentences": [{"0ee8": "Trump promised an official voter fraud investigation, then delegated it to a guy on Twitter"}, {"4fcf": "There is no credible evidence of significant patterns of voter fraud in the U.S."}, {"05e2": "President Donald Trump spent a lot of his first week in office re-litigating his election victory. In one of his first meetings with Congress, he claimed — without evidence — that 3 to 5 million illegal votes cost him the popular vote, which he lost by nearly 3 million to Democratic candidate Hillary Clinton."}, {"7b9e": "Quickly, some observers pointed out that if Trump genuinely believed that to be true, he would be derelict in his duty if he didn’t order a massive voter fraud investigation."}, {"c44a": "So Trump promised one."}, {"71f7": "He repeated the promise to ABC’s David Muir in an interview on Wednesday: “We’re gonna launch an investigation to find out. And then the next time — and I will say this, of those votes cast, none of ’em come to me. None of ’em come to me. They would all be for the other side. None of ’em come to me,” said President Trump."}, {"4e9a": "The official announcement came on Thursday via Sean Spicer: President Trump would be signing an executive order on voter fraud that day."}, {"d378": "“It will be a follow up on the announcement yesterday of his commitment to better understand voter fraud, faulty registration, et cetera,” Spicer told reporters aboard Air Force One."}, {"6d64": "Within a day of the promised official investigation, however, Trump backed off. Instead of promising an official government action, he pointed to a Gregg Phillips — the source of the two unverified tweets in November that seem to have set Trump off on his “3–5 million” vote spree."}, {"ae86": "Months later, Phillips has yet to show anyone evidence for his claim, or explain how he arrived at his 3 million number."}, {"303e": "Now, Phillips is at the center of an investigation into what would be — if his claims were true — the largest incidence of voter fraud in U.S. history, evidence that would shake the foundations of the country’s democracy. And President Trump is putting this investigation in the hands of a volunteer voter-fraud activist, and shining a spotlight on whatever he finds."}, {"b325": "The trajectory of the unverified ‘3 million vote’ claim"}, {"5bad": "On November 13th, Phillips tweeted this:"}, {"bc31": "Phillips notably claimed that he “verified” the illegal votes four days before any states certified their election results (Vermont was the first). Nonetheless, his tweet went viral in certain right-wing spheres."}, {"9685": "InfoWars, a well-known conspiracy site that has also claimed that the Sandy Hook Massacre was a hoax and 9/11 was an inside job, wrote up Phillips’ Tweet as a claim and argued that all those votes went to Hillary Clinton."}, {"8b3c": "Then popular right-wing aggregator Drudge Report picked up InfoWars’ article (which, incidentally cites “Greg Phillips of the VoteFraud.org organization.” That URL now goes to Election Night Gatekeepers, who say they’d “never heard of” Phillips before Drudge started sending them traffic by the thousands)."}, {"37d0": "Then, Trump started repeating the claim."}, {"361e": "Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org"}, {"84ca": "To recap: In the span of a week, “3 million illegal votes” went from an unverified tweet, to an Infowars article, to Drudge report, to the President-elect’s new favorite talking point."}, {"86c2": "Now it’s January, and Trump is still fixated on the fact that he lost the popular vote, and using Phillips’ “3 million votes” to back up his personal theory that he didn’t."}, {"91d9": "As CNN’s Brian Stelter pointed out, Trump’s tweet about waiting for Phillips’ report came about 45 minutes after Phillips was on CNN, where the host grilled him."}, {"d79f": "There is no credible evidence of voter fraud on a massive or even significant scale in the United States, so any official government investigation would be extremely unlikely to find any. Phillips is the only one claims to have evidence of any sort to back Trump up."}, {"f473": "No one has seen any of the data Phillips claims to have been using, nor the algorithm he and his team are using. Phillips stressed to The Daily Beast that he and his team are all volunteers."}, {"38df": "He made his claim based on a database collected by the conservative vote-monitoring group True the Vote (which was the subject of a congressional investigation for voter suppression in 2012). The head of that group told The Daily Beast that his original tweet was “based on his independent analysis.”"}, {"f6a6": "Phillips may well be conducting an investigation into voter fraud. But it is not the credible, official government investigation Trump implied was coming. Yet Trump is suggesting he will take Phillips’ investigation as truth and possibly use it to form policy — or, at the very least, drive headlines."}, {"d748": "The Trump bait and switch"}, {"4335": "The trajectory of this story fits into what has become a well worn pattern when it comes to Trump media coverage."}, {"37fc": "When Spicer first announced the voter fraud investigation, the headlines rolled out: “Trump to sign executive action on voter fraud,” read CBS. “Trump considers executive order on voter fraud,” read CNN."}, {"a10c": "Then, Thursday night, the executive order was unceremoniously pulled."}, {"ac30": "“The president got back a little late and he got jammed up on some meetings that needed to occur, and so we’re going to roll all that into Friday and Saturday,” Spicer said."}, {"e49c": "It’s possible that Trump will return to his executive order on voter fraud, and launch an expensive and potentially damaging investigation. But Spicer’s comments were also vague — “all that” could refer to any executive orders, and its unclear that they will actually include the promised investigation."}, {"f94a": "The details of the Carrier deal have finally been released. Trump exaggerated big league.Trump ignored the United Steelworkers, handed a big tax break to management, then claimed an exaggerated victory.thinkprogress.org"}, {"b0ad": "In either case, Trump promised to sign an executive order on voter fraud on Thursday — then didn’t deliver. This was largely overlooked by the media: Most outlets folded the new development into their earlier articles, but retained the headlines promising the investigation."}, {"c1ee": "This cycle often shows up in Trump’s media strategy: First, he makes a claim — such as his inflation of the amount of jobs Carrier would be retaining in Indiana. The press reports the claim, spawning headlines that reiterate his unverified statement."}, {"914b": "Then, hours or days later, the actual details come out, often showing that his claim was wrong or exaggerated. But it’s too late — his false statement is already out there. The news cycle has moved on, and even when reporters do come back to fact check the details, Trump’s supporters are still likely to believe his earlier statement."}, {"770a": "On his first day in office, Trump broke 34 promisesThe new president made 36 promises about his first day, but kept only two of them.thinkprogress.org"}, {"331e": "It’s a remarkably effective strategy for Trump; it enables him to build hype with bluster and create the impression that he’s engaged in a flurry of activity, fulfilling all of his promises."}, {"a416": "In reality, Trump isn’t (thus far) living up to the huge policy plans he promised — during his campaign, for example, he promised to accomplish 36 specific things on his first day. He fulfilled two of those promises."}, {"32b7": "Trump’s voter fraud investigation is another example. It may be that we will still see an executive order on a voter fraud investigation; perhaps it really was just delayed. But in any case, Trump already has the headlines he wanted, and somewhere down the line, Phillips may deliver the data. How accurate or official that data will be is another story entirely."}], "child": "1544_1\t1544_2\t1544_3\t1544_4\t1544_5\t1544_6\t1544_7\t1544_8\t1544_9\t1544_10\t1544_11\t1544_12"}