{"name": "1545", "parent": "", "content": "Trump’s lie about illegal votes will have dangerous consequences Sixteen states are already working on legislation to suppress voters this year. President Trump falsely claimed during a meeting with congressional leaders Monday that he would have won the popular vote if it were not for three to five million illegal votes. At least three sources familiar with the meeting told the Washington Post about Trump’s lie, which occurred during a private reception at the White House. House Majority Leader Kevin McCarthy (R-CA) refused to confirm Trump’s comment, but said they discussed “different electoral college, popular votes.” There is only one popular vote count, and Trump lost it. The final count puts Hillary Clinton’s vote total close to three million higher than Trump’s. Donald Trump thinks he won the popular vote, which he lost by more than 2 million votesThe president-elect baselessly claimed that millions of voters were illegal.thinkprogress.org But Trump apparently cannot accept the facts: There is no evidence that voter fraud occurred, let alone impacted the outcome of the election. Trump supporters have pointed to fake news websites like InfoWars, which reported without evidence that “three million votes in the U.S. presidential election were cast by illegal aliens.” The report also claims, without any evidence, that those three million votes went to Clinton. In reality, over 128 million votes were cast in 2016, but there have been just four documented cases of voter fraud. At least three of those illegal voters supported Trump. While illegal votes are not a real issue, Trump’s lies are. The media was quick to fact check his allegation, both on Monday and when he said fraud cost him the popular vote in November. But to Republican governors and state lawmakers across the country, those who have the ability to change voting laws and those who are looking to their president as a guiding voice, the lie could quickly affect policy. States could use Trump’s claim as justification to make it significantly harder or impossible for millions of voters to cast ballots. According to a 2017 preview published by the Brennan Center for Justice, “at least 33 bills to restrict access to registration and voting have been introduced in 16 states” as of January 17. Nine states — Arkansas, Indiana, Maine, Nebraska, New Hampshire, New York, North Dakota, Virginia, and Wyoming — are already considering strict voter ID legislation, despite court rulings and studies finding that requiring photo ID at the polls is discriminatory and reduced minority turnout. In Iowa, a strict voter ID law which would also limit absentee voting is likely to be proposed imminently, with strong support from the Secretary of State. And other states are considering bills to limit voter registration with proof of citizenship requirements, by eliminating Election Day registration, or by making it harder for voter registration groups to enlist new voters. Meanwhile, Texas is considering making it harder for people to help voters who need language assistance and Rhode Island is considering allowing database purges, which often lead to disenfranchised eligible voters. WATCH: The voter fraud myth, destroyed in 99 secondsWhat’s more common: Voter fraud or winning Olympic gold?thinkprogress.org All of these laws are predicated on the completely false notion, propagated by the president, that voter fraud exists and that it impact elections. With Trump lying to members of Congress, Republicans controlling a majority of statehouses and state legislatures, and a U.S. Department of Justice that will prosecute voter fraud instead of protecting voters, the future of the right to vote could be bleak. ", "title": "Trump’s lie about illegal votes will have dangerous consequences", "sentences": [{"2b15": "Trump’s lie about illegal votes will have dangerous consequences"}, {"4b4c": "Sixteen states are already working on legislation to suppress voters this year."}, {"77d7": "President Trump falsely claimed during a meeting with congressional leaders Monday that he would have won the popular vote if it were not for three to five million illegal votes."}, {"f32b": "At least three sources familiar with the meeting told the Washington Post about Trump’s lie, which occurred during a private reception at the White House. House Majority Leader Kevin McCarthy (R-CA) refused to confirm Trump’s comment, but said they discussed “different electoral college, popular votes.”"}, {"97e4": "There is only one popular vote count, and Trump lost it. The final count puts Hillary Clinton’s vote total close to three million higher than Trump’s."}, {"7189": "Donald Trump thinks he won the popular vote, which he lost by more than 2 million votesThe president-elect baselessly claimed that millions of voters were illegal.thinkprogress.org"}, {"68b3": "But Trump apparently cannot accept the facts: There is no evidence that voter fraud occurred, let alone impacted the outcome of the election. Trump supporters have pointed to fake news websites like InfoWars, which reported without evidence that “three million votes in the U.S. presidential election were cast by illegal aliens.” The report also claims, without any evidence, that those three million votes went to Clinton."}, {"8e5d": "In reality, over 128 million votes were cast in 2016, but there have been just four documented cases of voter fraud. At least three of those illegal voters supported Trump."}, {"7a02": "While illegal votes are not a real issue, Trump’s lies are."}, {"22ff": "The media was quick to fact check his allegation, both on Monday and when he said fraud cost him the popular vote in November. But to Republican governors and state lawmakers across the country, those who have the ability to change voting laws and those who are looking to their president as a guiding voice, the lie could quickly affect policy. States could use Trump’s claim as justification to make it significantly harder or impossible for millions of voters to cast ballots."}, {"4f9b": "According to a 2017 preview published by the Brennan Center for Justice, “at least 33 bills to restrict access to registration and voting have been introduced in 16 states” as of January 17. Nine states — Arkansas, Indiana, Maine, Nebraska, New Hampshire, New York, North Dakota, Virginia, and Wyoming — are already considering strict voter ID legislation, despite court rulings and studies finding that requiring photo ID at the polls is discriminatory and reduced minority turnout."}, {"660f": "In Iowa, a strict voter ID law which would also limit absentee voting is likely to be proposed imminently, with strong support from the Secretary of State."}, {"d5da": "And other states are considering bills to limit voter registration with proof of citizenship requirements, by eliminating Election Day registration, or by making it harder for voter registration groups to enlist new voters."}, {"8b98": "Meanwhile, Texas is considering making it harder for people to help voters who need language assistance and Rhode Island is considering allowing database purges, which often lead to disenfranchised eligible voters."}, {"d485": "WATCH: The voter fraud myth, destroyed in 99 secondsWhat’s more common: Voter fraud or winning Olympic gold?thinkprogress.org"}, {"0fcf": "All of these laws are predicated on the completely false notion, propagated by the president, that voter fraud exists and that it impact elections."}, {"0e21": "With Trump lying to members of Congress, Republicans controlling a majority of statehouses and state legislatures, and a U.S. Department of Justice that will prosecute voter fraud instead of protecting voters, the future of the right to vote could be bleak."}], "child": "1545_1\t1545_2\t1545_3\t1545_4\t1545_5\t1545_6\t1545_7\t1545_8\t1545_9\t1545_10\t1545_11\t1545_12\t1545_13\t1545_14\t1545_15\t1545_16\t1545_17\t1545_18\t1545_19\t1545_20\t1545_21\t1545_22\t1545_23\t1545_24"}