{"name": "1546", "parent": "", "content": "Federal court to Texas: Yup, your voter ID law is racist Also, water is wet. CREDIT: AP Photo In a brief order handed down Monday evening, a federal district court held that Texas’ voter ID law was “passed, at least in part, with a discriminatory intent in violation of the Voting Rights Act of 1965.” Voter ID laws are a common method of voter suppression that disproportionately target voters of color. According to data cited by the United States Court of Appeals for the Fifth Circuit, which will hear any appeal of Monday’s order, in Texas “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID. The Fifth Circuit previously held that Texas’ law had a greater impact on minority voters than on whites, a fact that in and of itself makes the law illegal under the Voting Rights Act. Nevertheless, the district court’s Monday order is significant for two reasons. First, as voting rights expert Rick Hasen notes, if the district court’s order is upheld on appeal, “it would be grounds for throwing out the entire law (and not just softening it though an affidavit requirement, etc.).” Additionally, while a 5–4 Supreme Court gutted a key provision of the Voting Rights Act in 2012 — the provision requiring certain states to submit any new election procedures to federal authorities for review before those procedures can take effect — a separate provision of the Voting Rights Act permits states that engage in intentional voting discrimination to be brought back under federal supervision. New study confirms that voter ID laws are very racistBut the Supreme Court probably won’t care.thinkprogress.org Monday’s order in Veasey v. Abbott notes several factors that suggest the law was enacted for the purpose of discriminating against African Americans and Latinos, including the law’s disparate impact on these voters and the fact that state lawmakers rushed the state’s voter ID law “through the legislative process without the usual committee analysis, debate, and substantive consideration of amendments.” The court also noted that, “Texas had become a majority-minority state” with “polarized voting patterns allowing the suppression of the overwhelmingly Democratic votes of African–Americans and Latinos to provide an Anglo partisan advantage.” The state’s Republican legislature, in other words, could use race as a proxy for partisan affiliation. By passing a law that would disproportionately target African Americans and Latinos, lawmakers could protect Republican rule. Additionally, while Texas claimed that its law exists to prevent voter fraud, not to disenfranchise voters of color, “the evidence shows a tenuous relationship between those rationales and the actual terms of the bill.” Of the 20 million votes cast in the ten years before this law’s passage, only two people were convicted by the kind of voter fraud that is supposedly targeted by voter ID. So Monday’s order is good news for voting rights supporters, but it is also good news that is likely to be short lived. Although the Fifth Circuit held that Texas’ law violates the Voting Rights Act, it is also a very conservative court. The lawyers challenging this law have a tough road ahead of themselves before the appeals court. And even if their case survives contact with the Fifth Circuit, the case is still likely to be reviewed by a newly Gorsuched Supreme Court. Prior to the 2016 election, while the Supreme Court was still down a justice, all four of the Court’s Republicans voted to reinstate North Carolina’s omnibus voter suppression law — despite a federal appeals court’s determination that the law was intentionally designed to increase its impact on black voters and minimize its impact on white voters. With Donald Trump’s nominee now occupying the Court’s vacant seat, it is likely that there are now five votes to permit racially motivated voter suppression to move forward. ", "title": "Federal court to Texas: Yup, your voter ID law is racist", "sentences": [{"35fa": "Federal court to Texas: Yup, your voter ID law is racist"}, {"6e89": "Also, water is wet."}, {"ecad": "CREDIT: AP Photo"}, {"2b55": "In a brief order handed down Monday evening, a federal district court held that Texas’ voter ID law was “passed, at least in part, with a discriminatory intent in violation of the Voting Rights Act of 1965.”"}, {"335b": "Voter ID laws are a common method of voter suppression that disproportionately target voters of color. According to data cited by the United States Court of Appeals for the Fifth Circuit, which will hear any appeal of Monday’s order, in Texas “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID."}, {"f737": "The Fifth Circuit previously held that Texas’ law had a greater impact on minority voters than on whites, a fact that in and of itself makes the law illegal under the Voting Rights Act. Nevertheless, the district court’s Monday order is significant for two reasons."}, {"4f12": "First, as voting rights expert Rick Hasen notes, if the district court’s order is upheld on appeal, “it would be grounds for throwing out the entire law (and not just softening it though an affidavit requirement, etc.).”"}, {"530f": "Additionally, while a 5–4 Supreme Court gutted a key provision of the Voting Rights Act in 2012 — the provision requiring certain states to submit any new election procedures to federal authorities for review before those procedures can take effect — a separate provision of the Voting Rights Act permits states that engage in intentional voting discrimination to be brought back under federal supervision."}, {"e4eb": "New study confirms that voter ID laws are very racistBut the Supreme Court probably won’t care.thinkprogress.org"}, {"7282": "Monday’s order in Veasey v. Abbott notes several factors that suggest the law was enacted for the purpose of discriminating against African Americans and Latinos, including the law’s disparate impact on these voters and the fact that state lawmakers rushed the state’s voter ID law “through the legislative process without the usual committee analysis, debate, and substantive consideration of amendments.”"}, {"6418": "The court also noted that, “Texas had become a majority-minority state” with “polarized voting patterns allowing the suppression of the overwhelmingly Democratic votes of African–Americans and Latinos to provide an Anglo partisan advantage.” The state’s Republican legislature, in other words, could use race as a proxy for partisan affiliation. By passing a law that would disproportionately target African Americans and Latinos, lawmakers could protect Republican rule."}, {"1189": "Additionally, while Texas claimed that its law exists to prevent voter fraud, not to disenfranchise voters of color, “the evidence shows a tenuous relationship between those rationales and the actual terms of the bill.” Of the 20 million votes cast in the ten years before this law’s passage, only two people were convicted by the kind of voter fraud that is supposedly targeted by voter ID."}, {"065f": "So Monday’s order is good news for voting rights supporters, but it is also good news that is likely to be short lived. Although the Fifth Circuit held that Texas’ law violates the Voting Rights Act, it is also a very conservative court. The lawyers challenging this law have a tough road ahead of themselves before the appeals court."}, {"07e6": "And even if their case survives contact with the Fifth Circuit, the case is still likely to be reviewed by a newly Gorsuched Supreme Court."}, {"7cbe": "Prior to the 2016 election, while the Supreme Court was still down a justice, all four of the Court’s Republicans voted to reinstate North Carolina’s omnibus voter suppression law — despite a federal appeals court’s determination that the law was intentionally designed to increase its impact on black voters and minimize its impact on white voters."}, {"4e4b": "With Donald Trump’s nominee now occupying the Court’s vacant seat, it is likely that there are now five votes to permit racially motivated voter suppression to move forward."}], "child": "1546_1\t1546_2\t1546_3\t1546_4\t1546_5\t1546_6\t1546_7\t1546_8\t1546_9\t1546_10\t1546_11\t1546_12\t1546_13"}