{"name": "1547", "parent": "", "content": "Florida ex-felons claim they are unlawfully blocked from voting More than 10 percent of the state’s voting-age residents are disenfranchised. People vote in the general election, Tuesday, Nov. 8, 2016, in Miami Shores, Fla. CREDIT: AP Photo/Lynne Sladky Seven former felons filed suit against Florida Gov. Rick Scott (R) on Monday, claiming that the state’s process for restoring voting rights to ex-felons is discriminatory, arbitrary, and unlawful. The seven citizens, who all had their right to vote permanently revoked when they were convicted of felonies, claim in a class action in federal court that the governor does not give them a fair chance to restore their rights. Florida is one of four states that permanently disenfranchise anyone with a felony conviction, unless they are able to apply for clemency. As a result of Scott’s decision to mandate a five- to seven-year waiting period before former felons can apply for clemency, just 2,487 petitions have been approved since Scott took office in 2011. Meanwhile, more than 10,500 people are waiting for consideration, according to the lawsuit. Florida elections shut out 1.5 million voters. These people want to change that.thinkprogress.org “It is common for an applicant to wait as many as ten years, if not more, without any update from the board before he or she is finally given a hearing date or notified the application was denied or granted without a hearing,” says the lawsuit, filed by the advocacy group Fair Elections Legal Network. According to the complaint, the clemency board uses “vague, shifting standards” to grant clemency to some applicants but not others, resulting in arbitrary decision-making that violates the First Amendment. During his term, former Gov. Charlie Crist, then a Republican, made it easier for felons to regain their rights, restoring the right to vote to more than 155,000 people. But Scott reversed that change in 2011 and mandated a long waiting period before felons could even apply for clemency. “As a result, Florida now has an estimated 1.68 million disenfranchised ex-felons or 10.4 percent of the state’s voting-age population — both the highest total and the highest rate in the nation,” the complaint notes. The plaintiffs also point out the discriminatory history of the disenfranchisement law, which dates back to the post–Civil War era when the state specifically wanted to keep black residents from gaining political power. Florida Supreme Court considers allowing vote to end permanent felon disenfranchisementThe state supreme court heard arguments on the amendment Monday.thinkprogress.org Scott’s office was not immediately available for comment, but his spokesperson Jeri Bustamante said in a statement that the restoration process should not be automatic. “Governor Scott believes that they have to demonstrate that they can live a life free of crime, show a willingness to request to have their rights restored, and show restitution to the victims of their crimes,” she said. The lawsuit, which seeks class-action status on behalf of all formerly convicted felons in Florida, is not the only potential avenue toward restored rights in the state right now. The state supreme court heard arguments last week about whether to allow a constitutional amendment on the 2018 ballot which would allow all voters to decide if the right to vote should be automatically restored to all former felons. If passed, the amendment would add roughly 1 million more voters to the rolls. Only those convicted of murder or felony sexual offenses would be excluded. If either the amendment or the lawsuit are successful, Florida would join the growing list of states making it easier for people with felony convictions to vote. According to the Sentencing Project, 23 states have expanded their voter eligibility laws to include more former felons, and an estimated 840,000 citizens have regained their right to vote. ", "title": "Florida ex-felons claim they are unlawfully blocked from voting", "sentences": [{"a2d0": "Florida ex-felons claim they are unlawfully blocked from voting"}, {"deb9": "More than 10 percent of the state’s voting-age residents are disenfranchised."}, {"64b1": "People vote in the general election, Tuesday, Nov. 8, 2016, in Miami Shores, Fla. CREDIT: AP Photo/Lynne Sladky"}, {"9671": "Seven former felons filed suit against Florida Gov. Rick Scott (R) on Monday, claiming that the state’s process for restoring voting rights to ex-felons is discriminatory, arbitrary, and unlawful."}, {"e478": "The seven citizens, who all had their right to vote permanently revoked when they were convicted of felonies, claim in a class action in federal court that the governor does not give them a fair chance to restore their rights. Florida is one of four states that permanently disenfranchise anyone with a felony conviction, unless they are able to apply for clemency."}, {"bd3f": "As a result of Scott’s decision to mandate a five- to seven-year waiting period before former felons can apply for clemency, just 2,487 petitions have been approved since Scott took office in 2011. Meanwhile, more than 10,500 people are waiting for consideration, according to the lawsuit."}, {"8751": "Florida elections shut out 1.5 million voters. These people want to change that.thinkprogress.org"}, {"29ac": "“It is common for an applicant to wait as many as ten years, if not more, without any update from the board before he or she is finally given a hearing date or notified the application was denied or granted without a hearing,” says the lawsuit, filed by the advocacy group Fair Elections Legal Network."}, {"8725": "According to the complaint, the clemency board uses “vague, shifting standards” to grant clemency to some applicants but not others, resulting in arbitrary decision-making that violates the First Amendment."}, {"9abc": "During his term, former Gov. Charlie Crist, then a Republican, made it easier for felons to regain their rights, restoring the right to vote to more than 155,000 people. But Scott reversed that change in 2011 and mandated a long waiting period before felons could even apply for clemency."}, {"af22": "“As a result, Florida now has an estimated 1.68 million disenfranchised ex-felons or 10.4 percent of the state’s voting-age population — both the highest total and the highest rate in the nation,” the complaint notes."}, {"e31f": "The plaintiffs also point out the discriminatory history of the disenfranchisement law, which dates back to the post–Civil War era when the state specifically wanted to keep black residents from gaining political power."}, {"ac76": "Florida Supreme Court considers allowing vote to end permanent felon disenfranchisementThe state supreme court heard arguments on the amendment Monday.thinkprogress.org"}, {"a34b": "Scott’s office was not immediately available for comment, but his spokesperson Jeri Bustamante said in a statement that the restoration process should not be automatic. “Governor Scott believes that they have to demonstrate that they can live a life free of crime, show a willingness to request to have their rights restored, and show restitution to the victims of their crimes,” she said."}, {"7dfa": "The lawsuit, which seeks class-action status on behalf of all formerly convicted felons in Florida, is not the only potential avenue toward restored rights in the state right now. The state supreme court heard arguments last week about whether to allow a constitutional amendment on the 2018 ballot which would allow all voters to decide if the right to vote should be automatically restored to all former felons."}, {"dde1": "If passed, the amendment would add roughly 1 million more voters to the rolls. Only those convicted of murder or felony sexual offenses would be excluded."}, {"719c": "If either the amendment or the lawsuit are successful, Florida would join the growing list of states making it easier for people with felony convictions to vote. According to the Sentencing Project, 23 states have expanded their voter eligibility laws to include more former felons, and an estimated 840,000 citizens have regained their right to vote."}], "child": "1547_1"}