{"name": "1548", "parent": "", "content": "District court rules Texas gerrymandering unconstitutional due to ‘intentional discrimination’ The court found that districts were drawn with the “intent to dilute minority voting strength.” Voters arrive at a polling site, Tuesday, March 4, 2014, in San Antonio. Texas. CREDIT: AP Photo/Eric Gay On Friday night, federal judges ruled 2–1 that some of Texas’s 36 congressional districts violate the U.S. Constitution or the federal Voting Rights Act, and need to be redrawn. “The Court finds that this evidence persuasively demonstrates that mapdrawers intentionally packed and cracked on the basis of race (using race as a proxy for voting behavior) with the intent to dilute minority voting strength,” U.S. District Judges Orlando Garcia and Xavier Rodriguez wrote in the majority opinion, as reported by the Dallas Morning News. Garcia and Rodriguez, who were appointed by President Bill Clinton and President George W. Bush, respectively, explicitly stated that districts were drawn to “minimize Hispanic electoral opportunity.” The ruling specifically named three congressional districts that need to be withdrawn— District 23, District 27, and District 35. Currently, two of those districts are represented by Republicans, while the other is represented by a Democrat. The order also said that the legislature manipulated the votes in District 26, a district in North Texas, through “packing and cracking” — meaning purposefully packing traditionally conservative voters in one district, while cracking traditionally liberal voters across multiple districts. Though this order didn’t invalidate District 26, redrawing three districts will by default alter the parameters of many surrounding districts. This ruling had been long awaited. The case was originally filed in 2011 as a response to the congressional redistricting that occurred after the 2010 census in Texas. In 2013, the district court found evidence that legislatures had been intentionally discriminatory when redrawing the districts, but when the U.S. Supreme Court struck down parts of the Voting Rights Act, the case stalled. If the Supreme Court upholds this ruling, minorities in Texas could have much more electoral influence in future elections. ", "title": "District court rules Texas gerrymandering unconstitutional due to ‘intentional discrimination’", "sentences": [{"5cf3": "District court rules Texas gerrymandering unconstitutional due to ‘intentional discrimination’"}, {"3877": "The court found that districts were drawn with the “intent to dilute minority voting strength.”"}, {"7a4e": "Voters arrive at a polling site, Tuesday, March 4, 2014, in San Antonio. Texas. CREDIT: AP Photo/Eric Gay"}, {"1e46": "On Friday night, federal judges ruled 2–1 that some of Texas’s 36 congressional districts violate the U.S. Constitution or the federal Voting Rights Act, and need to be redrawn."}, {"a01e": "“The Court finds that this evidence persuasively demonstrates that mapdrawers intentionally packed and cracked on the basis of race (using race as a proxy for voting behavior) with the intent to dilute minority voting strength,” U.S. District Judges Orlando Garcia and Xavier Rodriguez wrote in the majority opinion, as reported by the Dallas Morning News."}, {"3d60": "Garcia and Rodriguez, who were appointed by President Bill Clinton and President George W. Bush, respectively, explicitly stated that districts were drawn to “minimize Hispanic electoral opportunity.”"}, {"5db2": "The ruling specifically named three congressional districts that need to be withdrawn— District 23, District 27, and District 35. Currently, two of those districts are represented by Republicans, while the other is represented by a Democrat."}, {"37ed": "The order also said that the legislature manipulated the votes in District 26, a district in North Texas, through “packing and cracking” — meaning purposefully packing traditionally conservative voters in one district, while cracking traditionally liberal voters across multiple districts."}, {"acff": "Though this order didn’t invalidate District 26, redrawing three districts will by default alter the parameters of many surrounding districts."}, {"19b3": "This ruling had been long awaited. The case was originally filed in 2011 as a response to the congressional redistricting that occurred after the 2010 census in Texas. In 2013, the district court found evidence that legislatures had been intentionally discriminatory when redrawing the districts, but when the U.S. Supreme Court struck down parts of the Voting Rights Act, the case stalled."}, {"a556": "If the Supreme Court upholds this ruling, minorities in Texas could have much more electoral influence in future elections."}], "child": "1548_1"}