{"name": "1549", "parent": "", "content": "Florida Supreme Court considers allowing vote to end permanent felon disenfranchisement The state supreme court heard arguments on the amendment Monday. Ex-felons call attention to their lack of voting rights in a demonstration in Florida in 2003. CREDIT: AP Photo/J. Pat Carter More than 1.6 million Florida residents — including nearly one in four African Americans — are currently barred from the polls in Florida because of the state’s strict disenfranchisement law. But in 2018, state voters may have a chance to change that policy. A constitutional amendment is currently being considered for the ballot which would allow for the automatic restoration of voting rights to people who have completed their prison sentence, parole, and probation. The amendment could add roughly 1 million more voters to the rolls. Only those convicted of murder or felony sexual offenses would be excluded. Florida’s Supreme Court on Monday heard arguments about whether or not to allow voters to decide on the Voting Restoration Amendment. Arguing on behalf of Floridians for a Fair Democracy, the group that’s leading the effort in favor of restoring voting rights, attorney Jon Mills claimed that the amendment meets the requirements to be put on the ballot. Attorney Jon Mills argues in favor of the amendment. CREDIT: Screenshot “The question would have to be, ‘have you completed all terms of your sentence?’” he said, explaining how the state’s voter registration form could easily be changed from asking citizens about any felony convictions to asking whether the voter has completed his or her sentence. Solicitor General Amit Agarwal said Attorney General Pam Bondi (R) is taking no position on the issue. Florida currently has one of the strictest felon disenfranchisement laws in the country — only Florida, Kentucky, Virginia, and Iowa permanently bar those with felony convictions from voting for life, unless they seek clemency. More Than 1.5 Million Florida Voters Will Be Missing From Tuesday’s Primarythinkprogress.org The clemency process in Florida is notoriously difficult. During his term, former Gov. Charlie Crist made it easier for former felons to regain their rights, restoring the right to vote to more than 155,000 felons. But current Gov. Rick Scott (R) reversed that change in 2011 and mandated a waiting period before felons could even apply for clemency. Just 2,487 people have regained their voting rights since Scott took office in 2010. Floridians for a Fair Democracy chair Demond Meade is one of the more than one and a half million Floridians who cannot vote in elections, including last year’s election when his wife ran for state legislature. “In 2008, it hurt not to be able to be a part of a historic election, but I have even more pain now because I can’t even vote for my own wife,” he told ThinkProgress before Florida’s primary in March 2016. “It’s un-American and totally unfair. I should have that right.” Florida’s disenfranchisement law dates back to the post-Civil War era when the state specifically wanted to keep black residents from gaining political power. Voting advocates have pointed to its racist past in pushing for a legal change, arguing that former felons are better able to reintegrate into society when they are able to regain their rights. Meade has been active in pushing for the ballot initiative, which would require 600,000 signatures to appear on the ballot. If Floridians for a Fair Democracy reached that mark and the Supreme Court approved its language, the measure would appear on the 2018 ballot. In order to pass, it would need 60 percent support. If approved, Florida would be joining a growing list of states making it easier for people with felony convictions to vote. According to the Sentencing Project, 23 states have expanded their voter eligibility laws to include more former felons, and an estimated 840,000 citizens have regained their right to vote. Republicans were wildly successful at suppressing voters in 2016Three GOP-controlled states demonstrate the effectiveness of disenfranchising the opposition.thinkprogress.org Virginia Gov. Terry McAuliffe(D) has worked to ease his state’s restrictions, restoring voting rights to 140,000 people, considering them on a case-by-case basis. But his executive order which attempted to automatically restore rights to even more people en masse was invalidated by the state supreme court. At the time, President Trump accused McAuliffe of “crooked politics.” “They’re giving 200,000 people that have been convicted of heinous crimes, horrible crimes, the worst crimes, the right to vote because, you know what? They know they’re gonna vote Democrat,” said the then-Republican presidential candidate. In total, 6.1 million Americans, mostly from Democratic-leaning groups, are barred from voting due to felon disenfranchisement laws. An analysis released shortly before the 2016 election found that if Floridians with felony convictions were allowed to register, an estimated 258,060 would sign up as Democrats, 46,920 as Republicans, and 84,456 as independent and third party. And nearly 60,000 additional ballots would have been cast. ", "title": "Florida Supreme Court considers allowing vote to end permanent felon disenfranchisement", "sentences": [{"8daa": "Florida Supreme Court considers allowing vote to end permanent felon disenfranchisement"}, {"0eb3": "The state supreme court heard arguments on the amendment Monday."}, {"5fa4": "Ex-felons call attention to their lack of voting rights in a demonstration in Florida in 2003. CREDIT: AP Photo/J. Pat Carter"}, {"56c4": "More than 1.6 million Florida residents — including nearly one in four African Americans — are currently barred from the polls in Florida because of the state’s strict disenfranchisement law."}, {"87fb": "But in 2018, state voters may have a chance to change that policy. A constitutional amendment is currently being considered for the ballot which would allow for the automatic restoration of voting rights to people who have completed their prison sentence, parole, and probation."}, {"58f4": "The amendment could add roughly 1 million more voters to the rolls. Only those convicted of murder or felony sexual offenses would be excluded."}, {"3476": "Florida’s Supreme Court on Monday heard arguments about whether or not to allow voters to decide on the Voting Restoration Amendment. Arguing on behalf of Floridians for a Fair Democracy, the group that’s leading the effort in favor of restoring voting rights, attorney Jon Mills claimed that the amendment meets the requirements to be put on the ballot."}, {"8770": "Attorney Jon Mills argues in favor of the amendment. CREDIT: Screenshot"}, {"402c": "“The question would have to be, ‘have you completed all terms of your sentence?’” he said, explaining how the state’s voter registration form could easily be changed from asking citizens about any felony convictions to asking whether the voter has completed his or her sentence."}, {"ab41": "Solicitor General Amit Agarwal said Attorney General Pam Bondi (R) is taking no position on the issue."}, {"d7ed": "Florida currently has one of the strictest felon disenfranchisement laws in the country — only Florida, Kentucky, Virginia, and Iowa permanently bar those with felony convictions from voting for life, unless they seek clemency."}, {"b61a": "More Than 1.5 Million Florida Voters Will Be Missing From Tuesday’s Primarythinkprogress.org"}, {"58a4": "The clemency process in Florida is notoriously difficult. During his term, former Gov. Charlie Crist made it easier for former felons to regain their rights, restoring the right to vote to more than 155,000 felons. But current Gov. Rick Scott (R) reversed that change in 2011 and mandated a waiting period before felons could even apply for clemency. Just 2,487 people have regained their voting rights since Scott took office in 2010."}, {"a5c5": "Floridians for a Fair Democracy chair Demond Meade is one of the more than one and a half million Floridians who cannot vote in elections, including last year’s election when his wife ran for state legislature."}, {"e067": "“In 2008, it hurt not to be able to be a part of a historic election, but I have even more pain now because I can’t even vote for my own wife,” he told ThinkProgress before Florida’s primary in March 2016. “It’s un-American and totally unfair. I should have that right.”"}, {"c761": "Florida’s disenfranchisement law dates back to the post-Civil War era when the state specifically wanted to keep black residents from gaining political power. Voting advocates have pointed to its racist past in pushing for a legal change, arguing that former felons are better able to reintegrate into society when they are able to regain their rights."}, {"8726": "Meade has been active in pushing for the ballot initiative, which would require 600,000 signatures to appear on the ballot. If Floridians for a Fair Democracy reached that mark and the Supreme Court approved its language, the measure would appear on the 2018 ballot. In order to pass, it would need 60 percent support."}, {"4115": "If approved, Florida would be joining a growing list of states making it easier for people with felony convictions to vote. According to the Sentencing Project, 23 states have expanded their voter eligibility laws to include more former felons, and an estimated 840,000 citizens have regained their right to vote."}, {"3de1": "Republicans were wildly successful at suppressing voters in 2016Three GOP-controlled states demonstrate the effectiveness of disenfranchising the opposition.thinkprogress.org"}, {"d9c7": "Virginia Gov. Terry McAuliffe(D) has worked to ease his state’s restrictions, restoring voting rights to 140,000 people, considering them on a case-by-case basis. But his executive order which attempted to automatically restore rights to even more people en masse was invalidated by the state supreme court."}, {"1e60": "At the time, President Trump accused McAuliffe of “crooked politics.”"}, {"cab2": "“They’re giving 200,000 people that have been convicted of heinous crimes, horrible crimes, the worst crimes, the right to vote because, you know what? They know they’re gonna vote Democrat,” said the then-Republican presidential candidate."}, {"dca9": "In total, 6.1 million Americans, mostly from Democratic-leaning groups, are barred from voting due to felon disenfranchisement laws. An analysis released shortly before the 2016 election found that if Floridians with felony convictions were allowed to register, an estimated 258,060 would sign up as Democrats, 46,920 as Republicans, and 84,456 as independent and third party. And nearly 60,000 additional ballots would have been cast."}], "child": "1549_1\t1549_2\t1549_3\t1549_4\t1549_5"}