{"name": "1550", "parent": "", "content": "Trump’s voter suppression team may have just shot itself in the foot Hey, guys, you’re giving up the game. CREDIT: AP Photo/Susan Walsh, Pool On Monday, the Justice Department made its first major shift away from the role as a defender of voting rights that it played under President Obama — and toward the role as a defender of voter suppression that it is likely to play under President Trump and Attorney General Jeff Sessions. In a motion filed in a federal trial court, DOJ asked to withdraw an allegation it made against a Texas voter suppression law almost four years ago. As a legal matter, this motion shouldn’t matter very much. The case is also being litigated by private parties who will continue a full-fledged assault on Texas’ law, so all of the allegations against Texas are likely to move forward. As a practical matter, however, this motion could matter a great deal — and it could potentially backfire against the team of Republicans currently running the Justice Department. The fact that the Justice Department switched positions in a major lawsuit attacking a common form of voter suppression immediately after a change in administration only highlights what’s actually going on here. The law isn’t any different today than it was when Obama was president, but the party that currently controls the White House stands to benefit from Texas’ brand of voter suppression. And it is possible that this stark reality could make some judges — or even one justice in particular — uncomfortable enough to break against voter ID. An effort to rescue a voter ID law Back in 2011, Texas passed a strict law requiring voters to show certain forms of ID before they could cast a ballot. On its face, this law appeared to be designed to maximize its impact on Democratic voters and to minimize its impact on Republicans. It permitted voters to cast a ballot, for example, if they showed a handgun license, but not if they showed a student ID. Even if they don’t give preferential treatment to people with gun licenses, voter ID laws generally target Democratic voters. One study found that “Democratic turnout drops by an estimated 8.8 percentage points in general elections when strict photo identification laws are in place,” as opposed to only 3.6 percentage points for Republicans. New study confirms that voter ID laws are very racistBut the Supreme Court probably won’t care.thinkprogress.org Last year, the United States Court of Appeals for the Fifth Circuit held that Texas’ voting law violates the federal Voting Rights Act, citing its discriminatory effect on voters of color: One expert testified that “that Hispanic registered voters and Black registered voters were respectively 195% and 305% more likely than their Anglo peers to lack” voter ID. Another survey found that “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID. Even the state’s own expert determined that “4% of eligible White voters lacked [voter] ID, compared to 5.3% of eligible Black voters and 6.9% of eligible Hispanic voters.” The Justice Department cannot, at least at this stage of the litigation, do anything to change the Fifth Circuit’s determination that the law has a discriminatory effect. Its latest motion, however, withdraws its claim that the law was enacted with discriminatory intent. The Voting Rights Act prohibits laws that have a disproportionate effect on voters of color, even if the law was not necessarily enacted with racist intent. Nevertheless, the question of whether the law was enacted with such intent is important because it can determine how much of the law might stand. As voting rights scholar Rick Hasen explains, if the courts determine that Texas acted with discriminatory intent, that “would allow throwing the law out entirely,” and could also enable the courts to “put Texas back under federal supervision for up to 10 years.” Otherwise, the Texas’s law may only be softened with steps “such as by allowing those who lack ID and cannot easily get it to put in an affidavit swearing to identity.” Backing away from the claim that the law was enacted with discriminatory intent is, essentially, the DOJ’s effort to rescue as much of the law as possible. Off the wall Politically charged cases such as this one often operate on two levels. On the surface, lawyers and judges use the language of the law to argue that one result or the other is commanded by precedents. Below the surface, however, politics often intrudes, as do preconceived ideas that may not be consistent with the reality of a particular case. On the surface, Veasey v. Abbott, the challenge to the Texas voter ID law, is a case about how a Texas law interacts with a federal law prohibiting racial voter discrimination. At the sunken level, however, this is really a case about whether states should be allowed to manipulate election law in order to benefit one party over the other. Now he’s in the sunken place. CREDIT: AP Photo/Alex Brandon Judges who object to this kind of manipulation can fall back on the Voting Rights Act to provide a rationale to strike the law down — it helps that voter ID actually does violate the Voting Rights Act. Other judges, meanwhile, may claim that the plaintiffs failed to jump through procedural hoops, or that they need to produce more evidence that the law disenfranchises voters. There are often many ways to kill a meritorious legal challenge. But judges are also judges. Their institutional legitimacy depends on a widespread perception that they are applying the law fairly. Indeed, often a judge’s own self-image depends on this perception as well. Human beings have a tremendous ability to engage in motivated reasoning — to convince themselves that the thing they want to be true is, in fact, true — and judges are only human. But there is at least some evidence that, at a certain point, the bad optics surrounding a case can jolt a judge away from such reasoning. Consider the two major Supreme Court cases challenging the Affordable Care Act. The first of these suits, NFIB v. Sebelius, was widely considered a dog of a case by Court watchers. An American Bar Association poll of “a select group of academics, journalists and lawyers who regularly follow and/or comment on the Supreme Court” found that 85 percent expected the Court to uphold the law on the merits. And yet, we now know that the Court came within a hair of striking down the law. Four justices voted to repeal the entire law, while a fifth, Chief Justice John Roberts, reportedly “initially sided with the Supreme Court’s four conservative justices to strike down the heart of President Obama’s health care reform law, the Affordable Care Act, but later changed his position and formed an alliance with liberals to uphold the bulk of the law.” Three years later, the Supreme Court heard King v. Burwell, a second attempt to undermine Obamacare. This time, however, the Obama administration achieved a comfortable 6–3 win, as well as a majority opinion which left the Affordable Care Act on stronger footing than if King had never been litigated. The difference between these two cases wasn’t at the surface level. It was at the sunken level. As Yale’s Jack Balkin wrote about NFIB, the first challenge to Obamacare moved from “off the wall” to “on the wall” because of the considerable efforts by Republican elites to present NFIB’s off the wall claims as legitimate. “Arguments move from off the wall to on the wall because people and institutions are willing to put their reputations on the line and state that an argument formerly thought beyond the pale is not crazy at all, but is actually a pretty good legal argument,” Balkin wrote. Additionally, “it matters greatly who vouches for the argument — whether they are well-respected, powerful and influential, and how they are situated in institutions with professional authority or in institutions like politics or the media that shape public opinion.” So when conservative voices throughout government, the legal profession, the courts, and the media were willing to put their reputations on the line to elevate this challenge to Obamacare, it created space for the Supreme Court to go there as well. By the time King rolled around, liberals had learned this lesson. As I once described the campaign to save Obamacare from King v. Burwell: Every time a lawyer for the King plaintiffs was caught in a contradiction, it was reported in a national news outlet. Every time a previous statement by a Republican governor or member of Congress revealed that he or she once rejected the legal theory in King, that became national news as well. Columnists denounced the case. Liberal elites mocked it. By decision day, it was hard to escape Linda Greenhouse’s conclusion that this lawsuit was simply an effort to recruit the justices “into the front lines of a partisan war.” That’s the difference between Obamacare’s near-death experience in NFIB and its triumphant victory in King. The law’s supporters didn’t just win their case in court — they ensured that a vote in favor of the King plaintiffs would be an embarrassment. What about Justice Kennedy? Texas’ voter ID law is a case about federal anti-discrimination law, but it is just as much a case about whether the Republican Party should be allowed to play around with election law in order to help elect Republicans. Nothing drives that reality home more than the fact that, after four years of attacking Texas’ law, the Justice Department abruptly reversed course the moment that Republicans took over the agency. These optics should embarrass judges who are inclined to support the law. It makes it that much harder to keep the submerged aspects of Veasey hidden below the surface. Will that matter to most of these judges? Almost certainly not. But the single most important judge in the country is Justice Anthony Kennedy, a conservative who has supported voter ID laws in the past, but who is also known to be fickle, especially in cases related to race discrimination. Until recently, Justice Kennedy had never met an affirmative action program he was willing to tolerate. But then, the Court heard Fisher v. University of Texas at Austin — twice. The first time Fisher was before the Court, Kennedy complained at oral arguments that the University of Texas used an admissions program where “what counts is race above all.” He seemed determined to use this case to drive the final nail in affirmative action’s coffin. Then, as Joan Biskupic reported, Justice Sonia Sotomayor “drafted a dissent suffused with the personal experience of her Puerto Rican Bronx background.” As tensions rose within the Court, Justice Stephen Breyer brokered a compromise that kicked the case back down to the lower court rather than striking a killing blow against affirmative action. When the case was before the justices a second time, Kennedy lost his nerve. Justice Samuel Alito, now relegated to dissent, was forced to complain that “something strange has happened since our prior decision in this case.” The point is that optics can matter. Kennedy has been spooked in the past by such bad optics, and it’s possible he will be spooked again in the voter ID case. And the Justice Department’s recent actions should give him particular pause. It’s getting harder and harder for anyone to pretend that voter ID laws aren’t really just a way to keep Democrats from voting. ", "title": "Trump’s voter suppression team may have just shot itself in the foot", "sentences": [{"cb21": "Trump’s voter suppression team may have just shot itself in the foot"}, {"7673": "Hey, guys, you’re giving up the game."}, {"057c": "CREDIT: AP Photo/Susan Walsh, Pool"}, {"dd53": "On Monday, the Justice Department made its first major shift away from the role as a defender of voting rights that it played under President Obama — and toward the role as a defender of voter suppression that it is likely to play under President Trump and Attorney General Jeff Sessions."}, {"c0f1": "In a motion filed in a federal trial court, DOJ asked to withdraw an allegation it made against a Texas voter suppression law almost four years ago."}, {"ffd8": "As a legal matter, this motion shouldn’t matter very much. The case is also being litigated by private parties who will continue a full-fledged assault on Texas’ law, so all of the allegations against Texas are likely to move forward."}, {"41e2": "As a practical matter, however, this motion could matter a great deal — and it could potentially backfire against the team of Republicans currently running the Justice Department. The fact that the Justice Department switched positions in a major lawsuit attacking a common form of voter suppression immediately after a change in administration only highlights what’s actually going on here. The law isn’t any different today than it was when Obama was president, but the party that currently controls the White House stands to benefit from Texas’ brand of voter suppression."}, {"cf76": "And it is possible that this stark reality could make some judges — or even one justice in particular — uncomfortable enough to break against voter ID."}, {"d080": "An effort to rescue a voter ID law"}, {"2b69": "Back in 2011, Texas passed a strict law requiring voters to show certain forms of ID before they could cast a ballot."}, {"79b3": "On its face, this law appeared to be designed to maximize its impact on Democratic voters and to minimize its impact on Republicans. It permitted voters to cast a ballot, for example, if they showed a handgun license, but not if they showed a student ID."}, {"9de8": "Even if they don’t give preferential treatment to people with gun licenses, voter ID laws generally target Democratic voters. One study found that “Democratic turnout drops by an estimated 8.8 percentage points in general elections when strict photo identification laws are in place,” as opposed to only 3.6 percentage points for Republicans."}, {"10b7": "New study confirms that voter ID laws are very racistBut the Supreme Court probably won’t care.thinkprogress.org"}, {"be58": "Last year, the United States Court of Appeals for the Fifth Circuit held that Texas’ voting law violates the federal Voting Rights Act, citing its discriminatory effect on voters of color:"}, {"b783": "One expert testified that “that Hispanic registered voters and Black registered voters were respectively 195% and 305% more likely than their Anglo peers to lack” voter ID. Another survey found that “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID. Even the state’s own expert determined that “4% of eligible White voters lacked [voter] ID, compared to 5.3% of eligible Black voters and 6.9% of eligible Hispanic voters.”"}, {"d813": "The Justice Department cannot, at least at this stage of the litigation, do anything to change the Fifth Circuit’s determination that the law has a discriminatory effect. Its latest motion, however, withdraws its claim that the law was enacted with discriminatory intent."}, {"e93e": "The Voting Rights Act prohibits laws that have a disproportionate effect on voters of color, even if the law was not necessarily enacted with racist intent. Nevertheless, the question of whether the law was enacted with such intent is important because it can determine how much of the law might stand."}, {"e71f": "As voting rights scholar Rick Hasen explains, if the courts determine that Texas acted with discriminatory intent, that “would allow throwing the law out entirely,” and could also enable the courts to “put Texas back under federal supervision for up to 10 years.” Otherwise, the Texas’s law may only be softened with steps “such as by allowing those who lack ID and cannot easily get it to put in an affidavit swearing to identity.”"}, {"b4e3": "Backing away from the claim that the law was enacted with discriminatory intent is, essentially, the DOJ’s effort to rescue as much of the law as possible."}, {"5d4e": "Off the wall"}, {"763b": "Politically charged cases such as this one often operate on two levels. On the surface, lawyers and judges use the language of the law to argue that one result or the other is commanded by precedents. Below the surface, however, politics often intrudes, as do preconceived ideas that may not be consistent with the reality of a particular case."}, {"35f4": "On the surface, Veasey v. Abbott, the challenge to the Texas voter ID law, is a case about how a Texas law interacts with a federal law prohibiting racial voter discrimination. At the sunken level, however, this is really a case about whether states should be allowed to manipulate election law in order to benefit one party over the other."}, {"ec46": "Now he’s in the sunken place. CREDIT: AP Photo/Alex Brandon"}, {"99bb": "Judges who object to this kind of manipulation can fall back on the Voting Rights Act to provide a rationale to strike the law down — it helps that voter ID actually does violate the Voting Rights Act. Other judges, meanwhile, may claim that the plaintiffs failed to jump through procedural hoops, or that they need to produce more evidence that the law disenfranchises voters. There are often many ways to kill a meritorious legal challenge."}, {"8a01": "But judges are also judges. Their institutional legitimacy depends on a widespread perception that they are applying the law fairly. Indeed, often a judge’s own self-image depends on this perception as well."}, {"a01f": "Human beings have a tremendous ability to engage in motivated reasoning — to convince themselves that the thing they want to be true is, in fact, true — and judges are only human. But there is at least some evidence that, at a certain point, the bad optics surrounding a case can jolt a judge away from such reasoning."}, {"1164": "Consider the two major Supreme Court cases challenging the Affordable Care Act. The first of these suits, NFIB v. Sebelius, was widely considered a dog of a case by Court watchers. An American Bar Association poll of “a select group of academics, journalists and lawyers who regularly follow and/or comment on the Supreme Court” found that 85 percent expected the Court to uphold the law on the merits."}, {"7a9f": "And yet, we now know that the Court came within a hair of striking down the law. Four justices voted to repeal the entire law, while a fifth, Chief Justice John Roberts, reportedly “initially sided with the Supreme Court’s four conservative justices to strike down the heart of President Obama’s health care reform law, the Affordable Care Act, but later changed his position and formed an alliance with liberals to uphold the bulk of the law.”"}, {"4684": "Three years later, the Supreme Court heard King v. Burwell, a second attempt to undermine Obamacare. This time, however, the Obama administration achieved a comfortable 6–3 win, as well as a majority opinion which left the Affordable Care Act on stronger footing than if King had never been litigated."}, {"c1ac": "The difference between these two cases wasn’t at the surface level. It was at the sunken level."}, {"67b5": "As Yale’s Jack Balkin wrote about NFIB, the first challenge to Obamacare moved from “off the wall” to “on the wall” because of the considerable efforts by Republican elites to present NFIB’s off the wall claims as legitimate."}, {"7a40": "“Arguments move from off the wall to on the wall because people and institutions are willing to put their reputations on the line and state that an argument formerly thought beyond the pale is not crazy at all, but is actually a pretty good legal argument,” Balkin wrote. Additionally, “it matters greatly who vouches for the argument — whether they are well-respected, powerful and influential, and how they are situated in institutions with professional authority or in institutions like politics or the media that shape public opinion.”"}, {"6fc2": "So when conservative voices throughout government, the legal profession, the courts, and the media were willing to put their reputations on the line to elevate this challenge to Obamacare, it created space for the Supreme Court to go there as well."}, {"66cc": "By the time King rolled around, liberals had learned this lesson. As I once described the campaign to save Obamacare from King v. Burwell:"}, {"a834": "Every time a lawyer for the King plaintiffs was caught in a contradiction, it was reported in a national news outlet. Every time a previous statement by a Republican governor or member of Congress revealed that he or she once rejected the legal theory in King, that became national news as well. Columnists denounced the case. Liberal elites mocked it. By decision day, it was hard to escape Linda Greenhouse’s conclusion that this lawsuit was simply an effort to recruit the justices “into the front lines of a partisan war.”"}, {"08b7": "That’s the difference between Obamacare’s near-death experience in NFIB and its triumphant victory in King. The law’s supporters didn’t just win their case in court — they ensured that a vote in favor of the King plaintiffs would be an embarrassment."}, {"e500": "What about Justice Kennedy?"}, {"9c79": "Texas’ voter ID law is a case about federal anti-discrimination law, but it is just as much a case about whether the Republican Party should be allowed to play around with election law in order to help elect Republicans."}, {"eacd": "Nothing drives that reality home more than the fact that, after four years of attacking Texas’ law, the Justice Department abruptly reversed course the moment that Republicans took over the agency. These optics should embarrass judges who are inclined to support the law. It makes it that much harder to keep the submerged aspects of Veasey hidden below the surface."}, {"4ec0": "Will that matter to most of these judges? Almost certainly not. But the single most important judge in the country is Justice Anthony Kennedy, a conservative who has supported voter ID laws in the past, but who is also known to be fickle, especially in cases related to race discrimination."}, {"cbe4": "Until recently, Justice Kennedy had never met an affirmative action program he was willing to tolerate. But then, the Court heard Fisher v. University of Texas at Austin — twice."}, {"ac3e": "The first time Fisher was before the Court, Kennedy complained at oral arguments that the University of Texas used an admissions program where “what counts is race above all.” He seemed determined to use this case to drive the final nail in affirmative action’s coffin."}, {"c6aa": "Then, as Joan Biskupic reported, Justice Sonia Sotomayor “drafted a dissent suffused with the personal experience of her Puerto Rican Bronx background.” As tensions rose within the Court, Justice Stephen Breyer brokered a compromise that kicked the case back down to the lower court rather than striking a killing blow against affirmative action."}, {"7a2f": "When the case was before the justices a second time, Kennedy lost his nerve. Justice Samuel Alito, now relegated to dissent, was forced to complain that “something strange has happened since our prior decision in this case.”"}, {"3b2b": "The point is that optics can matter. Kennedy has been spooked in the past by such bad optics, and it’s possible he will be spooked again in the voter ID case."}, {"99f7": "And the Justice Department’s recent actions should give him particular pause. It’s getting harder and harder for anyone to pretend that voter ID laws aren’t really just a way to keep Democrats from voting."}], "child": "1550_1\t1550_2\t1550_3\t1550_4\t1550_5\t1550_6\t1550_7\t1550_8\t1550_9\t1550_10\t1550_11\t1550_12\t1550_13\t1550_14\t1550_15\t1550_16\t1550_17\t1550_18\t1550_19\t1550_20\t1550_21\t1550_22\t1550_23\t1550_24\t1550_25"}