{"name": "1551", "parent": "", "content": "Federal election official calls out Trump for his baseless voter fraud claims FEC commissioner Ellen Weintraub is demanding evidence. During a closed-door meeting earlier this month, President Trump told a bipartisan group of senators that if it wasn’t for massive voter fraud in New Hampshire, he would’ve won the state. But he presented no evidence for his claim that voters were illegally bused from Massachusetts to the Granite State, and a Federal Election Commission commissioner is calling him out on it. In a letter released Tuesday and published on the Federal Election Commission’s letterhead, Commissioner Ellen Weintraub says she won’t stop speaking out about Trump’s baseless claim. “The President of the United States has, without providing evidence, alleged a massive conspiracy to bus thousands of voters from one state to another to cast illegal votes in the 2016 elections,” Weintraub writes. “Any such allegation challenging the legitimacy of federal elections would be of great concern to me,” she continued. “As it happens, this particular allegation falls squarely within the jurisdiction of the Federal Election Commission, since the expense of these buses has not been accounted for on any campaign-finance filing. Accordingly, I have asked the President for his evidence.” Thus far, Trump has offered nothing to support his wild claims. Shortly after the inauguration, Trump tweeted that he’ll “be asking for a major investigation into VOTER FRAUD.” In another tweet, he claimed “at least 3,000,000 voters were illegal.” For that figure, he cited an unfounded claim repeatedly made by a obscure volunteer voter-fraud activist. Trump still hasn’t followed through on a promise to sign an executive order directing officials to begin an investigation, but he said he’s establishing a commission led by Vice President Mike Pence to “look at” alleged voter fraud “very, very carefully.” In the meantime, his spokespeople continue to go on TV and make up stories about voter fraud. The claims may be baseless, but they’re having an impact — at least 21 states are considering laws that would make it harder for citizens to vote. Those laws generally benefit Republicans. Citing Trump’s voter fraud lie, states are working to make it harder to voteSecretaries of state say legislation like voter ID laws are necessary.thinkprogress.org As Weintraub alludes to in her statement, Tuesday wasn’t the first time she called out Trump for his voter fraud comments. Days after news of Trump’s comments to the senators broke, she released this statement on FEC letterhead: That statement prompted a 501(c)(3) group named Cause of Action to send FEC Inspector General Lynne McFarland a letter calling for an investigation into whether Weintraub “violated federal ethics laws when she demanded President Trump provide evidence of his voter fraud claims in New Hampshire… Despite its name, the FEC has no authority over voter fraud claims.” Weintraub’s latest letter came in response to Cause of Action. CNN reports that Cause of Action is connected with “conservative megadonors Charles and David Koch… Tax records also show contributions to the Franklin Center from Donors Trust, a Koch-affiliated group, and the Charles Koch Foundation.” ", "title": "Federal election official calls out Trump for his baseless voter fraud claims", "sentences": [{"653d": "Federal election official calls out Trump for his baseless voter fraud claims"}, {"86c3": "FEC commissioner Ellen Weintraub is demanding evidence."}, {"bada": "During a closed-door meeting earlier this month, President Trump told a bipartisan group of senators that if it wasn’t for massive voter fraud in New Hampshire, he would’ve won the state. But he presented no evidence for his claim that voters were illegally bused from Massachusetts to the Granite State, and a Federal Election Commission commissioner is calling him out on it."}, {"462d": "In a letter released Tuesday and published on the Federal Election Commission’s letterhead, Commissioner Ellen Weintraub says she won’t stop speaking out about Trump’s baseless claim."}, {"e866": "“The President of the United States has, without providing evidence, alleged a massive conspiracy to bus thousands of voters from one state to another to cast illegal votes in the 2016 elections,” Weintraub writes."}, {"5060": "“Any such allegation challenging the legitimacy of federal elections would be of great concern to me,” she continued. “As it happens, this particular allegation falls squarely within the jurisdiction of the Federal Election Commission, since the expense of these buses has not been accounted for on any campaign-finance filing. Accordingly, I have asked the President for his evidence.”"}, {"8cf2": "Thus far, Trump has offered nothing to support his wild claims."}, {"be8c": "Shortly after the inauguration, Trump tweeted that he’ll “be asking for a major investigation into VOTER FRAUD.” In another tweet, he claimed “at least 3,000,000 voters were illegal.” For that figure, he cited an unfounded claim repeatedly made by a obscure volunteer voter-fraud activist. Trump still hasn’t followed through on a promise to sign an executive order directing officials to begin an investigation, but he said he’s establishing a commission led by Vice President Mike Pence to “look at” alleged voter fraud “very, very carefully.”"}, {"9562": "In the meantime, his spokespeople continue to go on TV and make up stories about voter fraud."}, {"65c2": "The claims may be baseless, but they’re having an impact — at least 21 states are considering laws that would make it harder for citizens to vote. Those laws generally benefit Republicans."}, {"517b": "Citing Trump’s voter fraud lie, states are working to make it harder to voteSecretaries of state say legislation like voter ID laws are necessary.thinkprogress.org"}, {"463a": "As Weintraub alludes to in her statement, Tuesday wasn’t the first time she called out Trump for his voter fraud comments. Days after news of Trump’s comments to the senators broke, she released this statement on FEC letterhead:"}, {"1512": "That statement prompted a 501(c)(3) group named Cause of Action to send FEC Inspector General Lynne McFarland a letter calling for an investigation into whether Weintraub “violated federal ethics laws when she demanded President Trump provide evidence of his voter fraud claims in New Hampshire… Despite its name, the FEC has no authority over voter fraud claims.” Weintraub’s latest letter came in response to Cause of Action."}, {"9d89": "CNN reports that Cause of Action is connected with “conservative megadonors Charles and David Koch… Tax records also show contributions to the Franklin Center from Donors Trust, a Koch-affiliated group, and the Charles Koch Foundation.”"}], "child": "1551_1\t1551_2\t1551_3"}