{"name": "1552", "parent": "", "content": "North Carolina asks SCOTUS to slay its voter suppression law for good The worst voter suppression law since Jim Crow may be dead, at least for now. CREDIT: AP Photo/Jacquelyn Martin Last July, a federal appeals court struck down several provisions of North Carolina’s omnibus voter suppression law, after determining that the law was designed for the very purpose of making it harder for African Americans to case a ballot. With this decision hobbling many of the state legislatures’ efforts to keep black people from the polls, Democrats narrowly won the state’s gubernatorial and attorney general’s races in November. Nevertheless, in Gov. Pat McCrory’s (R-NC) final days as governor, attorneys hired by the governor’s office asked the Supreme Court to take up the case, potentially creating an opening that could allow the law to be reinstated. On Tuesday, however, the state’s new attorney general Josh Stein (D) formally asked the justices to dismiss that petition — an act that will kill the case if the Court agrees. Stein’s motion matters because, while the eight-justice Court lacked the votes to reinstate the voter suppression law prior to the 2016 election, all four of the Court’s Republican appointees indicated that they were likely to support the law if North Carolina sought full review of the case. In August, North Carolina — then still led by McCrory — asked the Supreme Court to temporarily reinstate the voter suppression law for the 2016 election. The justices split 4–4 on whether to allow most of the challenged provisions to take effect. If Judge Neil Gorsuch, President Trump’s nominee to fill the Supreme Court seat that Senate Republicans held open for a year in the hopes that Trump would get to fill it, is confirmed, then he is likely to be the fifth vote to uphold voter suppression laws like the one in North Carolina. Stein’s motion seeks to take this case off the Court’s docket before the justices have a chance to breathe new life into the voter suppression law. Though the Court could conceivably deny his motion, it would be extraordinary for the justices to refuse to allow a party to withdraw a petition asking them to hear a case before the justices dispose of that petition. So the good news for voting rights advocates is that, at least for the short term, the North Carolina law is likely to be dead. The bad news is that, if the Supreme Court regains a majority that is hostile to voting rights, the law could potentially be revived down the road. The four justices who voted to reinstate the voter suppression law for the 2016 election did so despite a federal appeals court’s determination that the law was specifically designed to target black voters. As Judge Diana Gribbon Motz explained, “the legislature requested data on the use, by race, of a number of voting practices.” Then, after receiving that data, it “enacted legislation that restricted voting and registration in five different ways, all of which disproportionately affected African Americans.” A justice who is willing to reinstate such a law is unlikely to impose meaningful limits on states’ ability to suppress the vote. And, if Gorsuch becomes the fifth vote to uphold North Carolina-style laws, the state could someday seek to re-litigate the law’s legality. Or it could enact an only-slightly-modified version of the law and then ask the Supreme Court to bless that law. For the time being, however, North Carolina’s voters are likely to be safe from the voter suppression law. UPDATE: Professor Rick Hasen, an expert on voting rights, notes another way that the case could potentially remain alive. Stein’s press release announcing his motion states that “the State Board of Elections, its individual members, and its Executive Director will remain in the case for the time being,” though it is unclear whether the board “can get or keep outside counsel.” Hasen also notes that he is “not sure if the Legislature can seek to intervene at this time,” potentially allowing them to continue the case against the wishes of the governor and attorney general. ", "title": "North Carolina asks SCOTUS to slay its voter suppression law for good", "sentences": [{"489b": "North Carolina asks SCOTUS to slay its voter suppression law for good"}, {"3bed": "The worst voter suppression law since Jim Crow may be dead, at least for now."}, {"b49a": "CREDIT: AP Photo/Jacquelyn Martin"}, {"a4d6": "Last July, a federal appeals court struck down several provisions of North Carolina’s omnibus voter suppression law, after determining that the law was designed for the very purpose of making it harder for African Americans to case a ballot. With this decision hobbling many of the state legislatures’ efforts to keep black people from the polls, Democrats narrowly won the state’s gubernatorial and attorney general’s races in November."}, {"f0a9": "Nevertheless, in Gov. Pat McCrory’s (R-NC) final days as governor, attorneys hired by the governor’s office asked the Supreme Court to take up the case, potentially creating an opening that could allow the law to be reinstated."}, {"ee1d": "On Tuesday, however, the state’s new attorney general Josh Stein (D) formally asked the justices to dismiss that petition — an act that will kill the case if the Court agrees."}, {"3690": "Stein’s motion matters because, while the eight-justice Court lacked the votes to reinstate the voter suppression law prior to the 2016 election, all four of the Court’s Republican appointees indicated that they were likely to support the law if North Carolina sought full review of the case."}, {"635b": "In August, North Carolina — then still led by McCrory — asked the Supreme Court to temporarily reinstate the voter suppression law for the 2016 election. The justices split 4–4 on whether to allow most of the challenged provisions to take effect."}, {"4081": "If Judge Neil Gorsuch, President Trump’s nominee to fill the Supreme Court seat that Senate Republicans held open for a year in the hopes that Trump would get to fill it, is confirmed, then he is likely to be the fifth vote to uphold voter suppression laws like the one in North Carolina."}, {"3f2d": "Stein’s motion seeks to take this case off the Court’s docket before the justices have a chance to breathe new life into the voter suppression law. Though the Court could conceivably deny his motion, it would be extraordinary for the justices to refuse to allow a party to withdraw a petition asking them to hear a case before the justices dispose of that petition."}, {"c2ff": "So the good news for voting rights advocates is that, at least for the short term, the North Carolina law is likely to be dead. The bad news is that, if the Supreme Court regains a majority that is hostile to voting rights, the law could potentially be revived down the road."}, {"c62e": "The four justices who voted to reinstate the voter suppression law for the 2016 election did so despite a federal appeals court’s determination that the law was specifically designed to target black voters. As Judge Diana Gribbon Motz explained, “the legislature requested data on the use, by race, of a number of voting practices.” Then, after receiving that data, it “enacted legislation that restricted voting and registration in five different ways, all of which disproportionately affected African Americans.”"}, {"a969": "A justice who is willing to reinstate such a law is unlikely to impose meaningful limits on states’ ability to suppress the vote. And, if Gorsuch becomes the fifth vote to uphold North Carolina-style laws, the state could someday seek to re-litigate the law’s legality. Or it could enact an only-slightly-modified version of the law and then ask the Supreme Court to bless that law."}, {"bb1a": "For the time being, however, North Carolina’s voters are likely to be safe from the voter suppression law."}, {"ca0d": "UPDATE: Professor Rick Hasen, an expert on voting rights, notes another way that the case could potentially remain alive. Stein’s press release announcing his motion states that “the State Board of Elections, its individual members, and its Executive Director will remain in the case for the time being,” though it is unclear whether the board “can get or keep outside counsel.”"}, {"9a26": "Hasen also notes that he is “not sure if the Legislature can seek to intervene at this time,” potentially allowing them to continue the case against the wishes of the governor and attorney general."}], "child": "1552_1\t1552_2\t1552_3\t1552_4\t1552_5\t1552_6\t1552_7\t1552_8\t1552_9\t1552_101552_1\t1552_2\t1552_3\t1552_4\t1552_5\t1552_6\t1552_7\t1552_8\t1552_9\t1552_10"}