{"name": "1553", "parent": "", "content": "Citing Trump’s voter fraud lie, states are working to make it harder to vote Secretaries of state say legislation like voter ID laws are necessary. WASHINGTON, D.C. — President Trump will never come up with real evidence to support his claim that three to five million ballots were cast illegally in the 2016 election. The allegation is false, and no number of investigations or committees will be able to substantiate Trump’s claim. But that doesn’t mean that the lie won’t have consequences. Already, at least 21 states across the country are capitalizing on political rhetoric about fraud to push for laws that make it harder for eligible citizens to vote. At the annual gathering of secretaries of state in Washington, D.C. this week, Republican elections chiefs blocked an attempt to official denounce Trump’s lie. Instead, they cited the president’s claims, telling ThinkProgress they support measures like voter ID laws, cuts to same-day registration, and efforts to make it harder to register to vote. Alabama’s Republican Secretary of State repeated the White House’s unsubstantiated claim that thousands of out-of-state citizens cast ballots in New Hampshire, potentially handing the state to Hillary Clinton. New Hampshire’s Secretary of State defended his state’s voter accessibility while his legislature pushes for a measure that would potentially block thousands of college students from casting ballots. And Nevada’s Secretary of State said she supports voter ID laws because she has never had a problem showing an ID to vote. Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org Study after study has shown that voter fraud is non-existent, yet the Republican party has used the false narrative of rampant fraud to push for laws that have shown to disenfranchise minority, low-income, and younger voters. Voter suppression laws do not prevent voter fraud, but they do prevent a disproportionately large share of Democratic-leaning voters from casting ballots, helping Republicans to win elections. Democratic secretaries of state, though fewer in number, were also at the gathering, where they told ThinkProgress that their work countering the “voter fraud” narrative has become more challenging with President Trump in the White House. Connecticut Secretary of State Denise Merrill (D) said she worries for the future of voting laws with Republicans controlling all three branches of government. And New Mexico’s Maggie Toulouse Oliver (D) said that all state election chiefs should know that Trump’s claims of massive fraud are false, given the small number of fraud cases each state has documented. “This group knows better and is potentially poised to be very vocal about that,” she told ThinkProgress. “I would be dismayed to hear that those false claims are being used to make things harder for voters.” Looking for proof of fraud, GOP grasps at straws Voting experts have repeated since the election that there is no proof of fraud on the level that Trump has claimed. At the National Association of Secretaries of State convention, David Becker, executive director of the Center for Election Innovation and Research, reminded the attendees that if massive fraud had occurred, they would be the first to know. “There is a system of checks and balances in place,” he said during a panel on trust in elections. “We all know in this room that if there were massive voter registration fraud, we would have seen large numbers of flagged records that didn’t match DMV records or social security records, that we would have seen unusual levels of activity we hadn’t seen before, that we would have seen large numbers of requests for out of state mail ballots that we hadn’t seen before.” None of that occurred, but that hasn’t stopped elections chiefs from crying fraud. Alabama Secretary of State John Merrill (R) said that he has identified 304 potential cases of voter fraud in his state since he took office in 2015, and a far smaller number ended with convictions. Though that number pales in comparison to Trump’s claim of millions, Merrill said he can never be sure that other states don’t have more rampant fraud. “I’ve had some information that’s been introduced to me that’s been very disconcerting,” he told ThinkProgress. “We’ve been very concerned that there are instances in other states that may have a higher level of credibility than had been widely known before now.” Alabama Republican Secretary of State John Merrill. CREDIT: AP Photo/Brynn Anderson The instance Merrill was referring to was a claim that roughly 6,000 people registered to vote on Election Day in New Hampshire using out-of-state ID cards. Though it’s currently legal to same-day register and to use a different state’s ID, Merrill claimed that it could be evidence of massive vote fraud. “Some people would look at that as fraudulent activity because in their state law, it only indicates that you have to have intent to live there,” he said. “Well, their intent could be that I show up and then I go back to my home [state].” The White House has also pointed to vote fraud in New Hampshire, without any evidence. Senior policy adviser Stephen Miller was unable to substantiate his claim that out-of-state voters were bused into New Hampshire to commit fraud; neither could Kansas Secretary of State Kris Kobach (R), a Trump ally, who told CNN the same lie. “Statements that come from the White House are usually based on data or evidence or facts, and that’s clearly not the environment we’re living in right now,” California Secretary of State Alex Padilla (D) told ThinkProgress. For his part, New Hampshire Secretary of State Bill Gardner (D) has said he will not buy the claims without proof, but told ThinkProgress he welcomes investigators in his state to determine whether the small number of fraudulent votes he has seen could mean there are many more that go unreported. “People say that if you get picked up for a DWI, you’ve probably done it at least ten times, maybe more,” he told ThinkProgress. “We don’t know how to quantify it… We have many races that are decided by less than five votes.” 2017 could be a banner year for voter ID laws Already this year, at least 12 states are pushing for restrictive voter ID laws. In Arkansas and North Dakota, bills have already passed in their state houses, according to the Brennan Center for Justice. While most proposals have come out of the legislatures, Iowa’s Secretary of State himself proposed a plan to implement voter ID. Alabama already has a strict voter ID law, and Secretary of State Merrill said he recommends all of his colleagues push for similar requirements in their states. “I think everybody needs to have it because everybody needs to be interested in preserving the credibility and integrity of the election system,” he said. When presented with recent studies that document how voter ID blocks certain populations from voting, Merrill responded: “It’s easy for people to say that. It’s easy for people to say it’s a restrictive mechanism or it limits participation.” Not all state legislatures considering voter ID laws have the support of their elections chiefs. Legislators in Maine this week considered a voter ID bill, but Secretary of State Matt Dunlap (D) told ThinkProgress he has always opposed it. “It adds no additional security, it adds an unknown cost and we don’t know how it would be paid for, and it would put a barrier between voters and the polling places,” he said. “I see this as a cynical approach to keep low-income people, people under financial stress, minorities, the elderly from participating in their democratic form of self governance.” Other efforts to curb voter participation In addition to voter ID laws, elections officials are pushing for other, sometimes more subtle ways, to block people from the polls. Both Iowa and New Hampshire — states with crucial early presidential primaries — are considering eliminating same day registration. Texas is considering shortening the early voting period. And New Hampshire is also floating a residency requirement that would make it much more difficult for out-of-state students, military personnel, and other temporary residents to cast a ballot. That bill, predicated on false claims that thousands of out-of-state voters came into New Hampshire to sway the election, would change the law from requiring voters to simply be “domiciled” in the state to vote to requiring them to be in New Hampshire for 210 days a year. At the same time, the state is considering requiring voters to be residents who plan to live in New Hampshire “for the indefinite future.” Gardner, New Hampshire’s secretary of state, seemed unaware of the proposals when ThinkProgress asked him for comment. Democrats take the opposite approach Meanwhile, among most Democratic elections chiefs in Washington for the convention, the consensus was that states should implement automatic registration, expand early voting, and make registration easier to encourage more people to participate in election. According to the Brennan Center, already these year, “99 bills that would modernize voter registration have been introduced in 29 states, with automatic voter registration being the most prevalent.” Bills to introduce automatic registration have been introduced in Arizona, Arkansas, Connecticut, Florida, Georgia, Hawaii, Indiana, Iowa, Minnesota, Mississippi, Missouri, Nebraska, New Mexico, New York, Oklahoma, Pennsylvania, South Carolina, Texas, Utah, Virginia, and Washington. Alabama’s Merrill — who has said automatic registration would “cheapen” civil rights leaders’ work— questioned why any state would not “allow a person to decide what they want to do.” But a number of Democratic elections officials said there’s no reason not to make registration automatic. “We know that in New Mexico the allegations that are being made by the administration don’t bear out,” Toulouse Oliver said. “We’re going to keep moving forward to try to expand the franchise.” Denise Merrill of Connecticut agreed, saying she has collected data to prove the integrity of the voting process. Out of the millions of votes cast, a commission has only found 16 cases of potential fraud, most of which were mistakes or clerical errors. “We have fought off any effort to claim that there’s voter fraud,” she said. “Unfortunately I think it’s far too easy today to get people to think there’s a conspiracy, and so just bringing this up is a problem. It erodes trust in democracy, and that’s the worst of it.” ", "title": "Citing Trump’s voter fraud lie, states are working to make it harder to vote", "sentences": [{"0ebc": "Citing Trump’s voter fraud lie, states are working to make it harder to vote"}, {"771d": "Secretaries of state say legislation like voter ID laws are necessary."}, {"84be": "WASHINGTON, D.C. — President Trump will never come up with real evidence to support his claim that three to five million ballots were cast illegally in the 2016 election. The allegation is false, and no number of investigations or committees will be able to substantiate Trump’s claim."}, {"6020": "But that doesn’t mean that the lie won’t have consequences. Already, at least 21 states across the country are capitalizing on political rhetoric about fraud to push for laws that make it harder for eligible citizens to vote."}, {"21ca": "At the annual gathering of secretaries of state in Washington, D.C. this week, Republican elections chiefs blocked an attempt to official denounce Trump’s lie. Instead, they cited the president’s claims, telling ThinkProgress they support measures like voter ID laws, cuts to same-day registration, and efforts to make it harder to register to vote."}, {"7630": "Alabama’s Republican Secretary of State repeated the White House’s unsubstantiated claim that thousands of out-of-state citizens cast ballots in New Hampshire, potentially handing the state to Hillary Clinton. New Hampshire’s Secretary of State defended his state’s voter accessibility while his legislature pushes for a measure that would potentially block thousands of college students from casting ballots. And Nevada’s Secretary of State said she supports voter ID laws because she has never had a problem showing an ID to vote."}, {"c4bc": "Trump’s lie about illegal votes will have dangerous consequencesSixteen states are already working on legislation to suppress voters this year.thinkprogress.org"}, {"7c08": "Study after study has shown that voter fraud is non-existent, yet the Republican party has used the false narrative of rampant fraud to push for laws that have shown to disenfranchise minority, low-income, and younger voters. Voter suppression laws do not prevent voter fraud, but they do prevent a disproportionately large share of Democratic-leaning voters from casting ballots, helping Republicans to win elections."}, {"5a10": "Democratic secretaries of state, though fewer in number, were also at the gathering, where they told ThinkProgress that their work countering the “voter fraud” narrative has become more challenging with President Trump in the White House. Connecticut Secretary of State Denise Merrill (D) said she worries for the future of voting laws with Republicans controlling all three branches of government. And New Mexico’s Maggie Toulouse Oliver (D) said that all state election chiefs should know that Trump’s claims of massive fraud are false, given the small number of fraud cases each state has documented."}, {"ed25": "“This group knows better and is potentially poised to be very vocal about that,” she told ThinkProgress. “I would be dismayed to hear that those false claims are being used to make things harder for voters.”"}, {"95a3": "Looking for proof of fraud, GOP grasps at straws"}, {"e860": "Voting experts have repeated since the election that there is no proof of fraud on the level that Trump has claimed. At the National Association of Secretaries of State convention, David Becker, executive director of the Center for Election Innovation and Research, reminded the attendees that if massive fraud had occurred, they would be the first to know."}, {"c614": "“There is a system of checks and balances in place,” he said during a panel on trust in elections. “We all know in this room that if there were massive voter registration fraud, we would have seen large numbers of flagged records that didn’t match DMV records or social security records, that we would have seen unusual levels of activity we hadn’t seen before, that we would have seen large numbers of requests for out of state mail ballots that we hadn’t seen before.”"}, {"0582": "None of that occurred, but that hasn’t stopped elections chiefs from crying fraud."}, {"170b": "Alabama Secretary of State John Merrill (R) said that he has identified 304 potential cases of voter fraud in his state since he took office in 2015, and a far smaller number ended with convictions. Though that number pales in comparison to Trump’s claim of millions, Merrill said he can never be sure that other states don’t have more rampant fraud."}, {"c1ab": "“I’ve had some information that’s been introduced to me that’s been very disconcerting,” he told ThinkProgress. “We’ve been very concerned that there are instances in other states that may have a higher level of credibility than had been widely known before now.”"}, {"2c3a": "Alabama Republican Secretary of State John Merrill. CREDIT: AP Photo/Brynn Anderson"}, {"d56c": "The instance Merrill was referring to was a claim that roughly 6,000 people registered to vote on Election Day in New Hampshire using out-of-state ID cards. Though it’s currently legal to same-day register and to use a different state’s ID, Merrill claimed that it could be evidence of massive vote fraud."}, {"62f3": "“Some people would look at that as fraudulent activity because in their state law, it only indicates that you have to have intent to live there,” he said. “Well, their intent could be that I show up and then I go back to my home [state].”"}, {"01ea": "The White House has also pointed to vote fraud in New Hampshire, without any evidence. Senior policy adviser Stephen Miller was unable to substantiate his claim that out-of-state voters were bused into New Hampshire to commit fraud; neither could Kansas Secretary of State Kris Kobach (R), a Trump ally, who told CNN the same lie."}, {"dbd3": "“Statements that come from the White House are usually based on data or evidence or facts, and that’s clearly not the environment we’re living in right now,” California Secretary of State Alex Padilla (D) told ThinkProgress."}, {"1881": "For his part, New Hampshire Secretary of State Bill Gardner (D) has said he will not buy the claims without proof, but told ThinkProgress he welcomes investigators in his state to determine whether the small number of fraudulent votes he has seen could mean there are many more that go unreported."}, {"c298": "“People say that if you get picked up for a DWI, you’ve probably done it at least ten times, maybe more,” he told ThinkProgress. “We don’t know how to quantify it… We have many races that are decided by less than five votes.”"}, {"0ab8": "2017 could be a banner year for voter ID laws"}, {"7d14": "Already this year, at least 12 states are pushing for restrictive voter ID laws. In Arkansas and North Dakota, bills have already passed in their state houses, according to the Brennan Center for Justice. While most proposals have come out of the legislatures, Iowa’s Secretary of State himself proposed a plan to implement voter ID."}, {"6412": "Alabama already has a strict voter ID law, and Secretary of State Merrill said he recommends all of his colleagues push for similar requirements in their states. “I think everybody needs to have it because everybody needs to be interested in preserving the credibility and integrity of the election system,” he said."}, {"92c8": "When presented with recent studies that document how voter ID blocks certain populations from voting, Merrill responded: “It’s easy for people to say that. It’s easy for people to say it’s a restrictive mechanism or it limits participation.”"}, {"4db6": "Not all state legislatures considering voter ID laws have the support of their elections chiefs. Legislators in Maine this week considered a voter ID bill, but Secretary of State Matt Dunlap (D) told ThinkProgress he has always opposed it."}, {"8394": "“It adds no additional security, it adds an unknown cost and we don’t know how it would be paid for, and it would put a barrier between voters and the polling places,” he said. “I see this as a cynical approach to keep low-income people, people under financial stress, minorities, the elderly from participating in their democratic form of self governance.”"}, {"ede8": "Other efforts to curb voter participation"}, {"88bc": "In addition to voter ID laws, elections officials are pushing for other, sometimes more subtle ways, to block people from the polls. Both Iowa and New Hampshire — states with crucial early presidential primaries — are considering eliminating same day registration. Texas is considering shortening the early voting period. And New Hampshire is also floating a residency requirement that would make it much more difficult for out-of-state students, military personnel, and other temporary residents to cast a ballot."}, {"5030": "That bill, predicated on false claims that thousands of out-of-state voters came into New Hampshire to sway the election, would change the law from requiring voters to simply be “domiciled” in the state to vote to requiring them to be in New Hampshire for 210 days a year. At the same time, the state is considering requiring voters to be residents who plan to live in New Hampshire “for the indefinite future.”"}, {"11fa": "Gardner, New Hampshire’s secretary of state, seemed unaware of the proposals when ThinkProgress asked him for comment."}, {"1e2d": "Democrats take the opposite approach"}, {"c2ae": "Meanwhile, among most Democratic elections chiefs in Washington for the convention, the consensus was that states should implement automatic registration, expand early voting, and make registration easier to encourage more people to participate in election."}, {"e80d": "According to the Brennan Center, already these year, “99 bills that would modernize voter registration have been introduced in 29 states, with automatic voter registration being the most prevalent.”"}, {"121b": "Bills to introduce automatic registration have been introduced in Arizona, Arkansas, Connecticut, Florida, Georgia, Hawaii, Indiana, Iowa, Minnesota, Mississippi, Missouri, Nebraska, New Mexico, New York, Oklahoma, Pennsylvania, South Carolina, Texas, Utah, Virginia, and Washington."}, {"d192": "Alabama’s Merrill — who has said automatic registration would “cheapen” civil rights leaders’ work— questioned why any state would not “allow a person to decide what they want to do.” But a number of Democratic elections officials said there’s no reason not to make registration automatic."}, {"d7fc": "“We know that in New Mexico the allegations that are being made by the administration don’t bear out,” Toulouse Oliver said. “We’re going to keep moving forward to try to expand the franchise.”"}, {"02cb": "Denise Merrill of Connecticut agreed, saying she has collected data to prove the integrity of the voting process. Out of the millions of votes cast, a commission has only found 16 cases of potential fraud, most of which were mistakes or clerical errors."}, {"16bf": "“We have fought off any effort to claim that there’s voter fraud,” she said. “Unfortunately I think it’s far too easy today to get people to think there’s a conspiracy, and so just bringing this up is a problem. It erodes trust in democracy, and that’s the worst of it.”"}], "child": "1553_1\t1553_2\t1553_3\t1553_4\t1553_5\t1553_6\t1553_7\t1553_8\t1553_9\t1553_10\t1553_11"}