{"name": "1554", "parent": "", "content": "New study confirms that voter ID laws are very racist But the Supreme Court probably won’t care. CREDIT: AP Photo/Bob Daugherty, File Conservative lawmakers routinely tout voter ID laws as a solution to voter fraud, but multiple investigations — including investigations conducted by Republican supporters of voter ID — confirm that those laws are a solution in search of a problem. The kind of fraud prevented by such laws is only slightly more common than elves. A new study by political scientists Zoltan L. Hajnal, Nazita Lajevardi, and Lindsay Nielson explains what these laws do accomplish, however. According to Hajnal and his co-authors, turnout among Hispanic voters is “7.1 percentage points lower in general elections and 5.3 points lower in primaries” in states with strict voter ID laws. The laws also reduce turnout among African-American and Asian-American voters. White turnout, according to their study, is “largely unaffected.” Hajnal and his co-authors also offer a possible explanation for why conservatives favor these laws. “By instituting strict voter ID laws,” they explain, “states can alter the electorate and shift outcomes toward those on the right.” In states with such laws “the influence of Democrats and liberals wanes and the power of Republicans grows.” As a result of voter ID laws’ disparate impact on people of color, such laws are illegal. The Voting Rights Act prohibits any state voting restriction “which results in a denial or abridgment of the right of any citizen . . . to vote on account of race or color.” And indeed, some courts have struck down voter ID laws because of their disparate impact on minority voters. Most notably, the United States Court of Appeals for the Fifth Circuit, one of the most conservative federal appeals courts in the country, held that Texas’ voter ID law violates the Voting Rights Act. Their opinion noted data indicating that “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID.” Yet, despite the racist impact of voter ID and a federal law prohibiting such impacts, it is far from clear that the Supreme Court will enforce the Voting Rights Act when it hears a challenge to voter ID. Last year, a federal appeals court struck down North Carolina’s omnibus voter suppression law, after finding that the law was intentionally designed to target black voters and to minimize its impact on whites. Yet all four conservative justices voted to reinstate this law before the 2016 election. If Judge Neil Gorsuch, President Donald Trump’s nominee to fill the vacant seat on the Supreme Court, is confirmed, he will likely be the fifth vote in favor of racial voter suppression. ", "title": "New study confirms that voter ID laws are very racist", "sentences": [{"0ef4": "New study confirms that voter ID laws are very racist"}, {"ac70": "But the Supreme Court probably won’t care."}, {"62f8": "CREDIT: AP Photo/Bob Daugherty, File"}, {"4faf": "Conservative lawmakers routinely tout voter ID laws as a solution to voter fraud, but multiple investigations — including investigations conducted by Republican supporters of voter ID — confirm that those laws are a solution in search of a problem. The kind of fraud prevented by such laws is only slightly more common than elves."}, {"c352": "A new study by political scientists Zoltan L. Hajnal, Nazita Lajevardi, and Lindsay Nielson explains what these laws do accomplish, however. According to Hajnal and his co-authors, turnout among Hispanic voters is “7.1 percentage points lower in general elections and 5.3 points lower in primaries” in states with strict voter ID laws. The laws also reduce turnout among African-American and Asian-American voters."}, {"ca3c": "White turnout, according to their study, is “largely unaffected.”"}, {"5dc1": "Hajnal and his co-authors also offer a possible explanation for why conservatives favor these laws. “By instituting strict voter ID laws,” they explain, “states can alter the electorate and shift outcomes toward those on the right.” In states with such laws “the influence of Democrats and liberals wanes and the power of Republicans grows.”"}, {"edfb": "As a result of voter ID laws’ disparate impact on people of color, such laws are illegal. The Voting Rights Act prohibits any state voting restriction “which results in a denial or abridgment of the right of any citizen . . . to vote on account of race or color.” And indeed, some courts have struck down voter ID laws because of their disparate impact on minority voters."}, {"3fe7": "Most notably, the United States Court of Appeals for the Fifth Circuit, one of the most conservative federal appeals courts in the country, held that Texas’ voter ID law violates the Voting Rights Act. Their opinion noted data indicating that “Blacks were 1.78 times more likely than Whites, and Latinos 2.42 times more likely, to lack” voter ID.”"}, {"a30c": "Yet, despite the racist impact of voter ID and a federal law prohibiting such impacts, it is far from clear that the Supreme Court will enforce the Voting Rights Act when it hears a challenge to voter ID. Last year, a federal appeals court struck down North Carolina’s omnibus voter suppression law, after finding that the law was intentionally designed to target black voters and to minimize its impact on whites. Yet all four conservative justices voted to reinstate this law before the 2016 election."}, {"919d": "If Judge Neil Gorsuch, President Donald Trump’s nominee to fill the vacant seat on the Supreme Court, is confirmed, he will likely be the fifth vote in favor of racial voter suppression."}], "child": "1554_1\t1554_2\t1554_3\t1554_4\t1554_5\t1554_6\t1554_7\t1554_8\t1554_9\t1554_10\t1554_11\t1554_12\t1554_13\t1554_14\t1554_15\t1554_16\t1554_17\t1554_18\t1554_19\t1554_20\t1554_21\t1554_22\t1554_23\t1554_24"}