{"name": "1555", "parent": "", "content": "Gorsuch will make liberals miss Scalia Scalia, unlike Gorsuch, came from a humbler era for judicial conservatives. CREDIT: AP Photo/Lana Harris Originalism is having a moment. Although it’s been used to refer to slightly different ideas at various points in the recent past, “originalism” generally refers to the idea that the only proper way to interpret the U.S. Constitution is to examine what its words meant at the time they were ratified. The late Justice Antonin Scalia was originalism’s most famous evangelist. Neil Gorsuch, the man Donald Trump named to replace Scalia, is also an avowed originalist. Indeed, Gorsuch presents himself as something of a Scalia fanboy. In a 2016 lecture, Gorsuch spoke about how he “couldn’t see the rest of the way down the mountain for the tears” after he learned of Scalia’s death while skiing. During a White House ceremony on Monday where Gorsuch took the oath of office, he said that he “will never forget that the seat I inherit today is that of a very, very great man.” (He meant Scalia, not Merrick Garland.) The worst case scenario if Trump’s Supreme Court nominee is confirmedA child-exploiting, racist, security state hellscape.thinkprogress.org Yet for all of Gorsuch’s performative worship of Justice Scalia, Goruch’s record suggests that he takes a very different approach to the law than his judicial predecessor. Although Scalia and Gorsuch both identify as originalists, they came of age during very different times in the evolution of American law. There have been three great waves of originalist thinking in the last century. The first, led by Justice Hugo Black, was a liberal wave that washed away decisions imposing a libertarian economic model on the workplace while also invigorating the Bill of Rights. The second, led by Scalia, was a conservative wave seeking to wash away decisions such as Roe v. Wade, which Scalia and his allies viewed as too aggressively activist. Gorsuch belongs to a third wave, which is both far more at peace with judicial power than Scalia and far more skeptical of democracy. Scalia, at least for most of his time on the bench, envisioned originalism as a force of judicial restraint. Gorsuch, by contrast, is far more likely to wield it to sweep away liberal reforms and to siphon power away from the two elected branches of government. He will make Scalia look like a moderate. The three waves of originalism Senator Hugo Black accepted President Franklin Roosevelt’s appointment to the Supreme Court at a turning point in American constitutional history. In the decades before 1937, when Black took his seat on the Court, the Supreme Court largely divorced its decisions from the Constitution’s text — denuding provisions like the First Amendment of any real meaning, all while striking down child labor laws and other protections for workers. Black joined the Court just months after the Supreme Court reversed course on at least some of these decisions. The Court abandoned a line of cases that struck down the minimum wage and laws protecting labor unions on a highly dubious constitutional theory. And it upheld Social Security and other key prongs of the New Deal. Roosevelt hoped that Black, his first Supreme Court appointment, would get the Court out of the way of progress. And FDR was not disappointed. It’s unclear where Gorsuch stands on child labor. “That’s why I came on the Court,” the justice said in 1967. “I was against using due process to force the views of judges on the country” — a reference to the Constitution’s Due Process Clause, which early twentieth century conservative justices interpreted to strike down the minimum wage and similar laws — “I still am. I wouldn’t trust judges with that kind of power and the Founders did not trust them either.” Black, however, was not solely a proponent of judicial restraint — indeed, he was quite far from it. Justice Black probably did more to expand the role of the Bill of Rights than any other jurist in American history. Before Black became a justice, most of the Bill of Rights was understood to apply only to the federal government — states could violate them without risking a federal court order. Black made it his mission to ensure that these amendments would bind state and federal officials alike, and he largely succeeded in this project. Justice Black, moreover, announced this project in an opinion laying out his originalist approach to the Constitution. “I would follow what I believe was the original purpose of the Fourteenth Amendment,” he wrote. “To hold that this Court can determine what, if any, provisions of the Bill of Rights will be enforced, and if so to what degree, is to frustrate the great design of a written Constitution.” Nearly 40 years later, Justice Scalia joined the Court. Like Black, Scalia was profoundly frustrated with state of American legal precedents. Unlike Black, however, Scalia’s frustrations were directed more at decisions protecting women’s reproductive choice, among other things, than at decisions placing extra-constitutional limits on workplace regulation. In Praise Of Scaliathinkprogress.org Yet even as Scalia railed against liberal decisions he viewed as wholly illegitimate, there was a profound thread of judicial restraint woven through his rhetoric. “Whether you think prohibiting abortion is good or whether you think prohibiting abortion is bad,” the late justice said in a 2012 interview, “regardless of how you come out on that, my only point is the Constitution does not say anything about it.” Scalia denied that he wanted to enact his own anti-abortion views, and insisted that the courts should simply stay out of this space. “The main danger in judicial interpretation of the Constitution,” Scalia told a law school audience a couple of years after joining the Supreme Court, is “that the judges will mistake their own predilections for the law.” As the influential originalism scholar Keith Whittington wrote, the second wave originalism “was a reactive theory motivated by substantive disagreement with the recent and then-current actions of the Warren and Burger Courts.” It was developed as “a way of explaining what the Court had done wrong, and what it had done wrong in this context was primarily to strike down government actions in the name of individual rights.” Scalia represented a conservatism that was still getting its sea legs after the battering it took during the liberal Warren Court era. His originalism was rooted in an understanding that conservatives may not always control the Supreme Court, so judicial conservatives would do well to articulate lines that no judge, liberal or conservative, must ever cross. Gorusch carries none of this historical baggage. He graduated from Harvard Law School the same year that Justice Clarence Thomas replaced the civil rights icon Thurgood Marshall, entrenching conservative control of the judiciary in the process. Then, Gorsuch spent his entire professional career watching the Court grow more and more conservative. His own appointment is but the latest step in this rightward march. So, while Gorsuch almost certainly shares Scalia’s view of Roe v. Wade and many other decisions that affirmatively moved the law in a liberal direction, he lacks Scalia’s instinct for restraint (though, in fairness, Scalia himself sometimes departed from his own stated principles, especially near the end of his life). As Whittington explains, “if originalism in its modern form arose as a response to the perceived abuses of the Warren and Burger Courts, then the advent of the [conservative] Rehnquist Court made it largely irrelevant.” Third wave originalists such as Gorsuch are “less likely to emphasize a primary commitment to judicial restraint” and far more comfortable with an aggressive role for the judiciary. After all, why should they fear the courts when they own them? Prior to Gorsuch’s ascension to the Supreme Court, the nation’s preeminent third wave originalist was Justice Clarence Thomas. And Thomas is, in many ways, the anti-Hugo Black. Though both men often speak in the language of textualism and original history, Thomas embraces the same interpretation of the Constitution that pre-New Deal justices used to strike down child labor laws. His views are incompatible with the Supreme Court’s decision upholding the national ban on whites-only lunch counters. He wants to dismantle the entire system of executive branch regulation that, among other things, makes it possible for the United States to have any meaningful kind of environmental law. Gorsuch’s record is much thinner than Thomas’ — unlike Thomas, Gorsuch has not spent the last quarter century on the Supreme Court. Yet Gorsuch’s record does indicate that, on matters where Scalia and Thomas disagreed, Gorsuch’s views are much closer to Thomas’ than Scalia’s. Scalia, for example, explicitly rejected Thomas’ wholesale assault on federal agencies such as the Environmental Protection Agency. Gorsuch, by contrast, explicitly embraces many of Thomas’ views on agency regulation, and he wrote at least one opinion suggesting that he might share Thomas’ anti-regulatory views in their entirety. Whether Gorsuch proves as radical as Thomas —it’s unclear where Gorsuch stands on child labor — remains to be seen. But Gorsuch is very clearly a creature of the third wave of originalism. He now sits on the most powerful Court in the nation, and he is chomping at the bit to exercise that power. Originalism! What is it good for? One of the primary arguments in favor of originalism is that it seems to provide some certainty about what the law is. The original understanding of a constitutional provision appears to be a fixed star. Once that provision is committed to writing, its original meaning does not change over time. And yet, as the history recounted above suggests, originalism has done little to achieve such certainty. Nor has it, as Scalia hoped it would, mitigated the possibility that judges will “mistake their own predilections for the law.” Both Black and Thomas embraced a kind of originalism, and yet the two men reached strikingly opposite conclusions about what the Constitution requires — conclusions, it is worth noting, that largely align with their policy preferences. Nor is originalism particular useful for the single most important task facing judges — the task of deciding difficult cases. In his 1988 lecture laying out his philosophy of originalism, Scalia begins with a tale of Chief Justice William Howard Taft who, authored a great originalist opinion “which declared unconstitutional congressional attempts to restrict presidential removal of executive officers.” The Court first heard oral arguments in Myers v. United States, in December of 1923. As Scalia explains, “it was set for reargument and heard again the next Term, almost a year-and-a-half later, on April 13th and 14th, 1925.” Then, Taft’s “seventy page opinion for the Court, as well as a one-page dissent by Justice Holmes, a sixty-one page dissent by Justice McReynolds, and a fifty-five page dissent by Justice Brandeis, did not issue until more than a year-and-a-half after this second argument, on October 25, 1926.” That’s nearly three years from first argument to a final decision. Three years in which neither the president nor the Congress knew the scope of its own authority. And, if anything, three years is a extraordinarily brief period for a panel of lawyers untrained in historical research to conduct such an inquiry. Consider District of Columbia v. Heller, the landmark Second Amendment decision which originalist scholar Lawrence Solum describes as the “high-water mark” of Scalia’s efforts to bring originalist methods to the Court. In Heller, the Court’s five conservative justices examined the text and original history of the Second Amendment and determined that this amendment protects an individual right to bear arms — a result that aligns with conservative political preferences. Meanwhile, the Court’s four liberal members conducted a similarly originalist inquiry and determined that “neither the text of the Amendment nor the arguments advanced by its proponents evidenced the slightest interest in limiting any legislature’s authority to regulate private civilian uses of firearms.” In an incredible coincidence, that also happens to be the outcome favored by most liberals. Nor did this 5–4 decision happen overnight. Not so long ago, the idea that the Second Amendment does not protect an individual right to bear arms was so widely accepted that Chief Justice Warren Burger, a Nixon appointee, labeled any suggestion to the contrary “a fraud on the American public.” This idea began to change, albeit slowly, after a lawyer named Don Kates published a law review article in 1983 entitled “Handgun Prohibition and the Original Meaning of the Second Amendment.” But it took 25 years of work by scholars and advocates, many of them funded generously by the National Rifle Association, to bring the gun lobby’s view of the Second Amendment into the legal mainstream. And even then, this effort was only able to convince the five justices who were most inclined to side with conservatives in the first place. There will nearly always be evidence on both sides of a difficult question about the original meaning of the Constitution. My point isn’t that one side or the other was correct in Heller. It is simply that historical research is hard. It takes a very long time — and a great deal of resources — to do it well. And there will nearly always be evidence on both sides of a difficult question about the original meaning of the Constitution. This slow pace also raises difficult questions about what should happen if historians and originalist scholars actually do manage to prove that a long-accepted reading of the Constitution is not consistent with the document’s original meaning. Suppose, for example, that historical documents emerged tomorrow which demonstrate that Constitution was originally understood to render the entire federal highway system unconstitutional. Does that mean that these roads need to be torn up? And, if so, what happens if the documents are later discredited (something like this actually did happen in the debate over the Second Amendment)? People rely on existing legal doctrines. Businesses make investments assuming that the state of the law today will closely resemble the state of the law tomorrow. Governments pass laws. Entire legal regimes governing civil rights, environmental policy, union rights, and, yes, child labor, develop on the assumption that they will not all be cast aside tomorrow because someone shows Neil Gorsuch a law review article claiming that 80 years of precedent are wrongly decided. If you care about stability in the law, you cannot believe that fundamental assumptions of our law should be cast aside simply because some clever advocates claim that three generations of judges were bad at history. Which brings me to my ultimate point. Originalism isn’t about adding stability to the law. It isn’t about attaching legal doctrines to a fixed star in the sky. And it certainly isn’t about divorcing judges from politics. One thing that Justices Black, Scalia, Thomas and Gorsuch all have in common is that they have (or had) profound disagreements with longstanding precedent. The thing that sets them apart is how much they want to change the law, not how much they hope to stabilize it. Beware: Clarence Thomas Is One Of America’s Top Legal Mindsthinkprogress.org The judiciary is an institution built on precedent. Hugo Black could not simply show up for his first day or work and decree that dozens of pre-New Deal precedents would henceforth be ignored — any more than Neil Gorsuch can show up and simply declare that abortions must stop because he does not like them. Conversely, when a judge cites precedent, they legitimize their own decision by “grounding it in preexisting legal doctrines that they themselves may have played little or no role in shaping.” Precedent is one of the most important legal mechanisms that keeps judges from substituting their own preferences for the law. But precedent also is not the only source of legitimacy in the law. As I have argued in the past, “the genius of Black’s appeal to constitutional text and the original purposes of the framers, is that it allowed him to root his own decisions in something even more authoritative than the precedents he despised.” Originalism allowed Black to say that it wasn’t just his desire to bury decisions striking down child labor laws, it was also the Constitution’s desire. And originalism will also allow Gorsuch to make the same claim about laws protecting workers and the environment. The brilliance of originalism is that it enables judges to claim the mantle of an unchanging Constitution, even as they rely on sources that are no less malleable that the arguments deployed by so-called “living constitutionalists.” Conservatives can claim that the Constitution has always protected an individual right to bear arms. Liberals can claim that the Constitution has always said the opposite. And whoever controls a majority on the Supreme Court can wield this awesome power to undermine precedents they simply do not like. And now this awesome power rests in the hands of Neil Gorsuch. ", "title": "Gorsuch will make liberals miss Scalia", "sentences": [{"0037": "Gorsuch will make liberals miss Scalia"}, {"0f9e": "Scalia, unlike Gorsuch, came from a humbler era for judicial conservatives."}, {"452e": "CREDIT: AP Photo/Lana Harris"}, {"8ce1": "Originalism is having a moment."}, {"a3f1": "Although it’s been used to refer to slightly different ideas at various points in the recent past, “originalism” generally refers to the idea that the only proper way to interpret the U.S. Constitution is to examine what its words meant at the time they were ratified."}, {"8bc5": "The late Justice Antonin Scalia was originalism’s most famous evangelist. Neil Gorsuch, the man Donald Trump named to replace Scalia, is also an avowed originalist."}, {"b385": "Indeed, Gorsuch presents himself as something of a Scalia fanboy. In a 2016 lecture, Gorsuch spoke about how he “couldn’t see the rest of the way down the mountain for the tears” after he learned of Scalia’s death while skiing. During a White House ceremony on Monday where Gorsuch took the oath of office, he said that he “will never forget that the seat I inherit today is that of a very, very great man.” (He meant Scalia, not Merrick Garland.)"}, {"5226": "The worst case scenario if Trump’s Supreme Court nominee is confirmedA child-exploiting, racist, security state hellscape.thinkprogress.org"}, {"676d": "Yet for all of Gorsuch’s performative worship of Justice Scalia, Goruch’s record suggests that he takes a very different approach to the law than his judicial predecessor. Although Scalia and Gorsuch both identify as originalists, they came of age during very different times in the evolution of American law."}, {"5ee6": "There have been three great waves of originalist thinking in the last century. The first, led by Justice Hugo Black, was a liberal wave that washed away decisions imposing a libertarian economic model on the workplace while also invigorating the Bill of Rights. The second, led by Scalia, was a conservative wave seeking to wash away decisions such as Roe v. Wade, which Scalia and his allies viewed as too aggressively activist."}, {"e2ba": "Gorsuch belongs to a third wave, which is both far more at peace with judicial power than Scalia and far more skeptical of democracy."}, {"6e0b": "Scalia, at least for most of his time on the bench, envisioned originalism as a force of judicial restraint. Gorsuch, by contrast, is far more likely to wield it to sweep away liberal reforms and to siphon power away from the two elected branches of government."}, {"ae9e": "He will make Scalia look like a moderate."}, {"8fc6": "The three waves of originalism"}, {"ef87": "Senator Hugo Black accepted President Franklin Roosevelt’s appointment to the Supreme Court at a turning point in American constitutional history. In the decades before 1937, when Black took his seat on the Court, the Supreme Court largely divorced its decisions from the Constitution’s text — denuding provisions like the First Amendment of any real meaning, all while striking down child labor laws and other protections for workers."}, {"b16e": "Black joined the Court just months after the Supreme Court reversed course on at least some of these decisions. The Court abandoned a line of cases that struck down the minimum wage and laws protecting labor unions on a highly dubious constitutional theory. And it upheld Social Security and other key prongs of the New Deal."}, {"9c8a": "Roosevelt hoped that Black, his first Supreme Court appointment, would get the Court out of the way of progress. And FDR was not disappointed."}, {"7c4e": "It’s unclear where Gorsuch stands on child labor."}, {"c768": "“That’s why I came on the Court,” the justice said in 1967. “I was against using due process to force the views of judges on the country” — a reference to the Constitution’s Due Process Clause, which early twentieth century conservative justices interpreted to strike down the minimum wage and similar laws — “I still am. I wouldn’t trust judges with that kind of power and the Founders did not trust them either.”"}, {"1f2c": "Black, however, was not solely a proponent of judicial restraint — indeed, he was quite far from it. Justice Black probably did more to expand the role of the Bill of Rights than any other jurist in American history."}, {"a761": "Before Black became a justice, most of the Bill of Rights was understood to apply only to the federal government — states could violate them without risking a federal court order. Black made it his mission to ensure that these amendments would bind state and federal officials alike, and he largely succeeded in this project."}, {"2ebc": "Justice Black, moreover, announced this project in an opinion laying out his originalist approach to the Constitution. “I would follow what I believe was the original purpose of the Fourteenth Amendment,” he wrote. “To hold that this Court can determine what, if any, provisions of the Bill of Rights will be enforced, and if so to what degree, is to frustrate the great design of a written Constitution.”"}, {"50df": "Nearly 40 years later, Justice Scalia joined the Court. Like Black, Scalia was profoundly frustrated with state of American legal precedents. Unlike Black, however, Scalia’s frustrations were directed more at decisions protecting women’s reproductive choice, among other things, than at decisions placing extra-constitutional limits on workplace regulation."}, {"d56b": "In Praise Of Scaliathinkprogress.org"}, {"98b8": "Yet even as Scalia railed against liberal decisions he viewed as wholly illegitimate, there was a profound thread of judicial restraint woven through his rhetoric. “Whether you think prohibiting abortion is good or whether you think prohibiting abortion is bad,” the late justice said in a 2012 interview, “regardless of how you come out on that, my only point is the Constitution does not say anything about it.” Scalia denied that he wanted to enact his own anti-abortion views, and insisted that the courts should simply stay out of this space."}, {"96ff": "“The main danger in judicial interpretation of the Constitution,” Scalia told a law school audience a couple of years after joining the Supreme Court, is “that the judges will mistake their own predilections for the law.”"}, {"d346": "As the influential originalism scholar Keith Whittington wrote, the second wave originalism “was a reactive theory motivated by substantive disagreement with the recent and then-current actions of the Warren and Burger Courts.” It was developed as “a way of explaining what the Court had done wrong, and what it had done wrong in this context was primarily to strike down government actions in the name of individual rights.”"}, {"c881": "Scalia represented a conservatism that was still getting its sea legs after the battering it took during the liberal Warren Court era. His originalism was rooted in an understanding that conservatives may not always control the Supreme Court, so judicial conservatives would do well to articulate lines that no judge, liberal or conservative, must ever cross."}, {"9a58": "Gorusch carries none of this historical baggage. He graduated from Harvard Law School the same year that Justice Clarence Thomas replaced the civil rights icon Thurgood Marshall, entrenching conservative control of the judiciary in the process. Then, Gorsuch spent his entire professional career watching the Court grow more and more conservative. His own appointment is but the latest step in this rightward march."}, {"d498": "So, while Gorsuch almost certainly shares Scalia’s view of Roe v. Wade and many other decisions that affirmatively moved the law in a liberal direction, he lacks Scalia’s instinct for restraint (though, in fairness, Scalia himself sometimes departed from his own stated principles, especially near the end of his life)."}, {"7b6f": "As Whittington explains, “if originalism in its modern form arose as a response to the perceived abuses of the Warren and Burger Courts, then the advent of the [conservative] Rehnquist Court made it largely irrelevant.” Third wave originalists such as Gorsuch are “less likely to emphasize a primary commitment to judicial restraint” and far more comfortable with an aggressive role for the judiciary."}, {"c2eb": "After all, why should they fear the courts when they own them?"}, {"6c38": "Prior to Gorsuch’s ascension to the Supreme Court, the nation’s preeminent third wave originalist was Justice Clarence Thomas. And Thomas is, in many ways, the anti-Hugo Black. Though both men often speak in the language of textualism and original history, Thomas embraces the same interpretation of the Constitution that pre-New Deal justices used to strike down child labor laws. His views are incompatible with the Supreme Court’s decision upholding the national ban on whites-only lunch counters. He wants to dismantle the entire system of executive branch regulation that, among other things, makes it possible for the United States to have any meaningful kind of environmental law."}, {"255c": "Gorsuch’s record is much thinner than Thomas’ — unlike Thomas, Gorsuch has not spent the last quarter century on the Supreme Court. Yet Gorsuch’s record does indicate that, on matters where Scalia and Thomas disagreed, Gorsuch’s views are much closer to Thomas’ than Scalia’s."}, {"cba0": "Scalia, for example, explicitly rejected Thomas’ wholesale assault on federal agencies such as the Environmental Protection Agency. Gorsuch, by contrast, explicitly embraces many of Thomas’ views on agency regulation, and he wrote at least one opinion suggesting that he might share Thomas’ anti-regulatory views in their entirety."}, {"033f": "Whether Gorsuch proves as radical as Thomas —it’s unclear where Gorsuch stands on child labor — remains to be seen. But Gorsuch is very clearly a creature of the third wave of originalism. He now sits on the most powerful Court in the nation, and he is chomping at the bit to exercise that power."}, {"fc5e": "Originalism! What is it good for?"}, {"85a6": "One of the primary arguments in favor of originalism is that it seems to provide some certainty about what the law is. The original understanding of a constitutional provision appears to be a fixed star. Once that provision is committed to writing, its original meaning does not change over time."}, {"f44b": "And yet, as the history recounted above suggests, originalism has done little to achieve such certainty. Nor has it, as Scalia hoped it would, mitigated the possibility that judges will “mistake their own predilections for the law.” Both Black and Thomas embraced a kind of originalism, and yet the two men reached strikingly opposite conclusions about what the Constitution requires — conclusions, it is worth noting, that largely align with their policy preferences."}, {"4aab": "Nor is originalism particular useful for the single most important task facing judges — the task of deciding difficult cases. In his 1988 lecture laying out his philosophy of originalism, Scalia begins with a tale of Chief Justice William Howard Taft who, authored a great originalist opinion “which declared unconstitutional congressional attempts to restrict presidential removal of executive officers.”"}, {"be3b": "The Court first heard oral arguments in Myers v. United States, in December of 1923. As Scalia explains, “it was set for reargument and heard again the next Term, almost a year-and-a-half later, on April 13th and 14th, 1925.” Then, Taft’s “seventy page opinion for the Court, as well as a one-page dissent by Justice Holmes, a sixty-one page dissent by Justice McReynolds, and a fifty-five page dissent by Justice Brandeis, did not issue until more than a year-and-a-half after this second argument, on October 25, 1926.”"}, {"ce77": "That’s nearly three years from first argument to a final decision. Three years in which neither the president nor the Congress knew the scope of its own authority."}, {"400b": "And, if anything, three years is a extraordinarily brief period for a panel of lawyers untrained in historical research to conduct such an inquiry."}, {"7ef6": "Consider District of Columbia v. Heller, the landmark Second Amendment decision which originalist scholar Lawrence Solum describes as the “high-water mark” of Scalia’s efforts to bring originalist methods to the Court."}, {"59f3": "In Heller, the Court’s five conservative justices examined the text and original history of the Second Amendment and determined that this amendment protects an individual right to bear arms — a result that aligns with conservative political preferences."}, {"d14c": "Meanwhile, the Court’s four liberal members conducted a similarly originalist inquiry and determined that “neither the text of the Amendment nor the arguments advanced by its proponents evidenced the slightest interest in limiting any legislature’s authority to regulate private civilian uses of firearms.” In an incredible coincidence, that also happens to be the outcome favored by most liberals."}, {"f856": "Nor did this 5–4 decision happen overnight. Not so long ago, the idea that the Second Amendment does not protect an individual right to bear arms was so widely accepted that Chief Justice Warren Burger, a Nixon appointee, labeled any suggestion to the contrary “a fraud on the American public.”"}, {"8378": "This idea began to change, albeit slowly, after a lawyer named Don Kates published a law review article in 1983 entitled “Handgun Prohibition and the Original Meaning of the Second Amendment.” But it took 25 years of work by scholars and advocates, many of them funded generously by the National Rifle Association, to bring the gun lobby’s view of the Second Amendment into the legal mainstream. And even then, this effort was only able to convince the five justices who were most inclined to side with conservatives in the first place."}, {"ae08": "There will nearly always be evidence on both sides of a difficult question about the original meaning of the Constitution."}, {"456c": "My point isn’t that one side or the other was correct in Heller. It is simply that historical research is hard. It takes a very long time — and a great deal of resources — to do it well. And there will nearly always be evidence on both sides of a difficult question about the original meaning of the Constitution."}, {"baaf": "This slow pace also raises difficult questions about what should happen if historians and originalist scholars actually do manage to prove that a long-accepted reading of the Constitution is not consistent with the document’s original meaning."}, {"6aef": "Suppose, for example, that historical documents emerged tomorrow which demonstrate that Constitution was originally understood to render the entire federal highway system unconstitutional. Does that mean that these roads need to be torn up? And, if so, what happens if the documents are later discredited (something like this actually did happen in the debate over the Second Amendment)?"}, {"0240": "People rely on existing legal doctrines. Businesses make investments assuming that the state of the law today will closely resemble the state of the law tomorrow. Governments pass laws. Entire legal regimes governing civil rights, environmental policy, union rights, and, yes, child labor, develop on the assumption that they will not all be cast aside tomorrow because someone shows Neil Gorsuch a law review article claiming that 80 years of precedent are wrongly decided."}, {"4b92": "If you care about stability in the law, you cannot believe that fundamental assumptions of our law should be cast aside simply because some clever advocates claim that three generations of judges were bad at history."}, {"2611": "Which brings me to my ultimate point. Originalism isn’t about adding stability to the law. It isn’t about attaching legal doctrines to a fixed star in the sky. And it certainly isn’t about divorcing judges from politics."}, {"a822": "One thing that Justices Black, Scalia, Thomas and Gorsuch all have in common is that they have (or had) profound disagreements with longstanding precedent. The thing that sets them apart is how much they want to change the law, not how much they hope to stabilize it."}, {"94e1": "Beware: Clarence Thomas Is One Of America’s Top Legal Mindsthinkprogress.org"}, {"13d3": "The judiciary is an institution built on precedent. Hugo Black could not simply show up for his first day or work and decree that dozens of pre-New Deal precedents would henceforth be ignored — any more than Neil Gorsuch can show up and simply declare that abortions must stop because he does not like them."}, {"e967": "Conversely, when a judge cites precedent, they legitimize their own decision by “grounding it in preexisting legal doctrines that they themselves may have played little or no role in shaping.” Precedent is one of the most important legal mechanisms that keeps judges from substituting their own preferences for the law."}, {"0f85": "But precedent also is not the only source of legitimacy in the law. As I have argued in the past, “the genius of Black’s appeal to constitutional text and the original purposes of the framers, is that it allowed him to root his own decisions in something even more authoritative than the precedents he despised.” Originalism allowed Black to say that it wasn’t just his desire to bury decisions striking down child labor laws, it was also the Constitution’s desire."}, {"7c0e": "And originalism will also allow Gorsuch to make the same claim about laws protecting workers and the environment."}, {"df0d": "The brilliance of originalism is that it enables judges to claim the mantle of an unchanging Constitution, even as they rely on sources that are no less malleable that the arguments deployed by so-called “living constitutionalists.” Conservatives can claim that the Constitution has always protected an individual right to bear arms. Liberals can claim that the Constitution has always said the opposite. And whoever controls a majority on the Supreme Court can wield this awesome power to undermine precedents they simply do not like."}, {"6c61": "And now this awesome power rests in the hands of Neil Gorsuch."}], "child": "1555_1\t1555_2\t1555_3\t1555_4\t1555_5\t1555_6\t1555_7"}