{"name": "1556", "parent": "", "content": "A simple plan to end the Supreme Court confirmation wars for good This can’t go on. CREDIT: AP Photo/Pablo Martinez Monsivais “There’s no such thing as a Republican judge or a Democratic judge,” Donald Trump’s Supreme Court nominee claimed at his confirmation hearing. It’s unclear whether Neil Gorsuch actually believes such a thing, but it’s hard to think anyone else who was in that hearing room would agree with that statement. After all, if partisan politics were truly irrelevant to the Supreme Court, Justice Merrick Garland would be sitting in his chambers at One First Street and Gorsuch would still be an obscure judge in Colorado. There’s a reason why Senate Republicans held a Supreme Court vacancy open for more than a year until a Republican president could fill it. After Senate Majority Leader Mitch McConnell’s (R-KY) decision to prevent a president of the opposite party from nominating anyone to the Supreme Court, it’s doubtful that any justice will ever be confirmed again when the presidency is controlled by a different party than the Senate. That means America will lurch back and forth between extended periods with a understaffed Supreme Court, followed by massive shifts in the law as one party fills a backlog of vacancies. The Way America Picks Judges Is Stupid And Needs To Changethinkprogress.org This new normal raises a cloud of illegitimacy over Justice Gorsuch, as it will over every justice confirmed in our new hyperpartisan world. The Supreme Court has never been an apolitical entity, but its legitimacy has always depended on an illusion that it was above politics. Federal judges are not elected — they cannot claim a mandate that flows from the will of the people. And, as Alexander Hamilton explained, they have “no influence over either the sword or the purse; no direction either of the strength or of the wealth of the society; and can take no active resolution whatever.” We obey judges because we have collectively decided that the judiciary has moral credibility. But that credibility suffered a terrible blow this past year. Why should anyone obey a political charged order from an unelected body when that body’s members are determined by a game of partisan hardball? So America has a choice. It can let this equilibrium continue, and find out what happens as its judiciary slowly loses its sheen as a branch independent from politics. Or it can find a way to divorce the judicial selection process from partisanship. Fortunately, for those of us who prefer the later option, several states have shown that there is a better way. The Missouri plan As America struggled through the Great Depression, Missouri’s courts were a den of partisanship and corruption. As former Chief Justice of Missouri Michael Wolff explains, judges were “selected in elections in which nominees were chosen by political parties under a patronage system.” In much of the state, judges were selected by a single machine party leader, “Boss” Tom Pendergast. Throughout Missouri, “judges were plagued by outside political influences, and dockets were congested due to the time the judges spent making political appearances and campaigning.” Frustrated with their politicized judiciary, the people of Missouri passed a ballot initiative replacing the state’s corrupt process with a non-partisan coalition — at least for the state’s top judges. When a vacancy arises on the state’s supreme court, a seven person commission consisting of “three lawyers elected by the lawyers of The Missouri Bar . . . three citizens selected by the governor, and the chief justice” submits three candidates to fill that vacancy to the state’s governor. The governor then has 60 days to choose among those three names. If the governor fails to meet this deadline, the commission selects one of the three. Finally, after a year of service, the newly appointed judge must survive a retention election, where a majority of the electorate can cast them out of office — though this only happens rarely. This method of judicial selection, as well as variants upon it, was adopted by many states since its inception in Missouri. 9 terrible things Neil Gorsuch could do in his first full term on the Supreme CourtThere’s a reason Republicans sold their soul to Donald Trump in order to get this guy on the Court.thinkprogress.org It’s not a perfect system. In Iowa, which uses variant on the Missouri system, three justices were removed from office after anti-LGBT groups campaigned against them due to their votes in support of marriage equality. In Arizona, which uses a Missouri-style commission but with significantly more gubernatorial appointees, a libertarian attorney with aggressive plans to roll back laws protecting workers recently joined the state supreme court. Judicial selection commissions neither eliminate politics entirely nor shield a state entirely from ideologues. But they are a whole lot better than the world we live in now at the federal level, where no president is ever likely to appoint a justice again unless that justice shares the ideological preferences of a majority of the Senate. The one thing Barack Obama and Sarah Palin agreed on Consider Judge Morgan Christen. Christen is a judge on the United States Court of Appeals for the Ninth Circuit, a job she holds after being appointed by President Barack Obama. Prior to taking on her current role, she was appointed to the Alaska Supreme Court by Gov. Sarah Palin. “I have every confidence that Judge Christen has the experience, intellect, wisdom and character to be an outstanding Supreme Court justice,” Palin said at the time. This rare moment of consensus between Obama and Palin was made possible because Alaska uses a Missouri-style commission. While a commission cannot remove politics entirely from the judicial selection process — it is likely that if presidents got to appoint a minority of the commissions’ seats, as they do in Missouri, they will fill those seats with ideological allies — it can diminish the role that politics play in the judicial selection process and, in its best moments, elevate judges that the most bitter political foes can agree upon. Admittedly, it would also take a constitutional amendment to implement the Missouri plan at the federal level, so this kind of reform is unlikely to happen anytime soon. Given how difficult it is to amend the Constitution, such an amendment will also require a near-universal consensus among America’s various political factions. But it’s worth considering. While conservatives are riding high today, knowing that they’ve snatched control of the Supreme Court — and, with it, the Constitution — they may be less than joyous if Democrats regain control of the Senate during a Republican administration and dish out the very same treatment that McConnell dealt Chief Judge Garland. Republicans now control a diminished judiciary that is only likely to become weaker as the judicial selection wars wage on. At some point, an amendment may become the only rational choice for everyone. ", "title": "A simple plan to end the Supreme Court confirmation wars for good", "sentences": [{"e814": "A simple plan to end the Supreme Court confirmation wars for good"}, {"a9f1": "This can’t go on."}, {"9d05": "CREDIT: AP Photo/Pablo Martinez Monsivais"}, {"95b2": "“There’s no such thing as a Republican judge or a Democratic judge,” Donald Trump’s Supreme Court nominee claimed at his confirmation hearing."}, {"a71e": "It’s unclear whether Neil Gorsuch actually believes such a thing, but it’s hard to think anyone else who was in that hearing room would agree with that statement."}, {"8a22": "After all, if partisan politics were truly irrelevant to the Supreme Court, Justice Merrick Garland would be sitting in his chambers at One First Street and Gorsuch would still be an obscure judge in Colorado. There’s a reason why Senate Republicans held a Supreme Court vacancy open for more than a year until a Republican president could fill it."}, {"bf78": "After Senate Majority Leader Mitch McConnell’s (R-KY) decision to prevent a president of the opposite party from nominating anyone to the Supreme Court, it’s doubtful that any justice will ever be confirmed again when the presidency is controlled by a different party than the Senate. That means America will lurch back and forth between extended periods with a understaffed Supreme Court, followed by massive shifts in the law as one party fills a backlog of vacancies."}, {"36e0": "The Way America Picks Judges Is Stupid And Needs To Changethinkprogress.org"}, {"b8c4": "This new normal raises a cloud of illegitimacy over Justice Gorsuch, as it will over every justice confirmed in our new hyperpartisan world. The Supreme Court has never been an apolitical entity, but its legitimacy has always depended on an illusion that it was above politics. Federal judges are not elected — they cannot claim a mandate that flows from the will of the people. And, as Alexander Hamilton explained, they have “no influence over either the sword or the purse; no direction either of the strength or of the wealth of the society; and can take no active resolution whatever.”"}, {"bcbd": "We obey judges because we have collectively decided that the judiciary has moral credibility. But that credibility suffered a terrible blow this past year. Why should anyone obey a political charged order from an unelected body when that body’s members are determined by a game of partisan hardball?"}, {"3cea": "So America has a choice. It can let this equilibrium continue, and find out what happens as its judiciary slowly loses its sheen as a branch independent from politics. Or it can find a way to divorce the judicial selection process from partisanship."}, {"8300": "Fortunately, for those of us who prefer the later option, several states have shown that there is a better way."}, {"f405": "The Missouri plan"}, {"89c3": "As America struggled through the Great Depression, Missouri’s courts were a den of partisanship and corruption. As former Chief Justice of Missouri Michael Wolff explains, judges were “selected in elections in which nominees were chosen by political parties under a patronage system.” In much of the state, judges were selected by a single machine party leader, “Boss” Tom Pendergast. Throughout Missouri, “judges were plagued by outside political influences, and dockets were congested due to the time the judges spent making political appearances and campaigning.”"}, {"668f": "Frustrated with their politicized judiciary, the people of Missouri passed a ballot initiative replacing the state’s corrupt process with a non-partisan coalition — at least for the state’s top judges."}, {"c45b": "When a vacancy arises on the state’s supreme court, a seven person commission consisting of “three lawyers elected by the lawyers of The Missouri Bar . . . three citizens selected by the governor, and the chief justice” submits three candidates to fill that vacancy to the state’s governor. The governor then has 60 days to choose among those three names. If the governor fails to meet this deadline, the commission selects one of the three."}, {"cb2d": "Finally, after a year of service, the newly appointed judge must survive a retention election, where a majority of the electorate can cast them out of office — though this only happens rarely."}, {"3f27": "This method of judicial selection, as well as variants upon it, was adopted by many states since its inception in Missouri."}, {"2250": "9 terrible things Neil Gorsuch could do in his first full term on the Supreme CourtThere’s a reason Republicans sold their soul to Donald Trump in order to get this guy on the Court.thinkprogress.org"}, {"4491": "It’s not a perfect system. In Iowa, which uses variant on the Missouri system, three justices were removed from office after anti-LGBT groups campaigned against them due to their votes in support of marriage equality. In Arizona, which uses a Missouri-style commission but with significantly more gubernatorial appointees, a libertarian attorney with aggressive plans to roll back laws protecting workers recently joined the state supreme court. Judicial selection commissions neither eliminate politics entirely nor shield a state entirely from ideologues."}, {"6a36": "But they are a whole lot better than the world we live in now at the federal level, where no president is ever likely to appoint a justice again unless that justice shares the ideological preferences of a majority of the Senate."}, {"47e7": "The one thing Barack Obama and Sarah Palin agreed on"}, {"a8ee": "Consider Judge Morgan Christen."}, {"b223": "Christen is a judge on the United States Court of Appeals for the Ninth Circuit, a job she holds after being appointed by President Barack Obama. Prior to taking on her current role, she was appointed to the Alaska Supreme Court by Gov. Sarah Palin. “I have every confidence that Judge Christen has the experience, intellect, wisdom and character to be an outstanding Supreme Court justice,” Palin said at the time."}, {"48e9": "This rare moment of consensus between Obama and Palin was made possible because Alaska uses a Missouri-style commission."}, {"f89d": "While a commission cannot remove politics entirely from the judicial selection process — it is likely that if presidents got to appoint a minority of the commissions’ seats, as they do in Missouri, they will fill those seats with ideological allies — it can diminish the role that politics play in the judicial selection process and, in its best moments, elevate judges that the most bitter political foes can agree upon."}, {"e533": "Admittedly, it would also take a constitutional amendment to implement the Missouri plan at the federal level, so this kind of reform is unlikely to happen anytime soon. Given how difficult it is to amend the Constitution, such an amendment will also require a near-universal consensus among America’s various political factions."}, {"093f": "But it’s worth considering. While conservatives are riding high today, knowing that they’ve snatched control of the Supreme Court — and, with it, the Constitution — they may be less than joyous if Democrats regain control of the Senate during a Republican administration and dish out the very same treatment that McConnell dealt Chief Judge Garland. Republicans now control a diminished judiciary that is only likely to become weaker as the judicial selection wars wage on."}, {"8e95": "At some point, an amendment may become the only rational choice for everyone."}], "child": "1556_1\t1556_2\t1556_3\t1556_4\t1556_5\t1556_6\t1556_7\t1556_8\t1556_9\t1556_10\t1556_11\t1556_12\t1556_13\t1556_14\t1556_15\t1556_16\t1556_17\t1556_18\t1556_19\t1556_20\t1556_21"}