{"name": "1557", "parent": "", "content": "WATCH: Trump’s judicial legacy will go much further than Neil Gorsuch He has over one hundred seats to fill across the U.S. Now that Neil Gorsuch has been officially confirmed, Trump has secured a conservative majority in the Supreme Court, fulfilling one of his campaign promises to nominate a conservative judge to replace Justice Scalia. But Trump has more than a hundred other federal judicial vacancies to fill across the United States, an unprecedented number that is the result of GOP obstructionism in the Senate in Obama’s last two years in office. Facing more judicial vacancies than any other president entering office, Trump has the opportunity to change the make-up of the nation’s federal courts for generations. Transcript: VICTORIA FLEISCHER, ThinkProgress: When Trump became President, he inherited 107 federal judicial vacancies, essentially twice the number Obama inherited. That’s in large part because in 2015, the Republican majority Senate began refusing to confirm any of Obama’s appointments. Remember Merrick Garland? Well, he’s only one of 52 judicial nominees during Obama’s presidency who never received a vote. All told, there are 874 federal judges in the United States, including the District Court, the Court of Appeals, and the Supreme Court. Trump’s nominations only need simple majority in the Senate to be confirmed. And with the vacancies alone, Trump can appoint about 14 percent of all federal judges for the lifetime appointments. Take into account the number of judges coming up for retirement, and Trump’s judges could make up to one half of the Appellate Court. TRUMP: Well, I’m going to appoint conservative judges, I’m gonna appoint people that have great reputations, that are great with the legal profession. STEPHANOPOULOS: Like? FLEISCHER: Trump hasn’t provided much intel on his potential appointments, but we do know a little. He promised on the campaign to appoint only pro-life conservatives to the Supreme Court, which was instrumental in securing the evangelical vote. And he’s pledged that his judges will “all be picked by the Federalist Society,” an influential group of conservative lawyers. Trump is looking to appoint judges who are young and have less experience, ensuring the president’s influence on the judicial branch for decades. And that influence will have the greatest effect at the Circuit Court level. While the Supreme Court only hears about 75 cases a year, the court of appeals decides tens of thousands. Which means that often, the lower courts have the final say on the rule of law, creating a far reaching sphere of influence over the daily lives of Americans. For example, both of Trump’s travel bans were deemed unconstitutional, the first by an appellate court judge and the second by district judges. And just last month, the District Court for the 5th Circuit ruled that Texas’s gerrymandering of their congressional districts was unconstitutional because it targeted minority voters. The judges Trump nominates are likely going to preside over contentious debates like gun control, voting rights, civil liberties and abortion, to name a few. So Trump’s appointments will likely establish a new conservative precedent across the United States. ", "title": "WATCH: Trump’s judicial legacy will go much further than Neil Gorsuch", "sentences": [{"dd52": "WATCH: Trump’s judicial legacy will go much further than Neil Gorsuch"}, {"cc7e": "He has over one hundred seats to fill across the U.S."}, {"b0f3": "Now that Neil Gorsuch has been officially confirmed, Trump has secured a conservative majority in the Supreme Court, fulfilling one of his campaign promises to nominate a conservative judge to replace Justice Scalia."}, {"78d7": "But Trump has more than a hundred other federal judicial vacancies to fill across the United States, an unprecedented number that is the result of GOP obstructionism in the Senate in Obama’s last two years in office. Facing more judicial vacancies than any other president entering office, Trump has the opportunity to change the make-up of the nation’s federal courts for generations."}, {"1ea7": "Transcript:"}, {"3b95": "VICTORIA FLEISCHER, ThinkProgress: When Trump became President, he inherited 107 federal judicial vacancies, essentially twice the number Obama inherited."}, {"eff4": "That’s in large part because in 2015, the Republican majority Senate began refusing to confirm any of Obama’s appointments."}, {"e4e5": "Remember Merrick Garland? Well, he’s only one of 52 judicial nominees during Obama’s presidency who never received a vote."}, {"bcd6": "All told, there are 874 federal judges in the United States, including the District Court, the Court of Appeals, and the Supreme Court."}, {"d9ab": "Trump’s nominations only need simple majority in the Senate to be confirmed. And with the vacancies alone, Trump can appoint about 14 percent of all federal judges for the lifetime appointments. Take into account the number of judges coming up for retirement, and Trump’s judges could make up to one half of the Appellate Court."}, {"ac41": "TRUMP: Well, I’m going to appoint conservative judges, I’m gonna appoint people that have great reputations, that are great with the legal profession."}, {"7dd5": "STEPHANOPOULOS: Like?"}, {"95dd": "FLEISCHER: Trump hasn’t provided much intel on his potential appointments, but we do know a little. He promised on the campaign to appoint only pro-life conservatives to the Supreme Court, which was instrumental in securing the evangelical vote. And he’s pledged that his judges will “all be picked by the Federalist Society,” an influential group of conservative lawyers."}, {"c0c6": "Trump is looking to appoint judges who are young and have less experience, ensuring the president’s influence on the judicial branch for decades."}, {"9e3b": "And that influence will have the greatest effect at the Circuit Court level. While the Supreme Court only hears about 75 cases a year, the court of appeals decides tens of thousands. Which means that often, the lower courts have the final say on the rule of law, creating a far reaching sphere of influence over the daily lives of Americans."}, {"de94": "For example, both of Trump’s travel bans were deemed unconstitutional, the first by an appellate court judge and the second by district judges. And just last month, the District Court for the 5th Circuit ruled that Texas’s gerrymandering of their congressional districts was unconstitutional because it targeted minority voters."}, {"b2f5": "The judges Trump nominates are likely going to preside over contentious debates like gun control, voting rights, civil liberties and abortion, to name a few. So Trump’s appointments will likely establish a new conservative precedent across the United States."}], "child": "1557_1\t1557_2"}