{"name": "1558", "parent": "", "content": "BREAKING: Republicans take control of the Supreme Court Well, it was nice having voting rights while it lasted. CREDIT: AP Photo/J. Scott Applewhite By a 54–45 vote, the Senate confirmed Judge Neil Gorsuch to the Supreme Court on Friday. The vote effectively returns control of the judicial branch — and with it, the U.S. Constitution — to Republicans. Once Gorsuch is sworn in, Republicans will enjoy a 5–4 majority on the Supreme Court. After the death of Justice Antonin Scalia last year, President Obama nominated Chief Judge Merrick Garland, a moderate veteran of the federal appellate bench, to fill the vacant seat. Senate Republicans, however, held the seat open for more than a year — refusing to even give Garland a hearing — in the hopes that Donald Trump would have the opportunity to fill it. Candidate Trump, meanwhile, admitted that he would delegate the selection of the nominee to fill this seat to conservative groups, such as the Heritage Foundation and the Federalist Society, if he was elected president. “We’re going to have great judges,” Trump told Breitbart radio at one point, “conservative, all picked by the Federalist Society.” Among other things, Gorsuch is likely to be the key fifth vote to uphold voter suppression laws that target groups, such as African Americans, who tend to prefer Democratic candidates to Republicans. Though Scalia’s death broke the majority that decided the Citizens United case and injected limitless corporate funds into elections, Gorsuch is also likely to be the key fifth vote in favor of decisions like Citizens United. Beyond these electoral issues, which obviously matter a great deal to Republican elected officials, Gorsuch is also an almost certain vote against Roe v. Wade. He sided with employers who want to deny birth control coverage to their employees. And he wrote an opinion that drastically weakened a federal law protecting children with disabilities. That last opinion was unanimously overruled by the Supreme Court. ", "title": "BREAKING: Republicans take control of the Supreme Court", "sentences": [{"4bb9": "BREAKING: Republicans take control of the Supreme Court"}, {"a115": "Well, it was nice having voting rights while it lasted."}, {"6ce3": "CREDIT: AP Photo/J. Scott Applewhite"}, {"f833": "By a 54–45 vote, the Senate confirmed Judge Neil Gorsuch to the Supreme Court on Friday."}, {"158d": "The vote effectively returns control of the judicial branch — and with it, the U.S. Constitution — to Republicans. Once Gorsuch is sworn in, Republicans will enjoy a 5–4 majority on the Supreme Court."}, {"494c": "After the death of Justice Antonin Scalia last year, President Obama nominated Chief Judge Merrick Garland, a moderate veteran of the federal appellate bench, to fill the vacant seat. Senate Republicans, however, held the seat open for more than a year — refusing to even give Garland a hearing — in the hopes that Donald Trump would have the opportunity to fill it."}, {"7d0f": "Candidate Trump, meanwhile, admitted that he would delegate the selection of the nominee to fill this seat to conservative groups, such as the Heritage Foundation and the Federalist Society, if he was elected president. “We’re going to have great judges,” Trump told Breitbart radio at one point, “conservative, all picked by the Federalist Society.”"}, {"607b": "Among other things, Gorsuch is likely to be the key fifth vote to uphold voter suppression laws that target groups, such as African Americans, who tend to prefer Democratic candidates to Republicans. Though Scalia’s death broke the majority that decided the Citizens United case and injected limitless corporate funds into elections, Gorsuch is also likely to be the key fifth vote in favor of decisions like Citizens United."}, {"8ea0": "Beyond these electoral issues, which obviously matter a great deal to Republican elected officials, Gorsuch is also an almost certain vote against Roe v. Wade. He sided with employers who want to deny birth control coverage to their employees. And he wrote an opinion that drastically weakened a federal law protecting children with disabilities. That last opinion was unanimously overruled by the Supreme Court."}], "child": "1558_1\t1558_2\t1558_3\t1558_4\t1558_5\t1558_6\t1558_7\t1558_8\t1558_9\t1558_10\t1558_11\t1558_12\t1558_13"}