{"name": "1559", "parent": "", "content": "9 terrible things Neil Gorsuch could do in his first full term on the Supreme Court There’s a reason Republicans sold their soul to Donald Trump in order to get this guy on the Court. CREDIT: AP Photo/Susan Walsh The following was adapted from an earlier piece on the future of the Supreme Court under Gorsuch. Well, it’s all done except for one final vote. Along party lines, the Senate voted Thursday to change its rules in order to clear the way for Judge Neil Gorsuch’s confirmation to the Supreme Court. Soon, Gorsuch will almost certainly occupy the Supreme Court seat that Senate Republicans held open for a year in the hopes that Donald Trump would fill it. Gorsuch’s record places him to the right of Justice Antonin Scalia, the conservative icon Gorsuch hopes to replace, and he may prove to be the Court’s most conservative member. One strong indication that will be the case: In the middle of his testimony, every single member of the Court that Gorsuch is poised to join ruled that a decision their new colleague wrote —a decision that significantly weakened a law protecting children with disabilities — was wrongly decided. And Gorsuch is likely to have a very significant impact on the law very quickly. Because the Court was down a justice for more than a year, the remaining justices largely avoided contentious issues that were likely to produce 4–4 splits. That’s created a backlog of cases involving issues — ranging from voting rights, to LGBT equality, to birth control, to the rights of workers — that are now likely to be taken up in a hurry. The right to vote Before Scalia’s death, the Roberts Court was not friendly toward voting rights. The Court permitted voter ID laws, a common method of voter suppression. It struck down a major prong of the Voting Rights Act. And it’s placed increasingly high procedural hurdles in front of litigants seeking to protect their right to vote. In one particularly notable case, a federal appeals court struck down North Carolina’s omnibus voter suppression law. As the appeals court explained, North Carolina lawmakers “requested data on the use, by race, of a number of voting practices,” then used this data to design a voter suppression law that disproportionately targeted African Americans and that minimized its impact on white voters. BREAKING: Federal Appeals Court Strikes Down The Worst Voter Suppression Law In The NationLet’s summarize a federal appeals court’s decision striking down much of North Carolina’s omnibus voter suppression law…thinkprogress.org And yet, when this case reached the Supreme Court, all four of the Court’s conservatives voted to reinstate the North Carolina law. If Scalia were still alive, the law would have been in effect during the 2016 election. Assuming that none of these four conservatives have second thoughts, Gorsuch will almost certainly provide a fifth vote they need to uphold laws similar to North Carolina’s — even, apparently, when the law was enacted for the very purpose of preventing black people from voting. Gerrymandering Even if Democrats sweep back into the White House in 2020, Republicans have a significant advantage in U.S. House races thanks to congressional districts that overwhelmingly favor the GOP. Last November, however, a federal court struck down Wisconsin’s state assembly maps as an unconstitutional partisan gerrymander. The plaintiffs in that case, moreover, have devised a mathematical formula that will allow courts to sort out gerrymandered maps — potentially requiring states across the country to draw fairer congressional maps. The Supreme Court is likely to hear this case, Whitford v. Gill, as soon as its next term. Before the election, when most Democrats believed that either President Obama or the woman who received nearly 3 million more votes than Trump would get to fill the vacant seat on the Supreme Court, the plaintiffs in Whitford looked very likely to prevail. With Gorsuch on the Court, victory for these plaintiffs appears much more doubtful. It is not, however, impossible. Though conservative Justice Anthony Kennedy has been skeptical of gerrymandering suits in the past, he did write in a 2004 opinion that a gerrymandering case should be allowed to proceed if “workable standards” emerge “for measuring the burden a gerrymander imposes on representational rights.” Whitford, with its mathematical formula, offers such a standard — and thus a shot at winning a fifth vote. Working while gay Earlier this week, a federal appeals court held in a lopsided 8–3 vote, that the federal ban on “sex” discrimination prohibits discrimination on the basis of sexual orientation. Among other things, the appeals court explained in Hively v. Ivy Tech Community College, discrimination against gay or bisexual employees is a form of illegal gender stereotyping. A lesbian woman “represents the ultimate case of failure to conform to the female stereotype,” because they enter into sexual relationships with women instead of men. Other appeals courts disagree with this outcome, which means that it is almost certain to be heard by the Supreme Court. One of the Court’s primary roles is to resolve “circuit splits” where one federal appeals court reaches a different outcome than another. As is often the case in gay rights cases, Hively is likely to turn on Justice Anthony Kennedy’s vote. Though a conservative, Kennedy authored a series of cases recognizing that the Constitution protects against may forms of sexual orientation discrimination, including the Court’s landmark marriage equality decision. Gorsuch, meanwhile, has a record of reading civil rights legislation narrowly — including in the case where he read a law protecting disabled children so narrowly that every single member of the Supreme Court disagreed with him. Unions Last year, the Supreme Court heard Friedrichs v. California Teachers Association, a case seeking to defund many public sector unions. By law, these unions are required to bargain on behalf of union members and non-members alike, so if a worker within a bargaining unit decides not to join the union, they still get all the same wages and benefits they would if they did pay union dues. To prevent free-riders, who would enjoy nearly all of the benefits of being in a union without having to contribute to the union’s costs, unions often charge “agency” or “fair share” fees to non-members to recoup each non-member’s share of the costs of bargaining. Public Sector Unions Just Got Brutalized In The Supreme CourtWASHINGTON, DC — Let’s not beat around the bush. Friedrichs asked the Supreme Court to make these fair share fees illegal, at least when they are charged by public sector unions. The result would be that many individual workers would have an incentive to stop paying into their union, until the union was so starved for funds that it was no longer able to bargain effectively or conduct other union business. Without Scalia, the Court split 4–4 in Friedrichs. But Gorsuch is likely to be the fifth vote against unions. Birth control On the final day of the Supreme Court’s last term, Justice Samuel Alito was angry. A Washington state regulation requires pharmacies to “deliver lawfully prescribed drugs or devices to patients.” The owners of one pharmacy refused to comply with this regulation, because they object to certain forms of contraception on religious grounds and did not want to dispense it. If this case arose under federal law, the pharmacy would have a much stronger case. Those cases are controlled by the Religious Freedom Restoration Act (RFRA), which, at least after Hobby Lobby, offers religious objectors protections above and beyond the protections afforded by the Constitution. Justice Alito’s Bizarre And Offensive Attack On Atheists“This case is an ominous sign,” Justice Samuel Alito begins one of the final opinions released on this last day of the…thinkprogress.org State laws that burden religion, however, are valid so long as they do not single out people of faith for inferior treatment. As Justice Scalia wrote in Employment Division v. Smith, the Constitution “does not relieve an individual of the obligation to comply with a valid and neutral law of general applicability on the ground that the law proscribes (or prescribes) conduct that his religion prescribes (or proscribes).” Alito wanted his Court to hear Stormans v. Wiesman, the case brought by the pharmacy owners. He claimed that the Washington state regulation “specifically targeted religious objections,” noting a state guidance document which explains that the regulation “does not allow a pharmacy to refer a patient to another pharmacy to avoid filling the prescription due to moral or ethical objections.” Of course a “moral or ethical” objection is a different thing than a “religious” objection. So, if the state’s guidance can be used to tar Washington with accusations of religious discrimination, it is likely that many other states will become vulnerable to such accusations. The practical impact of a Supreme Court decision in favor of the plaintiffs in Stormans could be to impose the Hobby Lobby regime on all state laws, and not just federal law. It takes four votes for the Supreme Court to hear a case. With Scalia dead, Alito mustered only two of his colleagues in support of his bid to take up Stormans. Gorsuch is likely to be the fourth vote to take up a similar case. Freedom from discrimination A closely related question to the issue in Stormans is whether religion can be wielded as a sword to cut down anti-discrimination laws. Not too long ago, the idea that religious objections could justify discrimination was considered ludicrous. In 1968, a racist business owner claimed that the ban on whites-only lunch counters “contravenes the will of God,” and that he should be allowed to ignore it. A unanimous Supreme Court rejected this claim, labeling it “patently frivolous.” Times have changed, however, and the last few years have seen a rush of pizza-joint owners, cake bakers, photographers, and other anti-LGBT business owners who claim that their religion gives them a right to ignore anti-discrimination laws. The Hobby Lobby decision will no doubt embolden these religious objectors (as would a potential decision applying Hobby Lobby to state laws). Though Hobby Lobby indicates that religious objections cannot be used to evade “prohibitions on racial discrimination,” it conspicuously does not rule out the use of religious objections to enable discrimination against women, LGBT people or other groups. Trans rights Earlier this year, the Supreme Court intended to hear Gloucester County School Board v. G.G., which concerns the right of trans students to use a bathroom that corresponds with their gender identity. The justices wound up kicking the case back down to the lower courts, however, after the Trump administration rescinded an Obama-era policy guidance that was at the heart of the case. Although, a federal appeals court sided with Gavin Grimm, the trans student challenging a Virginia school board’s policy preventing him from using the men’s room at school, the lower court opinion relied primarily on the Obama administration’s pro-trans interpretation of a federal education regulation. Now that the Trump administration walked away from this interpretation, it was appropriate for the Supreme Court to send the case back down so that the lower court consider the remaining issues in the case. Supreme Court tosses transgender student’s case back to lower courtAnd it’s Trump’s fault.thinkprogress.org The issue of anti-trans discrimination is not going away, however, and it is likely that either this case or a related case will make it up to the justices again soon. Although Grimm won in the appeals court, he did not benefit from this ruling because the Supreme Court stayed it — in a decision joined by all four conservatives plus Justice Stephen Breyer (although Breyer wrote that he joined the conservatives solely as a “courtesy”). That suggests Kennedy and possibly even Breyer are uncertain votes in favor of trans rights. Gorsuch is very unlikely to side with trans students in a similar position to Grimm, which means that those students will almost certainly need to win Kennedy and Breyer in order to prevail. The workplace The Roberts Court has not been good to workers’ rights. Even setting aside Hobby Lobby and the coming attacks on public sector unions, the Court shrunk protections for victims of sexual harassment and for people who face retaliation because they reported discrimination. The very first bill President Barack Obama signed into law was in response to a Supreme Court decision that made it harder for women to bring suits when they experience pay discrimination. Gorsuch is likely to continue this pattern if he is appointed to the Supreme Court. One case where his influence is likely to be felt right away is Ernst & Young LLP v. Morris, which concerns whether an employee can be forced to sign away their right to bring a class action suit against their employer as a condition of employment. The Court recently scheduled arguments in this case for its next term. Trump’s Muslim ban Finally, it is likely that President Trump’s attempt to bar many Muslims from entering the United States will eventually reach the Supreme Court. Although many lower courts have not been kind to this ban, it is worth noting that the Roberts Court routinely stakes out positions that are well to the right of the median lower-court judge — especially in cases involving politically charged issues such as Obamacare and birth control. Though it is unlikely that any of the four left-leaning justices will side with Trump’s ban, if the four conservatives back the ban and Gorsuch is confirmed, he will be the tie-breaking vote. Gorsuch’s record, moreover, suggests that he may share the views of the Court’s most conservative member, Justice Clarence Thomas. ", "title": "9 terrible things Neil Gorsuch could do in his first full term on the Supreme Court", "sentences": [{"3f8f": "9 terrible things Neil Gorsuch could do in his first full term on the Supreme Court"}, {"ab41": "There’s a reason Republicans sold their soul to Donald Trump in order to get this guy on the Court."}, {"897e": "CREDIT: AP Photo/Susan Walsh"}, {"181f": "The following was adapted from an earlier piece on the future of the Supreme Court under Gorsuch."}, {"734c": "Well, it’s all done except for one final vote. Along party lines, the Senate voted Thursday to change its rules in order to clear the way for Judge Neil Gorsuch’s confirmation to the Supreme Court. Soon, Gorsuch will almost certainly occupy the Supreme Court seat that Senate Republicans held open for a year in the hopes that Donald Trump would fill it."}, {"3324": "Gorsuch’s record places him to the right of Justice Antonin Scalia, the conservative icon Gorsuch hopes to replace, and he may prove to be the Court’s most conservative member. One strong indication that will be the case: In the middle of his testimony, every single member of the Court that Gorsuch is poised to join ruled that a decision their new colleague wrote —a decision that significantly weakened a law protecting children with disabilities — was wrongly decided."}, {"c8fb": "And Gorsuch is likely to have a very significant impact on the law very quickly. Because the Court was down a justice for more than a year, the remaining justices largely avoided contentious issues that were likely to produce 4–4 splits. That’s created a backlog of cases involving issues — ranging from voting rights, to LGBT equality, to birth control, to the rights of workers — that are now likely to be taken up in a hurry."}, {"c3f3": "The right to vote"}, {"ab5f": "Before Scalia’s death, the Roberts Court was not friendly toward voting rights. The Court permitted voter ID laws, a common method of voter suppression. It struck down a major prong of the Voting Rights Act. And it’s placed increasingly high procedural hurdles in front of litigants seeking to protect their right to vote."}, {"2fbc": "In one particularly notable case, a federal appeals court struck down North Carolina’s omnibus voter suppression law. As the appeals court explained, North Carolina lawmakers “requested data on the use, by race, of a number of voting practices,” then used this data to design a voter suppression law that disproportionately targeted African Americans and that minimized its impact on white voters."}, {"0c3d": "BREAKING: Federal Appeals Court Strikes Down The Worst Voter Suppression Law In The NationLet’s summarize a federal appeals court’s decision striking down much of North Carolina’s omnibus voter suppression law…thinkprogress.org"}, {"992f": "And yet, when this case reached the Supreme Court, all four of the Court’s conservatives voted to reinstate the North Carolina law. If Scalia were still alive, the law would have been in effect during the 2016 election."}, {"61e7": "Assuming that none of these four conservatives have second thoughts, Gorsuch will almost certainly provide a fifth vote they need to uphold laws similar to North Carolina’s — even, apparently, when the law was enacted for the very purpose of preventing black people from voting."}, {"194f": "Gerrymandering"}, {"8efd": "Even if Democrats sweep back into the White House in 2020, Republicans have a significant advantage in U.S. House races thanks to congressional districts that overwhelmingly favor the GOP."}, {"95a6": "Last November, however, a federal court struck down Wisconsin’s state assembly maps as an unconstitutional partisan gerrymander. The plaintiffs in that case, moreover, have devised a mathematical formula that will allow courts to sort out gerrymandered maps — potentially requiring states across the country to draw fairer congressional maps."}, {"87ae": "The Supreme Court is likely to hear this case, Whitford v. Gill, as soon as its next term. Before the election, when most Democrats believed that either President Obama or the woman who received nearly 3 million more votes than Trump would get to fill the vacant seat on the Supreme Court, the plaintiffs in Whitford looked very likely to prevail. With Gorsuch on the Court, victory for these plaintiffs appears much more doubtful."}, {"43d5": "It is not, however, impossible. Though conservative Justice Anthony Kennedy has been skeptical of gerrymandering suits in the past, he did write in a 2004 opinion that a gerrymandering case should be allowed to proceed if “workable standards” emerge “for measuring the burden a gerrymander imposes on representational rights.” Whitford, with its mathematical formula, offers such a standard — and thus a shot at winning a fifth vote."}, {"8367": "Working while gay"}, {"a602": "Earlier this week, a federal appeals court held in a lopsided 8–3 vote, that the federal ban on “sex” discrimination prohibits discrimination on the basis of sexual orientation."}, {"df99": "Among other things, the appeals court explained in Hively v. Ivy Tech Community College, discrimination against gay or bisexual employees is a form of illegal gender stereotyping. A lesbian woman “represents the ultimate case of failure to conform to the female stereotype,” because they enter into sexual relationships with women instead of men."}, {"0281": "Other appeals courts disagree with this outcome, which means that it is almost certain to be heard by the Supreme Court. One of the Court’s primary roles is to resolve “circuit splits” where one federal appeals court reaches a different outcome than another."}, {"120f": "As is often the case in gay rights cases, Hively is likely to turn on Justice Anthony Kennedy’s vote. Though a conservative, Kennedy authored a series of cases recognizing that the Constitution protects against may forms of sexual orientation discrimination, including the Court’s landmark marriage equality decision."}, {"4a45": "Gorsuch, meanwhile, has a record of reading civil rights legislation narrowly — including in the case where he read a law protecting disabled children so narrowly that every single member of the Supreme Court disagreed with him."}, {"a211": "Unions"}, {"edf1": "Last year, the Supreme Court heard Friedrichs v. California Teachers Association, a case seeking to defund many public sector unions. By law, these unions are required to bargain on behalf of union members and non-members alike, so if a worker within a bargaining unit decides not to join the union, they still get all the same wages and benefits they would if they did pay union dues. To prevent free-riders, who would enjoy nearly all of the benefits of being in a union without having to contribute to the union’s costs, unions often charge “agency” or “fair share” fees to non-members to recoup each non-member’s share of the costs of bargaining."}, {"673c": "Public Sector Unions Just Got Brutalized In The Supreme CourtWASHINGTON, DC — Let’s not beat around the bush."}, {"7209": "Friedrichs asked the Supreme Court to make these fair share fees illegal, at least when they are charged by public sector unions. The result would be that many individual workers would have an incentive to stop paying into their union, until the union was so starved for funds that it was no longer able to bargain effectively or conduct other union business."}, {"ab6a": "Without Scalia, the Court split 4–4 in Friedrichs. But Gorsuch is likely to be the fifth vote against unions."}, {"6836": "Birth control"}, {"5478": "On the final day of the Supreme Court’s last term, Justice Samuel Alito was angry."}, {"ad68": "A Washington state regulation requires pharmacies to “deliver lawfully prescribed drugs or devices to patients.” The owners of one pharmacy refused to comply with this regulation, because they object to certain forms of contraception on religious grounds and did not want to dispense it."}, {"475f": "If this case arose under federal law, the pharmacy would have a much stronger case. Those cases are controlled by the Religious Freedom Restoration Act (RFRA), which, at least after Hobby Lobby, offers religious objectors protections above and beyond the protections afforded by the Constitution."}, {"d936": "Justice Alito’s Bizarre And Offensive Attack On Atheists“This case is an ominous sign,” Justice Samuel Alito begins one of the final opinions released on this last day of the…thinkprogress.org"}, {"71f4": "State laws that burden religion, however, are valid so long as they do not single out people of faith for inferior treatment. As Justice Scalia wrote in Employment Division v. Smith, the Constitution “does not relieve an individual of the obligation to comply with a valid and neutral law of general applicability on the ground that the law proscribes (or prescribes) conduct that his religion prescribes (or proscribes).”"}, {"e6b7": "Alito wanted his Court to hear Stormans v. Wiesman, the case brought by the pharmacy owners. He claimed that the Washington state regulation “specifically targeted religious objections,” noting a state guidance document which explains that the regulation “does not allow a pharmacy to refer a patient to another pharmacy to avoid filling the prescription due to moral or ethical objections.”"}, {"daec": "Of course a “moral or ethical” objection is a different thing than a “religious” objection. So, if the state’s guidance can be used to tar Washington with accusations of religious discrimination, it is likely that many other states will become vulnerable to such accusations. The practical impact of a Supreme Court decision in favor of the plaintiffs in Stormans could be to impose the Hobby Lobby regime on all state laws, and not just federal law."}, {"b834": "It takes four votes for the Supreme Court to hear a case. With Scalia dead, Alito mustered only two of his colleagues in support of his bid to take up Stormans. Gorsuch is likely to be the fourth vote to take up a similar case."}, {"bfd3": "Freedom from discrimination"}, {"9325": "A closely related question to the issue in Stormans is whether religion can be wielded as a sword to cut down anti-discrimination laws."}, {"32f5": "Not too long ago, the idea that religious objections could justify discrimination was considered ludicrous. In 1968, a racist business owner claimed that the ban on whites-only lunch counters “contravenes the will of God,” and that he should be allowed to ignore it. A unanimous Supreme Court rejected this claim, labeling it “patently frivolous.”"}, {"751e": "Times have changed, however, and the last few years have seen a rush of pizza-joint owners, cake bakers, photographers, and other anti-LGBT business owners who claim that their religion gives them a right to ignore anti-discrimination laws."}, {"f5b4": "The Hobby Lobby decision will no doubt embolden these religious objectors (as would a potential decision applying Hobby Lobby to state laws). Though Hobby Lobby indicates that religious objections cannot be used to evade “prohibitions on racial discrimination,” it conspicuously does not rule out the use of religious objections to enable discrimination against women, LGBT people or other groups."}, {"8350": "Trans rights"}, {"3033": "Earlier this year, the Supreme Court intended to hear Gloucester County School Board v. G.G., which concerns the right of trans students to use a bathroom that corresponds with their gender identity. The justices wound up kicking the case back down to the lower courts, however, after the Trump administration rescinded an Obama-era policy guidance that was at the heart of the case."}, {"9fc8": "Although, a federal appeals court sided with Gavin Grimm, the trans student challenging a Virginia school board’s policy preventing him from using the men’s room at school, the lower court opinion relied primarily on the Obama administration’s pro-trans interpretation of a federal education regulation. Now that the Trump administration walked away from this interpretation, it was appropriate for the Supreme Court to send the case back down so that the lower court consider the remaining issues in the case."}, {"7007": "Supreme Court tosses transgender student’s case back to lower courtAnd it’s Trump’s fault.thinkprogress.org"}, {"e91d": "The issue of anti-trans discrimination is not going away, however, and it is likely that either this case or a related case will make it up to the justices again soon."}, {"4ddb": "Although Grimm won in the appeals court, he did not benefit from this ruling because the Supreme Court stayed it — in a decision joined by all four conservatives plus Justice Stephen Breyer (although Breyer wrote that he joined the conservatives solely as a “courtesy”). That suggests Kennedy and possibly even Breyer are uncertain votes in favor of trans rights."}, {"a50a": "Gorsuch is very unlikely to side with trans students in a similar position to Grimm, which means that those students will almost certainly need to win Kennedy and Breyer in order to prevail."}, {"1e47": "The workplace"}, {"dd08": "The Roberts Court has not been good to workers’ rights. Even setting aside Hobby Lobby and the coming attacks on public sector unions, the Court shrunk protections for victims of sexual harassment and for people who face retaliation because they reported discrimination. The very first bill President Barack Obama signed into law was in response to a Supreme Court decision that made it harder for women to bring suits when they experience pay discrimination."}, {"1480": "Gorsuch is likely to continue this pattern if he is appointed to the Supreme Court. One case where his influence is likely to be felt right away is Ernst & Young LLP v. Morris, which concerns whether an employee can be forced to sign away their right to bring a class action suit against their employer as a condition of employment."}, {"6641": "The Court recently scheduled arguments in this case for its next term."}, {"e14d": "Trump’s Muslim ban"}, {"ff0f": "Finally, it is likely that President Trump’s attempt to bar many Muslims from entering the United States will eventually reach the Supreme Court. Although many lower courts have not been kind to this ban, it is worth noting that the Roberts Court routinely stakes out positions that are well to the right of the median lower-court judge — especially in cases involving politically charged issues such as Obamacare and birth control."}, {"ed61": "Though it is unlikely that any of the four left-leaning justices will side with Trump’s ban, if the four conservatives back the ban and Gorsuch is confirmed, he will be the tie-breaking vote. Gorsuch’s record, moreover, suggests that he may share the views of the Court’s most conservative member, Justice Clarence Thomas."}], "child": "1559_1\t1559_2\t1559_3\t1559_4\t1559_5\t1559_6\t1559_7\t1559_8\t1559_9\t1559_10\t1559_11\t1559_12\t1559_13\t1559_14\t1559_15\t1559_16\t1559_17\t1559_18\t1559_19\t1559_20\t1559_21\t1559_22\t1559_23"}