{"name": "1560", "parent": "", "content": "BREAKING: Republicans nuke Senate, clearing the way for Gorsuch confirmation It’s official. Late Thursday morning, Senate Democrats opposed to Judge Neil Gorsuch’s nomination to the Supreme Court successfully filibustered his confirmation vote. That victory proved short-lived, however, after Senate Republicans invoked a little-used procedure to change the Senate’s rules. Under the rules that existed prior to Thursday, Supreme Court nominees needed 60 votes in order to overcome a filibuster. Under the rules change enacted today, such nominees may now be confirmed with a simple majority (other nominees could already be confirmed by a majority vote under a rules change pushed by Senate Democrats in 2013). Because Senate rules regarding the timing of votes after a filibuster remain in place, the final vote to confirm Gorsuch is likely to come on Friday. Although the 44 senators who supported the filibuster are a minority in the Senate, they represent well over half of the nation. This is because the Senate is a malapportioned body where exactly two senators represent both California and Wyoming, even though California has 67 times as many people as Wyoming. The GOP had a much different opinion of the ‘nuclear option’ just 4 years agoNow they stand poised to confirm Donald Trump’s Supreme Court nominee using a procedure they said was an illegitimate…thinkprogress.org Gorsuch was nominated by President Donald Trump, who lost the popular vote to Democratic candidate Hillary Clinton by 2,864,974 votes. The Supreme Court nominee’s record indicates that he is more conservative than Justice Antonin Scalia, the conservative icon he hopes to replace. Among other things, Gorsuch is likely to be the fifth vote to uphold voter suppression laws that disproportionately target African Americans and other groups that tend to prefer Democrats to Republicans. Indeed, there is some indication that Gorsuch may be the most conservative member of the Supreme Court in the now very likely event that he is confirmed. In the middle of his confirmation hearing, the Supreme Court handed down a unanimous decision rejecting Gorsuch’s attempt to weaken a law protecting disabled children. The legal standard Gorsuch created in 2008, Chief Justice John Roberts wrote for a unanimous Court, would restrict many disabled children’s access to an education to such a degree that these children “can hardly be said to have been offered an education at all.” ", "title": "BREAKING: Republicans nuke Senate, clearing the way for Gorsuch confirmation", "sentences": [{"822a": "BREAKING: Republicans nuke Senate, clearing the way for Gorsuch confirmation"}, {"e119": "It’s official."}, {"ce7e": "Late Thursday morning, Senate Democrats opposed to Judge Neil Gorsuch’s nomination to the Supreme Court successfully filibustered his confirmation vote. That victory proved short-lived, however, after Senate Republicans invoked a little-used procedure to change the Senate’s rules."}, {"4c13": "Under the rules that existed prior to Thursday, Supreme Court nominees needed 60 votes in order to overcome a filibuster. Under the rules change enacted today, such nominees may now be confirmed with a simple majority (other nominees could already be confirmed by a majority vote under a rules change pushed by Senate Democrats in 2013). Because Senate rules regarding the timing of votes after a filibuster remain in place, the final vote to confirm Gorsuch is likely to come on Friday."}, {"83fa": "Although the 44 senators who supported the filibuster are a minority in the Senate, they represent well over half of the nation. This is because the Senate is a malapportioned body where exactly two senators represent both California and Wyoming, even though California has 67 times as many people as Wyoming."}, {"48f4": "The GOP had a much different opinion of the ‘nuclear option’ just 4 years agoNow they stand poised to confirm Donald Trump’s Supreme Court nominee using a procedure they said was an illegitimate…thinkprogress.org"}, {"9259": "Gorsuch was nominated by President Donald Trump, who lost the popular vote to Democratic candidate Hillary Clinton by 2,864,974 votes. The Supreme Court nominee’s record indicates that he is more conservative than Justice Antonin Scalia, the conservative icon he hopes to replace. Among other things, Gorsuch is likely to be the fifth vote to uphold voter suppression laws that disproportionately target African Americans and other groups that tend to prefer Democrats to Republicans."}, {"6ab0": "Indeed, there is some indication that Gorsuch may be the most conservative member of the Supreme Court in the now very likely event that he is confirmed. In the middle of his confirmation hearing, the Supreme Court handed down a unanimous decision rejecting Gorsuch’s attempt to weaken a law protecting disabled children."}, {"b584": "The legal standard Gorsuch created in 2008, Chief Justice John Roberts wrote for a unanimous Court, would restrict many disabled children’s access to an education to such a degree that these children “can hardly be said to have been offered an education at all.”"}], "child": "1560_1\t1560_2\t1560_3\t1560_4\t1560_5\t1560_6\t1560_7\t1560_8\t1560_9\t1560_10\t1560_11\t1560_12\t1560_13\t1560_14\t1560_15\t1560_16\t1560_17\t1560_18\t1560_19\t1560_20\t1560_21\t1560_22\t1560_23\t1560_24"}