{"name": "1561", "parent": "", "content": "The United States Senate is a failed institution It’s a malapportioned, anti-democratic embarrassment. CREDIT: AP Photo/J. Scott Applewhite Let’s briefly take stock of what’s about to happen in the U.S. Senate. A president who lost the popular vote by 2,864,974 nominated Neil Gorsuch to serve a lifetime appointment on the nation’s highest Court. Although a bloc of senators representing at least 53 percent of the country oppose this nominee, Gorsuch is all but certain to be confirmed — after a bit of a showdown over the Senate’s rules. Gorsuch’s confirmation will come more than a year after President Obama — a president who won the popular vote, twice — nominated Merrick Garland to the same vacant seat on the Supreme Court. At the time, Democratic senators represented over 53 percent of the nation. Yet Garland was not confirmed because, in the bizarre kind of math that exists in the U.S. Senate, 53 percent support only earned the Democratic caucus 46 percent of the Senate’s seats. The Constitution of the United States has failedThis is not fine.thinkprogress.org This is hardly an unusual event in the Senate’s history. The Senate is the product of a compromise that, while it made sense at the time, rested on assumptions that haven’t been true for more than a century. It was an early bulwark for southern slaveholders and a firewall protecting Jim Crow. One of its most defining traits, the filibuster, was invented accidentally by the villain in a popular Broadway musical. The Senate is a relic, wrapped in a mistake, wrapped in a toxic dose of sanctimony. Sen. Joe Manchin (D-WV) is one of the few Democrats who will not vote to filibuster Gorsuch’s nomination. He explained to reporters that he doesn’t want to goad Senate Republicans into eliminating filibusters of Supreme Court nominees, which they are expected to do after Gorsuch is filibustered. “People who have been here for a long time know that we’re going down the wrong path here,” Manchin claimed. “The most unique political body in the world, the United States Senate, will be no more than a six-year term in the House.” Manchin may be right that the Senate is the world’s most unique political body, but it is unique in the same way that Guy’s American Kitchen & Bar is a unique restaurant, or that Nickelback is a unique band. The Senate is the Showgirls of legislative chambers, the Miller Clear Beer of lawmaking bodies. It’s past time someone put it to sleep. How we got into this mess “We hold these truths to be self-evident,” Thomas Jefferson famously wrote in the document that set 13 British colonies on the path to independence, “that all men are created equal.” Eleven years later, several of the same men who signed this Declaration of Independence joined the delegates to America’s constitutional convention — where they promptly cast aside any pretense that the United States is dedicated to the notion that all people are equal. The Founding Fathers betrayed the Declaration’s promise with a Constitution that explicitly protected the institution of slavery. But they also betrayed it with the Senate, which treats residents of small states as more worthy of representation than residents of larger states. In fairness, there’s a good explanation for why delegates from larger states were willing to trade away their right to equal representation in the national legislature. The Articles of Confederation, which proceeded the Constitution, was less a charter for a single nation and more akin to NATO, or perhaps the European Union. As Yale law professor Akhil Amar explains, the Articles were “an alliance, a multilateral treaty of sovereign nation-states.” Under the Articles, Congress could neither tax individuals directly, raise troops, or provide for an army — a matter of great annoyance to General George Washington. The 13 former colonies largely functioned as their own independent nations. The Senate is a relic, wrapped in a mistake, wrapped in a toxic dose of sanctimony. Yet, while the United States’ first experiment in unity was more treaty than Union, early American leaders were both well-versed in European history and fearful of the warfare than inevitably results when rival nations share geographic borders. The Constitution was thus an effort to solve two problems at once: to bind the 13 states together in a manner that would keep them from warring with each other, but also to ensure that this Union had real authority over its citizens. Understood in this context, the Great Compromise that led to the Senate makes sense. Large states like Pennsylvania and New York feared war with their neighboring states more than they feared being outvoted in the Senate. Small states had a stronger claim to equal representation when they were conceived of as independent nations and not simply a collection of individual citizens. And, in any event, the malapportioned Senate would be less dysfunctional that the loose collection of separate nations joined together under the Articles of Confederation. Yet, whatever the logic of this compromise in 1787, a lot has changed since then. The United States has a coherent national identity. Rhode Island has little to fear from the conquering armies of nearby Massachusetts. Utah is not going to fight a war with Colorado. And yet the Senate persists, treating each resident of Wyoming as 67 times more worthy than each resident of California, despite the fact that the circumstances that birthed the Senate no longer exist. The slaveholder’s house Not long after the Constitution was ratified, slaveholders discovered that they had a problem — most of the nation lived in free states. By the early 1820s, free states controlled 105 of the 187 seats in the House of Representatives — and that’s after you account for the fact that the Three-Fifths Compromise permitted slave states to count 60 percent of their enslaved and disenfranchised population when it came time to allocate seats in the House. If the House were the only game in town, in other words, it could conceivably have banned the slave trade — or at least taken fairly aggressive steps to hobble the South’s “peculiar institution.” The South’s fears came to a head in 1819, when an obscure New York congressman introduced amendments to legislation admitting Missouri as a state, which would have banned any expansion of slavery within Missouri and required that all new children born into slavery be freed at age 25. Among other things, if Missouri were admitted into the Union on these terms, free states would have gained a majority in the Senate. The response, as Princeton historian Sean Wilentz writes, was “blistering.” Southern lawmakers “virtually threatened secession were the amendments approved.” Northerners united behind the amendments in the House, pushing them across the finish line to passage. Nevertheless, the amendments were ultimately defeated in the Senate, after five northern senators crossed over to vote with a unified South. Missouri was eventually admitted to the Union as a slave state, under the terms enacted through the so-called Missouri Compromise. The Senate, however, truly came into its own as a savior for Southern racists in the century following the Civil War. In 1875, Reconstruction was on its last legs. Democrats, then the party most sympathetic to Southern whites, recently regained control of the House of Representatives. When Mississippi Democrats staged a violent uprising to seize control of their state, President Grant did not send troops to intervene. Within just two years, Republican Rutherford B. Hayes would sell out African Americans in the South in order to secure his own election — trading the end of Reconstruction for the presidency. Yet, even as white supremacists tightened their grip on the old Confederacy, Congress, several senators elected under Reconstruction governments had not yet completed their terms. As racist mobs marched through the state, Mississippi still had two Republican senators in 1875 — one of whom, Sen. Blanche Bruce, was a black man. 1875 was thus the last year until midway through the next century that Congress enacted a civil rights law of any kind. The Civil Rights Act of 1875 prohibited racial discrimination by “inns, public conveyances on land or water, theaters, and other places of public amusement,” though this provision was soon struck down by the Supreme Court. The reason why no new civil rights bill emerged from Congress until 1957 was the Senate. Though five such bills cleared the House in the 12 years following World War II alone, Senate malapportionment gave the southern senators far more influence over the legislative process than their states’ population could justify. That, combined with another peculiarity of the Senate, was enough to halt civil rights in its tracks. Talk less, smile more This is an impolitic time for a liberal news site to discuss the history of the filibuster. A bloc of Democrats comprising a majority of the nation but a minority of the seats in the Senate hope to keep a very conservative judge off the Supreme Court through a filibuster. Republican leaders hope to block this maneuver by eliminating filibusters of Supreme Court nominees. Having endured under the filibuster for so many years, the United States would undoubtedly be better off if the filibuster survives just a little bit longer until the Gorsuch nomination is defeated. Yet, while the senators hoping to filibuster Gorsuch represent a majority of the nation, this state of affairs is fairly unusual. The filibuster played a major role in Southern senators’ efforts to halt civil rights legislation. It played a similar role in a Republican minority’s efforts to shut down the only agency that can enforce much of federal labor law in 2013, and it was the centerpiece of Republican efforts to sabotage the Consumer Financial Protection Bureau before it was even operational. The last time the Senate erupted into a nuclear showdown over the filibuster, a Republican minority tried to prevent President Obama from confirming anyone to a powerful appeals court in Washington, DC. Far more often than not, in other words, the filibuster thwarts democracy rather than reinforcing it. It cheated African Americans out of their full status as citizens. It threatened to dismantle entire agencies, despite the fact that Congress passed no law permitting this to happen. If the filibuster rules do change this week, Democrats should lament the rise of Neil Gorsuch, but they should not weep to see one of the most anti-democratic aspects of the Senate suffer another cut. The filibuster’s very existence is an historic accident arising from one of Aaron Burr’s final acts as vice president. As Brookings political scientist Sarah Binder recounts the history, the lame duck vice president returned to the Senate in 1805, fresh off his indictment for killing Alexander Hamilton. There, as the Senate’s presiding officer, he told the senators that their rule book was too complicated and had too many duplicative procedures. One process in particular, the “previous question motion,” Burr deemed especially worthy of removal. And the Senate believed him. They eliminated this motion the next year. It turned out, however, that the previous question motion was not superfluous, it was a motion that enabled senators to cut off debate on a subject when a minority wanted to keep that debate going. Thus, by eliminating the motion, Burr effectively enabled dissenters to delay a vote indefinitely by forcing the Senate to “debate” it until the majority gave up. No one actually attempted this until 1837, when “a minority block of Whig senators prolonged debate to prevent Andrew Jackson’s allies from expunging a resolution of censure against him.” But filibusters grew increasingly common over most of the following century and in 1917, the Senate amended its rules to permit a two-thirds supermajority to end debate. This threshold was eventually lowered to 60 senators, and later to 51 senators for confirmation votes not involving Supreme Court nominees. In any event, one of the Senate’s most distinctive features, the filibuster, is not part of some grand vision of minority rights handed down from up on high to the Founding Fathers. It is an accident, created by a lame duck vice president and a body of senators who did not understand what they were doing. Can it be fixed? In its inception, the Senate had two anti-democratic features. It is malapportioned, and its members were originally selected by state legislatures, not by the voters themselves. As explained above, it soon developed a third major anti-democratic feature, the filibuster. The good news, for those of us who believe that the right to govern should flow from the will of the people, is that the Senate has gotten better over time. The Seventeenth Amendment provides for direct election of senators. The filibuster is part-way through a process that is likely to end in its demise. Nevertheless, curing the Senate’s greatest sin against democracy — the fact that it treats a person from California as 1/67th of a person from Wyoming — will be a much heavier lift. Although the Constitution provides two processes for amendments, these processes come with two caveats. No amendment could be made prior to 1808 curtailing the slave trade, and “no state, without its consent, shall be deprived of its equal suffrage in the Senate.” Theoretically, there are ways around this problem. The United States could ratify two amendments to the Constitution — one permitting amendments to the Senate’s makeup and another actually changing that makeup or abolishing the Senate. Or, alternatively, a single amendment could leave the Senate in place as a malapportioned body, but reduce its authority so that it becomes an advisory body similar to the British House of Lords. The problem with these solutions, however, is that any amendment requires the consent of three-fourths of the states, and it is unlikely that the states that benefit from malappointment will vote to reduce their own power. So that leaves one last option, a constitutional revolution. And there is one very significant precedent for such radical change. Under the Articles of Confederation, amendments were only permitted with the unanimous consent of the states. Nevertheless, a new Constitution was drafted in Philadelphia which, by its own terms, became effective upon “the ratification of the conventions of nine states.” The Constitution of the United States is, in this sense, unconstitutional. We the People could once again invoke a similar process to create a more democratic union — one that is not only free of Senate malapportionment, but also free of other anti-democratic aspects of our present system such as partisan gerrymandering and the Electoral College. I have no illusions that this will happen any time soon, but it is likely the only way that the United States can become a truly democratic republic — one where everyone’s vote counts equally, regardless of where they live. ", "title": "The United States Senate is a failed institution", "sentences": [{"3b36": "The United States Senate is a failed institution"}, {"cf00": "It’s a malapportioned, anti-democratic embarrassment."}, {"4e76": "CREDIT: AP Photo/J. Scott Applewhite"}, {"62c5": "Let’s briefly take stock of what’s about to happen in the U.S. Senate."}, {"a6cd": "A president who lost the popular vote by 2,864,974 nominated Neil Gorsuch to serve a lifetime appointment on the nation’s highest Court. Although a bloc of senators representing at least 53 percent of the country oppose this nominee, Gorsuch is all but certain to be confirmed — after a bit of a showdown over the Senate’s rules."}, {"4976": "Gorsuch’s confirmation will come more than a year after President Obama — a president who won the popular vote, twice — nominated Merrick Garland to the same vacant seat on the Supreme Court. At the time, Democratic senators represented over 53 percent of the nation. Yet Garland was not confirmed because, in the bizarre kind of math that exists in the U.S. Senate, 53 percent support only earned the Democratic caucus 46 percent of the Senate’s seats."}, {"24cb": "The Constitution of the United States has failedThis is not fine.thinkprogress.org"}, {"ea24": "This is hardly an unusual event in the Senate’s history. The Senate is the product of a compromise that, while it made sense at the time, rested on assumptions that haven’t been true for more than a century. It was an early bulwark for southern slaveholders and a firewall protecting Jim Crow. One of its most defining traits, the filibuster, was invented accidentally by the villain in a popular Broadway musical."}, {"22e1": "The Senate is a relic, wrapped in a mistake, wrapped in a toxic dose of sanctimony."}, {"7fc2": "Sen. Joe Manchin (D-WV) is one of the few Democrats who will not vote to filibuster Gorsuch’s nomination. He explained to reporters that he doesn’t want to goad Senate Republicans into eliminating filibusters of Supreme Court nominees, which they are expected to do after Gorsuch is filibustered."}, {"3100": "“People who have been here for a long time know that we’re going down the wrong path here,” Manchin claimed. “The most unique political body in the world, the United States Senate, will be no more than a six-year term in the House.”"}, {"a9d7": "Manchin may be right that the Senate is the world’s most unique political body, but it is unique in the same way that Guy’s American Kitchen & Bar is a unique restaurant, or that Nickelback is a unique band. The Senate is the Showgirls of legislative chambers, the Miller Clear Beer of lawmaking bodies. It’s past time someone put it to sleep."}, {"8e72": "How we got into this mess"}, {"af44": "“We hold these truths to be self-evident,” Thomas Jefferson famously wrote in the document that set 13 British colonies on the path to independence, “that all men are created equal.” Eleven years later, several of the same men who signed this Declaration of Independence joined the delegates to America’s constitutional convention — where they promptly cast aside any pretense that the United States is dedicated to the notion that all people are equal."}, {"7a3f": "The Founding Fathers betrayed the Declaration’s promise with a Constitution that explicitly protected the institution of slavery. But they also betrayed it with the Senate, which treats residents of small states as more worthy of representation than residents of larger states."}, {"ed39": "In fairness, there’s a good explanation for why delegates from larger states were willing to trade away their right to equal representation in the national legislature. The Articles of Confederation, which proceeded the Constitution, was less a charter for a single nation and more akin to NATO, or perhaps the European Union. As Yale law professor Akhil Amar explains, the Articles were “an alliance, a multilateral treaty of sovereign nation-states.”"}, {"8f2f": "Under the Articles, Congress could neither tax individuals directly, raise troops, or provide for an army — a matter of great annoyance to General George Washington. The 13 former colonies largely functioned as their own independent nations."}, {"3135": "The Senate is a relic, wrapped in a mistake, wrapped in a toxic dose of sanctimony."}, {"1c01": "Yet, while the United States’ first experiment in unity was more treaty than Union, early American leaders were both well-versed in European history and fearful of the warfare than inevitably results when rival nations share geographic borders. The Constitution was thus an effort to solve two problems at once: to bind the 13 states together in a manner that would keep them from warring with each other, but also to ensure that this Union had real authority over its citizens."}, {"b728": "Understood in this context, the Great Compromise that led to the Senate makes sense. Large states like Pennsylvania and New York feared war with their neighboring states more than they feared being outvoted in the Senate. Small states had a stronger claim to equal representation when they were conceived of as independent nations and not simply a collection of individual citizens. And, in any event, the malapportioned Senate would be less dysfunctional that the loose collection of separate nations joined together under the Articles of Confederation."}, {"e254": "Yet, whatever the logic of this compromise in 1787, a lot has changed since then. The United States has a coherent national identity. Rhode Island has little to fear from the conquering armies of nearby Massachusetts. Utah is not going to fight a war with Colorado."}, {"c51b": "And yet the Senate persists, treating each resident of Wyoming as 67 times more worthy than each resident of California, despite the fact that the circumstances that birthed the Senate no longer exist."}, {"103d": "The slaveholder’s house"}, {"7f65": "Not long after the Constitution was ratified, slaveholders discovered that they had a problem — most of the nation lived in free states. By the early 1820s, free states controlled 105 of the 187 seats in the House of Representatives — and that’s after you account for the fact that the Three-Fifths Compromise permitted slave states to count 60 percent of their enslaved and disenfranchised population when it came time to allocate seats in the House."}, {"86e7": "If the House were the only game in town, in other words, it could conceivably have banned the slave trade — or at least taken fairly aggressive steps to hobble the South’s “peculiar institution.”"}, {"c051": "The South’s fears came to a head in 1819, when an obscure New York congressman introduced amendments to legislation admitting Missouri as a state, which would have banned any expansion of slavery within Missouri and required that all new children born into slavery be freed at age 25. Among other things, if Missouri were admitted into the Union on these terms, free states would have gained a majority in the Senate."}, {"fba1": "The response, as Princeton historian Sean Wilentz writes, was “blistering.” Southern lawmakers “virtually threatened secession were the amendments approved.” Northerners united behind the amendments in the House, pushing them across the finish line to passage."}, {"19b1": "Nevertheless, the amendments were ultimately defeated in the Senate, after five northern senators crossed over to vote with a unified South. Missouri was eventually admitted to the Union as a slave state, under the terms enacted through the so-called Missouri Compromise."}, {"f9cd": "The Senate, however, truly came into its own as a savior for Southern racists in the century following the Civil War."}, {"62ab": "In 1875, Reconstruction was on its last legs. Democrats, then the party most sympathetic to Southern whites, recently regained control of the House of Representatives. When Mississippi Democrats staged a violent uprising to seize control of their state, President Grant did not send troops to intervene. Within just two years, Republican Rutherford B. Hayes would sell out African Americans in the South in order to secure his own election — trading the end of Reconstruction for the presidency."}, {"d897": "Yet, even as white supremacists tightened their grip on the old Confederacy, Congress, several senators elected under Reconstruction governments had not yet completed their terms. As racist mobs marched through the state, Mississippi still had two Republican senators in 1875 — one of whom, Sen. Blanche Bruce, was a black man."}, {"3b04": "1875 was thus the last year until midway through the next century that Congress enacted a civil rights law of any kind. The Civil Rights Act of 1875 prohibited racial discrimination by “inns, public conveyances on land or water, theaters, and other places of public amusement,” though this provision was soon struck down by the Supreme Court."}, {"708c": "The reason why no new civil rights bill emerged from Congress until 1957 was the Senate. Though five such bills cleared the House in the 12 years following World War II alone, Senate malapportionment gave the southern senators far more influence over the legislative process than their states’ population could justify."}, {"c462": "That, combined with another peculiarity of the Senate, was enough to halt civil rights in its tracks."}, {"cf59": "Talk less, smile more"}, {"180d": "This is an impolitic time for a liberal news site to discuss the history of the filibuster. A bloc of Democrats comprising a majority of the nation but a minority of the seats in the Senate hope to keep a very conservative judge off the Supreme Court through a filibuster. Republican leaders hope to block this maneuver by eliminating filibusters of Supreme Court nominees. Having endured under the filibuster for so many years, the United States would undoubtedly be better off if the filibuster survives just a little bit longer until the Gorsuch nomination is defeated."}, {"a581": "Yet, while the senators hoping to filibuster Gorsuch represent a majority of the nation, this state of affairs is fairly unusual. The filibuster played a major role in Southern senators’ efforts to halt civil rights legislation. It played a similar role in a Republican minority’s efforts to shut down the only agency that can enforce much of federal labor law in 2013, and it was the centerpiece of Republican efforts to sabotage the Consumer Financial Protection Bureau before it was even operational. The last time the Senate erupted into a nuclear showdown over the filibuster, a Republican minority tried to prevent President Obama from confirming anyone to a powerful appeals court in Washington, DC."}, {"19f2": "Far more often than not, in other words, the filibuster thwarts democracy rather than reinforcing it. It cheated African Americans out of their full status as citizens. It threatened to dismantle entire agencies, despite the fact that Congress passed no law permitting this to happen. If the filibuster rules do change this week, Democrats should lament the rise of Neil Gorsuch, but they should not weep to see one of the most anti-democratic aspects of the Senate suffer another cut."}, {"a544": "The filibuster’s very existence is an historic accident arising from one of Aaron Burr’s final acts as vice president. As Brookings political scientist Sarah Binder recounts the history, the lame duck vice president returned to the Senate in 1805, fresh off his indictment for killing Alexander Hamilton. There, as the Senate’s presiding officer, he told the senators that their rule book was too complicated and had too many duplicative procedures. One process in particular, the “previous question motion,” Burr deemed especially worthy of removal."}, {"4ee2": "And the Senate believed him. They eliminated this motion the next year."}, {"35d4": "It turned out, however, that the previous question motion was not superfluous, it was a motion that enabled senators to cut off debate on a subject when a minority wanted to keep that debate going. Thus, by eliminating the motion, Burr effectively enabled dissenters to delay a vote indefinitely by forcing the Senate to “debate” it until the majority gave up."}, {"4e24": "No one actually attempted this until 1837, when “a minority block of Whig senators prolonged debate to prevent Andrew Jackson’s allies from expunging a resolution of censure against him.” But filibusters grew increasingly common over most of the following century and in 1917, the Senate amended its rules to permit a two-thirds supermajority to end debate. This threshold was eventually lowered to 60 senators, and later to 51 senators for confirmation votes not involving Supreme Court nominees."}, {"d29c": "In any event, one of the Senate’s most distinctive features, the filibuster, is not part of some grand vision of minority rights handed down from up on high to the Founding Fathers. It is an accident, created by a lame duck vice president and a body of senators who did not understand what they were doing."}, {"ea52": "Can it be fixed?"}, {"7471": "In its inception, the Senate had two anti-democratic features. It is malapportioned, and its members were originally selected by state legislatures, not by the voters themselves. As explained above, it soon developed a third major anti-democratic feature, the filibuster."}, {"7b97": "The good news, for those of us who believe that the right to govern should flow from the will of the people, is that the Senate has gotten better over time. The Seventeenth Amendment provides for direct election of senators. The filibuster is part-way through a process that is likely to end in its demise."}, {"0af4": "Nevertheless, curing the Senate’s greatest sin against democracy — the fact that it treats a person from California as 1/67th of a person from Wyoming — will be a much heavier lift."}, {"cbe5": "Although the Constitution provides two processes for amendments, these processes come with two caveats. No amendment could be made prior to 1808 curtailing the slave trade, and “no state, without its consent, shall be deprived of its equal suffrage in the Senate.”"}, {"526b": "Theoretically, there are ways around this problem. The United States could ratify two amendments to the Constitution — one permitting amendments to the Senate’s makeup and another actually changing that makeup or abolishing the Senate. Or, alternatively, a single amendment could leave the Senate in place as a malapportioned body, but reduce its authority so that it becomes an advisory body similar to the British House of Lords."}, {"fa65": "The problem with these solutions, however, is that any amendment requires the consent of three-fourths of the states, and it is unlikely that the states that benefit from malappointment will vote to reduce their own power."}, {"1e4a": "So that leaves one last option, a constitutional revolution. And there is one very significant precedent for such radical change."}, {"0a0f": "Under the Articles of Confederation, amendments were only permitted with the unanimous consent of the states. Nevertheless, a new Constitution was drafted in Philadelphia which, by its own terms, became effective upon “the ratification of the conventions of nine states.” The Constitution of the United States is, in this sense, unconstitutional."}, {"3a52": "We the People could once again invoke a similar process to create a more democratic union — one that is not only free of Senate malapportionment, but also free of other anti-democratic aspects of our present system such as partisan gerrymandering and the Electoral College."}, {"4539": "I have no illusions that this will happen any time soon, but it is likely the only way that the United States can become a truly democratic republic — one where everyone’s vote counts equally, regardless of where they live."}], "child": "1561_1\t1561_2\t1561_3\t1561_4\t1561_5\t1561_6\t1561_7\t1561_8\t1561_9\t1561_10\t1561_11\t1561_12\t1561_13\t1561_14\t1561_15\t1561_16\t1561_17\t1561_18\t1561_19\t1561_20\t1561_21\t1561_22\t1561_23\t1561_24"}