{"name": "1562", "parent": "", "content": "The GOP had a much different opinion of the ‘nuclear option’ just 4 years ago Now they stand poised to confirm Donald Trump’s Supreme Court nominee using a procedure they said was an illegitimate abuse of power. Republican Senators Ted Cruz of Texas, Mike Lee of Utah, and John Cornyn of Texas all stand ready to confirm Neil Gorsuch by any means necessary. CREDIT: AP Photo/J. Scott Applewhite By Josh Israel and Ryan Koronowski Not that long ago, it was November 2013. The Republican minority in the U.S. Senate had been mounting an unprecedented blockade of President Obama’s nominees for judgeships and executive branch positions. Key positions were being left unfilled. Senate Majority Harry Reid (D-NV) took to the Senate floor and moved to change the rules eliminate the filibuster for most appointments. The rules change — known as the “nuclear option” because of the explosive impact it was expected to have on the Senate — scrapped the requirement that ending debate on executive branch and lower court appointees took three-fifths of the Senate (60 votes) and replaced it with a simple majority (51 votes) threshold. At the time, the Republican minority denounced the move as an erosion of minority rights, a naked power grab, and a violation of the Senate’s constitutional duty. They pointed out that many of the same Democrats had fiercely fought a similar move 8 years earlier in support of George W. Bush’s nominees. But their biggest gripe was that the rule change was done by a majority vote; they pointed to a provision in Rule XXII that indicated rules changes require a two-thirds super-majority. Democrats argued that this rule was not applicable, but Senate Minority Leader Mitch McConnell (R-KY) and many of his GOP colleagues howled that Reid had decided to “break the rules to change the rules.” Watch: This week, after at least 41 Senate Democrats announced they plan to oppose cloture on the nomination of Neil Gorsuch to the Supreme Court, McConnell and his Republican colleagues made it clear that they would now use the maneuver they for years have claimed they cannot do under Senate rules to allow them to seat Trump’s pick on the high court with just a simple majority. In other words: McConnell now plans to “break the rules to change the rules.” But McConnell was not alone in deriding the maneuver. A ThinkProgress review of members’ comments from 2013 onward found that at least 34 of the 37 current Republican senators who were serving at the time denounced the “nuclear option” as forbidden and a dangerous power grab. Today, Democrats opposing the nuclear option for Supreme Court nominees are not arguing that Senate rules prevent it from happening. And while a reasonable case can be made that Supreme Court nominees, like appointees, should not be subject to the filibuster, what is stunning here is the number of Senators willing to do something that just four years ago they said could and should not be done, because it is politically expeditious now. They include (emphasis added): “Let’s imagine this: The Vanderbilt-Tennessee game, which is being played in Knoxville, home of the University of Tennessee, and Vanderbilt gets on the 1-yard line. The University of Tennessee says: Well, we are the home team, so we will just add 20 yards to the field or whatever it takes for us to win the game. Or the Boston Red Sox are playing at home. Let’s say they are behind the Cardinals this year. They get to the ninth inning and they are behind and they say: Well, it is our home field. We will just add a few innings or whatever it takes so we can win the game. That is what the Democratic majority did today. They say: The rules don’t allow us to do what we want to do, so we will just change the rules to do whatever it takes to get the result we want.” 2. John Barrasso (R-WY) “We are not wiser than the Founding Fathers. It is not time to throw out the rules. … Senate Democrats should remember — should remember — their prior commitments and abandon this plan before irreparably damaging the Senate.” 3. Roy Blunt (R-MO) “This power grab by Leader Reid and Senate Democrats is simply an attempt to shift the focus away from the disastrous Obamacare roll-out. The Democrats decided all on their own to involve the government in every American’s health care. Now, the Democrats want to make decisions all on their own about every federal judge. Neither of these things will produce a result the American people deserve.” 4. John Boozman (R-AR) “This was an act of desperation by the Senate Majority to distract from a disastrous few weeks. Senator Reid’s willingness to break the rules to change the rules so he could divert attention from Obamacare’s failures is understandable given how disastrous the program’s rollout has been.” 5. Richard Burr (R-NC) “The American people know what they get when the Senate removes the 60-vote threshold and the minority is stripped of its rights: they get unchecked power by the Executive Branch. The President and Harry Reid might not like the American people playing a role in outcomes through the minority, but it has worked well for over 200 years. This change is a blatant attempt to change the debate about the Democrats’ health care plan as the consequences of this disastrous law are felt around the country, but it has ramifications far beyond the debate surrounding Obamacare. Rather than advance legislation and nominate judges that are capable of receiving bipartisan support in the United States Senate, the President and the Democrat majority want their legislation, their way — and they want to change the Senate rules to pack the courts with judges who agree with them. Make no mistake; these actions pave the way for more laws like Obamacare and will do lasting damage to bipartisanship, the Senate, and the nation.” 6. Thad Cochran (R-MS) “Madam President, as the majority contemplate changing the rules of the Senate to expedite the confirmation of several executive branch nominees, I hope that serious consideration was given to the adverse effects this change could have. We should resist embarking on a path that would circumvent the rights of the minority to exercise its advice and consent responsibilities provided in the Constitution. The consequences of the action by the majority should not be minimized. Former Senator Ted Kennedy, in 2003, testified before the Rules Committee that by allowing a simple majority to end debate on nominees, the Senate would put itself on a course to destroy the very essence of our constitutional role.’ Such a departure from precedent would dilute the minority rights that differentiate the Senate from the other body. It also opens the door to applying this same rule to debate on judicial nominations, as well as the legislative process.” 7. Susan Collins (R-ME) “In 2005, I strongly opposed a Republican plan to employ the so-called ‘nuclear option.’ I was deeply concerned that, by adopting changes in the standing rules by a simple majority, party-line vote, the majority party would have had unprecedented power to limit debate and block Senators from offering amendments. Today, I feel just as strongly about Democratic Leader Harry Reid’s move to stifle debate and exclude amendments from members, no matter on which side of the aisle they serve. That impedes careful consideration of the most important matters before Congress and is not in our country’s best interests.” 8. Bob Corker (R-TN) “At some point, you have to just throw up your hands and say, look, they’re going to use brute, raw force to get what they wish. Let’s face it. I mean, this is about the D.C. Circuit.” 9. John Cornyn (R-TX) “[The Democrats] will do anything to take the attention off the failure that is Obamacare, even if it means breaking the rules of the Senate in a raw exercise of partisan political power.” 10. Mike Crapo (R-ID) “This week in the Senate, we have had a very intense battle over the filibuster rules. It has become named the ‘nuclear option’ battle, relating to a threat by Senator Harry Reid, the majority leader, to essentially break the rules to change the rules and force through a number of executive nominations. … in order to change the rule, it takes 67 votes.” 11. Ted Cruz (R-TX) “Today’s unfortunate vote damaged the Senate and was designed to try to change the topic from the millions of Americans losing their jobs and their healthcare because of Obamacare... [I]n yet another partisan abuse of power, the Democrats are now shamelessly working to pack the D.C. Circuit, so that President Obama’s lawless disregard of our statutes and Constitution will not be held to account by an impartial judiciary.” 12. Mike Enzi (R-WY) “If members of the majority in the Senate use the nuclear option to weaken the filibuster, they weaken the Senate itself. A weak Senate is more susceptible to the demands of a smaller majority and the president… So much for the rights of the minority inherent in the rules of the Senate. What they are considering would be incredibly short-sighted.” 13. Deb Fischer (R-NE) “Some of my colleagues are working to change the rules of the Senate by diluting the power of the filibuster. Nebraskans know that the filibuster ensures that the views of the minority are heard; many have called my office to express this opinion. While I agree that the Senate must become more functional, I do not believe the solution is to destroy the very character of the institution, which was purposefully designed by our Founding Fathers. When the Constitution was drafted, Thomas Jefferson was overseas serving as an ambassador. After he returned, Jefferson questioned George Washington about the role of the Senate. In response, Washington posed a question: ‘Why did you pour that tea into your saucer,’ he asked. ‘To cool it,’ said Jefferson. ‘Even so we pour legislation into the senatorial saucer to cool it,’ concluded Washington. The Senate, then, was designed as a deliberative body to produce thoughtful policy. The solution to Senate gridlock is not changing the rules, or shattering the ‘cooling saucer.’” 14. Jeff Flake (R-AZ) “It’s a sad day in the Senate when Democrats are willing to ignore 225 years of precedent to distract attention away from the failures of Obamacare.” 15. Lindsey Graham (R-SC) “Let’s call it what it was — a raw power grab by Senate Democrats and President Obama. Previous efforts to resist the temptation of turning the Senate into the House of Representatives were lost today and the ‘advise and consent’ clause for executive and judicial branch nominations was washed away. ... Without the ability to delay nominations, presidential administrations are likely to be even more successful in their stonewalling efforts. Finally, one of the great concerns about this rule change is without the requirement to work with the minority party to select judges, the judiciary will become dominated by ideologues. One of the biggest winners of this move is liberal groups who will be pushing radical, liberal judges to serve on the federal bench.” 16. Chuck Grassley (R-IA) “This is about a naked power grab and nothing more than a power grab. This is about the other side not getting everything they want, when they want it. … But make no mistake, my friends on the other side will have to answer this question: Why did you choose this moment to break the rules to change the rules?… [W]hy did you choose this moment to hand the keys to the kingdom over to the President, a President with less check on his authority?” 17. Orrin Hatch (R-UT) “It is a pre-scripted parliamentary hit-and-run, over in a flash andleaving Senate tradition and practice behind like so much confirmation roadkill. This would be the wrong way to address even a real confirmation crisis, let alone the fake one created by the majority today. The majority, it seems, just does not like the way our system of government is designed to work. … They are denying to others the very same tools that they used so aggressively before. … They have fundamentally altered this body, they have in the most disingenuous way done long term institutional damage for short term political gain.” 18. Dean Heller (R-NV) “This is a sad day for the United States Senate, and a scary day for Nevada. While today we are discussing nominations, what assurances are there that today’s changes will not apply to future legislation? The Nevada delegation has prevented Yucca Mountain from moving forward, a policy that is already the law of the land. We have been able to accomplish this using every arrow in our quiver. When you are from a small state, you have to rely on every tool in your toolbox to protect yourself. Now, the opening of Yucca Mountain is a renewed risk. It’s clear that today’s actions by the Senate have made Nevada even more vulnerable to the will of the majority.” 19. John Hoeven (R-ND) “You asked what we could do when we get control. I’m saying we’re going to think through that in a very measured way and come up with something that works for the American people and get some good results. Not a partisan unilateral action… I think Robert Byrd who was in the Senate for, you know, one of the longest serving senators in the history of the Senate, I think he is turning over in his grave. I mean, he was somebody who understood to break the rules means you have no rules.” 20. Jim Inhofe (R-OK) “For 100 years, the Senate has had a rule in place to protect the minority voice by requiring a supermajority for highly debated issue. Reid’s ‘nuclear option’ yesterday overturned this rule when it applies to consideration of most presidential nominees. By removing the minority’s voice in this procedure, Senate Democrats essentially made the Senate’s constitutional role to advise and consent on nominations merely ceremonial.” 21. Johnny Isakson (R-GA) “And what you do by changing the rules of the Senate and taking away that ability to be thoughtful and deliberate is, you end up with a Senate that can be a runaway Senate as much as you can have a House that’s a runaway House. And that’s not good for the country. … I think you need to be where you are where you’re in the majority as well as the minority. If we think something’s wrong when they’re in the majority and based on principle it also ought to be wrong when we’re in the majority.” 22. Ron Johnson (R-WI) “The rules are being changed in the middle of the game. They’re breaking the rules to change the rules, regardless of one’s political affiliations, Americans understand this is a political power grab — a partisan political grab.” 23. Mike Lee (R-UT) “Much like the ‘nuclear option’ change to Senate rules in November, Reid’s refusal to allow amendments to the NDAA this year serves no other purpose than to stymie the rights of the American people to have their voices heard on important legislation through their elected officials.” 24. John McCain (R-AZ) “I feel this is a dark day for the Senate. I don’t know how we can get out of it. It is the biggest rules change — certainly since I have been in the Senate, maybe my lifetime, and maybe in the history of the Senate — where it has changed by a simple majority by overruling the Chair…. Senator Reid says: I appeal the ruling of the Chair. I ask my colleagues in the Senate to overrule the rules of the Senate, by a simple majority vote, to overrule the Parliamentarian and the Presiding Officer of the Senate. This is what happened. When our rules say to change the rules of the Senate, it takes a two-thirds vote.\" 25. Mitch McConnell (R-KY) “If you think this is in the best interests of the Senate and the American people to make advice and consent, in effect, mean nothing — obviously you can break the rules to change the rules to achieve that.” 26. Jerry Moran (R-KS) “Senate Democrats are breaking the rules of the Senate so they can continue to invoke the same procedural tactics they used when Obamacare was forced through Congress without a single Republican vote.” 27. Lisa Murkowski (R-AK) “It’s a power grab, plain and simple. … Today’s vote saddens me more than it angers me. This is a sad day for the institution of the U.S. Senate, the legislative body designed to guard the views and the voices of the minority and to be — in the words of George Washington — the ‘saucer used to cool the tea.’ Senate Democrats have shattered that saucer into pieces. I’m afraid today’s rules change will fundamentally alter our operations and lead us to being a less tempered body.” 28. Rand Paul (R-KY) “But what he’s saying is, ‘I’m in charge here, I’m a bully, and I’m going to get my way or I’m going to change the rules.’ And he had to actually break the rules in order to change the rules. Never been done. He’s breaking with hundreds of years of precedent to do this. Frankly, in doing so, he’s causing more discord and disharmony here, and there will be more dysfunction, I think, because of it.” 29. Jim Risch (R-ID) “Our founding fathers engineered a government where it was not easy to move legislation forward. These difficulties were designed to ensure differences were recognized and compromises would be necessary. This design makes us stronger, not weaker. Unfortunately, Senator Reid and his colleagues believe the ends justify the means and are willing to sacrifice our constitutional traditions in pursuit of expediency. While these changes, which took place today in the United States Senate, apply only to judicial and executive nominations, I believe going forward that Senator Reid will attempt to apply this to all legislative business of the Senate. Today’s rule changes will have far ranging implications for the United States Senate and our democracy. “ 30. Pat Roberts (R-KS) “Our rules have always ensured a voice for the minority in this body. Unlike the House, where I served, where a simple majority has the power to impose a rule change at any time, in the Senate the minority has always been protected. Here, the rules protect the minority and cannot be changed without their consent — unless, of course, the majority decides it wants to break the rules to change the rules. I am saddened that is what happened today.” 31. Tim Scott (R-SC) “This unprecedented power grab to change the rules of the Senate simply to try and shift people’s attention away from the disastrous Obamacare rollout is short sighted, and it carries implications Democrats are going to have to live with when Republicans retake the Senate.” 32. Richard Shelby (R-AL) “If Democrats think that they deserve more power, they should earn it from voters at the polls in 2014, not swipe it with a drastic rule change in the Senate today.” 33. John Thune (R-SD)“Senate Democrats are desperate to talk about anything other than the disastrous train wreck of ObamaCare, and are willing to break the rules of the Senate to do so.” 34. Roger Wicker (R-MS) “The raw abuse of power being displayed by Senate Democrats is reminiscent of their purely partisan efforts to pass Obamacare four years ago. Further, they have tarnished the integrity of the institution by ignoring 225 years of precedent and trampling the rights of the minority party and the millions of Americans we represent. The Founding Fathers intended the Senate to be the most deliberative legislative body the world has ever seen. Unfortunately, actions taken today by the majority party have upended the chamber’s tradition of thoughtful and reasoned legislating.” Of course, some of these Senators who were fervently against the nuclear option for lower court judges in 2013 had actually been in support of the same maneuver in 2005 — but now they have completed a full 360 on the matter. One other then-Senator also proclaimed it a “sad day” when the majority engaged in “the greatest alteration of the rules without proper procedure that we have probably seen in the history of the Republic.” He is now Donald Trump’s Attorney General. ", "title": "The GOP had a much different opinion of the ‘nuclear option’ just 4 years ago", "sentences": [{"1731": "The GOP had a much different opinion of the ‘nuclear option’ just 4 years ago"}, {"a53f": "Now they stand poised to confirm Donald Trump’s Supreme Court nominee using a procedure they said was an illegitimate abuse of power."}, {"2f1c": "Republican Senators Ted Cruz of Texas, Mike Lee of Utah, and John Cornyn of Texas all stand ready to confirm Neil Gorsuch by any means necessary. CREDIT: AP Photo/J. Scott Applewhite"}, {"5932": "By Josh Israel and Ryan Koronowski"}, {"33ec": "Not that long ago, it was November 2013. The Republican minority in the U.S. Senate had been mounting an unprecedented blockade of President Obama’s nominees for judgeships and executive branch positions. Key positions were being left unfilled. Senate Majority Harry Reid (D-NV) took to the Senate floor and moved to change the rules eliminate the filibuster for most appointments."}, {"9f82": "The rules change — known as the “nuclear option” because of the explosive impact it was expected to have on the Senate — scrapped the requirement that ending debate on executive branch and lower court appointees took three-fifths of the Senate (60 votes) and replaced it with a simple majority (51 votes) threshold. At the time, the Republican minority denounced the move as an erosion of minority rights, a naked power grab, and a violation of the Senate’s constitutional duty. They pointed out that many of the same Democrats had fiercely fought a similar move 8 years earlier in support of George W. Bush’s nominees. But their biggest gripe was that the rule change was done by a majority vote; they pointed to a provision in Rule XXII that indicated rules changes require a two-thirds super-majority. Democrats argued that this rule was not applicable, but Senate Minority Leader Mitch McConnell (R-KY) and many of his GOP colleagues howled that Reid had decided to “break the rules to change the rules.”"}, {"0231": "Watch:"}, {"2890": "This week, after at least 41 Senate Democrats announced they plan to oppose cloture on the nomination of Neil Gorsuch to the Supreme Court, McConnell and his Republican colleagues made it clear that they would now use the maneuver they for years have claimed they cannot do under Senate rules to allow them to seat Trump’s pick on the high court with just a simple majority. In other words: McConnell now plans to “break the rules to change the rules.”"}, {"8d18": "But McConnell was not alone in deriding the maneuver. A ThinkProgress review of members’ comments from 2013 onward found that at least 34 of the 37 current Republican senators who were serving at the time denounced the “nuclear option” as forbidden and a dangerous power grab."}, {"cbb3": "Today, Democrats opposing the nuclear option for Supreme Court nominees are not arguing that Senate rules prevent it from happening. And while a reasonable case can be made that Supreme Court nominees, like appointees, should not be subject to the filibuster, what is stunning here is the number of Senators willing to do something that just four years ago they said could and should not be done, because it is politically expeditious now."}, {"06b9": "They include (emphasis added):"}, {"8647": "“Let’s imagine this: The Vanderbilt-Tennessee game, which is being played in Knoxville, home of the University of Tennessee, and Vanderbilt gets on the 1-yard line. The University of Tennessee says: Well, we are the home team, so we will just add 20 yards to the field or whatever it takes for us to win the game. Or the Boston Red Sox are playing at home. Let’s say they are behind the Cardinals this year. They get to the ninth inning and they are behind and they say: Well, it is our home field. We will just add a few innings or whatever it takes so we can win the game. That is what the Democratic majority did today. They say: The rules don’t allow us to do what we want to do, so we will just change the rules to do whatever it takes to get the result we want.”"}, {"9bc9": "2. John Barrasso (R-WY)"}, {"ed86": "“We are not wiser than the Founding Fathers. It is not time to throw out the rules. … Senate Democrats should remember — should remember — their prior commitments and abandon this plan before irreparably damaging the Senate.”"}, {"9281": "3. Roy Blunt (R-MO)"}, {"7d42": "“This power grab by Leader Reid and Senate Democrats is simply an attempt to shift the focus away from the disastrous Obamacare roll-out. The Democrats decided all on their own to involve the government in every American’s health care. Now, the Democrats want to make decisions all on their own about every federal judge. Neither of these things will produce a result the American people deserve.”"}, {"d86a": "4. John Boozman (R-AR)"}, {"18fc": "“This was an act of desperation by the Senate Majority to distract from a disastrous few weeks. Senator Reid’s willingness to break the rules to change the rules so he could divert attention from Obamacare’s failures is understandable given how disastrous the program’s rollout has been.”"}, {"5169": "5. Richard Burr (R-NC)"}, {"63a7": "“The American people know what they get when the Senate removes the 60-vote threshold and the minority is stripped of its rights: they get unchecked power by the Executive Branch. The President and Harry Reid might not like the American people playing a role in outcomes through the minority, but it has worked well for over 200 years. This change is a blatant attempt to change the debate about the Democrats’ health care plan as the consequences of this disastrous law are felt around the country, but it has ramifications far beyond the debate surrounding Obamacare. Rather than advance legislation and nominate judges that are capable of receiving bipartisan support in the United States Senate, the President and the Democrat majority want their legislation, their way — and they want to change the Senate rules to pack the courts with judges who agree with them. Make no mistake; these actions pave the way for more laws like Obamacare and will do lasting damage to bipartisanship, the Senate, and the nation.”"}, {"ca2e": "6. Thad Cochran (R-MS)"}, {"181d": "“Madam President, as the majority contemplate changing the rules of the Senate to expedite the confirmation of several executive branch nominees, I hope that serious consideration was given to the adverse effects this change could have. We should resist embarking on a path that would circumvent the rights of the minority to exercise its advice and consent responsibilities provided in the Constitution. The consequences of the action by the majority should not be minimized. Former Senator Ted Kennedy, in 2003, testified before the Rules Committee that by allowing a simple majority to end debate on nominees, the Senate would put itself on a course to destroy the very essence of our constitutional role.’ Such a departure from precedent would dilute the minority rights that differentiate the Senate from the other body. It also opens the door to applying this same rule to debate on judicial nominations, as well as the legislative process.”"}, {"7915": "7. Susan Collins (R-ME)"}, {"c65e": "“In 2005, I strongly opposed a Republican plan to employ the so-called ‘nuclear option.’ I was deeply concerned that, by adopting changes in the standing rules by a simple majority, party-line vote, the majority party would have had unprecedented power to limit debate and block Senators from offering amendments."}, {"4d1a": "Today, I feel just as strongly about Democratic Leader Harry Reid’s move to stifle debate and exclude amendments from members, no matter on which side of the aisle they serve. That impedes careful consideration of the most important matters before Congress and is not in our country’s best interests.”"}, {"ca67": "8. Bob Corker (R-TN)"}, {"e762": "“At some point, you have to just throw up your hands and say, look, they’re going to use brute, raw force to get what they wish. Let’s face it. I mean, this is about the D.C. Circuit.”"}, {"223d": "9. John Cornyn (R-TX)"}, {"aded": "“[The Democrats] will do anything to take the attention off the failure that is Obamacare, even if it means breaking the rules of the Senate in a raw exercise of partisan political power.”"}, {"a56b": "10. Mike Crapo (R-ID)"}, {"5212": "“This week in the Senate, we have had a very intense battle over the filibuster rules. It has become named the ‘nuclear option’ battle, relating to a threat by Senator Harry Reid, the majority leader, to essentially break the rules to change the rules and force through a number of executive nominations. … in order to change the rule, it takes 67 votes.”"}, {"ea1b": "11. Ted Cruz (R-TX)"}, {"8ceb": "“Today’s unfortunate vote damaged the Senate and was designed to try to change the topic from the millions of Americans losing their jobs and their healthcare because of Obamacare... [I]n yet another partisan abuse of power, the Democrats are now shamelessly working to pack the D.C. Circuit, so that President Obama’s lawless disregard of our statutes and Constitution will not be held to account by an impartial judiciary.”"}, {"7b2a": "12. Mike Enzi (R-WY)"}, {"f2b6": "“If members of the majority in the Senate use the nuclear option to weaken the filibuster, they weaken the Senate itself. A weak Senate is more susceptible to the demands of a smaller majority and the president… So much for the rights of the minority inherent in the rules of the Senate. What they are considering would be incredibly short-sighted.”"}, {"e26c": "13. Deb Fischer (R-NE)"}, {"9e63": "“Some of my colleagues are working to change the rules of the Senate by diluting the power of the filibuster. Nebraskans know that the filibuster ensures that the views of the minority are heard; many have called my office to express this opinion. While I agree that the Senate must become more functional, I do not believe the solution is to destroy the very character of the institution, which was purposefully designed by our Founding Fathers. When the Constitution was drafted, Thomas Jefferson was overseas serving as an ambassador. After he returned, Jefferson questioned George Washington about the role of the Senate. In response, Washington posed a question: ‘Why did you pour that tea into your saucer,’ he asked. ‘To cool it,’ said Jefferson. ‘Even so we pour legislation into the senatorial saucer to cool it,’ concluded Washington. The Senate, then, was designed as a deliberative body to produce thoughtful policy. The solution to Senate gridlock is not changing the rules, or shattering the ‘cooling saucer.’”"}, {"cd1a": "14. Jeff Flake (R-AZ)"}, {"4320": "“It’s a sad day in the Senate when Democrats are willing to ignore 225 years of precedent to distract attention away from the failures of Obamacare.”"}, {"8de6": "15. Lindsey Graham (R-SC)"}, {"36a5": "“Let’s call it what it was — a raw power grab by Senate Democrats and President Obama. Previous efforts to resist the temptation of turning the Senate into the House of Representatives were lost today and the ‘advise and consent’ clause for executive and judicial branch nominations was washed away. ... Without the ability to delay nominations, presidential administrations are likely to be even more successful in their stonewalling efforts. Finally, one of the great concerns about this rule change is without the requirement to work with the minority party to select judges, the judiciary will become dominated by ideologues. One of the biggest winners of this move is liberal groups who will be pushing radical, liberal judges to serve on the federal bench.”"}, {"a8af": "16. Chuck Grassley (R-IA)"}, {"4545": "“This is about a naked power grab and nothing more than a power grab. This is about the other side not getting everything they want, when they want it. … But make no mistake, my friends on the other side will have to answer this question: Why did you choose this moment to break the rules to change the rules?… [W]hy did you choose this moment to hand the keys to the kingdom over to the President, a President with less check on his authority?”"}, {"a6e5": "17. Orrin Hatch (R-UT)"}, {"7e70": "“It is a pre-scripted parliamentary hit-and-run, over in a flash andleaving Senate tradition and practice behind like so much confirmation roadkill. This would be the wrong way to address even a real confirmation crisis, let alone the fake one created by the majority today. The majority, it seems, just does not like the way our system of government is designed to work. … They are denying to others the very same tools that they used so aggressively before. … They have fundamentally altered this body, they have in the most disingenuous way done long term institutional damage for short term political gain.”"}, {"07d6": "18. Dean Heller (R-NV)"}, {"634a": "“This is a sad day for the United States Senate, and a scary day for Nevada. While today we are discussing nominations, what assurances are there that today’s changes will not apply to future legislation? The Nevada delegation has prevented Yucca Mountain from moving forward, a policy that is already the law of the land. We have been able to accomplish this using every arrow in our quiver. When you are from a small state, you have to rely on every tool in your toolbox to protect yourself. Now, the opening of Yucca Mountain is a renewed risk. It’s clear that today’s actions by the Senate have made Nevada even more vulnerable to the will of the majority.”"}, {"755f": "19. John Hoeven (R-ND)"}, {"2e8a": "“You asked what we could do when we get control. I’m saying we’re going to think through that in a very measured way and come up with something that works for the American people and get some good results. Not a partisan unilateral action… I think Robert Byrd who was in the Senate for, you know, one of the longest serving senators in the history of the Senate, I think he is turning over in his grave. I mean, he was somebody who understood to break the rules means you have no rules.”"}, {"02d5": "20. Jim Inhofe (R-OK)"}, {"4ab8": "“For 100 years, the Senate has had a rule in place to protect the minority voice by requiring a supermajority for highly debated issue. Reid’s ‘nuclear option’ yesterday overturned this rule when it applies to consideration of most presidential nominees. By removing the minority’s voice in this procedure, Senate Democrats essentially made the Senate’s constitutional role to advise and consent on nominations merely ceremonial.”"}, {"13cc": "21. Johnny Isakson (R-GA)"}, {"18e2": "“And what you do by changing the rules of the Senate and taking away that ability to be thoughtful and deliberate is, you end up with a Senate that can be a runaway Senate as much as you can have a House that’s a runaway House. And that’s not good for the country. … I think you need to be where you are where you’re in the majority as well as the minority. If we think something’s wrong when they’re in the majority and based on principle it also ought to be wrong when we’re in the majority.”"}, {"67c2": "22. Ron Johnson (R-WI)"}, {"5a32": "“The rules are being changed in the middle of the game. They’re breaking the rules to change the rules, regardless of one’s political affiliations, Americans understand this is a political power grab — a partisan political grab.”"}, {"9d9b": "23. Mike Lee (R-UT)"}, {"8736": "“Much like the ‘nuclear option’ change to Senate rules in November, Reid’s refusal to allow amendments to the NDAA this year serves no other purpose than to stymie the rights of the American people to have their voices heard on important legislation through their elected officials.”"}, {"b2f6": "24. John McCain (R-AZ)"}, {"da05": "“I feel this is a dark day for the Senate. I don’t know how we can get out of it. It is the biggest rules change — certainly since I have been in the Senate, maybe my lifetime, and maybe in the history of the Senate — where it has changed by a simple majority by overruling the Chair…. Senator Reid says: I appeal the ruling of the Chair. I ask my colleagues in the Senate to overrule the rules of the Senate, by a simple majority vote, to overrule the Parliamentarian and the Presiding Officer of the Senate. This is what happened. When our rules say to change the rules of the Senate, it takes a two-thirds vote.\""}, {"ab6a": "25. Mitch McConnell (R-KY)"}, {"b3e7": "“If you think this is in the best interests of the Senate and the American people to make advice and consent, in effect, mean nothing — obviously you can break the rules to change the rules to achieve that.”"}, {"8bcc": "26. Jerry Moran (R-KS)"}, {"89c0": "“Senate Democrats are breaking the rules of the Senate so they can continue to invoke the same procedural tactics they used when Obamacare was forced through Congress without a single Republican vote.”"}, {"eda6": "27. Lisa Murkowski (R-AK)"}, {"543d": "“It’s a power grab, plain and simple. … Today’s vote saddens me more than it angers me. This is a sad day for the institution of the U.S. Senate, the legislative body designed to guard the views and the voices of the minority and to be — in the words of George Washington — the ‘saucer used to cool the tea.’ Senate Democrats have shattered that saucer into pieces. I’m afraid today’s rules change will fundamentally alter our operations and lead us to being a less tempered body.”"}, {"4a1a": "28. Rand Paul (R-KY)"}, {"1252": "“But what he’s saying is, ‘I’m in charge here, I’m a bully, and I’m going to get my way or I’m going to change the rules.’ And he had to actually break the rules in order to change the rules. Never been done. He’s breaking with hundreds of years of precedent to do this. Frankly, in doing so, he’s causing more discord and disharmony here, and there will be more dysfunction, I think, because of it.”"}, {"3bb2": "29. Jim Risch (R-ID)"}, {"b5ca": "“Our founding fathers engineered a government where it was not easy to move legislation forward. These difficulties were designed to ensure differences were recognized and compromises would be necessary. This design makes us stronger, not weaker. Unfortunately, Senator Reid and his colleagues believe the ends justify the means and are willing to sacrifice our constitutional traditions in pursuit of expediency. While these changes, which took place today in the United States Senate, apply only to judicial and executive nominations, I believe going forward that Senator Reid will attempt to apply this to all legislative business of the Senate. Today’s rule changes will have far ranging implications for the United States Senate and our democracy. “"}, {"8f93": "30. Pat Roberts (R-KS)"}, {"6a62": "“Our rules have always ensured a voice for the minority in this body. Unlike the House, where I served, where a simple majority has the power to impose a rule change at any time, in the Senate the minority has always been protected. Here, the rules protect the minority and cannot be changed without their consent — unless, of course, the majority decides it wants to break the rules to change the rules. I am saddened that is what happened today.”"}, {"309a": "31. Tim Scott (R-SC)"}, {"4cb0": "“This unprecedented power grab to change the rules of the Senate simply to try and shift people’s attention away from the disastrous Obamacare rollout is short sighted, and it carries implications Democrats are going to have to live with when Republicans retake the Senate.”"}, {"c187": "32. Richard Shelby (R-AL)"}, {"2b3a": "“If Democrats think that they deserve more power, they should earn it from voters at the polls in 2014, not swipe it with a drastic rule change in the Senate today.”"}, {"126e": "33. John Thune (R-SD)“Senate Democrats are desperate to talk about anything other than the disastrous train wreck of ObamaCare, and are willing to break the rules of the Senate to do so.”"}, {"26a8": "34. Roger Wicker (R-MS)"}, {"e3fb": "“The raw abuse of power being displayed by Senate Democrats is reminiscent of their purely partisan efforts to pass Obamacare four years ago. Further, they have tarnished the integrity of the institution by ignoring 225 years of precedent and trampling the rights of the minority party and the millions of Americans we represent. The Founding Fathers intended the Senate to be the most deliberative legislative body the world has ever seen. Unfortunately, actions taken today by the majority party have upended the chamber’s tradition of thoughtful and reasoned legislating.”"}, {"9fda": "Of course, some of these Senators who were fervently against the nuclear option for lower court judges in 2013 had actually been in support of the same maneuver in 2005 — but now they have completed a full 360 on the matter."}, {"7b7f": "One other then-Senator also proclaimed it a “sad day” when the majority engaged in “the greatest alteration of the rules without proper procedure that we have probably seen in the history of the Republic.” He is now Donald Trump’s Attorney General."}], "child": "1562_1\t1562_2\t1562_3\t1562_4\t1562_5\t1562_6\t1562_7\t1562_8\t1562_91562_1\t1562_2\t1562_3\t1562_4\t1562_5\t1562_6\t1562_7\t1562_8\t1562_9"}