{"name": "1563", "parent": "", "content": "Oregon senator ends marathon Senate speech after 15 hours Jeff Merkley’s marathon stand, however, won’t delay Gorsuch’s confirmation. CREDIT: Screenshot, CSPAN Senator Jeff Merkley (D-OR) stepped onto the Senate floor around 6:45 pm Tuesday night to begin a marathon speech in protest of President Donald Trump’s Supreme Court nominee. Fifteen and a half hours later, he left. “By stealing a Supreme Court seat for the first time in American history, the Senate is undermining the Court and the rule of law, and turning the highest court in the land into a political committee,” Merkley wrote on his Facebook page before taking the floor. Merkley pledged on Twitter a few hours into his speech to keep talking “as long as I’m able.” His staff told an ABC reporter that he ran an Ironman Triathalon in November, and that “if anyone can keep going, he can.” But Merkley couldn’t keep talking forever, even if he had unlimited endurance. Senate Majority leader Mitch McConnell (R-KY) preemptively filed a motion to end debate, known as a cloture motion, before Merkley started talking. That motion starts a clock for votes on cloture, which is one of the few things that Senate rules allow to interrupt a marathon speech like Merkley’s. That means that while Merkley could use his speech to draw attention and as a symbolic protest, he couldn’t actually delay the vote on Gorsuch’s confirmation (and it also means that, technically, his speech wasn’t a filibuster). The vote on cloture for Gorsuch’s confirmation is expected on Thursday, and a full vote is expected in the Senate before it breaks for two weeks for Easter on Friday. Senate Republicans are expected to use the so-called “nuclear option” — getting rid of the 60-vote nomination threshold — in order to get Gorsuch passed in the face of near-complete Democratic opposition. McConnell announced his intention to do so as Merkley took the floor. Merkley’s speech ranged widely over the night. He riffed on Republicans’ refusal to hold votes on President Barack Obama’s nominee Merrick Garland, as they argued there was historic precedence for holding off during an election year. “That is a phony, phony, incorrect, salacious, insert-your-own-adjective-there argument,” Merkley said, listing out the history of four times SCOTUS nominees have been confirmed in election years. Merkley also drew ammunition from breaking events outside the Capitol building. While he was on the floor, news broke that Gorsuch’s 2006 books contains passages that are strikingly similar to a 1984 article in the Indiana Law Journal. The White House dismissed the news, but several academics and experts told Politico that the similarities between the passages would almost certainly violate academic plagiarism rules. Just after midnight, Merkley was handed a copy of the Politico report and recited several of the allegedly plagiarized passages. Even later in the night, Merkley went on a riff about the dangers of money in politics and Citizens United, the Supreme Court decision that enabled private interests to pour “a flow of largely secret money concentrated in the hands of the megawealthy into campaigns,” as he put it. “You can see this corrupting power by looking at the disappearance of the interests of my colleagues across the aisle in the environment,” he said. “It was Richard Nixon who created the Environmental Protection Agency and the Clean Air Act and the Clean Water Act. And many colleagues expressed a lot of interest in taking on one of the most diabolical sources of pollution — carbon dioxide. But that interest has completely disappeared since the fossil fuel industry has put billions of dollars into the Republican Senate Campaigns. Completely disappeared.” After listing off concrete examples of recent and impending environmental disasters linked to climate change — from the longer wildfire season in Oregon to coral bleaching caused by ocean acidification — Merkley circled back to money in politics corrupting the political response. “We are doing so little because the coal and oil billionaires have proceeded to invest so much money in third-party Senate campaigns to elect one side of the aisle and defeat the other side,” he said. “This fossil fuel cartel wants to make sure they have a court that continues this corruption, and that’s why they put so much pressure to have senators not consider Merrick Garland when he was nominated last year in 2016.” Merkley yielded the floor at 10:15 am on Wednesday, after 15 and a half hours of speaking. ", "title": "Oregon senator ends marathon Senate speech after 15 hours", "sentences": [{"f3f0": "Oregon senator ends marathon Senate speech after 15 hours"}, {"ad9e": "Jeff Merkley’s marathon stand, however, won’t delay Gorsuch’s confirmation."}, {"30e8": "CREDIT: Screenshot, CSPAN"}, {"d289": "Senator Jeff Merkley (D-OR) stepped onto the Senate floor around 6:45 pm Tuesday night to begin a marathon speech in protest of President Donald Trump’s Supreme Court nominee. Fifteen and a half hours later, he left."}, {"3d6b": "“By stealing a Supreme Court seat for the first time in American history, the Senate is undermining the Court and the rule of law, and turning the highest court in the land into a political committee,” Merkley wrote on his Facebook page before taking the floor."}, {"cc86": "Merkley pledged on Twitter a few hours into his speech to keep talking “as long as I’m able.” His staff told an ABC reporter that he ran an Ironman Triathalon in November, and that “if anyone can keep going, he can.”"}, {"44ac": "But Merkley couldn’t keep talking forever, even if he had unlimited endurance. Senate Majority leader Mitch McConnell (R-KY) preemptively filed a motion to end debate, known as a cloture motion, before Merkley started talking. That motion starts a clock for votes on cloture, which is one of the few things that Senate rules allow to interrupt a marathon speech like Merkley’s."}, {"08bf": "That means that while Merkley could use his speech to draw attention and as a symbolic protest, he couldn’t actually delay the vote on Gorsuch’s confirmation (and it also means that, technically, his speech wasn’t a filibuster). The vote on cloture for Gorsuch’s confirmation is expected on Thursday, and a full vote is expected in the Senate before it breaks for two weeks for Easter on Friday."}, {"1b4b": "Senate Republicans are expected to use the so-called “nuclear option” — getting rid of the 60-vote nomination threshold — in order to get Gorsuch passed in the face of near-complete Democratic opposition. McConnell announced his intention to do so as Merkley took the floor."}, {"1fcb": "Merkley’s speech ranged widely over the night. He riffed on Republicans’ refusal to hold votes on President Barack Obama’s nominee Merrick Garland, as they argued there was historic precedence for holding off during an election year."}, {"192a": "“That is a phony, phony, incorrect, salacious, insert-your-own-adjective-there argument,” Merkley said, listing out the history of four times SCOTUS nominees have been confirmed in election years."}, {"6066": "Merkley also drew ammunition from breaking events outside the Capitol building. While he was on the floor, news broke that Gorsuch’s 2006 books contains passages that are strikingly similar to a 1984 article in the Indiana Law Journal."}, {"0835": "The White House dismissed the news, but several academics and experts told Politico that the similarities between the passages would almost certainly violate academic plagiarism rules. Just after midnight, Merkley was handed a copy of the Politico report and recited several of the allegedly plagiarized passages."}, {"c971": "Even later in the night, Merkley went on a riff about the dangers of money in politics and Citizens United, the Supreme Court decision that enabled private interests to pour “a flow of largely secret money concentrated in the hands of the megawealthy into campaigns,” as he put it."}, {"4af9": "“You can see this corrupting power by looking at the disappearance of the interests of my colleagues across the aisle in the environment,” he said. “It was Richard Nixon who created the Environmental Protection Agency and the Clean Air Act and the Clean Water Act. And many colleagues expressed a lot of interest in taking on one of the most diabolical sources of pollution — carbon dioxide. But that interest has completely disappeared since the fossil fuel industry has put billions of dollars into the Republican Senate Campaigns. Completely disappeared.”"}, {"61d1": "After listing off concrete examples of recent and impending environmental disasters linked to climate change — from the longer wildfire season in Oregon to coral bleaching caused by ocean acidification — Merkley circled back to money in politics corrupting the political response."}, {"d203": "“We are doing so little because the coal and oil billionaires have proceeded to invest so much money in third-party Senate campaigns to elect one side of the aisle and defeat the other side,” he said. “This fossil fuel cartel wants to make sure they have a court that continues this corruption, and that’s why they put so much pressure to have senators not consider Merrick Garland when he was nominated last year in 2016.”"}, {"b465": "Merkley yielded the floor at 10:15 am on Wednesday, after 15 and a half hours of speaking."}], "child": "1563_1\t1563_2\t1563_3\t1563_4"}