{"name": "1564", "parent": "", "content": "Federal appeals court holds workers can’t be fired for being gay Onward to the Supreme Court! CREDIT: AP Photo/Jacquelyn Martin With a lopsided majority joined by a bipartisan coalition of judges, the United States Court of Appeals for the Seventh Circuit held on Tuesday that discrimination on the basis of sexual orientation violates federal civil rights law, at least in the context of the workplace. The court telegraphed in an order last October that Hively v. Ivy Tech Community College was likely to be a victory for victims of discrimination in the workplace. The final vote in the case, however, is a bit more surprising. Eight of the Seventh Circuit’s judges joined Tuesday’s opinion, including Republican appointees Richard Posner, Joel Flaum, Frank Easterbrook, Ilana Rovner, and Kenneth Ripple. Only three judges dissented. The case involves Title VII of the Civil Rights Act of 1964, which prohibits discrimination on the basis of an employee’s “sex.” Though Title VII contains no explicit statement that discrimination on the basis of “sexual orientation” is prohibited, two crucial Supreme Court precedents inform Chief Judge Diane Wood’s majority opinion in Hively. The first is Price Waterhouse v. Hopkins, which established that Title VII’s ban on sex discrimination is violated when an employee faces discrimination due to gender stereotyping. Thus, in that case, a female accountant could allege illegal discrimination if she was denied a partnership because her superiors deemed her too masculine. (One partner told her to take “a course at charm school.” Another deemed her too “macho.”) One of the the core insights of Chief Judge Wood’s decision in Hively is that, because she is a lesbian, “Hively represents the ultimate case of failure to conform to the female stereotype.” Stereotypical women enter into romantic and sexual partnerships with men. Hively defies this stereotype by engaging in such relationships with women. So presuming that she must prefer relations with men is itself a form of gender stereotyping forbidden by Hopkins. Wood’s opinion also offers several other reasons why sexual orientation discrimination should be understood as a form of sex discrimination. Indeed, as Wood explains, this case is actually pretty straightforward. “Hively alleges that if she had been a man married to a woman (or living with a woman, or dating a woman) and everything else had stayed the same, Ivy Tech would not have refused to promote her and would not have fired her,” Wood writes. If this claim proves to be true, then it “describes paradigmatic sex discrimination.” In reaching this conclusion, Wood acknowledges that the lawmakers who drafted the Civil Rights Act of 1964 probably did not expect it to be used this way. But the conclusion that Title VII can be read more expansively than its drafters anticipated was embraced by Justice Antonin Scalia’s opinion for the Supreme Court in Oncale v. Sundowner Offshore Services. Like the Seventh Circuit’s decision? Thank this guy. CREDIT: AP Photo/Charles Rex Arbogast, File Oncale was a case of male-on-male sexual harassment, something that, as Scalia wrote, “was assuredly not the principal evil Congress was concerned with when it enacted Title VII.” But so what? As Scalia explained, “statutory prohibitions often go beyond the principal evil to cover reasonably comparable evils, and it is ultimately the provisions of our laws rather than the principal concerns of our legislators by which we are governed.” A prohibition on discrimination “because of . . . sex” was expansive enough to cover male-on-male sexual harassment in Oncale. And it is big enough to encompass discrimination on the basis of sexual orientation. So holds the Seventh Circuit in Hively. As Wood notes in her opinion, “for many years, the courts of appeals of this country understood the prohibition against sex discrimination to exclude discrimination on the basis of a person’s sexual orientation.” Hively is now an outlier, and the Supreme Court typically takes up cases where the federal appeals courts disagree. It is all but certain to take up this case. That means the fate of gay and bisexual workers is likely to rest with Justice Anthony Kennedy, a conservative who often provides the fifth vote in favor of gay rights. Whether Kennedy does so in this case remains to be seen — though the lopsided vote in Hively should be an encouraging sign for supporters of LGBT rights. ", "title": "Federal appeals court holds workers can’t be fired for being gay", "sentences": [{"cf33": "Federal appeals court holds workers can’t be fired for being gay"}, {"abcc": "Onward to the Supreme Court!"}, {"9756": "CREDIT: AP Photo/Jacquelyn Martin"}, {"1bfd": "With a lopsided majority joined by a bipartisan coalition of judges, the United States Court of Appeals for the Seventh Circuit held on Tuesday that discrimination on the basis of sexual orientation violates federal civil rights law, at least in the context of the workplace."}, {"a7c0": "The court telegraphed in an order last October that Hively v. Ivy Tech Community College was likely to be a victory for victims of discrimination in the workplace. The final vote in the case, however, is a bit more surprising."}, {"b259": "Eight of the Seventh Circuit’s judges joined Tuesday’s opinion, including Republican appointees Richard Posner, Joel Flaum, Frank Easterbrook, Ilana Rovner, and Kenneth Ripple. Only three judges dissented."}, {"e842": "The case involves Title VII of the Civil Rights Act of 1964, which prohibits discrimination on the basis of an employee’s “sex.” Though Title VII contains no explicit statement that discrimination on the basis of “sexual orientation” is prohibited, two crucial Supreme Court precedents inform Chief Judge Diane Wood’s majority opinion in Hively."}, {"d706": "The first is Price Waterhouse v. Hopkins, which established that Title VII’s ban on sex discrimination is violated when an employee faces discrimination due to gender stereotyping. Thus, in that case, a female accountant could allege illegal discrimination if she was denied a partnership because her superiors deemed her too masculine. (One partner told her to take “a course at charm school.” Another deemed her too “macho.”)"}, {"0ddc": "One of the the core insights of Chief Judge Wood’s decision in Hively is that, because she is a lesbian, “Hively represents the ultimate case of failure to conform to the female stereotype.” Stereotypical women enter into romantic and sexual partnerships with men. Hively defies this stereotype by engaging in such relationships with women. So presuming that she must prefer relations with men is itself a form of gender stereotyping forbidden by Hopkins."}, {"f959": "Wood’s opinion also offers several other reasons why sexual orientation discrimination should be understood as a form of sex discrimination. Indeed, as Wood explains, this case is actually pretty straightforward. “Hively alleges that if she had been a man married to a woman (or living with a woman, or dating a woman) and everything else had stayed the same, Ivy Tech would not have refused to promote her and would not have fired her,” Wood writes. If this claim proves to be true, then it “describes paradigmatic sex discrimination.”"}, {"4816": "In reaching this conclusion, Wood acknowledges that the lawmakers who drafted the Civil Rights Act of 1964 probably did not expect it to be used this way. But the conclusion that Title VII can be read more expansively than its drafters anticipated was embraced by Justice Antonin Scalia’s opinion for the Supreme Court in Oncale v. Sundowner Offshore Services."}, {"5e3d": "Like the Seventh Circuit’s decision? Thank this guy. CREDIT: AP Photo/Charles Rex Arbogast, File"}, {"b72a": "Oncale was a case of male-on-male sexual harassment, something that, as Scalia wrote, “was assuredly not the principal evil Congress was concerned with when it enacted Title VII.” But so what?"}, {"9da6": "As Scalia explained, “statutory prohibitions often go beyond the principal evil to cover reasonably comparable evils, and it is ultimately the provisions of our laws rather than the principal concerns of our legislators by which we are governed.”"}, {"f07f": "A prohibition on discrimination “because of . . . sex” was expansive enough to cover male-on-male sexual harassment in Oncale. And it is big enough to encompass discrimination on the basis of sexual orientation. So holds the Seventh Circuit in Hively."}, {"cd84": "As Wood notes in her opinion, “for many years, the courts of appeals of this country understood the prohibition against sex discrimination to exclude discrimination on the basis of a person’s sexual orientation.” Hively is now an outlier, and the Supreme Court typically takes up cases where the federal appeals courts disagree. It is all but certain to take up this case."}, {"dd84": "That means the fate of gay and bisexual workers is likely to rest with Justice Anthony Kennedy, a conservative who often provides the fifth vote in favor of gay rights. Whether Kennedy does so in this case remains to be seen — though the lopsided vote in Hively should be an encouraging sign for supporters of LGBT rights."}], "child": "1564_1\t1564_2\t1564_3"}