{"name": "1565", "parent": "", "content": "McConnell threatens to ‘break the rules to change the rules’ to confirm Gorsuch The Senate Majority Leader said as recently as January that the Senate rules cannot be changed without a supermajority. Chris Wallace interviewed Sen. Mitch McConnell (R-KY) on Sunday CREDIT: Fox News Sunday Senate Majority Leader Mitch McConnell (R-KY) said on Sunday that he would make sure that Donald Trump’s Supreme Court nominee is confirmed this week, even if he has to break Senate rules to do so. Asked by Fox News Sunday host Chris Wallace about whether he had the required votes to invoke cloture (ending debate) on the nomination of Neil Gorsuch to fill the seat he kept open for a year following the death of Antonin Scalia, McConnell said he was not sure, but that it didn’t matter. Though he would need the votes of at least eight Senate Democrats to achieve the required 60-vote threshold, McConnell suggested if he doesn’t get it, he will simply change the rule to make the requirement 51 votes — a procedure known as the “nuclear option.” “Look, what I’m telling you is Judge Gorsuch is gonna be confirmed. The way in which that occurs is in the hands of the Democratic minority,” McConnell explained. “It will end with his confirmation.” Wallace then played a clip of then-Minority Leader McConnell in November 2013, as the Democratic majority prepared to change the rules governing lower court confirmations that he had been obstructive by filibuster. An outraged McConnell had claimed that scrapping the 60-vote threshold — without a super-majority to support the change — meant they would “break the rules to change the rules.” Doing so, he warned, would make “advice and consent, in effect, mean nothing.” “Now you’re prepared to do the same thing — to break the rules to change the rules,” Wallace observed. McConnell ignored his previous position, telling Wallace that while he had been of course upset then, he’d decided not to change the rules back as majority leader because “this business of filibustering judges and cabinet appointments is a recent phenomenon.” He noted that even Justice Clarence Thomas, who had only 52 votes in his support, was not filibustered even though he was “the most controversial Supreme Court nomination in history.” Watch: McConnell, of course, is correct that the filibustering of nominations was not common in the past (though Republicans and southern Democrats filibustered Lyndon Johnson’s nomination of Justice Abe Fortas to be chief justice in 1968). But his yearning for the days of bipartisanship ring hollow. He was the reason for this change, using the filibuster rule to require 60-vote thresholds more than any other Senate minority leader in history and blocking several Obama nominations for judgeships. Moreover, it was McConnell who kept the seat of Justice Antonin Scalia open vacant for more than a full year — longer than any vacancy in American history — refusing to even allow a confirmation hearing for Judge Merrick Garland, President Obama’s nominee for the seat. While that 2013 rules change — which applied to all nominations except for Supreme Court confirmations — certainly sets a precedent, McConnell has yet to acknowledge that the process by which it was changed was legitimate. As recently as January of this year, McConnell told The Hill that the nuclear option was not permissible under Senate rules. “We’ve already adopted the rules for this Congress at the beginning of the year. Basically we didn’t adopt any because in the Senate rules are permanent, unlike the House which every two year adopts a new set of rules. We don’t,” he said at the time. “It takes 67 votes to change the rules in the Senate. We saw one rather conspicuous exception to that a few years ago but no we don’t have any current plans on the rules,” he added. Now, faced with the possibility that Democrats may vote against confirming Trump’s pick for the seat many still believe rightfully belongs to Garland, McConnell is willing to ignore his own beliefs about Senate rules in order to complete his 14-month long gambit to choose Scalia’s successor. UPDATE: With the announcement on Monday by Sen. Chris Coons (D-DE) that he plans be the 41st Democratic vote against cloture, it will now fall to McConnell and the Senate Republican caucus to see whether they indeed decide to “break the rules to change the rules.” ", "title": "McConnell threatens to ‘break the rules to change the rules’ to confirm Gorsuch", "sentences": [{"c050": "McConnell threatens to ‘break the rules to change the rules’ to confirm Gorsuch"}, {"0eba": "The Senate Majority Leader said as recently as January that the Senate rules cannot be changed without a supermajority."}, {"f044": "Chris Wallace interviewed Sen. Mitch McConnell (R-KY) on Sunday CREDIT: Fox News Sunday"}, {"a3bf": "Senate Majority Leader Mitch McConnell (R-KY) said on Sunday that he would make sure that Donald Trump’s Supreme Court nominee is confirmed this week, even if he has to break Senate rules to do so."}, {"1ea7": "Asked by Fox News Sunday host Chris Wallace about whether he had the required votes to invoke cloture (ending debate) on the nomination of Neil Gorsuch to fill the seat he kept open for a year following the death of Antonin Scalia, McConnell said he was not sure, but that it didn’t matter. Though he would need the votes of at least eight Senate Democrats to achieve the required 60-vote threshold, McConnell suggested if he doesn’t get it, he will simply change the rule to make the requirement 51 votes — a procedure known as the “nuclear option.”"}, {"698b": "“Look, what I’m telling you is Judge Gorsuch is gonna be confirmed. The way in which that occurs is in the hands of the Democratic minority,” McConnell explained. “It will end with his confirmation.”"}, {"3b49": "Wallace then played a clip of then-Minority Leader McConnell in November 2013, as the Democratic majority prepared to change the rules governing lower court confirmations that he had been obstructive by filibuster. An outraged McConnell had claimed that scrapping the 60-vote threshold — without a super-majority to support the change — meant they would “break the rules to change the rules.” Doing so, he warned, would make “advice and consent, in effect, mean nothing.”"}, {"5597": "“Now you’re prepared to do the same thing — to break the rules to change the rules,” Wallace observed."}, {"be5b": "McConnell ignored his previous position, telling Wallace that while he had been of course upset then, he’d decided not to change the rules back as majority leader because “this business of filibustering judges and cabinet appointments is a recent phenomenon.” He noted that even Justice Clarence Thomas, who had only 52 votes in his support, was not filibustered even though he was “the most controversial Supreme Court nomination in history.”"}, {"d4c0": "Watch:"}, {"2bf6": "McConnell, of course, is correct that the filibustering of nominations was not common in the past (though Republicans and southern Democrats filibustered Lyndon Johnson’s nomination of Justice Abe Fortas to be chief justice in 1968). But his yearning for the days of bipartisanship ring hollow. He was the reason for this change, using the filibuster rule to require 60-vote thresholds more than any other Senate minority leader in history and blocking several Obama nominations for judgeships."}, {"a554": "Moreover, it was McConnell who kept the seat of Justice Antonin Scalia open vacant for more than a full year — longer than any vacancy in American history — refusing to even allow a confirmation hearing for Judge Merrick Garland, President Obama’s nominee for the seat."}, {"219c": "While that 2013 rules change — which applied to all nominations except for Supreme Court confirmations — certainly sets a precedent, McConnell has yet to acknowledge that the process by which it was changed was legitimate."}, {"d666": "As recently as January of this year, McConnell told The Hill that the nuclear option was not permissible under Senate rules."}, {"3d9d": "“We’ve already adopted the rules for this Congress at the beginning of the year. Basically we didn’t adopt any because in the Senate rules are permanent, unlike the House which every two year adopts a new set of rules. We don’t,” he said at the time."}, {"f8a8": "“It takes 67 votes to change the rules in the Senate. We saw one rather conspicuous exception to that a few years ago but no we don’t have any current plans on the rules,” he added."}, {"9233": "Now, faced with the possibility that Democrats may vote against confirming Trump’s pick for the seat many still believe rightfully belongs to Garland, McConnell is willing to ignore his own beliefs about Senate rules in order to complete his 14-month long gambit to choose Scalia’s successor."}, {"2341": "UPDATE: With the announcement on Monday by Sen. Chris Coons (D-DE) that he plans be the 41st Democratic vote against cloture, it will now fall to McConnell and the Senate Republican caucus to see whether they indeed decide to “break the rules to change the rules.”"}], "child": "1565_1\t1565_2\t1565_3\t1565_4\t1565_5\t1565_6\t1565_7\t1565_8\t1565_9\t1565_10\t1565_11"}