{"name": "1566", "parent": "", "content": "John McCain calls out his party’s Supreme Court hypocrisy, then enables it “I think it’s a dark day in the history of the United States Senate.” Sen. John McCain on Tuesday criticized his GOP colleagues’ hypocrisy CREDIT: CNN’s New Day Lacking the 60 votes required for cloture, Senate Majority Leader Mitch McConnell (R-KY) plans to confirm Donald Trump’s Supreme Court nominee this week using a procedure that he himself once decried as breaking the rules to change the rules. While he can circumvent the 60-vote requirement with a simple majority, at least one member of his caucus is not on board with the maneuver. Though he said Monday that he would vote with McConnell for the move, Sen. John McCain (R-AZ) said Tuesday that his party is doing something terrible. Asked by CNN’s New Day Alisyn Camerota whether he was comfortable with his party’s plan to invoke the so-called “nuclear option.” He responded bluntly that he was not. “I think it’s a dark day in the history of the United States Senate,” he lamented, though he said he expects it is going to happen. “It’s interesting that Republicans were dead set against it when my former colleague Harry Reid invoked it with the judges, but now it seems to be okay.” The Arizona Republican then observed that lowering the threshold now will have long-term ramifications for the Senate. “If you can do this with 51 votes, what do you think the next nominee is going to be like? What do you think will happen when eventually Democrats are in majority in the senate? That’s doing to happen sooner rather than later. I hope later.” Watch: McCain’s past comments also starkly conflict with his willingness to vote for this now. In 2013, when Senate Democrats used the same process to change the threshold for lower court judges to 51 votes, he denounced it as a “breathtaking” breach of Senate rules, slamming then Majority Leader Harry Reid (D-NV) as “unwilling to accept the process.” After his party won back the majority in 2014, McCain said the 60 vote threshold should be absolutely restored, or else voters should “disregard every bit of complaint that we made, not only after they did it but also during the campaign.” And in 2015, he said it would be “sheer hypocrisy” for Republicans to keep the 51 vote rule. “We said this was outrageous what they did,” he said. “Not only how they did it, but what they did, OK? Some of my Republican colleagues seem to have forgotten that. Some selective amnesia.” But it’s hardly the first time McCain said one thing and did another. He was the deciding vote against the DISCLOSE Act in 2010, even while denouncing Citizens United as the Supreme Court’s “worst decision ever.” And after suggesting he in January that would only support Rex Tillerson’s nomination to be Secretary of State when “pigs fly,” he ended up voting for his confirmation a few weeks later. With a 52 vote majority and Vice President Mike Pence available to break any ties, McConnell can lose no more than two members of his caucus on any vote to change this rule (no Democrats are expected to go along with his gambit). McConnell has indicated that he will have the votes, promising that “Judge Gorsuch is gonna be confirmed” this week. ", "title": "John McCain calls out his party’s Supreme Court hypocrisy, then enables it", "sentences": [{"6efb": "John McCain calls out his party’s Supreme Court hypocrisy, then enables it"}, {"3c22": "“I think it’s a dark day in the history of the United States Senate.”"}, {"ef06": "Sen. John McCain on Tuesday criticized his GOP colleagues’ hypocrisy CREDIT: CNN’s New Day"}, {"6770": "Lacking the 60 votes required for cloture, Senate Majority Leader Mitch McConnell (R-KY) plans to confirm Donald Trump’s Supreme Court nominee this week using a procedure that he himself once decried as breaking the rules to change the rules. While he can circumvent the 60-vote requirement with a simple majority, at least one member of his caucus is not on board with the maneuver."}, {"91fc": "Though he said Monday that he would vote with McConnell for the move, Sen. John McCain (R-AZ) said Tuesday that his party is doing something terrible. Asked by CNN’s New Day Alisyn Camerota whether he was comfortable with his party’s plan to invoke the so-called “nuclear option.” He responded bluntly that he was not."}, {"a6fb": "“I think it’s a dark day in the history of the United States Senate,” he lamented, though he said he expects it is going to happen. “It’s interesting that Republicans were dead set against it when my former colleague Harry Reid invoked it with the judges, but now it seems to be okay.”"}, {"aa59": "The Arizona Republican then observed that lowering the threshold now will have long-term ramifications for the Senate. “If you can do this with 51 votes, what do you think the next nominee is going to be like? What do you think will happen when eventually Democrats are in majority in the senate? That’s doing to happen sooner rather than later. I hope later.”"}, {"a62d": "Watch:"}, {"1439": "McCain’s past comments also starkly conflict with his willingness to vote for this now. In 2013, when Senate Democrats used the same process to change the threshold for lower court judges to 51 votes, he denounced it as a “breathtaking” breach of Senate rules, slamming then Majority Leader Harry Reid (D-NV) as “unwilling to accept the process.” After his party won back the majority in 2014, McCain said the 60 vote threshold should be absolutely restored, or else voters should “disregard every bit of complaint that we made, not only after they did it but also during the campaign.” And in 2015, he said it would be “sheer hypocrisy” for Republicans to keep the 51 vote rule. “We said this was outrageous what they did,” he said. “Not only how they did it, but what they did, OK? Some of my Republican colleagues seem to have forgotten that. Some selective amnesia.”"}, {"9ef0": "But it’s hardly the first time McCain said one thing and did another. He was the deciding vote against the DISCLOSE Act in 2010, even while denouncing Citizens United as the Supreme Court’s “worst decision ever.” And after suggesting he in January that would only support Rex Tillerson’s nomination to be Secretary of State when “pigs fly,” he ended up voting for his confirmation a few weeks later."}, {"7387": "With a 52 vote majority and Vice President Mike Pence available to break any ties, McConnell can lose no more than two members of his caucus on any vote to change this rule (no Democrats are expected to go along with his gambit). McConnell has indicated that he will have the votes, promising that “Judge Gorsuch is gonna be confirmed” this week."}], "child": "1566_1\t1566_2\t1566_3\t1566_4\t1566_5\t1566_6\t1566_7\t1566_8\t1566_9\t1566_10"}