{"name": "1567", "parent": "", "content": "The 43 senators who plan to filibuster Gorsuch represent 53 percent of the country It must be nice to live in a real democracy. CREDIT: AP Photo/Susan Walsh At least 43 senators will attempt to block Judge Neil Gorsuch’s nomination to the Supreme Court this week. And while these senators make up only a fairly small minority of the Senate, they represent more than half of the nation. In sum, the 43 senators who announced that they will vote to sustain a filibuster against Judge Gorsuch represent 170,297,633 individuals. By contrast, the sum total of the 57 senators who either support Gorsuch, intend to vote to break the filibuster, or have not yet announced how they will vote on the Gorsuch confirmation represent only 152,148,715 people. The senators who opposed DeVos represent 36 million more people than her supporters doDemocracy!thinkprogress.org You can check our work here. We calculated these numbers using 2016 population estimates from the U.S. Census. In states where the two senators divide on Gorsuch, we assigned half of the state to the “For” camp and half to the “Against” camp. The reason why less than half of the nation controls 57 percent of the votes in the Senate is because the Senate is malapportioned such that every state has two senators regardless of how many people live there. California’s two senators, Democrats Dianne Feinstein and Kamala Harris, represent 39,250,017 people between the two of them. Both Feinstein and Harris plan to oppose Gorsuch. Meanwhile, Wyoming’s senators, Republicans Mike Enzi and John Barrasso, represent just 585,501 individuals. And yet Enzi and Barrasso’s votes for Gorsuch will count exactly as much as Feinstein and Harris’ votes against him. Indeed, Enzi and Barrasso have far fewer constituents than a member of the Los Angeles County Board of Supervisors — each member of that five-person board has about 2 million constituents. And yet Wyoming’s senators each get as many votes as a senator who represents all of Los Angeles plus all of the rest of California. Gorsuch was nominated to the Supreme Court by President Donald Trump, who won 2,864,974 fewer votes than his Democratic opponent, Hillary Clinton. ", "title": "The 43 senators who plan to filibuster Gorsuch represent 53 percent of the country", "sentences": [{"69b3": "The 43 senators who plan to filibuster Gorsuch represent 53 percent of the country"}, {"cbb9": "It must be nice to live in a real democracy."}, {"2feb": "CREDIT: AP Photo/Susan Walsh"}, {"20b9": "At least 43 senators will attempt to block Judge Neil Gorsuch’s nomination to the Supreme Court this week. And while these senators make up only a fairly small minority of the Senate, they represent more than half of the nation."}, {"dd50": "In sum, the 43 senators who announced that they will vote to sustain a filibuster against Judge Gorsuch represent 170,297,633 individuals. By contrast, the sum total of the 57 senators who either support Gorsuch, intend to vote to break the filibuster, or have not yet announced how they will vote on the Gorsuch confirmation represent only 152,148,715 people."}, {"4f8c": "The senators who opposed DeVos represent 36 million more people than her supporters doDemocracy!thinkprogress.org"}, {"55eb": "You can check our work here. We calculated these numbers using 2016 population estimates from the U.S. Census. In states where the two senators divide on Gorsuch, we assigned half of the state to the “For” camp and half to the “Against” camp."}, {"76b0": "The reason why less than half of the nation controls 57 percent of the votes in the Senate is because the Senate is malapportioned such that every state has two senators regardless of how many people live there."}, {"4581": "California’s two senators, Democrats Dianne Feinstein and Kamala Harris, represent 39,250,017 people between the two of them. Both Feinstein and Harris plan to oppose Gorsuch."}, {"1541": "Meanwhile, Wyoming’s senators, Republicans Mike Enzi and John Barrasso, represent just 585,501 individuals. And yet Enzi and Barrasso’s votes for Gorsuch will count exactly as much as Feinstein and Harris’ votes against him."}, {"c8ab": "Indeed, Enzi and Barrasso have far fewer constituents than a member of the Los Angeles County Board of Supervisors — each member of that five-person board has about 2 million constituents. And yet Wyoming’s senators each get as many votes as a senator who represents all of Los Angeles plus all of the rest of California."}, {"4fe5": "Gorsuch was nominated to the Supreme Court by President Donald Trump, who won 2,864,974 fewer votes than his Democratic opponent, Hillary Clinton."}], "child": "1567_1\t1567_2\t1567_3\t1567_4\t1567_5\t1567_6\t1567_7\t1567_8\t1567_9\t1567_10\t1567_11\t1567_12\t1567_13\t1567_14\t1567_15\t1567_16\t1567_17\t1567_18\t1567_19\t1567_20\t1567_21\t1567_22\t1567_23"}