{"name": "1568", "parent": "", "content": "The Judge Gorsuch who spoke in the Senate today is nothing like the man who wrote his opinions Will the real Neil Gorsuch please stand up? CREDIT: AP Photo/Susan Walsh The first day of a Supreme Court confirmation hearing is one of the least edifying affairs in Washington. Nominee Neil Gorsuch spoke for only a little over 15 minutes, and his prepared remarks spent nearly as much time on his pet goat and his black polyester robe as it did on his record as a judge. But Gorsuch did speak long enough to paint of picture of the kind of judge he wanted people watching his hearing to think that he is. Echoing Chief Justice John Roberts at Roberts’ own confirmation hearing, Gorsuch said that judges should occupy a “modest station.” He warned that “if judges were just secret legislators, declaring not what the law is but what they would like it to be, the very idea of a government by the people and for the people would be at risk.” And he listed four judicial heroes, two of whom — Justice Robert Jackson and, to a lesser extent, Justice Byron White — are judges who were typically much more worried about judicial overreach than they were about the judges weren’t doing enough. Indeed, Jackson was so concerned about judges who behave too much like secret legislators that, as I explain in my book Injustices: The Supreme Court’s History of Comforting the Comfortable and Afflicting the Afflicted, Jackson agonized over Brown v. Board of Education — fearing that it would be wrong for him to impose his own anti-racist views on the nation without sufficient constitutional sanction. (Though it should be noted that Jackson eventually did vote to end public school segregation.) Jackson was a political liberal and a Franklin Roosevelt appointee, but there is also a rich tradition of conservative judicial restraint stretching back to the Nixon administration. It’s just not a tradition Gorsuch has participated in very much as a judge. The opinions that define Gorsuch’s tenure as a judge are primarily cases where he pushed for the courts to do more to intervene in policy disputes. In Hobby Lobby, Gorsuch urged the courts to grant new rights to religious objectors who did not wish to provide birth control coverage to their employees. In Gutierrez-Brizuela v. Lynch, Gorsuch complained that a longstanding doctrine requiring courts to defer to federal agencies “seems more than a little difficult to square with the Constitution of the framers’ design.” In United States v. Nichols, Gorsuch hinted that he might impose aggressive new limits on agencies like the Environmental Protection Agency if given to opportunity to do so. Whatever you think of these opinions, it’s likely that Justice Jackson would be horrified by them. They are anathema to a tradition of judicial restraint, and much easier to square with the kind of judicial conservatism that became ascendant during the Obama administration — a conservatism that calls upon the courts to take a much more aggressive role in shutting down policies that conservatives find distasteful. So why is Gorsuch selling himself as Mr. Modesty when he has not behaved that way on the bench? One possibility is that he is simply being a cynic. That he knows that “judges are not ‘secret legislators’” is a message that will sell well to a panel of United States senators who are jealous of their own power, and that once he is confirmed he will be free to do whatever he wants. Well, maybe. But there’s also another explanation. In Praise Of Scaliathinkprogress.org Justice Antonin Scalia, the conservative icon Gorsuch hopes to replace, emerged onto the national scene as a powerful advocate for judicial restraint. “The main danger in judicial interpretation of the Constitution,” Scalia said in a famous 1988 lecture, is “that the judges will mistake their own predilections for the law.” And Scalia appeared to really believe this. Though a devout Catholic and a staunch social conservative, Scalia never embraced the constitutionally radical view that the Constitution prohibits abortion outright. “Whether you think prohibiting abortion is good or whether you think prohibiting abortion is bad,” he said in a 2012 interview, “regardless of how you come out on that, my only point is the Constitution does not say anything about it.” And Scalia continued to tout the virtues of restrained judging until soon before his death. “The law can recognize as marriage whatever sexual attachments and living arrangements it wishes,” he wrote in a dissenting opinion in Obergefell v. Hodges, the marriage equality decision. It just should be up to lawmakers and not courts to make this decision. Yet Scalia offered this paean to judicial restraint just one day after he handed down a different dissenting opinion seeking to gut Obamacare on a very dubious legal theory, and he wrote that opinion three years after he voted to repeal the Affordable Care Act in its entirety. One of Scalia’s last acts on Earth was potentially to doom the Earth — with a decision halting President Obama’s most aggressive effort to fight climate change. Now, again, Scalia may have been touting his own restraint even as he grew more and more activist because he was a cynic, but it is possible that Scalia simply had a blind spot — that he was able to see activism in judicial decisions that he hated but not in decisions that he joined. Motivated reasoning is a hell of a drug. Likewise, it is possible that Gorsuch really meant it when he wrote, in 2005, that an “overweening addiction to the courtroom as the place to debate social policy is bad for the country and bad for the judiciary.” And it is possible that Gorsuch believed it today when he complained about judges who behave as “secret legislators.” But, regardless of what Gorsuch believes, he is a physician who needs to heal himself. His own record is tough to square with the rhetoric he doled out today. ", "title": "The Judge Gorsuch who spoke in the Senate today is nothing like the man who wrote his opinions", "sentences": [{"7312": "The Judge Gorsuch who spoke in the Senate today is nothing like the man who wrote his opinions"}, {"4826": "Will the real Neil Gorsuch please stand up?"}, {"d8fe": "CREDIT: AP Photo/Susan Walsh"}, {"c27d": "The first day of a Supreme Court confirmation hearing is one of the least edifying affairs in Washington. Nominee Neil Gorsuch spoke for only a little over 15 minutes, and his prepared remarks spent nearly as much time on his pet goat and his black polyester robe as it did on his record as a judge."}, {"e35f": "But Gorsuch did speak long enough to paint of picture of the kind of judge he wanted people watching his hearing to think that he is. Echoing Chief Justice John Roberts at Roberts’ own confirmation hearing, Gorsuch said that judges should occupy a “modest station.” He warned that “if judges were just secret legislators, declaring not what the law is but what they would like it to be, the very idea of a government by the people and for the people would be at risk.” And he listed four judicial heroes, two of whom — Justice Robert Jackson and, to a lesser extent, Justice Byron White — are judges who were typically much more worried about judicial overreach than they were about the judges weren’t doing enough."}, {"7b34": "Indeed, Jackson was so concerned about judges who behave too much like secret legislators that, as I explain in my book Injustices: The Supreme Court’s History of Comforting the Comfortable and Afflicting the Afflicted, Jackson agonized over Brown v. Board of Education — fearing that it would be wrong for him to impose his own anti-racist views on the nation without sufficient constitutional sanction. (Though it should be noted that Jackson eventually did vote to end public school segregation.)"}, {"e32e": "Jackson was a political liberal and a Franklin Roosevelt appointee, but there is also a rich tradition of conservative judicial restraint stretching back to the Nixon administration. It’s just not a tradition Gorsuch has participated in very much as a judge."}, {"e688": "The opinions that define Gorsuch’s tenure as a judge are primarily cases where he pushed for the courts to do more to intervene in policy disputes. In Hobby Lobby, Gorsuch urged the courts to grant new rights to religious objectors who did not wish to provide birth control coverage to their employees. In Gutierrez-Brizuela v. Lynch, Gorsuch complained that a longstanding doctrine requiring courts to defer to federal agencies “seems more than a little difficult to square with the Constitution of the framers’ design.” In United States v. Nichols, Gorsuch hinted that he might impose aggressive new limits on agencies like the Environmental Protection Agency if given to opportunity to do so."}, {"3938": "Whatever you think of these opinions, it’s likely that Justice Jackson would be horrified by them. They are anathema to a tradition of judicial restraint, and much easier to square with the kind of judicial conservatism that became ascendant during the Obama administration — a conservatism that calls upon the courts to take a much more aggressive role in shutting down policies that conservatives find distasteful."}, {"9033": "So why is Gorsuch selling himself as Mr. Modesty when he has not behaved that way on the bench? One possibility is that he is simply being a cynic. That he knows that “judges are not ‘secret legislators’” is a message that will sell well to a panel of United States senators who are jealous of their own power, and that once he is confirmed he will be free to do whatever he wants."}, {"217a": "Well, maybe. But there’s also another explanation."}, {"68a7": "In Praise Of Scaliathinkprogress.org"}, {"232c": "Justice Antonin Scalia, the conservative icon Gorsuch hopes to replace, emerged onto the national scene as a powerful advocate for judicial restraint. “The main danger in judicial interpretation of the Constitution,” Scalia said in a famous 1988 lecture, is “that the judges will mistake their own predilections for the law.”"}, {"6ab3": "And Scalia appeared to really believe this. Though a devout Catholic and a staunch social conservative, Scalia never embraced the constitutionally radical view that the Constitution prohibits abortion outright. “Whether you think prohibiting abortion is good or whether you think prohibiting abortion is bad,” he said in a 2012 interview, “regardless of how you come out on that, my only point is the Constitution does not say anything about it.”"}, {"ff7d": "And Scalia continued to tout the virtues of restrained judging until soon before his death. “The law can recognize as marriage whatever sexual attachments and living arrangements it wishes,” he wrote in a dissenting opinion in Obergefell v. Hodges, the marriage equality decision. It just should be up to lawmakers and not courts to make this decision."}, {"6bf8": "Yet Scalia offered this paean to judicial restraint just one day after he handed down a different dissenting opinion seeking to gut Obamacare on a very dubious legal theory, and he wrote that opinion three years after he voted to repeal the Affordable Care Act in its entirety. One of Scalia’s last acts on Earth was potentially to doom the Earth — with a decision halting President Obama’s most aggressive effort to fight climate change."}, {"3fa5": "Now, again, Scalia may have been touting his own restraint even as he grew more and more activist because he was a cynic, but it is possible that Scalia simply had a blind spot — that he was able to see activism in judicial decisions that he hated but not in decisions that he joined. Motivated reasoning is a hell of a drug."}, {"e65b": "Likewise, it is possible that Gorsuch really meant it when he wrote, in 2005, that an “overweening addiction to the courtroom as the place to debate social policy is bad for the country and bad for the judiciary.” And it is possible that Gorsuch believed it today when he complained about judges who behave as “secret legislators.”"}, {"333e": "But, regardless of what Gorsuch believes, he is a physician who needs to heal himself. His own record is tough to square with the rhetoric he doled out today."}], "child": "1568_1\t1568_2\t1568_3\t1568_4\t1568_5\t1568_6"}