{"name": "1569", "parent": "", "content": "Democratic senator will introduce Trump’s SCOTUS nominee at his hearing. WTF. It’s time for some game theory. Sen. Michael Bennet. CREDIT: AP Photo/David Zalubowski The Senate Judiciary Committee announced this week that Sen. Michael Bennet, a Democrat from Colorado, will give a gift to anyone who decides to challenge him in his next primary election. Bennet is one of three people who will introduce Trump Supreme Court nominee Judge Neil Gorsuch, at Gorsuch’s hearing on Monday. Gorsuch’s record suggests that he is to the right of the late conservative icon Justice Antonin Scalia, and possibly as far right as the most conservative member of the Supreme Court, Justice Clarence Thomas. As a judge, Gorsuch voted to limit women’s access to birth control in the Hobby Lobby case. He tried to cut off funding for Planned Parenthood in Utah. And he is likely to provide the key fifth vote to uphold voter suppression laws that skew the electorate to the right and help keep Democrats like Michael Bennet from winning elections. Last month, dozens of lawyers with clients who would benefit from a conservative Supreme Court signed a letter urging Bennet to support Gorsuch. According to the campaign donations tracking website Open Secrets, the legal industry contributed more than any sector other than “Securities and Investments” to Bennet’s campaigns from 2011–2016. The Denver Post adds that the letter was signed by “Norm Brownstein and Steve Farber, two giants in Colorado’s legal and political world.” Brownstein donated $10,000 to Bennet, according to Open Secrets, though he’s also made significant donations to Republicans. Farber, meanwhile, gave $5,500 to Bennet. In response to an inquiry from ThinkProgress regarding Bennet’s decision to introduce Gorsuch, Bennet’s press secretary Laurie Cipriano wrote that “it is tradition for senators to introduce nominees from their home state,” and that Bennet “has not taken a position on Gorsuch, nor will he take a position during the introduction.” A handful of prominent non-elected Democrats have urged Democratic senators to preemptively surrender to Trump and his nominee as an effort to deescalate the judicial confirmation wars. In a Washington Post op-ed last week, for example, former federal judge James Robertson, who worked to defeat the Supreme Court nomination of Judge Robert Bork in 1987, wrote that “we have politicized the judicial confirmation process far beyond historical norms and undermined public confidence in the judiciary.” And that “it’s time for a truce.” Well, maybe, but let’s game this out. Writing in the Pacific Standard, political scientist Seth Masket compares Supreme Court confirmations to a prisoner’s dilemma. The classic prisoner’s dilemma works something like this: two men are arrested, held in separate cells, and are told to confess to a crime. If they both refuse, they will get off with a fairly minor sentence (maybe half a year in jail). If both men confess they each receive a harsher sentence (two years). But if one man confesses and the other remains quiet, the confessor gets off scot-free while the other man receives a draconian sentence (10 years). The best possible outcome — the one that leads both men spending the least total amount of time in jail — is for both men to cooperate with each other and serve their brief six months in jail. But the only way for each man to avoid the worst possible outcome for himself is to not cooperate with the other man — that is, to confess. Judicial confirmations work the same way. In the best of all worlds, Democrats would confirm well-qualified, ideologically reasonable Republican nominees, and Republicans would do to the same for Democrats. But we do not live in that world. Just ask Merrick Garland. Democrats, in other words, are in the same position as the prisoner who knows that his partner-in-crime will rat him out. If they do not resist Republican nominees — and certainly if they do not resist ideologically extreme nominees like Gorsuch — they will be like the prisoner who sits in jail for a decade while his faithless partner enjoys sweet freedom. Republicans will continue to treat future nominees just like they treated Garland, and they will know they can get away with it because Democrats will do nothing to them in return. ", "title": "Democratic senator will introduce Trump’s SCOTUS nominee at his hearing. WTF.", "sentences": [{"bc95": "Democratic senator will introduce Trump’s SCOTUS nominee at his hearing. WTF."}, {"181a": "It’s time for some game theory."}, {"58d5": "Sen. Michael Bennet. CREDIT: AP Photo/David Zalubowski"}, {"788c": "The Senate Judiciary Committee announced this week that Sen. Michael Bennet, a Democrat from Colorado, will give a gift to anyone who decides to challenge him in his next primary election."}, {"a289": "Bennet is one of three people who will introduce Trump Supreme Court nominee Judge Neil Gorsuch, at Gorsuch’s hearing on Monday."}, {"a54e": "Gorsuch’s record suggests that he is to the right of the late conservative icon Justice Antonin Scalia, and possibly as far right as the most conservative member of the Supreme Court, Justice Clarence Thomas. As a judge, Gorsuch voted to limit women’s access to birth control in the Hobby Lobby case. He tried to cut off funding for Planned Parenthood in Utah. And he is likely to provide the key fifth vote to uphold voter suppression laws that skew the electorate to the right and help keep Democrats like Michael Bennet from winning elections."}, {"49b0": "Last month, dozens of lawyers with clients who would benefit from a conservative Supreme Court signed a letter urging Bennet to support Gorsuch."}, {"f6ad": "According to the campaign donations tracking website Open Secrets, the legal industry contributed more than any sector other than “Securities and Investments” to Bennet’s campaigns from 2011–2016. The Denver Post adds that the letter was signed by “Norm Brownstein and Steve Farber, two giants in Colorado’s legal and political world.” Brownstein donated $10,000 to Bennet, according to Open Secrets, though he’s also made significant donations to Republicans. Farber, meanwhile, gave $5,500 to Bennet."}, {"5e7a": "In response to an inquiry from ThinkProgress regarding Bennet’s decision to introduce Gorsuch, Bennet’s press secretary Laurie Cipriano wrote that “it is tradition for senators to introduce nominees from their home state,” and that Bennet “has not taken a position on Gorsuch, nor will he take a position during the introduction.”"}, {"566d": "A handful of prominent non-elected Democrats have urged Democratic senators to preemptively surrender to Trump and his nominee as an effort to deescalate the judicial confirmation wars. In a Washington Post op-ed last week, for example, former federal judge James Robertson, who worked to defeat the Supreme Court nomination of Judge Robert Bork in 1987, wrote that “we have politicized the judicial confirmation process far beyond historical norms and undermined public confidence in the judiciary.” And that “it’s time for a truce.”"}, {"8d44": "Well, maybe, but let’s game this out. Writing in the Pacific Standard, political scientist Seth Masket compares Supreme Court confirmations to a prisoner’s dilemma."}, {"eb7a": "The classic prisoner’s dilemma works something like this: two men are arrested, held in separate cells, and are told to confess to a crime. If they both refuse, they will get off with a fairly minor sentence (maybe half a year in jail). If both men confess they each receive a harsher sentence (two years). But if one man confesses and the other remains quiet, the confessor gets off scot-free while the other man receives a draconian sentence (10 years)."}, {"934b": "The best possible outcome — the one that leads both men spending the least total amount of time in jail — is for both men to cooperate with each other and serve their brief six months in jail. But the only way for each man to avoid the worst possible outcome for himself is to not cooperate with the other man — that is, to confess."}, {"2b0f": "Judicial confirmations work the same way. In the best of all worlds, Democrats would confirm well-qualified, ideologically reasonable Republican nominees, and Republicans would do to the same for Democrats. But we do not live in that world. Just ask Merrick Garland."}, {"cc66": "Democrats, in other words, are in the same position as the prisoner who knows that his partner-in-crime will rat him out. If they do not resist Republican nominees — and certainly if they do not resist ideologically extreme nominees like Gorsuch — they will be like the prisoner who sits in jail for a decade while his faithless partner enjoys sweet freedom."}, {"61c8": "Republicans will continue to treat future nominees just like they treated Garland, and they will know they can get away with it because Democrats will do nothing to them in return."}], "child": "1569_1\t1569_2\t1569_3\t1569_4\t1569_5\t1569_6\t1569_7\t1569_8\t1569_9\t1569_10\t1569_11\t1569_12\t1569_13\t1569_14\t1569_15\t1569_16\t1569_17\t1569_18\t1569_19\t1569_20\t1569_21\t1569_22\t1569_23"}