{"name": "1570", "parent": "", "content": "Republicans suspend rules, advance Pruitt to floor vote without a single Democrat It’s a new tactic for getting Trump’s controversial picks out of committee. CREDIT: AP Photo/J. Scott Applewhite For the second day in a row, all Democratic lawmakers on the Senate’s Environment and Public Works Committee boycotted a vote to send President Donald Trump’s controversial pick for EPA administrator, Oklahoma Attorney General Scott Pruitt, to the Senate floor for a full confirmation vote. This time, Republicans did it without them, with Committee Chairman Sen. John Barrasso (R-WY) suspending committee rules that require at least one Democrat to be present for a panel vote to send a nomination through to the Senate floor. Pruitt was then voted through committee by a vote of 11–0. “Yesterday the minority members of the committee chose to boycott this meeting,” Barrasso said. “It is disappointing that they chose that method, but we will not allow it to obstruct.” Trump to tap vocal EPA opponent to head the EPARIP, EPA.thinkprogress.org Barrasso argued that Pruitt had “sat through the longest EPA nomination hearing in history and answered the most questions.” He also argued that it was “unprecedented” for a minority to boycott for an incoming president’s EPA nominee. After President Barack Obama was re-elected in 2012, Republicans on the Senate Environment and Public Works Committee boycotted a confirmation meeting for then-EPA administrator nominee Gina McCarthy, arguing that McCarthy had failed to adequately answer the more than 1,000 questions Republican senators submitted in writing. Obama nominated McCarthy in March of 2013; she wasn’t confirmed as EPA administrator until July of that year. Democrats used a similar line of reasoning in defending their boycott of Pruitt, arguing that Pruitt had failed to adequately answer questions both during the confirmation hearing and submitted later in writing. “EPA nominee Scott Pruitt failed to answer important questions about his ties to industry,” Sen. Jeff Merkley (D-OR) said in a statement on Wednesday. “If he cannot answer the multitude of questions we’ve asked about his record and views, neither we nor the American people can have confidence that Pruitt is working to keep air and water clean, rather than protecting the profits of polluters.” Barrasso called the move “political theater.” “The nation needs a new EPA administrator,” Barrasso said. Scott Pruitt’s record reveals a long history of industry favoritismAs Oklahoma’s Attorney General, Pruitt has a history of slowing environmental regulation, cutting enforcement, and…thinkprogress.org Pruitt’s nomination will now go to the full Senate for confirmation. It’s likely Pruitt will be confirmed — he only needs 50 votes, as Vice President Mike Pence serves as the tie-breaking vote, and at least one Democratic senator, Sen. Joe Manchin (D-WV), has indicted that he will vote to confirm Pruitt. Environmental groups immediately voiced their concern over the vote to move Pruitt through committee, citing his history of suing the EPA, his ties to the fossil fuel industry, and his climate denial. “The Trump administration has let the fossil fuel industry hijack the EPA in broad daylight,” 350.org Executive Director Mary Boeve said in a statement. “It’s despicable but not surprising that members of Trump’s party want a climate denier running the EPA. Pruitt built his career trying to tear the EPA apart, sowing doubt about climate change along the way.” The move to suspend committee rules is unusual, though as of Wednesday, no longer unprecedented. Sen. Orrin Hatch (R-UT), Chairman of the Senate Finance Committee, employed an similar tactic to send the nominations of Steve Mnuchin, nominated for Treasury Secretary, and Rep. Tom Price (R-GA), nominated for Secretary of Health and Human Services, through to the Senate floor despite a Democratic boycott of the vote. ", "title": "Republicans suspend rules, advance Pruitt to floor vote without a single Democrat", "sentences": [{"8320": "Republicans suspend rules, advance Pruitt to floor vote without a single Democrat"}, {"1836": "It’s a new tactic for getting Trump’s controversial picks out of committee."}, {"1017": "CREDIT: AP Photo/J. Scott Applewhite"}, {"ef76": "For the second day in a row, all Democratic lawmakers on the Senate’s Environment and Public Works Committee boycotted a vote to send President Donald Trump’s controversial pick for EPA administrator, Oklahoma Attorney General Scott Pruitt, to the Senate floor for a full confirmation vote."}, {"537b": "This time, Republicans did it without them, with Committee Chairman Sen. John Barrasso (R-WY) suspending committee rules that require at least one Democrat to be present for a panel vote to send a nomination through to the Senate floor. Pruitt was then voted through committee by a vote of 11–0."}, {"044a": "“Yesterday the minority members of the committee chose to boycott this meeting,” Barrasso said. “It is disappointing that they chose that method, but we will not allow it to obstruct.”"}, {"5d84": "Trump to tap vocal EPA opponent to head the EPARIP, EPA.thinkprogress.org"}, {"e27b": "Barrasso argued that Pruitt had “sat through the longest EPA nomination hearing in history and answered the most questions.” He also argued that it was “unprecedented” for a minority to boycott for an incoming president’s EPA nominee."}, {"8af1": "After President Barack Obama was re-elected in 2012, Republicans on the Senate Environment and Public Works Committee boycotted a confirmation meeting for then-EPA administrator nominee Gina McCarthy, arguing that McCarthy had failed to adequately answer the more than 1,000 questions Republican senators submitted in writing. Obama nominated McCarthy in March of 2013; she wasn’t confirmed as EPA administrator until July of that year."}, {"7509": "Democrats used a similar line of reasoning in defending their boycott of Pruitt, arguing that Pruitt had failed to adequately answer questions both during the confirmation hearing and submitted later in writing."}, {"aece": "“EPA nominee Scott Pruitt failed to answer important questions about his ties to industry,” Sen. Jeff Merkley (D-OR) said in a statement on Wednesday. “If he cannot answer the multitude of questions we’ve asked about his record and views, neither we nor the American people can have confidence that Pruitt is working to keep air and water clean, rather than protecting the profits of polluters.”"}, {"0273": "Barrasso called the move “political theater.”"}, {"5401": "“The nation needs a new EPA administrator,” Barrasso said."}, {"90e9": "Scott Pruitt’s record reveals a long history of industry favoritismAs Oklahoma’s Attorney General, Pruitt has a history of slowing environmental regulation, cutting enforcement, and…thinkprogress.org"}, {"3591": "Pruitt’s nomination will now go to the full Senate for confirmation. It’s likely Pruitt will be confirmed — he only needs 50 votes, as Vice President Mike Pence serves as the tie-breaking vote, and at least one Democratic senator, Sen. Joe Manchin (D-WV), has indicted that he will vote to confirm Pruitt."}, {"c9c6": "Environmental groups immediately voiced their concern over the vote to move Pruitt through committee, citing his history of suing the EPA, his ties to the fossil fuel industry, and his climate denial."}, {"3d61": "“The Trump administration has let the fossil fuel industry hijack the EPA in broad daylight,” 350.org Executive Director Mary Boeve said in a statement. “It’s despicable but not surprising that members of Trump’s party want a climate denier running the EPA. Pruitt built his career trying to tear the EPA apart, sowing doubt about climate change along the way.”"}, {"d615": "The move to suspend committee rules is unusual, though as of Wednesday, no longer unprecedented. Sen. Orrin Hatch (R-UT), Chairman of the Senate Finance Committee, employed an similar tactic to send the nominations of Steve Mnuchin, nominated for Treasury Secretary, and Rep. Tom Price (R-GA), nominated for Secretary of Health and Human Services, through to the Senate floor despite a Democratic boycott of the vote."}], "child": "1570_1\t1570_2\t1570_3\t1570_4\t1570_5\t1570_6\t1570_7\t1570_8\t1570_9\t1570_10\t1570_11\t1570_12\t1570_13\t1570_14"}