{"name": "1571", "parent": "", "content": "It All Comes Down to Marco Rubio: He Has the Power to Nix Tillerson’s Nomination For a U.S. President to unsuccessfully nominate a candidate for Secretary of State would be unprecedented, and the momentous decision seems to rest squarely on the shoulders of the junior Senator from Florida. (Joe Raedle/Getty Images, Joshua Roberts/Reuters) In the history of the U.S. Senate, it has only used its ‘advice and consent’ power to reject a total of twenty-two nominations for cabinet secretaries, a relatively small number considering how many they ultimately consented to. Of those twenty-two, nine were voted down after being nominated and thirteen were withdrawn by the President once it became apparent they no longer had the necessary votes to make it through the Senate. Of the nine who were voted down there were three Attorney General nominees, two Treasury Secretary nominees, and one each of would-be Navy, War, Defense, and Commerce Secretaries. Among their unrealized policy ideas were plans to dismantle the second federal bank, assign Northerners in the Navy to Southern posts and Southerners to Northern posts, and some controversy arose when President Clinton had to balk on two nominees in a row who each would have been the first female Attorney General because they had both hired undocumented immigrants to watch their kids — the infamous Nannygate scandal. Regardless of which past nominees for other positions were either voted down or withdrawn for various reasons, the fact remains that in the 227 years of the office’s existence no nominee for Secretary of State has ever been unsuccessful so far. While still unlikely to be broken, that streak has a much higher than average chance of coming to an end under the administration of the 45th President. Trump’s nominee, former ExxonMobil CEO Rex Tillerson, faced intense questioning during his initial confirmation hearings in the Senate’s foreign relations committee. Senator Rubio pressed the former Boy Scouts of America President on how he viewed Russia, asking Tillerson numerous pointed questions about whether he would acknowledge Putin’s extrajudicial killings of journalists in Russia and war crimes in Syria, as well as Ukraine. While he may have stopped short of calling Putin a war criminal, Tillerson walked a fine line as he tried to speak firmly about Russia without committing too much to any specifics or creating too much daylight between his positions and the President Elect’s. One interesting statement made by Tillerson during the hearings was that he had yet to discuss details of Russia policy with Trump. This was a curious revelation which seems to beg questions about how thorough the President-elect’s selection process for Secretary of State was and what policy shifts will occur, considering how neither one of the two men has been particularly clear in public about what changes they’d like to make to our tenuous relationship with Russia. What is clear is how much the company Tillerson spent forty-five years with stands to gain should the sanctions applied to Russia in 2014 as a punitive measure for annexing Crimea be repealed. The following chart shows where Exxon’s untapped potential oil lies around the world: Wall Street Journal Obviously the vast majority of their resources are in Russia —where sanctions applied in 2014 killed the deal that Tillerson had negotiated in 2013 with Putin’s former KGB buddy Igor Sechin between Exxon and Russia’s state owned oil company, Rosneft. That’s why even though the vast majority of their resources are in Russia, it only represented a minuscule fraction of their overall drilling in 2015 — denying them their largest potential return on investment. Wall Street Journal It was clear that Rubio didn’t seem to have any of his concerns assuaged after the questioning, the color draining from his face as he walked down a hallway and the gravity of the situation seemed to dawn on him. A swarm of cameras descended on the former candidate for the Republican nomination who asserted with a shaky voice that “I’m prepared to do what’s right.” With Republicans only holding a one-seat majority in the Senate foreign relations committee, a single GOP defector coupled with unanimous Democratic opposition to Tillerson could kill his nomination in committee without a full floor vote ever taking place. While there are two other Republicans, John McCain and Linsday Graham who have publicly expressed their concerns about Tillerson, neither sits on the foreign relations committee so they would still need a third Republican to join them if they stand a chance of defeating Tillerson in a floor vote. So it all comes down to Rubio, who picked up a couple hundred thousand more votes in Florida reclaiming his Senate seat than Trump did securing its twenty-nine electoral votes on his way to the Presidency. The level of lobbying he must be subjected to at this moment must be inhumane, and the pressure can only build for so long — eventually Rubio will have to ‘do what’s right’. ", "title": "It All Comes Down to Marco Rubio: He Has the Power to Nix Tillerson’s Nomination", "sentences": [{"2b98": "It All Comes Down to Marco Rubio: He Has the Power to Nix Tillerson’s Nomination"}, {"59eb": "For a U.S. President to unsuccessfully nominate a candidate for Secretary of State would be unprecedented, and the momentous decision seems to rest squarely on the shoulders of the junior Senator from Florida."}, {"5611": "(Joe Raedle/Getty Images, Joshua Roberts/Reuters)"}, {"0c38": "In the history of the U.S. Senate, it has only used its ‘advice and consent’ power to reject a total of twenty-two nominations for cabinet secretaries, a relatively small number considering how many they ultimately consented to. Of those twenty-two, nine were voted down after being nominated and thirteen were withdrawn by the President once it became apparent they no longer had the necessary votes to make it through the Senate."}, {"c6ab": "Of the nine who were voted down there were three Attorney General nominees, two Treasury Secretary nominees, and one each of would-be Navy, War, Defense, and Commerce Secretaries. Among their unrealized policy ideas were plans to dismantle the second federal bank, assign Northerners in the Navy to Southern posts and Southerners to Northern posts, and some controversy arose when President Clinton had to balk on two nominees in a row who each would have been the first female Attorney General because they had both hired undocumented immigrants to watch their kids — the infamous Nannygate scandal."}, {"67ba": "Regardless of which past nominees for other positions were either voted down or withdrawn for various reasons, the fact remains that in the 227 years of the office’s existence no nominee for Secretary of State has ever been unsuccessful so far. While still unlikely to be broken, that streak has a much higher than average chance of coming to an end under the administration of the 45th President. Trump’s nominee, former ExxonMobil CEO Rex Tillerson, faced intense questioning during his initial confirmation hearings in the Senate’s foreign relations committee. Senator Rubio pressed the former Boy Scouts of America President on how he viewed Russia, asking Tillerson numerous pointed questions about whether he would acknowledge Putin’s extrajudicial killings of journalists in Russia and war crimes in Syria, as well as Ukraine."}, {"5fed": "While he may have stopped short of calling Putin a war criminal, Tillerson walked a fine line as he tried to speak firmly about Russia without committing too much to any specifics or creating too much daylight between his positions and the President Elect’s. One interesting statement made by Tillerson during the hearings was that he had yet to discuss details of Russia policy with Trump. This was a curious revelation which seems to beg questions about how thorough the President-elect’s selection process for Secretary of State was and what policy shifts will occur, considering how neither one of the two men has been particularly clear in public about what changes they’d like to make to our tenuous relationship with Russia. What is clear is how much the company Tillerson spent forty-five years with stands to gain should the sanctions applied to Russia in 2014 as a punitive measure for annexing Crimea be repealed. The following chart shows where Exxon’s untapped potential oil lies around the world:"}, {"f07a": "Wall Street Journal"}, {"648d": "Obviously the vast majority of their resources are in Russia —where sanctions applied in 2014 killed the deal that Tillerson had negotiated in 2013 with Putin’s former KGB buddy Igor Sechin between Exxon and Russia’s state owned oil company, Rosneft. That’s why even though the vast majority of their resources are in Russia, it only represented a minuscule fraction of their overall drilling in 2015 — denying them their largest potential return on investment."}, {"5c36": "Wall Street Journal"}, {"2a39": "It was clear that Rubio didn’t seem to have any of his concerns assuaged after the questioning, the color draining from his face as he walked down a hallway and the gravity of the situation seemed to dawn on him. A swarm of cameras descended on the former candidate for the Republican nomination who asserted with a shaky voice that “I’m prepared to do what’s right.” With Republicans only holding a one-seat majority in the Senate foreign relations committee, a single GOP defector coupled with unanimous Democratic opposition to Tillerson could kill his nomination in committee without a full floor vote ever taking place."}, {"5bb0": "While there are two other Republicans, John McCain and Linsday Graham who have publicly expressed their concerns about Tillerson, neither sits on the foreign relations committee so they would still need a third Republican to join them if they stand a chance of defeating Tillerson in a floor vote. So it all comes down to Rubio, who picked up a couple hundred thousand more votes in Florida reclaiming his Senate seat than Trump did securing its twenty-nine electoral votes on his way to the Presidency. The level of lobbying he must be subjected to at this moment must be inhumane, and the pressure can only build for so long — eventually Rubio will have to ‘do what’s right’."}], "child": "1571_1"}