{"name": "1573", "parent": "", "content": "Why Sen. Elizabeth Warren Was ‘Silenced’ A former Senate staffer explains why Sen. Elizabeth Warren was really ‘Silenced.’ Hint, it’s not what you think. The partisan outrage mill was restocked with fresh grist on Tuesday night when Senators invoked a century-old rule to rebuke Massachusetts Sen. Elizabeth Warren for remarks disparaging another Senator. For most people, it likely appeared to be politics as usual. Why should she be “silenced”? The backlash in the media has been swift, fierce, and almost universally wrong. The indignant reaction misunderstands the unique customs and traditions of the United States Senate. Over at RoughlyExplained.com, we asked a long-time former Senate staffer to explain why… Senator Elizabeth Warren speaks on the Senate Floor 2/7/16 Let me state at the outset that I do not know anything about this particular incident. I do not know what led to one Senator invoking Senate Rule XIX , and I do not know what caused the other Senator to continue after being advised of the violation. I’m writing only to share my relevant experiences as a long-time Senate staffer, by way of illuminating what this is all about. A Unique Institution I love the Senate. It’s out of fashion to speak highly of any governmental institution these days, but so be it: it’s far from the only way I’m unfashionable. I believe it an important, vital institution, with much to teach us. It’s not a strictly majoritarian body. Individual Senators have significant power to gum things up, and this forces Senators to deal with each other with a certain amount of mutual respect. Not every legislative body around the world works this way. Daniel Webster Addresses the U.S. Senate 1850. Credit: U.S. Senate Collection The Senate also has certain rules of decorum. When you debate in the Senate, you don’t address other Senators directly. This means you don’t say “you” when referring to another Senator in debate — you address your remarks to the presiding officer, and you generally refer to a colleague as “the Senator from (Name of State)” rather than using his or her name. This helps to keep the focus on issues rather than on personal disputes. The Senate observes other rules that are not only important in the context of the Senate, but which impressed me so much while working there that I have tried to import them into my personal conduct. You are not permitted to impugn another Senator or to characterize their motives. “NO SENATOR IN DEBATE SHALL, DIRECTLY OR INDIRECTLY, BY ANY FORM OF WORDS IMPUTE TO ANOTHER SENATOR OR TO OTHER SENATORS ANY CONDUCT OR MOTIVE UNWORTHY OR UNBECOMING A SENATOR.” — U.S. SENATE RULE XIX This, frankly, is great advice for everyone. So many debates we have would be more constructive if we would all agree to refrain from doing these things. None of us can ever really know another’s motives, so when we attribute someone else’s view to a nefarious motive, we’re usually ducking the issue in question to seek undeserved advantage. One reason the tenor of Senate debate doesn’t descend into the muck and mire associated with social media exchanges is precisely because of rules like Rule XIX against such tactics. It is rare for rule XIX to be formally invoked. It is not so rare for Senators to be cautioned about it. I have one recollection of an instance, which may be inaccurate in some respects, involving Senator Al Simpson in 1992, where the rule came up. Then-Senator Al Gore, running for Vice President at the time, had been taking what Senator Simpson viewed as very cheap shots out on the campaign trail at his friend President Bush. (Note, the Senate rules don’t prevent a Senator from saying whatever he wants outside of the Senate). Senator Simpson got a bellyful and went to the Senate floor to give a speech in which he complained about several things Senator Gore had done. During the speech I believe it was Senator Pryor who came in, and looking very concerned, asked for time and reminded Senator Simpson of rule XIX and how it forbade him to impugn Senator Gore’s motives or character. Senator Simpson took the point and stopped. I don’t recall whether any of his words were excised from the record. This, in my experience, is how it typically works. A Senator crosses the line by saying something that disparages another Senator’s character. They are then reminded of the existence of the rule, and typically will be apologetic and withdraw the remarks. I do not know why that did not happen in this case. I will say this: it saddens me greatly to read a lot of the commentary I’ve read over the last 24 hours. I’ve read not one but two ridiculous, childish pieces respectively in the online editions of the Washington Post and the New York Times that sought to make a gender-conflict issue out of the fact that the Senator who invoked the rule was male, while the Senator who proceeded in spite of it was female. Anyone who cares about the Senate must find this framing destructive and outrageous in the extreme. There are no gender specifications in Rule XIX. Every Senator is required to abide by it, and the sex of the Senator who invokes it is irrelevant. We can’t start carving out gender exceptions to the basic rules of Senate decorum to settle some perceived longstanding score about the politics of cross-gender communication. THE SENATE RULES OF COMPORTMENT ARE NOT ABOUT POLITICAL POSITIONING. THEY ARE ABOUT PRESERVING RESPECTFUL DEBATE. I’ve been equally frustrated by the speculations about the supposed strategy behind what one Senator or the other did. The Senate rules of comportment are not about political positioning. They are about preserving respectful debate. It shouldn’t matter who gains or loses politically from a violation or invocation of the rules. View of the Senate of the United States in Session. By J. Rodgers. 1850 ca. Credit: U.S. Senate Collection I realize mine is a lonely voice in a social media environment that seeks to construct political advantage out of anything and everything. But as someone who worked in the Senate a long time, I can tell you that the Senate rules of decorum are important, it’s good that they exist, and all Senators should respect them. This article originally published at: RoughlyExplained.com Follow on Twitter: @roughlyexplain Like us on Facebook: https://www.facebook.com/RoughlyExplained ", "title": "Why Sen. Elizabeth Warren Was ‘Silenced’", "sentences": [{"8bd3": "Why Sen. Elizabeth Warren Was ‘Silenced’"}, {"96ea": "A former Senate staffer explains why Sen. Elizabeth Warren was really ‘Silenced.’ Hint, it’s not what you think."}, {"92d0": "The partisan outrage mill was restocked with fresh grist on Tuesday night when Senators invoked a century-old rule to rebuke Massachusetts Sen. Elizabeth Warren for remarks disparaging another Senator. For most people, it likely appeared to be politics as usual. Why should she be “silenced”? The backlash in the media has been swift, fierce, and almost universally wrong. The indignant reaction misunderstands the unique customs and traditions of the United States Senate. Over at RoughlyExplained.com, we asked a long-time former Senate staffer to explain why…"}, {"5d98": "Senator Elizabeth Warren speaks on the Senate Floor 2/7/16"}, {"3d03": "Let me state at the outset that I do not know anything about this particular incident. I do not know what led to one Senator invoking Senate Rule XIX , and I do not know what caused the other Senator to continue after being advised of the violation. I’m writing only to share my relevant experiences as a long-time Senate staffer, by way of illuminating what this is all about."}, {"e186": "A Unique Institution"}, {"5a23": "I love the Senate. It’s out of fashion to speak highly of any governmental institution these days, but so be it: it’s far from the only way I’m unfashionable. I believe it an important, vital institution, with much to teach us. It’s not a strictly majoritarian body. Individual Senators have significant power to gum things up, and this forces Senators to deal with each other with a certain amount of mutual respect. Not every legislative body around the world works this way."}, {"86a7": "Daniel Webster Addresses the U.S. Senate 1850. Credit: U.S. Senate Collection"}, {"0d37": "The Senate also has certain rules of decorum. When you debate in the Senate, you don’t address other Senators directly. This means you don’t say “you” when referring to another Senator in debate — you address your remarks to the presiding officer, and you generally refer to a colleague as “the Senator from (Name of State)” rather than using his or her name. This helps to keep the focus on issues rather than on personal disputes."}, {"7314": "The Senate observes other rules that are not only important in the context of the Senate, but which impressed me so much while working there that I have tried to import them into my personal conduct. You are not permitted to impugn another Senator or to characterize their motives."}, {"6fae": "“NO SENATOR IN DEBATE SHALL, DIRECTLY OR INDIRECTLY, BY ANY FORM OF WORDS IMPUTE TO ANOTHER SENATOR OR TO OTHER SENATORS ANY CONDUCT OR MOTIVE UNWORTHY OR UNBECOMING A SENATOR.” — U.S. SENATE RULE XIX"}, {"b789": "This, frankly, is great advice for everyone. So many debates we have would be more constructive if we would all agree to refrain from doing these things. None of us can ever really know another’s motives, so when we attribute someone else’s view to a nefarious motive, we’re usually ducking the issue in question to seek undeserved advantage. One reason the tenor of Senate debate doesn’t descend into the muck and mire associated with social media exchanges is precisely because of rules like Rule XIX against such tactics."}, {"4aa3": "It is rare for rule XIX to be formally invoked. It is not so rare for Senators to be cautioned about it."}, {"0e00": "I have one recollection of an instance, which may be inaccurate in some respects, involving Senator Al Simpson in 1992, where the rule came up. Then-Senator Al Gore, running for Vice President at the time, had been taking what Senator Simpson viewed as very cheap shots out on the campaign trail at his friend President Bush. (Note, the Senate rules don’t prevent a Senator from saying whatever he wants outside of the Senate). Senator Simpson got a bellyful and went to the Senate floor to give a speech in which he complained about several things Senator Gore had done."}, {"3f82": "During the speech I believe it was Senator Pryor who came in, and looking very concerned, asked for time and reminded Senator Simpson of rule XIX and how it forbade him to impugn Senator Gore’s motives or character. Senator Simpson took the point and stopped. I don’t recall whether any of his words were excised from the record."}, {"fef8": "This, in my experience, is how it typically works. A Senator crosses the line by saying something that disparages another Senator’s character. They are then reminded of the existence of the rule, and typically will be apologetic and withdraw the remarks."}, {"d28d": "I do not know why that did not happen in this case. I will say this: it saddens me greatly to read a lot of the commentary I’ve read over the last 24 hours. I’ve read not one but two ridiculous, childish pieces respectively in the online editions of the Washington Post and the New York Times that sought to make a gender-conflict issue out of the fact that the Senator who invoked the rule was male, while the Senator who proceeded in spite of it was female."}, {"2464": "Anyone who cares about the Senate must find this framing destructive and outrageous in the extreme. There are no gender specifications in Rule XIX. Every Senator is required to abide by it, and the sex of the Senator who invokes it is irrelevant. We can’t start carving out gender exceptions to the basic rules of Senate decorum to settle some perceived longstanding score about the politics of cross-gender communication."}, {"bf70": "THE SENATE RULES OF COMPORTMENT ARE NOT ABOUT POLITICAL POSITIONING. THEY ARE ABOUT PRESERVING RESPECTFUL DEBATE."}, {"7fc9": "I’ve been equally frustrated by the speculations about the supposed strategy behind what one Senator or the other did. The Senate rules of comportment are not about political positioning. They are about preserving respectful debate. It shouldn’t matter who gains or loses politically from a violation or invocation of the rules."}, {"7cb0": "View of the Senate of the United States in Session. By J. Rodgers. 1850 ca. Credit: U.S. Senate Collection"}, {"f62b": "I realize mine is a lonely voice in a social media environment that seeks to construct political advantage out of anything and everything. But as someone who worked in the Senate a long time, I can tell you that the Senate rules of decorum are important, it’s good that they exist, and all Senators should respect them."}, {"9f4b": "This article originally published at: RoughlyExplained.com"}, {"eb30": "Follow on Twitter: @roughlyexplain"}, {"fb76": "Like us on Facebook: https://www.facebook.com/RoughlyExplained"}], "child": "1573_1\t1573_2\t1573_3\t1573_41573_1\t1573_2\t1573_3\t1573_41573_1\t1573_2\t1573_3\t1573_4"}