{"name": "1575", "parent": "", "content": "On Trump’s Attacks on Journalists and the Judiciary Since President Trump took the oath of office, he has consistently attacked our democratic institutions. These attacks undermine the strength of our democracy and are inconsistent with the values of our country. Most troubling, President Trump has repeatedly undermined the credibility of federal judges doing their Constitutional duty to uphold the rule of law simply because he disagrees with them. This week, he called our courts “political.” That is about the most damaging thing you could say about our independent judiciary. He called Monday night’s federal appellate hearing “disgraceful” before a decision had even been rendered. Last Sunday, the Vice President said there is a tradition in America where one branch of government has a right to be critical of the other branches of government. I’m aware of no such tradition in which a President meddles in an ongoing case in an Article III Court. Indeed, President Andrew Jackson — a man to whom President Trump often compares himself — once wrote, “all the rights secured to the citizens under the Constitution are worth nothing … except guaranteed to them by an independent and virtuous judiciary.” The independence of our courts is a great strength of our democracy. As Alexander Hamilton wrote, the judicial branch has “neither force nor will, but merely judgment.” Attacking the judicial branch erodes the public confidence that gives force to those judgments. It damages the very foundations of our constitutional system. Earlier this week, President Trump continued his similar attacks on the free press. He accused what he called “dishonest” American journalists of “ignoring” terrorist attacks because of some unnamed hidden agenda. To support this unfounded claim, the White House scrambled to release a list of over 70 terrorist attacks they said had never been reported. Newspaper after newspaper had to publish lists of these events with links to the stories where they had in fact reported on terrorism. The Denver Post Editorial Board wrote this week: “American journalists have been killed reporting on terrorists. They’ve been beheaded. . . . To suggest that some kind of shared bias exists throughout American newsrooms so strong that it compels journalists to hide truth and thereby endanger the public is as dangerous as it is demonstrably untrue.” They’re right. It is dangerous. It is dangerous for the leader of the free world to say that journalists are crooks — that the facts they are publishing in newspapers and online are untrue, when they are true. It is dangerous, when we are engaged in an experiment of self-government that goes back more than 240 years, to characterize things that are demonstrably true as false. It is dangerous for the Administration to claim that the reason facts are being challenged is because people lack integrity and that all critical journalism is false news. I know it has become fashionable to tear down rather than work to improve the democratic institutions that generations of Americans have built. But it’s important for us — Democrats and Republicans — to debate respectfully and work to preserve the institutions of our government. If we undermine our free press and an independent judiciary and other pillars of our democracy, we risk undermining the very foundation that allows this country to persist. The Founding Fathers would be shocked to know this republic still exits. They would be proud, too. They would be proud of the progress we’ve made: this country, 240 years later, with 330 million people from coast to coast, with the strongest military and economy on the planet, a place where people want to come — just as my mother and her parents came — to build opportunity for the next generation. That is incredibly special in the history of humankind. We need to treat our republic with a little more care. I’m not just talking about here in the Senate. We need to stand up against attacks on our journalists and judges. We need to fight for our democratic processes, before they slip away. And we need to set an example for our children — to demonstrate the foundational truths that matter so greatly in this country. If we follow this path, we’ll continue to honor and build upon the traditions of our Founders. We’ll continue to be the strongest and most enduring democracy in the world where open and honest debate can flourish. Most important, we’ll continue to fulfill our responsibility to our children and our grandchildren. Adapted from remarks delivered on the Senate floor on February 8, 2017, during the consideration of President Trump’s nominee for Attorney General. ", "title": "On Trump’s Attacks on Journalists and the Judiciary", "sentences": [{"f032": "On Trump’s Attacks on Journalists and the Judiciary"}, {"b62a": "Since President Trump took the oath of office, he has consistently attacked our democratic institutions. These attacks undermine the strength of our democracy and are inconsistent with the values of our country."}, {"b59b": "Most troubling, President Trump has repeatedly undermined the credibility of federal judges doing their Constitutional duty to uphold the rule of law simply because he disagrees with them."}, {"2153": "This week, he called our courts “political.” That is about the most damaging thing you could say about our independent judiciary."}, {"82ae": "He called Monday night’s federal appellate hearing “disgraceful” before a decision had even been rendered."}, {"ee64": "Last Sunday, the Vice President said there is a tradition in America where one branch of government has a right to be critical of the other branches of government. I’m aware of no such tradition in which a President meddles in an ongoing case in an Article III Court."}, {"5f83": "Indeed, President Andrew Jackson — a man to whom President Trump often compares himself — once wrote, “all the rights secured to the citizens under the Constitution are worth nothing … except guaranteed to them by an independent and virtuous judiciary.”"}, {"2ce6": "The independence of our courts is a great strength of our democracy. As Alexander Hamilton wrote, the judicial branch has “neither force nor will, but merely judgment.” Attacking the judicial branch erodes the public confidence that gives force to those judgments. It damages the very foundations of our constitutional system."}, {"d6cc": "Earlier this week, President Trump continued his similar attacks on the free press. He accused what he called “dishonest” American journalists of “ignoring” terrorist attacks because of some unnamed hidden agenda."}, {"ed15": "To support this unfounded claim, the White House scrambled to release a list of over 70 terrorist attacks they said had never been reported. Newspaper after newspaper had to publish lists of these events with links to the stories where they had in fact reported on terrorism."}, {"f76c": "The Denver Post Editorial Board wrote this week:"}, {"3090": "“American journalists have been killed reporting on terrorists. They’ve been beheaded. . . . To suggest that some kind of shared bias exists throughout American newsrooms so strong that it compels journalists to hide truth and thereby endanger the public is as dangerous as it is demonstrably untrue.”"}, {"caf1": "They’re right. It is dangerous. It is dangerous for the leader of the free world to say that journalists are crooks — that the facts they are publishing in newspapers and online are untrue, when they are true."}, {"50b8": "It is dangerous, when we are engaged in an experiment of self-government that goes back more than 240 years, to characterize things that are demonstrably true as false. It is dangerous for the Administration to claim that the reason facts are being challenged is because people lack integrity and that all critical journalism is false news."}, {"6112": "I know it has become fashionable to tear down rather than work to improve the democratic institutions that generations of Americans have built. But it’s important for us — Democrats and Republicans — to debate respectfully and work to preserve the institutions of our government. If we undermine our free press and an independent judiciary and other pillars of our democracy, we risk undermining the very foundation that allows this country to persist."}, {"78ca": "The Founding Fathers would be shocked to know this republic still exits. They would be proud, too. They would be proud of the progress we’ve made: this country, 240 years later, with 330 million people from coast to coast, with the strongest military and economy on the planet, a place where people want to come — just as my mother and her parents came — to build opportunity for the next generation. That is incredibly special in the history of humankind."}, {"8dea": "We need to treat our republic with a little more care."}, {"3e11": "I’m not just talking about here in the Senate. We need to stand up against attacks on our journalists and judges. We need to fight for our democratic processes, before they slip away. And we need to set an example for our children — to demonstrate the foundational truths that matter so greatly in this country."}, {"b079": "If we follow this path, we’ll continue to honor and build upon the traditions of our Founders. We’ll continue to be the strongest and most enduring democracy in the world where open and honest debate can flourish. Most important, we’ll continue to fulfill our responsibility to our children and our grandchildren."}, {"ae88": "Adapted from remarks delivered on the Senate floor on February 8, 2017, during the consideration of President Trump’s nominee for Attorney General."}], "child": "1575_1\t1575_2\t1575_3\t1575_4\t1575_51575_1\t1575_2\t1575_3\t1575_4\t1575_51575_1\t1575_2\t1575_3\t1575_4\t1575_5"}