{"name": "1576", "parent": "", "content": "How many Americans are swept up in warrantless foreign surveillance? We don’t know. Without even an estimate of this number, it’s impossible to judge what section 702 means for the core liberties of law-abiding Americans. Wyden blasts intelligence community for failing to provide public with number of Americans swept up by section 702 Sen. Wyden’s remarks as delivered on the Senate floor on March 15, 2017. I want to begin discussion of the nomination of Dan Coats to be the Director of National Intelligence. I have known Senator Coats for many years. He has been the lead cosponsor of the federal income tax reform proposal, the bipartisan federal income tax reform proposal that has been a special priority of mine, and I would just say to the president and colleagues I don’t know of a single United States Senator who does not like Senator Coats. He is honest, he is a straight shooter, he is gracious, and so my remarks are not about my personal affection for Senator Coats. The reason I’m voting against the nomination is because of the matter is for six years, Mr. President and colleagues, it has been impossible to get the intelligence community to provide the Congress and the American people information that is absolutely critical to the debate on reauthorizing the Foreign Intelligence Surveillance Act. For six long years, Democrats and Republicans — both in this body and in the other body — have been trying to get this information. And so this morning I’m going to explain, given the fact that this legislation would be Senator Coats’ top priority, as he said in the Intelligence Committee, I want the Senate and the country to understand why this issue is so important. I thank my colleague. And now, as we consider Senator Coats’ nomination and recognize that his top priority by his admission would be the reauthorization of the foreign investigation act, I want to begin that discussion today because it is because the intelligence community ha stonewalled Democrats and Republicans in both this body and the other body for six years on the information that we need to do good oversight that I have come to the floor to outline what I think this central issue is all about. And I’m going to begin my remarks, Mr. President, by way of saying that at a time when Americans are demanding policies that give them more security and more liberty, increasingly we’re seeing policies come from both this body and the other body that provide less of both. A good example would be weakening strong encryption. Weakening strong encryption is bad from a security standpoint, it’s bad from a liberty standpoint. And when government creates policies that give the American people less of both, less security, and less liberty, obviously the American people are not going to react well. My view is when the government — particularly intelligence agencies — don’t level with the American people about large-scale surveillance of law-abiding Americans, our people are justifiably are justifiably angry. And when the government tries to keep this information secret, as I have pointed out on this floor before, in America the truth always comes out. Leveling with the American people is the only way for agencies to have the credibility and the legitimacy to effectively do their jobs, and they have critically important jobs in keeping our people safe from threats. Now, with respect to Senator Coats, at his confirmation hearing, since he said the Foreign Intelligence Surveillance Act would be his top priority, I asked our former colleague how many Americans — innocent, law-abiding Americans — have actually been swept up in the surveillance program known as section 702 of the Foreign Intelligence Surveillance Act. Under section 702, the government conducts warrantless surveillance of foreigners who are reasonably believed to be overseas. It does this work by compelling telecommunications companies and internet service providers to provide the content — phone calls and e-mails and other individual communications. Now, there are several different ways that this happens, and I will get to that in the course of these remarks. What we’re talking about and what I want people to understand is this goes to the content of communications. This is not about metadata communication. And the Senate reformed that in the U.S.A. Freedom Act. This is surveillance without any warrants, and once the FISA court signs off on the overall program, the details are up to the government. Now, this was not always the case. For decades, individual warrants were required when the government needed the assistance of the country’s telecommunications firms. Then the Bush Administration created a secret, illegal, warrantless wiretapping program. After the program was revealed, the government then went to the Foreign Intelligence Surveillance Act court to get approval. But when the government ran into some trouble with the court, the Bush Administration argued that the Congress should create the current program. It was first passed in 2007 under the name “Protect America Act.” That became the Foreign Intelligence Surveillance Act amendments in 2008. Now, fortunately, the Congress included a sunset provision, which is why it was up for reauthorization in 2012, and that is why it is up for reauthorization this year, and this year it is Senator Coats’ top priority, if confirmed. Whoever is head of the intelligence community will be the point person for this legislation. But I want it understood that the reason that I’m going through this background is that I believe the American people deserve a fully informed debate about the Foreign Intelligence Surveillance Act reauthorization. You cannot have that debate — you cannot ensure that the American people have security and liberty unless you know the impact of section 702 of that bill on the constitutional rights of law-abiding Americans. So for six years, Mr. President, in this body Democrats and Republicans — in the other body, Democrats and Republicans — have been asking the same question: How many law-abiding Americans are having their communications swept up in all of this collection? Without even an estimate of this number, I don’t think it’s possible to judge what section 702 means for the core liberties of law-abiding Americans. Without this information, the Congress can’t make an informed decision about whether to reauthorize section 702 or what kind of reforms might be necessary to ensure the protection of the individual liberties of innocent Americans. At Senator Coats’ nomination hearing before the Senate Intelligence Committee, I asked Senator Coats whether he would commit to providing Congress and the public with information, and I say, Mr. President, because of my respect for Senator Coats and our longtime cooperation on issues like tax reform and a variety of, you know, others, I hope that Senator Coats would be the one, after six years of struggling to get this information — I had hoped that Senator Coats would make a commitment to deliver it to the Senate Intelligence Committee before work on the reauthorization began. Instead, Senator Coats said, and I quote, I’ll do everything I can to work with admiral Rogers at the N.S.A. To get you that number. If confirmed, I hope that happens.   But after asking for the number of law-abiding Americans who get swept up in these searches for years and getting stonewalled by the executive branch, hoping to get the information you need to do real oversight is just not good enough. Requesting the number of Americans surveilled since 2011 The problem — the lack of information on the impact of this law on the privacy of Americans — goes all the way back to the origins of the authority. In December of 2007, the Bush Administration in its statement of administration policy on the FISA amendment act stated that it would likely be impossible to count the number of people located in the United States whose communications were reviewed by the government. In April of 2011, our former colleague, Senator Mark Udall, and I then asked the Director of National Intelligence, James Clapper, for an estimate. In July of that year, the director wrote back and said, and I quote, it was not reasonably possible to identify the number of people located in the United States whose communications may have been reviewed under the authority of the Foreign Intelligence Surveillance Act. He suggested reviewing the classified number of disseminated intelligence reports containing a reference to a U.S. Person, but that is very different than the number of Americans whose communications have been collected in the first place. And that’s what this is all about. Mr. President, how many law-abiding Americans — innocent, law-abiding Americans are getting swept up in these searches? It will be an increasingly important issue, as the nature of telecommunications companies continues to change because it is now a field that is globally interconnected. We don’t have telecommunications systems just stopping at national borders. So getting the number of Americans whose communications have been collected in the first place is the prerequisite to doing real oversight on this law and doing our job at a time when it is being reauthorized and the American people want both security and liberty and understand that the two are not mutually exclusive. So, Director Clapper then suggested reviewing the classified number of targets that were later determined to be located in the United States. But the question has never been about the targets of section 702, although the mistaken targeting of Americans and the people in our country is another serious question. The question that Democrats and Republicans have been asking is about how many Americans are being swept up by a program that, according to the law, is supposed to only target foreigners overseas. So let me repeat that. That’s what the law says. The Foreign Intelligence Surveillance Act says that the targets are supposed to be foreigners overseas. And Democrats and Republicans want to know how many law-abiding Americans who might reside in Alaska or Oregon or anywhere else are getting swept up in these searches. So this bipartisan coalition has kept asking. In July of 2012, anticipating the first reauthorization of section 702 of the Foreign Intelligence Surveillance Act, I and 11 other Senators from both parties wrote Director Clapper. We wrote: We understand that it might not be possible for the Intelligence Committee to calculate this number with precision, but it is difficult for us to accept the assertion that it is not possible to come up with even a rough estimate of this number. If generating a precise estimate would require an inordinate amount of labor, we would be able to accept an imprecise one. So we asked about imprecise estimates. How many people, just a ballpark, law-abiding Americans are getting swept up in these searches that the law says are designed to target foreigners? So we asked about orders of magnitude. Is the number closer to a hundred or a hundred thousand or a hundred million? We still got no answer. And section 702 was reauthorized without this necessary information. So last year looking at the prospect of the law coming up, there was a renewed effort to find out how many law-abiding Americans are getting swept up in these searches of foreigners. In April 2016 a bipartisan letter from members of the House Judiciary Committee asked the Director of National Intelligence for a public estimate of the number of communications or transactions involving United States persons are collected under section 702 on an annual basis. This letter coming from the House Democrats and Republicans, again asked for a rough estimate. This bipartisan group suggested working with director clapper to determine the methodology to get this estimate. In December there were hints in the news media that something might be forthcoming, but now we’re here with a new administration considering the nomination of the next head of the intelligence community who has said that reauthorizing section 702 is his top legislative priority and that there is no answer in sight to the question Democrats and Republicans have been asking for over six years. How many innocent law-abiding Americans are getting swept up in these searches under a law that targets foreigners overseas? All the ways Americans’ can be swept up in foreign surveillance Now, having described this history, I want to explain why this issue is so important. Starting with the many ways in which innocent Americans can be swept up in section 702 surveillance.   The first are targeting mistakes in which contrary to the law, the target turns out to be an American or someone in the United States. The full impact of these mistakes on law-abiding Americans is not readily apparent. The most recent public report on section 702 noted that there were compliance incidents involving surveillance of foreigners in the United States and surveillance of Americans. This is in violation of the law and it happens. The way in which Americans can be swept up in section 702 collection is when they communicate with an overseas target. This is usually called incidental collection, and it is often mischaracterized. I have heard many times that the program is intended to find out when Americans are communicating  with, quote, bad guys. And I want it understood I’m not interested in some kind of bad guys caucus. I know of no Senator who is not interested in protecting our country from those kinds of threats. If a known terrorist overseas is communicating with someone in the United States, we ought to know about it. But section 702 is not just a counterterrorism program. The statute requires that the collection be conducted, quote, to acquire foreign intelligence information. As implemented the standard for targeting individuals under the program is that the government has reason to believe that these persons possess or are expected to receive or are likely to communicate foreign intelligence information. Obviously that is broad. It doesn’t even require that a target be suspected of wrongdoing. So if someone tells you that your communications will only be collected if you’re talking to Al Qaeda or ISIS that is just factually wrong. It is also important to note that the government is prohibited from collecting communications only when the sender of an e-mail and everyone receiving that e-mail are in the United States. So an American in the United States can send an e-mail to another American in the United States, but if the e-mail also goes to an overseas target, it’s going to be collected. So that then brings us to the different kinds of collection under section 702 and how it affects the liberties of our people in different ways. In one form of collection known as PRISM, the government orders an internet service provider to provide the government with messages to and from a specific e-mail address. Then there is something known as upstream collection which is when the communications are collected off the telecommunications and internet backbones. In other words, phone calls and e-mail messages are collected in transit. This kind of collection raises a number of other concerns, a number of other reasons to be concerned about how many law-abiding Americans are getting swept up. For one, it is through upstream collection that the government can collect e-mails that are neither to or from a target. The e-mail merely has to be about a target, meaning, for example, it includes the target’s e-mail address in the content. In other words, the government can collect e-mails to and from Americans, none of whom are of any interest to the government whatsoever as long as the target’s e-mail address is in the content of the e-mail. The law only requires that one of the parties to the communication who again could be another American is overseas and even that requirement is hard for the government to meet in practice. So the implications here ought to be pretty obvious. You don’t even have to be communicating with one of the government’s targets to be swept up in Foreign Intelligence Surveillance Act collection. You don’t even have to be communicating with a foreigner. You or somebody e-mailing you just needs to reference a target’s e-mail address. So, I’ve now mentioned that this target is not necessarily a terrorist because the law allows for surveillance to acquire foreign intelligence information. That’s been interpreted to allow the targeting of individuals who the government has reason to believe or expect — possesses or expected to receive or likely to communicate foreign intelligence information. It’s a broad standard, and the government could then collect the communications of all kinds of foreigners around the world. So think about how easy it would be for an American business leader to be in contact with a broad set of potential targets of this program. Consider how easy it would be for Americans communicating with other Americans to forward the e-mails of these people. All of this could be collected by the government. The upstream collection also includes the collection of what are called multicommunications transactions. This is when the N.S.A. collects an e-mail that is to, from, or about a target, but the e-mail is embedded among multiple other communications that are not. These communications may have nothing to do with the target, but the government just kind of sort of ends up with them. And some of them are sent and received entirely within the United States. These are the ways in which law-abiding Americans, innocent law-abiding Americans who have done absolutely nothing wrong both overseas and in the United States can have their communications collected under the Foreign Intelligence Surveillance Act. These are law-abiding Americans, innocent Americans, and they’re not necessarily suspected of anything. And it is their privacy and their constitutional rights that has caused Democrats and Republicans here in this body and in the other body to seek the actual numbers of how many law-abiding Americans are getting swept up in these searches that are supposed to target foreigners overseas. Constitutionality Now, the reason that this is important, Mr. President, is the program is getting bigger and bigger. Exact numbers are classified, but the government’s public reporting confirms steady increases in collection. At some point the size of the program, the extent to which Americans’ communications are being collected raises obvious concerns about our Fourth Amendment. The question is not if the program raises constitutional concerns but when. And that gets to the heart of what our bipartisan coalition has been concerned about. If it’s not possible for the Senate to know as part of reauthorizing this law how many Americans are being swept up by this program, you cannot determine whether the government has crossed a constitutional line. Now, the Privacy and Civil Liberties Oversight Board, this is an agency that the Congress has tasked to look at these issues, this agency has raised the very same concerns I’m outlining this morning. In the 2014 report by the board, a nonpartisan organization tasked by the Congress, they concluded that the lack of information about the collection of the communications of law-abiding Americans under section 702 “hampers attempts to gauge whether the program appropriately balances national security interests with the privacy of U.S. persons.” And they went on to say that the program is “close to the line of constitutional reasonableness. At the very least too much expansion in the collection of U.S. Persons’ communications or the uses to which these communications are put may push the program over the line.” They recommended, Mr. President, exactly what our bipartisan coalition has been calling for, that the government provide to the Congress and to the extent consistent with national security that the public and the Congress get data on the collection of these communications of law-abiding Americans. The use of Section 702 collection Now, the most frequently heard argument against what our bipartisan group of House and Senate members have been calling for is that whatever number of communications are being collected on law-abiding Americans, it is minimized which implies that information about Americans is hidden. And this is a particularly important issue, Mr. President. I’ve heard my colleagues on the other side talk frequently. Well, you know, if law-abiding Americans are having their communications swept up, we shouldn’t get all concerned about that because this array of Americans’ communications is being minimized, and somehow that means that it’s not getting out. It’s being hidden. That’s not what necessarily happens. To begin with, all that collection does not necessarily stay at the National Security Agency. E-mails collected through the PRISM component of section 702 may go to several other agencies, including the C.I.A. and the F.B.I. Then you have those three agencies in particular authorized to conduct searches through the data for communications that are to, from, or about Americans. Look for an American’s name, telephone number, e-mail address, even a key word or phrase. They can do that without any warrant. There doesn’t have to be even a suspicion, even a suspicion that an American is engaged in any kind of wrongdoing. The F.B.I.’s authorities are even broader. The F.B.I. can also conduct searches for communications that are to, from, or about an American to seek evidence of a crime. Unlike the National Security Agency and the Central Intelligence Agency, the F.B.I. doesn’t even report how many searches for Americans it’s conducting. Moreover, neither the F.B.I. Nor the C.I.A. Reports on the number of searches for Americans it conducts using metadata collected under section 702. Now, the authority to conduct searches for Americans’ communications in section 702 data is new. Before 2011, the FISA court prohibited, prohibited queries for U.S. persons. I’m going to repeat that: Under the Bush Administration and the first two years of the Obama Administration, it was not possible to conduct these back-door, warrantless searches of law-abiding Americans. Then the Obama Administration sought to change the rules and obtained authority to conduct them. In April, 2014, the Director of National Intelligence in response to questions from myself and Senator Mark Udall publicly acknowledged these warrantless searches, and by June 2015, the House voted overwhelmingly to prohibit them. That prohibition didn’t become law, but I can tell you it’s sure going to be considered in the context of this reauthorization, and the House voted overwhelmingly, overwhelmingly to prohibit these warrantless searches. So the question really is what exactly is the privacy impact of these warrantless searches for Americans? In 2014, I managed to extract from the intelligence community some but not all the necessary information about how many Americans have been the subject of the searches. That was a step forward, but what the data doesn’t tell us is: who are the subjects of these searches, and, more to the point, it doesn’t tell us how many Americans are potentially the subject of these searches. If the number is small, the potential for abuse obviously would be smaller. If the number is large, just the opposite. Potential for abuse is much greater. Without an understanding of the size of the pool from which the government can pull the communications of law-abiding Americans, there is just no way of knowing how easy it would be for the government to use this law as a means to read the e-mails of a political opponent, a business leader, a journalist or an activist. Reverse Targeting I now want to turn to the ultimate form of abuse, and that is something called reverse targeting. Prohibited by law, it’s defined as collection. If the purpose of the acquisition is to target a particular known person reasonably believed to be in the United States. This is a prohibition that also applies to U.S. persons. The question, though, is how is this defined and how can the public be assured it’s not happening? If you look at the language, you can see why there has been bipartisan concern. The collection is only prohibited if the purpose is to get the communications of Americans. The question obviously has arisen what if getting the Americans’ communications is only one of the purposes of collecting on an overseas target? What is actually acceptable here? This issue was concerning in 2008 when the Foreign Intelligence Surveillance Act amendments passed with a prohibition on reverse targeting, but that was before the Congress knew about the collection of e-mails that are only about a foreign target and that could be to and from Americans. That was before the Obama administration sought and obtained authority to conduct warrantless searches for communications to, from and about Americans out of section 702 PRISM collection. And that makes an important point to me, Mr. President. This bipartisan coalition of which I have been part of has fought back against executive branch overreach, whether it is Democratic administration or a Republican administration. And I cited the fact that President Obama brought back something with a great potential for abuse that President Bush said he wanted no part of. So as we look at these issues, it’s important to understand exactly what the scope of the problem is. Each of the agencies authorized to conduct these warrantless searches, the N.S.A., the F.B.I., the C.I.A., are also authorized to identify the overseas targets of section 702. The agencies that have developed an interest in Americans’ communications and are actually looking for these communications are the same agencies that are in a position to encourage ongoing collection of those communications by targeting the overseas party. So I believe, our bipartisan group believes that there is very substantial potential for abuse, and because of these decisions taking place in the executive branch without any judicial oversight, it’s possible that no one would ever know. Excuses Now, to quote the privacy oversight board, since the enactment of the FISA Amendments act, the extent to which the government requires the communications of U.S. persons has been one of the biggest open questions about the program and a continuing source of public concern. The board noted that the Executive Branch has responded with any number of excuses for why it couldn’t provide a number of how many innocent law-abiding Americans get swept up in these searches. One excuse has been the size of the program, but as members, Democrats and Republicans have said repeatedly, an estimate, perhaps based on a simple, is sufficient. Nobody is dictating how this would be done. Another excuse has been that determining whether individuals whose communications have been collected are American would itself be invasive of privacy. Now, this is something of a head scratcher, and I will just say the value of knowing how many law-abiding Americans get swept up in these searches, that privacy advocates have stated that this far-fetched theory, far-fetched excuse for not furnishing it doesn’t add up in terms of the benefit of finding how many Americans are swept up in these warrantless searches. The government is genuinely concerned about the privacy implications of calculating the number. I and many of my colleagues, both Democrats and Republicans, have been willing and we have renewed this in the last few weeks to have a discussion about the methodology, you know, under consideration. What’s ahead In the months ahead, the Senate is going to be debating a number of issues relating to this topic, such as U.S. person searches, reverse targeting and the collection of communications that are just about the target. The Senate is going to discuss how to strengthen oversight by the Foreign Intelligence Surveillance Court, the privacy board. The Director of National Intelligence will be right in the center of the debate, and there is more information that the American people need, and there is more information that this body needs to carry out its responsibility to do real oversight here. The center of these discussions about the reauthorization of the Foreign Intelligence Surveillance Act involves one question — how many innocent law-abiding Americans have been swept up in this program that has been written and developed to target foreigners overseas. Congress’ judgment about the impact of section 702 depends on getting this number. An assessment of the program’s constitutionality rests on the understanding of the impact it has on Americans. The implications of the warrantless search of Americans requires knowing how many Americans’ communications are being searched through. Countless questions related to the reauthorization of the program all require that the public have this information. And I’m just going to close by way of saying what those questions are, because if you want to do real oversight over a critically important program, you’ve got to have the information to respond to these questions. The questions are should there be safeguards against reverse targeting? Should the Congress legislate on upstream collection, collection of communications about targets because it raises unique concerns about the collection of the communications of law-abiding Americans? Are the rules related to the dissemination and use and retention of these communications adequate? Should there be limits on the use of these communications by the F.B.I. For non-intelligence purposes? Just think about that one for a minute, Mr. President. What does it mean to people in our part of the world where people feel that liberty and security are not mutually exclusive, that they are going to insist on both, what does it mean to them on the question of whether there ought to be limits on the use of this information by the F.B.I. For non-intelligence purposes? That’s exactly the kind of question that people are going to ask. I’m heading home today for town hall meetings in rural areas, and those are exactly the kind of questions that Oregonians ask. People understand this is a dangerous time. That’s not at issue. If you serve on the Intelligence Committee, and along with Senator Feinstein, I have been one of the longer serving members. The fact that this is a dangerous world is not a debatable proposition. There are a lot of people out there who do not wish our country well. But what I say to Oregonians, what I will say again this weekend, any politician who tells you you’ve got to give up your liberty to have security is not somebody who’s working in your interest, because smart policies give you both. That’s why I started talking about the benefits of strong encryption, critically important for security, critically important for liberty. And these questions are ones that I don’t think are particularly partisan. That’s why a big group of Democrats and Republicans here and in the other body have been seeking the information about how many law-abiding Americans get caught up in these efforts to target a foreigner overseas, and we are now at a critical moment. A government surveillance program with very obvious implications for the privacy and constitutional rights. It’s up for reauthorization by the end of the year. While more information may be part of the answer, we have got to have the best possible estimate to answer those questions that I just outlined. The American people want Congress to get to the bottom of questions that go right to the heart of our having policies that promote both their security and their liberty. I think the public expects a full debate. You can’t have a full debate. You cannot have a full and real debate over the Foreign Intelligence Surveillance Act unless you have some sense of how many law-abiding Americans are getting swept up in these searches of foreigners. I believe the American people expect serious oversight through it. They want assurances that their representatives in Congress have a sense of what is actually being voted on, and after years of secret surveillance programs being revealed only in the news media, I think the public has rightly insisted on more openness and more transparency. So getting the information that I have described today that will deal with Senator Coats’ top priority, reauthorizing the Foreign Intelligence Surveillance Act is a critical first step. Once the Senate knows the impact of this program on Americans, then you can have a full and real discussion, a real debate in Congress with the public and with the Director of National Intelligence. I took the view in the committee, Mr. President, despite very much liking Dan Coats and his being the bipartisan cosponsor of what is still the only federal income tax reform proposal we’ve had in the Senate since the 1986 law was authored, I said that I can’t support any nominee to be the head of national intelligence if that nominee will not guarantee that before this reauthorization is brought before the Senate and brought before the Intelligence Committee, that we have the information needed to do our jobs, to do real oversight, to show the American people that it’s possible to come up with policies that promote security and liberty and for that reason, despite my friendship for Senator Coats, I cannot support the nomination. ", "title": "How many Americans are swept up in warrantless foreign surveillance? We don’t know.", "sentences": [{"ec81": "How many Americans are swept up in warrantless foreign surveillance? We don’t know."}, {"a4cf": "Without even an estimate of this number, it’s impossible to judge what section 702 means for the core liberties of law-abiding Americans."}, {"858f": "Wyden blasts intelligence community for failing to provide public with number of Americans swept up by section 702"}, {"f6fc": "Sen. Wyden’s remarks as delivered on the Senate floor on March 15, 2017."}, {"2843": "I want to begin discussion of the nomination of Dan Coats to be the Director of National Intelligence. I have known Senator Coats for many years. He has been the lead cosponsor of the federal income tax reform proposal, the bipartisan federal income tax reform proposal that has been a special priority of mine, and I would just say to the president and colleagues I don’t know of a single United States Senator who does not like Senator Coats. He is honest, he is a straight shooter, he is gracious, and so my remarks are not about my personal affection for Senator Coats."}, {"3129": "The reason I’m voting against the nomination is because of the matter is for six years, Mr. President and colleagues, it has been impossible to get the intelligence community to provide the Congress and the American people information that is absolutely critical to the debate on reauthorizing the Foreign Intelligence Surveillance Act. For six long years, Democrats and Republicans — both in this body and in the other body — have been trying to get this information."}, {"b62c": "And so this morning I’m going to explain, given the fact that this legislation would be Senator Coats’ top priority, as he said in the Intelligence Committee, I want the Senate and the country to understand why this issue is so important. I thank my colleague. And now, as we consider Senator Coats’ nomination and recognize that his top priority by his admission would be the reauthorization of the foreign investigation act, I want to begin that discussion today because it is because the intelligence community ha stonewalled Democrats and Republicans in both this body and the other body for six years on the information that we need to do good oversight that I have come to the floor to outline what I think this central issue is all about."}, {"ca1e": "And I’m going to begin my remarks, Mr. President, by way of saying that at a time when Americans are demanding policies that give them more security and more liberty, increasingly we’re seeing policies come from both this body and the other body that provide less of both."}, {"76f6": "A good example would be weakening strong encryption. Weakening strong encryption is bad from a security standpoint, it’s bad from a liberty standpoint. And when government creates policies that give the American people less of both, less security, and less liberty, obviously the American people are not going to react well."}, {"2e20": "My view is when the government — particularly intelligence agencies — don’t level with the American people about large-scale surveillance of law-abiding Americans, our people are justifiably are justifiably angry. And when the government tries to keep this information secret, as I have pointed out on this floor before, in America the truth always comes out. Leveling with the American people is the only way for agencies to have the credibility and the legitimacy to effectively do their jobs, and they have critically important jobs in keeping our people safe from threats."}, {"b555": "Now, with respect to Senator Coats, at his confirmation hearing, since he said the Foreign Intelligence Surveillance Act would be his top priority, I asked our former colleague how many Americans — innocent, law-abiding Americans — have actually been swept up in the surveillance program known as section 702 of the Foreign Intelligence Surveillance Act."}, {"1a9b": "Under section 702, the government conducts warrantless surveillance of foreigners who are reasonably believed to be overseas. It does this work by compelling telecommunications companies and internet service providers to provide the content — phone calls and e-mails and other individual communications."}, {"f7a7": "Now, there are several different ways that this happens, and I will get to that in the course of these remarks. What we’re talking about and what I want people to understand is this goes to the content of communications. This is not about metadata communication. And the Senate reformed that in the U.S.A. Freedom Act. This is surveillance without any warrants, and once the FISA court signs off on the overall program, the details are up to the government. Now, this was not always the case."}, {"9663": "For decades, individual warrants were required when the government needed the assistance of the country’s telecommunications firms. Then the Bush Administration created a secret, illegal, warrantless wiretapping program. After the program was revealed, the government then went to the Foreign Intelligence Surveillance Act court to get approval. But when the government ran into some trouble with the court, the Bush Administration argued that the Congress should create the current program. It was first passed in 2007 under the name “Protect America Act.” That became the Foreign Intelligence Surveillance Act amendments in 2008."}, {"cea8": "Now, fortunately, the Congress included a sunset provision, which is why it was up for reauthorization in 2012, and that is why it is up for reauthorization this year, and this year it is Senator Coats’ top priority, if confirmed. Whoever is head of the intelligence community will be the point person for this legislation."}, {"8f23": "But I want it understood that the reason that I’m going through this background is that I believe the American people deserve a fully informed debate about the Foreign Intelligence Surveillance Act reauthorization. You cannot have that debate — you cannot ensure that the American people have security and liberty unless you know the impact of section 702 of that bill on the constitutional rights of law-abiding Americans."}, {"99f1": "So for six years, Mr. President, in this body Democrats and Republicans — in the other body, Democrats and Republicans — have been asking the same question: How many law-abiding Americans are having their communications swept up in all of this collection?"}, {"9028": "Without even an estimate of this number, I don’t think it’s possible to judge what section 702 means for the core liberties of law-abiding Americans."}, {"43ab": "Without this information, the Congress can’t make an informed decision about whether to reauthorize section 702 or what kind of reforms might be necessary to ensure the protection of the individual liberties of innocent Americans."}, {"d22a": "At Senator Coats’ nomination hearing before the Senate Intelligence Committee, I asked Senator Coats whether he would commit to providing Congress and the public with information, and I say, Mr. President, because of my respect for Senator Coats and our longtime cooperation on issues like tax reform and a variety of, you know, others, I hope that Senator Coats would be the one, after six years of struggling to get this information — I had hoped that Senator Coats would make a commitment to deliver it to the Senate Intelligence Committee before work on the reauthorization began."}, {"f313": "Instead, Senator Coats said, and I quote, I’ll do everything I can to work with admiral Rogers at the N.S.A. To get you that number. If confirmed, I hope that happens.   But after asking for the number of law-abiding Americans who get swept up in these searches for years and getting stonewalled by the executive branch, hoping to get the information you need to do real oversight is just not good enough."}, {"2ee0": "Requesting the number of Americans surveilled since 2011"}, {"8450": "The problem — the lack of information on the impact of this law on the privacy of Americans — goes all the way back to the origins of the authority. In December of 2007, the Bush Administration in its statement of administration policy on the FISA amendment act stated that it would likely be impossible to count the number of people located in the United States whose communications were reviewed by the government."}, {"1ba0": "In April of 2011, our former colleague, Senator Mark Udall, and I then asked the Director of National Intelligence, James Clapper, for an estimate. In July of that year, the director wrote back and said, and I quote, it was not reasonably possible to identify the number of people located in the United States whose communications may have been reviewed under the authority of the Foreign Intelligence Surveillance Act. He suggested reviewing the classified number of disseminated intelligence reports containing a reference to a U.S. Person, but that is very different than the number of Americans whose communications have been collected in the first place. And that’s what this is all about."}, {"0b66": "Mr. President, how many law-abiding Americans — innocent, law-abiding Americans are getting swept up in these searches? It will be an increasingly important issue, as the nature of telecommunications companies continues to change because it is now a field that is globally interconnected. We don’t have telecommunications systems just stopping at national borders."}, {"020e": "So getting the number of Americans whose communications have been collected in the first place is the prerequisite to doing real oversight on this law and doing our job at a time when it is being reauthorized and the American people want both security and liberty and understand that the two are not mutually exclusive. So, Director Clapper then suggested reviewing the classified number of targets that were later determined to be located in the United States. But the question has never been about the targets of section 702, although the mistaken targeting of Americans and the people in our country is another serious question."}, {"a04e": "The question that Democrats and Republicans have been asking is about how many Americans are being swept up by a program that, according to the law, is supposed to only target foreigners overseas. So let me repeat that. That’s what the law says. The Foreign Intelligence Surveillance Act says that the targets are supposed to be foreigners overseas. And Democrats and Republicans want to know how many law-abiding Americans who might reside in Alaska or Oregon or anywhere else are getting swept up in these searches. So this bipartisan coalition has kept asking."}, {"dcf1": "In July of 2012, anticipating the first reauthorization of section 702 of the Foreign Intelligence Surveillance Act, I and 11 other Senators from both parties wrote Director Clapper. We wrote:"}, {"4f8a": "We understand that it might not be possible for the Intelligence Committee to calculate this number with precision, but it is difficult for us to accept the assertion that it is not possible to come up with even a rough estimate of this number. If generating a precise estimate would require an inordinate amount of labor, we would be able to accept an imprecise one."}, {"9a87": "So we asked about imprecise estimates. How many people, just a ballpark, law-abiding Americans are getting swept up in these searches that the law says are designed to target foreigners? So we asked about orders of magnitude. Is the number closer to a hundred or a hundred thousand or a hundred million? We still got no answer. And section 702 was reauthorized without this necessary information."}, {"2be2": "So last year looking at the prospect of the law coming up, there was a renewed effort to find out how many law-abiding Americans are getting swept up in these searches of foreigners. In April 2016 a bipartisan letter from members of the House Judiciary Committee asked the Director of National Intelligence for a public estimate of the number of communications or transactions involving United States persons are collected under section 702 on an annual basis. This letter coming from the House Democrats and Republicans, again asked for a rough estimate. This bipartisan group suggested working with director clapper to determine the methodology to get this estimate."}, {"fb6c": "In December there were hints in the news media that something might be forthcoming, but now we’re here with a new administration considering the nomination of the next head of the intelligence community who has said that reauthorizing section 702 is his top legislative priority and that there is no answer in sight to the question Democrats and Republicans have been asking for over six years. How many innocent law-abiding Americans are getting swept up in these searches under a law that targets foreigners overseas?"}, {"56f3": "All the ways Americans’ can be swept up in foreign surveillance"}, {"6047": "Now, having described this history, I want to explain why this issue is so important. Starting with the many ways in which innocent Americans can be swept up in section 702 surveillance.   The first are targeting mistakes in which contrary to the law, the target turns out to be an American or someone in the United States. The full impact of these mistakes on law-abiding Americans is not readily apparent. The most recent public report on section 702 noted that there were compliance incidents involving surveillance of foreigners in the United States and surveillance of Americans. This is in violation of the law and it happens. The way in which Americans can be swept up in section 702 collection is when they communicate with an overseas target. This is usually called incidental collection, and it is often mischaracterized."}, {"45e8": "I have heard many times that the program is intended to find out when Americans are communicating  with, quote, bad guys. And I want it understood I’m not interested in some kind of bad guys caucus. I know of no Senator who is not interested in protecting our country from those kinds of threats. If a known terrorist overseas is communicating with someone in the United States, we ought to know about it."}, {"d719": "But section 702 is not just a counterterrorism program. The statute requires that the collection be conducted, quote, to acquire foreign intelligence information. As implemented the standard for targeting individuals under the program is that the government has reason to believe that these persons possess or are expected to receive or are likely to communicate foreign intelligence information. Obviously that is broad. It doesn’t even require that a target be suspected of wrongdoing. So if someone tells you that your communications will only be collected if you’re talking to Al Qaeda or ISIS that is just factually wrong."}, {"c2f0": "It is also important to note that the government is prohibited from collecting communications only when the sender of an e-mail and everyone receiving that e-mail are in the United States. So an American in the United States can send an e-mail to another American in the United States, but if the e-mail also goes to an overseas target, it’s going to be collected. So that then brings us to the different kinds of collection under section 702 and how it affects the liberties of our people in different ways."}, {"72d7": "In one form of collection known as PRISM, the government orders an internet service provider to provide the government with messages to and from a specific e-mail address. Then there is something known as upstream collection which is when the communications are collected off the telecommunications and internet backbones. In other words, phone calls and e-mail messages are collected in transit. This kind of collection raises a number of other concerns, a number of other reasons to be concerned about how many law-abiding Americans are getting swept up. For one, it is through upstream collection that the government can collect e-mails that are neither to or from a target. The e-mail merely has to be about a target, meaning, for example, it includes the target’s e-mail address in the content. In other words, the government can collect e-mails to and from Americans, none of whom are of any interest to the government whatsoever as long as the target’s e-mail address is in the content of the e-mail."}, {"a4b0": "The law only requires that one of the parties to the communication who again could be another American is overseas and even that requirement is hard for the government to meet in practice. So the implications here ought to be pretty obvious. You don’t even have to be communicating with one of the government’s targets to be swept up in Foreign Intelligence Surveillance Act collection. You don’t even have to be communicating with a foreigner. You or somebody e-mailing you just needs to reference a target’s e-mail address."}, {"4692": "So, I’ve now mentioned that this target is not necessarily a terrorist because the law allows for surveillance to acquire foreign intelligence information. That’s been interpreted to allow the targeting of individuals who the government has reason to believe or expect — possesses or expected to receive or likely to communicate foreign intelligence information. It’s a broad standard, and the government could then collect the communications of all kinds of foreigners around the world."}, {"9eab": "So think about how easy it would be for an American business leader to be in contact with a broad set of potential targets of this program. Consider how easy it would be for Americans communicating with other Americans to forward the e-mails of these people. All of this could be collected by the government."}, {"d073": "The upstream collection also includes the collection of what are called multicommunications transactions. This is when the N.S.A. collects an e-mail that is to, from, or about a target, but the e-mail is embedded among multiple other communications that are not. These communications may have nothing to do with the target, but the government just kind of sort of ends up with them. And some of them are sent and received entirely within the United States."}, {"db5f": "These are the ways in which law-abiding Americans, innocent law-abiding Americans who have done absolutely nothing wrong both overseas and in the United States can have their communications collected under the Foreign Intelligence Surveillance Act. These are law-abiding Americans, innocent Americans, and they’re not necessarily suspected of anything. And it is their privacy and their constitutional rights that has caused Democrats and Republicans here in this body and in the other body to seek the actual numbers of how many law-abiding Americans are getting swept up in these searches that are supposed to target foreigners overseas."}, {"c4a7": "Constitutionality"}, {"e542": "Now, the reason that this is important, Mr. President, is the program is getting bigger and bigger. Exact numbers are classified, but the government’s public reporting confirms steady increases in collection. At some point the size of the program, the extent to which Americans’ communications are being collected raises obvious concerns about our Fourth Amendment."}, {"fa05": "The question is not if the program raises constitutional concerns but when. And that gets to the heart of what our bipartisan coalition has been concerned about. If it’s not possible for the Senate to know as part of reauthorizing this law how many Americans are being swept up by this program, you cannot determine whether the government has crossed a constitutional line."}, {"558f": "Now, the Privacy and Civil Liberties Oversight Board, this is an agency that the Congress has tasked to look at these issues, this agency has raised the very same concerns I’m outlining this morning. In the 2014 report by the board, a nonpartisan organization tasked by the Congress, they concluded that the lack of information about the collection of the communications of law-abiding Americans under section 702 “hampers attempts to gauge whether the program appropriately balances national security interests with the privacy of U.S. persons.” And they went on to say that the program is “close to the line of constitutional reasonableness. At the very least too much expansion in the collection of U.S. Persons’ communications or the uses to which these communications are put may push the program over the line.”"}, {"01ce": "They recommended, Mr. President, exactly what our bipartisan coalition has been calling for, that the government provide to the Congress and to the extent consistent with national security that the public and the Congress get data on the collection of these communications of law-abiding Americans."}, {"9af4": "The use of Section 702 collection"}, {"84ab": "Now, the most frequently heard argument against what our bipartisan group of House and Senate members have been calling for is that whatever number of communications are being collected on law-abiding Americans, it is minimized which implies that information about Americans is hidden."}, {"96c6": "And this is a particularly important issue, Mr. President. I’ve heard my colleagues on the other side talk frequently. Well, you know, if law-abiding Americans are having their communications swept up, we shouldn’t get all concerned about that because this array of Americans’ communications is being minimized, and somehow that means that it’s not getting out. It’s being hidden. That’s not what necessarily happens."}, {"a389": "To begin with, all that collection does not necessarily stay at the National Security Agency. E-mails collected through the PRISM component of section 702 may go to several other agencies, including the C.I.A. and the F.B.I. Then you have those three agencies in particular authorized to conduct searches through the data for communications that are to, from, or about Americans. Look for an American’s name, telephone number, e-mail address, even a key word or phrase. They can do that without any warrant. There doesn’t have to be even a suspicion, even a suspicion that an American is engaged in any kind of wrongdoing."}, {"3286": "The F.B.I.’s authorities are even broader. The F.B.I. can also conduct searches for communications that are to, from, or about an American to seek evidence of a crime. Unlike the National Security Agency and the Central Intelligence Agency, the F.B.I. doesn’t even report how many searches for Americans it’s conducting. Moreover, neither the F.B.I. Nor the C.I.A. Reports on the number of searches for Americans it conducts using metadata collected under section 702."}, {"1ca5": "Now, the authority to conduct searches for Americans’ communications in section 702 data is new. Before 2011, the FISA court prohibited, prohibited queries for U.S. persons. I’m going to repeat that: Under the Bush Administration and the first two years of the Obama Administration, it was not possible to conduct these back-door, warrantless searches of law-abiding Americans. Then the Obama Administration sought to change the rules and obtained authority to conduct them."}, {"7342": "In April, 2014, the Director of National Intelligence in response to questions from myself and Senator Mark Udall publicly acknowledged these warrantless searches, and by June 2015, the House voted overwhelmingly to prohibit them. That prohibition didn’t become law, but I can tell you it’s sure going to be considered in the context of this reauthorization, and the House voted overwhelmingly, overwhelmingly to prohibit these warrantless searches."}, {"cb74": "So the question really is what exactly is the privacy impact of these warrantless searches for Americans?"}, {"a159": "In 2014, I managed to extract from the intelligence community some but not all the necessary information about how many Americans have been the subject of the searches. That was a step forward, but what the data doesn’t tell us is: who are the subjects of these searches, and, more to the point, it doesn’t tell us how many Americans are potentially the subject of these searches. If the number is small, the potential for abuse obviously would be smaller. If the number is large, just the opposite. Potential for abuse is much greater. Without an understanding of the size of the pool from which the government can pull the communications of law-abiding Americans, there is just no way of knowing how easy it would be for the government to use this law as a means to read the e-mails of a political opponent, a business leader, a journalist or an activist."}, {"8576": "Reverse Targeting"}, {"4e91": "I now want to turn to the ultimate form of abuse, and that is something called reverse targeting. Prohibited by law, it’s defined as collection. If the purpose of the acquisition is to target a particular known person reasonably believed to be in the United States. This is a prohibition that also applies to U.S. persons."}, {"620f": "The question, though, is how is this defined and how can the public be assured it’s not happening? If you look at the language, you can see why there has been bipartisan concern. The collection is only prohibited if the purpose is to get the communications of Americans. The question obviously has arisen what if getting the Americans’ communications is only one of the purposes of collecting on an overseas target? What is actually acceptable here?"}, {"9dc0": "This issue was concerning in 2008 when the Foreign Intelligence Surveillance Act amendments passed with a prohibition on reverse targeting, but that was before the Congress knew about the collection of e-mails that are only about a foreign target and that could be to and from Americans. That was before the Obama administration sought and obtained authority to conduct warrantless searches for communications to, from and about Americans out of section 702 PRISM collection."}, {"5484": "And that makes an important point to me, Mr. President. This bipartisan coalition of which I have been part of has fought back against executive branch overreach, whether it is Democratic administration or a Republican administration. And I cited the fact that President Obama brought back something with a great potential for abuse that President Bush said he wanted no part of."}, {"f4cc": "So as we look at these issues, it’s important to understand exactly what the scope of the problem is. Each of the agencies authorized to conduct these warrantless searches, the N.S.A., the F.B.I., the C.I.A., are also authorized to identify the overseas targets of section 702. The agencies that have developed an interest in Americans’ communications and are actually looking for these communications are the same agencies that are in a position to encourage ongoing collection of those communications by targeting the overseas party."}, {"932a": "So I believe, our bipartisan group believes that there is very substantial potential for abuse, and because of these decisions taking place in the executive branch without any judicial oversight, it’s possible that no one would ever know."}, {"adca": "Excuses"}, {"510f": "Now, to quote the privacy oversight board, since the enactment of the FISA Amendments act, the extent to which the government requires the communications of U.S. persons has been one of the biggest open questions about the program and a continuing source of public concern. The board noted that the Executive Branch has responded with any number of excuses for why it couldn’t provide a number of how many innocent law-abiding Americans get swept up in these searches."}, {"276a": "One excuse has been the size of the program, but as members, Democrats and Republicans have said repeatedly, an estimate, perhaps based on a simple, is sufficient. Nobody is dictating how this would be done."}, {"5f2d": "Another excuse has been that determining whether individuals whose communications have been collected are American would itself be invasive of privacy. Now, this is something of a head scratcher, and I will just say the value of knowing how many law-abiding Americans get swept up in these searches, that privacy advocates have stated that this far-fetched theory, far-fetched excuse for not furnishing it doesn’t add up in terms of the benefit of finding how many Americans are swept up in these warrantless searches. The government is genuinely concerned about the privacy implications of calculating the number."}, {"e0c2": "I and many of my colleagues, both Democrats and Republicans, have been willing and we have renewed this in the last few weeks to have a discussion about the methodology, you know, under consideration."}, {"b216": "What’s ahead"}, {"f136": "In the months ahead, the Senate is going to be debating a number of issues relating to this topic, such as U.S. person searches, reverse targeting and the collection of communications that are just about the target. The Senate is going to discuss how to strengthen oversight by the Foreign Intelligence Surveillance Court, the privacy board. The Director of National Intelligence will be right in the center of the debate, and there is more information that the American people need, and there is more information that this body needs to carry out its responsibility to do real oversight here."}, {"f4ae": "The center of these discussions about the reauthorization of the Foreign Intelligence Surveillance Act involves one question — how many innocent law-abiding Americans have been swept up in this program that has been written and developed to target foreigners overseas. Congress’ judgment about the impact of section 702 depends on getting this number."}, {"18e1": "An assessment of the program’s constitutionality rests on the understanding of the impact it has on Americans. The implications of the warrantless search of Americans requires knowing how many Americans’ communications are being searched through. Countless questions related to the reauthorization of the program all require that the public have this information."}, {"2c20": "And I’m just going to close by way of saying what those questions are, because if you want to do real oversight over a critically important program, you’ve got to have the information to respond to these questions. The questions are should there be safeguards against reverse targeting? Should the Congress legislate on upstream collection, collection of communications about targets because it raises unique concerns about the collection of the communications of law-abiding Americans? Are the rules related to the dissemination and use and retention of these communications adequate? Should there be limits on the use of these communications by the F.B.I. For non-intelligence purposes?"}, {"75fa": "Just think about that one for a minute, Mr. President. What does it mean to people in our part of the world where people feel that liberty and security are not mutually exclusive, that they are going to insist on both, what does it mean to them on the question of whether there ought to be limits on the use of this information by the F.B.I. For non-intelligence purposes? That’s exactly the kind of question that people are going to ask."}, {"5cf4": "I’m heading home today for town hall meetings in rural areas, and those are exactly the kind of questions that Oregonians ask. People understand this is a dangerous time. That’s not at issue. If you serve on the Intelligence Committee, and along with Senator Feinstein, I have been one of the longer serving members. The fact that this is a dangerous world is not a debatable proposition. There are a lot of people out there who do not wish our country well."}, {"96ed": "But what I say to Oregonians, what I will say again this weekend, any politician who tells you you’ve got to give up your liberty to have security is not somebody who’s working in your interest, because smart policies give you both. That’s why I started talking about the benefits of strong encryption, critically important for security, critically important for liberty. And these questions are ones that I don’t think are particularly partisan. That’s why a big group of Democrats and Republicans here and in the other body have been seeking the information about how many law-abiding Americans get caught up in these efforts to target a foreigner overseas, and we are now at a critical moment. A government surveillance program with very obvious implications for the privacy and constitutional rights. It’s up for reauthorization by the end of the year."}, {"0e21": "While more information may be part of the answer, we have got to have the best possible estimate to answer those questions that I just outlined. The American people want Congress to get to the bottom of questions that go right to the heart of our having policies that promote both their security and their liberty. I think the public expects a full debate. You can’t have a full debate. You cannot have a full and real debate over the Foreign Intelligence Surveillance Act unless you have some sense of how many law-abiding Americans are getting swept up in these searches of foreigners."}, {"6d62": "I believe the American people expect serious oversight through it. They want assurances that their representatives in Congress have a sense of what is actually being voted on, and after years of secret surveillance programs being revealed only in the news media, I think the public has rightly insisted on more openness and more transparency."}, {"b174": "So getting the information that I have described today that will deal with Senator Coats’ top priority, reauthorizing the Foreign Intelligence Surveillance Act is a critical first step. Once the Senate knows the impact of this program on Americans, then you can have a full and real discussion, a real debate in Congress with the public and with the Director of National Intelligence."}, {"439b": "I took the view in the committee, Mr. President, despite very much liking Dan Coats and his being the bipartisan cosponsor of what is still the only federal income tax reform proposal we’ve had in the Senate since the 1986 law was authored, I said that I can’t support any nominee to be the head of national intelligence if that nominee will not guarantee that before this reauthorization is brought before the Senate and brought before the Intelligence Committee, that we have the information needed to do our jobs, to do real oversight, to show the American people that it’s possible to come up with policies that promote security and liberty and for that reason, despite my friendship for Senator Coats, I cannot support the nomination."}], "child": "1576_1\t1576_2\t1576_3\t1576_4\t1576_5\t1576_6\t1576_7"}