{"name": "1595", "parent": "", "content": "Republican senator says Elizabeth Warren shouldn’t criticize Sessions — even if it’s the truth “Think of his wife.” Sen. Orrin Hatch (R-UT) CREDIT: AP Photo/Alex Brandon The world’s greatest deliberative body can’t handle the truth, apparently. A top Republican senator was “astounded” that Democratic Sen. Elizabeth Warren (MA) lacked the “etiquette and courtesy” to “think of the wife” of colleague Jeff Sessions, the U.S. attorney general nominee, before criticizing his record on voting rights. Sen. Orrin Hatch (R-UT) took to the Senate floor Tuesday night to accuse Warren of lacking the appropriate decorum. In his speech, Hatch accused Warren of being indelicate in her opposition, saying that senators “ought to be ashamed of ourselves” and that he “resented the constant diatribe against a fellow senator.” Earlier, Warren read a letter by Coretta Scott King, the widow of Martin Luther King Jr., which opposed the nomination of Sessions to a federal judgeship in 1986. King’s letter accused Sessions of blunting the rights of black citizens when he was a U.S. attorney in Alabama. The senate voted to silence Warren in a party-line vote. “Jeff Sessions is a very fine person,” Hatch said in his speech. “Think of his wife. She is a really fine person. Jeff has been here 20 years. He’s interchanged with almost all of us. Sometimes you agree with him and sometimes you disagree with him, but he’s always been a gentleman. He’s always been kind and considerate of his colleagues. I can’t name one time when he wasn’t. And yet we’re treating him like he is some terrible person that doesn’t deserve to be chosen by the current president of the United States to be attorney general of the United States.” “I think we have to grow up and I suggest all of us take stock in ourselves and see if we can treat each other with greater respect,” Hatch added. “But I have to say, I resented — as much as I like the distinguished senator from Massachusetts — I resented the constant diatribe against a fellow senator. Even if everything she said was true, I don’t think that was the right thing to do.” Hatch later accused Democratic senators for not treating Sessions with respect because they were still “very upset” that President Donald Trump won the general election in November. Elizabeth Warren was just silenced on the Senate floor. Her crime was quoting Coretta Scott King.A low moment for the world’s greatest deliberative body.thinkprogress.org Warren’s opposition to Sessions follows accusations that he supported white supremacist groups and used racially charged remarks in the past. Among some of his most egregious offenses, Sessions allegedly called a black assistant U.S. assistant “boy,” joked that the Ku Klux Klan was “okay” until he found out that members smoked marijuana, dismissed comprehensive immigration reform as an “ethnic politics,” and has called the Voting Rights Act a “piece of intrusive legislation.” ", "title": "Republican senator says Elizabeth Warren shouldn’t criticize Sessions — even if it’s the truth", "sentences": [{"3b5f": "Republican senator says Elizabeth Warren shouldn’t criticize Sessions — even if it’s the truth"}, {"2f15": "“Think of his wife.”"}, {"2ed0": "Sen. Orrin Hatch (R-UT) CREDIT: AP Photo/Alex Brandon"}, {"60c4": "The world’s greatest deliberative body can’t handle the truth, apparently."}, {"9871": "A top Republican senator was “astounded” that Democratic Sen. Elizabeth Warren (MA) lacked the “etiquette and courtesy” to “think of the wife” of colleague Jeff Sessions, the U.S. attorney general nominee, before criticizing his record on voting rights."}, {"91ce": "Sen. Orrin Hatch (R-UT) took to the Senate floor Tuesday night to accuse Warren of lacking the appropriate decorum. In his speech, Hatch accused Warren of being indelicate in her opposition, saying that senators “ought to be ashamed of ourselves” and that he “resented the constant diatribe against a fellow senator.”"}, {"e6a7": "Earlier, Warren read a letter by Coretta Scott King, the widow of Martin Luther King Jr., which opposed the nomination of Sessions to a federal judgeship in 1986. King’s letter accused Sessions of blunting the rights of black citizens when he was a U.S. attorney in Alabama. The senate voted to silence Warren in a party-line vote."}, {"daf6": "“Jeff Sessions is a very fine person,” Hatch said in his speech. “Think of his wife. She is a really fine person. Jeff has been here 20 years. He’s interchanged with almost all of us. Sometimes you agree with him and sometimes you disagree with him, but he’s always been a gentleman. He’s always been kind and considerate of his colleagues. I can’t name one time when he wasn’t. And yet we’re treating him like he is some terrible person that doesn’t deserve to be chosen by the current president of the United States to be attorney general of the United States.”"}, {"bc08": "“I think we have to grow up and I suggest all of us take stock in ourselves and see if we can treat each other with greater respect,” Hatch added. “But I have to say, I resented — as much as I like the distinguished senator from Massachusetts — I resented the constant diatribe against a fellow senator. Even if everything she said was true, I don’t think that was the right thing to do.”"}, {"25bb": "Hatch later accused Democratic senators for not treating Sessions with respect because they were still “very upset” that President Donald Trump won the general election in November."}, {"487f": "Elizabeth Warren was just silenced on the Senate floor. Her crime was quoting Coretta Scott King.A low moment for the world’s greatest deliberative body.thinkprogress.org"}, {"7b68": "Warren’s opposition to Sessions follows accusations that he supported white supremacist groups and used racially charged remarks in the past."}, {"325f": "Among some of his most egregious offenses, Sessions allegedly called a black assistant U.S. assistant “boy,” joked that the Ku Klux Klan was “okay” until he found out that members smoked marijuana, dismissed comprehensive immigration reform as an “ethnic politics,” and has called the Voting Rights Act a “piece of intrusive legislation.”"}], "child": "1595_1\t1595_2\t1595_3\t1595_4\t1595_5\t1595_6\t1595_7\t1595_8\t1595_9\t1595_10\t1595_11\t1595_12\t1595_13\t1595_14\t1595_15\t1595_16\t1595_17"}