{"name": "1597", "parent": "", "content": "Who Is Merrick Garland? President Barack Obama and first lady Michelle Obama stop to look at a portrait of Supreme Court Justice Antonin Scalia after paying their respects at Scalia’s casket in the Great Hall of the Supreme Court in Washington, Friday, Feb. 19, 2016. CREDIT: AP PHOTO/PABLO MARTINEZ MONSIVAIS Sen. Orrin Hatch (R-UT), the longest serving Republican on the Senate Judiciary Committee, offered his own thoughts on who President Obama should nominate to fill the seat left open by the death of Justice Antonin Scalia last week. “[Obama] could easily name Merrick Garland, who is a fine man,” Hatch told the conservative news site Newsmax, before adding that “he probably won’t do that because this appointment is about the election. So I’m pretty sure he’ll name someone the [liberal Democratic base] wants.” On Wednesday, the president reportedly plans to call Hatch’s bluff. Multiple sources report that the president will announce his nomination of Garland, the chief judge of the United States Court of Appeals for the District of Columbia Circuit, to fill Scalia’s seat. Follow us on Facebook for continued coverage on the SCOTUS nomination. Chief Judge Merrick Garland Garland is unquestionably qualified to sit on the Supreme Court. A 19 year veteran of the DC Circuit — a court that is widely viewed as the second-most powerful in the nation — Garland graduated with high honors from Harvard Law School. He clerked for Justice William Brennan, and spent a few years as a partner in the multinational law firm Arnold and Porter. He also held senior positions in the Justice Department, including a leadership role in the department’s criminal division and a stint as Principal Associate Deputy Attorney General. At age 63, Garland is also the oldest person nominated to the Supreme Court since President Nixon named Justice Lewis Powell in 1971. Thus, if confirmed, Garland is unlikely to match — or even approach — Justice Scalia’s nearly 30 years on the Supreme Court. 6 Quotes From Senate Republicans About Merrick Garland That Are Really Awkward NowJustice by CREDIT: AP Photo/J. Scott Applewhite Senate Majority Leader Mitch McConnell (R-KY) vowed moments after…thinkprogress.org Garland’s relatively advanced age may help explain why Hatch floated the DC Circuit chief judge as his ideal Obama nominee. Another factor that almost certainly played a role is Garland’s reputation for moderation. In 2003, for example, Garland joined an opinion holding that the federal judiciary lacks the authority “to assert habeas corpus jurisdiction at the behest of an alien held at a military base leased from another nation, a military base outside the sovereignty of the United States” — an opinion that effectively prohibited Guantanamo Bay detainees from seeking relief in civilian courts. A little over a year later, the Supreme Court reversed this decision in Rasul v. Bush. Although, in fairness, it should be noted that legal experts disagree about whether the decision Garland joined was mandated by existing precedents. The former prosecutor also has a relatively conservative record on criminal justice. A 2010 examination of his decisions by SCOTUSBlog’s Tom Goldstein determined that “Judge Garland rarely votes in favor of criminal defendants’ appeals of their convictions.” Goldstein “identified only eight such published rulings,” in addition to seven where “he voted to reverse the defendant’s sentence in whole or in part, or to permit the defendant to raise a argument relating to sentencing on remand,” during the 13 years Garland had then spent on the DC Circuit. To be clear, Garland’s record does not suggest that he would join the Court’s right flank if confirmed to the Supreme Court. He would likely vote much more often than not with the Supreme Court’s liberals, while occasionally casting a heterodox vote. Nevertheless, as Goldstein wrote in 2010 when Garland was under consideration to replace the retiring liberal Justice John Paul Stevens, “to the extent that the President’s goal is to select a nominee who will articulate a broad progressive vision for the law, Judge Garland would be a very unlikely candidate to take up that role.” That Awkward Moment When The GOP's Top Judicial Attack Dog Sang Merrick Garland's PraisesJustice by CREDIT: AP Photo/Evan Vucci Supreme Court nominee Merrick Garland once earned considerable praise from a…thinkprogress.org The Garland nomination, in other words, appears to be an attempt to box in Senate Republicans who’ve refused to confirm anyone Obama nominates. There are strong reasons to doubt whether this strategy will work, however. Sen. Hatch, who undoubtedly regrets his decision to praise Garland shortly before this nomination, has outright refused to meet with anyone Obama nominates to replace Scalia. And he’s far from alone within the GOP caucus. ", "title": "Who Is Merrick Garland?", "sentences": [{"8e7e": "Who Is Merrick Garland?"}, {"ee18": "President Barack Obama and first lady Michelle Obama stop to look at a portrait of Supreme Court Justice Antonin Scalia after paying their respects at Scalia’s casket in the Great Hall of the Supreme Court in Washington, Friday, Feb. 19, 2016. CREDIT: AP PHOTO/PABLO MARTINEZ MONSIVAIS"}, {"0583": "Sen. Orrin Hatch (R-UT), the longest serving Republican on the Senate Judiciary Committee, offered his own thoughts on who President Obama should nominate to fill the seat left open by the death of Justice Antonin Scalia last week. “[Obama] could easily name Merrick Garland, who is a fine man,” Hatch told the conservative news site Newsmax, before adding that “he probably won’t do that because this appointment is about the election. So I’m pretty sure he’ll name someone the [liberal Democratic base] wants.”"}, {"71cb": "On Wednesday, the president reportedly plans to call Hatch’s bluff. Multiple sources report that the president will announce his nomination of Garland, the chief judge of the United States Court of Appeals for the District of Columbia Circuit, to fill Scalia’s seat."}, {"68be": "Follow us on Facebook for continued coverage on the SCOTUS nomination."}, {"14f2": "Chief Judge Merrick Garland"}, {"48cd": "Garland is unquestionably qualified to sit on the Supreme Court. A 19 year veteran of the DC Circuit — a court that is widely viewed as the second-most powerful in the nation — Garland graduated with high honors from Harvard Law School. He clerked for Justice William Brennan, and spent a few years as a partner in the multinational law firm Arnold and Porter. He also held senior positions in the Justice Department, including a leadership role in the department’s criminal division and a stint as Principal Associate Deputy Attorney General."}, {"5bda": "At age 63, Garland is also the oldest person nominated to the Supreme Court since President Nixon named Justice Lewis Powell in 1971. Thus, if confirmed, Garland is unlikely to match — or even approach — Justice Scalia’s nearly 30 years on the Supreme Court."}, {"e145": "6 Quotes From Senate Republicans About Merrick Garland That Are Really Awkward NowJustice by CREDIT: AP Photo/J. Scott Applewhite Senate Majority Leader Mitch McConnell (R-KY) vowed moments after…thinkprogress.org"}, {"c2ea": "Garland’s relatively advanced age may help explain why Hatch floated the DC Circuit chief judge as his ideal Obama nominee. Another factor that almost certainly played a role is Garland’s reputation for moderation. In 2003, for example, Garland joined an opinion holding that the federal judiciary lacks the authority “to assert habeas corpus jurisdiction at the behest of an alien held at a military base leased from another nation, a military base outside the sovereignty of the United States” — an opinion that effectively prohibited Guantanamo Bay detainees from seeking relief in civilian courts. A little over a year later, the Supreme Court reversed this decision in Rasul v. Bush. Although, in fairness, it should be noted that legal experts disagree about whether the decision Garland joined was mandated by existing precedents."}, {"fa84": "The former prosecutor also has a relatively conservative record on criminal justice. A 2010 examination of his decisions by SCOTUSBlog’s Tom Goldstein determined that “Judge Garland rarely votes in favor of criminal defendants’ appeals of their convictions.” Goldstein “identified only eight such published rulings,” in addition to seven where “he voted to reverse the defendant’s sentence in whole or in part, or to permit the defendant to raise a argument relating to sentencing on remand,” during the 13 years Garland had then spent on the DC Circuit."}, {"38c6": "To be clear, Garland’s record does not suggest that he would join the Court’s right flank if confirmed to the Supreme Court. He would likely vote much more often than not with the Supreme Court’s liberals, while occasionally casting a heterodox vote. Nevertheless, as Goldstein wrote in 2010 when Garland was under consideration to replace the retiring liberal Justice John Paul Stevens, “to the extent that the President’s goal is to select a nominee who will articulate a broad progressive vision for the law, Judge Garland would be a very unlikely candidate to take up that role.”"}, {"8792": "That Awkward Moment When The GOP's Top Judicial Attack Dog Sang Merrick Garland's PraisesJustice by CREDIT: AP Photo/Evan Vucci Supreme Court nominee Merrick Garland once earned considerable praise from a…thinkprogress.org"}, {"3c5a": "The Garland nomination, in other words, appears to be an attempt to box in Senate Republicans who’ve refused to confirm anyone Obama nominates. There are strong reasons to doubt whether this strategy will work, however. Sen. Hatch, who undoubtedly regrets his decision to praise Garland shortly before this nomination, has outright refused to meet with anyone Obama nominates to replace Scalia. And he’s far from alone within the GOP caucus."}], "child": "1597_1"}