{"name": "1612", "parent": "", "content": "Trump threatens cutting off payments for low-income people to get health care “I don’t want people to get hurt,” said Trump. President Donald Trump listens during a news conference with NATO Secretary General Jens Stoltenberg in the East Room of the White House, Wednesday, April 12, 2017, in Washington. CREDIT: Evan Vucci President Donald Trump is still considering whether to continue payments for cost-sharing subsidies that help low-income people get health care, he said in an interview with The Wall Street Journal. The payments reduce copayments and deductibles for low-income people, and their elimination would mean a lot of Americans would go uninsured. Insurers would still have to provide lower deductible plans, but they wouldn’t be paid for it as they are now, which ultimately means that some insurers would either exit the markets to avoid losses or raise premiums. Premiums would need to rise by 19 percent to compensate for the lack of funding for cost-sharing subsidies. Of the 12.1 million people who selected a 2017 Obamacare marketplace plan, 7.1 million are receiving cost-sharing reductions, according to the Kaiser Family Foundation (KFF). The subsidies reduced annual out-of-pocket maximums by up to $5,587. The issue of whether the administration would allow payments to continue is connected to a 2014 lawsuit. House Republicans sued the Obama administration, claiming that Congress did not appropriate the funds for the payments. Although a federal judge said the payments were an overreach from the Obama administration, the judge let payments stay in place as the administration appealed. The presidential election delayed the case further. Trump’s attempts to sabotage Obamacare are making insurers nervousInsurers may pull out of the market if they can’t plan for the future.thinkprogress.org It’s unclear if the Trump administration would continue the appeal, since the administration has sent mixed signals about how it plans to administer the ACA. The Department of Health and Human Services sent The New York Times a statement on Monday telling the publication, “It would be fair for you to report that there has been no policy change in the current administration.” Only two days after that HHS comment to the Times, Trump told The Wall Street Journal, “Obamacare is dead next month if it doesn’t get that money. I haven’t made my viewpoint clear yet. I don’t want people to get hurt….What I think should happen and will happen is the Democrats will start calling me and negotiating.” House Speaker Paul Ryan (R-WI) said he would prefer it if the administration allows the payments to continue. During a web briefing for journalists last week, Larry Levitt, senior vice president of the Kaiser Family Foundation, said the results would be bleak for low-income people if the Trump administration stopped payments. “If insurers exit marketplaces and leave no option available in a region, that means there is no way for people access premium tax credits, so the vast majority of lower-income people getting coverage in marketplaces would end up uninsured,” Levitt said. “So far for 2018, that’s true for 16 counties and Tennessee, where Humana was the only insurer. If other major insurers announced exits, that would leave other counties where there is big increase of people uninsured.” Gary Claxton, a vice president at the Kaiser Family Foundation offered a far more grim prediction, which is that insurers wouldn’t continue to participate through 2017. “If they stopped making payments immediately, I don’t think insurers would continue to participate through the remainder of this year, because they would take substantial losses. They would leave as soon as they were legally able to,” Claxton said. It’s clear who the majority of the public would blame for an Obamacare meltdown. According to a Kaiser Family Foundation poll released this month, 61 percent of the public say President Trump and Republicans in Congress are to blame for future problems with the ACA, since they are in control of the government. ", "title": "Trump threatens cutting off payments for low-income people to get health care", "sentences": [{"5d5c": "Trump threatens cutting off payments for low-income people to get health care"}, {"9f05": "“I don’t want people to get hurt,” said Trump."}, {"5a7f": "President Donald Trump listens during a news conference with NATO Secretary General Jens Stoltenberg in the East Room of the White House, Wednesday, April 12, 2017, in Washington. CREDIT: Evan Vucci"}, {"59d7": "President Donald Trump is still considering whether to continue payments for cost-sharing subsidies that help low-income people get health care, he said in an interview with The Wall Street Journal. The payments reduce copayments and deductibles for low-income people, and their elimination would mean a lot of Americans would go uninsured."}, {"f8f5": "Insurers would still have to provide lower deductible plans, but they wouldn’t be paid for it as they are now, which ultimately means that some insurers would either exit the markets to avoid losses or raise premiums. Premiums would need to rise by 19 percent to compensate for the lack of funding for cost-sharing subsidies."}, {"e047": "Of the 12.1 million people who selected a 2017 Obamacare marketplace plan, 7.1 million are receiving cost-sharing reductions, according to the Kaiser Family Foundation (KFF). The subsidies reduced annual out-of-pocket maximums by up to $5,587."}, {"ec97": "The issue of whether the administration would allow payments to continue is connected to a 2014 lawsuit. House Republicans sued the Obama administration, claiming that Congress did not appropriate the funds for the payments. Although a federal judge said the payments were an overreach from the Obama administration, the judge let payments stay in place as the administration appealed. The presidential election delayed the case further."}, {"9280": "Trump’s attempts to sabotage Obamacare are making insurers nervousInsurers may pull out of the market if they can’t plan for the future.thinkprogress.org"}, {"b786": "It’s unclear if the Trump administration would continue the appeal, since the administration has sent mixed signals about how it plans to administer the ACA. The Department of Health and Human Services sent The New York Times a statement on Monday telling the publication, “It would be fair for you to report that there has been no policy change in the current administration.”"}, {"3030": "Only two days after that HHS comment to the Times, Trump told The Wall Street Journal, “Obamacare is dead next month if it doesn’t get that money. I haven’t made my viewpoint clear yet. I don’t want people to get hurt….What I think should happen and will happen is the Democrats will start calling me and negotiating.”"}, {"3be5": "House Speaker Paul Ryan (R-WI) said he would prefer it if the administration allows the payments to continue."}, {"017e": "During a web briefing for journalists last week, Larry Levitt, senior vice president of the Kaiser Family Foundation, said the results would be bleak for low-income people if the Trump administration stopped payments."}, {"bdfa": "“If insurers exit marketplaces and leave no option available in a region, that means there is no way for people access premium tax credits, so the vast majority of lower-income people getting coverage in marketplaces would end up uninsured,” Levitt said. “So far for 2018, that’s true for 16 counties and Tennessee, where Humana was the only insurer. If other major insurers announced exits, that would leave other counties where there is big increase of people uninsured.”"}, {"db75": "Gary Claxton, a vice president at the Kaiser Family Foundation offered a far more grim prediction, which is that insurers wouldn’t continue to participate through 2017."}, {"7df0": "“If they stopped making payments immediately, I don’t think insurers would continue to participate through the remainder of this year, because they would take substantial losses. They would leave as soon as they were legally able to,” Claxton said."}, {"2eb6": "It’s clear who the majority of the public would blame for an Obamacare meltdown. According to a Kaiser Family Foundation poll released this month, 61 percent of the public say President Trump and Republicans in Congress are to blame for future problems with the ACA, since they are in control of the government."}], "child": "1612_1\t1612_2\t1612_3\t1612_4\t1612_5"}