{"name": "1613", "parent": "", "content": "Members of Congress are facing constituent wrath for trying to repeal Obamacare The resistance is still alive and well at town halls. Republican lawmakers are not having an easy time during the first recess since Congress tried and failed to repeal and replace the Affordable Care Act. At town halls across the country, constituents are pressing GOP members of Congress about their support for a plan that would have stripped health insurance away from 24 million Americans. The questions are receiving standing ovations, while the lawmakers are being booed and jeered. In New Jersey on Wednesday, a woman asked Rep. Leonard Lance (R-NJ) about his support for repealing President Obama’s signature health care law and about the congressman’s plan to defund Planned Parenthood. The crowd gave the question a 30-second standing ovation, according to a spokesperson for the women’s health organization. While the audience continued screaming, Lance struggled to defend his support for dividing Planned Parenthood into “two completely separate organizations” — one to “deal with” women’s health and the other to perform abortions. As he spoke, one woman pointed out that zero women were present at the GOP’s meeting in which they decided to slash women’s health services. Lance also defended health care access in his district, telling constituents that there are six federally qualified health centers in the area, two of which are dentists offices. “If I’m pregnant, I don’t need a dental clinic,” one woman yelled. Across the country on Wednesday night, Colorado’s Rep. Mike Coffman (R-CO) faced similar constituent anger over his decision to support the GOP’s health care plan. According to CNN, Coffman fielded more than 40 questions for almost two hours, with health care dominating the evening. One woman, who said she was a health care worker with pre-existing conditions, asked how the congressman would support a plan that would eliminate her coverage. “Are you going to side with Trump or are you going to … stand with your constituents?” she asked. According to Politico, another constituent stood up to say her cousin with epilepsy would die without Medicaid, and other pressed Coffman to explain his vote. “I’m sorry to say I was shocked when you declared your intention to vote for the American Health Care Act,” said Steven Haas, a 68-year-old life-long registered Republican. “That is not the way we do things here in Colorado.” Meanwhile, many in the room shouted and held up signs reading “Medicare for all” and “Save Obamacare.” Confronted with talking to constituents about health care, these GOP lawmakers chose to hideMembers of Congress are fleeing from concerned constituents.thinkprogress.org In Arizona this week, concerned constituents also pressed freshman Rep. Andy Biggs (R-AZ), one of the hard-line members of the Freedom Caucus that helped sabotage Speaker Paul Ryan’s health care bill. According to local reporters, one constituent spoke about his anxiety about creating high-risk insurance pools, a policy favored by Republican lawmakers that would make it more difficult for people with conditions like Type I diabetes to afford care. The congressman was also booed throughout the evening. And on Monday, Rep. Joe Wilson (R-SC) — the congressman who shouted “you lie” at President Obama during a joint session of Congress in 2009 — got a taste of his own medicine. Constituents flung his signature phrase back at him when he spoke about his position on the Affordable Care Act. According to the New York Times, “after he said the law was delaying and denying health services to its intended recipients, the rest of his comments were drowned out, as the crowd began to chant ‘you lie’ in unison. The cheer continued for about 20 seconds.” Helen Kalla, press manager for the Indivisible Guide, told ThinkProgress that her group is seeing constituents mobilize in large numbers this recess. “Constituents across the country are showing up in droves this recess to hold their members of Congress accountable for supporting Trumpcare,” she said. “Republicans considering taking another swipe at the ACA need to know that the fight is over and it’s time to move on.” Constituents expressed similar anger at town hall events during the February Congressional recess, before the House GOP had officially introduced its health care plan. The reactions to lawmakers during that week helped scare lawmakers away from voting to repeal Obamacare before the party had proposed a replacement. ", "title": "Members of Congress are facing constituent wrath for trying to repeal Obamacare", "sentences": [{"5007": "Members of Congress are facing constituent wrath for trying to repeal Obamacare"}, {"a58d": "The resistance is still alive and well at town halls."}, {"ce4a": "Republican lawmakers are not having an easy time during the first recess since Congress tried and failed to repeal and replace the Affordable Care Act."}, {"d4ed": "At town halls across the country, constituents are pressing GOP members of Congress about their support for a plan that would have stripped health insurance away from 24 million Americans. The questions are receiving standing ovations, while the lawmakers are being booed and jeered."}, {"d564": "In New Jersey on Wednesday, a woman asked Rep. Leonard Lance (R-NJ) about his support for repealing President Obama’s signature health care law and about the congressman’s plan to defund Planned Parenthood. The crowd gave the question a 30-second standing ovation, according to a spokesperson for the women’s health organization. While the audience continued screaming, Lance struggled to defend his support for dividing Planned Parenthood into “two completely separate organizations” — one to “deal with” women’s health and the other to perform abortions."}, {"51f6": "As he spoke, one woman pointed out that zero women were present at the GOP’s meeting in which they decided to slash women’s health services."}, {"b90e": "Lance also defended health care access in his district, telling constituents that there are six federally qualified health centers in the area, two of which are dentists offices."}, {"d004": "“If I’m pregnant, I don’t need a dental clinic,” one woman yelled."}, {"b2b6": "Across the country on Wednesday night, Colorado’s Rep. Mike Coffman (R-CO) faced similar constituent anger over his decision to support the GOP’s health care plan. According to CNN, Coffman fielded more than 40 questions for almost two hours, with health care dominating the evening."}, {"7813": "One woman, who said she was a health care worker with pre-existing conditions, asked how the congressman would support a plan that would eliminate her coverage. “Are you going to side with Trump or are you going to … stand with your constituents?” she asked."}, {"dcab": "According to Politico, another constituent stood up to say her cousin with epilepsy would die without Medicaid, and other pressed Coffman to explain his vote. “I’m sorry to say I was shocked when you declared your intention to vote for the American Health Care Act,” said Steven Haas, a 68-year-old life-long registered Republican. “That is not the way we do things here in Colorado.”"}, {"8091": "Meanwhile, many in the room shouted and held up signs reading “Medicare for all” and “Save Obamacare.”"}, {"45ac": "Confronted with talking to constituents about health care, these GOP lawmakers chose to hideMembers of Congress are fleeing from concerned constituents.thinkprogress.org"}, {"c6a8": "In Arizona this week, concerned constituents also pressed freshman Rep. Andy Biggs (R-AZ), one of the hard-line members of the Freedom Caucus that helped sabotage Speaker Paul Ryan’s health care bill."}, {"8b97": "According to local reporters, one constituent spoke about his anxiety about creating high-risk insurance pools, a policy favored by Republican lawmakers that would make it more difficult for people with conditions like Type I diabetes to afford care."}, {"14ce": "The congressman was also booed throughout the evening."}, {"58c6": "And on Monday, Rep. Joe Wilson (R-SC) — the congressman who shouted “you lie” at President Obama during a joint session of Congress in 2009 — got a taste of his own medicine. Constituents flung his signature phrase back at him when he spoke about his position on the Affordable Care Act."}, {"f2fa": "According to the New York Times, “after he said the law was delaying and denying health services to its intended recipients, the rest of his comments were drowned out, as the crowd began to chant ‘you lie’ in unison. The cheer continued for about 20 seconds.”"}, {"4a6f": "Helen Kalla, press manager for the Indivisible Guide, told ThinkProgress that her group is seeing constituents mobilize in large numbers this recess."}, {"3e36": "“Constituents across the country are showing up in droves this recess to hold their members of Congress accountable for supporting Trumpcare,” she said. “Republicans considering taking another swipe at the ACA need to know that the fight is over and it’s time to move on.”"}, {"d9b2": "Constituents expressed similar anger at town hall events during the February Congressional recess, before the House GOP had officially introduced its health care plan. The reactions to lawmakers during that week helped scare lawmakers away from voting to repeal Obamacare before the party had proposed a replacement."}], "child": "1613_1\t1613_2"}