{"name": "1614", "parent": "", "content": "Does Your State Democratic Party’s Platform Endorse Medicare for All? Let’s Look. In June, the Massachusetts Democratic Party will be updating its platform at the state convention in Worcester. Although it is far from perfect, the Mass Dems platform is pretty progressive — far more so than our actual Legislature. It can often be tragically funny how divergent the platform and the real politicians are. My go-to example of this is that the Mass Dems platform calls for a single payer/Medicare for All health care system…. Massachusetts Democrats believe that every person should enjoy good quality of life and good health and wellbeing. We believe that high-quality and affordable health care should be available to all through a single payer government sponsored program like Medicare, regardless of employment status. We support policies which not only make healthcare more affordable, but which reduce its overall cost. We believe that every person and family should have access to what is needed to help them to grow and thrive while living successfully in economic independence. …but only about a third of the Democrats in each house support legislation to that effect. The single payer in MA has the support of only 10 out of 34 Democratic state senators and only 41 out of 126 Democratic state representatives. On the national level, single payer has been seeing momentum in the House Democratic caucus, where John Conyers (MI-13)’s Improved and Expanded Medicare for All bill recently achieved a record number of co-sponsors (with near half the caucus). Bernie Sanders will be releasing a Senate bill later this month, and we’ll see how many co-sponsors he is able to secure. This made me start thinking about the state of single payer/Medicare for All advocacy across states and whether other state parties call for it in their platforms. How many other state Democratic parties have embraced Medicare for All in their platform? The answer: 15. Alaska Democratic Party Alaska’s fiscal health is dependent upon the health of its people and their access to affordable health care. We support…Development and implementation of a single payer system to reduce and control costs…. California Democratic Party California Democrats believe that health care is a human right not a privilege. We recognizes the health and well-being of Californians cannot continue to be based on arbitrary private and public financial decisions and therefore advocates legislation to create and implement a publicly funded (single-payer), privately delivered, fiscally tractable, affordable, comprehensive, secure, high-quality, efficient, and sustainable health care system for all Californians. Colorado Democratic Party The health of our citizens is essential to the strength of our nation. We believe that government’s policies should “promote the general Welfare and secure the Blessing of Liberty to ourselves” as written in the opening lines of the Constitution of the United States. We believe, as a matter of social justice, that health care for all in the United States is a basic and necessary human right, that it is essential to the security of our nation, and that it serves the common good. Universal access to necessary medical services is required to preserve freedom, liberty, opportunity, and ability to be productive. We support the recently enacted healthcare reform legislation Patient Protection and Affordable Care Act (PPACA) as a first step in the process toward a quality universal single-payer health care system that is independent of employment and focuses on patient care first and foremost. Hawaii Democratic Party Access to health care is a basic human need. Our citizens and visitors have an inherent right to high quality, high standard health care….We support national healthcare reform via single payer universal healthcare. We also encourage the inclusion of a public option in the current national health care plan. Iowa Democratic Party We support: * universal access to affordable healthcare *single payer health care system Maine Democratic Party We support a democratic government that:1. Affirms health care as a fundamental human right and takes action to improve the health and wellness of all people by ensuring them access to quality and affordable health care. This goal is best achieved through the adoption of a universal, single-payer and non-profit health care system for Maine and the nation by extending Medicare to all. Minnesota Democratic-Farmer-Labor Party We believe that all people should have the opportunity to be self-sufficient, secure and healthy. Cost-effective and adequately funded programs can helpensure these basic needs. We support….Nationally funded, community-based comprehensive and affordable health care for all…Adoption of a single payer health care system. New Mexico Democratic Party Health is a basic need and right, and the New Mexico State Constitution should be amended to reflect that right (2011). Publicly financed healthcare should cover dental health, mental health, and vision, as well as preventative care. Medicare and Medicaid must be fully funded and fully supported and be expanded to cover all US citizens and residents regardless of age (2006). North Dakota Democratic-NPL Party Single Payer Health Insurance: The Dem-NPL Party supports implementation of a universal single-payer healthcare system. Oregon Democratic Party We believe in a strong social safety net and basic health care as a human right…We believe in a comprehensive single-payer system of health care such as improved Medicare for all. Texas Democratic Party Texas Democrats continue to believe healthcare is a fundamental human right for all Texans and not a privilege reserved for those able to afford it. Texas Democrats oppose the repeated efforts by Republican politicians to repeal the Affordable Care Act and return America to the disastrous system that has failed small businesses, working families and drained state and family budgets. Every family deserves quality healthcare they can count on and a secure and stable system that ensures access to affordable medical care. Texans deserve a Texas Solution to fix our medical coverage gap — a solution that should also consider a single payer option. In order to address critical health needs, Texas Democrats [believe]…that the most efficient and universal and adequate way to provide health care is through a single payer system. Washington Democratic Party Health care is a basic human right. Government should work to improve our overall health, while assuring access to high-quality, affordable care for everyone. Patients must have the right to access and choice between all lawful medical treatment options, without hindrance by institutions exercising religious doctrine….We call for: • An affordable universal single-payer system to provide the most equitable and effective health care, serving both individual and public health needs; • Our state to apply for a waiver under the Patient Protection and Affordable Care Act to establish a single payer system for Washington residents until such time as a single-payer system is enacted nationally; West Virginia Democratic Party We support the concept of a national health care system. It is a human right and should be guaranteed by enacting a for-all single payer healthcare system. Wisconsin Democratic Party Access to affordable, quality health care is a right and the best solution to our national health care crisis is a single‐payer system. Such a system must provide universal access for individuals of all ages, promote preventive measures, provide medications, therapy and cover all physical and mental illnesses equally. Until that system is available, we support broader coverage and increased funding for the current health care programs on local, state and national levels, including BadgerCare, Medicare, Medicaid, and the Veteran’s Administration. Wyoming Democratic Party We support the ultimate adoption of a nationwide single payer healthcare system that covers all. ", "title": "Does Your State Democratic Party’s Platform Endorse Medicare for All? Let’s Look.", "sentences": [{"62b8": "Does Your State Democratic Party’s Platform Endorse Medicare for All? Let’s Look."}, {"5402": "In June, the Massachusetts Democratic Party will be updating its platform at the state convention in Worcester. Although it is far from perfect, the Mass Dems platform is pretty progressive — far more so than our actual Legislature. It can often be tragically funny how divergent the platform and the real politicians are."}, {"8287": "My go-to example of this is that the Mass Dems platform calls for a single payer/Medicare for All health care system…."}, {"701c": "Massachusetts Democrats believe that every person should enjoy good quality of life and good health and wellbeing. We believe that high-quality and affordable health care should be available to all through a single payer government sponsored program like Medicare, regardless of employment status. We support policies which not only make healthcare more affordable, but which reduce its overall cost. We believe that every person and family should have access to what is needed to help them to grow and thrive while living successfully in economic independence."}, {"3a9f": "…but only about a third of the Democrats in each house support legislation to that effect. The single payer in MA has the support of only 10 out of 34 Democratic state senators and only 41 out of 126 Democratic state representatives."}, {"a9c3": "On the national level, single payer has been seeing momentum in the House Democratic caucus, where John Conyers (MI-13)’s Improved and Expanded Medicare for All bill recently achieved a record number of co-sponsors (with near half the caucus). Bernie Sanders will be releasing a Senate bill later this month, and we’ll see how many co-sponsors he is able to secure."}, {"293a": "This made me start thinking about the state of single payer/Medicare for All advocacy across states and whether other state parties call for it in their platforms."}, {"1659": "How many other state Democratic parties have embraced Medicare for All in their platform? The answer: 15."}, {"e06f": "Alaska Democratic Party"}, {"caaa": "Alaska’s fiscal health is dependent upon the health of its people and their access to affordable health care. We support…Development and implementation of a single payer system to reduce and control costs…."}, {"2244": "California Democratic Party"}, {"d7d6": "California Democrats believe that health care is a human right not a privilege. We recognizes the health and well-being of Californians cannot continue to be based on arbitrary private and public financial decisions and therefore advocates legislation to create and implement a publicly funded (single-payer), privately delivered, fiscally tractable, affordable, comprehensive, secure, high-quality, efficient, and sustainable health care system for all Californians."}, {"3df6": "Colorado Democratic Party"}, {"8702": "The health of our citizens is essential to the strength of our nation. We believe that government’s policies should “promote the general Welfare and secure the Blessing of Liberty to ourselves” as written in the opening lines of the Constitution of the United States. We believe, as a matter of social justice, that health care for all in the United States is a basic and necessary human right, that it is essential to the security of our nation, and that it serves the common good."}, {"4196": "Universal access to necessary medical services is required to preserve freedom, liberty, opportunity, and ability to be productive. We support the recently enacted healthcare reform legislation Patient Protection and Affordable Care Act (PPACA) as a first step in the process toward a quality universal single-payer health care system that is independent of employment and focuses on patient care first and foremost."}, {"830c": "Hawaii Democratic Party"}, {"ec50": "Access to health care is a basic human need. Our citizens and visitors have an inherent right to high quality, high standard health care….We support national healthcare reform via single payer universal healthcare. We also encourage the inclusion of a public option in the current national health care plan."}, {"57b1": "Iowa Democratic Party"}, {"2dae": "We support: * universal access to affordable healthcare *single payer health care system"}, {"1ad6": "Maine Democratic Party"}, {"2899": "We support a democratic government that:1. Affirms health care as a fundamental human right and takes action to improve the health and wellness of all people by ensuring them access to quality and affordable health care. This goal is best achieved through the adoption of a universal, single-payer and non-profit health care system for Maine and the nation by extending Medicare to all."}, {"c5a4": "Minnesota Democratic-Farmer-Labor Party"}, {"709b": "We believe that all people should have the opportunity to be self-sufficient, secure and healthy. Cost-effective and adequately funded programs can helpensure these basic needs."}, {"54f5": "We support….Nationally funded, community-based comprehensive and affordable health care for all…Adoption of a single payer health care system."}, {"84db": "New Mexico Democratic Party"}, {"1bd5": "Health is a basic need and right, and the New Mexico State Constitution should be amended to reflect that right (2011)."}, {"446a": "Publicly financed healthcare should cover dental health, mental health, and vision, as well as preventative care."}, {"f4ff": "Medicare and Medicaid must be fully funded and fully supported and be expanded to cover all US citizens and residents regardless of age (2006)."}, {"6095": "North Dakota Democratic-NPL Party"}, {"d49c": "Single Payer Health Insurance: The Dem-NPL Party supports implementation of a universal single-payer healthcare system."}, {"10de": "Oregon Democratic Party"}, {"0860": "We believe in a strong social safety net and basic health care as a human right…We believe in a comprehensive single-payer system of health care such as improved Medicare for all."}, {"9600": "Texas Democratic Party"}, {"4757": "Texas Democrats continue to believe healthcare is a fundamental human right for all Texans and not a privilege reserved for those able to afford it. Texas Democrats oppose the repeated efforts by Republican politicians to repeal the Affordable Care Act and return America to the disastrous system that has failed small businesses, working families and drained state and family budgets. Every family deserves quality healthcare they can count on and a secure and stable system that ensures access to affordable medical care. Texans deserve a Texas Solution to fix our medical coverage gap — a solution that should also consider a single payer option."}, {"0ff3": "In order to address critical health needs, Texas Democrats [believe]…that the most efficient and universal and adequate way to provide health care is through a single payer system."}, {"9426": "Washington Democratic Party"}, {"6ad9": "Health care is a basic human right. Government should work to improve our overall health, while assuring access to high-quality, affordable care for everyone. Patients must have the right to access and choice between all lawful medical treatment options, without hindrance by institutions exercising religious doctrine….We call for:"}, {"88c4": "• An affordable universal single-payer system to provide the most equitable and effective health care, serving both individual and public health needs;"}, {"83cd": "• Our state to apply for a waiver under the Patient Protection and Affordable Care Act to establish a single payer system for Washington residents until such time as a single-payer system is enacted nationally;"}, {"9c66": "West Virginia Democratic Party"}, {"c99a": "We support the concept of a national health care system. It is a human right and should be guaranteed by enacting a for-all single payer healthcare system."}, {"d229": "Wisconsin Democratic Party"}, {"46f6": "Access to affordable, quality health care is a right and the best solution to our national health care crisis is a single‐payer system. Such a system must provide universal access for individuals of all ages, promote preventive measures, provide medications, therapy and cover all physical and mental illnesses equally. Until that system is available, we support broader coverage and increased funding for the current health care programs on local, state and national levels, including BadgerCare, Medicare, Medicaid, and the Veteran’s Administration."}, {"9bb9": "Wyoming Democratic Party"}, {"97c6": "We support the ultimate adoption of a nationwide single payer healthcare system that covers all."}], "child": "1614_1\t1614_2\t1614_3\t1614_4\t1614_5"}