{"name": "1615", "parent": "", "content": "Rocks that Keep Away Tigers, Otter’s Consolation, and how Democrats Can Win Health Care (Again). A rock that keeps away tigers. The health care debate in Congress is one I take personally. I worked on the Affordable Care Act. When my job as an Obama-appointee at the FDA ended, my lovely young wife and I signed up for health insurance on the DC health exchange. On Friday morning I was humming the song Schadenfreude from Avenue Q, and I ended the day thinking that what Otter told Flounder to cheer him up after a spectacular failure might sound a lot like conversations among conservatives on Friday night. The political class is moving quickly through the blaming phase of the failed effort to repeal and replace the Affordable Care Act and the credit taking phase for stopping it. Now we are deep in the “I told you so” part of the conversation. Here is where everyone takes credit because they did something, and an outcome they wanted happened. This is also the moment in which advocates say this is therefore perfect moment to pursue their favored policy options, from straight repeal of the ACA and even more rollbacks of federal involvement in healthcare, to a complete takeover of the healthcare system by Congress. Everyone is a pundit, selling rocks to keep the tigers away. In my view, supporters of the ACA did not win. The ACA repeal and replace supporters lost. Those who opposed the proposal to repeal and replace the ACA were able to agree that the idea was a bad one, without having to agree on what a good idea would be. The outcome is the same, but the difference is important in determining next steps. The House vote on the bill was obviously cancelled because Speaker Ryan did not think he had the votes to pass it. No Democrats were going to vote for the bill. That left the Speaker needing all but 22 of the Republicans. Since the vote was not held, there is no way to know exactly how the votes would have gone. Nonetheless, three categories of “no” votes identified by the New York Times can help explain both last week’s failure and a possible path to success: First are 15 conservatives identified by the Times for whom anything beyond a straight repeal was too much. These members may have opposed the bill on purely policy grounds, may have been concerned that support for the bill would result in more a conservative primary challenger in the next election, or a mix of both. Regardless of the reason, these legislators are likely out of the reach of advocates and out of reach for reformers who want anything other than full repeal. The next 10 are self-identified moderates, some of whom received fewer votes than Hillary Clinton in their districts last November. This group may have disagreed with the policies in the Republican bill, may have been concerned about the political implications of voting to take health insurance away from 20-plus million people to give a tax cut to the rich, or both. This group is the most likely to have been persuaded by public pressure, and is a group activists can likely claim credit for influencing. The remaining eight Representatives identified by the Times expressed different reasons for opposing the repeal and replace proposal. Again, the motivations could be policy, politics or both. Understanding the exact reasons for this opposition will be important for advocates promoting next steps on health care. Supporters of the ACA can take credit for all of the Democrats, and a dozen or so Republicans. At most that means 210 votes of the 218 needed to pass a bill when all 435 House seats are filled (there are currently five vacancies in the House). A clearer understanding of the why a vote did not happen can inform what can happen in the coming months. The first thing ACA supporters can do has nothing to do with Congress. Advocates need to make the ACA work. This means continued efforts to boost enrollment on the state exchanges and following through with state Medicaid expansions. The President wants the ACA to fail, and as such is unlikely to put many (if any) resources behind getting people to sign up for insurance. The Obama administration put a tremendous amount of effort in to making the ACA work. There were pushes across federal agencies, online and social media promotion, senior administration officials were sent on the road to promote open-enrollment, and more. It is worth noting that the first senior member of the Obama administration to do television interviews after Trump’s election was Health and Human Services Secretary Burwell to talk about the ACA and open-enrollment season. That sort of focused use of limited time and resources is unlikely under Trump, which could help make his claim that the legislation will fail a self-fulfilling prophesy. Therefore, groups like Enroll America need to increase their efforts. Other groups need to step up as well. And that means funders need to donate to these groups. If the administration is not going to encourage participation and make the ACA work, outside organizations must. If outside groups do not get engaged, last week’s failure for Trump might wind up being the basis for his success. The second step that does not require Congressional action is continued state Medicaid expansion. Even as Republicans in Congress were trying to undo the ACA, Republican-controlled Kansas was moving forward with Medicaid expansion, for example. Advocates in states that have expanded the program need to continue to express support for it, and advocates in the remaining 19 states need to push for it. Again, this means that funders need to put money into campaigns that support exchanges where they exist so there is no backsliding, and into states to promote Medicaid expansion where it has not yet happened. There is, of course, work to be done in Congress. Given the analysis on why Members of Congress opposed the repeal and replace plan, it should be clear that now is not the moment for single-payer. Even if everyone who said they were planning to vote against last week’s bill voted for single payer, the idea would still fall short in the House.The votes aren’t there. If there were enough votes for single payer, Congress would have passed it in 2009. Voters do not like it when they think elected officials are more interested in headlines than solutions. Now is the time to work on workable improvements to health insurance and health care. Advocates should focus on improving what we have. The ACA is not perfect. Democrats can take the lead on the same bi-partisan steps I recommended to Republicans last week. Reiterate support for major elements of the ACA on which everyone can agree such as prohibiting insurance companies from denying someone coverage because of a preexisting condition. Identify relatively minor elements of the ACA that can be eliminated or tweaked. Look for larger provisions that could improve the ACA. There is no shortage of ideas here — for example, this piece lists several. Increased transparency in pricing could be another area of agreement. The most contentious ideas such as tax credits, rather than a mandate to have insurance, can be put off for another time. In crafting these legislative proposals, it will be important to remember what brought the 18 persuadable Republicans in the second two groups identified above to oppose the President. The best ideas will account for the motivations of these legislators and find policies that make for good politics for this group. Democrats also need to find more Republicans who did not express an opinion on the repeal and replace effort to join them for any legislation to pass, which means paying attention what those Republicans care about as well. One result could be Democrats helping hand some Republicans a possible win. If your goal is increasing the numbers of Democrats in Congress at the expense of Republicans, that’s bad news. But for our system to work, we have to be willing to work together and share credit for helping people. A better law that gives more people access to quality, affordable health care, matters more than scoring partisan points. Indeed, Democrats could claim political victory as the adults in the room by working with a handful for Republicans to advance the public good. Democrats become the party of solutions for real Americans, while Republicans become the party that rants. As a Democrat, I would welcome that. That you got the health care result you wanted last week does not mean that you won. There is no massive pool of Trump voters suddenly impersonating David Byrne. Last week’s non-vote no more proves that moderate Republicans are the enemy of freedom than it does the only sane and politically viable solution is single-payer health care. Last week’s non-vote means that Republicans in the House couldn’t cobble together a coalition of conservatives and moderates around legislation constructed on the fly that never got a real serious articulation from the President. Some of that failure was because of outside political pressure and advocates. Some of that failure was due to the failure of Republicans themselves. The best advocates will take an honest look at what happened and why, focus on the policy outcomes they want, and find ways to move toward those outcomes using the political tools to which they have access. ", "title": "Rocks that Keep Away Tigers, Otter’s Consolation, and how Democrats Can Win Health Care (Again).", "sentences": [{"1a6b": "Rocks that Keep Away Tigers, Otter’s Consolation, and how Democrats Can Win Health Care (Again)."}, {"a32b": "A rock that keeps away tigers."}, {"ff11": "The health care debate in Congress is one I take personally. I worked on the Affordable Care Act. When my job as an Obama-appointee at the FDA ended, my lovely young wife and I signed up for health insurance on the DC health exchange. On Friday morning I was humming the song Schadenfreude from Avenue Q, and I ended the day thinking that what Otter told Flounder to cheer him up after a spectacular failure might sound a lot like conversations among conservatives on Friday night."}, {"9a5b": "The political class is moving quickly through the blaming phase of the failed effort to repeal and replace the Affordable Care Act and the credit taking phase for stopping it. Now we are deep in the “I told you so” part of the conversation. Here is where everyone takes credit because they did something, and an outcome they wanted happened. This is also the moment in which advocates say this is therefore perfect moment to pursue their favored policy options, from straight repeal of the ACA and even more rollbacks of federal involvement in healthcare, to a complete takeover of the healthcare system by Congress. Everyone is a pundit, selling rocks to keep the tigers away."}, {"4043": "In my view, supporters of the ACA did not win. The ACA repeal and replace supporters lost. Those who opposed the proposal to repeal and replace the ACA were able to agree that the idea was a bad one, without having to agree on what a good idea would be. The outcome is the same, but the difference is important in determining next steps."}, {"c824": "The House vote on the bill was obviously cancelled because Speaker Ryan did not think he had the votes to pass it. No Democrats were going to vote for the bill. That left the Speaker needing all but 22 of the Republicans. Since the vote was not held, there is no way to know exactly how the votes would have gone. Nonetheless, three categories of “no” votes identified by the New York Times can help explain both last week’s failure and a possible path to success:"}, {"3810": "First are 15 conservatives identified by the Times for whom anything beyond a straight repeal was too much. These members may have opposed the bill on purely policy grounds, may have been concerned that support for the bill would result in more a conservative primary challenger in the next election, or a mix of both. Regardless of the reason, these legislators are likely out of the reach of advocates and out of reach for reformers who want anything other than full repeal."}, {"f356": "The next 10 are self-identified moderates, some of whom received fewer votes than Hillary Clinton in their districts last November. This group may have disagreed with the policies in the Republican bill, may have been concerned about the political implications of voting to take health insurance away from 20-plus million people to give a tax cut to the rich, or both. This group is the most likely to have been persuaded by public pressure, and is a group activists can likely claim credit for influencing."}, {"8409": "The remaining eight Representatives identified by the Times expressed different reasons for opposing the repeal and replace proposal. Again, the motivations could be policy, politics or both. Understanding the exact reasons for this opposition will be important for advocates promoting next steps on health care."}, {"52c2": "Supporters of the ACA can take credit for all of the Democrats, and a dozen or so Republicans. At most that means 210 votes of the 218 needed to pass a bill when all 435 House seats are filled (there are currently five vacancies in the House)."}, {"3d52": "A clearer understanding of the why a vote did not happen can inform what can happen in the coming months. The first thing ACA supporters can do has nothing to do with Congress. Advocates need to make the ACA work. This means continued efforts to boost enrollment on the state exchanges and following through with state Medicaid expansions."}, {"35ce": "The President wants the ACA to fail, and as such is unlikely to put many (if any) resources behind getting people to sign up for insurance. The Obama administration put a tremendous amount of effort in to making the ACA work. There were pushes across federal agencies, online and social media promotion, senior administration officials were sent on the road to promote open-enrollment, and more. It is worth noting that the first senior member of the Obama administration to do television interviews after Trump’s election was Health and Human Services Secretary Burwell to talk about the ACA and open-enrollment season. That sort of focused use of limited time and resources is unlikely under Trump, which could help make his claim that the legislation will fail a self-fulfilling prophesy. Therefore, groups like Enroll America need to increase their efforts. Other groups need to step up as well. And that means funders need to donate to these groups. If the administration is not going to encourage participation and make the ACA work, outside organizations must. If outside groups do not get engaged, last week’s failure for Trump might wind up being the basis for his success."}, {"96b8": "The second step that does not require Congressional action is continued state Medicaid expansion. Even as Republicans in Congress were trying to undo the ACA, Republican-controlled Kansas was moving forward with Medicaid expansion, for example. Advocates in states that have expanded the program need to continue to express support for it, and advocates in the remaining 19 states need to push for it. Again, this means that funders need to put money into campaigns that support exchanges where they exist so there is no backsliding, and into states to promote Medicaid expansion where it has not yet happened."}, {"e9d8": "There is, of course, work to be done in Congress. Given the analysis on why Members of Congress opposed the repeal and replace plan, it should be clear that now is not the moment for single-payer. Even if everyone who said they were planning to vote against last week’s bill voted for single payer, the idea would still fall short in the House.The votes aren’t there. If there were enough votes for single payer, Congress would have passed it in 2009."}, {"e3e5": "Voters do not like it when they think elected officials are more interested in headlines than solutions. Now is the time to work on workable improvements to health insurance and health care. Advocates should focus on improving what we have. The ACA is not perfect. Democrats can take the lead on the same bi-partisan steps I recommended to Republicans last week. Reiterate support for major elements of the ACA on which everyone can agree such as prohibiting insurance companies from denying someone coverage because of a preexisting condition. Identify relatively minor elements of the ACA that can be eliminated or tweaked. Look for larger provisions that could improve the ACA. There is no shortage of ideas here — for example, this piece lists several. Increased transparency in pricing could be another area of agreement. The most contentious ideas such as tax credits, rather than a mandate to have insurance, can be put off for another time."}, {"2bbb": "In crafting these legislative proposals, it will be important to remember what brought the 18 persuadable Republicans in the second two groups identified above to oppose the President. The best ideas will account for the motivations of these legislators and find policies that make for good politics for this group. Democrats also need to find more Republicans who did not express an opinion on the repeal and replace effort to join them for any legislation to pass, which means paying attention what those Republicans care about as well. One result could be Democrats helping hand some Republicans a possible win. If your goal is increasing the numbers of Democrats in Congress at the expense of Republicans, that’s bad news. But for our system to work, we have to be willing to work together and share credit for helping people. A better law that gives more people access to quality, affordable health care, matters more than scoring partisan points. Indeed, Democrats could claim political victory as the adults in the room by working with a handful for Republicans to advance the public good. Democrats become the party of solutions for real Americans, while Republicans become the party that rants. As a Democrat, I would welcome that."}, {"6216": "That you got the health care result you wanted last week does not mean that you won. There is no massive pool of Trump voters suddenly impersonating David Byrne. Last week’s non-vote no more proves that moderate Republicans are the enemy of freedom than it does the only sane and politically viable solution is single-payer health care. Last week’s non-vote means that Republicans in the House couldn’t cobble together a coalition of conservatives and moderates around legislation constructed on the fly that never got a real serious articulation from the President. Some of that failure was because of outside political pressure and advocates. Some of that failure was due to the failure of Republicans themselves. The best advocates will take an honest look at what happened and why, focus on the policy outcomes they want, and find ways to move toward those outcomes using the political tools to which they have access."}], "child": "1615_1\t1615_2"}