{"name": "1617", "parent": "", "content": "Waiting on a Liver A broken transplant system and the search for a ‘perfect’ organ cost my wife her life (Note: Most of the photos below were supplied by friends after I sent them the story. Thank you to everyone who helped document Tanya’s struggle) Tanya Gibson-Clark & husband Brian during happier, healthier times By Brian L. Clark PART ONE Earlier this year, my wife died awaiting a liver transplant at New York-Presbyterian Hospital. I believe she would be home recuperating now, if not for a broken transplant system that roadblocks potential donors, mystifies sick patients, and allows potential life-saving organs to pass by in order to obtain the “perfect” liver for a dying patient. Tanya Gibson-Clark was a vibrant, 55-year-old, Juilliard-trained dancer who appeared on Broadway in “Black & Blue,” and went on to choreograph for Jacques d’Amboise’s National Dance Institute and the U.S. Army Soldier Show. The mother of two teenage boys helped countless people in her life, using dance as her instrument. But she fell victim to an organ transplant system that inflates patients’ hopes, while taking them on a roller coaster ride that runs from elation to crushing disappointment. Tanya and dance partner Eugene Fleming, from “Black & Blue” Last February, Tanya noticed a hard spot in her upper abdomen, just below her sternum. She went in to see her doctor a few months later, and blood tests revealed some elevated numbers associated with her liver. So in June, she went to a local hospital for more tests. During the testing process, Tanya was misdiagnosed twice. The first doctor said she had hemochromatosis, a disorder that meant she had too much iron in her blood. The second swore she had Nash Syndrome, liver inflammation and damage caused by fat buildup, and told her she would need to get on a liver transplant list. Then he told her to come back in six months. He later told me her liver was functioning at 30 percent of its capacity. That scared the daylights out of me, as I didn’t understand what was happening to my wife or what it meant for our family. In the end, both diagnoses were wrong, but the fact her liver was in bad shape was not. Tanya at St. Barnabas in Livingston, NJ As the summer progressed, my wife’s health deteriorated. Tanya went from being an active, involved mom, to being so exhausted that just taking our youngest son to baseball practice in a neighboring town was too much. Still, she soldiered through, taking naps in the car so she could make the 20-minute drive back home. Then, in August, she developed a fever of 104 degrees. A friend ran her to the hospital in Hackensack, New Jersey, where the emergency room doctor told her point blank she needed to get on the organ transplant list at New York-Presbyterian Hospital. TANYA BECOMES A TRANSPLANT CANDIDATE After meeting with multiple doctors and running several tests at the NY-P Center for Liver Disease and Transplantation, Tanya discovered she had Alpha-1 Antitrypsin Deficiency. Alpha-1 is a genetic condition that can cause liver or lung disease — we learned about 15 percent of adults with this condition develop liver disease. Symptoms in adults included shortness of breath with mild activity and reduced ability to exercise, which could explain why my wife had been so tired. We soon met with members of the transplant team at New York-Presbyterian Hospital. It was an overwhelming and exhaustive initiation process. First there was a nurse who explained the liver transplant procedure, then came a psychiatrist who checked to make sure my wife was an emotionally-sound candidate who would take the prescribed medications and follow treatment. After that we met with a dietitian and, of course, the billing person for the hospital. The last person we spoke to that day was a social worker who tried to prepare us for what we would experience as part of the New York City liver transplant mill. Tanya would go through a very intensive, thorough program that included a complete physical workup, numerous tests, weekly blood work, and transplant seminars. As a liver transplant candidate, she was required to attend at least two of these seminars. The first one she attended dealt with the path to transplant. But the second dealt with living donors. In that session, we met a mother who had donated a portion of her liver to her daughter, as well as others who had survived the 9-hour surgery. The testimonials made the transplant process sound very positive, but during the surgeon’s presentation there was a slide that read, “10 percent of people on the transplant list will die.” When we got in the car to head home, Tanya broke down into tears and said, “I don’t want to die.” The odds were in our favor, so I assured her that wouldn’t happen and we drove home. FINDING A DONOR The liver is an amazing organ. It converts and distributes nutrients throughout the body. It renders toxic substances harmless and controls blood clotting. More importantly, it’s the only organ that can regenerate itself. That’s why living donors with the same blood type can give a portion of their liver to a transplant patient and have perfectly normal lives thereafter. But when our 19-year-old son volunteered to be a living donor for his mom, they told him he had to be 21. When Tanya posted on social media that she could have a living donor, five of her friends stepped up. Three of them made the cut to be potential donors. Yet despite having three matches, each of my wife’s friends told me they felt New York-Presbyterian Hospital made it virtually impossible for them to actually donate. Phone calls not returned, redundant “are you sure” conversations, limiting the testing to one person at a time — all of it gave potential donors the feeling the hospital was trying to dissuade them. As a result of the delays, my wife’s MELD score became too high for her to have a living donor. The Model for End-Stage Liver Disease (MELD) score is used to determine a patient’s place on the organ transplant list, with the maximum score for a living donor set at 25. So we would have to wait for someone to die, preferably from a head injury, so she could have their liver. We were told hoverboards — self-balanced, two-wheeled, battery-powered scooters — are a transplant surgeon’s new best friend. PART TWO LIVING WITH LIVER DISEASE Liver disease is horrible. It’s a destructive force that ravages the body and mind, and caused my wife to lose so much weight that she was virtually nothing but skin and bone toward the end of her life. I hesitated to rub her back or hug her too hard for fear of hurting her. Then there’s the ascites, a malicious offshoot that causes fluid to accumulate in the abdomen and elsewhere in the body. My wife’s ascites was so bad the doctor actually joked about her carrying twins. Tanya’s only relief was going to the local emergency room to have it periodically drained. Several times doctors took as much as six liters (1.58 gallons) of fluid from her belly — they couldn’t drain too much for fear of causing her kidneys to shut down. And every time Tanya returned from being drained, we had to worry about leaks from the drainage holes. We tried to bandage them the best we could, but the leaks were persistent and seemed ripe for infection. Then there were the false starts. While waiting in the transplant mill, we had three. The first time they took Tanya to the pre-op area at 5:30am, where we waited several hours until the surgeons returned to tell her the liver was too fibrous. The second time, Tanya was about to check out of the hospital after being treated for an infection. The nurse ran up to me in the hallway and told us to wait, that they might have a liver available. So we did, for seven hours, only to find out this particular liver was too fatty. Tanya said, “Let’s go to Popeye’s.” So we did. But the worst false start came after we received a phone call at 11:20pm on December 22nd telling us to get to the hospital. Apparently, an 18-year-old had overdosed and was brain dead. We were told they’d have the liver in house between 8:00 and 9:00am, and that Tanya would be in the operating room by 12:30pm. Tanya prepped and ready for a liver transplant, December 23, 2015 We arrived at the hospital and checked in to the “liver floor” at 2:00am on December 23rd. Finally, we thought, the organ she needed would be available. But 9:00am came and went with no word. Then 12:30pm came and still no word. Despite the lack of updates, the liver team continued to prep Tanya as though the surgery would happen. They gave her fluids and prepared her emotionally by having the surgeon come in to explain what would happen in the operating room. The doctor told my wife this liver arrived just in time, because her health was spiraling: She was getting sicker. Still, we waited, past 5:00pm and then past 8:00pm. Finally, some time after 10:00pm, the liver team came in to say the organ was no good. We were devastated. That night, my wife insisted on leaving the hospital so she could be home for Christmas with the family. But on Christmas Eve, her ascites was so bad I had to take her to our local hospital in New Jersey to get drained. The doctors removed another 1.5 gallons of fluid from her belly. Afterward, Tanya talked to me about “spiraling” and told me again she didn’t want to die. Again, I reassured her she would be fine. A FINE LINE BETWEEN HOPE AND DESPAIR Waiting for someone else to die so your spouse can live is an awful position. But that’s exactly what we were doing, hoping to take advantage of someone else’s misfortune. It wasn’t until later we discovered New York State ranks 50th out of 50 in percentage of residents who are registered organ donors — plenty of livers, lungs and kidneys that could save lives go to waste. We had a lovely Christmas. Tanya took her traditional place on the couch and watched the kids open their gifts. Friends stopped by and she was happy. But the week after Christmas was bad. Tanya’s condition worsened each day with no check-ins or calls from the liver center about a new organ. On the way to a routine blood test visit, she was so weak, she had to sit and rest by the elevators before riding up to the second floor. She spent most of that week in bed. Then on Sunday, in the middle of the night, she couldn’t make it to the bathroom by herself. It had been 11 days since the last transplant false alarm and it felt like they forgot about her. But after another blood test the next day, she was told to get to the New York-Presbyterian Emergency Room immediately. Her kidneys were failing. The emergency room at NY-P is its own special circle of hell. Gurneys are everywhere: the hallways, the aisles and the “rooms,” which are about five feet wide and divided by curtains. Those who don’t get gurneys sit on hard chairs and wait. The cloud of sickness and disease is almost overwhelming—you want to wear a mask and wash your hands every time you touch something. And yet by some miracle, namely the place’s incredible staff, it functions. We were in the ER until 2:00am, when Tanya was transferred to a step-down room, which is between a regular room and the ICU. She was in so much pain she moaned the entire night, while a woman across the room shouted because she couldn’t understand why she was being restrained. When morning finally came on January 5th, the doctor assured Tanya she was right where she needed to be. This was her “transplant admission.” Tanya was as sick as she would get, the doctor said, and she would not be leaving the hospital without a new liver. But no amount of seminars could have prepared us for what we faced over the next three weeks. While I was at work, a friend who stayed with Tanya called to say she was being taken to the ICU. But when I returned to the hospital that night, she couldn’t speak — all she could do was grunt. I was told it was because of hepatic encephalopathy, which is the loss of brain function when a damaged liver doesn’t remove toxins from the blood. At 5:30am the following morning, doctors put in a breathing tube because they feared Tanya would choke on her own saliva. And I was completely unprepared for what I found when they put her on dialysis. She had two long tubes coming out of her neck and running into the machine, which was purifying her blood. My wife was in bad shape. Nurses were draining a lot fluid from her lungs, as she aspirated some vomit the previous day and had developed a lung infection. A nurse practitioner in the ICU told me she was very sick, and I should talk with our kids about their mother possibly not making it. I nearly freaked out. How was that possible? She was supposed to get a new liver, not die from an infection. The next morning, our 19-year-old came with me to the hospital. He saw his mother, connected to a dialysis machine with tubes running into her neck, a breathing tube down her throat, a feeding tube in her nose, and all manner of IVs in what was left of her skinny little arms. Tanya on breathing tube in ICU That evening I returned with both boys to see her. Tanya was heavily sedated, but still managed to lift her head and open her eyes a few times when she heard our sons in the room. While I was telling the boys this was an encouraging sign, the nurse overheard me and said, “She’s been doing that all day.” I was livid. I was trying to give my kids some hope their mother would pull through this and she just shot me down. Later, I noticed our 14-year-old sitting on a chair in the room, a single tear running down his cheek. The memory still brings tears to my eyes. The next day, we were told Tanya had to get better in the next 48 hours or the chances for a liver transplant were remote. Still, the doctor and social worker said my wife was right where they wanted her to be, and there were signs she was improving. She responded to a request, which meant she could still hear. It was a small sign, but I grasped at any improvements and breathed a sigh of relief. LIFE & DEATH ROLLER COASTER For three weeks, we went on the worst roller coaster ride ever. One day Tanya was transplant ready, then too sick the next. After visiting Tanya one night, I had a conversation with my youngest, who said he didn’t want to see his mom the next day. I talked with him about the possibility his mom might not make it — it was one of the hardest things I’ve ever had to do — and that he should go see her whenever he had the chance. It’s extraordinarily difficult to watch your children react to a loved one in such a deteriorated state. But the roller coaster continued, and Tanya continued to fight. Eventually, the nurses stepped down the oxygen levels, took her off blood pressure medicine, and lowered the sedation so she could respond to us more. The social worker said my wife had met half of the criteria needed to get her transplant. Tanya maintained a semi-awake state for a few days, with bouts of restlessness and aggravation due to the breathing tube. Each day seemed like another step closer to transplant, and I silently cheered her on. But as the days passed, I grew more impatient. The social worker said doctors were pleased with Tanya’s progress, and that they were just looking for a window to do the transplant. But the waiting game was horrible, as I watched my wife swing between good days and bad days. From days where she was highly aware, answering questions, and very responsive to days where she developed infections, struggled to breathe, or tried to rip out IVs. Liver disease is an experience I wouldn’t wish on anyone. It was emotionally and physically exhausting and I just wanted to make it stop. My wife was at death’s door and supposed to be at the top of the transplant list, but weeks later we were still waiting for an organ. PART THREE THE HORROR OF IT ALL There are no bathrooms in the ICU. During one visit, Tanya whispered to me it was like “being in a horrible movie.” The indignity of being cleaned up, sometimes roughly, by male and female nurses, and not being able to express herself clearly was taking its toll. And when it was time for me to leave that night, she looked at me like I was deserting her. In mid-January, Tanya became more alert and feisty. She asked to go home, and I explained the many reasons that wasn’t possible. She even had her first round of physical therapy, but was still fighting that nasty lung infection. As I watched her move her legs with great effort, I reminded myself it was just more baby steps till she was back home with the family. That night as I was about to leave, Tanya puckered to give me a kiss. I was fighting a cold and didn’t want to make her sick, as she was finally improving. So I tried to explain and gently kissed her forehead. I didn’t know it would be the last chance I would ever have to kiss her. Overnight, Tanya’s liver function worsened and she began to bleed. Doctors said they could control it, and support her even if her liver failed. All we needed was for the infection to be gone, and she’d be liver ready. The entire liver team was pulling for her — she had to stay strong and keep fighting. But when the next morning came, Tanya’s liver had completely failed and she started bleeding out of her nose, mouth, and gums. I began to think the chances of her being healthy enough to even survive a liver transplant were slim. Still, the nurse practitioner told me he had seen people this sick get new livers and recover, so I held on to a glimmer of hope. As I was leaving the hospital, I received a call from one of our friends who had talked to Tanya’s doctor. The doctor had told her bluntly that anyone who wanted to see Tanya should do so in the next two days. I had just left her room and she seemed to be improving. At least, I thought she was. AWAITING THE “PERFECT” ORGAN The next day the nurse practitioner came in the room and announced the hospital had started taking calls for livers for Tanya. Our last hope was for a “perfect” organ — meaning one from a child, teen, or smaller adult, according to the surgeons. Tanya’s doctor told me she was good to go once they got their hands on one. There was supposed to be a snowstorm that weekend, which rousted some folks on the transplant team. Apparently, snowstorms mean car accidents, and a higher chance of getting a liver. During the same conversation, the doctor told me just how screwed up the transplant system was. I agreed. The prayer that wasn’t answered January 22nd marked my wife’s 56th birthday, and with it came one of her dearest friends from high school. When my wife saw him, her face lit up, but due to the sedation she immediately fell back asleep. That happened at least four times, and each time she reacted like she was seeing him for the first time. We laughed about it, as a steady stream of visitors came and went to wish her happy birthday. The best moment of the day was when my sons and I came in the room to sing her happy birthday and one of the nurses joined in. Even with the tubes in her throat, down her nose, and everywhere else, she still got a big smile on her face. ‘Happy birthday T!’ The next day, the mayor shut down New York City due to the blizzard, so I wasn’t able to get to the hospital to see my wife. Fortunately, that also meant her high school friend was stuck in New York and could connect us via FaceTime. During the digital chat, Tanya waved and we laughed. But later that night, while my oldest and I were shoveling the driveway, the ICU called to say Tanya had a great day, but her blood pressure was crashing; that she had another infection and this time it was really bad. I didn’t sleep, thinking the FaceTime I had with my wife might be our last. THE END When I arrived at the hospital the next morning, it was like Tanya was already dead. Her eyes were barely open and there was no one there. Her chest moved up and down in rhythm with the breathing machine — she was clearly being kept alive until we could get in to say goodbye. My oldest son and I talked to her and stroked her forehead, hoping she could hear but knowing she probably didn’t. And when her heart stopped at 1:43pm that day, her family and friends were all standing around the bed. It was the most intense experience I’ve ever had. That day, I lost my friend, my partner of 22 years, and the mother of my two sons. A few days later, the friend who stayed with her during the evening of the blizzard told me he had talked with her and tried to comfort her, despite the fact that she was unconscious. He wasn’t sure if Tanya could hear, but when he spoke about myself and the boys, a single tear ran down her cheek. He sent a picture that, to this day, breaks my heart. A tear from Tanya for her family Looking back, it’s clear the transplant system in this country is an abject disaster. Despite the high quality and reputation of New York-Presbyterian’s surgeons, and heroic efforts of the ICU team, for which I am forever grateful, my wife died waiting for the “perfect” organ. I honestly believe once Tanya went to the ICU, her odds of getting a transplant went down exponentially. Waiting till someone is so sick they may not even survive the surgery is absurd. The pneumonia, lung and stomach infections, and ultimate failure of her liver meant the transplant window was so small, it was virtually impossible to hit. The push to get the “perfect” organ made finding one even less likely. For me, the “perfect” liver would be one that extended her life another five years or so, giving her time to receive some type of stem cell treatment and leave this mess of a transplant system behind. And that may be all the time she needed. I recently wrote to Fernando Camargo, Ph.D., from the Stem Cell Program at Children’s Hospital in Boston. Dr. Camargo wrote back that he believes “within 5 years, there will be some novel therapeutic approaches in the clinic” to treat liver disease. LESSONS LEARNED First, get on multiple transplant lists. We were afraid to do so because we didn’t want Columbia Presbyterian to push Tanya down the list if they found out. That was a huge mistake. New York is in Region 9, which only gets livers from New York State and Vermont. And as I mentioned earlier, New York is 50th in percentage of residents who are organ donors. If we’d registered in New Jersey, where we live, we would have had access to livers from Jersey, West Virginia, Delaware, Maryland, Pennsylvania, Washington, D.C., and Virginia. And while I’m told NY-P was legally and morally obligated to tell us this, no one ever did. Instead, we found a bullet point in a form Tanya signed. The 6th bullet point mentions “multiple listing” Second, the only reason to go to New York for a transplant is if you have a living donor lined up and approved. I lost count how many times I was told about the competition for organs among hospitals in the city, and that makes it a total crapshoot. You never know when (or if) a liver will come to your hospital. On my wife’s last day a doctor from the liver team told me the pre-eminent transplant center in the U.S. hadn’t had a liver come through its doors for three weeks. That was the entire time my wife was in the ICU. She was O+, too, the most common blood type. And another thing: Why the hell are hospitals fighting over organs in the first place? Wouldn’t it be smarter to have one be where you go for a liver transplant. Another for lungs. And another for kidneys. No competition. The list dictates who gets what, and the system dictates where they get it. A doctor I spoke to recently told me point blank he never sends transplant patients to New York. Ever. Avoid transplants over the holidays, if at all possible. You’d like to think you wouldn’t get lost over the holidays, but in Tanya’s case, the fact that we didn’t hear from the hospital for 11 days, in spite of the fact that she was “spiraling,” told us all we needed to know. Beware talk of a “perfect” organ. Throughout this process, doctors kept talking about finding Tanya the perfect liver. Yet on her birthday, we left the room for a bit and met a gentleman whose mother received a transplant at a West Chester hospital when she was in her 50s. Her liver came from a 70-year-old man. Here it was, 20 years later, and she was in the hospital for “routine maintenance.” Otherwise, he said, the liver was working just fine. Finally, do your research. Late in the process, we found out there were at least 100 people on the New York liver transplant list, whereas in New Jersey there were just 2. I truly wish we’d known that earlier. (https://optn.transplant.hrsa.gov/data/view-data-reports/regional-data/) Tanya and I put our absolute faith in the New York City transplant mill, and I will regret it for the rest of my life. In the days following Tanya’s death, she received a solicitation in the mail that read, “We invite you to show your appreciation by making a gift to New York-Presbyterian Hospital. Your contribution will both express your thanks to your doctor, and help make amazing things happen for every patient who walks through our doors.” I won’t be sending a donation any time soon. The solicitation that arrived days after Tanya’s death PART FOUR TANYA’S MEMORIAL CELEBRATION On March 5th, about 300 of Tanya Gibson-Clark’s family and friends gathered in Maplewood, New Jersey, to pay tribute to a life well lived. I invite you to watch the video below to really know Tanya the dancer, teacher, wife, mother and friend. She was a very special person. Thank you. BC Tanya Gibson-Clark’s Memorial Tribute, March 5, 2016 ", "title": "Waiting on a Liver", "sentences": [{"9def": "Waiting on a Liver"}, {"1ea5": "A broken transplant system and the search for a ‘perfect’ organ cost my wife her life"}, {"60a2": "(Note: Most of the photos below were supplied by friends after I sent them the story. Thank you to everyone who helped document Tanya’s struggle)"}, {"ff63": "Tanya Gibson-Clark & husband Brian during happier, healthier times"}, {"29c1": "By Brian L. Clark"}, {"d77b": "PART ONE"}, {"6d3e": "Earlier this year, my wife died awaiting a liver transplant at New York-Presbyterian Hospital. I believe she would be home recuperating now, if not for a broken transplant system that roadblocks potential donors, mystifies sick patients, and allows potential life-saving organs to pass by in order to obtain the “perfect” liver for a dying patient."}, {"f1b5": "Tanya Gibson-Clark was a vibrant, 55-year-old, Juilliard-trained dancer who appeared on Broadway in “Black & Blue,” and went on to choreograph for Jacques d’Amboise’s National Dance Institute and the U.S. Army Soldier Show. The mother of two teenage boys helped countless people in her life, using dance as her instrument. But she fell victim to an organ transplant system that inflates patients’ hopes, while taking them on a roller coaster ride that runs from elation to crushing disappointment."}, {"76e0": "Tanya and dance partner Eugene Fleming, from “Black & Blue”"}, {"b904": "Last February, Tanya noticed a hard spot in her upper abdomen, just below her sternum. She went in to see her doctor a few months later, and blood tests revealed some elevated numbers associated with her liver. So in June, she went to a local hospital for more tests."}, {"5d92": "During the testing process, Tanya was misdiagnosed twice. The first doctor said she had hemochromatosis, a disorder that meant she had too much iron in her blood. The second swore she had Nash Syndrome, liver inflammation and damage caused by fat buildup, and told her she would need to get on a liver transplant list. Then he told her to come back in six months. He later told me her liver was functioning at 30 percent of its capacity. That scared the daylights out of me, as I didn’t understand what was happening to my wife or what it meant for our family."}, {"4cf3": "In the end, both diagnoses were wrong, but the fact her liver was in bad shape was not."}, {"2324": "Tanya at St. Barnabas in Livingston, NJ"}, {"2fcf": "As the summer progressed, my wife’s health deteriorated. Tanya went from being an active, involved mom, to being so exhausted that just taking our youngest son to baseball practice in a neighboring town was too much. Still, she soldiered through, taking naps in the car so she could make the 20-minute drive back home."}, {"a751": "Then, in August, she developed a fever of 104 degrees. A friend ran her to the hospital in Hackensack, New Jersey, where the emergency room doctor told her point blank she needed to get on the organ transplant list at New York-Presbyterian Hospital."}, {"0947": "TANYA BECOMES A TRANSPLANT CANDIDATE"}, {"f9cd": "After meeting with multiple doctors and running several tests at the NY-P Center for Liver Disease and Transplantation, Tanya discovered she had Alpha-1 Antitrypsin Deficiency. Alpha-1 is a genetic condition that can cause liver or lung disease — we learned about 15 percent of adults with this condition develop liver disease. Symptoms in adults included shortness of breath with mild activity and reduced ability to exercise, which could explain why my wife had been so tired."}, {"107a": "We soon met with members of the transplant team at New York-Presbyterian Hospital. It was an overwhelming and exhaustive initiation process."}, {"3284": "First there was a nurse who explained the liver transplant procedure, then came a psychiatrist who checked to make sure my wife was an emotionally-sound candidate who would take the prescribed medications and follow treatment. After that we met with a dietitian and, of course, the billing person for the hospital. The last person we spoke to that day was a social worker who tried to prepare us for what we would experience as part of the New York City liver transplant mill."}, {"712f": "Tanya would go through a very intensive, thorough program that included a complete physical workup, numerous tests, weekly blood work, and transplant seminars. As a liver transplant candidate, she was required to attend at least two of these seminars."}, {"7d91": "The first one she attended dealt with the path to transplant. But the second dealt with living donors. In that session, we met a mother who had donated a portion of her liver to her daughter, as well as others who had survived the 9-hour surgery. The testimonials made the transplant process sound very positive, but during the surgeon’s presentation there was a slide that read, “10 percent of people on the transplant list will die.”"}, {"8952": "When we got in the car to head home, Tanya broke down into tears and said, “I don’t want to die.” The odds were in our favor, so I assured her that wouldn’t happen and we drove home."}, {"e989": "FINDING A DONOR"}, {"c56a": "The liver is an amazing organ. It converts and distributes nutrients throughout the body. It renders toxic substances harmless and controls blood clotting. More importantly, it’s the only organ that can regenerate itself. That’s why living donors with the same blood type can give a portion of their liver to a transplant patient and have perfectly normal lives thereafter."}, {"3289": "But when our 19-year-old son volunteered to be a living donor for his mom, they told him he had to be 21. When Tanya posted on social media that she could have a living donor, five of her friends stepped up. Three of them made the cut to be potential donors."}, {"93b2": "Yet despite having three matches, each of my wife’s friends told me they felt New York-Presbyterian Hospital made it virtually impossible for them to actually donate. Phone calls not returned, redundant “are you sure” conversations, limiting the testing to one person at a time — all of it gave potential donors the feeling the hospital was trying to dissuade them."}, {"c25d": "As a result of the delays, my wife’s MELD score became too high for her to have a living donor. The Model for End-Stage Liver Disease (MELD) score is used to determine a patient’s place on the organ transplant list, with the maximum score for a living donor set at 25. So we would have to wait for someone to die, preferably from a head injury, so she could have their liver."}, {"9d34": "We were told hoverboards — self-balanced, two-wheeled, battery-powered scooters — are a transplant surgeon’s new best friend."}, {"dce2": "PART TWO"}, {"54fd": "LIVING WITH LIVER DISEASE"}, {"9ac4": "Liver disease is horrible. It’s a destructive force that ravages the body and mind, and caused my wife to lose so much weight that she was virtually nothing but skin and bone toward the end of her life. I hesitated to rub her back or hug her too hard for fear of hurting her."}, {"8d3d": "Then there’s the ascites, a malicious offshoot that causes fluid to accumulate in the abdomen and elsewhere in the body. My wife’s ascites was so bad the doctor actually joked about her carrying twins. Tanya’s only relief was going to the local emergency room to have it periodically drained. Several times doctors took as much as six liters (1.58 gallons) of fluid from her belly — they couldn’t drain too much for fear of causing her kidneys to shut down. And every time Tanya returned from being drained, we had to worry about leaks from the drainage holes. We tried to bandage them the best we could, but the leaks were persistent and seemed ripe for infection."}, {"00d7": "Then there were the false starts. While waiting in the transplant mill, we had three. The first time they took Tanya to the pre-op area at 5:30am, where we waited several hours until the surgeons returned to tell her the liver was too fibrous. The second time, Tanya was about to check out of the hospital after being treated for an infection. The nurse ran up to me in the hallway and told us to wait, that they might have a liver available. So we did, for seven hours, only to find out this particular liver was too fatty."}, {"a21b": "Tanya said, “Let’s go to Popeye’s.” So we did."}, {"3c48": "But the worst false start came after we received a phone call at 11:20pm on December 22nd telling us to get to the hospital. Apparently, an 18-year-old had overdosed and was brain dead. We were told they’d have the liver in house between 8:00 and 9:00am, and that Tanya would be in the operating room by 12:30pm."}, {"cc2c": "Tanya prepped and ready for a liver transplant, December 23, 2015"}, {"1437": "We arrived at the hospital and checked in to the “liver floor” at 2:00am on December 23rd. Finally, we thought, the organ she needed would be available. But 9:00am came and went with no word. Then 12:30pm came and still no word. Despite the lack of updates, the liver team continued to prep Tanya as though the surgery would happen. They gave her fluids and prepared her emotionally by having the surgeon come in to explain what would happen in the operating room. The doctor told my wife this liver arrived just in time, because her health was spiraling: She was getting sicker. Still, we waited, past 5:00pm and then past 8:00pm. Finally, some time after 10:00pm, the liver team came in to say the organ was no good."}, {"4546": "We were devastated."}, {"28d5": "That night, my wife insisted on leaving the hospital so she could be home for Christmas with the family. But on Christmas Eve, her ascites was so bad I had to take her to our local hospital in New Jersey to get drained. The doctors removed another 1.5 gallons of fluid from her belly. Afterward, Tanya talked to me about “spiraling” and told me again she didn’t want to die. Again, I reassured her she would be fine."}, {"5db4": "A FINE LINE BETWEEN HOPE AND DESPAIR"}, {"0d7c": "Waiting for someone else to die so your spouse can live is an awful position. But that’s exactly what we were doing, hoping to take advantage of someone else’s misfortune. It wasn’t until later we discovered New York State ranks 50th out of 50 in percentage of residents who are registered organ donors — plenty of livers, lungs and kidneys that could save lives go to waste."}, {"4e92": "We had a lovely Christmas. Tanya took her traditional place on the couch and watched the kids open their gifts. Friends stopped by and she was happy. But the week after Christmas was bad. Tanya’s condition worsened each day with no check-ins or calls from the liver center about a new organ. On the way to a routine blood test visit, she was so weak, she had to sit and rest by the elevators before riding up to the second floor."}, {"c4cb": "She spent most of that week in bed. Then on Sunday, in the middle of the night, she couldn’t make it to the bathroom by herself."}, {"c0ca": "It had been 11 days since the last transplant false alarm and it felt like they forgot about her. But after another blood test the next day, she was told to get to the New York-Presbyterian Emergency Room immediately. Her kidneys were failing."}, {"b8a6": "The emergency room at NY-P is its own special circle of hell. Gurneys are everywhere: the hallways, the aisles and the “rooms,” which are about five feet wide and divided by curtains. Those who don’t get gurneys sit on hard chairs and wait. The cloud of sickness and disease is almost overwhelming—you want to wear a mask and wash your hands every time you touch something. And yet by some miracle, namely the place’s incredible staff, it functions. We were in the ER until 2:00am, when Tanya was transferred to a step-down room, which is between a regular room and the ICU. She was in so much pain she moaned the entire night, while a woman across the room shouted because she couldn’t understand why she was being restrained."}, {"d296": "When morning finally came on January 5th, the doctor assured Tanya she was right where she needed to be. This was her “transplant admission.” Tanya was as sick as she would get, the doctor said, and she would not be leaving the hospital without a new liver. But no amount of seminars could have prepared us for what we faced over the next three weeks."}, {"606a": "While I was at work, a friend who stayed with Tanya called to say she was being taken to the ICU. But when I returned to the hospital that night, she couldn’t speak — all she could do was grunt. I was told it was because of hepatic encephalopathy, which is the loss of brain function when a damaged liver doesn’t remove toxins from the blood. At 5:30am the following morning, doctors put in a breathing tube because they feared Tanya would choke on her own saliva."}, {"1816": "And I was completely unprepared for what I found when they put her on dialysis. She had two long tubes coming out of her neck and running into the machine, which was purifying her blood."}, {"f356": "My wife was in bad shape. Nurses were draining a lot fluid from her lungs, as she aspirated some vomit the previous day and had developed a lung infection. A nurse practitioner in the ICU told me she was very sick, and I should talk with our kids about their mother possibly not making it. I nearly freaked out. How was that possible? She was supposed to get a new liver, not die from an infection."}, {"07ea": "The next morning, our 19-year-old came with me to the hospital. He saw his mother, connected to a dialysis machine with tubes running into her neck, a breathing tube down her throat, a feeding tube in her nose, and all manner of IVs in what was left of her skinny little arms."}, {"b727": "Tanya on breathing tube in ICU"}, {"83f1": "That evening I returned with both boys to see her. Tanya was heavily sedated, but still managed to lift her head and open her eyes a few times when she heard our sons in the room. While I was telling the boys this was an encouraging sign, the nurse overheard me and said, “She’s been doing that all day.” I was livid. I was trying to give my kids some hope their mother would pull through this and she just shot me down. Later, I noticed our 14-year-old sitting on a chair in the room, a single tear running down his cheek. The memory still brings tears to my eyes."}, {"08a8": "The next day, we were told Tanya had to get better in the next 48 hours or the chances for a liver transplant were remote. Still, the doctor and social worker said my wife was right where they wanted her to be, and there were signs she was improving. She responded to a request, which meant she could still hear. It was a small sign, but I grasped at any improvements and breathed a sigh of relief."}, {"2c2a": "LIFE & DEATH ROLLER COASTER"}, {"2b9c": "For three weeks, we went on the worst roller coaster ride ever. One day Tanya was transplant ready, then too sick the next."}, {"ab93": "After visiting Tanya one night, I had a conversation with my youngest, who said he didn’t want to see his mom the next day. I talked with him about the possibility his mom might not make it — it was one of the hardest things I’ve ever had to do — and that he should go see her whenever he had the chance. It’s extraordinarily difficult to watch your children react to a loved one in such a deteriorated state."}, {"a5ff": "But the roller coaster continued, and Tanya continued to fight. Eventually, the nurses stepped down the oxygen levels, took her off blood pressure medicine, and lowered the sedation so she could respond to us more. The social worker said my wife had met half of the criteria needed to get her transplant. Tanya maintained a semi-awake state for a few days, with bouts of restlessness and aggravation due to the breathing tube. Each day seemed like another step closer to transplant, and I silently cheered her on."}, {"7b7c": "But as the days passed, I grew more impatient. The social worker said doctors were pleased with Tanya’s progress, and that they were just looking for a window to do the transplant. But the waiting game was horrible, as I watched my wife swing between good days and bad days. From days where she was highly aware, answering questions, and very responsive to days where she developed infections, struggled to breathe, or tried to rip out IVs."}, {"3070": "Liver disease is an experience I wouldn’t wish on anyone. It was emotionally and physically exhausting and I just wanted to make it stop. My wife was at death’s door and supposed to be at the top of the transplant list, but weeks later we were still waiting for an organ."}, {"ea54": "PART THREE"}, {"d210": "THE HORROR OF IT ALL"}, {"c4f8": "There are no bathrooms in the ICU. During one visit, Tanya whispered to me it was like “being in a horrible movie.” The indignity of being cleaned up, sometimes roughly, by male and female nurses, and not being able to express herself clearly was taking its toll. And when it was time for me to leave that night, she looked at me like I was deserting her."}, {"3b4d": "In mid-January, Tanya became more alert and feisty. She asked to go home, and I explained the many reasons that wasn’t possible. She even had her first round of physical therapy, but was still fighting that nasty lung infection. As I watched her move her legs with great effort, I reminded myself it was just more baby steps till she was back home with the family."}, {"4c4b": "That night as I was about to leave, Tanya puckered to give me a kiss. I was fighting a cold and didn’t want to make her sick, as she was finally improving. So I tried to explain and gently kissed her forehead. I didn’t know it would be the last chance I would ever have to kiss her."}, {"04a8": "Overnight, Tanya’s liver function worsened and she began to bleed. Doctors said they could control it, and support her even if her liver failed. All we needed was for the infection to be gone, and she’d be liver ready. The entire liver team was pulling for her — she had to stay strong and keep fighting."}, {"b0ad": "But when the next morning came, Tanya’s liver had completely failed and she started bleeding out of her nose, mouth, and gums. I began to think the chances of her being healthy enough to even survive a liver transplant were slim. Still, the nurse practitioner told me he had seen people this sick get new livers and recover, so I held on to a glimmer of hope."}, {"1b27": "As I was leaving the hospital, I received a call from one of our friends who had talked to Tanya’s doctor. The doctor had told her bluntly that anyone who wanted to see Tanya should do so in the next two days. I had just left her room and she seemed to be improving. At least, I thought she was."}, {"dc1b": "AWAITING THE “PERFECT” ORGAN"}, {"408a": "The next day the nurse practitioner came in the room and announced the hospital had started taking calls for livers for Tanya. Our last hope was for a “perfect” organ — meaning one from a child, teen, or smaller adult, according to the surgeons. Tanya’s doctor told me she was good to go once they got their hands on one."}, {"2d05": "There was supposed to be a snowstorm that weekend, which rousted some folks on the transplant team. Apparently, snowstorms mean car accidents, and a higher chance of getting a liver. During the same conversation, the doctor told me just how screwed up the transplant system was. I agreed."}, {"9165": "The prayer that wasn’t answered"}, {"2be9": "January 22nd marked my wife’s 56th birthday, and with it came one of her dearest friends from high school. When my wife saw him, her face lit up, but due to the sedation she immediately fell back asleep. That happened at least four times, and each time she reacted like she was seeing him for the first time. We laughed about it, as a steady stream of visitors came and went to wish her happy birthday."}, {"04fb": "The best moment of the day was when my sons and I came in the room to sing her happy birthday and one of the nurses joined in. Even with the tubes in her throat, down her nose, and everywhere else, she still got a big smile on her face."}, {"c613": "‘Happy birthday T!’"}, {"e694": "The next day, the mayor shut down New York City due to the blizzard, so I wasn’t able to get to the hospital to see my wife. Fortunately, that also meant her high school friend was stuck in New York and could connect us via FaceTime. During the digital chat, Tanya waved and we laughed."}, {"5436": "But later that night, while my oldest and I were shoveling the driveway, the ICU called to say Tanya had a great day, but her blood pressure was crashing; that she had another infection and this time it was really bad. I didn’t sleep, thinking the FaceTime I had with my wife might be our last."}, {"f49d": "THE END"}, {"1e89": "When I arrived at the hospital the next morning, it was like Tanya was already dead. Her eyes were barely open and there was no one there. Her chest moved up and down in rhythm with the breathing machine — she was clearly being kept alive until we could get in to say goodbye. My oldest son and I talked to her and stroked her forehead, hoping she could hear but knowing she probably didn’t. And when her heart stopped at 1:43pm that day, her family and friends were all standing around the bed."}, {"c557": "It was the most intense experience I’ve ever had."}, {"5bab": "That day, I lost my friend, my partner of 22 years, and the mother of my two sons. A few days later, the friend who stayed with her during the evening of the blizzard told me he had talked with her and tried to comfort her, despite the fact that she was unconscious. He wasn’t sure if Tanya could hear, but when he spoke about myself and the boys, a single tear ran down her cheek. He sent a picture that, to this day, breaks my heart."}, {"5a46": "A tear from Tanya for her family"}, {"beff": "Looking back, it’s clear the transplant system in this country is an abject disaster. Despite the high quality and reputation of New York-Presbyterian’s surgeons, and heroic efforts of the ICU team, for which I am forever grateful, my wife died waiting for the “perfect” organ."}, {"0492": "I honestly believe once Tanya went to the ICU, her odds of getting a transplant went down exponentially. Waiting till someone is so sick they may not even survive the surgery is absurd. The pneumonia, lung and stomach infections, and ultimate failure of her liver meant the transplant window was so small, it was virtually impossible to hit. The push to get the “perfect” organ made finding one even less likely. For me, the “perfect” liver would be one that extended her life another five years or so, giving her time to receive some type of stem cell treatment and leave this mess of a transplant system behind."}, {"c9ec": "And that may be all the time she needed. I recently wrote to Fernando Camargo, Ph.D., from the Stem Cell Program at Children’s Hospital in Boston. Dr. Camargo wrote back that he believes “within 5 years, there will be some novel therapeutic approaches in the clinic” to treat liver disease."}, {"e556": "LESSONS LEARNED"}, {"c6fd": "First, get on multiple transplant lists. We were afraid to do so because we didn’t want Columbia Presbyterian to push Tanya down the list if they found out. That was a huge mistake. New York is in Region 9, which only gets livers from New York State and Vermont. And as I mentioned earlier, New York is 50th in percentage of residents who are organ donors. If we’d registered in New Jersey, where we live, we would have had access to livers from Jersey, West Virginia, Delaware, Maryland, Pennsylvania, Washington, D.C., and Virginia. And while I’m told NY-P was legally and morally obligated to tell us this, no one ever did. Instead, we found a bullet point in a form Tanya signed."}, {"1b7b": "The 6th bullet point mentions “multiple listing”"}, {"af2e": "Second, the only reason to go to New York for a transplant is if you have a living donor lined up and approved. I lost count how many times I was told about the competition for organs among hospitals in the city, and that makes it a total crapshoot. You never know when (or if) a liver will come to your hospital. On my wife’s last day a doctor from the liver team told me the pre-eminent transplant center in the U.S. hadn’t had a liver come through its doors for three weeks. That was the entire time my wife was in the ICU. She was O+, too, the most common blood type."}, {"68e2": "And another thing: Why the hell are hospitals fighting over organs in the first place? Wouldn’t it be smarter to have one be where you go for a liver transplant. Another for lungs. And another for kidneys. No competition. The list dictates who gets what, and the system dictates where they get it."}, {"e35c": "A doctor I spoke to recently told me point blank he never sends transplant patients to New York. Ever."}, {"45e2": "Avoid transplants over the holidays, if at all possible. You’d like to think you wouldn’t get lost over the holidays, but in Tanya’s case, the fact that we didn’t hear from the hospital for 11 days, in spite of the fact that she was “spiraling,” told us all we needed to know."}, {"f9ea": "Beware talk of a “perfect” organ. Throughout this process, doctors kept talking about finding Tanya the perfect liver. Yet on her birthday, we left the room for a bit and met a gentleman whose mother received a transplant at a West Chester hospital when she was in her 50s. Her liver came from a 70-year-old man. Here it was, 20 years later, and she was in the hospital for “routine maintenance.” Otherwise, he said, the liver was working just fine."}, {"1f89": "Finally, do your research. Late in the process, we found out there were at least 100 people on the New York liver transplant list, whereas in New Jersey there were just 2. I truly wish we’d known that earlier. (https://optn.transplant.hrsa.gov/data/view-data-reports/regional-data/)"}, {"f4c7": "Tanya and I put our absolute faith in the New York City transplant mill, and I will regret it for the rest of my life."}, {"dbaa": "In the days following Tanya’s death, she received a solicitation in the mail that read, “We invite you to show your appreciation by making a gift to New York-Presbyterian Hospital. Your contribution will both express your thanks to your doctor, and help make amazing things happen for every patient who walks through our doors.”"}, {"d181": "I won’t be sending a donation any time soon."}, {"224a": "The solicitation that arrived days after Tanya’s death"}, {"1634": "PART FOUR"}, {"6652": "TANYA’S MEMORIAL CELEBRATION"}, {"3180": "On March 5th, about 300 of Tanya Gibson-Clark’s family and friends gathered in Maplewood, New Jersey, to pay tribute to a life well lived. I invite you to watch the video below to really know Tanya the dancer, teacher, wife, mother and friend. She was a very special person. Thank you. BC"}, {"2343": "Tanya Gibson-Clark’s Memorial Tribute, March 5, 2016"}], "child": "1617_1\t1617_2\t1617_3\t1617_4\t1617_5\t1617_6\t1617_7\t1617_8\t1617_9\t1617_10\t1617_11\t1617_12\t1617_13\t1617_14\t1617_15\t1617_16\t1617_17\t1617_18\t1617_19\t1617_20\t1617_21\t1617_22\t1617_23\t1617_24\t1617_251617_1\t1617_2\t1617_3\t1617_4\t1617_5\t1617_6\t1617_7\t1617_8\t1617_9\t1617_10\t1617_11\t1617_12\t1617_13\t1617_14\t1617_15\t1617_16\t1617_17\t1617_18\t1617_19\t1617_20\t1617_21\t1617_22\t1617_23\t1617_24\t1617_251617_1\t1617_2\t1617_3\t1617_4\t1617_5\t1617_6\t1617_7\t1617_8\t1617_9\t1617_10\t1617_11\t1617_12\t1617_13\t1617_14\t1617_15\t1617_16\t1617_17\t1617_18\t1617_19\t1617_20\t1617_21\t1617_22\t1617_23\t1617_24\t1617_251617_1\t1617_2\t1617_3\t1617_4\t1617_5\t1617_6\t1617_7\t1617_8\t1617_9\t1617_10\t1617_11\t1617_12\t1617_13\t1617_14\t1617_15\t1617_16\t1617_17\t1617_18\t1617_19\t1617_20\t1617_21\t1617_22\t1617_23\t1617_24\t1617_251617_1\t1617_2\t1617_3\t1617_4\t1617_5\t1617_6\t1617_7\t1617_8\t1617_9\t1617_10\t1617_11\t1617_12\t1617_13\t1617_14\t1617_15\t1617_16\t1617_17\t1617_18\t1617_19\t1617_20\t1617_21\t1617_22\t1617_23\t1617_24\t1617_25"}