{"name": "1622", "parent": "", "content": "Sobre a série Girls: o que não levamos dos nossos 20 anos O forte de Girls sempre foi provocar sensações Girls é uma série com muitos problemas que, provavelmente, será lembrada como algo que tinha muito potencial, mas não deu certo. Ainda assim — ou talvez justamente por isso — Girls foi a série dos meus 20 anos. Em 2012, eu passava as tardes tentando escrever ou fazer qualquer coisa minimamente produtiva durante o período em que minha faculdade estava em greve. Eu tinha tempo demais, vontade demais e nem um pedaço de chão próprio. Então, Lena Dunham apareceu em uma série que beirava o horror em seu excesso de realismo. Eu odiei e amei me identificar com Girls. Porque, enfim, aquela era uma conversa da qual eu podia participar, aquela era uma protagonista possível e não uma miragem do que eu supostamente deveria ser aos 22 anos. Hoje já não tem o mesmo efeito, mas em uma fase tão vazia de sentido, foi importante encontrar personagens femininas falhas, detestáveis e confusas. O forte de Girls sempre foi provocar sensações. Gosto muito de uma distinção apontada por Carol Bensimon entre romances de informação e romances de clima. Os romances de informação, segundo Bensimon, seriam aqueles focados em expressar uma opinião e relatar acontecimentos ou questões contemporâneas, enquanto os de clima são os que se ocupam de transmitir uma sensação, aquela famigerada vibe. Por exemplo, ao analisar Americanah, de Chimamanda Ngozi Adichie, Bensimon diz que o livro seria mais gostoso e eficaz se, em meio aos diálogos sobre a realidade nigeriana, houvesse um pouco de nada, um pouco daqueles momentos que parecem intervalos, em que jogamos tempo e conversa fora. Não sei se concordo com a leitura desse livro específico, mas certamente me identifico com a preferência de Bensimon por livros de clima. sente essa vibe. E, por isso, acho que Girls é uma série que, apesar de tantos erros, foi eficaz, porque ela consegue recriar muitas das sensações que vivi ao longo dos últimos anos; sentimentos tão difíceis de rotular, de discernir entre raiva, amor ou tédio, enfim, toda uma gama de emoções e acontecimentos que escapam dos fatos e das informações objetivas. Girls é uma série que se concentra no que acontece depois do que supostamente deveria ser grande, porque parece reconhecer que os mais significativos eventos se passam durante os intervalos, nas noites em que estamos completamente sozinhos, entre as caminhadas que enfrentamos até chegar onde nos esperam. Um dos meus episódios preferidos da série foi o oitavo da sexta e última temporada, porque ele conseguiu sintetizar de um modo radical o que há de melhor em Girls: Os desencontros, a agonia, a busca por um lugar ou uma pessoa que nos acolha, a instabilidade, o medo e esse inevitável momento em que precisamos voltar para nossa casa sozinhos. A partir de agora o texto contém spoilers. What will we do this time about Adam? Começa com Adam contando à Jessa que precisa ficar com Hannah e ajudá-la a criar um bebê que não é seu filho. Uma afirmação típica de Adam, ou seja, bem loca. Jessa, possivelmente por já conhecer o jeito impulsivo e pouco razoável de Adam, se abala, mas não demonstra, deixa que ele faça o que diz que desejar. É assim que ele chega até Hannah decidido e ela o recebe com a mesma confusão que os espectadores sentem. Até que há um corte dessa cena, em um mercado, para uma em que Adam e Hannah estão transando. Acho que não houve um pessoa que assistiu isso e não soltou um “Mas o quê?”. Esse corte súbito e inesperado — que, ao mesmo tempo, faz tanto sentido quando se trata desses dois personagens — é uma preciosidade de Girls. Nos melhores episódios, a série nos poupa dos diálogos óbvios e nos leva imediatamente para aquele instante onde as coisas mais estranhas e, no entanto, familiares acontecem. Porque a vida é assim, na maior parte das vezes, quando nos damos conta, já perdemos uma ou três cenas de nossas próprias histórias. Durante esse episódio, Adam e Hannah revisitam todos os gestos que marcaram o relacionamento entre eles. Com uma química intacta, eles se rendem à fantasia de juntos criarem um bebê, conversam sobre o medo que envolve esse tipo de responsabilidade, fazem planos, vão às compras, caminham lado a lado como se, apesar dos desvios de percurso (afinal, Hannah pergunta a Adam como foi transar com Jessa), nada nunca tivesse mudado. Eles agem como se isso fosse o caminho mais natural, como se sempre soubessem que seria assim e, de uma hora para outra, voltariam a compartilhar suas vidas. Apesar de insensato, é fácil entender o que se passa, especialmente quando se pensa na situação de Hannah que está grávida, sozinha, confusa e vulnerável. Adam não parece ainda ser uma possibilidade real. Ele não é mais compatível com sua vida. Não é o que ela espera do amor e certamente não é quem pode lhe fazer feliz. Mas, mesmo assim, é a intimidade possível. Entre eles existe esse conhecimento, uma espécie de dinâmica, justamente o que falta no início dos relacionamentos, quando pisamos em ovos para tentar esconder o que há de pior em nós. Eles já passaram por isso. Com Adam, Hannah não precisa encenar ou fingir que está bem, que tem plena certeza e segurança diante da escolha de ser mãe. Ele conhece sua ansiedade e seus limites — e, até certo ponto, não a julga por isso. Nesse momento de instabilidade, Hannah encontra em Adam um lugar seguro. Ele conhece quem ela é. Mais do que isso: Adam conhece quem Hannah foi. Ele tem acesso a uma parte da sua história. Estar com ele é revisitar uma época. O que se dá entre eles, a tal dinâmica, parece ser algo que sobrevive a todas as mudanças e coisas que o tempo extermina, é um furo na linearidade. Adam conhece quem ela foi e, por mais que ela talvez nem deseje retornar ao passado, há sempre uma nostalgia que nos ronda, por que quem gosta de admitir suas perdas? É a mesma coleção de possibilidades que abrimos aos domingos para nos distrair do tempo presente, sempre confuso demais: E se a gente pudesse ser quem é e ainda carregar todos os pedacinhos que nos formaram? E se as transformações não significassem a extinção de grande parte do que fomos? E se, diante de toda instabilidade, existisse uma pessoa que permanecesse, uma pessoa que conhecesse nosso âmago de tal modo que as mudanças seriam sempre superficiais? São muitas as fantasias que habitam uma relação. Contudo, Adam conhece mais quem Hannah foi do que quem Hannah é ou deseja ser. Porque viver essa relação e seu término a transformou e Adam não teve acesso a esse processo. Esse desencontro, essa perda fundamental que se dá entre nossos deslocamentos, parece ser algo recorrente na vida, para além dos relacionamentos românticos, e ainda mais intenso durante os nossos 20 e alguns anos. Nós somos atravessados por acontecimentos que não escolhemos e, pior, somos obrigados a fazer escolhas, a apostar em riscos e ceder aos seus limites. Em meio a isso, pessoas, lugares, gestos vão perdendo o sentindo, se reconstruindo ou existindo em nossas vidas como uma palavra de uma língua morta, acessível mas inabitável. O que Adam e Hannah vivem durante aquela tarde é a sorte, um pouco amarga e deliciosa, de tapear a vida. Como se fosse possível esse tipo de roubo, eles reencontram uma oportunidade perdida e se entregam, entram juntos em uma máquina do tempo. Mas uma hora a viagem acaba, a névoa se dissipa, o alarme dispara, as responsabilidades são sempre mais persistentes do que nossas tentativas de fuga. Inevitavelmente chega a hora de voltar para a Terra. A hora de voltar aos hábitos gastos da rotina, “fazer compras”, “trabalhar”, “tentar dormir”. Essa dolorosa inevitabilidade que nos força a admitir que estar vivo é um exercício de perda. Girls é sobre essa volta que forçosamente negamos até que seja mais uma vez inevitável. O tema desse episódio é o mesmo da série, os intervalos que inventamos para nos refugiar enquanto protelamos o encontro com a concretude de nossas vidas. Porque é assustador, solitário e frustrante reconhecer que daqui pra frente a única garantia é a instabilidade. Girls é sobre constatar — e repetir essa descoberta, porque ela nunca é totalmente aceita ou assimilada — que ser é sempre estar sendo, porque não há um ponto definido em que vamos nos tornar algo e qualquer conquista é temporária. Enquanto estamos vivos, nossa vida permanece em questão. Dá um cansaço só de pensar, mas pode ser que consentir a essa conclusão seja a origem dos nossos inícios. ", "title": "Sobre a série Girls: o que não levamos dos nossos 20 anos", "sentences": [{"a44e": "Sobre a série Girls: o que não levamos dos nossos 20 anos"}, {"b7a9": "O forte de Girls sempre foi provocar sensações"}, {"9548": "Girls é uma série com muitos problemas que, provavelmente, será lembrada como algo que tinha muito potencial, mas não deu certo. Ainda assim — ou talvez justamente por isso — Girls foi a série dos meus 20 anos. Em 2012, eu passava as tardes tentando escrever ou fazer qualquer coisa minimamente produtiva durante o período em que minha faculdade estava em greve. Eu tinha tempo demais, vontade demais e nem um pedaço de chão próprio."}, {"115a": "Então, Lena Dunham apareceu em uma série que beirava o horror em seu excesso de realismo. Eu odiei e amei me identificar com Girls. Porque, enfim, aquela era uma conversa da qual eu podia participar, aquela era uma protagonista possível e não uma miragem do que eu supostamente deveria ser aos 22 anos. Hoje já não tem o mesmo efeito, mas em uma fase tão vazia de sentido, foi importante encontrar personagens femininas falhas, detestáveis e confusas."}, {"4eda": "O forte de Girls sempre foi provocar sensações. Gosto muito de uma distinção apontada por Carol Bensimon entre romances de informação e romances de clima. Os romances de informação, segundo Bensimon, seriam aqueles focados em expressar uma opinião e relatar acontecimentos ou questões contemporâneas, enquanto os de clima são os que se ocupam de transmitir uma sensação, aquela famigerada vibe. Por exemplo, ao analisar Americanah, de Chimamanda Ngozi Adichie, Bensimon diz que o livro seria mais gostoso e eficaz se, em meio aos diálogos sobre a realidade nigeriana, houvesse um pouco de nada, um pouco daqueles momentos que parecem intervalos, em que jogamos tempo e conversa fora. Não sei se concordo com a leitura desse livro específico, mas certamente me identifico com a preferência de Bensimon por livros de clima."}, {"d5b1": "sente essa vibe."}, {"7ae5": "E, por isso, acho que Girls é uma série que, apesar de tantos erros, foi eficaz, porque ela consegue recriar muitas das sensações que vivi ao longo dos últimos anos; sentimentos tão difíceis de rotular, de discernir entre raiva, amor ou tédio, enfim, toda uma gama de emoções e acontecimentos que escapam dos fatos e das informações objetivas. Girls é uma série que se concentra no que acontece depois do que supostamente deveria ser grande, porque parece reconhecer que os mais significativos eventos se passam durante os intervalos, nas noites em que estamos completamente sozinhos, entre as caminhadas que enfrentamos até chegar onde nos esperam."}, {"28fd": "Um dos meus episódios preferidos da série foi o oitavo da sexta e última temporada, porque ele conseguiu sintetizar de um modo radical o que há de melhor em Girls:"}, {"d996": "Os desencontros, a agonia, a busca por um lugar ou uma pessoa que nos acolha, a instabilidade, o medo e esse inevitável momento em que precisamos voltar para nossa casa sozinhos."}, {"f4ee": "A partir de agora o texto contém spoilers."}, {"4570": "What will we do this time about Adam? Começa com Adam contando à Jessa que precisa ficar com Hannah e ajudá-la a criar um bebê que não é seu filho. Uma afirmação típica de Adam, ou seja, bem loca. Jessa, possivelmente por já conhecer o jeito impulsivo e pouco razoável de Adam, se abala, mas não demonstra, deixa que ele faça o que diz que desejar. É assim que ele chega até Hannah decidido e ela o recebe com a mesma confusão que os espectadores sentem. Até que há um corte dessa cena, em um mercado, para uma em que Adam e Hannah estão transando. Acho que não houve um pessoa que assistiu isso e não soltou um “Mas o quê?”."}, {"bca9": "Esse corte súbito e inesperado — que, ao mesmo tempo, faz tanto sentido quando se trata desses dois personagens — é uma preciosidade de Girls. Nos melhores episódios, a série nos poupa dos diálogos óbvios e nos leva imediatamente para aquele instante onde as coisas mais estranhas e, no entanto, familiares acontecem. Porque a vida é assim, na maior parte das vezes, quando nos damos conta, já perdemos uma ou três cenas de nossas próprias histórias."}, {"1b50": "Durante esse episódio, Adam e Hannah revisitam todos os gestos que marcaram o relacionamento entre eles. Com uma química intacta, eles se rendem à fantasia de juntos criarem um bebê, conversam sobre o medo que envolve esse tipo de responsabilidade, fazem planos, vão às compras, caminham lado a lado como se, apesar dos desvios de percurso (afinal, Hannah pergunta a Adam como foi transar com Jessa), nada nunca tivesse mudado. Eles agem como se isso fosse o caminho mais natural, como se sempre soubessem que seria assim e, de uma hora para outra, voltariam a compartilhar suas vidas."}, {"b9a1": "Apesar de insensato, é fácil entender o que se passa, especialmente quando se pensa na situação de Hannah que está grávida, sozinha, confusa e vulnerável. Adam não parece ainda ser uma possibilidade real. Ele não é mais compatível com sua vida. Não é o que ela espera do amor e certamente não é quem pode lhe fazer feliz. Mas, mesmo assim, é a intimidade possível. Entre eles existe esse conhecimento, uma espécie de dinâmica, justamente o que falta no início dos relacionamentos, quando pisamos em ovos para tentar esconder o que há de pior em nós. Eles já passaram por isso. Com Adam, Hannah não precisa encenar ou fingir que está bem, que tem plena certeza e segurança diante da escolha de ser mãe. Ele conhece sua ansiedade e seus limites — e, até certo ponto, não a julga por isso. Nesse momento de instabilidade, Hannah encontra em Adam um lugar seguro. Ele conhece quem ela é."}, {"cc44": "Mais do que isso: Adam conhece quem Hannah foi. Ele tem acesso a uma parte da sua história. Estar com ele é revisitar uma época. O que se dá entre eles, a tal dinâmica, parece ser algo que sobrevive a todas as mudanças e coisas que o tempo extermina, é um furo na linearidade. Adam conhece quem ela foi e, por mais que ela talvez nem deseje retornar ao passado, há sempre uma nostalgia que nos ronda, por que quem gosta de admitir suas perdas?"}, {"d79f": "É a mesma coleção de possibilidades que abrimos aos domingos para nos distrair do tempo presente, sempre confuso demais: E se a gente pudesse ser quem é e ainda carregar todos os pedacinhos que nos formaram? E se as transformações não significassem a extinção de grande parte do que fomos? E se, diante de toda instabilidade, existisse uma pessoa que permanecesse, uma pessoa que conhecesse nosso âmago de tal modo que as mudanças seriam sempre superficiais?"}, {"abd5": "São muitas as fantasias que habitam uma relação."}, {"7fc7": "Contudo, Adam conhece mais quem Hannah foi do que quem Hannah é ou deseja ser. Porque viver essa relação e seu término a transformou e Adam não teve acesso a esse processo. Esse desencontro, essa perda fundamental que se dá entre nossos deslocamentos, parece ser algo recorrente na vida, para além dos relacionamentos românticos, e ainda mais intenso durante os nossos 20 e alguns anos. Nós somos atravessados por acontecimentos que não escolhemos e, pior, somos obrigados a fazer escolhas, a apostar em riscos e ceder aos seus limites. Em meio a isso, pessoas, lugares, gestos vão perdendo o sentindo, se reconstruindo ou existindo em nossas vidas como uma palavra de uma língua morta, acessível mas inabitável."}, {"6d98": "O que Adam e Hannah vivem durante aquela tarde é a sorte, um pouco amarga e deliciosa, de tapear a vida. Como se fosse possível esse tipo de roubo, eles reencontram uma oportunidade perdida e se entregam, entram juntos em uma máquina do tempo. Mas uma hora a viagem acaba, a névoa se dissipa, o alarme dispara, as responsabilidades são sempre mais persistentes do que nossas tentativas de fuga. Inevitavelmente chega a hora de voltar para a Terra. A hora de voltar aos hábitos gastos da rotina, “fazer compras”, “trabalhar”, “tentar dormir”."}, {"2e66": "Essa dolorosa inevitabilidade que nos força a admitir que estar vivo é um exercício de perda."}, {"e8e3": "Girls é sobre essa volta que forçosamente negamos até que seja mais uma vez inevitável. O tema desse episódio é o mesmo da série, os intervalos que inventamos para nos refugiar enquanto protelamos o encontro com a concretude de nossas vidas. Porque é assustador, solitário e frustrante reconhecer que daqui pra frente a única garantia é a instabilidade. Girls é sobre constatar — e repetir essa descoberta, porque ela nunca é totalmente aceita ou assimilada — que ser é sempre estar sendo, porque não há um ponto definido em que vamos nos tornar algo e qualquer conquista é temporária. Enquanto estamos vivos, nossa vida permanece em questão."}, {"7621": "Dá um cansaço só de pensar, mas pode ser que consentir a essa conclusão seja a origem dos nossos inícios."}], "child": "1622_1\t1622_2\t1622_3\t1622_4\t1622_5\t1622_6\t1622_7\t1622_8\t1622_9"}