{"name": "1649", "parent": "", "content": "Final Fantasy XV “Se c’è un futuro per i JRPG, passa per Xenoblade Chronicles”. Ero io, nel 2011, dopo aver provato uno dei migliori giochi mai arrivati da uno studio giapponese in un periodo di forte crisi per l’industria nipponica. Square mi aveva preso in parola. La sua IP più grande avrebbe preso un’altra direzione e Final Fanatsy XV sarebbe diventato un open world con sistema di combattimento action, un gioco più vicino ai gusti occidentali di quanto non lo fossero i predecessori. Poi il progetto è passato per più mani ed è stato rimaneggiato più volte e, allo stato attuale, è difficile dire cosa è Final Fantasy XV. Per questo proverò a dire cosa non è. Final Fantasy XV non è un gioco scritto bene. Non mi soffermo quasi mai sull’aspetto narrativo dei giochi e, se lo faccio, è perché in questo caso è particolarmente fastidioso. Non c’è evoluzione nei personaggi, non ci sono back stories o appronfondimenti sui personaggi e sui loro rapporti e, in generale, tutto ha un sapore caricaturale. Le situazioni e i momenti in cui si porta avanti la linea narrativa sono imbarazzanti: non c’è logica né costruzione per un qualcosa di più profondo tanto che, nonostante il gioco si prenda molto sul serio, spesso le cutscene si riducono ad una sequenza di cose totalmente random e il tutto scade nel ridicolo. Insomma, se propio dobbiamo ricordare questo Final Fantasy XV per qualcosa, non lo faremo per la fine narrativa. Final Fantasy XV non è un gioco dal ritmo stellare. Il mondo è bello dal punto di vista estetico ma, a conti fatti, è vuoto. Gli scontri con i nemici, i dungeon e i minigiochi sono tutti separati da grosse distese di nulla da percorre a bordo di un auto che non si può guidare. Quello fatto sul mondo e le ambientazioni è un lavoro fatto a metà: è stato curata l’architettura e la resa grafica dei luoghi ma ci si è dimenticato di dare loro vita. Quello che rimane è una sequenza di cartoline. Troppo poco per me. Final Fantasy XV non sfrutta il potenziale delle sue meccaniche di gioco. Il sistema di combattimento è ben disegnato, funziona bene e l’introduzione della proiezione costringe a studiare anche le ambientazioni oltre che le creature nemiche (che, per inciso, sono di due tipi: gruppi di minion impazziti che ci girano intorno e nemici singoli enormi, lenti e potenti). Peccato per i personaggi del nostro party che agiscono in maniera insensata, peccato per le telecamere che fanno tirare bestemmie una dopo l’altra, peccato per la mancata progressione del gioco, peccato per l’elisione totale degli elementi che caratterizzavano la serie: le magie non ci sono più, le evocazioni sia attivano casualmente o quasi, la personalizzazione tramite armi ed equipaggiamento è ridotta all’osso. Anche qui, nonostante ci sia del buono, si poteva fare molto di più. Allora cosa rimane di questo Final Fantasy XV? Rimane l’amaro in bocca per quella che è, a tutti gli effetti, una occasione sprecata. Sarebbe bastato ridurre le dimensioni del mondo per dare l’impressione che fosse più denso, più vivo, sarebbe bastato un sistema di quest più flessibile per avere ritmo. E invece ci ritroviamo con un gioco che non funziona, che non riesce minimamente a scalfire il primato di Xenoblade. In definitiva, Final Fantasy XV non è un buon gioco, è una grossa delusione. ", "title": "Final Fantasy XV", "sentences": [{"3952": "Final Fantasy XV"}, {"2c07": "“Se c’è un futuro per i JRPG, passa per Xenoblade Chronicles”. Ero io, nel 2011, dopo aver provato uno dei migliori giochi mai arrivati da uno studio giapponese in un periodo di forte crisi per l’industria nipponica."}, {"7963": "Square mi aveva preso in parola. La sua IP più grande avrebbe preso un’altra direzione e Final Fanatsy XV sarebbe diventato un open world con sistema di combattimento action, un gioco più vicino ai gusti occidentali di quanto non lo fossero i predecessori."}, {"f321": "Poi il progetto è passato per più mani ed è stato rimaneggiato più volte e, allo stato attuale, è difficile dire cosa è Final Fantasy XV. Per questo proverò a dire cosa non è."}, {"94fb": "Final Fantasy XV non è un gioco scritto bene. Non mi soffermo quasi mai sull’aspetto narrativo dei giochi e, se lo faccio, è perché in questo caso è particolarmente fastidioso. Non c’è evoluzione nei personaggi, non ci sono back stories o appronfondimenti sui personaggi e sui loro rapporti e, in generale, tutto ha un sapore caricaturale. Le situazioni e i momenti in cui si porta avanti la linea narrativa sono imbarazzanti: non c’è logica né costruzione per un qualcosa di più profondo tanto che, nonostante il gioco si prenda molto sul serio, spesso le cutscene si riducono ad una sequenza di cose totalmente random e il tutto scade nel ridicolo. Insomma, se propio dobbiamo ricordare questo Final Fantasy XV per qualcosa, non lo faremo per la fine narrativa."}, {"0d0c": "Final Fantasy XV non è un gioco dal ritmo stellare. Il mondo è bello dal punto di vista estetico ma, a conti fatti, è vuoto. Gli scontri con i nemici, i dungeon e i minigiochi sono tutti separati da grosse distese di nulla da percorre a bordo di un auto che non si può guidare. Quello fatto sul mondo e le ambientazioni è un lavoro fatto a metà: è stato curata l’architettura e la resa grafica dei luoghi ma ci si è dimenticato di dare loro vita. Quello che rimane è una sequenza di cartoline. Troppo poco per me."}, {"04fc": "Final Fantasy XV non sfrutta il potenziale delle sue meccaniche di gioco. Il sistema di combattimento è ben disegnato, funziona bene e l’introduzione della proiezione costringe a studiare anche le ambientazioni oltre che le creature nemiche (che, per inciso, sono di due tipi: gruppi di minion impazziti che ci girano intorno e nemici singoli enormi, lenti e potenti). Peccato per i personaggi del nostro party che agiscono in maniera insensata, peccato per le telecamere che fanno tirare bestemmie una dopo l’altra, peccato per la mancata progressione del gioco, peccato per l’elisione totale degli elementi che caratterizzavano la serie: le magie non ci sono più, le evocazioni sia attivano casualmente o quasi, la personalizzazione tramite armi ed equipaggiamento è ridotta all’osso. Anche qui, nonostante ci sia del buono, si poteva fare molto di più."}, {"31b1": "Allora cosa rimane di questo Final Fantasy XV? Rimane l’amaro in bocca per quella che è, a tutti gli effetti, una occasione sprecata. Sarebbe bastato ridurre le dimensioni del mondo per dare l’impressione che fosse più denso, più vivo, sarebbe bastato un sistema di quest più flessibile per avere ritmo. E invece ci ritroviamo con un gioco che non funziona, che non riesce minimamente a scalfire il primato di Xenoblade."}, {"da48": "In definitiva, Final Fantasy XV non è un buon gioco, è una grossa delusione."}], "child": "1649_1\t1649_2"}