{"name": "1656", "parent": "", "content": "Part 1 — Sony X940E pre-order experience Shut up and take my money! Generally, plunking down a pile of cash for something should be a good experience, right? After all, I’m buying a premium device and I’d hope, if nothing else, to find an easy method to give someone money in exchange for the product I want. Apparently, I asked for too much. Now I’m sure there is some complicated reason that boils down to dollars and cents but when, in 2015, Sony decided to shutter their dozen or so retail stores they operated in the US alongside their entire online store, they also opted to end any direct relationship they had with consumers. For a company that enjoys a very small mindshare among consumers outside of PlayStation, and has little to no marketing efforts, surely my experience of trying to give them $6,500 for a TV can be traced back to that decision. The keyword here is trying. You see, when a new iPhone or insert-whatever-other-Apple-product-you’d-like is announced, we learn shortly after exactly what date the device will go on sale and when it will become available for pre-order. From there, the usual scenario plays out: their online store and shopping app goes live at midnight with the new product, millions of us rush it, crash it and somewhere in between, we’re able to give Apple money for a product we want. And that’s just for products that tend to range between $200-$900. The shopping experience for the X940E, Sony’s 4K HDR TV which was unveiled at CES 2017, couldn’t be further from this. From the minute Sony products are announced at CES, they’re given a vague release window of either TBA or Spring and even worse, Summer. This means what we see from them in early January could be anywhere from 6 to 9 months away, ensuring that more aggressive rivals can sweep in with a product unveiling and launch it long before Sony even has a chance to sell them. Not that once available, buying them is easy. Thanks to some little birdies, I had a general idea as to when the X940E would launch, something most consumers would never know and even I had to routinely refresh Sony and Best Buy’s website to learn exactly when I could buy the TV. That’s because although Sony eventually allowed me to use their “notify” feature which would send me an email about when the TV would be available, it wouldn’t send me anything until two weeks after I had already pre-ordered it at Best Buy. Yes, Best Buy was able to have more accurate information on the X940E than Sony itself but even that was problematic because for the first two weeks on their site, the TV had a listing price of $7,999 and not $5,999. This meant that if anybody was interested in preordering the TV, they may have seen that price and moved right along. But even if no priced hampered your excitement for the flagship TV, going to a Best Buy store that, in my case, even had a Magnolia division inside of it, their supposed premium tier home theater division, was a nightmare. Talk about the perfect customer — I walked into the store with card in hand and knew exactly what I wanted and had no desire to bargain or shop around. Yet after sitting around in Magnolia for over 20 minutes with my wife, hoping that someone would come to us, I had to eventually wander around the store to find some help. If that’s not absurd, I don’t know what is. Remember that this is all in the context of a knowledgable consumer who is ready to part with their money. Now imagine what the poor sap who may have heard of the new TVs from Sony must experience or the average person who walks into any retail store and needs a new TV. Would they last through all that or would they see a Samsung or LG TV that looks bright for $2,500 and buy that? The moral of the story is this: when you end your sales channels to consumers and don’t have a clear go-to-market strategy, outside of the old business model, you also forfeit your relationship with consumers and in turn, they experience the less-than-spectacular time that I went through. Can operating an online store really be that challenging for a multi-billion dollar company? Thanks for reading! Did you like this post? Let us know! ", "title": "Part 1 — Sony X940E pre-order experience", "sentences": [{"86ba": "Part 1 — Sony X940E pre-order experience"}, {"cce4": "Shut up and take my money!"}, {"1701": "Generally, plunking down a pile of cash for something should be a good experience, right? After all, I’m buying a premium device and I’d hope, if nothing else, to find an easy method to give someone money in exchange for the product I want. Apparently, I asked for too much. Now I’m sure there is some complicated reason that boils down to dollars and cents but when, in 2015, Sony decided to shutter their dozen or so retail stores they operated in the US alongside their entire online store, they also opted to end any direct relationship they had with consumers."}, {"256f": "For a company that enjoys a very small mindshare among consumers outside of PlayStation, and has little to no marketing efforts, surely my experience of trying to give them $6,500 for a TV can be traced back to that decision. The keyword here is trying."}, {"3e13": "You see, when a new iPhone or insert-whatever-other-Apple-product-you’d-like is announced, we learn shortly after exactly what date the device will go on sale and when it will become available for pre-order. From there, the usual scenario plays out: their online store and shopping app goes live at midnight with the new product, millions of us rush it, crash it and somewhere in between, we’re able to give Apple money for a product we want. And that’s just for products that tend to range between $200-$900."}, {"723f": "The shopping experience for the X940E, Sony’s 4K HDR TV which was unveiled at CES 2017, couldn’t be further from this. From the minute Sony products are announced at CES, they’re given a vague release window of either TBA or Spring and even worse, Summer. This means what we see from them in early January could be anywhere from 6 to 9 months away, ensuring that more aggressive rivals can sweep in with a product unveiling and launch it long before Sony even has a chance to sell them."}, {"7942": "Not that once available, buying them is easy. Thanks to some little birdies, I had a general idea as to when the X940E would launch, something most consumers would never know and even I had to routinely refresh Sony and Best Buy’s website to learn exactly when I could buy the TV. That’s because although Sony eventually allowed me to use their “notify” feature which would send me an email about when the TV would be available, it wouldn’t send me anything until two weeks after I had already pre-ordered it at Best Buy."}, {"c825": "Yes, Best Buy was able to have more accurate information on the X940E than Sony itself but even that was problematic because for the first two weeks on their site, the TV had a listing price of $7,999 and not $5,999. This meant that if anybody was interested in preordering the TV, they may have seen that price and moved right along. But even if no priced hampered your excitement for the flagship TV, going to a Best Buy store that, in my case, even had a Magnolia division inside of it, their supposed premium tier home theater division, was a nightmare."}, {"d20c": "Talk about the perfect customer — I walked into the store with card in hand and knew exactly what I wanted and had no desire to bargain or shop around. Yet after sitting around in Magnolia for over 20 minutes with my wife, hoping that someone would come to us, I had to eventually wander around the store to find some help. If that’s not absurd, I don’t know what is."}, {"b16e": "Remember that this is all in the context of a knowledgable consumer who is ready to part with their money. Now imagine what the poor sap who may have heard of the new TVs from Sony must experience or the average person who walks into any retail store and needs a new TV. Would they last through all that or would they see a Samsung or LG TV that looks bright for $2,500 and buy that?"}, {"8c27": "The moral of the story is this: when you end your sales channels to consumers and don’t have a clear go-to-market strategy, outside of the old business model, you also forfeit your relationship with consumers and in turn, they experience the less-than-spectacular time that I went through. Can operating an online store really be that challenging for a multi-billion dollar company?"}, {"7599": "Thanks for reading! Did you like this post? Let us know!"}], "child": "1656_1\t1656_2\t1656_3\t1656_41656_1\t1656_2\t1656_3\t1656_4"}