{"name": "167", "parent": "", "content": "An Ivy League of Their Own Only Cubs fans know the antidote to a century’s worth of despair: 108 years worth of hope. My story is not unique. It’s not special or one-off. It’s one of a million — but it’s one you can only begin to understand if you’re a member of the most agonizing fraternity in sports. I was born on October 5, 1992, in Wheaton, Illinois, a suburb 30 miles west of Chicago. When the doctors finally got me out, I was crying. Not because I was a newborn baby and that’s what newborn babies do, but because the Cubs finished 78–84 and missed the playoffs that started the next day. Like every true Cubs fan, I didn’t choose to bleed Cubbies blue: I was born into it. After getting married, my parents’ first place was an apartment on legendary Waveland Avenue. They and their friends spent countless summer days on their apartment’s roof, lounging in lawn chairs, drinking cold beers and watching their beloved Cubs. My mom’s cousin, Scot Thompson, was drafted by the Cubs with the seventh overall pick in the 1974 MLB Draft. He eventually made it to The Show, where he played six years for the Cubs, batted .255 as a first baseman and outfielder and finished third in the 1979 NL Rookie of the Year voting. So when I was born, the love and passion for the Cubs was passed down to me like a hereditary disease — a disease that hasn’t been cured in 108 years. Since the Cubs dominated the Tigers four games to one in the 1908 World Series, we’ve made it back just once and have single-handedly debunked the “blind squirrel theory.” We’ve seen billy goats, black cats and Bartman, but have been deprived the tears-inducing image that would be the Cubs hoisting the World Series trophy. We dream, yes, but we dwell even more. That’s one of the roughest side effects of being a Cubs fan: We forget nothing. People often ask me how I can be such a diehard Cub fan after so many years of losing. How can we continue to uphold such unmatched affection for a team that has caused us so much pain? Because it’s not just our pain: It’s generations of pain. The losses, the heartbreak, the turmoil and meltdowns — they’re not just a part of us. They’ve been handed down for generations like a contaminated family heirloom. Posing on my parents’ old rooftop, with the view now obscured, slightly, by 21st-century corporate signage. The landlord is the same woman from whom my parents rented the place, and she still lets us up onto the roof whenever we visit. This year… this year, we’ve got all the tools to find that cure that’s been missing for over a century. A fearsome lineup led by two MVP candidates. A pitching staff with two aces and the lowest collective ERA in the MLB. The league’s best defense and the game’s best manager. So with such a loaded team, why the continued, deep, and even amplified worry? Because of the decades of memories that resurface every October like a monster in a bad horror movie. No matter how hard we try, we can’t shake the nerves and anxiety. Sure, we were up 2–0 going into Game 3 of the NLDS — a lead that would have most fans feeling secure. But then the Giants shell Aroldis Chapman, we lose Game 3, and immediately the series seems to be over. Go down 2–1 to the Dodgers in the NLCS and we’re convinced we’ll never get another hit and lose the series in five. Two days and two wins later, we’re back to the best team in baseball and certain we’ll win it all. The next morning, I’m already thinking about the last time we went back to Chicago up 3–2 with two chances to finally get back to the Fall Classic … and the fear comes flooding back. But this isn’t 2003. We jump all over Kershaw from the hop, Lester throws another gem, and we party like it’s 1945. I wake up the next morning and instantly remind myself of two things. One: THE CHICAGO CUBS ARE IN THE F — ING WORLD SERIES! Two: We still have four games to win against a team that’s lost once this postseason and is led by a manager who is 8–0 in the World Series. Am I certain that this our year? You better damn believe it. Am I horrified that we’ll fall short yet again, even with every single piece to get it done? Absolutely. But that’s what being a devout Cubbie is all about — soaking up a beautiful Chicago summer’s day with an ice cold Old Style in Wrigley’s sun-drenched bleachers. Passing a fellow Cubs fan on the street and becoming immediate friends through a simple “Go Cubbies” exchange. Believing with every fiber of our being that this actually IS the year. No matter how many times they break our hearts, make us cry or shatter our dreams, our love and support never waver. Instead, it grows as each year passes. Because it’s not just about baseball, or sports fandom. It’s about sharing some of our most cherished experiences with family, friends, fellow fans, and people we love the most. Next year is here. Fly The W. The Ronans: Cubbies fans ’til the day we die. ", "title": "An Ivy League of Their Own", "sentences": [{"7c36": "An Ivy League of Their Own"}, {"9ad7": "Only Cubs fans know the antidote to a century’s worth of despair: 108 years worth of hope."}, {"a5e6": "My story is not unique. It’s not special or one-off. It’s one of a million — but it’s one you can only begin to understand if you’re a member of the most agonizing fraternity in sports."}, {"c720": "I was born on October 5, 1992, in Wheaton, Illinois, a suburb 30 miles west of Chicago. When the doctors finally got me out, I was crying. Not because I was a newborn baby and that’s what newborn babies do, but because the Cubs finished 78–84 and missed the playoffs that started the next day."}, {"db13": "Like every true Cubs fan, I didn’t choose to bleed Cubbies blue: I was born into it. After getting married, my parents’ first place was an apartment on legendary Waveland Avenue. They and their friends spent countless summer days on their apartment’s roof, lounging in lawn chairs, drinking cold beers and watching their beloved Cubs."}, {"b8b1": "My mom’s cousin, Scot Thompson, was drafted by the Cubs with the seventh overall pick in the 1974 MLB Draft. He eventually made it to The Show, where he played six years for the Cubs, batted .255 as a first baseman and outfielder and finished third in the 1979 NL Rookie of the Year voting."}, {"8a17": "So when I was born, the love and passion for the Cubs was passed down to me like a hereditary disease — a disease that hasn’t been cured in 108 years."}, {"fb0b": "Since the Cubs dominated the Tigers four games to one in the 1908 World Series, we’ve made it back just once and have single-handedly debunked the “blind squirrel theory.”"}, {"f277": "We’ve seen billy goats, black cats and Bartman, but have been deprived the tears-inducing image that would be the Cubs hoisting the World Series trophy. We dream, yes, but we dwell even more. That’s one of the roughest side effects of being a Cubs fan: We forget nothing."}, {"5666": "People often ask me how I can be such a diehard Cub fan after so many years of losing. How can we continue to uphold such unmatched affection for a team that has caused us so much pain? Because it’s not just our pain: It’s generations of pain. The losses, the heartbreak, the turmoil and meltdowns — they’re not just a part of us. They’ve been handed down for generations like a contaminated family heirloom."}, {"4677": "Posing on my parents’ old rooftop, with the view now obscured, slightly, by 21st-century corporate signage. The landlord is the same woman from whom my parents rented the place, and she still lets us up onto the roof whenever we visit."}, {"aeec": "This year… this year, we’ve got all the tools to find that cure that’s been missing for over a century. A fearsome lineup led by two MVP candidates. A pitching staff with two aces and the lowest collective ERA in the MLB. The league’s best defense and the game’s best manager."}, {"ae20": "So with such a loaded team, why the continued, deep, and even amplified worry?"}, {"070c": "Because of the decades of memories that resurface every October like a monster in a bad horror movie."}, {"6a16": "No matter how hard we try, we can’t shake the nerves and anxiety. Sure, we were up 2–0 going into Game 3 of the NLDS — a lead that would have most fans feeling secure. But then the Giants shell Aroldis Chapman, we lose Game 3, and immediately the series seems to be over."}, {"cac2": "Go down 2–1 to the Dodgers in the NLCS and we’re convinced we’ll never get another hit and lose the series in five. Two days and two wins later, we’re back to the best team in baseball and certain we’ll win it all. The next morning, I’m already thinking about the last time we went back to Chicago up 3–2 with two chances to finally get back to the Fall Classic … and the fear comes flooding back."}, {"aa2d": "But this isn’t 2003. We jump all over Kershaw from the hop, Lester throws another gem, and we party like it’s 1945. I wake up the next morning and instantly remind myself of two things."}, {"5d24": "One:"}, {"bc6e": "THE CHICAGO CUBS ARE IN THE F — ING WORLD SERIES!"}, {"eeee": "Two:"}, {"bd47": "We still have four games to win against a team that’s lost once this postseason and is led by a manager who is 8–0 in the World Series."}, {"f424": "Am I certain that this our year? You better damn believe it. Am I horrified that we’ll fall short yet again, even with every single piece to get it done? Absolutely."}, {"03ae": "But that’s what being a devout Cubbie is all about — soaking up a beautiful Chicago summer’s day with an ice cold Old Style in Wrigley’s sun-drenched bleachers. Passing a fellow Cubs fan on the street and becoming immediate friends through a simple “Go Cubbies” exchange. Believing with every fiber of our being that this actually IS the year."}, {"3244": "No matter how many times they break our hearts, make us cry or shatter our dreams, our love and support never waver. Instead, it grows as each year passes. Because it’s not just about baseball, or sports fandom. It’s about sharing some of our most cherished experiences with family, friends, fellow fans, and people we love the most."}, {"148d": "Next year is here."}, {"a3d6": "Fly The W."}, {"784c": "The Ronans: Cubbies fans ’til the day we die."}], "child": "167_1"}