{"name": "1671", "parent": "", "content": "These are the best free Artificial Intelligence educational resources online Deep learning is not a beginner-friendly subject — even for experienced software engineers and data scientists. If you’ve been Googling this subject, you may have been confused by the resources you’ve come across. To find the best resources, we surveyed engineers on their favorite sources for deep learning, and these are what they recommended. These educational resources include online courses, in-person courses, books, and videos. All are completely free and designed by leading professors, researchers, and industry professionals like Geoffrey Hinton, Yoshua Bengio, and Sebastian Thrun. Machine Learning Deep learning techniques build off of and often combine with classic machine learning methodologies. If you don’t know the difference between supervised and unsupervised learning, or think “gradient descent” is some kind of Photoshop tool, you should definitely take one of the courses below first to get caught up. 1) Andrew Ng’s Machine Learning at Stanford University (online course) Before Andrew Ng became Chief Scientist at Baidu, he taught machine learning at Stanford and co-founded Coursera, the world’s first MOOC (massively open online course) platform. Ng’s gentle introduction to machine learning course is perfect for engineers who want a foundational overview of key concepts in the field. To supplement the online course, you’ll want to check out the lecture notes, problem sets, and Matlab code samples under Ng’s formal Stanford’s CS 229 — Machine Learning course offered at the university. 2) Sebastian Thrun’s Introduction To Machine Learning (online course) Sebastian Thrun has a long history of innovating in A.I. and autonomous vehicle technology, first winning the DARPA Grand Challenge with Stanford’s Stanley team in 2005. He also directed Stanford’s artificial intelligence laboratory, started Google’s self-driving car division, and founded Udacity, another MOOC platform with excellent offerings in machine learning and artificial intelligence. Thrun’s “Introduction To Machine Learning” course is a robust introduction to the subject and also the foundation for a Data Analyst “nanodegree” certification sponsored by Facebook and MongoDB. Also offered on Udacity is Thrun’s “Introduction to Artificial Intelligence” which teaches the fundamentals of A.I. as well as applications such as robotics, computer vision, and natural language processing. This course leads into the Machine Learning Engineer nanodegree sponsored by Kaggle. Deep Learning Even though neural networks were invented in the 1960’s, deep learning only became viable and popular in recent years due to the explosion of big data and computational power. Once you’ve covered the basics of machine learning, you can start learning about this exciting new field in artificial intelligence. 1) Geoffrey Hinton’s Neural Networks For Machine Learning (online course) Widely credited as the “father of deep learning,” Geoffrey Hinton is a University of Toronto professor and Google Researcher. Hinton’s UT lab put “deep learning” into mainstream media in 2012 with their surprising win of a Merck drug discovery challenge despite no one on the team having any molecular biology expertise. Suddenly, the New York Times started featuring headlines like “Scientists See Promise In Deep Learning Programs.” Alums of Hinton’s lab have continued his legacy. Yann LeCun, formerly a postdoctorate research associate in Hinton’s lab, is a leading innovator in convolutional neural nets and now directs Facebook’s AI Research. Ilya Sutskever went on to co-found and act as Research Director of OpenAI (backed by Elon Musk). Brendan Frey, inspired by a personal tragedy, went on to found Deep Genomics, a startup that applies deep learning to genomic medicine and therapy. Taking Hinton’s “Neural Networks For Machine Learning” course on Coursera won’t automatically turn you into a brilliant artificial intelligence pioneer, but the class is certainly a helpful start. 2) Jeremy Howard’s Fast.ai & Data Institute Certificates (online and in-person courses) Jeremy Howard was President & Chief Scientist of Kaggle before founding Enlitic, a company that applies deep learning to medical diagnoses and clinical decisions, and Fast.ai, an educational resource for deep learning engineers. He also teaches in-person deep learning courses along with researcher Rachel Thomas at the University of San Francisco’s Data Institute. Deep Learning Part One covers the basics of Deep Learning, while Part Two covers advanced applications. The in-person certificate courses are not free, but all of the content is available on Fast.ai as MOOCs. Howard and his teaching team work hard to curate diverse students because they’ve observed that the A.I. industry is severely lacking in women, people of color, LGBTQ, and other minority representation. Potential students who fall within these underrepresented groups are encouraged to apply for diversity fellowships in order to attend. 3) Deep Learning by Yoshua Bengio & Ian Goodfellow (book) Yoshua Bengio, professor at University of Montreal, is another leading figure driving forward the deep learning industry. His papers have been cited over 40,000 times on Google Scholar. His former student, Ian Goodfellow, is now a researcher at OpenAI and best known for inventing Generative Adversarial Networks. Their book, Deep Learning, published by MIT Press, is freely available online and conveniently includes applied math refreshers on Linear Algebra, Probability Theory, and Numeric Computation prior to diving into core deep learning concepts. 4) Neural Networks & Deep Learning by Michael Nielsen (book) Michael Nielsen’s ever evolving book on “Neural Networks & Deep Learning” was recommended over and over again. Nielsen, a Research Fellow at YCombinator Research, prefers to explain core principles in intuitive and memorable ways rather than drown you in “a hazy understanding of a long laundry list of ideas.” Nielsen’s book focuses on teaching you how to solve a concrete problem — teaching a computer to recognize handwritten digits — with neural networks. You start with a simple neural network and gradually improve upon your code as new concepts are introduced. If you don’t have the strongest grasp of the prerequisite mathematics for deep learning or are not an experienced programmer, Nielsen’s book is especially beginner-friendly. The code for the course exercises are written in Python 2.7 and relatively easy to understand even if you don’t normally use the language. 5) Deep Learning With TensorFlow (online course) Once you’ve mastered the conceptual groundwork of deep learning and neural networks using any of the previous resources, you’ll want to master the tools to turn theory into practice. While numerous deep learning frameworks and libraries exist, TensorFlow by Google has quickly become one of the most popular and best supported. Udacity’s Deep Learning by Google online course is taught by Vincent Vanhoucke, a Principal Scientist at Google, and technical lead in the Google Brain team. The course assumes intermediate to advanced grasp of machine and deep learning concepts and extends your knowledge to training logistical classifiers, simple deep networks, and convolutional and recurrent neural networks with TensorFlow. TensorFlow’s website also offers beginner and advanced tutorials and strong community support. Videos from their most recent developer summit are available here and describe a slew of new features. 6) Oxford Deep NLP Course (VIDEOS & LECTURES) For those of you with an interest in natural language processing and understanding, Oxford recently published course videos and lectures from their “Deep Natural Language Processing” course taught by DeepMind experts like Phil Blunsom and Chris Dyer. This advanced and applied course covers NLP topics like analysing latent dimensions in text, speech-to-text transcription, machine translation, and Q&A systems. 7) NIPS Conference Video Archive (video) Advanced practitioners of deep learning flock to the increasingly more popular NIPS (Neural Information Processing Systems) conference every year to hear the top researchers present their breakthrough papers and discoveries. If you’ve missed the conference in the past or simply can’t make the event in person, check out the NIPS video archives from 2015 and 2016. 8) Scientific Papers New papers are published every day in the artificial intelligence and deep learning space. Google Scholar, ArXiv, and Research Gate are great repositories to start with, but many more collections exist. If you’re wondering which papers to start with, here is a starting list of foundational research papers to read. Once you start reading papers, Andrej Karpathy created a useful tool aptly named ArXiv Sanity which will recommend related work. To be alerted to new papers, you can subscribe to the RSS feeds of these two ArVix sections: computer learning and machine learning. The most popular articles also tend to bubble up on Reddit Machine Learning or Hacker News. If you own an Amazon Echo and want to geek out hands-free, you can use ArXivML, an Alexa Skill that will read recent abstracts for you. Conclusion With the best minds in artificial intelligence freely offering a wide range of educational resources, everyone interested in deep learning should be able to find content that suits their learning style and level. Beginners can start with Andrew Ng’s online course and Michael Nielsen’s accessible book, while advanced engineers can dive right into Geoffrey Hinton’s classic Neural Networks course, start learning Tensorflow, and stay updated with the latest scientific research. Did we miss any deep learning education resources from industry leaders? Please let us know in the comments below. And check out our blog for more articles like this. ", "title": "These are the best free Artificial Intelligence educational resources online", "sentences": [{"5b00": "These are the best free Artificial Intelligence educational resources online"}, {"a244": "Deep learning is not a beginner-friendly subject — even for experienced software engineers and data scientists. If you’ve been Googling this subject, you may have been confused by the resources you’ve come across."}, {"72f0": "To find the best resources, we surveyed engineers on their favorite sources for deep learning, and these are what they recommended."}, {"fc5f": "These educational resources include online courses, in-person courses, books, and videos. All are completely free and designed by leading professors, researchers, and industry professionals like Geoffrey Hinton, Yoshua Bengio, and Sebastian Thrun."}, {"5250": "Machine Learning"}, {"3bb3": "Deep learning techniques build off of and often combine with classic machine learning methodologies. If you don’t know the difference between supervised and unsupervised learning, or think “gradient descent” is some kind of Photoshop tool, you should definitely take one of the courses below first to get caught up."}, {"8826": "1) Andrew Ng’s Machine Learning at Stanford University (online course)"}, {"887f": "Before Andrew Ng became Chief Scientist at Baidu, he taught machine learning at Stanford and co-founded Coursera, the world’s first MOOC (massively open online course) platform. Ng’s gentle introduction to machine learning course is perfect for engineers who want a foundational overview of key concepts in the field."}, {"8ab9": "To supplement the online course, you’ll want to check out the lecture notes, problem sets, and Matlab code samples under Ng’s formal Stanford’s CS 229 — Machine Learning course offered at the university."}, {"4272": "2) Sebastian Thrun’s Introduction To Machine Learning (online course)"}, {"bc64": "Sebastian Thrun has a long history of innovating in A.I. and autonomous vehicle technology, first winning the DARPA Grand Challenge with Stanford’s Stanley team in 2005. He also directed Stanford’s artificial intelligence laboratory, started Google’s self-driving car division, and founded Udacity, another MOOC platform with excellent offerings in machine learning and artificial intelligence."}, {"2ae3": "Thrun’s “Introduction To Machine Learning” course is a robust introduction to the subject and also the foundation for a Data Analyst “nanodegree” certification sponsored by Facebook and MongoDB."}, {"307a": "Also offered on Udacity is Thrun’s “Introduction to Artificial Intelligence” which teaches the fundamentals of A.I. as well as applications such as robotics, computer vision, and natural language processing. This course leads into the Machine Learning Engineer nanodegree sponsored by Kaggle."}, {"0ca2": "Deep Learning"}, {"c2e4": "Even though neural networks were invented in the 1960’s, deep learning only became viable and popular in recent years due to the explosion of big data and computational power. Once you’ve covered the basics of machine learning, you can start learning about this exciting new field in artificial intelligence."}, {"0ba8": "1) Geoffrey Hinton’s Neural Networks For Machine Learning (online course)"}, {"eb81": "Widely credited as the “father of deep learning,” Geoffrey Hinton is a University of Toronto professor and Google Researcher. Hinton’s UT lab put “deep learning” into mainstream media in 2012 with their surprising win of a Merck drug discovery challenge despite no one on the team having any molecular biology expertise. Suddenly, the New York Times started featuring headlines like “Scientists See Promise In Deep Learning Programs.”"}, {"b033": "Alums of Hinton’s lab have continued his legacy. Yann LeCun, formerly a postdoctorate research associate in Hinton’s lab, is a leading innovator in convolutional neural nets and now directs Facebook’s AI Research. Ilya Sutskever went on to co-found and act as Research Director of OpenAI (backed by Elon Musk). Brendan Frey, inspired by a personal tragedy, went on to found Deep Genomics, a startup that applies deep learning to genomic medicine and therapy."}, {"43a9": "Taking Hinton’s “Neural Networks For Machine Learning” course on Coursera won’t automatically turn you into a brilliant artificial intelligence pioneer, but the class is certainly a helpful start."}, {"0a2a": "2) Jeremy Howard’s Fast.ai & Data Institute Certificates (online and in-person courses)"}, {"ad83": "Jeremy Howard was President & Chief Scientist of Kaggle before founding Enlitic, a company that applies deep learning to medical diagnoses and clinical decisions, and Fast.ai, an educational resource for deep learning engineers."}, {"2b09": "He also teaches in-person deep learning courses along with researcher Rachel Thomas at the University of San Francisco’s Data Institute. Deep Learning Part One covers the basics of Deep Learning, while Part Two covers advanced applications. The in-person certificate courses are not free, but all of the content is available on Fast.ai as MOOCs."}, {"dc34": "Howard and his teaching team work hard to curate diverse students because they’ve observed that the A.I. industry is severely lacking in women, people of color, LGBTQ, and other minority representation. Potential students who fall within these underrepresented groups are encouraged to apply for diversity fellowships in order to attend."}, {"7d7a": "3) Deep Learning by Yoshua Bengio & Ian Goodfellow (book)"}, {"dd1b": "Yoshua Bengio, professor at University of Montreal, is another leading figure driving forward the deep learning industry. His papers have been cited over 40,000 times on Google Scholar. His former student, Ian Goodfellow, is now a researcher at OpenAI and best known for inventing Generative Adversarial Networks."}, {"2b7d": "Their book, Deep Learning, published by MIT Press, is freely available online and conveniently includes applied math refreshers on Linear Algebra, Probability Theory, and Numeric Computation prior to diving into core deep learning concepts."}, {"22a5": "4) Neural Networks & Deep Learning by Michael Nielsen (book)"}, {"38ba": "Michael Nielsen’s ever evolving book on “Neural Networks & Deep Learning” was recommended over and over again. Nielsen, a Research Fellow at YCombinator Research, prefers to explain core principles in intuitive and memorable ways rather than drown you in “a hazy understanding of a long laundry list of ideas.”"}, {"b536": "Nielsen’s book focuses on teaching you how to solve a concrete problem — teaching a computer to recognize handwritten digits — with neural networks. You start with a simple neural network and gradually improve upon your code as new concepts are introduced."}, {"400a": "If you don’t have the strongest grasp of the prerequisite mathematics for deep learning or are not an experienced programmer, Nielsen’s book is especially beginner-friendly. The code for the course exercises are written in Python 2.7 and relatively easy to understand even if you don’t normally use the language."}, {"75b2": "5) Deep Learning With TensorFlow (online course)"}, {"67ee": "Once you’ve mastered the conceptual groundwork of deep learning and neural networks using any of the previous resources, you’ll want to master the tools to turn theory into practice. While numerous deep learning frameworks and libraries exist, TensorFlow by Google has quickly become one of the most popular and best supported."}, {"4573": "Udacity’s Deep Learning by Google online course is taught by Vincent Vanhoucke, a Principal Scientist at Google, and technical lead in the Google Brain team. The course assumes intermediate to advanced grasp of machine and deep learning concepts and extends your knowledge to training logistical classifiers, simple deep networks, and convolutional and recurrent neural networks with TensorFlow."}, {"89c2": "TensorFlow’s website also offers beginner and advanced tutorials and strong community support. Videos from their most recent developer summit are available here and describe a slew of new features."}, {"63d0": "6) Oxford Deep NLP Course (VIDEOS & LECTURES)"}, {"a8b7": "For those of you with an interest in natural language processing and understanding, Oxford recently published course videos and lectures from their “Deep Natural Language Processing” course taught by DeepMind experts like Phil Blunsom and Chris Dyer. This advanced and applied course covers NLP topics like analysing latent dimensions in text, speech-to-text transcription, machine translation, and Q&A systems."}, {"6bcd": "7) NIPS Conference Video Archive (video)"}, {"aa5b": "Advanced practitioners of deep learning flock to the increasingly more popular NIPS (Neural Information Processing Systems) conference every year to hear the top researchers present their breakthrough papers and discoveries."}, {"8eb4": "If you’ve missed the conference in the past or simply can’t make the event in person, check out the NIPS video archives from 2015 and 2016."}, {"c9a0": "8) Scientific Papers"}, {"82a4": "New papers are published every day in the artificial intelligence and deep learning space. Google Scholar, ArXiv, and Research Gate are great repositories to start with, but many more collections exist."}, {"c813": "If you’re wondering which papers to start with, here is a starting list of foundational research papers to read. Once you start reading papers, Andrej Karpathy created a useful tool aptly named ArXiv Sanity which will recommend related work."}, {"6424": "To be alerted to new papers, you can subscribe to the RSS feeds of these two ArVix sections: computer learning and machine learning. The most popular articles also tend to bubble up on Reddit Machine Learning or Hacker News."}, {"58d6": "If you own an Amazon Echo and want to geek out hands-free, you can use ArXivML, an Alexa Skill that will read recent abstracts for you."}, {"38b9": "Conclusion"}, {"b062": "With the best minds in artificial intelligence freely offering a wide range of educational resources, everyone interested in deep learning should be able to find content that suits their learning style and level."}, {"4a1f": "Beginners can start with Andrew Ng’s online course and Michael Nielsen’s accessible book, while advanced engineers can dive right into Geoffrey Hinton’s classic Neural Networks course, start learning Tensorflow, and stay updated with the latest scientific research."}, {"1c06": "Did we miss any deep learning education resources from industry leaders? Please let us know in the comments below. And check out our blog for more articles like this."}], "child": "1671_1\t1671_2\t1671_3\t1671_4"}