{"name": "1680", "parent": "", "content": "JavaScript Top 10 Articles in March 2017 For the past month, we’ve ranked nearly 1,400 JavaScript articles to pick the Top 10 stories (0.7% chance to be included) that can help advance your career. Topics included in this JavaScript list are: Async/Await, Amazon Alexa, Modularity, Hacks, Webpack, Destructuring, Vue, Machine Learning. The lists for React, Node, Angular are published separately in the publication. Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by the experienced JS developers particularly useful. Rank 1 Modern JavaScript for Ancient Web Developers. Courtesy of Gina Trapani, Director of Engineering at Postlight. Rank 2 6 Reasons Why JavaScript’s Async/Await Blows Promises Away. Courtesy of Mostafa Gaafar Rank 3 How We Hacked Our Coffee Machine with JavaScript and Amazon Alexa. Courtesy of Dominik Kundel, Developer Evangelist at Twilio Rank 4 Extremely Useful Hacks for JavaScript. Courtesy of John Howard Rank 5 History of Javascript: Evolution of Modularity [572 stars on Github]. Rank 6 Webpack Bits: Getting the most out of the CommonsChunkPlugin(). Courtesy of Sean T. Larkin, Core Team at Webpack Rank 7 Everything I learned from #Javascript30. Courtesy of Amber Wilkie Rank 8 5 Features You Can Use in ES6 Today. Courtesy of Josh Marinacci and Scotch Development Rank 9 JavaScript in parallel: 50 lines of code. Courtesy of Martin Splitt Rank 10 ES6: Destructuring: An elegant way of extracting data from arrays and objects in JavaScript. <Open source of the Month> No 1) Quokk.JS The Live Scratchpad for JavaScript . . No 2) Franc Franc: Natural language detection [2,183 stars on Github] . No 3) JSinspect Jsinspect: Detect copy-pasted and structurally similar code [1,371 stars on Github] . <Course of the Month> No 1) ES6 Accelerated ES6 JavaScript Training By Maximilian Schwarzmüller [4,212 recommends, 4.7/5 stars] No 2) Vue The Complete Guide to web development with Vue JS 2 (incl. Vuex) [11,261 recommends, 4.8/5 stars] That’s it for JavaScript Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App. Recommend & share.. ", "title": "JavaScript Top 10 Articles in March 2017", "sentences": [{"5b52": "JavaScript Top 10 Articles in March 2017"}, {"c7b4": "For the past month, we’ve ranked nearly 1,400 JavaScript articles to pick the Top 10 stories (0.7% chance to be included) that can help advance your career."}, {"0167": "Topics included in this JavaScript list are: Async/Await, Amazon Alexa, Modularity, Hacks, Webpack, Destructuring, Vue, Machine Learning. The lists for React, Node, Angular are published separately in the publication."}, {"6450": "Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by the experienced JS developers particularly useful."}, {"2cf4": "Rank 1"}, {"839e": "Modern JavaScript for Ancient Web Developers. Courtesy of Gina Trapani, Director of Engineering at Postlight."}, {"7b13": "Rank 2"}, {"5a1d": "6 Reasons Why JavaScript’s Async/Await Blows Promises Away. Courtesy of Mostafa Gaafar"}, {"8c63": "Rank 3"}, {"46a2": "How We Hacked Our Coffee Machine with JavaScript and Amazon Alexa. Courtesy of Dominik Kundel, Developer Evangelist at Twilio"}, {"a609": "Rank 4"}, {"359a": "Extremely Useful Hacks for JavaScript. Courtesy of John Howard"}, {"dd55": "Rank 5"}, {"1db4": "History of Javascript: Evolution of Modularity [572 stars on Github]."}, {"c8ff": "Rank 6"}, {"647d": "Webpack Bits: Getting the most out of the CommonsChunkPlugin(). Courtesy of Sean T. Larkin, Core Team at Webpack"}, {"6ccf": "Rank 7"}, {"0598": "Everything I learned from #Javascript30. Courtesy of Amber Wilkie"}, {"3a6f": "Rank 8"}, {"1580": "5 Features You Can Use in ES6 Today. Courtesy of Josh Marinacci and Scotch Development"}, {"841b": "Rank 9"}, {"6d2a": "JavaScript in parallel: 50 lines of code. Courtesy of Martin Splitt"}, {"21a4": "Rank 10"}, {"5b2c": "ES6: Destructuring: An elegant way of extracting data from arrays and objects in JavaScript."}, {"0051": "<Open source of the Month>"}, {"1160": "No 1) Quokk.JS"}, {"3c10": "The Live Scratchpad for JavaScript"}, {"3236": "."}, {"5603": "."}, {"9ab3": "No 2) Franc"}, {"bd51": "Franc: Natural language detection"}, {"a598": "[2,183 stars on Github]"}, {"c227": "."}, {"5048": "No 3) JSinspect"}, {"6e9d": "Jsinspect: Detect copy-pasted and structurally similar code"}, {"b2e8": "[1,371 stars on Github]"}, {"08f7": "."}, {"a961": "<Course of the Month>"}, {"755d": "No 1) ES6"}, {"bb1a": "Accelerated ES6 JavaScript Training By Maximilian Schwarzmüller"}, {"496d": "[4,212 recommends, 4.7/5 stars]"}, {"e30c": "No 2) Vue"}, {"acc6": "The Complete Guide to web development with Vue JS 2 (incl. Vuex)"}, {"bad6": "[11,261 recommends, 4.8/5 stars]"}, {"3e25": "That’s it for JavaScript Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_21680_1\t1680_2"}