{"name": "1681", "parent": "", "content": "Web Development Top 10 Articles in March 2017 For the past month, we’ve ranked nearly 1,000 Web Development articles to pick the Top 10 stories (1% chance to be included) that can help advance your career. Topics included in this Web Development list are: Chrome, Web Cache, Docker, Machine Learning, Password, Inspiration, Lessons. The lists for JavaScript, React, Node, Angular are published separately in the publication. Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by the experienced web developers particularly useful. Rank 1 Roadmap to becoming a web developer in 2017 [14,129 stars on Github]. Rank 2 How I got a second degree and earned 5 developer certifications in just one year, while working and raising two kids. Courtesy of Beau Carnes and Free Code Camp Rank 3 I’ve been a Web Developer for 17 Years, and this is what I learned. Courtesy of Ferenc Hamori and Daniel Khan Rank 4 Writing good code: how to reduce the cognitive load of your code. Courtesy of Christian Maioli Rank 5 Speed up your site with a little machine learning. Courtesy of David Gilbertson and Hackernoon Rank 6 Here’s How You Start Using Docker. Courtesy of Alexander Ryabtsev Rank 7 Preload, Prefetch And Priorities in Chrome. Courtesy of Addy Osmani, Staff Engineer at Google. Rank 8 Password Rules Are Bullshit. Courtesy of Jeff Atwood Rank 9 Web Cache — Everything you need to know. Courtesy of Kamran Ahmed Rank 10 The Developer’s Edge: How To Become A Senior Developer. Courtesy of Andrei Neagoie <Bonus> No 1) Survey Developer Survey Results 2017 Courtesy of Stack Overflow . No 2) Public APIs Public APIs: A collective list of public JSON APIs for use in web development. By Todd Motto [14,850 stars on Github] No 3) Dev Portfolio Devportfolio-template: A customizable single-page personal portfolio template built with JS and Sass. [1,203 stars on Github] <Learn> No 1) Vue The Complete Guide to web development with Vue JS 2 (incl. Vuex). By Maximilian Schwarzmüller [11,261 recommends, 4.8/5 stars] No 2) Go Web Development with Google’s Go (golang) Programming Language [2,620 recommends, 4.8/5 stars] No 3) JavaScript ES6 For Everyone: The Best Way To Learn Modern JavaScript By Wes Bos [8,767 recommends] That’s it for Web Development Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App. Recommend & share.. ", "title": "Web Development Top 10 Articles in March 2017", "sentences": [{"5b52": "Web Development Top 10 Articles in March 2017"}, {"c7b4": "For the past month, we’ve ranked nearly 1,000 Web Development articles to pick the Top 10 stories (1% chance to be included) that can help advance your career."}, {"0167": "Topics included in this Web Development list are: Chrome, Web Cache, Docker, Machine Learning, Password, Inspiration, Lessons. The lists for JavaScript, React, Node, Angular are published separately in the publication."}, {"6450": "Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by the experienced web developers particularly useful."}, {"2cf4": "Rank 1"}, {"839e": "Roadmap to becoming a web developer in 2017 [14,129 stars on Github]."}, {"06e6": "Rank 2"}, {"3574": "How I got a second degree and earned 5 developer certifications in just one year, while working and raising two kids. Courtesy of Beau Carnes and Free Code Camp"}, {"0572": "Rank 3"}, {"356f": "I’ve been a Web Developer for 17 Years, and this is what I learned. Courtesy of Ferenc Hamori and Daniel Khan"}, {"5aa1": "Rank 4"}, {"4b11": "Writing good code: how to reduce the cognitive load of your code. Courtesy of Christian Maioli"}, {"4616": "Rank 5"}, {"9c62": "Speed up your site with a little machine learning. Courtesy of David Gilbertson and Hackernoon"}, {"4463": "Rank 6"}, {"5756": "Here’s How You Start Using Docker. Courtesy of Alexander Ryabtsev"}, {"6736": "Rank 7"}, {"4a67": "Preload, Prefetch And Priorities in Chrome. Courtesy of Addy Osmani, Staff Engineer at Google."}, {"68d8": "Rank 8"}, {"6f91": "Password Rules Are Bullshit. Courtesy of Jeff Atwood"}, {"2f6b": "Rank 9"}, {"3f51": "Web Cache — Everything you need to know. Courtesy of Kamran Ahmed"}, {"0f1f": "Rank 10"}, {"98ea": "The Developer’s Edge: How To Become A Senior Developer. Courtesy of Andrei Neagoie"}, {"0051": "<Bonus>"}, {"1160": "No 1) Survey"}, {"3c10": "Developer Survey Results 2017"}, {"15aa": "Courtesy of Stack Overflow"}, {"bdc4": "."}, {"afd8": "No 2) Public APIs"}, {"b0bc": "Public APIs: A collective list of public JSON APIs for use in web development. By Todd Motto"}, {"ee3f": "[14,850 stars on Github]"}, {"5c8a": "No 3) Dev Portfolio"}, {"efa8": "Devportfolio-template: A customizable single-page personal portfolio template built with JS and Sass."}, {"5d95": "[1,203 stars on Github]"}, {"ae73": "<Learn>"}, {"b53f": "No 1) Vue"}, {"acc6": "The Complete Guide to web development with Vue JS 2 (incl. Vuex). By Maximilian Schwarzmüller"}, {"bad6": "[11,261 recommends, 4.8/5 stars]"}, {"a91b": "No 2) Go"}, {"fb18": "Web Development with Google’s Go (golang) Programming Language"}, {"db22": "[2,620 recommends, 4.8/5 stars]"}, {"9f76": "No 3) JavaScript"}, {"6bd3": "ES6 For Everyone: The Best Way To Learn Modern JavaScript By Wes Bos"}, {"e9e5": "[8,767 recommends]"}, {"3e25": "That’s it for Web Development Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1681_11681_11681_11681_11681_11681_11681_11681_11681_11681_1"}