{"name": "1682", "parent": "", "content": "Swift Top 10 Articles for the Past Month Between January and February 2017, we’ve ranked nearly 1,300 Swift articles to pick the Top 10 stories (0.8% chance) that can help advance your iOS development career. Topics included in this Swift list are: Testing, Toolset, Compiler, Algorithms, Performance, Memory Management, React Native, UI Framework, Job. Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by iOS leaders particularly useful. Rank 1 14 must knows for an iOS developer. Courtesy of Norberto Gil Vasconcelos Rank 2 Swift + Keywords (V 3.0.1). Courtesy of Jordan Morgan, iOS Engineer at Buffer. Rank 3 Testing an Untested App. Courtesy of Michael May Rank 4 My Development Toolset 2017 for iOS. Courtesy of durul Rank 5 Building a Compiler in Swift with LLVM [Part 1]: Introduction and the Lexer. Courtesy of Harlan Haskins …………. [ Part II: AST and the Parser ] …………. [ Part III: Code Generation to LLVM IR ] Rank 6 Comparing the Performance between Native iOS (Swift) and React-Native. Courtesy of John A. Calderaio Rank 7 Swift Algorithm Club: Graphs with Adjacency List. Courtesy of Vincent Ngo, iOS Engineer at Capital One Rank 8 Replicating Apple Design Awarded Applications in Swift. Courtesy of Igor Zapletnev Rank 9 Make Memory Management Great Again: Swift 3 Automatic Reference Counting explained. Courtesy of Bob Lee Rank 10 5 Core Swift Competencies Before You Get a Job. Courtesy of Andrew Wagner <Open Source of the Month> No 1) Panel PanelKit: A UI framework that enables panels on iOS. [2,387 stars on Github] . No 2) Layout TinyConstraints: Syntactic sugar that makes Auto Layout sweeter for human use. [1,173 stars on Github] No 3) Swipe SwipeCellKit: Swipeable UITableViewCell based on the stock Mail.app, implemented in Swift. [1,682 stars on Github] <Course of the Month> No 1) Beginner Learn to Program Swift 3 with Xcode Playgrounds (including convert from Swift 2 to 3) [2,178 recommends, 4.6/5 rating] No 2) Instagram Creating a Full Instagram Clone with Swift 3 and Xcode. Become an advanced iOS developer. [1,790 recommends, 4.5/5 rating] No 3) Game Learn to build iOS games in Swift3 and Xcode 8. That’s it for Swift Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App. Recommend & share.. ", "title": "Swift Top 10 Articles for the Past Month", "sentences": [{"5b52": "Swift Top 10 Articles for the Past Month"}, {"c7b4": "Between January and February 2017, we’ve ranked nearly 1,300 Swift articles to pick the Top 10 stories (0.8% chance) that can help advance your iOS development career."}, {"6450": "Topics included in this Swift list are: Testing, Toolset, Compiler, Algorithms, Performance, Memory Management, React Native, UI Framework, Job."}, {"9fa0": "Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by iOS leaders particularly useful."}, {"2cf4": "Rank 1"}, {"839e": "14 must knows for an iOS developer. Courtesy of Norberto Gil Vasconcelos"}, {"6a8d": "Rank 2"}, {"7c38": "Swift + Keywords (V 3.0.1). Courtesy of Jordan Morgan, iOS Engineer at Buffer."}, {"9dcd": "Rank 3"}, {"8385": "Testing an Untested App. Courtesy of Michael May"}, {"f26f": "Rank 4"}, {"380e": "My Development Toolset 2017 for iOS. Courtesy of durul"}, {"f86e": "Rank 5"}, {"ca6e": "Building a Compiler in Swift with LLVM [Part 1]: Introduction and the Lexer. Courtesy of Harlan Haskins"}, {"9e73": "…………. [ Part II: AST and the Parser ]"}, {"b63e": "…………. [ Part III: Code Generation to LLVM IR ]"}, {"7239": "Rank 6"}, {"6f72": "Comparing the Performance between Native iOS (Swift) and React-Native. Courtesy of John A. Calderaio"}, {"b256": "Rank 7"}, {"3512": "Swift Algorithm Club: Graphs with Adjacency List. Courtesy of Vincent Ngo, iOS Engineer at Capital One"}, {"a8c2": "Rank 8"}, {"c5a5": "Replicating Apple Design Awarded Applications in Swift. Courtesy of Igor Zapletnev"}, {"3e75": "Rank 9"}, {"0ed2": "Make Memory Management Great Again: Swift 3 Automatic Reference Counting explained. Courtesy of Bob Lee"}, {"9a59": "Rank 10"}, {"9093": "5 Core Swift Competencies Before You Get a Job. Courtesy of Andrew Wagner"}, {"0051": "<Open Source of the Month>"}, {"1160": "No 1) Panel"}, {"3c10": "PanelKit: A UI framework that enables panels on iOS."}, {"a454": "[2,387 stars on Github]"}, {"3236": "."}, {"8db0": "No 2) Layout"}, {"887f": "TinyConstraints: Syntactic sugar that makes Auto Layout sweeter for human use."}, {"88dc": "[1,173 stars on Github]"}, {"1f49": "No 3) Swipe"}, {"f715": "SwipeCellKit: Swipeable UITableViewCell based on the stock Mail.app, implemented in Swift."}, {"5816": "[1,682 stars on Github]"}, {"ff41": "<Course of the Month>"}, {"bba7": "No 1) Beginner"}, {"cba2": "Learn to Program Swift 3 with Xcode Playgrounds (including convert from Swift 2 to 3)"}, {"37b2": "[2,178 recommends, 4.6/5 rating]"}, {"9937": "No 2) Instagram"}, {"e39d": "Creating a Full Instagram Clone with Swift 3 and Xcode. Become an advanced iOS developer."}, {"8227": "[1,790 recommends, 4.5/5 rating]"}, {"082c": "No 3) Game"}, {"92a0": "Learn to build iOS games in Swift3 and Xcode 8."}, {"3e25": "That’s it for Swift Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1682_11682_11682_11682_11682_11682_11682_11682_11682_11682_1"}