{"name": "1685", "parent": "", "content": "Angular 2 Top 10 Articles for the Past Month For Jan-Feb 2017, we’ve ranked nearly 1,000 Angular articles to pick the Top 10 stories (1% chance) that can help advance your career. Topics included in this Angular list are: Progressive Web App, Managing State, Router, Async Data, Redux, TypeScript, Ngrx, Performance, VS Code Extensions. The list for JavaScript, React and Node are posted separately. Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by Angular leaders useful. Rank 1 Progressive Web Apps with Angular 2+. Courtesy of Houssein Djirdeh Rank 2 Angular in Production: A case study of my experience in using Angular (2 and above) in production. Courtesy of Minko Gechev Rank 3 How Google builds web frameworks. Courtesy of Free Code Camp and Filip Hracek, Software Egnineer at Google Rank 4 Managing State in Angular Applications. Courtesy of Victor Savkin Rank 5 Top Angular VS Code Extensions. Rank 6 Making your Angular apps fast. Courtesy of Pascal Precht ʕ•̫͡•ʔ Rank 7 Redux in Angular 2: Learn what Redux is, when to use and why, and how to implement it in an Angular 2 app. Rank 8 Getting started with Angular’s Router. Courtesy of Todd Motto Rank 9 Distributing an Angular Library — The Brief Guide. Rank 10 3 Ways to Pass Async Data to Angular 2+ Child Components. Courtesy of Scotch Development and Jecelyn Yeen <Open Source of the Month> No 1) Notification Angular 2 Notifications: A light and easy to use notifications library for Angular 2 [267 stars on Github] . No 2) Table Angular 2 Smart Table with Sorting, filtering, pagination & add/edit/delete functions. [249 stars on Github] No 3) App Yatrum: Travel Guides App Built with Angular2, ngrx store, observables and reactive forms. [94 stars on Github] <Course of the Month> No 1) Beginner Learn Angular 2 step-by-step to go from a beginner to a paid professional . No 2) Rails Angular 2 + Rails 5: Learn to build a real world Angular 2 app with Ruby on Rails backend. [1,290 recommends, 4.7/5 stars] No 3) Ngrx Angular 2.0 NgRx & Typescript Architecture: Learn to build a Chat App [385 recommends, 4.8/5 stars] That’s it for Angular Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App. Recommend & share.. ", "title": "Angular 2 Top 10 Articles for the Past Month", "sentences": [{"5b52": "Angular 2 Top 10 Articles for the Past Month"}, {"c7b4": "For Jan-Feb 2017, we’ve ranked nearly 1,000 Angular articles to pick the Top 10 stories (1% chance) that can help advance your career."}, {"0167": "Topics included in this Angular list are: Progressive Web App, Managing State, Router, Async Data, Redux, TypeScript, Ngrx, Performance, VS Code Extensions. The list for JavaScript, React and Node are posted separately."}, {"6450": "Mybridge AI ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. This is a competitive list and you’ll find the experience and techniques shared by Angular leaders useful."}, {"2cf4": "Rank 1"}, {"839e": "Progressive Web Apps with Angular 2+. Courtesy of Houssein Djirdeh"}, {"34f2": "Rank 2"}, {"ccdd": "Angular in Production: A case study of my experience in using Angular (2 and above) in production. Courtesy of Minko Gechev"}, {"e8fa": "Rank 3"}, {"ad2e": "How Google builds web frameworks. Courtesy of Free Code Camp and Filip Hracek, Software Egnineer at Google"}, {"5c87": "Rank 4"}, {"bbdd": "Managing State in Angular Applications. Courtesy of Victor Savkin"}, {"a03d": "Rank 5"}, {"419a": "Top Angular VS Code Extensions."}, {"43e7": "Rank 6"}, {"fe2d": "Making your Angular apps fast. Courtesy of Pascal Precht ʕ•̫͡•ʔ"}, {"28e0": "Rank 7"}, {"c7e4": "Redux in Angular 2: Learn what Redux is, when to use and why, and how to implement it in an Angular 2 app."}, {"331a": "Rank 8"}, {"d53a": "Getting started with Angular’s Router. Courtesy of Todd Motto"}, {"1800": "Rank 9"}, {"8c8f": "Distributing an Angular Library — The Brief Guide."}, {"56b6": "Rank 10"}, {"7d0a": "3 Ways to Pass Async Data to Angular 2+ Child Components. Courtesy of Scotch Development and Jecelyn Yeen"}, {"0126": "<Open Source of the Month>"}, {"1160": "No 1) Notification"}, {"3c10": "Angular 2 Notifications: A light and easy to use notifications library for Angular 2"}, {"7dc9": "[267 stars on Github]"}, {"3236": "."}, {"8113": "No 2) Table"}, {"3444": "Angular 2 Smart Table with Sorting, filtering, pagination & add/edit/delete functions."}, {"cf8f": "[249 stars on Github]"}, {"fd74": "No 3) App"}, {"1215": "Yatrum: Travel Guides App Built with Angular2, ngrx store, observables and reactive forms."}, {"b15d": "[94 stars on Github]"}, {"bd74": "<Course of the Month>"}, {"7f56": "No 1) Beginner"}, {"7088": "Learn Angular 2 step-by-step to go from a beginner to a paid professional"}, {"83d0": "."}, {"f8ed": "No 2) Rails"}, {"2ad7": "Angular 2 + Rails 5: Learn to build a real world Angular 2 app with Ruby on Rails backend."}, {"4732": "[1,290 recommends, 4.7/5 stars]"}, {"5099": "No 3) Ngrx"}, {"e30a": "Angular 2.0 NgRx & Typescript Architecture: Learn to build a Chat App"}, {"7500": "[385 recommends, 4.8/5 stars]"}, {"3e25": "That’s it for Angular Monthly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_21685_1\t1685_2"}