{"name": "1689", "parent": "", "content": "Python Top 10 Articles for the Past Year (v.2017) For the past year, we’ve ranked nearly 10,000 Python articles to pick the Top 10 stories (0.1% chance) that can help you advance your career in 2017. This Python list includes topics such as: Django, Data Science, Numpy, Data Mining, Stock Trading, Home Automation, Self Driving Car, Dataset. Machine Learning Top 10 is published separately. This is an extremely competitive list and Mybridge has not been solicited to promote any publishers. Mybridge A.I. ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. Academic papers were not considered in this batch. Give a plenty of time to read all of the articles you’ve missed this year. You’ll find the experience and techniques shared by the Python leaders particularly useful. Rank 1 The Hitchhiker’s Guide to Python: Best practices guidebook written for Humans. Rank 2 Scipy Lecture Notes — Learn numerics, science, and data with Python. Rank 3 30 Essential Python Tips and Tricks for Programmers. Rank 4 Computational and Inferential Thinking for Data Science. Courtesy of UC Berkeley Rank 5 Welcome to Python cheatsheet. Rank 6 Data Mining in Python: A Guide. Courtesy of Michael Rundell Rank 7 Python FAQ: Why should I use Python 3? Courtesy of Eevee Rank 8 An Introduction to Stock Market Data Analysis with Python [Part 1]. Courtesy of Curtis Miller ……………………………….……[Part 2] Rank 9 NumPy Tutorial: Data analysis with Python. Courtesy of Vik Paruchuri Rank 10 Build Your First Python and Django Application. Courtesy of Scotch Development and Amos Omondi <Open Source of the Year> No 1) Home Automation Open-source home automation platform running on Python 3 [5683 stars on Github] . No 2) Self Driving Comma.ai for the people to experiment on self driving [2848 stars on Github] . No 3) Dataset StackOverflow Importer — Import code from Stack Overflow as Python modules [1220 stars on Github] <Course of the Year> No 1) Beginner The Python Bible: Build 11 Projects and Go from Beginner to Pro [10,256 recommends, 4.7/5 stars] No 2) Data Science Data Science for Beginners: Deep Learning in Python with Tensor flow and Neural Networks. [9,426 recommends, 4.6/5 rating] That’s it for Python Yearly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App. Recommend & share.. ", "title": "Python Top 10 Articles for the Past Year (v.2017)", "sentences": [{"5b52": "Python Top 10 Articles for the Past Year (v.2017)"}, {"071d": "For the past year, we’ve ranked nearly 10,000 Python articles to pick the Top 10 stories (0.1% chance) that can help you advance your career in 2017."}, {"28c1": "This Python list includes topics such as: Django, Data Science, Numpy, Data Mining, Stock Trading, Home Automation, Self Driving Car, Dataset. Machine Learning Top 10 is published separately."}, {"1be6": "This is an extremely competitive list and Mybridge has not been solicited to promote any publishers. Mybridge A.I. ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. Academic papers were not considered in this batch."}, {"6450": "Give a plenty of time to read all of the articles you’ve missed this year. You’ll find the experience and techniques shared by the Python leaders particularly useful."}, {"2cf4": "Rank 1"}, {"839e": "The Hitchhiker’s Guide to Python: Best practices guidebook written for Humans."}, {"b60a": "Rank 2"}, {"70bd": "Scipy Lecture Notes — Learn numerics, science, and data with Python."}, {"50c1": "Rank 3"}, {"0526": "30 Essential Python Tips and Tricks for Programmers."}, {"1456": "Rank 4"}, {"c303": "Computational and Inferential Thinking for Data Science. Courtesy of UC Berkeley"}, {"2511": "Rank 5"}, {"7961": "Welcome to Python cheatsheet."}, {"463b": "Rank 6"}, {"29f4": "Data Mining in Python: A Guide. Courtesy of Michael Rundell"}, {"a4a7": "Rank 7"}, {"4379": "Python FAQ: Why should I use Python 3? Courtesy of Eevee"}, {"701b": "Rank 8"}, {"e962": "An Introduction to Stock Market Data Analysis with Python [Part 1]. Courtesy of Curtis Miller"}, {"c441": "……………………………….……[Part 2]"}, {"5949": "Rank 9"}, {"5a0f": "NumPy Tutorial: Data analysis with Python. Courtesy of Vik Paruchuri"}, {"177e": "Rank 10"}, {"8bcc": "Build Your First Python and Django Application. Courtesy of Scotch Development and Amos Omondi"}, {"0051": "<Open Source of the Year>"}, {"1160": "No 1) Home Automation"}, {"3c10": "Open-source home automation platform running on Python 3"}, {"232d": "[5683 stars on Github]"}, {"3236": "."}, {"d8b4": "No 2) Self Driving"}, {"0931": "Comma.ai for the people to experiment on self driving"}, {"f7c2": "[2848 stars on Github]"}, {"8af9": "."}, {"8b27": "No 3) Dataset"}, {"8400": "StackOverflow Importer — Import code from Stack Overflow as Python modules"}, {"b6a8": "[1220 stars on Github]"}, {"0c1c": "<Course of the Year>"}, {"ed0f": "No 1) Beginner"}, {"7edf": "The Python Bible: Build 11 Projects and Go from Beginner to Pro"}, {"9fc1": "[10,256 recommends, 4.7/5 stars]"}, {"1451": "No 2) Data Science"}, {"6559": "Data Science for Beginners: Deep Learning in Python with Tensor flow and Neural Networks."}, {"97a6": "[9,426 recommends, 4.6/5 rating]"}, {"3e25": "That’s it for Python Yearly Top 10. If you like this curation, read best daily articles based on your programming skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1689_11689_11689_11689_11689_11689_11689_11689_11689_11689_1"}