{"name": "1691", "parent": "", "content": "Product Management Top 10 Articles for the Past Year (v.2017) For the past year, we’ve ranked nearly 8,000 Product Management articles to pick the Top 10 stories (0.13% chance) that can help you advance your PM career in 2017. “A PM basically sits at the center of UX, technology and business. You may have heard the quote: ‘The PM is the CEO of their product” — Todd Jackson, VP of Product at Dropbox. This is an extremely competitive list and Mybridge has not been solicited to promote any publishers. Mybridge A.I. ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity. Give a plenty of time to read all of the articles you’ve missed this year. You’ll find the experience and techniques shared by the product leaders particularly useful. Rank 1 The Hierarchy of Engagement: Roadmap to Building a Billion Dollar Startup. Courtesy of Sarah Tavel, Partner GreylockVC, Formerly product at Pinterest Rank 2 Great Products Don’t Happen By Accident: Using playbooks for designing and building products. Courtesy of Jon Lax Rank 3 The Art of Product Management. Wharton School. Courtesy of Sachin Rekhi, Former Director of Product at LinkedIn Rank 4 MVPM: Minimum Viable Product Manager. Courtesy of Brandon Chu, Product at Shoptify Rank 5 The Power of Elastic Product Team. Courtesy of Jonathan Golden, Airbnb’s First PM. Rank 6 Shipping vs. Learning. Courtesy of Mike Davidson, Former VP of design at Twitter Rank 7 How Instagram’s Head Engineer Is Using Quantum Mechanics To Manage His Team. Courtesy of James Everingham, Head of Engineering, Instagram at Facebook Rank 8 Your product is already obsolete. Courtesy of Des Traynor, Co-founder of Intercom Rank 9 Find, Vet and Close the Best Product Managers. Courtesy of First Round and Todd Jackson, VP of Product and Design at Dropbox. Rank 10 On Writing Product Specs — Engineering PM. Courtesy of Gaurav Oberoi <Bonus> No 1) 1% vs 10% What distinguishes the Top 1% of Product Managers from the Top 10%? Courtesy of Ian McAllister, Director at Airbnb [273,782 views on Quora] No 2) PM at Google What makes someone a great product manager at Google Courtesy of Edward Ho, Former PM at Google [386,652 views on Quora] No 3) Learn Become a Product Manager: The complete course for getting a PM job. Learn skills and prepare for interviews [15,797 recommends, 4.5/5 stars] No 4) Hosting Host a website for your product or portfolio under 5 minutes That’s it for Product Management Yearly top 10. If you like this curation, read best daily articles based on your skills on our iOS App. Recommend & share.. ", "title": "Product Management Top 10 Articles for the Past Year (v.2017)", "sentences": [{"5b52": "Product Management Top 10 Articles for the Past Year (v.2017)"}, {"c7b4": "For the past year, we’ve ranked nearly 8,000 Product Management articles to pick the Top 10 stories (0.13% chance) that can help you advance your PM career in 2017."}, {"486f": "“A PM basically sits at the center of UX, technology and business. You may have heard the quote: ‘The PM is the CEO of their product” — Todd Jackson, VP of Product at Dropbox."}, {"1be6": "This is an extremely competitive list and Mybridge has not been solicited to promote any publishers. Mybridge A.I. ranks articles based on the quality of content measured by our machine and a variety of human factors including engagement and popularity."}, {"6450": "Give a plenty of time to read all of the articles you’ve missed this year. You’ll find the experience and techniques shared by the product leaders particularly useful."}, {"2cf4": "Rank 1"}, {"839e": "The Hierarchy of Engagement: Roadmap to Building a Billion Dollar Startup. Courtesy of Sarah Tavel, Partner GreylockVC, Formerly product at Pinterest"}, {"e15a": "Rank 2"}, {"fea4": "Great Products Don’t Happen By Accident: Using playbooks for designing and building products. Courtesy of Jon Lax"}, {"a7ff": "Rank 3"}, {"b69f": "The Art of Product Management. Wharton School. Courtesy of Sachin Rekhi, Former Director of Product at LinkedIn"}, {"4f31": "Rank 4"}, {"3adf": "MVPM: Minimum Viable Product Manager. Courtesy of Brandon Chu, Product at Shoptify"}, {"ca61": "Rank 5"}, {"5ab9": "The Power of Elastic Product Team. Courtesy of Jonathan Golden, Airbnb’s First PM."}, {"b89e": "Rank 6"}, {"eac4": "Shipping vs. Learning. Courtesy of Mike Davidson, Former VP of design at Twitter"}, {"ed5e": "Rank 7"}, {"0864": "How Instagram’s Head Engineer Is Using Quantum Mechanics To Manage His Team. Courtesy of James Everingham, Head of Engineering, Instagram at Facebook"}, {"684e": "Rank 8"}, {"6f6b": "Your product is already obsolete. Courtesy of Des Traynor, Co-founder of Intercom"}, {"50a9": "Rank 9"}, {"2140": "Find, Vet and Close the Best Product Managers. Courtesy of First Round and Todd Jackson, VP of Product and Design at Dropbox."}, {"50f1": "Rank 10"}, {"e2c5": "On Writing Product Specs — Engineering PM. Courtesy of Gaurav Oberoi"}, {"0051": "<Bonus>"}, {"1160": "No 1) 1% vs 10%"}, {"3c10": "What distinguishes the Top 1% of Product Managers from the Top 10%? Courtesy of Ian McAllister, Director at Airbnb"}, {"4121": "[273,782 views on Quora]"}, {"d36b": "No 2) PM at Google"}, {"4ead": "What makes someone a great product manager at Google Courtesy of Edward Ho, Former PM at Google"}, {"4287": "[386,652 views on Quora]"}, {"e5d4": "No 3) Learn"}, {"43a3": "Become a Product Manager: The complete course for getting a PM job. Learn skills and prepare for interviews"}, {"de18": "[15,797 recommends, 4.5/5 stars]"}, {"5b68": "No 4) Hosting"}, {"9b58": "Host a website for your product or portfolio under 5 minutes"}, {"3e25": "That’s it for Product Management Yearly top 10. If you like this curation, read best daily articles based on your skills on our iOS App."}, {"084d": "Recommend & share.."}], "child": "1691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_31691_1\t1691_2\t1691_3"}