{"name": "1692", "parent": "", "content": "All about creating a startup pitch deck to raise funding A good pitch can significantly increase your chance to raise money from investors. Notably, Airbnb was turned down multiple times by investors until they figured out the pitch that worked best for them (see: 7 Rejections by Brian Chesky) There are many reasons why your company is great, but people can only really remember a few of them after a short presentation or pitch. From the visuals to the key numbers you choose, you want to make it as attractive, simple and clear as possible. “One in 15 entrepreneurs that come through our doors can convey clearly about what they do in literally 5 minutes.” — Jim Goetz at Sequoia Capital (known for investing in WhatsApp) Mybridge AI evaluates the quality of content and ranks the best articles for professionals. In this observation, we’ve compared nearly 4,200 articles on creating pitch decks and picked the Top 35 for entrepreneurs. 4,200 -> 35. Only 0.8% chance to be included. This is a competitive list that carefully includes the most useful articles for creating a pitch deck. Keep this as a reference for creating a pitch deck when you’re raising money from VCs. <By Investors> No 1) Sequoia Capital Pitch Deck Template. No 2) How to Design a Better Pitch Deck — Y Combinator. Courtesy of Kevin Hale, Partner at YC No 3) How to Pitch a VC Redesigned — 500 Startups. Courtesy of Dave McClure, Founder of 500 Startups No 4) The Startup Investor Pitch Deck & How to Present to Angels. Courtesy of J Skyler Fernandes at Simon Venture Group …………..[Related] Step by Step Pitching Course by J Skyler Fernandes 4.8/5 stars, 1,384 recommends on Udemy No 5) Pitch Deck Template For Entrepreneurs by Peter Thiel, Facebook’s first investor. No 6) The 10/20/30 Rule of PowerPoint — Garage Technology Ventures. Courtesy of Guy Kawasaki, Partner at GTV <By Entrepreneurs> No 1) How to Design a Pitch Deck from a Seasoned Founder. Courtesy of WebdesignerDepot No 2) How to Create a Pitch Deck from LinkedIn’s Series B Pitch to Greylock. Courtesy of Reid Hoffman, Founder of LinkedIn No 3) Creating Series A Deck for Raising $10M at Front. Courtesy of Mathilde Collin, Founder of Front. No 4) The investor presentation we used to raise $2 million at Crew. Courtesy of Mikael Cho, Founder of Crew No 5) The Pitch Deck Buffer Used to Raise $500,000. Courtesy of Dharmesh Shah, Founder and CTO of Hubspot No 6) How Tim Young raised $10 million in 3 rounds with 5 Magic Pitch Slides. No 7) How We Raised $700,000 without a product but a pitch deck. Courtesy of Andrew Michael, Founder of AdJelly <Research> No 1) A Study of Creating a Perfect Pitch Deck From Observation of 200 Decks: VCs Spend an Average of 3.8 minutes. No 2) The secret formula to startup pitch from analyzing 477,358 pitches. No 3) Airbnb pitch deck: Teardown and Redesign No 4) 10 things I learned from looking at 600 pitch deck reviews. No 5) What we learned from designing 200 pitch decks No 6) Startup Metrics: Which Ones Matter Most to Investors? Courtesy of Product Hunt <Pitching> No 1) David S. Rose: How to pitch to a VC. Courtesy of David S. Roserose, Managing Partner of Rose Tech Ventures No 2) How to Pitch to Investors — Y Combinator (From 19m 49s) Courtesy of Michael Siebel and Tyler Bosmeny, Partners at YC No 3) 14 Pitch Lessons Every Startup Founder Should Know No 4) The Most Important Elevator Pitch Rule: “No Ands.” Courtesy of David Cancel, CEO at Drift. No 5) How to Convince Investors — Paul Graham’s Essay. Courtesy of Paul Graham, Founder of Y Combinator No 6) A Dozen Things I’ve Learned from Jim Goetz at Sequoia Capital about Startup and Pitching. Courtesy of Tren Griffin No 7) Advice on pitching your startup by one of most influential investors in Silicon Valley, Ron Conway. No 8) Twillo 2008: Best Seed Pitch Ever. (Twillo is now publicly traded company). Courtesy of Fred Wilson <Book & Course> No 1) Get Backed: Craft Your Story, Build the Perfect Pitch Deck, and Launch the Venture of Your Dreams. 4.9/5 stars, 87 reviews. Courtesy of Evan Baehr No 2) The Art of Startup Fundraising: Pitching Investors, Negotiating the Deal, and Everything Else Entrepreneurs Need to Know. 4.8/5 stars, 127 reviews. Courtesy of Alejandro Cremades and Barbara Corcoran at SharkTank No 3) The “Best” Startup Pitch Deck — How To Raise Venture Capital. 4.8/5 stars, 1384 recommends. Courtesy of J Skyler Fernandes <Good Examples> No 1) Square’s Series B Pitch Deck No 2) WeWork pitch deck (Series D) No 3) Mixpanel — Our pitch deck that we used to raise $65M No 4) Chewse Pitch Deck: Raised $7.6M in funding No 5) Intercom’s first pitch deck No 6) Foursquare’s 1st Pitch Deck No 7) Youtube pitch deck to Sequoia Capital That’s it for How to Create a Pitch Deck. If you like this curation, you can read Top 10 daily articles based on your skills on iPhone & iPad app. Mybridge is a curated reading app for professionals. The AI technology ranks articles across the web and finds you the top articles everyday. Click heart & share.. ", "title": "All about creating a startup pitch deck to raise funding", "sentences": [{"5b52": "All about creating a startup pitch deck to raise funding"}, {"7b64": "A good pitch can significantly increase your chance to raise money from investors."}, {"8100": "Notably, Airbnb was turned down multiple times by investors until they figured out the pitch that worked best for them (see: 7 Rejections by Brian Chesky)"}, {"02cd": "There are many reasons why your company is great, but people can only really remember a few of them after a short presentation or pitch. From the visuals to the key numbers you choose, you want to make it as attractive, simple and clear as possible."}, {"5495": "“One in 15 entrepreneurs that come through our doors can convey clearly about what they do in literally 5 minutes.” — Jim Goetz at Sequoia Capital (known for investing in WhatsApp)"}, {"73b7": "Mybridge AI evaluates the quality of content and ranks the best articles for professionals. In this observation, we’ve compared nearly 4,200 articles on creating pitch decks and picked the Top 35 for entrepreneurs."}, {"c50c": "4,200 -> 35. Only 0.8% chance to be included."}, {"2433": "This is a competitive list that carefully includes the most useful articles for creating a pitch deck. Keep this as a reference for creating a pitch deck when you’re raising money from VCs."}, {"5861": "<By Investors>"}, {"62ba": "No 1) Sequoia Capital Pitch Deck Template."}, {"2cdb": "No 2) How to Design a Better Pitch Deck — Y Combinator. Courtesy of Kevin Hale, Partner at YC"}, {"b474": "No 3) How to Pitch a VC Redesigned — 500 Startups. Courtesy of Dave McClure, Founder of 500 Startups"}, {"e22f": "No 4) The Startup Investor Pitch Deck & How to Present to Angels. Courtesy of J Skyler Fernandes at Simon Venture Group"}, {"0df2": "…………..[Related] Step by Step Pitching Course by J Skyler Fernandes 4.8/5 stars, 1,384 recommends on Udemy"}, {"855f": "No 5) Pitch Deck Template For Entrepreneurs by Peter Thiel, Facebook’s first investor."}, {"42f7": "No 6) The 10/20/30 Rule of PowerPoint — Garage Technology Ventures. Courtesy of Guy Kawasaki, Partner at GTV"}, {"a4ee": "<By Entrepreneurs>"}, {"a0c5": "No 1) How to Design a Pitch Deck from a Seasoned Founder. Courtesy of WebdesignerDepot"}, {"e2f0": "No 2) How to Create a Pitch Deck from LinkedIn’s Series B Pitch to Greylock. Courtesy of Reid Hoffman, Founder of LinkedIn"}, {"d427": "No 3) Creating Series A Deck for Raising $10M at Front. Courtesy of Mathilde Collin, Founder of Front."}, {"5fec": "No 4) The investor presentation we used to raise $2 million at Crew. Courtesy of Mikael Cho, Founder of Crew"}, {"ed12": "No 5) The Pitch Deck Buffer Used to Raise $500,000. Courtesy of Dharmesh Shah, Founder and CTO of Hubspot"}, {"dc4b": "No 6) How Tim Young raised $10 million in 3 rounds with 5 Magic Pitch Slides."}, {"64b1": "No 7) How We Raised $700,000 without a product but a pitch deck. Courtesy of Andrew Michael, Founder of AdJelly"}, {"70f7": "<Research>"}, {"8b93": "No 1) A Study of Creating a Perfect Pitch Deck From Observation of 200 Decks: VCs Spend an Average of 3.8 minutes."}, {"d896": "No 2) The secret formula to startup pitch from analyzing 477,358 pitches."}, {"f4e7": "No 3) Airbnb pitch deck: Teardown and Redesign"}, {"2058": "No 4) 10 things I learned from looking at 600 pitch deck reviews."}, {"9202": "No 5) What we learned from designing 200 pitch decks"}, {"c5d8": "No 6) Startup Metrics: Which Ones Matter Most to Investors? Courtesy of Product Hunt"}, {"aeb9": "<Pitching>"}, {"5b4f": "No 1) David S. Rose: How to pitch to a VC. Courtesy of David S. Roserose, Managing Partner of Rose Tech Ventures"}, {"6099": "No 2) How to Pitch to Investors — Y Combinator (From 19m 49s) Courtesy of Michael Siebel and Tyler Bosmeny, Partners at YC"}, {"7c27": "No 3) 14 Pitch Lessons Every Startup Founder Should Know"}, {"93bd": "No 4) The Most Important Elevator Pitch Rule: “No Ands.” Courtesy of David Cancel, CEO at Drift."}, {"865e": "No 5) How to Convince Investors — Paul Graham’s Essay. Courtesy of Paul Graham, Founder of Y Combinator"}, {"a108": "No 6) A Dozen Things I’ve Learned from Jim Goetz at Sequoia Capital about Startup and Pitching. Courtesy of Tren Griffin"}, {"13a6": "No 7) Advice on pitching your startup by one of most influential investors in Silicon Valley, Ron Conway."}, {"f218": "No 8) Twillo 2008: Best Seed Pitch Ever. (Twillo is now publicly traded company). Courtesy of Fred Wilson"}, {"983c": "<Book & Course>"}, {"201a": "No 1) Get Backed: Craft Your Story, Build the Perfect Pitch Deck, and Launch the Venture of Your Dreams. 4.9/5 stars, 87 reviews. Courtesy of Evan Baehr"}, {"3955": "No 2) The Art of Startup Fundraising: Pitching Investors, Negotiating the Deal, and Everything Else Entrepreneurs Need to Know. 4.8/5 stars, 127 reviews. Courtesy of Alejandro Cremades and Barbara Corcoran at SharkTank"}, {"b837": "No 3) The “Best” Startup Pitch Deck — How To Raise Venture Capital. 4.8/5 stars, 1384 recommends. Courtesy of J Skyler Fernandes"}, {"d106": "<Good Examples>"}, {"9539": "No 1) Square’s Series B Pitch Deck"}, {"4c31": "No 2) WeWork pitch deck (Series D)"}, {"d8b7": "No 3) Mixpanel — Our pitch deck that we used to raise $65M"}, {"fff4": "No 4) Chewse Pitch Deck: Raised $7.6M in funding"}, {"ffbd": "No 5) Intercom’s first pitch deck"}, {"8bbc": "No 6) Foursquare’s 1st Pitch Deck"}, {"9882": "No 7) Youtube pitch deck to Sequoia Capital"}, {"3e25": "That’s it for How to Create a Pitch Deck."}, {"ed2e": "If you like this curation, you can read Top 10 daily articles based on your skills on iPhone & iPad app."}, {"a7a7": "Mybridge is a curated reading app for professionals. The AI technology ranks articles across the web and finds you the top articles everyday."}, {"e3fa": "Click heart & share.."}], "child": "1692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_21692_1\t1692_2"}