{"name": "1693", "parent": "", "content": "Top 10 Startup Readings to Make You a Better Founder. We’ve observed nearly 2,000 articles posted and updated between Feb-March 2016 that are related to building a startup company. A startup is an entrepreneurial venture in the form of a company designed to search for a scalable business model through constant iterations. In this post, I’ll size down thousands of posts to just ten. Mybridge A.I. considers at a variety of factors to determine how useful the content are for professionals. Hopefully you’ll find some worthy articles that you may have missed for the past months. If you’re looking for Top articles for web design or development, visit our Medium publication. Rank 1 The 30 Best Pieces of Advice from Startup Founders. Courtesy of First Round. Rank 2 The Hierarchy of Engagement: Roadmap to Building a Billion Dollar Startup. Courtesy of Sarah Tavel & Greylock Partners. Rank 3 16 Startup Metrics. Courtesy of Andreessen Horowitz. Rank 4 Blitzscaling: Growing your startup really really quickly. Courtesy of Reid Hoffman & Harvard Business Review. Rank 5 MVPM: Minimum Viable Product Manager. Courtesy of Brandon Chu. Rank 6 How Airbnb scaled its startup from 0 to $25b — Conversation between Brian Chesky and Reid Hoffman. Rank 7 Slack’s First Product Manager on How to Make a Firehose of Feedback Useful. Courtesy of First Round. Rank 8 10 Steps to Validating Product Ideas. Courtesy of Tomer Sharon. Rank 9 The life and death of apps in the App Store. Courtesy of Casey Newton and Fortune. Rank 10 Silicon Valley’s Unchecked Arrogance: How Silicon Valley is creating the future while the rest of the world could become the idle class (a philosophical reading about the tech startups in the Bay Area). Courtesy of Ross Baird. Bonus 1 CrunchBase Unicorn Leaderboards (see the list of all unicorn startups in the world and the valuation status). Courtesy of @techcrunch. Bonus 2 How to be a great founder by LinkedIn co-founder, Reid Hoffman, at Stanford. Bonus 3 How to Start a Startup by YCombinator President, Sam Altman, and Facebook co-founder, Dustin Moskovitz at Stanford. That’s it for Startup monthly Top 10. If you like our curation, you can read Top 10 daily articles personalized for your skills on Mybridge iPhone app. It’s free for anyone who wants to read great content and get better at work. Hope you enjoyed it! Mybridge a reading app for professionals. The A.I. technology ranks content across the internet and finds you top content every day, week and month. Recommend & Share.. ", "title": "Top 10 Startup Readings to Make You a Better Founder.", "sentences": [{"5b52": "Top 10 Startup Readings to Make You a Better Founder."}, {"c915": "We’ve observed nearly 2,000 articles posted and updated between Feb-March 2016 that are related to building a startup company."}, {"7d7c": "A startup is an entrepreneurial venture in the form of a company designed to search for a scalable business model through constant iterations."}, {"1339": "In this post, I’ll size down thousands of posts to just ten. Mybridge A.I. considers at a variety of factors to determine how useful the content are for professionals. Hopefully you’ll find some worthy articles that you may have missed for the past months."}, {"725c": "If you’re looking for Top articles for web design or development, visit our Medium publication."}, {"2cf4": "Rank 1"}, {"839e": "The 30 Best Pieces of Advice from Startup Founders. Courtesy of First Round."}, {"1f10": "Rank 2"}, {"1afa": "The Hierarchy of Engagement: Roadmap to Building a Billion Dollar Startup. Courtesy of Sarah Tavel & Greylock Partners."}, {"abef": "Rank 3"}, {"396b": "16 Startup Metrics. Courtesy of Andreessen Horowitz."}, {"bc5b": "Rank 4"}, {"0e66": "Blitzscaling: Growing your startup really really quickly. Courtesy of Reid Hoffman & Harvard Business Review."}, {"1a01": "Rank 5"}, {"e8d5": "MVPM: Minimum Viable Product Manager. Courtesy of Brandon Chu."}, {"dcd6": "Rank 6"}, {"62cb": "How Airbnb scaled its startup from 0 to $25b — Conversation between Brian Chesky and Reid Hoffman."}, {"8cde": "Rank 7"}, {"22bc": "Slack’s First Product Manager on How to Make a Firehose of Feedback Useful. Courtesy of First Round."}, {"21ce": "Rank 8"}, {"c28a": "10 Steps to Validating Product Ideas. Courtesy of Tomer Sharon."}, {"4d58": "Rank 9"}, {"9b97": "The life and death of apps in the App Store. Courtesy of Casey Newton and Fortune."}, {"9e4e": "Rank 10"}, {"71ab": "Silicon Valley’s Unchecked Arrogance: How Silicon Valley is creating the future while the rest of the world could become the idle class (a philosophical reading about the tech startups in the Bay Area). Courtesy of Ross Baird."}, {"0580": "Bonus 1"}, {"bac3": "CrunchBase Unicorn Leaderboards (see the list of all unicorn startups in the world and the valuation status). Courtesy of @techcrunch."}, {"4a4b": "Bonus 2"}, {"76c9": "How to be a great founder by LinkedIn co-founder, Reid Hoffman, at Stanford."}, {"8959": "Bonus 3"}, {"8331": "How to Start a Startup by YCombinator President, Sam Altman, and Facebook co-founder, Dustin Moskovitz at Stanford."}, {"c2d6": "That’s it for Startup monthly Top 10. If you like our curation, you can read Top 10 daily articles personalized for your skills on Mybridge iPhone app. It’s free for anyone who wants to read great content and get better at work."}, {"cb7f": "Hope you enjoyed it!"}, {"a7a7": "Mybridge a reading app for professionals. The A.I. technology ranks content across the internet and finds you top content every day, week and month."}, {"4abe": "Recommend & Share.."}], "child": "1693_1\t1693_2\t1693_3\t1693_4\t1693_51693_1\t1693_2\t1693_3\t1693_4\t1693_51693_1\t1693_2\t1693_3\t1693_4\t1693_5"}