{"name": "1698", "parent": "", "content": "THE BEST MORNING ROUTINE STARTS NINE HOURS EARLIER Properly plan your nights to boost your mornings. Photo courtesy of Mitchell Jordan I can remember exactly when and where I was when I started to take all of this self-help advice to heart. My wife and I were standing in the bathroom, and she told me that the stick that ultimately determined if another human being was going to enter the world, read positive. Worried that I would no longer have time for “my” things, I began to read any book I could get my hands on. After opening up just a handful of them, I immediately identify some re-occurring themes; meditation, exercise, gratitude, morning routines, etc. Since I was not regularly doing any of these things consistently, I figured a solid morning routine should come first and I began experimenting. After roughly 318 attempts I finally discovered one that worked for me as an individual, and also as a new parent. Interestingly enough, out of all the information I had consumed, and experts I had read, the person that finally taught me how to make my routine stick, weighed in, just months prior, at a whopping 7 pounds and 11 ounces. During this time, like most people, my son got a day older as each day passed. However, unlike most people, he was changing on a daily basis and it was hard to keep up with him. My wife and I did our best to keep his days simple and get a routine that works for him down pat. It did not take us long to realise that the “one thing” in which all else hinged upon, had nothing to do with simple days, and everything to do with simple evenings. After a few months of witnessing first-hand how my son acted if he did not have a solid wind-down routine, it finally hit me: if my son´s happiness and energy levels tomorrow depend on a consistent and relaxing hour before going to bed, as an adult, am I that different? And with that, my son taught me the missing link in getting the most out of my mornings: the most successful morning routine begins with a successful nighttime routine. Below are the 6 steps I am now taking each evening prior to going to bed to make sure I wake up smiling and ready to take on the morning. 1. AMISH HOUR: The hour leading up to bedtime is technology free, hence the term “amish hour”. Computers and phones are off limits. No exceptions, and no doubt a challenge. To ensure the habit took hold, my wife and I came up with a designated “charging room” for all electronic devices. This one action makes the rest of the items on the list possible, and most importantly, it raises the odds of my wife being the last thing I see and touch prior to falling asleep, something I hate to admit was not always the case (which was flat-out ridiculous of me. Sorry Little One). 2. COLD SHOWER: When I was young I was that kid who wore a shirt when swimming, and nervously paced around the pool testing the water with my toes, before chickening out from jumping in due to the cold water. Today I cannot go 24 hours without a cold shower, and most days I spend more time in the cold water tub at the gym than the sauna. Sounds counter-productive before going to bed, but give it a shot. I have discovered it is also a great solution for anxiety. 3. PRACTICE GRATITUDE OF SOME SORT: My wife and I are not the types to sit around and tell each other about all the great things we have. So in place of the standard “gratitude” list, my wife and I have a “Holy Shit Jar”, where each evening we write out a few cool things that happened each day. Last week my son asked me what a penis was. He is two years old. I thought that was worthy of a “Holy Shit Jar” submission. But it can be simple as what we ate for dinner or how great my wife looks. The point is just to keep your ears and eyes open for the good in the world and make a note of it, after all, it is much easier to wake up smiling, if we fall asleep smiling. 3. MEDITATION: This does not have to mean candles and Yanni. Just take 10 minutes prior to going to sleep and sit comfortably in silence or with light music and breathe. This was a challenge for me at first, but after a month of doing it, I now find myself taking 5 to 10 minute breaks more and more often and I get why meditation is not just a trend, but here to stay. 4. WRITE OUT YOUR NEXT DAY (focus on the good things) I used to hate getting out of bed because I would immediately get stressed out thinking about all the “things” that I “had to do” during the upcoming day. An easy solution for this is getting down on paper the items that I do indeed “have to do”, but also putting pencil to paper for the things that “I want to do” and making sure in the morning this list takes priority. My “want to do” list now is twice the size of my “have to do´s” and has helped me a great deal in starting each day with a positive mindset. 5. READING and/or WRITING: Every night either my wife or I go down with our little man and read him a story and soon after he is snoring away. Much of the advice from successful people boils down to staying a student and never losing your childlike wonder and curiosity for the world. Reading before going to bed, instead of watching TV, helps to take care of both. 6. SOME FORM OF HUMAN CONTACT (If your circumstances permit): This does not have to mean sex. For those of you with partners, you can start with holding hands. My wife and I have had a hard time making time for us with the new addition, and at times I am blown away by the power of such a simple action. The rise of technology has so many great things to offer us, but nothing competes with communication and touching the real thing. Incidentally, the morning routine that finally stuck is a close variation of my evening routine: human contact, breathing, walking my son to school and then running home, cold shower followed by reading books or trying to write one. I am still not where I want to be in my career, but in the last year I have gotten much closer, and it had nothing to do with what time I got up, and everything to do with what time I went to bed, and the routine leading up to it. ", "title": "THE BEST MORNING ROUTINE STARTS NINE HOURS EARLIER", "sentences": [{"af4f": "THE BEST MORNING ROUTINE STARTS NINE HOURS EARLIER"}, {"1423": "Properly plan your nights to boost your mornings."}, {"0f26": "Photo courtesy of Mitchell Jordan"}, {"bd0d": "I can remember exactly when and where I was when I started to take all of this self-help advice to heart. My wife and I were standing in the bathroom, and she told me that the stick that ultimately determined if another human being was going to enter the world, read positive."}, {"0699": "Worried that I would no longer have time for “my” things, I began to read any book I could get my hands on. After opening up just a handful of them, I immediately identify some re-occurring themes; meditation, exercise, gratitude, morning routines, etc. Since I was not regularly doing any of these things consistently, I figured a solid morning routine should come first and I began experimenting."}, {"3e0e": "After roughly 318 attempts I finally discovered one that worked for me as an individual, and also as a new parent. Interestingly enough, out of all the information I had consumed, and experts I had read, the person that finally taught me how to make my routine stick, weighed in, just months prior, at a whopping 7 pounds and 11 ounces."}, {"81dc": "During this time, like most people, my son got a day older as each day passed. However, unlike most people, he was changing on a daily basis and it was hard to keep up with him. My wife and I did our best to keep his days simple and get a routine that works for him down pat. It did not take us long to realise that the “one thing” in which all else hinged upon, had nothing to do with simple days, and everything to do with simple evenings."}, {"3dba": "After a few months of witnessing first-hand how my son acted if he did not have a solid wind-down routine, it finally hit me: if my son´s happiness and energy levels tomorrow depend on a consistent and relaxing hour before going to bed, as an adult, am I that different?"}, {"21a5": "And with that, my son taught me the missing link in getting the most out of my mornings: the most successful morning routine begins with a successful nighttime routine."}, {"1831": "Below are the 6 steps I am now taking each evening prior to going to bed to make sure I wake up smiling and ready to take on the morning."}, {"fcb0": "1. AMISH HOUR:"}, {"83aa": "The hour leading up to bedtime is technology free, hence the term “amish hour”. Computers and phones are off limits. No exceptions, and no doubt a challenge. To ensure the habit took hold, my wife and I came up with a designated “charging room” for all electronic devices. This one action makes the rest of the items on the list possible, and most importantly, it raises the odds of my wife being the last thing I see and touch prior to falling asleep, something I hate to admit was not always the case (which was flat-out ridiculous of me. Sorry Little One)."}, {"19cd": "2. COLD SHOWER:"}, {"4db0": "When I was young I was that kid who wore a shirt when swimming, and nervously paced around the pool testing the water with my toes, before chickening out from jumping in due to the cold water. Today I cannot go 24 hours without a cold shower, and most days I spend more time in the cold water tub at the gym than the sauna. Sounds counter-productive before going to bed, but give it a shot. I have discovered it is also a great solution for anxiety."}, {"ad5a": "3. PRACTICE GRATITUDE OF SOME SORT:"}, {"b545": "My wife and I are not the types to sit around and tell each other about all the great things we have. So in place of the standard “gratitude” list, my wife and I have a “Holy Shit Jar”, where each evening we write out a few cool things that happened each day. Last week my son asked me what a penis was. He is two years old. I thought that was worthy of a “Holy Shit Jar” submission. But it can be simple as what we ate for dinner or how great my wife looks. The point is just to keep your ears and eyes open for the good in the world and make a note of it, after all, it is much easier to wake up smiling, if we fall asleep smiling."}, {"f6a3": "3. MEDITATION:"}, {"37e3": "This does not have to mean candles and Yanni. Just take 10 minutes prior to going to sleep and sit comfortably in silence or with light music and breathe. This was a challenge for me at first, but after a month of doing it, I now find myself taking 5 to 10 minute breaks more and more often and I get why meditation is not just a trend, but here to stay."}, {"35c9": "4. WRITE OUT YOUR NEXT DAY (focus on the good things)"}, {"60de": "I used to hate getting out of bed because I would immediately get stressed out thinking about all the “things” that I “had to do” during the upcoming day. An easy solution for this is getting down on paper the items that I do indeed “have to do”, but also putting pencil to paper for the things that “I want to do” and making sure in the morning this list takes priority. My “want to do” list now is twice the size of my “have to do´s” and has helped me a great deal in starting each day with a positive mindset."}, {"a2be": "5. READING and/or WRITING:"}, {"74c9": "Every night either my wife or I go down with our little man and read him a story and soon after he is snoring away. Much of the advice from successful people boils down to staying a student and never losing your childlike wonder and curiosity for the world. Reading before going to bed, instead of watching TV, helps to take care of both."}, {"c671": "6. SOME FORM OF HUMAN CONTACT (If your circumstances permit):"}, {"05d1": "This does not have to mean sex. For those of you with partners, you can start with holding hands. My wife and I have had a hard time making time for us with the new addition, and at times I am blown away by the power of such a simple action. The rise of technology has so many great things to offer us, but nothing competes with communication and touching the real thing."}, {"47d8": "Incidentally, the morning routine that finally stuck is a close variation of my evening routine: human contact, breathing, walking my son to school and then running home, cold shower followed by reading books or trying to write one. I am still not where I want to be in my career, but in the last year I have gotten much closer, and it had nothing to do with what time I got up, and everything to do with what time I went to bed, and the routine leading up to it."}], "child": "1698_1\t1698_2"}