{"content": "Why Pro Matters In the light of Apple’s recent, incredibly surprising reveal of their plans for the Mac Pro, I wanted to write a bit about the (literally) immeasurable value of their Pro Mac user base. As John Gruber mentioned, the Mac market is negligible next to the iPhone market: Even among pro users, notebooks are by far the most popular Macs. In second place are iMacs. The Mac Pro is third. Apple declined to describe the Mac Pro’s share of all Mac sales any more specifically than “a single-digit percent”, but my gut feeling is that the single digit is a lot closer to 1 than it is to 9. The desktop market is a small shard of a chunk, and out of that, the Mac Pro users are an even smaller one: a single-digit percentage of all Macs. So why would Apple even bother with this group? I won’t lie; even though I am an ex-Mac Pro owner and one of the biggest whiners online for a new Mac Pro, I expected Apple to outright abandon this market. I figured they simply didn’t care enough about this segment anymore and they would let the companies that entered the currently-vacuous-space of Pro creative computers take over. Several companies are already making moves. This week showed that Apple isn’t going to let that group of users slide. Let’s talk about Macs for a moment. They’re a classic story of an underdog: as the PC was conquering the market, the Mac somewhat miraculously emerged as the choice of design professionals. Steve Jobs proudly marketed it towards the ‘Crazy Ones’ in their marketing. Adobe initially favored Apple’s platform for its creative software like Photoshop and Illustrator. Add the late (RIP) QuarkExpress DTP software, along with other smaller creative apps and you can see how people came to prefer the Mac for creative work. In 2001, Apple moved Mac OS to a UNIX base, appealing to the scientific computing community as well as developers. What happened next was very interesting. As Apple focused on creating a healthy developer environment with good tools, a huge explosion in digital and web design happened. Macs became the tool of choice of this new wave of designers, and as the web evolved Apple kept its OS and app ecosystem in sync with its trends; as online video became popular, Apple offered the easiest editing software in iMovie. Blogs and RSS had a peak; Macs came with iWeb that let you author blogs literally out of the box. These designers started to code, or came in contact with developers. As a result, Apple’s Mac OS third party software ecosystem thrived. Apple’s intense focus on design, in its computers and in its user interfaces, helped its creative users realize what a interactions with a computer and software could be. There was a lot of tinkering, but beyond that: Art in apps became a real thing. We had smoking disc burning apps (no, really: an app with a smoke simulation system as you burned a disc). A piece of cataloging software that let you literally shelve your books (and later, items in your home). Some fun people got together to make an uninstaller modeled after a laser gun. Others took Apple’s approach to making something ‘stupid easy’ and took a complex, inaccessible thing and made it understandable to an entirely new class of nontechnical users, like the ultra-polished CSSEdit or Panic’s Coda. I actually learned CSS thanks to CSSEdit’s — at the time, totally unique — X-Ray and Override feature that let you click website elements, view their styles and live-edit them. The list goes on, and what Apple had created started giving back to them: a beautiful exploration in browsing music, Coverflow, was a standalone app but its creators were acqui-hired by Apple and the UI and technology integrated into the first iPhone OS and Mac OS X Leopard. Exploration of small UI in Mac OS X Tiger’s Dashboard widgets informed the user interface of the first iPhone. Beautiful mini-apps already existed there, like Delivery Status and Ski Report. All of this existed because Apple invested hugely in developing its OS, packing great APIs and innovations into at every release, as well as keeping a big, healthy, frequently updated set of computers for every niche. I know designers that switched to Macs coming from a professional 3D background, editing special effects for feature films, designing immersive Flash (remember Flash?) website experiences and more — who all went and ended up working on apps. Many jumped from a PC to a beefy Mac Pro. Others got a Mac Mini, uninterested in buying an expensive new laptop or screen. Others yet got in with the sleek MacBook Pros, only to ditch the PC for their 3D / animation rendering work and buying a Mac Pro. I was one of the latter. This scene of creative software development and ‘app artists’ was swirling at an absolute storm of activity when Apple suddenly released the iPhone. All these people who were already making these fantastically beautiful apps or just part of the community were suddenly eager to build apps for this new device. Some even did before you were able to; bypassing limitations before the App Store came into existence. Eventually, Apple opened the gates. What happened next was incredible. The Nokia N95 was the absolute state of the art at the time. This was the state of mobile software pre-App Store: Here’s the same app from the first iPhone OS: Apple massively innovated with a phone that was essentially a highly capable, all-screen multi-purpose computer in your pocket. Thanks to the Mac, it instantly had an audience of skilled, creative and passionate makers that were eager to bring all their artistry and experience to an entirely new class of product. iPhone marked a huge revolution in software: no such shift in the quality of software since has ever happened again. Almost overnight, we went from rudimentary fragments of a utility to mind-blowing experiments on a tiny computer that went with us everywhere. And apps were gorgeous. A huge, creative base was unleashed on an entirely new medium all at once. And again, like with the Mac, Apple got a lot back from what it created. You could argue that Apple was inspired by an app back then Classics, with its actual-page-flipping UI to create iBooks. (I worked on Classics with the talented David Lanham, Andrew Kaz and Phill Ryu) We all know the iPhone story after this. It became the rocket engine to power Apple’s rise to the most profitable company on Earth. We can excuse Apple for losing sight of what made that so special and such a success; in creating such excellent products on the computer and phone side, they had an ecosystem that produced beautiful work almost automatically. It was a wonderful combination of factors. But since then, Apple has focused almost exclusively on its massive moneymakers and not so much on the Mac or creative professionals. In fact, they let the creatives that brought them to that point down. As they focused solely on the iPhone and iPad, they let the Mac languish, with a lack of updates to the hardware making it increasingly difficult to use the Mac for demanding work. The Mac Pro itself was removed from sale and replaced with a somewhat tone-deaf ‘Trash Can’ edition that was non-upgradable, impossible to expand and severely underpowered soon after launch. And year after year, without any word from Apple, the professional desktop Macs got older without updates. Four years passed. Four years. An eternity and a half in computers. Creatives started to leave. Most of my friends that are in 3D, film and other creative industries have switched to PCs. And more continue to leave. Why? The next wave of creative work is here. It requires a great deal more power than Apple’s sleek laptops offer today. In the last years, real-time ray tracing became a thing in 3D. It’s hard to overstate how much of a big deal this is. In a recent talk at FITC Amsterdam, artist Raul Marks (famous for working on inimitable titles for Westworld, True Detective and Halt and Catch Fire) stated he used to have to rely on the rendering farm of Elastic to get his work done. Creatives are losing the option to use Macs to create work like this. Now, he can work from Australia; previewing how his renders will turn out from the comfort of his home by realtime-raytracing his scenes. This is only possible with powerful modern GPUs paired up with Octane Render. The same kind of huge leaps are happening in gaming and game development; a powerful modern GPU is a requirement for working on and using VR and AR, one area Apple is said to be working on. Demand and interest in 3D work, for design, game and software development, and video is bigger than ever and growing exponentially. Without a truly top-tier workstation, Apple will miss out on a huge segment of digital creatives that can craft the future of human-machine interaction — something way beyond tapping a piece of glass. It would lack a Mac workstation with the raw computing power to prototype VR and AR interactions, build game worlds, simulate complex models and render the effects of tomorrow’s great feature films all the while offering those same creatives a platform to create for its own mobile devices. Before this week’s announcement, it was looking like the future would simply pass Apple by. And I was convinced — me, an ex-Apple designer with the greatest passion for Macs — that I had bought my last Mac, and would finally be forced to switch back to PCs. I’m incredibly relieved I won’t be. ", "child": "17_1\t17_2\t17_3\t17_4\t17_5\t17_6\t17_7\t17_8\t17_9\t17_10\t17_11\t17_12\t17_13\t17_14", "title": "Why Pro Matters", "parent": "", "sentences": [{"02e6": "Why Pro Matters"}, {"563f": "In the light of Apple’s recent, incredibly surprising reveal of their plans for the Mac Pro, I wanted to write a bit about the (literally) immeasurable value of their Pro Mac user base."}, {"beab": "As John Gruber mentioned, the Mac market is negligible next to the iPhone market:"}, {"4129": "Even among pro users, notebooks are by far the most popular Macs. In second place are iMacs. The Mac Pro is third. Apple declined to describe the Mac Pro’s share of all Mac sales any more specifically than “a single-digit percent”, but my gut feeling is that the single digit is a lot closer to 1 than it is to 9."}, {"ff66": "The desktop market is a small shard of a chunk, and out of that, the Mac Pro users are an even smaller one: a single-digit percentage of all Macs."}, {"e6aa": "So why would Apple even bother with this group? I won’t lie; even though I am an ex-Mac Pro owner and one of the biggest whiners online for a new Mac Pro, I expected Apple to outright abandon this market. I figured they simply didn’t care enough about this segment anymore and they would let the companies that entered the currently-vacuous-space of Pro creative computers take over. Several companies are already making moves."}, {"b8be": "This week showed that Apple isn’t going to let that group of users slide."}, {"fac5": "Let’s talk about Macs for a moment. They’re a classic story of an underdog: as the PC was conquering the market, the Mac somewhat miraculously emerged as the choice of design professionals. Steve Jobs proudly marketed it towards the ‘Crazy Ones’ in their marketing. Adobe initially favored Apple’s platform for its creative software like Photoshop and Illustrator. Add the late (RIP) QuarkExpress DTP software, along with other smaller creative apps and you can see how people came to prefer the Mac for creative work. In 2001, Apple moved Mac OS to a UNIX base, appealing to the scientific computing community as well as developers."}, {"4199": "What happened next was very interesting."}, {"34f7": "As Apple focused on creating a healthy developer environment with good tools, a huge explosion in digital and web design happened."}, {"4564": "Macs became the tool of choice of this new wave of designers, and as the web evolved Apple kept its OS and app ecosystem in sync with its trends; as online video became popular, Apple offered the easiest editing software in iMovie. Blogs and RSS had a peak; Macs came with iWeb that let you author blogs literally out of the box. These designers started to code, or came in contact with developers."}, {"6c7d": "As a result, Apple’s Mac OS third party software ecosystem thrived. Apple’s intense focus on design, in its computers and in its user interfaces, helped its creative users realize what a interactions with a computer and software could be. There was a lot of tinkering, but beyond that:"}, {"b0df": "Art in apps became a real thing."}, {"14cb": "We had smoking disc burning apps (no, really: an app with a smoke simulation system as you burned a disc). A piece of cataloging software that let you literally shelve your books (and later, items in your home). Some fun people got together to make an uninstaller modeled after a laser gun. Others took Apple’s approach to making something ‘stupid easy’ and took a complex, inaccessible thing and made it understandable to an entirely new class of nontechnical users, like the ultra-polished CSSEdit or Panic’s Coda. I actually learned CSS thanks to CSSEdit’s — at the time, totally unique — X-Ray and Override feature that let you click website elements, view their styles and live-edit them."}, {"613b": "The list goes on, and what Apple had created started giving back to them: a beautiful exploration in browsing music, Coverflow, was a standalone app but its creators were acqui-hired by Apple and the UI and technology integrated into the first iPhone OS and Mac OS X Leopard."}, {"cf0e": "Exploration of small UI in Mac OS X Tiger’s Dashboard widgets informed the user interface of the first iPhone. Beautiful mini-apps already existed there, like Delivery Status and Ski Report."}, {"d968": "All of this existed because Apple invested hugely in developing its OS, packing great APIs and innovations into at every release, as well as keeping a big, healthy, frequently updated set of computers for every niche. I know designers that switched to Macs coming from a professional 3D background, editing special effects for feature films, designing immersive Flash (remember Flash?) website experiences and more — who all went and ended up working on apps."}, {"6ce8": "Many jumped from a PC to a beefy Mac Pro. Others got a Mac Mini, uninterested in buying an expensive new laptop or screen. Others yet got in with the sleek MacBook Pros, only to ditch the PC for their 3D / animation rendering work and buying a Mac Pro. I was one of the latter."}, {"a584": "This scene of creative software development and ‘app artists’ was swirling at an absolute storm of activity when Apple suddenly released the iPhone. All these people who were already making these fantastically beautiful apps or just part of the community were suddenly eager to build apps for this new device."}, {"08ca": "Some even did before you were able to; bypassing limitations before the App Store came into existence."}, {"24f0": "Eventually, Apple opened the gates. What happened next was incredible."}, {"01d9": "The Nokia N95 was the absolute state of the art at the time. This was the state of mobile software pre-App Store:"}, {"b5c1": "Here’s the same app from the first iPhone OS:"}, {"2266": "Apple massively innovated with a phone that was essentially a highly capable, all-screen multi-purpose computer in your pocket. Thanks to the Mac, it instantly had an audience of skilled, creative and passionate makers that were eager to bring all their artistry and experience to an entirely new class of product."}, {"09f9": "iPhone marked a huge revolution in software: no such shift in the quality of software since has ever happened again. Almost overnight, we went from rudimentary fragments of a utility to mind-blowing experiments on a tiny computer that went with us everywhere. And apps were gorgeous. A huge, creative base was unleashed on an entirely new medium all at once."}, {"260b": "And again, like with the Mac, Apple got a lot back from what it created. You could argue that Apple was inspired by an app back then Classics, with its actual-page-flipping UI to create iBooks."}, {"06e5": "(I worked on Classics with the talented David Lanham, Andrew Kaz and Phill Ryu)"}, {"daed": "We all know the iPhone story after this. It became the rocket engine to power Apple’s rise to the most profitable company on Earth."}, {"6be8": "We can excuse Apple for losing sight of what made that so special and such a success; in creating such excellent products on the computer and phone side, they had an ecosystem that produced beautiful work almost automatically. It was a wonderful combination of factors."}, {"e080": "But since then, Apple has focused almost exclusively on its massive moneymakers and not so much on the Mac or creative professionals."}, {"0aeb": "In fact, they let the creatives that brought them to that point down. As they focused solely on the iPhone and iPad, they let the Mac languish, with a lack of updates to the hardware making it increasingly difficult to use the Mac for demanding work."}, {"f842": "The Mac Pro itself was removed from sale and replaced with a somewhat tone-deaf ‘Trash Can’ edition that was non-upgradable, impossible to expand and severely underpowered soon after launch."}, {"6e89": "And year after year, without any word from Apple, the professional desktop Macs got older without updates. Four years passed. Four years. An eternity and a half in computers."}, {"3f9f": "Creatives started to leave. Most of my friends that are in 3D, film and other creative industries have switched to PCs. And more continue to leave."}, {"0fe8": "Why? The next wave of creative work is here. It requires a great deal more power than Apple’s sleek laptops offer today. In the last years, real-time ray tracing became a thing in 3D. It’s hard to overstate how much of a big deal this is. In a recent talk at FITC Amsterdam, artist Raul Marks (famous for working on inimitable titles for Westworld, True Detective and Halt and Catch Fire) stated he used to have to rely on the rendering farm of Elastic to get his work done."}, {"b570": "Creatives are losing the option to use Macs to create work like this."}, {"d7d7": "Now, he can work from Australia; previewing how his renders will turn out from the comfort of his home by realtime-raytracing his scenes. This is only possible with powerful modern GPUs paired up with Octane Render."}, {"94c9": "The same kind of huge leaps are happening in gaming and game development; a powerful modern GPU is a requirement for working on and using VR and AR, one area Apple is said to be working on. Demand and interest in 3D work, for design, game and software development, and video is bigger than ever and growing exponentially."}, {"10e5": "Without a truly top-tier workstation, Apple will miss out on a huge segment of digital creatives that can craft the future of human-machine interaction — something way beyond tapping a piece of glass. It would lack a Mac workstation with the raw computing power to prototype VR and AR interactions, build game worlds, simulate complex models and render the effects of tomorrow’s great feature films all the while offering those same creatives a platform to create for its own mobile devices."}, {"1054": "Before this week’s announcement, it was looking like the future would simply pass Apple by."}, {"87a0": "And I was convinced — me, an ex-Apple designer with the greatest passion for Macs — that I had bought my last Mac, and would finally be forced to switch back to PCs."}, {"d206": "I’m incredibly relieved I won’t be."}], "name": "17"}