{"name": "1701", "parent": "", "content": "Strike while the iron is hot… or how to embrace people, lessons and experiences as they appear. In my third week in Mexico, I left the steady waters of Chacala, that slow paced beach town, and began my journey east. My first stop inland, Guadalajara, is the second largest city in Mexico with a vibe that is less quaint and more fast paced, with commerce, trade, students and more variety, too, in terms of food options. Walking along the streets, life pulses like a musical instrument, ready to burst forth in upbeat melodies. Dance group performing in the street, Guadalajara, MX One of my friends from Austin introduced me to her best friend, Rocio, here in Guadalajara. This wonderful woman took me on a personal tour of this, her hometown. As I have found throughout my Mexican travels so far, and as demonstrated by Rocio, the deep-seated heartfulness and kindness of people here, touches my own heart strings. Rocio and I spoke about meditation, spirituality and the way we build meaning as we walk with intention through this life. We shared photos of our daughters- hers about 6 months old, mine 20 years- and it was the same love we described, that of a mother for her children- that animated our conversation. Almost as an aside, Rocio mentioned to me that she thought I should meet this man, who is very close to her family. She felt his gifts would support me on my spiritual journey. The cryptic nature of this comment, and the light shining in her eyes- the fact that this comment was so out of context to what we were discussing- caught my attention. It intrigued me enough that I decided to follow up by calling this gentleman the next day. This man, Raúl Medina de Wit, works with Quantum Healing Hypnosis Technique, a hypnosis therapy with a particular focus on past life regression. As a lightworker myself, I told him, it is rare for me to engage another healer for this type of session. However, something about his work was a draw for me and I decided I wanted to experience it. He agreed to meet me the next day (as I was leaving town the day after this). It is a 5 hour commitment, and one that Raul is clearly well-seasoned in leading clients through. This deep process, led skillfully and with kindness, helped me view three past lives with the overarching theme of clearing the past so I that could move more powerfully into the fullest expression of my gifts in this lifetime. Forgiveness is the balm that was applied to the wounds of the past- scars and misperceptions I have held close to my heart for lifetimes. My guides and angels used this balm to help me forgive and clear the past, providing me a path forward for my growth and expansion. I needed to see myself, and everyone involved in these past hurtful experiences, in a more truthful way- full of love and as a part of the Oneness. As promised, the session took almost the full five hours. I returned home to the hostel I was staying at with much energy to integrate and a new vibration to be strung into this instrument that is my body, so that I am able to play the music of my soul at a more expanded range and within a higher octave. So, what am I learning now, as I continue to explore central Mexico, and in many ways, move into the heart of my journey? I am learning that the right person always shows up at the right time, just as I am ready, for the highest good of each of us. I am learning that life loves me and yearns to share her blessings with me. It is reciprocal — just as I desire to experience the sweetness of infinite possibilities, the Universe aims in every way possible to deliver my fondest wishes to me. Forgiveness of myself and others — facing the darkest places within me and having them be touched by the balm of love and forgiveness — transmutes these wounds and heartaches into flowers of infinite beauty. The love of the Oneness for me and all of creation — for the blessed child of the Universe that we all are — continues to flow. And so striking when the iron is hot for me is getting clear on what is important to me, what I yearn for, and then surrendering and allowing the answers to unfold in whatever form they may. My work is to not dictate how the answers should look, but rather allow myself to be surprised and delighted by the gifts and answers that support and nourish my journey. And so my wish for you today, dear reader, is an invitation to strike when the iron is hot in your own world, and see what mysteries and beauties unlock themselves for you. May you be inspired by the greatness that is within you. ", "title": "Strike while the iron is hot…", "sentences": [{"2f36": "Strike while the iron is hot…"}, {"2b14": "or how to embrace people, lessons and experiences as they appear."}, {"29b7": "In my third week in Mexico, I left the steady waters of Chacala, that slow paced beach town, and began my journey east. My first stop inland, Guadalajara, is the second largest city in Mexico with a vibe that is less quaint and more fast paced, with commerce, trade, students and more variety, too, in terms of food options. Walking along the streets, life pulses like a musical instrument, ready to burst forth in upbeat melodies."}, {"05f8": "Dance group performing in the street, Guadalajara, MX"}, {"356f": "One of my friends from Austin introduced me to her best friend, Rocio, here in Guadalajara. This wonderful woman took me on a personal tour of this, her hometown. As I have found throughout my Mexican travels so far, and as demonstrated by Rocio, the deep-seated heartfulness and kindness of people here, touches my own heart strings."}, {"ba6c": "Rocio and I spoke about meditation, spirituality and the way we build meaning as we walk with intention through this life. We shared photos of our daughters- hers about 6 months old, mine 20 years- and it was the same love we described, that of a mother for her children- that animated our conversation."}, {"25a6": "Almost as an aside, Rocio mentioned to me that she thought I should meet this man, who is very close to her family. She felt his gifts would support me on my spiritual journey. The cryptic nature of this comment, and the light shining in her eyes- the fact that this comment was so out of context to what we were discussing- caught my attention."}, {"5325": "It intrigued me enough that I decided to follow up by calling this gentleman the next day. This man, Raúl Medina de Wit, works with Quantum Healing Hypnosis Technique, a hypnosis therapy with a particular focus on past life regression."}, {"180f": "As a lightworker myself, I told him, it is rare for me to engage another healer for this type of session. However, something about his work was a draw for me and I decided I wanted to experience it. He agreed to meet me the next day (as I was leaving town the day after this)."}, {"fa62": "It is a 5 hour commitment, and one that Raul is clearly well-seasoned in leading clients through. This deep process, led skillfully and with kindness, helped me view three past lives with the overarching theme of clearing the past so I that could move more powerfully into the fullest expression of my gifts in this lifetime."}, {"4489": "Forgiveness is the balm that was applied to the wounds of the past- scars and misperceptions I have held close to my heart for lifetimes. My guides and angels used this balm to help me forgive and clear the past, providing me a path forward for my growth and expansion. I needed to see myself, and everyone involved in these past hurtful experiences, in a more truthful way- full of love and as a part of the Oneness."}, {"0f62": "As promised, the session took almost the full five hours. I returned home to the hostel I was staying at with much energy to integrate and a new vibration to be strung into this instrument that is my body, so that I am able to play the music of my soul at a more expanded range and within a higher octave."}, {"4653": "So, what am I learning now, as I continue to explore central Mexico, and in many ways, move into the heart of my journey?"}, {"f625": "I am learning that the right person always shows up at the right time, just as I am ready, for the highest good of each of us."}, {"594b": "I am learning that life loves me and yearns to share her blessings with me. It is reciprocal — just as I desire to experience the sweetness of infinite possibilities, the Universe aims in every way possible to deliver my fondest wishes to me."}, {"cbef": "Forgiveness of myself and others — facing the darkest places within me and having them be touched by the balm of love and forgiveness — transmutes these wounds and heartaches into flowers of infinite beauty. The love of the Oneness for me and all of creation — for the blessed child of the Universe that we all are — continues to flow."}, {"46e5": "And so striking when the iron is hot for me is getting clear on what is important to me, what I yearn for, and then surrendering and allowing the answers to unfold in whatever form they may."}, {"b325": "My work is to not dictate how the answers should look, but rather allow myself to be surprised and delighted by the gifts and answers that support and nourish my journey."}, {"aed8": "And so my wish for you today, dear reader, is an invitation to strike when the iron is hot in your own world, and see what mysteries and beauties unlock themselves for you. May you be inspired by the greatness that is within you."}], "child": "1701_1"}