{"name": "1702", "parent": "", "content": "13 Awkward (But Useful) Ways To Help Your Grieving Friend The first weeks after losing my husband are a total blur. I sort of remember there was food and lots of hugging visitors. Unfortunately most of the faces and their gifts are swirled up in the tsunami that was my grief and I don’t remember much of it. It was so primal those first weeks; there really wasn’t much capacity for permanent recall. Over time, I’ve regained a few of the brain cells no longer preoccupied with mere survival. I’ve found lists of what people brought and can now remember extraordinary ways people showed up to love us. I can’t begin to name all the things, but there are a few rock star grief goodies that stand out. Helpful things people gave, said or did that were extra useful, even if I didn’t realize it at the time. Most of these things came from people who have walked through their own hell. Grief makes us amazing comforters and helpers if we let it. I could immediately tell who had experienced great loss in their lives by the things they did or said. Their words and gifts helped in ways beyond the comfort of feeling loved. They were often ordinary and usually practical. And they were things I’d usually never considered before. Flower-givers, casserole-makers and card-senders are equally important, don’t get me wrong, but I’m going to share some less than obvious ways you can help your grieving friends. The tricky thing is, grieving people are so weird. It’s such an individual thing — what we need, what we want, how we feel — all so different from one another and also likely to change in the blink of an eye. It can be really hard to know what to do, so people often tiptoe around, feeling helpless. They often say, “Let me know if there’s anything I can do.” I’ve said it myself to grieving friends and family, but I will rephrase my condolences from now on, because now I know. The truth is, I wasn’t able to think about what I needed from all of the helpers offering their assistance the first month. And by the time I had regained half a brain, most of the helpers were gone. As it turns out, grief lasts longer than sympathy — way longer. I feel bad for all the people who wanted to help right away because I didn’t know what I needed. I don’t blame them for moving on when I wasn’t able to give them instructions. I mean how many times should they need to ask? I would’ve moved on too….before. But now, because grief has changed me, I’ve learned a few things. If you’re a friend to someone who’s experiencing loss and you’re just not sure what to say or do, here’s a list of 13 ideas: My favorites involved lovely, often funny stories about my husband. Sure, they made me cry, but the personal stories brought me comfort. Realizing people actually knew my husband and would miss him too was reassuring. Plus they provided more memories I could call upon later. 2. Gift cards to restaurants It was almost three months before I could do more than prepare a bowl of cereal or toast for my family, and even that felt overwhelming. The freezer was bursting at the seams but defrosting things and turning on the oven? More than I could handle. 3. Paper goods Toilet paper, paper plates, paper towels, Kleenex, napkins, food storage bags, etc. There’s lots of people, and even more food when someone dies. There’s no time for doing dishes and not enough Tupperware in the cupboard to handle it all. And also, who has time to run to the store for toilet paper when you’re grieving? Plus, there are people at the store and they might ask how you’re doing and no. Just NO to that for a while. Too much. 4. Breath mints Do you know what happens when you cry a lot and are running on emotional fumes? Bad breath, that’s what. I honestly don’t even know if I brushed my teeth those first weeks, which is totally gross, but who knows? It’s a grief mystery. All of the hugging and having to talk close-up makes this a gift that keeps on giving. 5. Postage stamps I received a few sympathy cards containing stamps. Thank you! Because running out to buy a stamp was a tiny bit not even on my priority list. These same beautiful people usually wrote their name and address and what they gave inside the card (so I didn’t have to!) and also gave me a free pass on sending them a thank you. 6. Less talk, more listen Listening is probably the most underappreciated gift, yet one of the most valuable. It’s especially an excellent choice when you’re just not sure what to say. Don’t feel bad, most people don’t. It’s just as awkward for you as it is for me. 7. Things to occupy the kids Books, toys, craft kits, Legos, board games, movie theater gift cards — all of these types of things helped give my kids something to do while their Mom was distracted and unavailable. It’s awkward for kids to have a bunch of adults invade their house when they’re craving a sliver of “normal.” 8. Things kids will actually eat Granola bars, cereal, juice boxes, Lunchables, fruit, frozen waffles, etc. The truth is, kids just don’t appreciate a green bean casserole. They did, however, eat up the kid-friendly food that was delivered. And that, in turn, helped me. When my son asked me one evening, “Mom, are you going to feed us tonight?” (don’t judge — grief is hard), I had things I could feed them that didn’t require thought. 9. Gift cards for retail therapy Sometimes the greatest gifts aren’t practical gifts. It took many, many weeks before this was fully appreciated, but it turns out when you’re ready to take that first step forward out of grief, a new outfit really helps. 10. Rescuing the kids If you’re close enough to the family, rescuing the kids from grief-central is so kind and gives them something else to think about for a minute. Taking them for a walk, to a movie, playing with them somewhere other than where all the grief is happening is an amazing gift. It also eased my guilt about not spending time with them because I had to be on the phone handling post-death details. 11. Touch base regularly I have one friend who set an alarm on her phone to remind her to check-in with me via text message every day. It’s not as frequent now, but she’s still checking in. Some days I had the energy to reply, some days I didn’t, but every time I appreciated knowing someone was still thinking about me. It took less energy than a phone call too, which I appreciated. And for the love, please don’t stop doing this after a few months have passed. Do it a year or two later too! 12. Extra Grace This should really be at the top of this list. I can’t speak for other grievers, but the most inappropriate things flew out of my mouth the first month — especially at the funeral. I think I told everyone in the condolences line (is that what it’s called?) that my husband’s funeral was the best funeral EVER! (Seriously?!) Sorry about that — and also probably my bad breath. There are so many more ways you can bless your grieving people. These are just some of the ways. The traditional ways are still beautiful, loving and helpful methods too, so don’t feel badly if that’s what you do. But don’t we always wonder how we can help someone that’s hurting in real, tangible and even more useful ways? The things I found ridiculously helpful may not resonate the same way with another person. Grief is so tricky, isn’t it?! Just do your best. We grievers can give extra grace too. And if we don’t, forgive us. We don’t mean it. 13. Prayer Prayer deserves a huge shout-out. Sometimes that’s the best thing to say. “I’m so sorry and I’m praying for you.” But mean it. Nothing is more powerful than prayer…paired with a hug or shared cry…and maybe some chocolate. Because after a few weeks, food doesn’t taste like cardboard anymore and chocolate becomes necessary. Showing up, in whatever way you can is what really matters most. If you know someone hurting after loss, just show up in the ways you’re most equipped and realize it’s going to be awkward. Awkward is ok — it’s just part of it, so please don’t let it stop you. There’s a place for everyone at the grief table; the Kleenex givers, the huggers AND the casserole makers. ### A version of this story was originally published at www.extragracerequired.com on 9/21/16. ", "title": "13 Awkward (But Useful) Ways To Help Your Grieving Friend", "sentences": [{"c851": "13 Awkward (But Useful) Ways To Help Your Grieving Friend"}, {"9eca": "The first weeks after losing my husband are a total blur. I sort of remember there was food and lots of hugging visitors. Unfortunately most of the faces and their gifts are swirled up in the tsunami that was my grief and I don’t remember much of it. It was so primal those first weeks; there really wasn’t much capacity for permanent recall."}, {"fc9f": "Over time, I’ve regained a few of the brain cells no longer preoccupied with mere survival. I’ve found lists of what people brought and can now remember extraordinary ways people showed up to love us. I can’t begin to name all the things, but there are a few rock star grief goodies that stand out. Helpful things people gave, said or did that were extra useful, even if I didn’t realize it at the time. Most of these things came from people who have walked through their own hell."}, {"d67c": "Grief makes us amazing comforters and helpers if we let it. I could immediately tell who had experienced great loss in their lives by the things they did or said."}, {"6d62": "Their words and gifts helped in ways beyond the comfort of feeling loved. They were often ordinary and usually practical. And they were things I’d usually never considered before. Flower-givers, casserole-makers and card-senders are equally important, don’t get me wrong, but I’m going to share some less than obvious ways you can help your grieving friends."}, {"186c": "The tricky thing is, grieving people are so weird. It’s such an individual thing — what we need, what we want, how we feel — all so different from one another and also likely to change in the blink of an eye. It can be really hard to know what to do, so people often tiptoe around, feeling helpless. They often say, “Let me know if there’s anything I can do.”"}, {"0905": "I’ve said it myself to grieving friends and family, but I will rephrase my condolences from now on, because now I know. The truth is, I wasn’t able to think about what I needed from all of the helpers offering their assistance the first month. And by the time I had regained half a brain, most of the helpers were gone."}, {"2525": "As it turns out, grief lasts longer than sympathy — way longer."}, {"623f": "I feel bad for all the people who wanted to help right away because I didn’t know what I needed. I don’t blame them for moving on when I wasn’t able to give them instructions. I mean how many times should they need to ask? I would’ve moved on too….before. But now, because grief has changed me, I’ve learned a few things."}, {"51ef": "If you’re a friend to someone who’s experiencing loss and you’re just not sure what to say or do, here’s a list of 13 ideas:"}, {"191d": "My favorites involved lovely, often funny stories about my husband. Sure, they made me cry, but the personal stories brought me comfort. Realizing people actually knew my husband and would miss him too was reassuring. Plus they provided more memories I could call upon later."}, {"193a": "2. Gift cards to restaurants"}, {"d15d": "It was almost three months before I could do more than prepare a bowl of cereal or toast for my family, and even that felt overwhelming. The freezer was bursting at the seams but defrosting things and turning on the oven? More than I could handle."}, {"69fc": "3. Paper goods"}, {"7021": "Toilet paper, paper plates, paper towels, Kleenex, napkins, food storage bags, etc. There’s lots of people, and even more food when someone dies. There’s no time for doing dishes and not enough Tupperware in the cupboard to handle it all. And also, who has time to run to the store for toilet paper when you’re grieving? Plus, there are people at the store and they might ask how you’re doing and no. Just NO to that for a while. Too much."}, {"f65f": "4. Breath mints"}, {"245b": "Do you know what happens when you cry a lot and are running on emotional fumes? Bad breath, that’s what. I honestly don’t even know if I brushed my teeth those first weeks, which is totally gross, but who knows? It’s a grief mystery. All of the hugging and having to talk close-up makes this a gift that keeps on giving."}, {"94e8": "5. Postage stamps"}, {"3109": "I received a few sympathy cards containing stamps. Thank you! Because running out to buy a stamp was a tiny bit not even on my priority list. These same beautiful people usually wrote their name and address and what they gave inside the card (so I didn’t have to!) and also gave me a free pass on sending them a thank you."}, {"dec7": "6. Less talk, more listen"}, {"d286": "Listening is probably the most underappreciated gift, yet one of the most valuable. It’s especially an excellent choice when you’re just not sure what to say. Don’t feel bad, most people don’t. It’s just as awkward for you as it is for me."}, {"1144": "7. Things to occupy the kids"}, {"fffb": "Books, toys, craft kits, Legos, board games, movie theater gift cards — all of these types of things helped give my kids something to do while their Mom was distracted and unavailable. It’s awkward for kids to have a bunch of adults invade their house when they’re craving a sliver of “normal.”"}, {"b69a": "8. Things kids will actually eat"}, {"8d99": "Granola bars, cereal, juice boxes, Lunchables, fruit, frozen waffles, etc. The truth is, kids just don’t appreciate a green bean casserole. They did, however, eat up the kid-friendly food that was delivered. And that, in turn, helped me. When my son asked me one evening, “Mom, are you going to feed us tonight?” (don’t judge — grief is hard), I had things I could feed them that didn’t require thought."}, {"2c19": "9. Gift cards for retail therapy"}, {"0022": "Sometimes the greatest gifts aren’t practical gifts. It took many, many weeks before this was fully appreciated, but it turns out when you’re ready to take that first step forward out of grief, a new outfit really helps."}, {"2486": "10. Rescuing the kids"}, {"da52": "If you’re close enough to the family, rescuing the kids from grief-central is so kind and gives them something else to think about for a minute. Taking them for a walk, to a movie, playing with them somewhere other than where all the grief is happening is an amazing gift. It also eased my guilt about not spending time with them because I had to be on the phone handling post-death details."}, {"8cda": "11. Touch base regularly"}, {"5c10": "I have one friend who set an alarm on her phone to remind her to check-in with me via text message every day. It’s not as frequent now, but she’s still checking in. Some days I had the energy to reply, some days I didn’t, but every time I appreciated knowing someone was still thinking about me. It took less energy than a phone call too, which I appreciated. And for the love, please don’t stop doing this after a few months have passed. Do it a year or two later too!"}, {"9779": "12. Extra Grace"}, {"83c2": "This should really be at the top of this list. I can’t speak for other grievers, but the most inappropriate things flew out of my mouth the first month — especially at the funeral. I think I told everyone in the condolences line (is that what it’s called?) that my husband’s funeral was the best funeral EVER! (Seriously?!) Sorry about that — and also probably my bad breath."}, {"3472": "There are so many more ways you can bless your grieving people. These are just some of the ways. The traditional ways are still beautiful, loving and helpful methods too, so don’t feel badly if that’s what you do. But don’t we always wonder how we can help someone that’s hurting in real, tangible and even more useful ways? The things I found ridiculously helpful may not resonate the same way with another person. Grief is so tricky, isn’t it?! Just do your best. We grievers can give extra grace too. And if we don’t, forgive us. We don’t mean it."}, {"a2ae": "13. Prayer"}, {"a615": "Prayer deserves a huge shout-out. Sometimes that’s the best thing to say. “I’m so sorry and I’m praying for you.” But mean it."}, {"e037": "Nothing is more powerful than prayer…paired with a hug or shared cry…and maybe some chocolate. Because after a few weeks, food doesn’t taste like cardboard anymore and chocolate becomes necessary."}, {"049e": "Showing up, in whatever way you can is what really matters most. If you know someone hurting after loss, just show up in the ways you’re most equipped and realize it’s going to be awkward. Awkward is ok — it’s just part of it, so please don’t let it stop you. There’s a place for everyone at the grief table; the Kleenex givers, the huggers AND the casserole makers."}, {"c434": "###"}, {"c97c": "A version of this story was originally published at www.extragracerequired.com on 9/21/16."}], "child": "1702_1"}