{"name": "1704", "parent": "", "content": "My Brother the Beluga How my autistic brother taught me to embrace the unpredictable. “Ethan!!!” My mom screamed. Once again, my brother was nowhere to be found. We were frantically splashing in the bay at my grandparents’ beach house, searching for Ethan who had disappeared into the murky, brown water. He has always had a talent for holding his breath, but on this occasion, he stayed underneath the nearly opaque, algae ridden water for an eerily long time. I was not worried. This was a common occurrence when I was younger. The sun was setting behind the jetty, burning my eyes with its red-hot glare, and the salty water was starting to irritate my sunburn. I was ready to go inside. Despite this, I was screaming and searching for Ethan right along side my mother. A struggling wind surfer made his way toward us, his sail drooping from the lack of breeze as he dragged his board deeper into the water. We probably looked insane with our arms flailing and our voices echoing in the open waters, but he seemed undeterred by our yelling, and ignored us. He looked flustered as he stood thigh deep in the water, muddling with a rented wind surfboard that would obviously not function on this breezeless summer day. Suddenly, his board leaned almost to the point of tipping, followed by violent shaking and water spraying in every direction. Very gracefully, a little white butt emerged from the water and slid right onto the front of the board like a beached beluga whale. My mother and I stopped screaming and looked at the man as he looked back at us, all of our mouths gaping and eyes wide. My mother waded with urgency through the water and grabbed my naked brother by the wrist, pulling him off of the man’s board. This poor guy — he was speechless. I almost felt bad for him; however, I was laughing too hard to really care at that point. At the time, I was just picturing an old, crusty fisherman reeling in my brother’s abandoned swim trunks and mistaking them for the dinner he was hoping to catch for him and his wife. My mother, being an adult, had to deal with this awkward situation, because you can’t just let something like this go unexplained. Slightly embarrassed, yet not really phased, she said in a perfectly confident and steady tone, “Hey, um, have you ever wind surfed before? Seems like you might be struggling a bit,” before we ran inside the house laughing like children, dragging Ethan as we went. Growing up with an autistic brother made my childhood so incredibly fun, unpredictable, and exciting. I mean, what 10 year old wouldn’t want to come home from school to find her brother eating a box of crayons while pissing off the top of the banister, discover he had cracked eggs all over the kitchen floor, or witness he had thrown his socks on to the neighbors deck again. This was all a blast in my opinion — that is until mom found out what naughty things he had been up to and screamed at my siblings and me for watching and laughing. But, being a devious child by nature, that part was kind of exhilarating as well. Obviously, there are downfalls to having an autistic brother. It is incredibly frustrating when Ethan puts my make up and toothbrushes in the toilet and his constant screaming and noises can drive the whole family crazy. But these things did not bother me very much growing up, and they usually still don’t now (unless he touches my Stila liquid black eyeliner). There are even some perks. Now that I am living in my own apartment, I am always equipped with a spare box of toothbrushes out of habit, which comes in handy more often than you would think. I am not even embarrassed when we take him on family outings or when we have company over to our house. Pride wasn’t really something I was raised to have. When he is freaking out at the airport because crowds of people make him uncomfortable, my sister and I sing to him. When he takes his pants off at the public pool, we laugh with him while my siblings and I flash our butts. When he used to shriek like a hyena out of the car window in the school carpool lane, I yelled back. I’ve always wondered if I would be stuck up and ignorant like many of the other rich suburban dwellers in my hometown if I had been born into a normal family with a normal brother. Random people in the grocery store, teachers, and even other family members used to praise me for being so kind to my brother with “special needs,” and being brave enough to take him out in public. I’ve always hated that term, “special needs.” He’s autistic, he’s my brother, and I love him unconditionally, so why am I such a saint? Also, why is he special? Can’t we all just have fun, piss in the neighbors yard, scare the kids at the park, wear our pants on our heads, and put our shirts in the toilet? It is very strange, but the opinions of others hardly register with me. Obviously, I know Ethan is not normal, and I know that at times he can be a spectacle, but that juvenile naivety still resonates within me. Ethan came into my life when I was 5 years old. When he was diagnosed, I never felt any remorse or sorrow. That was just how things were, and that’s how they still are. It’s not like he is going to die, he just can’t talk: he is my eternal baby. There have only been a few occasions that I have understood how hard it can be to watch the person you love offend and frighten people so severely. It wrenched my heart when that ignorant flight attendant tried to kick my family off a plane; when the neighbors called the cops for public display of nudity; when the man who now serves as our president mocked disabled people; and when a family at the beach harassed my family and told us we had failed to raise Ethan properly. Whether I’m holding Ethan as he’s having a seizure, wrestling his clothes onto him, cleaning his drool and spit off me, or wiping his ass, I love him. I love him more than I have ever loved anything else, regardless of anyone’s opinion. Now, don’t get all choked up on me, and don’t tell me I’m an incredible person because that is not what this is about. Just see my beautiful beluga whale of a brother like I see him and respect him for who he is — that is all I ask. ", "title": "My Brother the Beluga", "sentences": [{"62cc": "My Brother the Beluga"}, {"13d9": "How my autistic brother taught me to embrace the unpredictable."}, {"ed7c": "“Ethan!!!” My mom screamed. Once again, my brother was nowhere to be found. We were frantically splashing in the bay at my grandparents’ beach house, searching for Ethan who had disappeared into the murky, brown water. He has always had a talent for holding his breath, but on this occasion, he stayed underneath the nearly opaque, algae ridden water for an eerily long time. I was not worried. This was a common occurrence when I was younger. The sun was setting behind the jetty, burning my eyes with its red-hot glare, and the salty water was starting to irritate my sunburn. I was ready to go inside. Despite this, I was screaming and searching for Ethan right along side my mother."}, {"d427": "A struggling wind surfer made his way toward us, his sail drooping from the lack of breeze as he dragged his board deeper into the water. We probably looked insane with our arms flailing and our voices echoing in the open waters, but he seemed undeterred by our yelling, and ignored us. He looked flustered as he stood thigh deep in the water, muddling with a rented wind surfboard that would obviously not function on this breezeless summer day. Suddenly, his board leaned almost to the point of tipping, followed by violent shaking and water spraying in every direction. Very gracefully, a little white butt emerged from the water and slid right onto the front of the board like a beached beluga whale. My mother and I stopped screaming and looked at the man as he looked back at us, all of our mouths gaping and eyes wide."}, {"7b5a": "My mother waded with urgency through the water and grabbed my naked brother by the wrist, pulling him off of the man’s board. This poor guy — he was speechless. I almost felt bad for him; however, I was laughing too hard to really care at that point. At the time, I was just picturing an old, crusty fisherman reeling in my brother’s abandoned swim trunks and mistaking them for the dinner he was hoping to catch for him and his wife."}, {"9b3d": "My mother, being an adult, had to deal with this awkward situation, because you can’t just let something like this go unexplained. Slightly embarrassed, yet not really phased, she said in a perfectly confident and steady tone, “Hey, um, have you ever wind surfed before? Seems like you might be struggling a bit,” before we ran inside the house laughing like children, dragging Ethan as we went."}, {"4e3f": "Growing up with an autistic brother made my childhood so incredibly fun, unpredictable, and exciting. I mean, what 10 year old wouldn’t want to come home from school to find her brother eating a box of crayons while pissing off the top of the banister, discover he had cracked eggs all over the kitchen floor, or witness he had thrown his socks on to the neighbors deck again. This was all a blast in my opinion — that is until mom found out what naughty things he had been up to and screamed at my siblings and me for watching and laughing. But, being a devious child by nature, that part was kind of exhilarating as well."}, {"aa1b": "Obviously, there are downfalls to having an autistic brother. It is incredibly frustrating when Ethan puts my make up and toothbrushes in the toilet and his constant screaming and noises can drive the whole family crazy. But these things did not bother me very much growing up, and they usually still don’t now (unless he touches my Stila liquid black eyeliner). There are even some perks. Now that I am living in my own apartment, I am always equipped with a spare box of toothbrushes out of habit, which comes in handy more often than you would think."}, {"bbb9": "I am not even embarrassed when we take him on family outings or when we have company over to our house. Pride wasn’t really something I was raised to have. When he is freaking out at the airport because crowds of people make him uncomfortable, my sister and I sing to him. When he takes his pants off at the public pool, we laugh with him while my siblings and I flash our butts. When he used to shriek like a hyena out of the car window in the school carpool lane, I yelled back."}, {"5ed9": "I’ve always wondered if I would be stuck up and ignorant like many of the other rich suburban dwellers in my hometown if I had been born into a normal family with a normal brother. Random people in the grocery store, teachers, and even other family members used to praise me for being so kind to my brother with “special needs,” and being brave enough to take him out in public. I’ve always hated that term, “special needs.” He’s autistic, he’s my brother, and I love him unconditionally, so why am I such a saint? Also, why is he special? Can’t we all just have fun, piss in the neighbors yard, scare the kids at the park, wear our pants on our heads, and put our shirts in the toilet?"}, {"4b1e": "It is very strange, but the opinions of others hardly register with me. Obviously, I know Ethan is not normal, and I know that at times he can be a spectacle, but that juvenile naivety still resonates within me. Ethan came into my life when I was 5 years old. When he was diagnosed, I never felt any remorse or sorrow. That was just how things were, and that’s how they still are. It’s not like he is going to die, he just can’t talk: he is my eternal baby. There have only been a few occasions that I have understood how hard it can be to watch the person you love offend and frighten people so severely. It wrenched my heart when that ignorant flight attendant tried to kick my family off a plane; when the neighbors called the cops for public display of nudity; when the man who now serves as our president mocked disabled people; and when a family at the beach harassed my family and told us we had failed to raise Ethan properly."}, {"f19a": "Whether I’m holding Ethan as he’s having a seizure, wrestling his clothes onto him, cleaning his drool and spit off me, or wiping his ass, I love him. I love him more than I have ever loved anything else, regardless of anyone’s opinion. Now, don’t get all choked up on me, and don’t tell me I’m an incredible person because that is not what this is about. Just see my beautiful beluga whale of a brother like I see him and respect him for who he is — that is all I ask."}], "child": "1704_1\t1704_2\t1704_3"}