{"name": "1706", "parent": "", "content": "The Father Of Mindfulness on What Mindfulness Has Become An interview with Jon Kabat-Zinn, creator of Mindfulness-Based Stress Reduction. Jon Kabat-Zinn. If any one person has helped shepherd the word “mindfulness” into the American mainstream and make meditation the kind of thing that scientists and doctors take seriously, it’s Jon Kabat-Zinn. Back in 1979, he introduced the world to what would become Mindfulness-Based Stress Reduction (MBSR), an eight-week course first developed to help people with pain management. It has since been shown to help with depression, anxiety and a host of clinical and nonclinical issues, down to the inflammation of neurons themselves. Kabat-Zinn also helped found the Stress Reduction Clinic at the University of Massachusetts Medical School, where much of the original clinical research on mindfulness interventions was originally carried out; it’s since grown into the Center for Mindfulness in Medicine, Health Care and Society. Today, a search for MBSR leads to more than 22,000 results on Google Scholar. Kabat-Zinn has also authored ten books. His most famous, Wherever You Go, There You Are, has sold more than a million copies since it was first published in 1995. In the nearly four decades since MBSR made its debut, more than 24,000 people have completed the course at UMass alone, and popular culture has begun to absorb the practice’s fundamental point: If you attend to your mind, you can change your life. Thrive Global spoke with Kabat-Zinn about the mindfulness revolution that he helped kickstart, the pros and cons of mindfulness becoming mainstream and if it’s even possible to be mindful with your phone on. The below interview has edited for length and clarity. Thrive Global: Did you ever expect mindfulness to become so mainstream, such an everyday thing? Jon Kabat-Zinn: I did, actually, have a vision in 1979 that came to be true: That [mindfulness] would have a tremendous impact if the science said that it had been clinically successful at the medical center where I was starting MBSR. Then, because of its impact on mainstream medicine and neuroscience and health care, it would move out into society. The whole idea was to transform and heal the world, and I know that sounds arrogant, but that was, in fact, the sense of it. But mindfulness is something at the heart of Buddhist practice — it’s not like I made up “mindfulness” in 1979. TG: This gets to what’s been called “McMindfulness,” the fashionable consumer culture that’s grown around the so-called “Mindfulness Movement.” JKZ: One of the byproducts of rapid spread of dharma wisdom in the world is that people will latch onto anything that’s hot and try to make a buck off of it, use it for advertising purposes to sell more jewelry or hamburgers. That’s not necessarily entirely bad. It’s a sign that [mindfulness] is actually going through society. In terms of clinical work — MBSR and mindfulness-based cognitive therapy — the general sense is that the level of depth and fidelity to deeply embodied practice is enormous. I am not worried about the robust health of mindfulness in the world at all. TG: Is it possible to have a more mindful relationship with technology? JKZ: You can be more mindful of how addicted you are, but unless you impose behaviors on yourself, it’s like heroin. It’s not like you can live without technology — I own an iPhone. But you can’t live with it unless you find some kind of way to not lose yourself in digital reality to the point where you forget that your body is analog. It’s a matter of not being there for an experience because you were texting about it or tweeting about it. That can happen when you have a baby. You’re not there for having a baby because you’re sharing [the experience] so fast. You want to get feedback about what you said so much that you miss your own analog experience. That would be a tragedy. My son and I teach retreats for Silicon Valley leaders, and it’s largely with the hope that the people who brought us this technology might recognize how wonderful and how simultaneously harmful and distracting and addicting it is, and find ways to utilize and transform it so we don’t just create a deeper and deeper hole for ourselves. The biggest distractor is not your iPhone — it’s your own mind. You can’t stop your mind from secreting thoughts, but what you can do is not be caught by them. That’s an art form and that’s what mindfulness training is about. TG: Is what you do “secular mindfulness”? JKZ: I assiduously avoid the word secular. As soon as you say secular mindfulness, you’re abstracting the sacred out of it. TG: The sacred? JKZ: It’s not really about the breathing, or the object of attention, but it’s the attending itself. We are so seduced by thinking and emotion and we don’t realize that awareness is at least as powerful of a function. It can hold any emotion, no matter how destructive, any thought, no matter how gigantic. That’s where the transformative power lies, that you’re adding a measure of deep introspection and perception to ordinary experience. And then realizing: There is no such thing as ‘ordinary experience.’ Everything is extraordinary. TG: Seeing the extraordinary in the everyday is part of the path. JKZ: [Mindfulness represents] a new way of being in relationship with yourself, one that’s catalytic of a new way of ongoing learning and healing. The transformation comes with the understanding that you are not your thoughts about yourself. You are far far bigger, more nuanced and multidimensional than who you think you are, the story of you. In some sense, it’s befriending yourself. You don’t have to meditate in a cave for 50 years; you just need to realize that. These meditative practices are really meant to recognize and learn to inhabit that domain of being, as opposed to fragment it into the sacred-secular divide, the mind-body divide, or the self-other divide. TG: But is anything lost from the mainstreaming process? JKZ: The challenge is when you take something that’s thousands of years old, that’s really grounded in very deep wisdom, how do you bring it into the mainstream without destroying it in the process? It’s inevitable that some people might say, you’re decontextualizing mindfulness. What would be lost are a bunch of amazing things from ancient religions and traditions that are very different if you’re in Japan, Thailand, Vietnam or Tibet. They’re different, but tributaries within the same river. If you’re a Buddhist, then an enormous amount of the beauty in the culture would be lost. But Buddhism is never about ‘Buddhism’ [as a religion]. It’s about suffering and recognizing the causes of suffering and the potential for liberation from suffering. I could make the argument, and of course I do all the time, that if there were something lost in taking some element of meditative practice at the core of the Buddha’s original life and trying to bring it into the mainstream for anybody and everybody, the potential benefits far outweigh the costs. MBSR is only eight weeks long and it’s meant to be a launching pad. The Buddha wasn’t a Buddhist. A religion grew around his community. His realizations were universal realizations about suffering, the nature of suffering and the nature of the human mind. ", "title": "The Father Of Mindfulness on What Mindfulness Has Become", "sentences": [{"8341": "The Father Of Mindfulness on What Mindfulness Has Become"}, {"e2eb": "An interview with Jon Kabat-Zinn, creator of Mindfulness-Based Stress Reduction."}, {"9dad": "Jon Kabat-Zinn."}, {"c691": "If any one person has helped shepherd the word “mindfulness” into the American mainstream and make meditation the kind of thing that scientists and doctors take seriously, it’s Jon Kabat-Zinn. Back in 1979, he introduced the world to what would become Mindfulness-Based Stress Reduction (MBSR), an eight-week course first developed to help people with pain management. It has since been shown to help with depression, anxiety and a host of clinical and nonclinical issues, down to the inflammation of neurons themselves."}, {"59f5": "Kabat-Zinn also helped found the Stress Reduction Clinic at the University of Massachusetts Medical School, where much of the original clinical research on mindfulness interventions was originally carried out; it’s since grown into the Center for Mindfulness in Medicine, Health Care and Society. Today, a search for MBSR leads to more than 22,000 results on Google Scholar. Kabat-Zinn has also authored ten books. His most famous, Wherever You Go, There You Are, has sold more than a million copies since it was first published in 1995. In the nearly four decades since MBSR made its debut, more than 24,000 people have completed the course at UMass alone, and popular culture has begun to absorb the practice’s fundamental point: If you attend to your mind, you can change your life."}, {"11c6": "Thrive Global spoke with Kabat-Zinn about the mindfulness revolution that he helped kickstart, the pros and cons of mindfulness becoming mainstream and if it’s even possible to be mindful with your phone on. The below interview has edited for length and clarity."}, {"20a9": "Thrive Global: Did you ever expect mindfulness to become so mainstream, such an everyday thing?"}, {"98d4": "Jon Kabat-Zinn: I did, actually, have a vision in 1979 that came to be true: That [mindfulness] would have a tremendous impact if the science said that it had been clinically successful at the medical center where I was starting MBSR. Then, because of its impact on mainstream medicine and neuroscience and health care, it would move out into society."}, {"7a65": "The whole idea was to transform and heal the world, and I know that sounds arrogant, but that was, in fact, the sense of it. But mindfulness is something at the heart of Buddhist practice — it’s not like I made up “mindfulness” in 1979."}, {"77e9": "TG: This gets to what’s been called “McMindfulness,” the fashionable consumer culture that’s grown around the so-called “Mindfulness Movement.”"}, {"ce48": "JKZ: One of the byproducts of rapid spread of dharma wisdom in the world is that people will latch onto anything that’s hot and try to make a buck off of it, use it for advertising purposes to sell more jewelry or hamburgers. That’s not necessarily entirely bad. It’s a sign that [mindfulness] is actually going through society."}, {"bb89": "In terms of clinical work — MBSR and mindfulness-based cognitive therapy — the general sense is that the level of depth and fidelity to deeply embodied practice is enormous. I am not worried about the robust health of mindfulness in the world at all."}, {"8dc2": "TG: Is it possible to have a more mindful relationship with technology?"}, {"d0a4": "JKZ: You can be more mindful of how addicted you are, but unless you impose behaviors on yourself, it’s like heroin. It’s not like you can live without technology — I own an iPhone. But you can’t live with it unless you find some kind of way to not lose yourself in digital reality to the point where you forget that your body is analog."}, {"bb9c": "It’s a matter of not being there for an experience because you were texting about it or tweeting about it. That can happen when you have a baby. You’re not there for having a baby because you’re sharing [the experience] so fast. You want to get feedback about what you said so much that you miss your own analog experience. That would be a tragedy."}, {"6cea": "My son and I teach retreats for Silicon Valley leaders, and it’s largely with the hope that the people who brought us this technology might recognize how wonderful and how simultaneously harmful and distracting and addicting it is, and find ways to utilize and transform it so we don’t just create a deeper and deeper hole for ourselves."}, {"4314": "The biggest distractor is not your iPhone — it’s your own mind. You can’t stop your mind from secreting thoughts, but what you can do is not be caught by them. That’s an art form and that’s what mindfulness training is about."}, {"2c53": "TG: Is what you do “secular mindfulness”?"}, {"3be3": "JKZ: I assiduously avoid the word secular. As soon as you say secular mindfulness, you’re abstracting the sacred out of it."}, {"96d4": "TG: The sacred?"}, {"2cc7": "JKZ: It’s not really about the breathing, or the object of attention, but it’s the attending itself. We are so seduced by thinking and emotion and we don’t realize that awareness is at least as powerful of a function. It can hold any emotion, no matter how destructive, any thought, no matter how gigantic."}, {"87b7": "That’s where the transformative power lies, that you’re adding a measure of deep introspection and perception to ordinary experience. And then realizing: There is no such thing as ‘ordinary experience.’ Everything is extraordinary."}, {"b1a1": "TG: Seeing the extraordinary in the everyday is part of the path."}, {"5567": "JKZ: [Mindfulness represents] a new way of being in relationship with yourself, one that’s catalytic of a new way of ongoing learning and healing. The transformation comes with the understanding that you are not your thoughts about yourself. You are far far bigger, more nuanced and multidimensional than who you think you are, the story of you."}, {"186a": "In some sense, it’s befriending yourself. You don’t have to meditate in a cave for 50 years; you just need to realize that. These meditative practices are really meant to recognize and learn to inhabit that domain of being, as opposed to fragment it into the sacred-secular divide, the mind-body divide, or the self-other divide."}, {"35b9": "TG: But is anything lost from the mainstreaming process?"}, {"8c09": "JKZ: The challenge is when you take something that’s thousands of years old, that’s really grounded in very deep wisdom, how do you bring it into the mainstream without destroying it in the process?"}, {"5933": "It’s inevitable that some people might say, you’re decontextualizing mindfulness. What would be lost are a bunch of amazing things from ancient religions and traditions that are very different if you’re in Japan, Thailand, Vietnam or Tibet. They’re different, but tributaries within the same river. If you’re a Buddhist, then an enormous amount of the beauty in the culture would be lost. But Buddhism is never about ‘Buddhism’ [as a religion]. It’s about suffering and recognizing the causes of suffering and the potential for liberation from suffering."}, {"c04a": "I could make the argument, and of course I do all the time, that if there were something lost in taking some element of meditative practice at the core of the Buddha’s original life and trying to bring it into the mainstream for anybody and everybody, the potential benefits far outweigh the costs. MBSR is only eight weeks long and it’s meant to be a launching pad."}, {"0e8c": "The Buddha wasn’t a Buddhist. A religion grew around his community. His realizations were universal realizations about suffering, the nature of suffering and the nature of the human mind."}], "child": "1706_1\t1706_2\t1706_3\t1706_4\t1706_5"}