{"name": "1708", "parent": "", "content": "Everything I’ve ever learned about everything (in less than 300 words) People are fundamentally good, though it may often seem otherwise. “Life is easy” and “life is hard” are equally true statements. Travel is probably overrated. Expanding your comfort zone isn’t. The longer you wait to do something, the more difficult it becomes. Exercise and proper nutrition are technically optional, but you will suffer without them. Life, the universe, and the meaning of it all are troublesome subjects; questioning them never fails to summon an unpleasant sensation. Success mostly comes to those who work for it. Drugs are fun but it’s generally unwise to do them. Most things seem silly if you think about them for a while. Gratitude is the only reliable source of fulfillment. Complaining is typically a waste of time. People, ideas, and things don’t have to be good to be popular. They don’t have to make sense either. Humans create meaning for everything. Happy humans create happy meanings. Cynicism is weakness. Everybody has split personalities. It’s unhealthy to avoid being alone. It’s also unhealthy to be alone too much. You can’t choose your family but you can choose to love them. Who you spend time with matters. Everybody is interesting if you give them the chance to be. It’s wise to be skeptical of those who will profit from your actions or beliefs. The older you get, the faster the time goes. If it’s a cliché, it’s probably true. Mistakes and misfortunes are inevitable. The spirit is strong. Your resilience will surprise you. The imagination is a superpower. Some people abuse it. Art is magic. All we can do is the best we can do. https://www.instagram.com/selfactual/ If you enjoyed this piece, please hit the ❤ button to support the author. Note from the author: This title proved to be a fun writing prompt. If you choose to write your own “Everything I’ve ever learned about everything (in less than 300 words)”, I’d love to read yours. Patrick Wiltse is a writer and publisher from Ontario, Canada. You can read more of his writing and learn awkwardly intimate details about his life by visiting his blog, selfactual.com ", "title": "Everything I’ve ever learned about everything (in less than 300 words)", "sentences": [{"b0dd": "Everything I’ve ever learned about everything (in less than 300 words)"}, {"9d84": "People are fundamentally good, though it may often seem otherwise."}, {"ac7a": "“Life is easy” and “life is hard” are equally true statements."}, {"3a0d": "Travel is probably overrated. Expanding your comfort zone isn’t."}, {"9e8a": "The longer you wait to do something, the more difficult it becomes."}, {"c161": "Exercise and proper nutrition are technically optional, but you will suffer without them."}, {"d420": "Life, the universe, and the meaning of it all are troublesome subjects; questioning them never fails to summon an unpleasant sensation."}, {"7458": "Success mostly comes to those who work for it."}, {"4688": "Drugs are fun but it’s generally unwise to do them."}, {"c2b0": "Most things seem silly if you think about them for a while."}, {"2223": "Gratitude is the only reliable source of fulfillment."}, {"674d": "Complaining is typically a waste of time."}, {"108d": "People, ideas, and things don’t have to be good to be popular. They don’t have to make sense either."}, {"f4bf": "Humans create meaning for everything. Happy humans create happy meanings."}, {"ceaf": "Cynicism is weakness."}, {"ad7c": "Everybody has split personalities."}, {"9425": "It’s unhealthy to avoid being alone. It’s also unhealthy to be alone too much."}, {"1a3c": "You can’t choose your family but you can choose to love them."}, {"b4a6": "Who you spend time with matters."}, {"6c33": "Everybody is interesting if you give them the chance to be."}, {"3fdd": "It’s wise to be skeptical of those who will profit from your actions or beliefs."}, {"6699": "The older you get, the faster the time goes."}, {"e229": "If it’s a cliché, it’s probably true."}, {"4ebf": "Mistakes and misfortunes are inevitable."}, {"5efe": "The spirit is strong. Your resilience will surprise you."}, {"6ba2": "The imagination is a superpower. Some people abuse it."}, {"edbb": "Art is magic."}, {"63c1": "All we can do is the best we can do."}, {"175f": "https://www.instagram.com/selfactual/"}, {"0320": "If you enjoyed this piece, please hit the ❤ button to support the author."}, {"5987": "Note from the author: This title proved to be a fun writing prompt. If you choose to write your own “Everything I’ve ever learned about everything (in less than 300 words)”, I’d love to read yours."}, {"9825": "Patrick Wiltse is a writer and publisher from Ontario, Canada."}, {"add6": "You can read more of his writing and learn awkwardly intimate details about his life by visiting his blog, selfactual.com"}], "child": "1708_1\t1708_2\t1708_3\t1708_4\t1708_5\t1708_6\t1708_7\t1708_8\t1708_9\t1708_10\t1708_11\t1708_12\t1708_13\t1708_14\t1708_15\t1708_16\t1708_17\t1708_18\t1708_19\t1708_20\t1708_21\t1708_22\t1708_231708_1\t1708_2\t1708_3\t1708_4\t1708_5\t1708_6\t1708_7\t1708_8\t1708_9\t1708_10\t1708_11\t1708_12\t1708_13\t1708_14\t1708_15\t1708_16\t1708_17\t1708_18\t1708_19\t1708_20\t1708_21\t1708_22\t1708_231708_1\t1708_2\t1708_3\t1708_4\t1708_5\t1708_6\t1708_7\t1708_8\t1708_9\t1708_10\t1708_11\t1708_12\t1708_13\t1708_14\t1708_15\t1708_16\t1708_17\t1708_18\t1708_19\t1708_20\t1708_21\t1708_22\t1708_231708_1\t1708_2\t1708_3\t1708_4\t1708_5\t1708_6\t1708_7\t1708_8\t1708_9\t1708_10\t1708_11\t1708_12\t1708_13\t1708_14\t1708_15\t1708_16\t1708_17\t1708_18\t1708_19\t1708_20\t1708_21\t1708_22\t1708_23"}