{"name": "1731", "parent": "", "content": "‘Release the Fear’ of [Not] Measuring Up and Share Your Light Image Licensed from Shutterstock “You’re imperfect, and you’re wired for struggle, but you are worthy of love and belonging.” ~Brené Brown I believe it is part of the human condition to want love and connection with others. For some of us this comes much more naturally and abundantly than it does for others. The universal connection we all share is that at some point along our life journey, there will come a time when our self-worth is on the table for questioning. I can clearly recall the first time my self-confidence was rocked. I was seven years old and full of energy, life, and good old-fashioned cheer. I spent endless summer hours skipping rope, riding bikes, playing tag with the neighborhood kids, and had recently discovered the art of performing cartwheels on the back lawn — what a rush! At the time we lived in a duplex. My mom was a single mom. My dad passed away when I was only six months old, and my brother Eric was two years old. Of course I didn’t realize it at the time, that while my mom was the most amazing mom around, I didn’t have a male role model in my life and must have really felt that loss. My mom and I still share a giggle over a story from when I was two years old. I very eagerly staggered out into the street during a holiday parade to profess my love or “wuv” for the policemen and firemen as they passed by. It just so happened we had a police officer living next door to us. It was a warm summer evening and he had guests out on his deck enjoying a barbeque. I also just so happened to be outside once again, perfecting my cartwheel. I remember gearing up to showcase them my newly honed skill. I composed myself and very deliberately set off down our bumpy, sloped lawn toward their deck. I gave them one impeccable cartwheel after the other, without any break in between, until I reached the end of the lawn and the start of the blackberry bush. I turned to face them with a victory smile and a silent “ta-da!” but instead of receiving anticipated applause and approval, I was met with roars of laughter and a snicker: “Wow, what a showoff this one is!” I was instantly deflated and utterly crushed. I clearly remember feeling the heavy pit in my stomach, and the accompanying sting of tears and hurt I fought back as the heat rose from my belly to my cheeks. At seven years old I stood there with my heart wide open, looking for approval only to feel squashed and ashamed. Fast-forward another thirty-one years and it all sounds a bit silly to me now, yet somehow the hurt is still quick for me to recall. This was, of course, not the experience that taught me the great life lesson of expressing and honoring my worth as a human being. That came much later with far more extensive bruises, bumps, and lessons, but this memory is one that stands out to me because it was the first time I ever thought to myself “Maybe I am not good enough, and maybe I never will be.” I don’t believe there is a human out there that doesn’t have this inner child in them that yearns for the reassurance that they are okay. Most of us have had at least one experience somewhere along the line that has left the lingering question of whether or not we are good enough. I think we all carry these wounds around with us. Some of us face unthinkable things and suffer from much deeper wounds and fears than others. I guess the point is, at any given time we are surrounded by others that have felt insecure and unloved, that worry about being worthy of belonging and can relate to what may be one of our biggest fears. I just can’t help but think if we all gave ourselves permission to not be so hard on ourselves, or to each other, the ride could be a little gentler. When we come back to that place in life where our hearts are open, we are less likely to be so critical of others and of ourselves. The simple act of sharing a heartfelt smile with a stranger on the street, or praising a young child for being completely amazing by just being who they are, is empowering and contagious. When we loosen our grip on our fear of looking foolish or not measuring up, and instead share our light and love with others, the magic of life seems to naturally unfold. The best part is, we help give others the courage to do the same, to find their way back to remembering how totally awesome and worthy they are right now as they are. I should add that while I never did become a gifted gymnast, I will on occasion bust out my best cartwheel moves on the back lawn with my kids, or on the beach just because. Now I always follow it up with a “ta-da” and a pat on the back I deserve for purely being human. Hi, I’m Emily. Thanks for reading this post. If you like what you read — be sure to click recommend❤️ below. emilymadill.com Emily Madill is the author of 11 books in the area of self-development and empowerment, both for children and adults. Her newest title ‘Fall in Love with Your Life, One Week at a Time’ is now being offered as an E-Course. Fall in Love With Your Life, One Week at a Time by Emily Madill If you are interested in connecting to who you are on a deeper level, or if you would like to create a self-care and self-love practice — come on over and join our growing community within my E-Course, ‘Fall In Love With Your Life, One Week at a Time’. It is a chance to create your own life practice in a way that is meaningful to you. ❤️ Emily Madill’s E-Course, ‘Fall In Love With Your Life, One Week at a Time’. Sign-up For Emily’s Weekly Inspiration, Tips and Ideas for Loving the Life of Your Dreams ❤️ & Receive a FREE copy of Emily’s Guide to Self-Care Success. Sign up for Emily’s weekly Inspiration and Receive a Free copy of her guide to Self-Care Success Sign up for Emily’s weekly Inspiration and Receive a Free copy of her guide to Self-Care Success Fall in Love with Your Life, One Week at a Time Book Trailer Follow Emily Madill on Twitter Visit Emily Madill’s Facebook Page Originally published at tinybuddha.com ", "title": "‘Release the Fear’ of [Not] Measuring Up and Share Your Light", "sentences": [{"52e9": "‘Release the Fear’ of [Not] Measuring Up and Share Your Light"}, {"51b0": "Image Licensed from Shutterstock"}, {"421b": "“You’re imperfect, and you’re wired for struggle, but you are worthy of love and belonging.” ~Brené Brown"}, {"0291": "I believe it is part of the human condition to want love and connection with others. For some of us this comes much more naturally and abundantly than it does for others."}, {"c45a": "The universal connection we all share is that at some point along our life journey, there will come a time when our self-worth is on the table for questioning."}, {"1302": "I can clearly recall the first time my self-confidence was rocked. I was seven years old and full of energy, life, and good old-fashioned cheer."}, {"3050": "I spent endless summer hours skipping rope, riding bikes, playing tag with the neighborhood kids, and had recently discovered the art of performing cartwheels on the back lawn — what a rush!"}, {"7736": "At the time we lived in a duplex. My mom was a single mom. My dad passed away when I was only six months old, and my brother Eric was two years old."}, {"b338": "Of course I didn’t realize it at the time, that while my mom was the most amazing mom around, I didn’t have a male role model in my life and must have really felt that loss."}, {"c670": "My mom and I still share a giggle over a story from when I was two years old. I very eagerly staggered out into the street during a holiday parade to profess my love or “wuv” for the policemen and firemen as they passed by."}, {"0c0a": "It just so happened we had a police officer living next door to us. It was a warm summer evening and he had guests out on his deck enjoying a barbeque. I also just so happened to be outside once again, perfecting my cartwheel."}, {"da6b": "I remember gearing up to showcase them my newly honed skill. I composed myself and very deliberately set off down our bumpy, sloped lawn toward their deck."}, {"82a2": "I gave them one impeccable cartwheel after the other, without any break in between, until I reached the end of the lawn and the start of the blackberry bush."}, {"7a8b": "I turned to face them with a victory smile and a silent “ta-da!” but instead of receiving anticipated applause and approval, I was met with roars of laughter and a snicker: “Wow, what a showoff this one is!”"}, {"56dd": "I was instantly deflated and utterly crushed."}, {"23a9": "I clearly remember feeling the heavy pit in my stomach, and the accompanying sting of tears and hurt I fought back as the heat rose from my belly to my cheeks. At seven years old I stood there with my heart wide open, looking for approval only to feel squashed and ashamed."}, {"ea3b": "Fast-forward another thirty-one years and it all sounds a bit silly to me now, yet somehow the hurt is still quick for me to recall."}, {"1493": "This was, of course, not the experience that taught me the great life lesson of expressing and honoring my worth as a human being."}, {"8065": "That came much later with far more extensive bruises, bumps, and lessons, but this memory is one that stands out to me because it was the first time I ever thought to myself “Maybe I am not good enough, and maybe I never will be.”"}, {"522d": "I don’t believe there is a human out there that doesn’t have this inner child in them that yearns for the reassurance that they are okay. Most of us have had at least one experience somewhere along the line that has left the lingering question of whether or not we are good enough."}, {"40ff": "I think we all carry these wounds around with us. Some of us face unthinkable things and suffer from much deeper wounds and fears than others."}, {"faf6": "I guess the point is, at any given time we are surrounded by others that have felt insecure and unloved, that worry about being worthy of belonging and can relate to what may be one of our biggest fears."}, {"79e0": "I just can’t help but think if we all gave ourselves permission to not be so hard on ourselves, or to each other, the ride could be a little gentler. When we come back to that place in life where our hearts are open, we are less likely to be so critical of others and of ourselves."}, {"c2ab": "The simple act of sharing a heartfelt smile with a stranger on the street, or praising a young child for being completely amazing by just being who they are, is empowering and contagious."}, {"d6a5": "When we loosen our grip on our fear of looking foolish or not measuring up, and instead share our light and love with others, the magic of life seems to naturally unfold."}, {"b5de": "The best part is, we help give others the courage to do the same, to find their way back to remembering how totally awesome and worthy they are right now as they are."}, {"21cd": "I should add that while I never did become a gifted gymnast, I will on occasion bust out my best cartwheel moves on the back lawn with my kids, or on the beach just because. Now I always follow it up with a “ta-da” and a pat on the back I deserve for purely being human."}, {"a941": "Hi, I’m Emily. Thanks for reading this post. If you like what you read — be sure to click recommend❤️ below."}, {"586c": "emilymadill.com"}, {"7ee9": "Emily Madill is the author of 11 books in the area of self-development and empowerment, both for children and adults. Her newest title ‘Fall in Love with Your Life, One Week at a Time’ is now being offered as an E-Course."}, {"bb78": "Fall in Love With Your Life, One Week at a Time by Emily Madill"}, {"80ea": "If you are interested in connecting to who you are on a deeper level, or if you would like to create a self-care and self-love practice — come on over and join our growing community within my E-Course, ‘Fall In Love With Your Life, One Week at a Time’. It is a chance to create your own life practice in a way that is meaningful to you. ❤️"}, {"9d6e": "Emily Madill’s E-Course, ‘Fall In Love With Your Life, One Week at a Time’."}, {"7ca0": "Sign-up For Emily’s Weekly Inspiration, Tips and Ideas for Loving the Life of Your Dreams ❤️ & Receive a FREE copy of Emily’s Guide to Self-Care Success."}, {"4cd9": "Sign up for Emily’s weekly Inspiration and Receive a Free copy of her guide to Self-Care Success"}, {"ede6": "Sign up for Emily’s weekly Inspiration and Receive a Free copy of her guide to Self-Care Success"}, {"c2f9": "Fall in Love with Your Life, One Week at a Time Book Trailer"}, {"184f": "Follow Emily Madill on Twitter"}, {"e3b1": "Visit Emily Madill’s Facebook Page"}, {"f147": "Originally published at tinybuddha.com"}], "child": "1731_1\t1731_21731_1\t1731_2"}