{"name": "1732", "parent": "", "content": "The Power of (Your) Space How your surroundings can impact your thoughts, emotions and sense of self. Close your eyes and picture the hustle and bustle of a busy city street. Cars are honking their horns. People push past you in a hurry. And the street is flanked by buildings that seem to touch the sky. Now, imagine you are in the middle of an open meadow. Sunlight warms your shoulders and tall grass waves gently in the breeze. You hear the chirping of birds and the subtle buzzing of bees. Image © Shutterstock / Chaiwatphotos The difference between these situations is stark. And, odds are, so is your psychological and physiological response. The benefits of nature have been well documented, and it is now common knowledge that we are genetically wired to have an intuitive response to our surroundings. But just how connected are we to the environment we are in? And how deep is the impact on us mentally, emotionally and physically? THE POWER OF INTIMATE SPACE Back in 1958, French philosopher Gaston Bachelard published The Poetics of Space, which explores the impact of intimate spaces on the human psyche. Bachelard maintains that our minds thrive in spaces that allow us to daydream and become stagnant in spaces that feel depressing or oppressive. A more recent study by researchers at the University of Illinois at Urbana-Champaign Department of Landscape Architecture examined the relationship between environment and student’s cognitive abilities. They found that high school students performed better on exams if the classroom had a view of a green landscape, rather than if the classroom had a view of another building or a parking lot, or no view at all. Students with an expansive view had less mental fatigue and recovered better from stress, they also discovered. But these findings are not just limited to students; results are quite similar for those in a professional environment. In one study focused on employees in a workplace, increased exposure to nature at work made employees less stressed, and it also resulted in fewer filings of generalized health complaints. Perhaps this is why innovative companies such as Google, Microsoft and Pixar have created “campuses” with an open, expansive feel, surrounded by green landscapes and trees. And why here at Robbins Research International, we swapped out cubicles for an open floor plan and moved to a building with a glass infrastructure that fills our offices with natural sunlight and panoramic views. THE WAY WE INTERACT WITH SPACE We also understand our environment differently depending on how we interact with it. Researchers in the UK have recently discovered that when we navigate a new area with a map, for example, then we start looking at objects in relation to one another. But if we are exploring a route without a map, we tend to think more about the space in terms of its relation to ourselves. Our perspective becomes completely different. “The built environment can restrict or promote spatial cognition, which can influence one’s self-hood. Our spatial coordinates and our ‘selves’ are intertwined,” the report stated. The amount of time we are in a particular environment can also influence our understandings of ourselves. This suggests that having unrestricted movement in the space can allow us to experience a number of different perspectives over time. “The greater familiarity one has with a place increases the knowledge one has of different perspectives and orientations,” the report continues. With this in mind, it seems that we are not separate from what we experience. THE IMPORTANCE OF WELL-BUILT ENVIRONMENTS The findings are clear motivation for a more inclusive future, where everyone has access to environments that are more conducive to cognitive performance and well-being. And it’s something that is beginning to take shape. “Recently, architects and urban planners have started to consider the abilities and reference frames of those using the space to optimize the design of the built environment,” researchers said. Our thoughts, our emotions, and ultimately our sense of self are intimately tied to our surroundings. Where we are has the potential to mold who we are. And perhaps even more importantly, given our ability to shape the environment, and select where we spend our time, we can also play a more active role in shaping our own lives. This post is authored by the Tony Robbins editorial team and first appeared on the Tony Robbins blog. ", "title": "The Power of (Your) Space", "sentences": [{"cd4c": "The Power of (Your) Space"}, {"a2df": "How your surroundings can impact your thoughts, emotions and sense of self."}, {"f053": "Close your eyes and picture the hustle and bustle of a busy city street. Cars are honking their horns. People push past you in a hurry. And the street is flanked by buildings that seem to touch the sky."}, {"b2b1": "Now, imagine you are in the middle of an open meadow. Sunlight warms your shoulders and tall grass waves gently in the breeze. You hear the chirping of birds and the subtle buzzing of bees."}, {"7e76": "Image © Shutterstock / Chaiwatphotos"}, {"88b9": "The difference between these situations is stark. And, odds are, so is your psychological and physiological response. The benefits of nature have been well documented, and it is now common knowledge that we are genetically wired to have an intuitive response to our surroundings."}, {"d90a": "But just how connected are we to the environment we are in? And how deep is the impact on us mentally, emotionally and physically?"}, {"d6ee": "THE POWER OF INTIMATE SPACE"}, {"36fc": "Back in 1958, French philosopher Gaston Bachelard published The Poetics of Space, which explores the impact of intimate spaces on the human psyche. Bachelard maintains that our minds thrive in spaces that allow us to daydream and become stagnant in spaces that feel depressing or oppressive."}, {"6663": "A more recent study by researchers at the University of Illinois at Urbana-Champaign Department of Landscape Architecture examined the relationship between environment and student’s cognitive abilities. They found that high school students performed better on exams if the classroom had a view of a green landscape, rather than if the classroom had a view of another building or a parking lot, or no view at all. Students with an expansive view had less mental fatigue and recovered better from stress, they also discovered."}, {"07db": "But these findings are not just limited to students; results are quite similar for those in a professional environment. In one study focused on employees in a workplace, increased exposure to nature at work made employees less stressed, and it also resulted in fewer filings of generalized health complaints."}, {"978c": "Perhaps this is why innovative companies such as Google, Microsoft and Pixar have created “campuses” with an open, expansive feel, surrounded by green landscapes and trees. And why here at Robbins Research International, we swapped out cubicles for an open floor plan and moved to a building with a glass infrastructure that fills our offices with natural sunlight and panoramic views."}, {"6742": "THE WAY WE INTERACT WITH SPACE"}, {"31b6": "We also understand our environment differently depending on how we interact with it. Researchers in the UK have recently discovered that when we navigate a new area with a map, for example, then we start looking at objects in relation to one another. But if we are exploring a route without a map, we tend to think more about the space in terms of its relation to ourselves. Our perspective becomes completely different."}, {"0aae": "“The built environment can restrict or promote spatial cognition, which can influence one’s self-hood. Our spatial coordinates and our ‘selves’ are intertwined,” the report stated."}, {"6e76": "The amount of time we are in a particular environment can also influence our understandings of ourselves. This suggests that having unrestricted movement in the space can allow us to experience a number of different perspectives over time."}, {"62ae": "“The greater familiarity one has with a place increases the knowledge one has of different perspectives and orientations,” the report continues."}, {"3cc5": "With this in mind, it seems that we are not separate from what we experience."}, {"3917": "THE IMPORTANCE OF WELL-BUILT ENVIRONMENTS"}, {"5532": "The findings are clear motivation for a more inclusive future, where everyone has access to environments that are more conducive to cognitive performance and well-being. And it’s something that is beginning to take shape."}, {"0b49": "“Recently, architects and urban planners have started to consider the abilities and reference frames of those using the space to optimize the design of the built environment,” researchers said."}, {"13ce": "Our thoughts, our emotions, and ultimately our sense of self are intimately tied to our surroundings. Where we are has the potential to mold who we are. And perhaps even more importantly, given our ability to shape the environment, and select where we spend our time, we can also play a more active role in shaping our own lives."}, {"a933": "This post is authored by the Tony Robbins editorial team and first appeared on the Tony Robbins blog."}], "child": "1732_1\t1732_2"}