{"name": "1733", "parent": "", "content": "This Research Might Make You Rethink Your Social Media Habits Step away from the ‘like’ button. Prolific social media users, take note: A study published in the American Journal of Epidemiology has linked frequent Facebook use over time to poorer well-being. According to this Harvard Business Review article written by the study authors, mental health is particularly at risk. Image courtesy of Pixabay Researchers Holly Shakya, a professor of Global Public Health at UC San Diego, and Nicholas Christakis, director of the Human Nature Lab at Yale University, recruited 5,208 adults and tracked both their Facebook activity and real-world social lives in addition to their well-being for two years. (Well-being included life satisfaction, self-reported mental health, self-reported physical health and body-mass index.) Actual in-person relationships were, unsurprisingly, linked to better overall well-being, as a wealth of research has shown that close social ties do our mind and body good. Facebook use (measured by by often subjects’ liked other people’s posts, created their own posts and clicked on links) was negatively associated with well-being. As the authors write, “These results were particularly strong for mental health; most measures of Facebook use in one year predicted a decrease in mental health in a later year.” This is in line with prior studies showing the less-than-beneficial effects of social media. What makes these findings particularly attention-worthy is the design of the study itself. According to Shakya and Christakis, most of social media studies conducted in the past looked at one particular point in time (i.e. how much do you use social media and how are you feeling right at this moment) — this study took place over the course of two years, allowing the researchers to monitor changes in well-being that could be linked to social media use. Another important distinction is that Facebook use here wasn’t self-reported — the researchers pulled actual data from subject’s Facebook accounts, giving them a much more accurate picture of their usage. The researchers were also able to compare the links between social use and well-being and real-world relationships and well-being. Since this study proved correlation, not causation, the researchers can’t definitively say how increased social use might erode your well-being, but they do have some theories, from the destructive effects of comparing your digital life to the lives of others to engaging in fewer IRL interactions because you assume that digital missives are just as beneficial. Even without causation, this study is still more reason to unplug and connect offline. “The tricky thing about social media is that while we are using it, we get the impression that we’re engaging in meaningful social interaction,” Shakya and Christakis write. “Our results suggest that the nature and quality of this sort of connection is no substitute for the real world interaction we need for a healthy life.” Read the full HBR article here. ", "title": "This Research Might Make You Rethink Your Social Media Habits", "sentences": [{"3e0a": "This Research Might Make You Rethink Your Social Media Habits"}, {"6553": "Step away from the ‘like’ button."}, {"5e89": "Prolific social media users, take note: A study published in the American Journal of Epidemiology has linked frequent Facebook use over time to poorer well-being. According to this Harvard Business Review article written by the study authors, mental health is particularly at risk."}, {"732a": "Image courtesy of Pixabay"}, {"82c7": "Researchers Holly Shakya, a professor of Global Public Health at UC San Diego, and Nicholas Christakis, director of the Human Nature Lab at Yale University, recruited 5,208 adults and tracked both their Facebook activity and real-world social lives in addition to their well-being for two years. (Well-being included life satisfaction, self-reported mental health, self-reported physical health and body-mass index.) Actual in-person relationships were, unsurprisingly, linked to better overall well-being, as a wealth of research has shown that close social ties do our mind and body good."}, {"f667": "Facebook use (measured by by often subjects’ liked other people’s posts, created their own posts and clicked on links) was negatively associated with well-being. As the authors write, “These results were particularly strong for mental health; most measures of Facebook use in one year predicted a decrease in mental health in a later year.” This is in line with prior studies showing the less-than-beneficial effects of social media."}, {"c4c7": "What makes these findings particularly attention-worthy is the design of the study itself. According to Shakya and Christakis, most of social media studies conducted in the past looked at one particular point in time (i.e. how much do you use social media and how are you feeling right at this moment) — this study took place over the course of two years, allowing the researchers to monitor changes in well-being that could be linked to social media use. Another important distinction is that Facebook use here wasn’t self-reported — the researchers pulled actual data from subject’s Facebook accounts, giving them a much more accurate picture of their usage. The researchers were also able to compare the links between social use and well-being and real-world relationships and well-being."}, {"7158": "Since this study proved correlation, not causation, the researchers can’t definitively say how increased social use might erode your well-being, but they do have some theories, from the destructive effects of comparing your digital life to the lives of others to engaging in fewer IRL interactions because you assume that digital missives are just as beneficial."}, {"0f35": "Even without causation, this study is still more reason to unplug and connect offline. “The tricky thing about social media is that while we are using it, we get the impression that we’re engaging in meaningful social interaction,” Shakya and Christakis write. “Our results suggest that the nature and quality of this sort of connection is no substitute for the real world interaction we need for a healthy life.”"}, {"fa0a": "Read the full HBR article here."}], "child": "1733_1"}