{"name": "1734", "parent": "", "content": "Is Your Work Ethic ‘Unhealthy?’ How to keep your professional drive from ending in burnout. Work ethic is one of those intangible traits we all value, right up there with kindness and intelligence. We tend to think only of the upside, but as this eye-opening Science of Us piece explains, unbridled work ethic can put you on the path to burnout. Image courtesy of Unsplash The logic makes sense. Even if you’re motivated for all the right reasons (pride in your work, a sense of purpose, etc.) you can still become so invested in your work that you stop prioritizing your well-being and push yourself past your limits. As writer Cari Romm puts it, “Unhealthy [work ethic] is what happens when you don’t know how to turn off your motivation; it’s when the belief that work is inherently good transforms into the idea that downtime is inherently bad, or wasteful.” Part of the problem, as Romm lays out, is that there’s no agreed-upon definition of work ethic. We think of it as an all-or-nothing trait — either you have work ethic or you don’t. But it’s actually much more complicated and nuanced. As research from David Woehr, a management professor at Beck College of Business at the University of North Carolina, Charlotte, has suggested though, work ethic is a combination of seven traits, including whether you’re internally or externally motivated. There’s good news within the vagueness though. Since there’s no set-in-stone definition, it means we can each (individually and at the company-level) create one that aligns with our professional goals and personal needs. It’s critical that companies get involved here. When workplaces have clear definitions that include boundaries between work and home and the difference between hard work and overwork, employees can reframe their own idea of what constitutes “work ethic” accordingly. If Romm’s definition of “unhealthy” work ethic sounds awfully familiar, ask yourself if you’re putting work ahead of yourself. We’re all for ambition, but when professional success has a higher place on your priority list than your well-being, it’s time to reevaluate. Read more on Science of Us. ", "title": "Is Your Work Ethic ‘Unhealthy?’", "sentences": [{"7ce4": "Is Your Work Ethic ‘Unhealthy?’"}, {"163a": "How to keep your professional drive from ending in burnout."}, {"afb8": "Work ethic is one of those intangible traits we all value, right up there with kindness and intelligence. We tend to think only of the upside, but as this eye-opening Science of Us piece explains, unbridled work ethic can put you on the path to burnout."}, {"3a13": "Image courtesy of Unsplash"}, {"e0a7": "The logic makes sense. Even if you’re motivated for all the right reasons (pride in your work, a sense of purpose, etc.) you can still become so invested in your work that you stop prioritizing your well-being and push yourself past your limits. As writer Cari Romm puts it, “Unhealthy [work ethic] is what happens when you don’t know how to turn off your motivation; it’s when the belief that work is inherently good transforms into the idea that downtime is inherently bad, or wasteful.”"}, {"320c": "Part of the problem, as Romm lays out, is that there’s no agreed-upon definition of work ethic. We think of it as an all-or-nothing trait — either you have work ethic or you don’t. But it’s actually much more complicated and nuanced. As research from David Woehr, a management professor at Beck College of Business at the University of North Carolina, Charlotte, has suggested though, work ethic is a combination of seven traits, including whether you’re internally or externally motivated."}, {"9fcb": "There’s good news within the vagueness though. Since there’s no set-in-stone definition, it means we can each (individually and at the company-level) create one that aligns with our professional goals and personal needs. It’s critical that companies get involved here. When workplaces have clear definitions that include boundaries between work and home and the difference between hard work and overwork, employees can reframe their own idea of what constitutes “work ethic” accordingly."}, {"71d9": "If Romm’s definition of “unhealthy” work ethic sounds awfully familiar, ask yourself if you’re putting work ahead of yourself. We’re all for ambition, but when professional success has a higher place on your priority list than your well-being, it’s time to reevaluate."}, {"8e03": "Read more on Science of Us."}], "child": "1734_1\t1734_2"}