{"name": "1735", "parent": "", "content": "You Love What You Invest Yourself In Until you love something, you’ll never give everything you have for it. Passion fades. Love only becomes more powerful, regardless of the outcome. Love is the highest of all human motivations. The lower motivations — avoiding punishment/pain, seeking reward/pleasure, and duty — aren’t even comparable to the power of love. Love takes the attention off of you and places it on someone or something else. When you love something, you put it before yourself. Very few display this level of devotion, where you’re willing to be and do whatever is required. Where is your love directed? Give-Up Your Notion of “Authenticity” If you want to make improvements in your life, you need to fundamentally change as a person. The idea of “changing yourself” is off-putting to some. The desire to be “authentic” keeps people stuck in unhealthy patterns. Said, David Heinemeier Hansson, author of Rework, “Just be yourself” is a terrible platitude for accepting the random attributes of character you’ve acquired thus far.” According to psychologist Carol Dweck, having the belief in a “fixed” identity can interfere with growth. Your identity isn’t fixed. Without the belief that you can growth and change, all of your choices would be meaningless and irrelevant. If you truly love someone, you’ll be who you need to be for that person. Your thoughts will be directed toward their happiness, not how they can make you happy. Your creativity will be towards creating meaningful experiences for them. If you love a particular cause, you’ll be who you need to be to bring that cause forward. You won’t let your current deficiencies stop you. You’ll get educated. You’ll acquire skills. You’ll develop relationships. You’ll fail. You work. You’ll look foolish. It’s not about you. Kierkegaard, Socrates, and Levinas all believed love is fundamentally directed toward something outside oneself. An over-focus on yourself keeps you stuck in your head and worried about your own feelings, rather than out in the world doing good. Forget yourself and get to work. Become who you must be for the people and causes you love. It is only in devoting yourself wholly to something outside of yourself that you become self-actualized. It cannot happen is a self-absorbed and self-concerned manner. Being about something far greater than yourself is the most beautiful way to live. Completely Own Where You Currently Are If you want a life more than you currently have, you must be more than you currently are. Said Benjamin Disraeli, “Man is not the creature of circumstances, circumstances are the creatures of men.” Your circumstances are a reflection of you. If your relationships are toxic, who’s to blame? If your finances are a mess, who’s to blame? If you hate your job, who’s to blame? Of course there are external factors at play, but life organically shapes itself around your standards. Until you change, your circumstances won’t. To quote Darren Hardy, “To achieve what you have not, you must become what you are not. You have to grow into your goals.” Whatever it is you want in life, you must be that person before you can have it. Until you become that person, you are delusional. You won’t “live your dreams” until you become the person who creates those dreams. Said Jim Rohn, “Success is not to be pursued; it is to be attracted by the person you become.” This reality has recently become very apparent to me. To be blunt, I’ve been living far beneath the results I’m seeking in my life. The reason is simple. I haven’t loved deeply enough. I haven’t loved my family enough. I haven’t loved my clients enough. I haven’t loved my work enough. I haven’t loved my life enough. Because I haven’t loved enough, I haven’t been the person needed to make these things as great as they could be. I’m not crying over this fact. I’m not depressed. I’m just stating the facts. I’ve been selfish. “Love is the only thing powerful enough to overcome everything holding you back.” — Chris Chann, professional skateboarder Love is powerful enough to make hard and sometimes irrational decisions. Love is powerful enough to commit to something for the long-haul. Love is powerful enough to get you out of bed at 5AM and get to work. Love is powerful enough to learn things and acquire skills to benefit the lives of others. Love is powerful enough to change you into someone more and better than you currently are. Love is always directed outward. You Love What You Invest Yourself In People often ask: How can I know what I WANT TO DO? How can I know what I’m passionate about? These questions are misdirected. They’re overtly focused on themselves and their own happiness. Happiness cannot be pursued, it must ensue as the unintended consequence of devotion to something or someone else. Viktor Frankl believed this too, explaining it as the very reason for both survival in Nazi concentration camps and for success in life. Rather than worrying about what you’re passionate about, invest yourself in something you believe in. You grow to love what you put your energy into. You love what you do well. You love what you’ve sacrificed for. You love what you’ve changed for. If you work hard in a particular class, you’ll love that class. If you work hard on a project, you’ll love that project. If you work hard writing a paper, you’ll love that paper. If you invest yourself in a relationship, you’ll love that person. Love comes from work. It’s not a feeling. It’s committed action. What do you love? Call To Action Are you proactive? If so, check out my 7-page checklist of the most effective morning activities. Life awards the doers. Click here to get the checklist right now. (Good luck with the cold showers!) ", "title": "You Love What You Invest Yourself In", "sentences": [{"a3f8": "You Love What You Invest Yourself In"}, {"ca34": "Until you love something, you’ll never give everything you have for it."}, {"48b9": "Passion fades. Love only becomes more powerful, regardless of the outcome."}, {"021c": "Love is the highest of all human motivations. The lower motivations — avoiding punishment/pain, seeking reward/pleasure, and duty — aren’t even comparable to the power of love."}, {"fd10": "Love takes the attention off of you and places it on someone or something else. When you love something, you put it before yourself. Very few display this level of devotion, where you’re willing to be and do whatever is required."}, {"54e8": "Where is your love directed?"}, {"8d6c": "Give-Up Your Notion of “Authenticity”"}, {"58ba": "If you want to make improvements in your life, you need to fundamentally change as a person."}, {"30cf": "The idea of “changing yourself” is off-putting to some. The desire to be “authentic” keeps people stuck in unhealthy patterns. Said, David Heinemeier Hansson, author of Rework, “Just be yourself” is a terrible platitude for accepting the random attributes of character you’ve acquired thus far.”"}, {"21f3": "According to psychologist Carol Dweck, having the belief in a “fixed” identity can interfere with growth. Your identity isn’t fixed. Without the belief that you can growth and change, all of your choices would be meaningless and irrelevant."}, {"24b0": "If you truly love someone, you’ll be who you need to be for that person. Your thoughts will be directed toward their happiness, not how they can make you happy. Your creativity will be towards creating meaningful experiences for them."}, {"a619": "If you love a particular cause, you’ll be who you need to be to bring that cause forward. You won’t let your current deficiencies stop you. You’ll get educated. You’ll acquire skills. You’ll develop relationships. You’ll fail. You work. You’ll look foolish."}, {"f54a": "It’s not about you. Kierkegaard, Socrates, and Levinas all believed love is fundamentally directed toward something outside oneself. An over-focus on yourself keeps you stuck in your head and worried about your own feelings, rather than out in the world doing good."}, {"9450": "Forget yourself and get to work. Become who you must be for the people and causes you love. It is only in devoting yourself wholly to something outside of yourself that you become self-actualized. It cannot happen is a self-absorbed and self-concerned manner."}, {"b0c5": "Being about something far greater than yourself is the most beautiful way to live."}, {"18ab": "Completely Own Where You Currently Are"}, {"ced0": "If you want a life more than you currently have, you must be more than you currently are. Said Benjamin Disraeli, “Man is not the creature of circumstances, circumstances are the creatures of men.”"}, {"a595": "Your circumstances are a reflection of you."}, {"725b": "If your relationships are toxic, who’s to blame?"}, {"8ea6": "If your finances are a mess, who’s to blame?"}, {"205b": "If you hate your job, who’s to blame?"}, {"64ca": "Of course there are external factors at play, but life organically shapes itself around your standards. Until you change, your circumstances won’t. To quote Darren Hardy, “To achieve what you have not, you must become what you are not. You have to grow into your goals.”"}, {"eb90": "Whatever it is you want in life, you must be that person before you can have it. Until you become that person, you are delusional. You won’t “live your dreams” until you become the person who creates those dreams. Said Jim Rohn, “Success is not to be pursued; it is to be attracted by the person you become.”"}, {"741e": "This reality has recently become very apparent to me. To be blunt, I’ve been living far beneath the results I’m seeking in my life. The reason is simple. I haven’t loved deeply enough."}, {"47d8": "I haven’t loved my family enough."}, {"d926": "I haven’t loved my clients enough."}, {"9a72": "I haven’t loved my work enough."}, {"d29b": "I haven’t loved my life enough."}, {"79ff": "Because I haven’t loved enough, I haven’t been the person needed to make these things as great as they could be."}, {"97af": "I’m not crying over this fact. I’m not depressed. I’m just stating the facts. I’ve been selfish."}, {"aa61": "“Love is the only thing powerful enough to overcome everything holding you back.” — Chris Chann, professional skateboarder"}, {"bc8b": "Love is powerful enough to make hard and sometimes irrational decisions."}, {"5faf": "Love is powerful enough to commit to something for the long-haul."}, {"9e1e": "Love is powerful enough to get you out of bed at 5AM and get to work."}, {"90e6": "Love is powerful enough to learn things and acquire skills to benefit the lives of others."}, {"48f3": "Love is powerful enough to change you into someone more and better than you currently are."}, {"16fa": "Love is always directed outward."}, {"6042": "You Love What You Invest Yourself In"}, {"7f43": "People often ask: How can I know what I WANT TO DO? How can I know what I’m passionate about?"}, {"fb7c": "These questions are misdirected. They’re overtly focused on themselves and their own happiness. Happiness cannot be pursued, it must ensue as the unintended consequence of devotion to something or someone else. Viktor Frankl believed this too, explaining it as the very reason for both survival in Nazi concentration camps and for success in life."}, {"c690": "Rather than worrying about what you’re passionate about, invest yourself in something you believe in."}, {"e478": "You grow to love what you put your energy into. You love what you do well. You love what you’ve sacrificed for. You love what you’ve changed for."}, {"8caf": "If you work hard in a particular class, you’ll love that class."}, {"6230": "If you work hard on a project, you’ll love that project."}, {"da73": "If you work hard writing a paper, you’ll love that paper."}, {"ff2c": "If you invest yourself in a relationship, you’ll love that person."}, {"4abb": "Love comes from work. It’s not a feeling. It’s committed action."}, {"1d10": "What do you love?"}, {"58b0": "Call To Action"}, {"6da6": "Are you proactive? If so, check out my 7-page checklist of the most effective morning activities. Life awards the doers."}, {"6b92": "Click here to get the checklist right now. (Good luck with the cold showers!)"}], "child": "1735_1\t1735_2\t1735_3\t1735_4\t1735_5\t1735_6\t1735_7\t1735_8\t1735_9\t1735_10\t1735_11\t1735_12\t1735_13\t1735_14\t1735_15\t1735_16\t1735_17\t1735_18\t1735_19\t1735_20\t1735_21\t1735_22\t1735_23\t1735_24\t1735_25"}