{"name": "1737", "parent": "", "content": "Does Meditation Change Your DNA? You may want to make time for this. Image courtesy of Pexels. Most people who meditate do it because it feels good or perhaps because they’ve heard it’s good for their health. Many people, myself included, have intentions to meditate regularly but often find that life gets in the way. But what if we knew that meditation could actually change our DNA in a good way? Would that motivate us to set aside time for it more often? We’re all born with certain genes — the genetic material passed on to us from our parents. And you can often tell which genes you have just by looking in the mirror — blue eyes or brown hair, for example. But not every gene you carry will be “expressed,” or experienced by your body, even if your DNA carries its genetic code. Certain genes can turn on and off, like a light switch — and a multitude of factors determine when the switch gets flipped. Epigenetics is the study of the outside factors that influence gene expression — the way our DNA shows up in our bodies. Scientists are still learning about all the things that affect DNA. They run the gamut from exposure to toxins to diet and exercise to — you guessed it — meditation. Mindfulness meditation is a simple technique of bringing awareness to the present moment without judgment, often using the breath or a mantra as a focal point. A study at the University of Wisconsin-Madison confirmed genetic changes in test subjects following a day of mindfulness meditation. These meditators showed a range of genetic changes after eight hours, including reduced levels of inflammatory genes, indicating they had enhanced their ability to recover from physical stress. The inflammatory genes that “switched off” in the test subjects are the same genes often targeted with anti-inflammatory and analgesic drugs. The meditators also showed more rapidly declining cortisol levels following mentally stressful stimulation in comparison to the control group. Another study, published in the journal Cancer, looked at breast cancer patients who practiced mindfulness meditation. These patients had longer telomeres (strands of DNA that protect chromosomes). Telomeres normally shorten with age, leaving chromosomes vulnerable to deterioration. They’re shorter in people with chronic disease and high stress and longer in young, healthy people. So, long telomeres are a good thing and one that the researchers correlated with meditation. Does this mean that meditation can prevent you from getting a disease if you carry the gene for it? Not necessarily. But knowing meditation is on the list of epigenetic factors we can control in our lives makes a significant difference. Next time you start to feel like meditation is one thing too many to pack into an already busy day, consider this quote from Gandhi: “I have so much to accomplish today that I must meditate for two hours instead of one.” And think of your telomeres! Originally published at www.mindbodygreen.com. ", "title": "Does Meditation Change Your DNA?", "sentences": [{"7b1c": "Does Meditation Change Your DNA?"}, {"2a09": "You may want to make time for this."}, {"a81f": "Image courtesy of Pexels."}, {"bd7e": "Most people who meditate do it because it feels good or perhaps because they’ve heard it’s good for their health. Many people, myself included, have intentions to meditate regularly but often find that life gets in the way. But what if we knew that meditation could actually change our DNA in a good way? Would that motivate us to set aside time for it more often?"}, {"951e": "We’re all born with certain genes — the genetic material passed on to us from our parents. And you can often tell which genes you have just by looking in the mirror — blue eyes or brown hair, for example. But not every gene you carry will be “expressed,” or experienced by your body, even if your DNA carries its genetic code. Certain genes can turn on and off, like a light switch — and a multitude of factors determine when the switch gets flipped."}, {"caab": "Epigenetics is the study of the outside factors that influence gene expression — the way our DNA shows up in our bodies. Scientists are still learning about all the things that affect DNA. They run the gamut from exposure to toxins to diet and exercise to — you guessed it — meditation."}, {"43c0": "Mindfulness meditation is a simple technique of bringing awareness to the present moment without judgment, often using the breath or a mantra as a focal point."}, {"a742": "A study at the University of Wisconsin-Madison confirmed genetic changes in test subjects following a day of mindfulness meditation. These meditators showed a range of genetic changes after eight hours, including reduced levels of inflammatory genes, indicating they had enhanced their ability to recover from physical stress."}, {"7e82": "The inflammatory genes that “switched off” in the test subjects are the same genes often targeted with anti-inflammatory and analgesic drugs. The meditators also showed more rapidly declining cortisol levels following mentally stressful stimulation in comparison to the control group."}, {"2018": "Another study, published in the journal Cancer, looked at breast cancer patients who practiced mindfulness meditation. These patients had longer telomeres (strands of DNA that protect chromosomes). Telomeres normally shorten with age, leaving chromosomes vulnerable to deterioration."}, {"45c4": "They’re shorter in people with chronic disease and high stress and longer in young, healthy people. So, long telomeres are a good thing and one that the researchers correlated with meditation."}, {"b2dd": "Does this mean that meditation can prevent you from getting a disease if you carry the gene for it? Not necessarily. But knowing meditation is on the list of epigenetic factors we can control in our lives makes a significant difference."}, {"192e": "Next time you start to feel like meditation is one thing too many to pack into an already busy day, consider this quote from Gandhi: “I have so much to accomplish today that I must meditate for two hours instead of one.” And think of your telomeres!"}, {"6089": "Originally published at www.mindbodygreen.com."}], "child": "1737_1\t1737_2\t1737_3"}