{"name": "1738", "parent": "", "content": "Why You’re Different People On Instagram And Facebook Research suggests who you are online may depend on the platform. Do you act differently depending on the social platform you’re using? It’s highly likely — but you’re probably not doing it on on purpose. New research from Penn State University and King’s College in London suggests we subconsciously tailor our social media personas to specific platforms. Image courtesy of Unsplash The study will be presented at the International AAAI Conference on Web and Social Media next month. Researchers analyzed more than 100,000 social media users and found that — without even realizing it — many were molding their online behavior to fit “within the distinctive culture of etiquette for each site,” King’s College professor and study co-leader Nishanth Sastry said in the study’s press release. While it might seem obvious that something you’d post on Facebook (like a vacation picture) wouldn’t be suitable for LinkedIn or that your friends on Instagram don’t really want a resume update, the findings underscore how social media changes the way we present ourselves. They also provide further insight into how social media can warp our sense of self and self-esteem, giving us yet another reason to hop offline and seek analog connections — no platform-specific persona required. Read more about the study here. ", "title": "Why You’re Different People On Instagram And Facebook", "sentences": [{"72c9": "Why You’re Different People On Instagram And Facebook"}, {"7b0f": "Research suggests who you are online may depend on the platform."}, {"be9a": "Do you act differently depending on the social platform you’re using? It’s highly likely — but you’re probably not doing it on on purpose. New research from Penn State University and King’s College in London suggests we subconsciously tailor our social media personas to specific platforms."}, {"1fd3": "Image courtesy of Unsplash"}, {"46b7": "The study will be presented at the International AAAI Conference on Web and Social Media next month. Researchers analyzed more than 100,000 social media users and found that — without even realizing it — many were molding their online behavior to fit “within the distinctive culture of etiquette for each site,” King’s College professor and study co-leader Nishanth Sastry said in the study’s press release."}, {"b75e": "While it might seem obvious that something you’d post on Facebook (like a vacation picture) wouldn’t be suitable for LinkedIn or that your friends on Instagram don’t really want a resume update, the findings underscore how social media changes the way we present ourselves. They also provide further insight into how social media can warp our sense of self and self-esteem, giving us yet another reason to hop offline and seek analog connections — no platform-specific persona required."}, {"eff3": "Read more about the study here."}], "child": "1738_1\t1738_2\t1738_3"}