{"name": "174", "parent": "", "content": "The Story of Chicago’s Four-Star City Flag Wallace Rice covered the floor of his living room with colorful rectangles. He’d spent six weeks combining shapes and symbols, trying to find just the right image to represent the city where he lived. He’d come up with hundreds of possibilities for a city flag design, and now he displayed his favorites on that floor. Anytime anyone visited Rice’s home in the Lincoln Park neighborhood — people including the author’s acquaintances as well as delivery boys and milkmen — he quizzed them: Which of these should be the city flag? One design was the overwhelming favorite. It had two horizontal blue stripes and three white stripes. And there were two six-pointed red stars, positioned off-center in the middle white stripe. Maybe it was something about those stars. Who had ever seen a symbol shaped like ✶ before? It was a “Chicago Star,” Rice later recalled: After more than four hundred designs had been made by me, I finally struck upon such a six-pointed star as had never appeared in any flag before, peculiarly and singularly a Chicago star, made by a Chicagoan for his greatly loved city, by an American in the tenth generation in this country, whose ancestors had fought against Great Britain, for the most American of American cities. The visitors at Rice’s home (at 2701 North Best Avenue, which is now called Wilton Avenue) weren’t the only ones who liked that design with the blue stripes and red six-pointed stars. Rice won a contest the city was holding for a flag design — a contest he just happened to have written the rules for — and the City Council officially made it the municipal flag on April 4, 1917. A third star and a fourth were added later. As it turns a hundred years old, it’s arguably the most popular city flag in the United States. ✶✶✶✶ ‘People love Chicago more because the flag is so cool’ I made the case for the flag’s popularity in a 2013 Chicago magazine story, “Chicago’s Flag Is a Much Bigger Deal Than Any Other City’s Flag.” And I’ve also written an op-ed for Crain’s Chicago Business, “In a divided Chicago, one thing we all agree on: A damn fine flag.” Roman Mars, a former Chicagoan who hosts the consistently fascinating 99% Invisible podcast, touted the city flag’s beautiful design in a March 2015 TED Talk. He said: The design of the Chicago flag has complete buy-in with an entire cross-section of the city. It is everywhere. Every municipal building flies the flag. … It’s adaptable and remixable. The six-pointed stars in particular show up in all kinds of places. It’s a distinct symbol of Chicago pride. … And it isn’t just that people love Chicago and therefore love the flag. I also think that people love Chicago more because the flag is so cool. And as Mars noted, the flags for many other cities have rather lame designs. The video of Mars’s engaging lecture has now been viewed more than 4 million times, inspiring people in other cities to seek new designs for their municipal flags. Here’s a sample of news stories from the last few years: ✶ “Boston’s vexing flag problem. Critics call the style ‘a seal on a bedsheet.’ It’s boring, yet unfortunately common.” ✶ “Milwaukee unveils new flag by Robert Lenz highlighting a unified future.” (More about the new “People’s Flag of Milwaukee.”) ✶ “Know Lexington’s flag? Nobody does. Two groups say it’s time for a new one.” ✶ “Redding’s new flag will come from outside City Hall.” ✶ “Flag contest meant to show love for Joplin, but former mayor opposes plan” ✶ “South Bend seeks new design for city flag” The movement for better city flags was already underway before Mars’s talk went viral, driven in part by the North American Vexillological Association. (Vexillology is the study of flag designs.) Back in 2004, the Post and Courier reported on efforts to bring a new city flag to Charleston, South Carolina. That article quoted vexillologist Ted Kaye (author of Good Flag, Bad Flag: How to Design a Great Flag), as saying that Chicago’s flag showed the power of good design. “There also seems to be a correlation between good flags and how widely they’re flown,” Kaye said. “Chicago’s flag is used very widely — on all municipal buildings, on uniforms, bridge abutments. When a Chicago policeman dies, it’s not a U.S. flag on his casket, but a Chicago city flag.” And in 2014, The Daily Oklahoman quoted Oklahoma City Mayor Mick Cornett using Chicago’s flag as an example of what a good city flag can be. It has “become a standard in that community,” he said. Råvad’s Municipal Device Twenty-five years before Wallace Rice’s flag become the standard, Chicagoans made an earlier stab at devising a municipal symbol. Chicago was getting ready to host the 1893 World’s Columbian Exposition, and it wanted to look sharp for all those millions of people who’d be coming to visit the bustling Midwest metropolis. In 1892, the Chicago Tribune offered a one-hundred-dollar prize for the best suggestion of a municipal color or combination of colors that would symbolize the city. The local artist Francis Davis Millet explained why this was a good idea: The ordinary failure in decorating streets and buildings is in trying to make a harlequin effect. If you remember the decoration at the time of the death of President Lincoln, where the people only used black and white, you will recall how striking, impressive, and artistic was the general effect. Now, in general terms, the facade of a building is best decorated with one color alone or with two or three colors properly arranged without any special regard to the employment of red, white, and blue. … Almost all European cities have chosen colors, as the universities and colleges have done, and these are called the “municipal colors.” And the Tribune suggested that a municipal color scheme would boost Chicagoans’ sense of solidarity: Chicago’s unparalleled progress has been in no small degree due to the intense local pride and loyalty of its citizens of all classes. “Shoulder to shoulder, close ranks” has always been the watchword, and the consequence is a vast amount of justifiable civic pride which would doubtless welcome a chance to display itself in the display of a “municipal color.” Shoulder to shoulder? Describing Chicagoans as a unified bunch was wishful thinking. The city’s factions often seemed to be at war with one another, whether it was moralists denouncing the people who frequented saloons and brothels, or captains of industry battling against unions. Was it possible — or even desirable — that a symbol like a municipal color or a city flag would somehow bring all of these bickering clans into harmony? How much can any flag or symbol change the culture of a place? And yet, it was true that Chicagoans were proud of their bustling, growing city. The Rhode Island author Hezekiah Butterworth wrote in 1892 about visiting Chicago. “Everything here seemed to be upon the march. Men and women lived in what they were doing,” he wrote. He heard a Chicagoan saying: “In Chicago we live two years in one, and that is the best life that demands all our energies. Chicago works; other cities play.” Butterworth perceived the truth when this Chicagoan succinctly proclaimed: “Chicago does!” What color would best represent such a city? Out of 829 contest submissions, the winner was a noted Danish architect who’d recently moved to Chicago, to design buildings for the World’s Fair, Alfred Jensen Råvad (who also used an Americanized spelling of his name, Roewad). But Råvad did more than just suggest red and white as the city’s colors — he also offered a symbol. It was the shape of the letter “Y,” representing the Chicago River, whose branches form that pronged pattern. Råvad explained: I think it right to give a heraldic and graphic expression of Chicago, as it is and always will be divided by the river in three sides — North Side, West Side, and South Side. The Citizens’ World’s Fair committee tweaked Råvad’s submission, specifying a brownish shade of red — terra cotta. Millet designed a flag featuring Råvad’s Y symbol. The Chicago Evening Post offered its praise in an editorial: The Roewad design, besides being simple and artistic, is adapted to flag, gonfalon, or shield. Mr. Millet’s adaptation of it to the flag is one of the best things of its kind conceivable. If we are to have a city flag let’s have the Roewad flag. We can’t do better. Råvad’s scrapbook from the World’s Fair (now stored at the Chicago History Museum) shows how his symbol started to spread, appearing in advertisements, posters, and business cards. Chicago History Museum, ICHi-088680 But as Chicago magazine’s Whet Moser observes, “it was apparently not well received, judging by the Tribune’s pissy, defensive editorial about it.” The newspaper said a “Chicago contemporary” had denounced the terra cotta color as “akin to that which predominates at the slaughter-houses near the stockyards,” and “sneered” at the design. The Tribune’s editorial concluded: “If the carpers have anything better to suggest they should bring it out and if they have not they may find other topics better suited to the display of their wit and envious criticism.” Råvad’s design didn’t become part of an official city flag. Eventually, in 1917, it was enshrined in a city ordinance: “The municipal device, for use by the varied unofficial interests of Chicago and its people, shall show a Y-shaped figure in a circle, colored and designed to suit individual tastes and needs.” Look closely, and you’ll see many examples of the municipal device in Chicago today. Alderman Kearns pushes for a flag In 1915, Republican alderman James A. Kearns began pushing the idea of creating a city flag. Kearns, an Irish immigrant, represented what was then the thirty-first ward, out on the city’s southwest edge. Back in 1909, he’d introduced the “novelty” of showing motion pictures during a campaign event at a “nickel house.” Now, he said: In order to symbolize Chicago civic properly, to stimulate local patriotism, visualize industrial progress, and instill in school children a concrete evidence of the reality of the city of Chicago as a corporate community and civic organization, it is advisable to adopt a suitable design for a municipal flag. In July 1915, the City Council approved Kearns’s motion to form a Municipal Flag Commission. Chaired by Kearns, with members including the respected painter Lawton Parker, this group really did its homework. Working with municipal reference librarian Frederick Rex (“a man who could put his finger on any quotation a person asked for out of 200,000 books and pamphlets”), the commission published a detailed report about other municipal flags. Observing that sixteen United States cities with populations over thirty thousand had flags, the report noted: “Chicago has been far behind other cities in the adoption of a municipal flag.” It continued: Usually the adoption of a municipal flag by a city indicates its awakening to a new civic spirit of the highest order, the possession of broader and more far sighted municipal conceptions and convictions and the dawn of a community spirit devoid of the bickerings of political parties and of self-seeking private interests or individuals. A municipal flag will arouse civic pride and allegiance to home industry and form a rallying point for the plans and deeds which make for better conditions and better citizens. A municipal flag instills a sense of duty towards the community and city into the hearts of citizens and children, engendering that spirit of progress which serves to make a city or a community great. Such sense of duty develops a sense of public spirit which basically is the keystone of city building and planning. The father of the flag As the city held a contest for a flag design, it turned to Wallace de Groot Cecil Rice to write the rules. “He has been interested in flags from his infancy, one of his childhood pastimes being inventive use of colored paper and mucilage,” the Chicago Daily News reported. Although he was born in Hamilton, Ontario, Rice had moved to Chicago when he was two years old, in 1861. His father, John A. Rice, owned three legendary Chicago hotels at various times: the Sherman House, the Grand Pacific, and the Tremont House. Wallace Rice studied at Harvard University, earned a law degree and was admitted to the bar — but instead of pursuing a career as a lawyer, he became a newspaper reporter, drama critic and book critic. Rice dressed immaculately, often wearing silk hats. Like many of Chicago’s prominent journalists, he was in the infamous Whitechapel Club. As Rice recalled, it was “a little party of Bohemians” that began meeting in 1888, taking its name from the London neighborhood where Jack the Ripper was on his murderous rampage. The club met in chambers ghoulishly decorated with actual human skulls, hangman’s ropes and a coffin-shaped table. The group hit its pinnacle of notoriety on July 16, 1891, when its members conducted a funeral pyre in Miller Beach, Indiana, burning the body of the Dallas Suicide Club’s president, who’d killed himself and left a request to be reduced to ashes. Showing his flair for the dramatic, Rice recited a poem, proclaiming: “Death’s a dear friend to him whose life is blighted.” Rice wrote histories of gas companies, hotels, and stock exchanges; later, he collaborated with the legendary Chicago lawyer Clarence Darrow on an anthology called Infidels and Heretics. (Rice and Darrow were both early members of the Society of Midland Authors.) He wrote newspaper columns about grammar, including one that declared “ain’t” is acceptable English. “Ain’t has a pleasant sound, once the ears are unstopped of prejudice,” he insisted. Rice wrote pageants for historical occasions. Around the same time when he designed the Chicago city flag, he also created a flag for the centennial of Illinois. And he wrote the script for “The Masque of Illinois,” a spectacle staged on the Illinois State Fair Grounds in Springfield. The program called it “an attempt, believed to be the first of its kind ever made, to interpret by means of symbol and allegory the 245 years (1673–1918) of the history of the Illinois Country.” Rice’s ideas for showing history through dance and song would now seem hokey and sometimes politically incorrect. A sample: Illinois is first shown surrounded by her Prairies, Rivers, Forests, and flowers, which may be taken as standing for our natural resources. Upon this primitive and idyllic peace Fear intrudes, accompanied by a band of Indians, who dance War and Squaw Dances. They are frightened away by the coming of the French (1673). Joliet, La Salle, and Tonty, are shown as symbolizing certain of the gifts the French brought to us; religion, the most valuable of these … The gayety of France is also shown in a little dance, which is interrupted by the coming of the British… In 1917, as the United States plunged into World War I, Rice wrote the lyrics of “Freedom and Glory,” a song for the Army and the Navy played by the Great Lakes Naval Training Station Band and other military outfits. The song proclaimed: Freedom! Glory!off to war are we,To fight the fight for Godand right along the land and sea. Rice also lectured on heraldry and flag design at the Art Institute. As Moser observed in Chicago magazine, Rice “was a classic turn-of-the-century polymath.” Rice’s rules Here are the rules Rice spelled out for the city flag contest. They still stand today as sound advice for good design: Rule 1. The municipal flag should have significance, heraldric and other. The space or area to be utilized is so limited by its terms and the conditions so insistent, that there is neither room nor reason for colors and designs which do not make for a Chicago flag. Rule 2. Since the municipal flag of the City of Chicago is always to be flown in conjunction with the Stars and Stripes, all designs for a municipal flag submitted by competitors should be colored and patterned with special reference to such continued and inevitable use. Rule 3. The municipal flag should not only be symbolic of the City of Chicago, but also typify its ideals and aspirations, its history, its geographical and political divisions, and its people, so far as possible; but it should display knowledge of heraldric and other symbols already assigned definite meanings. Rule 4. The municipal flag should be beautiful, to the point of decorativeness. The colors should contrast effectively and the divisions of the design accord symmetrically. Rule 5. The municipal flag should be simple. Elaboration at any point, whether by multiplicity of colors or minute subdivisions of design, will destroy its chief purposes. Rule 6. The municipal flag should be the symbol and emblem of a free people in a free city and for this reason devices peculiar to the Old World and other foreign countries should be omitted from the design of the municipal flag for the City of Chicago. Rule 7. The municipal flag should be original. It should not resemble closely in coloration or design any other flag whatsoever. Rule 8. The municipal flag should be contrived and designed with prime reference to the fundamental fact that it is to be made from fabrics, cotton, bunting, silk or other material which can be readily cut and stitched. Rule 9. The symbols and details on the municipal flag should be such as will work out particularly by cutting and stitching fabrics. Nothing that requires to be painted on, as landscapes, unconventionalized birds and beasts or natural objects in general, should find place, demanding as they frequently do, separate treatment for the two sides of the flag. No lettering, either of initials, words, mottoes or figures, will be permitted or considered on a municipal flag design. The municipal flag should be alike on both sides for the sake of simplicity and for ease of manufacture. Rule 10. The municipal flag should conform in its sizes, shapes and proportions to those which custom and experience have established as suitable. Rule 11. The use of the colors and designs of the municipal flag as a banner to be hung vertically rather than flown horizontally, and as a badge, button or other device to be worn on the person may well be taken into consideration, and its colors and design be made adaptable to such ends when practicable. Rice also offered a list of “suggestions,” including one that addressed the tricky issue of how a flag looks as it is rippling in the wind: The municipal flag should be designed with some practical knowledge derived from observation of the proportions of flags flown to the breeze, and of the portions or parts of such flag coming first into view and also oftenest in view. For this purpose it is desirable that certain elementary facts should be considered, as [1] the lower corner next the staff is the first to show when the flag lifts itself from pendency; [2] the line of flag next the staff is visible before its middle third is disclosed; [3] the whole of the first third of the flag is in view before the last third, the fly, is seen; [4] the upper of the fly is not seen until the rest of the flag is streaming. It is evident from such study and observation of the properties of flags that horizontal divisions, bars and stripes, flow and stream with the stream and flow of the flag and that vertical divisions, cantons, quarters and piles act against and interrupt these. The former, therefore, make for beauty, distinctiveness and visibility; the latter against them. Considering that Rice wrote the rules, it isn’t surprising that he won. More than a thousand entries poured in. “Many of them looked pretty well on paper, where every part of the pattern is seen equally well, but would not have shown to any advantage dancing in a variable breeze, which is the only test of a flag,” the Tribune later reported. One proposal used that “Y” shape symbolizing the branches of the Chicago River. But as this Tribune article pointed out, Chicago isn’t the only city with a Y-shaped confluences of rivers. That device wasn’t distinctive enough. The Tribune described some of the other rejected designs: Many designs submitted showed from eight to twelve different and conflicting colors — as many as the designers happened to have in their boxes of crayons or paints. One ingenious person, who had heard of Chicago as a melting pot of humanity, placed a large black pot in the middle of his design, with red flames overflowing from it. By a unanimous vote on April 4, 1917, Chicago’s aldermen approved Wallace Rice’s design for municipal flag. “Chicago now has an expressive and beautiful municipal flag,” the publication Chicago Commerce commented. At the end of April 1917, an auto dealer named Henry Paulman was the first person who was reported to fly the city’s new flag. He displayed it at his Pierce-Arrow showroom at 2420 South Michigan Avenue, in an area known as Motor Row. On May 30, Rice went along with Mayor William Hale Thompson and a delegation of city officials to the downstate town of Evansville, where the mayor dedicated a monument to the late James Thompson, who’d been Chicago’s first land surveyor back in 1830. (The mayor, nicknamed Big Bill, wasn’t related to the surveyor.) This ceremony was the first time Chicago’s municipal flag was ever displayed outside of the city. Rice later recalled telling the mayor about the significance of those six-pointed stars, explaining it “in detail.” Mayor Thompson, who hadn’t taken an active role in the flag’s selection process, “openly expressed” his “enthusiastic approval,” according to Rice. What the flag means Recent documents from the Chicago City Clerk’s office offer a simple explanation of the flag’s symbols. Those two blue bars represent the branches of the Chicago River. And from top to bottom, the white stripes stand for the North Side, the West Side and the South Side. The blue stripes But Rice’s original ideas about those stripes were more complicated. He noted that blue was “the color of the Lake and River, of distant mountains, and of the Oceans.” The flag’s top blue stripe stood for the Chicago River’s North Branch, but Rice said it also had a “national” meaning — the Allegheny Mountains. And it had a “terrestrial” meaning, symbolizing the Atlantic Ocean and the Great Lakes. But Rice wasn’t consistent about all of this. Another time, he said the top blue stripe stood for Lake Michigan and the river’s North Branch. The bottom blue stripe was a symbol of the Chicago River’s South Branch, but for Rice, it had similar layers of multiple meaning. From a national perspective, it signified the Rocky Mountains and the Sierras. And from a global viewpoint, it represented the Pacific Ocean and Gulf of Mexico. On another occasion, Rice gave a different explanation for the bottom blue stripe, saying it stood for the river’s South Branch and “the great canal” — referring to the Illinois and Michigan Canal and/or the Chicago Sanitary and Ship Canal. The white stripes Rice did not think of the white stripes as a neutral background. “It is white, the composite of all the colors, because its population is a composite of all the nations, dwelling here in peace,” Rice said. The flag’s top white stripe “stands locally for the North Side, nationally for the Atlantic Coast, and terrestrially for the countries east and north of the United States,” Rice wrote. The middle white bar “stands locally for the West Side, nationally for the Great Central Plain dominated by Chicago, and terrestrially for the United States.” And the white bar across the flag’s bottom was “stands locally for the South Side, nationally for the Pacific Coast, and terrestrially for the countries west and south of the United States.” It’s no wonder that these ideas have been simplified over time. The middle white stripe is twice as wide as the other two — symbolizing the fact that the West Side was larger than the North Side and South Side were. Rice called it “the great West side, with an area and population greatly exceeding that of the other two sides.” That assertion might surprise today’s Chicagoans. The West Side, as most people think of it now, no longer dwarfs the city’s other sides. That’s because our concept of the city’s layout has evolved. During Chicago’s first century, people often referred to its three sides: the North Side, the West Side and the South Side. Sometimes, these were called the city’s “divisions.” That Y-shaped Chicago River, with its branches, was commonly accepted as the dividing line between these sections of the city. If you look at the city that way, the West Side is large indeed, encompassing everything west of the river’s branches. 1880 map by the West Chicago Park Commissioners (image: Boston Public Library) The construction of expressways after World War II created new dividing lines. And today, people commonly talk about the Northwest Side, the Southwest Side and other areas, parceling up the city into smaller subsections. Depending on how you define its boundaries, the West Side may actually seem like a fairly small chunk of the city today. Rice saw other meanings in the flag’s numbers of symbols. Why were there two stars? Because Chicago was the second-biggest city in the United States. And if you added the two blue stripes to the two red stars for a sum of four, that signified the idea that Chicago was “the fourth city of the globe.” (If Chicago actually was the world’s fourth-largest city at the time, it has fallen way down in those rankings since then.) A page from the October 2, 1921, Chicago Herald and Examiner, posted on the Chicago Detours website. The flag’s geometry Rice wrote out very specific instructions for the size of the stripes and the shape of the stars. But when aldermen voted on the flag’s design, they kept things simple — and a little vague. For one thing, the ordinance doesn’t say anything about white stripes. Instead, it describes white as the flag’s background color: “The Chicago municipal flag shall be white, with two blue bars…” Then it declares that each of these blue bars is one-sixth of the flag’s width. The city’s law then offers some wiggle room about exactly where those blue stripes should go. They are supposed to be “set a little less than one-sixth of the way from the top and bottom of the flag, respectively.” A little less? How much less? The law doesn’t say. Chicagoan Ted Whalen, who has researched the city flag’s history, suggests that the vague language may actually be what Rice intended. Rice’s suggestions in the flag-design contest included this advice: The visibility at distances of the several colors and of the different portions of the flag itself should be taken into account in determining its proportions, rather than divisions of mathematical exactitude. In other words, it is the effect of symmetry, not the mere physical fact, which should be taken into account. The French, for example, after extensive experimentation, divide their tricolor so that the blue next the staff has thirty parts in a hundred, the white in the middle thirty-three parts, and the red in the fly thirty-seven, and thus secure the appearance of an equal division. Whalen says: “I suppose this explains why all the descriptions of the flag have tortured syntax — the ‘slightly less than a sixth’ language. Rice wanted the white and blue stripes to appear to have the same width, and so they must be slightly different.” The stars As far as the stars go, the ordinance does not spell out their exact dimensions. It just says they should have “sharp points.” The flag’s original two stars symbolized significant events in the city’s history: The Great Chicago Fire of 1871: And the World’s Columbian Exposition of 1893: A new flag at a time of war The Chicago City Council approved Rice’s flag design on the same day when the United States Senate voted for America to go to war in Europe. Not surprisingly, the news about the city flag was buried. The Tribune’s front page was filled with headlines about the war. Chicagoans were torn apart by America’s entry into the Great War against Germany. Thirty percent of the city’s people in 1910 were either German immigrants or children of German immigrants. (Another 13.5 percent were Austrian.) That same week, the Tribune published a letter from a local German-American named C. Kotzenabe: As a German by birth it is a horrible calamity that I may have to fight Germans. That is natural, is it not so? But as an American by preference I can see no other course open. … It sickens my soul to think of this nation going forth to destroy people many of whom are bound to me by ties of blood and friendship. But it must be so. It is like a dreadful surgical operation. The militaristic, undemocratic demon which rules Germany must be cast out. It is for us to do it — NOW. William Hale Thompson Chicago’s Republican mayor at the time, William Hale Thompson, was outspoken against the war. Federal prosecutors even talked about putting him on trial: “He should know that the penalty for treason is hanging,” one remarked. Thompson’s crusade for isolationism eventually led to a fight over the Chicago city flag. After serving two terms as mayor, from 1915 to 1923, the colorful politician left City Hall, replaced by Democrat William Dever. But then Thompson roared back in the election of 1927, accusing the Dever administration of pushing pro-British propaganda in Chicago’s schools. Thompson even threatened to punch the king of England “on the snoot” to “keep him from annexing the U.S.A. as a British colony.” In their 1953 biography, Big Bill of Chicago, Lloyd Wendt and Herman Kogan described one of Thompson’s campaign speeches: … the crowds pushed in for the show. When they finished singing “America First, Last and Always,” and Bill had been introduced as one of the greatest living Americans, he lumbered forward, grinning his crooked-tooth grin, his brown eyes gleaming with pleasure. He drew his big hands from his pockets, cracked them together over his ample paunch… Then, after dealing with … assorted local issues, Big Bill tore into King George. “I wanta make the King of England keep his snoot out of America!” he cried huskily. “That’s what I want. I don’t want the League of Nations! I don’t want the World Court! America first, and last, and always! That’s the issue of this campaign. That’s what Big Bill Thompson wants!” He advanced toward an American flag hanging from a staff on the platform, embraced it and shrieked, “This is the issue of this campaign! What was good enough for George Washington is good enough for Bill Thompson!” The press and Big Bill’s political opponents acted like he’d lost his mind. His “troubles are mental,” Mayor Dever said. The New York Evening World reported: Bill Thompson’s issue is the infamy of the English and the tyranny of King George V.! … Great crowds who hate England scream their approval. … Big Bill Thompson speeds over the city like a modern Paul Revere warning the patriots of the dangers of oppression under King George. Over in England, The Guardian commented: “the oddest thing about this story is that it is not a dream like ‘Alice in Wonderland’…” Thompson may have seemed like a kook, but one of his biographers, Charles Bukowski, saw a rational explanation for his seemingly bizarre tirades: Every charge, no matter how absurd on the surface, served a purpose. … To the literal-minded, talk about George V (or III, Thompson was not always clear which one he meant) and the threat of “handing the king one on the snoot” were nonsense. But observers were too far removed from the lives of ordinary Chicagoans to understand: Thompson offered his audience a double dose of emotional release. His “king” could just as well be their “boss,” “millionaire,” or “newspaper publisher,” along with “czar,” “emperor,” or “kaiser.” Thompson won the election. Back in control at City Hall, he pushed the school board to oust the superintendent, accusing him of trying to indoctrinate the kids with pro-British propaganda. Thompson ordered that no lions should be carved on new school buildings, because he saw lions as a symbol of England. And then the mayor took a close look at the city flag. And he thought: Isn’t there something British about those six-pointed stars? How many points? On February 1, 1928, Thompson was leaving for a vacation in New Orleans on a special train decked out with flags when the municipal flag caught his eye. An Associated Press story noted that the city flag was “generally forgotten” at this point in history, eleven years after its approval. Big Bill zeroed in on those ✶ stars — as the AP described them, these were “the stars of the British Union Jack.” Thompson pointed to to ★ symbols on an American flag nearby and said: “The stars in that banner have five points. Draw up an ordinance at once changing the stars of the Chicago flag from the British to the American type.” The previous year, someone named “A.F.” had written a letter to the Tribune, complaining about the city flag’s “six-pointed English stars.” The letter mentioned a legend about Betsy Ross. The famous flag-maker’s family told a story about how she’d changed the design of the American flag when a Congressional delegation came to her Philadelphia sewing shop in 1776 with a drawing of a proposed flag for the new country. Almost a hundred years later, Ross’s daughter, Rachel Fletcher, recounted what happened: … the stars were six-pointed in the drawing, and she said they should be five pointed. That the gentlemen of the committee and General Washington very respectfully considered the suggestions and acted upon them, General Washington seating himself at a table with a pencil and paper, altered the drawing and then made a new one according to the suggestions of my mother. There’s no documentation to back up this story, but it was passed down in the Ross family, according to historian Ed Crews. “Today, historians almost uniformly agree that family oral history is not particularly reliable,” he wrote. In any case, there’s nothing especially British about six-pointed stars. For one thing, the Union Jack does not actually have any stars on it, either ★ or ✶. Acting on Mayor Thompson’s orders, Chicago’s corporation counsel, Samuel A. Ettelson, quickly researched the question of how many points the stars should have. Checking with the municipal reference library, Ettelson discovered that “the only national flags using stars of more than five points are those of the Australian Commonwealth, the Zionists of Palestine and New South Wales.” Ettelson wrote up an ordinance that would change the flag’s stars to five-pointed ones. This provoked a passionate plea from Wallace Rice against changing the stars. He told the Tribune: I purposely made the stars six-pointed. Five point stars are the symbols of states and could manifestly have no place in a municipal flag. Mayor Thompson is making not only himself but the flag ridiculous by ordering the change. Rice shot off a five-page missive to Ettelson, explaining in detail why the stars had six points: … so far from being a copy of or echo from the Old World, the Chicago Stars are that and nothing else, a unique form never before used in a flag or in heraldry, especially contrived and designed by me to meet local conditions as exist nowhere else, with a wealth of apt significance quite without parallel. Rice said he’d relied on Arthur Charles Fox-Davies’s book A Complete Guide to Heraldry for guidance about stars. That book describes five-pointed stars as “Scottish stars.” As Rice pointed out, the book doesn’t include any six-pointed stars like the ✶ ones on his flag: This will also establish the important fact that the Chicago Stars I set in our municipal flag are quite unknown to the heraldric art and in consequence to flag-designing, and are not merely American in the sense that they were contrived by a man who has, by accident of birth, every line of descent centering in him in this country before the year 1650, and who has been a resident of Chicago since June, 1861, and has never known another home, but are the painstaking result of thinking out a design that will be of the essence of Chicago. Rice said that five-pointed stars symbolized sovereign states, so it wouldn’t make sense to use them on a city flag. And Rice talked about the meanings of the stars. He said the Chicago Fire of 1871 was “the greatest material event in our local history” and the 1893 World’s Fair was “the greatest event in our local history on the finer sides of life, including the Congress of Religions, art in every known form, music, literature, and calling as never before upon our civic spirit and generosity.” The red color of the stars symbolized the flames of the 1871 fire, as well as the “rejoicing” at the World’s Fair, he said. On the star representing the 1871 fire, the six points symbolized ✶Transportation, ✶Trade, ✶Finance, ✶Industry, ✶Populousness, and ✶Healthfulness. “Can our material ambitions be more briefly and comprehensively set forth and can they be better and more simply symbolized than by these six sharp points in the Chicago Star?” Rice wrote. On the star representing the 1893 expo, the six points symbolized ✶Religion, ✶Education, ✶Aesthetics, ✶Beneficence, ✶Justice, and ✶Civism (or civic spirit). Rice wrote: Here in a single simple symbol, especially designed for the Chicago occasion, are comprehended a city of churches innumerable, a city with more degree conferring institutions of the first rank than any other other and with some of the world’s greatest libraries, the city of the Art Institute, the Chicago Orchestra, the Civic Opera, uncounted schools of music, of drama, of painting and sculpture, its literature including poetry commanding the world’s attention, the city of countless charities amounting to many millions annually and huge gifts for every good work in all directions, the city of the Juvenile Court, the Court of Domestic Relations and other greatly needed and widely copied means of dealing with the unfortunate, and finally, the city of such civic spirit that the Chicago Plan flourishes beyond earthly precedent and every worthy enterprise conceivable to the mind of man is encourage beyond example anywhere. Rice said his star’s points should have a thirty-degree angle, making them look sharply pointed — “acutely sharp for Chicago’s forward thrust and enterprise.” (Helpful hint: You can copy and paste a symbol of the Chicago Star: ✶) They looked distinctly different from the famous six-pointed Star of David. Rice took umbrage at seeing city flags with thick-pointed stars, like this photo that appeared in the Chicago Herald and Examiner on February 2, 1928: Chicago Herald and Examiner Those are “not Chicago Stars at all, either in size or shape,” Rice said. He wondered if Mayor Thompson’s displeasure with the stars was actually caused by incorrect flags like the one in the photo. Incorrect stars were being “allowed to creep into the flag” because people weren’t consulting the official design, he said. (Whalen explored the geometry behind the variable shape of Chicago stars in this 2004 blog post, along with this follow-up in 2005. In spite of Rice’s plea, the Chicago City Council unanimously voted on February 15, 1928, to change the city flag’s ✶ stars to five-pointed stars. But then, strangely, this new version of the flag apparently never made it into the city’s ordinance books. Whalen pointed out this puzzle in a blog post: “all the printed and bound editions of the code that the Municipal Reference department can produce all have ‘six in number’ language.” Chicago City Council motion, Illinois Regional Archives Depository A short time after Thompson won his vote for five-pointed stars, the mayor had a mental breakdown, according to Wendt and Kogan’s biography. “He drank constantly, gabbled hysterically and spoke irrationally,” they wrote. Thompson went into hiding in the Wisconsin woods, and the city’s lawyer, Ettelson, effectively took control of City Hall for a while. By the time Thompson finished this third and final mayoral term in 1931, many people regarded him as an embarrassment. Summing up what the critics said, Wendt and Kogan wrote: He has given the city an international reputation for moronic buffoonery, barbaric crime, triumphant hoodlumism, unchecked graft and a dejected citizenship. He nearly ruined the property and completely destroyed the pride of the city. He made Chicago a byword of the collapse of American civilization. No other Republican has won election as Chicago’s mayor since Thompson. In a 2016 article, Chicago Tribune reporter Ron Grossman compared Thompson to Donald Trump, calling Big Bill “a mayor who could match the most narrow-minded politicians of any era in chest-thumping xenophobia.” Municipal Reference Desk, Chicago Public Library Thompson was still serving as mayor in 1930 when the Municipal Employes Society featured the city flag on the cover of its quarterly bulletin. The newsletter’s article mentioned that the flag had “two five-pointed stars.” But strangely, the cover illustration showed a flag with three six-pointed stars. ✶✶✶ Were city employees rebelling against Big Bill’s pentagrams? The editors noted that another world’s fair was coming up in three years. “When the Century of Progress Exposition is a thing of the past, no doubt the City Council will then take appropriate action for a third star on the Municipal Flag.” Adding a third star And that’s just what happened. As Chicago hosted the Century of Progress expo in the summer of 1933, the Tribune reported that many Chicagoans were noticing their city’s flag for the first time, thanks to flag displays at the fair and on State Street’s stores. “Most of them, however, did not recognize the flag as Chicago’s own emblem,” the newspaper said. That October, aldermen voted to add a third star to the city’s flag, commemorating the world’s fair, which continued for another year. And in case there was any doubt about the number of points on those stars, the vote confirmed that they were six-pointed. According to a city document, the six points of the newest star represented the various governments that dominated the land where Chicago stands today: ✶France, 1673; ✶Great Britain, 1763; ✶Virginia, 1778; ✶Northwest Territory, 1798; ✶Indiana Territory, 1802; and ✶Illinois Statehood, 1818. And then, there were four stars Six years later, the City Council added a fourth star, symbolizing Fort Dearborn, the American military garrison built in 1803 on the site of the future city. The fort’s soldiers fought in an 1812 battle with Native Americans. A group called the Fort Dearborn Memorial Commission suggested adding a star to commemorate “Fort Dearborn and the gallant men who served there.” Aldermen unanimously approved the idea on December 21, 1939. City documents list the meanings of the six points on this fourth star: ✶World’s Third Largest City; ✶Urbs in Horto (the city’s Latin motto, meaning “City in a Garden”); ✶“I Will” Spirit (another city motto); ✶The Great Central Market; ✶The Wonder City; and ✶The Convention City. Even though the Fort Dearborn star was added last, it represents the earliest of the four historical events, so it was essentially inserted in front of the other three stars. A fifth star? Over the decades, people have occasionally suggested adding a fifth star to the flag. One idea was a star representing the French explorers Joliet and Marquette. And then in 1961, a fifth star was suggested to represent Chicago’s role as the birthplace of the atomic age. (The first human-made self-sustaining nuclear chain reaction took place December 2, 1942, at the University of Chicago.) “I think we’ll explore this,” Mayor Richard J. Daley said. But nothing came of it. Richard J. Daley. Photo by László Kondor, UIC After Daley died in 1976, the City Council approved a resolution calling for a fifth star — a ✶ symbolizing the long-serving Democratic mayor. The resolution was replete with flowery language: … Whereas, Now the citizens of Chicago are in agreement that there is a fifth significant event which should be commemorated, that is the twenty-one years of faithful service and leadership achieved by our beloved Mayor Richard J. Daley; and Whereas, The City itself is a monument to Mayor Daley since its magnificent lakefront, its gleaming skyscrapers and its diverse neighborhoods are the result of his enthusiasm for and love of his City; a love that was contagious and was infused into the hearts of all who knew and talked to him, whether corporate president, or shopkeeper or working man; and Whereas, No granite monument, no photographer’s eye, nor artist’s pen could ever adequately capture his quick wit, his jaunty step, his vigorous attack on the problems of the City and its people; and Whereas, A fitting symbol of Mayor Richard J. Daley’s spirit would be a fifth star added to the City’s flag because his life and energy were devoted to making this City a better place for all to live and work and his years among us were surely one of our City’s most significant eras, comparable even to the City’s Founding; … But the aldermen never voted on an ordinance that would actually change the law to add the fifth star. Out of obscurity In spite of its lovely design, Chicago’s city flag was not widely known or popular for decades. In 1948, Mayor Martin Kennelly started “a one man crusade” to educate Chicagoans about their flag. He kept a pile of postcards showing the flag in his desk and handed them out to City Hall visitors. “I didn’t know what the flag was until I was elected,” he said, “and I didn’t learn what it meant until recently when I presented one to the Art Institute. I think it’s a fine thing for buildings to fly the city flag.” In 1958, the Tribune reported: Lloyd Schumacher raised a Chicago flag outside his hardware store at 3634 N. Central av. a month ago and since then has been busy answering questions. Few people recognize the city’s flag, Schumacher said, and have mistaken it for everything from the flag of Israel to that of one of the Scandinavian countries. It’s gotten to the point, he said Monday, that he’s so busy answering questions there is little time left to sell tenpenny nails or a brace of carpenter’s tools. Schumacher said he is displaying the Chicago flag because he is a booster of the city and doesn’t think the flag is seen often enough. He plans to keep flying the flag. And in 1959, the Chicago American reported: You have to look far and wide to find a flag of Chicago in the city. In fact, you have to look farther and wider before you can find a Chicagoan who knows the city has its own flag. One of the few buildings flying the colorful four-star flag is City Hall. A police was asked by a reporter if he knew what flag was displayed next to the Stars and Stripes on the La Salle street side of the building. The policeman pondered a moment. Then his face came alive with inspiration. He replied: “That’s in honor of Israel, I think. You notice that the stars have six points.” … A check of flag manufacturers and distributors in the city showed few have any variety of sizes of Chicago flags in stock — if they have them at all. A Loop distributor volunteered: “We just don’t get many calls for them. You can see for yourself. It’s on the City Hall, but where else?” In the late 1960s, Daley may have boosted the flag’s visibility by sending flags to Chicagoans serving in the Vietnam War. After he sent a flag to Lance Corporal David Marchi, the soldier wrote a letter to the mayor: “As you can see in the pictures, I am keeping the flag flying high. You’d be surprised how it boosted morale when some of the men found out my mayor sent it to me. They are now sending away for flags also.” An art display now on the Harold Washington Library Center’s third floor includes a large photo showing a Chicago flag flying in 1970 at an American encampment in Vietnam. Combat photographer Laszló Kondor took the photo from the top of a moving tank, and it’s now part of the National Veterans Art Museum’s collection, which also includes the actual flag pictured in the photo (which is online at the museum’s website). The Tribune reported that Chicago police officers had begun wearing a patch of the city flag on their right sleeves on May 1, 1971. The Police Department’s annual report, published a month later, included a photo of an officer with the patch. The Tribune’s “Finds” columnist, Susan Nelson, noted: Anyone may wear a city flag patch on his own, an Officer Friendly told us. Find them where the policemen and other uniformed public servants shop — at Kale Uniforms, 532 W. Roosevelt Rd. Cloth-backed flags are 25 cents; vinyl-backed flags (for leather jackets) are 50 cents. With police officers wearing ✶✶✶✶ on their shoulders, one might expect the flag would become a symbol of authority and the establishment. You know — The Man. But the flag also became popular with the sort of people whom we might call the counterculture. For example, Chicago punk rock musicians and punk fans began buying leather police jackets. I asked Joe Losurdo, who co-directed the 2007 documentary You Weren’t There: A History of Chicago Punk, 1977–1984 with Christina Tillman, about this phenomenon. In an email, he told me: Like it was pointed out in You Weren’t There, the Chicago Punks from that era left the flag on their Chicago Police jackets. I actually used to have one that was handed down from a friend of my sister’s that had the Effigies painted on the arm. But I’ve heard that the reason they started wearing them was purely economical (with a little tongue in cheek). The Ramones-style biker leathers were a lot more expensive back then but you could get an old Chicago cop leather for cheap at this store that used to sell them. Can’t remember the name, but I think it sold surplus goods like Uncle Dan’s used to. Photo by Robert Loerzel The Alley, which calls itself “America’s Rock n’ Roll Dept. Store,” sells its own version of the black leather Chicago Police Jacket, featuring a city flag on one shoulder. It’s worth noting that Chicago has a law against using the city flag for anything other than “the usual and customary purposes of decoration or display.” The law has been on the books since the flag was created in 1917, with only minor tweaks in the language since then. This part of the ordinance seems to be directed at preventing commercial uses of the flag — an effort that may be unconstitutional, and is quite certainly futile. The fines for breaking this law are five to twenty-five dollars. The same ordinance also makes it illegal for anyone to add “any letter, word, legend or device” to the city flag’s image. Are you kidding? The city is overrun with images of the Chicago flag, on everything from souvenir stands (of course) to hot-dog joints. It’s everywhere. And then there’s the graffiti and street art… And politicians love to pose with the flag, or to throw some of those six-pointed stars onto their campaign signs. In one of its more ignominious appearances, the flag fills the screen in Spike Lee’s 2015 movie Chi-Raq, blood dripping from the red stars to symbolize Chicago’s plague of violence. Many Chicagoans have the city flag—or variations of it—inked onto their skins. Fuzzy Gerdes’s website Chicago Flag Tattoos showcases people who have chosen to permanently put six-pointed stars on their bodies. “One of the great things about the Chicago flag is how easily the design can be adapted yet remain recognizable — put four red things between two blue stripey things and there’s your flag,” Gerdes writes. Here’s a sample of comments on Gerdes’s website from city-flag-tattooed Chicagoans: Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com David Lind: I just have a pure love and fascination with Chicago, and the city’s flag is so simple in design, but so meaningful in description with the city’s rich history. My heart is within Chicago, so why not make it permanently tattoo it across my heart?! Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com Doug Sichmeller: Chicago has always been an important place to me. I love this city and am the fourth generation of my family to call it home. Besides that I had always loved the simple, yet iconic, design of the flag. Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com Caitlin, on whether people recognize her tattoo as the city flag: The people like you who are like “hey, what’s up, Chicago flag.” But a lot of people, even people who live in the city, don’t know what it is. They’re like, “OK, I see that everywhere, what is that?” And I’m like, “it’s the Chicago flag!” They’re like, “Get out of town.” Yes, it’s your flag. Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com Tim Chidester: They know it’s the Chicago flag. Even people out of state know what it is surprisingly. It’s a very recognizable flag. I’ve had a couple questions when I’ve been on gigs out of state where they’re like, ‘What is that?’ Mysteries of the city flag As we celebrate the centennial of the Chicago city flag, a few mysteries linger. ✶ What exactly happened with Big Bill Thompson’s law giving the stars five points? ✶ Where did that light shade of blue come from? The ordinance simply says the stripes should be blue, without specifying a shade. But that sky blue now feels like an important of the flag’s identity. ✶ Why are the four stars centered? From the very beginning, the law has said the stars should be grouped near the side of the flag that’s attached to the flagpole. And that remained the case even when the fourth star was added in 1939. The current ordinance says the stars should be “set side by side, close together, next to the staff.” If you followed the letter of the law, the flag might look more like this example from 1947, which is in the Chicago History Museum’s collection: The Chicago flag that circumnavigated the world, c. 1947. Chicago History Museum, ICHi-66334 But that’s not the flag Chicagoans have come to know and love. Perhaps it’s time to tweak the ordinance—so that it describes the flag as we actually know it. ✶ What happened to the original documents about the flag from the Chicago City Council meeting on April 4, 1917, when the design was approved? Moldy papers from council meetings in that era are stored in boxes at the Illinois Regional Archive Depository, in the basement of the library at Northeastern Illinois University. (And when I say “moldy,” I mean it literally.) But the box from April 1917 has a note saying that someone removed “12 folders pertaining to Municipal Flag documents,” including a “sample of flag.” Archive employees have told me this probably means that someone from the city government took those folders. But they don’t know who it was or where these files went. (I requested documents about the flag from the city clerk’s office and received several PDFs, none of which appear to be more than a few decades old.) Some of these missing documents might be the ones you can see over at the Harold Washington Library Center’s Municipal Reference Desk. But I suspect there were more. And what happened to that “sample” of the flag? ✶ How has the flag changed the city’s culture? Does it somehow make people feel prouder of the city where they live, even if they hate things about Chicago? Do people feel more like they’re marching “shoulder to shoulder” simply because they see those blue bars and six-pointed stars around Chicago? The answers are probably unquantifiable. ✶ Really, how did the flag become so popular? We can offer theories — like Chicagoans waving their municipal flag in the Vietnam War or punks buying police jackets — but it’s always challenging to pinpoint why anything grows in popularity. In the end, it all comes down to Wallace Rice’s design. Back in 1917, the publication Chicago Commerce predicted that Chicagoans “will always look upon the elements of their flag with pride and pleasure because in a way it is descriptive of their being and spirit.” I don’t completely buy that. As pervasive as the flag is in Chicago, I doubt that many people think or care much about the meanings of those stripes and stars. But they probably do like the way the flag looks. There’s something magical about Rice’s design. Simply put, it’s beautiful. Photo by Robert Loerzel Further reading ✶ Kori Rumore and Ryan Marx, “Chicago’s flag: The history of every star and every stripe,” Chicago Tribune, June 13, 2016. ✶ Whet Moser, “Why the Chicago Flag Is Such a Brilliant Design,” Chicago magazine website, November 19, 2014. ✶ John Hardberger, “Happy 100th Birthday to the Best Damn City Flag Ever,” Chicago magazine website, March 31, 2017. ✶ T.E. Whalen, “The Municipal Flag of Chicago,” a bibliography. ✶ Robert Loerzel, “Chicago’s Flag Is a Much Bigger Deal Than Any Other City’s Flag,” Chicago magazine website, August 22, 2013. ✶ Robert Loerzel, “In a divided Chicago, one thing we all agree on: A damn fine flag,” Crain’s Chicago Business website, April 4, 2017. Footnotes Endnotes citing the sources for this article are available as a PDF here. This article is © 2017 by Robert Loerzel. The photos (except for those credited to other sources) are also © 2017 by Robert Loerzel. ", "title": "The Story of Chicago’s Four-Star City Flag", "sentences": [{"a2d7": "The Story of Chicago’s Four-Star City Flag"}, {"09bc": "Wallace Rice covered the floor of his living room with colorful rectangles. He’d spent six weeks combining shapes and symbols, trying to find just the right image to represent the city where he lived. He’d come up with hundreds of possibilities for a city flag design, and now he displayed his favorites on that floor."}, {"9c11": "Anytime anyone visited Rice’s home in the Lincoln Park neighborhood — people including the author’s acquaintances as well as delivery boys and milkmen — he quizzed them: Which of these should be the city flag?"}, {"8406": "One design was the overwhelming favorite. It had two horizontal blue stripes and three white stripes. And there were two six-pointed red stars, positioned off-center in the middle white stripe."}, {"91e9": "Maybe it was something about those stars. Who had ever seen a symbol shaped like ✶ before? It was a “Chicago Star,” Rice later recalled:"}, {"699e": "After more than four hundred designs had been made by me, I finally struck upon such a six-pointed star as had never appeared in any flag before, peculiarly and singularly a Chicago star, made by a Chicagoan for his greatly loved city, by an American in the tenth generation in this country, whose ancestors had fought against Great Britain, for the most American of American cities."}, {"86ab": "The visitors at Rice’s home (at 2701 North Best Avenue, which is now called Wilton Avenue) weren’t the only ones who liked that design with the blue stripes and red six-pointed stars."}, {"5d76": "Rice won a contest the city was holding for a flag design — a contest he just happened to have written the rules for — and the City Council officially made it the municipal flag on April 4, 1917. A third star and a fourth were added later."}, {"a9b6": "As it turns a hundred years old, it’s arguably the most popular city flag in the United States. ✶✶✶✶"}, {"d8b4": "‘People love Chicago more because the flag is so cool’"}, {"80d2": "I made the case for the flag’s popularity in a 2013 Chicago magazine story, “Chicago’s Flag Is a Much Bigger Deal Than Any Other City’s Flag.” And I’ve also written an op-ed for Crain’s Chicago Business, “In a divided Chicago, one thing we all agree on: A damn fine flag.”"}, {"2174": "Roman Mars, a former Chicagoan who hosts the consistently fascinating 99% Invisible podcast, touted the city flag’s beautiful design in a March 2015 TED Talk. He said:"}, {"cf2e": "The design of the Chicago flag has complete buy-in with an entire cross-section of the city. It is everywhere. Every municipal building flies the flag. … It’s adaptable and remixable. The six-pointed stars in particular show up in all kinds of places. It’s a distinct symbol of Chicago pride. … And it isn’t just that people love Chicago and therefore love the flag. I also think that people love Chicago more because the flag is so cool."}, {"3d2f": "And as Mars noted, the flags for many other cities have rather lame designs."}, {"0e40": "The video of Mars’s engaging lecture has now been viewed more than 4 million times, inspiring people in other cities to seek new designs for their municipal flags. Here’s a sample of news stories from the last few years:"}, {"f967": "✶ “Boston’s vexing flag problem. Critics call the style ‘a seal on a bedsheet.’ It’s boring, yet unfortunately common.”"}, {"095d": "✶ “Milwaukee unveils new flag by Robert Lenz highlighting a unified future.” (More about the new “People’s Flag of Milwaukee.”)"}, {"e37f": "✶ “Know Lexington’s flag? Nobody does. Two groups say it’s time for a new one.”"}, {"9137": "✶ “Redding’s new flag will come from outside City Hall.”"}, {"7fb1": "✶ “Flag contest meant to show love for Joplin, but former mayor opposes plan”"}, {"986d": "✶ “South Bend seeks new design for city flag”"}, {"9246": "The movement for better city flags was already underway before Mars’s talk went viral, driven in part by the North American Vexillological Association. (Vexillology is the study of flag designs.)"}, {"d7c6": "Back in 2004, the Post and Courier reported on efforts to bring a new city flag to Charleston, South Carolina. That article quoted vexillologist Ted Kaye (author of Good Flag, Bad Flag: How to Design a Great Flag), as saying that Chicago’s flag showed the power of good design."}, {"982d": "“There also seems to be a correlation between good flags and how widely they’re flown,” Kaye said. “Chicago’s flag is used very widely — on all municipal buildings, on uniforms, bridge abutments. When a Chicago policeman dies, it’s not a U.S. flag on his casket, but a Chicago city flag.”"}, {"8161": "And in 2014, The Daily Oklahoman quoted Oklahoma City Mayor Mick Cornett using Chicago’s flag as an example of what a good city flag can be. It has “become a standard in that community,” he said."}, {"f74b": "Råvad’s Municipal Device"}, {"548b": "Twenty-five years before Wallace Rice’s flag become the standard, Chicagoans made an earlier stab at devising a municipal symbol. Chicago was getting ready to host the 1893 World’s Columbian Exposition, and it wanted to look sharp for all those millions of people who’d be coming to visit the bustling Midwest metropolis."}, {"f70a": "In 1892, the Chicago Tribune offered a one-hundred-dollar prize for the best suggestion of a municipal color or combination of colors that would symbolize the city. The local artist Francis Davis Millet explained why this was a good idea:"}, {"bd8f": "The ordinary failure in decorating streets and buildings is in trying to make a harlequin effect. If you remember the decoration at the time of the death of President Lincoln, where the people only used black and white, you will recall how striking, impressive, and artistic was the general effect. Now, in general terms, the facade of a building is best decorated with one color alone or with two or three colors properly arranged without any special regard to the employment of red, white, and blue. … Almost all European cities have chosen colors, as the universities and colleges have done, and these are called the “municipal colors.”"}, {"2373": "And the Tribune suggested that a municipal color scheme would boost Chicagoans’ sense of solidarity:"}, {"4a08": "Chicago’s unparalleled progress has been in no small degree due to the intense local pride and loyalty of its citizens of all classes. “Shoulder to shoulder, close ranks” has always been the watchword, and the consequence is a vast amount of justifiable civic pride which would doubtless welcome a chance to display itself in the display of a “municipal color.”"}, {"4b84": "Shoulder to shoulder? Describing Chicagoans as a unified bunch was wishful thinking. The city’s factions often seemed to be at war with one another, whether it was moralists denouncing the people who frequented saloons and brothels, or captains of industry battling against unions."}, {"189a": "Was it possible — or even desirable — that a symbol like a municipal color or a city flag would somehow bring all of these bickering clans into harmony? How much can any flag or symbol change the culture of a place?"}, {"90c2": "And yet, it was true that Chicagoans were proud of their bustling, growing city. The Rhode Island author Hezekiah Butterworth wrote in 1892 about visiting Chicago."}, {"06e5": "“Everything here seemed to be upon the march. Men and women lived in what they were doing,” he wrote. He heard a Chicagoan saying: “In Chicago we live two years in one, and that is the best life that demands all our energies. Chicago works; other cities play.” Butterworth perceived the truth when this Chicagoan succinctly proclaimed: “Chicago does!”"}, {"f951": "What color would best represent such a city?"}, {"c402": "Out of 829 contest submissions, the winner was a noted Danish architect who’d recently moved to Chicago, to design buildings for the World’s Fair, Alfred Jensen Råvad (who also used an Americanized spelling of his name, Roewad)."}, {"368b": "But Råvad did more than just suggest red and white as the city’s colors — he also offered a symbol. It was the shape of the letter “Y,” representing the Chicago River, whose branches form that pronged pattern."}, {"dcc0": "Råvad explained:"}, {"08b7": "I think it right to give a heraldic and graphic expression of Chicago, as it is and always will be divided by the river in three sides — North Side, West Side, and South Side."}, {"1aec": "The Citizens’ World’s Fair committee tweaked Råvad’s submission, specifying a brownish shade of red — terra cotta. Millet designed a flag featuring Råvad’s Y symbol. The Chicago Evening Post offered its praise in an editorial:"}, {"d503": "The Roewad design, besides being simple and artistic, is adapted to flag, gonfalon, or shield. Mr. Millet’s adaptation of it to the flag is one of the best things of its kind conceivable. If we are to have a city flag let’s have the Roewad flag. We can’t do better."}, {"bb3b": "Råvad’s scrapbook from the World’s Fair (now stored at the Chicago History Museum) shows how his symbol started to spread, appearing in advertisements, posters, and business cards."}, {"f787": "Chicago History Museum, ICHi-088680"}, {"6dbf": "But as Chicago magazine’s Whet Moser observes, “it was apparently not well received, judging by the Tribune’s pissy, defensive editorial about it.”"}, {"c6a5": "The newspaper said a “Chicago contemporary” had denounced the terra cotta color as “akin to that which predominates at the slaughter-houses near the stockyards,” and “sneered” at the design. The Tribune’s editorial concluded: “If the carpers have anything better to suggest they should bring it out and if they have not they may find other topics better suited to the display of their wit and envious criticism.”"}, {"1d97": "Råvad’s design didn’t become part of an official city flag. Eventually, in 1917, it was enshrined in a city ordinance: “The municipal device, for use by the varied unofficial interests of Chicago and its people, shall show a Y-shaped figure in a circle, colored and designed to suit individual tastes and needs.”"}, {"27b5": "Look closely, and you’ll see many examples of the municipal device in Chicago today."}, {"d364": "Alderman Kearns pushes for a flag"}, {"c01e": "In 1915, Republican alderman James A. Kearns began pushing the idea of creating a city flag. Kearns, an Irish immigrant, represented what was then the thirty-first ward, out on the city’s southwest edge. Back in 1909, he’d introduced the “novelty” of showing motion pictures during a campaign event at a “nickel house.” Now, he said:"}, {"4e7a": "In order to symbolize Chicago civic properly, to stimulate local patriotism, visualize industrial progress, and instill in school children a concrete evidence of the reality of the city of Chicago as a corporate community and civic organization, it is advisable to adopt a suitable design for a municipal flag."}, {"84fa": "In July 1915, the City Council approved Kearns’s motion to form a Municipal Flag Commission. Chaired by Kearns, with members including the respected painter Lawton Parker, this group really did its homework. Working with municipal reference librarian Frederick Rex (“a man who could put his finger on any quotation a person asked for out of 200,000 books and pamphlets”), the commission published a detailed report about other municipal flags."}, {"ca3e": "Observing that sixteen United States cities with populations over thirty thousand had flags, the report noted: “Chicago has been far behind other cities in the adoption of a municipal flag.” It continued:"}, {"5571": "Usually the adoption of a municipal flag by a city indicates its awakening to a new civic spirit of the highest order, the possession of broader and more far sighted municipal conceptions and convictions and the dawn of a community spirit devoid of the bickerings of political parties and of self-seeking private interests or individuals. A municipal flag will arouse civic pride and allegiance to home industry and form a rallying point for the plans and deeds which make for better conditions and better citizens. A municipal flag instills a sense of duty towards the community and city into the hearts of citizens and children, engendering that spirit of progress which serves to make a city or a community great. Such sense of duty develops a sense of public spirit which basically is the keystone of city building and planning."}, {"25c8": "The father of the flag"}, {"ab7c": "As the city held a contest for a flag design, it turned to Wallace de Groot Cecil Rice to write the rules. “He has been interested in flags from his infancy, one of his childhood pastimes being inventive use of colored paper and mucilage,” the Chicago Daily News reported."}, {"f57b": "Although he was born in Hamilton, Ontario, Rice had moved to Chicago when he was two years old, in 1861. His father, John A. Rice, owned three legendary Chicago hotels at various times: the Sherman House, the Grand Pacific, and the Tremont House."}, {"fbe4": "Wallace Rice studied at Harvard University, earned a law degree and was admitted to the bar — but instead of pursuing a career as a lawyer, he became a newspaper reporter, drama critic and book critic."}, {"66bb": "Rice dressed immaculately, often wearing silk hats. Like many of Chicago’s prominent journalists, he was in the infamous Whitechapel Club. As Rice recalled, it was “a little party of Bohemians” that began meeting in 1888, taking its name from the London neighborhood where Jack the Ripper was on his murderous rampage. The club met in chambers ghoulishly decorated with actual human skulls, hangman’s ropes and a coffin-shaped table."}, {"6286": "The group hit its pinnacle of notoriety on July 16, 1891, when its members conducted a funeral pyre in Miller Beach, Indiana, burning the body of the Dallas Suicide Club’s president, who’d killed himself and left a request to be reduced to ashes. Showing his flair for the dramatic, Rice recited a poem, proclaiming: “Death’s a dear friend to him whose life is blighted.”"}, {"a29d": "Rice wrote histories of gas companies, hotels, and stock exchanges; later, he collaborated with the legendary Chicago lawyer Clarence Darrow on an anthology called Infidels and Heretics. (Rice and Darrow were both early members of the Society of Midland Authors.)"}, {"8739": "He wrote newspaper columns about grammar, including one that declared “ain’t” is acceptable English. “Ain’t has a pleasant sound, once the ears are unstopped of prejudice,” he insisted."}, {"ef9d": "Rice wrote pageants for historical occasions. Around the same time when he designed the Chicago city flag, he also created a flag for the centennial of Illinois."}, {"c093": "And he wrote the script for “The Masque of Illinois,” a spectacle staged on the Illinois State Fair Grounds in Springfield. The program called it “an attempt, believed to be the first of its kind ever made, to interpret by means of symbol and allegory the 245 years (1673–1918) of the history of the Illinois Country.”"}, {"41b8": "Rice’s ideas for showing history through dance and song would now seem hokey and sometimes politically incorrect. A sample:"}, {"8550": "Illinois is first shown surrounded by her Prairies, Rivers, Forests, and flowers, which may be taken as standing for our natural resources. Upon this primitive and idyllic peace Fear intrudes, accompanied by a band of Indians, who dance War and Squaw Dances. They are frightened away by the coming of the French (1673). Joliet, La Salle, and Tonty, are shown as symbolizing certain of the gifts the French brought to us; religion, the most valuable of these … The gayety of France is also shown in a little dance, which is interrupted by the coming of the British…"}, {"13ee": "In 1917, as the United States plunged into World War I, Rice wrote the lyrics of “Freedom and Glory,” a song for the Army and the Navy played by the Great Lakes Naval Training Station Band and other military outfits."}, {"3858": "The song proclaimed:"}, {"6152": "Freedom! Glory!off to war are we,To fight the fight for Godand right along the land and sea."}, {"3390": "Rice also lectured on heraldry and flag design at the Art Institute. As Moser observed in Chicago magazine, Rice “was a classic turn-of-the-century polymath.”"}, {"4cd3": "Rice’s rules"}, {"ead0": "Here are the rules Rice spelled out for the city flag contest. They still stand today as sound advice for good design:"}, {"2675": "Rule 1. The municipal flag should have significance, heraldric and other. The space or area to be utilized is so limited by its terms and the conditions so insistent, that there is neither room nor reason for colors and designs which do not make for a Chicago flag."}, {"4f9c": "Rule 2. Since the municipal flag of the City of Chicago is always to be flown in conjunction with the Stars and Stripes, all designs for a municipal flag submitted by competitors should be colored and patterned with special reference to such continued and inevitable use."}, {"e784": "Rule 3. The municipal flag should not only be symbolic of the City of Chicago, but also typify its ideals and aspirations, its history, its geographical and political divisions, and its people, so far as possible; but it should display knowledge of heraldric and other symbols already assigned definite meanings."}, {"8472": "Rule 4. The municipal flag should be beautiful, to the point of decorativeness. The colors should contrast effectively and the divisions of the design accord symmetrically."}, {"1f4d": "Rule 5. The municipal flag should be simple. Elaboration at any point, whether by multiplicity of colors or minute subdivisions of design, will destroy its chief purposes."}, {"618a": "Rule 6. The municipal flag should be the symbol and emblem of a free people in a free city and for this reason devices peculiar to the Old World and other foreign countries should be omitted from the design of the municipal flag for the City of Chicago."}, {"a086": "Rule 7. The municipal flag should be original. It should not resemble closely in coloration or design any other flag whatsoever."}, {"7727": "Rule 8. The municipal flag should be contrived and designed with prime reference to the fundamental fact that it is to be made from fabrics, cotton, bunting, silk or other material which can be readily cut and stitched."}, {"c312": "Rule 9. The symbols and details on the municipal flag should be such as will work out particularly by cutting and stitching fabrics. Nothing that requires to be painted on, as landscapes, unconventionalized birds and beasts or natural objects in general, should find place, demanding as they frequently do, separate treatment for the two sides of the flag. No lettering, either of initials, words, mottoes or figures, will be permitted or considered on a municipal flag design. The municipal flag should be alike on both sides for the sake of simplicity and for ease of manufacture."}, {"ab16": "Rule 10. The municipal flag should conform in its sizes, shapes and proportions to those which custom and experience have established as suitable."}, {"bb04": "Rule 11. The use of the colors and designs of the municipal flag as a banner to be hung vertically rather than flown horizontally, and as a badge, button or other device to be worn on the person may well be taken into consideration, and its colors and design be made adaptable to such ends when practicable."}, {"f56c": "Rice also offered a list of “suggestions,” including one that addressed the tricky issue of how a flag looks as it is rippling in the wind:"}, {"4d02": "The municipal flag should be designed with some practical knowledge derived from observation of the proportions of flags flown to the breeze, and of the portions or parts of such flag coming first into view and also oftenest in view. For this purpose it is desirable that certain elementary facts should be considered, as [1] the lower corner next the staff is the first to show when the flag lifts itself from pendency; [2] the line of flag next the staff is visible before its middle third is disclosed; [3] the whole of the first third of the flag is in view before the last third, the fly, is seen; [4] the upper of the fly is not seen until the rest of the flag is streaming. It is evident from such study and observation of the properties of flags that horizontal divisions, bars and stripes, flow and stream with the stream and flow of the flag and that vertical divisions, cantons, quarters and piles act against and interrupt these. The former, therefore, make for beauty, distinctiveness and visibility; the latter against them."}, {"0488": "Considering that Rice wrote the rules, it isn’t surprising that he won."}, {"3fe6": "More than a thousand entries poured in. “Many of them looked pretty well on paper, where every part of the pattern is seen equally well, but would not have shown to any advantage dancing in a variable breeze, which is the only test of a flag,” the Tribune later reported."}, {"d295": "One proposal used that “Y” shape symbolizing the branches of the Chicago River. But as this Tribune article pointed out, Chicago isn’t the only city with a Y-shaped confluences of rivers. That device wasn’t distinctive enough. The Tribune described some of the other rejected designs:"}, {"fd2e": "Many designs submitted showed from eight to twelve different and conflicting colors — as many as the designers happened to have in their boxes of crayons or paints. One ingenious person, who had heard of Chicago as a melting pot of humanity, placed a large black pot in the middle of his design, with red flames overflowing from it."}, {"9db9": "By a unanimous vote on April 4, 1917, Chicago’s aldermen approved Wallace Rice’s design for municipal flag."}, {"389e": "“Chicago now has an expressive and beautiful municipal flag,” the publication Chicago Commerce commented."}, {"c565": "At the end of April 1917, an auto dealer named Henry Paulman was the first person who was reported to fly the city’s new flag. He displayed it at his Pierce-Arrow showroom at 2420 South Michigan Avenue, in an area known as Motor Row."}, {"600a": "On May 30, Rice went along with Mayor William Hale Thompson and a delegation of city officials to the downstate town of Evansville, where the mayor dedicated a monument to the late James Thompson, who’d been Chicago’s first land surveyor back in 1830. (The mayor, nicknamed Big Bill, wasn’t related to the surveyor.)"}, {"e89a": "This ceremony was the first time Chicago’s municipal flag was ever displayed outside of the city. Rice later recalled telling the mayor about the significance of those six-pointed stars, explaining it “in detail.”"}, {"e13a": "Mayor Thompson, who hadn’t taken an active role in the flag’s selection process, “openly expressed” his “enthusiastic approval,” according to Rice."}, {"6d47": "What the flag means"}, {"19b9": "Recent documents from the Chicago City Clerk’s office offer a simple explanation of the flag’s symbols. Those two blue bars represent the branches of the Chicago River. And from top to bottom, the white stripes stand for the North Side, the West Side and the South Side."}, {"6839": "The blue stripes"}, {"77db": "But Rice’s original ideas about those stripes were more complicated. He noted that blue was “the color of the Lake and River, of distant mountains, and of the Oceans.” The flag’s top blue stripe stood for the Chicago River’s North Branch, but Rice said it also had a “national” meaning — the Allegheny Mountains. And it had a “terrestrial” meaning, symbolizing the Atlantic Ocean and the Great Lakes. But Rice wasn’t consistent about all of this. Another time, he said the top blue stripe stood for Lake Michigan and the river’s North Branch."}, {"6011": "The bottom blue stripe was a symbol of the Chicago River’s South Branch, but for Rice, it had similar layers of multiple meaning. From a national perspective, it signified the Rocky Mountains and the Sierras. And from a global viewpoint, it represented the Pacific Ocean and Gulf of Mexico. On another occasion, Rice gave a different explanation for the bottom blue stripe, saying it stood for the river’s South Branch and “the great canal” — referring to the Illinois and Michigan Canal and/or the Chicago Sanitary and Ship Canal."}, {"43d5": "The white stripes"}, {"e798": "Rice did not think of the white stripes as a neutral background. “It is white, the composite of all the colors, because its population is a composite of all the nations, dwelling here in peace,” Rice said."}, {"7759": "The flag’s top white stripe “stands locally for the North Side, nationally for the Atlantic Coast, and terrestrially for the countries east and north of the United States,” Rice wrote."}, {"8d88": "The middle white bar “stands locally for the West Side, nationally for the Great Central Plain dominated by Chicago, and terrestrially for the United States.”"}, {"1597": "And the white bar across the flag’s bottom was “stands locally for the South Side, nationally for the Pacific Coast, and terrestrially for the countries west and south of the United States.”"}, {"663b": "It’s no wonder that these ideas have been simplified over time."}, {"381b": "The middle white stripe is twice as wide as the other two — symbolizing the fact that the West Side was larger than the North Side and South Side were. Rice called it “the great West side, with an area and population greatly exceeding that of the other two sides.”"}, {"5ec0": "That assertion might surprise today’s Chicagoans. The West Side, as most people think of it now, no longer dwarfs the city’s other sides. That’s because our concept of the city’s layout has evolved. During Chicago’s first century, people often referred to its three sides: the North Side, the West Side and the South Side. Sometimes, these were called the city’s “divisions.”"}, {"197b": "That Y-shaped Chicago River, with its branches, was commonly accepted as the dividing line between these sections of the city. If you look at the city that way, the West Side is large indeed, encompassing everything west of the river’s branches."}, {"b532": "1880 map by the West Chicago Park Commissioners (image: Boston Public Library)"}, {"bfe7": "The construction of expressways after World War II created new dividing lines. And today, people commonly talk about the Northwest Side, the Southwest Side and other areas, parceling up the city into smaller subsections. Depending on how you define its boundaries, the West Side may actually seem like a fairly small chunk of the city today."}, {"da9d": "Rice saw other meanings in the flag’s numbers of symbols. Why were there two stars? Because Chicago was the second-biggest city in the United States. And if you added the two blue stripes to the two red stars for a sum of four, that signified the idea that Chicago was “the fourth city of the globe.” (If Chicago actually was the world’s fourth-largest city at the time, it has fallen way down in those rankings since then.)"}, {"e0b3": "A page from the October 2, 1921, Chicago Herald and Examiner, posted on the Chicago Detours website."}, {"1037": "The flag’s geometry"}, {"f7e5": "Rice wrote out very specific instructions for the size of the stripes and the shape of the stars."}, {"b669": "But when aldermen voted on the flag’s design, they kept things simple — and a little vague. For one thing, the ordinance doesn’t say anything about white stripes. Instead, it describes white as the flag’s background color: “The Chicago municipal flag shall be white, with two blue bars…” Then it declares that each of these blue bars is one-sixth of the flag’s width."}, {"6e5b": "The city’s law then offers some wiggle room about exactly where those blue stripes should go. They are supposed to be “set a little less than one-sixth of the way from the top and bottom of the flag, respectively.”"}, {"3a81": "A little less? How much less? The law doesn’t say."}, {"8203": "Chicagoan Ted Whalen, who has researched the city flag’s history, suggests that the vague language may actually be what Rice intended. Rice’s suggestions in the flag-design contest included this advice:"}, {"fad4": "The visibility at distances of the several colors and of the different portions of the flag itself should be taken into account in determining its proportions, rather than divisions of mathematical exactitude. In other words, it is the effect of symmetry, not the mere physical fact, which should be taken into account. The French, for example, after extensive experimentation, divide their tricolor so that the blue next the staff has thirty parts in a hundred, the white in the middle thirty-three parts, and the red in the fly thirty-seven, and thus secure the appearance of an equal division."}, {"299e": "Whalen says: “I suppose this explains why all the descriptions of the flag have tortured syntax — the ‘slightly less than a sixth’ language. Rice wanted the white and blue stripes to appear to have the same width, and so they must be slightly different.”"}, {"96e8": "The stars"}, {"8b37": "As far as the stars go, the ordinance does not spell out their exact dimensions. It just says they should have “sharp points.”"}, {"e4c6": "The flag’s original two stars symbolized significant events in the city’s history:"}, {"77fe": "The Great Chicago Fire of 1871:"}, {"434e": "And the World’s Columbian Exposition of 1893:"}, {"1748": "A new flag at a time of war"}, {"2a45": "The Chicago City Council approved Rice’s flag design on the same day when the United States Senate voted for America to go to war in Europe. Not surprisingly, the news about the city flag was buried. The Tribune’s front page was filled with headlines about the war."}, {"2731": "Chicagoans were torn apart by America’s entry into the Great War against Germany. Thirty percent of the city’s people in 1910 were either German immigrants or children of German immigrants. (Another 13.5 percent were Austrian.)"}, {"03fa": "That same week, the Tribune published a letter from a local German-American named C. Kotzenabe:"}, {"26b7": "As a German by birth it is a horrible calamity that I may have to fight Germans. That is natural, is it not so? But as an American by preference I can see no other course open. … It sickens my soul to think of this nation going forth to destroy people many of whom are bound to me by ties of blood and friendship. But it must be so. It is like a dreadful surgical operation. The militaristic, undemocratic demon which rules Germany must be cast out. It is for us to do it — NOW."}, {"867a": "William Hale Thompson"}, {"7e2f": "Chicago’s Republican mayor at the time, William Hale Thompson, was outspoken against the war. Federal prosecutors even talked about putting him on trial: “He should know that the penalty for treason is hanging,” one remarked."}, {"e343": "Thompson’s crusade for isolationism eventually led to a fight over the Chicago city flag. After serving two terms as mayor, from 1915 to 1923, the colorful politician left City Hall, replaced by Democrat William Dever."}, {"fed5": "But then Thompson roared back in the election of 1927, accusing the Dever administration of pushing pro-British propaganda in Chicago’s schools."}, {"2609": "Thompson even threatened to punch the king of England “on the snoot” to “keep him from annexing the U.S.A. as a British colony.” In their 1953 biography, Big Bill of Chicago, Lloyd Wendt and Herman Kogan described one of Thompson’s campaign speeches:"}, {"5c07": "… the crowds pushed in for the show. When they finished singing “America First, Last and Always,” and Bill had been introduced as one of the greatest living Americans, he lumbered forward, grinning his crooked-tooth grin, his brown eyes gleaming with pleasure. He drew his big hands from his pockets, cracked them together over his ample paunch… Then, after dealing with … assorted local issues, Big Bill tore into King George."}, {"cb26": "“I wanta make the King of England keep his snoot out of America!” he cried huskily. “That’s what I want. I don’t want the League of Nations! I don’t want the World Court! America first, and last, and always! That’s the issue of this campaign. That’s what Big Bill Thompson wants!”"}, {"5477": "He advanced toward an American flag hanging from a staff on the platform, embraced it and shrieked, “This is the issue of this campaign! What was good enough for George Washington is good enough for Bill Thompson!”"}, {"2a5a": "The press and Big Bill’s political opponents acted like he’d lost his mind. His “troubles are mental,” Mayor Dever said. The New York Evening World reported:"}, {"cef2": "Bill Thompson’s issue is the infamy of the English and the tyranny of King George V.! … Great crowds who hate England scream their approval. … Big Bill Thompson speeds over the city like a modern Paul Revere warning the patriots of the dangers of oppression under King George."}, {"6082": "Over in England, The Guardian commented: “the oddest thing about this story is that it is not a dream like ‘Alice in Wonderland’…”"}, {"1100": "Thompson may have seemed like a kook, but one of his biographers, Charles Bukowski, saw a rational explanation for his seemingly bizarre tirades:"}, {"2a86": "Every charge, no matter how absurd on the surface, served a purpose. … To the literal-minded, talk about George V (or III, Thompson was not always clear which one he meant) and the threat of “handing the king one on the snoot” were nonsense. But observers were too far removed from the lives of ordinary Chicagoans to understand: Thompson offered his audience a double dose of emotional release. His “king” could just as well be their “boss,” “millionaire,” or “newspaper publisher,” along with “czar,” “emperor,” or “kaiser.”"}, {"3794": "Thompson won the election. Back in control at City Hall, he pushed the school board to oust the superintendent, accusing him of trying to indoctrinate the kids with pro-British propaganda. Thompson ordered that no lions should be carved on new school buildings, because he saw lions as a symbol of England."}, {"5e64": "And then the mayor took a close look at the city flag. And he thought: Isn’t there something British about those six-pointed stars?"}, {"9730": "How many points?"}, {"9dfd": "On February 1, 1928, Thompson was leaving for a vacation in New Orleans on a special train decked out with flags when the municipal flag caught his eye. An Associated Press story noted that the city flag was “generally forgotten” at this point in history, eleven years after its approval."}, {"7037": "Big Bill zeroed in on those ✶ stars — as the AP described them, these were “the stars of the British Union Jack.”"}, {"1e42": "Thompson pointed to to ★ symbols on an American flag nearby and said: “The stars in that banner have five points. Draw up an ordinance at once changing the stars of the Chicago flag from the British to the American type.”"}, {"5a1b": "The previous year, someone named “A.F.” had written a letter to the Tribune, complaining about the city flag’s “six-pointed English stars.” The letter mentioned a legend about Betsy Ross."}, {"b7f4": "The famous flag-maker’s family told a story about how she’d changed the design of the American flag when a Congressional delegation came to her Philadelphia sewing shop in 1776 with a drawing of a proposed flag for the new country. Almost a hundred years later, Ross’s daughter, Rachel Fletcher, recounted what happened:"}, {"876f": "… the stars were six-pointed in the drawing, and she said they should be five pointed. That the gentlemen of the committee and General Washington very respectfully considered the suggestions and acted upon them, General Washington seating himself at a table with a pencil and paper, altered the drawing and then made a new one according to the suggestions of my mother."}, {"2d0b": "There’s no documentation to back up this story, but it was passed down in the Ross family, according to historian Ed Crews. “Today, historians almost uniformly agree that family oral history is not particularly reliable,” he wrote."}, {"c1ec": "In any case, there’s nothing especially British about six-pointed stars. For one thing, the Union Jack does not actually have any stars on it, either ★ or ✶."}, {"a488": "Acting on Mayor Thompson’s orders, Chicago’s corporation counsel, Samuel A. Ettelson, quickly researched the question of how many points the stars should have. Checking with the municipal reference library, Ettelson discovered that “the only national flags using stars of more than five points are those of the Australian Commonwealth, the Zionists of Palestine and New South Wales.” Ettelson wrote up an ordinance that would change the flag’s stars to five-pointed ones."}, {"9ad7": "This provoked a passionate plea from Wallace Rice against changing the stars. He told the Tribune:"}, {"7df6": "I purposely made the stars six-pointed. Five point stars are the symbols of states and could manifestly have no place in a municipal flag. Mayor Thompson is making not only himself but the flag ridiculous by ordering the change."}, {"84f0": "Rice shot off a five-page missive to Ettelson, explaining in detail why the stars had six points:"}, {"e75b": "… so far from being a copy of or echo from the Old World, the Chicago Stars are that and nothing else, a unique form never before used in a flag or in heraldry, especially contrived and designed by me to meet local conditions as exist nowhere else, with a wealth of apt significance quite without parallel."}, {"6f32": "Rice said he’d relied on Arthur Charles Fox-Davies’s book A Complete Guide to Heraldry for guidance about stars."}, {"7899": "That book describes five-pointed stars as “Scottish stars.”"}, {"cbc0": "As Rice pointed out, the book doesn’t include any six-pointed stars like the ✶ ones on his flag:"}, {"e0e8": "This will also establish the important fact that the Chicago Stars I set in our municipal flag are quite unknown to the heraldric art and in consequence to flag-designing, and are not merely American in the sense that they were contrived by a man who has, by accident of birth, every line of descent centering in him in this country before the year 1650, and who has been a resident of Chicago since June, 1861, and has never known another home, but are the painstaking result of thinking out a design that will be of the essence of Chicago."}, {"e5e6": "Rice said that five-pointed stars symbolized sovereign states, so it wouldn’t make sense to use them on a city flag."}, {"6324": "And Rice talked about the meanings of the stars. He said the Chicago Fire of 1871 was “the greatest material event in our local history” and the 1893 World’s Fair was “the greatest event in our local history on the finer sides of life, including the Congress of Religions, art in every known form, music, literature, and calling as never before upon our civic spirit and generosity.”"}, {"0c5b": "The red color of the stars symbolized the flames of the 1871 fire, as well as the “rejoicing” at the World’s Fair, he said."}, {"9499": "On the star representing the 1871 fire, the six points symbolized ✶Transportation, ✶Trade, ✶Finance, ✶Industry, ✶Populousness, and ✶Healthfulness. “Can our material ambitions be more briefly and comprehensively set forth and can they be better and more simply symbolized than by these six sharp points in the Chicago Star?” Rice wrote."}, {"4af1": "On the star representing the 1893 expo, the six points symbolized ✶Religion, ✶Education, ✶Aesthetics, ✶Beneficence, ✶Justice, and ✶Civism (or civic spirit). Rice wrote:"}, {"40a0": "Here in a single simple symbol, especially designed for the Chicago occasion, are comprehended a city of churches innumerable, a city with more degree conferring institutions of the first rank than any other other and with some of the world’s greatest libraries, the city of the Art Institute, the Chicago Orchestra, the Civic Opera, uncounted schools of music, of drama, of painting and sculpture, its literature including poetry commanding the world’s attention, the city of countless charities amounting to many millions annually and huge gifts for every good work in all directions, the city of the Juvenile Court, the Court of Domestic Relations and other greatly needed and widely copied means of dealing with the unfortunate, and finally, the city of such civic spirit that the Chicago Plan flourishes beyond earthly precedent and every worthy enterprise conceivable to the mind of man is encourage beyond example anywhere."}, {"b3a2": "Rice said his star’s points should have a thirty-degree angle, making them look sharply pointed — “acutely sharp for Chicago’s forward thrust and enterprise.” (Helpful hint: You can copy and paste a symbol of the Chicago Star: ✶) They looked distinctly different from the famous six-pointed Star of David. Rice took umbrage at seeing city flags with thick-pointed stars, like this photo that appeared in the Chicago Herald and Examiner on February 2, 1928:"}, {"16b7": "Chicago Herald and Examiner"}, {"91c8": "Those are “not Chicago Stars at all, either in size or shape,” Rice said. He wondered if Mayor Thompson’s displeasure with the stars was actually caused by incorrect flags like the one in the photo."}, {"352a": "Incorrect stars were being “allowed to creep into the flag” because people weren’t consulting the official design, he said. (Whalen explored the geometry behind the variable shape of Chicago stars in this 2004 blog post, along with this follow-up in 2005."}, {"6af0": "In spite of Rice’s plea, the Chicago City Council unanimously voted on February 15, 1928, to change the city flag’s ✶ stars to five-pointed stars."}, {"03ab": "But then, strangely, this new version of the flag apparently never made it into the city’s ordinance books."}, {"15f4": "Whalen pointed out this puzzle in a blog post: “all the printed and bound editions of the code that the Municipal Reference department can produce all have ‘six in number’ language.”"}, {"8f01": "Chicago City Council motion, Illinois Regional Archives Depository"}, {"17d1": "A short time after Thompson won his vote for five-pointed stars, the mayor had a mental breakdown, according to Wendt and Kogan’s biography. “He drank constantly, gabbled hysterically and spoke irrationally,” they wrote. Thompson went into hiding in the Wisconsin woods, and the city’s lawyer, Ettelson, effectively took control of City Hall for a while."}, {"96e6": "By the time Thompson finished this third and final mayoral term in 1931, many people regarded him as an embarrassment. Summing up what the critics said, Wendt and Kogan wrote:"}, {"938b": "He has given the city an international reputation for moronic buffoonery, barbaric crime, triumphant hoodlumism, unchecked graft and a dejected citizenship. He nearly ruined the property and completely destroyed the pride of the city. He made Chicago a byword of the collapse of American civilization."}, {"4329": "No other Republican has won election as Chicago’s mayor since Thompson. In a 2016 article, Chicago Tribune reporter Ron Grossman compared Thompson to Donald Trump, calling Big Bill “a mayor who could match the most narrow-minded politicians of any era in chest-thumping xenophobia.”"}, {"6491": "Municipal Reference Desk, Chicago Public Library"}, {"2ea5": "Thompson was still serving as mayor in 1930 when the Municipal Employes Society featured the city flag on the cover of its quarterly bulletin. The newsletter’s article mentioned that the flag had “two five-pointed stars.” But strangely, the cover illustration showed a flag with three six-pointed stars. ✶✶✶ Were city employees rebelling against Big Bill’s pentagrams?"}, {"a202": "The editors noted that another world’s fair was coming up in three years. “When the Century of Progress Exposition is a thing of the past, no doubt the City Council will then take appropriate action for a third star on the Municipal Flag.”"}, {"c139": "Adding a third star"}, {"c442": "And that’s just what happened. As Chicago hosted the Century of Progress expo in the summer of 1933, the Tribune reported that many Chicagoans were noticing their city’s flag for the first time, thanks to flag displays at the fair and on State Street’s stores. “Most of them, however, did not recognize the flag as Chicago’s own emblem,” the newspaper said."}, {"8b78": "That October, aldermen voted to add a third star to the city’s flag, commemorating the world’s fair, which continued for another year. And in case there was any doubt about the number of points on those stars, the vote confirmed that they were six-pointed."}, {"181b": "According to a city document, the six points of the newest star represented the various governments that dominated the land where Chicago stands today: ✶France, 1673; ✶Great Britain, 1763; ✶Virginia, 1778; ✶Northwest Territory, 1798; ✶Indiana Territory, 1802; and ✶Illinois Statehood, 1818."}, {"cd70": "And then, there were four stars"}, {"d6dc": "Six years later, the City Council added a fourth star, symbolizing Fort Dearborn, the American military garrison built in 1803 on the site of the future city. The fort’s soldiers fought in an 1812 battle with Native Americans. A group called the Fort Dearborn Memorial Commission suggested adding a star to commemorate “Fort Dearborn and the gallant men who served there.” Aldermen unanimously approved the idea on December 21, 1939."}, {"ae2a": "City documents list the meanings of the six points on this fourth star: ✶World’s Third Largest City; ✶Urbs in Horto (the city’s Latin motto, meaning “City in a Garden”); ✶“I Will” Spirit (another city motto); ✶The Great Central Market; ✶The Wonder City; and ✶The Convention City."}, {"567a": "Even though the Fort Dearborn star was added last, it represents the earliest of the four historical events, so it was essentially inserted in front of the other three stars."}, {"ccea": "A fifth star?"}, {"c5e6": "Over the decades, people have occasionally suggested adding a fifth star to the flag. One idea was a star representing the French explorers Joliet and Marquette. And then in 1961, a fifth star was suggested to represent Chicago’s role as the birthplace of the atomic age. (The first human-made self-sustaining nuclear chain reaction took place December 2, 1942, at the University of Chicago.) “I think we’ll explore this,” Mayor Richard J. Daley said. But nothing came of it."}, {"f8d5": "Richard J. Daley. Photo by László Kondor, UIC"}, {"f7aa": "After Daley died in 1976, the City Council approved a resolution calling for a fifth star — a ✶ symbolizing the long-serving Democratic mayor. The resolution was replete with flowery language:"}, {"bd32": "… Whereas, Now the citizens of Chicago are in agreement that there is a fifth significant event which should be commemorated, that is the twenty-one years of faithful service and leadership achieved by our beloved Mayor Richard J. Daley; and"}, {"4676": "Whereas, The City itself is a monument to Mayor Daley since its magnificent lakefront, its gleaming skyscrapers and its diverse neighborhoods are the result of his enthusiasm for and love of his City; a love that was contagious and was infused into the hearts of all who knew and talked to him, whether corporate president, or shopkeeper or working man; and"}, {"ac0c": "Whereas, No granite monument, no photographer’s eye, nor artist’s pen could ever adequately capture his quick wit, his jaunty step, his vigorous attack on the problems of the City and its people; and"}, {"975a": "Whereas, A fitting symbol of Mayor Richard J. Daley’s spirit would be a fifth star added to the City’s flag because his life and energy were devoted to making this City a better place for all to live and work and his years among us were surely one of our City’s most significant eras, comparable even to the City’s Founding; …"}, {"b590": "But the aldermen never voted on an ordinance that would actually change the law to add the fifth star."}, {"c8fa": "Out of obscurity"}, {"a23f": "In spite of its lovely design, Chicago’s city flag was not widely known or popular for decades."}, {"6eb3": "In 1948, Mayor Martin Kennelly started “a one man crusade” to educate Chicagoans about their flag. He kept a pile of postcards showing the flag in his desk and handed them out to City Hall visitors."}, {"7d22": "“I didn’t know what the flag was until I was elected,” he said, “and I didn’t learn what it meant until recently when I presented one to the Art Institute. I think it’s a fine thing for buildings to fly the city flag.”"}, {"63c2": "In 1958, the Tribune reported:"}, {"afd0": "Lloyd Schumacher raised a Chicago flag outside his hardware store at 3634 N. Central av. a month ago and since then has been busy answering questions."}, {"c3c4": "Few people recognize the city’s flag, Schumacher said, and have mistaken it for everything from the flag of Israel to that of one of the Scandinavian countries. It’s gotten to the point, he said Monday, that he’s so busy answering questions there is little time left to sell tenpenny nails or a brace of carpenter’s tools. Schumacher said he is displaying the Chicago flag because he is a booster of the city and doesn’t think the flag is seen often enough. He plans to keep flying the flag."}, {"b078": "And in 1959, the Chicago American reported:"}, {"bdaf": "You have to look far and wide to find a flag of Chicago in the city. In fact, you have to look farther and wider before you can find a Chicagoan who knows the city has its own flag."}, {"5c2f": "One of the few buildings flying the colorful four-star flag is City Hall. A police was asked by a reporter if he knew what flag was displayed next to the Stars and Stripes on the La Salle street side of the building. The policeman pondered a moment. Then his face came alive with inspiration. He replied: “That’s in honor of Israel, I think. You notice that the stars have six points.” …"}, {"6818": "A check of flag manufacturers and distributors in the city showed few have any variety of sizes of Chicago flags in stock — if they have them at all. A Loop distributor volunteered: “We just don’t get many calls for them. You can see for yourself. It’s on the City Hall, but where else?”"}, {"6d7a": "In the late 1960s, Daley may have boosted the flag’s visibility by sending flags to Chicagoans serving in the Vietnam War. After he sent a flag to Lance Corporal David Marchi, the soldier wrote a letter to the mayor: “As you can see in the pictures, I am keeping the flag flying high. You’d be surprised how it boosted morale when some of the men found out my mayor sent it to me. They are now sending away for flags also.”"}, {"a2bc": "An art display now on the Harold Washington Library Center’s third floor includes a large photo showing a Chicago flag flying in 1970 at an American encampment in Vietnam. Combat photographer Laszló Kondor took the photo from the top of a moving tank, and it’s now part of the National Veterans Art Museum’s collection, which also includes the actual flag pictured in the photo (which is online at the museum’s website)."}, {"556a": "The Tribune reported that Chicago police officers had begun wearing a patch of the city flag on their right sleeves on May 1, 1971. The Police Department’s annual report, published a month later, included a photo of an officer with the patch. The Tribune’s “Finds” columnist, Susan Nelson, noted:"}, {"c0b5": "Anyone may wear a city flag patch on his own, an Officer Friendly told us. Find them where the policemen and other uniformed public servants shop — at Kale Uniforms, 532 W. Roosevelt Rd. Cloth-backed flags are 25 cents; vinyl-backed flags (for leather jackets) are 50 cents."}, {"526d": "With police officers wearing ✶✶✶✶ on their shoulders, one might expect the flag would become a symbol of authority and the establishment. You know — The Man. But the flag also became popular with the sort of people whom we might call the counterculture. For example, Chicago punk rock musicians and punk fans began buying leather police jackets."}, {"9385": "I asked Joe Losurdo, who co-directed the 2007 documentary You Weren’t There: A History of Chicago Punk, 1977–1984 with Christina Tillman, about this phenomenon. In an email, he told me:"}, {"ceb9": "Like it was pointed out in You Weren’t There, the Chicago Punks from that era left the flag on their Chicago Police jackets. I actually used to have one that was handed down from a friend of my sister’s that had the Effigies painted on the arm. But I’ve heard that the reason they started wearing them was purely economical (with a little tongue in cheek). The Ramones-style biker leathers were a lot more expensive back then but you could get an old Chicago cop leather for cheap at this store that used to sell them. Can’t remember the name, but I think it sold surplus goods like Uncle Dan’s used to."}, {"94cd": "Photo by Robert Loerzel"}, {"a7fc": "The Alley, which calls itself “America’s Rock n’ Roll Dept. Store,” sells its own version of the black leather Chicago Police Jacket, featuring a city flag on one shoulder."}, {"df34": "It’s worth noting that Chicago has a law against using the city flag for anything other than “the usual and customary purposes of decoration or display.” The law has been on the books since the flag was created in 1917, with only minor tweaks in the language since then."}, {"3ab1": "This part of the ordinance seems to be directed at preventing commercial uses of the flag — an effort that may be unconstitutional, and is quite certainly futile. The fines for breaking this law are five to twenty-five dollars. The same ordinance also makes it illegal for anyone to add “any letter, word, legend or device” to the city flag’s image. Are you kidding?"}, {"85c6": "The city is overrun with images of the Chicago flag, on everything from souvenir stands (of course) to hot-dog joints. It’s everywhere."}, {"3ec0": "And then there’s the graffiti and street art…"}, {"0761": "And politicians love to pose with the flag, or to throw some of those six-pointed stars onto their campaign signs."}, {"5520": "In one of its more ignominious appearances, the flag fills the screen in Spike Lee’s 2015 movie Chi-Raq, blood dripping from the red stars to symbolize Chicago’s plague of violence."}, {"609b": "Many Chicagoans have the city flag—or variations of it—inked onto their skins."}, {"0625": "Fuzzy Gerdes’s website Chicago Flag Tattoos showcases people who have chosen to permanently put six-pointed stars on their bodies."}, {"7ff9": "“One of the great things about the Chicago flag is how easily the design can be adapted yet remain recognizable — put four red things between two blue stripey things and there’s your flag,” Gerdes writes."}, {"660b": "Here’s a sample of comments on Gerdes’s website from city-flag-tattooed Chicagoans:"}, {"f4c5": "Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com"}, {"8014": "David Lind: I just have a pure love and fascination with Chicago, and the city’s flag is so simple in design, but so meaningful in description with the city’s rich history. My heart is within Chicago, so why not make it permanently tattoo it across my heart?!"}, {"61de": "Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com"}, {"f4a5": "Doug Sichmeller: Chicago has always been an important place to me. I love this city and am the fourth generation of my family to call it home. Besides that I had always loved the simple, yet iconic, design of the flag."}, {"dbbc": "Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com"}, {"1257": "Caitlin, on whether people recognize her tattoo as the city flag: The people like you who are like “hey, what’s up, Chicago flag.” But a lot of people, even people who live in the city, don’t know what it is. They’re like, “OK, I see that everywhere, what is that?” And I’m like, “it’s the Chicago flag!” They’re like, “Get out of town.” Yes, it’s your flag."}, {"65e2": "Photo courtesy of Fuzzy Gerdes, ChicagoFlagTattoos.com"}, {"b5bc": "Tim Chidester: They know it’s the Chicago flag. Even people out of state know what it is surprisingly. It’s a very recognizable flag. I’ve had a couple questions when I’ve been on gigs out of state where they’re like, ‘What is that?’"}, {"5dab": "Mysteries of the city flag"}, {"5a7b": "As we celebrate the centennial of the Chicago city flag, a few mysteries linger."}, {"6a89": "✶ What exactly happened with Big Bill Thompson’s law giving the stars five points?"}, {"faa8": "✶ Where did that light shade of blue come from? The ordinance simply says the stripes should be blue, without specifying a shade. But that sky blue now feels like an important of the flag’s identity."}, {"1b36": "✶ Why are the four stars centered? From the very beginning, the law has said the stars should be grouped near the side of the flag that’s attached to the flagpole. And that remained the case even when the fourth star was added in 1939. The current ordinance says the stars should be “set side by side, close together, next to the staff.”"}, {"7e6d": "If you followed the letter of the law, the flag might look more like this example from 1947, which is in the Chicago History Museum’s collection:"}, {"3097": "The Chicago flag that circumnavigated the world, c. 1947. Chicago History Museum, ICHi-66334"}, {"2048": "But that’s not the flag Chicagoans have come to know and love. Perhaps it’s time to tweak the ordinance—so that it describes the flag as we actually know it."}, {"c1b4": "✶ What happened to the original documents about the flag from the Chicago City Council meeting on April 4, 1917, when the design was approved? Moldy papers from council meetings in that era are stored in boxes at the Illinois Regional Archive Depository, in the basement of the library at Northeastern Illinois University. (And when I say “moldy,” I mean it literally.)"}, {"b6cf": "But the box from April 1917 has a note saying that someone removed “12 folders pertaining to Municipal Flag documents,” including a “sample of flag.”"}, {"fa82": "Archive employees have told me this probably means that someone from the city government took those folders. But they don’t know who it was or where these files went. (I requested documents about the flag from the city clerk’s office and received several PDFs, none of which appear to be more than a few decades old.)"}, {"8763": "Some of these missing documents might be the ones you can see over at the Harold Washington Library Center’s Municipal Reference Desk. But I suspect there were more. And what happened to that “sample” of the flag?"}, {"5599": "✶ How has the flag changed the city’s culture? Does it somehow make people feel prouder of the city where they live, even if they hate things about Chicago? Do people feel more like they’re marching “shoulder to shoulder” simply because they see those blue bars and six-pointed stars around Chicago? The answers are probably unquantifiable."}, {"1faf": "✶ Really, how did the flag become so popular? We can offer theories — like Chicagoans waving their municipal flag in the Vietnam War or punks buying police jackets — but it’s always challenging to pinpoint why anything grows in popularity."}, {"bb94": "In the end, it all comes down to Wallace Rice’s design. Back in 1917, the publication Chicago Commerce predicted that Chicagoans “will always look upon the elements of their flag with pride and pleasure because in a way it is descriptive of their being and spirit.”"}, {"31a8": "I don’t completely buy that. As pervasive as the flag is in Chicago, I doubt that many people think or care much about the meanings of those stripes and stars. But they probably do like the way the flag looks."}, {"cea9": "There’s something magical about Rice’s design. Simply put, it’s beautiful."}, {"2333": "Photo by Robert Loerzel"}, {"7858": "Further reading"}, {"c185": "✶ Kori Rumore and Ryan Marx, “Chicago’s flag: The history of every star and every stripe,” Chicago Tribune, June 13, 2016."}, {"6fb4": "✶ Whet Moser, “Why the Chicago Flag Is Such a Brilliant Design,” Chicago magazine website, November 19, 2014."}, {"1d47": "✶ John Hardberger, “Happy 100th Birthday to the Best Damn City Flag Ever,” Chicago magazine website, March 31, 2017."}, {"3e73": "✶ T.E. Whalen, “The Municipal Flag of Chicago,” a bibliography."}, {"0cf2": "✶ Robert Loerzel, “Chicago’s Flag Is a Much Bigger Deal Than Any Other City’s Flag,” Chicago magazine website, August 22, 2013."}, {"6628": "✶ Robert Loerzel, “In a divided Chicago, one thing we all agree on: A damn fine flag,” Crain’s Chicago Business website, April 4, 2017."}, {"1800": "Footnotes"}, {"df21": "Endnotes citing the sources for this article are available as a PDF here."}, {"689f": "This article is © 2017 by Robert Loerzel. The photos (except for those credited to other sources) are also © 2017 by Robert Loerzel."}], "child": "174_1\t174_2"}