{"name": "1740", "parent": "", "content": "What If Instead Of Controlling Your Life, Your Phone Helped You Live It? The Thrive Interview with Tristan Harris, founder of Time Well Spent. Tristan Harris. Fake news. Push notifications. Phone addiction. Phantom buzzes. Snapchat Streaks. Clickbait. Social approval. Loneliness. Americans checking their phones 150 times a day. To Tristan Harris, these trends all radiate out of what he calls “the attention economy,” where tech giants and media companies alike are in a Darwinian struggle for your time, your attention–your life. It’s a “race to the bottom of the brain stem,” he likes to say, as basic human needs like belonging, curiosity, and fear are manipulated to drive engagement and page views. Rather than enhancing your life, technology — as it is — is built to suck your time. But what if it doesn’t have to be this way? We sacrifice chunks of our lives every time we open Twitter, Tinder, or Facebook. Harris is in a unique position to make these claims — and to do something about them. In 2007 he cofounded Apture, a startup that helped publishers more readily use multimedia. In 2011 it was acquired by Google. There he became a product manager, and produced a 144-page Google Slides presentation titled “A Call to Minimize Distraction & Respect Users’ Attention.” In it he asked his colleagues to “feel an enormous responsibility” about their work, since “never before in history have the decisions of a handful of designers … had so much impact on how people around the world spend their attention.” As reported by Bianca Bosker at The Atlantic, he only shared the deck with 10 of his coworkers, but it spread to 5,000 colleagues, all the way to then-CEO Larry Page. The presentation sparked a conversation within Google, and later a TED Talk with 1.3 million views, and then a viral Medium post. That traction, he says, allowed him to create for himself the position of Design Ethicist, where he focused on “the ethics of how design of technology influences people’s psychology and behavior.” He became an advocate for more mindful user experience. Not coincidentally, he helped arrange the Zen Master Thich Nhat Hanh’s Google visit in fall 2013; the famous Buddhist was concerned with how easy tech made it for people to run from their inner lives. And to the company’s credit, they kept Harris on the payroll as he spent his days critiquing the product they built. But Harris ran into “inertia” within the Googleplex, he says. While his colleagues were interested in his perspective, the company wasn’t about to suddenly restructure its goals and definitions of growth and success. None of his suggestions was implemented. In December 2015, Harris left Google, and has since dedicated his life to “a consumer advocacy group and social movement” that he created called Time Well Spent, along with Oxford Internet Institute philosopher James Williams, Center for Liveable Media founder Joe Edelman and filmmaker Max Stossel. The goal is Silicon Valley reformation: instead of building products that are designed to keep your face affixed to your phone, it’s about making tech that’s in line with people’s basic human needs and values. The purpose shouldn’t be to get you to swipe at more push notifications, but complete your goals. Our relationship with technology is already one of the defining conversations of our time, and it’s one we’re focused on at Thrive Global. In conversations over the phone and in person, Harris outlined why this problem is far larger than addiction. It’s an “existential crisis” he says, as attention spans shrink, a deluge of information overwhelms us , and a sense of shared, objective reality erodes. Tech isn’t just a platform for all this, he emphasizes. It’s responsible. The below interview has been edited for length and clarity. THRIVE GLOBAL: The first step is always admitting that you have a problem. And you say that we, as a society, don’t realize how easily swayed we are by tech. TRISTAN HARRIS: We continue to have this illusion that things outside of us aren’t driving what we think and believe, when in fact so much of what we spend our attention on is driven by decisions of thousands of engineers and product designers. We need to see ourselves as having certain buttons that can be pushed — our social approval, our belonging. Facebook owns my sense of approval right now. They have in their hands a dial for when and how often I get notified about how much people approve of me or not. TG: And that’s baked into how tech is structured today? TH: The idea that Facebook or Twitter or Snapchat is neutral is a lie. When you log into Facebook, are you making choices in what you see in your News Feed or is Facebook making that choice? You might think you’re making that choice because you chose to be friends with these people. It is more that these things are being shown to maximize the time you spend on Facebook. TG: What’s the alternative? TH: Facebook could look dramatically different than it does today. Today, it works the way it does because it needs to get as much attention from you as possible. If showing you news that confirms your existing ways of seeing the world — the filter bubble — works better at keeping you engaged, then it has to show you that confirm-your-beliefs version of Facebook rather than the version of Facebook that challenges you with complexity, that shows you that life is messy and complicated. TG: What are the stakes? TH: The race to the bottom is going to leave us in an environment that doesn’t serve anybody. The most important problems we face are complex, and require sustained attention. But we don’t speak in terms of nuance or complexity. Is that by accident? It’s because our minds have been entrained to expect shorter and shorter bite-sized bits. TG: Recent Stanford neuroscience research suggests that the more you multitask, the less you can sustain focus. And you say that the attention economy is shaping media, too? TH: If I’m a news website, I can tap into outrage, which is really good at getting your attention, and getting you to share. Or I could not. Which strategy is going to be more successful, which is going to get more page views? The end result of more and more successful grabbing of attention creates a world where you can’t open a door into the Internet without getting sucked in or feeling like the world is going crazy. That’s what makes this an existential problem. It’s a problem shaping how people create their own understanding of the world. TG: And that’s why the answer isn’t just “put your phone down.” TH: The solution isn’t abstinence, the solution is connection. For example, think about someone who’s lonely on a Saturday night — a friend just cancelled on them and they’re about to open Facebook in a bout of loneliness. It’s not just that their phone should say, “Oh, you’re using Facebook too much, let me lock you out of Facebook.” That would get the psychology wrong. And it would get ignored: People don’t listen to apps that scold them. Imagine if at that same moment, instead of a thousand engineers at Facebook working to make that lonely person scroll for as long as possible, all those engineers acted on what that lonely person really wants — to be with friends. Those thousand engineers could instead work to use all the other information about who else is online right now, addictively scrolling, to help make it easier for the lonely person to actually be with other people. Facebook is in a position to solve the problem of loneliness — if they wanted to — by enabling real-life connection. TG: What can regular people, the consumers, do? TH: It might sound simple, but one thing you can do is to turn off all notifications except for when a human being wants your attention. Most notifications you get are because a machine is trying to get your attention. Those notifications aren’t built to help you live your life. They’re built to get your attention. So when you just have notifications on from people, it reduces the frequency of notifications in general. That in turn helps untrain the habit of automatically checking your phone all the time. Another thing is to have a unique signature for a when a certain person or a certain channel of communication is requesting you. If your phone buzzes in the same way when something’s on fire at work as it does when it’s just an app wanting to tell you about a new podcast release, that ambiguity is what creates a variable reward. TG: Why isn’t this movement happening within the tech giants? TH: On a human level, the people I met at Google cared a lot about this problem. But at the end of the day, you have a product roadmap, and the way things are structured right now, every quarter you’re evaluated, asked to demonstrate growth. And that’s even more true in attention companies like Facebook, Netflix and Snapchat than at device companies like Apple and Google. Most people realize that Facebook’s biggest competitor isn’t Twitter or another social network, it’s another attention business like YouTube. TG: What about how technology is evaluated? TH: Right now on the App Store, developers are rewarded for the more downloads or sales they get. The game is essentially, who’s better at getting a download or a sale. But instead of these global, “most downloaded” rankings, it could instead be a ranking of who’s best at helping you thrive in the morning. The meditation app gets to be in the top 10 of that list. In this Time Well Spent economy, you get to win for the benefit you provide. TG: As an organization, what does a good 2017 look like for Time Well Spent? TH: The first thing would be a mass cultural shift. I think 2017 could be the inflection point where we all collectively recognize that technology is not a neutral tool, that technology has a certain goal about how it wants to be used, and that it wants to be used in a way that maximizes the usage of our attention. And I hope we will also see that this is not a good thing, because democracy can’t work when our attention spans are five seconds long. TG: Where does this change come from? TH: It obviously can’t come from inside the company with a mid-level designer. I tried that, it didn’t work. It has to come from the outside. It has to come from their being a clear demand from consumers. We’re going to need a new social contract with the tech world one that asks for consent, and one with transparent goals. Right now, the goals of technology are not aligned with our goals as humans. We need technology that empowers us to make the life choices we want to make. ", "title": "What If Instead Of Controlling Your Life, Your Phone Helped You Live It?", "sentences": [{"4d22": "What If Instead Of Controlling Your Life, Your Phone Helped You Live It?"}, {"4656": "The Thrive Interview with Tristan Harris, founder of Time Well Spent."}, {"f8f9": "Tristan Harris."}, {"d28c": "Fake news. Push notifications. Phone addiction. Phantom buzzes. Snapchat Streaks. Clickbait. Social approval. Loneliness. Americans checking their phones 150 times a day."}, {"536e": "To Tristan Harris, these trends all radiate out of what he calls “the attention economy,” where tech giants and media companies alike are in a Darwinian struggle for your time, your attention–your life. It’s a “race to the bottom of the brain stem,” he likes to say, as basic human needs like belonging, curiosity, and fear are manipulated to drive engagement and page views. Rather than enhancing your life, technology — as it is — is built to suck your time. But what if it doesn’t have to be this way? We sacrifice chunks of our lives every time we open Twitter, Tinder, or Facebook."}, {"a2cc": "Harris is in a unique position to make these claims — and to do something about them. In 2007 he cofounded Apture, a startup that helped publishers more readily use multimedia. In 2011 it was acquired by Google. There he became a product manager, and produced a 144-page Google Slides presentation titled “A Call to Minimize Distraction & Respect Users’ Attention.” In it he asked his colleagues to “feel an enormous responsibility” about their work, since “never before in history have the decisions of a handful of designers … had so much impact on how people around the world spend their attention.” As reported by Bianca Bosker at The Atlantic, he only shared the deck with 10 of his coworkers, but it spread to 5,000 colleagues, all the way to then-CEO Larry Page. The presentation sparked a conversation within Google, and later a TED Talk with 1.3 million views, and then a viral Medium post. That traction, he says, allowed him to create for himself the position of Design Ethicist, where he focused on “the ethics of how design of technology influences people’s psychology and behavior.” He became an advocate for more mindful user experience. Not coincidentally, he helped arrange the Zen Master Thich Nhat Hanh’s Google visit in fall 2013; the famous Buddhist was concerned with how easy tech made it for people to run from their inner lives. And to the company’s credit, they kept Harris on the payroll as he spent his days critiquing the product they built."}, {"b737": "But Harris ran into “inertia” within the Googleplex, he says. While his colleagues were interested in his perspective, the company wasn’t about to suddenly restructure its goals and definitions of growth and success. None of his suggestions was implemented. In December 2015, Harris left Google, and has since dedicated his life to “a consumer advocacy group and social movement” that he created called Time Well Spent, along with Oxford Internet Institute philosopher James Williams, Center for Liveable Media founder Joe Edelman and filmmaker Max Stossel. The goal is Silicon Valley reformation: instead of building products that are designed to keep your face affixed to your phone, it’s about making tech that’s in line with people’s basic human needs and values. The purpose shouldn’t be to get you to swipe at more push notifications, but complete your goals."}, {"62c4": "Our relationship with technology is already one of the defining conversations of our time, and it’s one we’re focused on at Thrive Global. In conversations over the phone and in person, Harris outlined why this problem is far larger than addiction. It’s an “existential crisis” he says, as attention spans shrink, a deluge of information overwhelms us , and a sense of shared, objective reality erodes. Tech isn’t just a platform for all this, he emphasizes. It’s responsible."}, {"7607": "The below interview has been edited for length and clarity."}, {"07d6": "THRIVE GLOBAL: The first step is always admitting that you have a problem. And you say that we, as a society, don’t realize how easily swayed we are by tech."}, {"d94f": "TRISTAN HARRIS: We continue to have this illusion that things outside of us aren’t driving what we think and believe, when in fact so much of what we spend our attention on is driven by decisions of thousands of engineers and product designers."}, {"3a1e": "We need to see ourselves as having certain buttons that can be pushed — our social approval, our belonging. Facebook owns my sense of approval right now. They have in their hands a dial for when and how often I get notified about how much people approve of me or not."}, {"fda2": "TG: And that’s baked into how tech is structured today?"}, {"b172": "TH: The idea that Facebook or Twitter or Snapchat is neutral is a lie. When you log into Facebook, are you making choices in what you see in your News Feed or is Facebook making that choice? You might think you’re making that choice because you chose to be friends with these people. It is more that these things are being shown to maximize the time you spend on Facebook."}, {"946b": "TG: What’s the alternative?"}, {"a6d9": "TH: Facebook could look dramatically different than it does today. Today, it works the way it does because it needs to get as much attention from you as possible."}, {"5ea6": "If showing you news that confirms your existing ways of seeing the world — the filter bubble — works better at keeping you engaged, then it has to show you that confirm-your-beliefs version of Facebook rather than the version of Facebook that challenges you with complexity, that shows you that life is messy and complicated."}, {"4971": "TG: What are the stakes?"}, {"ec9a": "TH: The race to the bottom is going to leave us in an environment that doesn’t serve anybody. The most important problems we face are complex, and require sustained attention. But we don’t speak in terms of nuance or complexity. Is that by accident? It’s because our minds have been entrained to expect shorter and shorter bite-sized bits."}, {"40ac": "TG: Recent Stanford neuroscience research suggests that the more you multitask, the less you can sustain focus. And you say that the attention economy is shaping media, too?"}, {"23b8": "TH: If I’m a news website, I can tap into outrage, which is really good at getting your attention, and getting you to share. Or I could not. Which strategy is going to be more successful, which is going to get more page views?"}, {"8c21": "The end result of more and more successful grabbing of attention creates a world where you can’t open a door into the Internet without getting sucked in or feeling like the world is going crazy. That’s what makes this an existential problem. It’s a problem shaping how people create their own understanding of the world."}, {"97ea": "TG: And that’s why the answer isn’t just “put your phone down.”"}, {"3c71": "TH: The solution isn’t abstinence, the solution is connection. For example, think about someone who’s lonely on a Saturday night — a friend just cancelled on them and they’re about to open Facebook in a bout of loneliness. It’s not just that their phone should say, “Oh, you’re using Facebook too much, let me lock you out of Facebook.” That would get the psychology wrong. And it would get ignored: People don’t listen to apps that scold them."}, {"0e59": "Imagine if at that same moment, instead of a thousand engineers at Facebook working to make that lonely person scroll for as long as possible, all those engineers acted on what that lonely person really wants — to be with friends. Those thousand engineers could instead work to use all the other information about who else is online right now, addictively scrolling, to help make it easier for the lonely person to actually be with other people. Facebook is in a position to solve the problem of loneliness — if they wanted to — by enabling real-life connection."}, {"a00a": "TG: What can regular people, the consumers, do?"}, {"d960": "TH: It might sound simple, but one thing you can do is to turn off all notifications except for when a human being wants your attention. Most notifications you get are because a machine is trying to get your attention. Those notifications aren’t built to help you live your life. They’re built to get your attention. So when you just have notifications on from people, it reduces the frequency of notifications in general. That in turn helps untrain the habit of automatically checking your phone all the time."}, {"f3cf": "Another thing is to have a unique signature for a when a certain person or a certain channel of communication is requesting you. If your phone buzzes in the same way when something’s on fire at work as it does when it’s just an app wanting to tell you about a new podcast release, that ambiguity is what creates a variable reward."}, {"3f14": "TG: Why isn’t this movement happening within the tech giants?"}, {"f732": "TH: On a human level, the people I met at Google cared a lot about this problem. But at the end of the day, you have a product roadmap, and the way things are structured right now, every quarter you’re evaluated, asked to demonstrate growth. And that’s even more true in attention companies like Facebook, Netflix and Snapchat than at device companies like Apple and Google. Most people realize that Facebook’s biggest competitor isn’t Twitter or another social network, it’s another attention business like YouTube."}, {"9ba4": "TG: What about how technology is evaluated?"}, {"e8c8": "TH: Right now on the App Store, developers are rewarded for the more downloads or sales they get. The game is essentially, who’s better at getting a download or a sale."}, {"0f89": "But instead of these global, “most downloaded” rankings, it could instead be a ranking of who’s best at helping you thrive in the morning. The meditation app gets to be in the top 10 of that list. In this Time Well Spent economy, you get to win for the benefit you provide."}, {"20fe": "TG: As an organization, what does a good 2017 look like for Time Well Spent?"}, {"2493": "TH: The first thing would be a mass cultural shift. I think 2017 could be the inflection point where we all collectively recognize that technology is not a neutral tool, that technology has a certain goal about how it wants to be used, and that it wants to be used in a way that maximizes the usage of our attention. And I hope we will also see that this is not a good thing, because democracy can’t work when our attention spans are five seconds long."}, {"63f7": "TG: Where does this change come from?"}, {"5786": "TH: It obviously can’t come from inside the company with a mid-level designer. I tried that, it didn’t work. It has to come from the outside. It has to come from their being a clear demand from consumers."}, {"7f42": "We’re going to need a new social contract with the tech world one that asks for consent, and one with transparent goals. Right now, the goals of technology are not aligned with our goals as humans. We need technology that empowers us to make the life choices we want to make."}], "child": "1740_1"}