{"name": "1741", "parent": "", "content": "Boredom By Martin Lindstrom Recall the last time you found yourself waiting for someone in a bar. You used your smartphone to fill the empty moments, didn’t you? Or remember the last time you ate a meal in a restaurant by yourself. Did you enjoy the quiet time by yourself and allow your mind to wander? Or course not! You fiddled with your phone — anything to save yourself from boredom. Image courtesy of Pixabay Today’s young people, afraid of being bored, cram an average of more than 10 hours of media content into each and every day. This is close to ten times the amount of time they spend with their parents. The International Center for Media and Public Agenda asked 1,000 students to live without any electronic devices for 24 hours. Not such a monumental task, you’d think? But more than half had given up within two hours, and the “survivors” reported an overwhelming sense of emptiness and boredom. These days, we’ve become petrified at the notion of being alone and with nothing to occupy our minds. We’re terrified by boredom. But never fear. If you ever happen to find yourself bored, there’s even a website for that. It’s called — what else? — bored.com. You understand how those test subjects felt, don’t you? I certainly do. In the midst of writing a serious document, I may feel a sudden urge to break away for a few minutes to watch an unserious YouTube video, check the latest gossip on Facebook, or make sure no absolutely urgent messages haven’t arrived on my phone (even if there hasn’t been a message alert, so I know perfectly well there are no new messages). I need a candy moment. Though an empty, unserious moment may make me uneasy, as if I’m wasting moments that I’ll never get back, boredom may indeed be essential to getting my best ideas and doing my best work. As writer and philosopher Robert Pirsig claimed, “Boredom always precedes a period of great creativity.” I’ve learned that Pirsig was dead-on: My best ideas have always grown out of boredom. If I grant my brain the space it needs to wander, explore, puzzle, and play, then seemingly unconnected concepts begin, as if by magic, to combine into some of my very best insights. Infusing boredom into our highly technological lives can be a difficult challenge. From the moment we open our eyes in the morning, we’re reaching for our phones. We work in bed, both morning and night. We check messages or read the news while we’re eating breakfast, in the car or on the bus, waiting in the airport, walking down the sidewalk. I even discovered recently that one out of three teenage boys takes his phone into the shower. We used to have “transition zones” between work and leisure. These transition zones provided us with time to reset our brains. Just like resetting a computer, that process allowed us to shed extraneous garbage, come back fast and focused, and flourish. But when is the last time you intentionally reset your computer? And when did you turn off your mind, even for a few minutes? Somewhere along the way, our transition zones vanished, and every waking minute got filled up with media, information, and data. Just like a computer that never gets reset, our brains fill up with extraneous stuff, and they’re running slower and slower. Not long ago, I was in conversation with one of the great writers of our time, and as we talked, he realized that his phones and computers had started taking over his life. His creativity was suffering, he realized. I’ve talked to artists, writers, creatives, and philosophers, and those who are the most successful and creative tell me that they’ve come to realize that their creativity derives from a single source in their lives. They’ve created their own transition zones. They’ve allowed themselves to be bored. My own times of boredom take place in the pool. In fact, most of my latest book, Small Data, was written in the water. Swimming along, back and forth, helped me to solve complex problems and dream up new theories. Other creative people tell me they do their best creative thinking in the shower or while sailing. I don’t believe the common factor is water (though that might be an idea worth exploring). All these “water moments” could be called personal appointments. Whether we’re swimming or washing or sailing — or whatever else we give ourselves permission to do — they all involve putting down the phone, stepping away from the computer, and allowing our thoughts to flow freely. The brightest talents in our world have the uncanny ability to combine two or more ordinary things in a completely novel way. That kind of creative thinking doesn’t happen as a result of brute-force cogitation. In my experience, and in the experience of the creatives with whom I’ve discussed the process, it happens during the transition zones, the water moments, the moments of unforced boredom. In other words, during electronics-free personal appointments. We may not all be world-renowned artists or philosophers, but all of us, in our work lives and in our personal lives, face stiff challenges. We need to craft that important email, create a killer presentation, or — in my case — seek to combine seemingly insignificant observations into the insights that lead to unique brand concepts. As simple as it might sound, I’ve come to realize that my “water moments” are the magical key to solving the most perplexing questions. Your own water moment might have nothing to do with H2O. It might be taking a leisurely walk around the neighborhood. It might be a ten-mile run. It might be in the car. It might involve a glass of iced tea in an Adirondack chair on your patio. Whatever it is for you, it is a time when you give yourself permission to put the electronics away, stop forcing your thought process forward at a frantic clip, and allow your thoughts to take their own meandering course. It’s the most important appointment of your day. It’s the appointment you make with yourself. Martin Lindstrom, one of the world’s foremost branding experts, and author of Small Data: The Tiny Clues That Uncover Huge Trends. His previous books have been translated into 47 languages and have sold well over one million copies. He was named one of TIME magazine’s 100 most influential people in the world. In 2016, Thinkers50 named him one of the top 20 business thinkers in the world, and he has been ranked the world’s #1 branding expert for three consecutive years. His articles appear in The New York Times, Harvard Business Review, and Fast Company. He advises startups and a Who’s Who of Fortune 100 companies on branding, communication, consumer psychology, retail, innovation, and transformation. Lindstrom currently hosts Main Street Makeover, a series on NBC’s TODAY show that creates solutions to business problems in less than just 24 hours. ", "title": "Boredom", "sentences": [{"9830": "Boredom"}, {"9d6f": "By Martin Lindstrom"}, {"30bb": "Recall the last time you found yourself waiting for someone in a bar. You used your smartphone to fill the empty moments, didn’t you? Or remember the last time you ate a meal in a restaurant by yourself. Did you enjoy the quiet time by yourself and allow your mind to wander? Or course not! You fiddled with your phone — anything to save yourself from boredom."}, {"42b8": "Image courtesy of Pixabay"}, {"ec18": "Today’s young people, afraid of being bored, cram an average of more than 10 hours of media content into each and every day. This is close to ten times the amount of time they spend with their parents."}, {"76eb": "The International Center for Media and Public Agenda asked 1,000 students to live without any electronic devices for 24 hours. Not such a monumental task, you’d think? But more than half had given up within two hours, and the “survivors” reported an overwhelming sense of emptiness and boredom."}, {"5c42": "These days, we’ve become petrified at the notion of being alone and with nothing to occupy our minds. We’re terrified by boredom. But never fear. If you ever happen to find yourself bored, there’s even a website for that. It’s called — what else? — bored.com."}, {"569c": "You understand how those test subjects felt, don’t you? I certainly do. In the midst of writing a serious document, I may feel a sudden urge to break away for a few minutes to watch an unserious YouTube video, check the latest gossip on Facebook, or make sure no absolutely urgent messages haven’t arrived on my phone (even if there hasn’t been a message alert, so I know perfectly well there are no new messages). I need a candy moment."}, {"d591": "Though an empty, unserious moment may make me uneasy, as if I’m wasting moments that I’ll never get back, boredom may indeed be essential to getting my best ideas and doing my best work. As writer and philosopher Robert Pirsig claimed, “Boredom always precedes a period of great creativity.”"}, {"2655": "I’ve learned that Pirsig was dead-on: My best ideas have always grown out of boredom. If I grant my brain the space it needs to wander, explore, puzzle, and play, then seemingly unconnected concepts begin, as if by magic, to combine into some of my very best insights."}, {"0fd8": "Infusing boredom into our highly technological lives can be a difficult challenge. From the moment we open our eyes in the morning, we’re reaching for our phones. We work in bed, both morning and night. We check messages or read the news while we’re eating breakfast, in the car or on the bus, waiting in the airport, walking down the sidewalk. I even discovered recently that one out of three teenage boys takes his phone into the shower."}, {"7dc6": "We used to have “transition zones” between work and leisure. These transition zones provided us with time to reset our brains. Just like resetting a computer, that process allowed us to shed extraneous garbage, come back fast and focused, and flourish. But when is the last time you intentionally reset your computer? And when did you turn off your mind, even for a few minutes? Somewhere along the way, our transition zones vanished, and every waking minute got filled up with media, information, and data."}, {"39c0": "Just like a computer that never gets reset, our brains fill up with extraneous stuff, and they’re running slower and slower."}, {"23a8": "Not long ago, I was in conversation with one of the great writers of our time, and as we talked, he realized that his phones and computers had started taking over his life. His creativity was suffering, he realized. I’ve talked to artists, writers, creatives, and philosophers, and those who are the most successful and creative tell me that they’ve come to realize that their creativity derives from a single source in their lives. They’ve created their own transition zones. They’ve allowed themselves to be bored."}, {"0abc": "My own times of boredom take place in the pool. In fact, most of my latest book, Small Data, was written in the water. Swimming along, back and forth, helped me to solve complex problems and dream up new theories."}, {"8bf1": "Other creative people tell me they do their best creative thinking in the shower or while sailing. I don’t believe the common factor is water (though that might be an idea worth exploring). All these “water moments” could be called personal appointments. Whether we’re swimming or washing or sailing — or whatever else we give ourselves permission to do — they all involve putting down the phone, stepping away from the computer, and allowing our thoughts to flow freely."}, {"dc02": "The brightest talents in our world have the uncanny ability to combine two or more ordinary things in a completely novel way. That kind of creative thinking doesn’t happen as a result of brute-force cogitation. In my experience, and in the experience of the creatives with whom I’ve discussed the process, it happens during the transition zones, the water moments, the moments of unforced boredom. In other words, during electronics-free personal appointments."}, {"3fa7": "We may not all be world-renowned artists or philosophers, but all of us, in our work lives and in our personal lives, face stiff challenges. We need to craft that important email, create a killer presentation, or — in my case — seek to combine seemingly insignificant observations into the insights that lead to unique brand concepts. As simple as it might sound, I’ve come to realize that my “water moments” are the magical key to solving the most perplexing questions."}, {"8c40": "Your own water moment might have nothing to do with H2O. It might be taking a leisurely walk around the neighborhood. It might be a ten-mile run. It might be in the car. It might involve a glass of iced tea in an Adirondack chair on your patio. Whatever it is for you, it is a time when you give yourself permission to put the electronics away, stop forcing your thought process forward at a frantic clip, and allow your thoughts to take their own meandering course."}, {"079a": "It’s the most important appointment of your day."}, {"27b5": "It’s the appointment you make with yourself."}, {"6891": "Martin Lindstrom, one of the world’s foremost branding experts, and author of Small Data: The Tiny Clues That Uncover Huge Trends."}, {"0782": "His previous books have been translated into 47 languages and have sold well over one million copies. He was named one of TIME magazine’s 100 most influential people in the world. In 2016, Thinkers50 named him one of the top 20 business thinkers in the world, and he has been ranked the world’s #1 branding expert for three consecutive years. His articles appear in The New York Times, Harvard Business Review, and Fast Company. He advises startups and a Who’s Who of Fortune 100 companies on branding, communication, consumer psychology, retail, innovation, and transformation. Lindstrom currently hosts Main Street Makeover, a series on NBC’s TODAY show that creates solutions to business problems in less than just 24 hours."}], "child": "1741_1\t1741_2\t1741_31741_1\t1741_2\t1741_3"}