{"name": "1742", "parent": "", "content": "How Relocating from Busy City to Rural Changed my Perspective on Well-Being What happens when we are in nature more often Image courtesy of Unsplash A year and a half ago, I lived in a busy city, and let me tell you; city life rattled me. The sounds of honking horns passing by my home, people shouting and creating a stir on nearby street corners, and living by noisy bars about wreaked havoc on my overall well-being. The second I’d mention that I wanted to relocate to a rural environment, I’d hear: “Stay in the city, this is where it ALL happens.” Ha! Yeah, that’s true. Now that I look back on my old city life, I recall suffering respiratory issues, allergies, and caught colds and flues frequently. Cities are dusty, germ-filled, gross environments. So, sure, while a lot of good things happen, too, (like festivals and interesting social events) I rarely got to experience any of it being sick all the time. Plus, I am immune deficient and failed to take that into account. Not to mention the regular exposure of breathing in exhaust from too many cars and buses. Being in the heart of city also induced frequent anxiety attacks. I was always on guard, as I lived just a block or two from busy entertainment venues. Random people out of the blue would approach me and I’d feel threatened. A lot of my closest friends still live in the city and I had fears of missing out on those festivals and activities. I thought that the distance would cause strain on my relationships. Often times, I backed out of doing things because of fear. At first, I resisted relocating. I didn’t realize that my body was telling me, “Get out of the city, now,” and I listened to what my body needed. It’s easy to get confused with our wants and needs — I wanted to stay close to my friends, but I needed to live in a cleaner environment. Despite my anxiety about moving, many things propelled me to ditch my city life. I think once we get to a certain age, we’d rather wake up to birds singing instead of honking cars and people racing by with their faces buried in their beeping phones. The area I live in, mostly greenery surrounds me, and I live one block from a stunning bike trail I walk almost daily. I’d open the door to my home and would find five deer walking along the wooded area just a few feet from me. I’d stop walking and be still with them. The stillness of wildlife, tall brushes, varying types of trees, and flower beds make up most of the area. I don’t live far from a lake front. To be honest with you, though, my move from city to rural was a bit of a culture shock. It took me a few months to adjust. I had to adapt. Within a couple of months, I developed routines that involved long nature walks, meditating outdoors, and exercising outdoors too. I noticed almost immediately a drastic change in every aspect of my health. And, my lungs appreciated the fresher air. If you’re surrounded by chaos, that will take a toll on your health over time. Some people function just fine living in the city, and that’s great for them. I prefer to live in an area where I can pursue a quality of life without needless distractions and interruptions. I didn’t like hearing other people’s phones go off. I didn’t like honking horns and listening to the public transportation buses driving along the same street as my home. When I moved to this rural environment, I gave myself the opportunity to explore and experience the benefits of serenity. Since my move, I’ve noticed little to no anxiety, my respiratory and sinus issues improved, and I can function better. It’s a fact that people who spend more time in nature are happier and calmer. In moments of stillness, only then could I get inspired and be creative. These days, I hardly have creative blocks. And, I’ve gone from sleeping in until noon to waking up each morning before dawn feeling serene mentally, emotionally, and physically. Being in nature more often has given me new perspectives on what it means to live well. As someone that’s resistant when it comes to making extreme transitions, I am now grateful for the transformations in my health and well-being. ", "title": "How Relocating from Busy City to Rural Changed my Perspective on Well-Being", "sentences": [{"7eff": "How Relocating from Busy City to Rural Changed my Perspective on Well-Being"}, {"9f3a": "What happens when we are in nature more often"}, {"a520": "Image courtesy of Unsplash"}, {"c007": "A year and a half ago, I lived in a busy city, and let me tell you; city life rattled me. The sounds of honking horns passing by my home, people shouting and creating a stir on nearby street corners, and living by noisy bars about wreaked havoc on my overall well-being. The second I’d mention that I wanted to relocate to a rural environment, I’d hear: “Stay in the city, this is where it ALL happens.” Ha! Yeah, that’s true."}, {"dcd5": "Now that I look back on my old city life, I recall suffering respiratory issues, allergies, and caught colds and flues frequently. Cities are dusty, germ-filled, gross environments. So, sure, while a lot of good things happen, too, (like festivals and interesting social events) I rarely got to experience any of it being sick all the time. Plus, I am immune deficient and failed to take that into account. Not to mention the regular exposure of breathing in exhaust from too many cars and buses. Being in the heart of city also induced frequent anxiety attacks. I was always on guard, as I lived just a block or two from busy entertainment venues. Random people out of the blue would approach me and I’d feel threatened."}, {"9052": "A lot of my closest friends still live in the city and I had fears of missing out on those festivals and activities. I thought that the distance would cause strain on my relationships. Often times, I backed out of doing things because of fear. At first, I resisted relocating. I didn’t realize that my body was telling me, “Get out of the city, now,” and I listened to what my body needed. It’s easy to get confused with our wants and needs — I wanted to stay close to my friends, but I needed to live in a cleaner environment."}, {"9a14": "Despite my anxiety about moving, many things propelled me to ditch my city life. I think once we get to a certain age, we’d rather wake up to birds singing instead of honking cars and people racing by with their faces buried in their beeping phones. The area I live in, mostly greenery surrounds me, and I live one block from a stunning bike trail I walk almost daily. I’d open the door to my home and would find five deer walking along the wooded area just a few feet from me. I’d stop walking and be still with them."}, {"90ec": "The stillness of wildlife, tall brushes, varying types of trees, and flower beds make up most of the area. I don’t live far from a lake front. To be honest with you, though, my move from city to rural was a bit of a culture shock. It took me a few months to adjust. I had to adapt. Within a couple of months, I developed routines that involved long nature walks, meditating outdoors, and exercising outdoors too. I noticed almost immediately a drastic change in every aspect of my health. And, my lungs appreciated the fresher air."}, {"2bb6": "If you’re surrounded by chaos, that will take a toll on your health over time. Some people function just fine living in the city, and that’s great for them. I prefer to live in an area where I can pursue a quality of life without needless distractions and interruptions. I didn’t like hearing other people’s phones go off. I didn’t like honking horns and listening to the public transportation buses driving along the same street as my home. When I moved to this rural environment, I gave myself the opportunity to explore and experience the benefits of serenity."}, {"352b": "Since my move, I’ve noticed little to no anxiety, my respiratory and sinus issues improved, and I can function better. It’s a fact that people who spend more time in nature are happier and calmer. In moments of stillness, only then could I get inspired and be creative. These days, I hardly have creative blocks. And, I’ve gone from sleeping in until noon to waking up each morning before dawn feeling serene mentally, emotionally, and physically. Being in nature more often has given me new perspectives on what it means to live well. As someone that’s resistant when it comes to making extreme transitions, I am now grateful for the transformations in my health and well-being."}], "child": "1742_1\t1742_2"}