{"name": "1745", "parent": "", "content": "5 Ideas Under 5 Minutes to Spring Clean Your Morning Routine It’s finally happening, and I’m super psyched! Even though many of us are used to frigid winters (and toes and fingers), and, all things considered, this one wasn’t so bad at all, I’m still really ready to put on my espadrilles and drink a beer outside (among other things). March is a thing of the past for now (phew), and spring is in full, sweet swing. Look, I’m not going to tell you to quit drinking coffee or to get up at 5 AM every day — though more power to you if those are your goals and you’re meeting them — but I am going to make a couple of easy (five-minute) suggestions that might just make your days better and, ultimately, more productive. Because you know that whole drinking a beer outside thing? It feels exponentially better when it takes place after a day you conquer (like a boss [insert wink]). 1. Do One Chore Photo courtesy of Unsplash That word is really the worst, isn’t it? But we all have ’em, and some are less appealing than others, even those that take barely any time at all. What if, instead of putting everything off until “later,” or the weekend, you tackled one little item before you headed to work? Maybe you empty the dishwasher (three minutes, tops), fold the clothes that have been piling up on your chair for days (five minutes), change your sheets (four to seven minutes, depending on your level of anal), or wipe down the bathroom sink (one and a half minutes). Crossing one thing off of your household to-do list first thing is an awesome new way to start the day. Plus, when you get home to find that the dishwasher’s empty, your clothes are on hangars and in drawers, your bed’s made with fresh sheets, the bathroom sink’s sparkling, you’ll feel even better about your day. Related: Copy This Routine: How the Author of the 4-Hour Workweek Starts His Day 2. Make Someone’s Day Photo courtesy of Unsplash It can be as easy as sending a friend you haven’t talked to in a while a thoughtful text message or as spontaneous as writing a note to your grandma, popping it into an envelope, putting an address and stamp on it, and dropping it in the mailbox on your way to work. When you hear back from your friend a few minutes or hours later, you’ll be glad you took a moment to say hi. And when you hear from gram after she gets your snail mail, you’ll feel warm and fuzzy all over again. These are things that many of us probably think to do throughout the day, but then never get around to as work priorities take over, and before we know it, we’re leaving the office to deal with obligations (like picking up milk or the dry-cleaning). Do them when you’re not yet entrenched in, well, life. 3. Read Photo courtesy of Unsplash Not your Facebook feed or the comments on your latest Instagram post, and don’t even think I’m recommending email. No, I’m talking about real, solid, worthy reading (not that those emails from your boss aren’t important). Are you in the middle of a book, or have you been wanting to read an article from your favorite site, a movie review, or a TV recap from the A.V. Club? This is a very nice time to engage with that kind of material. Most of us, even those that are really pressed for time in the morning, probably have a few minutes that could be better spent. Ditch the social media and ignore your inbox for a few more moments, and remind yourself how refreshing it feels to do this kind of reading before almost anything else. This is you putting you first. You have the rest of the day to read and reply to emails, answer to people, and get caught up in the latest FB trends. Related: The 3-Task Trick That’ll Make Every Morning More Productive 4. Eat Eggs Photo courtesy of Unsplash Surprised by this one? Unless you’re a staunch opponent of eating breakfast, it’s my personal experience that making eggs at home and sitting down to eat them is an excellent way to get the day started. Fried, poached, scrambled — it’s all good and delicious. And it’s protein, which I’ve heard keeps you fuller longer. Seriously, if you regularly eat yogurt or cereal, try changing it up. If you typically grab a breakfast sandwich or a muffin on your way into the office, make a deliberate choice to eat at home with food you cooked. Another incentive? You’ll save money! 5. Unwind Photo courtesy of Unsplash It may seem counterintuitive to factor this into your (hectic, rushed) morning, but what if it had the effect of making things feel less harried? You don’t have to get caught up on your TV shows or go shopping (What? It helps me unwind), but try sitting quietly with your coffee, tea, or smoothie. Put on music that soothes you. Meditate for a few. Spring cleaning is intended to de-clutter your life, and that’s all this exercise is meant to do. Rethinking what it means to unwind and how you can work it into your life in the most beneficial way possible is the ultimate goal here. Related: 16 Better Ways to Start Your Day (That Have Nothing to Do With Breakfast) There’s obviously myriad other ways to spring clean your morning regimen, and I’d encourage you to do you, whether that involves journaling, exercising, or giving into your love of the snooze button. The key is discovering practices and behaviors that motivate you to face the day and get ‘er done. Originally published at www.themuse.com on April 10, 2017. ", "title": "5 Ideas Under 5 Minutes to Spring Clean Your Morning Routine", "sentences": [{"645f": "5 Ideas Under 5 Minutes to Spring Clean Your Morning Routine"}, {"9e5d": "It’s finally happening, and I’m super psyched!"}, {"6bab": "Even though many of us are used to frigid winters (and toes and fingers), and, all things considered, this one wasn’t so bad at all, I’m still really ready to put on my espadrilles and drink a beer outside (among other things). March is a thing of the past for now (phew), and spring is in full, sweet swing."}, {"0298": "Look, I’m not going to tell you to quit drinking coffee or to get up at 5 AM every day — though more power to you if those are your goals and you’re meeting them — but I am going to make a couple of easy (five-minute) suggestions that might just make your days better and, ultimately, more productive."}, {"7aab": "Because you know that whole drinking a beer outside thing? It feels exponentially better when it takes place after a day you conquer (like a boss [insert wink])."}, {"1e15": "1. Do One Chore"}, {"2212": "Photo courtesy of Unsplash"}, {"ccc3": "That word is really the worst, isn’t it?"}, {"a5bd": "But we all have ’em, and some are less appealing than others, even those that take barely any time at all. What if, instead of putting everything off until “later,” or the weekend, you tackled one little item before you headed to work?"}, {"c1e2": "Maybe you empty the dishwasher (three minutes, tops), fold the clothes that have been piling up on your chair for days (five minutes), change your sheets (four to seven minutes, depending on your level of anal), or wipe down the bathroom sink (one and a half minutes)."}, {"2822": "Crossing one thing off of your household to-do list first thing is an awesome new way to start the day. Plus, when you get home to find that the dishwasher’s empty, your clothes are on hangars and in drawers, your bed’s made with fresh sheets, the bathroom sink’s sparkling, you’ll feel even better about your day."}, {"8877": "Related: Copy This Routine: How the Author of the 4-Hour Workweek Starts His Day"}, {"5c29": "2. Make Someone’s Day"}, {"4daf": "Photo courtesy of Unsplash"}, {"c086": "It can be as easy as sending a friend you haven’t talked to in a while a thoughtful text message or as spontaneous as writing a note to your grandma, popping it into an envelope, putting an address and stamp on it, and dropping it in the mailbox on your way to work. When you hear back from your friend a few minutes or hours later, you’ll be glad you took a moment to say hi. And when you hear from gram after she gets your snail mail, you’ll feel warm and fuzzy all over again."}, {"3233": "These are things that many of us probably think to do throughout the day, but then never get around to as work priorities take over, and before we know it, we’re leaving the office to deal with obligations (like picking up milk or the dry-cleaning). Do them when you’re not yet entrenched in, well, life."}, {"bed5": "3. Read"}, {"4bf1": "Photo courtesy of Unsplash"}, {"b700": "Not your Facebook feed or the comments on your latest Instagram post, and don’t even think I’m recommending email."}, {"4bb1": "No, I’m talking about real, solid, worthy reading (not that those emails from your boss aren’t important)."}, {"6e1a": "Are you in the middle of a book, or have you been wanting to read an article from your favorite site, a movie review, or a TV recap from the A.V. Club? This is a very nice time to engage with that kind of material."}, {"8c90": "Most of us, even those that are really pressed for time in the morning, probably have a few minutes that could be better spent. Ditch the social media and ignore your inbox for a few more moments, and remind yourself how refreshing it feels to do this kind of reading before almost anything else. This is you putting you first. You have the rest of the day to read and reply to emails, answer to people, and get caught up in the latest FB trends."}, {"f280": "Related: The 3-Task Trick That’ll Make Every Morning More Productive"}, {"8c41": "4. Eat Eggs"}, {"f09d": "Photo courtesy of Unsplash"}, {"97d9": "Surprised by this one? Unless you’re a staunch opponent of eating breakfast, it’s my personal experience that making eggs at home and sitting down to eat them is an excellent way to get the day started. Fried, poached, scrambled — it’s all good and delicious. And it’s protein, which I’ve heard keeps you fuller longer."}, {"11f7": "Seriously, if you regularly eat yogurt or cereal, try changing it up. If you typically grab a breakfast sandwich or a muffin on your way into the office, make a deliberate choice to eat at home with food you cooked."}, {"f983": "Another incentive? You’ll save money!"}, {"fc5a": "5. Unwind"}, {"9be8": "Photo courtesy of Unsplash"}, {"5c8e": "It may seem counterintuitive to factor this into your (hectic, rushed) morning, but what if it had the effect of making things feel less harried?"}, {"872a": "You don’t have to get caught up on your TV shows or go shopping (What? It helps me unwind), but try sitting quietly with your coffee, tea, or smoothie. Put on music that soothes you. Meditate for a few."}, {"3a0f": "Spring cleaning is intended to de-clutter your life, and that’s all this exercise is meant to do. Rethinking what it means to unwind and how you can work it into your life in the most beneficial way possible is the ultimate goal here."}, {"677a": "Related: 16 Better Ways to Start Your Day (That Have Nothing to Do With Breakfast)"}, {"ae8a": "There’s obviously myriad other ways to spring clean your morning regimen, and I’d encourage you to do you, whether that involves journaling, exercising, or giving into your love of the snooze button. The key is discovering practices and behaviors that motivate you to face the day and get ‘er done."}, {"45be": "Originally published at www.themuse.com on April 10, 2017."}], "child": "1745_1\t1745_21745_1\t1745_2"}