{"name": "1752", "parent": "", "content": "How I Hacked My Perspective 3 Glass Half Full Positivity Practices. I married Captain Optimistic and his positivity used to drive me bonkers. I practiced 3 things to help me from rolling my eyes every time he seemed to spew sunshine and roses. These 3 things ended up hacking my outlook. 1. Adapt — I surrounded myself with positive people and words Positivity is not stamped on my DNA like it is my husband’s. I Googled “species adaptation” and number 1 on Animal Planet’s list of adaptations was: “The habit of living together in communal or family groups. Animals can derive a lot of benefit from spending time with other members of the same species. Countless species engage in group living, either in herds, colonies, harems, complex societies or loose associations. But perhaps the simplest and most common form of group living in the natural world is that of nuclear families.” I had to find my “positive” family, so to speak. I sought out others to find out if my husband was an anomaly. Turns out there are herds of positive people and I needed to be friends with them to help me practice a positive outlook. When my pragmatic mind kicks in they give me a nudge in the positive direction. When I decided to launch my latest business venture I borrowed the motto of my former business partner and bestie. I wrote her motto on a post-it note and stuck it on my desk: “Clear Your Mind of Can’t.” Words are powerful. I seek positive perspectives and words in conversation, I search inspirational quotes and I recently discovered this awesome card that I’ll be sending to others to pay it forward: Emily McDowell’s line of cards are the bomb. 2. Habit — I practice daily positivity Living with captain optimistic’s glass half-full perspective has strengthened my ability to look on the bright side. But merely living with someone or surrounding yourself with those who have a positive outlook isn’t enough. Create a personal positivity daily habit. Write down one good thing that happened everyday or force yourself to have an alternative thought when you feel negative thoughts ensue. I practice reframing declarative statements into questions. “There is no way we’ll make that deadline.” Reframe: “How can we reset expectations and work together?” Simple shifts in narrative and perspective can make a world of difference. Every night I ask our boys what was your rose and thorn (best and worst part of your day). I learn so much from this and it’s a simple positivity practice. It forces us all to recognize one good thing. (In case you’re wondering, when Captain Optimistic is home he’s only allowed 3 roses, otherwise he’ll go on and on). 3. Roll with it — I try to flip my perspective when having a terrible, awful, no good day Things don’t always go as planned. I’ve learned to practice positivity in times of stress and life nuttiness. Practicing positivity in stressful situations helps me build resiliency. Re·sil·ient adjective (of a person or animal) able to withstand or recover quickly from difficult conditions I run 2 businesses, have 4 boys, a dog, live on a country property and Captain Optimistic travels. Life never goes as planned. Just the other day I was squeezing into my nylons and power dress to attend a red carpet event when my babysitter discovered the toilet overflowing downstairs. Literally, shit happens. I had lined up an entire afternoon of meetings and was going to cap off the evening at the event where an important introduction was to be made. As the feeling of despair and panic at undoing my afternoon and evening ensued, I took a deep breath and said to myself “First, let me call the plumber” and then “maybe this isn’t that bad.” Followed by, “If I’m real in communicating my situation maybe the folks I have to reschedule will understand.” Turns out they did understand and as I waited for the septic company to arrive, I changed my clothes and decided to change my narrative/my perspective on the situation. Turns out I had found time to check in with my boys on their school work. I read a book with my youngest son. I had an opportunity to schedule a 1:1 with the person I was to be introduced to instead of tracking him down at the crowded event. I flexed my resiliency muscle. Accepting the situation and trying to see the positive helped me roll with it. Later at the dinner table (ah, another positive, I got to have dinner with my boys) when asked what my rose and thorn was I answered, “my thorn turned into my rose.” That took years of positivity practice. ", "title": "How I Hacked My Perspective", "sentences": [{"9a77": "How I Hacked My Perspective"}, {"f597": "3 Glass Half Full Positivity Practices."}, {"df28": "I married Captain Optimistic and his positivity used to drive me bonkers. I practiced 3 things to help me from rolling my eyes every time he seemed to spew sunshine and roses. These 3 things ended up hacking my outlook."}, {"c1f9": "1. Adapt — I surrounded myself with positive people and words"}, {"2aa9": "Positivity is not stamped on my DNA like it is my husband’s. I Googled “species adaptation” and number 1 on Animal Planet’s list of adaptations was:"}, {"8767": "“The habit of living together in communal or family groups. Animals can derive a lot of benefit from spending time with other members of the same species. Countless species engage in group living, either in herds, colonies, harems, complex societies or loose associations. But perhaps the simplest and most common form of group living in the natural world is that of nuclear families.”"}, {"1df1": "I had to find my “positive” family, so to speak. I sought out others to find out if my husband was an anomaly."}, {"00b0": "Turns out there are herds of positive people and I needed to be friends with them to help me practice a positive outlook. When my pragmatic mind kicks in they give me a nudge in the positive direction."}, {"d046": "When I decided to launch my latest business venture I borrowed the motto of my former business partner and bestie. I wrote her motto on a post-it note and stuck it on my desk:"}, {"eba2": "“Clear Your Mind of Can’t.”"}, {"df57": "Words are powerful. I seek positive perspectives and words in conversation, I search inspirational quotes and I recently discovered this awesome card that I’ll be sending to others to pay it forward:"}, {"b52e": "Emily McDowell’s line of cards are the bomb."}, {"0103": "2. Habit — I practice daily positivity"}, {"4132": "Living with captain optimistic’s glass half-full perspective has strengthened my ability to look on the bright side. But merely living with someone or surrounding yourself with those who have a positive outlook isn’t enough. Create a personal positivity daily habit."}, {"9076": "Write down one good thing that happened everyday or force yourself to have an alternative thought when you feel negative thoughts ensue."}, {"d6ce": "I practice reframing declarative statements into questions. “There is no way we’ll make that deadline.” Reframe: “How can we reset expectations and work together?” Simple shifts in narrative and perspective can make a world of difference."}, {"4709": "Every night I ask our boys what was your rose and thorn (best and worst part of your day). I learn so much from this and it’s a simple positivity practice. It forces us all to recognize one good thing. (In case you’re wondering, when Captain Optimistic is home he’s only allowed 3 roses, otherwise he’ll go on and on)."}, {"5d4d": "3. Roll with it — I try to flip my perspective when having a terrible, awful, no good day"}, {"5040": "Things don’t always go as planned. I’ve learned to practice positivity in times of stress and life nuttiness. Practicing positivity in stressful situations helps me build resiliency."}, {"603c": "Re·sil·ient adjective (of a person or animal) able to withstand or recover quickly from difficult conditions"}, {"1ef9": "I run 2 businesses, have 4 boys, a dog, live on a country property and Captain Optimistic travels. Life never goes as planned."}, {"a6ad": "Just the other day I was squeezing into my nylons and power dress to attend a red carpet event when my babysitter discovered the toilet overflowing downstairs. Literally, shit happens."}, {"6d42": "I had lined up an entire afternoon of meetings and was going to cap off the evening at the event where an important introduction was to be made. As the feeling of despair and panic at undoing my afternoon and evening ensued, I took a deep breath and said to myself “First, let me call the plumber” and then “maybe this isn’t that bad.” Followed by, “If I’m real in communicating my situation maybe the folks I have to reschedule will understand.”"}, {"10c0": "Turns out they did understand and as I waited for the septic company to arrive, I changed my clothes and decided to change my narrative/my perspective on the situation."}, {"e307": "Turns out I had found time to check in with my boys on their school work. I read a book with my youngest son. I had an opportunity to schedule a 1:1 with the person I was to be introduced to instead of tracking him down at the crowded event."}, {"6104": "I flexed my resiliency muscle. Accepting the situation and trying to see the positive helped me roll with it."}, {"7081": "Later at the dinner table (ah, another positive, I got to have dinner with my boys) when asked what my rose and thorn was I answered, “my thorn turned into my rose.” That took years of positivity practice."}], "child": "1752_1"}