{"name": "1754", "parent": "", "content": "How Writing Weekly on Medium Changed My Life One year ago I gave myself a challenge to post one blog post each week on Medium. Why? I wanted to see if this writing hobby of mine had any merit. Nothing better than a self imposed rule with the hashtag #humpdayheidi. With friend and family encouragement, I published a new piece every Wednesday. My weekends, previously spent having far flung adventures with a glass of whisky, were now devoted to my writing desk. I solicited topics, daydreamed plots and did what every writer must do–forced my ass in the chair even when I had nothing to say. With time, I always found something. My raw weekend prose was sculpted into something manageable on weekday train rides to work. After 52 weeks of discipline, this is what happened and what I learned. 1. My writing got better To create flow, one must create a ritual. Weekend writing became easier and easier until I was like Pavlov’s dog, salivating at the thought of prose, before my ass-chair time even came. I also became better at self editing developing an understanding of which things worked and which things didn’t. I started to be wary of superfluous adjectives and overly needy verbs. I also had “editors” devote their time to helping me. Sometimes they were friends in Tahoe that I forced to read my work in exchange for a hearty meal. Other times it was my family. My cousin pushed me when I wasn’t “being real enough” and my mother cleaned up almost every single post until it shone.”It still needs tightening” she’d say until I treated my posts like a balsamic reduction. Reduce, reduce, reduce until I got a good thick syrup. 2. I went viral…and international Medium is a great way for other publications to discover and syndicate new writers. From Quartz to the Observer to Huffington Post to tiny outfits in Australia, China and even an orthodox Christian site, my writing speckled the internet like dots on a pointillist painting. People recognized my name when I ordered a cocktail in New York and one person even asked for my autograph at a dinner party in Oakland. I may have been poor, but I had a tinge of fame. Well, at least when it came to writing about love’s mishaps on the interwebs. 3. To go viral, I had to make a lot of experiments, In the book The Originals, Adam Grant writes, “….On average geniuses weren’t qualitatively better in their fields than their peers. They simply produced a greater volume of work, which gave them more variation and a higher chance of originality.” I could never tell which post would resonate and go viral and which would be a lonely tumbleweed, blowing through a deserted IP address. Some of the things I thought were amazingly good only got a few likes from my mother, boyfriend, and that random person in Australia. Some posts I felt “meh” about sizzled and got retweeted hundreds of times. There was no way to predict success. I just had to keep at it. Every single week, one post in front of the other. 3. I grew a whole new love of humanity, even for the lonely people. When writing moves people, they respond. Perhaps because I wrote about relationships with my own vulnerable stories, people felt safe to write me personally and chime in with their own. So many people were lonely! People all over the world told me their hopeful dreams and devastating heartaches. Everyone was desperate for understanding and love. It made me wonder- What can we do to increase love? In an age of faceless digital interactions, how can we better unite one another? How can we comfort the lonely, and in turn, comfort ourselves? My personal ‘raison d’être’ started to change. 4. I viewed relationships differently Before I started writing consistently about relationships, I had a sense of entitlement about them. I didn’t think so much about what I could give someone, but rather what they could give me. However, after a year of observing other people to get material, I realized how flawed the urban dating scene was. People were constantly trying to trade up other people, just like they would a job, a car, or a house. I decided to focus on what I had, uncover the beauty in human imperfection, and be patient. One doesn’t find soul mates after all. Soul mates are created. 5. I got paid to speak Vulnerability sells. I got offered a few speaking engagements where I spoke about the power of vulnerability. I realized that what I was learning about love had direct applications to the corporate world. To be successful in business, one needs to be successful with people. Our ability to communicate and collaborate paves the way for promotion and vulnerability actually helps us get there faster. I realized not only did I like writing, I also liked speaking. It’s just another form of storytelling. 6. I got a new job If my current employer hadn’t started reading my work on Medium, we probably never would have gotten together to talk about his company mission–to make the world more human. This resonated deeply with the writing I was trying to do. We started talking about ideas and experiences, and months later, I ended up joining his company. Writing opened up many doors, but the best one was the ability to have a career that harnessed my desire for greater human connection and impact. During my first week on the job we had an important meeting with a leading corporate innovation center. The executive in charge greeted me with ‘Heidi! — Well, I just finished reading your post on why women should date carpenters.” Ahem. Luckily, I had landed the right job. My Carrie Bradshaw tendencies weren’t grounds for termination, but rather encouragement to write more…just perhaps try out some new topics. 7. I discovered I was meant to write Perhaps it was the worldwide recognition that gave me validation. Or maybe it was the fact that I started to look forward to my solitary wordplay. I stopped craving penthouse cocktail parties, and wanted to spend more time alone with my laptop and an idea. Writing, more than any other pursuit, made me feel the most “me.” Whether it was short stories or business cases or dating mishaps, I just couldn’t keep thoughts inside of me. I may not post every week anymore, but that doesn’t mean I am not writing. I am just working on something larger. I would encourage everyone to write….but perhaps you are not a writer with a obsession for words, but are instead a closet painter, a wanna- be musician,or an occasional baker. What can you do each week to grow your craft? How can you use it to further connect to your community? Sometimes your greatest passion will lead you to your greatest impact. All it takes is a little discipline... ", "title": "How Writing Weekly on Medium Changed My Life", "sentences": [{"115e": "How Writing Weekly on Medium Changed My Life"}, {"8658": "One year ago I gave myself a challenge to post one blog post each week on Medium. Why? I wanted to see if this writing hobby of mine had any merit. Nothing better than a self imposed rule with the hashtag #humpdayheidi."}, {"b3f9": "With friend and family encouragement, I published a new piece every Wednesday. My weekends, previously spent having far flung adventures with a glass of whisky, were now devoted to my writing desk. I solicited topics, daydreamed plots and did what every writer must do–forced my ass in the chair even when I had nothing to say. With time, I always found something. My raw weekend prose was sculpted into something manageable on weekday train rides to work. After 52 weeks of discipline, this is what happened and what I learned."}, {"1709": "1. My writing got better"}, {"428a": "To create flow, one must create a ritual. Weekend writing became easier and easier until I was like Pavlov’s dog, salivating at the thought of prose, before my ass-chair time even came. I also became better at self editing developing an understanding of which things worked and which things didn’t. I started to be wary of superfluous adjectives and overly needy verbs. I also had “editors” devote their time to helping me. Sometimes they were friends in Tahoe that I forced to read my work in exchange for a hearty meal. Other times it was my family. My cousin pushed me when I wasn’t “being real enough” and my mother cleaned up almost every single post until it shone.”It still needs tightening” she’d say until I treated my posts like a balsamic reduction. Reduce, reduce, reduce until I got a good thick syrup."}, {"af7f": "2. I went viral…and international"}, {"5d2d": "Medium is a great way for other publications to discover and syndicate new writers. From Quartz to the Observer to Huffington Post to tiny outfits in Australia, China and even an orthodox Christian site, my writing speckled the internet like dots on a pointillist painting. People recognized my name when I ordered a cocktail in New York and one person even asked for my autograph at a dinner party in Oakland. I may have been poor, but I had a tinge of fame. Well, at least when it came to writing about love’s mishaps on the interwebs."}, {"f7fa": "3. To go viral, I had to make a lot of experiments,"}, {"02eb": "In the book The Originals, Adam Grant writes,"}, {"fa2e": "“….On average geniuses weren’t qualitatively better in their fields than their peers. They simply produced a greater volume of work, which gave them more variation and a higher chance of originality.”"}, {"f44a": "I could never tell which post would resonate and go viral and which would be a lonely tumbleweed, blowing through a deserted IP address. Some of the things I thought were amazingly good only got a few likes from my mother, boyfriend, and that random person in Australia. Some posts I felt “meh” about sizzled and got retweeted hundreds of times. There was no way to predict success. I just had to keep at it. Every single week, one post in front of the other."}, {"8cc6": "3. I grew a whole new love of humanity, even for the lonely people."}, {"2486": "When writing moves people, they respond. Perhaps because I wrote about relationships with my own vulnerable stories, people felt safe to write me personally and chime in with their own. So many people were lonely! People all over the world told me their hopeful dreams and devastating heartaches. Everyone was desperate for understanding and love. It made me wonder-"}, {"8a71": "What can we do to increase love?"}, {"cf7b": "In an age of faceless digital interactions, how can we better unite one another?"}, {"3166": "How can we comfort the lonely, and in turn, comfort ourselves?"}, {"26f4": "My personal ‘raison d’être’ started to change."}, {"9d62": "4. I viewed relationships differently"}, {"7e39": "Before I started writing consistently about relationships, I had a sense of entitlement about them. I didn’t think so much about what I could give someone, but rather what they could give me. However, after a year of observing other people to get material, I realized how flawed the urban dating scene was. People were constantly trying to trade up other people, just like they would a job, a car, or a house. I decided to focus on what I had, uncover the beauty in human imperfection, and be patient. One doesn’t find soul mates after all. Soul mates are created."}, {"0715": "5. I got paid to speak"}, {"4c63": "Vulnerability sells. I got offered a few speaking engagements where I spoke about the power of vulnerability. I realized that what I was learning about love had direct applications to the corporate world. To be successful in business, one needs to be successful with people. Our ability to communicate and collaborate paves the way for promotion and vulnerability actually helps us get there faster. I realized not only did I like writing, I also liked speaking. It’s just another form of storytelling."}, {"4966": "6. I got a new job"}, {"f695": "If my current employer hadn’t started reading my work on Medium, we probably never would have gotten together to talk about his company mission–to make the world more human. This resonated deeply with the writing I was trying to do. We started talking about ideas and experiences, and months later, I ended up joining his company. Writing opened up many doors, but the best one was the ability to have a career that harnessed my desire for greater human connection and impact."}, {"9e5b": "During my first week on the job we had an important meeting with a leading corporate innovation center. The executive in charge greeted me with ‘Heidi! — Well, I just finished reading your post on why women should date carpenters.” Ahem."}, {"95e0": "Luckily, I had landed the right job. My Carrie Bradshaw tendencies weren’t grounds for termination, but rather encouragement to write more…just perhaps try out some new topics."}, {"5c8e": "7. I discovered I was meant to write"}, {"3103": "Perhaps it was the worldwide recognition that gave me validation. Or maybe it was the fact that I started to look forward to my solitary wordplay. I stopped craving penthouse cocktail parties, and wanted to spend more time alone with my laptop and an idea. Writing, more than any other pursuit, made me feel the most “me.” Whether it was short stories or business cases or dating mishaps, I just couldn’t keep thoughts inside of me. I may not post every week anymore, but that doesn’t mean I am not writing. I am just working on something larger."}, {"c1e0": "I would encourage everyone to write….but perhaps you are not a writer with a obsession for words, but are instead a closet painter, a wanna- be musician,or an occasional baker. What can you do each week to grow your craft? How can you use it to further connect to your community?"}, {"5d8c": "Sometimes your greatest passion will lead you to your greatest impact. All it takes is a little discipline..."}], "child": "1754_1\t1754_2\t1754_3\t1754_4\t1754_5\t1754_6\t1754_7\t1754_8\t1754_9\t1754_10\t1754_11\t1754_12\t1754_13\t1754_14\t1754_15\t1754_16\t1754_17\t1754_18\t1754_19\t1754_20\t1754_21\t1754_22\t1754_23\t1754_24\t1754_251754_1\t1754_2\t1754_3\t1754_4\t1754_5\t1754_6\t1754_7\t1754_8\t1754_9\t1754_10\t1754_11\t1754_12\t1754_13\t1754_14\t1754_15\t1754_16\t1754_17\t1754_18\t1754_19\t1754_20\t1754_21\t1754_22\t1754_23\t1754_24\t1754_25"}