{"name": "1755", "parent": "", "content": "We live in the blue ruin 1. The Preliminaries You are permitted twenty things from the old life before the move. Fingers count. Single eyelashes count. A breath does not. Breathing is a given. Antiseptic is forbidden. Bones, you can have those. Don’t bother with your voice — it’ll be removed in stages. Besides, no one speaks inside The Blue. People always forget about skin even though it’s the one item they’ll invariably need — how else will you hold yourself together when you enter The Blue? Baffling. Pairs are a technicality — feet, hands, kidneys, ears, and eyes — you may keep the plurals with some restrictions. For example, you may retain your feet but you’ll have to make tough decisions regarding the toes. Eyes may be preserved but sight isn’t guaranteed. We’re not unreasonable people, but there are limits to our generosity. Some of The Originals try to invent loopholes, they lobby for shared items and fractions — if we each preserve 2.5 fingers we’ll have an entire right hand! We have to remind them that while they may leave together, they go in alone. The only math up for discussion is subtraction. Know that you will become a passenger in your own body. A thick darkness will cover your face. I’m sorry for your loss, they say to one another as items are discarded. Is that what this is? 2. Provisions We will provide you with the latest technology. Our motion sensor keypads will allow you to form paragraphs with the slightest of movements. We can’t get into specifics because our techniques are proprietary, but we assure you that our products come with a money-back guarantee. Hunger and thirst will be retired. Most bodily functions will depreciate. You will be assigned a finite number of emotions so as to individualize your experience, but we will monitor your habits and adjust accordingly. We had an incident — you might have read about it in the papers — concerning @grady. We miscalculated the appropriate dosage of desire, and as a result we experienced an unfortunate situation, a contagion. His banal encounter with Super User @felsull was misinterpreted; affection developed (one-sided, of course, because @felsull really didn’t have the time since she accumulating one million Likes, Hearts and Fans!) that resulted in a virus that plagued all of The Blue. He literally gave her his heart and the virus nearly crashed our servers. Do you know how many cells there are in one human heart? Two billion. What a fucking disaster. Don’t worry. We’ve taken the proper precautions to ensure an affliction of this magnitude doesn’t occur again. We’ve opened up call centers staffed with community managers who actively police the engagements with our most active members, top earners, and emerging talent. Emotions are modulated when appropriate. And yes, our call center staff has been allowed complete use of their limbs — a small investment for the necessary work they do. You will have everything you need to start your new life in The Blue. Here is your Welcome Packet. We suggest you actually read it. A side note — sentimental types tend to carry over an article of clothing, a photograph, or a piece of furniture, and they will soon realize that these items are irrelevant in The Blue. Everyone assumed memory would be a given (it is not — breath is the only default setting — and we’re tired of reminding you people of this), and one day they wake, confused. Who are those people in the picture? What is a picture? How do I know this word? There is an upholstered chair in the corner but you’ve elected not to keep your legs so what’s the point? What use do you have for that shirt when a chest cavity becomes extraneous? When a stomach is left off the list? Because of this, we remind everyone during the intake session: bring only what you need. Bring only that which is required to function. Over time you can win back the rest. May we remind you: twenty items. 20. Some ask: where do the items go? We respond how we always respond: they are returned to The Deserving. How else would we be able to run The Blue? Measures are needed to protect you from one another and those measures require resources, money. We exist to preserve life. Have you reviewed the contents of your Welcome Packet along with your New Identity Folder? You have been assigned an online identity, an avatar (we can make adjustments — we’ve found Photoshop to be useful), a social media presence (your starting point is determined by a number of factors including projected possibility of popularity, race, gender, age, and income), a set of interests, likes and dislikes — personal preferences, if you will — and a library of rights-free images, fonts, popular vernacular, and emoticons. You’ll enjoy monthly refreshes, and we can discuss your goals for personal growth during Quarterly Review. By now you’ve heard the rumors about the disproportionate allocation of audiences. Let me assure you that these aren’t rumors, they’re facts, and that’s what makes the game interesting. If everyone were equal what fun would that be? There’s a race, gender and age hierarchy in your packet, but why bother reading what you already know. The good news is that The Blue can elevate your status. The challenges you complete and the points you accumulate will one day afford you the privilege of The Deserving. All the rules of engagement are detailed in your Packet. The goal is to be popular, be liked, and you do this by being what people wish they could be. Pictures and inspiring quotes only go so far — we merely give you the tools in the toolbox, it’s up to you to build your kingdom. You might have heard about the success stories and know that with an increase in your social status you get special privileges. We attach badges to your avatar and you get to change your font size and color. People will know you’re special. Cliques, groups and fiefdoms are inevitable in The Blue because where there are thoughts and a means in which to express them (even in our strictly monitored and controlled environments), hierarchies will always exist. We encourage you to not engage in flamewars only if it is to your strategic advancement. Nobody likes a troublemaker, and due to recent budget cuts most of our community managers can’t work overtime. 3. The Originals The first thing we lost was our voice. It slipped away in stages. Next were the pictures in the frames. All gone. Then the children vanished, one by one. No one noticed at first. Some of the mothers couldn’t cry out for help (no voice), so they were forced to scream their sorrow on paper. They wrote in all-caps because this is still the easiest way to get someone’s attention. The children were taken with their eyes half closed, in the space between sleep and awakening. We saw the fliers, the missing persons reports, and the websites showing the pictures that had been removed from the frames and a reward for the children’s safe return. No one will ask questions, just give us back our children. Bring them home. One day we received printed notices sealed in white envelopes. We will give you back the children but we require something in return. We posted signs on our window detailing the terms of our surrender. Back then we didn’t know we were prolonging the inevitable — everyone is forced (or born) into The Blue. We were naïve, desperate. We would do anything to return to normal. So we read about a program that promised a rebirth. Imagine being born into a virtual world where pain ceased to exist. There would be no pestilence, famine, corruption, environmental catastrophe, or war. The whole of your life would exist within the confines of a 7x7 room — a virtual bunker that would shield us from the physicality of the natural world. The room would have no windows, only walls that served as screens. We pictured an existence free of Republicans, Christian fundamentalists, global warming, telemarketers, reality TV shows, eyeliner, stamps, parking tickets, kale, and junk mail. We were locked in a room for a trial period. Over the years we experienced a gradual, careful loss. Items from our person were being removed and we didn’t register their loss until the next item vanished. You notice a nail gone when a whole thumb goes missing — that sort of thing. We never discuss the accumulations, even after the years following our release, because how could we? How could we explain the negligence that occurs when whole parts of our bodies vanished? How could we comprehend that we don’t remember the children we spent ten years in a room trying to reclaim? Was it worth it? When we were paraded out in front of our children to say our goodbyes, some parents blinked onto their screens: I’m sorry. Do you belong to me? I don’t remember you. Why are you making this sacrifice? You hardly remember us. Later we learn that the children were told that we would say this. They were encouraged to nod politely and ignore us, as teenagers are prone to do. You’re probably wondering why no one’s crying. Simple — we don’t mourn what we don’t remember missing. Weeping feels futile when our emotions have been excised so cleanly and completely. We don’t wonder where hearts originate. When we were released and labeled The Defective, our children were shuttled into our rooms to take our place. They were promised fully functioning parents, an all-expenses-paid re-assembly, if they were to participate in the beta. The Deserving required additional observational data. We want clocks so we’ll know when our time is up! The children’s demands were indulged because they bordered on adolescence, and part of our job required this level of entertainment. The children didn’t know about the vanishings — they didn’t foresee the taxonomy of things they would slowly, inevitably lose. They were told their parents were an experiment gone wrong, an anomaly. No one tells the children where we end up. They don’t see the advertisements regarding the opening of our exhibit. How the rooms they’ve now been locked in have been recreated in excruciating detail and how we’ll spend the rest of our days trapped in them. They don’t hear the promises to The Deserving — we’re doing this all for you! Everyone is lead to believe that The Blue is a sanctuary. No one sees that The Deserving never receive Welcome Packets. They aren’t invited to the Open Houses. No one accounts for the fact that The Deserving have bonfire parties where they laugh over the items that have been surrendered and discarded. In moments they snatch up the items that take months for The Defective to give away. We tell The Deserving to not be greedy, they are in the minority and there’s enough to go around. New Defectives are born for The Blue every day. 4. Call Center Log. Incident #4232.12A @nadia tries to jump out of a window, only there were no windows, only walls, and @nadia doesn’t have legs or feet but that doesn’t stop her from trying — not hard enough it seems. We see her cursor making a kicking motion. We watch her paint her blue room black out of protest. We record her not logging on for 3 days and 2 hours. During that time she processes forms to change her avatar to a photo of the dog she was forced to leave behind — a Pomeranian that sleeps with one of The Deserving at night. When there’s a server outage, @nadia can sometimes see the photos posted by those on the Outside. The puppy she held in her hands now sleeps beside a little girl with red hair. @nadia knows this because the mother posts photos of her sleeping daughter online for everyone to see. It’s an infraction to brag about items redistributed, and the mother will get fined at the most and receive a stern email at the very least, but in the end @nadia blames herself because her dog was not one of the twenty. On the fourth day she offers @mikey her badges in exchange for a window with a view — she’s read about the infamous @mikey in the underground forums. But @mikey is a mole, a spy, a low-level agent of The Deserving, and he posts unflattering photos of @nadia as punishment for her infraction. @nadia unfollows people; she blocks them and joins a forum instructing people on how to delete. Burn your manual. We’ll show you how to secure a dignified end. @nadia: Kevin, can you do me a favor and turn off the fucking cameras? Give a woman a little privacy, would you? Operator Kevin Gray: @nadia, you know I can’t do that. @nadia: We all know about the budget cuts, the infighting on the Outside. There’s no one around to monitor you. They’re too busy fighting over the leftovers. Operator Kevin Gray: We’ve been keeping track… @nadia: There’s no we; there’s only you. Operator Kevin Gray. And last time I checked all your limbs were intact — you have the privilege of being a person, while I’m a screen name, a thing in a room with 20 objects down to 15. My memory was #13 of 20, and sometimes I wish I’d brought Lacy instead of that. Operator Kevin Gray: (sighs) You know they wouldn’t have allowed a complete pet. Nothing living arrives in tact. Love is what’s abandoned because there aren’t enough numbers to bring something as large as that in. @nadia: (photograph disappears; she starts the download) Stay with me while I delete. Operator Kevin Gray: Don’t fuck this up. You’ve got a good set-up here. @nadia: This is good? All I see is a prison with an Internet connection. I lost an eye five minutes ago and I didn’t even know it. Do you know what that’s like? To live each day in fear of what will be missed? Operator Kevin Gray: You know I can’t allow that. You know — @nadia: I know, what? That we’re The Deserving’s entertainment? That we’re what they watch now that televisions have been taken away? That we’ll never earn our way out — the badges, hearts, and numbers are a mountain of false hope. Operator Kevin Gray, we know. We know that we’ll lose our twenty over time. We know that we’ll be replaced and our fans redistributed and our hearts bled back to white. A lot of us have been afraid for a long time, and fear was the one emotion you forgot to modulate maybe because you suspected we would never figure you out. A lot of us know who you are, what we really are, and we’re telling as many as we can. You forgot, Operator Kevin Gray. #18 was my intelligence. #19 was my dignity. Operator Kevin Gray admires @nadia so you have to know that he doesn’t take the following events — the gas and the injections after — lightly. But he has a duty. Even though she’s one of The Original’s children, a girl who spends her life confined to four screens, a ceiling and a floor, he has a purpose. Even though she forgets how heavy rain wrinkled her skin and how fireflies glowed hot in the night, he has a duty. Operator Kevin Gray wipes her browsing history clean and removes the photo of her puppy. When @nadia wakes the next morning she can’t recall how she arrived at her room or why she has been placed there, she only knows that she’s meant to turn on the computer and start accumulating. Nearly every everything of hers has vanished, and she will never remember what she had and subsequently lost. She’ll never realize that Operator Kevin Gray is watching, that in the middle of the night, he retrieved and returned one of her eyes. A week later we start making our withdrawals from Kevin. He goes willingly, of course. He never asks why because he knows. His duty was to take orders and his purpose was to follow them. Operator Kevin Gray was never supposed to feel anything for The Defective. He wasn’t supposed to feel anything at all. 5. The Situation on the Outside What do you mean they’re bored? We’ve got nearly the entire world population cut up and shut up in rooms and the children require additional amusements, further costume changes? Do you understand the sacrifices that have been made? The gods everyone had to forsake for The Deserving? There is no rewinding of the tape. Turning back is impossible. Let’s dial down the dramatics. I’m just saying that some are concerned about the methods that have been employed against some of the dissidents. Others have suggested that we’ve taken The Blue too far… Now you have a conscience? Maybe you should have considered that before posting videos of your friends in The Defectives’ houses, rummaging through their things, eating their food, and filling up your bodies with their organs. The past is past. Now we’re wondering whether there’s a middle ground, if there’s something that we can give to appease them. Not enough for them to be dangerous, but something that allows them to be grateful. They trust you — the sites and forums your company built — you’re their sole connection to what’s in and beyond The Blue. More like appease you, but let’s say I sell the story of hope to The Defective. What do I get in return? Your men get their overtime. And you get what you’ve always wanted. Recognition. Respect. Love. 6. Cracks One morning @nadia’s Pomeranian attacks the little Deserving in her sleep. The parents call the hospital and are given a ticket number. We’re in a war; a dog bite is considered low priority. Call us back when the dog mauls her and we’ll bump her number up. Until then… When the father shouts, rattling off his title and rank of importance, the operator responds by blasting hold music. The daughter is bleeding and the wife insists that she’ll need a transfusion. Already the woman is cutting herself and bleeding into a mason jar just in case. She’s adopted; she’s not even our blood type the father says. It would be just like you to remind me, the wife responds. Clearly your rank isn’t that important. A week later the little Deserving dies from infection, and in her grief the mother curls up next the dog, dresses it, and calls it by the little girl’s name. When the father kicks up a fuss, he’s demoted and denied access to the country club. We’re in the middle of a fucking war, the wife cries out. No one’s playing golf. No one’s asking for Glenfiddich on the rocks. I don’t even understand why we’re at war. Didn’t we get rid of The Defectives? Everyone’s the same — what’s there left to fight about? And you wonder why your body wasn’t built for children. The online publisher gets his overtime and a standalone show on all the premiere screens once the televisions becomes extinct, but one night he wakes in terror and writes on a piece of paper: This is what happens when you delete without a proper archive. Profiles and pages and photos and approvals deleted without burial. They work so hard to be one of the enviable and beloved. They spend days calibrating words and editing photos. They study and analyze the monthly data and trend reports and take fastidious notes during Quarterly Review. And yet we’re deleting pages faster than we create new ones. We scrub down their rooms and incinerate any leftovers from the twenty. The Defective are only know for the duration of their online existence while people write and publish books about the brave Deserving who are dying in droves. Some amongst us — the not so bright — contemplate enacting a draft, a grand act of patriotism on behalf of The Defective. We are at war and need reinforcements. The idea nearly becomes law with opposing sides ready to make their picks like a game of grade school dodge ball, until we have to remind them that The Defective are no longer people. They’ve donated their actual hearts for virtual ones because what use did they have for a heart that pumped blood through a whole archipelago of organs that now ceased to exist? They’ve been taught to take only that which they need in order to grow their fanbase and prove they themselves worthy of someone’s attention and love. Only then do they have a chance to recover what was discard before entering The Blue. Some make their gains based on their situation (who wouldn’t throw an old woman dying of cancer a like or a team #followback? Who wouldn’t give a toddler a re-pin, a re-tweet?) The new life and near dying have it easy while everyone in the middle has to work. In The Blue you learn quickly that you have to earn your keep. That knowledge makes your stronger even when everyone on the Outside grows soft, complacent, comfortable and weak. Some of The Deserving won’t let this draft business go, and we nearly miss the screen showcasing The Defective who risked it all to bring in a kitten. It paid off because Pickles the Pink Kitten banked seventy million views on his series of Dear Defective videos — how-tos for those new to The Blue. Pickles’ owner was one of the elusive few that managed to retrieve her hearing. Functioning ears! The day the rumor spread The Defectives re-gramed pictures of Pickles with the hashtag #goals. And we’re missing the debut of the latest video because some Deserving with a donated Defective brain has a bright idea about drafting blinking cursors to do their dirty work. We are exasperated. What are you going to do? Book a conference room and have them tweet our enemies to death? You’d be surprised what an online mob can do to an offline life. Remember that sweet picture of the little girl and the Pomeranian and how it went viral? You know what happened to that girl? Dead. Everyone remembers the dead little girl and the puppy that takes her place. I heard the dog took off her face! Lies, all lies, it was only a flesh wound and a father who got a lousy ticket and hold music. Hold music. One says: I know how we’ll conquer our enemies. Put them in The Blue with hold music. Everyone gasps. The Blue is a war crime. We might as well behead and water-board while we’re at it. 7. Fault lines Over the next year and during the war that would stretch for an additional ten, bodies begin to give out. Donated organs from The Defective become…defective. Houses collapse and furniture rots, mushrooms bloom from the insides of cushions and along the walls. Wallpaper peel and animals keel over. Land that was once fertile expels fumes. Flowers recoil and vegetables turn to ash. It’s as if everything that has been taken from The Defective expires when they do. Sometimes people wake to see The Defectives’ fingers under their doors or crawling up from the floorboards. Long after the books about The Deserving have been burned and everyone discusses the return of the abacus and Paleolithic diets, there exists a small community of young Blues who archive. We are the minority and we’re dying while The Defective replicate and reproduce online. We are dying and times are changing and our children, who remember the girl who got bit by the dog and the parents who did nothing, begin to realize that maybe we got it wrong. Maybe we’re the ones who needed to be contained. Maybe those in the Blue are the beautiful ones — fragile, refined parts of a person trying to be a person, trying to live and project the very best of their sad and tragic life. ", "title": "We live in the blue ruin", "sentences": [{"2735": "We live in the blue ruin"}, {"478d": "1. The Preliminaries"}, {"ed14": "You are permitted twenty things from the old life before the move. Fingers count. Single eyelashes count. A breath does not. Breathing is a given. Antiseptic is forbidden. Bones, you can have those. Don’t bother with your voice — it’ll be removed in stages. Besides, no one speaks inside The Blue. People always forget about skin even though it’s the one item they’ll invariably need — how else will you hold yourself together when you enter The Blue? Baffling. Pairs are a technicality — feet, hands, kidneys, ears, and eyes — you may keep the plurals with some restrictions. For example, you may retain your feet but you’ll have to make tough decisions regarding the toes. Eyes may be preserved but sight isn’t guaranteed. We’re not unreasonable people, but there are limits to our generosity. Some of The Originals try to invent loopholes, they lobby for shared items and fractions — if we each preserve 2.5 fingers we’ll have an entire right hand! We have to remind them that while they may leave together, they go in alone. The only math up for discussion is subtraction. Know that you will become a passenger in your own body. A thick darkness will cover your face."}, {"1273": "I’m sorry for your loss, they say to one another as items are discarded. Is that what this is?"}, {"d647": "2. Provisions"}, {"b682": "We will provide you with the latest technology. Our motion sensor keypads will allow you to form paragraphs with the slightest of movements. We can’t get into specifics because our techniques are proprietary, but we assure you that our products come with a money-back guarantee. Hunger and thirst will be retired. Most bodily functions will depreciate. You will be assigned a finite number of emotions so as to individualize your experience, but we will monitor your habits and adjust accordingly. We had an incident — you might have read about it in the papers — concerning @grady. We miscalculated the appropriate dosage of desire, and as a result we experienced an unfortunate situation, a contagion. His banal encounter with Super User @felsull was misinterpreted; affection developed (one-sided, of course, because @felsull really didn’t have the time since she accumulating one million Likes, Hearts and Fans!) that resulted in a virus that plagued all of The Blue. He literally gave her his heart and the virus nearly crashed our servers. Do you know how many cells there are in one human heart? Two billion."}, {"a4e7": "What a fucking disaster."}, {"1e94": "Don’t worry. We’ve taken the proper precautions to ensure an affliction of this magnitude doesn’t occur again. We’ve opened up call centers staffed with community managers who actively police the engagements with our most active members, top earners, and emerging talent. Emotions are modulated when appropriate. And yes, our call center staff has been allowed complete use of their limbs — a small investment for the necessary work they do."}, {"99be": "You will have everything you need to start your new life in The Blue. Here is your Welcome Packet. We suggest you actually read it."}, {"9d32": "A side note — sentimental types tend to carry over an article of clothing, a photograph, or a piece of furniture, and they will soon realize that these items are irrelevant in The Blue. Everyone assumed memory would be a given (it is not — breath is the only default setting — and we’re tired of reminding you people of this), and one day they wake, confused. Who are those people in the picture? What is a picture? How do I know this word? There is an upholstered chair in the corner but you’ve elected not to keep your legs so what’s the point? What use do you have for that shirt when a chest cavity becomes extraneous? When a stomach is left off the list? Because of this, we remind everyone during the intake session: bring only what you need. Bring only that which is required to function. Over time you can win back the rest."}, {"53f1": "May we remind you: twenty items. 20. Some ask: where do the items go? We respond how we always respond: they are returned to The Deserving. How else would we be able to run The Blue? Measures are needed to protect you from one another and those measures require resources, money. We exist to preserve life."}, {"82f6": "Have you reviewed the contents of your Welcome Packet along with your New Identity Folder? You have been assigned an online identity, an avatar (we can make adjustments — we’ve found Photoshop to be useful), a social media presence (your starting point is determined by a number of factors including projected possibility of popularity, race, gender, age, and income), a set of interests, likes and dislikes — personal preferences, if you will — and a library of rights-free images, fonts, popular vernacular, and emoticons. You’ll enjoy monthly refreshes, and we can discuss your goals for personal growth during Quarterly Review."}, {"27fd": "By now you’ve heard the rumors about the disproportionate allocation of audiences. Let me assure you that these aren’t rumors, they’re facts, and that’s what makes the game interesting. If everyone were equal what fun would that be?"}, {"f6d7": "There’s a race, gender and age hierarchy in your packet, but why bother reading what you already know. The good news is that The Blue can elevate your status. The challenges you complete and the points you accumulate will one day afford you the privilege of The Deserving. All the rules of engagement are detailed in your Packet. The goal is to be popular, be liked, and you do this by being what people wish they could be. Pictures and inspiring quotes only go so far — we merely give you the tools in the toolbox, it’s up to you to build your kingdom. You might have heard about the success stories and know that with an increase in your social status you get special privileges. We attach badges to your avatar and you get to change your font size and color. People will know you’re special."}, {"e900": "Cliques, groups and fiefdoms are inevitable in The Blue because where there are thoughts and a means in which to express them (even in our strictly monitored and controlled environments), hierarchies will always exist. We encourage you to not engage in flamewars only if it is to your strategic advancement. Nobody likes a troublemaker, and due to recent budget cuts most of our community managers can’t work overtime."}, {"5ae1": "3. The Originals"}, {"84a3": "The first thing we lost was our voice. It slipped away in stages."}, {"3267": "Next were the pictures in the frames. All gone. Then the children vanished, one by one. No one noticed at first. Some of the mothers couldn’t cry out for help (no voice), so they were forced to scream their sorrow on paper. They wrote in all-caps because this is still the easiest way to get someone’s attention. The children were taken with their eyes half closed, in the space between sleep and awakening. We saw the fliers, the missing persons reports, and the websites showing the pictures that had been removed from the frames and a reward for the children’s safe return. No one will ask questions, just give us back our children. Bring them home."}, {"4dd8": "One day we received printed notices sealed in white envelopes."}, {"1f6e": "We will give you back the children but we require something in return."}, {"dae3": "We posted signs on our window detailing the terms of our surrender. Back then we didn’t know we were prolonging the inevitable — everyone is forced (or born) into The Blue. We were naïve, desperate. We would do anything to return to normal. So we read about a program that promised a rebirth. Imagine being born into a virtual world where pain ceased to exist. There would be no pestilence, famine, corruption, environmental catastrophe, or war. The whole of your life would exist within the confines of a 7x7 room — a virtual bunker that would shield us from the physicality of the natural world. The room would have no windows, only walls that served as screens. We pictured an existence free of Republicans, Christian fundamentalists, global warming, telemarketers, reality TV shows, eyeliner, stamps, parking tickets, kale, and junk mail."}, {"16e6": "We were locked in a room for a trial period. Over the years we experienced a gradual, careful loss. Items from our person were being removed and we didn’t register their loss until the next item vanished. You notice a nail gone when a whole thumb goes missing — that sort of thing. We never discuss the accumulations, even after the years following our release, because how could we? How could we explain the negligence that occurs when whole parts of our bodies vanished? How could we comprehend that we don’t remember the children we spent ten years in a room trying to reclaim? Was it worth it? When we were paraded out in front of our children to say our goodbyes, some parents blinked onto their screens: I’m sorry. Do you belong to me? I don’t remember you. Why are you making this sacrifice? You hardly remember us."}, {"7e6d": "Later we learn that the children were told that we would say this. They were encouraged to nod politely and ignore us, as teenagers are prone to do."}, {"1a7d": "You’re probably wondering why no one’s crying. Simple — we don’t mourn what we don’t remember missing. Weeping feels futile when our emotions have been excised so cleanly and completely. We don’t wonder where hearts originate."}, {"f0cf": "When we were released and labeled The Defective, our children were shuttled into our rooms to take our place. They were promised fully functioning parents, an all-expenses-paid re-assembly, if they were to participate in the beta. The Deserving required additional observational data. We want clocks so we’ll know when our time is up! The children’s demands were indulged because they bordered on adolescence, and part of our job required this level of entertainment. The children didn’t know about the vanishings — they didn’t foresee the taxonomy of things they would slowly, inevitably lose. They were told their parents were an experiment gone wrong, an anomaly."}, {"519b": "No one tells the children where we end up. They don’t see the advertisements regarding the opening of our exhibit. How the rooms they’ve now been locked in have been recreated in excruciating detail and how we’ll spend the rest of our days trapped in them. They don’t hear the promises to The Deserving — we’re doing this all for you!"}, {"2522": "Everyone is lead to believe that The Blue is a sanctuary. No one sees that The Deserving never receive Welcome Packets. They aren’t invited to the Open Houses. No one accounts for the fact that The Deserving have bonfire parties where they laugh over the items that have been surrendered and discarded. In moments they snatch up the items that take months for The Defective to give away. We tell The Deserving to not be greedy, they are in the minority and there’s enough to go around. New Defectives are born for The Blue every day."}, {"a6b1": "4. Call Center Log. Incident #4232.12A"}, {"1faf": "@nadia tries to jump out of a window, only there were no windows, only walls, and @nadia doesn’t have legs or feet but that doesn’t stop her from trying — not hard enough it seems. We see her cursor making a kicking motion. We watch her paint her blue room black out of protest. We record her not logging on for 3 days and 2 hours. During that time she processes forms to change her avatar to a photo of the dog she was forced to leave behind — a Pomeranian that sleeps with one of The Deserving at night. When there’s a server outage, @nadia can sometimes see the photos posted by those on the Outside. The puppy she held in her hands now sleeps beside a little girl with red hair. @nadia knows this because the mother posts photos of her sleeping daughter online for everyone to see. It’s an infraction to brag about items redistributed, and the mother will get fined at the most and receive a stern email at the very least, but in the end @nadia blames herself because her dog was not one of the twenty."}, {"26fc": "On the fourth day she offers @mikey her badges in exchange for a window with a view — she’s read about the infamous @mikey in the underground forums. But @mikey is a mole, a spy, a low-level agent of The Deserving, and he posts unflattering photos of @nadia as punishment for her infraction. @nadia unfollows people; she blocks them and joins a forum instructing people on how to delete. Burn your manual. We’ll show you how to secure a dignified end."}, {"8846": "@nadia: Kevin, can you do me a favor and turn off the fucking cameras? Give a woman a little privacy, would you?"}, {"17c0": "Operator Kevin Gray: @nadia, you know I can’t do that."}, {"9fbb": "@nadia: We all know about the budget cuts, the infighting on the Outside. There’s no one around to monitor you. They’re too busy fighting over the leftovers."}, {"d306": "Operator Kevin Gray: We’ve been keeping track…"}, {"7e64": "@nadia: There’s no we; there’s only you. Operator Kevin Gray. And last time I checked all your limbs were intact — you have the privilege of being a person, while I’m a screen name, a thing in a room with 20 objects down to 15. My memory was #13 of 20, and sometimes I wish I’d brought Lacy instead of that."}, {"51d3": "Operator Kevin Gray: (sighs) You know they wouldn’t have allowed a complete pet. Nothing living arrives in tact. Love is what’s abandoned because there aren’t enough numbers to bring something as large as that in."}, {"5524": "@nadia: (photograph disappears; she starts the download) Stay with me while I delete."}, {"4c5b": "Operator Kevin Gray: Don’t fuck this up. You’ve got a good set-up here."}, {"87f4": "@nadia: This is good? All I see is a prison with an Internet connection. I lost an eye five minutes ago and I didn’t even know it. Do you know what that’s like? To live each day in fear of what will be missed?"}, {"739e": "Operator Kevin Gray: You know I can’t allow that. You know —"}, {"3890": "@nadia: I know, what? That we’re The Deserving’s entertainment? That we’re what they watch now that televisions have been taken away? That we’ll never earn our way out — the badges, hearts, and numbers are a mountain of false hope. Operator Kevin Gray, we know. We know that we’ll lose our twenty over time. We know that we’ll be replaced and our fans redistributed and our hearts bled back to white. A lot of us have been afraid for a long time, and fear was the one emotion you forgot to modulate maybe because you suspected we would never figure you out. A lot of us know who you are, what we really are, and we’re telling as many as we can. You forgot, Operator Kevin Gray. #18 was my intelligence. #19 was my dignity."}, {"2262": "Operator Kevin Gray admires @nadia so you have to know that he doesn’t take the following events — the gas and the injections after — lightly. But he has a duty. Even though she’s one of The Original’s children, a girl who spends her life confined to four screens, a ceiling and a floor, he has a purpose. Even though she forgets how heavy rain wrinkled her skin and how fireflies glowed hot in the night, he has a duty. Operator Kevin Gray wipes her browsing history clean and removes the photo of her puppy. When @nadia wakes the next morning she can’t recall how she arrived at her room or why she has been placed there, she only knows that she’s meant to turn on the computer and start accumulating. Nearly every everything of hers has vanished, and she will never remember what she had and subsequently lost. She’ll never realize that Operator Kevin Gray is watching, that in the middle of the night, he retrieved and returned one of her eyes."}, {"9491": "A week later we start making our withdrawals from Kevin. He goes willingly, of course. He never asks why because he knows. His duty was to take orders and his purpose was to follow them. Operator Kevin Gray was never supposed to feel anything for The Defective. He wasn’t supposed to feel anything at all."}, {"d844": "5. The Situation on the Outside"}, {"9a05": "What do you mean they’re bored? We’ve got nearly the entire world population cut up and shut up in rooms and the children require additional amusements, further costume changes? Do you understand the sacrifices that have been made? The gods everyone had to forsake for The Deserving? There is no rewinding of the tape. Turning back is impossible."}, {"afc2": "Let’s dial down the dramatics. I’m just saying that some are concerned about the methods that have been employed against some of the dissidents. Others have suggested that we’ve taken The Blue too far…"}, {"0d72": "Now you have a conscience? Maybe you should have considered that before posting videos of your friends in The Defectives’ houses, rummaging through their things, eating their food, and filling up your bodies with their organs."}, {"5177": "The past is past. Now we’re wondering whether there’s a middle ground, if there’s something that we can give to appease them. Not enough for them to be dangerous, but something that allows them to be grateful. They trust you — the sites and forums your company built — you’re their sole connection to what’s in and beyond The Blue."}, {"9851": "More like appease you, but let’s say I sell the story of hope to The Defective. What do I get in return?"}, {"7be3": "Your men get their overtime. And you get what you’ve always wanted. Recognition. Respect. Love."}, {"8e2d": "6. Cracks"}, {"56c8": "One morning @nadia’s Pomeranian attacks the little Deserving in her sleep. The parents call the hospital and are given a ticket number. We’re in a war; a dog bite is considered low priority. Call us back when the dog mauls her and we’ll bump her number up. Until then… When the father shouts, rattling off his title and rank of importance, the operator responds by blasting hold music. The daughter is bleeding and the wife insists that she’ll need a transfusion. Already the woman is cutting herself and bleeding into a mason jar just in case. She’s adopted; she’s not even our blood type the father says. It would be just like you to remind me, the wife responds. Clearly your rank isn’t that important."}, {"855d": "A week later the little Deserving dies from infection, and in her grief the mother curls up next the dog, dresses it, and calls it by the little girl’s name. When the father kicks up a fuss, he’s demoted and denied access to the country club. We’re in the middle of a fucking war, the wife cries out. No one’s playing golf. No one’s asking for Glenfiddich on the rocks. I don’t even understand why we’re at war. Didn’t we get rid of The Defectives? Everyone’s the same — what’s there left to fight about?"}, {"1879": "And you wonder why your body wasn’t built for children."}, {"b579": "The online publisher gets his overtime and a standalone show on all the premiere screens once the televisions becomes extinct, but one night he wakes in terror and writes on a piece of paper:"}, {"eaf2": "This is what happens when you delete without a proper archive."}, {"a878": "Profiles and pages and photos and approvals deleted without burial. They work so hard to be one of the enviable and beloved. They spend days calibrating words and editing photos. They study and analyze the monthly data and trend reports and take fastidious notes during Quarterly Review. And yet we’re deleting pages faster than we create new ones. We scrub down their rooms and incinerate any leftovers from the twenty. The Defective are only know for the duration of their online existence while people write and publish books about the brave Deserving who are dying in droves."}, {"092a": "Some amongst us — the not so bright — contemplate enacting a draft, a grand act of patriotism on behalf of The Defective. We are at war and need reinforcements. The idea nearly becomes law with opposing sides ready to make their picks like a game of grade school dodge ball, until we have to remind them that The Defective are no longer people. They’ve donated their actual hearts for virtual ones because what use did they have for a heart that pumped blood through a whole archipelago of organs that now ceased to exist? They’ve been taught to take only that which they need in order to grow their fanbase and prove they themselves worthy of someone’s attention and love. Only then do they have a chance to recover what was discard before entering The Blue. Some make their gains based on their situation (who wouldn’t throw an old woman dying of cancer a like or a team #followback? Who wouldn’t give a toddler a re-pin, a re-tweet?) The new life and near dying have it easy while everyone in the middle has to work."}, {"3d06": "In The Blue you learn quickly that you have to earn your keep. That knowledge makes your stronger even when everyone on the Outside grows soft, complacent, comfortable and weak."}, {"4625": "Some of The Deserving won’t let this draft business go, and we nearly miss the screen showcasing The Defective who risked it all to bring in a kitten. It paid off because Pickles the Pink Kitten banked seventy million views on his series of Dear Defective videos — how-tos for those new to The Blue. Pickles’ owner was one of the elusive few that managed to retrieve her hearing. Functioning ears! The day the rumor spread The Defectives re-gramed pictures of Pickles with the hashtag #goals. And we’re missing the debut of the latest video because some Deserving with a donated Defective brain has a bright idea about drafting blinking cursors to do their dirty work."}, {"4ede": "We are exasperated. What are you going to do? Book a conference room and have them tweet our enemies to death?"}, {"7cbc": "You’d be surprised what an online mob can do to an offline life. Remember that sweet picture of the little girl and the Pomeranian and how it went viral? You know what happened to that girl? Dead. Everyone remembers the dead little girl and the puppy that takes her place. I heard the dog took off her face! Lies, all lies, it was only a flesh wound and a father who got a lousy ticket and hold music."}, {"3836": "Hold music. One says: I know how we’ll conquer our enemies. Put them in The Blue with hold music. Everyone gasps. The Blue is a war crime. We might as well behead and water-board while we’re at it."}, {"6d7e": "7. Fault lines"}, {"5c12": "Over the next year and during the war that would stretch for an additional ten, bodies begin to give out. Donated organs from The Defective become…defective. Houses collapse and furniture rots, mushrooms bloom from the insides of cushions and along the walls. Wallpaper peel and animals keel over. Land that was once fertile expels fumes. Flowers recoil and vegetables turn to ash. It’s as if everything that has been taken from The Defective expires when they do."}, {"4900": "Sometimes people wake to see The Defectives’ fingers under their doors or crawling up from the floorboards."}, {"5547": "Long after the books about The Deserving have been burned and everyone discusses the return of the abacus and Paleolithic diets, there exists a small community of young Blues who archive."}, {"c582": "We are the minority and we’re dying while The Defective replicate and reproduce online. We are dying and times are changing and our children, who remember the girl who got bit by the dog and the parents who did nothing, begin to realize that maybe we got it wrong. Maybe we’re the ones who needed to be contained. Maybe those in the Blue are the beautiful ones — fragile, refined parts of a person trying to be a person, trying to live and project the very best of their sad and tragic life."}], "child": "1755_1\t1755_2\t1755_3\t1755_4\t1755_5\t1755_6\t1755_7\t1755_8\t1755_9\t1755_10\t1755_11\t1755_12\t1755_13\t1755_14\t1755_15\t1755_16\t1755_17\t1755_18\t1755_19\t1755_20\t1755_21\t1755_22"}