{"name": "1756", "parent": "", "content": "If a Jay Z Song Streams and Nobody Hears It, Does It Make a Sound? Artists risk seeing their cultural resonance fade when they abandon the major streaming platforms A couple of weeks ago, a friend and I were discussing the albums we keep in constant rotation. A constant-rotation album is obviously a personal favorite, but over time it also becomes a life companion. It offers reassurance across cities, jobs, relationships, and distribution formats. I might habitually return to an album because it’s dense enough to contain an endless number of sonic mysteries (ATLiens), versatile enough to serve up a new form of human genius every two minutes (Innervisions), or familiar enough that every periodic spin feels like a catch-up phone call with an old friend (The College Dropout). I listen to these albums because I enjoy them but also to establish a self-continuity that connects my past and present. I keep coming back to them because I have always kept coming back to them. My friend mentioned Jay Z’s The Blueprint, which is a great album to keep in constant rotation for a few reasons. There’s the lush, soulful production that makes it feel timeless rather than dated, and there’s the fact that most Jay Z lyrics are easy to recite but also nuanced and clever, so his effortless cool can be transferred to the listener for at least a few bars. But I actually haven’t listened to The Blueprint in more than a year, I realized, not since Jay Z removed the album from Spotify and Apple Music in early 2016 (along with The Blueprint 2, which Jay can keep to himself). Now the rapper appears to be going further with his digital scrubbing. All of his solo albums, as well as Watch the Throne, disappeared from Spotify and Apple Music last week. Most have since been restored to Apple Music but remain absent from Spotify. The only streaming platform with access to Jay Z’s entire discography is his own, Tidal. Obviously, Jay Z does not need Spotify in order to remain relevant. He has sold millions of records, played the silent villain in the biggest musical release of 2016, and continues to dutifully drop dusty feature verses in 2017. Like many of the artists who choose to trade ubiquity for long-term exclusivity — ranging from Beyoncé to Taylor Swift to Garth Brooks — he’s bigger than any one platform. But I managed to carve Jay Z out of my life without even really thinking about it, just because his best songs weren’t available at my fingertips. With the gaps in streaming catalogs now seemingly a permanent way of life in music consumption, I’m beginning to wonder how many other music fans have simply cut Jay Z, or other hard-to-access artists, out of their listening habits. Today’s crop of college students probably don’t remember the day Aaliyah died in a plane crash in 2001, an abrupt and tragic end to an ascendant career. She had released her first Billboard no. 1 single, “Try Again,” the year before, and her third solo LP, Aaliyah, just a month before her death. She has lived on as a ghost floating into the modern R&B soundscape she helped pioneer — “Rock the Boat” was sampled on the Weeknd’s breakout mixtape, House of Balloons, and Drake once harbored a public Aaliyah obsession that he has thankfully suppressed in recent years. But by and large, her music has drifted slowly away from collective cultural memory, mainly because it’s unavailable on streaming or digital-download platforms. The exact reasons we can’t stream Aaliyah are murky — her reclusive uncle and his defunct record label own the masters to her most famous work — but the end result for the streaming user is that one of the biggest R&B stars of the turn of the century has effectively been wiped off the face of the digital planet (at least we have the “Are You That Somebody” music video). Aaliyah remains an internet talking point, but a lot of the discussion centers on her style rather than her actual music. She’s become a symbol partially due to her sudden death but also because her music lockdown forces us to engage with her through images and memory alone. Aaliyah is an extreme example, but more and more we’re finding that the unwillingness of some artists (or their managers) to allow their music to proliferate online butts up against our modern notion that media should be easy to access at all times. The eulogizing of Prince last year on social media was made difficult because he fastidiously kept his music off the digital platforms where people congregate. Kanye West created a spectacle and a pretty good meme around the Tidal-exclusive The Life of Pablo, but none of the tracks ultimately achieved the ubiquity of his previous work. Meanwhile, Drake has been flooding every crevice of the internet with pop hits for what feels like a decade now. After a short stint as an Apple exclusive, 2016’s Views arrived on all the major streaming platforms and has sold the equivalent of 2 million albums from digital spins alone. This year’s More Life got a wide release from the start and is already breaking Views’ records. If Jay Z is trying to wield power by turning Tidal into an exclusive, prestigious club, Drake’s power comes through his omnipresence. Every online club is a Drake club. His strategy better aligns with how we consume music and value artists today. “Artists should think about streaming the same way they think about mainstream radio,” says Catherine Moore, professor of music and technology at the University of Toronto. “You don’t see a major artist ever saying I don’t want my music on [New York City radio station] Z100 because they don’t pay record labels.” As streaming has grown into the primary mode of music consumption in the United States, it’s grown more radiolike. Spotify now places a huge emphasis on playlists, to the point that it’s launched an ad campaign around its biggest ones. Apple Music uses its live radio show to premiere new songs the same way terrestrial stations do. Pandora now has its own Spotify-killer, but has been touting “lean back” features that serve users songs they want to hear rather than forcing them to thumb through LPs. These platforms are trying to teach consumers to use them not just to access songs from a digital locker but also to experience the current cultural musical moment — and what artist doesn’t want to be part of that? The rub is that even if streaming is replacing radio, it’s also eating away at album and single sales at the same time without offering artists the same amount of compensation. That’s why Taylor Swift ditched Spotify and why Adele waited months to put 25 on streaming services. From a financial standpoint, Jay’s moves make sense. He’s probably earning a pittance from his back catalog on streaming services, and shoring up the catalog of Tidal could help him attract even more investors. Sprint recently bought a 33 percent stake in the company, effectively dashing any dreams that the streaming wars for exclusive content will end anytime soon. It’s just business, Jay Z has rapped in various cool/effortless ways over the years (quick paraphrase: “I left my Spotify audience to double my dollars / they criticize me for it yet they all yell ‘holla’”). But a lack of loyalty between fans and artists can go both ways. Artists face a financial risk in letting their music propagate online, but they face a cultural risk by assuming that fans will jump through hoops to reach them. “People want instant gratification,” says Moore. “If they’re signed up on a streaming service and they can’t find [a song], it’s hard to motivate them to join another music service. They’re just going to listen to something else.” ", "title": "If a Jay Z Song Streams and Nobody Hears It, Does It Make a Sound?", "sentences": [{"b464": "If a Jay Z Song Streams and Nobody Hears It, Does It Make a Sound?"}, {"93e7": "Artists risk seeing their cultural resonance fade when they abandon the major streaming platforms"}, {"c9a9": "A couple of weeks ago, a friend and I were discussing the albums we keep in constant rotation. A constant-rotation album is obviously a personal favorite, but over time it also becomes a life companion. It offers reassurance across cities, jobs, relationships, and distribution formats. I might habitually return to an album because it’s dense enough to contain an endless number of sonic mysteries (ATLiens), versatile enough to serve up a new form of human genius every two minutes (Innervisions), or familiar enough that every periodic spin feels like a catch-up phone call with an old friend (The College Dropout). I listen to these albums because I enjoy them but also to establish a self-continuity that connects my past and present. I keep coming back to them because I have always kept coming back to them."}, {"f4c9": "My friend mentioned Jay Z’s The Blueprint, which is a great album to keep in constant rotation for a few reasons. There’s the lush, soulful production that makes it feel timeless rather than dated, and there’s the fact that most Jay Z lyrics are easy to recite but also nuanced and clever, so his effortless cool can be transferred to the listener for at least a few bars. But I actually haven’t listened to The Blueprint in more than a year, I realized, not since Jay Z removed the album from Spotify and Apple Music in early 2016 (along with The Blueprint 2, which Jay can keep to himself). Now the rapper appears to be going further with his digital scrubbing. All of his solo albums, as well as Watch the Throne, disappeared from Spotify and Apple Music last week. Most have since been restored to Apple Music but remain absent from Spotify. The only streaming platform with access to Jay Z’s entire discography is his own, Tidal."}, {"da08": "Obviously, Jay Z does not need Spotify in order to remain relevant. He has sold millions of records, played the silent villain in the biggest musical release of 2016, and continues to dutifully drop dusty feature verses in 2017. Like many of the artists who choose to trade ubiquity for long-term exclusivity — ranging from Beyoncé to Taylor Swift to Garth Brooks — he’s bigger than any one platform. But I managed to carve Jay Z out of my life without even really thinking about it, just because his best songs weren’t available at my fingertips. With the gaps in streaming catalogs now seemingly a permanent way of life in music consumption, I’m beginning to wonder how many other music fans have simply cut Jay Z, or other hard-to-access artists, out of their listening habits."}, {"395e": "Today’s crop of college students probably don’t remember the day Aaliyah died in a plane crash in 2001, an abrupt and tragic end to an ascendant career. She had released her first Billboard no. 1 single, “Try Again,” the year before, and her third solo LP, Aaliyah, just a month before her death. She has lived on as a ghost floating into the modern R&B soundscape she helped pioneer — “Rock the Boat” was sampled on the Weeknd’s breakout mixtape, House of Balloons, and Drake once harbored a public Aaliyah obsession that he has thankfully suppressed in recent years. But by and large, her music has drifted slowly away from collective cultural memory, mainly because it’s unavailable on streaming or digital-download platforms."}, {"027f": "The exact reasons we can’t stream Aaliyah are murky — her reclusive uncle and his defunct record label own the masters to her most famous work — but the end result for the streaming user is that one of the biggest R&B stars of the turn of the century has effectively been wiped off the face of the digital planet (at least we have the “Are You That Somebody” music video). Aaliyah remains an internet talking point, but a lot of the discussion centers on her style rather than her actual music. She’s become a symbol partially due to her sudden death but also because her music lockdown forces us to engage with her through images and memory alone."}, {"e6f8": "Aaliyah is an extreme example, but more and more we’re finding that the unwillingness of some artists (or their managers) to allow their music to proliferate online butts up against our modern notion that media should be easy to access at all times. The eulogizing of Prince last year on social media was made difficult because he fastidiously kept his music off the digital platforms where people congregate. Kanye West created a spectacle and a pretty good meme around the Tidal-exclusive The Life of Pablo, but none of the tracks ultimately achieved the ubiquity of his previous work. Meanwhile, Drake has been flooding every crevice of the internet with pop hits for what feels like a decade now. After a short stint as an Apple exclusive, 2016’s Views arrived on all the major streaming platforms and has sold the equivalent of 2 million albums from digital spins alone. This year’s More Life got a wide release from the start and is already breaking Views’ records."}, {"5bfa": "If Jay Z is trying to wield power by turning Tidal into an exclusive, prestigious club, Drake’s power comes through his omnipresence. Every online club is a Drake club. His strategy better aligns with how we consume music and value artists today. “Artists should think about streaming the same way they think about mainstream radio,” says Catherine Moore, professor of music and technology at the University of Toronto. “You don’t see a major artist ever saying I don’t want my music on [New York City radio station] Z100 because they don’t pay record labels.”"}, {"5f38": "As streaming has grown into the primary mode of music consumption in the United States, it’s grown more radiolike. Spotify now places a huge emphasis on playlists, to the point that it’s launched an ad campaign around its biggest ones. Apple Music uses its live radio show to premiere new songs the same way terrestrial stations do. Pandora now has its own Spotify-killer, but has been touting “lean back” features that serve users songs they want to hear rather than forcing them to thumb through LPs. These platforms are trying to teach consumers to use them not just to access songs from a digital locker but also to experience the current cultural musical moment — and what artist doesn’t want to be part of that?"}, {"869a": "The rub is that even if streaming is replacing radio, it’s also eating away at album and single sales at the same time without offering artists the same amount of compensation. That’s why Taylor Swift ditched Spotify and why Adele waited months to put 25 on streaming services. From a financial standpoint, Jay’s moves make sense. He’s probably earning a pittance from his back catalog on streaming services, and shoring up the catalog of Tidal could help him attract even more investors. Sprint recently bought a 33 percent stake in the company, effectively dashing any dreams that the streaming wars for exclusive content will end anytime soon."}, {"9b81": "It’s just business, Jay Z has rapped in various cool/effortless ways over the years (quick paraphrase: “I left my Spotify audience to double my dollars / they criticize me for it yet they all yell ‘holla’”). But a lack of loyalty between fans and artists can go both ways. Artists face a financial risk in letting their music propagate online, but they face a cultural risk by assuming that fans will jump through hoops to reach them. “People want instant gratification,” says Moore. “If they’re signed up on a streaming service and they can’t find [a song], it’s hard to motivate them to join another music service. They’re just going to listen to something else.”"}], "child": "1756_1\t1756_2\t1756_3\t1756_4\t1756_5\t1756_6\t1756_7\t1756_8\t1756_9\t1756_10\t1756_11\t1756_12\t1756_13\t1756_14"}