{"name": "1760", "parent": "", "content": "You can now read Doha News in Qatar thanks to RSF Qatar listed amongst RSF’s Enemies of the Internet. Credit: Reporters Without Borders As Doha News approaches its fourth month of being blocked in Qatar, international non-profit Reporters Without Borders (RSF) has come up with an innovative solution to the issue. As part of a campaign to mark World Day Against Cyber-Censorship, the group has launched a mirrored version of the Doha News website that is accessible in Qatar. Bookmark this URL to access our site whenever you want: http://ec2-52-17-106-120.eu-west-1.compute.amazonaws.com/ The censorship page shown when some users try to access Doha News in Qatar. If you use Google Chrome, RSF has also built a handy Chrome browser extension to make it easier to access the mirror. Fighting censorship The mirrored site is part of RSF’s annual Operation #CollateralFreedom campaign. This year, the group is unblocking 24 websites across Turkey, Azerbaijan, Saudi Arabia and beyond. RSF explains how it works on their website: “Operation #CollateralFreedom circumvents technological censorship by means of an original strategy in which “mirrors” or duplicates of the censored websites are created on the servers of the world’s Internet giants. Authoritarian regimes cannot block access to the mirrors without the “collateral damage” of restricting their own access to the services of these Internet companies.” Does the mirrored site work for you? Thoughts? ", "title": "You can now read Doha News in Qatar thanks to RSF", "sentences": [{"a637": "You can now read Doha News in Qatar thanks to RSF"}, {"419a": "Qatar listed amongst RSF’s Enemies of the Internet. Credit: Reporters Without Borders"}, {"022c": "As Doha News approaches its fourth month of being blocked in Qatar, international non-profit Reporters Without Borders (RSF) has come up with an innovative solution to the issue."}, {"9d36": "As part of a campaign to mark World Day Against Cyber-Censorship, the group has launched a mirrored version of the Doha News website that is accessible in Qatar."}, {"f979": "Bookmark this URL to access our site whenever you want: http://ec2-52-17-106-120.eu-west-1.compute.amazonaws.com/"}, {"3d05": "The censorship page shown when some users try to access Doha News in Qatar."}, {"939d": "If you use Google Chrome, RSF has also built a handy Chrome browser extension to make it easier to access the mirror."}, {"0bd8": "Fighting censorship"}, {"2fd9": "The mirrored site is part of RSF’s annual Operation #CollateralFreedom campaign. This year, the group is unblocking 24 websites across Turkey, Azerbaijan, Saudi Arabia and beyond."}, {"d33b": "RSF explains how it works on their website:"}, {"c4a9": "“Operation #CollateralFreedom circumvents technological censorship by means of an original strategy in which “mirrors” or duplicates of the censored websites are created on the servers of the world’s Internet giants."}, {"9405": "Authoritarian regimes cannot block access to the mirrors without the “collateral damage” of restricting their own access to the services of these Internet companies.”"}, {"3345": "Does the mirrored site work for you? Thoughts?"}], "child": "1760_1\t1760_2"}