{"name": "1763", "parent": "", "content": "On Medium Writers Who Abuse the “Blocking” Function to Insulate Themselves from Criticism… by Alexander Zubatov Recently, I wrote a response to a Medium story by the writer Anthony J. Williams, @anthoknees, who tweets under the moniker “The Real Racist” and has 1.5 thousand followers on Medium. The story of his I’d commented on, entitled “let’s stop coddling white feelings,” suggests that the best way to advance the cause of racial justice is to stop caring whether or not blacks alienate whites. I wrote a response to this story in which I took issue with Mr. Williams’ point, linked to another recent story of mine that had discussed this very issue, and outlined the general idea that you can’t fight racism by directing anger and hatred at the racist. My response was completely polite, did not contain any insults, epithets, profanities or anything of that sort, and tried to be constructive in suggesting another way forward. A bunch of people clearly agreed with me, and I quickly got a bunch of recommends over the course of two days (34 as of this writing). This would have resulted in elevating my response to the top or near the top of the responses to Mr. Williams’ article. Sometime today, however, Mr. Williams used Medium’s blocking function to block me, and my response promptly stopped getting “views” and “likes.” This is because of the way Medium and Medium Staff have designed the “blocking” function, which results in making a blocked response to an article no longer visible to anyone looking for responses beneath that article: https://help.medium.com/hc/en-us/articles/214994577-Blocking-other-users To say this another way, not only has Medium armed thin-skinned writers with a tool to insulate themselves from criticism, but it has also deprived every other Medium reader of the opportunity to view that criticism. This is not the first time I have seen the blocking function used in this manner, and I’m sure it will not be the last. The way Medium has set it up, the “block user” function might as well say “silence criticism from writer with whom you disagree.” If @MediumStaff wants this to be a vibrant community where a variety of viewpoints and voices gets heard, it needs to prevent the blocking function from being abused in this manner. If you want to block someone to prevent yourself from seeing anything they write because you just can’t deal with it, that’s fine, but you shouldn’t be permitted to block them from seeing what you write or to block them from commenting on it. This is especially the case when someone like Mr. Williams is using the blocking function to eviscerate an already-posted comment that has gotten lots of positive reactions. If someone is truly spewing hatred, profanity or other abuse, that’s different, of course, but blocking someone who’s merely writing a measured response to your writing should not be allowed. Medium can’t, or, at least, shouldn’t, turn a user-blocker into a user-silencer. If you agree, please “like” this article by clicking on the green heart below, and make your voice heard. — — — — — — — — — — — - Alexander Zubatov is a practicing attorney specializing in general commercial litigation. He is also a practicing writer specializing in general non-commercial poetry, fiction, drama, essays and polemics. In the words of one of his intellectual heroes, José Ortega y Gasset, biography is “a system in which the contradictions of a human life are unified.” Some of his articles have appeared in The Federalist, Acculturated, PopMatters, The Hedgehog Review, The Montreal Review, The Fortnightly Review, Mercatornet, New English Review, Culture Wars and nthposition. He makes occasional, unscheduled appearances on Twitter (https://twitter.com/Zoobahtov). ", "title": "On Medium Writers Who Abuse the “Blocking” Function to Insulate Themselves from Criticism…", "sentences": [{"e177": "On Medium Writers Who Abuse the “Blocking” Function to Insulate Themselves from Criticism…"}, {"46b6": "by Alexander Zubatov"}, {"da3b": "Recently, I wrote a response to a Medium story by the writer Anthony J. Williams, @anthoknees, who tweets under the moniker “The Real Racist” and has 1.5 thousand followers on Medium."}, {"f6b4": "The story of his I’d commented on, entitled “let’s stop coddling white feelings,” suggests that the best way to advance the cause of racial justice is to stop caring whether or not blacks alienate whites. I wrote a response to this story in which I took issue with Mr. Williams’ point, linked to another recent story of mine that had discussed this very issue, and outlined the general idea that you can’t fight racism by directing anger and hatred at the racist. My response was completely polite, did not contain any insults, epithets, profanities or anything of that sort, and tried to be constructive in suggesting another way forward. A bunch of people clearly agreed with me, and I quickly got a bunch of recommends over the course of two days (34 as of this writing). This would have resulted in elevating my response to the top or near the top of the responses to Mr. Williams’ article."}, {"e7f6": "Sometime today, however, Mr. Williams used Medium’s blocking function to block me, and my response promptly stopped getting “views” and “likes.” This is because of the way Medium and Medium Staff have designed the “blocking” function, which results in making a blocked response to an article no longer visible to anyone looking for responses beneath that article:"}, {"df94": "https://help.medium.com/hc/en-us/articles/214994577-Blocking-other-users"}, {"0994": "To say this another way, not only has Medium armed thin-skinned writers with a tool to insulate themselves from criticism, but it has also deprived every other Medium reader of the opportunity to view that criticism."}, {"3ecd": "This is not the first time I have seen the blocking function used in this manner, and I’m sure it will not be the last. The way Medium has set it up, the “block user” function might as well say “silence criticism from writer with whom you disagree.”"}, {"4d67": "If @MediumStaff wants this to be a vibrant community where a variety of viewpoints and voices gets heard, it needs to prevent the blocking function from being abused in this manner. If you want to block someone to prevent yourself from seeing anything they write because you just can’t deal with it, that’s fine, but you shouldn’t be permitted to block them from seeing what you write or to block them from commenting on it. This is especially the case when someone like Mr. Williams is using the blocking function to eviscerate an already-posted comment that has gotten lots of positive reactions. If someone is truly spewing hatred, profanity or other abuse, that’s different, of course, but blocking someone who’s merely writing a measured response to your writing should not be allowed. Medium can’t, or, at least, shouldn’t, turn a user-blocker into a user-silencer."}, {"d55e": "If you agree, please “like” this article by clicking on the green heart below, and make your voice heard."}, {"24d9": "— — — — — — — — — — — -"}, {"b2c3": "Alexander Zubatov is a practicing attorney specializing in general commercial litigation. He is also a practicing writer specializing in general non-commercial poetry, fiction, drama, essays and polemics. In the words of one of his intellectual heroes, José Ortega y Gasset, biography is “a system in which the contradictions of a human life are unified.”"}, {"0006": "Some of his articles have appeared in The Federalist, Acculturated, PopMatters, The Hedgehog Review, The Montreal Review, The Fortnightly Review, Mercatornet, New English Review, Culture Wars and nthposition."}, {"05a2": "He makes occasional, unscheduled appearances on Twitter (https://twitter.com/Zoobahtov)."}], "child": "1763_1\t1763_2\t1763_3\t1763_4\t1763_5\t1763_6\t1763_7\t1763_8\t1763_9\t1763_10\t1763_11"}