{"name": "1764", "parent": "", "content": "Extreme Niche: the Kids will not be Alright Erstwhile Disney family childstar Miley Cyrus If you never ventured down the back corner stairs into Blockbuster’s adult section, you might have missed the vile flowering of extreme hardcore in the digital age. If you’re somehow still blissfully unaware, anomalous niche porn is detestable and deeply unsettling. Porno has darkened considerably. And kids now see it on average by age eight. So how do parents adequately explain away this nauseating inevitability? Is it realistic to imagine parents and ISPs can stem the interporn tide? Is the right to free expression at the expense of all else more important than the right to grow up unpredated? The grotesque mainstreaming of niche fetishes is a threat to families, not just family values. And we all face a darker future because of it. Sure, maybe manic masturbation to anomalous sex acts won’t do anything. But it already bore hallmarks of the criminal a generation ago. Hyperbolic? It takes two seconds’ halfassed google to find Paul Bernardo. Extreme hardcore is a foul witch’s brew blurring the lines between organic sexuality and contrived perversion. Passed down in demented secret through the ages from generation to generation of pedophiles, alphas, and bears. Perhaps tubes are the only healthy outlet for some perverts and parents’ basement-dwellers to innocuously express exotic sexuality unfairly denied them. Maybe it does stop some isolated, marginalized would-be rapists. But other times, it appears suspiciously linked to violence against women. In fact, a 2010 New Zealand study of American porn found that 95% of sexual aggression was met positively by female performers. Reinforcing the inverted, stereotypical, and incorrect notion that women like to be abused. Because yeah, that’s right. You know you like it, you dirty little slut. Dominant male victimization of the weak and willing female victimhood manifest society’s most destructive constructs. And passing if off as common, widely held fantasy is a vicious lie that endangers our daughters. The obscene behaviors depicted are exceedingly rare. Not even close to everyone else is doing “it.” Nor is “it” necessarily always super fucking weird. The kids will not be alright This is not the baby boomer smut of yesteryear. Sure, predigital kids all knew where dads hid their depravations and gleefully sought those crusty mags to dazzle friends. But Facialabuse and Deviantclip are on an entirely different planet altogether than even Hustler at its very worst. The internet, for all its promise and agency, also functions to grant obscure, little known fetishes a platform to metastasize from sickening local curiosity to global trend. All the more creeping and insidious, because actually watching might not even matter. Read some clip names once and never be the same again. Distressing Conan the caveman verbs now dominate titles and litter the tubes. Devastate, demolish, destroy, disgrace, pulverize, punish, ruin, annihilate, obliterate, crush, spoil, waste. Wtf? You don’t do these things to lovers; you do these things to rival enemy tribes. Radical feminist Gail Dines is right: this poisonous trash teaches little boys to make hate. And while it may be half-hyperventilating to call it a public health crisis, the industry indisputably has risks. The supply chain of what’s happening on the other side of the camera is no longer a viewer’s fantasy, it’s a nightmare. Award winning adult actresses must have different experiences filming brutal teen gangbangs than audiences do watching. Because no viewer takes away anything remotely pro-woman or empowering. Bad day? Here, have a feelgood jagoff to 45 seconds of this ghoulish free clip that gave its 18 and one day-old female star eye chlamydia and psychic scarring. Even without family values hysterics, scabrous analogies to horndog old testament greatest hits rising from syphilitic ancient sands are unavoidable: Sodom, Gomorrah, Babylon. The lepers have breached the gates. Max Hardcore and his sensualist fellow travelers are indefensible. Today’s depravity is psychotic. It dehumanizes and humiliates girls, saddling them with unrealistic concepts of self. It also desensitizes boys and leads to bottomless chasms of shame, as well as potential erectile dysfunction. A handful of corrupting masturbatory bouts with the hypersensory, postmoral upheaval of Punishtube, and regular sex with real girls just won’t compare. How are young viewers of these vomitous delights to know when to punch, choke, pee on, or kiss their partners? The kids will not be alright. Confronting extreme niche Sanitizing the toxic language of this debate does a disservice to addressing it. Antiseptic terms cloaked in the syntax of family hour might be fit to print, but are counterproductive and fail to express what kids nowadays actually face: 3D tentacle monsters wrecking every hole. My generation was the first to grapple with the fearsome, saturnalian bacchanal of round-the-clock, one-click-away anything. And like everyone else, I was an eager adolescent pioneer of the original tubes. Now, I’m a recovering young father of small children ominously approaching their own interporn event horizon. I always knew that not everything is fetish; some things are sociopathic. And the market for repressed sex freaks has doubtless always been there. But only in fatherhood have I realized how many good reasons there are to repress them. While most searched terms remain relatively benign, results are anything but. Appallingly violent, they threaten not just women’s rights, but human rights. And it’s naive to believe some performers are not trafficking victims. Every homepage offers unthinkable-until-recently, beyond-bizarre fare that has somehow become ordinary. One errant click is all that stands between the tuber and variants of medieval torture that first entered the historical record as an Inquisition technique to extract confessions. Fisting is not an element of the first date, but it is indeed an interesting cultural and historical phenomenon to explore. And as long as parents find similar ways to guide the pornversation, the kids may be alright. Prolapse will eventually break through into your living room, but that’s not a justification for inaction. Not the message parents want to send kids: “too hard; why bother.” So, turn on a filter, pay attention, communicate, and teach them partners are neither punching bags, nor adolescent basement couches. Of course, virtuous, self-righteous parents will never be able to always block everything they in their endless wisdom deem objectionable. Innovative, entrepreneurial, and cutting edge, teens will always find workarounds. And there’s no point closing doors they’ve already opened. The only way to adequately prepare them for Tinder or whatever concupiscent, superpredator app inherits its foul legacy is to tackle Analabuse head-on, as soon as it ithyphallically pops up onto the screen from whatever prurient hell misbegat it unto our afflicted world. Defending the indefensible Dismissive claims that antiporn is just another sensationalist moral panic miss the point. This industry does not somehow liberate women. And pubescence awash in it is certainly a risk to childhood and adolescent development. Interporn’s only real defense is shameful indeed: for some unhappy youth bathed in the soft backlit glow of laptops and tablets, paypaled tubegirls will indeed be the best they ever have. But it can’t be at everyone else’s expense and damn the consequences. Debate about the validity of data and evidence — correlational? anecdotal? — obscures the essential gestalt reality of how most endusers experience it. And this skepticism beggars the question: who gives a scientific shit? Why lament craven old lechers’ lost innocence “accidentally” clicking down rabbitholes to at long last come face to face with the dark arts of childporn? Aging hypocrites mindlessly perpetuating vicious cycles of self-repression deserve to be exposed for the pervy, secretly leering cowards they are. After all, it was that sex-crazed, postwar STD-infested greatest generation returning from sexcapades overseas who oversaw the flowering of our trash culture. Everything, especially girls, single use and disposable. Mad men did indeed once roam the countryside, notching their belts with fucked farmers’ daughters and then heedlessly discarding them in their careless wake. From whence now springs our foul reckoning in the form of Disney family childstar Miley Cyrus. Precariously perched atop the rotten detritus of sex fiend society. Tongue out, on her back, legs spread wide open up in the air, barely legal and barely anything between us and her tight, little readyvag: “She’s so liberated and exhibits such great leadership potential; a real role model. Land of opportunity. Freedom of speech. God bless Merica.” From Caged Heat to Eazy-E to Youporn, consumer pop anticulture saturated the digital generation with absurd, upside down concepts of what women want and how to treat them. Subsequent generations will of course be subjected to the same daunting cesspool. The least we can do is prepare them with accurate points of reference to develop their own healthy sexualities independent of Monstertube. The internet-enabled, self-shot and published filth that inverted our sexual polarity can be stopped. Parents can filter the most troubling tubes and terms, and some ISPs offer opt-out mechanisms. Beyond opt-outs, governments are palsied to address the issue without jeopardizing democratic values like freedom of expression and the presumption of privacy. But fuck the freedom of speech at the expense of all else! It’s not always worth it, nor is it a license to be as vicious and depraved as possible. Other things are more important, like childhood health, safety, and wellbeing. Parents have to step up, because constitutions stop governments from doing so. A flesh-colored wave of popup clickbait bitches Victorian moralism’s popular decline just happened to coincide with globalization. And now, hot nonstop broadband with the tubes threatens to turn the whole sick planet into obscenity-crazed degenerates. Abusedteens was not born in some loathsome vacuum. The stifling archetype of wholesome, procreative, nuclear family sexuality itself probably generated today’s explosion of noxious hypersex deviance. Had the closet never existed, we wouldn’t all be in it, one way or another. Nor would we be seeking to fill it with the most repulsive and repugnant sex acts ever misbegotten. Imagine looking back on now from the distant future: people discover the internet, and then immediately use it overwhelmingly to stream porn. Surfing the world’s greatest information equalizer on a revolting flesh-colored wave of popup clickbait bitches. Analytic maps of global traffic are scarcely believable. Unorthodox and unexpected behavior abounds, like Pakistani men outsearching us all for gay porn. And exposure to hardcore will not be a modernizing influence that drags the next generation of native Muslims and Hindus kicking and screaming into our rights-based world. Extreme niche will only harden their already deeply seeded disrespect and hatred of women and gays. Raising kids abroad away from the blazing dumpsterfire of porno USA, it’s hard to imagine how they will ever reintegrate with peers when we return. Yet even as far from Vegas and Panama City as we can get, they still remain at the same internet’s mercy. Depraved priapic content across the full infotainment spectrum will almost certainly suffuse their adolescence, wherever we are. Kids’ shows, young adult fiction, reality tv, advertising, social media, and apps now all trade in the bedroom, or torture chamber, as the case may be. Thinkfluenced by a demand quantified from the whole wide world’s horny clickbait misadventures, it’s useless to blame the pusher for this. Statistics indicate that niche online trends are without question a function of viewer demand. Virtual irreality: everyone watching what no one is doing. Here’s to hoping it stays that way. Proudly and openly bohemian, I never thought I’d want my kids to be the only ones not doing something, but that’s exactly the right response to market-researched, datamined coprophagia. By the time they become teenagers, I fear the array of Monster High, slutoween, celebrity sex tapes, and baldfaced instrumentalization of sex to sell literally everything will have grown the gulf between them and their American peers to almost insurmountable proportions. At least, I hope so. As global connectivity grows, so certainly will porn and its misperceptions of what is normophilic sexual behavior. And sadly, so far, only an obscure and irreconcilable constellation of culture war antagonists seems to care. Incompatible they may be, but radical social feminists and censorious conservative evangelicals have finally found common cause behind which to unite: dads coming home early to pitilessly punish schoolgirl stepdaughter babysitter teens caught redhanded boning their meathead jerk boyfriends. The good news in this race to absolute rockbottom is that niche interporn has nowhere left to go. Producers have already plumbed the very depths. And thankfully, the worst shit imaginable has already been imagined. If you liked this, please recommend it. If you want to talk, comment; I reply to every remark. I also write about Russia, real America, disbelief, and elections at Counterpunch. Here at Medium about demographics, yesteryear, voters, foreign policy, untold history, and family values. ", "title": "Extreme Niche: the Kids will not be Alright", "sentences": [{"683b": "Extreme Niche: the Kids will not be Alright"}, {"8b0b": "Erstwhile Disney family childstar Miley Cyrus"}, {"e669": "If you never ventured down the back corner stairs into Blockbuster’s adult section, you might have missed the vile flowering of extreme hardcore in the digital age. If you’re somehow still blissfully unaware, anomalous niche porn is detestable and deeply unsettling. Porno has darkened considerably. And kids now see it on average by age eight."}, {"891f": "So how do parents adequately explain away this nauseating inevitability? Is it realistic to imagine parents and ISPs can stem the interporn tide? Is the right to free expression at the expense of all else more important than the right to grow up unpredated?"}, {"b15d": "The grotesque mainstreaming of niche fetishes is a threat to families, not just family values. And we all face a darker future because of it. Sure, maybe manic masturbation to anomalous sex acts won’t do anything. But it already bore hallmarks of the criminal a generation ago. Hyperbolic? It takes two seconds’ halfassed google to find Paul Bernardo."}, {"78c6": "Extreme hardcore is a foul witch’s brew blurring the lines between organic sexuality and contrived perversion. Passed down in demented secret through the ages from generation to generation of pedophiles, alphas, and bears."}, {"ddf2": "Perhaps tubes are the only healthy outlet for some perverts and parents’ basement-dwellers to innocuously express exotic sexuality unfairly denied them. Maybe it does stop some isolated, marginalized would-be rapists. But other times, it appears suspiciously linked to violence against women."}, {"76f9": "In fact, a 2010 New Zealand study of American porn found that 95% of sexual aggression was met positively by female performers. Reinforcing the inverted, stereotypical, and incorrect notion that women like to be abused. Because yeah, that’s right. You know you like it, you dirty little slut."}, {"9ef3": "Dominant male victimization of the weak and willing female victimhood manifest society’s most destructive constructs. And passing if off as common, widely held fantasy is a vicious lie that endangers our daughters. The obscene behaviors depicted are exceedingly rare. Not even close to everyone else is doing “it.” Nor is “it” necessarily always super fucking weird."}, {"de1b": "The kids will not be alright"}, {"d57e": "This is not the baby boomer smut of yesteryear. Sure, predigital kids all knew where dads hid their depravations and gleefully sought those crusty mags to dazzle friends. But Facialabuse and Deviantclip are on an entirely different planet altogether than even Hustler at its very worst."}, {"e179": "The internet, for all its promise and agency, also functions to grant obscure, little known fetishes a platform to metastasize from sickening local curiosity to global trend. All the more creeping and insidious, because actually watching might not even matter. Read some clip names once and never be the same again."}, {"beed": "Distressing Conan the caveman verbs now dominate titles and litter the tubes. Devastate, demolish, destroy, disgrace, pulverize, punish, ruin, annihilate, obliterate, crush, spoil, waste. Wtf? You don’t do these things to lovers; you do these things to rival enemy tribes."}, {"e4fb": "Radical feminist Gail Dines is right: this poisonous trash teaches little boys to make hate. And while it may be half-hyperventilating to call it a public health crisis, the industry indisputably has risks. The supply chain of what’s happening on the other side of the camera is no longer a viewer’s fantasy, it’s a nightmare."}, {"cb88": "Award winning adult actresses must have different experiences filming brutal teen gangbangs than audiences do watching. Because no viewer takes away anything remotely pro-woman or empowering. Bad day? Here, have a feelgood jagoff to 45 seconds of this ghoulish free clip that gave its 18 and one day-old female star eye chlamydia and psychic scarring."}, {"64d1": "Even without family values hysterics, scabrous analogies to horndog old testament greatest hits rising from syphilitic ancient sands are unavoidable: Sodom, Gomorrah, Babylon. The lepers have breached the gates. Max Hardcore and his sensualist fellow travelers are indefensible."}, {"7ccc": "Today’s depravity is psychotic. It dehumanizes and humiliates girls, saddling them with unrealistic concepts of self. It also desensitizes boys and leads to bottomless chasms of shame, as well as potential erectile dysfunction."}, {"e662": "A handful of corrupting masturbatory bouts with the hypersensory, postmoral upheaval of Punishtube, and regular sex with real girls just won’t compare. How are young viewers of these vomitous delights to know when to punch, choke, pee on, or kiss their partners? The kids will not be alright."}, {"6180": "Confronting extreme niche"}, {"b406": "Sanitizing the toxic language of this debate does a disservice to addressing it. Antiseptic terms cloaked in the syntax of family hour might be fit to print, but are counterproductive and fail to express what kids nowadays actually face: 3D tentacle monsters wrecking every hole."}, {"e700": "My generation was the first to grapple with the fearsome, saturnalian bacchanal of round-the-clock, one-click-away anything. And like everyone else, I was an eager adolescent pioneer of the original tubes."}, {"7d73": "Now, I’m a recovering young father of small children ominously approaching their own interporn event horizon. I always knew that not everything is fetish; some things are sociopathic. And the market for repressed sex freaks has doubtless always been there. But only in fatherhood have I realized how many good reasons there are to repress them."}, {"16d2": "While most searched terms remain relatively benign, results are anything but. Appallingly violent, they threaten not just women’s rights, but human rights. And it’s naive to believe some performers are not trafficking victims."}, {"7228": "Every homepage offers unthinkable-until-recently, beyond-bizarre fare that has somehow become ordinary. One errant click is all that stands between the tuber and variants of medieval torture that first entered the historical record as an Inquisition technique to extract confessions."}, {"ee1f": "Fisting is not an element of the first date, but it is indeed an interesting cultural and historical phenomenon to explore. And as long as parents find similar ways to guide the pornversation, the kids may be alright. Prolapse will eventually break through into your living room, but that’s not a justification for inaction."}, {"b97a": "Not the message parents want to send kids: “too hard; why bother.” So, turn on a filter, pay attention, communicate, and teach them partners are neither punching bags, nor adolescent basement couches."}, {"876a": "Of course, virtuous, self-righteous parents will never be able to always block everything they in their endless wisdom deem objectionable. Innovative, entrepreneurial, and cutting edge, teens will always find workarounds. And there’s no point closing doors they’ve already opened."}, {"43c3": "The only way to adequately prepare them for Tinder or whatever concupiscent, superpredator app inherits its foul legacy is to tackle Analabuse head-on, as soon as it ithyphallically pops up onto the screen from whatever prurient hell misbegat it unto our afflicted world."}, {"de94": "Defending the indefensible"}, {"af31": "Dismissive claims that antiporn is just another sensationalist moral panic miss the point. This industry does not somehow liberate women. And pubescence awash in it is certainly a risk to childhood and adolescent development."}, {"b33a": "Interporn’s only real defense is shameful indeed: for some unhappy youth bathed in the soft backlit glow of laptops and tablets, paypaled tubegirls will indeed be the best they ever have. But it can’t be at everyone else’s expense and damn the consequences."}, {"e515": "Debate about the validity of data and evidence — correlational? anecdotal? — obscures the essential gestalt reality of how most endusers experience it. And this skepticism beggars the question: who gives a scientific shit?"}, {"4ecd": "Why lament craven old lechers’ lost innocence “accidentally” clicking down rabbitholes to at long last come face to face with the dark arts of childporn? Aging hypocrites mindlessly perpetuating vicious cycles of self-repression deserve to be exposed for the pervy, secretly leering cowards they are."}, {"0ae2": "After all, it was that sex-crazed, postwar STD-infested greatest generation returning from sexcapades overseas who oversaw the flowering of our trash culture. Everything, especially girls, single use and disposable. Mad men did indeed once roam the countryside, notching their belts with fucked farmers’ daughters and then heedlessly discarding them in their careless wake."}, {"3f4a": "From whence now springs our foul reckoning in the form of Disney family childstar Miley Cyrus. Precariously perched atop the rotten detritus of sex fiend society. Tongue out, on her back, legs spread wide open up in the air, barely legal and barely anything between us and her tight, little readyvag:"}, {"d836": "“She’s so liberated and exhibits such great leadership potential; a real role model. Land of opportunity. Freedom of speech. God bless Merica.”"}, {"f371": "From Caged Heat to Eazy-E to Youporn, consumer pop anticulture saturated the digital generation with absurd, upside down concepts of what women want and how to treat them. Subsequent generations will of course be subjected to the same daunting cesspool. The least we can do is prepare them with accurate points of reference to develop their own healthy sexualities independent of Monstertube."}, {"6a09": "The internet-enabled, self-shot and published filth that inverted our sexual polarity can be stopped. Parents can filter the most troubling tubes and terms, and some ISPs offer opt-out mechanisms. Beyond opt-outs, governments are palsied to address the issue without jeopardizing democratic values like freedom of expression and the presumption of privacy. But fuck the freedom of speech at the expense of all else!"}, {"d962": "It’s not always worth it, nor is it a license to be as vicious and depraved as possible. Other things are more important, like childhood health, safety, and wellbeing. Parents have to step up, because constitutions stop governments from doing so."}, {"4eae": "A flesh-colored wave of popup clickbait bitches"}, {"8c86": "Victorian moralism’s popular decline just happened to coincide with globalization. And now, hot nonstop broadband with the tubes threatens to turn the whole sick planet into obscenity-crazed degenerates."}, {"a71a": "Abusedteens was not born in some loathsome vacuum. The stifling archetype of wholesome, procreative, nuclear family sexuality itself probably generated today’s explosion of noxious hypersex deviance."}, {"8cf5": "Had the closet never existed, we wouldn’t all be in it, one way or another. Nor would we be seeking to fill it with the most repulsive and repugnant sex acts ever misbegotten."}, {"3175": "Imagine looking back on now from the distant future: people discover the internet, and then immediately use it overwhelmingly to stream porn. Surfing the world’s greatest information equalizer on a revolting flesh-colored wave of popup clickbait bitches."}, {"c3a1": "Analytic maps of global traffic are scarcely believable. Unorthodox and unexpected behavior abounds, like Pakistani men outsearching us all for gay porn. And exposure to hardcore will not be a modernizing influence that drags the next generation of native Muslims and Hindus kicking and screaming into our rights-based world. Extreme niche will only harden their already deeply seeded disrespect and hatred of women and gays."}, {"83df": "Raising kids abroad away from the blazing dumpsterfire of porno USA, it’s hard to imagine how they will ever reintegrate with peers when we return. Yet even as far from Vegas and Panama City as we can get, they still remain at the same internet’s mercy."}, {"1b41": "Depraved priapic content across the full infotainment spectrum will almost certainly suffuse their adolescence, wherever we are. Kids’ shows, young adult fiction, reality tv, advertising, social media, and apps now all trade in the bedroom, or torture chamber, as the case may be."}, {"a3d1": "Thinkfluenced by a demand quantified from the whole wide world’s horny clickbait misadventures, it’s useless to blame the pusher for this. Statistics indicate that niche online trends are without question a function of viewer demand. Virtual irreality: everyone watching what no one is doing. Here’s to hoping it stays that way."}, {"4645": "Proudly and openly bohemian, I never thought I’d want my kids to be the only ones not doing something, but that’s exactly the right response to market-researched, datamined coprophagia. By the time they become teenagers, I fear the array of Monster High, slutoween, celebrity sex tapes, and baldfaced instrumentalization of sex to sell literally everything will have grown the gulf between them and their American peers to almost insurmountable proportions. At least, I hope so."}, {"588b": "As global connectivity grows, so certainly will porn and its misperceptions of what is normophilic sexual behavior. And sadly, so far, only an obscure and irreconcilable constellation of culture war antagonists seems to care."}, {"4ec6": "Incompatible they may be, but radical social feminists and censorious conservative evangelicals have finally found common cause behind which to unite: dads coming home early to pitilessly punish schoolgirl stepdaughter babysitter teens caught redhanded boning their meathead jerk boyfriends."}, {"3faf": "The good news in this race to absolute rockbottom is that niche interporn has nowhere left to go. Producers have already plumbed the very depths. And thankfully, the worst shit imaginable has already been imagined."}, {"b50d": "If you liked this, please recommend it. If you want to talk, comment; I reply to every remark. I also write about Russia, real America, disbelief, and elections at Counterpunch. Here at Medium about demographics, yesteryear, voters, foreign policy, untold history, and family values."}], "child": "1764_1\t1764_2\t1764_3"}