{"name": "1769", "parent": "", "content": "Media, Technology, Politics six new pieces on the networked public sphere Since November 8, countless articles have been written about “fake news,” hacking, and new forms of harassment and hate speech. A group of us at Data & Society have been following these conversations with great interest because, over the last several months, we have been tracking the various ways in which old and new media can be used to shape how information flows. Our work and interest in these issues stems from a project that we’ve undertaken to understand Who Controls the Public Sphere in an Age of Algorithms? Although many people are anxious to understand how much influence old and new media had over the US presidential election, the reality is that we will never know comprehensively. We can, though, seek to understand how different cultural and technical factors are shaping the contemporary information landscape. To document some of our thinking, we are releasing six pieces that look at different issues that we think are important for trying to make sense of the relationship between technology and current political dynamics in the US. These six pieces build on a few earlier essays as part of our work on media, accountability, and the public sphere, including: Taken together, these pieces begin to shed light on some of the challenging dynamics that we face as we grapple with and imagine what information looks like in a highly networked society. Democracy requires the free flow of information, informed citizens, and accountable media. What happens when the basic infrastructure of information and publics isn’t functioning as people expect and need? We’re keen to learn from other researchers working in this area and will be hosting an intensive workshop on Propaganda and Media Manipulation. To participate, apply by February 15. We also hope to host a series of events focused on these issues for different constituencies shortly. Subscribe to the Data & Society newsletter for updates. ", "title": "Media, Technology, Politics", "sentences": [{"5ddd": "Media, Technology, Politics"}, {"4acd": "six new pieces on the networked public sphere"}, {"b7f8": "Since November 8, countless articles have been written about “fake news,” hacking, and new forms of harassment and hate speech. A group of us at Data & Society have been following these conversations with great interest because, over the last several months, we have been tracking the various ways in which old and new media can be used to shape how information flows. Our work and interest in these issues stems from a project that we’ve undertaken to understand Who Controls the Public Sphere in an Age of Algorithms?"}, {"5455": "Although many people are anxious to understand how much influence old and new media had over the US presidential election, the reality is that we will never know comprehensively. We can, though, seek to understand how different cultural and technical factors are shaping the contemporary information landscape."}, {"4b67": "To document some of our thinking, we are releasing six pieces that look at different issues that we think are important for trying to make sense of the relationship between technology and current political dynamics in the US."}, {"e364": "These six pieces build on a few earlier essays as part of our work on media, accountability, and the public sphere, including:"}, {"f893": "Taken together, these pieces begin to shed light on some of the challenging dynamics that we face as we grapple with and imagine what information looks like in a highly networked society. Democracy requires the free flow of information, informed citizens, and accountable media. What happens when the basic infrastructure of information and publics isn’t functioning as people expect and need?"}, {"2c59": "We’re keen to learn from other researchers working in this area and will be hosting an intensive workshop on Propaganda and Media Manipulation. To participate, apply by February 15. We also hope to host a series of events focused on these issues for different constituencies shortly. Subscribe to the Data & Society newsletter for updates."}], "child": "1769_11769_1"}