{"name": "1773", "parent": "", "content": "What’s Propaganda Got To Do With It? Calling out news — whether real or fake — as propaganda expresses anxieties over media power, but is it helping us a get a grip on the media landscape? Amid the “fake news” controversies in the aftermath of the 2016 United States Presidential election, the notion of propaganda surged back into popular consciousness. Across the political spectrum, online conversations about propaganda bloomed like a thousand flowers of media anxiety. For example, shortly after the election, futurist Alex Steffen garnered thousands of retweets and likes with a tweet that declared, “Fake news is propaganda. The powerful demanding apologies from artists is censorship. Business dealings while in office are corruption.” To underscore the anti-authoritarian thrust of the message, a follow-up Medium post featured an image of 1984 author (and dedicated democratic socialist) George Orwell, invoking the thought-limiting qualities of that novel’s Newspeak. Although Steffen did not name the President-Elect in his short text, the post is tagged, “Donald Trump.” While some social media users were using the notion of propaganda to critique both the President-Elect and clickbait masquerading as journalistic content, others were labeling cable news networks and newspapers of record both “fake news” and propaganda, thus enfolding both terms into longstanding critiques of the media establishment. Propaganda, in other words, is having a moment. People are turning to propaganda as a media epithet because it helps to express discomfort with media — and the “fake news” controversy is just one part of this discomfort. The epithet gets its sting, in part, from popular imaginings of propaganda as bombastic, deceptive mass communications from an overreaching or abusive state. But this cultural imaginary can also limit our perceptions of how power and meaning move through society. State actors are involved in the current media moment, but so are a variety of other collectivities, with a variety of motives. What is propaganda? Propaganda is notoriously difficult to define. Beyond the generally agreed upon principle that propaganda involves some effort at persuasion, it’s hard to settle on clear boundaries on what counts as propaganda. Communication scholar Philip M. Taylor briefly defines propaganda as “the deliberate attempt to persuade people to think and behave in a desired way” (2003, p.6). Philosopher Jason Stanley lists a variety of definitions, including the “classical” sense of “manipulation of the rational will to close off debate” (2015, p. 48). Stanley focuses in particular on supporting propaganda, which bolsters certain favored ideals but does so by nonrational means, and undermining propaganda, which presents itself as bolstering favored ideals but in fact “tends to erode those very ideals” (p. 53). These are only two examples, differing on many points but tied together in their attention to power and persuasion. Public domain image via Library of Congress, Work Projects Administration Poster Collection. “We could quote definitions for pages on end,” Jacques Ellul wrote in his 1965 treatise on the topic, and the situation hasn’t improved much since then. But even if we leave aside the thorny question of definition, the fact of use-in-practice remains. People are using the term “propaganda” to express their discomfort with the media in this moment. I want to ask what the resurgence of propaganda as a topic of conversation reflects about popular understandings of the media in this moment. What itch does this nebulous term scratch for the people who are using it? And what does it draw attention away from? Holding the media to account…kind of. Most obviously, calling news propaganda expresses a suspicion that the leading media are affected by powerful interests, either directly or indirectly. It speaks to a sense of boundaries transgressed: democratic citizens want news to be trustworthy and dedicated to the public interest. Calling a news story or news outlet propagandistic suggests that it is anything but. The prevalence of “propaganda” as a media epithet reflects a variety of sentiments about the shortcomings of American journalism. The recent discussions of “fake news” and propaganda issue from many points on the political spectrum. We saw, during the recent election cycle, how news-like items of questionable or outright false web content, designed to garner maximum clicks and likes, sowed confusion within our national discourse. Concerns about these new developments have been added to longstanding objections from the left that include the corporate dominance of the fourth estate and the perpetuation of social injustice, and objections from the right that include what it sees as attacks on traditional values and undue protection of partisan political figures and projects. Add to these positions the many emergent strains of anti-institutionalism, nationalism, and populism in current American political discourse, and you get a sense of how the discourse about propaganda runs far beyond typical lines of partisanship. The epithet of propaganda contains a critique of elitism: the leading media are a bottleneck through which social reality must pass to gain a certain level of public legitimacy. The popular revival of “propaganda” as a media epithet expresses misgivings about media power and media practices. But even as it helps to focus popular misgivings, it also creates a frame. And that frame brings assumptions with it that can make it hard to see some of the cultural aspects of the present moment. State-controlled media? For one, the epithet of “propaganda” raises the spectre of state control, but governments are only one of the types of collectives that can exert influence over media. The most egregious historical cases of propaganda — ones everyone agrees were propagandistic — were media productions that issued from, or were driven by, state (or would-be state) actors. Scholarly treatments, of propaganda, too, tend to focus on state (or would-be state) actors). When coordinated, persuasive messages issue from non-state entities, we tend to use gentler terms like public relations, which shifts matters from the civic sphere to the seemingly separate sphere of commerce, or activism, which conjures images of grassroots, bottom-up persuasion. But these bright-line divisions are not as reliable as they seem. Consider, for example, the online discussions that culminated in Edgar Welch firing an assault rifle inside Comet Ping Pong. Discussions on user-driven sites such as Reddit and 4chan helped propel conspiracy theories about a possible child sex abuse ring headquartered in the DC-area pizzeria (#Pizzagate) into popular consciousness. Subsequently, some social media users (and the New York Times) condemned the Pizzagate conspiracy theory itself as fake news. Meanwhile, other users leveled charges of propaganda at New York Times for its coverage of these events, alleging that the powerful were banding together to protect one another. A matter of perspective The Pizzagate conspiracy theory itself was far-fetched, to say the least; even Welch conceded that the “intel” was “not 100%.” Depending on your perspective, though, discussions of Pizzagate on such sites could be described, variously, as propaganda or (misguided) activism. This is an admittedly extreme example, but it speaks to a broader issue in American culture. One person’s activism — or education, or journalism, for that matter — is another person’s propaganda. The boundaries between education, entertainment, and propaganda are blurry. This is a problem with a long history in the United States, as I have argued elsewhere. And amidst an ideologically and epistemologically divided population, agreement on the boundaries between categories like activism and propaganda are especially hard to find. Colloquial understandings of propaganda — narratives about strategic manipulation of leading media outlets by governments and or para-governmental groups — don’t capture this categorical contingency. It’s not (necessarily) a state actor If “propaganda” is a useful as a media epithet because it expresses concerns about media persuasion and power, then we must allow that a variety of actors, not just states or would-be states, can influence the television networks, newspapers of record, and leading online news sources. Our understanding of media power (and of what it means to call something propaganda) must make room for a variety of potential collective and individual influences. This includes corporations, interest groups, activist groups, and other traditional collectives; it should also include the new forms of individual and collective presence that digital communications facilitate. This includes state-sponsored online actors and ad-hoc user collectives. It’s not always entirely serious, although the outcomes can be Turning to the specific dynamics in play with Pizzagate, there’s another way that an observer could have categorized the conspiracy theories about Comet Ping Pong that flourished as users dug through John Podesta’s leaked emails, and it’s one that prior conceptions of propaganda don’t account for: play. A sense of absurd play — of trolling — prevails in some corners of user-driven online spaces. Trolling involves a kind of social playfulness that, if done correctly, is undetectable to the objects of the ruse; folklorist Whitney Phillips has written brilliantly and at length on this matter. There is no way to know for certain what motivations, in which proportions, drove users to participate in the conspiracy discussions on 4chan and Reddit. It may have been sincere concern, absurd play, curiosity, nihilism, boredom, or some mixture of all of these. Our understandings of media persuasion and power need to be capacious enough to acknowledge that some users participate in online projects such as this to gain a particular outcome, while others participate to enjoy the engaging or absurd play of the process. The resulting media texts can spur serious outcomes. Some of these may have been intended (e.g. entrenching negative sentiment against Clinton and her associates); others may not have been (as, seemingly, was the case with Welch). Shifting the frame Americans will be grappling with these novel contexts of media persuasion and power for some time. And the use of “propaganda” as a media epithet will likely continue. As these conversations unspool over the coming months and years, one way to avoid getting mired in is-it-or-isn’t-it debates that serve as proxies for a fractured civic sphere is to ask what people get from using the epithet. People are referencing a disconcerting set of realizations about how media and power function in our society. In some cases, those realizations challenge the foundational beliefs of our constitutional democracy. While definitions of propaganda may vary, they generally have to do with power and persuasion. But propaganda (versus entertainment, versus education, versus activism…) is a matter of perspective. Almost any communication can be interpreted as propagandistic in nature. Outside of the most blatantly egregious, demagogic or hateful cases, attempting to stifle propaganda won’t work. The emergence of propaganda as a media epithet, in practical use, isn’t a cause but a symptom of deeper fissures in American culture. Caroline Jack is a media scholar whose research focuses on media history and the public communication of economies. She holds a PhD in Communication from Cornell University, and is currently a Postdoctoral Scholar at Data & Society. Points/spheres: In “What’s Propaganda Got To Do With It?” Caroline Jack notes a resurgence in the popularity of “propaganda” as a judgment-laden label for a vast array of media ranging from fringe conspiracy theories to establishment news institutions . What work is this concept doing in efforts to conceptually navigate the contemporary media environment? This piece is part of a batch of new additions to an ongoing Points series on media, accountability, and the public sphere. See also: ", "title": "What’s Propaganda Got To Do With It?", "sentences": [{"5bae": "What’s Propaganda Got To Do With It?"}, {"f54c": "Calling out news — whether real or fake — as propaganda expresses anxieties over media power, but is it helping us a get a grip on the media landscape?"}, {"e800": "Amid the “fake news” controversies in the aftermath of the 2016 United States Presidential election, the notion of propaganda surged back into popular consciousness. Across the political spectrum, online conversations about propaganda bloomed like a thousand flowers of media anxiety."}, {"e340": "For example, shortly after the election, futurist Alex Steffen garnered thousands of retweets and likes with a tweet that declared, “Fake news is propaganda. The powerful demanding apologies from artists is censorship. Business dealings while in office are corruption.” To underscore the anti-authoritarian thrust of the message, a follow-up Medium post featured an image of 1984 author (and dedicated democratic socialist) George Orwell, invoking the thought-limiting qualities of that novel’s Newspeak. Although Steffen did not name the President-Elect in his short text, the post is tagged, “Donald Trump.”"}, {"8749": "While some social media users were using the notion of propaganda to critique both the President-Elect and clickbait masquerading as journalistic content, others were labeling cable news networks and newspapers of record both “fake news” and propaganda, thus enfolding both terms into longstanding critiques of the media establishment."}, {"5577": "Propaganda, in other words, is having a moment. People are turning to propaganda as a media epithet because it helps to express discomfort with media — and the “fake news” controversy is just one part of this discomfort. The epithet gets its sting, in part, from popular imaginings of propaganda as bombastic, deceptive mass communications from an overreaching or abusive state. But this cultural imaginary can also limit our perceptions of how power and meaning move through society. State actors are involved in the current media moment, but so are a variety of other collectivities, with a variety of motives."}, {"0f66": "What is propaganda?"}, {"b076": "Propaganda is notoriously difficult to define. Beyond the generally agreed upon principle that propaganda involves some effort at persuasion, it’s hard to settle on clear boundaries on what counts as propaganda. Communication scholar Philip M. Taylor briefly defines propaganda as “the deliberate attempt to persuade people to think and behave in a desired way” (2003, p.6). Philosopher Jason Stanley lists a variety of definitions, including the “classical” sense of “manipulation of the rational will to close off debate” (2015, p. 48). Stanley focuses in particular on supporting propaganda, which bolsters certain favored ideals but does so by nonrational means, and undermining propaganda, which presents itself as bolstering favored ideals but in fact “tends to erode those very ideals” (p. 53). These are only two examples, differing on many points but tied together in their attention to power and persuasion."}, {"3b54": "Public domain image via Library of Congress, Work Projects Administration Poster Collection."}, {"aa2d": "“We could quote definitions for pages on end,” Jacques Ellul wrote in his 1965 treatise on the topic, and the situation hasn’t improved much since then. But even if we leave aside the thorny question of definition, the fact of use-in-practice remains. People are using the term “propaganda” to express their discomfort with the media in this moment."}, {"d080": "I want to ask what the resurgence of propaganda as a topic of conversation reflects about popular understandings of the media in this moment. What itch does this nebulous term scratch for the people who are using it? And what does it draw attention away from?"}, {"4fd6": "Holding the media to account…kind of."}, {"5f31": "Most obviously, calling news propaganda expresses a suspicion that the leading media are affected by powerful interests, either directly or indirectly. It speaks to a sense of boundaries transgressed: democratic citizens want news to be trustworthy and dedicated to the public interest. Calling a news story or news outlet propagandistic suggests that it is anything but."}, {"14e4": "The prevalence of “propaganda” as a media epithet reflects a variety of sentiments about the shortcomings of American journalism. The recent discussions of “fake news” and propaganda issue from many points on the political spectrum. We saw, during the recent election cycle, how news-like items of questionable or outright false web content, designed to garner maximum clicks and likes, sowed confusion within our national discourse."}, {"2ba4": "Concerns about these new developments have been added to longstanding objections from the left that include the corporate dominance of the fourth estate and the perpetuation of social injustice, and objections from the right that include what it sees as attacks on traditional values and undue protection of partisan political figures and projects. Add to these positions the many emergent strains of anti-institutionalism, nationalism, and populism in current American political discourse, and you get a sense of how the discourse about propaganda runs far beyond typical lines of partisanship."}, {"ba7f": "The epithet of propaganda contains a critique of elitism: the leading media are a bottleneck through which social reality must pass to gain a certain level of public legitimacy."}, {"9473": "The popular revival of “propaganda” as a media epithet expresses misgivings about media power and media practices. But even as it helps to focus popular misgivings, it also creates a frame. And that frame brings assumptions with it that can make it hard to see some of the cultural aspects of the present moment."}, {"a70a": "State-controlled media?"}, {"8ed2": "For one, the epithet of “propaganda” raises the spectre of state control, but governments are only one of the types of collectives that can exert influence over media. The most egregious historical cases of propaganda — ones everyone agrees were propagandistic — were media productions that issued from, or were driven by, state (or would-be state) actors. Scholarly treatments, of propaganda, too, tend to focus on state (or would-be state) actors). When coordinated, persuasive messages issue from non-state entities, we tend to use gentler terms like public relations, which shifts matters from the civic sphere to the seemingly separate sphere of commerce, or activism, which conjures images of grassroots, bottom-up persuasion. But these bright-line divisions are not as reliable as they seem."}, {"43e5": "Consider, for example, the online discussions that culminated in Edgar Welch firing an assault rifle inside Comet Ping Pong. Discussions on user-driven sites such as Reddit and 4chan helped propel conspiracy theories about a possible child sex abuse ring headquartered in the DC-area pizzeria (#Pizzagate) into popular consciousness. Subsequently, some social media users (and the New York Times) condemned the Pizzagate conspiracy theory itself as fake news. Meanwhile, other users leveled charges of propaganda at New York Times for its coverage of these events, alleging that the powerful were banding together to protect one another."}, {"8631": "A matter of perspective"}, {"e9d1": "The Pizzagate conspiracy theory itself was far-fetched, to say the least; even Welch conceded that the “intel” was “not 100%.” Depending on your perspective, though, discussions of Pizzagate on such sites could be described, variously, as propaganda or (misguided) activism. This is an admittedly extreme example, but it speaks to a broader issue in American culture."}, {"119f": "One person’s activism — or education, or journalism, for that matter — is another person’s propaganda."}, {"ef60": "The boundaries between education, entertainment, and propaganda are blurry. This is a problem with a long history in the United States, as I have argued elsewhere. And amidst an ideologically and epistemologically divided population, agreement on the boundaries between categories like activism and propaganda are especially hard to find. Colloquial understandings of propaganda — narratives about strategic manipulation of leading media outlets by governments and or para-governmental groups — don’t capture this categorical contingency."}, {"15a7": "It’s not (necessarily) a state actor"}, {"2c36": "If “propaganda” is a useful as a media epithet because it expresses concerns about media persuasion and power, then we must allow that a variety of actors, not just states or would-be states, can influence the television networks, newspapers of record, and leading online news sources."}, {"dc09": "Our understanding of media power (and of what it means to call something propaganda) must make room for a variety of potential collective and individual influences. This includes corporations, interest groups, activist groups, and other traditional collectives; it should also include the new forms of individual and collective presence that digital communications facilitate. This includes state-sponsored online actors and ad-hoc user collectives."}, {"a4e0": "It’s not always entirely serious, although the outcomes can be"}, {"a110": "Turning to the specific dynamics in play with Pizzagate, there’s another way that an observer could have categorized the conspiracy theories about Comet Ping Pong that flourished as users dug through John Podesta’s leaked emails, and it’s one that prior conceptions of propaganda don’t account for: play."}, {"e0c9": "A sense of absurd play — of trolling — prevails in some corners of user-driven online spaces. Trolling involves a kind of social playfulness that, if done correctly, is undetectable to the objects of the ruse; folklorist Whitney Phillips has written brilliantly and at length on this matter. There is no way to know for certain what motivations, in which proportions, drove users to participate in the conspiracy discussions on 4chan and Reddit. It may have been sincere concern, absurd play, curiosity, nihilism, boredom, or some mixture of all of these."}, {"e2a0": "Our understandings of media persuasion and power need to be capacious enough to acknowledge that some users participate in online projects such as this to gain a particular outcome, while others participate to enjoy the engaging or absurd play of the process. The resulting media texts can spur serious outcomes. Some of these may have been intended (e.g. entrenching negative sentiment against Clinton and her associates); others may not have been (as, seemingly, was the case with Welch)."}, {"fdcf": "Shifting the frame"}, {"a22c": "Americans will be grappling with these novel contexts of media persuasion and power for some time. And the use of “propaganda” as a media epithet will likely continue. As these conversations unspool over the coming months and years, one way to avoid getting mired in is-it-or-isn’t-it debates that serve as proxies for a fractured civic sphere is to ask what people get from using the epithet. People are referencing a disconcerting set of realizations about how media and power function in our society. In some cases, those realizations challenge the foundational beliefs of our constitutional democracy."}, {"6be0": "While definitions of propaganda may vary, they generally have to do with power and persuasion. But propaganda (versus entertainment, versus education, versus activism…) is a matter of perspective. Almost any communication can be interpreted as propagandistic in nature. Outside of the most blatantly egregious, demagogic or hateful cases, attempting to stifle propaganda won’t work. The emergence of propaganda as a media epithet, in practical use, isn’t a cause but a symptom of deeper fissures in American culture."}, {"26ae": "Caroline Jack is a media scholar whose research focuses on media history and the public communication of economies. She holds a PhD in Communication from Cornell University, and is currently a Postdoctoral Scholar at Data & Society."}, {"c327": "Points/spheres: In “What’s Propaganda Got To Do With It?” Caroline Jack notes a resurgence in the popularity of “propaganda” as a judgment-laden label for a vast array of media ranging from fringe conspiracy theories to establishment news institutions . What work is this concept doing in efforts to conceptually navigate the contemporary media environment? This piece is part of a batch of new additions to an ongoing Points series on media, accountability, and the public sphere. See also:"}], "child": "1773_1\t1773_2\t1773_3\t1773_4\t1773_5\t1773_6\t1773_7\t1773_81773_1\t1773_2\t1773_3\t1773_4\t1773_5\t1773_6\t1773_7\t1773_81773_1\t1773_2\t1773_3\t1773_4\t1773_5\t1773_6\t1773_7\t1773_8"}