{"name": "1775", "parent": "", "content": "Culture of Harassment In the last two weeks, we’ve seen numerous examples of hate speech and harassment documented and shared on social media. It’s devastating to imagine how many other attacks are occurring that are less visible. We are collectively bearing witness to a form of meanness and cruelty that is by no means new but is nonetheless heartbreaking because so much of it is justified by contemporary politics. Yesterday, Data & Society and CiPHR released a report on “Online Harassment, Digital Abuse, and Cyberstalking in America” based on survey research conducted earlier this year. An astonishing 72% of American internet users have witnessed online harassment or abuse while almost 47% have personally been on the receiving end. From being called offensive names to being physically threatened, many people experience the internet as an unsafe space. Unsurprisingly, women, LGB people, and people of color are more likely to witness, and in many cases, experience such harassment. Advocates, educators, and policymakers have spent a decade focusing on ending bullying among young people, and yet, in this study, it is clear that young people face harassment at higher levels than many other groups. The psychological, social, and political cost of harassment is real. 27% of all American internet users self-censor what they post online out of fear of online harassment. Young people are especially prone to self-censorship. This is deeply disturbing. We often worry about free speech online, but we don’t consider the social factors that prompt people to censor themselves or the ways in which this impacts some groups more than others. The data that this report offers complements what I’ve seen on the ground. Over the last 15 years, I’ve seen self-censoring increase among teenagers, especially among vulnerable teens, but it is still shocking to see it in such stark numbers. And it’s even harder to think about how it’s getting worse as the proliferation of hate escalates and is justified by political leadership. CC BY 2.0-licensed photo by Jason Howie. Where do we go from here? When I was growing up in the 1990s, I found solace in the internet. I saw it as a place where I could connect to people and escape challenges and prejudices that I faced on a daily basis. Like many of my peers, I imagined that the internet could be used to empower and connect people at unprecedented levels, and I dove into building social media tools to enable that goal. I’ve always know that the utopian kumbaya rhetoric of my peers was a bit off, but I still struggle with the realization that the tools that I cherish are sites of pain for so many people. Last week, Twitter announced new tools to fight harassment, highlighting the challenges that they’ve faced in preventing hurtful actions through their terms of service. Meanwhile, Facebook is struggling to control “fake” news that’s used to polarize and incent hatred. Sadly, as these social media companies know all too well, creative hate mongers will still find new and innovative ways to harass and spread hate, whether on their service or through other means. We have a lot of work to do to make social media a place where many people feel free to speak and participate without being hurt. Harassment and hate erode our social contract. The language people use and the threats they make can be tools of power used against others. As we grapple to make sense of our contemporary political landscape, we cannot accept hate, intolerance, and harassment as status quo. Like Twitter and Facebook, we will always be playing whack-a-mole, but we owe it to ourselves and our country to stand up to harassment as bystanders, citizens, and technology makers. This new report on harassment sheds light on how pervasive these issues are, but it now behooves us to do something about it. We must start by using the tools available to report abuse when possible. As bystanders, we also have a responsibility to reach out to those who are affected and make certain that they are OK. And as citizens, it is imperative that we call out and refuse to accept harassing language from our leaders. Hate and harassment cannot be normalized. In the same vein, we must recognize that the technical platforms that many of us love are not neutral spaces of free speech for everyone. We must understand the diversity of experience and work hard to protect those who are most vulnerable. No one deserves to be harassed when they try to participate in the public sphere. And when we allow some people to be silenced, we all lose. Points: danah boyd reads Data & Society and CiPHR’s new report, “Online Harassment, Digital Abuse, and Cyberstalking in America,” and connects it with her own qualitative research and today’s political culture. Online harassment, she argues, suppresses voices that need to be heard for the public sphere to be public. — Ed. ", "title": "Culture of Harassment", "sentences": [{"fd41": "Culture of Harassment"}, {"e710": "In the last two weeks, we’ve seen numerous examples of hate speech and harassment documented and shared on social media. It’s devastating to imagine how many other attacks are occurring that are less visible. We are collectively bearing witness to a form of meanness and cruelty that is by no means new but is nonetheless heartbreaking because so much of it is justified by contemporary politics."}, {"c9b4": "Yesterday, Data & Society and CiPHR released a report on “Online Harassment, Digital Abuse, and Cyberstalking in America” based on survey research conducted earlier this year. An astonishing 72% of American internet users have witnessed online harassment or abuse while almost 47% have personally been on the receiving end. From being called offensive names to being physically threatened, many people experience the internet as an unsafe space. Unsurprisingly, women, LGB people, and people of color are more likely to witness, and in many cases, experience such harassment. Advocates, educators, and policymakers have spent a decade focusing on ending bullying among young people, and yet, in this study, it is clear that young people face harassment at higher levels than many other groups."}, {"4583": "The psychological, social, and political cost of harassment is real."}, {"cd8c": "27% of all American internet users self-censor what they post online out of fear of online harassment. Young people are especially prone to self-censorship."}, {"c9f5": "This is deeply disturbing. We often worry about free speech online, but we don’t consider the social factors that prompt people to censor themselves or the ways in which this impacts some groups more than others. The data that this report offers complements what I’ve seen on the ground. Over the last 15 years, I’ve seen self-censoring increase among teenagers, especially among vulnerable teens, but it is still shocking to see it in such stark numbers. And it’s even harder to think about how it’s getting worse as the proliferation of hate escalates and is justified by political leadership."}, {"0309": "CC BY 2.0-licensed photo by Jason Howie."}, {"dc48": "Where do we go from here?"}, {"4db4": "When I was growing up in the 1990s, I found solace in the internet. I saw it as a place where I could connect to people and escape challenges and prejudices that I faced on a daily basis. Like many of my peers, I imagined that the internet could be used to empower and connect people at unprecedented levels, and I dove into building social media tools to enable that goal. I’ve always know that the utopian kumbaya rhetoric of my peers was a bit off, but I still struggle with the realization that the tools that I cherish are sites of pain for so many people."}, {"5980": "Last week, Twitter announced new tools to fight harassment, highlighting the challenges that they’ve faced in preventing hurtful actions through their terms of service. Meanwhile, Facebook is struggling to control “fake” news that’s used to polarize and incent hatred. Sadly, as these social media companies know all too well, creative hate mongers will still find new and innovative ways to harass and spread hate, whether on their service or through other means. We have a lot of work to do to make social media a place where many people feel free to speak and participate without being hurt."}, {"5c3b": "Harassment and hate erode our social contract. The language people use and the threats they make can be tools of power used against others. As we grapple to make sense of our contemporary political landscape, we cannot accept hate, intolerance, and harassment as status quo. Like Twitter and Facebook, we will always be playing whack-a-mole, but we owe it to ourselves and our country to stand up to harassment as bystanders, citizens, and technology makers."}, {"9b40": "This new report on harassment sheds light on how pervasive these issues are, but it now behooves us to do something about it. We must start by using the tools available to report abuse when possible. As bystanders, we also have a responsibility to reach out to those who are affected and make certain that they are OK. And as citizens, it is imperative that we call out and refuse to accept harassing language from our leaders."}, {"d4c5": "Hate and harassment cannot be normalized. In the same vein, we must recognize that the technical platforms that many of us love are not neutral spaces of free speech for everyone. We must understand the diversity of experience and work hard to protect those who are most vulnerable. No one deserves to be harassed when they try to participate in the public sphere. And when we allow some people to be silenced, we all lose."}, {"be47": "Points: danah boyd reads Data & Society and CiPHR’s new report, “Online Harassment, Digital Abuse, and Cyberstalking in America,” and connects it with her own qualitative research and today’s political culture. Online harassment, she argues, suppresses voices that need to be heard for the public sphere to be public. — Ed."}], "child": "1775_1\t1775_2\t1775_3\t1775_4\t1775_5\t1775_61775_1\t1775_2\t1775_3\t1775_4\t1775_5\t1775_6"}