{"name": "1781", "parent": "", "content": "UX analysis and recommendations for DBS/POSB Digibank app Duration: 6 days Team members: Eugene, Gary and Pooja Main roles: Project Planning, User Research Project Planning Objectives and roles and responsibilities were laid out as part of project planning. Usability Testing and User Interview Research subjects included both iOS and Android users who were tech savvy. Two separate groups of customers were recruited for user research: 1. Customers who have not used POSB/DBS Digibank app before These customers were recruited for usability testing. We observed them undertaking tasks using the app to uncover areas which they had problems with. A total of 22 task-based questions* were asked. 2. Customers who are current app user Detailed user interviews were carried out to understand their behaviours, habits and frustrations when interacting with the app. A total of 38 interview questions* were asked. *These questions were devised by me. Affinity Mapping The responses from all 9 customers were consolidated using affinity mapping, allowing us to understand the major problems they faced while interacting with the app. Affinity mapping results Identifying User Needs Based on the findings, there are three key issues that need to be addressed. These issues surround the functionality and usability of the app. Recommendations We recommend POSB/DBS to reduce the complexity in which customers achieve important tasks, such as checking for account balance and bank transfers. We are working on a list of features for improvements. One feature worth mentioning here is the \"Slide and Peek\" feature. \"Slide and Peek\" feature POSB/DBS has tried to solve the issue of the quick viewing of account balance through the \"Slide and peek\" feature, which customers can enable/disable according to how comfortable they are. However, customers we have interviewed do not feel safe about this feature. The fundamental reason why this feature came about was to afford customers an easier way to check their account balance without logging in. Viewing account balance takes 2 steps Yet, this feature does not allow customers to perform other essential functions that came onto the app for. This problem may be solved equally well in this scenario: Same 2 steps but different outcomes Customers still get to see their account balances, but with an added layer of protection through fingerprint authentication. Moreover, not only will customers be able to check for their account balance, they would be able to perform all essential tasks they came to the app for. Of course, this is based on the assumptions that there are no business needs or restrictions which limit the UX team at POSB/DBS. Future developments The team is now compiling a complete list of usability issues. We are also working on sketches to ideate new solutions and designs to solve the issues uncovered from user research and improve the UX of the app. By enhancing the UX of the POSB/DBS apps, we hope to reduce the time taken for customers' to perform essential tasks they came to the app for, creating a delightful user experience. This would help to drive the use of the app, customers' satisfaction, and trust in the POSB/DBS brand. ", "title": "UX analysis and recommendations for DBS/POSB Digibank app", "sentences": [{"cd2f": "UX analysis and recommendations for DBS/POSB Digibank app"}, {"8393": "Duration: 6 days"}, {"6f4d": "Team members: Eugene, Gary and Pooja"}, {"93a1": "Main roles: Project Planning, User Research"}, {"a402": "Project Planning"}, {"032c": "Objectives and roles and responsibilities were laid out as part of project planning."}, {"9515": "Usability Testing and User Interview"}, {"5421": "Research subjects included both iOS and Android users who were tech savvy."}, {"137f": "Two separate groups of customers were recruited for user research:"}, {"710b": "1. Customers who have not used POSB/DBS Digibank app before"}, {"330f": "These customers were recruited for usability testing. We observed them undertaking tasks using the app to uncover areas which they had problems with. A total of 22 task-based questions* were asked."}, {"a48d": "2. Customers who are current app user"}, {"75a5": "Detailed user interviews were carried out to understand their behaviours, habits and frustrations when interacting with the app. A total of 38 interview questions* were asked."}, {"5aa4": "*These questions were devised by me."}, {"05c9": "Affinity Mapping"}, {"faf7": "The responses from all 9 customers were consolidated using affinity mapping, allowing us to understand the major problems they faced while interacting with the app."}, {"0461": "Affinity mapping results"}, {"f7ab": "Identifying User Needs"}, {"9b2a": "Based on the findings, there are three key issues that need to be addressed. These issues surround the functionality and usability of the app."}, {"a53e": "Recommendations"}, {"bea8": "We recommend POSB/DBS to reduce the complexity in which customers achieve important tasks, such as checking for account balance and bank transfers. We are working on a list of features for improvements."}, {"220c": "One feature worth mentioning here is the \"Slide and Peek\" feature."}, {"4d22": "\"Slide and Peek\" feature"}, {"63cb": "POSB/DBS has tried to solve the issue of the quick viewing of account balance through the \"Slide and peek\" feature, which customers can enable/disable according to how comfortable they are. However, customers we have interviewed do not feel safe about this feature."}, {"63d5": "The fundamental reason why this feature came about was to afford customers an easier way to check their account balance without logging in."}, {"66e1": "Viewing account balance takes 2 steps"}, {"fec1": "Yet, this feature does not allow customers to perform other essential functions that came onto the app for. This problem may be solved equally well in this scenario:"}, {"48f2": "Same 2 steps but different outcomes"}, {"be6d": "Customers still get to see their account balances, but with an added layer of protection through fingerprint authentication. Moreover, not only will customers be able to check for their account balance, they would be able to perform all essential tasks they came to the app for."}, {"2d3b": "Of course, this is based on the assumptions that there are no business needs or restrictions which limit the UX team at POSB/DBS."}, {"1ec4": "Future developments"}, {"6e72": "The team is now compiling a complete list of usability issues. We are also working on sketches to ideate new solutions and designs to solve the issues uncovered from user research and improve the UX of the app."}, {"5ca4": "By enhancing the UX of the POSB/DBS apps, we hope to reduce the time taken for customers' to perform essential tasks they came to the app for, creating a delightful user experience. This would help to drive the use of the app, customers' satisfaction, and trust in the POSB/DBS brand."}], "child": "1781_1"}