{"content": "10 books that will make you a better writer (and why) Books every fiction writer should own Last week, I wrote about 25 habits that will make you a better writer. This week, I thought — let’s dive into books. After twenty-plus years writing, I’ve collected some resources that I absolutely couldn’t do with out. 25 Habits That Will Make You a WriterHard learned lessons distilled from 25 years of writingmedium.com I love borrowing books. But there are some books that a writer really should have in their own personal for-keeps libraries. These are the books that you’ll keep coming back to, over and over, through your career. Here are my top ten writing craft books. Some of them I’ve owned for twenty years or more. Some are new to me. Some are classics that you might already own. Maybe there are some that will be new to you. Self-Editing for Fiction Writers by Renni Browne and Dave King http://amzn.to/2oPzo9X “You want to draw your readers into the world you’ve created, make them feel a part of it, make them forget where they are. And you can’t do this effectively if you tell your readers about your world secondhand.” In 2004, when I was eight months pregnant, I won Nanowrimo for the first time. I wrote a truly awful first draft of a romantic suspense story. Then I had a baby girl on December 8. I never looked back. Once I knew that I could finish writing a novel, I knew that I could learn how to write well. Self-Editing for Fiction Writers is the book that taught me how to be a better writer. I finished my first manuscript and took a solid year, going through this book, chapter by chapter, exercise by exercise, and applying what I learned to my work. Zen in the Art of Writing by Ray Bradbury http://amzn.to/2nvgBR0 “I have never listened to anyone who criticized my taste in space travel, sideshows or gorillas. When this occurs, I pack up my dinosaurs and leave the room.” Ray Bradbury’s little book of essays about writing and creativity is an essential little pocket of inspiration. I’ve read it half a dozen times and every single time, I pick up something new. Because it’s a collection of essays, you can pick it up and read what you need, when you need it. Bradbury’s advice for fiction writers has shaped my writing life. He believed, especially, in short stories and in reading a lot. And watching movies. One of my favorite parts of Zen in the Art of Writing is the way that Bradbury breaks down how and why he wrote some of my favorite short stories. On Writing by Stephen King http://amzn.to/2nYruaf “Writing isn’t about making money, getting famous, getting dates, getting laid, or making friends. In the end, it’s about enriching the lives of those who will read your work, and enriching your own life, as well. It’s about getting up, getting well, and getting over. Getting happy, okay? Getting happy.” In 1997, I sent a query letter to Dog Fancy magazine, pitching an idea for an article about dog-friendly restaurants in Las Vegas. They accepted. I wrote the article, my sister Alison took a couple of pictures of her dog at a dog-friendly restaurant in Las Vegas, and Dog Fancy magazine paid me $10. In 1997, gas cost about a dollar a gallon. I put my $10 in my ginormous yellow station wagon. And because Stephen King wrote, in On Writing, that he considers anyone who writes something that someone pays them for, and they use that money to pay the bills, a successful writer, when my daughter Adrienne started Kindergarten a few weeks later, I wrote ‘writer’ in the space for her mother’s occupation. You’d have to look hard to find a list of books for writers that doesn’t include this one. That’s not because the people who make the lists are lazy or unimaginative. It’s because it’s that good. If you only buy one, buy this one. Write. Publish. Repeat. by Sean Platt and Johnny B. Truant http://amzn.to/2nvcfZU “The people who read pirated books are never going to buy your work anyway; it’s a totally different audience than purchasing readers. Even if you could scrub your stuff from the Internet, you’d only be keeping your book from pirate readers. You wouldn’t convert those readers into buyers. They’d simply read something else that was free.” My friend Hartley talks all the time about the “Write, publish, repeat guys.” When I finally picked up this book to read, I totally got why. Sean Platt, Johnny B. Truant, and David Wright are genius at figuring out how to meld art and business without losing what’s important about either one. Seriously, they’ve made an art of the business of writing and it’s incredible. If you don’t listen to their Self-publishing Podcast, you should. And definitely, read this book. Whether your plan is traditional publishing or going indie, it’s important to learn the business of being an author. There aren’t a whole lot of people talking about that. I don’t think anyone is talking about it quite this well. Indie Writer Survival Guide by Susan Kaye Quinn http://amzn.to/2pivrqn “Admit it, name it, and take action in the face of it.” Another friend, Tracy Clark, introduced me to Indie Author Survival Guide by Susan Kaye Quinn. It’s not quite as slick as Write. Publish. Repeat. but it’s full of fantastic information. It’s like sitting down with a friend whose several steps ahead of you in this thing, and having her tell you all of her secrets. Quinn is a solid mid-list indie author and she talks a lot in the book about how she got there. I love that she talks about things that feel possible, for any writer. Lots of the time, when you read about someone’s success, they’ve done something or had something happen to them that just isn’t reproducible by the average writer. One more time: if you want to be a novelist, you need to know how to sell books, regardless of the mode with which you publish your work. You can take that from me. I wrote about my experience with Penguin here: How Being Published by the Big Six F*cked Me Up.All my life, I’ve had one dream.medium.com Story Genius by Lisa Cron http://amzn.to/2pivMJR “Each thing you add to your story is a drop of paint falling into clear water; it spreads through and colors everything.” You know how sometimes you read a book and it just instantly feels like it’s yours? That’s how Story Genius was for me. Lisa Cron’s book is all about how our brains react to stories. It was assigned to me by my MFA mentor and I’m so glad. I especially love the exercises in this one. They help me to take a deeper dive into my characters, into my story, and into the reasons why I’m writing it. This book is definitely one you’ll want to own, because you’ll be coming back to it again and again as you write. Steering the Craft by Ursula K. LeGuin http://amzn.to/2piHy6F “Ultimately you write alone. And ultimately you and you alone can judge your work. The judgment that a work is complete — this is what I meant to do, and I stand by it — can come only from the writer, and it can be made rightly only by a writer who’s learned to read her own work. Group criticism is great training for self-criticism. But until quite recently no writer had that training, and yet they learned what they needed. They learned it by doing it.” According to the intro to this book, Steering the Craft started as a course Ursula K. Le Guin gave to aspiring writers. I can’t tell you how badly I wish I’d been able to take that class! She teaches writers not only how to write, but how to make the story become a living thing for the reader. Beautiful. The Writer’s Journey by Christopher Vogler http://amzn.to/2oU43T0 “I realized that the good stories were affecting the organs of my body in various ways, and the really good ones were stimulating more than one organ. An effective story grabs your gut, tightens your throat, makes your heart race and your lungs pump, brings tears to your eyes or an explosion of laughter to your lips.” Of all of the books on this list, The Writer’s Journey might be my favorite. It’s taught me more about story structure than any other resource, including my undergraduate and graduate work in creative writing. It’s a step-by-step guide through the classic hero’s journey with examples and exercises that will improve your writing if you pay attention. My free course The Plotting Workshop is based on The Writer’s Journey. The Creative Tarot by Jessica Crispin “Do you know that maxim ‘Write what you know?’ Nonsense. That saying lets us off the hook for our more narcissistic impulses and for not trying to understand the world around us.” This one’s just pure fun. I’ve been having so much fun with The Creative Tarot and my set of Rider Tarot Deck. It gets my creative juices flowing. Especially if I’m feeling a little stuck. I found out about it through Austin Kleon’s newsletter, so that’s a nice segway into . . . Steal Like an Artist by Austin Kleon http://amzn.to/2nYFYqm “Draw the art you want to see, start the business you want to run, play the music you want to hear, write the books you want to read, build the products you want to use — do the work you want to see done.” What I love the most about Austin Kleon’s work is the way it is just pure creativity. Every time I read his newsletter or pick up one of his books, it’s like a booster shot of creative inspiration. Own Steal Like an Artist. It’s only $5.99 on Amazon right now. Seriously — best $6 spent ever. (If you really want to go all in, buy Show Your Work, too. Also $5.99!) And, whatever else you do after reading this entire post, go sign up for Kleon’s newsletter. It’s one of my favorite pieces of email all week. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "child": "18_1\t18_2\t18_3\t18_4\t18_5\t18_6\t18_7\t18_8\t18_9\t18_10\t18_11\t18_12\t18_13\t18_14\t18_15\t18_16\t18_17\t18_18\t18_19\t18_20\t18_21\t18_22\t18_23\t18_24", "title": "10 books that will make you a better writer (and why)", "parent": "", "sentences": [{"c4be": "10 books that will make you a better writer (and why)"}, {"ab1c": "Books every fiction writer should own"}, {"a7fc": "Last week, I wrote about 25 habits that will make you a better writer. This week, I thought — let’s dive into books. After twenty-plus years writing, I’ve collected some resources that I absolutely couldn’t do with out."}, {"d313": "25 Habits That Will Make You a WriterHard learned lessons distilled from 25 years of writingmedium.com"}, {"909d": "I love borrowing books. But there are some books that a writer really should have in their own personal for-keeps libraries. These are the books that you’ll keep coming back to, over and over, through your career."}, {"31c8": "Here are my top ten writing craft books. Some of them I’ve owned for twenty years or more. Some are new to me. Some are classics that you might already own. Maybe there are some that will be new to you."}, {"e0a3": "Self-Editing for Fiction Writers by Renni Browne and Dave King"}, {"9ffa": "http://amzn.to/2oPzo9X"}, {"dcc0": "“You want to draw your readers into the world you’ve created, make them feel a part of it, make them forget where they are. And you can’t do this effectively if you tell your readers about your world secondhand.”"}, {"fc49": "In 2004, when I was eight months pregnant, I won Nanowrimo for the first time. I wrote a truly awful first draft of a romantic suspense story. Then I had a baby girl on December 8. I never looked back. Once I knew that I could finish writing a novel, I knew that I could learn how to write well."}, {"746b": "Self-Editing for Fiction Writers is the book that taught me how to be a better writer. I finished my first manuscript and took a solid year, going through this book, chapter by chapter, exercise by exercise, and applying what I learned to my work."}, {"a64b": "Zen in the Art of Writing by Ray Bradbury"}, {"8606": "http://amzn.to/2nvgBR0"}, {"d51e": "“I have never listened to anyone who criticized my taste in space travel, sideshows or gorillas. When this occurs, I pack up my dinosaurs and leave the room.”"}, {"8686": "Ray Bradbury’s little book of essays about writing and creativity is an essential little pocket of inspiration. I’ve read it half a dozen times and every single time, I pick up something new. Because it’s a collection of essays, you can pick it up and read what you need, when you need it."}, {"6edd": "Bradbury’s advice for fiction writers has shaped my writing life. He believed, especially, in short stories and in reading a lot. And watching movies. One of my favorite parts of Zen in the Art of Writing is the way that Bradbury breaks down how and why he wrote some of my favorite short stories."}, {"9819": "On Writing by Stephen King"}, {"8397": "http://amzn.to/2nYruaf"}, {"037c": "“Writing isn’t about making money, getting famous, getting dates, getting laid, or making friends. In the end, it’s about enriching the lives of those who will read your work, and enriching your own life, as well. It’s about getting up, getting well, and getting over. Getting happy, okay? Getting happy.”"}, {"80e3": "In 1997, I sent a query letter to Dog Fancy magazine, pitching an idea for an article about dog-friendly restaurants in Las Vegas. They accepted. I wrote the article, my sister Alison took a couple of pictures of her dog at a dog-friendly restaurant in Las Vegas, and Dog Fancy magazine paid me $10."}, {"3f89": "In 1997, gas cost about a dollar a gallon. I put my $10 in my ginormous yellow station wagon. And because Stephen King wrote, in On Writing, that he considers anyone who writes something that someone pays them for, and they use that money to pay the bills, a successful writer, when my daughter Adrienne started Kindergarten a few weeks later, I wrote ‘writer’ in the space for her mother’s occupation."}, {"a6cc": "You’d have to look hard to find a list of books for writers that doesn’t include this one. That’s not because the people who make the lists are lazy or unimaginative. It’s because it’s that good. If you only buy one, buy this one."}, {"0756": "Write. Publish. Repeat. by Sean Platt and Johnny B. Truant"}, {"de54": "http://amzn.to/2nvcfZU"}, {"1581": "“The people who read pirated books are never going to buy your work anyway; it’s a totally different audience than purchasing readers. Even if you could scrub your stuff from the Internet, you’d only be keeping your book from pirate readers. You wouldn’t convert those readers into buyers. They’d simply read something else that was free.”"}, {"0bf9": "My friend Hartley talks all the time about the “Write, publish, repeat guys.” When I finally picked up this book to read, I totally got why. Sean Platt, Johnny B. Truant, and David Wright are genius at figuring out how to meld art and business without losing what’s important about either one."}, {"34d0": "Seriously, they’ve made an art of the business of writing and it’s incredible. If you don’t listen to their Self-publishing Podcast, you should. And definitely, read this book."}, {"db86": "Whether your plan is traditional publishing or going indie, it’s important to learn the business of being an author. There aren’t a whole lot of people talking about that. I don’t think anyone is talking about it quite this well."}, {"887b": "Indie Writer Survival Guide by Susan Kaye Quinn"}, {"2d03": "http://amzn.to/2pivrqn"}, {"bc54": "“Admit it, name it, and take action in the face of it.”"}, {"b682": "Another friend, Tracy Clark, introduced me to Indie Author Survival Guide by Susan Kaye Quinn. It’s not quite as slick as Write. Publish. Repeat. but it’s full of fantastic information. It’s like sitting down with a friend whose several steps ahead of you in this thing, and having her tell you all of her secrets."}, {"88f2": "Quinn is a solid mid-list indie author and she talks a lot in the book about how she got there. I love that she talks about things that feel possible, for any writer. Lots of the time, when you read about someone’s success, they’ve done something or had something happen to them that just isn’t reproducible by the average writer."}, {"7513": "One more time: if you want to be a novelist, you need to know how to sell books, regardless of the mode with which you publish your work. You can take that from me. I wrote about my experience with Penguin here:"}, {"8e92": "How Being Published by the Big Six F*cked Me Up.All my life, I’ve had one dream.medium.com"}, {"99a1": "Story Genius by Lisa Cron"}, {"de74": "http://amzn.to/2pivMJR"}, {"80c4": "“Each thing you add to your story is a drop of paint falling into clear water; it spreads through and colors everything.”"}, {"2b62": "You know how sometimes you read a book and it just instantly feels like it’s yours? That’s how Story Genius was for me. Lisa Cron’s book is all about how our brains react to stories. It was assigned to me by my MFA mentor and I’m so glad."}, {"11a7": "I especially love the exercises in this one. They help me to take a deeper dive into my characters, into my story, and into the reasons why I’m writing it."}, {"daf7": "This book is definitely one you’ll want to own, because you’ll be coming back to it again and again as you write."}, {"2eea": "Steering the Craft by Ursula K. LeGuin"}, {"1b64": "http://amzn.to/2piHy6F"}, {"bde8": "“Ultimately you write alone. And ultimately you and you alone can judge your work. The judgment that a work is complete — this is what I meant to do, and I stand by it — can come only from the writer, and it can be made rightly only by a writer who’s learned to read her own work. Group criticism is great training for self-criticism. But until quite recently no writer had that training, and yet they learned what they needed. They learned it by doing it.”"}, {"5ae4": "According to the intro to this book, Steering the Craft started as a course Ursula K. Le Guin gave to aspiring writers. I can’t tell you how badly I wish I’d been able to take that class! She teaches writers not only how to write, but how to make the story become a living thing for the reader. Beautiful."}, {"5464": "The Writer’s Journey by Christopher Vogler"}, {"6f33": "http://amzn.to/2oU43T0"}, {"49bc": "“I realized that the good stories were affecting the organs of my body in various ways, and the really good ones were stimulating more than one organ. An effective story grabs your gut, tightens your throat, makes your heart race and your lungs pump, brings tears to your eyes or an explosion of laughter to your lips.”"}, {"9c2c": "Of all of the books on this list, The Writer’s Journey might be my favorite. It’s taught me more about story structure than any other resource, including my undergraduate and graduate work in creative writing. It’s a step-by-step guide through the classic hero’s journey with examples and exercises that will improve your writing if you pay attention. My free course The Plotting Workshop is based on The Writer’s Journey."}, {"9d5f": "The Creative Tarot by Jessica Crispin"}, {"db25": "“Do you know that maxim ‘Write what you know?’ Nonsense. That saying lets us off the hook for our more narcissistic impulses and for not trying to understand the world around us.”"}, {"42d5": "This one’s just pure fun."}, {"c982": "I’ve been having so much fun with The Creative Tarot and my set of Rider Tarot Deck."}, {"043d": "It gets my creative juices flowing. Especially if I’m feeling a little stuck. I found out about it through Austin Kleon’s newsletter, so that’s a nice segway into . . ."}, {"9b61": "Steal Like an Artist by Austin Kleon"}, {"4dcf": "http://amzn.to/2nYFYqm"}, {"5801": "“Draw the art you want to see, start the business you want to run, play the music you want to hear, write the books you want to read, build the products you want to use — do the work you want to see done.”"}, {"45a9": "What I love the most about Austin Kleon’s work is the way it is just pure creativity. Every time I read his newsletter or pick up one of his books, it’s like a booster shot of creative inspiration. Own Steal Like an Artist. It’s only $5.99 on Amazon right now. Seriously — best $6 spent ever. (If you really want to go all in, buy Show Your Work, too. Also $5.99!) And, whatever else you do after reading this entire post, go sign up for Kleon’s newsletter. It’s one of my favorite pieces of email all week."}, {"2d11": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"b3ad": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "name": "18"}