{"name": "1820", "parent": "", "content": "The House of ‘The Walking Dead’ Twenty-five years ago, seven acclaimed artists ditched their Marvel overlords and started a comic-book rebellion. They called it Image, and it rewrote the industry playbook. This is how the founders revolutionized an industry and launched a new generation of stars and ‘The Walking Dead’ juggernaut. Todd McFarlane was tired. It was 1991, and the superstar comic-book artist was at the peak of his powers. In the year prior, McFarlane had launched a new Spider-Man title — simply called Spider-Man — that would sell more than 2.5 million copies for Marvel Comics. But he didn’t have the respect from his editors that he thought he deserved. His days were filled with “silly mini-confrontations” with Marvel over the direction of the book, and with his first child on the way, McFarlane was over it. He needed a break, or at the very least, something new. That’s when an opportunity presented itself. One day, while chatting with fellow Marvel artists Rob Liefeld and Erik Larsen, a simple idea dawned on them: What if we just made our own comics, together? “There were three of us who had the same general idea, but we were all going down our own separate tracks individually and emotionally,” McFarlane said. “Why are we talking about three different things that we’re going to do on our own? Why don’t we just do it together?” McFarlane knew what had happened to some of the great comics creators before him. And he knew he didn’t want to suffer the same fate. “I had been doing a lot of reading on the history of comics, and the one thing that became abundantly clear to me was that comic artists had been coming and going one at a time for decades,” he said. “It was easy to deal with one-in-one-out from a corporate perspective. If you look at it like a sports franchise, you look at it and go, ‘The Yankees may be able to live to tell about Derek Jeter not being there.’” Todd McFarlane and ‘Spider-Man’ editor Jim Salicrup (Courtesy Image Comics) “But what if Derek Jeter, Roger Clemens, Mariano Rivera, and whoever else all retired the same year? That’s an impact that has to now be taken seriously.” On February 1, 1992, seven of the most popular artists in comics — including McFarlane, Liefeld, and Larsen — said goodbye to Marvel to form a company of their own creation. It was called Image Comics. Today, Image is known as one of the industry’s most influential tastemakers and home to beloved titles like Saga, The Wicked + The Divine, and The Walking Dead. The founders’ gambit inspired a generation of writers and artists. Take it from Robert Kirkman, the creator of TWD: “I wouldn’t have ever created The Walking Dead if it wasn’t for Image Comics.” And if things had played out differently, Kirkman and his peers may not have even had a place to publish their work. Image’s story is rife with turmoil, befitting the medium it embraces. It was a harbinger of great disruption, triggering panic and tumult in an industry whose record sales belied its tenuous state. To reinvigorate comics over its 25 years, Image had to play a part in its darkest period. To understand Image’s impact, you need to know a little about the history of comics. Its past is littered with writers and artists frustrated by a lack of rights to and recognition for their work, from legends like Jerry Siegel and Joe Shuster (the creators of Superman) and Jack Kirby (the cocreator of Marvel characters such as Captain America, the Hulk, and the X-Men) to more recent examples like the team of Alan Moore and Dave Gibbons (the pair behind Watchmen). Writers and artists have spent decades creating for corporations without ownership to their name, despite being the foundation of the characters that prop up these media empires. They’re idea factories, and that’s led to comics creators being exploited to an extent that is unrivaled by other art forms. Historically, the vast majority of creators have stuck with Marvel or DC, the Coke and Pepsi of the industry. After all, that’s where the money and opportunity have always been. On occasion, someone like Neal Adams or Howard Chaykin would leave the Big Two to create comics on their own, but the steady paychecks and relative stability offered there ensured creators almost always found their way back. Comics publishers had built and funded a medium where the creations were exponentially more valuable than the creators, and that imbalance ensured that the power stayed on their side. “But then in the early 1990s,” said comics historian John Jackson Miller, “all the conditions had changed.” Printing and color technology became inexpensive and accessible enough that independent comics companies could publish products that looked as refined and professional as what Marvel and DC were making. The industry itself was booming, with speculators from the sports-card industry fueling immense sales of new titles. To top it all off, a new generation of superstar artists, led by X-Men’s Jim Lee, Spider-Man’s McFarlane, and X-Force’s Liefeld, were soaring into the stratosphere. The first issues of the aforementioned trio’s titles had set sales records in the early ’90s, with McFarlane’s Spider-Man No. 1 moving nearly 3.3 million copies, Liefeld’s X-Force No. 1 topping it at 3.5 million, and Lee’s X-Men No. 1 setting a world record with nearly 8.2 million copies ordered, per internal publisher data provided by Miller’s Comichron. “They were fucking monstrously popular,” said Brian Hibbs, the owner of San Francisco’s Comix Experience. “They were more popular than the characters themselves.” It wasn’t just their art, though. These artists were deemed cool in a way comics creators rarely were. Particularly Liefeld. “The first time people laid eyes on Rob Liefeld, they were like, ‘This is the new breed,’” said comics journalist Heidi MacDonald. To steal a comics phrase, Liefeld was the bizarro version of the average artist. A fit, tan, young guy who loved the Lakers and starred in a Spike Lee–directed Levi’s commercial, Liefeld was just 23 years old when X-Force No. 1 was released. His manic energy and atypical, self-taught style was emblematic of Image’s launch — it was both familiar and without precedent. Rob Liefeld (Courtesy Image Comics) “I was fearless about what to do,” said Liefeld, now 49. Unlike his peers, he didn’t have kids, and that emboldened him. “Comic books and creating comic books was my 100 percent obsession.” Arguably Liefeld’s greatest gift as a creator was his ability to develop new characters in a medium well known for playing back the hits. His work on Marvel titles New Mutants and X-Force was propelled by fan favorites of his, particularly a certain talkative mercenary named Deadpool. (Which he cocreated with writer Fabian Nicieza, and has since become a massively successful film starring Ryan Reynolds.) With a background in independent comics — he debuted his Image creation Youngblood in a comic from publisher Megaton Comics — he’d always intended to return to do his own thing once he reached a certain point. But his schedule accelerated when he received an unexpected call from his bosses. “[Marvel] called and told me the second line of X-Men toys was going to feature the X-Force characters,” said Liefeld. “I was like, ‘What are you talking about? You just launched a line of X-Men toys and you’re jumping 30 years of history and going right into mine?’” That was all the reason he needed to move toward authoring his own fate. Liefeld started doing just that at a dinner with Guardians of the Galaxy artist and writer Jim Valentino, Amazing Spider-Man artist Larsen, and Malibu Comics publisher Dave Olbrich at San Diego Comic-Con in 1991. “Rob asked Dave if he would publish a book by him,” Valentino said. “And Dave started laughing and said, ‘Yeah, of course.’ And he goes, ‘How about a book by Jim and Erik?,’ and Dave’s laughing and goes, ‘Yes, of course.’” Olbrich offered to publish anything they’d like to create. Liefeld took out an ad in the September edition of the Comics Buyer’s Guide, an industry paper. It was for a comic called The Executioners, with emphasis on the x. It was the first time the name “Image Comics” appeared in print. “Marvel kind of flipped the fuck out,” Larsen said. “[X-Men editor] Bob Harras read him the riot act,” said Valentino. “That he’d never work in comics again, that they would sue him if he was profiting off of the X-franchise. “It didn’t scare Rob, it just pissed him off.” At that point, Liefeld turned to the people he was closest to in comics — Larsen, Valentino, and McFarlane — with the plan to break away from Marvel. Larsen and Valentino were onboard immediately. McFarlane saw an opportunity to break the cycle that had felled many artists before him. “I remember having this epiphany, saying, ‘Man, if they can do that to Jack Kirby — The King! — they can do that to anybody,’” McFarlane said of Marvel’s treatment of one of its founding fathers. He was in, too. On the strength of that foursome, Liefeld and McFarlane ventured to New York for an auction of their original art and a meeting with Marvel to let them know they were out. Everything escalated when McFarlane ran into Lee at the auction. “I gave him the sales pitch. I go, ‘Here’s what we’re doing, here’s why we’re in town, and by the way, we’d love to have you, dude,’” McFarlane said. Jim Lee (Courtesy Image Comics) By day’s end, Jim Lee was in. This was when Image’s potential skyrocketed — even relative to the rest of his cohort, Lee was a superstar. He was the most popular artist on Marvel’s most popular franchise. Image without Lee would have been significant. With him, it was something more. “I thought Jim Lee was the moment, because at this point Rob and I were the renegades,” McFarlane said. “Of course the rebels are going to go into rebellion. It’s who [we] were.” “Jim Lee was the Golden Boy. He was the guy who followed and abided and was the perfect employee. And to me, he was the one who was going to send the loudest message,” McFarlane continued. “They thought he was content, they thought he was happy, and even he’s going.” With Lee onboard, four became five. He even planned to join Liefeld and McFarlane at the meeting with Marvel. The evening before the meeting, McFarlane ran into Wolverine artist Marc Silvestri. They happened to be staying in the same hotel, and McFarlane took the opportunity to give him the hard sell. By the next morning, five was six. Lee, Liefeld, and McFarlane met with Marvel to let them know that the artists of 44 of the 50 top-selling comics of 1991 were leaving to form their own company. “We were essentially the Dream Team,” McFarlane said. “So the Dream Team was about to walk out of the office, and of course it was going to have an impact.” While the events of the meeting with Marvel — which included Liefeld, Lee, McFarlane, his wife and newborn child, Marvel editor-in-chief Tom DeFalco, and Marvel president Terry Stewart — change depending on who tells the story, McFarlane insisted it was straightforward. “We just said, ‘We’re leaving, and here are a couple reasons why,’” McFarlane said. The part McFarlane said he will always remember, and one of the things that ensured his future as the Image founder who would never work for Marvel again, was what DeFalco said to Lee and McFarlane as they departed: If it doesn’t work, they were welcome back anytime. Marvel was skeptical about Image’s potential. McFarlane was taken aback. “‘Wow. He just thinks we’re dumbasses,’” McFarlane recalled thinking. “It was a bit of an insult.” In 1991, when a comics creator left Marvel, they’d head to DC for work, or vice versa. McFarlane didn’t want that to be the expectation, so after the Marvel meeting, McFarlane and Lee went to DC’s offices. While McFarlane had worked for DC in the past, Lee hadn’t. Because of that, “they thought they hit the mother lode,” McFarlane said. “We get into the meeting and we go, ‘By the way, we’re here to tell you the same thing. We’re not here to work for you, either,’” McFarlane said. “When we walked out of DC, that was day one of Image being official.” Then came the tricky part: The founders had to figure out what Image would be. Even though each had different reasons for the move, Image’s genesis came down to creative freedom and ownership — the ability for artists to control their own fate and get compensated the way they felt they deserved. “We all saw the mistakes that everybody else made before us and decided not to repeat them,” Valentino said. “We also set up the company in such a way that was favorable to us and therefore favorable to anyone else who came in. We had a very long view.” The first meeting of Image Comics commenced on February 1, 1992, at Silvestri’s Malibu home. This was when the seventh founder, Uncanny X-Men artist Whilce Portacio, joined the fray. While he wasn’t at the meeting in Malibu — he was in the Philippines at the time — Portacio was a friend of Lee’s, and one who everyone liked and respected. He was in. From there, the six attending founders decided two major things that day: (1) Image Comics would incorporate after a year with Malibu Comics — with whom they worked initially for infrastructure purposes — and (2) each of the partners would have complete autonomy, which included the ability to launch independent studios creating titles that would be published under the Image banner. This independence was essential to the publisher and its founders (although upon Image’s incorporation the next year, Portacio declined to become a partner in the business for personal reasons). In the same meeting, the six also agreed that the deal they were giving themselves — where the creators owned their creations — would be offered to others, too. “We created the company that we wanted to work for, a company that would respect creators and their creations,” Valentino said. “We wanted to create the anti-Marvel, the anti-DC, because it was the right thing to do.” When news of their move hit, the reaction was mixed. Some were surprised; others were angry. “I was really surprised at the news, as I think most people in comics were at the time,” said Karen Berger, then an editor at DC. “It was a really bold and audacious move.” “[My reaction] was complete and utter disbelief. It was so shocking that this would be happening,” comics journalist MacDonald said. “From [the] fans’ [perspective] it was almost entirely positive,” Larsen said, before adding that some considered them “traitors” for leaving Marvel. For the most part, however, fans were ecstatic. This meant original comics from some of the most exciting creators around and a new company whose heat in the industry rivaled, if not surpassed, Marvel’s and DC’s. The move defied decades of history, as the partners became even more popular by leaving the world’s greatest heroes behind. Valentino described it by saying the founders simply “changed jobs,” but this wasn’t just a lateral movement; it was the most shocking move in the history of the comics industry. In April 1992, Liefeld’s Youngblood launched to towering sales, with orders of its first issue topping 1 million copies. Image Comics was instantaneously a sensation. Each partner followed Liefeld with their own title in 1992. The first was McFarlane, the only founder whose first title — Spawn — was intended to be an ongoing series from the start. (According to Larsen, every other founder had planned to open with limited series in case the sales weren’t there.) Spawn was a character McFarlane had developed as a teenager, well before he had made it at Marvel. The series was about a demonic antihero who, after he was killed in a previous life, made a deal with a devil so he could see his wife again. It was a perfect showcase of what everyone loved about his art, minus the editorial oversight that surely would have reined in the dark subject matter. Fans ate it up, with the first issue selling 1.7 million copies, a previously unthinkable number for an independent comic starring an original character. The summer saw the launch of Larsen’s The Savage Dragon (featuring a character he created in elementary school that was first published at Megaton Comics), Valentino’s Shadowhawk, Lee’s WildC.A.T.s, and a second title from Liefeld (Brigade), with Silvestri’s Cyberforce and Supreme (a third title from Liefeld’s Extreme Studios) arriving by the end of the year. The first year also brought the first defection from Marvel to Image after the founders, with Incredible Hulk artist Dale Keown launching Pitt in January 1993. The company’s lineup was quickly filling up. Even better, each was a hit. Valentino said that every Image launch that first year sold more than half a million copies, which would have been a monster success for Marvel or DC. For a collective of renegade artists? “This was a phenomenon that does not really have a comparison you can make,” Comix Experience’s Hibbs said. “It was a movement for a lot of people.” “I just remember [saying] every day, ‘What’s going to happen today?’” Liefeld said. “We were a seismic wave of a cultural shift in the comic-book industry. You could feel it. It was exciting.” Liefeld wasn’t wrong. Malibu — powered by the Image titles — topped DC Comics in market share in August 1992 with just a fraction of DC’s releases. In that first year, Image had nine titles on limited runs, which managed to comprise 24 of the top-100 selling comics of the year. In fact, the only title that sold more than the highest-selling Image release in 1992 was Superman No. 75 — which famously featured the hero’s death. While events like Superman’s death or Batman being replaced after having his back broken by a new foe named Bane can’t definitively be tied to pressure from Image’s success, a major event series that DC announced shortly after Liefeld had launched Youngblood felt more reactionary. It was called Bloodlines, and it featured the publisher unleashing a legion of new Liefeldesque characters known as the New Bloods. Marvel, not to be left behind, doubled up its 1993 annuals, introducing its own wave of new characters and an Avengers and X-Men crossover event, titled Bloodties. Image was so hot that even Marvel and DC wanted to ride the wave the founders had created. While Image was designed to support the greatest comics artists and the finest storytellers, the launch lineup was filled with familiar ideas: Every title was a superhero book of sorts. That was by design, as the founders knew what their fans wanted. “It wasn’t our intention for the company to be a superhero company,” Valentino said. “It was our intention to compete with Marvel and DC.” The tactic worked. As Hibbs shared with me, Image titles like WildC.A.T.s were selling X-Men numbers in a time when Marvel’s franchise players were in their own stratosphere. In their efforts to put creators above characters, the Image founders managed to create characters that rivaled the medium’s biggest names (for a time). Everywhere they went, the Image founders were followed by adoring fans. Their signings were events of a size typically saved for rock stars, with 1992’s Chicago Comic-Con needing a special tent in its parking lot just to accommodate their tens of thousands of supporters. With Image’s success came rapid growth. Liefeld was the first to develop his own line of comics at his imprint, Extreme Studios, with Lee’s WildStorm Productions and Silvestri’s Top Cow Productions expanding their footprint shortly thereafter. Because of that, Image performed even better in 1993. Forty-one of the 100 best-selling comics that year featured Image’s unmistakable “i” icon on the cover. However, for new comics publishers, managing growth can be tricky. Image’s expansion led to the first cracks in its armor. “[Image] enthusiastically announced a lot of titles from outside creators right away in the summer of 1992, but that made it all the harder to keep books on time out of the gate,” Miller said. “A number of advertised books never came out at all.” “You can now argue our naïveté and the pennies raining down from heaven were some of the early undoings of what we did,” McFarlane said. “Because you go, ‘Oh my gosh, we don’t know what we’re doing, but we’re making money, and oh by the way, I have so much money, why do I need to work?’ “This is sort of the curse of anybody that is young. Don’t give them too much success too fast, because we don’t know what to do with it.” Larry Marder, a cartoonist who was renowned for his industry savvy, was brought on in 1993 as executive director to get Image’s house in order. But by then its scheduling issues were already having a significant impact on the industry. Tom Spurgeon, a comics historian who was just starting at industry magazine The Comics Journal at the time, said he’d heard Image described as “this giant toddler smashing things,” at least in part because its books were “so successful they were immediately off schedule.” At the time, there were no protections for retailers, according to Spurgeon. So if a book was off schedule, there was no recourse. Comics shops would pay for the product regardless of whether they would actually receive it on time. Eric Reynolds, now the associate publisher at Fantagraphics, was an editor at The Comics Journal at the time, and he said that Image’s actions had a massive domino effect within the industry. Image’s best-known and late-shipping titles would arrive months after the promised release date, tying up retailer budgets and then failing to sell once they finally arrived. “They single-handedly fucked up the cash flow of an entire industry and ruined a lot of retailers,” Reynolds said. As a retailer at the time, Hibbs had a front-row seat to this destructive period. “They didn’t know what they were doing when it came to publishing houses and they overcommitted and started putting out books later and later,” Hibbs said. “They started adding so many spinoffs that people didn’t want and doing everything we spent years criticizing Marvel and DC for. People tend to make the mistakes of the generation before without even realizing it.” Despite those struggles, Image was still moving huge numbers of units. It wasn’t just Image; the whole industry was. Until 1993. That’s when everything fell apart. In the years previous, comic-book distributors like Capital City Distribution and Diamond Comic Distributors — whose role was to circulate comics from publishers to retail stores — aided in expanding the market to more than 10,000 retail accounts. While this sounds like a good thing on the surface, many of these shops were undercapitalized and overextended. That growth, paired with a boom fueled by speculators buying up multiple copies of the hottest titles in hopes of a quick buck, meant the comics industry was in a bubble waiting to be burst. While indicators had been there since the early days of the publisher — a Barron’s story in February 1992 on Marvel’s unsold inventory problem mentioned the departure of the group that would found Image — it wasn’t until 1993 that the overexpansion of the industry led to massive store closures and publishers being forced to face reality. Those huge order numbers meant a sizable chunk of comics, including Image titles, were collecting dust across the country. With speculators leaving comics behind and the sales potential of the medium plummeting, the industry was in trouble. Publishers cut back their lines, which meant there were fewer comics for the remaining shops to sell, which eventually led to even more shops closing. The days of new Image titles launching with more than a million copies ordered were coming to a close. This culminated in widespread consolidation within the industry, including what pundits call the “distributor wars.” When Image launched, comics were distributed by a bevy of houses (including both Capital City and Diamond), allowing for competition. However, Marvel responded to Image’s success by buying its own distribution company — Heroes World — so it wouldn’t have to compete with DC and Image for space in distributor catalogs. That wasn’t the smartest play — as comics historian Spurgeon said, aligning national orders with a regional distributor was “not the best plan” — but the cascading moves it compelled DC and Image to make exacerbated the problem. While Marvel signed up with Heroes World, DC and fellow publisher Dark Horse Comics paired with Diamond Comics Distributors. At that point, Image was “in a very important position that could have kept so much consolidation from happening,” Reynolds said. “But instead [Image] somewhat cravenly took the path of least resistance by lining up behind DC and Dark Horse, despite positioning themselves as rebels and mavericks. Image was the tipping point in putting Capital City Distribution out of business, thereby ending the distributor wars and giving Diamond a de facto monopoly it still maintains.” The final straw in this dark period for Image came between 1996 and 1998, when two of the founders departed. First, Liefeld left amid controversy after he’d created a competitive comics company and was accused of attempting to poach talent from other Image studios. Then, Lee sold his studio — WildStorm — to DC Comics so he could focus on the creative side. Six became four. Image was fractured. “The thing that was hurting us the most isn’t that we lack the skills or we don’t have the ideas or we don’t know people who can help us. It’s just starting to treat Image like a real business and not letting it be a frat house,” McFarlane said. “We sort of got scared straight, more than anything else, because we saw not only was the industry deteriorating from the bubble bursting back in 1992 and 1993, [but] we were also exacerbating it by some of our own personal actions and some of our corporate actions.” “We [said], ‘Hey, if we don’t start acting a little more mature, then this may be a hard fall here,’” McFarlane said. “And none of us wanted the hard fall.” The remaining partners — Larsen, McFarlane, Silvestri, and Valentino — had to figure out how to recover, especially after Lee’s departure. His studio had been a huge part of Image’s lineup, and to ensure continued success and future potential, a void had to be filled. Make the wrong move and they’d become an impressive but ultimately fleeting footnote in comics history. Make the right one, and the potential was significant. In their recovery effort, the partners took on more active roles in ensuring Image’s success, with Valentino taking the lead as publisher in 1999. While the line had diversified beyond superheroes in its early years to include titles like Mike Grell’s mystical tale Shaman’s Tears and Colleen Doran’s space epic A Distant Soil, Valentino was displeased with risqué titles that pushed titillation above all else. He worked to rebuild Image’s line. “I told the guys, ‘Look, I’m going to have a scorched-earth policy,’” Valentino said. “‘We’re going to start all over because we can do better than that.’” While its sales paled in comparison with Image’s previous levels with Valentino as publisher, it was a different, smaller comics industry after the bubble burst. More importantly, with Valentino at the head of the company, Image preserved its place as the industry’s third-largest publisher — which was important to maintaining distribution deals — and started to bring fresh blood into the fold, including creators like Warren Ellis and Brian Michael Bendis. Robert Kirkman in 2012 (Jerod Harris/WireImage) Another who joined the ranks during Valentino’s time as publisher was Robert Kirkman, who is now arguably the most famous modern comic-book creator. While he’s a household name now thanks to the success of The Walking Dead, back in Image’s darkest days, he was “some rando writer from Rando Town, Kentucky,” as writer Joe Keatinge put it. (He was born in Lexington, Kentucky.) He’d always wanted to make comics for Image — Kirkman told me that when the founders departed from Marvel, it was one of the most influential moments of his life. “He’s kind of the child of Image,” Valentino said. While a few small projects put Kirkman in the building, a pair of books changed everything for him and signaled the beginning of Image’s return to being a key player in comics. The first was Invincible, a superhero comic he cocreated with Cory Walker before he and artist Ryan Ottley developed it into one of the longest-running — and consistently great — titles of Image’s line. The other, of course, was The Walking Dead. Kirkman pitched Image on The Walking Dead only after Invincible found its footing. But Valentino was unimpressed with the initial pitch. “He approached us with this zombie book that he was originally calling ‘World of the Zombies,’ and I was like, ‘Robert, that’s horrible,’” Valentino said. For this book to work, Valentino told Kirkman, it needed a hook. “So [Kirkman] said, ‘OK, the zombies are an alien invasion,’” Valentino told me. “And about three or four issues into it, Eric Stephenson [then Image’s director of sales and marketing] called him up and said, ‘So where’s the aliens?’” “Robert laughed and said, ‘There are no aliens. I just told you guys that so you would publish it,’” Valentino added with a laugh. Aliens or not, The Walking Dead — which started with Tony Moore as artist before Charlie Adlard took the reins on Issue no. 7 — became one of the most uncommon stories in comics: a title that started with low sales (fewer than 7,300 copies of its first printing were ordered, per estimates) and steadily increased until it became one of the industry’s top sellers. From there, the TV show launched and a media empire was formed, sending its sales into rarefied air. An issue that hits stores today is already the highest-selling single issue in nearly 20 years, thanks in part to its cover price of a quarter to honor Image’s anniversary. However, its collections are the series’ biggest revenue generator. These paperback and hardcover books bundle issues together in bulk so you can binge-read the series, perfect for crossover TV fans. Millions of the collections have been purchased, with the first compendium — at a cover price of $60 — estimated to have sold more than 450,000 copies as of the end of 2015. In recent years, The Walking Dead has had an annual market share as high as 2.5 percent of the total comic shop market by itself. It doesn’t stop there, of course. The Walking Dead is a phenomenon beyond comic-book racks. Even accounting for a recent ratings slide, its TV show is an enormous hit that draws in the largest audience in the coveted 18-to-49 demographic of any nonsports program, cable or network. The video game series developed by Telltale Games set in TWD’s world has earned massive acclaim and sales of more than 28 million as of 2014, with a third season launching this past December. While many of the original titles are well liked among fans, the deal that Image developed at its inception for its founders — and then passed on to others — is in many ways Image’s most lasting and impactful creation. Image itself takes only a flat dollar amount from each print comic it sells, while getting a fixed percentage from each collection or digital comic. That means the bulk of potential profits and all of the rights belong to the creators — the latter being a key difference-maker in this adaptation-loving era. If an Image comic becomes a movie or TV show — like The Walking Dead — the creators are the ones who reap the profits. That’s not to say Image doesn’t benefit from adaptations, as the success of a TV show like The Walking Dead can be a major boon to a comic series’ sales, particularly those of collections. While Image may not directly profit from the show, its indirect upside can be enormous. That structure results in a longer path to earning money and fewer guarantees of a job than from, say, Marvel or DC, but it also means significantly greater potential earnings for those willing to take the leap. It’s high-variance, but it’s an offer that can’t be beat, especially if you’re an established creator. “It’s the absolute best deal in comics,” Kirkman said. It’s not just the monetary rights that speak to creators. While every writer or artist I spoke to had worked with Marvel and/or DC, many touted the creative freedom that Image offered. It’s why creators like writer Kieron Gillen release passion projects at the place where they can most fully realize them. “If you could do anything, there’s the implication you should at least try to do something,” Gillen said. “If you’re not using that blank paper for something big, different, redefining, you’re somehow wasting it,” he said, before adding with a laugh, “but that’s my own personal bullshit.” Several people I spoke to shared that Image is where you can find the biggest talent in comics “with the brakes off,” as Gillen put it, and that’s a significant advantage. To be able to create, completely unfettered, is a dream for all artists. That’s different from working at Marvel or DC, where an important part of your role is as a caretaker of intellectual property. You can tell the stories you want with their characters, but only if it fits within their plans. Creating at Image, on the other hand, is closer to self-publishing than working at Marvel or DC. Yet this deal had been available for a long time before creators began migrating en masse to Image around 2009, so the question becomes, “What changed?” One of the biggest factors was Kirkman’s success, which has had an incalculable impact on the fate of Image, and not just because of the revenue it brought in when the company most needed it. The Walking Dead proved the Image model could work even if you weren’t a top star — that the right idea could be a million-dollar one. “You need this wedge product that is able to prove to people that it’s possible,” said MacDonald of The Walking Dead. “I just think it’s a matter of people seeing it works,” Larsen added. “That you can look at it and go, suddenly there’s this Robert Kirkman and he’s got this TV show and things are wonderful for him and he doesn’t seem to be getting screwed over.” Joe Keatinge said that his comic, Shutter (cocreated with Leila del Duca), wouldn’t be around if Kirkman hadn’t been there to hand off the baton. “Shutter can exist because the success of books like Sex Criminals, Fatale, Bitch Planet, and Saga opened up the doors for weird books by new creators to exist. Their doors got opened by Robert. His doors got opened by the founders,” Keatinge said. “You gotta keep opening those doors, man — Robert certainly has for me and many others.” In 2008, Kirkman’s relationship with Image was taken to another level when, despite having significant success working on for-hire projects, he left Marvel for good and became Image’s first new partner since the company had been founded. Shortly after that, Kirkman unleashed a video mission statement known as “The Kirkman Manifesto” on the comic industry. In the video, Kirkman suggests that comics creators should build up their names at Marvel or DC and then leave to find greater financial success creating their own work. This was the opposite of the typical career path in comics. Historically, writers and artists worked tirelessly on their own comics to become well known enough for Marvel or DC to hire them. Kirkman challenged this paradigm and encouraged creators to take full authorship. It was that kind of belief that inspired the partners to bring him onboard. Beyond admiring his work and his character, the Image founders saw a reflection of themselves, 16 years later. “He had given up a lucrative deal at Marvel, and both Marvel and DC were chasing after him at the time, and he was like, ‘No, I’m going to do this and I’m only going to do this,’” Valentino said. “That impressed us because that’s what we did.” For McFarlane, the biggest reason to add him to the mix was simple: Kirkman is a writer. Artists founded Image, and every writer they’d worked with had been unwilling to commit fully to the brand. “The writers, I kept telling them, ‘If you want your books to succeed, you have to quit Marvel and DC,’” McFarlane said. “They wouldn’t heed that simple rule.” To McFarlane, writers create competition against themselves if they don’t fully commit in one direction, hamstringing the potential of their own creations. “Robert not only figured [that] out on his own, he cut Marvel and DC out cold turkey as a writer. He was the first guy. I had been railing against this for what seemed like forever,” McFarlane said. “And all of a sudden there was this bright, shining light. Some writer was doing it on his own and was acting like an artist. He kept his skills all on his own books, so you now have to buy his books, not some corporation’s books.” While Liefeld was no longer a partner when Kirkman was elevated, he believes Kirkman’s ascent has been essential to Image’s rise, touting The Walking Dead as Image’s own version of Batman or The Avengers. “Image Comics exists in the form it does today because of Robert Kirkman and everything he’s done,” Liefeld said. “You cannot have a discussion about Image Comics, from about 2008 to present, that does not involve his success carrying the company and giving it a new foundation to build on, [which] allows Eric Stephenson to make the moves he makes.” Stephenson is the other catalyst in Image’s rise over the past decade. While he has been at Image since 1992 — he was a writer and editor at Liefeld’s Extreme Studios before joining Image as director of sales and marketing in 2001 — his promotion to publisher in 2008 has been essential to the company’s success. “Robert is the right hand,” said Liefeld. “Eric is the left hand.” “Eric Stephenson isn’t one important aspect to Image’s present success in terms of how the company’s run,” Keatinge said. “He’s the aspect to Image’s present success in terms of how the company’s run.” “His contributions have been incalculable,” added Valentino. Kirkman’s success was a bellwether for the potential of the Image approach, but it had existed for more than a decade and a half by the time Stephenson had taken over. They needed someone who wouldn’t just convey the value of the deal, but help creators find the potential of their strongest ideas. Spurgeon believes a big part of Stephenson’s ability to do that relied on the fact he wasn’t a creator or a businessman: He was both. “I think the overall quality of the line is higher than it’s ever been and I think that is because of Eric. I think it’s [because] he can wear both hats,” Spurgeon said. “That’s hugely valuable.” Stephenson and Kirkman work closely, and the latter clearly has great admiration for the former and the way he helps creators find the best version of their own work. Stephenson’s method for doing so is simple, according to Kirkman. “The real heart of what Eric Stephenson does, and this is a story I tell people a lot, he’ll talk to a big creator and they’ll call him up and be like, ‘What book are you looking for Eric? What would Image want from me?,’” Kirkman said. “And his answer is always, ‘I want the book that you want to do.’” “He’s not looking for something specific. There’s not a specific genre that he’s trying to service. He’s not a television network saying, ‘Well, sci-fi shows are popular.’ That’s not how Eric Stephenson works.” Since Stephenson became publisher, Image has launched exciting and unexpected titles that have won awards and been best sellers with concepts that likely wouldn’t have gotten published at such a scale in years past. Comics like Chew, from writer John Layman and artist Rob Guillory, which tells the story of an FDA agent who receives psychic impressions from what he eats as he deals with life after a bird flu epidemic killed millions. Or Sex Criminals, Matt Fraction and Chip Zdarsky’s comic about a couple who can stop time when they orgasm and use said powers to rob banks. Image doesn’t exactly publish Superman. “The way you get books like that is by looking at what’s not happening in the marketplace, the niches that aren’t being filled,” Stephenson said, “and big-picture, that’s the only way we’ll ultimately grow our industry, because just giving people the same thing over and over again is going to appeal to fewer and fewer readers as time goes on.” No comic showcases that mentality better than Saga, a space epic by writer Brian K. Vaughan and artist Fiona Staples. While it was certain to garner plenty of attention as Vaughan’s return to comics — after wrapping titles like Y: The Last Man and Ex Machina, he worked in TV for several years as a writer for Lost and the executive producer on Under the Dome’s first season — readers quickly made it Vaughan’s and Staples’s biggest hit to date. Saga won three consecutive Eisner Awards, the comic-book world’s Oscars, for Best Continuing Series from 2013 to 2015, as well as individual wins for Vaughan and Staples. The title, which could be described as a marriage between Star Wars and Romeo and Juliet, isn’t just a good comic, though. Its diverse cast and progressive themes helped it fill some of the niches Stephenson spoke of, making it both the symbol of Image’s success and the changing face of comics. In recent years, readership has evolved, with digital comics giant ComiXology revealing in 2013 that the fastest-growing segment of readers were 17-to-26-year-old women who were newer to comics. As MacDonald said, “Saga really appealed to this influx of female readers,” and the results have been stunning. The title has generated sales that rival The Walking Dead without a movie or TV deal in sight. In the comics industry of yesteryear, certain markets were massively underserved. Saga’s arrival was a shining example that readers of all types would respond if given something that speaks to them. Liefeld calls Stephenson a “tastemaker,” and he’s proved that with the titles published under his watch. “I think he’s really transformed Image into the safe haven it’s become for the best and brightest of the current generation,” Kirkman said. Despite a tumultuous run-up to the milestone, 25 years later Image Comics is — in the words of Hibbs — “probably the most vital [comics] publisher we have.” “I don’t think anyone else would have been able to help Fiona and me reach as large an audience as we did, while still giving us total creative freedom and true ownership of our characters,” Vaughan said. Very little is the same since Image launched, but the one constant has been the deal the founders created 25 years ago. It’s what helped them make it through their most challenging period. And it all comes back to what the founders were looking for themselves: true economic and creative freedom. “Image is the best comic company in the world because the emphasis is in the right place,” writer Jonathan Hickman said. Not only have creators flocked to the publisher to develop some of the medium’s most beloved titles, but Image’s place in the market has improved as well. The industry has made a huge recovery in recent years — according to Comichron, it has increased in value from a low of $255 million to $275 million in 2000 to $940 million in 2015 — and Image has seen its market share grow from under 3 percent in terms of total dollars in June 2009 to nearly 9 percent in December 2016. It’s a dramatic turnaround that has firmly entrenched Image in a familiar spot as the third-largest North American comics publisher. Of the original founders, only Larsen, McFarlane, Silvestri, and Valentino remain. As partners, they’re important to determining the overall direction of the company. Both McFarlane’s Spawn and Larsen’s Savage Dragon are still being published, with Larsen still creating every aspect of the book — just like he was in 1992. Lee is now the copublisher of DC Entertainment. Liefeld mended his relationship with Image with the help of Kirkman and is developing a new era for his Extreme Universe there, building off of a recent reported seven-figure movie deal. Portacio still resides on the creative side, working on projects for Marvel, DC, and Image over the years. Even the company itself recently relocated from the Bay Area to Portland, Oregon. Image has fulfilled the promise it had when it first started, even if took an unexpected path to getting there. “I remember I went to one of the Image Expos [a yearly event Image holds to announce new titles] and one of the things that struck me as interesting and a little bit of a mixed bag because we all have our egos, [was realizing], ‘Wow, this whole room is about Image. If I wasn’t here, it would still be exactly the same,’” McFarlane said. “I’m not saying that what we did at the beginning in 1992 as a group didn’t start the ball rolling. It’s just the ball is rolling pretty good right now, and it doesn’t need any big pushes from the original founders now. “My greatest sense of pride is we’re still here 25 years later.” An earlier version of this piece incorrectly stated that Battle Pope was Robert Kirkman’s first project for Image Comics; that reference has been removed. Also, the piece inaccurately stated that the company takes a fixed percentage from each comic and collection it sells; Image takes a flat dollar amount from each comic it sells, and a fixed percentage from each collection or digital comic. ", "title": "The House of ‘The Walking Dead’", "sentences": [{"48f4": "The House of ‘The Walking Dead’"}, {"c9a8": "Twenty-five years ago, seven acclaimed artists ditched their Marvel overlords and started a comic-book rebellion. They called it Image, and it rewrote the industry playbook. This is how the founders revolutionized an industry and launched a new generation of stars and ‘The Walking Dead’ juggernaut."}, {"b280": "Todd McFarlane was tired."}, {"a0cb": "It was 1991, and the superstar comic-book artist was at the peak of his powers. In the year prior, McFarlane had launched a new Spider-Man title — simply called Spider-Man — that would sell more than 2.5 million copies for Marvel Comics. But he didn’t have the respect from his editors that he thought he deserved. His days were filled with “silly mini-confrontations” with Marvel over the direction of the book, and with his first child on the way, McFarlane was over it. He needed a break, or at the very least, something new. That’s when an opportunity presented itself. One day, while chatting with fellow Marvel artists Rob Liefeld and Erik Larsen, a simple idea dawned on them: What if we just made our own comics, together?"}, {"f907": "“There were three of us who had the same general idea, but we were all going down our own separate tracks individually and emotionally,” McFarlane said. “Why are we talking about three different things that we’re going to do on our own? Why don’t we just do it together?”"}, {"089c": "McFarlane knew what had happened to some of the great comics creators before him. And he knew he didn’t want to suffer the same fate."}, {"47f7": "“I had been doing a lot of reading on the history of comics, and the one thing that became abundantly clear to me was that comic artists had been coming and going one at a time for decades,” he said. “It was easy to deal with one-in-one-out from a corporate perspective. If you look at it like a sports franchise, you look at it and go, ‘The Yankees may be able to live to tell about Derek Jeter not being there.’”"}, {"315c": "Todd McFarlane and ‘Spider-Man’ editor Jim Salicrup (Courtesy Image Comics)"}, {"dde5": "“But what if Derek Jeter, Roger Clemens, Mariano Rivera, and whoever else all retired the same year? That’s an impact that has to now be taken seriously.”"}, {"c6c1": "On February 1, 1992, seven of the most popular artists in comics — including McFarlane, Liefeld, and Larsen — said goodbye to Marvel to form a company of their own creation. It was called Image Comics."}, {"ae1a": "Today, Image is known as one of the industry’s most influential tastemakers and home to beloved titles like Saga, The Wicked + The Divine, and The Walking Dead. The founders’ gambit inspired a generation of writers and artists. Take it from Robert Kirkman, the creator of TWD: “I wouldn’t have ever created The Walking Dead if it wasn’t for Image Comics.”"}, {"c89e": "And if things had played out differently, Kirkman and his peers may not have even had a place to publish their work. Image’s story is rife with turmoil, befitting the medium it embraces. It was a harbinger of great disruption, triggering panic and tumult in an industry whose record sales belied its tenuous state. To reinvigorate comics over its 25 years, Image had to play a part in its darkest period."}, {"37d8": "To understand Image’s impact, you need to know a little about the history of comics. Its past is littered with writers and artists frustrated by a lack of rights to and recognition for their work, from legends like Jerry Siegel and Joe Shuster (the creators of Superman) and Jack Kirby (the cocreator of Marvel characters such as Captain America, the Hulk, and the X-Men) to more recent examples like the team of Alan Moore and Dave Gibbons (the pair behind Watchmen)."}, {"449e": "Writers and artists have spent decades creating for corporations without ownership to their name, despite being the foundation of the characters that prop up these media empires. They’re idea factories, and that’s led to comics creators being exploited to an extent that is unrivaled by other art forms."}, {"be05": "Historically, the vast majority of creators have stuck with Marvel or DC, the Coke and Pepsi of the industry. After all, that’s where the money and opportunity have always been. On occasion, someone like Neal Adams or Howard Chaykin would leave the Big Two to create comics on their own, but the steady paychecks and relative stability offered there ensured creators almost always found their way back. Comics publishers had built and funded a medium where the creations were exponentially more valuable than the creators, and that imbalance ensured that the power stayed on their side."}, {"d3e6": "“But then in the early 1990s,” said comics historian John Jackson Miller, “all the conditions had changed.”"}, {"8ba2": "Printing and color technology became inexpensive and accessible enough that independent comics companies could publish products that looked as refined and professional as what Marvel and DC were making. The industry itself was booming, with speculators from the sports-card industry fueling immense sales of new titles. To top it all off, a new generation of superstar artists, led by X-Men’s Jim Lee, Spider-Man’s McFarlane, and X-Force’s Liefeld, were soaring into the stratosphere."}, {"4e0f": "The first issues of the aforementioned trio’s titles had set sales records in the early ’90s, with McFarlane’s Spider-Man No. 1 moving nearly 3.3 million copies, Liefeld’s X-Force No. 1 topping it at 3.5 million, and Lee’s X-Men No. 1 setting a world record with nearly 8.2 million copies ordered, per internal publisher data provided by Miller’s Comichron."}, {"430d": "“They were fucking monstrously popular,” said Brian Hibbs, the owner of San Francisco’s Comix Experience. “They were more popular than the characters themselves.”"}, {"0fe6": "It wasn’t just their art, though. These artists were deemed cool in a way comics creators rarely were. Particularly Liefeld."}, {"4a73": "“The first time people laid eyes on Rob Liefeld, they were like, ‘This is the new breed,’” said comics journalist Heidi MacDonald."}, {"777b": "To steal a comics phrase, Liefeld was the bizarro version of the average artist. A fit, tan, young guy who loved the Lakers and starred in a Spike Lee–directed Levi’s commercial, Liefeld was just 23 years old when X-Force No. 1 was released. His manic energy and atypical, self-taught style was emblematic of Image’s launch — it was both familiar and without precedent."}, {"43f0": "Rob Liefeld (Courtesy Image Comics)"}, {"26ba": "“I was fearless about what to do,” said Liefeld, now 49. Unlike his peers, he didn’t have kids, and that emboldened him. “Comic books and creating comic books was my 100 percent obsession.”"}, {"eb67": "Arguably Liefeld’s greatest gift as a creator was his ability to develop new characters in a medium well known for playing back the hits. His work on Marvel titles New Mutants and X-Force was propelled by fan favorites of his, particularly a certain talkative mercenary named Deadpool. (Which he cocreated with writer Fabian Nicieza, and has since become a massively successful film starring Ryan Reynolds.) With a background in independent comics — he debuted his Image creation Youngblood in a comic from publisher Megaton Comics — he’d always intended to return to do his own thing once he reached a certain point. But his schedule accelerated when he received an unexpected call from his bosses."}, {"5249": "“[Marvel] called and told me the second line of X-Men toys was going to feature the X-Force characters,” said Liefeld. “I was like, ‘What are you talking about? You just launched a line of X-Men toys and you’re jumping 30 years of history and going right into mine?’” That was all the reason he needed to move toward authoring his own fate."}, {"cd2a": "Liefeld started doing just that at a dinner with Guardians of the Galaxy artist and writer Jim Valentino, Amazing Spider-Man artist Larsen, and Malibu Comics publisher Dave Olbrich at San Diego Comic-Con in 1991."}, {"db12": "“Rob asked Dave if he would publish a book by him,” Valentino said. “And Dave started laughing and said, ‘Yeah, of course.’ And he goes, ‘How about a book by Jim and Erik?,’ and Dave’s laughing and goes, ‘Yes, of course.’” Olbrich offered to publish anything they’d like to create."}, {"6bcf": "Liefeld took out an ad in the September edition of the Comics Buyer’s Guide, an industry paper. It was for a comic called The Executioners, with emphasis on the x. It was the first time the name “Image Comics” appeared in print."}, {"ae43": "“Marvel kind of flipped the fuck out,” Larsen said."}, {"3411": "“[X-Men editor] Bob Harras read him the riot act,” said Valentino. “That he’d never work in comics again, that they would sue him if he was profiting off of the X-franchise."}, {"b74b": "“It didn’t scare Rob, it just pissed him off.”"}, {"929f": "At that point, Liefeld turned to the people he was closest to in comics — Larsen, Valentino, and McFarlane — with the plan to break away from Marvel. Larsen and Valentino were onboard immediately. McFarlane saw an opportunity to break the cycle that had felled many artists before him."}, {"7bc6": "“I remember having this epiphany, saying, ‘Man, if they can do that to Jack Kirby — The King! — they can do that to anybody,’” McFarlane said of Marvel’s treatment of one of its founding fathers. He was in, too."}, {"5e2e": "On the strength of that foursome, Liefeld and McFarlane ventured to New York for an auction of their original art and a meeting with Marvel to let them know they were out. Everything escalated when McFarlane ran into Lee at the auction."}, {"6743": "“I gave him the sales pitch. I go, ‘Here’s what we’re doing, here’s why we’re in town, and by the way, we’d love to have you, dude,’” McFarlane said."}, {"d024": "Jim Lee (Courtesy Image Comics)"}, {"ac83": "By day’s end, Jim Lee was in."}, {"e639": "This was when Image’s potential skyrocketed — even relative to the rest of his cohort, Lee was a superstar. He was the most popular artist on Marvel’s most popular franchise. Image without Lee would have been significant. With him, it was something more."}, {"5731": "“I thought Jim Lee was the moment, because at this point Rob and I were the renegades,” McFarlane said. “Of course the rebels are going to go into rebellion. It’s who [we] were.”"}, {"6e69": "“Jim Lee was the Golden Boy. He was the guy who followed and abided and was the perfect employee. And to me, he was the one who was going to send the loudest message,” McFarlane continued. “They thought he was content, they thought he was happy, and even he’s going.”"}, {"cd14": "With Lee onboard, four became five. He even planned to join Liefeld and McFarlane at the meeting with Marvel."}, {"8b47": "The evening before the meeting, McFarlane ran into Wolverine artist Marc Silvestri. They happened to be staying in the same hotel, and McFarlane took the opportunity to give him the hard sell. By the next morning, five was six. Lee, Liefeld, and McFarlane met with Marvel to let them know that the artists of 44 of the 50 top-selling comics of 1991 were leaving to form their own company."}, {"a797": "“We were essentially the Dream Team,” McFarlane said. “So the Dream Team was about to walk out of the office, and of course it was going to have an impact.”"}, {"8d2d": "While the events of the meeting with Marvel — which included Liefeld, Lee, McFarlane, his wife and newborn child, Marvel editor-in-chief Tom DeFalco, and Marvel president Terry Stewart — change depending on who tells the story, McFarlane insisted it was straightforward."}, {"1e7e": "“We just said, ‘We’re leaving, and here are a couple reasons why,’” McFarlane said."}, {"f511": "The part McFarlane said he will always remember, and one of the things that ensured his future as the Image founder who would never work for Marvel again, was what DeFalco said to Lee and McFarlane as they departed: If it doesn’t work, they were welcome back anytime. Marvel was skeptical about Image’s potential. McFarlane was taken aback."}, {"b54b": "“‘Wow. He just thinks we’re dumbasses,’” McFarlane recalled thinking. “It was a bit of an insult.”"}, {"7812": "In 1991, when a comics creator left Marvel, they’d head to DC for work, or vice versa. McFarlane didn’t want that to be the expectation, so after the Marvel meeting, McFarlane and Lee went to DC’s offices. While McFarlane had worked for DC in the past, Lee hadn’t. Because of that, “they thought they hit the mother lode,” McFarlane said."}, {"89ff": "“We get into the meeting and we go, ‘By the way, we’re here to tell you the same thing. We’re not here to work for you, either,’” McFarlane said. “When we walked out of DC, that was day one of Image being official.”"}, {"cbf7": "Then came the tricky part: The founders had to figure out what Image would be. Even though each had different reasons for the move, Image’s genesis came down to creative freedom and ownership — the ability for artists to control their own fate and get compensated the way they felt they deserved."}, {"b582": "“We all saw the mistakes that everybody else made before us and decided not to repeat them,” Valentino said. “We also set up the company in such a way that was favorable to us and therefore favorable to anyone else who came in. We had a very long view.”"}, {"42ed": "The first meeting of Image Comics commenced on February 1, 1992, at Silvestri’s Malibu home. This was when the seventh founder, Uncanny X-Men artist Whilce Portacio, joined the fray. While he wasn’t at the meeting in Malibu — he was in the Philippines at the time — Portacio was a friend of Lee’s, and one who everyone liked and respected. He was in."}, {"09d3": "From there, the six attending founders decided two major things that day: (1) Image Comics would incorporate after a year with Malibu Comics — with whom they worked initially for infrastructure purposes — and (2) each of the partners would have complete autonomy, which included the ability to launch independent studios creating titles that would be published under the Image banner. This independence was essential to the publisher and its founders (although upon Image’s incorporation the next year, Portacio declined to become a partner in the business for personal reasons)."}, {"66d7": "In the same meeting, the six also agreed that the deal they were giving themselves — where the creators owned their creations — would be offered to others, too."}, {"e88a": "“We created the company that we wanted to work for, a company that would respect creators and their creations,” Valentino said. “We wanted to create the anti-Marvel, the anti-DC, because it was the right thing to do.”"}, {"7175": "When news of their move hit, the reaction was mixed. Some were surprised; others were angry."}, {"0a9e": "“I was really surprised at the news, as I think most people in comics were at the time,” said Karen Berger, then an editor at DC. “It was a really bold and audacious move.”"}, {"baf8": "“[My reaction] was complete and utter disbelief. It was so shocking that this would be happening,” comics journalist MacDonald said."}, {"cb48": "“From [the] fans’ [perspective] it was almost entirely positive,” Larsen said, before adding that some considered them “traitors” for leaving Marvel. For the most part, however, fans were ecstatic. This meant original comics from some of the most exciting creators around and a new company whose heat in the industry rivaled, if not surpassed, Marvel’s and DC’s. The move defied decades of history, as the partners became even more popular by leaving the world’s greatest heroes behind."}, {"435e": "Valentino described it by saying the founders simply “changed jobs,” but this wasn’t just a lateral movement; it was the most shocking move in the history of the comics industry."}, {"b6f0": "In April 1992, Liefeld’s Youngblood launched to towering sales, with orders of its first issue topping 1 million copies. Image Comics was instantaneously a sensation."}, {"715a": "Each partner followed Liefeld with their own title in 1992. The first was McFarlane, the only founder whose first title — Spawn — was intended to be an ongoing series from the start. (According to Larsen, every other founder had planned to open with limited series in case the sales weren’t there.)"}, {"ec67": "Spawn was a character McFarlane had developed as a teenager, well before he had made it at Marvel. The series was about a demonic antihero who, after he was killed in a previous life, made a deal with a devil so he could see his wife again. It was a perfect showcase of what everyone loved about his art, minus the editorial oversight that surely would have reined in the dark subject matter. Fans ate it up, with the first issue selling 1.7 million copies, a previously unthinkable number for an independent comic starring an original character."}, {"4fd7": "The summer saw the launch of Larsen’s The Savage Dragon (featuring a character he created in elementary school that was first published at Megaton Comics), Valentino’s Shadowhawk, Lee’s WildC.A.T.s, and a second title from Liefeld (Brigade), with Silvestri’s Cyberforce and Supreme (a third title from Liefeld’s Extreme Studios) arriving by the end of the year. The first year also brought the first defection from Marvel to Image after the founders, with Incredible Hulk artist Dale Keown launching Pitt in January 1993. The company’s lineup was quickly filling up."}, {"4583": "Even better, each was a hit. Valentino said that every Image launch that first year sold more than half a million copies, which would have been a monster success for Marvel or DC. For a collective of renegade artists?"}, {"67f0": "“This was a phenomenon that does not really have a comparison you can make,” Comix Experience’s Hibbs said. “It was a movement for a lot of people.”"}, {"9abd": "“I just remember [saying] every day, ‘What’s going to happen today?’” Liefeld said. “We were a seismic wave of a cultural shift in the comic-book industry. You could feel it. It was exciting.”"}, {"e182": "Liefeld wasn’t wrong. Malibu — powered by the Image titles — topped DC Comics in market share in August 1992 with just a fraction of DC’s releases. In that first year, Image had nine titles on limited runs, which managed to comprise 24 of the top-100 selling comics of the year. In fact, the only title that sold more than the highest-selling Image release in 1992 was Superman No. 75 — which famously featured the hero’s death."}, {"8425": "While events like Superman’s death or Batman being replaced after having his back broken by a new foe named Bane can’t definitively be tied to pressure from Image’s success, a major event series that DC announced shortly after Liefeld had launched Youngblood felt more reactionary. It was called Bloodlines, and it featured the publisher unleashing a legion of new Liefeldesque characters known as the New Bloods. Marvel, not to be left behind, doubled up its 1993 annuals, introducing its own wave of new characters and an Avengers and X-Men crossover event, titled Bloodties. Image was so hot that even Marvel and DC wanted to ride the wave the founders had created."}, {"6be7": "While Image was designed to support the greatest comics artists and the finest storytellers, the launch lineup was filled with familiar ideas: Every title was a superhero book of sorts. That was by design, as the founders knew what their fans wanted."}, {"17c5": "“It wasn’t our intention for the company to be a superhero company,” Valentino said. “It was our intention to compete with Marvel and DC.”"}, {"4bcc": "The tactic worked. As Hibbs shared with me, Image titles like WildC.A.T.s were selling X-Men numbers in a time when Marvel’s franchise players were in their own stratosphere. In their efforts to put creators above characters, the Image founders managed to create characters that rivaled the medium’s biggest names (for a time)."}, {"471c": "Everywhere they went, the Image founders were followed by adoring fans. Their signings were events of a size typically saved for rock stars, with 1992’s Chicago Comic-Con needing a special tent in its parking lot just to accommodate their tens of thousands of supporters."}, {"cdcd": "With Image’s success came rapid growth. Liefeld was the first to develop his own line of comics at his imprint, Extreme Studios, with Lee’s WildStorm Productions and Silvestri’s Top Cow Productions expanding their footprint shortly thereafter. Because of that, Image performed even better in 1993. Forty-one of the 100 best-selling comics that year featured Image’s unmistakable “i” icon on the cover."}, {"854d": "However, for new comics publishers, managing growth can be tricky. Image’s expansion led to the first cracks in its armor."}, {"dd81": "“[Image] enthusiastically announced a lot of titles from outside creators right away in the summer of 1992, but that made it all the harder to keep books on time out of the gate,” Miller said. “A number of advertised books never came out at all.”"}, {"1688": "“You can now argue our naïveté and the pennies raining down from heaven were some of the early undoings of what we did,” McFarlane said. “Because you go, ‘Oh my gosh, we don’t know what we’re doing, but we’re making money, and oh by the way, I have so much money, why do I need to work?’"}, {"d756": "“This is sort of the curse of anybody that is young. Don’t give them too much success too fast, because we don’t know what to do with it.”"}, {"2fcf": "Larry Marder, a cartoonist who was renowned for his industry savvy, was brought on in 1993 as executive director to get Image’s house in order. But by then its scheduling issues were already having a significant impact on the industry."}, {"411c": "Tom Spurgeon, a comics historian who was just starting at industry magazine The Comics Journal at the time, said he’d heard Image described as “this giant toddler smashing things,” at least in part because its books were “so successful they were immediately off schedule.” At the time, there were no protections for retailers, according to Spurgeon. So if a book was off schedule, there was no recourse. Comics shops would pay for the product regardless of whether they would actually receive it on time."}, {"48d8": "Eric Reynolds, now the associate publisher at Fantagraphics, was an editor at The Comics Journal at the time, and he said that Image’s actions had a massive domino effect within the industry. Image’s best-known and late-shipping titles would arrive months after the promised release date, tying up retailer budgets and then failing to sell once they finally arrived."}, {"7206": "“They single-handedly fucked up the cash flow of an entire industry and ruined a lot of retailers,” Reynolds said."}, {"d022": "As a retailer at the time, Hibbs had a front-row seat to this destructive period."}, {"3918": "“They didn’t know what they were doing when it came to publishing houses and they overcommitted and started putting out books later and later,” Hibbs said. “They started adding so many spinoffs that people didn’t want and doing everything we spent years criticizing Marvel and DC for. People tend to make the mistakes of the generation before without even realizing it.”"}, {"6781": "Despite those struggles, Image was still moving huge numbers of units. It wasn’t just Image; the whole industry was. Until 1993. That’s when everything fell apart."}, {"067a": "In the years previous, comic-book distributors like Capital City Distribution and Diamond Comic Distributors — whose role was to circulate comics from publishers to retail stores — aided in expanding the market to more than 10,000 retail accounts. While this sounds like a good thing on the surface, many of these shops were undercapitalized and overextended. That growth, paired with a boom fueled by speculators buying up multiple copies of the hottest titles in hopes of a quick buck, meant the comics industry was in a bubble waiting to be burst."}, {"21c8": "While indicators had been there since the early days of the publisher — a Barron’s story in February 1992 on Marvel’s unsold inventory problem mentioned the departure of the group that would found Image — it wasn’t until 1993 that the overexpansion of the industry led to massive store closures and publishers being forced to face reality. Those huge order numbers meant a sizable chunk of comics, including Image titles, were collecting dust across the country."}, {"9484": "With speculators leaving comics behind and the sales potential of the medium plummeting, the industry was in trouble. Publishers cut back their lines, which meant there were fewer comics for the remaining shops to sell, which eventually led to even more shops closing. The days of new Image titles launching with more than a million copies ordered were coming to a close."}, {"f476": "This culminated in widespread consolidation within the industry, including what pundits call the “distributor wars.” When Image launched, comics were distributed by a bevy of houses (including both Capital City and Diamond), allowing for competition. However, Marvel responded to Image’s success by buying its own distribution company — Heroes World — so it wouldn’t have to compete with DC and Image for space in distributor catalogs. That wasn’t the smartest play — as comics historian Spurgeon said, aligning national orders with a regional distributor was “not the best plan” — but the cascading moves it compelled DC and Image to make exacerbated the problem."}, {"8797": "While Marvel signed up with Heroes World, DC and fellow publisher Dark Horse Comics paired with Diamond Comics Distributors. At that point, Image was “in a very important position that could have kept so much consolidation from happening,” Reynolds said. “But instead [Image] somewhat cravenly took the path of least resistance by lining up behind DC and Dark Horse, despite positioning themselves as rebels and mavericks. Image was the tipping point in putting Capital City Distribution out of business, thereby ending the distributor wars and giving Diamond a de facto monopoly it still maintains.”"}, {"f418": "The final straw in this dark period for Image came between 1996 and 1998, when two of the founders departed. First, Liefeld left amid controversy after he’d created a competitive comics company and was accused of attempting to poach talent from other Image studios. Then, Lee sold his studio — WildStorm — to DC Comics so he could focus on the creative side. Six became four. Image was fractured."}, {"c041": "“The thing that was hurting us the most isn’t that we lack the skills or we don’t have the ideas or we don’t know people who can help us. It’s just starting to treat Image like a real business and not letting it be a frat house,” McFarlane said. “We sort of got scared straight, more than anything else, because we saw not only was the industry deteriorating from the bubble bursting back in 1992 and 1993, [but] we were also exacerbating it by some of our own personal actions and some of our corporate actions.”"}, {"33cc": "“We [said], ‘Hey, if we don’t start acting a little more mature, then this may be a hard fall here,’” McFarlane said. “And none of us wanted the hard fall.”"}, {"d4c8": "The remaining partners — Larsen, McFarlane, Silvestri, and Valentino — had to figure out how to recover, especially after Lee’s departure. His studio had been a huge part of Image’s lineup, and to ensure continued success and future potential, a void had to be filled. Make the wrong move and they’d become an impressive but ultimately fleeting footnote in comics history. Make the right one, and the potential was significant."}, {"79e3": "In their recovery effort, the partners took on more active roles in ensuring Image’s success, with Valentino taking the lead as publisher in 1999. While the line had diversified beyond superheroes in its early years to include titles like Mike Grell’s mystical tale Shaman’s Tears and Colleen Doran’s space epic A Distant Soil, Valentino was displeased with risqué titles that pushed titillation above all else. He worked to rebuild Image’s line."}, {"7189": "“I told the guys, ‘Look, I’m going to have a scorched-earth policy,’” Valentino said. “‘We’re going to start all over because we can do better than that.’”"}, {"4f0c": "While its sales paled in comparison with Image’s previous levels with Valentino as publisher, it was a different, smaller comics industry after the bubble burst. More importantly, with Valentino at the head of the company, Image preserved its place as the industry’s third-largest publisher — which was important to maintaining distribution deals — and started to bring fresh blood into the fold, including creators like Warren Ellis and Brian Michael Bendis."}, {"13f3": "Robert Kirkman in 2012 (Jerod Harris/WireImage)"}, {"8a03": "Another who joined the ranks during Valentino’s time as publisher was Robert Kirkman, who is now arguably the most famous modern comic-book creator. While he’s a household name now thanks to the success of The Walking Dead, back in Image’s darkest days, he was “some rando writer from Rando Town, Kentucky,” as writer Joe Keatinge put it. (He was born in Lexington, Kentucky.) He’d always wanted to make comics for Image — Kirkman told me that when the founders departed from Marvel, it was one of the most influential moments of his life."}, {"5926": "“He’s kind of the child of Image,” Valentino said."}, {"e531": "While a few small projects put Kirkman in the building, a pair of books changed everything for him and signaled the beginning of Image’s return to being a key player in comics. The first was Invincible, a superhero comic he cocreated with Cory Walker before he and artist Ryan Ottley developed it into one of the longest-running — and consistently great — titles of Image’s line. The other, of course, was The Walking Dead."}, {"c2e8": "Kirkman pitched Image on The Walking Dead only after Invincible found its footing. But Valentino was unimpressed with the initial pitch."}, {"a091": "“He approached us with this zombie book that he was originally calling ‘World of the Zombies,’ and I was like, ‘Robert, that’s horrible,’” Valentino said. For this book to work, Valentino told Kirkman, it needed a hook."}, {"dd9c": "“So [Kirkman] said, ‘OK, the zombies are an alien invasion,’” Valentino told me. “And about three or four issues into it, Eric Stephenson [then Image’s director of sales and marketing] called him up and said, ‘So where’s the aliens?’”"}, {"1324": "“Robert laughed and said, ‘There are no aliens. I just told you guys that so you would publish it,’” Valentino added with a laugh."}, {"768a": "Aliens or not, The Walking Dead — which started with Tony Moore as artist before Charlie Adlard took the reins on Issue no. 7 — became one of the most uncommon stories in comics: a title that started with low sales (fewer than 7,300 copies of its first printing were ordered, per estimates) and steadily increased until it became one of the industry’s top sellers. From there, the TV show launched and a media empire was formed, sending its sales into rarefied air."}, {"1454": "An issue that hits stores today is already the highest-selling single issue in nearly 20 years, thanks in part to its cover price of a quarter to honor Image’s anniversary. However, its collections are the series’ biggest revenue generator. These paperback and hardcover books bundle issues together in bulk so you can binge-read the series, perfect for crossover TV fans. Millions of the collections have been purchased, with the first compendium — at a cover price of $60 — estimated to have sold more than 450,000 copies as of the end of 2015. In recent years, The Walking Dead has had an annual market share as high as 2.5 percent of the total comic shop market by itself."}, {"78d6": "It doesn’t stop there, of course. The Walking Dead is a phenomenon beyond comic-book racks. Even accounting for a recent ratings slide, its TV show is an enormous hit that draws in the largest audience in the coveted 18-to-49 demographic of any nonsports program, cable or network. The video game series developed by Telltale Games set in TWD’s world has earned massive acclaim and sales of more than 28 million as of 2014, with a third season launching this past December."}, {"ad38": "While many of the original titles are well liked among fans, the deal that Image developed at its inception for its founders — and then passed on to others — is in many ways Image’s most lasting and impactful creation."}, {"32f0": "Image itself takes only a flat dollar amount from each print comic it sells, while getting a fixed percentage from each collection or digital comic. That means the bulk of potential profits and all of the rights belong to the creators — the latter being a key difference-maker in this adaptation-loving era. If an Image comic becomes a movie or TV show — like The Walking Dead — the creators are the ones who reap the profits."}, {"cfbe": "That’s not to say Image doesn’t benefit from adaptations, as the success of a TV show like The Walking Dead can be a major boon to a comic series’ sales, particularly those of collections. While Image may not directly profit from the show, its indirect upside can be enormous."}, {"f9d9": "That structure results in a longer path to earning money and fewer guarantees of a job than from, say, Marvel or DC, but it also means significantly greater potential earnings for those willing to take the leap. It’s high-variance, but it’s an offer that can’t be beat, especially if you’re an established creator."}, {"22e1": "“It’s the absolute best deal in comics,” Kirkman said."}, {"5568": "It’s not just the monetary rights that speak to creators. While every writer or artist I spoke to had worked with Marvel and/or DC, many touted the creative freedom that Image offered. It’s why creators like writer Kieron Gillen release passion projects at the place where they can most fully realize them."}, {"4a6d": "“If you could do anything, there’s the implication you should at least try to do something,” Gillen said. “If you’re not using that blank paper for something big, different, redefining, you’re somehow wasting it,” he said, before adding with a laugh, “but that’s my own personal bullshit.”"}, {"17e7": "Several people I spoke to shared that Image is where you can find the biggest talent in comics “with the brakes off,” as Gillen put it, and that’s a significant advantage. To be able to create, completely unfettered, is a dream for all artists. That’s different from working at Marvel or DC, where an important part of your role is as a caretaker of intellectual property. You can tell the stories you want with their characters, but only if it fits within their plans. Creating at Image, on the other hand, is closer to self-publishing than working at Marvel or DC."}, {"6586": "Yet this deal had been available for a long time before creators began migrating en masse to Image around 2009, so the question becomes, “What changed?” One of the biggest factors was Kirkman’s success, which has had an incalculable impact on the fate of Image, and not just because of the revenue it brought in when the company most needed it. The Walking Dead proved the Image model could work even if you weren’t a top star — that the right idea could be a million-dollar one."}, {"8f2d": "“You need this wedge product that is able to prove to people that it’s possible,” said MacDonald of The Walking Dead."}, {"4636": "“I just think it’s a matter of people seeing it works,” Larsen added. “That you can look at it and go, suddenly there’s this Robert Kirkman and he’s got this TV show and things are wonderful for him and he doesn’t seem to be getting screwed over.”"}, {"ed8b": "Joe Keatinge said that his comic, Shutter (cocreated with Leila del Duca), wouldn’t be around if Kirkman hadn’t been there to hand off the baton."}, {"2ddc": "“Shutter can exist because the success of books like Sex Criminals, Fatale, Bitch Planet, and Saga opened up the doors for weird books by new creators to exist. Their doors got opened by Robert. His doors got opened by the founders,” Keatinge said. “You gotta keep opening those doors, man — Robert certainly has for me and many others.”"}, {"0de1": "In 2008, Kirkman’s relationship with Image was taken to another level when, despite having significant success working on for-hire projects, he left Marvel for good and became Image’s first new partner since the company had been founded."}, {"7bff": "Shortly after that, Kirkman unleashed a video mission statement known as “The Kirkman Manifesto” on the comic industry. In the video, Kirkman suggests that comics creators should build up their names at Marvel or DC and then leave to find greater financial success creating their own work."}, {"0883": "This was the opposite of the typical career path in comics. Historically, writers and artists worked tirelessly on their own comics to become well known enough for Marvel or DC to hire them. Kirkman challenged this paradigm and encouraged creators to take full authorship. It was that kind of belief that inspired the partners to bring him onboard. Beyond admiring his work and his character, the Image founders saw a reflection of themselves, 16 years later."}, {"8ace": "“He had given up a lucrative deal at Marvel, and both Marvel and DC were chasing after him at the time, and he was like, ‘No, I’m going to do this and I’m only going to do this,’” Valentino said. “That impressed us because that’s what we did.”"}, {"eb98": "For McFarlane, the biggest reason to add him to the mix was simple: Kirkman is a writer. Artists founded Image, and every writer they’d worked with had been unwilling to commit fully to the brand."}, {"6517": "“The writers, I kept telling them, ‘If you want your books to succeed, you have to quit Marvel and DC,’” McFarlane said. “They wouldn’t heed that simple rule.”"}, {"56f2": "To McFarlane, writers create competition against themselves if they don’t fully commit in one direction, hamstringing the potential of their own creations."}, {"2d49": "“Robert not only figured [that] out on his own, he cut Marvel and DC out cold turkey as a writer. He was the first guy. I had been railing against this for what seemed like forever,” McFarlane said. “And all of a sudden there was this bright, shining light. Some writer was doing it on his own and was acting like an artist. He kept his skills all on his own books, so you now have to buy his books, not some corporation’s books.”"}, {"589a": "While Liefeld was no longer a partner when Kirkman was elevated, he believes Kirkman’s ascent has been essential to Image’s rise, touting The Walking Dead as Image’s own version of Batman or The Avengers."}, {"c855": "“Image Comics exists in the form it does today because of Robert Kirkman and everything he’s done,” Liefeld said. “You cannot have a discussion about Image Comics, from about 2008 to present, that does not involve his success carrying the company and giving it a new foundation to build on, [which] allows Eric Stephenson to make the moves he makes.”"}, {"1b55": "Stephenson is the other catalyst in Image’s rise over the past decade. While he has been at Image since 1992 — he was a writer and editor at Liefeld’s Extreme Studios before joining Image as director of sales and marketing in 2001 — his promotion to publisher in 2008 has been essential to the company’s success."}, {"0359": "“Robert is the right hand,” said Liefeld. “Eric is the left hand.”"}, {"fcc6": "“Eric Stephenson isn’t one important aspect to Image’s present success in terms of how the company’s run,” Keatinge said. “He’s the aspect to Image’s present success in terms of how the company’s run.”"}, {"536a": "“His contributions have been incalculable,” added Valentino."}, {"4906": "Kirkman’s success was a bellwether for the potential of the Image approach, but it had existed for more than a decade and a half by the time Stephenson had taken over. They needed someone who wouldn’t just convey the value of the deal, but help creators find the potential of their strongest ideas. Spurgeon believes a big part of Stephenson’s ability to do that relied on the fact he wasn’t a creator or a businessman: He was both."}, {"fac6": "“I think the overall quality of the line is higher than it’s ever been and I think that is because of Eric. I think it’s [because] he can wear both hats,” Spurgeon said. “That’s hugely valuable.”"}, {"ff8a": "Stephenson and Kirkman work closely, and the latter clearly has great admiration for the former and the way he helps creators find the best version of their own work. Stephenson’s method for doing so is simple, according to Kirkman."}, {"9be5": "“The real heart of what Eric Stephenson does, and this is a story I tell people a lot, he’ll talk to a big creator and they’ll call him up and be like, ‘What book are you looking for Eric? What would Image want from me?,’” Kirkman said. “And his answer is always, ‘I want the book that you want to do.’”"}, {"1ac6": "“He’s not looking for something specific. There’s not a specific genre that he’s trying to service. He’s not a television network saying, ‘Well, sci-fi shows are popular.’ That’s not how Eric Stephenson works.”"}, {"1cf5": "Since Stephenson became publisher, Image has launched exciting and unexpected titles that have won awards and been best sellers with concepts that likely wouldn’t have gotten published at such a scale in years past. Comics like Chew, from writer John Layman and artist Rob Guillory, which tells the story of an FDA agent who receives psychic impressions from what he eats as he deals with life after a bird flu epidemic killed millions. Or Sex Criminals, Matt Fraction and Chip Zdarsky’s comic about a couple who can stop time when they orgasm and use said powers to rob banks. Image doesn’t exactly publish Superman."}, {"d31c": "“The way you get books like that is by looking at what’s not happening in the marketplace, the niches that aren’t being filled,” Stephenson said, “and big-picture, that’s the only way we’ll ultimately grow our industry, because just giving people the same thing over and over again is going to appeal to fewer and fewer readers as time goes on.”"}, {"f9b5": "No comic showcases that mentality better than Saga, a space epic by writer Brian K. Vaughan and artist Fiona Staples. While it was certain to garner plenty of attention as Vaughan’s return to comics — after wrapping titles like Y: The Last Man and Ex Machina, he worked in TV for several years as a writer for Lost and the executive producer on Under the Dome’s first season — readers quickly made it Vaughan’s and Staples’s biggest hit to date. Saga won three consecutive Eisner Awards, the comic-book world’s Oscars, for Best Continuing Series from 2013 to 2015, as well as individual wins for Vaughan and Staples."}, {"863d": "The title, which could be described as a marriage between Star Wars and Romeo and Juliet, isn’t just a good comic, though. Its diverse cast and progressive themes helped it fill some of the niches Stephenson spoke of, making it both the symbol of Image’s success and the changing face of comics."}, {"719f": "In recent years, readership has evolved, with digital comics giant ComiXology revealing in 2013 that the fastest-growing segment of readers were 17-to-26-year-old women who were newer to comics. As MacDonald said, “Saga really appealed to this influx of female readers,” and the results have been stunning. The title has generated sales that rival The Walking Dead without a movie or TV deal in sight. In the comics industry of yesteryear, certain markets were massively underserved. Saga’s arrival was a shining example that readers of all types would respond if given something that speaks to them."}, {"1664": "Liefeld calls Stephenson a “tastemaker,” and he’s proved that with the titles published under his watch."}, {"2b22": "“I think he’s really transformed Image into the safe haven it’s become for the best and brightest of the current generation,” Kirkman said."}, {"5adf": "Despite a tumultuous run-up to the milestone, 25 years later Image Comics is — in the words of Hibbs — “probably the most vital [comics] publisher we have.”"}, {"ba93": "“I don’t think anyone else would have been able to help Fiona and me reach as large an audience as we did, while still giving us total creative freedom and true ownership of our characters,” Vaughan said."}, {"d2f6": "Very little is the same since Image launched, but the one constant has been the deal the founders created 25 years ago. It’s what helped them make it through their most challenging period. And it all comes back to what the founders were looking for themselves: true economic and creative freedom."}, {"2c34": "“Image is the best comic company in the world because the emphasis is in the right place,” writer Jonathan Hickman said."}, {"1ce8": "Not only have creators flocked to the publisher to develop some of the medium’s most beloved titles, but Image’s place in the market has improved as well. The industry has made a huge recovery in recent years — according to Comichron, it has increased in value from a low of $255 million to $275 million in 2000 to $940 million in 2015 — and Image has seen its market share grow from under 3 percent in terms of total dollars in June 2009 to nearly 9 percent in December 2016. It’s a dramatic turnaround that has firmly entrenched Image in a familiar spot as the third-largest North American comics publisher."}, {"5e91": "Of the original founders, only Larsen, McFarlane, Silvestri, and Valentino remain. As partners, they’re important to determining the overall direction of the company. Both McFarlane’s Spawn and Larsen’s Savage Dragon are still being published, with Larsen still creating every aspect of the book — just like he was in 1992. Lee is now the copublisher of DC Entertainment. Liefeld mended his relationship with Image with the help of Kirkman and is developing a new era for his Extreme Universe there, building off of a recent reported seven-figure movie deal. Portacio still resides on the creative side, working on projects for Marvel, DC, and Image over the years. Even the company itself recently relocated from the Bay Area to Portland, Oregon. Image has fulfilled the promise it had when it first started, even if took an unexpected path to getting there."}, {"a7cf": "“I remember I went to one of the Image Expos [a yearly event Image holds to announce new titles] and one of the things that struck me as interesting and a little bit of a mixed bag because we all have our egos, [was realizing], ‘Wow, this whole room is about Image. If I wasn’t here, it would still be exactly the same,’” McFarlane said. “I’m not saying that what we did at the beginning in 1992 as a group didn’t start the ball rolling. It’s just the ball is rolling pretty good right now, and it doesn’t need any big pushes from the original founders now."}, {"dfc3": "“My greatest sense of pride is we’re still here 25 years later.”"}, {"e9be": "An earlier version of this piece incorrectly stated that Battle Pope was Robert Kirkman’s first project for Image Comics; that reference has been removed. Also, the piece inaccurately stated that the company takes a fixed percentage from each comic and collection it sells; Image takes a flat dollar amount from each comic it sells, and a fixed percentage from each collection or digital comic."}], "child": "1820_1\t1820_2\t1820_3\t1820_4\t1820_5\t1820_6\t1820_7\t1820_8\t1820_9\t1820_10\t1820_11\t1820_12\t1820_13\t1820_14"}