{"name": "1838", "parent": "", "content": "Youth, the Secret of Life, and Other Alchemy I was talking to a colleague of mine yesterday, who is about to turn 50. He was regretful about the fact that he grew up too fast. He said that when he was a kid, all he wanted to do was get older, so he could do all of the things that that adults were doing — the things that seemed so cool to him as a child. So when he became an adult, and experienced the anxiety, uncertainty, and expectations that come with it, he looked back on a youth that he seemed to have let slip by him. I sympathized with him, having heard this kind of thing before — also from someone older than me. But I could not empathize. I had never shared his feeling, his desire to grow up. I still don’t, even though I am myself a grown-up. And though I felt bad for not having shared such a common experience, I also feel very fortunate to have dodged a bullet. The bullet that I dodged was the bullet of missing out on my youth. It’s something that I have seen so many people lament about. They pine for a youth that they feel they weren’t able to fully appreciate — because they were so hell-bent on obtaining the supposed treasures of adulthood. Having found those treasures to be largely composed of fool’s gold, they have turned their gaze backward, wondering if they missed the real treasure — and feeling a sneaking suspicion that they did. I suspect that my reason for having dodged the bullet of misspent youth was that at least as it regards youth and its nuance, I learned a subtle and fine art. It was a kind of phenomenological alchemy that I have tried to deploy in other areas of my life. It’s a kind of alchemy that turns both the mundane and the painful into gold. It’s called appreciation. Happiness vs. Appreciation When I was 10 years old, my parents informed me that by the time I turned 11, we would be moving to the suburbs. We would be moving away from the intimate city blocks that I had come to know like the back of my hand — away from my friends, my school, my favorite parks, and family close by. A summer that by all rights I would have just let unfold like all the others became a summer that I had to carefully and masterfully handle, in order to extract all of the joy and future memories that I could. In previous years I was merely a diner in the kitchen of my youth, enjoying the meal of a youthful summer. This year I had to become the chef as well. I had to both carefully prepare the meal, plate it, and present it in the best possible way. Only after that could I sit down to enjoy it. It was at that time that a very subtle but very valuable truth occurred to me: Appreciation is not something that just comes to you. It has to be carefully prepared for, nurtured, and cultivated. Developing appreciation for something or someone — especially things or people in your life — is actually a very involved and demanding endeavor. It takes effort and concentration, contemplation and mental space, to develop an appreciation for something. But here’s another important thing that I learned from my youth: Appreciation is not the same as joy, happiness, pleasure, or any of the other positive emotions. Appreciation is a relationship that involves many other emotions and thoughts— both positive and negative. You can appreciate a warm, light-hearted dinner with friends where everyone enjoyed themselves and had wonderful, warm conversations. You can also appreciate when your first love broke your heart by breaking up with you in order to date your good friend — and the months of agony and self-doubt that followed. Both of those appreciations are the same, but they involve all sorts of different, opposite feelings. Experiential Alchemy I have always tended to follow the model of the optimist : look for the sliver lining, find the good in people, smile through the pain, etc. And though much of that model works to create a positive mindset, it still leaves much to be desired. The optimist may well have it right that we need to always look for the positive, but inasmuch as she instructs us to only look for the positive, she is missing something valuable. There is power in the negative, and we should not shy away from it. We should feel negative about some things. We should look at our situation — at times of loss and defeat — and say “this is terrible, I feel terrible”. Those feelings are instructive. Those feelings can be the seeds of appreciation. This should not surprise us. We should be aware of the necessity of lows in order to accentuate the highs. We should be aware of the fact that life necessarily involves the good as well as the bad. Pleasure can’t be what it is without pain to contrast it. Joy cannot be what it is — and as important as it is — without sorrow against which to compare it. The Test A life of only joyful and pleasurable feelings — if not impossible — would simply seem devoid something necessary: those negative experiences to round it out. Yet we seem to forget that as we stumble through life, and we keep grasping for the joy and pleasure, while pushing forcefully away those negative experiences that come hurtling toward us. Somewhere in there, we have to understand how to relate to all of these experiences, and figure out what a truly good life really looks like. So here’s a test I’m proposing. It’s a test that if you can pass, perhaps you really understand a good life in a non-superficial way — you have the right balance. Think of your most negative experience you’ve had— one where you felt at or close to your personal bottom. If you can look back on it and appreciate it, then you are doing okay. Appreciating it means acknowledging that it was bad at the time — that you felt bad, perhaps you were ready to give up. But you can also see how it has helped shape you into who you are today. Assuming you like who you are today, you can appreciate what all that pain and sorrow has done for you. Those feelings never change into positive ones; they remain painful — that’s why they were so instructive. However, they changed you in a way that now serves to give you joy and pleasure. That’s appreciation. And truly, the more you can appreciate, the more you can live. Because a life filled with appreciation is a life fully lived. In Conclusion: Staying Sharp vs. Cutting Eventually, I did turn 11 — in the middle of that fateful summer. Within 6 weeks, my parents had sold our house and moved us to the suburbs — exactly as promised. I would begin middle school as the new kid. But under my belt, I had a summer that I could honestly say I appreciated as it happened. That in turn was the cornerstone a greater awareness I gained of how to appreciate youth, and thus how to appreciate my lived experiences in general. I think that as we age, there is a sharpness to our faculty of appreciation that tends to become blunted. I’m not sure how it happens, and I’m not sure that we ever can get it back. But I take comfort in the fact that even a dull knife can cut, so long as you’re careful and calculated. So that is what I am trying to do: become more careful and calculated in my appreciation. It involves being present. It involves being still and silent more often. It also involves expecting and desiring less. Come to think of it, perhaps it is expectations, desires, and future planning that blunt our faculty of appreciation. When you grow up, you have to plan, and you have to grapple with expectations — both yours and those of others. Try to shake them all you like, but such things will always be heavier as you age than when you were young. That’s just how it works. Aristotle once said something like you are what you habitually do. I guess for the most part, this holds true, but I think there is another formulation: we are what we habitually appreciate. In one formulation, I am a writer. On the other formulation, I am so much more. For obvious reasons, I prefer the second. Did you find value in this piece? Consider subscribing to my weekly newsletter — Woolgathering. It’s one email per week, with interesting stuff to ponder, from me and from around the web. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "title": "Youth, the Secret of Life, and Other Alchemy", "sentences": [{"eaa9": "Youth, the Secret of Life, and Other Alchemy"}, {"01ec": "I was talking to a colleague of mine yesterday, who is about to turn 50. He was regretful about the fact that he grew up too fast. He said that when he was a kid, all he wanted to do was get older, so he could do all of the things that that adults were doing — the things that seemed so cool to him as a child. So when he became an adult, and experienced the anxiety, uncertainty, and expectations that come with it, he looked back on a youth that he seemed to have let slip by him."}, {"16e6": "I sympathized with him, having heard this kind of thing before — also from someone older than me. But I could not empathize. I had never shared his feeling, his desire to grow up. I still don’t, even though I am myself a grown-up. And though I felt bad for not having shared such a common experience, I also feel very fortunate to have dodged a bullet."}, {"a348": "The bullet that I dodged was the bullet of missing out on my youth. It’s something that I have seen so many people lament about. They pine for a youth that they feel they weren’t able to fully appreciate — because they were so hell-bent on obtaining the supposed treasures of adulthood. Having found those treasures to be largely composed of fool’s gold, they have turned their gaze backward, wondering if they missed the real treasure — and feeling a sneaking suspicion that they did."}, {"4368": "I suspect that my reason for having dodged the bullet of misspent youth was that at least as it regards youth and its nuance, I learned a subtle and fine art. It was a kind of phenomenological alchemy that I have tried to deploy in other areas of my life. It’s a kind of alchemy that turns both the mundane and the painful into gold. It’s called appreciation."}, {"6c4a": "Happiness vs. Appreciation"}, {"9b95": "When I was 10 years old, my parents informed me that by the time I turned 11, we would be moving to the suburbs. We would be moving away from the intimate city blocks that I had come to know like the back of my hand — away from my friends, my school, my favorite parks, and family close by. A summer that by all rights I would have just let unfold like all the others became a summer that I had to carefully and masterfully handle, in order to extract all of the joy and future memories that I could."}, {"3fd9": "In previous years I was merely a diner in the kitchen of my youth, enjoying the meal of a youthful summer. This year I had to become the chef as well. I had to both carefully prepare the meal, plate it, and present it in the best possible way. Only after that could I sit down to enjoy it. It was at that time that a very subtle but very valuable truth occurred to me:"}, {"f848": "Appreciation is not something that just comes to you. It has to be carefully prepared for, nurtured, and cultivated."}, {"dcf7": "Developing appreciation for something or someone — especially things or people in your life — is actually a very involved and demanding endeavor. It takes effort and concentration, contemplation and mental space, to develop an appreciation for something."}, {"d118": "But here’s another important thing that I learned from my youth:"}, {"1468": "Appreciation is not the same as joy, happiness, pleasure, or any of the other positive emotions. Appreciation is a relationship that involves many other emotions and thoughts— both positive and negative."}, {"e87b": "You can appreciate a warm, light-hearted dinner with friends where everyone enjoyed themselves and had wonderful, warm conversations. You can also appreciate when your first love broke your heart by breaking up with you in order to date your good friend — and the months of agony and self-doubt that followed. Both of those appreciations are the same, but they involve all sorts of different, opposite feelings."}, {"7a87": "Experiential Alchemy"}, {"1097": "I have always tended to follow the model of the optimist : look for the sliver lining, find the good in people, smile through the pain, etc. And though much of that model works to create a positive mindset, it still leaves much to be desired."}, {"c310": "The optimist may well have it right that we need to always look for the positive, but inasmuch as she instructs us to only look for the positive, she is missing something valuable."}, {"41ff": "There is power in the negative, and we should not shy away from it. We should feel negative about some things. We should look at our situation — at times of loss and defeat — and say “this is terrible, I feel terrible”. Those feelings are instructive. Those feelings can be the seeds of appreciation."}, {"3e7f": "This should not surprise us. We should be aware of the necessity of lows in order to accentuate the highs. We should be aware of the fact that life necessarily involves the good as well as the bad. Pleasure can’t be what it is without pain to contrast it. Joy cannot be what it is — and as important as it is — without sorrow against which to compare it."}, {"a9a1": "The Test"}, {"e4e3": "A life of only joyful and pleasurable feelings — if not impossible — would simply seem devoid something necessary: those negative experiences to round it out. Yet we seem to forget that as we stumble through life, and we keep grasping for the joy and pleasure, while pushing forcefully away those negative experiences that come hurtling toward us."}, {"a592": "Somewhere in there, we have to understand how to relate to all of these experiences, and figure out what a truly good life really looks like."}, {"7cfd": "So here’s a test I’m proposing. It’s a test that if you can pass, perhaps you really understand a good life in a non-superficial way — you have the right balance. Think of your most negative experience you’ve had— one where you felt at or close to your personal bottom. If you can look back on it and appreciate it, then you are doing okay."}, {"12b4": "Appreciating it means acknowledging that it was bad at the time — that you felt bad, perhaps you were ready to give up. But you can also see how it has helped shape you into who you are today. Assuming you like who you are today, you can appreciate what all that pain and sorrow has done for you."}, {"0c46": "Those feelings never change into positive ones; they remain painful — that’s why they were so instructive. However, they changed you in a way that now serves to give you joy and pleasure. That’s appreciation. And truly, the more you can appreciate, the more you can live. Because a life filled with appreciation is a life fully lived."}, {"858b": "In Conclusion: Staying Sharp vs. Cutting"}, {"6f13": "Eventually, I did turn 11 — in the middle of that fateful summer. Within 6 weeks, my parents had sold our house and moved us to the suburbs — exactly as promised. I would begin middle school as the new kid. But under my belt, I had a summer that I could honestly say I appreciated as it happened. That in turn was the cornerstone a greater awareness I gained of how to appreciate youth, and thus how to appreciate my lived experiences in general."}, {"e417": "I think that as we age, there is a sharpness to our faculty of appreciation that tends to become blunted. I’m not sure how it happens, and I’m not sure that we ever can get it back. But I take comfort in the fact that even a dull knife can cut, so long as you’re careful and calculated. So that is what I am trying to do: become more careful and calculated in my appreciation. It involves being present. It involves being still and silent more often. It also involves expecting and desiring less."}, {"6e07": "Come to think of it, perhaps it is expectations, desires, and future planning that blunt our faculty of appreciation. When you grow up, you have to plan, and you have to grapple with expectations — both yours and those of others. Try to shake them all you like, but such things will always be heavier as you age than when you were young. That’s just how it works."}, {"12ca": "Aristotle once said something like you are what you habitually do. I guess for the most part, this holds true, but I think there is another formulation: we are what we habitually appreciate. In one formulation, I am a writer. On the other formulation, I am so much more. For obvious reasons, I prefer the second."}, {"fa0c": "Did you find value in this piece? Consider subscribing to my weekly newsletter — Woolgathering. It’s one email per week, with interesting stuff to ponder, from me and from around the web."}, {"4e76": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}], "child": "1838_1\t1838_2\t1838_3\t1838_4\t1838_5\t1838_61838_1\t1838_2\t1838_3\t1838_4\t1838_5\t1838_6"}