{"name": "1848", "parent": "", "content": "Stand Up To Dragons Re-reading ‘The Paper Bag Princess’ On my desk beside me is a slim, square book with yellowed pages, a copy of The Paper Bag Princess, by Canadian children’s author Robert Munsch. Beautiful Elizabeth is about to marry Prince Ronald — a tousle-headed blond with a retroussé nose, a haughty air, and extremely snug trousers — when he is unexpectedly snatched by a dragon. Princess Elizabeth doesn’t hesitate. She chases after the giant fire-breathing beast, outwits it with her cunning, and eventually liberates the prisoner. Ronald, still clutching his tennis racket, is less than impressed by her daring. She has lost her gown, messed up her hair, and she smells of ashes. How very unfeminine she was, to save his life. Plucky Elizabeth is characteristically robust about the pettiness of her fiancé. ‘Ronald,’ she tells him, as uncowed and forthright as she was with the dragon, ‘your clothes are really pretty and your hair is very neat. You look like a real prince but you are a bum.’ Elizabeth tells it like it is. In the book’s final illustration she capers off towards the horizon and her own golden future beyond, arms raised into the sunset, dirty bare feet leaping joyfully in the dust. I recount this story in full because it was the most important book I ever read. It is all but impossible to overstate the impact of this book upon my six-year-old self. It’s true that in later life it didn’t stop me waiting longer than I should have by a silent telephone, nor do I always speak my mind to men, nor defend myself as I ought against subtle sexist insult derision or plain bad manners. But it has always been there in my psyche, whispering softly, a second narrative interwoven with the blasting electronic symphonies of popular culture that declare through every billboard and magazine and movie and pop song and the sound system of every mall: Be pleasing! Be nice! Be fragrant! Be thin! Conform! Elizabeth stayed with me, whispered to me of another empowered femininity; warning me of Ronalds. The Paperbag Princess is on my desk today because I have twin toddlers, and I wanted to read it to them. Of course the lesson of the book is for future Ronalds as well as future Elizabeths — I’d have dug it out for a son just as readily as for my girls. The moral then becomes one of respect for women, to judge what lies beyond the paper bag the princess was forced to wear when the dragon’s breath burned her royal robes; always to speak to a woman as to an equal or if you don’t, to rue the consequences. Well, Ronald, Donald. Tomayto, tomahto. That women are human is a lesson the world is striving to forget in 2017, if indeed it ever learned it. Funding for global women’s health organizations? Not any longer, if the organizations in question intend to counsel, refer or advocate for access to safe, legal abortion. What about contributions to the UN Population Fund, which provides life-saving contraception across some of the poorest parts of Africa? No more fun for them soon, those wanton African hussies. Better that struggling and impoverished mothers in HIV-ravaged countries practice abstinence as birth control — the method of choice, no doubt, for all those white, male, married Republicans backing the steady flow of woman-hating executive orders pouring out of the new White House. How to parent daughters while America leads a Western backslide into cronyism, pettiness and institutionalized misogyny? I don’t know, but this morning I searched my mother’s basement for The Paper Bag Princess, and though my daughters are sixteen months old, that is where I will begin. I will read it to them and I hope over time that they will learn Princess Elizabeth’s lessons: Adventure and be fearless. Stand up to dragons. Defend yourself with all you have. Walk away from any man who treats you with disrespect. You, yourself, alone, are enough, and more than enough. For now, at sixteen months, that will have to do. That, and to hear their mother saying aloud, Donald. You are the president, but you are a bum. After which we will all hold hands and skip off — or march, as necessary — into the sunset. The Awkward Age by Francesca Segal will be published by Riverhead in May ’17. ", "title": "Stand Up To Dragons", "sentences": [{"3a5a": "Stand Up To Dragons"}, {"f31b": "Re-reading ‘The Paper Bag Princess’"}, {"10cd": "On my desk beside me is a slim, square book with yellowed pages, a copy of The Paper Bag Princess, by Canadian children’s author Robert Munsch."}, {"4434": "Beautiful Elizabeth is about to marry Prince Ronald — a tousle-headed blond with a retroussé nose, a haughty air, and extremely snug trousers — when he is unexpectedly snatched by a dragon. Princess Elizabeth doesn’t hesitate. She chases after the giant fire-breathing beast, outwits it with her cunning, and eventually liberates the prisoner. Ronald, still clutching his tennis racket, is less than impressed by her daring. She has lost her gown, messed up her hair, and she smells of ashes. How very unfeminine she was, to save his life."}, {"1cae": "Plucky Elizabeth is characteristically robust about the pettiness of her fiancé. ‘Ronald,’ she tells him, as uncowed and forthright as she was with the dragon, ‘your clothes are really pretty and your hair is very neat. You look like a real prince but you are a bum.’ Elizabeth tells it like it is. In the book’s final illustration she capers off towards the horizon and her own golden future beyond, arms raised into the sunset, dirty bare feet leaping joyfully in the dust. I recount this story in full because it was the most important book I ever read."}, {"84fe": "It is all but impossible to overstate the impact of this book upon my six-year-old self. It’s true that in later life it didn’t stop me waiting longer than I should have by a silent telephone, nor do I always speak my mind to men, nor defend myself as I ought against subtle sexist insult derision or plain bad manners."}, {"3b0b": "But it has always been there in my psyche, whispering softly, a second narrative interwoven with the blasting electronic symphonies of popular culture that declare through every billboard and magazine and movie and pop song and the sound system of every mall: Be pleasing! Be nice! Be fragrant! Be thin! Conform! Elizabeth stayed with me, whispered to me of another empowered femininity; warning me of Ronalds."}, {"4005": "The Paperbag Princess is on my desk today because I have twin toddlers, and I wanted to read it to them. Of course the lesson of the book is for future Ronalds as well as future Elizabeths — I’d have dug it out for a son just as readily as for my girls. The moral then becomes one of respect for women, to judge what lies beyond the paper bag the princess was forced to wear when the dragon’s breath burned her royal robes; always to speak to a woman as to an equal or if you don’t, to rue the consequences. Well, Ronald, Donald. Tomayto, tomahto. That women are human is a lesson the world is striving to forget in 2017, if indeed it ever learned it. Funding for global women’s health organizations? Not any longer, if the organizations in question intend to counsel, refer or advocate for access to safe, legal abortion. What about contributions to the UN Population Fund, which provides life-saving contraception across some of the poorest parts of Africa? No more fun for them soon, those wanton African hussies. Better that struggling and impoverished mothers in HIV-ravaged countries practice abstinence as birth control — the method of choice, no doubt, for all those white, male, married Republicans backing the steady flow of woman-hating executive orders pouring out of the new White House."}, {"d23d": "How to parent daughters while America leads a Western backslide into cronyism, pettiness and institutionalized misogyny? I don’t know, but this morning I searched my mother’s basement for The Paper Bag Princess, and though my daughters are sixteen months old, that is where I will begin. I will read it to them and I hope over time that they will learn Princess Elizabeth’s lessons: Adventure and be fearless. Stand up to dragons. Defend yourself with all you have. Walk away from any man who treats you with disrespect. You, yourself, alone, are enough, and more than enough."}, {"f0fe": "For now, at sixteen months, that will have to do. That, and to hear their mother saying aloud, Donald. You are the president, but you are a bum. After which we will all hold hands and skip off — or march, as necessary — into the sunset."}, {"0795": "The Awkward Age by Francesca Segal will be published by Riverhead in May ’17."}], "child": "1848_11848_1"}