{"name": "1849", "parent": "", "content": "People Who Make A Big Deal About How Much They Love Reading And other deal breakers There’s this very disappointing Reddit thread, titled “You’re on a date. What is the one thing the other person would have to say to make it an immediate deal-breaker?” My friend Rebecca asked me what some of mine were, and I remember thinking, “Well, shit, I am a kind and mega-tolerant soul. Bet you I will be able to think of two or three MAX.” Lolol. (A caveat: I cannot speak for Rebecca, but I am All Too Aware that my very existence constitutes a deal breaker for all sorts of people. Somewhere someone is writing a similar list and at the top it just says “BEING LIKE ROSA.) (Another caveat: the fact that the following does not include the real deal breakers such as being unkind or a racist or a bigot of any description means that these things go without saying.) Some obvious ones, basic crowdpleasers: Bizarrely specific stuff obviously based on bitter experience: (There is some stuff which is too mean to write down here, but you can email me and ask me about it if you need.) In the course of compiling this list, I stumbled upon what is perhaps my biggest and most pettiest deal breaker of all: PEOPLE WHO MAKE A BIG DEAL ABOUT HOW MUCH THEY LOVE READING/PEOPLE WHO GO ON AND FUCKING ON ABOUT HOW MUCH THEY LOVE THE FEEL/WEIGHT/SMELL OF A BOOK. You guys. This is the big one. I did not know how true it was until I wrote it down. It is my worst. I don’t why it is my worst but it is. It is the fucking pits. Remember when e-readers first came out and we all wanted to kill ourselves because there was always some ghastly person holding forth about how TECHNOLOGY could never replace THE TEXTURE OF THE PRINTED PAGE? Jesus. E-readers are useful and good and you can go on holiday with them and how is this even up for discussion? Remember this? Also THIS? Fuhhhhhhhhhh. Full-on deal breaker. If I had to be on a date with someone and they started waxing all lyrical about The Smell and Feel Of A Book and being Transported Into Another World and how sick it is to be an introvert, I would call for the bill immediately, and then after that I would make myself invisible so that I could go up to this person at a later date and whisper in their ear that they were a nerd. Sorry but that’s just how I feel. How is it that here in late-stage 2016, we are still fetishizing reading like it is an activity only performed by sensitive woodland creatures with cool glasses on and their hair tucked behind their ears? An activity performed by people who live on the moon? You guys, we all love reading. If you are reading this, I think it is safe to say that you love reading. I think it is further safe to say that we can all move on with our lives now, safe in the collective assumption that reading is fine and ok and absolutely not a thing to get boasty about. Everyone likes books. Also, if you don’t like reading, that doesn’t make you dumb. It just means that you don’t like reading, because reading actually is a morally neutral act. I believe this. Also, most books are about how to make money, or they are about murders, or they are aimed at teens. You know what is a book? Mein Kampf. You know what else is a book? It’s Not About the Bike. Liking to read doesn’t make a person smart or good, it just makes them literate. Reading in itself is not an intrinsically dreamy activity, and I think we should stop pretending that it is. How are we still getting away with this, here in the end times? Reading is fine. It is fine to read. But here in late-stage 2016, let’s stop making it a thing. Let’s all never say anything again about how we love the smell of books and so on. We need to stop resting on our laurels, and come up with better and more intimidating ways to make ourselves seem interesting to others. Sorry but that’s just how I feel. ", "title": "People Who Make A Big Deal About How Much They Love Reading", "sentences": [{"ef0b": "People Who Make A Big Deal About How Much They Love Reading"}, {"8ad7": "And other deal breakers"}, {"cb86": "There’s this very disappointing Reddit thread, titled “You’re on a date. What is the one thing the other person would have to say to make it an immediate deal-breaker?” My friend Rebecca asked me what some of mine were, and I remember thinking, “Well, shit, I am a kind and mega-tolerant soul. Bet you I will be able to think of two or three MAX.” Lolol."}, {"87bc": "(A caveat: I cannot speak for Rebecca, but I am All Too Aware that my very existence constitutes a deal breaker for all sorts of people. Somewhere someone is writing a similar list and at the top it just says “BEING LIKE ROSA.)"}, {"2b25": "(Another caveat: the fact that the following does not include the real deal breakers such as being unkind or a racist or a bigot of any description means that these things go without saying.)"}, {"7f53": "Some obvious ones, basic crowdpleasers:"}, {"2b9f": "Bizarrely specific stuff obviously based on bitter experience:"}, {"471a": "(There is some stuff which is too mean to write down here, but you can email me and ask me about it if you need.)"}, {"8c47": "In the course of compiling this list, I stumbled upon what is perhaps my biggest and most pettiest deal breaker of all: PEOPLE WHO MAKE A BIG DEAL ABOUT HOW MUCH THEY LOVE READING/PEOPLE WHO GO ON AND FUCKING ON ABOUT HOW MUCH THEY LOVE THE FEEL/WEIGHT/SMELL OF A BOOK."}, {"0205": "You guys. This is the big one. I did not know how true it was until I wrote it down. It is my worst. I don’t why it is my worst but it is. It is the fucking pits. Remember when e-readers first came out and we all wanted to kill ourselves because there was always some ghastly person holding forth about how TECHNOLOGY could never replace THE TEXTURE OF THE PRINTED PAGE? Jesus. E-readers are useful and good and you can go on holiday with them and how is this even up for discussion? Remember this? Also THIS? Fuhhhhhhhhhh. Full-on deal breaker. If I had to be on a date with someone and they started waxing all lyrical about The Smell and Feel Of A Book and being Transported Into Another World and how sick it is to be an introvert, I would call for the bill immediately, and then after that I would make myself invisible so that I could go up to this person at a later date and whisper in their ear that they were a nerd. Sorry but that’s just how I feel."}, {"54e4": "How is it that here in late-stage 2016, we are still fetishizing reading like it is an activity only performed by sensitive woodland creatures with cool glasses on and their hair tucked behind their ears? An activity performed by people who live on the moon? You guys, we all love reading. If you are reading this, I think it is safe to say that you love reading. I think it is further safe to say that we can all move on with our lives now, safe in the collective assumption that reading is fine and ok and absolutely not a thing to get boasty about. Everyone likes books."}, {"25ea": "Also, if you don’t like reading, that doesn’t make you dumb. It just means that you don’t like reading, because reading actually is a morally neutral act. I believe this. Also, most books are about how to make money, or they are about murders, or they are aimed at teens. You know what is a book? Mein Kampf. You know what else is a book? It’s Not About the Bike. Liking to read doesn’t make a person smart or good, it just makes them literate. Reading in itself is not an intrinsically dreamy activity, and I think we should stop pretending that it is. How are we still getting away with this, here in the end times?"}, {"45a3": "Reading is fine. It is fine to read. But here in late-stage 2016, let’s stop making it a thing. Let’s all never say anything again about how we love the smell of books and so on. We need to stop resting on our laurels, and come up with better and more intimidating ways to make ourselves seem interesting to others. Sorry but that’s just how I feel."}], "child": "1849_1\t1849_2\t1849_3\t1849_4\t1849_5\t1849_6\t1849_7\t1849_8\t1849_9\t1849_10\t1849_11\t1849_12\t1849_13\t1849_14\t1849_15\t1849_16\t1849_17\t1849_18\t1849_19\t1849_20\t1849_21\t1849_22\t1849_23\t1849_24\t1849_25"}