{"name": "1855", "parent": "", "content": "No One Cares? That’s a Bunch of B.S. Not sure about you, but I’m OVER this notion that nobody gives a $#it about you or your dreams. It’s simply not true. Yet you’d never know it, judging by the tenor of many popular articles that appear on this site. Lately, it seems there are a plethora of cynical and deprecating pieces telling you why you have to look out for yourself because no one cares what you have to say. Let me end the suspense right now: Medium wouldn’t be one of the most highly-trafficked websites on the Internet if nobody cared what you, me and the thousands of others who write, read and comment had to say. I love reading a lot of the writing on this site. I’m blessed to be one of the top writer in tags like Inspiration, Self Improvement and Love. I care passionately about my readers and I always lend a hand to writers who reach out to me. I care. And I know many of you do, too. There’s simply too many, “No one cares about you” stories circulating these days. Why all the frustration and the anger? Is it from writers who feel they’ve hit a ceiling? Is it from people who aren’t quite getting the exposure they desire? I can question, but in the end, I’ve stopped trying to figure out exactly why. I just know it’s there. I see it all the time. You’re Here. You Care. So do I So, I got to thinking: Hmmm. Well, if no one cares, then why do we even bother creating? Why do you even bother coming to this website to read new content? Why do you do anything that you do? I’ll tell you why: Because you care. We see the world through our emotions, experiences and environments. These things color our outlook, while also enhancing it. They enable us to care. Some part of you, whether you’re looking for entertainment, life lessons, a great new app, keys to code more efficiently, feminist literature, inspiration, an outlet to laugh, cry, love or simply to amuse yourself as you waste away a few minutes on a late Wednesday afternoon at the office; you have millions of other alternatives for how to spend your time. But you’re here. And you care. If you truly only cared for yourself, then you’d never contribute anything for the benefit of humanity. Can you honestly say that’s you? If you didn’t care what I had to say, then you wouldn’t support me, or the countless other writers on this site who pour out their hearts each week. We do what we love. And yes, we want others to notice. We read other writers, we help people out, free of charge. Because we care. And by the grace of God, others do notice. Meant for More Some of us have built budding writing careers. We’ve written books. We’ve engaged with our readers and helped this art form of self-expression increase in vitality. We’re living bolder, in an effort to see a brighter, future day. We care. It’s why we‘re willing to invest in the Medium platform. Why all of us have grown leaps and bounds on this platform and cared enough to share posts on Twitter, Facebook and countless message boards and sites. It’s not easy to make our way in this world. There are so many reasons to get frustrated, angry and mean. And that’s before we drink our coffee each morning! Let me let you in on a secret of life: We were created to love. We are social creatures who desire to give and receive affection. We want friendship. We want to learn and get better as humans. The future of human existence — at a high level — is dependent on whether we genuinely care for one another. Thoughts to Go All right, all right. I’ll descend from my soapbox. But before I do, let me ask you one question: What is the thing that gets you fired up? It may only be one thing. Think about that one thing. Burn it into your memory. My guess is that one thing is something you care deeply about. You’ve likely realized that the flame has been fanned for this passion when you’ve seen others care for it, too. We all have creative passions, things that inspire us to do something that brings satisfaction and joy to the lives of others. None of us make it on our own. We make it because others care for us. A recurring theme in one of my favorite movies, A Bronx Tale, is the notion uttered by Chazz Palminteri’s character, Sonny, that no one cares. In the climax scene, after Sonny has been killed, the main character, C, played by Lillo Brancato, stands over Sonny’s casket at the funeral home. He’s learned all throughout the movie that people do, in fact, care. So much so, that Sonny’s life was a testament to this very matter. Before he says goodbye for the final time, he says, “No one cares? You were wrong about that one.” Think about that next time you get a little cynical. Do your thing and believe that people will care. Don’t forget to care for them, in return. Live Boldly! Want more great content like this? Find my absolute best, plus a free chapter of my NEW book on Values by subscribing for awesome updates and my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others and follow me on Medium! ", "title": "No One Cares? That’s a Bunch of B.S.", "sentences": [{"1796": "No One Cares? That’s a Bunch of B.S."}, {"69f1": "Not sure about you, but I’m OVER this notion that nobody gives a $#it about you or your dreams. It’s simply not true. Yet you’d never know it, judging by the tenor of many popular articles that appear on this site. Lately, it seems there are a plethora of cynical and deprecating pieces telling you why you have to look out for yourself because no one cares what you have to say."}, {"2d5b": "Let me end the suspense right now: Medium wouldn’t be one of the most highly-trafficked websites on the Internet if nobody cared what you, me and the thousands of others who write, read and comment had to say."}, {"63ea": "I love reading a lot of the writing on this site. I’m blessed to be one of the top writer in tags like Inspiration, Self Improvement and Love. I care passionately about my readers and I always lend a hand to writers who reach out to me. I care. And I know many of you do, too."}, {"ff7c": "There’s simply too many, “No one cares about you” stories circulating these days. Why all the frustration and the anger? Is it from writers who feel they’ve hit a ceiling? Is it from people who aren’t quite getting the exposure they desire? I can question, but in the end, I’ve stopped trying to figure out exactly why. I just know it’s there. I see it all the time."}, {"18bb": "You’re Here. You Care. So do I"}, {"f523": "So, I got to thinking: Hmmm. Well, if no one cares, then why do we even bother creating? Why do you even bother coming to this website to read new content? Why do you do anything that you do? I’ll tell you why: Because you care. We see the world through our emotions, experiences and environments. These things color our outlook, while also enhancing it. They enable us to care."}, {"c84b": "Some part of you, whether you’re looking for entertainment, life lessons, a great new app, keys to code more efficiently, feminist literature, inspiration, an outlet to laugh, cry, love or simply to amuse yourself as you waste away a few minutes on a late Wednesday afternoon at the office; you have millions of other alternatives for how to spend your time."}, {"47c5": "But you’re here. And you care. If you truly only cared for yourself, then you’d never contribute anything for the benefit of humanity. Can you honestly say that’s you? If you didn’t care what I had to say, then you wouldn’t support me, or the countless other writers on this site who pour out their hearts each week."}, {"72d9": "We do what we love. And yes, we want others to notice. We read other writers, we help people out, free of charge. Because we care. And by the grace of God, others do notice."}, {"0363": "Meant for More"}, {"1b13": "Some of us have built budding writing careers. We’ve written books. We’ve engaged with our readers and helped this art form of self-expression increase in vitality. We’re living bolder, in an effort to see a brighter, future day."}, {"bab4": "We care. It’s why we‘re willing to invest in the Medium platform. Why all of us have grown leaps and bounds on this platform and cared enough to share posts on Twitter, Facebook and countless message boards and sites."}, {"80dd": "It’s not easy to make our way in this world. There are so many reasons to get frustrated, angry and mean. And that’s before we drink our coffee each morning! Let me let you in on a secret of life: We were created to love. We are social creatures who desire to give and receive affection. We want friendship. We want to learn and get better as humans."}, {"93e2": "The future of human existence — at a high level — is dependent on whether we genuinely care for one another."}, {"1292": "Thoughts to Go"}, {"6ef7": "All right, all right. I’ll descend from my soapbox. But before I do, let me ask you one question: What is the thing that gets you fired up? It may only be one thing. Think about that one thing. Burn it into your memory. My guess is that one thing is something you care deeply about. You’ve likely realized that the flame has been fanned for this passion when you’ve seen others care for it, too."}, {"d873": "We all have creative passions, things that inspire us to do something that brings satisfaction and joy to the lives of others. None of us make it on our own. We make it because others care for us. A recurring theme in one of my favorite movies, A Bronx Tale, is the notion uttered by Chazz Palminteri’s character, Sonny, that no one cares."}, {"9bbe": "In the climax scene, after Sonny has been killed, the main character, C, played by Lillo Brancato, stands over Sonny’s casket at the funeral home. He’s learned all throughout the movie that people do, in fact, care. So much so, that Sonny’s life was a testament to this very matter. Before he says goodbye for the final time, he says,"}, {"1692": "“No one cares? You were wrong about that one.”"}, {"c9bf": "Think about that next time you get a little cynical. Do your thing and believe that people will care. Don’t forget to care for them, in return."}, {"2a99": "Live Boldly!"}, {"a59d": "Want more great content like this? Find my absolute best, plus a free chapter of my NEW book on Values by subscribing for awesome updates and my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others and follow me on Medium!"}], "child": "1855_1\t1855_2\t1855_3\t1855_4\t1855_5\t1855_6"}