{"name": "1856", "parent": "", "content": "ex libris the day the last bookshop closes The bookshops are closing. Listen. Listen and you can hear the doorbells jingle for the last time as each door is closed, then locked, on the final day. Listen to the footsteps recede. On each door, at eye height, there are two signs — there are always two signs: one says “Thank you for your support” and the other one says “For Lease.” These two signs represent the cessation first of the lungs, and then of the heart of every bookshop. Those bells, those final bells, they ring the end of a bookshop somewhere in the world every 15 minutes, but soon then they will ring every hour, and then they will ring every week. Until, one day, there will be only one doorbell left to sound. It is the last bookshop in the world. Look at it: an unloved relic, a vestige, a crass piece of capitalist architecture in a glossy turquoise and sandstone future. By this time, new books are a thing of the distant past. By this time, even the fashion for antique books, and for book-as-ornament is finished. By this time, people no longer even cut up old books to turn into picture frames, jewellery boxes, seedling pots, ashtrays. By this time, the fashion for reading books ostentatiously on public transport has no cultural cachet left… The woman who ran the last bookshop remembered when books were still something, though. She was sure there would always be someone who wanted books. She’s the first bookseller in history to be wrong on this count. The last bookshop in the world, there by the side of what used to be a road. The desert surrounding it is unsympathetic. The building is ready for demolition and recycling: its solar tiles have become matte with age, its teal paint has crusted and flaked off discontinued bricks, its aerocat charging ports are stained copper blue, and barely anyone flies overhead now. Go in. The glass doors scoop you inside, out of heavy white heat into a dry cave that smells like frankincense and paper. At the front of the shop, there are unstraightened books and unsorted piles. At the back, the near empty shelves have dust-shadows where the books used to be. The holography hasn’t been activated in years — crude projections of yesterday’s celebrities talking about the benefits of the Post-Fibre Diet, or of DIY aerocat repair, or of a new atlas of the nation-states, with pictorial representations of the projected Kepler colonies. These holographs were recorded back when Kepler was intended to reproduce the nation states. Here’s a useless dictionary; a book of disproved anatomy; a book of recipes demanding scandalous ingredients you wouldn’t dare buy now; a book of inspirational quotes from the wealthiest people in the world who presumed their wealth was, in itself, inspiring; a book of photographs of twenty first century autumn; the Collected works of William Shakespeare with bonus holographic expansion; a box set of Harry Potter written in binary, for kicks. The publishers stopped printing on paper years and years ago, but for a while there were amateur craftspeople who made books out of nostalgia, out of anti-modernity, out of post-modernity: zines, anthologies, romances, political essays. From the professional to the mediocre, these books are dry, they are beautiful, are sad, unwanted. By this time, books have neither been a source nor a repository of information for years. The promise of information isn’t symbolised by books anymore. Books now symbolise the grim attitudes of the last millennium: empire, misogyny, food-animals, waste. Open a book. You still have the chance. Notice the weight of it. Did people really carry these around for kilometres and kilometres, from the electric train to her house, where her kisses tasted like cloves? Close the book, close the idea of a time when lovers, after sex, would grab an old tee shirt, wrap it around their fingers and twist the gel of reproduction off their digits so that they might be dry enough to turn the thirsty pages of books by Angela Carter, by Charles Bukowski. Did people really lug these wordbricks around from room to room, from house to house, from relationship to relationship, from youth to old age? Did scribes once sit in frosty scriptoria copying from one book to another book in fastidious inks for hundreds of hours? It must have been a faltering way to transmit data, a heavy way, a laborious way, life-wasting. A few days pass, and the woman running the bookshop has died, and the bookshop’s reasons for existing at all have died with her. Her grand-nephew is behind the counter listening to the hiss of the air conditioner, and the crackle of the holographic aquarium. There hasn’t been a customer for days. There was almost going to be a journalist travelling here from Cairo to write a poignant essay about the closure of the world’s last bookshop, but she cancelled — another water shortage in New Shanghai. She suggested he write the story himself. But he won’t. He figures he has better things to write. And then, suddenly, it is 5pm on the last day. He switches off the holographs. Switches off the air conditioner. Organises the recycling carrier to come and take whatever they will, and to deposit any residual moneys to his avatar. He locks the doors by tapping the lifeband on his wrist. The musical note it sounds is the last note in a symphony of bookshops that has stretched on for centuries. He climbs on his aerocycle, and spirals upward slowly into the quiet sunset. He will not come back. Before leaving, he looks down at the building with its long shadow. This was once a bookshop. The last of its kind. A vapour-collar forms around the aerocycle as he javelins off into the sunset. And in his satchel he has taken one book. It is a book of poems by the Cavalier Poets. He doesn’t mind its heft. He feels somehow it anchors him, not just to his past, but to the world, and the world’s past. ", "title": "ex libris", "sentences": [{"9e57": "ex libris"}, {"8e7a": "the day the last bookshop closes"}, {"28a4": "The bookshops are closing. Listen. Listen and you can hear the doorbells jingle for the last time as each door is closed, then locked, on the final day. Listen to the footsteps recede. On each door, at eye height, there are two signs — there are always two signs: one says “Thank you for your support” and the other one says “For Lease.” These two signs represent the cessation first of the lungs, and then of the heart of every bookshop."}, {"1620": "Those bells, those final bells, they ring the end of a bookshop somewhere in the world every 15 minutes, but soon then they will ring every hour, and then they will ring every week."}, {"a541": "Until, one day, there will be only one doorbell left to sound."}, {"ccfe": "It is the last bookshop in the world."}, {"ee11": "Look at it: an unloved relic, a vestige, a crass piece of capitalist architecture in a glossy turquoise and sandstone future. By this time, new books are a thing of the distant past. By this time, even the fashion for antique books, and for book-as-ornament is finished. By this time, people no longer even cut up old books to turn into picture frames, jewellery boxes, seedling pots, ashtrays. By this time, the fashion for reading books ostentatiously on public transport has no cultural cachet left…"}, {"6e35": "The woman who ran the last bookshop remembered when books were still something, though. She was sure there would always be someone who wanted books. She’s the first bookseller in history to be wrong on this count."}, {"3644": "The last bookshop in the world, there by the side of what used to be a road."}, {"8036": "The desert surrounding it is unsympathetic. The building is ready for demolition and recycling: its solar tiles have become matte with age, its teal paint has crusted and flaked off discontinued bricks, its aerocat charging ports are stained copper blue, and barely anyone flies overhead now."}, {"96b0": "Go in."}, {"353a": "The glass doors scoop you inside, out of heavy white heat into a dry cave that smells like frankincense and paper. At the front of the shop, there are unstraightened books and unsorted piles. At the back, the near empty shelves have dust-shadows where the books used to be. The holography hasn’t been activated in years — crude projections of yesterday’s celebrities talking about the benefits of the Post-Fibre Diet, or of DIY aerocat repair, or of a new atlas of the nation-states, with pictorial representations of the projected Kepler colonies. These holographs were recorded back when Kepler was intended to reproduce the nation states."}, {"0d11": "Here’s a useless dictionary; a book of disproved anatomy; a book of recipes demanding scandalous ingredients you wouldn’t dare buy now; a book of inspirational quotes from the wealthiest people in the world who presumed their wealth was, in itself, inspiring; a book of photographs of twenty first century autumn; the Collected works of William Shakespeare with bonus holographic expansion; a box set of Harry Potter written in binary, for kicks. The publishers stopped printing on paper years and years ago, but for a while there were amateur craftspeople who made books out of nostalgia, out of anti-modernity, out of post-modernity: zines, anthologies, romances, political essays. From the professional to the mediocre, these books are dry, they are beautiful, are sad, unwanted."}, {"460f": "By this time, books have neither been a source nor a repository of information for years. The promise of information isn’t symbolised by books anymore. Books now symbolise the grim attitudes of the last millennium: empire, misogyny, food-animals, waste."}, {"021f": "Open a book. You still have the chance. Notice the weight of it. Did people really carry these around for kilometres and kilometres, from the electric train to her house, where her kisses tasted like cloves?"}, {"aa48": "Close the book, close the idea of a time when lovers, after sex, would grab an old tee shirt, wrap it around their fingers and twist the gel of reproduction off their digits so that they might be dry enough to turn the thirsty pages of books by Angela Carter, by Charles Bukowski. Did people really lug these wordbricks around from room to room, from house to house, from relationship to relationship, from youth to old age?"}, {"eb7a": "Did scribes once sit in frosty scriptoria copying from one book to another book in fastidious inks for hundreds of hours? It must have been a faltering way to transmit data, a heavy way, a laborious way, life-wasting."}, {"477a": "A few days pass, and the woman running the bookshop has died, and the bookshop’s reasons for existing at all have died with her. Her grand-nephew is behind the counter listening to the hiss of the air conditioner, and the crackle of the holographic aquarium. There hasn’t been a customer for days. There was almost going to be a journalist travelling here from Cairo to write a poignant essay about the closure of the world’s last bookshop, but she cancelled — another water shortage in New Shanghai. She suggested he write the story himself. But he won’t. He figures he has better things to write."}, {"e9be": "And then, suddenly, it is 5pm on the last day. He switches off the holographs. Switches off the air conditioner. Organises the recycling carrier to come and take whatever they will, and to deposit any residual moneys to his avatar."}, {"b813": "He locks the doors by tapping the lifeband on his wrist. The musical note it sounds is the last note in a symphony of bookshops that has stretched on for centuries."}, {"7311": "He climbs on his aerocycle, and spirals upward slowly into the quiet sunset. He will not come back. Before leaving, he looks down at the building with its long shadow. This was once a bookshop. The last of its kind. A vapour-collar forms around the aerocycle as he javelins off into the sunset."}, {"3a59": "And in his satchel he has taken one book. It is a book of poems by the Cavalier Poets. He doesn’t mind its heft. He feels somehow it anchors him, not just to his past, but to the world, and the world’s past."}], "child": "1856_1\t1856_2\t1856_3"}