{"name": "1857", "parent": "", "content": "Aren’t We all Envious of Something? The Trials and Tribulations Everyone has a something their envious of. It’s the old people with curly hair wish they had straight hair and vice versa. They want that fancy car, the latest cell phone, a perfect relationship, the better job, higher pay, the ability to drop everything and travel the world, more cats than humanly possible to care for. Envy will eat you up if you let it. It can become an unhealthy obsession. It acts as motivation to do things you don’t want to do in order to get what you want. Or, you might be the type of person who says, “I wish I had that,” and go back to your already life without a second thought of what you don’t have. I too am envious. Not of something I’ve ever experienced face to face, but rather something I’ve seen on websites and magazines. So here it is, I’m fessing up. I’m coming clean. I wish I had one of these rooms in my house. You can contribute to my writing habit by clicking this link. You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.” ", "title": "Aren’t We all Envious of Something?", "sentences": [{"3bcd": "Aren’t We all Envious of Something?"}, {"48c5": "The Trials and Tribulations"}, {"447c": "Everyone has a something their envious of. It’s the old people with curly hair wish they had straight hair and vice versa. They want that fancy car, the latest cell phone, a perfect relationship, the better job, higher pay, the ability to drop everything and travel the world, more cats than humanly possible to care for."}, {"dcd1": "Envy will eat you up if you let it. It can become an unhealthy obsession. It acts as motivation to do things you don’t want to do in order to get what you want."}, {"6d91": "Or, you might be the type of person who says, “I wish I had that,” and go back to your already life without a second thought of what you don’t have."}, {"e94d": "I too am envious. Not of something I’ve ever experienced face to face, but rather something I’ve seen on websites and magazines."}, {"5831": "So here it is, I’m fessing up. I’m coming clean. I wish I had one of these rooms in my house."}, {"f9d1": "You can contribute to my writing habit by clicking this link."}, {"05c8": "You can follow my absurd life on Facebook and my cats on “The Crazy Cat Lady Photo Blog.”"}], "child": "1857_1\t1857_2\t1857_3\t1857_4\t1857_5\t1857_6\t1857_7\t1857_8"}