{"name": "1858", "parent": "", "content": "Something Is Not Better Than Nothing: Embracing Negative Space In Your Product Development Process You’ve heard the idiom “less is more,” and that’s precisely the path you should consider when building your product. Negative space is a well known concept used in traditional art, design, interior decorating, and other disciplines to effectively convey something through what is not there. When I refer to negative space in the produce development process, I mean the temptation to just do this, or just do that to the product because the space to do so simply exists. Instead, leverage that negative space as a reminder to stay disciplined. Do not give in to the continued temptation to just do something because you can. Acting on this temptation is a lot more expensive than you might think. It sounds painfully obvious, I know. But herein lies the truth: as a Product Manager, it’s natural to over-trust your intuition, and even more difficult to identify when you’re doing so. Couple this with the fact that you have the means to execute, and soon we see that the struggle is real! What’s a little change here, or an completely intuition-based feature there? Resisting filling this negative space is not quite as easy as it sounds and requires discipline to achieve fully over time. When you get the because you can itch (and successfully identify it as such), use the negative space itself to remind you to refocus that energy on pursuing validated, permanent and measurably higher impact tasks. The benefits are two-fold: this will provide your users with more long-term value and you’re maximizing your opportunity cost. When designing a product, I often have to remind myself what it is not. This helps to keep things focused, scoped and understood. It makes prioritizing things easier and it provides clear constraints, which are very important when it comes to being able to ship. In the context of product development, alarm bells start ringing when I hear the phrase “but something is better than nothing!”. And when you hear this, they should ring for you too. First of all, that nothing is not nothing — it’s negative space we can leverage into higher impact work! Second, something is not better than nothing when that something is reactionary, not fully validated or its reverberations not fully understood. Third and finally, builder beware: once you have real users, it’s a lot harder to remove something from your product than to add it. I really appreciate you checking this out! If you enjoyed this, feel free to recommend or share with your friends. You can also reach out and say hi on Twitter, I’m @redman. ", "title": "Something Is Not Better Than Nothing: Embracing Negative Space In Your Product Development Process", "sentences": [{"1280": "Something Is Not Better Than Nothing: Embracing Negative Space In Your Product Development Process"}, {"f583": "You’ve heard the idiom “less is more,” and that’s precisely the path you should consider when building your product. Negative space is a well known concept used in traditional art, design, interior decorating, and other disciplines to effectively convey something through what is not there."}, {"9b14": "When I refer to negative space in the produce development process, I mean the temptation to just do this, or just do that to the product because the space to do so simply exists."}, {"d55b": "Instead, leverage that negative space as a reminder to stay disciplined. Do not give in to the continued temptation to just do something because you can. Acting on this temptation is a lot more expensive than you might think."}, {"fb32": "It sounds painfully obvious, I know. But herein lies the truth: as a Product Manager, it’s natural to over-trust your intuition, and even more difficult to identify when you’re doing so. Couple this with the fact that you have the means to execute, and soon we see that the struggle is real! What’s a little change here, or an completely intuition-based feature there?"}, {"c9c0": "Resisting filling this negative space is not quite as easy as it sounds and requires discipline to achieve fully over time. When you get the because you can itch (and successfully identify it as such), use the negative space itself to remind you to refocus that energy on pursuing validated, permanent and measurably higher impact tasks. The benefits are two-fold: this will provide your users with more long-term value and you’re maximizing your opportunity cost."}, {"2b86": "When designing a product, I often have to remind myself what it is not. This helps to keep things focused, scoped and understood. It makes prioritizing things easier and it provides clear constraints, which are very important when it comes to being able to ship."}, {"e10b": "In the context of product development, alarm bells start ringing when I hear the phrase “but something is better than nothing!”. And when you hear this, they should ring for you too."}, {"ae9b": "First of all, that nothing is not nothing — it’s negative space we can leverage into higher impact work! Second, something is not better than nothing when that something is reactionary, not fully validated or its reverberations not fully understood. Third and finally, builder beware: once you have real users, it’s a lot harder to remove something from your product than to add it."}, {"5332": "I really appreciate you checking this out! If you enjoyed this, feel free to recommend or share with your friends. You can also reach out and say hi on Twitter, I’m @redman."}], "child": "1858_11858_1"}