{"name": "1859", "parent": "", "content": "When Goals and Plans Are Eclipsed by Survival Mode I worked myself into a lovely pickle at the end of 2016. I gave my manager feedback that I’d love to have a session on career planning and goals for my role in the company. I love these sorts of chats! Well, I used to. I’ve been so knee-deep in survival mode during my son’s first year of life, wrangling a puppy, and finding out that I was pregnant with number 2 when my son was 9 months old that I suddenly realized, while preparing for this chat, that I had no short- or long-term goals. “Well, what do you want life to look like in five years?” my friend asked as a prompt. After pondering this for an hour or so, all — and I do mean all — I could come up with was: “I want to sleep through the night, for more than three hours at a time.” Is that reaching too far? Goals, plans — never in short supply Rewind another 10 years and beyond. I was the straight-A student, the very nerdy girl riding horses (working at barns to pay for her horse habit) and writing novels in every spare moment. I was the one involved in 3–4 clubs or nonprofits at a time. I directed two musicals. I served on a rodeo court and was crowned for a state title as “Miss Teen Rodeo” in my first year of college. I was the news editor and editor-in-chief of the college paper. I was editor-in-chief of the college magazine. I won several national awards for my writing in college and even won trips to conferences and such. At the same time, I freelanced for the local newspaper and several state-wide publications. Ambition, plans, side projects were never in short supply. Dreams become reality This continued as I entered the professional work: I continually took more on in my roles and shaped my jobs into what I wanted them to be (and what the organization needed.) I knew that when it came time for me to start a family, I wanted to work from home. I started a side business while working full time at a university, hoping to accomplish this. Landing a job here at Buffer was an avenue I never anticipated — but something far better than my plan of making my business self-sufficient. (I have always worked better with teams than working for myself!) And all the while I still worked my dream job in my dream environment (home office!), I continued to work on some side projects and write novels. I’ve never not had 3–4 “jobs” at once. I thrive under the constant yearn to explore more, learn more, test a new skill. The tipping point: Hello, baby I remember the moment when my side projects, novel wanderings and drive faltered. It was April 24th of 2015. I found out I was pregnant with my first child. This didn’t manifest in an instant cosmic shift. We were elated about the news and new plans and tons of new projects swirled in my head. I dove into every baby and parenting book I could get my hands on, and when that initial freak-out stage passed, I attempted to dive back into the projects and novels I’d been working on. But it was like a dam had been erected. There, square in that exact part of my brain where my fiction writing and freelance design work resided. For months I battled this dam, but I felt like I was poking a thousand tons of concrete with a needle. I couldn’t even get a drop through. Oh, a year has passed? Then came baby, and somehow I blinked. It’s been a year beyond my biggest dreams, being able to work from home and raise my child at the same time. I’m so grateful for this every day and the lessons it continually teaches me! Now we’re a year into this wild adventure of parenting and as I look back on 2016 and ahead for 2017, I had a strange stumble. What do I want out of 2017? A year ago, I had the dreams: a family, a career, a side-passion-project of writing a novel a year. Well, the side project never quite happened and I sometimes feel like I’m barely holding onto the career and family. So, for 2017? I want sleep. I want an afternoon to myself every now and then. And then I shake myself a little. Who is this person? Where are my goals of publishing novels? Why aren’t I involved in a dozen nonprofits? Sleep? That’s not a “goal!” Coming to terms The hour of pondering my goals for 2017 led to a few hours of panic, then a half a day of mourning for the woman I once was. And a few days later, I’m at peace. This past year flew by, and I wouldn’t have traded a single baby snuggle for more writing time or more time on the laptop. I know the next few years will go by just as fast, and I’ll welcome that lofty-goal setting person once more. Until then, I’m on the journey of being more content with smaller (but equally impactful and more realistic) goals. I’ll work on being a better parent and teammate. I’ll strive to live more in the moment and less in my to-do list. I’ll let go of the things that don’t matter and hold to the essential. So, what do you do when life gets in the way? This will look different for every person, in each walk of life, at every different company. But after a few weeks to think back on this event and seeking lots of advice, here is how I plan to get through the next instance of survival mode eclipsing all else: Over to you Have you had moments where just getting by (or getting enough sleep) were your main goals day-to-day? What were some things that helped you cope? What advice can you give others in that same spot? We’d love to hear from you in the comments! This post was originally published on the Buffer Open blog on March 1, 2017. ", "title": "When Goals and Plans Are Eclipsed by Survival Mode", "sentences": [{"2b01": "When Goals and Plans Are Eclipsed by Survival Mode"}, {"f4ec": "I worked myself into a lovely pickle at the end of 2016."}, {"bdcd": "I gave my manager feedback that I’d love to have a session on career planning and goals for my role in the company. I love these sorts of chats!"}, {"16d5": "Well, I used to."}, {"d23e": "I’ve been so knee-deep in survival mode during my son’s first year of life, wrangling a puppy, and finding out that I was pregnant with number 2 when my son was 9 months old that I suddenly realized, while preparing for this chat, that I had no short- or long-term goals."}, {"6f6b": "“Well, what do you want life to look like in five years?” my friend asked as a prompt."}, {"9fa3": "After pondering this for an hour or so, all — and I do mean all — I could come up with was:"}, {"46a4": "“I want to sleep through the night, for more than three hours at a time.”"}, {"2bb4": "Is that reaching too far?"}, {"f4aa": "Goals, plans — never in short supply"}, {"7f8d": "Rewind another 10 years and beyond. I was the straight-A student, the very nerdy girl riding horses (working at barns to pay for her horse habit) and writing novels in every spare moment."}, {"6062": "I was the one involved in 3–4 clubs or nonprofits at a time. I directed two musicals. I served on a rodeo court and was crowned for a state title as “Miss Teen Rodeo” in my first year of college."}, {"8d4c": "I was the news editor and editor-in-chief of the college paper. I was editor-in-chief of the college magazine. I won several national awards for my writing in college and even won trips to conferences and such. At the same time, I freelanced for the local newspaper and several state-wide publications."}, {"955b": "Ambition, plans, side projects were never in short supply."}, {"4476": "Dreams become reality"}, {"8273": "This continued as I entered the professional work: I continually took more on in my roles and shaped my jobs into what I wanted them to be (and what the organization needed.)"}, {"7801": "I knew that when it came time for me to start a family, I wanted to work from home. I started a side business while working full time at a university, hoping to accomplish this."}, {"a465": "Landing a job here at Buffer was an avenue I never anticipated — but something far better than my plan of making my business self-sufficient. (I have always worked better with teams than working for myself!)"}, {"2d16": "And all the while I still worked my dream job in my dream environment (home office!), I continued to work on some side projects and write novels."}, {"c0fa": "I’ve never not had 3–4 “jobs” at once. I thrive under the constant yearn to explore more, learn more, test a new skill."}, {"2162": "The tipping point: Hello, baby"}, {"e124": "I remember the moment when my side projects, novel wanderings and drive faltered."}, {"a221": "It was April 24th of 2015. I found out I was pregnant with my first child."}, {"4c56": "This didn’t manifest in an instant cosmic shift. We were elated about the news and new plans and tons of new projects swirled in my head."}, {"3540": "I dove into every baby and parenting book I could get my hands on, and when that initial freak-out stage passed, I attempted to dive back into the projects and novels I’d been working on."}, {"3f21": "But it was like a dam had been erected. There, square in that exact part of my brain where my fiction writing and freelance design work resided."}, {"be00": "For months I battled this dam, but I felt like I was poking a thousand tons of concrete with a needle. I couldn’t even get a drop through."}, {"dc3f": "Oh, a year has passed?"}, {"fb8f": "Then came baby, and somehow I blinked."}, {"45b4": "It’s been a year beyond my biggest dreams, being able to work from home and raise my child at the same time. I’m so grateful for this every day and the lessons it continually teaches me!"}, {"f6aa": "Now we’re a year into this wild adventure of parenting and as I look back on 2016 and ahead for 2017, I had a strange stumble."}, {"4916": "What do I want out of 2017? A year ago, I had the dreams: a family, a career, a side-passion-project of writing a novel a year. Well, the side project never quite happened and I sometimes feel like I’m barely holding onto the career and family."}, {"c920": "So, for 2017? I want sleep. I want an afternoon to myself every now and then."}, {"529f": "And then I shake myself a little. Who is this person? Where are my goals of publishing novels? Why aren’t I involved in a dozen nonprofits? Sleep? That’s not a “goal!”"}, {"c29c": "Coming to terms"}, {"5d78": "The hour of pondering my goals for 2017 led to a few hours of panic, then a half a day of mourning for the woman I once was."}, {"1c98": "And a few days later, I’m at peace."}, {"0839": "This past year flew by, and I wouldn’t have traded a single baby snuggle for more writing time or more time on the laptop. I know the next few years will go by just as fast, and I’ll welcome that lofty-goal setting person once more."}, {"e453": "Until then, I’m on the journey of being more content with smaller (but equally impactful and more realistic) goals."}, {"6dd8": "I’ll work on being a better parent and teammate. I’ll strive to live more in the moment and less in my to-do list. I’ll let go of the things that don’t matter and hold to the essential."}, {"8c56": "So, what do you do when life gets in the way?"}, {"bdcc": "This will look different for every person, in each walk of life, at every different company. But after a few weeks to think back on this event and seeking lots of advice, here is how I plan to get through the next instance of survival mode eclipsing all else:"}, {"bff9": "Over to you"}, {"bcd0": "Have you had moments where just getting by (or getting enough sleep) were your main goals day-to-day? What were some things that helped you cope? What advice can you give others in that same spot? We’d love to hear from you in the comments!"}, {"53d5": "This post was originally published on the Buffer Open blog on March 1, 2017."}], "child": "1859_11859_1"}