{"name": "1860", "parent": "", "content": "The Power of Company Retreats: Thoughts after the 8th Buffer Retreat By now we have a fairly long history of doing retreats at Buffer. We’re now a 75 person team, and we just wrapped up our 8th company retreat in Madrid, Spain. Here’s a quick history of retreat locations, timeline and size over time: It’s been a wild ride for us at Buffer, to this point where the regular company retreat is a very clear part of our culture. Each retreat has felt a little different, and the nature of the retreat evolves as the company grows and our vision and culture advances. The purpose of a retreat, from a CEO perspective As CEO of a 75 person remote team, I see the retreats as an essential part of the work we do together. I firmly believe that if we would operate the company without these regular face to face gatherings, we would be less effective and feel less connected. When we were a team of less than 30 people, the retreats felt like they could be a productive day-to-day work time for us. A shift towards working together, but continuing with the projects we happened to be working on. In addition, when we were smaller, we would do the retreats more regularly (around every 4–7 months). By doing them more frequently, and having a smaller team, the retreat itself was not as much of a monumental event, because it would come around again quite fast. Today, we do it less frequently: this retreat was 1 year after our last one in Hawaii. As a result, today our retreats serve less of a purpose of immediate productivity, and are more geared towards long-term productivity and meaningful connectedness of the team. We focus all of our sessions throughout the week on brainstorms and higher level discussions that will have an impact for months going forward. As CEO, I find that beyond the opportunity I have to provide leadership, set vision and create alignment, the real purpose of retreats is to listen. I try my best to float in and out of different groups, whether for lunch or dinner, in sessions during the day, activities on off days or drinks in the evening. In these very different groups, I am part of the conversation but also sitting and listening, and trying to take a lot in. Of course there will always be blind spots for me as a leader, and so I lean on the leads I work with too, but I try my best to be present and soaking up the joys and frustrations that I hear expressed. Each retreat is an opportunity to take this in, and try to act to improve our culture and working processes further. Timing of a retreat The context within which a retreat happens is a key component of how it will feel, and the goals we try to have in mind. 2016 was a difficult year for Buffer, we had layoffs and then at the start of this year, my co-founder Leo and I came to the conclusion for him to move on from Buffer. Our CTO Sunil also decided to leave the company at this time too. A lot of change for a single year. It’s been rocky. We’re now in a great position and have rebuilt our cash reserves to over $2.4m since the low point of $1.3m around our cash flow crisis. As a result, at retreat it was important to acknowledge the past year. Morale is still in recovery from those ups and downs, and the team gathering in Madrid could not have come at a better time. We had sessions in which people could open up about those feelings, and we also had a lot of serendipitous conversations around the future. All in all, I think we did a good job of acknowledging the challenges, and also sharing the excitement with each other about our future. We shifted towards this throughout the week, and almost all teams focused on their vision for 2017. I shared a lot of my own ideas around the company and product vision going forward, and we have a huge number of opportunities based on our solid foundation of products, customers, culture and profitability. Being a key part of retreat as an introverted CEO I am lucky to have an incredible team I work with on retreat, and this year Stephanie really took on the task wholly and I didn’t need to be too involved in the planning. At the same time, I am leading the retreat in many ways, I officially start it and I run many sessions. Especially since retreats are not cheap (our budget for Madrid was $400,000) I strive to reflect on how we get the most out of the time and take a lot of personal responsibility for that. The retreat itself is a week packed with so much energy and happiness. We are all incredibly excited to see each other after a year apart, and this year around 25 people were on retreat for the first time, meeting almost all the team for the first time. I am an introvert, around 85–90% introvert vs extrovert in most tests I take. In the past, this has at times led to debilitating situations after long periods of social stimulation. Around 4–5 years ago, I started to understand myself much more clearly, and I now find in general I can take the action I need to in order to feel recharged most of the time. During retreat, I took a 20–45 minute solo walk each day during the week. At an appropriate time in the afternoon between sessions, I’d just head out of our work space and go walk up the nearby hill. After a day with a lot of social interactions, my mind can feel clouded and I find it hard to think and articulate clearly when I am drained. It’s always fascinating to me how quickly I can recover from this and feel energized, sharp and ready to be amongst people again. A few times this was essential was before my fireside chat with the Madrid community at Google Campus, before our Sunday welcome drinks and before our Wednesday evening team dinner. I have found that it absolutely is possible for me to enjoy the whole week, as long as I remember to be aware of my energy levels and take care of myself. It’s been a hugely rewarding and energizing week. I am pumped for the rest of 2017, and I am confident we’re going to achieve some great things together. If there’s any single takeaway for me from the retreat, it is the reminder that I get to work with the best team on Earth. ", "title": "The Power of Company Retreats: Thoughts after the 8th Buffer Retreat", "sentences": [{"1073": "The Power of Company Retreats: Thoughts after the 8th Buffer Retreat"}, {"acae": "By now we have a fairly long history of doing retreats at Buffer. We’re now a 75 person team, and we just wrapped up our 8th company retreat in Madrid, Spain. Here’s a quick history of retreat locations, timeline and size over time:"}, {"3e60": "It’s been a wild ride for us at Buffer, to this point where the regular company retreat is a very clear part of our culture. Each retreat has felt a little different, and the nature of the retreat evolves as the company grows and our vision and culture advances."}, {"2849": "The purpose of a retreat, from a CEO perspective"}, {"6cd3": "As CEO of a 75 person remote team, I see the retreats as an essential part of the work we do together. I firmly believe that if we would operate the company without these regular face to face gatherings, we would be less effective and feel less connected."}, {"8e31": "When we were a team of less than 30 people, the retreats felt like they could be a productive day-to-day work time for us. A shift towards working together, but continuing with the projects we happened to be working on. In addition, when we were smaller, we would do the retreats more regularly (around every 4–7 months). By doing them more frequently, and having a smaller team, the retreat itself was not as much of a monumental event, because it would come around again quite fast. Today, we do it less frequently: this retreat was 1 year after our last one in Hawaii."}, {"ba92": "As a result, today our retreats serve less of a purpose of immediate productivity, and are more geared towards long-term productivity and meaningful connectedness of the team. We focus all of our sessions throughout the week on brainstorms and higher level discussions that will have an impact for months going forward."}, {"49e3": "As CEO, I find that beyond the opportunity I have to provide leadership, set vision and create alignment, the real purpose of retreats is to listen. I try my best to float in and out of different groups, whether for lunch or dinner, in sessions during the day, activities on off days or drinks in the evening. In these very different groups, I am part of the conversation but also sitting and listening, and trying to take a lot in. Of course there will always be blind spots for me as a leader, and so I lean on the leads I work with too, but I try my best to be present and soaking up the joys and frustrations that I hear expressed. Each retreat is an opportunity to take this in, and try to act to improve our culture and working processes further."}, {"74b8": "Timing of a retreat"}, {"982a": "The context within which a retreat happens is a key component of how it will feel, and the goals we try to have in mind."}, {"69fd": "2016 was a difficult year for Buffer, we had layoffs and then at the start of this year, my co-founder Leo and I came to the conclusion for him to move on from Buffer. Our CTO Sunil also decided to leave the company at this time too. A lot of change for a single year. It’s been rocky. We’re now in a great position and have rebuilt our cash reserves to over $2.4m since the low point of $1.3m around our cash flow crisis."}, {"a261": "As a result, at retreat it was important to acknowledge the past year. Morale is still in recovery from those ups and downs, and the team gathering in Madrid could not have come at a better time. We had sessions in which people could open up about those feelings, and we also had a lot of serendipitous conversations around the future."}, {"27ac": "All in all, I think we did a good job of acknowledging the challenges, and also sharing the excitement with each other about our future. We shifted towards this throughout the week, and almost all teams focused on their vision for 2017. I shared a lot of my own ideas around the company and product vision going forward, and we have a huge number of opportunities based on our solid foundation of products, customers, culture and profitability."}, {"32ce": "Being a key part of retreat as an introverted CEO"}, {"998a": "I am lucky to have an incredible team I work with on retreat, and this year Stephanie really took on the task wholly and I didn’t need to be too involved in the planning. At the same time, I am leading the retreat in many ways, I officially start it and I run many sessions. Especially since retreats are not cheap (our budget for Madrid was $400,000) I strive to reflect on how we get the most out of the time and take a lot of personal responsibility for that."}, {"1a91": "The retreat itself is a week packed with so much energy and happiness. We are all incredibly excited to see each other after a year apart, and this year around 25 people were on retreat for the first time, meeting almost all the team for the first time."}, {"25ec": "I am an introvert, around 85–90% introvert vs extrovert in most tests I take. In the past, this has at times led to debilitating situations after long periods of social stimulation. Around 4–5 years ago, I started to understand myself much more clearly, and I now find in general I can take the action I need to in order to feel recharged most of the time."}, {"9a90": "During retreat, I took a 20–45 minute solo walk each day during the week. At an appropriate time in the afternoon between sessions, I’d just head out of our work space and go walk up the nearby hill. After a day with a lot of social interactions, my mind can feel clouded and I find it hard to think and articulate clearly when I am drained. It’s always fascinating to me how quickly I can recover from this and feel energized, sharp and ready to be amongst people again. A few times this was essential was before my fireside chat with the Madrid community at Google Campus, before our Sunday welcome drinks and before our Wednesday evening team dinner."}, {"910c": "I have found that it absolutely is possible for me to enjoy the whole week, as long as I remember to be aware of my energy levels and take care of myself."}, {"dcb3": "It’s been a hugely rewarding and energizing week. I am pumped for the rest of 2017, and I am confident we’re going to achieve some great things together. If there’s any single takeaway for me from the retreat, it is the reminder that I get to work with the best team on Earth."}], "child": "1860_1\t1860_2\t1860_3\t1860_4"}