{"name": "1862", "parent": "", "content": "How Our Remote Marketing Team Collaborates Across 6 Timezones In the past when our marketing team was only two or three people, it was easy to work on projects together. Finding time to meet and discuss was also easy, as we only had to coordinate between a few people and we were in fairly close timezones. In the past year, our marketing team has grown from a team of four to a team of eight (yay!). Timezones are mildly more of a challenge now that we are based all around the world — from the West Coast in the US to the East Coast in the US to Canada, to the UK, to Singapore! We don’t let remote work halt any productivity, so we’d love to share how we communicate, collaborate and get results. To truly reflect our team’s strategies and thoughts, several members of our marketing team have contributed the sections below! How we work across 6 timezones by Alfred Lua, Content Crafter It’s hard to find a common time in eight calendars across six timezones when everyone is free and awake! (For example, people in Singapore are usually going to bed when the people in the U.S. are just starting their work days.) Our solution: Asynchronous collaboration. Here are a few of the ways we typically collaborate asynchronously: Using Discourse to kick off an idea when others might be sleeping When there’s an upcoming marketing launch or when someone has an idea for the team, she or he will kickstart a conversation on Discourse for us to riff on the idea and share early thoughts. Here’s an example for this blog post: Other projects we have worked on together include: When collaborating as a remote team, it is key for one person to own the project and guide the team. It doesn’t always have to be the manager of the team (i.e. Kevan Lee, our Director of Marketing). Any of us on the marketing team can kick off and lead a project, and several of us have. Using a tool like Paper or Trello where everyone can track progress If we want to move forward with the idea after it’s been kicked off in Discourse, we will move our discussion to a Dropbox Paper document (if it requires a bit more writing) or a Trello board (if we’re tracking progress more closely). We all work on our own tasks when we’re online and coordinate in the Paper document or Trello card if we need to leave updates or ask questions. Using our themed content week as an example, Brian G. Peters and Hailley Griffis worked together on the podcast while Arielle Tannenbaum amazingly handled the #bufferchat planning herself. As much as possible, we will update the Paper document with our progress. If we have any questions, we will comment on the relevant sections and discuss asynchronously. Here’s an example: We found that having a central location makes asynchronous coordination much easier. We know where to look for the information we need and how we are progressing for the project. This practice has helped us coordinate big projects such as feature launches, where we also collaborate with the Product, Engineering, and Happiness teams. Using Slack to chat quickly and Zoom for meetings Slack is an amazing tool to keep us all connected, help us ask quick questions when another teammate is online, keep everyone up to date with the latest in social media and, all in all, be together as a team. Zoom is our preferred tool for having face-to-face calls for meetings, brainstorms and our weekly standup. How we build the Buffer community remotely by Arielle Tannenbaum, Community Strategist Being part of a well-oiled remote team has been instrumental in helping us build a remote community of customers and evangelists. We’re experimenting with new processes for communication all the time as a team, and it’s such a cool experience to take our learnings and apply them to how we grow our community. We have over 4 million users who interact with us on many platforms — on all of our social media platforms, through emailing us, and commenting our blog. It’s amazing to get to know all of them! We’re found that when folks respond to our social media posts, they’re looking for one or more things: to learn new information, to get better at their jobs, to grow personally, and to gain new connections. By building an engaged and active online community, we create opportunities and spaces for all of that to happen! We focus on ways to increase “many to many” interactions, so our members are constantly meeting new people and learning a lot from each other. That’s where the magic happens — when community members support and teach each other! Image above is via Alex Hillman Our community “spaces” include our Slack community, our weekly Twitter chat called #bufferchat, and occasional in-person meetups and workshops in cities all over the world. We have a landing page for all of our community activities, if you’d like to take a look! So how do we organize all of this remotely? Here are some of our tricks for managing these projects. Managing our Twitter chat with Respond We aim to have 2–4 team members tweeting from Buffer’s Twitter handle during #bufferchat, to interact with the hundreds of participants that show up every week! We could not do this without one of our very own tools, Respond. Respond is a robust Twitter customer support tool, taking all Twitter mentions (and tweets from search terms like “#bufferchat”) and organizing them into an inbox. This way, multiple team members can be responding from the same handle without overlapping on tweets. It has been a lifesaver for #bufferchat! It’s our secret sauce for how we respond to all of your tweets so quickly. :) Setting reminders in Slack When you manage a community of thousands, having a little bit of order can be super helpful. In our Slack community, there are several tasks that happen every week like clockwork, though it can difficult to remember to do dozens of small things! That’s why the “remind” feature within Slack has been a game-changer. You can use the “/remind” command in Slack to set recurring reminders — we set reminders for things like welcoming new members, inviting new members, posting about a weekly event, checking stats, etc. It’s meta — using Slack reminders to remind us to do things in Slack — and it saves us loads of time. Organizing events in Asana If you’ve ever planned an event before, you know that there are a lot of tasks, big and small, that go into it. When we plan our meetups and workshops in different cities all over the world, Asana is the place where we keep our dozens of to-dos. This project management tool comes in handy as you can set due dates for specific tasks and assign certain tasks to teammates, so nothing slips through the cracks. There are so many moving pieces with events that it’s key to have one place to keep everything! How we run the Buffer blog remotely by Ashley Read, Editor of Buffer’s Social Blog When it comes to managing the blog, we’re in an almost constant state of experimentation — from the types of content we write and the ways we formulate our strategy, to how we turn an idea into a ready-to-publish blog post and even how we measure success. We tend to tackle most of our work on the blog asynchronously, using tools like Dropbox Paper (for drafts and planning) and Trello (for managing our editorial calendar). Here’s how our Trello board looks for February: If you want to check it out in more detail, we’ve opened it up publicly. Here’s how we currently approach the process of creating content for our blog: For Q1 2017, we’re experimenting with using content themes each month. During January we had a new theme each week: In February, we’re mixing things up slightly and running with three themes across the whole month: When deciding on a theme, we use a mix of research and intuition. Over time, we’ve built up a good understanding of which topics resonate with our audience and we tend to lean on this experience for our initial brainstorm into topics. We then turn to data to validate the opportunities within each topic. The data we look at is: Once we’ve taken these points into consideration, we’ll decide on a topic and then break that topic down into a bunch of post ideas. We’re also quite fluid with our planning, so if something big happens, we can shuffle things around and jump into whatever topic is trending in the social media/marketing industry. For example, last year when Instagram Stories launched, we dropped everything to get a post out covering how the new features work and this post was viewed over 45,000 times in the 7 days after publishing (it still brings in between 500–1,000 views per day today). How this looks in action As a remote team, the majority of the work we do on our blog happens asynchronously. Once we have a blog post idea, we’ll add it to Trello, first in the ‘Content Ideas’ column, then it’ll move along each column as we get further into writing it until it’s shipped. Here’s what our board looks like: When we decide to write a post, we’ll then add a little context to the Trello card to help share a little clarity on what some of the key points this post should talk about and cover. Here’s an example for our recent Facebook Ads Images Sizes and Specs post: From here, it’s time to write the draft. When writing a post, we check in for feedback at two stages: First, when the draft is ~30% complete and again when it’s 90% complete. We check in at 30% to chat more about structure and layout of the post and then at 90% we focus on details and copy editing. Sometimes, we’ll handle all these conversations on Trello, with the draft and back-and-forth feedback being shared within the card for each post. Other times we’ll hop on a quick video chat using Zoom to chat through feedback. The amazing thing about working across timezones with the blog is that we almost have someone working on content 24 hours a day with Alfred in Singapore, Ash in the UK and Kevan, Brian, and Spencer in the US. This feels a like a huge win for productivity. 😃 How we brainstorming remotely by Hailley Griffis, PR and Communications Specialist One of the challenging parts of working remotely is that brainstorming might not come as naturally. Whereas in an an office the team can gather in a room, or toss ideas around at lunch, we have to be very intentional about our brainstorming. We’ve experimented with different styles and types of brainstorming. In one quarter of 2016, we did a brainstorming meeting every Friday afternoon for whoever was around. While we loved gathering in one virtual place, the time didn’t quite work for all timezones once our team grew. We also found that small frequent brainstorming was good for when someone was working on a project and needed another set of eyes, but the short amount of time together made it hard for us to look at the big picture. The last quarter of 2016, we had a marketing team wide brainstorm that lasted an hour to reflect on 2016 and brainstorm for 2017. First, we had to find a time when we are all awake: Here’s how we structured the meeting: Ash, our social blog editor, put forward a content plan that would have us all working more closely together on themed weeks of content, so we took the second part of this meeting to brainstorm and plan this new initiative. We wanted to have a plan in place to give everyone time to speak. Here’s how that worked: When we all get together on our annual Buffer retreat, we can take full advantage of brainstorming in person and potentially having more room to let ideas take place organically while we are all spending time together. (Here’s a screenshot from that end of year brainstorm! From left to right, Spencer, Hailley, Brian, Arielle, Bonnie, Kevan, Alfred, David, and Ash — David was our Marketing Data Analyst and has since switched over to focusing purely on the Data team, though we still ask him questions frequently!) There are always ways to improve our set up and systems. If you have any ideas, thoughts or pieces of advice, we’d love to hear from you! Over to You Originally published on Buffer Open blog on February 7, 2017 by Hailley Griffis. ", "title": "How Our Remote Marketing Team Collaborates Across 6 Timezones", "sentences": [{"11e5": "How Our Remote Marketing Team Collaborates Across 6 Timezones"}, {"f403": "In the past when our marketing team was only two or three people, it was easy to work on projects together. Finding time to meet and discuss was also easy, as we only had to coordinate between a few people and we were in fairly close timezones."}, {"0ac6": "In the past year, our marketing team has grown from a team of four to a team of eight (yay!). Timezones are mildly more of a challenge now that we are based all around the world — from the West Coast in the US to the East Coast in the US to Canada, to the UK, to Singapore!"}, {"b152": "We don’t let remote work halt any productivity, so we’d love to share how we communicate, collaborate and get results. To truly reflect our team’s strategies and thoughts, several members of our marketing team have contributed the sections below!"}, {"389b": "How we work across 6 timezones"}, {"8ff4": "by Alfred Lua, Content Crafter"}, {"da60": "It’s hard to find a common time in eight calendars across six timezones when everyone is free and awake! (For example, people in Singapore are usually going to bed when the people in the U.S. are just starting their work days.)"}, {"1f29": "Our solution: Asynchronous collaboration."}, {"e77f": "Here are a few of the ways we typically collaborate asynchronously:"}, {"c0ef": "Using Discourse to kick off an idea when others might be sleeping"}, {"9f1f": "When there’s an upcoming marketing launch or when someone has an idea for the team, she or he will kickstart a conversation on Discourse for us to riff on the idea and share early thoughts."}, {"a883": "Here’s an example for this blog post:"}, {"4587": "Other projects we have worked on together include:"}, {"ba53": "When collaborating as a remote team, it is key for one person to own the project and guide the team. It doesn’t always have to be the manager of the team (i.e. Kevan Lee, our Director of Marketing). Any of us on the marketing team can kick off and lead a project, and several of us have."}, {"a355": "Using a tool like Paper or Trello where everyone can track progress"}, {"c84d": "If we want to move forward with the idea after it’s been kicked off in Discourse, we will move our discussion to a Dropbox Paper document (if it requires a bit more writing) or a Trello board (if we’re tracking progress more closely). We all work on our own tasks when we’re online and coordinate in the Paper document or Trello card if we need to leave updates or ask questions."}, {"4367": "Using our themed content week as an example, Brian G. Peters and Hailley Griffis worked together on the podcast while Arielle Tannenbaum amazingly handled the #bufferchat planning herself. As much as possible, we will update the Paper document with our progress."}, {"a9bb": "If we have any questions, we will comment on the relevant sections and discuss asynchronously. Here’s an example:"}, {"b91a": "We found that having a central location makes asynchronous coordination much easier. We know where to look for the information we need and how we are progressing for the project. This practice has helped us coordinate big projects such as feature launches, where we also collaborate with the Product, Engineering, and Happiness teams."}, {"6c4a": "Using Slack to chat quickly and Zoom for meetings"}, {"a4bc": "Slack is an amazing tool to keep us all connected, help us ask quick questions when another teammate is online, keep everyone up to date with the latest in social media and, all in all, be together as a team."}, {"1330": "Zoom is our preferred tool for having face-to-face calls for meetings, brainstorms and our weekly standup."}, {"d6b4": "How we build the Buffer community remotely"}, {"7152": "by Arielle Tannenbaum, Community Strategist"}, {"dd8e": "Being part of a well-oiled remote team has been instrumental in helping us build a remote community of customers and evangelists. We’re experimenting with new processes for communication all the time as a team, and it’s such a cool experience to take our learnings and apply them to how we grow our community."}, {"e896": "We have over 4 million users who interact with us on many platforms — on all of our social media platforms, through emailing us, and commenting our blog. It’s amazing to get to know all of them! We’re found that when folks respond to our social media posts, they’re looking for one or more things: to learn new information, to get better at their jobs, to grow personally, and to gain new connections."}, {"eeb5": "By building an engaged and active online community, we create opportunities and spaces for all of that to happen! We focus on ways to increase “many to many” interactions, so our members are constantly meeting new people and learning a lot from each other. That’s where the magic happens — when community members support and teach each other!"}, {"4207": "Image above is via Alex Hillman"}, {"0512": "Our community “spaces” include our Slack community, our weekly Twitter chat called #bufferchat, and occasional in-person meetups and workshops in cities all over the world. We have a landing page for all of our community activities, if you’d like to take a look!"}, {"269c": "So how do we organize all of this remotely? Here are some of our tricks for managing these projects."}, {"7672": "Managing our Twitter chat with Respond"}, {"5797": "We aim to have 2–4 team members tweeting from Buffer’s Twitter handle during #bufferchat, to interact with the hundreds of participants that show up every week! We could not do this without one of our very own tools, Respond."}, {"acd4": "Respond is a robust Twitter customer support tool, taking all Twitter mentions (and tweets from search terms like “#bufferchat”) and organizing them into an inbox. This way, multiple team members can be responding from the same handle without overlapping on tweets. It has been a lifesaver for #bufferchat!"}, {"424c": "It’s our secret sauce for how we respond to all of your tweets so quickly. :)"}, {"b16a": "Setting reminders in Slack"}, {"a4a8": "When you manage a community of thousands, having a little bit of order can be super helpful. In our Slack community, there are several tasks that happen every week like clockwork, though it can difficult to remember to do dozens of small things! That’s why the “remind” feature within Slack has been a game-changer."}, {"3ae8": "You can use the “/remind” command in Slack to set recurring reminders — we set reminders for things like welcoming new members, inviting new members, posting about a weekly event, checking stats, etc."}, {"15bc": "It’s meta — using Slack reminders to remind us to do things in Slack — and it saves us loads of time."}, {"faa2": "Organizing events in Asana"}, {"de93": "If you’ve ever planned an event before, you know that there are a lot of tasks, big and small, that go into it. When we plan our meetups and workshops in different cities all over the world, Asana is the place where we keep our dozens of to-dos."}, {"567f": "This project management tool comes in handy as you can set due dates for specific tasks and assign certain tasks to teammates, so nothing slips through the cracks. There are so many moving pieces with events that it’s key to have one place to keep everything!"}, {"24e5": "How we run the Buffer blog remotely"}, {"f241": "by Ashley Read, Editor of Buffer’s Social Blog"}, {"df97": "When it comes to managing the blog, we’re in an almost constant state of experimentation — from the types of content we write and the ways we formulate our strategy, to how we turn an idea into a ready-to-publish blog post and even how we measure success."}, {"03e4": "We tend to tackle most of our work on the blog asynchronously, using tools like Dropbox Paper (for drafts and planning) and Trello (for managing our editorial calendar). Here’s how our Trello board looks for February:"}, {"835a": "If you want to check it out in more detail, we’ve opened it up publicly."}, {"5556": "Here’s how we currently approach the process of creating content for our blog:"}, {"afef": "For Q1 2017, we’re experimenting with using content themes each month. During January we had a new theme each week:"}, {"c7a1": "In February, we’re mixing things up slightly and running with three themes across the whole month:"}, {"9a9c": "When deciding on a theme, we use a mix of research and intuition. Over time, we’ve built up a good understanding of which topics resonate with our audience and we tend to lean on this experience for our initial brainstorm into topics. We then turn to data to validate the opportunities within each topic. The data we look at is:"}, {"0845": "Once we’ve taken these points into consideration, we’ll decide on a topic and then break that topic down into a bunch of post ideas."}, {"6fcf": "We’re also quite fluid with our planning, so if something big happens, we can shuffle things around and jump into whatever topic is trending in the social media/marketing industry."}, {"bec3": "For example, last year when Instagram Stories launched, we dropped everything to get a post out covering how the new features work and this post was viewed over 45,000 times in the 7 days after publishing (it still brings in between 500–1,000 views per day today)."}, {"8740": "How this looks in action"}, {"6448": "As a remote team, the majority of the work we do on our blog happens asynchronously. Once we have a blog post idea, we’ll add it to Trello, first in the ‘Content Ideas’ column, then it’ll move along each column as we get further into writing it until it’s shipped. Here’s what our board looks like:"}, {"5881": "When we decide to write a post, we’ll then add a little context to the Trello card to help share a little clarity on what some of the key points this post should talk about and cover. Here’s an example for our recent Facebook Ads Images Sizes and Specs post:"}, {"fa2c": "From here, it’s time to write the draft. When writing a post, we check in for feedback at two stages: First, when the draft is ~30% complete and again when it’s 90% complete."}, {"ecf0": "We check in at 30% to chat more about structure and layout of the post and then at 90% we focus on details and copy editing. Sometimes, we’ll handle all these conversations on Trello, with the draft and back-and-forth feedback being shared within the card for each post. Other times we’ll hop on a quick video chat using Zoom to chat through feedback."}, {"8b6f": "The amazing thing about working across timezones with the blog is that we almost have someone working on content 24 hours a day with Alfred in Singapore, Ash in the UK and Kevan, Brian, and Spencer in the US. This feels a like a huge win for productivity. 😃"}, {"a572": "How we brainstorming remotely"}, {"163b": "by Hailley Griffis, PR and Communications Specialist"}, {"1cdb": "One of the challenging parts of working remotely is that brainstorming might not come as naturally. Whereas in an an office the team can gather in a room, or toss ideas around at lunch, we have to be very intentional about our brainstorming."}, {"69ba": "We’ve experimented with different styles and types of brainstorming. In one quarter of 2016, we did a brainstorming meeting every Friday afternoon for whoever was around."}, {"cdb9": "While we loved gathering in one virtual place, the time didn’t quite work for all timezones once our team grew. We also found that small frequent brainstorming was good for when someone was working on a project and needed another set of eyes, but the short amount of time together made it hard for us to look at the big picture."}, {"344b": "The last quarter of 2016, we had a marketing team wide brainstorm that lasted an hour to reflect on 2016 and brainstorm for 2017."}, {"bfbd": "First, we had to find a time when we are all awake:"}, {"5c1c": "Here’s how we structured the meeting:"}, {"e478": "Ash, our social blog editor, put forward a content plan that would have us all working more closely together on themed weeks of content, so we took the second part of this meeting to brainstorm and plan this new initiative."}, {"3437": "We wanted to have a plan in place to give everyone time to speak. Here’s how that worked:"}, {"36f7": "When we all get together on our annual Buffer retreat, we can take full advantage of brainstorming in person and potentially having more room to let ideas take place organically while we are all spending time together."}, {"9d41": "(Here’s a screenshot from that end of year brainstorm! From left to right, Spencer, Hailley, Brian, Arielle, Bonnie, Kevan, Alfred, David, and Ash — David was our Marketing Data Analyst and has since switched over to focusing purely on the Data team, though we still ask him questions frequently!)"}, {"62a9": "There are always ways to improve our set up and systems. If you have any ideas, thoughts or pieces of advice, we’d love to hear from you!"}, {"d437": "Over to You"}, {"1b91": "Originally published on Buffer Open blog on February 7, 2017 by Hailley Griffis."}], "child": "1862_1\t1862_2\t1862_3\t1862_41862_1\t1862_2\t1862_3\t1862_4"}