{"name": "1863", "parent": "", "content": "My advice to aspiring Product Managers A few months ago, I received an email asking for advice on the best skills and qualifications to break into a product management position at a tech company. Since then, I’ve received some similar requests so I thought it might be worthwhile to share some of that advice more widely, for anybody who is interested. Because I was specifically asked about getting a product management position at a tech startup, my advice tends to skew a little on the technical side. Hi Tom, The main reason I am reaching out is because I am currently in a financial analyst role, however I am trying to transition into a product management position (ideally for a tech startup). I have some Java programming experience, but am still very much a novice. I am therefore planning to take some night classes on UX design and coding, but am a little unsure as to what the best starting point may be. I therefore wanted to get your opinion on the following: — Which programming language you find to be the most useful in the tech start-up world — Recommendations of other courses that may be helpful — Qualifications that you find most necessary to succeed in a product management position Again, thank you for lending time from your busy schedule to speak with me, it is very much appreciated. Hey there, thanks for the message, very concise — I like that! :) It’s awesome to hear you’re interested in shifting roles — it’s super important to chase the things that might bring you the most fulfillment. And for me, doing product management for the last few months has been challenging, interesting and fulfilling to say the least. It’s really great you’ve stretched yourself to learn some Java and start thinking about UX on a deeper level. These are very strong starting points. While you don’t need to be an engineer, technical acumen is very important for a PM, so you’ve got the right idea. It’s important in gaining the trust of your developers, to know what truly is and isn’t easily possible, and to fully grasp the technical nuances and consequences of certain product decisions. I’d recommend to keep learning coding, and the best way to do that is to build something. Even if it’s quite simple. Night classes and online courses will help get you there. Keep in mind that programming can have a steep-ish learning curve which can be discouraging at times. Though if you stick through, you’ll hit a point where everything “clicks”. This is different for each person, anywhere from a few months to a few years. Irrespective of language, solid understanding of programming fundamentals and design patterns will take you the furthest as a PM. In terms of the other skills that are the most useful for effective product management, it helps to think about why product management is a role in the first place. Our biggest task is to identify and deeply understand the problems to solve. We do that by understanding data and by listening to customers. Empathy is a very important skill, used internally with the team and externally when chatting with customer (or potential customers). We then understand which of these problems are worth solving in terms of offering the most value, coupled with their alignment to the company’s values and goals. You’ll need to justify your decisions to the whole team: you need to be able to persuade the research, marketing, design and engineering teams that this is the best thing to build right now. Typically, you’ll then work with a Product Designer, whose job it is to ideate 5, 10, 20 potential solutions to the problem you’ve identified as valuable and worth solving. You don’t have to be (and probably won’t be) the expert on UX and UI — that’s the Product Designer’s role. However, you are the expert on the user, “who you are designing for” and it’s your job to make sure the Designer is keeping that user in mind. You’ll hone a “final” solution with the Designer, and then show a prototype of that to users — again an exercise in listening and empathy. Rinse and repeat until you, your researcher and designer feel like you’re ready for implementation. At the implementation step, you’ll want to provide engineers with as much distraction-free time as possible. Usually this means being the point of contact for most things and filtering out the signals from the noise, and only passing along the signals. During this part of a project, you’re kind of the glue between everything, and you need to keep everything on track — coordinate with engineers (How’s everything going? Are we on track?), coordinate with Marketing (Should this have a launch? What kind of timeline is required?) and all the while making sure you’re still building the right thing. To break it down, the top skills required are: technical depth, data analysis, listening and empathy, specific product expertise, strong UX knowledge, and organizational and people management. I’d also recommend to start thinking critically about products, software and non-software, that you use in your daily life. I love to do this with non-software products. When I come across a product I love, I think a bit about why I feel that way. Why is this awesome? What decisions were made to get here? What might have been some of the tradeoffs? How could it be improved? This will prime you not just for thinking on a higher product level in general, but also for product-related conversations and questions you might face when seeking out your new role. Good luck with your new journey! If you liked this, feel free to recommend or share! And as always you can get in touch with me on Twitter @redman. ", "title": "My advice to aspiring Product Managers", "sentences": [{"d69f": "My advice to aspiring Product Managers"}, {"5712": "A few months ago, I received an email asking for advice on the best skills and qualifications to break into a product management position at a tech company."}, {"6ca4": "Since then, I’ve received some similar requests so I thought it might be worthwhile to share some of that advice more widely, for anybody who is interested."}, {"bf1a": "Because I was specifically asked about getting a product management position at a tech startup, my advice tends to skew a little on the technical side."}, {"80f2": "Hi Tom,"}, {"2947": "The main reason I am reaching out is because I am currently in a financial analyst role, however I am trying to transition into a product management position (ideally for a tech startup). I have some Java programming experience, but am still very much a novice. I am therefore planning to take some night classes on UX design and coding, but am a little unsure as to what the best starting point may be. I therefore wanted to get your opinion on the following:"}, {"680d": "— Which programming language you find to be the most useful in the tech start-up world"}, {"84b7": "— Recommendations of other courses that may be helpful"}, {"71d0": "— Qualifications that you find most necessary to succeed in a product management position"}, {"be25": "Again, thank you for lending time from your busy schedule to speak with me, it is very much appreciated."}, {"cd6f": "Hey there, thanks for the message, very concise — I like that! :)"}, {"5c0d": "It’s awesome to hear you’re interested in shifting roles — it’s super important to chase the things that might bring you the most fulfillment. And for me, doing product management for the last few months has been challenging, interesting and fulfilling to say the least."}, {"b528": "It’s really great you’ve stretched yourself to learn some Java and start thinking about UX on a deeper level. These are very strong starting points."}, {"c1e3": "While you don’t need to be an engineer, technical acumen is very important for a PM, so you’ve got the right idea. It’s important in gaining the trust of your developers, to know what truly is and isn’t easily possible, and to fully grasp the technical nuances and consequences of certain product decisions."}, {"5431": "I’d recommend to keep learning coding, and the best way to do that is to build something. Even if it’s quite simple. Night classes and online courses will help get you there."}, {"fcad": "Keep in mind that programming can have a steep-ish learning curve which can be discouraging at times. Though if you stick through, you’ll hit a point where everything “clicks”. This is different for each person, anywhere from a few months to a few years. Irrespective of language, solid understanding of programming fundamentals and design patterns will take you the furthest as a PM."}, {"a05e": "In terms of the other skills that are the most useful for effective product management, it helps to think about why product management is a role in the first place. Our biggest task is to identify and deeply understand the problems to solve. We do that by understanding data and by listening to customers. Empathy is a very important skill, used internally with the team and externally when chatting with customer (or potential customers)."}, {"d8ad": "We then understand which of these problems are worth solving in terms of offering the most value, coupled with their alignment to the company’s values and goals. You’ll need to justify your decisions to the whole team: you need to be able to persuade the research, marketing, design and engineering teams that this is the best thing to build right now."}, {"36e0": "Typically, you’ll then work with a Product Designer, whose job it is to ideate 5, 10, 20 potential solutions to the problem you’ve identified as valuable and worth solving."}, {"2c64": "You don’t have to be (and probably won’t be) the expert on UX and UI — that’s the Product Designer’s role. However, you are the expert on the user, “who you are designing for” and it’s your job to make sure the Designer is keeping that user in mind. You’ll hone a “final” solution with the Designer, and then show a prototype of that to users — again an exercise in listening and empathy. Rinse and repeat until you, your researcher and designer feel like you’re ready for implementation."}, {"8d80": "At the implementation step, you’ll want to provide engineers with as much distraction-free time as possible. Usually this means being the point of contact for most things and filtering out the signals from the noise, and only passing along the signals."}, {"9de5": "During this part of a project, you’re kind of the glue between everything, and you need to keep everything on track — coordinate with engineers (How’s everything going? Are we on track?), coordinate with Marketing (Should this have a launch? What kind of timeline is required?) and all the while making sure you’re still building the right thing."}, {"a566": "To break it down, the top skills required are: technical depth, data analysis, listening and empathy, specific product expertise, strong UX knowledge, and organizational and people management."}, {"2f5c": "I’d also recommend to start thinking critically about products, software and non-software, that you use in your daily life. I love to do this with non-software products. When I come across a product I love, I think a bit about why I feel that way. Why is this awesome? What decisions were made to get here? What might have been some of the tradeoffs? How could it be improved? This will prime you not just for thinking on a higher product level in general, but also for product-related conversations and questions you might face when seeking out your new role."}, {"ed22": "Good luck with your new journey!"}, {"b464": "If you liked this, feel free to recommend or share! And as always you can get in touch with me on Twitter @redman."}], "child": "1863_1\t1863_2\t1863_31863_1\t1863_2\t1863_31863_1\t1863_2\t1863_31863_1\t1863_2\t1863_3"}