{"name": "1864", "parent": "", "content": "The Most Valuable Thing We’ve Done for Our Product Managers in the Last Six Months This is a real example of an email we send to all Product Managers at Buffer when a user churns. A few months ago, all the Product Managers at Buffer started receiving a direct email each time somebody churned from a paid plan at Buffer. This is arguably the most valuable thing we’ve done for our product team in the past six months, and I expect its value to compound over the coming months and years. But these emails weren’t new: the leadership team have been receiving these automated messages for a long time as a way of keeping a finger on the pulse of churned users. By sharing this with the PMs (and anybody at the company who wants to receive them), we’ve helped further reduce the chasm of understanding between a PM and their product. These emails allow us to build our intuition into the patterns and trends of churning customers. For each churn email, we ask ourselves some questions. Are they our target customer? Do they mention some specific functionality, or lack thereof? Do they mention billing or pricing? Do they sound frustrated? Happy? Over time, we’re able to internalize various patterns and use that developed intuition in guiding product decisions. In many cases, we’ll also reach out directly, not to ask for their business back — that ship has sailed — but for help. Here’s a real-life example of how I might follow up to a churn email (names have been changed): I get one response for about every 10–15 of these emails I send. Remember, these users are no longer invested in Buffer. I think there’s an Ed Sheeran song about this relationship dynamic. At this point in a customer’s relationship with Buffer, they’re no longer invested in us and may even be frustrated or angry with us, so responses are few. But there are responses, for which I’m eternally grateful, and these are another tool to help us further refine our intuition: “Jennifer” churned, but was very gracious in providing us with extra information about why, which helps us drive future product decisions. I can’t recommend enough sharing this type of information widely and regularly with at least your product team, and ideally with everybody in the company who might benefit from building their product intuition this way. If you like this, please recommend or share freely! As always, you can get in touch with me on Twitter @redman. :) ", "title": "The Most Valuable Thing We’ve Done for Our Product Managers in the Last Six Months", "sentences": [{"3bd4": "The Most Valuable Thing We’ve Done for Our Product Managers in the Last Six Months"}, {"cec9": "This is a real example of an email we send to all Product Managers at Buffer when a user churns."}, {"9f79": "A few months ago, all the Product Managers at Buffer started receiving a direct email each time somebody churned from a paid plan at Buffer."}, {"c88c": "This is arguably the most valuable thing we’ve done for our product team in the past six months, and I expect its value to compound over the coming months and years."}, {"82bd": "But these emails weren’t new: the leadership team have been receiving these automated messages for a long time as a way of keeping a finger on the pulse of churned users. By sharing this with the PMs (and anybody at the company who wants to receive them), we’ve helped further reduce the chasm of understanding between a PM and their product."}, {"066f": "These emails allow us to build our intuition into the patterns and trends of churning customers. For each churn email, we ask ourselves some questions. Are they our target customer? Do they mention some specific functionality, or lack thereof? Do they mention billing or pricing? Do they sound frustrated? Happy?"}, {"1227": "Over time, we’re able to internalize various patterns and use that developed intuition in guiding product decisions. In many cases, we’ll also reach out directly, not to ask for their business back — that ship has sailed — but for help."}, {"6446": "Here’s a real-life example of how I might follow up to a churn email (names have been changed):"}, {"09f9": "I get one response for about every 10–15 of these emails I send. Remember, these users are no longer invested in Buffer. I think there’s an Ed Sheeran song about this relationship dynamic."}, {"8d89": "At this point in a customer’s relationship with Buffer, they’re no longer invested in us and may even be frustrated or angry with us, so responses are few. But there are responses, for which I’m eternally grateful, and these are another tool to help us further refine our intuition:"}, {"73ae": "“Jennifer” churned, but was very gracious in providing us with extra information about why, which helps us drive future product decisions."}, {"ca13": "I can’t recommend enough sharing this type of information widely and regularly with at least your product team, and ideally with everybody in the company who might benefit from building their product intuition this way."}, {"0f38": "If you like this, please recommend or share freely! As always, you can get in touch with me on Twitter @redman. :)"}], "child": "1864_11864_11864_1"}