{"name": "1865", "parent": "", "content": "How to navigate a leadership transition This is what I googled the morning Sunil resigned. Now, I’m writing the piece that I needed to read that morning when the interweb seemed to come up blank in the face of my shock and sadness. If you’re experiencing this, I hope this post can be a reasonably useful and honest look at what it was like for me, and what I learned, because not a lot of people seem to experience this and go on to talk about it afterwards. “I have some tough news, perhaps shocking news. I’ll be leaving Buffer”. Whatever I’d expected to hear on our mysterious early morning call, that thought was the furthest from my mind. I pride myself on a good poker face, and staying calm and collected in tough situations. I found myself unable to see through my misted up glasses. I knew I’d likely never find another manager like Sunil, and I don’t think I ever want to. What I did want was to take care of the legacy he built at Buffer, and make our engineering team one he’d be proud of. Our globally distributed engineering team during an all-hands sync in December, 2016 — the last Sunil would lead When a leader leaves, you need to rebuild the team The first step in a successful leadership transition is to reach alignment with the new vision and direction the company is headed in. There is no time to dither here, as new trust has to be built up between leaders and the company has to re-integrate. It’s key to recognize the close relationship and trust you’ve built with your leader, is not automatically going to transfer to others. In the time immediately after hearing the news, your own section leaders (in our case, engineering managers and staff engineers) need to regroup. Without a CTO, this layer becomes the de-facto voice of engineering until a more permanent solution can be found, and it should be a strong, unified force that engineers can count on. Talk it out together, work through your feelings of shock and loss, and build your new team. Don’t just say, “it’ll be ok”. Go and make it ok. While it’s important to share and work through the complex web of emotions, and reintegrate the team, integrating without then acting doesn’t help. In the days and weeks following, find a way to get the practical things done. Set up a weekly standing meeting with the engineering leads (in our case, Engineering managers and staff engineers) to keep in sync. Make and keep a running transition doc. Make a list of accounts to transition, and name someone who should get admin access for each one Go through all the areas of knowledge the leader had and ensure transfer to someone else (in this case, Sunil was the primary caretaker of our production Mongo database, and managed the relationship with Compose) Reschedule 1:1s. For managers or staff engineers, we paired up into “mastermind” relationships, and figured out who else to take over any other 1:1s. Go through the calendar and note what regular meetings were had. Are these critical? If so, decide someone else to represent engineering (possibly with input from other leaders if it was company-wide level). Communicate what’s going on to other company leaders. We chose long-form weekly doc each week with key stats, links to key resources highlights of major areas of focus that week. We also share our weekly meeting notes transparently with the whole team (people specific items are removed for privacy). The best advice I ever got During a 1:1 shortly after hearing the news, an engineer I often rely on to tell it like it really is asked me how I was doing with my focus. Somewhat surprised, I answered honestly: I was not doing that well. I felt rudderless without Sunil and overwhelmed by the sense of responsibility. I was jumping between tasks and lacking purposeful focus in my work. The response I got was the single most important piece of advice I’ve got: This is very unfair to me. If you are not focussed, you’re letting me down, and it’s not fair because you’re my manager and I rely on you to do this. Mentally revisiting that one conversation pulled me through many moments of overwhelm. It was the bucket of water that finally cleared my head. It made me realize what I needed to do and gave me the emotional energy to do it, because I knew that it mattered how hard I tried. Sunil and Avanti meeting my parents at my childhood home in Camps Bay, Cape Town in October 2016. At this point, I’d not yet met Sunil myself, but he went over to say hi to my mom and dad. ", "title": "How to navigate a leadership transition", "sentences": [{"8001": "How to navigate a leadership transition"}, {"9050": "This is what I googled the morning Sunil resigned. Now, I’m writing the piece that I needed to read that morning when the interweb seemed to come up blank in the face of my shock and sadness. If you’re experiencing this, I hope this post can be a reasonably useful and honest look at what it was like for me, and what I learned, because not a lot of people seem to experience this and go on to talk about it afterwards."}, {"d7a3": "“I have some tough news, perhaps shocking news. I’ll be leaving Buffer”. Whatever I’d expected to hear on our mysterious early morning call, that thought was the furthest from my mind. I pride myself on a good poker face, and staying calm and collected in tough situations. I found myself unable to see through my misted up glasses. I knew I’d likely never find another manager like Sunil, and I don’t think I ever want to. What I did want was to take care of the legacy he built at Buffer, and make our engineering team one he’d be proud of."}, {"e4f3": "Our globally distributed engineering team during an all-hands sync in December, 2016 — the last Sunil would lead"}, {"9dfe": "When a leader leaves, you need to rebuild the team"}, {"91c6": "The first step in a successful leadership transition is to reach alignment with the new vision and direction the company is headed in. There is no time to dither here, as new trust has to be built up between leaders and the company has to re-integrate."}, {"6c2b": "It’s key to recognize the close relationship and trust you’ve built with your leader, is not automatically going to transfer to others. In the time immediately after hearing the news, your own section leaders (in our case, engineering managers and staff engineers) need to regroup. Without a CTO, this layer becomes the de-facto voice of engineering until a more permanent solution can be found, and it should be a strong, unified force that engineers can count on. Talk it out together, work through your feelings of shock and loss, and build your new team."}, {"b633": "Don’t just say, “it’ll be ok”. Go and make it ok."}, {"6393": "While it’s important to share and work through the complex web of emotions, and reintegrate the team, integrating without then acting doesn’t help. In the days and weeks following, find a way to get the practical things done."}, {"0c99": "Set up a weekly standing meeting with the engineering leads (in our case, Engineering managers and staff engineers) to keep in sync."}, {"4005": "Make and keep a running transition doc."}, {"2393": "Make a list of accounts to transition, and name someone who should get admin access for each one"}, {"a6c9": "Go through all the areas of knowledge the leader had and ensure transfer to someone else (in this case, Sunil was the primary caretaker of our production Mongo database, and managed the relationship with Compose)"}, {"62b3": "Reschedule 1:1s. For managers or staff engineers, we paired up into “mastermind” relationships, and figured out who else to take over any other 1:1s."}, {"36da": "Go through the calendar and note what regular meetings were had. Are these critical? If so, decide someone else to represent engineering (possibly with input from other leaders if it was company-wide level)."}, {"7b05": "Communicate what’s going on to other company leaders. We chose long-form weekly doc each week with key stats, links to key resources highlights of major areas of focus that week. We also share our weekly meeting notes transparently with the whole team (people specific items are removed for privacy)."}, {"0eb8": "The best advice I ever got"}, {"d5e6": "During a 1:1 shortly after hearing the news, an engineer I often rely on to tell it like it really is asked me how I was doing with my focus. Somewhat surprised, I answered honestly: I was not doing that well. I felt rudderless without Sunil and overwhelmed by the sense of responsibility. I was jumping between tasks and lacking purposeful focus in my work. The response I got was the single most important piece of advice I’ve got:"}, {"9a14": "This is very unfair to me. If you are not focussed, you’re letting me down, and it’s not fair because you’re my manager and I rely on you to do this."}, {"a170": "Mentally revisiting that one conversation pulled me through many moments of overwhelm. It was the bucket of water that finally cleared my head. It made me realize what I needed to do and gave me the emotional energy to do it, because I knew that it mattered how hard I tried."}, {"709c": "Sunil and Avanti meeting my parents at my childhood home in Camps Bay, Cape Town in October 2016. At this point, I’d not yet met Sunil myself, but he went over to say hi to my mom and dad."}], "child": "1865_11865_11865_1"}