{"name": "1867", "parent": "", "content": "The two pillars of engineering leadership I find it helpful to think of engineering leadership as having two pillars: management, and technical leadership. I first came to this metaphor when faced with updating an org chart and Buffer, and it struck me how the management structure (who does 1:1 with whom) missed a huge aspect of how our engineering team really runs. The 1:1 structure is half the story, if that, and I think it’s really important that it is only half the story. The twin pillars of people/process and technical leadership* The twin pillars of an engineering organization are the technical leaders and the people leaders. Both pillars are equally important and a strong engineering team will have excellent leaders in both camps, and a relationship of mutual respect and cooperation. These two leadership pillars exist side by side in harmony, working to support and strengthen each other. It is not the case that managers are “in charge” and hierarchically above engineering leaders, nor that leading engineers have “the real power”. Rather, people/process leaders (managers) and technical leaders have different strengths and represent different interests, with managers being concerned with execution, and making sure engineers are happy and productive. Shipping gets easier, better, faster over time through continually improved processes and developing engineers’ potential. Technical leaders are concerned with making the right technical choices to enable a successful team and product, and serve to unblock and enable teams technically with their expertise. These two pillars could be united at “the top” in one person, but with this structure a CTO is usually the technical thought leader and a VP Engineering type role would focus on people management and execution. The pillars do (and should) overlap There is, and has to be, overlap between the two pillars. Engineering management is a technical discipline, and these managers absolutely have to be engineers themselves with enough experience and expertise to manage other engineers and communicate fluently with the technical leaders. The engineering management side doesn’t focus on making technical decisions, but they definitely have to understand them fully to ask the right questions to balance technical needs with product/business requirements. Similarly, the technical leaders are not people managers, and shouldn’t focus on things like hiring, promotion, and giving constructive feedback, or leading project planning and management. The nature of managing means it’ll break up the deep focus chunks needed to write code and design systems, even if these tasks appeal. They do have to have people and team building skills in order to be effective technical mentors and influence the various teams within an engineering organization positively. A technical leader might lead ideas, but ideas live within people. You can’t influence the idea without having the person in whose head it resides being on board. A structure for playing to strengths, not minimizing weakness This twin pillar approach enables people to embrace and pursue what they are good at. The best technical leaders are rarely also the best people managers. The way to have great engineers is to encourage engineering as a career in itself, through a viable path to the same kind of leadership, pay and status that most management tracks tend to have for granted. This means (in theory) no more poor managers aching to get away from people and back to code, and more awesome engineers growing at the craft they love. It also means engineering management as a craft can be pursued without having to try hold down a full day job as a developer in between. Having a structure that allows great technical people to focus on technical excellence, and managers focus on the art of enabling engineers to do their best work, makes for a strong engineering team. *This structure makes most sense above the size where you find yourself needing engineering managers — likely, the point where your founder/CTO/lead dev is becoming overwhelmed and there are now too many engineers for everyone to talk to everyone else and still get anything done. ", "title": "The two pillars of engineering leadership", "sentences": [{"c6d3": "The two pillars of engineering leadership"}, {"7f3e": "I find it helpful to think of engineering leadership as having two pillars: management, and technical leadership. I first came to this metaphor when faced with updating an org chart and Buffer, and it struck me how the management structure (who does 1:1 with whom) missed a huge aspect of how our engineering team really runs. The 1:1 structure is half the story, if that, and I think it’s really important that it is only half the story."}, {"b67d": "The twin pillars of people/process and technical leadership*"}, {"a11c": "The twin pillars of an engineering organization are the technical leaders and the people leaders. Both pillars are equally important and a strong engineering team will have excellent leaders in both camps, and a relationship of mutual respect and cooperation. These two leadership pillars exist side by side in harmony, working to support and strengthen each other. It is not the case that managers are “in charge” and hierarchically above engineering leaders, nor that leading engineers have “the real power”."}, {"7822": "Rather, people/process leaders (managers) and technical leaders have different strengths and represent different interests, with managers being concerned with execution, and making sure engineers are happy and productive. Shipping gets easier, better, faster over time through continually improved processes and developing engineers’ potential. Technical leaders are concerned with making the right technical choices to enable a successful team and product, and serve to unblock and enable teams technically with their expertise. These two pillars could be united at “the top” in one person, but with this structure a CTO is usually the technical thought leader and a VP Engineering type role would focus on people management and execution."}, {"5d01": "The pillars do (and should) overlap"}, {"1c79": "There is, and has to be, overlap between the two pillars. Engineering management is a technical discipline, and these managers absolutely have to be engineers themselves with enough experience and expertise to manage other engineers and communicate fluently with the technical leaders. The engineering management side doesn’t focus on making technical decisions, but they definitely have to understand them fully to ask the right questions to balance technical needs with product/business requirements."}, {"07a5": "Similarly, the technical leaders are not people managers, and shouldn’t focus on things like hiring, promotion, and giving constructive feedback, or leading project planning and management. The nature of managing means it’ll break up the deep focus chunks needed to write code and design systems, even if these tasks appeal. They do have to have people and team building skills in order to be effective technical mentors and influence the various teams within an engineering organization positively. A technical leader might lead ideas, but ideas live within people. You can’t influence the idea without having the person in whose head it resides being on board."}, {"bdbb": "A structure for playing to strengths, not minimizing weakness"}, {"d6d4": "This twin pillar approach enables people to embrace and pursue what they are good at. The best technical leaders are rarely also the best people managers. The way to have great engineers is to encourage engineering as a career in itself, through a viable path to the same kind of leadership, pay and status that most management tracks tend to have for granted. This means (in theory) no more poor managers aching to get away from people and back to code, and more awesome engineers growing at the craft they love. It also means engineering management as a craft can be pursued without having to try hold down a full day job as a developer in between."}, {"780d": "Having a structure that allows great technical people to focus on technical excellence, and managers focus on the art of enabling engineers to do their best work, makes for a strong engineering team."}, {"7776": "*This structure makes most sense above the size where you find yourself needing engineering managers — likely, the point where your founder/CTO/lead dev is becoming overwhelmed and there are now too many engineers for everyone to talk to everyone else and still get anything done."}], "child": "1867_1"}