{"name": "187", "parent": "", "content": "Oh my, so many typos For the past thirty days or so, I have been doing two things: a) writing a post every day, hoping that at the end I will write 100 posts;b) finding typos in my posts after they are published. The sheer number of typos are unsettling. And I can only spot them when the article is published. Thank goodness for the Edit button. But I will keep on making typos for these 100 posts, even if I need to correct them later, because I am still finding my voice for future blogging. After these 100 posts, I (probably) will spend weeks researching for one post, then use a week to write and proofread it. If those long posts have typos, I will be in trouble. So please forgive me for the typos I have made for now. I will spot them and change them soon. (36/100) If you like my stuff, please click the green ❤ to share it and follow me :D My stuff: https://medium.com/@thatshirleylee ", "title": "Oh my, so many typos", "sentences": [{"84d0": "Oh my, so many typos"}, {"23cb": "For the past thirty days or so, I have been doing two things: a) writing a post every day, hoping that at the end I will write 100 posts;b) finding typos in my posts after they are published."}, {"3ca2": "The sheer number of typos are unsettling. And I can only spot them when the article is published. Thank goodness for the Edit button."}, {"63cb": "But I will keep on making typos for these 100 posts, even if I need to correct them later, because I am still finding my voice for future blogging. After these 100 posts, I (probably) will spend weeks researching for one post, then use a week to write and proofread it. If those long posts have typos, I will be in trouble."}, {"52a4": "So please forgive me for the typos I have made for now. I will spot them and change them soon."}, {"faf2": "(36/100)"}, {"9c37": "If you like my stuff, please click the green ❤ to share it and follow me :D"}, {"0844": "My stuff: https://medium.com/@thatshirleylee"}], "child": "187_1\t187_2187_1\t187_2"}