{"name": "1872", "parent": "", "content": "5 Bad Startup Ideas (with equally bad drawings explaining them) Investors pay close attention: If you’re looking for the next Yo, the next Potato Parcel, the next Uber meets SnapChat with the UI of Slack and the virality of Tinder, you’ve come to the right place. You see, I’ve spent the last few months in all out brainstorm mode. The good ideas have been put towards a startup called Incremental, which I helped found back in February. The bad ideas? Well they’re right here of course! Bad Idea #1: PerspectiveBot Anxious about a flu shot? Upset that your Coachella flight got delayed? Pissed because your Uber Pool just picked up another passenger mid-ride?? Here’s a solution that will uhh… put things into perspective. PerspectiveBot uses the latest artificial intelligence technology to ruthlessly belittle your mundane first-world problems. With over 1 million humbling facts, PerspectiveBot can bring even the most out of touch people back to cold hard reality. Starting at $79.99. Bad Idea #2: Automated card delivery service Let’s face it. Gam Gam isn’t as sharp as she used to be. And with the recent arrival of her ninth grandchild, it’s become damn near impossible for her to remember everyone’s names, let alone their birthdays. That’s when you start helping her plan for the future — a future made possible by automated card delivery services. For just $29.99/year, Hallmark will send a thoughtful, age-specific card from Gam Gam to each one of her grandkids on their birthday. Hallmark provides fast, easy setup — just tell us each grandkid’s name and birthday, and we’ll make sure they receive cards up until they start having grandkids. Bad Idea #3: Noise cancelling toilets Image by Jugo de Palabras For years the corporate restroom has been a place of great controversy. A place where a typically relaxing activity can quickly devolve into a nerve-racking standoff upon the arrival of undesired company. But not for long oh weary bathroom goer. Introducing the noise cancelling toilet — by Bose. From the folks that brought you the crisp, serene sound of noise cancelling headphones, the Bose Silent Toilet marks a key breakthrough in the rapidly-expanding toilet tech market. For just $1,499, you can “soundproof” the whole office bathroom for life. No more stand-offs, no more holding it in, no more hiding your feet on the seat. Sidenote: It appears that Google has already patented this idea. Looks like I’m not the only one making big bets on toilet tech… Bad Idea #4: Girl scout advertising Image by Jugo de Palabras Marketers are facing tough times. Spam filters are getting smarter, ad blockers are becoming more mainstream, and consumers just aren’t falling for tactics like “native” or “in-feed” anymore. It’s time to call an audible and send in the heavy hitters. With over 200 million boxes sold each year, girl scouts have the highest standing conversion rate of all time. And now, they’re ready to sell for you. Starting at $5 per house, the girl scouts will broadcast your message to any quiet, suburban neighborhood (as long as they can sell a few boxes of cookies on the side). Bad Idea #5: Paternity Clothing With all the buzz around maternity and expecting mothers, it’s easy for soon-to-be dads to get lost in the shuffle. Perk up dads — this clothing line was created just for you! With over 500 t-shirts to choose from, paternityclothing.com is a one-stop shop for expecting dads (yes, we think dads can be expecting too!). Each shirt is made of 100% cotton and comes with a third-child guarantee. Paternity t-shirts make the perfect gift for that expecting dad in your life. Get out those checkbooks… So there you have it — 5 subpar startup ideas, complete with a hastily written elevator pitch. Cuban, get at me! Special thanks to the wonderful Jugo de Palabras for assistance on some of the ideas and drawings (hint: she drew the good ones). Til next time… ", "title": "5 Bad Startup Ideas (with equally bad drawings explaining them)", "sentences": [{"15da": "5 Bad Startup Ideas (with equally bad drawings explaining them)"}, {"6f51": "Investors pay close attention: If you’re looking for the next Yo, the next Potato Parcel, the next Uber meets SnapChat with the UI of Slack and the virality of Tinder, you’ve come to the right place."}, {"1656": "You see, I’ve spent the last few months in all out brainstorm mode. The good ideas have been put towards a startup called Incremental, which I helped found back in February. The bad ideas? Well they’re right here of course!"}, {"5b2f": "Bad Idea #1: PerspectiveBot"}, {"a5de": "Anxious about a flu shot? Upset that your Coachella flight got delayed? Pissed because your Uber Pool just picked up another passenger mid-ride?? Here’s a solution that will uhh… put things into perspective."}, {"71cc": "PerspectiveBot uses the latest artificial intelligence technology to ruthlessly belittle your mundane first-world problems. With over 1 million humbling facts, PerspectiveBot can bring even the most out of touch people back to cold hard reality. Starting at $79.99."}, {"3ca6": "Bad Idea #2: Automated card delivery service"}, {"252e": "Let’s face it. Gam Gam isn’t as sharp as she used to be. And with the recent arrival of her ninth grandchild, it’s become damn near impossible for her to remember everyone’s names, let alone their birthdays. That’s when you start helping her plan for the future — a future made possible by automated card delivery services."}, {"cbfe": "For just $29.99/year, Hallmark will send a thoughtful, age-specific card from Gam Gam to each one of her grandkids on their birthday. Hallmark provides fast, easy setup — just tell us each grandkid’s name and birthday, and we’ll make sure they receive cards up until they start having grandkids."}, {"e25b": "Bad Idea #3: Noise cancelling toilets"}, {"84a1": "Image by Jugo de Palabras"}, {"6b7e": "For years the corporate restroom has been a place of great controversy. A place where a typically relaxing activity can quickly devolve into a nerve-racking standoff upon the arrival of undesired company. But not for long oh weary bathroom goer. Introducing the noise cancelling toilet — by Bose."}, {"e834": "From the folks that brought you the crisp, serene sound of noise cancelling headphones, the Bose Silent Toilet marks a key breakthrough in the rapidly-expanding toilet tech market. For just $1,499, you can “soundproof” the whole office bathroom for life. No more stand-offs, no more holding it in, no more hiding your feet on the seat."}, {"4044": "Sidenote: It appears that Google has already patented this idea. Looks like I’m not the only one making big bets on toilet tech…"}, {"544f": "Bad Idea #4: Girl scout advertising"}, {"a502": "Image by Jugo de Palabras"}, {"c822": "Marketers are facing tough times. Spam filters are getting smarter, ad blockers are becoming more mainstream, and consumers just aren’t falling for tactics like “native” or “in-feed” anymore. It’s time to call an audible and send in the heavy hitters."}, {"423b": "With over 200 million boxes sold each year, girl scouts have the highest standing conversion rate of all time. And now, they’re ready to sell for you. Starting at $5 per house, the girl scouts will broadcast your message to any quiet, suburban neighborhood (as long as they can sell a few boxes of cookies on the side)."}, {"a4a0": "Bad Idea #5: Paternity Clothing"}, {"04be": "With all the buzz around maternity and expecting mothers, it’s easy for soon-to-be dads to get lost in the shuffle. Perk up dads — this clothing line was created just for you!"}, {"1add": "With over 500 t-shirts to choose from, paternityclothing.com is a one-stop shop for expecting dads (yes, we think dads can be expecting too!). Each shirt is made of 100% cotton and comes with a third-child guarantee. Paternity t-shirts make the perfect gift for that expecting dad in your life."}, {"ca3f": "Get out those checkbooks…"}, {"b4ae": "So there you have it — 5 subpar startup ideas, complete with a hastily written elevator pitch. Cuban, get at me!"}, {"f378": "Special thanks to the wonderful Jugo de Palabras for assistance on some of the ideas and drawings (hint: she drew the good ones). Til next time…"}], "child": "1872_1\t1872_2\t1872_31872_1\t1872_2\t1872_3"}