{"name": "1878", "parent": "", "content": "Does China Have an Unfair Competitive Advantage in IoT? Here are the folks at research firm Rethink Research discussing Huawei’s warning that this LTE NB-IoT hype is just a little overdone and that the technology for now is mainly for smart meters. The warning about NB-IoT use case limitations is something I’ve mentioned previously, but what caught my eye was some stark differences on pricing. As I mentioned last week, Verizon announced plans to charge $2 per month for its entry level (i.e. smart meter/once per day message) per LTE CAT M1 endpoint in the USA, but this is positively affordable compared to Deutsche Telekom’s NB-IoT pricing of EUR 9.95 per month for each connected machine. (!) I wonder what Verizon and DT customers will think when they learn that China Telecom will charge $0.15 per month per smart meter for its NB-IoT endpoint? Smart meters will only be transmitting incredibly small amounts of data on an operator’s network. Xujianmin suggested that China Telecom will be charging $0.15 per month per smart meter device connection. Now, applying pricing in China to pricing in the U.S. and Germany is not necessarily apples-to-apples, and China may simply be selling NB-IoT services below cost in order to grab market share, stimulate a nascent industry, etc. But global cellular LPWAN markets are all launching at around the same time, have common infrastructure and silicon providers, and … a 1,333% difference between Verizon in the USA and China Mobile in China is kind of shocking, no? A 7,026% difference between Deutsche Telekom and China Mobile is … beyond shocking. So either a) China Mobile is radically selling below cost, b) China Mobile has an amazing unfair cost structure advantage vis-a-vis the rest of the world’s carriers, or c) Verizon and DT finance departments don’t do marketing. Whatever the case, I think cellular IoT pricing is one of its biggest challenges, especially in commercial/industrial markets and China Mobile just highlighted this for the world to see. If you liked this article, please hit the ❤ icon below and follow me. ", "title": "Does China Have an Unfair Competitive Advantage in IoT?", "sentences": [{"cab1": "Does China Have an Unfair Competitive Advantage in IoT?"}, {"a947": "Here are the folks at research firm Rethink Research discussing Huawei’s warning that this LTE NB-IoT hype is just a little overdone and that the technology for now is mainly for smart meters."}, {"55c9": "The warning about NB-IoT use case limitations is something I’ve mentioned previously, but what caught my eye was some stark differences on pricing."}, {"3326": "As I mentioned last week, Verizon announced plans to charge $2 per month for its entry level (i.e. smart meter/once per day message) per LTE CAT M1 endpoint in the USA, but this is positively affordable compared to Deutsche Telekom’s NB-IoT pricing of EUR 9.95 per month for each connected machine. (!)"}, {"0190": "I wonder what Verizon and DT customers will think when they learn that China Telecom will charge $0.15 per month per smart meter for its NB-IoT endpoint?"}, {"64c1": "Smart meters will only be transmitting incredibly small amounts of data on an operator’s network. Xujianmin suggested that China Telecom will be charging $0.15 per month per smart meter device connection."}, {"c536": "Now, applying pricing in China to pricing in the U.S. and Germany is not necessarily apples-to-apples, and China may simply be selling NB-IoT services below cost in order to grab market share, stimulate a nascent industry, etc. But global cellular LPWAN markets are all launching at around the same time, have common infrastructure and silicon providers, and … a 1,333% difference between Verizon in the USA and China Mobile in China is kind of shocking, no? A 7,026% difference between Deutsche Telekom and China Mobile is … beyond shocking."}, {"943d": "So either a) China Mobile is radically selling below cost, b) China Mobile has an amazing unfair cost structure advantage vis-a-vis the rest of the world’s carriers, or c) Verizon and DT finance departments don’t do marketing. Whatever the case, I think cellular IoT pricing is one of its biggest challenges, especially in commercial/industrial markets and China Mobile just highlighted this for the world to see."}, {"33ba": "If you liked this article, please hit the ❤ icon below and follow me."}], "child": "1878_1"}