{"name": "1880", "parent": "", "content": "After 6 incredible years at Buffer I’m moving on to something else On January 3rd 2011, I remember talking with Joel on Skype. We were catching up about life and his projects. I remember asking for some advice on a prototype to create student surveying software that I was working on at the time. Joel also caught me up on the progress of his project “bfffr”, which he had launched just a few weeks earlier: Just over 100 free signups and 3 paying. My jaw dropped, that was incredible! Only a couple months before, I had put my email into Joel’s splash page to keep up with bfffr’s developments: I asked him what his plan was from here and quickly we ended up brainstorming about his ideas and the opportunities for bfffr’s future. I got very excited and wanted to help out in any way I could and after the call we had an action plan for how I could help: monitor and grow @bfffr’s Twitter account for 30 minutes a day. I was ecstatic! What followed was a rollercoaster ride for 6 years, which changed my life in a way that I would have never dreamed of would ever happen. During that time, I: I’m still in awe when I reflect on everything that has happened to me in the last 6 years. Despite a lot of my privilege that I’ve become aware of as I got older, it seemed unlikely to me to be where I am today, growing up in a modest household in a 5,000 person town on the countryside in Austria, barely wanting to abandon small town life and taking the step to go to high school in the “big city” a.k.a. Vienna there. I’m grateful for all the help I’ve received from so many friends, family and advisors and supporters in that time and I see it as a great responsibility to pay it forward and pass along what I learned to others who are looking to find their own path in startups. 2 of my favorite Buffer episodes in detail With the many stories that are to tell, I want to pick out 2 things that we have done, that I think had a meaningful impact: Salary transparency The initiative that particularly stands out for me was to go public with Buffer’s salary structure and the incredible response this garnered from the tech community. For some backstory on this initiative: We had just completed the finalizing of our first draft of the Buffer values in early 2013, made some difficult team changes and had spelt out transparency as a key thing we wanted to focus on. From then onwards, we kept on thinking about where we were and where we weren’t living up to our values in detail. Throughout the summer of 2013, I remember debating at various times with Joel about the potential value of making salaries internally as well as externally public with the underlying idea of also adding a strong salary formula to determine salary fairly and without bias for everyone. We felt more and more that becoming completely transparent with our salaries would eliminate sources of potential unnecessary conflict around negotiation and pay inequality. On top of that, it’d allow us to show our customers and the world at large, how we were thinking about compensation for our team and potentially help other startup founders out there who were struggling to figure this out for themselves. All of this also felt like a huge taboo and I remember sitting and discussing with Joel on the eve of announcing this in late December. We discussed and anticipated a potential backlash or otherwise simply little interest in the fact that a small company was releasing their salary information. When we then went ahead with announcing it on the 19th of December in 2013, we couldn’t believe our eyes when we saw the response. Within less than 24 hours, we had over 100,000 people check out our salary formula and open salary data. What blew me away the most however, was the sincere gratitude people expressed to us for kicking off a movement in transparency, unbeknownst to us at the time which some people saw as furthering the close of the gender pay gap and general reduction of inequities in pay across tech companies. Having played a small part in that meant a lot to me. Here is our original post from back then, which I just noticed garnered over 400 comments. Downtime and rallying in Sydney Another episode that I remember very fondly is really a rather small episode. It was early 2015 and we were on our 4th Buffer retreat with about 25 Bufferoos in Sydney. We had a magical time as we were working together, seeing a concert at the Sydney opera house, surfed together and so much more. One day, we had a field trip to the Sydney Zoo, which was a really great experience, except that half-way through the day, we ran into a big issue, which brought one of our social media services down. We sat down at the zoo’s restaurant and all rallied together to resolve the issue and get back up and running. Afterwards, we also came together in the hotel conference room to work on customer service tickets together as a team: In hindsight, it was just a blip, but it somehow represented something more than that. This incredible sense of cohesion and working on something together that’s bigger than you. It was a special bonding moment, that I know brought us all closer together as a team and made us that much better at coping with future challenges and issues. Why move on? As Joel outlined in his blogpost, we discovered that there are naturally different ways that one can run a great company. Over the last few years, and particularly the last 6 months, we noticed that slowly some differences were emerging between how Joel would approach execution and how I would in various instances. When we discussed topics like new product offerings, the spectrum of nurturing versus performance for bringing on new team members, being customer-centric versus team-centric, we were more often than not starting to fall on differing parts of the spectrum. Personally, I see it as quite natural. Joel and I both had the chance to learn about building a company and to figure out what style it is that gets us excited every day. Learning that some of these motivations differ between us felt like a positive realization and it’s a big reason for why we’re parting ways. As for the examples above, I’ve naturally fallen closer to a more traditional path, and also being more on the action side. No surprises there for anyone that might have worked with me in the past before. Another reason emerged after Joel and I had a candid conversation on how we’re structured as CEO and COO over the last 6 months or so and recognized some challenges in it. Joel shared this article with me, which I thought explains some of the struggles well of what’s been going on. Joel shared with me, that a big vacuum has opened up for him to feel truly fulfilled and connected to the team in his current role and in some discussions. I fully recognize this and want to fully support Joel in his ambition here to step back into more of an operating role going forward. This made me ponder what my role going forward should possibly be and how I can help Buffer the most. Given both of those reasons, I came to the conclusion that my place with Buffer is not in an operational role going forward. In stepping away from my day to day duties, I want to let Joel fully step back into the day to day management and make space for him to fully develop and execute on the vision he has set out for Buffer. With that, I see myself as Buffer’s biggest cheerleader and even though I’m not operationally active, Joel and I are both excited for me to step into a non-executive role as an advisor as well as being a member of the board going forward. My plan with this role is to keep being a sounding board to Joel, our investors and the team, particularly the executive team as we’re maneuvering the next chapter of Buffer together. Personally, I’m really excited for Buffer’s next steps and have full confidence in Joel, especially now that he can fully lean into the direction that he thinks is best for Buffer. Joel has long been inspired by companies such as Basecamp, Mailchimp, Patagonia, Union Square Hospitality group and others, which I know will serve as great role models for the company that Buffer will become. Special thanks and gratitude I’m particularly grateful to Joel, who from the very start supported my naive approaches and kept on coaching me and providing feedback to me on how to get better and improve the relationship with our customers, partners and team members. Some highlights I particularly remember were arguments I got into on Twitter with potential new customers, where Joel helped me see things from their side and helped me turn the situation around. The same is true as we approached building partnerships with new companies to integrate Buffer, to stay true to our values and always follow up with politeness and trying to genuinely see things from the other person’s perspective. I remember many emails Joel and I sat over for many hours over the years to really get the tone and experience right and truthfully understand people as much as possible. I think this has led to great success for Buffer and also for me personally in learning how to deal with people compassionately and also move the company forward. It’s the kind of learning that I don’t know if I’d have been able to pick up anywhere else in life and I cherish this greatly. I’m also particularly grateful for the amazing group of people that make up the Buffer team as it stands today, to Caro, Kevan, Åsa and Caryn for having become a true rock of solidity to Buffer that a big part of the company relies on. I’ve learned so much from all of you throughout the years. I’m grateful to Courtney, who particularly opened my eyes to diversity and the importance of it and my ignorance of it for the longest part of my life, it’s really changed how I get to view the world today. A special thanks also to Sunil, Buffer’s CTO, who is also moving on from Buffer, who worked tirelessly for many years to help Buffer become the solid platform that it is today, processing millions of social media posts daily. Since deciding to leave, Sunil and I had a discussion to continue working together on our new idea, Matter, and I’m excited to share more on that below. I’m grateful to all the other Bufferoos, Max, Nicole, Steven, Katie, Tom, Dan, Mary, Brian, Michael, DaveO, Niel and so many others (I know I’m forgetting some here!), which I had the chance to work with over the last few years. The more I reflect on it, the more I’m grateful that we were able to bring such a compassionate group of people together, who truly think about how we treat each other and our customers. I’m excited for Buffer in 2017! To new waters and explorations! What’s next for me? After lots of reflection in the last few weeks and coming to the conclusion to leave together with Joel, I am venturing out into the world again looking for what to do next. And I quickly started to do some scheming and found a very fulfilling area I want to dive in more: Diversity and Inclusion in tech. I’ve had some deeply personal experiences around how little I understood about the difficulty many underrepresented minorities and marginalized groups face, where I believe there is incredibly positive forward momentum and also so much more great work to be done, that I’m excited to help contribute. You can learn more about my new company Matter here: matterapp.io I’m also really excited to announce that Sunil Sadasivan will be joining me on this new endeavor with Matter, to work on our mission to help change diversity and inclusion in tech, where I believe there’s so much important work to be done. If you’re interested, you can find out more about it here! I’ll be sharing lots more details for it over the coming weeks. Thank you all for your support and following along with my journey! Joel and me on our way to lunch in San Francisco ", "title": "After 6 incredible years at Buffer I’m moving on to something else", "sentences": [{"18f5": "After 6 incredible years at Buffer I’m moving on to something else"}, {"50fe": "On January 3rd 2011, I remember talking with Joel on Skype. We were catching up about life and his projects. I remember asking for some advice on a prototype to create student surveying software that I was working on at the time. Joel also caught me up on the progress of his project “bfffr”, which he had launched just a few weeks earlier: Just over 100 free signups and 3 paying. My jaw dropped, that was incredible! Only a couple months before, I had put my email into Joel’s splash page to keep up with bfffr’s developments:"}, {"9fe6": "I asked him what his plan was from here and quickly we ended up brainstorming about his ideas and the opportunities for bfffr’s future. I got very excited and wanted to help out in any way I could and after the call we had an action plan for how I could help: monitor and grow @bfffr’s Twitter account for 30 minutes a day. I was ecstatic!"}, {"8186": "What followed was a rollercoaster ride for 6 years, which changed my life in a way that I would have never dreamed of would ever happen. During that time, I:"}, {"774c": "I’m still in awe when I reflect on everything that has happened to me in the last 6 years. Despite a lot of my privilege that I’ve become aware of as I got older, it seemed unlikely to me to be where I am today, growing up in a modest household in a 5,000 person town on the countryside in Austria, barely wanting to abandon small town life and taking the step to go to high school in the “big city” a.k.a. Vienna there. I’m grateful for all the help I’ve received from so many friends, family and advisors and supporters in that time and I see it as a great responsibility to pay it forward and pass along what I learned to others who are looking to find their own path in startups."}, {"748e": "2 of my favorite Buffer episodes in detail"}, {"d85e": "With the many stories that are to tell, I want to pick out 2 things that we have done, that I think had a meaningful impact:"}, {"4794": "Salary transparency"}, {"8edf": "The initiative that particularly stands out for me was to go public with Buffer’s salary structure and the incredible response this garnered from the tech community. For some backstory on this initiative: We had just completed the finalizing of our first draft of the Buffer values in early 2013, made some difficult team changes and had spelt out transparency as a key thing we wanted to focus on. From then onwards, we kept on thinking about where we were and where we weren’t living up to our values in detail. Throughout the summer of 2013, I remember debating at various times with Joel about the potential value of making salaries internally as well as externally public with the underlying idea of also adding a strong salary formula to determine salary fairly and without bias for everyone. We felt more and more that becoming completely transparent with our salaries would eliminate sources of potential unnecessary conflict around negotiation and pay inequality. On top of that, it’d allow us to show our customers and the world at large, how we were thinking about compensation for our team and potentially help other startup founders out there who were struggling to figure this out for themselves."}, {"4f9b": "All of this also felt like a huge taboo and I remember sitting and discussing with Joel on the eve of announcing this in late December. We discussed and anticipated a potential backlash or otherwise simply little interest in the fact that a small company was releasing their salary information. When we then went ahead with announcing it on the 19th of December in 2013, we couldn’t believe our eyes when we saw the response. Within less than 24 hours, we had over 100,000 people check out our salary formula and open salary data. What blew me away the most however, was the sincere gratitude people expressed to us for kicking off a movement in transparency, unbeknownst to us at the time which some people saw as furthering the close of the gender pay gap and general reduction of inequities in pay across tech companies. Having played a small part in that meant a lot to me."}, {"11ea": "Here is our original post from back then, which I just noticed garnered over 400 comments."}, {"f96b": "Downtime and rallying in Sydney"}, {"1812": "Another episode that I remember very fondly is really a rather small episode. It was early 2015 and we were on our 4th Buffer retreat with about 25 Bufferoos in Sydney. We had a magical time as we were working together, seeing a concert at the Sydney opera house, surfed together and so much more. One day, we had a field trip to the Sydney Zoo, which was a really great experience, except that half-way through the day, we ran into a big issue, which brought one of our social media services down. We sat down at the zoo’s restaurant and all rallied together to resolve the issue and get back up and running."}, {"5442": "Afterwards, we also came together in the hotel conference room to work on customer service tickets together as a team:"}, {"8d26": "In hindsight, it was just a blip, but it somehow represented something more than that. This incredible sense of cohesion and working on something together that’s bigger than you. It was a special bonding moment, that I know brought us all closer together as a team and made us that much better at coping with future challenges and issues."}, {"f9db": "Why move on?"}, {"2a26": "As Joel outlined in his blogpost, we discovered that there are naturally different ways that one can run a great company. Over the last few years, and particularly the last 6 months, we noticed that slowly some differences were emerging between how Joel would approach execution and how I would in various instances. When we discussed topics like new product offerings, the spectrum of nurturing versus performance for bringing on new team members, being customer-centric versus team-centric, we were more often than not starting to fall on differing parts of the spectrum. Personally, I see it as quite natural. Joel and I both had the chance to learn about building a company and to figure out what style it is that gets us excited every day. Learning that some of these motivations differ between us felt like a positive realization and it’s a big reason for why we’re parting ways. As for the examples above, I’ve naturally fallen closer to a more traditional path, and also being more on the action side. No surprises there for anyone that might have worked with me in the past before."}, {"34f1": "Another reason emerged after Joel and I had a candid conversation on how we’re structured as CEO and COO over the last 6 months or so and recognized some challenges in it. Joel shared this article with me, which I thought explains some of the struggles well of what’s been going on. Joel shared with me, that a big vacuum has opened up for him to feel truly fulfilled and connected to the team in his current role and in some discussions. I fully recognize this and want to fully support Joel in his ambition here to step back into more of an operating role going forward. This made me ponder what my role going forward should possibly be and how I can help Buffer the most."}, {"aab1": "Given both of those reasons, I came to the conclusion that my place with Buffer is not in an operational role going forward. In stepping away from my day to day duties, I want to let Joel fully step back into the day to day management and make space for him to fully develop and execute on the vision he has set out for Buffer."}, {"8c8c": "With that, I see myself as Buffer’s biggest cheerleader and even though I’m not operationally active, Joel and I are both excited for me to step into a non-executive role as an advisor as well as being a member of the board going forward. My plan with this role is to keep being a sounding board to Joel, our investors and the team, particularly the executive team as we’re maneuvering the next chapter of Buffer together."}, {"cc08": "Personally, I’m really excited for Buffer’s next steps and have full confidence in Joel, especially now that he can fully lean into the direction that he thinks is best for Buffer. Joel has long been inspired by companies such as Basecamp, Mailchimp, Patagonia, Union Square Hospitality group and others, which I know will serve as great role models for the company that Buffer will become."}, {"db3d": "Special thanks and gratitude"}, {"6297": "I’m particularly grateful to Joel, who from the very start supported my naive approaches and kept on coaching me and providing feedback to me on how to get better and improve the relationship with our customers, partners and team members. Some highlights I particularly remember were arguments I got into on Twitter with potential new customers, where Joel helped me see things from their side and helped me turn the situation around. The same is true as we approached building partnerships with new companies to integrate Buffer, to stay true to our values and always follow up with politeness and trying to genuinely see things from the other person’s perspective. I remember many emails Joel and I sat over for many hours over the years to really get the tone and experience right and truthfully understand people as much as possible. I think this has led to great success for Buffer and also for me personally in learning how to deal with people compassionately and also move the company forward. It’s the kind of learning that I don’t know if I’d have been able to pick up anywhere else in life and I cherish this greatly."}, {"164a": "I’m also particularly grateful for the amazing group of people that make up the Buffer team as it stands today, to Caro, Kevan, Åsa and Caryn for having become a true rock of solidity to Buffer that a big part of the company relies on. I’ve learned so much from all of you throughout the years. I’m grateful to Courtney, who particularly opened my eyes to diversity and the importance of it and my ignorance of it for the longest part of my life, it’s really changed how I get to view the world today."}, {"0001": "A special thanks also to Sunil, Buffer’s CTO, who is also moving on from Buffer, who worked tirelessly for many years to help Buffer become the solid platform that it is today, processing millions of social media posts daily. Since deciding to leave, Sunil and I had a discussion to continue working together on our new idea, Matter, and I’m excited to share more on that below."}, {"572f": "I’m grateful to all the other Bufferoos, Max, Nicole, Steven, Katie, Tom, Dan, Mary, Brian, Michael, DaveO, Niel and so many others (I know I’m forgetting some here!), which I had the chance to work with over the last few years. The more I reflect on it, the more I’m grateful that we were able to bring such a compassionate group of people together, who truly think about how we treat each other and our customers."}, {"f949": "I’m excited for Buffer in 2017! To new waters and explorations!"}, {"8edb": "What’s next for me?"}, {"8534": "After lots of reflection in the last few weeks and coming to the conclusion to leave together with Joel, I am venturing out into the world again looking for what to do next. And I quickly started to do some scheming and found a very fulfilling area I want to dive in more: Diversity and Inclusion in tech. I’ve had some deeply personal experiences around how little I understood about the difficulty many underrepresented minorities and marginalized groups face, where I believe there is incredibly positive forward momentum and also so much more great work to be done, that I’m excited to help contribute. You can learn more about my new company Matter here: matterapp.io"}, {"660c": "I’m also really excited to announce that Sunil Sadasivan will be joining me on this new endeavor with Matter, to work on our mission to help change diversity and inclusion in tech, where I believe there’s so much important work to be done. If you’re interested, you can find out more about it here! I’ll be sharing lots more details for it over the coming weeks."}, {"0db7": "Thank you all for your support and following along with my journey!"}, {"eeb7": "Joel and me on our way to lunch in San Francisco"}], "child": "1880_1\t1880_2\t1880_3\t1880_4\t1880_5\t1880_6\t1880_7\t1880_8\t1880_9\t1880_10\t1880_11\t1880_12\t1880_13\t1880_14\t1880_15\t1880_16\t1880_17\t1880_18\t1880_19\t1880_20\t1880_21\t1880_22\t1880_23\t1880_24\t1880_25"}