{"name": "1882", "parent": "", "content": "Tech your privilege at the door I am a thirty-something white, English speaking male working in tech. I feel like this simultaneously gives me every right and no right to discuss privilege. Maybe I can excuse myself my saying that I try (hard) to be aware and conscious of my privilege and react and respond to others accordingly. I (think/hope) I am also conscious when I am not conscious, if that makes any sense. At least acknowledging and regretting a situation where I could have handled it better. However, I do often encounter participants in the tech industry who are less aware and understanding, and whilst I don’t want this to be a big rant and whinge, I feel like if we were more aware, then maybe our community would be more welcoming, balanced and understanding. I started planning this article a couple of months ago, and its premise was simple. A more casual criticism of the expectations of some tech workers, when we have a lot of privilege. This changed for me with events this year culminating in the US election result. This article will still mostly be about my initial ideas, but will also start disseminating my other ideas and thoughts about how we tech professionals need to be more responsible for our actions and power. Arrogance The geeks have risen, we are in demand and have the freedom and power to pick and choose the role we want. For a group of individuals who were likely marginalised and made to feel weak and insignificant as children, this is a powerful and seductive feeling. The gung-ho attitude of many startups can exacerbate and manipulate these feelings to fever point. Making you honestly feel like you are changing the world and that the world owes you a favour, when you’re actually making another damned dating app. This arrogance and complacency can lead to, or intensify the other factors I will discuss in this article. Superiority is a powerful and seductive feeling, it makes you feel good, but it can blinker you to reality and other perspectives. Disruption I wrote about this in brief in my round up of the Trump election and Brexit. But it has been widely shown that the partial cause of these outcomes was the insecurity that sections of the population feel due to technological disruption. Technology and change has always driven the human race, and probably always will. I won’t even say that we are in a period of the most rapid change the human race has ever experienced, as personally, I think we have always thought and said that. What I would like to say is that whilst you are working on an app, technology or platform that will disrupt or unsettle a massive industry and thus make the future of many people uncertain, be conscious of the impact. For example, my wife spends a lot of her time writing about how great robots are at repetitive tasks. Her brother has severe schizophrenia so already struggles to find work, and his current job is stacking fridges, a role a robot would be well suited to. But the impact on his dignity and lifestyle would be immense. I am not saying stop doing what you’re doing, as history mostly shows that jobs shift, not get lost, but reduce the arrogance and bragging. One day the same will probably happen to you, and I bet you will welcome the support of others. Diversity I am not talking specifically about gender or race in this section. First because (as noted in the intro), I don’t feel I qualified to deliberate on the subject. Also because others with far more knowledge and experience on the subject(s) have covered it far better than me (You can find good starting articles here). But mostly because I want this post to be about other facets of the same problem, maybe less important topics, but topics I want to cover. There have been millions of better words written about why diversity is important, and not just specific to the tech industry. It should almost feel like this is an issue I shouldn’t even have to mention as others have discussed it so much already. And yes, there are a lot of companies and people making a considered effort to bring more diversity to the tech sector, and/or helping those people even get a seat at the table in the first place. What I want to discuss is what happens next. As an industry used to being a mono-culture, we can have certain ways of doing things and attitudes that we are comfortable with, and subconsciously expect that everyone else is. I feel like I repeat the mantra ‘assume nothing’ in most articles I write, but it is such an essential part of so many problems, I guess I’ll keep repeating it until my last breath. There are many hard set aspects of geek and hacker culture that may not sit comfortably with everyone. That doesn’t mean you have to stop doing them, no, it means to be a little more flexible and aware that if someone looks uncomfortable with an activity, don’t coerce or force them into it, or worst, make them feel shitty for not taking part. Pay and prospects Tech professionals (especially programmers) typically get paid well, relative to the average wage for a country or area. In many locations we can practically pick a wage, and as long as it’s not insane and we can justify our worth, we will likely get what we ask for. This is not because programming itself is valuable, but because those with sufficient skills and experience are rare. As an aside, don’t assume this situation will last forever. This can make us unconscious of an ‘average’ wage, or the cost and worth of items. For example: I try to be open with people as much as possible, this has got me into trouble on occasion, but I find it hard to do otherwise. This has included talking about money or what I do with my money. I don’t intend to come across as arrogant, but maybe subconsciously I am arrogant, and even if I’m not, it can still cause others to feel inferior, and that’s never a good feeling. Extras In addition to great wages, we often receive other benefits at work, such as drinks, food, travel, education budgets and more. We are very lucky to receive these extras and whilst the trend of ‘happy workplaces’ has broadened, it’s still rare in many sectors. Welcome these benefits and acknowledge how lucky you are to receive them. Thank the people who arrange them for you and don’t complain too much if they are not to your standards. Free coffee and beer are still free coffee and beer, if you don’t like the standard, donate it to someone who will appreciate it. What the world needs now is… I wasn’t sure how to end this post, so I’m going to paraphrase one of my reviewers, as they put it best. We are smart people, but so are many others in the world, we are not inherently more brilliant or superior than them. We are lucky that our skills are currently in demand, but, well, don’t let it go to your head. Being aware of our privilege is not only a positive to those around us and those we interact with, but will make us more conscious of this fact. It will make us more flexible, more aware and more understanding. In conclusion, looping back to me wanting to link my initial idea to recent world events. What the world needs more of right now is understanding, and we are in a perfect position to show it. Thanks to all of those who reviewed the drafts of this post, your input was valuable. ", "title": "Tech your privilege at the door", "sentences": [{"32ff": "Tech your privilege at the door"}, {"87c5": "I am a thirty-something white, English speaking male working in tech. I feel like this simultaneously gives me every right and no right to discuss privilege. Maybe I can excuse myself my saying that I try (hard) to be aware and conscious of my privilege and react and respond to others accordingly. I (think/hope) I am also conscious when I am not conscious, if that makes any sense. At least acknowledging and regretting a situation where I could have handled it better."}, {"c364": "However, I do often encounter participants in the tech industry who are less aware and understanding, and whilst I don’t want this to be a big rant and whinge, I feel like if we were more aware, then maybe our community would be more welcoming, balanced and understanding."}, {"96b7": "I started planning this article a couple of months ago, and its premise was simple. A more casual criticism of the expectations of some tech workers, when we have a lot of privilege. This changed for me with events this year culminating in the US election result. This article will still mostly be about my initial ideas, but will also start disseminating my other ideas and thoughts about how we tech professionals need to be more responsible for our actions and power."}, {"ff1c": "Arrogance"}, {"bfd7": "The geeks have risen, we are in demand and have the freedom and power to pick and choose the role we want. For a group of individuals who were likely marginalised and made to feel weak and insignificant as children, this is a powerful and seductive feeling. The gung-ho attitude of many startups can exacerbate and manipulate these feelings to fever point. Making you honestly feel like you are changing the world and that the world owes you a favour, when you’re actually making another damned dating app."}, {"17c6": "This arrogance and complacency can lead to, or intensify the other factors I will discuss in this article. Superiority is a powerful and seductive feeling, it makes you feel good, but it can blinker you to reality and other perspectives."}, {"2de9": "Disruption"}, {"dc35": "I wrote about this in brief in my round up of the Trump election and Brexit. But it has been widely shown that the partial cause of these outcomes was the insecurity that sections of the population feel due to technological disruption. Technology and change has always driven the human race, and probably always will. I won’t even say that we are in a period of the most rapid change the human race has ever experienced, as personally, I think we have always thought and said that."}, {"2b25": "What I would like to say is that whilst you are working on an app, technology or platform that will disrupt or unsettle a massive industry and thus make the future of many people uncertain, be conscious of the impact."}, {"a5cc": "For example, my wife spends a lot of her time writing about how great robots are at repetitive tasks. Her brother has severe schizophrenia so already struggles to find work, and his current job is stacking fridges, a role a robot would be well suited to. But the impact on his dignity and lifestyle would be immense."}, {"8864": "I am not saying stop doing what you’re doing, as history mostly shows that jobs shift, not get lost, but reduce the arrogance and bragging. One day the same will probably happen to you, and I bet you will welcome the support of others."}, {"d148": "Diversity"}, {"e740": "I am not talking specifically about gender or race in this section. First because (as noted in the intro), I don’t feel I qualified to deliberate on the subject. Also because others with far more knowledge and experience on the subject(s) have covered it far better than me (You can find good starting articles here). But mostly because I want this post to be about other facets of the same problem, maybe less important topics, but topics I want to cover."}, {"919e": "There have been millions of better words written about why diversity is important, and not just specific to the tech industry. It should almost feel like this is an issue I shouldn’t even have to mention as others have discussed it so much already. And yes, there are a lot of companies and people making a considered effort to bring more diversity to the tech sector, and/or helping those people even get a seat at the table in the first place."}, {"82c7": "What I want to discuss is what happens next. As an industry used to being a mono-culture, we can have certain ways of doing things and attitudes that we are comfortable with, and subconsciously expect that everyone else is."}, {"6021": "I feel like I repeat the mantra ‘assume nothing’ in most articles I write, but it is such an essential part of so many problems, I guess I’ll keep repeating it until my last breath."}, {"ad7c": "There are many hard set aspects of geek and hacker culture that may not sit comfortably with everyone. That doesn’t mean you have to stop doing them, no, it means to be a little more flexible and aware that if someone looks uncomfortable with an activity, don’t coerce or force them into it, or worst, make them feel shitty for not taking part."}, {"a032": "Pay and prospects"}, {"de4f": "Tech professionals (especially programmers) typically get paid well, relative to the average wage for a country or area. In many locations we can practically pick a wage, and as long as it’s not insane and we can justify our worth, we will likely get what we ask for. This is not because programming itself is valuable, but because those with sufficient skills and experience are rare. As an aside, don’t assume this situation will last forever."}, {"ea7e": "This can make us unconscious of an ‘average’ wage, or the cost and worth of items. For example:"}, {"ea88": "I try to be open with people as much as possible, this has got me into trouble on occasion, but I find it hard to do otherwise. This has included talking about money or what I do with my money. I don’t intend to come across as arrogant, but maybe subconsciously I am arrogant, and even if I’m not, it can still cause others to feel inferior, and that’s never a good feeling."}, {"deec": "Extras"}, {"06b5": "In addition to great wages, we often receive other benefits at work, such as drinks, food, travel, education budgets and more. We are very lucky to receive these extras and whilst the trend of ‘happy workplaces’ has broadened, it’s still rare in many sectors. Welcome these benefits and acknowledge how lucky you are to receive them. Thank the people who arrange them for you and don’t complain too much if they are not to your standards. Free coffee and beer are still free coffee and beer, if you don’t like the standard, donate it to someone who will appreciate it."}, {"7f37": "What the world needs now is…"}, {"f503": "I wasn’t sure how to end this post, so I’m going to paraphrase one of my reviewers, as they put it best."}, {"ff07": "We are smart people, but so are many others in the world, we are not inherently more brilliant or superior than them. We are lucky that our skills are currently in demand, but, well, don’t let it go to your head."}, {"cc72": "Being aware of our privilege is not only a positive to those around us and those we interact with, but will make us more conscious of this fact. It will make us more flexible, more aware and more understanding."}, {"4dc8": "In conclusion, looping back to me wanting to link my initial idea to recent world events. What the world needs more of right now is understanding, and we are in a perfect position to show it."}, {"c270": "Thanks to all of those who reviewed the drafts of this post, your input was valuable."}], "child": "1882_1\t1882_2\t1882_3\t1882_4\t1882_5\t1882_6\t1882_7\t1882_8\t1882_9\t1882_10"}