{"name": "1883", "parent": "", "content": "To Be A Young Black Man Working In An Office Full of White People I was recently severanced from a job I kept for six months at the reputable impact driven non-profit in New York City, Do Something.org where I was the only full-time Black male in the office (there was one other Black male working remotely) out of a 50 plus person team. Do Something.org was an organization I looked up to since I was in high school back on the South-Side of Chicago because it inspired me to believe that I could serve my local community, regardless of my age, in a meaningful way. I cared about the organizational mission because it was one that impacted me at a critical age and I cared about my work. But, I was pushed out of this job because I am a Black man. Today, I am compelled to proclaim and expose people to the details of this experience considering all of the social and race-related issues America is currently facing and because I feel the progressive platform DoSomething.org claims to be pushing forward needs to see itself in the mirror. The obvious disdain certain groups receive at every layer of our society is disheartening, appalling. And because it is frustrating, it is also invigorating and a catalyst for action. The unfortunate truth is that while Black people are in real-time situations at their workplace, they often feel like they cannot talk about racial aggressions and general mistreatment, without of course, losing their jobs. So, we sit in the office feeling uncomfortable. Day after day, our zeal is eroded. We begin to feel that we’re trading pieces of ourselves in order to continue gaining paychecks. …while Black people are in real-time situations at their workplace, we often feel like we cannot talk about racial aggressions and general mistreatment at work, without of course, losing our jobs. In this regard, I was privileged. Privileged enough to smile in the meeting where I was told, “we’re going to cut to the chase, today will be your last day here at DoSomething. Privileged enough to have been an entrepreneur while working there, so I had other options. Many of us, however, are simply not in the position where we can quit our jobs because we feel mistreated or targeted in some racially motivated way while working. Many of us think the best scenario is simply to remain silent and keep working, but this only makes the situation worse. Beyond the willingness to quit, is the fact that many of us are not in a position to smile with relief if we are fired. Being fired would, rather, be devastating to us even if we weren’t fond of our job or company culture. My time at Do Something does not warrant total condemnation. During my time there, I experienced many uniquely amazing moments. I saw, for the first time in my life, an entire group of people who were passionate about their jobs and I saw people foster genuine relationships with the people inside their workplace. I watched as a 50+ person team created a “Secret Santa” gift exchange during the holiday season.One by one, each team member stood up and explained the gift and why they got it for their designated team member — no one was allowed to skip and the remarks were quite personal and passionate. My manager, beyond the gift exchange, gave our entire team personalized gifts. This thoughtful gesture coupled with handpicked items tailored to personalities showed a deep sense of compassion and care for her squad, the thought put into the gift was so much bigger than the gifts (and the gifts were nice!). That was beyond beautiful to observe in a workplace culture. To a degree, this organization gave me a glimpse of what a work environment could be — organizations treating real people with real dignity. Sadly, in the midst of broadening my professional and social perspectives, was an ominous feeling of being treated differently than my colleagues. My suspicion began when I learned that the position I originally interviewed for at the organization was given to a very “mediocre white male”, as stated verbatim by a colleague. This same colleague pulled me to the side during the office holiday party (after imbibing, folks get brutally honest) to express that: she really wanted me on on their team (the Business Development team), but Anna* “wanted to hire someone who wouldn’t challenge her, someone who wouldn’t be as talented, but who also wouldn’t really want to push boundaries to innovate”. She said this in confidence and out of respect, I kept my cool in the moment, but, how was I supposed to feel after hearing that insider information? Should I have felt good about the company that relegated me to another open position even though I was the most qualified for the position I originally interviewed for? Or should I have just been happy that they gave me another job? I chose to not look at the company the same. Over time, I noticed that mistreatment became the norm, and it continued with Anna asking me to rap a song for one of the board members at the quarterly company dinner. To be fair, this was a rap that I’d written for youth across America in relation to a social impact campaign the organization was deploying. I wrote the rap for fun, and more importantly for the youth. I didn’t write it to entertain board members; furthermore, I wasn’t getting paid to rap. When I approached Anna to let her know that I did not feel comfortable rapping for a board member, she said “no problem” so quickly that it felt as if she knew she shouldn’t have made such a request. These are just two of many instances that made it clear I was on the margin. Having reflected on this experience for several months, I would issue two challenges. The first to the people who feel like they are currently being mistreated within a work culture of white normativity. I challenge you to speak up when you feel someone has stepped outside their professional boundaries. I challenge you to communicate as best as you can when you feel you have been mistreated. Don’t apologize for feeling this way. Stop worrying so much about respectability that you quietly allow yourself to be disrespected. If none of these things work and you can honestly say that you handled yourself professionally and with honor — then I challenge you to quit. If your employer has a severance policy, rather than quit, I challenge you to find a way to get fired so that you can get that severance check first. The second challenge is for all leaders of startup and established companies across America thinking critically about how to create a company culture where people of all races, cultures, gender identities, and socioeconomic backgrounds can feel comfortable and proud of their work. I challenge you to be open to the unfortunate, but very real, possibility that some of your Black and Latinx employees are very uncomfortable within your office culture. I challenge you to be open to the unfortunate, but very real possibility that some of your Black and Latinx employees are very uncomfortable within your office culture. Even if your company isn’t necessarily interested in promoting social justice, I am sure you are interested in improving a key business metric — your bottom line. Even if you aren’t necessarily interested in contributing to a more equitable nation, you are interested in identifying, recruiting, and retaining the best talent — white and non-white. It does not take much to do better by your employees of color. Some of the most effective things you can do to create a great culture are not hard to implement; they do not require large amounts of capital investment. They simply require you to be conscious of what you say. Of how white supremacy is ingrained in the structures of our society, and how these malignities often permeate the walls of your workplaces like carbon monoxide — undetectable yet lethal. A substantive change requires you to recognize why asking one of your few Black employees to perform a rap for one of your board members at an upcoming company dinner is NOT acceptable and in fact, quite offensive. It requires you to recognize why asking one of your few Black employees to perform a rap for one of your board members at an upcoming company dinner is NOT acceptable and in fact, quite offensive. It requires you to uphold the right people of color have to be judged first and foremost based on their work performance and not a bevy of ancillary interpersonal interactions such as “I didn’t like the way you said hi to me in the elevator” (which actually happened to me). Again, small and simple things. The troubles that Black and Latinx people are having when navigating the halls of Twitter, LinkedIn, Google, Apple, etc. all the way out in that “magical land” of Silicon Valley have been duly documented over the past two years. In the midst of this important conversation, however, there seems to be a consistent overlooking of the institutional racism and systemic biases that exist in own cubicle-laden offices. The fact is, Black and Latinx people are not just feeling marginalized in Silicon Valley, we are feeling pressed within all major cities in America. The question at hand is whether or not we will acknowledge the issues head on so solutions can be created or continue to avoid them and miss the opportunities within the challenges? *Disclosure: Name changed to ensure anonymity for legal purposes — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — Derrius Quarles is a 13-year alumnus of foster care and award-winning social justice entrepreneur and author. He is the Founder of Million Dollar Scholar, Chief Strategist at DQ & Partners and CTO of Breaux Capital. An accomplished public speaker, he has delivered talks at Harvard University, The United Nations, and Morehouse College and facilitated workshops to over 5,000 students across America in more than 20 states and 3 continents. His work to increase higher education access has been highlighted by the Associated Press, Huffington Post, CNN, and Time amongst others. He lives in NYC and is currently finishing up a Masters degree in Education Entrepreneurship at the University of Pennsylvania. ", "title": "To Be A Young Black Man Working In An Office Full of White People", "sentences": [{"4238": "To Be A Young Black Man Working In An Office Full of White People"}, {"7d23": "I was recently severanced from a job I kept for six months at the reputable impact driven non-profit in New York City, Do Something.org where I was the only full-time Black male in the office (there was one other Black male working remotely) out of a 50 plus person team. Do Something.org was an organization I looked up to since I was in high school back on the South-Side of Chicago because it inspired me to believe that I could serve my local community, regardless of my age, in a meaningful way. I cared about the organizational mission because it was one that impacted me at a critical age and I cared about my work. But, I was pushed out of this job because I am a Black man."}, {"7504": "Today, I am compelled to proclaim and expose people to the details of this experience considering all of the social and race-related issues America is currently facing and because I feel the progressive platform DoSomething.org claims to be pushing forward needs to see itself in the mirror. The obvious disdain certain groups receive at every layer of our society is disheartening, appalling. And because it is frustrating, it is also invigorating and a catalyst for action."}, {"3c7a": "The unfortunate truth is that while Black people are in real-time situations at their workplace, they often feel like they cannot talk about racial aggressions and general mistreatment, without of course, losing their jobs. So, we sit in the office feeling uncomfortable. Day after day, our zeal is eroded. We begin to feel that we’re trading pieces of ourselves in order to continue gaining paychecks."}, {"3b9e": "…while Black people are in real-time situations at their workplace, we often feel like we cannot talk about racial aggressions and general mistreatment at work, without of course, losing our jobs."}, {"ce79": "In this regard, I was privileged. Privileged enough to smile in the meeting where I was told, “we’re going to cut to the chase, today will be your last day here at DoSomething. Privileged enough to have been an entrepreneur while working there, so I had other options. Many of us, however, are simply not in the position where we can quit our jobs because we feel mistreated or targeted in some racially motivated way while working. Many of us think the best scenario is simply to remain silent and keep working, but this only makes the situation worse. Beyond the willingness to quit, is the fact that many of us are not in a position to smile with relief if we are fired. Being fired would, rather, be devastating to us even if we weren’t fond of our job or company culture."}, {"7c19": "My time at Do Something does not warrant total condemnation. During my time there, I experienced many uniquely amazing moments. I saw, for the first time in my life, an entire group of people who were passionate about their jobs and I saw people foster genuine relationships with the people inside their workplace. I watched as a 50+ person team created a “Secret Santa” gift exchange during the holiday season.One by one, each team member stood up and explained the gift and why they got it for their designated team member — no one was allowed to skip and the remarks were quite personal and passionate. My manager, beyond the gift exchange, gave our entire team personalized gifts. This thoughtful gesture coupled with handpicked items tailored to personalities showed a deep sense of compassion and care for her squad, the thought put into the gift was so much bigger than the gifts (and the gifts were nice!). That was beyond beautiful to observe in a workplace culture. To a degree, this organization gave me a glimpse of what a work environment could be — organizations treating real people with real dignity. Sadly, in the midst of broadening my professional and social perspectives, was an ominous feeling of being treated differently than my colleagues."}, {"d9f9": "My suspicion began when I learned that the position I originally interviewed for at the organization was given to a very “mediocre white male”, as stated verbatim by a colleague. This same colleague pulled me to the side during the office holiday party (after imbibing, folks get brutally honest) to express that: she really wanted me on on their team (the Business Development team), but Anna* “wanted to hire someone who wouldn’t challenge her, someone who wouldn’t be as talented, but who also wouldn’t really want to push boundaries to innovate”. She said this in confidence and out of respect, I kept my cool in the moment, but, how was I supposed to feel after hearing that insider information? Should I have felt good about the company that relegated me to another open position even though I was the most qualified for the position I originally interviewed for? Or should I have just been happy that they gave me another job? I chose to not look at the company the same."}, {"6740": "Over time, I noticed that mistreatment became the norm, and it continued with Anna asking me to rap a song for one of the board members at the quarterly company dinner. To be fair, this was a rap that I’d written for youth across America in relation to a social impact campaign the organization was deploying. I wrote the rap for fun, and more importantly for the youth. I didn’t write it to entertain board members; furthermore, I wasn’t getting paid to rap. When I approached Anna to let her know that I did not feel comfortable rapping for a board member, she said “no problem” so quickly that it felt as if she knew she shouldn’t have made such a request. These are just two of many instances that made it clear I was on the margin."}, {"3878": "Having reflected on this experience for several months, I would issue two challenges. The first to the people who feel like they are currently being mistreated within a work culture of white normativity. I challenge you to speak up when you feel someone has stepped outside their professional boundaries. I challenge you to communicate as best as you can when you feel you have been mistreated. Don’t apologize for feeling this way. Stop worrying so much about respectability that you quietly allow yourself to be disrespected. If none of these things work and you can honestly say that you handled yourself professionally and with honor — then I challenge you to quit. If your employer has a severance policy, rather than quit, I challenge you to find a way to get fired so that you can get that severance check first."}, {"83f0": "The second challenge is for all leaders of startup and established companies across America thinking critically about how to create a company culture where people of all races, cultures, gender identities, and socioeconomic backgrounds can feel comfortable and proud of their work. I challenge you to be open to the unfortunate, but very real, possibility that some of your Black and Latinx employees are very uncomfortable within your office culture."}, {"245c": "I challenge you to be open to the unfortunate, but very real possibility that some of your Black and Latinx employees are very uncomfortable within your office culture."}, {"dc4f": "Even if your company isn’t necessarily interested in promoting social justice, I am sure you are interested in improving a key business metric — your bottom line. Even if you aren’t necessarily interested in contributing to a more equitable nation, you are interested in identifying, recruiting, and retaining the best talent — white and non-white. It does not take much to do better by your employees of color. Some of the most effective things you can do to create a great culture are not hard to implement; they do not require large amounts of capital investment. They simply require you to be conscious of what you say. Of how white supremacy is ingrained in the structures of our society, and how these malignities often permeate the walls of your workplaces like carbon monoxide — undetectable yet lethal. A substantive change requires you to recognize why asking one of your few Black employees to perform a rap for one of your board members at an upcoming company dinner is NOT acceptable and in fact, quite offensive."}, {"6834": "It requires you to recognize why asking one of your few Black employees to perform a rap for one of your board members at an upcoming company dinner is NOT acceptable and in fact, quite offensive."}, {"741a": "It requires you to uphold the right people of color have to be judged first and foremost based on their work performance and not a bevy of ancillary interpersonal interactions such as “I didn’t like the way you said hi to me in the elevator” (which actually happened to me). Again, small and simple things."}, {"dd38": "The troubles that Black and Latinx people are having when navigating the halls of Twitter, LinkedIn, Google, Apple, etc. all the way out in that “magical land” of Silicon Valley have been duly documented over the past two years. In the midst of this important conversation, however, there seems to be a consistent overlooking of the institutional racism and systemic biases that exist in own cubicle-laden offices. The fact is, Black and Latinx people are not just feeling marginalized in Silicon Valley, we are feeling pressed within all major cities in America. The question at hand is whether or not we will acknowledge the issues head on so solutions can be created or continue to avoid them and miss the opportunities within the challenges?"}, {"234c": "*Disclosure: Name changed to ensure anonymity for legal purposes"}, {"e67d": "— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —"}, {"9545": "Derrius Quarles is a 13-year alumnus of foster care and award-winning social justice entrepreneur and author. He is the Founder of Million Dollar Scholar, Chief Strategist at DQ & Partners and CTO of Breaux Capital. An accomplished public speaker, he has delivered talks at Harvard University, The United Nations, and Morehouse College and facilitated workshops to over 5,000 students across America in more than 20 states and 3 continents."}, {"06d7": "His work to increase higher education access has been highlighted by the Associated Press, Huffington Post, CNN, and Time amongst others. He lives in NYC and is currently finishing up a Masters degree in Education Entrepreneurship at the University of Pennsylvania."}], "child": "1883_1\t1883_2\t1883_3\t1883_4\t1883_5\t1883_6\t1883_7\t1883_8\t1883_9\t1883_10\t1883_11\t1883_12\t1883_13\t1883_14\t1883_15\t1883_16\t1883_17\t1883_18\t1883_19\t1883_20\t1883_21"}