{"name": "1884", "parent": "", "content": "Please Fix The Diversity & Inclusion Loop It Feels Broken Give me a time machine and an invisibility cloak and I’ll do it right now. I’ll go back to the first time I considered becoming a software engineer and slap the taste of ambition right out of my mouth. Sure, it’s a bit violent, but the young me needs to know that tech companies won’t make people like me feel like I belong. After picking himself off the floor, Young Kwaku is going to ask why I did that. I’ll have to tell him: “Because you’re Black, and they don’t really care about you” To prevent this raw form of neglect from happening again, we’ve come up with some real ways to solve the problem of diversity in tech. For years, Big Tech Execs have been broadcasting messages through the air waves, stating double-sized intentions to make things change. But from down here, the words sound fake, and the initiatives… they look completely half-baked. I think “diverse” as a company flavor would taste pretty good. It’d be a part of every healthy diet, since it makes people smarter. Plus, more inclusive work environments help people of underrepresented groups focus more energy on work, and less on trying to fit in. Wouldn’t it be nice to have all your Black coworkers at 100% productivity? I bet it would. You know what though, being a woman or person of color in this melting pot of technology can often feel isolating, and equally exhausting, turning any experience into a very vanilla one. Rewind Back to 2013, when I had my first interview with a big tech company. It couldn’t have gone any worse. I failed miserably, and I wasn’t invited back. While the rejection stung, the real trauma came when I noticed that I was the only Black person invited to interview for the position. There were 4 men on the interview panel, 2 White and 2 Asian, none of the more than 20+ candidates were Black, and none of the company employees brought in to speak to us at lunch were Black, Latino, or female. Six months later, after founding my own company, the Bay Area’s diversity problem struck me again. My Co-founders and I, after being accepted into an accelerator program in San Mateo, were given a day to “speed date” and match with mentors. One round with a particular potential mentor was especially “fun”. To begin the conversation, each of my co-founders shared their background and role on the team. Once it was my turn, I told Mr. Mentor about my degree in Computer Engineering from Cal Poly and my role as the Technical Co-Founder. Fascination was smeared all over his face. But the real paralyzing blow came as soon as he said, “Hmm, I never would’ve guessed…” Pause Who do you think you are, Mr. Mentor? What are you talking about, Mr. Mentor? Mr. Mentor, did you really just say that? How Sway? I would’ve liked answers to all these questions, but I didn’t feel comfortable sharing the experience with anyone, not even my co-founders. I was the only Black person of all the people on the sixteen businesses in our program. Generally, I try to avoid serving any “race talk” to White people — it usually ends with a sweet defense of White ignorance, sugared with some good ole idealisms of the USA. And that’s just how it goes when you’re Black in a White place; that’s just another bout with social isolation in the workplace. I never got the chance to figure out what Mr. Mentor meant, but I’ve made my own assumptions. At the time, I wasn’t sure how to respond. I wasn’t sure if Mr. Mentor’s actions were the exception, or the norm. So I decided to leave it be, because I didn’t want to be mistaken; I didn’t want to ruin my team’s chances to succeed as we continued on. Fast Forward Today, the problem of diversity in tech gets much more attention than it did in 2013; however, solutions are slow to develop. The big tech companies are insanely consistent with the reasons why they’re having problems. “What actions would you take to fix the diversity problem?” If we asked that question to leaders at companies like Twitter and Microsoft, I genuinely believe that they wouldn’t have an answer, because most of them aren’t Black, aren’t women, and aren’t forced to confront issues of diversity and inclusion head on. But I also genuinely believe that, together, we can come up with solutions that are better than what we’ve currently seen. In recent months I’ve had conversations with diversity recruiters, diversity managers and reps from top tech firms, Black peers, women peers, and mentors; these are the people that have insights that can help solve the problem significantly. The key takeaway from these conversations: the solution needs to cover both diversity and inclusion. Also, it’s not just a pipeline problem, and it’s definitely not a talent problem. DIVERSITY Express Intentions There are a many reasons why a person of color might not apply for a tech job. One reason is imposter syndrome. To counteract this, employers need to express intentions. In the job description, employers should be explicit and state that women and minorities are encouraged to apply. This resonates well with people who fit the description, and it also holds the employer more accountable to make hires that fit. This doesn’t mean an employer has to be biased when making hiring decisions. Make the interview process objective Implicit bias is something that everyone has. Ensuring hiring practices are tailored to prevent implicit bias will help people of color and women avoid being judged for things they can not change. Objective hiring can be accomplished through training. Pinterest, for example, trains their managers to focus less on the candidates name/college on their resume, and focus more on experience and performance. With training, hiring managers will be more able to pinpoint what types of experiences make candidates talented, instead of what college they think does. Lack of diversity in tech is not about lack a talent, it’s about the lack of practice finding it. Recruit from different places How will diversity increase if the schools that these companies use to hire new grads are not diverse? It won’t. Some companies are beginning to recruit from unique areas, such as Google. If potential candidates are always coming from Stanford and UC Berkeley then results will stay the same. It’s not just them though, a lot of good engineering schools have diversity issues, such as Cal Poly, where less than 2% of the student body is African American. Hire for other positions Diversity in tech is not just diversity in software engineering, but diversity in other areas like sales, management, and human resources. It’s frustrating when you walk onto a company’s campus and notice that most of the Black employees at the company are greeting you at the front door. Hiring people from underrepresented groups for roles all throughout a company will close the diversity gap much faster. INCLUSION Affirm Underrepresented Employees Be constructive and positive when telling an employee how they can continue to improve their skills. When justified, point out to the individual that they should consider more opportunities. Many underrepresented minorities in tech don’t feel comfortable raising their hand to ask for a promotion. Let them know that, while it may be a challenge, they are more than capable of taking on the added responsibilities. Understand the effects of privilege Personally, being a Black man means that failing carries more weight than my White colleagues. However, I also understand that my privilege as a man has put me in a better position for success than women. The same goes for education. Knowing what privileges you have and the several types of privilege that exist is important because it produces more empathy. Many times we don’t recognize our own biases towards other people, and that doesn’t help us understand one another’s personal struggles. Recognize all employees as individuals I like music, basketball, food, and cartoons. I’m an individual with my own unique interests. Lack of knowledge about others in the workplace can really affect comfort at work. It was painfully awkward for me the time when someone in my office of fewer than twenty people mistook me for my coworker (who happens to be two shades lighter and six inches taller) and I had to explain that they were thinking about the other Black guy. It’s just as awkward when they realize their mistake and wonder why they made the assumption. Build strategic partnerships with CBOs Many people at tech companies are involved with CBOs (Community Based Organizations) outside of their work lives. By getting involved with — or even just expressing interest in — these programs, employers can appeal to the interests of the employees, and enable the employees to continue getting involved with passion projects. This will also make employees more comfortable expressing themselves at work. Foster collaborative environments It’s hard to know everyone in a big company. But that shouldn’t stop employees from working with one another. I shouldn’t be forced to, nor should I continually, work and interact with the same few people at the office every day. There’s plenty ways to switch this up. Some companies have open seating arrangements, others use a random seating chart to mix things up. This will ultimately lessen the effect of isolation on employees who feel like they don’t fit in. “… over time companies tend to get comfortable doing the same thing, just making incremental changes. But in the technology industry, where revolutionary ideas drive the next big growth areas, you need to be a bit uncomfortable to stay relevant” That quote can be found on Alphabet’s homepage, yet they still seem unwilling to open up a dialog to make lasting changes regarding inclusion of all people in technology. It’s ironic, and it makes me realize that many communities don’t recognize the problem with a lack of diversity, because they’ve already created success without it. Diversity in tech isn’t just a problem for the people of color and women to solve. No. It’s something everyone needs to think about it, and be held accountable for. Otherwise we get things like this — and this, and this and this. Lets diversify tech now so we don’t have to see this broken part of history continue to repeat itself. Special thanks to Daisha, Jan, Kaley and everyone who helped craft this post ", "title": "Please Fix The Diversity & Inclusion Loop", "sentences": [{"8b23": "Please Fix The Diversity & Inclusion Loop"}, {"322e": "It Feels Broken"}, {"8bb5": "Give me a time machine and an invisibility cloak and I’ll do it right now. I’ll go back to the first time I considered becoming a software engineer and slap the taste of ambition right out of my mouth. Sure, it’s a bit violent, but the young me needs to know that tech companies won’t make people like me feel like I belong. After picking himself off the floor, Young Kwaku is going to ask why I did that. I’ll have to tell him:"}, {"7dc7": "“Because you’re Black, and they don’t really care about you”"}, {"ab19": "To prevent this raw form of neglect from happening again, we’ve come up with some real ways to solve the problem of diversity in tech."}, {"e477": "For years, Big Tech Execs have been broadcasting messages through the air waves, stating double-sized intentions to make things change. But from down here, the words sound fake, and the initiatives… they look completely half-baked."}, {"0cd5": "I think “diverse” as a company flavor would taste pretty good. It’d be a part of every healthy diet, since it makes people smarter. Plus, more inclusive work environments help people of underrepresented groups focus more energy on work, and less on trying to fit in."}, {"03e4": "Wouldn’t it be nice to have all your Black coworkers at 100% productivity? I bet it would. You know what though, being a woman or person of color in this melting pot of technology can often feel isolating, and equally exhausting, turning any experience into a very vanilla one."}, {"14b8": "Rewind"}, {"7875": "Back to 2013, when I had my first interview with a big tech company. It couldn’t have gone any worse. I failed miserably, and I wasn’t invited back. While the rejection stung, the real trauma came when I noticed that I was the only Black person invited to interview for the position. There were 4 men on the interview panel, 2 White and 2 Asian, none of the more than 20+ candidates were Black, and none of the company employees brought in to speak to us at lunch were Black, Latino, or female."}, {"5ade": "Six months later, after founding my own company, the Bay Area’s diversity problem struck me again. My Co-founders and I, after being accepted into an accelerator program in San Mateo, were given a day to “speed date” and match with mentors. One round with a particular potential mentor was especially “fun”."}, {"bc9c": "To begin the conversation, each of my co-founders shared their background and role on the team. Once it was my turn, I told Mr. Mentor about my degree in Computer Engineering from Cal Poly and my role as the Technical Co-Founder. Fascination was smeared all over his face. But the real paralyzing blow came as soon as he said,"}, {"bd6b": "“Hmm, I never would’ve guessed…”"}, {"2809": "Pause"}, {"de0e": "Who do you think you are, Mr. Mentor? What are you talking about, Mr. Mentor? Mr. Mentor, did you really just say that? How Sway?"}, {"c0ec": "I would’ve liked answers to all these questions, but I didn’t feel comfortable sharing the experience with anyone, not even my co-founders. I was the only Black person of all the people on the sixteen businesses in our program. Generally, I try to avoid serving any “race talk” to White people — it usually ends with a sweet defense of White ignorance, sugared with some good ole idealisms of the USA."}, {"eb01": "And that’s just how it goes when you’re Black in a White place; that’s just another bout with social isolation in the workplace."}, {"ccdd": "I never got the chance to figure out what Mr. Mentor meant, but I’ve made my own assumptions. At the time, I wasn’t sure how to respond. I wasn’t sure if Mr. Mentor’s actions were the exception, or the norm. So I decided to leave it be, because I didn’t want to be mistaken; I didn’t want to ruin my team’s chances to succeed as we continued on."}, {"5333": "Fast Forward"}, {"6e03": "Today, the problem of diversity in tech gets much more attention than it did in 2013; however, solutions are slow to develop. The big tech companies are insanely consistent with the reasons why they’re having problems."}, {"a655": "“What actions would you take to fix the diversity problem?”"}, {"9099": "If we asked that question to leaders at companies like Twitter and Microsoft, I genuinely believe that they wouldn’t have an answer, because most of them aren’t Black, aren’t women, and aren’t forced to confront issues of diversity and inclusion head on."}, {"675a": "But I also genuinely believe that, together, we can come up with solutions that are better than what we’ve currently seen."}, {"ac34": "In recent months I’ve had conversations with diversity recruiters, diversity managers and reps from top tech firms, Black peers, women peers, and mentors; these are the people that have insights that can help solve the problem significantly. The key takeaway from these conversations: the solution needs to cover both diversity and inclusion. Also, it’s not just a pipeline problem, and it’s definitely not a talent problem."}, {"a33b": "DIVERSITY"}, {"2988": "Express Intentions"}, {"844c": "There are a many reasons why a person of color might not apply for a tech job. One reason is imposter syndrome. To counteract this, employers need to express intentions. In the job description, employers should be explicit and state that women and minorities are encouraged to apply. This resonates well with people who fit the description, and it also holds the employer more accountable to make hires that fit. This doesn’t mean an employer has to be biased when making hiring decisions."}, {"ac0c": "Make the interview process objective"}, {"435e": "Implicit bias is something that everyone has. Ensuring hiring practices are tailored to prevent implicit bias will help people of color and women avoid being judged for things they can not change. Objective hiring can be accomplished through training. Pinterest, for example, trains their managers to focus less on the candidates name/college on their resume, and focus more on experience and performance. With training, hiring managers will be more able to pinpoint what types of experiences make candidates talented, instead of what college they think does. Lack of diversity in tech is not about lack a talent, it’s about the lack of practice finding it."}, {"ff92": "Recruit from different places"}, {"8d72": "How will diversity increase if the schools that these companies use to hire new grads are not diverse? It won’t. Some companies are beginning to recruit from unique areas, such as Google. If potential candidates are always coming from Stanford and UC Berkeley then results will stay the same. It’s not just them though, a lot of good engineering schools have diversity issues, such as Cal Poly, where less than 2% of the student body is African American."}, {"84f5": "Hire for other positions"}, {"954f": "Diversity in tech is not just diversity in software engineering, but diversity in other areas like sales, management, and human resources. It’s frustrating when you walk onto a company’s campus and notice that most of the Black employees at the company are greeting you at the front door. Hiring people from underrepresented groups for roles all throughout a company will close the diversity gap much faster."}, {"cffd": "INCLUSION"}, {"9b69": "Affirm Underrepresented Employees"}, {"352d": "Be constructive and positive when telling an employee how they can continue to improve their skills. When justified, point out to the individual that they should consider more opportunities. Many underrepresented minorities in tech don’t feel comfortable raising their hand to ask for a promotion. Let them know that, while it may be a challenge, they are more than capable of taking on the added responsibilities."}, {"6759": "Understand the effects of privilege"}, {"78eb": "Personally, being a Black man means that failing carries more weight than my White colleagues. However, I also understand that my privilege as a man has put me in a better position for success than women. The same goes for education. Knowing what privileges you have and the several types of privilege that exist is important because it produces more empathy. Many times we don’t recognize our own biases towards other people, and that doesn’t help us understand one another’s personal struggles."}, {"c848": "Recognize all employees as individuals"}, {"f4d4": "I like music, basketball, food, and cartoons. I’m an individual with my own unique interests. Lack of knowledge about others in the workplace can really affect comfort at work. It was painfully awkward for me the time when someone in my office of fewer than twenty people mistook me for my coworker (who happens to be two shades lighter and six inches taller) and I had to explain that they were thinking about the other Black guy. It’s just as awkward when they realize their mistake and wonder why they made the assumption."}, {"8967": "Build strategic partnerships with CBOs"}, {"d359": "Many people at tech companies are involved with CBOs (Community Based Organizations) outside of their work lives. By getting involved with — or even just expressing interest in — these programs, employers can appeal to the interests of the employees, and enable the employees to continue getting involved with passion projects. This will also make employees more comfortable expressing themselves at work."}, {"bf01": "Foster collaborative environments"}, {"199b": "It’s hard to know everyone in a big company. But that shouldn’t stop employees from working with one another. I shouldn’t be forced to, nor should I continually, work and interact with the same few people at the office every day. There’s plenty ways to switch this up. Some companies have open seating arrangements, others use a random seating chart to mix things up. This will ultimately lessen the effect of isolation on employees who feel like they don’t fit in."}, {"25ab": "“… over time companies tend to get comfortable doing the same thing, just making incremental changes. But in the technology industry, where revolutionary ideas drive the next big growth areas, you need to be a bit uncomfortable to stay relevant”"}, {"2793": "That quote can be found on Alphabet’s homepage, yet they still seem unwilling to open up a dialog to make lasting changes regarding inclusion of all people in technology. It’s ironic, and it makes me realize that many communities don’t recognize the problem with a lack of diversity, because they’ve already created success without it."}, {"0f18": "Diversity in tech isn’t just a problem for the people of color and women to solve. No. It’s something everyone needs to think about it, and be held accountable for. Otherwise we get things like this — and this, and this and this. Lets diversify tech now so we don’t have to see this broken part of history continue to repeat itself."}, {"5cac": "Special thanks to Daisha, Jan, Kaley and everyone who helped craft this post"}], "child": "1884_1\t1884_2\t1884_31884_1\t1884_2\t1884_3"}