{"name": "1885", "parent": "", "content": "Why More Minority Founders Should Apply to Y Combinator Y Combinator is looking to increase diversity within technology. That’s why we decided to apply. I’m Dave Salvant, the Co-Founder/President of Squire. Our company went through Y Combinator during the Summer 2016 batch. Squire connects people to great barbers. We are living in a diverse world. We need products and solutions that serve people from all walks of life. We need diverse founders to create these companies. In a recent New Yorker profile on YC’s President, Sam Altman, YC alumni Sebastian Wallin said, “YC provides instant entrée to Silicon Valley — a community that, despite its meritocratic rhetoric, typically requires a “warm intro” from a colleague, who is usually a white man.” With over 1,300 alumni companies that are worth over $80 Billion in combined market cap, the Y Combinator brand holds hella weight in Silicon Valley. Companies such as Airbnb, Dropbox, and Stripe have all gone through the program and have said that YC was critical to their success. YC is a family. They give you access to a network, connections, and resources that you otherwise would not have access to — especially if you’re a minority founder. Squire started out as many companies do. My Co-Founder Songe LaRon and I had the same problem — every few weeks we would have to get a haircut, and we either had to call or text our barber to get an appointment. Or worse, we’d have to take a chance and just show up. First, we thought it was problem unique to African American men, but after speaking to all of our friends, we quickly realized that every man experiences this problem. Busy men don’t want to call or text their barbershop or spend time waiting around. And it’s a pain to make sure you have cash to pay. Songe and I figured, we can pay for food at the tap of a button, why shouldn’t we be able to pay for an haircut? In January 2015, we decided to make the leap and started building a product that would solve this problem full-time. I left business school and Songe quit his job as a corporate attorney. Winter 2015 was hard. Every other week it felt as if I was getting my teeth kicked in. From outsourced tech nightmares, to facing eviction, to being flat broke ($-337 dollars for about two months to be exact). Then, things started to change. To be honest, we got lucky. In fact, luck — the concept of something good happening by sheer chance — is a large part of the story of many successful startups/companies. Knowing the right people and being in the right place at the right time means and does more than you can imagine. We met our third Co-Founder and CTO, Yas Tabasam, at his first meetup in NYC, and the following month we pitched Squire to WeWork founders/executives and received an angel round of funding with little more than wireframes. This is extremely rare for a minority-led tech company. YC funds great founders. We applied three times before and went through YC Fellowship program before we were finally accepted. YC makes you focus on things that matter. During YC, we grew on average 26% week over week in terms of sales and revenue. If you are on the fence about applying, as Michael Seibel, the new CEO of YC Core would say, “Just apply.” There’s a growing number of minority founders in YC these days. I’ve started an internal group called “YCFOC,” Y Combinator Founders of Color. We’d love for more of you to join us. The application deadline has passed but YC accepts late applicants. I’ll leave you with two quotes that have special meaning for me and my team The first is by Wayne Gretzky — “You miss 100% of the shots you don’t take.” The second is by Mark Zuckerberg “The biggest risk is not taking the risk.” Good Luck. Special Thanks to Songe LaRon, Yas Tabasam, Kevin Hale, Michael Seibel, Sam Altman, Qasar Younis, Kat Manalac, Justin Kan, Jesse Middleton, Matt Shampine, Blake Chandlee, Adam Nuemann, Devon Drew, and my family and friends that have supported me along the way. ", "title": "Why More Minority Founders Should Apply to Y Combinator", "sentences": [{"bbba": "Why More Minority Founders Should Apply to Y Combinator"}, {"aee0": "Y Combinator is looking to increase diversity within technology. That’s why we decided to apply."}, {"a280": "I’m Dave Salvant, the Co-Founder/President of Squire. Our company went through Y Combinator during the Summer 2016 batch. Squire connects people to great barbers."}, {"327e": "We are living in a diverse world. We need products and solutions that serve people from all walks of life. We need diverse founders to create these companies. In a recent New Yorker profile on YC’s President, Sam Altman, YC alumni Sebastian Wallin said, “YC provides instant entrée to Silicon Valley — a community that, despite its meritocratic rhetoric, typically requires a “warm intro” from a colleague, who is usually a white man.”"}, {"201b": "With over 1,300 alumni companies that are worth over $80 Billion in combined market cap, the Y Combinator brand holds hella weight in Silicon Valley. Companies such as Airbnb, Dropbox, and Stripe have all gone through the program and have said that YC was critical to their success. YC is a family. They give you access to a network, connections, and resources that you otherwise would not have access to — especially if you’re a minority founder."}, {"13f3": "Squire started out as many companies do. My Co-Founder Songe LaRon and I had the same problem — every few weeks we would have to get a haircut, and we either had to call or text our barber to get an appointment. Or worse, we’d have to take a chance and just show up."}, {"bbfc": "First, we thought it was problem unique to African American men, but after speaking to all of our friends, we quickly realized that every man experiences this problem. Busy men don’t want to call or text their barbershop or spend time waiting around. And it’s a pain to make sure you have cash to pay."}, {"d386": "Songe and I figured, we can pay for food at the tap of a button, why shouldn’t we be able to pay for an haircut? In January 2015, we decided to make the leap and started building a product that would solve this problem full-time. I left business school and Songe quit his job as a corporate attorney."}, {"d2cf": "Winter 2015 was hard. Every other week it felt as if I was getting my teeth kicked in. From outsourced tech nightmares, to facing eviction, to being flat broke ($-337 dollars for about two months to be exact). Then, things started to change. To be honest, we got lucky. In fact, luck — the concept of something good happening by sheer chance — is a large part of the story of many successful startups/companies. Knowing the right people and being in the right place at the right time means and does more than you can imagine. We met our third Co-Founder and CTO, Yas Tabasam, at his first meetup in NYC, and the following month we pitched Squire to WeWork founders/executives and received an angel round of funding with little more than wireframes. This is extremely rare for a minority-led tech company."}, {"f5d5": "YC funds great founders. We applied three times before and went through YC Fellowship program before we were finally accepted. YC makes you focus on things that matter. During YC, we grew on average 26% week over week in terms of sales and revenue. If you are on the fence about applying, as Michael Seibel, the new CEO of YC Core would say, “Just apply.”"}, {"310e": "There’s a growing number of minority founders in YC these days. I’ve started an internal group called “YCFOC,” Y Combinator Founders of Color. We’d love for more of you to join us."}, {"0a25": "The application deadline has passed but YC accepts late applicants. I’ll leave you with two quotes that have special meaning for me and my team The first is by Wayne Gretzky — “You miss 100% of the shots you don’t take.” The second is by Mark Zuckerberg “The biggest risk is not taking the risk.”"}, {"dd44": "Good Luck."}, {"6894": "Special Thanks to Songe LaRon, Yas Tabasam, Kevin Hale, Michael Seibel, Sam Altman, Qasar Younis, Kat Manalac, Justin Kan, Jesse Middleton, Matt Shampine, Blake Chandlee, Adam Nuemann, Devon Drew, and my family and friends that have supported me along the way."}], "child": "1885_1\t1885_2\t1885_3\t1885_4\t1885_5\t1885_6\t1885_7\t1885_8\t1885_9\t1885_10\t1885_11"}