{"name": "1886", "parent": "", "content": "How Our Biases Make Us Blind A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true … but there’s a negative to this uniqueness. A thousand or so years ago, somewhere in the great subcontinent of India, there was a village. Within the village were five elders: men who had traveled wide and studied much. Sadly, back in those days, it was always men; clearly they couldn’t have been that wise. But though they had explored far, they had never met an elephant. The beast was mythical to them, only a few steps away from a dragon or a phoenix. Then one day an elephant came to town. The thing about the elders is that they couldn’t see very well. They weren’t blind as a bat, per say; rather, they were as blind as old, proud men. Since they were each very much accustomed to being right and loved nothing more than to tell their friends about something they didn’t know, each sought out the elephant, looking to report back on the nature of the creature. The first elder came to the elephant and found its trunk. An elephant is a snake, only more playful! he thought to himself. The second elder sauntered up to the elephant and alighted upon its knee. An elephant is rough, round, and strong — like a tree trunk! he decided. The third elder found the elephant’s tusk. An elephant is as sharp as a spear! he understood. The fourth found the ear. An elephant is like a palm frond, so good for shade! The last found the elephant’s rear end. An elephant is very big and very smelly! he admitted. After each elder made his encounter with the ambiguous pachyderm, each told the other what he had found. They each had a different account of elephantness — to be an elephant is to be thick, to be an elephant is to be thin, to be an elephant is to smell bad. It could be said that each elder accurately reported his own experience, yet it’s obvious that each elder’s reportage was incomplete. How can we describe that incompleteness? It is perspective. It is bias. Let’s examine how biases manifest themselves. For instance: A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true — each of us has a genius unique to ourselves, to use the Ancient Greek meaning of the term — but there’s a negative to this uniqueness. Our whole history: the family we’re born into; the town, the state, the country; the schools we attend; the friends we keep; the organizations we form or join; the disciplines we steep ourselves in: designing, writing, leading, coding. Each of these gives us a unique lens through which to view the world, but each lens refracts a different bias, gives us a different hand on the elephant. In the research of Northwestern professor Lauren Rivera, we can see that elite firms have a replication problem: while they may hire to satisfy demographic diversity — getting people with different genders and skin tones into organizations that used to be rather homogenous — they still lack in deep-level diversity. While the new recruits may look different from the old recruits, they still went to the same three schools and were born in the same three zip codes and played the same three sports. Why do these people get hired? Because the hiring managers “click” with them; they just “get along.” They could stand being stuck in an airport with them. But that feeling of “clicking” just means that we have shared experiences with the other person, commonalities in our personal histories. This can make interactions very pleasant; it can also make the processes and products within an organization monolithic. We best empathize with people — be they colleagues or customers — that we have some shared experience with. So if a company is homogenous in form, it will only be able to connect with a homogenous swathe of humans outside the organization — you’ll only be able to communicate with people who have the same hand on the elephant as you do. This leads to a lack of understanding of what value the customer wants. That misunderstanding is the seed of disruption, for the gap between the value you think your customers want and the value your customers actually want is precisely the space where a competitor can replace you. “It could be said that each elder accurately reported his own experience, yet it’s obvious that each elder’s reportage was incomplete. How can we describe that incompleteness? It is perspective. It is bias.” A Different Kind of Blindness September 23, 2010: Blockbuster, the once-mighty purveyor of video rentals, files for bankruptcy. In 2004, it had more than 9,000 stores; by the end of 2013, nearly all of them would be shuttered. What happened? It’s become a morality tale in the business world: gigantic incumbent rests upon laurels, gets upset — or disrupted if you would — by nimble young upstarts. In this case it’s Redbox and Netflix. (By the way, have you started watching House of Cards? It’s great.) The story is that Blockbuster was titanic and lackadaisical and skeptical of this thing called the Internet, and it is for this tone-deafness that the startup kids came and ate their lunch. If you’re following along, at the time of this writing, Netflix’s stock is above $350 a share. “A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true … but there’s a negative to this uniqueness.” Yes, Blockbuster does appear to be a modern myth about the dangers of myopia, but let’s try to take a more empathic lens to its demise. Specifically, let’s try and look at the psychology at work here. While we can’t get into the heads of its execs, we can attempt to consider their vantage point. Imagine you’re a Senior Vice President there — perhaps SVP of DVD Store Experience. (We’re making this up.) If you were the SVP of DVD Store Experience, would you want to bat an eye at this interweb thing that the nerds in IT keep talking about? And who would wait for DVDs to arrive in the mail when they could just go to the charming blue store? And again, who cares about the internet: the transfer speeds are so slow! No, you need to perfect the placement of New Releases as the customer walks into the store — get that display right and they’ll be sure to love their shopping experience. Now we can begin to understand a few of the busts lying within Blockbuster. First, there seemed to be a bias toward clinging to The Way Things Are, and a false assumption that The Way Things Are is the same as The Way Things Always Will Be. People love movies. To get the movies they love, they drive to the store and rent them — only to return them a few days late and face that late fee. What’s missing here is an understanding of the value that customers are coming to them for, the ”job” that users are ”hiring” the product to do. The guy renting the action movie just wants to lounge on his couch and watch things blow up. If he can get that same pyrotechnic delight from another avenue — like by getting a DVD in the mail or streaming it to his laptop — then he’s going to opt for that more convenient option. As will, history now shows us, everybody else. In hindsight, all of this looks so obvious. But what was it that prevented Blockbuster from actually adapting? What is it that prevents any organization from adapting? Bias is the root of that dysfunction. “That misunderstanding is the seed of disruption, for the gap between the value you think your customers want and the value your customers actually want is precisely the space where a competitor can replace you.” It’s the Structure, Stupid Let’s take Yammer, which was recently acquired by Microsoft, as an example of one way to overcome bias. Within the engineering section of Yammer, people don’t keep their positions for long — teams form, split and re-form with others. This makes the workday more about the work and less about the title. Knowledge naturally gets shared between individuals, making for a higher bandwidth organizational network. Those with natural leadership skills show themselves to be leaders. Developers get to test their abilities in a range of structures, in a range of contexts. This allows for the team to optimize for the value that users are telling them they want through their behavior; the team can be responsive, allowing strategies to emerge from the shifting tastes of users rather than having them arranged for by leadership and the organizational structure. Why is this important? Because we are creatures of our structure. Blockbuster was organized around making an awesome DVD rental experience — intentionally or not, they were fixated on the medium that delivers the value rather than the value itself. But the user doesn’t care about the medium, they care about the value, the experience they associate with your brand. It’s not that structure itself is maladaptive; but it is if the structure doesn’t flex to fit to the changing environment. Some companies are excellent in managing for that fit. One of them is Square, the payments company founded by Twitter alumnus Jack Dorsey. When someone within the organization wants to test a new product, they quickly assemble a ”fullstack” team — that is, one having a whole range of necessary capabilities present within a team: you have developers, designers, project managers, the whole lot. Management scholars call the congruence between environmental demands and organizational needs requisite variety: the information entering into the team is complex, so the constituents of the team need to match that complexity in order to operate at a high function. What’s the result? The team doesn’t need to conscript talent from another wing of the company to move forward with an idea. Similarly, they don’t need to make a pitch presentation for some manager’s approval in order to improve the product. This allows for more rapid decisions, and thus more rapid iterations, and thus better, faster, more adaptable business. While the structure may seem inconsequential (it’s only stuff that people in HR pay attention to, right?), it is, in fact, incredibly predictive of the outcome. As Blockbuster, Yammer, and Square all show, the structure itself — something often invisible to the people within the organization — predicts the function of the organization. This is a lesson that the young creative must learn again and again, for the most difficult part of composing a narrative work — be it a film or a book — is to figure out the structure of the telling. The same scenes told in a different order reveal a vastly different story. It’s similar within business: while a top-down, waterfall, command-and-control structure is amazing for mobilizing quickly, it’s not so good for coming up with new ideas and adapting to the shifting desires of users. “… the information entering into the team is complex, so the constituents of the team need to match that complexity in order to operate at a high function.” But when a structure is matched to its environment, the results can be extraordinary. Depending on where your hand is on the elephant and how your structure suits your environment, bias — when accounted for — can be overcome. [Photo: Unsplash user Peter Clarkson] Adapted from “Everything Connects — How to Transform and Lead in the Age of Creativity, Innovation and Sustainability” (McGraw Hill, 2014). Copyright © 2015 by Faisal Hoque. All rights reserved. I am an entrepreneur and author. Founder of SHADOKA and other companies. Shadoka enables entrepreneurship, growth, and social impact. Author of “Everything Connects — How to Transform and Lead in the Age of Creativity, Innovation and Sustainability” (McGraw Hill, 2014) and “Survive to Thrive: 27 Practices of Resilient Entrepreneurs, Innovators, and Leaders” (Motivational Press, 2015). Follow me on Twitter @faisal_hoque. Use the Everything Connects leadership app for free. ", "title": "How Our Biases Make Us Blind", "sentences": [{"49ba": "How Our Biases Make Us Blind"}, {"c5a1": "A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true … but there’s a negative to this uniqueness."}, {"76f4": "A thousand or so years ago, somewhere in the great subcontinent of India, there was a village. Within the village were five elders: men who had traveled wide and studied much."}, {"aa7d": "Sadly, back in those days, it was always men; clearly they couldn’t have been that wise. But though they had explored far, they had never met an elephant. The beast was mythical to them, only a few steps away from a dragon or a phoenix. Then one day an elephant came to town."}, {"dab0": "The thing about the elders is that they couldn’t see very well. They weren’t blind as a bat, per say; rather, they were as blind as old, proud men. Since they were each very much accustomed to being right and loved nothing more than to tell their friends about something they didn’t know, each sought out the elephant, looking to report back on the nature of the creature."}, {"c8ce": "The first elder came to the elephant and found its trunk. An elephant is a snake, only more playful! he thought to himself. The second elder sauntered up to the elephant and alighted upon its knee. An elephant is rough, round, and strong — like a tree trunk! he decided. The third elder found the elephant’s tusk. An elephant is as sharp as a spear! he understood. The fourth found the ear. An elephant is like a palm frond, so good for shade! The last found the elephant’s rear end. An elephant is very big and very smelly! he admitted."}, {"1dee": "After each elder made his encounter with the ambiguous pachyderm, each told the other what he had found. They each had a different account of elephantness — to be an elephant is to be thick, to be an elephant is to be thin, to be an elephant is to smell bad. It could be said that each elder accurately reported his own experience, yet it’s obvious that each elder’s reportage was incomplete. How can we describe that incompleteness? It is perspective. It is bias."}, {"1266": "Let’s examine how biases manifest themselves."}, {"38e2": "For instance:"}, {"ba63": "A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true — each of us has a genius unique to ourselves, to use the Ancient Greek meaning of the term — but there’s a negative to this uniqueness."}, {"2332": "Our whole history: the family we’re born into; the town, the state, the country; the schools we attend; the friends we keep; the organizations we form or join; the disciplines we steep ourselves in: designing, writing, leading, coding. Each of these gives us a unique lens through which to view the world, but each lens refracts a different bias, gives us a different hand on the elephant."}, {"4337": "In the research of Northwestern professor Lauren Rivera, we can see that elite firms have a replication problem: while they may hire to satisfy demographic diversity — getting people with different genders and skin tones into organizations that used to be rather homogenous — they still lack in deep-level diversity. While the new recruits may look different from the old recruits, they still went to the same three schools and were born in the same three zip codes and played the same three sports. Why do these people get hired? Because the hiring managers “click” with them; they just “get along.” They could stand being stuck in an airport with them."}, {"0230": "But that feeling of “clicking” just means that we have shared experiences with the other person, commonalities in our personal histories. This can make interactions very pleasant; it can also make the processes and products within an organization monolithic. We best empathize with people — be they colleagues or customers — that we have some shared experience with. So if a company is homogenous in form, it will only be able to connect with a homogenous swathe of humans outside the organization — you’ll only be able to communicate with people who have the same hand on the elephant as you do. This leads to a lack of understanding of what value the customer wants. That misunderstanding is the seed of disruption, for the gap between the value you think your customers want and the value your customers actually want is precisely the space where a competitor can replace you."}, {"b319": "“It could be said that each elder accurately reported his own experience, yet it’s obvious that each elder’s reportage was incomplete. How can we describe that incompleteness? It is perspective. It is bias.”"}, {"6299": "A Different Kind of Blindness"}, {"afed": "September 23, 2010: Blockbuster, the once-mighty purveyor of video rentals, files for bankruptcy. In 2004, it had more than 9,000 stores; by the end of 2013, nearly all of them would be shuttered. What happened?"}, {"33eb": "It’s become a morality tale in the business world: gigantic incumbent rests upon laurels, gets upset — or disrupted if you would — by nimble young upstarts. In this case it’s Redbox and Netflix. (By the way, have you started watching House of Cards? It’s great.) The story is that Blockbuster was titanic and lackadaisical and skeptical of this thing called the Internet, and it is for this tone-deafness that the startup kids came and ate their lunch. If you’re following along, at the time of this writing, Netflix’s stock is above $350 a share."}, {"adc7": "“A lot of us grew up with the idea that we were beautiful, unique, utterly irreplaceable snowflakes. This is true … but there’s a negative to this uniqueness.”"}, {"1e1e": "Yes, Blockbuster does appear to be a modern myth about the dangers of myopia, but let’s try to take a more empathic lens to its demise. Specifically, let’s try and look at the psychology at work here. While we can’t get into the heads of its execs, we can attempt to consider their vantage point."}, {"b737": "Imagine you’re a Senior Vice President there — perhaps SVP of DVD Store Experience. (We’re making this up.) If you were the SVP of DVD Store Experience, would you want to bat an eye at this interweb thing that the nerds in IT keep talking about? And who would wait for DVDs to arrive in the mail when they could just go to the charming blue store? And again, who cares about the internet: the transfer speeds are so slow! No, you need to perfect the placement of New Releases as the customer walks into the store — get that display right and they’ll be sure to love their shopping experience."}, {"5ade": "Now we can begin to understand a few of the busts lying within Blockbuster. First, there seemed to be a bias toward clinging to The Way Things Are, and a false assumption that The Way Things Are is the same as The Way Things Always Will Be."}, {"04cd": "People love movies. To get the movies they love, they drive to the store and rent them — only to return them a few days late and face that late fee. What’s missing here is an understanding of the value that customers are coming to them for, the ”job” that users are ”hiring” the product to do."}, {"7c8b": "The guy renting the action movie just wants to lounge on his couch and watch things blow up. If he can get that same pyrotechnic delight from another avenue — like by getting a DVD in the mail or streaming it to his laptop — then he’s going to opt for that more convenient option. As will, history now shows us, everybody else."}, {"cd8e": "In hindsight, all of this looks so obvious. But what was it that prevented Blockbuster from actually adapting? What is it that prevents any organization from adapting? Bias is the root of that dysfunction."}, {"acbb": "“That misunderstanding is the seed of disruption, for the gap between the value you think your customers want and the value your customers actually want is precisely the space where a competitor can replace you.”"}, {"088b": "It’s the Structure, Stupid"}, {"fd65": "Let’s take Yammer, which was recently acquired by Microsoft, as an example of one way to overcome bias. Within the engineering section of Yammer, people don’t keep their positions for long — teams form, split and re-form with others. This makes the workday more about the work and less about the title. Knowledge naturally gets shared between individuals, making for a higher bandwidth organizational network. Those with natural leadership skills show themselves to be leaders. Developers get to test their abilities in a range of structures, in a range of contexts. This allows for the team to optimize for the value that users are telling them they want through their behavior; the team can be responsive, allowing strategies to emerge from the shifting tastes of users rather than having them arranged for by leadership and the organizational structure."}, {"e3b0": "Why is this important? Because we are creatures of our structure. Blockbuster was organized around making an awesome DVD rental experience — intentionally or not, they were fixated on the medium that delivers the value rather than the value itself. But the user doesn’t care about the medium, they care about the value, the experience they associate with your brand."}, {"ac52": "It’s not that structure itself is maladaptive; but it is if the structure doesn’t flex to fit to the changing environment. Some companies are excellent in managing for that fit. One of them is Square, the payments company founded by Twitter alumnus Jack Dorsey. When someone within the organization wants to test a new product, they quickly assemble a ”fullstack” team — that is, one having a whole range of necessary capabilities present within a team: you have developers, designers, project managers, the whole lot."}, {"637e": "Management scholars call the congruence between environmental demands and organizational needs requisite variety: the information entering into the team is complex, so the constituents of the team need to match that complexity in order to operate at a high function. What’s the result?"}, {"11b2": "The team doesn’t need to conscript talent from another wing of the company to move forward with an idea. Similarly, they don’t need to make a pitch presentation for some manager’s approval in order to improve the product. This allows for more rapid decisions, and thus more rapid iterations, and thus better, faster, more adaptable business."}, {"a758": "While the structure may seem inconsequential (it’s only stuff that people in HR pay attention to, right?), it is, in fact, incredibly predictive of the outcome. As Blockbuster, Yammer, and Square all show, the structure itself — something often invisible to the people within the organization — predicts the function of the organization."}, {"4da1": "This is a lesson that the young creative must learn again and again, for the most difficult part of composing a narrative work — be it a film or a book — is to figure out the structure of the telling. The same scenes told in a different order reveal a vastly different story. It’s similar within business: while a top-down, waterfall, command-and-control structure is amazing for mobilizing quickly, it’s not so good for coming up with new ideas and adapting to the shifting desires of users."}, {"8094": "“… the information entering into the team is complex, so the constituents of the team need to match that complexity in order to operate at a high function.”"}, {"dc6e": "But when a structure is matched to its environment, the results can be extraordinary."}, {"fc16": "Depending on where your hand is on the elephant and how your structure suits your environment, bias — when accounted for — can be overcome."}, {"8ed1": "[Photo: Unsplash user Peter Clarkson]"}, {"a785": "Adapted from “Everything Connects — How to Transform and Lead in the Age of Creativity, Innovation and Sustainability” (McGraw Hill, 2014). Copyright © 2015 by Faisal Hoque. All rights reserved."}, {"a63c": "I am an entrepreneur and author. Founder of SHADOKA and other companies. Shadoka enables entrepreneurship, growth, and social impact. Author of “Everything Connects — How to Transform and Lead in the Age of Creativity, Innovation and Sustainability” (McGraw Hill, 2014) and “Survive to Thrive: 27 Practices of Resilient Entrepreneurs, Innovators, and Leaders” (Motivational Press, 2015). Follow me on Twitter @faisal_hoque."}, {"3521": "Use the Everything Connects leadership app for free."}], "child": "1886_11886_11886_1"}