{"name": "1887", "parent": "", "content": "Ladies That UX on women in design and diversity Ladies That UX, an international organization of women UXers with over fifty chapters worldwide, reached out to the global Women in UX community to gather several different viewpoints on how women contribute to the UX field at large. cel·e·brate: acknowledge (a significant or happy day or event) with a social gathering or enjoyable activity; perform a ceremony publicly and duly. Why is it important to celebrate and promote women in UX? “Because my 5-year old daughter deserves to grow up in a world with products and services designed for her. Women bring important perspectives to design. We need the experience and skills of UXers of all genders,” explains Melissa Eggleston, a Durham-based UX consultant. Melissa Eggleston, UX Consultant (Photo courtesy of Kari Leigh Marucchi of Found Art Photography) Sarah Doody, Founder of the UX Notebook adds, \"as the UX community grows, we must work hard to increase awareness of other women in UX because too many great voices and ideas aren’t surfacing in the existing community. Once I said to someone, ‘Why should I teach UX, aren’t there enough UX courses out there’, and the person replied, ‘yes but some people want to learn from you’. We’re drawn to and connect with with different types of people — personality, background, life experience. By promoting a diverse range of women in UX, we increase the awareness of many great people to learn from\". It’s not that anyone is better than the other. It’s that each woman has a unique voice and perspective that attracts people to want to learn from them. “Teams with women simply perform better.” adds Mariah Hay, VP of Pluralsight. “I’m no expert on this topic but there is lots of thought leadership out there on why this happens; from team psychology to empathic decision making, gender diversity is a true competitive advantage. I’ve personally experienced the difference and would encourage organizations to carefully curate their teams for diversity.” Luana Cavalcanti from Dublin, Ireland has also observed this phenomenon and offers an explanation. “Many studies have shown that women tend to score higher on tests of social sensitivity than men do, that means that working with women makes a team smarter. Promoting women in UX raises awareness about the importance of gender equality, what makes a good user experience is diversity in ideas, concepts and experiences and the more women working with UX.” San Francisco-based Jenny Shen of Jenny Shen Designs shares a similar perspective. “In my experience, the ones in the spotlight as leaders, speakers, and trainers of UX tend to be men. We need women in UX to be in the spotlight, offering their perspectives, so people in the industry can get a holistic understanding of how UX designers solve problems in different ways.” Why is it beneficial for senior female UX designers to connect with and mentor younger practitioners? “It’s easy to get lost and doubt yourself as you navigate the early stages of your career, senior female UX designers help inspire and reminder younger designers of what’s possible and, that there is no there.” says Sarah. “When you’re just starting out, you’re hungry for knowledge and self-growth. You’re chasing the time when you’ll finally feel like you made it in your career. But, as you mature and growth both personally and professionally you realize that there is no there. Those feelings of doubt and uncertainly never go away. The idea of imposter syndrome doesn’t magically leave when you get more experience. We’re all trying to figure it out, just like everyone else. The difference? Senior female UX designers likely have more confidence in themselves and their skills — and I think that confidence is what’s like a magnet for younger practitioners and helps inspire them to keep going.” “Each time a girl opens a book and reads a womanless history, she learns she is worth less.” Mariah shares a quote to describe her sentiments. “Myra Pollack Sadker once said “Each time a girl opens a book and reads a womanless history, she learns she is worth less.” The same is true for each professional context a women arrives in and finds herself alone in her gender. By reaching out a hand to the next generation of female UX practitioners, we break that very real, and often overlooked barrier — simply by being proof, that she too belongs.” Melissa feels an immediate gratification in that sharing the knowledge also helps her hone her ability to educate other partners, who may not even practice UX. “Each time I explain a concept or idea to a new UXer, it helps me better explain it to the marketer, the developer, or others who aren’t familiar with UX. Part of UX is being an evangelist for the industry, at least where I live, so skills in this area are important to have.” Jenny Shen, Founder & UX UI Designer, jennyshen.com “Mentorship can help younger practitioners improve their chances of success by sharing valuable learnings, similar experiences and helping mentees feel more confident and comfortable in their journey.” — Jenny Shen Luana suggests, “I think that mentorship is essential for career growth especially for younger practitioners, you can only be inspired if you share your career failure and success stories, when you connect to someone who has more experience than yourself you build your confidence because you gain valuable feedback that will prepare you to face real world challenges.” What is your most rewarding and inspirational experience as a female UX practitioner? Sarah Doody, UX Designer, Consultant, Founder of The UX Notebook Sarah shares, “I’m a completely self taught UX designer and when I was starting out, I remember reading Boxes & Arrows and following a ton of people in the field on Twitter. I’m pretty independent and introverted, so I didn’t do much reaching out to other designers for mentorship — men or women. My presence on Twitter (@sarahdoody) and my weekly UX newsletter and created a platform for sharing my knowledge and the knowledge of others. I get a lot of email from other women (and men) thanking me for sometime I tweeted, or wrote, or said at a conference. It’s a great reminder for all of us that you should share that idea, write that article, talk at that event — because you never know who you’re going to inspire or who may need to hear that message, from you.” “As a UX Leader and woman, I often volunteer to speak to UX and Technology classes, at meetups, and mentor anyone who is interested in our profession,” reflects Mariah. “This is not only because I am a total nerd and love talking shop, but because I know women are the minority in our industry. I make it a point to give my time to others so they can see a path to success. From time to time I hear back from folks I have connected with, and they tell me about their progress. These notes fill me with so much joy — when we help others succeed, we all succeed.” Luana Cavalcanti, UI / UX Designer Melissa shares a particularly gratifying experience. “A young, new-to-UX woman told me she was nervous about an interview coming up the following afternoon. She had heard they might ask her to do a whiteboard challenge. A meeting for the next morning had just rescheduled, so I asked her if she wanted to practice with me. We met, and I gave a her an approach to take to the challenges and coached her through a few. In 90 short minutes she made incredible progress! By the end of our time, she had a method to tackle challenges and had a good sense of how to field questions. It was heartening for me to see and an excellent reminder for me of the importance of practicing. It helped her walk confidently into an interview. It was a win-win and a valuable use of time.” “The success of the community led me to believe that we’re indeed filling a real need in the society.” — Jenny Shen Jenny recalls the early struggles of how establishing her local chapter in Amsterdam had a humble beginning, but undiscouraged, she continued contributing to the community until she finally saw the chapter grow to impressive numbers. “I’ve been going to UX meetups for years and almost every time, there is only a handful of female attendees. When I started Ladies that UX Amsterdam in 2015, I got questions from men and women about why we’re separating women, and criticism of women in tech organizations that I had to defend. Despite the discouragement, I continued to organize meetups and grow the organizing team. We started to get compliments that our meetup is more welcoming than other UX meetups, even from male members. One time, a male Twitter follower thanked us because he works in tech and we were inspirational to his daughters. That really touched us. Right now, Ladies that UX Amsterdam has grown to almost 1000 members and is currently the biggest women in tech community in the Netherlands. The success of the community led me to believe that we’re indeed filling a real need in the society.” Luana recounts an experience from her early days as a practitioner. “My journey to UX started when I was working with localization, after all, a good UX is contextual, language included. I often found myself more interested in the whole concept of building an app or a service. I wanted to prototype, to do research and all that became very clear after I read The Design of Every Day Things, then from there I started researching about user experience until I decided to start a second bachelor in Digital technology and Design, while studying I started working as UX designer, however a moment that gave me a wider perspective of my potential as multilingual UX Designer was through Mentorship Everywhere , a mentorship program from Automattic, having a senior UX designer mentor me made me aware of my limitations and strengths and broaden my skills set.” Ladies That UX -Fancy meeting other women for a good old natter about UX and life in general? Then Ladies that UX is for you. Not got…ladiesthatux.com Special thanks to our Ladies That UX contributors: See you in the next article. ", "title": "Ladies That UX on women in design and diversity", "sentences": [{"66ca": "Ladies That UX on women in design and diversity"}, {"c3c2": "Ladies That UX, an international organization of women UXers with over fifty chapters worldwide, reached out to the global Women in UX community to gather several different viewpoints on how women contribute to the UX field at large."}, {"fc42": "cel·e·brate: acknowledge (a significant or happy day or event) with a social gathering or enjoyable activity; perform a ceremony publicly and duly."}, {"a5fd": "Why is it important to celebrate and promote women in UX?"}, {"aa7a": "“Because my 5-year old daughter deserves to grow up in a world with products and services designed for her. Women bring important perspectives to design. We need the experience and skills of UXers of all genders,” explains Melissa Eggleston, a Durham-based UX consultant."}, {"6835": "Melissa Eggleston, UX Consultant (Photo courtesy of Kari Leigh Marucchi of Found Art Photography)"}, {"eb31": "Sarah Doody, Founder of the UX Notebook adds, \"as the UX community grows, we must work hard to increase awareness of other women in UX because too many great voices and ideas aren’t surfacing in the existing community. Once I said to someone, ‘Why should I teach UX, aren’t there enough UX courses out there’, and the person replied, ‘yes but some people want to learn from you’. We’re drawn to and connect with with different types of people — personality, background, life experience. By promoting a diverse range of women in UX, we increase the awareness of many great people to learn from\"."}, {"a26a": "It’s not that anyone is better than the other."}, {"b973": "It’s that each woman has a unique voice and perspective that attracts people to want to learn from them."}, {"e857": "“Teams with women simply perform better.” adds Mariah Hay, VP of Pluralsight. “I’m no expert on this topic but there is lots of thought leadership out there on why this happens; from team psychology to empathic decision making, gender diversity is a true competitive advantage. I’ve personally experienced the difference and would encourage organizations to carefully curate their teams for diversity.”"}, {"0262": "Luana Cavalcanti from Dublin, Ireland has also observed this phenomenon and offers an explanation. “Many studies have shown that women tend to score higher on tests of social sensitivity than men do, that means that working with women makes a team smarter. Promoting women in UX raises awareness about the importance of gender equality, what makes a good user experience is diversity in ideas, concepts and experiences and the more women working with UX.”"}, {"3c26": "San Francisco-based Jenny Shen of Jenny Shen Designs shares a similar perspective. “In my experience, the ones in the spotlight as leaders, speakers, and trainers of UX tend to be men. We need women in UX to be in the spotlight, offering their perspectives, so people in the industry can get a holistic understanding of how UX designers solve problems in different ways.”"}, {"6c3b": "Why is it beneficial for senior female UX designers to connect with and mentor younger practitioners?"}, {"c1ef": "“It’s easy to get lost and doubt yourself as you navigate the early stages of your career, senior female UX designers help inspire and reminder younger designers of what’s possible and, that there is no there.” says Sarah. “When you’re just starting out, you’re hungry for knowledge and self-growth. You’re chasing the time when you’ll finally feel like you made it in your career. But, as you mature and growth both personally and professionally you realize that there is no there. Those feelings of doubt and uncertainly never go away. The idea of imposter syndrome doesn’t magically leave when you get more experience. We’re all trying to figure it out, just like everyone else. The difference? Senior female UX designers likely have more confidence in themselves and their skills — and I think that confidence is what’s like a magnet for younger practitioners and helps inspire them to keep going.”"}, {"4ef4": "“Each time a girl opens a book and reads a womanless history, she learns she is worth less.”"}, {"205a": "Mariah shares a quote to describe her sentiments. “Myra Pollack Sadker once said “Each time a girl opens a book and reads a womanless history, she learns she is worth less.” The same is true for each professional context a women arrives in and finds herself alone in her gender. By reaching out a hand to the next generation of female UX practitioners, we break that very real, and often overlooked barrier — simply by being proof, that she too belongs.”"}, {"b5c5": "Melissa feels an immediate gratification in that sharing the knowledge also helps her hone her ability to educate other partners, who may not even practice UX. “Each time I explain a concept or idea to a new UXer, it helps me better explain it to the marketer, the developer, or others who aren’t familiar with UX. Part of UX is being an evangelist for the industry, at least where I live, so skills in this area are important to have.”"}, {"b436": "Jenny Shen, Founder & UX UI Designer, jennyshen.com"}, {"0378": "“Mentorship can help younger practitioners improve their chances of success by sharing valuable learnings, similar experiences and helping mentees feel more confident and comfortable in their journey.” — Jenny Shen"}, {"9f72": "Luana suggests, “I think that mentorship is essential for career growth especially for younger practitioners, you can only be inspired if you share your career failure and success stories, when you connect to someone who has more experience than yourself you build your confidence because you gain valuable feedback that will prepare you to face real world challenges.”"}, {"0488": "What is your most rewarding and inspirational experience as a female UX practitioner?"}, {"7f3a": "Sarah Doody, UX Designer, Consultant, Founder of The UX Notebook"}, {"ceab": "Sarah shares, “I’m a completely self taught UX designer and when I was starting out, I remember reading Boxes & Arrows and following a ton of people in the field on Twitter. I’m pretty independent and introverted, so I didn’t do much reaching out to other designers for mentorship — men or women. My presence on Twitter (@sarahdoody) and my weekly UX newsletter and created a platform for sharing my knowledge and the knowledge of others. I get a lot of email from other women (and men) thanking me for sometime I tweeted, or wrote, or said at a conference. It’s a great reminder for all of us that you should share that idea, write that article, talk at that event — because you never know who you’re going to inspire or who may need to hear that message, from you.”"}, {"d628": "“As a UX Leader and woman, I often volunteer to speak to UX and Technology classes, at meetups, and mentor anyone who is interested in our profession,” reflects Mariah. “This is not only because I am a total nerd and love talking shop, but because I know women are the minority in our industry. I make it a point to give my time to others so they can see a path to success. From time to time I hear back from folks I have connected with, and they tell me about their progress. These notes fill me with so much joy — when we help others succeed, we all succeed.”"}, {"dc3f": "Luana Cavalcanti, UI / UX Designer"}, {"aeee": "Melissa shares a particularly gratifying experience. “A young, new-to-UX woman told me she was nervous about an interview coming up the following afternoon. She had heard they might ask her to do a whiteboard challenge. A meeting for the next morning had just rescheduled, so I asked her if she wanted to practice with me. We met, and I gave a her an approach to take to the challenges and coached her through a few. In 90 short minutes she made incredible progress! By the end of our time, she had a method to tackle challenges and had a good sense of how to field questions. It was heartening for me to see and an excellent reminder for me of the importance of practicing. It helped her walk confidently into an interview. It was a win-win and a valuable use of time.”"}, {"6af1": "“The success of the community led me to believe that we’re indeed filling a real need in the society.” — Jenny Shen"}, {"b480": "Jenny recalls the early struggles of how establishing her local chapter in Amsterdam had a humble beginning, but undiscouraged, she continued contributing to the community until she finally saw the chapter grow to impressive numbers. “I’ve been going to UX meetups for years and almost every time, there is only a handful of female attendees. When I started Ladies that UX Amsterdam in 2015, I got questions from men and women about why we’re separating women, and criticism of women in tech organizations that I had to defend. Despite the discouragement, I continued to organize meetups and grow the organizing team. We started to get compliments that our meetup is more welcoming than other UX meetups, even from male members. One time, a male Twitter follower thanked us because he works in tech and we were inspirational to his daughters. That really touched us. Right now, Ladies that UX Amsterdam has grown to almost 1000 members and is currently the biggest women in tech community in the Netherlands. The success of the community led me to believe that we’re indeed filling a real need in the society.”"}, {"bf5b": "Luana recounts an experience from her early days as a practitioner. “My journey to UX started when I was working with localization, after all, a good UX is contextual, language included. I often found myself more interested in the whole concept of building an app or a service. I wanted to prototype, to do research and all that became very clear after I read The Design of Every Day Things, then from there I started researching about user experience until I decided to start a second bachelor in Digital technology and Design, while studying I started working as UX designer, however a moment that gave me a wider perspective of my potential as multilingual UX Designer was through Mentorship Everywhere , a mentorship program from Automattic, having a senior UX designer mentor me made me aware of my limitations and strengths and broaden my skills set.”"}, {"f912": "Ladies That UX -Fancy meeting other women for a good old natter about UX and life in general? Then Ladies that UX is for you. Not got…ladiesthatux.com"}, {"4940": "Special thanks to our Ladies That UX contributors:"}, {"0bcb": "See you in the next article."}], "child": "1887_11887_1"}