{"name": "189", "parent": "", "content": "No, I will not “waste” my degree if I don’t get a decent job Can’t I just float around for a bit? When (adult) people ask me what job I will get after I graduate, I often laughingly tell them I want to be a server at my favourite ramen shop and have free ramen every day and night, just to see how long I can last. “You spent four years getting a degree, and being a server will be a huge waste,” said the adults. What should I do then? Spend the rest of my life doing something not because I like it or believe in it, but only because it guarantees a stable income? That would be a waste. And the lessons I had in college will live with me as well. Can people stop judging? (35/100) If you like my stuff, please click the green ❤ to share it and follow me :D My stuff: https://medium.com/@thatshirleylee ", "title": "No, I will not “waste” my degree if I don’t get a decent job", "sentences": [{"ad1f": "No, I will not “waste” my degree if I don’t get a decent job"}, {"e58d": "Can’t I just float around for a bit?"}, {"75e2": "When (adult) people ask me what job I will get after I graduate, I often laughingly tell them I want to be a server at my favourite ramen shop and have free ramen every day and night, just to see how long I can last."}, {"93ee": "“You spent four years getting a degree, and being a server will be a huge waste,” said the adults."}, {"e2a6": "What should I do then? Spend the rest of my life doing something not because I like it or believe in it, but only because it guarantees a stable income? That would be a waste."}, {"7f3a": "And the lessons I had in college will live with me as well."}, {"71e5": "Can people stop judging?"}, {"029f": "(35/100)"}, {"9c37": "If you like my stuff, please click the green ❤ to share it and follow me :D"}, {"0844": "My stuff: https://medium.com/@thatshirleylee"}], "child": "189_1\t189_2\t189_3\t189_4\t189_5\t189_6\t189_7\t189_8189_1\t189_2\t189_3\t189_4\t189_5\t189_6\t189_7\t189_8"}