{"name": "1891", "parent": "", "content": "Combatting unconscious bias in design Without realizing it, biases can manifest themselves into our design decisions. How can we create systems that respond to diversity and measure the impact it will have on the end user? bi·as: prejudice in favor of or against one thing, person, or group compared with another, usually in a way considered to be unfair; cause to feel or show inclination or prejudice for or against someone or something. A few years ago, a male-led design team was working on a brief for a major athletic apparel company. When the team presented its work to the client, the reaction was honest: the work was too clinical and serious. Perhaps female designers would help take the work in a different direction? As a result, a few women were brought in to diversify the team. The end result: work which was more simple, friendlier and easier to understand. Without realizing it, biases can manifest themselves into our design decisions. But considering diverse teams from the outset is so important as we create work for cross-cultural products and services targeted toward diverse, global audiences. As a female creative director, I see diversity impact design decisions made daily, and quite often, I’m the only female in the room, surrounded by male C-suite execs. The 3% reported roughly 11% of creative directors are female, while 73% of consumer purchasing decisions are made by women, $20 trillion of the world’s annual spending. The majority of designs are being directed by people for people not like them. Roughly 11% of creative directors are female, while 73% of consumer purchasing decisions are made by women, $20 trillion of the world’s annual spending. It has been shown that we do 98% of our thinking in our subconscious mind. This is where we store our implicit or unconscious biases. Unconscious bias is the result of the brain working automatically to make decisions without thinking, programmed to make quick decisions a legacy of our survival instincts. This results from the brain deflecting to moments that are familiar to us and to what we know. These biases represent themselves in the systems and designs being created. Unconscious bias exists in many forms, including race, gender, culture, age and religion. As creators, it is our responsibility to be aware of our natural biases as we make design decisions so that we can better connect with and design for a wider audience. 40 years ago, colour film was designed to work perfectly for people with white skin. It wasn’t until 1995 that Kodak introduced a colour film that catered to people of multi-racial skin colours. Today, we have mobile cameras and social media filters exhibiting similar biases, with several examples of people with dark skin not being recognized and other racially insensitive charges being discussed in the media. A recent example of a Chinese man in New Zealand who couldn’t have his passport photo recognized in the online system because “subject eyes are closed” are all examples of machines not being programmed to accept diversity in people. Unconscious bias in design systems — IMAGE:MASHABLE How is it possible in 2016 that there is technology making the same mistakes as Kodak in the 1960s? The result of the actions by designers quickly encroaches on that of machines, and as we progress further into the world of machine learning and artificial intelligence we need to ensure that pre-existing models and shortcuts are not designed into the technology. A problem with the evolution of these systems is that algorithms are being created with the inventors’ unconscious biases: Once systems are created, the test subjects are often internal subjects or recruits with similar backgrounds to the creators, therefore the voice or learning program becomes more receptive to that uniform group. The same goes for language. I have seen people in my office where English isn’t their first language try to engage with Amazon’s Alexa. But because of their accents, their commands aren’t recognized. Alexa isn’t necessarily racist but the conversational interface has been programmed with unconscious biases, assuming that all end users will speak and sound the same. As designers, we need to create systems which can respond to diversity and measure the impact it will have on the end user. Designing for a diverse global audience At R/GA, to achieve global audience reach we leverage people with diverse backgrounds and skill sets for all aspects of work from our network, from research and development to creation of our products and services. We compile rich cultural audience insights to garner more diverse thinking, with evidence of success from ensuring a diverse mix of people are participating from the early stages of the design process. The design model we use, “Human, Simple, Powerful,” ensures framing and awareness of diversity at the outset. The “Human” element of this is key to counter unconscious bias. When problems are addressed through a human lens, cultures and customs are considered in design solutions. Once we have a prototype, user testing is key to test with a diverse audience that represents the anticipated end users. “Human, Simple, Powerful” helps us really get behind the context, environment & mindset of users in order to create conscious ecosystems, by mapping out the touchpoints that each of these individuals will encounter and considering breakpoints for people of diverse backgrounds. Experience mapping and validation are conducted in global and local markets with a varied set of personas to get a well-rounded picture of the end users. We then use these cultural understandings of individuals to ensure that we create a clear, focused, and centered idea in order to eliminate ambiguity. Human, Simple, Powerful — the R/GA London product and services design model Empowering diversity Our London office champions a group called Woman Up, for both males and females, with a goal to empower and foster the women of our company while attracting the best female talent in the industry. Since its inception in 2016, the group has evolved to now be embedded in the work. In London, it’s used as an outlet to validate and ensure more diversity on briefs. The initiative sponsors brainstorm panels to ensure a dual-gendered perspective to client briefs. A Woman Up workgroup assesses work and looks for opportunities for diversity. A lot of our best work is created when there is a mix of diverse skills and backgrounds involved. The power of diversity ensures the end result is appealing to a much wider audience. R/GA London — Woman Up Testing your own biases We are facing new challenges and we need to embrace new mindsets to tackle them. The Harvard Implicit personality test developed 20 years ago allows you to assess your own biases with tests measuring biases on skin-tone, race, weight, gender, sexuality, disability and age. Though the test has recently come under scrutiny as to its validity by researchers at the University of Wisconsin at Madison, Harvard, and the University of Virginia, it’s worth taking to open your eyes to your own unconscious bias. Responsibility exists for designers to ensure that what is being created has a consideration for the diversity of the audience. Ideas need to be prototyped, tested and iterated upon with many different inputs. Diversity is inherent to how we design, it’s in the people we hire, the clients we work with and the products and services we create. The next time you tackle your next design problem make sure you understand your audience, and if you don’t, make a conscious decision to learn about them, validate with them and think from their point of view about what really interests them. Let’s not continue to make the same mistakes as the 1960’s and ensure we always practice more inclusive design. We invited Jen Heazlewood to be part of this series after seeing her presentation at Interaction 17 in NYC on this topic. Raising awareness for the fact bias can be unconscious and invisible is the first step to igniting change. See you in the next story. ", "title": "Combatting unconscious bias in design", "sentences": [{"3c6e": "Combatting unconscious bias in design"}, {"44f7": "Without realizing it, biases can manifest themselves into our design decisions. How can we create systems that respond to diversity and measure the impact it will have on the end user?"}, {"79ee": "bi·as: prejudice in favor of or against one thing, person, or group compared with another, usually in a way considered to be unfair; cause to feel or show inclination or prejudice for or against someone or something."}, {"cdf9": "A few years ago, a male-led design team was working on a brief for a major athletic apparel company. When the team presented its work to the client, the reaction was honest: the work was too clinical and serious. Perhaps female designers would help take the work in a different direction? As a result, a few women were brought in to diversify the team. The end result: work which was more simple, friendlier and easier to understand."}, {"76ed": "Without realizing it, biases can manifest themselves into our design decisions. But considering diverse teams from the outset is so important as we create work for cross-cultural products and services targeted toward diverse, global audiences."}, {"6c2a": "As a female creative director, I see diversity impact design decisions made daily, and quite often, I’m the only female in the room, surrounded by male C-suite execs. The 3% reported roughly 11% of creative directors are female, while 73% of consumer purchasing decisions are made by women, $20 trillion of the world’s annual spending. The majority of designs are being directed by people for people not like them."}, {"2e18": "Roughly 11% of creative directors are female, while 73% of consumer purchasing decisions are made by women, $20 trillion of the world’s annual spending."}, {"1a60": "It has been shown that we do 98% of our thinking in our subconscious mind. This is where we store our implicit or unconscious biases. Unconscious bias is the result of the brain working automatically to make decisions without thinking, programmed to make quick decisions a legacy of our survival instincts. This results from the brain deflecting to moments that are familiar to us and to what we know. These biases represent themselves in the systems and designs being created. Unconscious bias exists in many forms, including race, gender, culture, age and religion. As creators, it is our responsibility to be aware of our natural biases as we make design decisions so that we can better connect with and design for a wider audience."}, {"1c1e": "40 years ago, colour film was designed to work perfectly for people with white skin. It wasn’t until 1995 that Kodak introduced a colour film that catered to people of multi-racial skin colours. Today, we have mobile cameras and social media filters exhibiting similar biases, with several examples of people with dark skin not being recognized and other racially insensitive charges being discussed in the media."}, {"f978": "A recent example of a Chinese man in New Zealand who couldn’t have his passport photo recognized in the online system because “subject eyes are closed” are all examples of machines not being programmed to accept diversity in people."}, {"72a3": "Unconscious bias in design systems — IMAGE:MASHABLE"}, {"af50": "How is it possible in 2016 that there is technology making the same mistakes as Kodak in the 1960s?"}, {"fc76": "The result of the actions by designers quickly encroaches on that of machines, and as we progress further into the world of machine learning and artificial intelligence we need to ensure that pre-existing models and shortcuts are not designed into the technology. A problem with the evolution of these systems is that algorithms are being created with the inventors’ unconscious biases: Once systems are created, the test subjects are often internal subjects or recruits with similar backgrounds to the creators, therefore the voice or learning program becomes more receptive to that uniform group. The same goes for language."}, {"a311": "I have seen people in my office where English isn’t their first language try to engage with Amazon’s Alexa. But because of their accents, their commands aren’t recognized. Alexa isn’t necessarily racist but the conversational interface has been programmed with unconscious biases, assuming that all end users will speak and sound the same."}, {"676a": "As designers, we need to create systems which can respond to diversity and measure the impact it will have on the end user."}, {"2c02": "Designing for a diverse global audience"}, {"9f48": "At R/GA, to achieve global audience reach we leverage people with diverse backgrounds and skill sets for all aspects of work from our network, from research and development to creation of our products and services. We compile rich cultural audience insights to garner more diverse thinking, with evidence of success from ensuring a diverse mix of people are participating from the early stages of the design process."}, {"5491": "The design model we use, “Human, Simple, Powerful,” ensures framing and awareness of diversity at the outset. The “Human” element of this is key to counter unconscious bias. When problems are addressed through a human lens, cultures and customs are considered in design solutions. Once we have a prototype, user testing is key to test with a diverse audience that represents the anticipated end users."}, {"9367": "“Human, Simple, Powerful” helps us really get behind the context, environment & mindset of users in order to create conscious ecosystems, by mapping out the touchpoints that each of these individuals will encounter and considering breakpoints for people of diverse backgrounds. Experience mapping and validation are conducted in global and local markets with a varied set of personas to get a well-rounded picture of the end users. We then use these cultural understandings of individuals to ensure that we create a clear, focused, and centered idea in order to eliminate ambiguity."}, {"51aa": "Human, Simple, Powerful — the R/GA London product and services design model"}, {"a5fb": "Empowering diversity"}, {"fe1f": "Our London office champions a group called Woman Up, for both males and females, with a goal to empower and foster the women of our company while attracting the best female talent in the industry. Since its inception in 2016, the group has evolved to now be embedded in the work. In London, it’s used as an outlet to validate and ensure more diversity on briefs. The initiative sponsors brainstorm panels to ensure a dual-gendered perspective to client briefs. A Woman Up workgroup assesses work and looks for opportunities for diversity. A lot of our best work is created when there is a mix of diverse skills and backgrounds involved. The power of diversity ensures the end result is appealing to a much wider audience."}, {"4cc0": "R/GA London — Woman Up"}, {"776f": "Testing your own biases"}, {"485c": "We are facing new challenges and we need to embrace new mindsets to tackle them. The Harvard Implicit personality test developed 20 years ago allows you to assess your own biases with tests measuring biases on skin-tone, race, weight, gender, sexuality, disability and age. Though the test has recently come under scrutiny as to its validity by researchers at the University of Wisconsin at Madison, Harvard, and the University of Virginia, it’s worth taking to open your eyes to your own unconscious bias."}, {"82aa": "Responsibility exists for designers to ensure that what is being created has a consideration for the diversity of the audience. Ideas need to be prototyped, tested and iterated upon with many different inputs."}, {"e12f": "Diversity is inherent to how we design, it’s in the people we hire, the clients we work with and the products and services we create. The next time you tackle your next design problem make sure you understand your audience, and if you don’t, make a conscious decision to learn about them, validate with them and think from their point of view about what really interests them. Let’s not continue to make the same mistakes as the 1960’s and ensure we always practice more inclusive design."}, {"3a7d": "We invited Jen Heazlewood to be part of this series after seeing her presentation at Interaction 17 in NYC on this topic. Raising awareness for the fact bias can be unconscious and invisible is the first step to igniting change."}, {"defa": "See you in the next story."}], "child": "1891_1\t1891_2"}