{"name": "19", "parent": "", "content": "The Definitive ‘Fast & Furious’ Movie Rankings Which ‘F&F’ installment is the best? Two Ringer writers debate. By Andrew Gruttadaro and Shea Serrano For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. Shea Serrano: Andrew, Fate of the Furious releases on Friday. It’s the eighth entry into a series that has stretched out across four different continents over 16 years; a series that has caused over $527 million in fictional damage; a series that is already the sixth-highest grossing of all time, and will soon cross the $4 billion mark in gross sales; a series that gave us Dominic Toretto fighting Luke Hobbs, which was really Vin Diesel fighting the Rock, which was really Mark Sinclair fighting Dwayne Johnson. As such, I have a very big question: Which movie is the greatest in the Fast & Furious film franchise? I’ve been thinking about it a bunch. It’s tough to say quickly, because it’s an answer that, much like a car engine, has a bunch of parts that need to fit together in exactly the right order to work. You can’t just go, “Oh, it’s definitely Furious 7,” or, “Oh, it’s definitely the first one,” or, “Oh, it’s definitely that one when they were in Tokyo” (even though no one would ever go, “Oh, it’s definitely that one when they were in Tokyo,” not even the people who starred in that one when they were in Tokyo). It’s just way more nuanced than that. It’s way more complicated than that. So you need parts. You need to have everything fully vetted and absolutely understood. Andrew Gruttadaro: All right, let’s run through the bases real quick. What do we need? Shea: We need sections. We need guidelines, or some sort of grading rubric. We need a full-on, top-end, movie-by-movie ranking, of course, yes, but we also need smaller satellite rankings, too, that orbit around the movie-by-movie ranking. We need about 6,000 words, is what we need. Andrew: Yeah. What else? Shea: Most importantly, we need two precision writers. Writers that don’t crack under pressure. Writers that never lose. Andrew: You know we got that. Shea: … Andrew: … Shea: That was way dorkier than when Dom and Brian did it. Andrew: I agree. Shea: Let’s just get started. (Universal Pictures) Shea: Every Fast & Furious movie, no matter how low the stakes or how high the stakes, has a framework built on five pillars. So when you’re trying to figure out which Fast & Furious movie is the best, you need to run them all through that rubric and see how thoroughly (or how poorly) each movie touched on each pillar. The Five Pillars 1. How good and important was the movie’s best actual car race? Andrew: To define this, it’s important to define what we mean by “good,” “important,” and “actual car race.” Let’s work backward. “Actual car race” means an official competition between two or more drivers. An “actual car race” contains a clearly defined (though not necessarily binding) route, a starting line where participants can glower at one another while their engines hum, and a finish line where nondescript underground racing enthusiasts can gather around the winning car/where Vin Diesel can deliver koans about gas pedals or whatever. Brian and Roman racing for pink slips against two henchmen in 2 Fast 2 Furious is an “actual car race”; Brian and Roman driving their car off a ramp onto Carter Verone’s yacht is not. “Important” more or less measures how much impact the result of the actual car race had on the rest of the film. And “good,” well, you can figure that out. And if you can’t, ask yourself a few questions: Did the actual car race make you stand up and applaud? Did it cause you to ponder that maybe God actually is real? Did it make you cry? A good race in the Fast franchise does those things. Generally. 2. How dangerous was the movie’s alpha villain? Shea: Will he kill you? Will he kill someone in your family just to hurt you? Will he kill your entire family just to hurt you? Is he building a doomsday device that he plans to sell to the highest bidder? Do you remember in 2 Fast 2 Furious when Carter Verone forced a cop to help him by tying him down, ripping open the guy’s shirt, trapping a rat in a metal bucket on the guy’s belly, then using a blowtorch to heat up the bucket, causing the rat to try to dig its way out through the guy’s belly? So on and such. (Universal Pictures) 3. How thoroughly was the idea of “family” tested in the movie? Andrew: The concept of family is what defines the Fast movies. You can tell because Dom says “family” almost as much as Groot says “Groot” in Guardians of the Galaxy. A sign of a superior Fast movie is how well it explores this idea of basic sociological affiliation, delving into its construction and stretching the bond to its breaking point. 4. How moving was the movie’s most emotional moment? Shea: This one is always tied to the family angle. The more capably a movie was able to drill the concept of that particular installment’s close-knit family into your head, the more it was able to pull on those strings later. It’s why, say, the toast Dom gave in Fast Five was so important, or why Tokyo Drift was such a dud, or why 2 Fast 2 Furious, which was fun and cool but didn’t have Dom in it, never had the gravity of the movies that did have Dom. It’s also why the ending in Furious 7 was so compelling and utterly emotional. More on this later. 5. How much NOS was used? Andrew: Theory: The CGI shots that took the audience into the labyrinthine engine of a car just activated by the NOS button are why everyone thought The Fast and the Furious was so dope back in ’01. When I interviewed The Fast and the Furious director Rob Cohen last year, he told me that he more or less invented how speed feels by flying into the engines and all that. “It was original in my whole way of shooting it,” he said. “Everything I wanted to do — fly into the engines — I didn’t want to know how speed looked, I wanted to show the audience how speed felt.” That’s a tremendous flex, but he’s not wrong! The NOS shots are to Fast & Furious what the light-speed effect is to Star Wars: a pitch-perfect detail that transports the viewer completely. But on a deeper, more philosophical level, NOS is essential to the spirit of Fast & Furious. NOS is the idea that despite what the speedometer says, you can always go a little faster — that you can run down the rival who looks out of reach — so long as you have the stones to push the button. Without a decent helping of NOS, you might as well be watching Herbie: Fully Loaded. Shea: Can I jump in real quick right here and say two things? First, this quote: “NOS is the idea that despite what the speedometer says, you can always go a little faster.” Andrew, that’s honestly beautiful, and extremely true, and I legit got emotional when I read that. Second, anytime that you rent and watch a movie on Amazon Video, you can pause it during a scene and it’ll show you bonus information and little trivia bits. I was reading all of the bonus bits while I rewatched the original Fast and the Furious movie and I learned that the big muscle car that Dom drives in that film (the 1970 Charger) actually shows up in Herbie: Fully Loaded. It’s all beat up and broken in a junkyard. OK, but so for this exercise, we’ll decide where every Fast movie falls in the overall Fast movie rankings, based on the rubric above. We’ll also intersperse those with separate, more specific satellite rankings of things that were important to the franchise, just because we are thorough and we care. Let’s start with a satellite ranking. (Universal Pictures) Satellite Ranking No. 1: A Hierarchy of the Women of the ‘Fast & Furious’ Movies, Based on How Independent They’re Allowed to Be, From Least Independent to Most Independent — Shea 17. That one woman who volunteers herself as a race prize in Tokyo Drift (least) 16. Any of the women who were at any of the races but had nothing to do with the races 15. Any of the women who called any of the races 14. MONICAAAAAAA, The Fast and the Furious 13. Mia Toretto after she gets pregnant and has a kid 12. Neela, Tokyo Drift 11. Cara Mirtha, Fast & Furious 10. Mia Toretto before she gets pregnant 9. Suki, 2 Fast 2 Furious 8. Ramsey, Furious 7 7. Kara the Bodyguard (Ronda Rousey), Furious 7 6. Officer Elena Neves, Fast Five 5. Agent Monica Fuentes, 2 Fast 2 Furious 4. That one woman driver in Fast & Furious 6 3. Gisele Yashar, Fast & Furious, Fast Five, Fast & Furious 6 2. Agent Riley Hicks, Fast & Furious 6 1. Letty Ortiz (most) Andrew: I agree wholeheartedly with all of the above. This was a nice kickoff. Shall we get started on the official ranking? (Universal Pictures) The Seventh-Best ‘Fast & Furious’ Movie ‘The Fast and the Furious: Tokyo Drift’ Andrew: I don’t want be too hard on Tokyo Drift for not featuring either Brian or Dom, because that’s not the movie’s fault. But even if you push that criticism to the side, Tokyo Drift is pretty rough. The main villain is called “DK,” which, I’m not joking, stands for “Drift King.” That’s negative dangerousness. Lucas Black is the main character. Lucas Black can be in your movie if you need a character whose defining trait is how little he speaks, but if you want him to say lines and convey emotion? Uh-uh. His character, Sean, goes to live with his estranged father in Tokyo, which you’d think would be ripe grounds for exploring the idea of family and tugging on your heartstrings with emotionally loaded moments, but nothing close to that ever happens. Truly, the best thing about Lucas Black being in Tokyo Drift is imagining him saying, “Hey, Boobie, ya didn’t drift.” It’s not all bad, though: Han, who is my idol and whose last name is Seoul-Oh (say it out loud and go, “Oooooh my god”), is introduced in this movie. Shea: Han is, without question, the most overlooked, underappreciated character in any of these movies. The ease with which he exists in a complicated life is very appealing. It’s this movie’s main redeeming quality. (Universal Pictures) Satellite Ranking No. 2: Arranging the Franchise’s Villains, by Order of Villainy — Shea 7. Hernan Reyes in Fast Five: Hernan did a good job of being intimidating when he was standing still, but that’s about where the end of his He Did A Good Job With This list of character traits ends. He was never smart enough to be truly terrifying, never mean enough to be truly terrifying, never motivated enough to be truly terrifying. (He’s the only villain in the series whose existence revolved around money, which is almost always the least interesting way to approach villainy.) 6. Carter Verone in 2 Fast 2 Furious: The Miami version of Hernan Reyes. (I think it says a lot about Verone that the writers allowed Letty to come back from the dead, but they wouldn’t even let Verone out of prison.) Andrew: In defense of Carter Verone’s chops as a terrifying, sickly devious villain, though, he did employ a torture tactic that was later stolen by Game of Thrones. 5. Takashi in Tokyo Drift: He beats out Reyes and Verone because (a) he was a villain who actually raced (Hernan and Carter are the only two villains in the franchise whom we never see drive a car, and so of course they can’t finish any higher than any villain who does, given that driving is important in this movie’s universe), (b) he was connected to the yakuza via blood, (c) he was legit intimidating, and (d) he had real hate in his heart for Sean, the protagonist. 4. Arturo Braga in Fast & Furious: He’s able to pass Takashi here because of the way he tricked everyone into believing that he was just one of Braga’s henchmen and not Braga himself. 3. Owen Shaw in Fast & Furious 6: An elite villain. He was wildly talented, wildly smart, wildly vicious, and wildly manipulative. (Owen Shaw was the guy who took Letty after she’d gotten all the memories zapped out of her brain and then turned her into one of the bad guys.) Just think on it like this: Agent Hobbs was served up to us as this almost mythic character, a tough man, a fearless man, a truly unstoppable man, right? And yet, when his unit was tasked with capturing Shaw, Hobbs had to call in Dom et al. for backup. (Universal Pictures) 2. Deckard Shaw in Furious 7: Owen’s older brother. Just take all of the things that Owen was and multiply them by, like, three or four. That was Deckard. (If you feel yourself starting to get hung up on whether or not Owen might’ve maybe been better than Deckard, just look at the way the movies ended. Both Owen and Deckard were fighting against the same forces in their movies [Dom and Hobbs], but one of them ended up nearly dead and the other one walked himself into his prison cell.) 1. Dominic Toretto in The Fast and the Furious: It’s a common misconception that Johnny Tran (the guy who shoots and kills the neurotic and helpless Jesse) was the bad guy in the series’ first film, The Fast and the Furious. That’s not the case. I mean, yes, he was a bad guy, but he wasn’t the bad guy. THE bad guy was Dominic. He was literally the lead criminal of a gang of other criminals that heisted millions of dollars of electronics from 18-wheelers. So you take that, plus you add in how he’s the only villain who didn’t get captured in his movie, and that’s how he ends up no. 1. (Universal Pictures) The Sixth-Best ‘Fast & Furious’ Movie ‘Fast & Furious’ Andrew: The fourth movie in the franchise, Fast & Furious — not to be confused with the first movie, The Fast and the Furious — is the 2014–15 Cleveland Cavaliers of Fast movies. Stick with me here. That team brought LeBron back into the fold, added Kevin Love to the mix, and came up just short of beating the Golden State Warriors for the championship. The team was, in black-and-white terms, a failure, but it did act as the foundation for the sublimity that followed. The next year, the Cavs figured out how to integrate wild cards like J.R. Smith into their roster and reached a new level of excellence, coming back from a 3–1 deficit and beating the Warriors in the NBA Finals. Which is to say, Fast & Furious is a failure (and also, the Rock is the J.R. Smith of the Fast franchise) that doesn’t quite satisfy any of the standards we’ve set. Its best actual race feels too much like a carbon copy of races from the first two movies; its villain is midlevel; and it’s so light on NOS! But! It set the stage for Fast Five, a near-perfect movie, by reintegrating the original cast and injecting the series with a level self-awareness, a tool that’d be honed into an art form by Fasts 5 through 7. You don’t necessarily need to rewatch Fast & Furious, but you should appreciate it for starting the revolution. (Universal Pictures) Satellite Ranking No. 3: Rapper Cameos, Ranked by How Much They Are Not Iggy Azalea — Shea 8. Iggy Azalea in Furious 7: Yes Iggy Azalea 1. (tie) Bow Wow in Tokyo Drift: Not Iggy Azalea 1. (tie) Jin in 2 Fast 2 Furious: Not Iggy Azalea 1. (tie) Ja Rule in The Fast and the Furious: Not Iggy Azalea 1. (tie) Don Omar in Fast & Furious, Fast Five : Not Iggy Azalea 1. (tie) Ludacris in 2 Fast 2 Furious, Fast Five, Fast & Furious 6, Furious 7: Not Iggy Azalea. 1. (tie) Tyrese in 2 Fast 2 Furious, Fast Five, Fast & Furious 6, Furious 7: Not Iggy Azalea. 1. (tie) Tego Calderón in Fast & Furious, Fast Five: Not Iggy Azalea. Andrew: In my opinion, Ja Rule is the best Not Iggy Azalea. (Universal Pictures) The Fifth-Best ‘Fast & Furious’ Movie ‘2 Fast 2 Furious’ Shea: This one gets dumped on a bit, and I suppose that’s at least a little bit fair given that it scores well in only two of the five pillars (the Race one and the NOS one), but two very important things happened in it that helped shape what has turned into a perfect movie universe: Ludacris replaced Ja Rule: Ja was asked to be in 2 Fast 2 Furious after he was in The Fast and the Furious but he turned it down because this was back in the early 2000s and he was still famous and successful then. That’s how Ludacris ended up in this and the subsequent movies. Two things about that move: (1) I wonder how often Ja thinks about that. He’d made $15,000 for his appearance in the original and they offered him $500,000 to be in the second one. That means he’d be making several million per movie now instead of working at Chick-Fil-A or wherever it is he’s working now. (2) Ja losing his spot to Luda was a great turn for the franchise. They have completely different energies. Ja was always gruffer, meaner, tougher. There’s no way he’d have been able to slide into the tech guy role that Luda plays so perfectly. It’d have to have been a whole different thing. Roman Pearce gets introduced: Dropping Tyrese’s Roman Pearce into the series was, either by accident or design, a genius play. He is exactly the right pitch, exactly the right tempo, exactly the right speed for what he’s responsible for (which is to say, for being cool but funny but cool while being funny). He’s responsible for, probably, like, at least 80 percent of the genuine humor in the movies. Here’s his best scene — watch how quickly he glows, and how exquisitely he glows: Who else could’ve played that role that well but Tyrese? I’ll tell you who: nobody. (Universal Pictures) Satellite Ranking No. 4: The Best Times Two Characters Talked About Manhood and Bonding — Andrew Now, these conversations — from which I have constructed my entire worldview — don’t necessarily need to be had over beer, but it helps if they are. That said, these are the two best times Fast characters talked about manhood and bonding. 4. Brian and Roman, 2 Fast 2 Furious As the story goes, Roman and Brian grew up together, and Roman misguidedly blames Brian for his going to prison. But toward the end of 2 Fast 2 Furious, as the sun sets in Miami, Roman commiserates with Brian and finally takes responsibility. Then they do this: It’s really beautiful. 3. Dom and Brian, The Fast and the Furious This sort of gets lost in the excitement of The Fast and the Furious, but the moment Dom tells Brian about the death of his father is truly emotional. He’s straight up confessing to nearly beating the man who killed his dad to death with a wrench — which comes up again in Fast Five — and admitting that even he gets scared sometimes. Plus, it all culminates in this quote, one of the best of the franchise: “I live my life a quarter-mile at a time. Nothing else matters — not the mortgage, not the store, not my team and all their bullshit. For those 10 seconds or less, I’m free.” 2. Han and Sean, The Fast and the Furious: Tokyo Drift I’m going to cede the floor to Han, but let me just say that this is deeply profound and actually phenomenal life advice: 1. Dom and Brian, Fast Five I know we’re having fun, but seriously — this scene is legitimately poignant, and now in retrospect, almost heartbreaking. It comes soon after Dom and Brian find out that Mia, Dom’s sister and Brian’s wife, is pregnant. “Dom, what do you remember about your father?” Brian asks, cannonballing into a serious conversation about parenting, and how the decisions a father makes irrevocably affect a son. Both guys get super raw, but nothing’s more heart-wrenching than Brian admitting he doesn’t remember anything about his dad because his dad wasn’t there. It’s almost impossible to watch this scene now, knowing that Paul Walker is gone. It’s probably the most important character moment Brian has in the entire series. Shea, I know you have feelings about this one. Shea: I do, Andrew. And you touched on exactly those feelings, too. Before we sat down to write this, I spent, I think, four days rewatching all of these movies. Minus the ending scene of Furious 7, this was the one that thumped me in the chest the hardest. I didn’t remember being super affected by it when I saw Five in the theaters, but this time, watching him talking about growing up without his father around with the knowledge that his real-life daughter was now doing exactly that — it was just real rough, man. (Universal Pictures) The Fourth-Best ‘Fast & Furious’ Movie ‘Fast & Furious 6’ Andrew: Here’s everything Fast & Furious 6 has going for it. Shea: There’s a great shot right before this GIF you plugged in where we get Vin and the Rock squaring off against Owen Shaw and his Man Mountain soldier. I’m thinking about this scene right now and I am feeling some strong emotions. Andrew: If it seems like Fast & Furious 6 checks all of our boxes, we should probably say that it absolutely does. Maybe it’s confusing, then, that the movie lands right in the middle of this ranking. But I think that’s a testament to the franchise — even a killer movie like this is overshadowed by some of the other installments. (Universal Pictures) Satellite Ranking No. 5: The Best One-Liners From the Rock — Andrew 4. “They’re not for me. They’re protection for you from me killing your ass.” It’s hard to use this many prepositions and sound badass, but the Rock pulls it off. 3. “When you find that sumbitch, just do me one favor … don’t miss.” Hobbs’s use of “sumbitch” is 100 percent a character choice made by the Rock. He uses the phrase far too much in Five, 6, and 7 for it not to be. But in Fast Five and Fast & Furious 6, Hobbs actually says “son of a bitch,” though each time you can hear him smashing the words closer and closer together. This moment in Furious 7, then, is truly historical — it’s when Hobbs becomes the ideal version of himself. Wow. Shea: There’s a scene in Fast Five where he accidentally says the full phrase — “son of a bitch” — and I remember being startled by it when I rewatched that movie after I’d seen 6 and 7. It was weird to hear him say “of” and “a” there. It was like in The Office when Dwight made that sign for Kelly that read, “It Is Your Birthday.” 2. “Daddy’s gotta go to work.” Several notes about this very good one-liner: Hobbs says this to his daughter. Until this moment in Furious 7, I had no idea Hobbs had a daughter. Hobbs says this only because he sees a far-away explosion from his hospital window. This is man who does not ask, “Is that ball of fire related to daddy’s current situation, therefore requiring daddy to go to work?” No — an explosion in his vicinity automatically means he’s on the clock, no questions asked. Immediately after Hobbs says this, he flexes so hard his full-arm cast explodes. Shea: This is my favorite Rock quote in any movie. It’s perfect. Hearing him say it is when I was 100 percent positive we were going to get an Agent Hobbs spinoff. 1. “Stay the fuck out of my way.” This happens in Fast Five when the Rock tells a lowly Brazilian policeman that he needs “two things.” He purposely doesn’t mention the second thing. It’s a setup: He wants the Brazilian policeman to ask him what the second thing is. And when he does, the Rock ends his life. (Universal Pictures) The Third-Best ‘Fast & Furious’ Movie ‘Fast Five’ Shea: There’s a clear and distinct transition that takes place over the course of the Fast franchise, and Fast Five represents the point during the metamorphosis where everything became bigger, better, smarter, faster, and more furious. The Fast and the Furious was the skeleton. 2 Fast 2 Furious introduced the idea of Brian and someone else teaming up to defeat someone he couldn’t otherwise defeat alone. Tokyo Drift made the game international. Fast & Furious took all three of those ideas and then turned the volume up on them. And then Fast Five, exquisite and meaty and loud and obscene, catalyzed and crystallized all of everything that had come before. From that point forward, literally anything was possible. You wanna fight a tank on a freeway? Cool. You wanna yank a plane out of the sky? OK. You wanna take a car and jump it from high-rise building to high-rise building in Abu Dhabi after someone fights Ronda Rousey? Go for it. Do it. You wanna fucking run up a bus as it falls off a cliff and then jump and dive and grab hold of the tail of a car as someone drifts it along the edge of the cliff? Sure. Absolutely. That can happen, because Fast Five happened. (Also, this is where the Rock’s Agent Hobbs gets introduced, which was vital, not only because he’s perfect in the role, but because it made it A-OK for A+ movie stars to jump into an already established franchise. I can’t wait to see who ends up in part 9 and part 10.) (Another “also”: This is the first movie in our countdown that scores well in all five of the movie pillars.) (Universal Pictures) Satellite Ranking No. 6: The 18 Best Dominic Toretto Lines, Ranked by How Dominic Toretto–y They Are — Shea 18. After Gisele asks him if he’s one of those boys who appreciates cars over women in The Fast and the Furious: “I’m one of those boys that appreciates a fine body regardless of the make.” 17. After Agent Hobbs tells Dom he was easy to find in Fast & Furious 6: “I wasn’t hiding.” 16. When he’s about to race Letty in Fast & Furious 6 and he tries to jog her memory because he knows she has amnesia: “Ride or die, remember?” 15. When he wants to race in Fast & Furious but Brian keeps talking: “We talkin’ or we racin’?” 14. When he finds out that Brian and Mia are dating in The Fast and the Furious: “You break her heart I’ll break your neck.” 13. When he realizes it’s not just about being fast in Furious 7: “This time it ain’t just about being fast.” 12. When Owen Shaw threatens Dom’s family in Fast & Furious 6: “Your brother never told you never threaten a man’s family?” 11. When he sees a very nice car all cooped up in a building in Furious 7: “Nothing’s sadder than locking a beast in a cage.” Andrew: 11b. When he’s about to drive the very nice car through a building: “Time to unleash the beast.” Shea: 10. When Elena tells him he should just run if he wants to escape in Fast Five: “Runnin’ ain’t freedom.” 9. When Vince is groveling, asking if he can join in on Dom’s job in Fast Five, and Dom interrupts him mid-ask: “You’re in.” 8. When Vince asks why Dom brought the buster (Brian) home to the party in The Fast and the Furious: “Cuz the buster kept me out of handcuffs!” 7. When Deckard Shaw thought it was gonna be a street fight in Furious 7: “You thought this was gonna be a street fight? [Picks up two giant wrenches] You’re goddamn right it is.” 6. When Dom said he still wanted to save Letty after she shot him in Fast & Furious 6: “You don’t turn your back on family. Even when they do.” 5. When Dom said he didn’t have friends, he has family in Furious 7: “I don’t have friends. I got family.” 4. When Agent Hobbs showed up and told Dom he was under arrest in Fast Five: “Arrest? I don’t feel like I’m under arrest.” 3. When Dom was being a philosopher in The Fast and the Furious: “I live my life a quarter-mile at a time.” 2. When Dom was thinking about Brian and remembering the time he was being a philosopher in The Fast and the Furious in Furious 7: “I used to say I live my life a quarter-mile at a time. And I think that’s why we were brothers. Because you did, too.” 1. When Brian told Dom that he almost beat him in their first race against each other in The Fast and the Furious: “Ask any racer — any real racer: It don’t matter if you win by an inch or a mile. Winning’s winning.” Andrew: Can we also rate all of Roman Pearce’s pickup lines on a scale of 1 to “Wow, that was low-key really gross”? Shea: Andrew, we have a ranking to finish. (Universal Pictures) The Second-Best ‘Fast & Furious’ Movie ‘Furious 7’ Andrew: In my mind, Furious 7 is the movie that perfected the approach initiated by Fast & Furious and Fast Five. It’s the moment in the franchise when that self-awareness and disregard for all rationality reaches a peak — the entire franchise was building to this movie, and any movie that comes after it is going to be hard-pressed to top it. As an example, watch this, the centerpiece of the film: It doesn’t matter how sure you are that driving a car through three skyscrapers is physically impossible — that the movie just goes for it is a stunning source of joy. Frankly, it’s inspirational. And that’s all of Furious 7 in a nutshell. Jason Statham is also the movie’s alpha villain — as Shea covered above, only Dom himself has been a more dangerous villain than Statham’s Deckard Shaw. As for how thoroughly family is tested in Furious 7, and how moving the emotional moments are, well, where to even begin? Midway through filming Furious 7, Paul Walker died in a car accident. That left everyone involved in the movie in a tough position, and after legitimately considering shutting down the franchise, the filmmakers opted to rewrite the movie’s ending, hire Walker’s brother as a stand-in and use cutting-edge CGI to give Brian O’Conner — and Paul Walker — an appropriate goodbye. The how and why Brian is sent off into the sunset is a little half-baked — I guess he’s, like, just gonna go do dad stuff now? — but the emotion of it all is executed perfectly. At the end of Furious 7, you come to understand that, over the years, when Vin Diesel was reciting all those lines about family, he wasn’t acting. And put simply, if you don’t cry watching this closing scene you are a monster. (Universal Pictures) Satellite Ranking No. 7: The Best Conversations About Sandwiches in the Fast & Furious Movies — Andrew If you didn’t know, sandwiches are how Brian got Mia to fall in love with him. And so they come up once in a while in the movies. These are the best times: 3. When Vince and Brian fight over whether the tuna sandwich at Dom’s auto shop is good in The Fast and the Furious Some sample dialogue: Vince: Try Fatburger from now on, you can get yourself a double-cheese with fries for $2.95. Brian: I like the tuna here. Vince: Bullshit, asshole. No one likes the tuna here. Brian: Yeah, well I do. Vince and Brian punch each other after this conversation. 2. When Mia tells Brian they’re having another baby and he’s all, “How about sandwiches?” in Furious 7 1. When Mia and Brian fall in love over tuna sandwiches in The Fast and the Furious I had to go with the franchise’s first conversation about sandwiches: Not only is it an emotional stake that ripples through the movies that followed, but it’s why all other sandwich-related discussions occur in the saga. The Best ‘Fast & Furious’ Movie ‘The Fast and the Furious’ Shea: This is a weird thing to think about now, because we’ve come to know Dominic Toretto and his gang as an ultra-elite, ultra-advanced, ultra-smart, ultra-unstoppable group of professional drivers, fighters, computer hackers, and heist superstars, but back when the franchise first started, they weren’t anything more than some people stealing DVD players off 18-wheelers. That’s it. There were no international voyages, no secret government agencies, no superheroic stunts, no the Rock. It was just Brian, a local cop with perfect blue eyes and slightly too-long hair, vs. Dominic and Letty and Jesse and Vince and that other guy nobody ever remembers or talks about. That was the foundation upon which a globe-trotting adventure was eventually laid out. It’s wild, really. They started out racing for $2,000 per entry, and then in 2 Fast 2 Furious it was $3,500 to enter the race, and then all of sudden by Fast Five they’re trying to evade international agents while also stealing $100,000,000 from a Brazilian kingpin. Watching that sort of come-up happening — watching the stakes just get ratcheted up higher and higher, all the while growing more and more attached to characters — it’s made for just a really great and enjoyable movie experience. And it’s also why original The Fast and the Furious has to finish first here. Let’s look back at those five tentpoles we identified earlier in the copy for measuring the worth of a Fast movie: How good and important was the movie’s best actual race? The most consequential race of all the races happens here (that first one between Dom and Brian). It set everything else into motion. Brian immediately fell in love with Dom, and Dom immediately identified Brian as hapless, sure, but also as talented and fearless, and so he knew right then he was going to bring him into the fold. Without this moment, everything else turns to ash. They never build that bond, Brian never lets Dom go at the end of the movie, Dom goes to prison, Vince probably kills Brian, etc. The series ends after one movie without this race. How dangerous was the movie’s alpha villain? (We talked about this already.) How thoroughly was the idea of “family” tested in the movie? They spend the whole entire movie building up the idea of family (the relationship between Dom and his younger sister serving as the lighthouse in the storm; the reveal that Dom’s father died while Dom watched; the makeshift family Dom built around himself; Jesse getting killed at the end), all so they could place that final “Let Dom go or send him to prison?” dilemma at Brian’s feet in the movie’s final scene. How moving was the movie’s most emotional moment? The big ones here were (a) Dom telling Brian what happened to his father and how that event shaped his life, (b) Brian having to reveal that he was a cop to save Vince’s life in front of Dom, and (c) Jesse getting gunned down. But a secretly equally strong tug was right before Jesse got shot. Dom was getting in his car to go ride off. Brian pulled up behind him, pinning him in, trying to stop him. He thought Dom was gonna head out and do some violent things to people who probably deserved it. That’s when Dom — and this was the first time we ever heard him sound scared — shouts something close to, “I have to go find Jesse! He’s all I got!” That was the moment when it was really like, “Oh, shit. Wait. Dominic is actually perfect.” Of course, none of these were as good as that final tug at the end of Furious 7, but cumulatively it’s a big score here. How much NOS was used? So goddamn much NOS. But so you take all of those things and add them up and that’s how, just by the tiniest margin and slimmest margin and narrowest margin, The Fast and the Furious manages to edge out Furious 7 for first place. It was really close, but ask any racer — any real racer … An earlier version of this piece incorrectly stated which season the Cleveland Cavaliers added J.R. Smith to their roster. It was the 2014–15 season, not the season after. ", "title": "The Definitive ‘Fast & Furious’ Movie Rankings", "sentences": [{"7940": "The Definitive ‘Fast & Furious’ Movie Rankings"}, {"ec46": "Which ‘F&F’ installment is the best? Two Ringer writers debate."}, {"a5b6": "By Andrew Gruttadaro and Shea Serrano"}, {"4361": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"1b12": "Shea Serrano: Andrew, Fate of the Furious releases on Friday. It’s the eighth entry into a series that has stretched out across four different continents over 16 years; a series that has caused over $527 million in fictional damage; a series that is already the sixth-highest grossing of all time, and will soon cross the $4 billion mark in gross sales; a series that gave us Dominic Toretto fighting Luke Hobbs, which was really Vin Diesel fighting the Rock, which was really Mark Sinclair fighting Dwayne Johnson."}, {"b6bb": "As such, I have a very big question: Which movie is the greatest in the Fast & Furious film franchise?"}, {"f625": "I’ve been thinking about it a bunch. It’s tough to say quickly, because it’s an answer that, much like a car engine, has a bunch of parts that need to fit together in exactly the right order to work. You can’t just go, “Oh, it’s definitely Furious 7,” or, “Oh, it’s definitely the first one,” or, “Oh, it’s definitely that one when they were in Tokyo” (even though no one would ever go, “Oh, it’s definitely that one when they were in Tokyo,” not even the people who starred in that one when they were in Tokyo). It’s just way more nuanced than that. It’s way more complicated than that. So you need parts. You need to have everything fully vetted and absolutely understood."}, {"23df": "Andrew Gruttadaro: All right, let’s run through the bases real quick. What do we need?"}, {"59eb": "Shea: We need sections. We need guidelines, or some sort of grading rubric. We need a full-on, top-end, movie-by-movie ranking, of course, yes, but we also need smaller satellite rankings, too, that orbit around the movie-by-movie ranking. We need about 6,000 words, is what we need."}, {"f34f": "Andrew: Yeah. What else?"}, {"516d": "Shea: Most importantly, we need two precision writers. Writers that don’t crack under pressure. Writers that never lose."}, {"1490": "Andrew: You know we got that."}, {"c014": "Shea: …"}, {"c4b1": "Andrew: …"}, {"b3bf": "Shea: That was way dorkier than when Dom and Brian did it."}, {"9cad": "Andrew: I agree."}, {"e428": "Shea: Let’s just get started."}, {"fe68": "(Universal Pictures)"}, {"17c4": "Shea: Every Fast & Furious movie, no matter how low the stakes or how high the stakes, has a framework built on five pillars. So when you’re trying to figure out which Fast & Furious movie is the best, you need to run them all through that rubric and see how thoroughly (or how poorly) each movie touched on each pillar."}, {"dc27": "The Five Pillars"}, {"8634": "1. How good and important was the movie’s best actual car race?"}, {"5dfa": "Andrew: To define this, it’s important to define what we mean by “good,” “important,” and “actual car race.” Let’s work backward. “Actual car race” means an official competition between two or more drivers. An “actual car race” contains a clearly defined (though not necessarily binding) route, a starting line where participants can glower at one another while their engines hum, and a finish line where nondescript underground racing enthusiasts can gather around the winning car/where Vin Diesel can deliver koans about gas pedals or whatever. Brian and Roman racing for pink slips against two henchmen in 2 Fast 2 Furious is an “actual car race”; Brian and Roman driving their car off a ramp onto Carter Verone’s yacht is not."}, {"6e95": "“Important” more or less measures how much impact the result of the actual car race had on the rest of the film."}, {"784a": "And “good,” well, you can figure that out. And if you can’t, ask yourself a few questions: Did the actual car race make you stand up and applaud? Did it cause you to ponder that maybe God actually is real? Did it make you cry? A good race in the Fast franchise does those things. Generally."}, {"3f0f": "2. How dangerous was the movie’s alpha villain?"}, {"fc45": "Shea: Will he kill you? Will he kill someone in your family just to hurt you? Will he kill your entire family just to hurt you? Is he building a doomsday device that he plans to sell to the highest bidder? Do you remember in 2 Fast 2 Furious when Carter Verone forced a cop to help him by tying him down, ripping open the guy’s shirt, trapping a rat in a metal bucket on the guy’s belly, then using a blowtorch to heat up the bucket, causing the rat to try to dig its way out through the guy’s belly? So on and such."}, {"3b18": "(Universal Pictures)"}, {"e793": "3. How thoroughly was the idea of “family” tested in the movie?"}, {"8c45": "Andrew: The concept of family is what defines the Fast movies. You can tell because Dom says “family” almost as much as Groot says “Groot” in Guardians of the Galaxy. A sign of a superior Fast movie is how well it explores this idea of basic sociological affiliation, delving into its construction and stretching the bond to its breaking point."}, {"b398": "4. How moving was the movie’s most emotional moment?"}, {"bd89": "Shea: This one is always tied to the family angle. The more capably a movie was able to drill the concept of that particular installment’s close-knit family into your head, the more it was able to pull on those strings later. It’s why, say, the toast Dom gave in Fast Five was so important, or why Tokyo Drift was such a dud, or why 2 Fast 2 Furious, which was fun and cool but didn’t have Dom in it, never had the gravity of the movies that did have Dom. It’s also why the ending in Furious 7 was so compelling and utterly emotional. More on this later."}, {"5f8f": "5. How much NOS was used?"}, {"ef59": "Andrew: Theory: The CGI shots that took the audience into the labyrinthine engine of a car just activated by the NOS button are why everyone thought The Fast and the Furious was so dope back in ’01. When I interviewed The Fast and the Furious director Rob Cohen last year, he told me that he more or less invented how speed feels by flying into the engines and all that. “It was original in my whole way of shooting it,” he said. “Everything I wanted to do — fly into the engines — I didn’t want to know how speed looked, I wanted to show the audience how speed felt.” That’s a tremendous flex, but he’s not wrong! The NOS shots are to Fast & Furious what the light-speed effect is to Star Wars: a pitch-perfect detail that transports the viewer completely. But on a deeper, more philosophical level, NOS is essential to the spirit of Fast & Furious. NOS is the idea that despite what the speedometer says, you can always go a little faster — that you can run down the rival who looks out of reach — so long as you have the stones to push the button. Without a decent helping of NOS, you might as well be watching Herbie: Fully Loaded."}, {"ec71": "Shea: Can I jump in real quick right here and say two things? First, this quote: “NOS is the idea that despite what the speedometer says, you can always go a little faster.” Andrew, that’s honestly beautiful, and extremely true, and I legit got emotional when I read that. Second, anytime that you rent and watch a movie on Amazon Video, you can pause it during a scene and it’ll show you bonus information and little trivia bits. I was reading all of the bonus bits while I rewatched the original Fast and the Furious movie and I learned that the big muscle car that Dom drives in that film (the 1970 Charger) actually shows up in Herbie: Fully Loaded. It’s all beat up and broken in a junkyard."}, {"f4a4": "OK, but so for this exercise, we’ll decide where every Fast movie falls in the overall Fast movie rankings, based on the rubric above. We’ll also intersperse those with separate, more specific satellite rankings of things that were important to the franchise, just because we are thorough and we care. Let’s start with a satellite ranking."}, {"6e4b": "(Universal Pictures)"}, {"a968": "Satellite Ranking No. 1: A Hierarchy of the Women of the ‘Fast & Furious’ Movies, Based on How Independent They’re Allowed to Be, From Least Independent to Most Independent — Shea"}, {"21a0": "17. That one woman who volunteers herself as a race prize in Tokyo Drift (least)"}, {"b1c4": "16. Any of the women who were at any of the races but had nothing to do with the races"}, {"5aea": "15. Any of the women who called any of the races"}, {"24a8": "14. MONICAAAAAAA, The Fast and the Furious"}, {"984c": "13. Mia Toretto after she gets pregnant and has a kid"}, {"d5db": "12. Neela, Tokyo Drift"}, {"77f6": "11. Cara Mirtha, Fast & Furious"}, {"a100": "10. Mia Toretto before she gets pregnant"}, {"2f84": "9. Suki, 2 Fast 2 Furious"}, {"f804": "8. Ramsey, Furious 7"}, {"73dc": "7. Kara the Bodyguard (Ronda Rousey), Furious 7"}, {"5c3f": "6. Officer Elena Neves, Fast Five"}, {"ca5f": "5. Agent Monica Fuentes, 2 Fast 2 Furious"}, {"5dbb": "4. That one woman driver in Fast & Furious 6"}, {"eda6": "3. Gisele Yashar, Fast & Furious, Fast Five, Fast & Furious 6"}, {"ce67": "2. Agent Riley Hicks, Fast & Furious 6"}, {"d494": "1. Letty Ortiz (most)"}, {"7c79": "Andrew: I agree wholeheartedly with all of the above. This was a nice kickoff. Shall we get started on the official ranking?"}, {"4c1d": "(Universal Pictures)"}, {"4e1f": "The Seventh-Best ‘Fast & Furious’ Movie"}, {"d845": "‘The Fast and the Furious: Tokyo Drift’"}, {"8233": "Andrew: I don’t want be too hard on Tokyo Drift for not featuring either Brian or Dom, because that’s not the movie’s fault. But even if you push that criticism to the side, Tokyo Drift is pretty rough. The main villain is called “DK,” which, I’m not joking, stands for “Drift King.” That’s negative dangerousness. Lucas Black is the main character. Lucas Black can be in your movie if you need a character whose defining trait is how little he speaks, but if you want him to say lines and convey emotion? Uh-uh. His character, Sean, goes to live with his estranged father in Tokyo, which you’d think would be ripe grounds for exploring the idea of family and tugging on your heartstrings with emotionally loaded moments, but nothing close to that ever happens. Truly, the best thing about Lucas Black being in Tokyo Drift is imagining him saying, “Hey, Boobie, ya didn’t drift.”"}, {"3d0e": "It’s not all bad, though: Han, who is my idol and whose last name is Seoul-Oh (say it out loud and go, “Oooooh my god”), is introduced in this movie."}, {"8207": "Shea: Han is, without question, the most overlooked, underappreciated character in any of these movies. The ease with which he exists in a complicated life is very appealing. It’s this movie’s main redeeming quality."}, {"289b": "(Universal Pictures)"}, {"82dc": "Satellite Ranking No. 2: Arranging the Franchise’s Villains, by Order of Villainy — Shea"}, {"7d0a": "7. Hernan Reyes in Fast Five: Hernan did a good job of being intimidating when he was standing still, but that’s about where the end of his He Did A Good Job With This list of character traits ends. He was never smart enough to be truly terrifying, never mean enough to be truly terrifying, never motivated enough to be truly terrifying. (He’s the only villain in the series whose existence revolved around money, which is almost always the least interesting way to approach villainy.)"}, {"3d38": "6. Carter Verone in 2 Fast 2 Furious: The Miami version of Hernan Reyes. (I think it says a lot about Verone that the writers allowed Letty to come back from the dead, but they wouldn’t even let Verone out of prison.)"}, {"bcf7": "Andrew: In defense of Carter Verone’s chops as a terrifying, sickly devious villain, though, he did employ a torture tactic that was later stolen by Game of Thrones."}, {"21c2": "5. Takashi in Tokyo Drift: He beats out Reyes and Verone because (a) he was a villain who actually raced (Hernan and Carter are the only two villains in the franchise whom we never see drive a car, and so of course they can’t finish any higher than any villain who does, given that driving is important in this movie’s universe), (b) he was connected to the yakuza via blood, (c) he was legit intimidating, and (d) he had real hate in his heart for Sean, the protagonist."}, {"cf85": "4. Arturo Braga in Fast & Furious: He’s able to pass Takashi here because of the way he tricked everyone into believing that he was just one of Braga’s henchmen and not Braga himself."}, {"16fe": "3. Owen Shaw in Fast & Furious 6: An elite villain. He was wildly talented, wildly smart, wildly vicious, and wildly manipulative. (Owen Shaw was the guy who took Letty after she’d gotten all the memories zapped out of her brain and then turned her into one of the bad guys.) Just think on it like this: Agent Hobbs was served up to us as this almost mythic character, a tough man, a fearless man, a truly unstoppable man, right? And yet, when his unit was tasked with capturing Shaw, Hobbs had to call in Dom et al. for backup."}, {"8618": "(Universal Pictures)"}, {"4083": "2. Deckard Shaw in Furious 7: Owen’s older brother. Just take all of the things that Owen was and multiply them by, like, three or four. That was Deckard. (If you feel yourself starting to get hung up on whether or not Owen might’ve maybe been better than Deckard, just look at the way the movies ended. Both Owen and Deckard were fighting against the same forces in their movies [Dom and Hobbs], but one of them ended up nearly dead and the other one walked himself into his prison cell.)"}, {"0545": "1. Dominic Toretto in The Fast and the Furious: It’s a common misconception that Johnny Tran (the guy who shoots and kills the neurotic and helpless Jesse) was the bad guy in the series’ first film, The Fast and the Furious. That’s not the case. I mean, yes, he was a bad guy, but he wasn’t the bad guy. THE bad guy was Dominic. He was literally the lead criminal of a gang of other criminals that heisted millions of dollars of electronics from 18-wheelers. So you take that, plus you add in how he’s the only villain who didn’t get captured in his movie, and that’s how he ends up no. 1."}, {"1f77": "(Universal Pictures)"}, {"15c4": "The Sixth-Best ‘Fast & Furious’ Movie"}, {"93e1": "‘Fast & Furious’"}, {"1514": "Andrew: The fourth movie in the franchise, Fast & Furious — not to be confused with the first movie, The Fast and the Furious — is the 2014–15 Cleveland Cavaliers of Fast movies. Stick with me here. That team brought LeBron back into the fold, added Kevin Love to the mix, and came up just short of beating the Golden State Warriors for the championship. The team was, in black-and-white terms, a failure, but it did act as the foundation for the sublimity that followed. The next year, the Cavs figured out how to integrate wild cards like J.R. Smith into their roster and reached a new level of excellence, coming back from a 3–1 deficit and beating the Warriors in the NBA Finals. Which is to say, Fast & Furious is a failure (and also, the Rock is the J.R. Smith of the Fast franchise) that doesn’t quite satisfy any of the standards we’ve set. Its best actual race feels too much like a carbon copy of races from the first two movies; its villain is midlevel; and it’s so light on NOS! But! It set the stage for Fast Five, a near-perfect movie, by reintegrating the original cast and injecting the series with a level self-awareness, a tool that’d be honed into an art form by Fasts 5 through 7. You don’t necessarily need to rewatch Fast & Furious, but you should appreciate it for starting the revolution."}, {"553e": "(Universal Pictures)"}, {"a78a": "Satellite Ranking No. 3: Rapper Cameos, Ranked by How Much They Are Not Iggy Azalea — Shea"}, {"443b": "8. Iggy Azalea in Furious 7: Yes Iggy Azalea"}, {"3404": "1. (tie) Bow Wow in Tokyo Drift: Not Iggy Azalea"}, {"5cc5": "1. (tie) Jin in 2 Fast 2 Furious: Not Iggy Azalea"}, {"538f": "1. (tie) Ja Rule in The Fast and the Furious: Not Iggy Azalea"}, {"90c4": "1. (tie) Don Omar in Fast & Furious, Fast Five : Not Iggy Azalea"}, {"9a9f": "1. (tie) Ludacris in 2 Fast 2 Furious, Fast Five, Fast & Furious 6, Furious 7: Not Iggy Azalea."}, {"ddaf": "1. (tie) Tyrese in 2 Fast 2 Furious, Fast Five, Fast & Furious 6, Furious 7: Not Iggy Azalea."}, {"3604": "1. (tie) Tego Calderón in Fast & Furious, Fast Five: Not Iggy Azalea."}, {"aaa8": "Andrew: In my opinion, Ja Rule is the best Not Iggy Azalea."}, {"744a": "(Universal Pictures)"}, {"083a": "The Fifth-Best ‘Fast & Furious’ Movie"}, {"a58d": "‘2 Fast 2 Furious’"}, {"c562": "Shea: This one gets dumped on a bit, and I suppose that’s at least a little bit fair given that it scores well in only two of the five pillars (the Race one and the NOS one), but two very important things happened in it that helped shape what has turned into a perfect movie universe:"}, {"a58a": "Ludacris replaced Ja Rule: Ja was asked to be in 2 Fast 2 Furious after he was in The Fast and the Furious but he turned it down because this was back in the early 2000s and he was still famous and successful then. That’s how Ludacris ended up in this and the subsequent movies. Two things about that move: (1) I wonder how often Ja thinks about that. He’d made $15,000 for his appearance in the original and they offered him $500,000 to be in the second one. That means he’d be making several million per movie now instead of working at Chick-Fil-A or wherever it is he’s working now. (2) Ja losing his spot to Luda was a great turn for the franchise. They have completely different energies. Ja was always gruffer, meaner, tougher. There’s no way he’d have been able to slide into the tech guy role that Luda plays so perfectly. It’d have to have been a whole different thing."}, {"9819": "Roman Pearce gets introduced: Dropping Tyrese’s Roman Pearce into the series was, either by accident or design, a genius play. He is exactly the right pitch, exactly the right tempo, exactly the right speed for what he’s responsible for (which is to say, for being cool but funny but cool while being funny). He’s responsible for, probably, like, at least 80 percent of the genuine humor in the movies. Here’s his best scene — watch how quickly he glows, and how exquisitely he glows:"}, {"131c": "Who else could’ve played that role that well but Tyrese? I’ll tell you who: nobody."}, {"2962": "(Universal Pictures)"}, {"3ba8": "Satellite Ranking No. 4: The Best Times Two Characters Talked About Manhood and Bonding — Andrew"}, {"7fb2": "Now, these conversations — from which I have constructed my entire worldview — don’t necessarily need to be had over beer, but it helps if they are. That said, these are the two best times Fast characters talked about manhood and bonding."}, {"51bf": "4. Brian and Roman, 2 Fast 2 Furious"}, {"ea53": "As the story goes, Roman and Brian grew up together, and Roman misguidedly blames Brian for his going to prison. But toward the end of 2 Fast 2 Furious, as the sun sets in Miami, Roman commiserates with Brian and finally takes responsibility. Then they do this:"}, {"fa80": "It’s really beautiful."}, {"34f9": "3. Dom and Brian, The Fast and the Furious"}, {"94c7": "This sort of gets lost in the excitement of The Fast and the Furious, but the moment Dom tells Brian about the death of his father is truly emotional. He’s straight up confessing to nearly beating the man who killed his dad to death with a wrench — which comes up again in Fast Five — and admitting that even he gets scared sometimes. Plus, it all culminates in this quote, one of the best of the franchise: “I live my life a quarter-mile at a time. Nothing else matters — not the mortgage, not the store, not my team and all their bullshit. For those 10 seconds or less, I’m free.”"}, {"094c": "2. Han and Sean, The Fast and the Furious: Tokyo Drift"}, {"3526": "I’m going to cede the floor to Han, but let me just say that this is deeply profound and actually phenomenal life advice:"}, {"6782": "1. Dom and Brian, Fast Five"}, {"5cbd": "I know we’re having fun, but seriously — this scene is legitimately poignant, and now in retrospect, almost heartbreaking. It comes soon after Dom and Brian find out that Mia, Dom’s sister and Brian’s wife, is pregnant. “Dom, what do you remember about your father?” Brian asks, cannonballing into a serious conversation about parenting, and how the decisions a father makes irrevocably affect a son. Both guys get super raw, but nothing’s more heart-wrenching than Brian admitting he doesn’t remember anything about his dad because his dad wasn’t there. It’s almost impossible to watch this scene now, knowing that Paul Walker is gone. It’s probably the most important character moment Brian has in the entire series. Shea, I know you have feelings about this one."}, {"6a73": "Shea: I do, Andrew. And you touched on exactly those feelings, too. Before we sat down to write this, I spent, I think, four days rewatching all of these movies. Minus the ending scene of Furious 7, this was the one that thumped me in the chest the hardest. I didn’t remember being super affected by it when I saw Five in the theaters, but this time, watching him talking about growing up without his father around with the knowledge that his real-life daughter was now doing exactly that — it was just real rough, man."}, {"5e04": "(Universal Pictures)"}, {"88e0": "The Fourth-Best ‘Fast & Furious’ Movie"}, {"e65c": "‘Fast & Furious 6’"}, {"1bb7": "Andrew: Here’s everything Fast & Furious 6 has going for it."}, {"1469": "Shea: There’s a great shot right before this GIF you plugged in where we get Vin and the Rock squaring off against Owen Shaw and his Man Mountain soldier. I’m thinking about this scene right now and I am feeling some strong emotions."}, {"c3af": "Andrew: If it seems like Fast & Furious 6 checks all of our boxes, we should probably say that it absolutely does. Maybe it’s confusing, then, that the movie lands right in the middle of this ranking. But I think that’s a testament to the franchise — even a killer movie like this is overshadowed by some of the other installments."}, {"35f1": "(Universal Pictures)"}, {"fba7": "Satellite Ranking No. 5: The Best One-Liners From the Rock — Andrew"}, {"02e2": "4. “They’re not for me. They’re protection for you from me killing your ass.”"}, {"db01": "It’s hard to use this many prepositions and sound badass, but the Rock pulls it off."}, {"6d13": "3. “When you find that sumbitch, just do me one favor … don’t miss.”"}, {"288d": "Hobbs’s use of “sumbitch” is 100 percent a character choice made by the Rock. He uses the phrase far too much in Five, 6, and 7 for it not to be. But in Fast Five and Fast & Furious 6, Hobbs actually says “son of a bitch,” though each time you can hear him smashing the words closer and closer together. This moment in Furious 7, then, is truly historical — it’s when Hobbs becomes the ideal version of himself. Wow."}, {"0ec1": "Shea: There’s a scene in Fast Five where he accidentally says the full phrase — “son of a bitch” — and I remember being startled by it when I rewatched that movie after I’d seen 6 and 7. It was weird to hear him say “of” and “a” there. It was like in The Office when Dwight made that sign for Kelly that read, “It Is Your Birthday.”"}, {"1b33": "2. “Daddy’s gotta go to work.”"}, {"0bb1": "Several notes about this very good one-liner:"}, {"f6d8": "Hobbs says this to his daughter."}, {"1664": "Until this moment in Furious 7, I had no idea Hobbs had a daughter."}, {"1164": "Hobbs says this only because he sees a far-away explosion from his hospital window. This is man who does not ask, “Is that ball of fire related to daddy’s current situation, therefore requiring daddy to go to work?” No — an explosion in his vicinity automatically means he’s on the clock, no questions asked."}, {"a891": "Immediately after Hobbs says this, he flexes so hard his full-arm cast explodes."}, {"2985": "Shea: This is my favorite Rock quote in any movie. It’s perfect. Hearing him say it is when I was 100 percent positive we were going to get an Agent Hobbs spinoff."}, {"b361": "1. “Stay the fuck out of my way.”"}, {"8f99": "This happens in Fast Five when the Rock tells a lowly Brazilian policeman that he needs “two things.” He purposely doesn’t mention the second thing. It’s a setup: He wants the Brazilian policeman to ask him what the second thing is. And when he does, the Rock ends his life."}, {"d961": "(Universal Pictures)"}, {"1a7b": "The Third-Best ‘Fast & Furious’ Movie"}, {"04e5": "‘Fast Five’"}, {"1d7b": "Shea: There’s a clear and distinct transition that takes place over the course of the Fast franchise, and Fast Five represents the point during the metamorphosis where everything became bigger, better, smarter, faster, and more furious."}, {"84fd": "The Fast and the Furious was the skeleton. 2 Fast 2 Furious introduced the idea of Brian and someone else teaming up to defeat someone he couldn’t otherwise defeat alone. Tokyo Drift made the game international. Fast & Furious took all three of those ideas and then turned the volume up on them. And then Fast Five, exquisite and meaty and loud and obscene, catalyzed and crystallized all of everything that had come before. From that point forward, literally anything was possible."}, {"5b40": "You wanna fight a tank on a freeway? Cool. You wanna yank a plane out of the sky? OK. You wanna take a car and jump it from high-rise building to high-rise building in Abu Dhabi after someone fights Ronda Rousey? Go for it. Do it. You wanna fucking run up a bus as it falls off a cliff and then jump and dive and grab hold of the tail of a car as someone drifts it along the edge of the cliff? Sure. Absolutely. That can happen, because Fast Five happened."}, {"e673": "(Also, this is where the Rock’s Agent Hobbs gets introduced, which was vital, not only because he’s perfect in the role, but because it made it A-OK for A+ movie stars to jump into an already established franchise. I can’t wait to see who ends up in part 9 and part 10.)"}, {"5085": "(Another “also”: This is the first movie in our countdown that scores well in all five of the movie pillars.)"}, {"f6dc": "(Universal Pictures)"}, {"db3d": "Satellite Ranking No. 6: The 18 Best Dominic Toretto Lines, Ranked by How Dominic Toretto–y They Are — Shea"}, {"d22f": "18. After Gisele asks him if he’s one of those boys who appreciates cars over women in The Fast and the Furious: “I’m one of those boys that appreciates a fine body regardless of the make.”"}, {"3431": "17. After Agent Hobbs tells Dom he was easy to find in Fast & Furious 6: “I wasn’t hiding.”"}, {"2cc3": "16. When he’s about to race Letty in Fast & Furious 6 and he tries to jog her memory because he knows she has amnesia: “Ride or die, remember?”"}, {"53eb": "15. When he wants to race in Fast & Furious but Brian keeps talking: “We talkin’ or we racin’?”"}, {"84ef": "14. When he finds out that Brian and Mia are dating in The Fast and the Furious: “You break her heart I’ll break your neck.”"}, {"888d": "13. When he realizes it’s not just about being fast in Furious 7: “This time it ain’t just about being fast.”"}, {"1ed8": "12. When Owen Shaw threatens Dom’s family in Fast & Furious 6: “Your brother never told you never threaten a man’s family?”"}, {"d342": "11. When he sees a very nice car all cooped up in a building in Furious 7: “Nothing’s sadder than locking a beast in a cage.”"}, {"c98c": "Andrew: 11b. When he’s about to drive the very nice car through a building: “Time to unleash the beast.”"}, {"bef5": "Shea: 10. When Elena tells him he should just run if he wants to escape in Fast Five: “Runnin’ ain’t freedom.”"}, {"e010": "9. When Vince is groveling, asking if he can join in on Dom’s job in Fast Five, and Dom interrupts him mid-ask: “You’re in.”"}, {"75d3": "8. When Vince asks why Dom brought the buster (Brian) home to the party in The Fast and the Furious: “Cuz the buster kept me out of handcuffs!”"}, {"f880": "7. When Deckard Shaw thought it was gonna be a street fight in Furious 7: “You thought this was gonna be a street fight? [Picks up two giant wrenches] You’re goddamn right it is.”"}, {"5426": "6. When Dom said he still wanted to save Letty after she shot him in Fast & Furious 6: “You don’t turn your back on family. Even when they do.”"}, {"7205": "5. When Dom said he didn’t have friends, he has family in Furious 7: “I don’t have friends. I got family.”"}, {"cd2c": "4. When Agent Hobbs showed up and told Dom he was under arrest in Fast Five: “Arrest? I don’t feel like I’m under arrest.”"}, {"8ac2": "3. When Dom was being a philosopher in The Fast and the Furious: “I live my life a quarter-mile at a time.”"}, {"8277": "2. When Dom was thinking about Brian and remembering the time he was being a philosopher in The Fast and the Furious in Furious 7: “I used to say I live my life a quarter-mile at a time. And I think that’s why we were brothers. Because you did, too.”"}, {"d972": "1. When Brian told Dom that he almost beat him in their first race against each other in The Fast and the Furious: “Ask any racer — any real racer: It don’t matter if you win by an inch or a mile. Winning’s winning.”"}, {"ecb3": "Andrew: Can we also rate all of Roman Pearce’s pickup lines on a scale of 1 to “Wow, that was low-key really gross”?"}, {"919b": "Shea: Andrew, we have a ranking to finish."}, {"9b20": "(Universal Pictures)"}, {"5ce6": "The Second-Best ‘Fast & Furious’ Movie"}, {"b6d5": "‘Furious 7’"}, {"5054": "Andrew: In my mind, Furious 7 is the movie that perfected the approach initiated by Fast & Furious and Fast Five. It’s the moment in the franchise when that self-awareness and disregard for all rationality reaches a peak — the entire franchise was building to this movie, and any movie that comes after it is going to be hard-pressed to top it. As an example, watch this, the centerpiece of the film:"}, {"c84c": "It doesn’t matter how sure you are that driving a car through three skyscrapers is physically impossible — that the movie just goes for it is a stunning source of joy. Frankly, it’s inspirational. And that’s all of Furious 7 in a nutshell. Jason Statham is also the movie’s alpha villain — as Shea covered above, only Dom himself has been a more dangerous villain than Statham’s Deckard Shaw."}, {"6257": "As for how thoroughly family is tested in Furious 7, and how moving the emotional moments are, well, where to even begin? Midway through filming Furious 7, Paul Walker died in a car accident. That left everyone involved in the movie in a tough position, and after legitimately considering shutting down the franchise, the filmmakers opted to rewrite the movie’s ending, hire Walker’s brother as a stand-in and use cutting-edge CGI to give Brian O’Conner — and Paul Walker — an appropriate goodbye. The how and why Brian is sent off into the sunset is a little half-baked — I guess he’s, like, just gonna go do dad stuff now? — but the emotion of it all is executed perfectly. At the end of Furious 7, you come to understand that, over the years, when Vin Diesel was reciting all those lines about family, he wasn’t acting. And put simply, if you don’t cry watching this closing scene you are a monster."}, {"bded": "(Universal Pictures)"}, {"bc11": "Satellite Ranking No. 7: The Best Conversations About Sandwiches in the Fast & Furious Movies — Andrew"}, {"8aca": "If you didn’t know, sandwiches are how Brian got Mia to fall in love with him. And so they come up once in a while in the movies. These are the best times:"}, {"61d2": "3. When Vince and Brian fight over whether the tuna sandwich at Dom’s auto shop is good in The Fast and the Furious"}, {"14cb": "Some sample dialogue:"}, {"bcdd": "Vince: Try Fatburger from now on, you can get yourself a double-cheese with fries for $2.95."}, {"6ee8": "Brian: I like the tuna here."}, {"e0c9": "Vince: Bullshit, asshole. No one likes the tuna here."}, {"1232": "Brian: Yeah, well I do."}, {"cdb0": "Vince and Brian punch each other after this conversation."}, {"33c2": "2. When Mia tells Brian they’re having another baby and he’s all, “How about sandwiches?” in Furious 7"}, {"f483": "1. When Mia and Brian fall in love over tuna sandwiches in The Fast and the Furious"}, {"3de1": "I had to go with the franchise’s first conversation about sandwiches: Not only is it an emotional stake that ripples through the movies that followed, but it’s why all other sandwich-related discussions occur in the saga."}, {"f93f": "The Best ‘Fast & Furious’ Movie"}, {"b752": "‘The Fast and the Furious’"}, {"53fd": "Shea: This is a weird thing to think about now, because we’ve come to know Dominic Toretto and his gang as an ultra-elite, ultra-advanced, ultra-smart, ultra-unstoppable group of professional drivers, fighters, computer hackers, and heist superstars, but back when the franchise first started, they weren’t anything more than some people stealing DVD players off 18-wheelers. That’s it. There were no international voyages, no secret government agencies, no superheroic stunts, no the Rock. It was just Brian, a local cop with perfect blue eyes and slightly too-long hair, vs. Dominic and Letty and Jesse and Vince and that other guy nobody ever remembers or talks about. That was the foundation upon which a globe-trotting adventure was eventually laid out."}, {"a927": "It’s wild, really. They started out racing for $2,000 per entry, and then in 2 Fast 2 Furious it was $3,500 to enter the race, and then all of sudden by Fast Five they’re trying to evade international agents while also stealing $100,000,000 from a Brazilian kingpin. Watching that sort of come-up happening — watching the stakes just get ratcheted up higher and higher, all the while growing more and more attached to characters — it’s made for just a really great and enjoyable movie experience. And it’s also why original The Fast and the Furious has to finish first here."}, {"1009": "Let’s look back at those five tentpoles we identified earlier in the copy for measuring the worth of a Fast movie:"}, {"45dc": "How good and important was the movie’s best actual race? The most consequential race of all the races happens here (that first one between Dom and Brian). It set everything else into motion. Brian immediately fell in love with Dom, and Dom immediately identified Brian as hapless, sure, but also as talented and fearless, and so he knew right then he was going to bring him into the fold. Without this moment, everything else turns to ash. They never build that bond, Brian never lets Dom go at the end of the movie, Dom goes to prison, Vince probably kills Brian, etc. The series ends after one movie without this race."}, {"805f": "How dangerous was the movie’s alpha villain? (We talked about this already.)"}, {"b0ab": "How thoroughly was the idea of “family” tested in the movie? They spend the whole entire movie building up the idea of family (the relationship between Dom and his younger sister serving as the lighthouse in the storm; the reveal that Dom’s father died while Dom watched; the makeshift family Dom built around himself; Jesse getting killed at the end), all so they could place that final “Let Dom go or send him to prison?” dilemma at Brian’s feet in the movie’s final scene."}, {"c668": "How moving was the movie’s most emotional moment? The big ones here were (a) Dom telling Brian what happened to his father and how that event shaped his life, (b) Brian having to reveal that he was a cop to save Vince’s life in front of Dom, and (c) Jesse getting gunned down. But a secretly equally strong tug was right before Jesse got shot."}, {"578c": "Dom was getting in his car to go ride off. Brian pulled up behind him, pinning him in, trying to stop him. He thought Dom was gonna head out and do some violent things to people who probably deserved it. That’s when Dom — and this was the first time we ever heard him sound scared — shouts something close to, “I have to go find Jesse! He’s all I got!” That was the moment when it was really like, “Oh, shit. Wait. Dominic is actually perfect.” Of course, none of these were as good as that final tug at the end of Furious 7, but cumulatively it’s a big score here."}, {"a172": "How much NOS was used? So goddamn much NOS."}, {"1f8e": "But so you take all of those things and add them up and that’s how, just by the tiniest margin and slimmest margin and narrowest margin, The Fast and the Furious manages to edge out Furious 7 for first place. It was really close, but ask any racer — any real racer …"}, {"ab1e": "An earlier version of this piece incorrectly stated which season the Cleveland Cavaliers added J.R. Smith to their roster. It was the 2014–15 season, not the season after."}], "child": "19_1\t19_2\t19_3\t19_4\t19_5\t19_6\t19_7\t19_8\t19_9\t19_10\t19_11\t19_12\t19_13\t19_14\t19_15\t19_16\t19_17\t19_18\t19_19\t19_20\t19_21\t19_22\t19_23\t19_24\t19_25"}