{"name": "1909", "parent": "", "content": "Spring Break to Continue Forever On Mysterious Streaming Platform What does a French billionaire want with James Franco? The sun sets over these last and barren weeks of madness we call March. What remains of snowfall turns into slosh as students blink slowly into sobriety. “Spring Break, Spring Break, Spring Break forever,” an icy voice chants. But good news: that creepy voice just might have its demands met. A mysterious streaming platform called Blackpills has, per Deadline, now committed to distributing a scripted micro-episodic series based on Harmony Korine’s 2012 hyper-stylized meditation of life, love and spring break that starred James Franco, Selena Gomez and Vanessa Hudgens. The production company behind Spring Breakers, Fernando Sulichin and Chris Hanley’s Muse Productions (Buffalo ’66, Virgin Suicides), are more than thrilled. Hanley excitedly tells Deadline that the proposed micro-episode format is “the future of digital media.” Korine, on the other hand, has asserted his lack of interest in the project: busy, as he is, in gathering funding for various movies that have yet to see the light of production. Beach Bum, the latest, just tapped Matthew McConaughey as a lead and allegedly begins shooting in July. But Korine also had little interest in attempts to make a more conventional Spring Breakers: The Second Coming, which had begun development back in 2014. In his wake, Jonas Åkerlund, who once made a few music videos for Beyoncé, was set to direct and noted novelist Irvine Welsh on hand to write. It already had a plot involving its titular vacationers doing “battle with an extreme militant extremist sect that attempts to convert them.” Activity around the sequel seemed to fade shortly after James Franco lambasted any Spring Breakers sequel that did not have Korine as its head as a “poison ship” and predicted that “it will be a terrible film, with a horrible reason d’être.” While Franco has not yet commented on the potential of a Spring Breakers series, also sans Korine, its unlikely he will come on board given his upcoming work on Alien: Covenant, a starring role in an adaptation of sleazy pick-up book The Game, or maybe that doctorate in English Literature I don’t believe he ever got around to finishing at Yale. It’s worth noting that one of the most beloved examples of a TV series spun out of a movie, Larry Gelbart’s M*A*S*H, literally had other less famous people playing the same characters on the smaller screen. If the production team has any sense, they’ll get Pitchfork-reviewed rapper Riff Raff to take Franco’s role, since he believed Franco’s character was based on him, anyway. A more interesting question would be: what is Blackpills? Their website reveals nothing more informative or less ominous than a floating logo on an otherwise black page. But last year, Video Ink had reported that “For months, murmurs of a new French buyer and millennial distribution platform have been circulating the industry.” The buyer turned out to be Xavier Niel, a billionaire who founded France’s fourth-largest mobile carrier and, for some reason, once bought the rights to the Frank Sinatra song “My Way.” The ‘millennial distribution platform’ that he had cooked up was called Blackpills. Helming this millennial falcon is a fella by the name of Daniel Marhely, who founded something called Deezer, which is like Spotify but French. Billing itself as a ‘mobile-first streaming destination,’ Blackpills hit the ground running last year with a 13-episode series called You Got Trumped, written and directed by Canadian comedian Derek Harvie (Freddy Got Fingered) an imagining, back in October, the first hundred days of a hypothetical Trump presidency. While the writing is pretty trash, it is very well produced for a web-series (Video Ink reported that Blackpills was shilling something like $100,000 per three or four-minute episode). They even got a mildly respected Canadian comedian, Ron Sparks, to play Chris Christie, who one imagined would have been compensated for his early support and not currently hoping to land a gig on sports radio. It’s also kind of surreal to watch, given it currently being the first hundred days of a Trump presidency. Knock yourself out. A hypothetical Trump cabinet in Blackpill’s You Got Trumped, starring John Di Domenico. Watching these bad Trump jokes on YouTube, you might wonder whatever happened to the whole ‘mobile-first’ element of the story. The riotous success of (fake) President Trump was supposed to lay the ground work for Blackpill’s January rollout but that obviously didn’t happen. Now, it appears, the very-edgy website is planning on using a Spring Breakers adaptation as a jumping off point along with a curious holster of series from other odd ends of the cinematic universe. These include a series called Killer’s School helmed by Luc Besson (Lucy) about kids who to become killers and Junior by Zoe Cassavetes (Broken English). All of these are being marketed as cool, edgy ‘mobile native’ miniature-length serials; meat to be consumed, I take it, while on the go like a meal compressed in snack bar form. However, as The A.V. Club notes, at least one of the features that Blackpill claims to be dishing out, Sebastien Landry’s Game Of Death, already played at last week’s SXSW, leading some to wonder if the format will just be an odd and chunky way of distributing movies. Weirder still, Blackpills just signed a deal with Vice to exclusively distribute their content via their video hub. Which means the whole mobile thing might not be working out. The whole mini-episode format, as a way to reach millennials with those silly attention spans that can no longer handle the old-fashioned twenty-two minutes, has an interesting history. While websites like YouTube and its clones have built empires of bank by hosting viral short videos and series, the internet teams with the corpses of its failed peers. AOL famously tried to get back into the game of being cool by launching a bevy of short ten-minutes or less programs, one of which starred Steve Buscemi and won an Emmy. Now they vaguely hope Netflix will buy it off them. Even the less-lame Verizon’s attempt at short, edgy fun, Go90 — home to Megyn Kelly’s show about casual sex and journalism that I reviewed — is now being referred to as “pretty much dead.” Will Blackpill, with a name that immediately brings to mind some lost misogynist subreddit, win the hearts and minds of our diminished attention spans? Can a mini-episode, mini-Spring Breakers really out-preform this gif? ", "title": "Spring Break to Continue Forever On Mysterious Streaming Platform", "sentences": [{"0241": "Spring Break to Continue Forever On Mysterious Streaming Platform"}, {"4b33": "What does a French billionaire want with James Franco?"}, {"659c": "The sun sets over these last and barren weeks of madness we call March. What remains of snowfall turns into slosh as students blink slowly into sobriety. “Spring Break, Spring Break, Spring Break forever,” an icy voice chants. But good news: that creepy voice just might have its demands met. A mysterious streaming platform called Blackpills has, per Deadline, now committed to distributing a scripted micro-episodic series based on Harmony Korine’s 2012 hyper-stylized meditation of life, love and spring break that starred James Franco, Selena Gomez and Vanessa Hudgens."}, {"09ce": "The production company behind Spring Breakers, Fernando Sulichin and Chris Hanley’s Muse Productions (Buffalo ’66, Virgin Suicides), are more than thrilled. Hanley excitedly tells Deadline that the proposed micro-episode format is “the future of digital media.” Korine, on the other hand, has asserted his lack of interest in the project: busy, as he is, in gathering funding for various movies that have yet to see the light of production. Beach Bum, the latest, just tapped Matthew McConaughey as a lead and allegedly begins shooting in July."}, {"c909": "But Korine also had little interest in attempts to make a more conventional Spring Breakers: The Second Coming, which had begun development back in 2014. In his wake, Jonas Åkerlund, who once made a few music videos for Beyoncé, was set to direct and noted novelist Irvine Welsh on hand to write. It already had a plot involving its titular vacationers doing “battle with an extreme militant extremist sect that attempts to convert them.” Activity around the sequel seemed to fade shortly after James Franco lambasted any Spring Breakers sequel that did not have Korine as its head as a “poison ship” and predicted that “it will be a terrible film, with a horrible reason d’être.”"}, {"e404": "While Franco has not yet commented on the potential of a Spring Breakers series, also sans Korine, its unlikely he will come on board given his upcoming work on Alien: Covenant, a starring role in an adaptation of sleazy pick-up book The Game, or maybe that doctorate in English Literature I don’t believe he ever got around to finishing at Yale. It’s worth noting that one of the most beloved examples of a TV series spun out of a movie, Larry Gelbart’s M*A*S*H, literally had other less famous people playing the same characters on the smaller screen. If the production team has any sense, they’ll get Pitchfork-reviewed rapper Riff Raff to take Franco’s role, since he believed Franco’s character was based on him, anyway."}, {"2230": "A more interesting question would be: what is Blackpills? Their website reveals nothing more informative or less ominous than a floating logo on an otherwise black page. But last year, Video Ink had reported that “For months, murmurs of a new French buyer and millennial distribution platform have been circulating the industry.” The buyer turned out to be Xavier Niel, a billionaire who founded France’s fourth-largest mobile carrier and, for some reason, once bought the rights to the Frank Sinatra song “My Way.” The ‘millennial distribution platform’ that he had cooked up was called Blackpills. Helming this millennial falcon is a fella by the name of Daniel Marhely, who founded something called Deezer, which is like Spotify but French."}, {"4c93": "Billing itself as a ‘mobile-first streaming destination,’ Blackpills hit the ground running last year with a 13-episode series called You Got Trumped, written and directed by Canadian comedian Derek Harvie (Freddy Got Fingered) an imagining, back in October, the first hundred days of a hypothetical Trump presidency. While the writing is pretty trash, it is very well produced for a web-series (Video Ink reported that Blackpills was shilling something like $100,000 per three or four-minute episode). They even got a mildly respected Canadian comedian, Ron Sparks, to play Chris Christie, who one imagined would have been compensated for his early support and not currently hoping to land a gig on sports radio. It’s also kind of surreal to watch, given it currently being the first hundred days of a Trump presidency. Knock yourself out."}, {"e56f": "A hypothetical Trump cabinet in Blackpill’s You Got Trumped, starring John Di Domenico."}, {"5149": "Watching these bad Trump jokes on YouTube, you might wonder whatever happened to the whole ‘mobile-first’ element of the story. The riotous success of (fake) President Trump was supposed to lay the ground work for Blackpill’s January rollout but that obviously didn’t happen. Now, it appears, the very-edgy website is planning on using a Spring Breakers adaptation as a jumping off point along with a curious holster of series from other odd ends of the cinematic universe. These include a series called Killer’s School helmed by Luc Besson (Lucy) about kids who to become killers and Junior by Zoe Cassavetes (Broken English). All of these are being marketed as cool, edgy ‘mobile native’ miniature-length serials; meat to be consumed, I take it, while on the go like a meal compressed in snack bar form. However, as The A.V. Club notes, at least one of the features that Blackpill claims to be dishing out, Sebastien Landry’s Game Of Death, already played at last week’s SXSW, leading some to wonder if the format will just be an odd and chunky way of distributing movies. Weirder still, Blackpills just signed a deal with Vice to exclusively distribute their content via their video hub. Which means the whole mobile thing might not be working out."}, {"814b": "The whole mini-episode format, as a way to reach millennials with those silly attention spans that can no longer handle the old-fashioned twenty-two minutes, has an interesting history. While websites like YouTube and its clones have built empires of bank by hosting viral short videos and series, the internet teams with the corpses of its failed peers. AOL famously tried to get back into the game of being cool by launching a bevy of short ten-minutes or less programs, one of which starred Steve Buscemi and won an Emmy. Now they vaguely hope Netflix will buy it off them. Even the less-lame Verizon’s attempt at short, edgy fun, Go90 — home to Megyn Kelly’s show about casual sex and journalism that I reviewed — is now being referred to as “pretty much dead.” Will Blackpill, with a name that immediately brings to mind some lost misogynist subreddit, win the hearts and minds of our diminished attention spans? Can a mini-episode, mini-Spring Breakers really out-preform this gif?"}], "child": "1909_11909_1"}