{"name": "1913", "parent": "", "content": "11 Good Movies to Watch on Hulu in March 2017 Epic action, misbehaving students, and intergalactic clowns are here to brighten your month on Hulu. I’m here to tell you that there’s a cinematic streaming goldmine available on Hulu that includes recent hits, older classics, domestic releases, and foreign imports. Sure there’s plenty of filler and seemingly thousands of titles I’ve never heard of before, but I’m here to recommend some good movies (and maybe even some “good” movies) to watch this March on Hulu. Pick of the Month: Enemy at the Gates (2001) Period war films are a dime a dozen, but director Jean-Jacques Annaud’s intimate World War II epic narrows its focus in a very specific way. As the battle of Stalingrad shakes the earth around them, two men — a Russian sniper (Jude Law) and his German counterpart (Ed Harris) — face-off from hundreds of yards apart. The action and acting are top-notch all around, and even though the city is crumbling Annaud still manages to deliver an attractive film. Carrie (1976) There have been sequels and remakes, but Brian De Palma’s original remains the most visually compelling and emotionally draining adaptation of Stephen King’s first novel. It’s far from my favorite De Palma (or King for that matter), but its effectiveness is hard to beat. Killer Klowns from Outer Space (1988) Alien clowns land on earth and begin harvesting the citizens of a small town, and yes, the clown effects remain terrifically creepy and creative. It’s an absolute crime against humanity that the Chiodo Brothers never made another feature film after this wonderfully ridiculous horror/sci-fi/comedy. Happily, IMDB mentions a long-awaited sequel that may go into production next year…? Lost Highway (1997) Don’t tell anyone I said this, but I’m not really much of a David Lynch fan outside of the first season of Twin Peaks. To that end there are a few films in his filmography that I have yet to watch, and chief among them are probably this one and Mulholland Drive. I may or may not be cutting that list in half this month. A Simple Plan (1998) I don’t think it’s much of a stretch to call this Sam Raimi’s best film. I’d put Spider-Man 2, The Quick and the Dead, and For the Love of the Game (yeah I said it) in the slots following, but for me this dark thriller about mistakes and morality is his number one. If you’ve never seen it this is a great opportunity to discover it, but even if you have maybe give it a re-watch both for its brilliance and for a reminder of the late, great Bill Paxton. 13 Going on 30 (2004) Good thing Twitter wasn’t around back in 2004 otherwise the bro brigade would have probably gone off on this movie’s female riff on Big as an assault on their collective childhood. It’s little more than a gender-swapped take on the same story, but it delivers the goods and avoids having a love interest who actually sleeps with the child in an adult body. Is that a double standard in the same way female teachers who have sex with teen boys aren’t seen as creepy as male teachers who sleep with their female students? Miami Vice (2006) Michael Mann’s big-screen adaptation of the popular ’80s TV show has long been the director’s most divisive film. It’s neither objectively great like Heat nor absolute garbage like Blackhat, and Mann fans are constantly at war over which end it’s closer to. I was no fan on my first viewing, but I plan on giving it a re-watch this month. Flash Point (2007) I’m an absolute sucker for Donnie Yen films, particularly the ones that see him kicking ass in modern day settings. Of the titles which fit that bill this is probably my favorite. Yen’s big brawl with Collin Chou is an all-time great and one of the absolute best movie fights of all time. The Man from Nowhere (2010) The plot is as simple as they come — a retired bad-ass is forced back into the game to protect an innocent girl — but good gravy does director Lee Jeong-beom execute it with style, beauty, and mesmerizing carnage. Won Bin convinces both as someone who cares and as someone capable of wiping out a private security force with guns, knives, cars, and fists. It’s fantastic even before the epic knife fight in the third act. Confession of Murder (2012) That’s right, I have two Korean action/thrillers in a row. Feel free to take that as a suggestion for a long but highly worthwhile double feature. This one is loaded with action, some grim and some fun, but the bigger draw here is a terrifically twisted plot that makes time for bloodletting, smart story turns, and heavy doses of humor. Everybody Wants Some (2016) *available 3/17* Richard Linklater’s latest is a slight film, but that’s in no way a criticism. Instead, I only mean that it avoids much in the way of plot or character development and instead simply enjoys a leisurely stroll through a week or so in the lives of some college baseball players in the ’80s. It’s a fun, relaxing movie that eases you into its mostly conflict-free world with humor, great music, and a casual atmosphere. ", "title": "11 Good Movies to Watch on Hulu in March 2017", "sentences": [{"dd99": "11 Good Movies to Watch on Hulu in March 2017"}, {"6e8c": "Epic action, misbehaving students, and intergalactic clowns are here to brighten your month on Hulu."}, {"a63e": "I’m here to tell you that there’s a cinematic streaming goldmine available on Hulu that includes recent hits, older classics, domestic releases, and foreign imports. Sure there’s plenty of filler and seemingly thousands of titles I’ve never heard of before, but I’m here to recommend some good movies (and maybe even some “good” movies) to watch this March on Hulu."}, {"dc74": "Pick of the Month: Enemy at the Gates (2001)"}, {"185c": "Period war films are a dime a dozen, but director Jean-Jacques Annaud’s intimate World War II epic narrows its focus in a very specific way. As the battle of Stalingrad shakes the earth around them, two men — a Russian sniper (Jude Law) and his German counterpart (Ed Harris) — face-off from hundreds of yards apart. The action and acting are top-notch all around, and even though the city is crumbling Annaud still manages to deliver an attractive film."}, {"4206": "Carrie (1976)"}, {"438d": "There have been sequels and remakes, but Brian De Palma’s original remains the most visually compelling and emotionally draining adaptation of Stephen King’s first novel. It’s far from my favorite De Palma (or King for that matter), but its effectiveness is hard to beat."}, {"93f4": "Killer Klowns from Outer Space (1988)"}, {"3974": "Alien clowns land on earth and begin harvesting the citizens of a small town, and yes, the clown effects remain terrifically creepy and creative. It’s an absolute crime against humanity that the Chiodo Brothers never made another feature film after this wonderfully ridiculous horror/sci-fi/comedy. Happily, IMDB mentions a long-awaited sequel that may go into production next year…?"}, {"8455": "Lost Highway (1997)"}, {"c2fa": "Don’t tell anyone I said this, but I’m not really much of a David Lynch fan outside of the first season of Twin Peaks. To that end there are a few films in his filmography that I have yet to watch, and chief among them are probably this one and Mulholland Drive. I may or may not be cutting that list in half this month."}, {"913c": "A Simple Plan (1998)"}, {"071c": "I don’t think it’s much of a stretch to call this Sam Raimi’s best film. I’d put Spider-Man 2, The Quick and the Dead, and For the Love of the Game (yeah I said it) in the slots following, but for me this dark thriller about mistakes and morality is his number one. If you’ve never seen it this is a great opportunity to discover it, but even if you have maybe give it a re-watch both for its brilliance and for a reminder of the late, great Bill Paxton."}, {"b80b": "13 Going on 30 (2004)"}, {"7504": "Good thing Twitter wasn’t around back in 2004 otherwise the bro brigade would have probably gone off on this movie’s female riff on Big as an assault on their collective childhood. It’s little more than a gender-swapped take on the same story, but it delivers the goods and avoids having a love interest who actually sleeps with the child in an adult body. Is that a double standard in the same way female teachers who have sex with teen boys aren’t seen as creepy as male teachers who sleep with their female students?"}, {"d31b": "Miami Vice (2006)"}, {"67d3": "Michael Mann’s big-screen adaptation of the popular ’80s TV show has long been the director’s most divisive film. It’s neither objectively great like Heat nor absolute garbage like Blackhat, and Mann fans are constantly at war over which end it’s closer to. I was no fan on my first viewing, but I plan on giving it a re-watch this month."}, {"38c1": "Flash Point (2007)"}, {"23b0": "I’m an absolute sucker for Donnie Yen films, particularly the ones that see him kicking ass in modern day settings. Of the titles which fit that bill this is probably my favorite. Yen’s big brawl with Collin Chou is an all-time great and one of the absolute best movie fights of all time."}, {"1bb5": "The Man from Nowhere (2010)"}, {"1736": "The plot is as simple as they come — a retired bad-ass is forced back into the game to protect an innocent girl — but good gravy does director Lee Jeong-beom execute it with style, beauty, and mesmerizing carnage. Won Bin convinces both as someone who cares and as someone capable of wiping out a private security force with guns, knives, cars, and fists. It’s fantastic even before the epic knife fight in the third act."}, {"8730": "Confession of Murder (2012)"}, {"c871": "That’s right, I have two Korean action/thrillers in a row. Feel free to take that as a suggestion for a long but highly worthwhile double feature. This one is loaded with action, some grim and some fun, but the bigger draw here is a terrifically twisted plot that makes time for bloodletting, smart story turns, and heavy doses of humor."}, {"7a5e": "Everybody Wants Some (2016) *available 3/17*"}, {"f585": "Richard Linklater’s latest is a slight film, but that’s in no way a criticism. Instead, I only mean that it avoids much in the way of plot or character development and instead simply enjoys a leisurely stroll through a week or so in the lives of some college baseball players in the ’80s. It’s a fun, relaxing movie that eases you into its mostly conflict-free world with humor, great music, and a casual atmosphere."}], "child": "1913_11913_11913_11913_11913_11913_11913_11913_11913_11913_11913_11913_1"}