{"child": "1916_1\t1916_2\t1916_3\t1916_4\t1916_5\t1916_6\t1916_7\t1916_8\t1916_9\t1916_10\t1916_11\t1916_12", "title": "Any Brew You Want, As Long As It’s a Corona", "content": "Any Brew You Want, As Long As It’s a Corona The ‘Fast & Furious’ movies have been devoted to a single beer brand since the beginning. But believe it or not, the franchise’s love affair with Corona is not product placement — it’s character development at its weirdest, and most American. For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. Dominic Toretto, the hulking, hairless patriarch of 2001’s The Fast and the Furious, is upset. Also tired. A routine night of underground racing in East L.A. has just turned into a police raid; Dom managed an on-foot escape, but he and his new friend Brian Spilner, a mysterious rookie in the racing scene, were quickly intercepted by Dom’s rival Johnny Tran and had to stand idly by as a hail of gunfire and NOS turned Brian’s Mitsubishi Eclipse into a green-orange ball of fire. After finally making it back to his house — a refuge for outcasts and car-and-leather-obsessed tweakers — Dom is chagrined to find his crew having a party. At the moment, the only person on Dom’s good side is Brian. Determined to reward Brian further, Dom picks up two stray beer bottles and approaches him. That’s when he says it: “You can have any brew you want … as long as it’s a Corona.” Fourteen years later, and 30 minutes into Furious 7, Dom is fighting Deckard Shaw (Jason Statham) to the death when they’re interrupted by a man who refers to himself as Mr. Nobody (Kurt Russell). Shaw escapes, and Dom is forced to follow Nobody back to his super-secret lair in El Segundo, California, where, amid barrels of explosives and camo-colored trunks, there sits a kegerator. “Belgian ale,” Mr. Nobody says, taking a sip out of a freshly poured pint glass. “Oh man, those monks got it right. Would you like one?” And then Dom says it: “I’m more of a Corona man myself.” Unfazed, Nobody reaches behind a trunk and produces a Corona-branded bucket of Coronas and slaps it down on a table in all its frosty, ice-cold glory. The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com The Fast & Furious franchise became what it is today — a billion-dollar box-office juggernaut, with seven sequels and at least two more to come — in part because the movies embraced their absurdity. They drive cars through skyscrapers, make 100-foot leaps into ravines, and drive bank vaults through Rio, stripping themselves of all self-seriousness and adherence to the laws of physics. But beneath the nonsensical stunts and the utter disappearance of the threat of death, when everything gets boiled down, the Fast movies remain focused on a family of misfit thrill-seekers who sit around a table drinking beer — almost always Corona — together well after the sun goes down. That truth layers emotion behind every stunt and every illogical plot development and engenders loyalty from the audience. More than any of the cars Dom, Brian, and their crew have driven or destroyed in seven movies — more than the cities they’ve dragged through, more than Eva Mendes or Lucas Black — Corona has been a unifying symbol in the Fast & Furious franchise. Since Vin Diesel’s reading of that now-iconic line, at once nonsensical and definitive, the beer brand has acted as a signifier of time and place, and now, as Fast approaches its eighth film, a tool for self-reference and awareness. “It’s literally a character in the films,” says Chris Morgan, who’s written the screenplay for every Fast movie since the third, Tokyo Drift. It’s what Reese’s Pieces was to ET — if ET had seven sequels and counting. ‘The Fast and the Furious,’ 2001 (Universal Pictures) But the history of Corona and Fast & Furious isn’t a story about a winking, fruitful, long-running product-placement deal, or even some byzantine corporate favor for two closely aligned conglomerates. There are likely hundreds of corporations who would shell out to be repeatedly endorsed by a multibillion-dollar franchise; to pick a close example, Heineken reportedly paid $45 million to make James Bond a beer drinker in Skyfall. But, believe it or not, Universal is featuring Corona for free. According to the franchise’s creators, Corona’s product just so happened to represent exactly what Fast & Furious was looking for when the saga began — and 16 years later, it’s what Corona represents, and the character continuity it provides, they say, that matters. As consumers, the things we buy are shorthand — consciously and subconsciously — for who we are and, just as importantly, who we think other people are. It’s for that reason that some products become character notes and reference points all on their own. Think Tiffany & Co. in Breakfast at Tiffany’s or Alaia in Clueless, or more recently Eggo in Stranger Things. But there’s a fine line between overt mentions of a product and all-out pandering. Mike Myers poked fun at how movies sell out for products in Wayne’s World, imitating their transparent greediness while smizing over an open box of Pizza Hut. As the boardroom deals between production companies and brands began to manifest in increasingly obvious ways on screen (and haven’t slowed down since 1992, the year Wayne’s World came out), audiences reprogrammed themselves to balk at product placement and be skeptical of any art that appears to be selling out. The funny, and quite frankly weird, thing about Fast & Furious is that it seems like one of these sellouts, when actually, it’s not like that at all. We Wrote the Next Four ‘Fast & Furious’ MoviesHere’s how Vin Diesel, the Rock, and the rest of the gang will get to space, survive the apocalypse, and resurrect the…theringer.com Corona gained popularity in the 1980s, bursting onto the scene at a time when Americans were moving toward lighter-tasting beers and starting to buy more imported products. “It emanated out of California,” says Benj Steinman, longtime president of Beer Marketer’s Insights. “Vacation in a bottle — that’s iconic at this point.” It’s that fact that drew Gary Scott Thompson to Corona when he was working on the script for what would become 2001’s The Fast and the Furious. “I was asked by Universal to see if I could figure out a story based on a Vibe magazine article that they had. Ironically, I lived a block from a group of kids who were tearing their cars apart and putting them back together,” says Thompson. “I had Corona in my script because the guys at the end of the street drank Corona. It was a very East L.A. beer.” ‘The Fast and the Furious,’ 2001 (Universal Pictures) “I was trying to make an L.A. saga,” says Rob Cohen, who developed and directed The Fast and the Furious, “and Corona, to me, just seemed like this iconic, Southern California beer.” It also helped that Corona, a beer with significant contingents of Hispanic and Asian consumers, had a base that reflected the kind of cast Cohen was trying to build. “[When] I went to a street race for the first time out on San Fernando Road, I noticed that there were these mixed-up niches. There were Vietnamese kids, white kids, black kids, and there were Latinos. I wanted to reflect that in the movie.” The scene in The Fast and the Furious where Dom hosts a barbecue in his L.A. backyard for his multicultural crew, his “family,” is the essence of what the franchise is about. And it’s not an accident that Corona bottles line Dom’s picnic table in that moment. As for how they got the beer in the movie, Cohen paints a pretty loose picture. “You’ve got to remember, [in the late ’90s], nobody believed in the movie. Nobody knew what the fuck it was.” As such, the two parties didn’t come close to approaching what would be considered a full-fledged product-placement deal. “We got some free beer. We reached out to Corona, and they responded like, ‘We’ll give you product and it’s OK to use our name.’” Even as the years went on, and the impact of the Fast & Furious franchise grew exponentially, that arrangement defined the level of Corona’s involvement. “It’s been an honor to have Corona Extra play a part in pop culture history with the Fast and the Furious franchise over the years,” a spokesperson for the company told The Ringer in an official statement. “While we had no formal agreement with the production company, we were aware of the incorporation of Corona into several of the films.” ‘Fast & Furious,’ 2009 (Universal Pictures) The elephant in the 1970 Chevrolet Chevelle SS is the fact that moviemaking is a business, and product placement — even really good product placement — is almost always about a capitalistic exchange, rather than world-building. Brands pay a production company to be prominently featured in a film. The exchange manifests in varying ways — from Heineken partially funding the production budget for 2015’s Spectre with a product placement deal to Oliver Stone getting a free pair of boots for showing a certain brand name in Natural Born Killers. As Cohen noted, the initial deal between The Fast and the Furious and Corona was small and rather unofficial: a few cases of free beer in exchange for an overt mention of the brand name. “They were one of the companies that was smart enough to get in with us at the ground floor,” Cohen adds. Whether the company actually foresaw the success of Fast or just didn’t see the point in denying any movie’s outright endorsement of their product, the decision to allow Corona to be featured in The Fast and the Furious has developed into a profitable one. “[Corona is] the unpaid official beer of Fast & Furious,” longtime producer Neal H. Moritz told The Bill Simmons Podcast. “I know it’s crazy. I should have a pallet of it in front of my house right now.” ‘Furious 7,’ 2015 (Universal Pictures) As a managing partner at Apex Marketing Group, Eric Smallwood analyzes the value of product placement and strategic advertising for both brands and production companies. “I’m amazed at how it was used,” he says of Corona’s placement in the Fast franchise. “The verbal mentions — it’s very overt.” “If you were to poll people that saw these movies — ‘What kind of brand did you see in the movie?’ — a large percentage would say Corona,” he continues. “It’s got a brand association with the franchise.” That might not have mattered much to Corona’s bottom line in 2001, but it has to these days, now that Fast & Furious is an international franchise whose last film made over $1.5 billion worldwide. “The more people see it, the more money the movie makes — but also, the more awareness there is for the brand,” says Smallwood. He estimates that Corona’s product-placement value from Furious 7 is a whopping $6.1 million — basically, more than it cost to buy a 30-second Super Bowl ad in 2017. In total, he estimates that the product-placement value for Corona from all of the films is about $15.3 million. And yet, according to everyone we spoke to, Corona doesn’t even pay to be in the movies. “On all the stuff I’ve ever done, I don’t believe there ever was [a deal with Corona],” says Morgan. “The truth is we write it in there. We talk about it. It’s what it’s going to be, and not for any business reasons. It’s part of Dom’s character. It just is.” “I saw the original movie in the theater and I was just a fan.” Having joined the franchise in 2006, Morgan is one of the most tenured members on the Fast team, and he’s personally responsible for every Corona reference the movies have made since the original. He continues to bake them into his scripts for one primary reason: precedent. “They branded themselves [in the original],” Morgan says. “‘If you’re gonna fit in with our crew, this is what our crew does.’” When he first got to write for Dom in the fourth installment, Fast & Furious (Diesel appears in only the waning seconds of Tokyo Drift), Morgan used the mention and presence of Corona to show that while years have passed, the characters haven’t changed. He achieved the same effect, wrapping continuity into nostalgia, with a barbecue scene that closes Fast & Furious 6 — and dutifully mirrors the barbecue scene of the original Fast, beer and all. ‘Fast & Furious 6,’ 2013 (Universal Pictures) Cohen points out, “The sequels can get bigger. They can go to Abu Dhabi, Miami, Tokyo, wherever they want, but it all comes back to that picnic table, and that backyard with the skyline view.” Along with continuing this sense of family, Morgan has also used Corona as a tool of self-awareness. Now eight movies into the franchise, there’s over a decade worth of history to draw from — and inside jokes to make. The scene featuring Corona in Furious 7, which might as well be a 30-second ad for the beer, even stylistically speaking, is the perfect example of that. The Family Values of ‘Fast & Furious’As the preeminent family-friendly franchise, ‘Fast’ can teach you a thing or twotheringer.com “Mr. Nobody is this mysterious guy — nobody knows who he is — so the idea was to bring Dom to the office and start layering in a little bit of trust and familiarity,” Morgan says. “And you can talk about, ‘Hey Dom, here’s what I know you did with that car,’ but I was looking for one thing to put in there to give the audience a wink. We played that for a joke, but also, this is how well this guy knows Dom. It’s just a fun, character-y moment.” The scene’s greatest power, however — beyond establishing Mr. Nobody’s fastidiousness, beyond acting as a punch line, beyond displaying how comfortable the underwriters must be financially, that they’d forgo such an obvious opportunity to make a product-placement deal — is the way it confirms a camaraderie between those who make the Fast movies and those who watch them. This is a franchise that builds on itself and actively celebrates its history, rewarding those who have been there from the beginning with self-aware nods and self-deprecating in-jokes. Dom’s line — “As long as it’s a Corona” — in The Fast and the Furious is so bewildering that it stands out in fans’ memories. The Corona bucket in Furious 7 is the franchise saying to the audience, “We remember it too.” ", "name": "1916", "parent": "", "sentences": [{"120f": "Any Brew You Want, As Long As It’s a Corona"}, {"396e": "The ‘Fast & Furious’ movies have been devoted to a single beer brand since the beginning. But believe it or not, the franchise’s love affair with Corona is not product placement — it’s character development at its weirdest, and most American."}, {"1e0f": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of The Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"4a5e": "Dominic Toretto, the hulking, hairless patriarch of 2001’s The Fast and the Furious, is upset. Also tired. A routine night of underground racing in East L.A. has just turned into a police raid; Dom managed an on-foot escape, but he and his new friend Brian Spilner, a mysterious rookie in the racing scene, were quickly intercepted by Dom’s rival Johnny Tran and had to stand idly by as a hail of gunfire and NOS turned Brian’s Mitsubishi Eclipse into a green-orange ball of fire. After finally making it back to his house — a refuge for outcasts and car-and-leather-obsessed tweakers — Dom is chagrined to find his crew having a party. At the moment, the only person on Dom’s good side is Brian. Determined to reward Brian further, Dom picks up two stray beer bottles and approaches him. That’s when he says it: “You can have any brew you want … as long as it’s a Corona.”"}, {"edae": "Fourteen years later, and 30 minutes into Furious 7, Dom is fighting Deckard Shaw (Jason Statham) to the death when they’re interrupted by a man who refers to himself as Mr. Nobody (Kurt Russell). Shaw escapes, and Dom is forced to follow Nobody back to his super-secret lair in El Segundo, California, where, amid barrels of explosives and camo-colored trunks, there sits a kegerator. “Belgian ale,” Mr. Nobody says, taking a sip out of a freshly poured pint glass. “Oh man, those monks got it right. Would you like one?” And then Dom says it: “I’m more of a Corona man myself.”"}, {"0e03": "Unfazed, Nobody reaches behind a trunk and produces a Corona-branded bucket of Coronas and slaps it down on a table in all its frosty, ice-cold glory."}, {"f29a": "The Definitive ‘Fast & Furious’ Movie RankingsBefore ‘Fate of the Furious’ is released, Shea Serrano and Andrew Gruttadaro are taking stock: Which is the best ‘Fast…theringer.com"}, {"4557": "The Fast & Furious franchise became what it is today — a billion-dollar box-office juggernaut, with seven sequels and at least two more to come — in part because the movies embraced their absurdity. They drive cars through skyscrapers, make 100-foot leaps into ravines, and drive bank vaults through Rio, stripping themselves of all self-seriousness and adherence to the laws of physics. But beneath the nonsensical stunts and the utter disappearance of the threat of death, when everything gets boiled down, the Fast movies remain focused on a family of misfit thrill-seekers who sit around a table drinking beer — almost always Corona — together well after the sun goes down. That truth layers emotion behind every stunt and every illogical plot development and engenders loyalty from the audience."}, {"9d1b": "More than any of the cars Dom, Brian, and their crew have driven or destroyed in seven movies — more than the cities they’ve dragged through, more than Eva Mendes or Lucas Black — Corona has been a unifying symbol in the Fast & Furious franchise. Since Vin Diesel’s reading of that now-iconic line, at once nonsensical and definitive, the beer brand has acted as a signifier of time and place, and now, as Fast approaches its eighth film, a tool for self-reference and awareness."}, {"2b67": "“It’s literally a character in the films,” says Chris Morgan, who’s written the screenplay for every Fast movie since the third, Tokyo Drift. It’s what Reese’s Pieces was to ET — if ET had seven sequels and counting."}, {"baae": "‘The Fast and the Furious,’ 2001 (Universal Pictures)"}, {"4f3b": "But the history of Corona and Fast & Furious isn’t a story about a winking, fruitful, long-running product-placement deal, or even some byzantine corporate favor for two closely aligned conglomerates. There are likely hundreds of corporations who would shell out to be repeatedly endorsed by a multibillion-dollar franchise; to pick a close example, Heineken reportedly paid $45 million to make James Bond a beer drinker in Skyfall. But, believe it or not, Universal is featuring Corona for free. According to the franchise’s creators, Corona’s product just so happened to represent exactly what Fast & Furious was looking for when the saga began — and 16 years later, it’s what Corona represents, and the character continuity it provides, they say, that matters."}, {"0cff": "As consumers, the things we buy are shorthand — consciously and subconsciously — for who we are and, just as importantly, who we think other people are. It’s for that reason that some products become character notes and reference points all on their own. Think Tiffany & Co. in Breakfast at Tiffany’s or Alaia in Clueless, or more recently Eggo in Stranger Things. But there’s a fine line between overt mentions of a product and all-out pandering. Mike Myers poked fun at how movies sell out for products in Wayne’s World, imitating their transparent greediness while smizing over an open box of Pizza Hut. As the boardroom deals between production companies and brands began to manifest in increasingly obvious ways on screen (and haven’t slowed down since 1992, the year Wayne’s World came out), audiences reprogrammed themselves to balk at product placement and be skeptical of any art that appears to be selling out. The funny, and quite frankly weird, thing about Fast & Furious is that it seems like one of these sellouts, when actually, it’s not like that at all."}, {"2abc": "We Wrote the Next Four ‘Fast & Furious’ MoviesHere’s how Vin Diesel, the Rock, and the rest of the gang will get to space, survive the apocalypse, and resurrect the…theringer.com"}, {"b7ae": "Corona gained popularity in the 1980s, bursting onto the scene at a time when Americans were moving toward lighter-tasting beers and starting to buy more imported products. “It emanated out of California,” says Benj Steinman, longtime president of Beer Marketer’s Insights. “Vacation in a bottle — that’s iconic at this point.” It’s that fact that drew Gary Scott Thompson to Corona when he was working on the script for what would become 2001’s The Fast and the Furious. “I was asked by Universal to see if I could figure out a story based on a Vibe magazine article that they had. Ironically, I lived a block from a group of kids who were tearing their cars apart and putting them back together,” says Thompson. “I had Corona in my script because the guys at the end of the street drank Corona. It was a very East L.A. beer.”"}, {"8cfb": "‘The Fast and the Furious,’ 2001 (Universal Pictures)"}, {"e5fa": "“I was trying to make an L.A. saga,” says Rob Cohen, who developed and directed The Fast and the Furious, “and Corona, to me, just seemed like this iconic, Southern California beer.” It also helped that Corona, a beer with significant contingents of Hispanic and Asian consumers, had a base that reflected the kind of cast Cohen was trying to build. “[When] I went to a street race for the first time out on San Fernando Road, I noticed that there were these mixed-up niches. There were Vietnamese kids, white kids, black kids, and there were Latinos. I wanted to reflect that in the movie.” The scene in The Fast and the Furious where Dom hosts a barbecue in his L.A. backyard for his multicultural crew, his “family,” is the essence of what the franchise is about. And it’s not an accident that Corona bottles line Dom’s picnic table in that moment."}, {"7277": "As for how they got the beer in the movie, Cohen paints a pretty loose picture. “You’ve got to remember, [in the late ’90s], nobody believed in the movie. Nobody knew what the fuck it was.” As such, the two parties didn’t come close to approaching what would be considered a full-fledged product-placement deal. “We got some free beer. We reached out to Corona, and they responded like, ‘We’ll give you product and it’s OK to use our name.’” Even as the years went on, and the impact of the Fast & Furious franchise grew exponentially, that arrangement defined the level of Corona’s involvement."}, {"bbc6": "“It’s been an honor to have Corona Extra play a part in pop culture history with the Fast and the Furious franchise over the years,” a spokesperson for the company told The Ringer in an official statement. “While we had no formal agreement with the production company, we were aware of the incorporation of Corona into several of the films.”"}, {"5bdf": "‘Fast & Furious,’ 2009 (Universal Pictures)"}, {"6bfe": "The elephant in the 1970 Chevrolet Chevelle SS is the fact that moviemaking is a business, and product placement — even really good product placement — is almost always about a capitalistic exchange, rather than world-building. Brands pay a production company to be prominently featured in a film. The exchange manifests in varying ways — from Heineken partially funding the production budget for 2015’s Spectre with a product placement deal to Oliver Stone getting a free pair of boots for showing a certain brand name in Natural Born Killers. As Cohen noted, the initial deal between The Fast and the Furious and Corona was small and rather unofficial: a few cases of free beer in exchange for an overt mention of the brand name."}, {"de39": "“They were one of the companies that was smart enough to get in with us at the ground floor,” Cohen adds. Whether the company actually foresaw the success of Fast or just didn’t see the point in denying any movie’s outright endorsement of their product, the decision to allow Corona to be featured in The Fast and the Furious has developed into a profitable one."}, {"8702": "“[Corona is] the unpaid official beer of Fast & Furious,” longtime producer Neal H. Moritz told The Bill Simmons Podcast. “I know it’s crazy. I should have a pallet of it in front of my house right now.”"}, {"5f3f": "‘Furious 7,’ 2015 (Universal Pictures)"}, {"2199": "As a managing partner at Apex Marketing Group, Eric Smallwood analyzes the value of product placement and strategic advertising for both brands and production companies. “I’m amazed at how it was used,” he says of Corona’s placement in the Fast franchise. “The verbal mentions — it’s very overt.”"}, {"ffbe": "“If you were to poll people that saw these movies — ‘What kind of brand did you see in the movie?’ — a large percentage would say Corona,” he continues. “It’s got a brand association with the franchise.”"}, {"f71f": "That might not have mattered much to Corona’s bottom line in 2001, but it has to these days, now that Fast & Furious is an international franchise whose last film made over $1.5 billion worldwide. “The more people see it, the more money the movie makes — but also, the more awareness there is for the brand,” says Smallwood. He estimates that Corona’s product-placement value from Furious 7 is a whopping $6.1 million — basically, more than it cost to buy a 30-second Super Bowl ad in 2017. In total, he estimates that the product-placement value for Corona from all of the films is about $15.3 million."}, {"18e7": "And yet, according to everyone we spoke to, Corona doesn’t even pay to be in the movies. “On all the stuff I’ve ever done, I don’t believe there ever was [a deal with Corona],” says Morgan. “The truth is we write it in there. We talk about it. It’s what it’s going to be, and not for any business reasons. It’s part of Dom’s character. It just is.”"}, {"de2f": "“I saw the original movie in the theater and I was just a fan.” Having joined the franchise in 2006, Morgan is one of the most tenured members on the Fast team, and he’s personally responsible for every Corona reference the movies have made since the original. He continues to bake them into his scripts for one primary reason: precedent. “They branded themselves [in the original],” Morgan says. “‘If you’re gonna fit in with our crew, this is what our crew does.’” When he first got to write for Dom in the fourth installment, Fast & Furious (Diesel appears in only the waning seconds of Tokyo Drift), Morgan used the mention and presence of Corona to show that while years have passed, the characters haven’t changed. He achieved the same effect, wrapping continuity into nostalgia, with a barbecue scene that closes Fast & Furious 6 — and dutifully mirrors the barbecue scene of the original Fast, beer and all."}, {"ac25": "‘Fast & Furious 6,’ 2013 (Universal Pictures)"}, {"12c1": "Cohen points out, “The sequels can get bigger. They can go to Abu Dhabi, Miami, Tokyo, wherever they want, but it all comes back to that picnic table, and that backyard with the skyline view.”"}, {"9878": "Along with continuing this sense of family, Morgan has also used Corona as a tool of self-awareness. Now eight movies into the franchise, there’s over a decade worth of history to draw from — and inside jokes to make. The scene featuring Corona in Furious 7, which might as well be a 30-second ad for the beer, even stylistically speaking, is the perfect example of that."}, {"acf7": "The Family Values of ‘Fast & Furious’As the preeminent family-friendly franchise, ‘Fast’ can teach you a thing or twotheringer.com"}, {"c2b9": "“Mr. Nobody is this mysterious guy — nobody knows who he is — so the idea was to bring Dom to the office and start layering in a little bit of trust and familiarity,” Morgan says. “And you can talk about, ‘Hey Dom, here’s what I know you did with that car,’ but I was looking for one thing to put in there to give the audience a wink. We played that for a joke, but also, this is how well this guy knows Dom. It’s just a fun, character-y moment.”"}, {"bc79": "The scene’s greatest power, however — beyond establishing Mr. Nobody’s fastidiousness, beyond acting as a punch line, beyond displaying how comfortable the underwriters must be financially, that they’d forgo such an obvious opportunity to make a product-placement deal — is the way it confirms a camaraderie between those who make the Fast movies and those who watch them. This is a franchise that builds on itself and actively celebrates its history, rewarding those who have been there from the beginning with self-aware nods and self-deprecating in-jokes. Dom’s line — “As long as it’s a Corona” — in The Fast and the Furious is so bewildering that it stands out in fans’ memories. The Corona bucket in Furious 7 is the franchise saying to the audience, “We remember it too.”"}]}