{"child": "1927_1\t1927_2\t1927_3\t1927_4\t1927_5", "title": "Jimmy Butler Is a Blue-Collar Hero", "content": "King of the Court Jimmy Butler Is a Blue-Collar Hero Our daily look at the NBA’s best players of the night punches the clock with the Bulls star and watches Jabari Parker go off Welcome to King of the Court, our daily celebration of the best performances in basketball from the night that was. We’ll be keeping track of the best player of every night of the NBA season, and tallying the results as we go along. King of the Court: Jimmy Butler There’s nothing pretty about Jimmy Butler’s game. His jumper comes and goes; his most effective move is putting his head down and bullying his way through defenders to get to the rim. He doesn’t make it look easy. He’s a very deliberate offensive player, and even when he’s knocking down jumpers off the dribble, it usually comes after pounding the ball against a set defense geared to stop him. Watching Butler is a reminder that playing professional basketball at a high level is work. These guys may be playing a game, but they are still punching a clock. In the fourth quarter of the Bulls’ 101–99 win over the Nets on Wednesday, Butler landed on Randy Foye’s foot after taking a jumper and immediately began grabbing his ankle. It was a play that made pickup basketball players everywhere cringe in sympathy. He hobbled off the court, but returned a few minutes later, telling an interviewer after the game that his ankle was “still connected to [his] body, so [he was] still trying to fight.” This game was a fight. The Bulls shot 39.8 percent from the field, while the Nets shot 43 percent. There were plenty of misses to go around, and it was a game won in scrums in the paint, with the two teams combining to grab 28 offensive rebounds. Neither squad could get much going on offense outside of its best player, with Butler (40 points) eventually outdueling Brook Lopez (33 points) to give the Bulls the victory. You can see the sweat pouring off of Butler’s stat line. While Lopez went 5-for-6 from the 3-point line and spent most of the night effortlessly knocking down his 25-foot set shot, Butler went only 1-for-2 from beyond the arc. Instead, he shot 13-for-27 from 2-point range, getting to the free throw line 11 times, and pulling down seven offensive rebounds. Few wing players outside of LeBron can physically impose their will on a game like Butler. At 6-foot-7 and 220 pounds, Butler is built like a Mack truck. He’s almost cartoonishly muscled, especially in comparison to less defined perimeter players like Brooklyn’s Bojan Bogdanovic, who had the unenviable task of matching up with him for most of the night. There are only two ways to guard Butler: spend a few years of your life in the weight room, or let him have his jumper. That was the Nets game plan, and their defenders went under the screen almost every time Butler was in the pick-and-roll. Brooklyn was content to live with what happened when he pulled up. Butler became a star when he began to make shots off the dribble, and four of his six midrange jumpers on Wednesday were unassisted. If you watch his highlights from the game, he’s scoring on the same play over and over again. The Spurs made the expression “pounding the rock” famous in the NBA, but there’s no player in the league who embodies that mentality more than Butler. If the Bulls had more 3-point shooting on their roster, they could spread the defense out and prevent opponents from building a wall in the paint to slow down their star. However, Chicago is dead last in the league in 3-point attempts and 3-pointers made, so the only driving lanes Butler sees are the ones he creates for himself. Given the amount of contact he delivers and receives on a nightly basis, it’s amazing he has yet to miss a game all season. If Butler does wind up missing time, the Bulls’ wildly inconsistent season would start to become a lot more predictable. They have a net rating of plus-3.6 with Butler on the floor this season, their best rating of anyone other than Michael Carter-Williams, who has played in only five games. When Butler isn’t in, they have a net rating of minus-10.3, more than seven points lower than any of their other players. Butler is carrying Chicago. The Bulls offense in the last few minutes against the Nets was simple: give Butler a ball screen and then get out of the way. With 2:30 remaining in the fourth quarter, this is how a run of five possessions went for the Bulls: Butler hit a pull-up 3, drew a shooting foul on Brook Lopez, found Carter-Williams cutting to the lane, missed a pull-up jumper, and then made a pull-up jumper. All that set up this isolation with the game tied at 99 with 12 seconds left, a possession that ended with the first regular-season, game-winning buzzer-beater of his career. That it took that kind of effort from Butler to beat Brooklyn says everything you need to know about the Bulls this season. He played 38 minutes on Wednesday, and has had only two games below 36 minutes in the entire month of December. Tom Thibodeau was his first coach in the NBA, and Butler seems to have absorbed the Thibs mentality. He’s a blue-collar star, and putting in that type of work on a nightly basis takes a toll on your body. Enjoy him while you can. Runner-up: Jabari Parker With Giannis Antetokounmpo putting up absurd stat lines and even more absurd highlights on a nightly basis, it’s easy to forget that Jabari Parker was the Bucks player who was originally destined for stardom. Parker has quietly become a deadly scorer in his third season in the league, averaging 20.3 points a game on 49.5 percent shooting, and he had one of his best all-around games of the season on Wednesday, with 31 points, 9 rebounds, and 7 assists on 13-for-18 shooting in a clinical 119–94 dissection of the Pistons. Jabari went 4-for-7 from 3, with most of those shots coming off wide-open looks, including two assists from Giannis. There’s almost no way to guard Parker when he’s making that shot, as he’s at his best when he can take defenders off the dribble. He was operating at peak efficiency on Wednesday, getting to the basket in one or two dribbles and pulling up whenever he sensed the defender was too far off him. The Pistons have been starting Jon Leuer at power forward in an effort to balance their rotation and get more shooting in their lineup, and he had about as much chance of guarding Jabari as a guy off the street. The three big numbers to watch with Jabari this season are his 3-point percentage, his free throw rate, and his assist-to-turnover ratio. He’s never going to be a great defensive player, so he needs to be as versatile on the offensive end of the floor as possible. If he’s being efficient while still moving the ball, the Bucks are going to be hard to beat. He shot 72.2 percent against the Pistons and had seven assists and just one turnover, and it’s not a coincidence the Bucks were a team-high plus-27 when he was on the floor. We already know how good Giannis is going to be. The question for the Bucks is how good a second option Jabari can become. ", "name": "1927", "parent": "", "sentences": [{"f63f": "King of the Court"}, {"9cfe": "Jimmy Butler Is a Blue-Collar Hero"}, {"8f6c": "Our daily look at the NBA’s best players of the night punches the clock with the Bulls star and watches Jabari Parker go off"}, {"0744": "Welcome to King of the Court, our daily celebration of the best performances in basketball from the night that was. We’ll be keeping track of the best player of every night of the NBA season, and tallying the results as we go along."}, {"6f03": "King of the Court: Jimmy Butler"}, {"4320": "There’s nothing pretty about Jimmy Butler’s game. His jumper comes and goes; his most effective move is putting his head down and bullying his way through defenders to get to the rim. He doesn’t make it look easy. He’s a very deliberate offensive player, and even when he’s knocking down jumpers off the dribble, it usually comes after pounding the ball against a set defense geared to stop him. Watching Butler is a reminder that playing professional basketball at a high level is work. These guys may be playing a game, but they are still punching a clock."}, {"2ea3": "In the fourth quarter of the Bulls’ 101–99 win over the Nets on Wednesday, Butler landed on Randy Foye’s foot after taking a jumper and immediately began grabbing his ankle. It was a play that made pickup basketball players everywhere cringe in sympathy. He hobbled off the court, but returned a few minutes later, telling an interviewer after the game that his ankle was “still connected to [his] body, so [he was] still trying to fight.”"}, {"1be2": "This game was a fight. The Bulls shot 39.8 percent from the field, while the Nets shot 43 percent. There were plenty of misses to go around, and it was a game won in scrums in the paint, with the two teams combining to grab 28 offensive rebounds. Neither squad could get much going on offense outside of its best player, with Butler (40 points) eventually outdueling Brook Lopez (33 points) to give the Bulls the victory."}, {"af98": "You can see the sweat pouring off of Butler’s stat line. While Lopez went 5-for-6 from the 3-point line and spent most of the night effortlessly knocking down his 25-foot set shot, Butler went only 1-for-2 from beyond the arc. Instead, he shot 13-for-27 from 2-point range, getting to the free throw line 11 times, and pulling down seven offensive rebounds. Few wing players outside of LeBron can physically impose their will on a game like Butler."}, {"6473": "At 6-foot-7 and 220 pounds, Butler is built like a Mack truck. He’s almost cartoonishly muscled, especially in comparison to less defined perimeter players like Brooklyn’s Bojan Bogdanovic, who had the unenviable task of matching up with him for most of the night. There are only two ways to guard Butler: spend a few years of your life in the weight room, or let him have his jumper."}, {"b33c": "That was the Nets game plan, and their defenders went under the screen almost every time Butler was in the pick-and-roll. Brooklyn was content to live with what happened when he pulled up. Butler became a star when he began to make shots off the dribble, and four of his six midrange jumpers on Wednesday were unassisted. If you watch his highlights from the game, he’s scoring on the same play over and over again. The Spurs made the expression “pounding the rock” famous in the NBA, but there’s no player in the league who embodies that mentality more than Butler."}, {"c1bd": "If the Bulls had more 3-point shooting on their roster, they could spread the defense out and prevent opponents from building a wall in the paint to slow down their star. However, Chicago is dead last in the league in 3-point attempts and 3-pointers made, so the only driving lanes Butler sees are the ones he creates for himself. Given the amount of contact he delivers and receives on a nightly basis, it’s amazing he has yet to miss a game all season."}, {"f25e": "If Butler does wind up missing time, the Bulls’ wildly inconsistent season would start to become a lot more predictable. They have a net rating of plus-3.6 with Butler on the floor this season, their best rating of anyone other than Michael Carter-Williams, who has played in only five games. When Butler isn’t in, they have a net rating of minus-10.3, more than seven points lower than any of their other players. Butler is carrying Chicago."}, {"baa4": "The Bulls offense in the last few minutes against the Nets was simple: give Butler a ball screen and then get out of the way. With 2:30 remaining in the fourth quarter, this is how a run of five possessions went for the Bulls: Butler hit a pull-up 3, drew a shooting foul on Brook Lopez, found Carter-Williams cutting to the lane, missed a pull-up jumper, and then made a pull-up jumper. All that set up this isolation with the game tied at 99 with 12 seconds left, a possession that ended with the first regular-season, game-winning buzzer-beater of his career."}, {"5a1b": "That it took that kind of effort from Butler to beat Brooklyn says everything you need to know about the Bulls this season. He played 38 minutes on Wednesday, and has had only two games below 36 minutes in the entire month of December. Tom Thibodeau was his first coach in the NBA, and Butler seems to have absorbed the Thibs mentality. He’s a blue-collar star, and putting in that type of work on a nightly basis takes a toll on your body. Enjoy him while you can."}, {"4a55": "Runner-up: Jabari Parker"}, {"d834": "With Giannis Antetokounmpo putting up absurd stat lines and even more absurd highlights on a nightly basis, it’s easy to forget that Jabari Parker was the Bucks player who was originally destined for stardom. Parker has quietly become a deadly scorer in his third season in the league, averaging 20.3 points a game on 49.5 percent shooting, and he had one of his best all-around games of the season on Wednesday, with 31 points, 9 rebounds, and 7 assists on 13-for-18 shooting in a clinical 119–94 dissection of the Pistons."}, {"e2a6": "Jabari went 4-for-7 from 3, with most of those shots coming off wide-open looks, including two assists from Giannis. There’s almost no way to guard Parker when he’s making that shot, as he’s at his best when he can take defenders off the dribble. He was operating at peak efficiency on Wednesday, getting to the basket in one or two dribbles and pulling up whenever he sensed the defender was too far off him. The Pistons have been starting Jon Leuer at power forward in an effort to balance their rotation and get more shooting in their lineup, and he had about as much chance of guarding Jabari as a guy off the street."}, {"f481": "The three big numbers to watch with Jabari this season are his 3-point percentage, his free throw rate, and his assist-to-turnover ratio. He’s never going to be a great defensive player, so he needs to be as versatile on the offensive end of the floor as possible. If he’s being efficient while still moving the ball, the Bucks are going to be hard to beat. He shot 72.2 percent against the Pistons and had seven assists and just one turnover, and it’s not a coincidence the Bucks were a team-high plus-27 when he was on the floor. We already know how good Giannis is going to be. The question for the Bucks is how good a second option Jabari can become."}]}