{"child": "1945_1", "title": "An update on Alaska’s McHugh Creek Wild Fire", "content": "An update on Alaska’s McHugh Creek Wild Fire As of today, July 22nd, 2016 the McHugh Creek fire, just south of Anchorage, Alaska is 842 acres burned. As of 11am today, the fire is only 7% contained since it’s start last Saturday. Photo via| KTUU.com Alaska’s “hot shot” fire crews who are specifically trained to handle wild fires on tricky slopes like this are finally able to create a boundary line. The McHugh creek fire is literally burning it’s way up a cliff side mountain, and on the other side of the ridge… is a neighborhood. The neighborhood is referred to as “the hillside,” know for the biggest houses that cost the most money. High end multi story homes with multi car garages and some of the most perfect views in the State. This photo, from Alaska.org is a view from Potter’s Marsh looking upwards to the Hillside neighborhood in threat of the McHugh Creek fire. This is what the Hillside looks like on a nice day. The homes going up to the ridge can go anywhere from $500,000 to a couple Million. Photo Via| KTUU.com This is a view from the Seward Highway of the entrance to the McHugh creek trail head, a short 10 minute drive from Anchorage. In the last day and a half the Anchorage bowl and Turnagain inlet has finally seen some rain. It’s just a drizzle, but it’s better than the wind blowing the flames up the ridge threatening the homes just outside of it’s reach. It’s a neighborhood that at the base of it… is my mother’s home. I sit in wait, hoping that I don’t need to run up the hillside and pack my truck full of precious belongings and our three family dogs. The grace of rain is helping the Alaska hot shot crew as well as the Tahoe crew that has flown up from the states to offer help, but with the rain, the ground softens and gives way to rock slides and unstable ground on the steep cliff side. This was our view from the McHugh Creek Trail head just this past April. This is one of the many well kept trail heads up and down the Seward high way, complete with bathrooms, tables, bbq stands and quite the view. It will never be the same. The massive trees that line the pathway hide the beautiful waterfall that feeds McHugh Creek. The steep terrain brings much joy to the many thousands of hikers in the state, it’s a great view for travelers to take a break from the winding highway. This area will not be the same, not for a very long time. On national television this morning, reports of intense heat around the country catches my attention. This 2016 year has broken at least 15 record high temperatures in Alaska since January. Anchorage had no measurable snow this past winter. It was 45 degrees in Juneau, Alaska in January. This weather is not normal. Up north where the big oil rigs are, Kaparuk, Alaska hit a scorching 84 degrees last week. This week, not far from Kaparuk, Anaktuvuk Pass is expected to see snow. As rain continues to fall here in Anchorage, Alaska, all I can do is hope that the wild fire crews are able to contain the fire. As of right now, we are on high alert. Air quality concerns are on high alert. The only plus side is that everything smells like camp fire. The silver lining once the fire is out is that there will be good berry picking next year in the burned areas. Cranberries grow well in burned tundra, and cranberries are good. Soon, I expect to see an increase of black bears on the populated side of the ridge, as they try to escape the fire and smoke. Moose will also make their way closer to town. The mountain goats will go deeper in the mountain range on the far side of the ridge. The Seward highway is closed to traffic, the fire is just about the road. Photo Via| KTUU.com Stay tuned for more updates. If you’d like to see live stream footage and more visit KTUU.com. ", "name": "1945", "parent": "", "sentences": [{"6214": "An update on Alaska’s McHugh Creek Wild Fire"}, {"7712": "As of today, July 22nd, 2016 the McHugh Creek fire, just south of Anchorage, Alaska is 842 acres burned."}, {"7492": "As of 11am today, the fire is only 7% contained since it’s start last Saturday."}, {"e722": "Photo via| KTUU.com"}, {"d810": "Alaska’s “hot shot” fire crews who are specifically trained to handle wild fires on tricky slopes like this are finally able to create a boundary line. The McHugh creek fire is literally burning it’s way up a cliff side mountain, and on the other side of the ridge… is a neighborhood."}, {"320b": "The neighborhood is referred to as “the hillside,” know for the biggest houses that cost the most money. High end multi story homes with multi car garages and some of the most perfect views in the State."}, {"eeaa": "This photo, from Alaska.org is a view from Potter’s Marsh looking upwards to the Hillside neighborhood in threat of the McHugh Creek fire. This is what the Hillside looks like on a nice day. The homes going up to the ridge can go anywhere from $500,000 to a couple Million."}, {"71d4": "Photo Via| KTUU.com"}, {"5622": "This is a view from the Seward Highway of the entrance to the McHugh creek trail head, a short 10 minute drive from Anchorage. In the last day and a half the Anchorage bowl and Turnagain inlet has finally seen some rain. It’s just a drizzle, but it’s better than the wind blowing the flames up the ridge threatening the homes just outside of it’s reach. It’s a neighborhood that at the base of it… is my mother’s home. I sit in wait, hoping that I don’t need to run up the hillside and pack my truck full of precious belongings and our three family dogs."}, {"e863": "The grace of rain is helping the Alaska hot shot crew as well as the Tahoe crew that has flown up from the states to offer help, but with the rain, the ground softens and gives way to rock slides and unstable ground on the steep cliff side."}, {"0509": "This was our view from the McHugh Creek Trail head just this past April. This is one of the many well kept trail heads up and down the Seward high way, complete with bathrooms, tables, bbq stands and quite the view. It will never be the same."}, {"f418": "The massive trees that line the pathway hide the beautiful waterfall that feeds McHugh Creek. The steep terrain brings much joy to the many thousands of hikers in the state, it’s a great view for travelers to take a break from the winding highway. This area will not be the same, not for a very long time."}, {"b758": "On national television this morning, reports of intense heat around the country catches my attention."}, {"4865": "This 2016 year has broken at least 15 record high temperatures in Alaska since January."}, {"e53b": "Anchorage had no measurable snow this past winter. It was 45 degrees in Juneau, Alaska in January."}, {"d692": "This weather is not normal."}, {"50ae": "Up north where the big oil rigs are, Kaparuk, Alaska hit a scorching 84 degrees last week. This week, not far from Kaparuk, Anaktuvuk Pass is expected to see snow."}, {"e0ed": "As rain continues to fall here in Anchorage, Alaska, all I can do is hope that the wild fire crews are able to contain the fire. As of right now, we are on high alert. Air quality concerns are on high alert."}, {"96ec": "The only plus side is that everything smells like camp fire. The silver lining once the fire is out is that there will be good berry picking next year in the burned areas. Cranberries grow well in burned tundra, and cranberries are good."}, {"4809": "Soon, I expect to see an increase of black bears on the populated side of the ridge, as they try to escape the fire and smoke. Moose will also make their way closer to town. The mountain goats will go deeper in the mountain range on the far side of the ridge. The Seward highway is closed to traffic, the fire is just about the road."}, {"4d8d": "Photo Via| KTUU.com"}, {"d419": "Stay tuned for more updates. If you’d like to see live stream footage and more visit KTUU.com."}]}