{"child": "1947_1\t1947_2\t1947_31947_1\t1947_2\t1947_31947_1\t1947_2\t1947_31947_1\t1947_2\t1947_3", "title": "What I’ve learned while writing my 1st book — part II", "content": "What I’ve learned while writing my 1st book — part II Oh, this isn’t supposed to be easy? Got it. I’m leaning once and done. This book writing thing is way overrated. I am having trouble sleeping and having trouble staying awake. My family has had enough and I don’t blame them. I identify myself as a writer and a book felt like the next logical progression. That progression isn’t progressing as planned. Beyond that, this has been a blast. The easy part was crafting the first draft of the book. Ideas coalesced with ease, words flowed and my concentration level was on point. I must be one of the gifted few who can write without the requisite suffering. Once the first draft was done, I cockily started sharing my “success” on social media. There were a lot of “coming soon” purposely vague messages to generate interest. “This book should be out any day now fans, brace yourself for the fireworks that will be the release”. I’m now on version 1.29 and my confidence level is at 23% and trending down. I’ve gone dark on social media and the marketing department has been informed that they need to shut down their operations for the foreseeable future. The editing process has been eye opening. I am self publishing this book and doing all that I can to keep the spending to a bare minimum. My editor is my wife and she has been honest with me in all the best ways. I trust her implicitly and while I’ve put up a fight on some of her suggested changes, deep down I know that she is right 99.8% of the time. As I approach, fingers crossed, the final edit, here is what I’ve learned over the past few weeks, post first-draft completion: My insecurity level (as writer) is at an all time high. The first sentence my wife (editor) read back to me, as she attempted to understand its purpose, was a true eye opener. The sentence managed to be embarrassingly pretentious. Not to mention horrifically constructed and factually inaccurate all at the same time. Is it possible I didn’t actually write it? Shit, I’m not very good at this. I’ve found the more I attempt to write in a specific style, the more cringe-worthy it becomes. My book is about gardening and plants and I like to think I bring a great combo of high brow and low brow writing to the table. When it occurs naturally, it can be magical. When I force it, it feels well, forced and inauthentic. That first sentence we reviewed was a wake-up call. As I have edited sentences and swapped out words along the way, I’ve made the mistake of not reading the entire passage in order to evaluate the flow. That leads to some choppy story. I’ve been way too over anxious to get the book done and that has ended up slowing things down even more. Lesson learned: that first edit needs to be done slowly and methodically or subsequent edits become more and more difficult. My insecurity level (book idea) is at an all time high. I loved the premise of this book. I’ve lived it for almost two decades. That was the constant from the beginning. The difficult part was how to construct a book around that central idea. Now that the construct of the book is done, I’m doubting the original premise. Have I supported the premise properly? Has the story turned in a way that has now forced me into a different premise? What I battle now is believing that my central idea has to be the greatest idea of all time and one that no one has ever dared to tackle before. I’m worried that if this concept isn’t 100% flawless, I shouldn’t attempt it at all. Mess this up and a 2nd book isn’t an option. Never mind the fact that I’m publishing it myself and only have to answer to me. I so have to lighten up. I find myself enjoying reading more than ever. I’m appreciating a beautifully put together sentence more than ever before. I am so tired of my own writing style that everyone else’s seems to be the best I’ve ever read. I’m jealous of the flawlessly flowing passage. I’m jealous of the simple heartfelt sentence. I’m jealous of any writing that evokes strong emotion. I’m so close to my own word style and have poured over the same sentences for week’s now that I honestly have no idea if they are great or awful. I assume every writer goes through this and can only hope I come out better for it on the other side. Eliminating chapters has been difficult. When my first draft was complete, it was 188 pages. This is on 8.5 x 11 paper and in color because there are over 300 photographs included in the book. I have no choice, it is about plants and the photos are what ultimately tell the story. Add it all up and the minimum I could charge for the book was $32.00 and that included $0 royalty through Amazon. How funny is that? Back to the drawing board. After some number crunching and market evaluation, I determined that I had to get the page total down to 90 or so pages. That meant eliminating half of the f’n book. All that work, time and effort would be gone in a flash. Everything I write is brilliant, the world needs to see it all. After a good cry, I got the latest version of the book down to 94 pages. And wouldn’t you know it, it is much tighter, much more supportive of the central thesis and manageable financially. And if I achieve any level of success with this one, Volume 2 is right around the corner and I’m already off to a great head start. Book writing is very different from blog writing. My blog is 7+ years old. I’ve written over 1,100 posts. They’ve all centered around what this book is ultimately about: the beauty of our gardens beyond flowers. The posts are all very of the moment. I like to include what is going on in my life and relating that to my garden. Looking back on old posts can be difficult, they do not always stand the test of time. A book is another animal all together. It needs to stand on its own. It needs to be evergreen. While I am including a lot of personal anecdotes, I have to be very careful to not allow it to become too “of the day” or too inside or even too me. The Writing Cooperative is a community of people helping each other write better. Become a member to join our Slack team, get fresh eyes on your writing, and participate in the 52-Week Writing Challenge! ", "name": "1947", "parent": "", "sentences": [{"3463": "What I’ve learned while writing my 1st book — part II"}, {"003e": "Oh, this isn’t supposed to be easy? Got it."}, {"9db8": "I’m leaning once and done. This book writing thing is way overrated. I am having trouble sleeping and having trouble staying awake. My family has had enough and I don’t blame them. I identify myself as a writer and a book felt like the next logical progression."}, {"50bc": "That progression isn’t progressing as planned."}, {"e0e7": "Beyond that, this has been a blast."}, {"b326": "The easy part was crafting the first draft of the book. Ideas coalesced with ease, words flowed and my concentration level was on point. I must be one of the gifted few who can write without the requisite suffering."}, {"0393": "Once the first draft was done, I cockily started sharing my “success” on social media. There were a lot of “coming soon” purposely vague messages to generate interest."}, {"2002": "“This book should be out any day now fans, brace yourself for the fireworks that will be the release”."}, {"638c": "I’m now on version 1.29 and my confidence level is at 23% and trending down. I’ve gone dark on social media and the marketing department has been informed that they need to shut down their operations for the foreseeable future."}, {"395a": "The editing process has been eye opening. I am self publishing this book and doing all that I can to keep the spending to a bare minimum. My editor is my wife and she has been honest with me in all the best ways. I trust her implicitly and while I’ve put up a fight on some of her suggested changes, deep down I know that she is right 99.8% of the time."}, {"04bd": "As I approach, fingers crossed, the final edit, here is what I’ve learned over the past few weeks, post first-draft completion:"}, {"1733": "My insecurity level (as writer) is at an all time high."}, {"a191": "The first sentence my wife (editor) read back to me, as she attempted to understand its purpose, was a true eye opener. The sentence managed to be embarrassingly pretentious."}, {"2cc4": "Not to mention horrifically constructed and factually inaccurate all at the same time. Is it possible I didn’t actually write it?"}, {"50d6": "Shit, I’m not very good at this."}, {"d655": "I’ve found the more I attempt to write in a specific style, the more cringe-worthy it becomes. My book is about gardening and plants and I like to think I bring a great combo of high brow and low brow writing to the table. When it occurs naturally, it can be magical. When I force it, it feels well, forced and inauthentic."}, {"57f5": "That first sentence we reviewed was a wake-up call."}, {"88a5": "As I have edited sentences and swapped out words along the way, I’ve made the mistake of not reading the entire passage in order to evaluate the flow. That leads to some choppy story. I’ve been way too over anxious to get the book done and that has ended up slowing things down even more."}, {"62c5": "Lesson learned: that first edit needs to be done slowly and methodically or subsequent edits become more and more difficult."}, {"7a78": "My insecurity level (book idea) is at an all time high."}, {"ef4b": "I loved the premise of this book. I’ve lived it for almost two decades. That was the constant from the beginning. The difficult part was how to construct a book around that central idea."}, {"fd15": "Now that the construct of the book is done, I’m doubting the original premise. Have I supported the premise properly? Has the story turned in a way that has now forced me into a different premise?"}, {"29c9": "What I battle now is believing that my central idea has to be the greatest idea of all time and one that no one has ever dared to tackle before. I’m worried that if this concept isn’t 100% flawless, I shouldn’t attempt it at all. Mess this up and a 2nd book isn’t an option."}, {"08e8": "Never mind the fact that I’m publishing it myself and only have to answer to me."}, {"f0b3": "I so have to lighten up."}, {"d0a9": "I find myself enjoying reading more than ever."}, {"9581": "I’m appreciating a beautifully put together sentence more than ever before. I am so tired of my own writing style that everyone else’s seems to be the best I’ve ever read."}, {"08d5": "I’m jealous of the flawlessly flowing passage."}, {"18e2": "I’m jealous of the simple heartfelt sentence."}, {"b0cd": "I’m jealous of any writing that evokes strong emotion."}, {"083f": "I’m so close to my own word style and have poured over the same sentences for week’s now that I honestly have no idea if they are great or awful."}, {"adc2": "I assume every writer goes through this and can only hope I come out better for it on the other side."}, {"bc31": "Eliminating chapters has been difficult."}, {"9410": "When my first draft was complete, it was 188 pages. This is on 8.5 x 11 paper and in color because there are over 300 photographs included in the book. I have no choice, it is about plants and the photos are what ultimately tell the story."}, {"f460": "Add it all up and the minimum I could charge for the book was $32.00 and that included $0 royalty through Amazon. How funny is that?"}, {"607a": "Back to the drawing board."}, {"53db": "After some number crunching and market evaluation, I determined that I had to get the page total down to 90 or so pages. That meant eliminating half of the f’n book. All that work, time and effort would be gone in a flash."}, {"5d8c": "Everything I write is brilliant, the world needs to see it all."}, {"b2eb": "After a good cry, I got the latest version of the book down to 94 pages."}, {"5527": "And wouldn’t you know it, it is much tighter, much more supportive of the central thesis and manageable financially."}, {"c7b9": "And if I achieve any level of success with this one, Volume 2 is right around the corner and I’m already off to a great head start."}, {"3d7e": "Book writing is very different from blog writing."}, {"2bbb": "My blog is 7+ years old. I’ve written over 1,100 posts. They’ve all centered around what this book is ultimately about: the beauty of our gardens beyond flowers."}, {"19b4": "The posts are all very of the moment. I like to include what is going on in my life and relating that to my garden. Looking back on old posts can be difficult, they do not always stand the test of time."}, {"a533": "A book is another animal all together. It needs to stand on its own. It needs to be evergreen. While I am including a lot of personal anecdotes, I have to be very careful to not allow it to become too “of the day” or too inside or even too me."}, {"08da": "The Writing Cooperative is a community of people helping each other write better. Become a member to join our Slack team, get fresh eyes on your writing, and participate in the 52-Week Writing Challenge!"}]}