{"child": "1951_11951_1", "title": "Stop Researching & Get Writing!", "content": "Stop Researching & Get Writing! How do you know when enough is enough? Researching can be fun. No, seriously. If you’re writing about a new topic for a blog post or an interesting subject for a work of fiction, it’s the details that help your writing ring true. Some experts say you can’t do too much research if you want your prose to be believable. There is a point, however, that research becomes a way to procrastinate the actual writing itself. There’s too much information out there Let’s say you’re writing a blog post about artificial intelligence and its impact on current manufacturers. This requires detailed research to understand how AI works and how it’s disrupting the manufacturing process. And there’s plenty out there on the internet. But let’s say you’re writing a story about a crime scene in the 1920s. You certainly need to grasp a general overview of the 1920’s culture and crime scenes to get the details right, but you could spend days, weeks, months going from print books to online sites, cruising from one resource to the next. There’s always that next link that sounds so interesting, and we continue to click away. Where do you stop? Researching best practices There is a difference in research methods depending on what you’re writing. For blog posts, you need to get the research done before you begin writing. A good rule of thumb is to plan on one-half to two-thirds of your time spent on research and the other portion on drafting, editing, and polishing your work. For fiction, however, you can actually start with general knowledge about your subject matter and jump right into writing. Let’s take that crime scene in the 1920s again. Say your protagonist is a flapper who stumbles across a dead body. Since your character is not a detective, you don’t need to understand procedural detail. You can start writing the scene until you get to a point where you need to know a detail. For example, you might need to know what a flapper would call a policeman in the 1920s. Simply note the old journalistic designation “tk” (shorthand for “to come”) at that point in your manuscript and keep writing. Nothing should stop the flow of your creative writing. You can research the details later. When not to research Most of us can’t write like Patricia Cornwell. She writes about Dr. Kay Scarpetta, a medical examiner, in such intimate detail because her day job was in the Office of the Chief Medical Examiner of Virginia. She had first-hand knowledge of how a postmortem is conducted. It would take me years of research and study to write like Patricia Cornwell because I don’t have even a general idea of how a medical examiner operates. While it’s fun to learn new things to write about, there is a tipping point when it would take entirely too much time and effort to become knowledgeable. There is a grain of truth to the maxim “write what you know.” Let’s re-frame that thought to “write what you know and spot-research the details.” An interesting concept I came across an article on Paper Raven Books’ website by Morgan Gist MacDonald: “5 Signs You’re Doing Too Much Research”. MacDonald proposes that you keep a research diary for your work in progress. The premise is that you carefully determine how much research you need to gain general knowledge, and you don’t go over that estimate. Then at the end of your research period, you write in your research diary your own individual take on the research, what you learned, and how you feel about it. MacDonald predicts that if you keep a research diary, you will reap three enormous benefits: Conclusion If you lose yourself in research only to realize you’ve just spent hours chasing links down rabbit holes, you may be researching too much. Carefully consider what your project is and how much you really need to know beforehand. Use “tk” to help you track places where you need to spot research to fill in details. Your writing time is precious. Make sure you enhance it by writing more. This works for both fiction writers and content creators. Fiction writers need to get the book down on paper; then you can fill in details. Content creators need to balance quality of writing (researching) with quantity (more articles mean more money). How much detail do you need before you get started? Let us know in the comments below. We’re always interested in how writers work. Maybe we can learn something new from your research methods. Do you believe the world needs more good writing? Hit that ♥ button below to spread it around even more. Read this next: Are You Ready to Draft Your Plot? Originally published at prowritingaid.com. ", "name": "1951", "parent": "", "sentences": [{"7049": "Stop Researching & Get Writing!"}, {"cc0d": "How do you know when enough is enough?"}, {"db59": "Researching can be fun. No, seriously. If you’re writing about a new topic for a blog post or an interesting subject for a work of fiction, it’s the details that help your writing ring true."}, {"6266": "Some experts say you can’t do too much research if you want your prose to be believable. There is a point, however, that research becomes a way to procrastinate the actual writing itself."}, {"e010": "There’s too much information out there"}, {"c9a3": "Let’s say you’re writing a blog post about artificial intelligence and its impact on current manufacturers. This requires detailed research to understand how AI works and how it’s disrupting the manufacturing process. And there’s plenty out there on the internet."}, {"976d": "But let’s say you’re writing a story about a crime scene in the 1920s. You certainly need to grasp a general overview of the 1920’s culture and crime scenes to get the details right, but you could spend days, weeks, months going from print books to online sites, cruising from one resource to the next. There’s always that next link that sounds so interesting, and we continue to click away. Where do you stop?"}, {"3e94": "Researching best practices"}, {"f8f3": "There is a difference in research methods depending on what you’re writing. For blog posts, you need to get the research done before you begin writing. A good rule of thumb is to plan on one-half to two-thirds of your time spent on research and the other portion on drafting, editing, and polishing your work."}, {"d475": "For fiction, however, you can actually start with general knowledge about your subject matter and jump right into writing."}, {"9229": "Let’s take that crime scene in the 1920s again. Say your protagonist is a flapper who stumbles across a dead body. Since your character is not a detective, you don’t need to understand procedural detail. You can start writing the scene until you get to a point where you need to know a detail. For example, you might need to know what a flapper would call a policeman in the 1920s. Simply note the old journalistic designation “tk” (shorthand for “to come”) at that point in your manuscript and keep writing."}, {"83bd": "Nothing should stop the flow of your creative writing. You can research the details later."}, {"cc46": "When not to research"}, {"7dbb": "Most of us can’t write like Patricia Cornwell. She writes about Dr. Kay Scarpetta, a medical examiner, in such intimate detail because her day job was in the Office of the Chief Medical Examiner of Virginia. She had first-hand knowledge of how a postmortem is conducted."}, {"33b9": "It would take me years of research and study to write like Patricia Cornwell because I don’t have even a general idea of how a medical examiner operates."}, {"2317": "While it’s fun to learn new things to write about, there is a tipping point when it would take entirely too much time and effort to become knowledgeable. There is a grain of truth to the maxim “write what you know.”"}, {"3629": "Let’s re-frame that thought to “write what you know and spot-research the details.”"}, {"1c52": "An interesting concept"}, {"9ea5": "I came across an article on Paper Raven Books’ website by Morgan Gist MacDonald: “5 Signs You’re Doing Too Much Research”. MacDonald proposes that you keep a research diary for your work in progress. The premise is that you carefully determine how much research you need to gain general knowledge, and you don’t go over that estimate. Then at the end of your research period, you write in your research diary your own individual take on the research, what you learned, and how you feel about it."}, {"2050": "MacDonald predicts that if you keep a research diary, you will reap three enormous benefits:"}, {"aac4": "Conclusion"}, {"3b26": "If you lose yourself in research only to realize you’ve just spent hours chasing links down rabbit holes, you may be researching too much. Carefully consider what your project is and how much you really need to know beforehand. Use “tk” to help you track places where you need to spot research to fill in details."}, {"585e": "Your writing time is precious. Make sure you enhance it by writing more. This works for both fiction writers and content creators. Fiction writers need to get the book down on paper; then you can fill in details. Content creators need to balance quality of writing (researching) with quantity (more articles mean more money)."}, {"9375": "How much detail do you need before you get started? Let us know in the comments below. We’re always interested in how writers work. Maybe we can learn something new from your research methods."}, {"49fd": "Do you believe the world needs more good writing? Hit that ♥ button below to spread it around even more."}, {"143c": "Read this next: Are You Ready to Draft Your Plot?"}, {"3a7c": "Originally published at prowritingaid.com."}]}