{"child": "1952_1\t1952_2\t1952_3\t1952_41952_1\t1952_2\t1952_3\t1952_4", "title": "A trace of life: A memoir about values and success", "content": "A trace of life: A memoir about values and success (Image: Chris Osmond, via Unsplash)) When my friend Katie told me that she knew somebody who needed help with her memoir, I had no idea this was going to change the course of my career. She introduced me to Celia Tejada, a Spaniard who had made a name for herself in the U.S. as a fashion and interior designer. She’s now the CCO of Restoration Hardware. Celia had been working on her memoir for over a year, with the help of several friends. The foundation of her story had been written. She had also created a beautiful design with the help of a talented young woman, Yara Pisani. But the narrative needed work. Her story intrigued me. She had grown in a tiny village in the north of Spain helping her father and brothers milk cows and pick potatoes. She came to the U.S. as a 19 year-old, following her love, with $350 in her pocket. Here she built a smashing career by sheer will, talent, and hard work. Throughout her journey, her values and her love of family, home and friendship provided the North Star that kept her grounded. As I read, dozens of questions popped up. How did a little girl from such a humble origin fall in love with art and design? What did it mean that her mother “always had an eye for beauty”? In which sense was her father a “man of the world”, while living in this remote and rural valley? What made her so fearless as a young woman? How did she translate her personal values into her leadership style? Why did she hate feelings of guilt and how did she overcome them? What was the next step in her life and her career? We got to work. We were supposed to add 10 to 15 pages. We ended up doubling the book. Her story deserved to be told in all its depth. We worked on it for several months, first in English, and then in Spanish. This last summer, she invited me to her hometown, Ruerrero, to be present when she gave the Spanish version of the book to her brothers. It was a very moving moment. Here I am with Celia when she gifted her memoir to her family. I loved this project: the intimacy created when Celia talked about the most significant moments and people in her life; adding color and depth to the narrative, while respecting her voice and her vision; witnessing the emotional moment when she gifted this loving keepsake to her family. This experience convinced me that helping other people voice their stories would be a worthy endeavor, which would also make me happy. I was so fortunate that Celia was my first client in this new venture. Her strength, bravery and integrity have been an inspiration. When I feel down I often go back in my mind to some passage in the book that lifted my spirit. She reminds me the way to move forward, pushing through my fear and committing to my values. I know that every person has a unique story and many life lessons to share with the world. As I work on my own memoir, I look forward to helping others voice theirs, so they can leave a tangible trace of their journey for generations to come. See a sample of this beautiful memoir. Find out more about Vida Now. READ NEXT: The naked truth in memoir: Two approaches to facing your fear. Originally published at vidanow.net on February 14, 2017. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1952", "parent": "", "sentences": [{"14f6": "A trace of life: A memoir about values and success"}, {"30b0": "(Image: Chris Osmond, via Unsplash))"}, {"3dde": "When my friend Katie told me that she knew somebody who needed help with her memoir, I had no idea this was going to change the course of my career."}, {"768f": "She introduced me to Celia Tejada, a Spaniard who had made a name for herself in the U.S. as a fashion and interior designer. She’s now the CCO of Restoration Hardware."}, {"908c": "Celia had been working on her memoir for over a year, with the help of several friends. The foundation of her story had been written. She had also created a beautiful design with the help of a talented young woman, Yara Pisani. But the narrative needed work."}, {"7782": "Her story intrigued me. She had grown in a tiny village in the north of Spain helping her father and brothers milk cows and pick potatoes. She came to the U.S. as a 19 year-old, following her love, with $350 in her pocket. Here she built a smashing career by sheer will, talent, and hard work. Throughout her journey, her values and her love of family, home and friendship provided the North Star that kept her grounded."}, {"bae4": "As I read, dozens of questions popped up. How did a little girl from such a humble origin fall in love with art and design? What did it mean that her mother “always had an eye for beauty”? In which sense was her father a “man of the world”, while living in this remote and rural valley? What made her so fearless as a young woman? How did she translate her personal values into her leadership style? Why did she hate feelings of guilt and how did she overcome them? What was the next step in her life and her career?"}, {"f7f6": "We got to work. We were supposed to add 10 to 15 pages. We ended up doubling the book. Her story deserved to be told in all its depth. We worked on it for several months, first in English, and then in Spanish."}, {"2db3": "This last summer, she invited me to her hometown, Ruerrero, to be present when she gave the Spanish version of the book to her brothers. It was a very moving moment."}, {"f7f0": "Here I am with Celia when she gifted her memoir to her family."}, {"a9e4": "I loved this project: the intimacy created when Celia talked about the most significant moments and people in her life; adding color and depth to the narrative, while respecting her voice and her vision; witnessing the emotional moment when she gifted this loving keepsake to her family."}, {"fd40": "This experience convinced me that helping other people voice their stories would be a worthy endeavor, which would also make me happy."}, {"8b2b": "I was so fortunate that Celia was my first client in this new venture. Her strength, bravery and integrity have been an inspiration. When I feel down I often go back in my mind to some passage in the book that lifted my spirit. She reminds me the way to move forward, pushing through my fear and committing to my values."}, {"9e52": "I know that every person has a unique story and many life lessons to share with the world. As I work on my own memoir, I look forward to helping others voice theirs, so they can leave a tangible trace of their journey for generations to come."}, {"da98": "See a sample of this beautiful memoir."}, {"f82a": "Find out more about Vida Now."}, {"3678": "READ NEXT: The naked truth in memoir: Two approaches to facing your fear."}, {"1858": "Originally published at vidanow.net on February 14, 2017."}, {"74f1": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}