{"child": "1955_1\t1955_2\t1955_3\t1955_4\t1955_5\t1955_6\t1955_7\t1955_8\t1955_9\t1955_10\t1955_11\t1955_12\t1955_13\t1955_14\t1955_15\t1955_16\t1955_17\t1955_18\t1955_19\t1955_20\t1955_21\t1955_22\t1955_23\t1955_24", "title": "Why Medium Partnership/Membership Idea Sucks", "content": "Why Medium Partnership/Membership Idea Sucks In response to Ev Williams (Our approach to member-only content) To: Ev, Medium Staff, Your Friends @ Medium, and Medium users I’m among those who were invited to participate in the new Medium Partnership and Membership program. Note: Partnership means that I was invited to pitch my stories to Medium for a chance of getting paid for one or maybe more of them, while Membership means I was also asked to become a paying member, or ‘a founder,’ as Medium puts it. The circle around my profile pic means I’m now a paying member. To make it clear before I voice my concerns and unleash my mind — I love Medium (or at least have loved it so far) and much appreciate the opportunity to MAYBE get paid for my contributions here. But… I certainly do not appreciate how all this has been handled and what I’m getting as a paying member. I also do not appreciate how this whole idea is presented as ‘original’ and ‘unprecedented,’ when there is, frankly, not much originality in what is going on right now. If anything, this approach is killing the essence of where the true originality of Medium lies. And that’s why I’m thinking more and more about canceling my membership and remain a humble non-paying participant. I hope that something might still change, though, and so I wrote a list of my objections for Medium to perhaps take into consideration. 1 You didn’t ask us what we want. Instead, you wrote a couple of posts about some undefined plans of yours. I’ve seen those and commented on them but received no response, so I’m not sure have anyone of the team even read them. I also haven’t received a survey or anything of the sort. I wasn’t asked, for instance, what kind of device I prefer to use to read Medium posts and why. I wasn’t asked how I would like to use the ‘series’ option. I wasn’t asked what I think about membership and partnership programs. In short, I’m one of your most active users and you don’t care to know anything about me. Until I paid the fee, I wasn’t given a chance to voice my preferences and have a say in any of this. Showing no regard for your users’ wants and needs is not the best way to create something they might like. And it’s not just me saying this. These are startup basics. Interviews and surveys are what we had to do first in the startup course I took. Have you forgotten that? Do you think you know me better than I know myself? I might not have a super-successful startup under my belt, but this guy created a multi-billion dollar business and here are his thoughts on leadership and the importance of listening and being interested in the ideas of others. To quote: “It’s a shame to not take advantage of that.” Instead of listening, you offered me to become a paying member, so that I now have to pay for the ‘privilege’ of testing what you started to develop and give you my feedback. Seriously?! I have to PAY for a chance to be heard? 2 The editorial team is a major issue. Yes, I know — the membership fee will be used to pay (only a handful of selected) writers, which brings me to the next point. I have a major issue with your editorial team. There are plenty of other media outlets with absolutely fabulous editors, and most of them regularly pay all of their writers and not just a couple of them on a rare occasion. Besides, what makes you think your editorial team is so great that it can compete with the big league? From what I’ve seen so far, it cannot. I’m not interested in most of your teams’ story picks. I don’t check their recommendations and I don’t find my daily email selection all that great. I would say your editors pick what I might like in one of ten cases. Meaning, I occasionally read and like a story that was recommended by your team. On average, I check no more than 1 to 2 links in your daily email selection. In your first members-only email there was one single story I was slightly interested in, but then couldn’t finish reading it, for it was so dry and dull — the kind you end up with when you desperately try to please the editors and edit it to the point of sucking all the juice out of it. I’m not happy with what I’m getting from your editors. Who are they even? From what I’ve seen so far, I suspect they are a group of people of similar age (I’m guessing around 30), similar (probably middle class) background and education, with very little (if any) diversity, and no international members. Am I right? 3 Here is what I’m getting elsewhere for my money: The Washington post is offering me a yearly subscription for $19. Amazon will give me a free membership for 6 months and another 6 months for $2.99 per month, that would be $17.94 per year for tons of content I would be interested in seeing. Your membership fee will cost me more than three times that sum at $60 per year, and so far I could not even find a single post I’d want to read. To top it off, there are other publications here that will charge me yet again for access to their membership-only content! Where’s the sense in that?! Medium’s expensive new approach is no different from what most other media outlets are doing, and I fail to see any originality in it. This is NOT why I came here and it has nothing to do with why I like Medium so much. What’s worse, it makes me dislike it. What FitBit’s James Park also said in the above-mentioned interview is that people like to know there is a plan and vision behind a project and I cannot find it here. What I see is a team of mediocre editors, lack of originality, and a whole lot of annoying confusion. Why came here and what I suggest I came here because the stories here were original. People were pouring their hearts out, shared interesting thoughts and personal insights, original fiction, unexpected diary entries… I didn’t come here for your editorial team. I couldn’t care less about it. I came here for the writers, amazing, new, fresh writers, first timers and those who have been writing for years. I came here because I could finally find something different from the usual editor-curated same old, same old. And now you are pushing this same old approach here. Stop it, just please stop it! What I would like to see here is a donation button or an option to pay as much as one wants for a subscription or to writers directly. I want to be my own editor and be able to pay writers regardless of what your team thinks. I want to have the ability to personally reward what I deem worthy. This option would also take into consideration the fact that there are many people from different economic backgrounds here. Giving them an open choice based on how much they can afford would level the playing field. For some $50 is a trifle, for others a $1 is a lot, so a flat fee for all doesn’t ensure equality. I hate the elitist approach you are now taking. Why have you only opened this option to a selected few? Why the exclusion? I find that disturbing and unfair. This, again, is not why I came here or what I expected from Medium. Everyone should get a chance to participate and not just a few. This is what freedom of expression is all about and what is going on here right now is not in accord with it. I want to get back my tribe and the inspiring free-roaming community I found when I first got here! Mateja started to write short stories at the age of ten and later became a freelance writer, radio personality, and counselor. Her life resembles a roller coaster ride full of ups and downs and some pretty wild turns. Among other things, her car was destroyed by tanks and she survived several brushes with death. She graduated in psychology from Arizona State University and is now a founder and editor at Transform the Pain and Personal Brain Whisperer, but her secret love is writing weird stories for The Rabbit Is In. Connect with Mateja on LinkedIn. ", "name": "1955", "parent": "", "sentences": [{"063a": "Why Medium Partnership/Membership Idea Sucks"}, {"3727": "In response to Ev Williams (Our approach to member-only content)"}, {"4df5": "To: Ev, Medium Staff, Your Friends @ Medium, and Medium users"}, {"563c": "I’m among those who were invited to participate in the new Medium Partnership and Membership program."}, {"9ab3": "Note: Partnership means that I was invited to pitch my stories to Medium for a chance of getting paid for one or maybe more of them, while Membership means I was also asked to become a paying member, or ‘a founder,’ as Medium puts it. The circle around my profile pic means I’m now a paying member."}, {"0689": "To make it clear before I voice my concerns and unleash my mind — I love Medium (or at least have loved it so far) and much appreciate the opportunity to MAYBE get paid for my contributions here."}, {"ac23": "But…"}, {"eaf2": "I certainly do not appreciate how all this has been handled and what I’m getting as a paying member. I also do not appreciate how this whole idea is presented as ‘original’ and ‘unprecedented,’ when there is, frankly, not much originality in what is going on right now."}, {"3dea": "If anything, this approach is killing the essence of where the true originality of Medium lies. And that’s why I’m thinking more and more about canceling my membership and remain a humble non-paying participant."}, {"f56a": "I hope that something might still change, though, and so I wrote a list of my objections for Medium to perhaps take into consideration."}, {"07ec": "1 You didn’t ask us what we want. Instead, you wrote a couple of posts about some undefined plans of yours. I’ve seen those and commented on them but received no response, so I’m not sure have anyone of the team even read them."}, {"c268": "I also haven’t received a survey or anything of the sort. I wasn’t asked, for instance, what kind of device I prefer to use to read Medium posts and why. I wasn’t asked how I would like to use the ‘series’ option. I wasn’t asked what I think about membership and partnership programs."}, {"0e73": "In short, I’m one of your most active users and you don’t care to know anything about me. Until I paid the fee, I wasn’t given a chance to voice my preferences and have a say in any of this."}, {"72f3": "Showing no regard for your users’ wants and needs is not the best way to create something they might like."}, {"f912": "And it’s not just me saying this. These are startup basics. Interviews and surveys are what we had to do first in the startup course I took. Have you forgotten that? Do you think you know me better than I know myself?"}, {"9d60": "I might not have a super-successful startup under my belt, but this guy created a multi-billion dollar business and here are his thoughts on leadership and the importance of listening and being interested in the ideas of others."}, {"a4d7": "To quote: “It’s a shame to not take advantage of that.”"}, {"9f70": "Instead of listening, you offered me to become a paying member, so that I now have to pay for the ‘privilege’ of testing what you started to develop and give you my feedback. Seriously?! I have to PAY for a chance to be heard?"}, {"3690": "2 The editorial team is a major issue. Yes, I know — the membership fee will be used to pay (only a handful of selected) writers, which brings me to the next point."}, {"0ac8": "I have a major issue with your editorial team. There are plenty of other media outlets with absolutely fabulous editors, and most of them regularly pay all of their writers and not just a couple of them on a rare occasion."}, {"3037": "Besides, what makes you think your editorial team is so great that it can compete with the big league? From what I’ve seen so far, it cannot. I’m not interested in most of your teams’ story picks. I don’t check their recommendations and I don’t find my daily email selection all that great."}, {"83d4": "I would say your editors pick what I might like in one of ten cases. Meaning, I occasionally read and like a story that was recommended by your team. On average, I check no more than 1 to 2 links in your daily email selection."}, {"31ec": "In your first members-only email there was one single story I was slightly interested in, but then couldn’t finish reading it, for it was so dry and dull — the kind you end up with when you desperately try to please the editors and edit it to the point of sucking all the juice out of it."}, {"1684": "I’m not happy with what I’m getting from your editors."}, {"9bc0": "Who are they even? From what I’ve seen so far, I suspect they are a group of people of similar age (I’m guessing around 30), similar (probably middle class) background and education, with very little (if any) diversity, and no international members. Am I right?"}, {"6823": "3 Here is what I’m getting elsewhere for my money: The Washington post is offering me a yearly subscription for $19."}, {"0b54": "Amazon will give me a free membership for 6 months and another 6 months for $2.99 per month, that would be $17.94 per year for tons of content I would be interested in seeing."}, {"4c0f": "Your membership fee will cost me more than three times that sum at $60 per year, and so far I could not even find a single post I’d want to read. To top it off, there are other publications here that will charge me yet again for access to their membership-only content!"}, {"c054": "Where’s the sense in that?!"}, {"f8d8": "Medium’s expensive new approach is no different from what most other media outlets are doing, and I fail to see any originality in it. This is NOT why I came here and it has nothing to do with why I like Medium so much. What’s worse, it makes me dislike it."}, {"9c04": "What FitBit’s James Park also said in the above-mentioned interview is that people like to know there is a plan and vision behind a project and I cannot find it here. What I see is a team of mediocre editors, lack of originality, and a whole lot of annoying confusion."}, {"078c": "Why came here and what I suggest"}, {"3e85": "I came here because the stories here were original. People were pouring their hearts out, shared interesting thoughts and personal insights, original fiction, unexpected diary entries…"}, {"5778": "I didn’t come here for your editorial team. I couldn’t care less about it. I came here for the writers, amazing, new, fresh writers, first timers and those who have been writing for years."}, {"a512": "I came here because I could finally find something different from the usual editor-curated same old, same old. And now you are pushing this same old approach here. Stop it, just please stop it!"}, {"c6e8": "What I would like to see here is a donation button or an option to pay as much as one wants for a subscription or to writers directly. I want to be my own editor and be able to pay writers regardless of what your team thinks."}, {"f9ba": "I want to have the ability to personally reward what I deem worthy."}, {"ccb6": "This option would also take into consideration the fact that there are many people from different economic backgrounds here. Giving them an open choice based on how much they can afford would level the playing field."}, {"4e08": "For some $50 is a trifle, for others a $1 is a lot, so a flat fee for all doesn’t ensure equality."}, {"4d76": "I hate the elitist approach you are now taking. Why have you only opened this option to a selected few? Why the exclusion? I find that disturbing and unfair. This, again, is not why I came here or what I expected from Medium."}, {"cc57": "Everyone should get a chance to participate and not just a few."}, {"ed83": "This is what freedom of expression is all about and what is going on here right now is not in accord with it. I want to get back my tribe and the inspiring free-roaming community I found when I first got here!"}, {"27a3": "Mateja started to write short stories at the age of ten and later became a freelance writer, radio personality, and counselor. Her life resembles a roller coaster ride full of ups and downs and some pretty wild turns. Among other things, her car was destroyed by tanks and she survived several brushes with death. She graduated in psychology from Arizona State University and is now a founder and editor at Transform the Pain and Personal Brain Whisperer, but her secret love is writing weird stories for The Rabbit Is In. Connect with Mateja on LinkedIn."}]}