{"child": "1956_1\t1956_2\t1956_3\t1956_4\t1956_5\t1956_6\t1956_7\t1956_81956_1\t1956_2\t1956_3\t1956_4\t1956_5\t1956_6\t1956_7\t1956_81956_1\t1956_2\t1956_3\t1956_4\t1956_5\t1956_6\t1956_7\t1956_8", "title": "Just See What Happens: an Absolutely Terrifying Experiment", "content": "Just See What Happens: an Absolutely Terrifying Experiment Exploring the benefits of publishing fiction on Medium Last night I started a new publication: The 1000 Day MFA. The 1000 Day MFA is a program I run through Ninja Writers. We read a lot (a short story, a poem, and an essay every day), we watch movies, and we write a short story every week. That’s Ray Bradbury’s basic advice to writers. This quote basically rules my life and it informs my program: Just write every day of your life. Read intensely. Then see what happens. — Ray Bradbury We also work toward writing a novel every year and read at least one novel and one craft book a month. You can read more about it here: The 1000 Day MFAmedium.com The publication is a place for me to publish the short stories I write every week. They won’t be perfect. They’ll reflect my learning curve, since I generally write novels and short stories are a whole other animal. I’m going to be very honest here. I’m terrified. I’m a novelist. I don’t write short fiction. I’m scared that people are going to hate my stories. Or (worse?) that no one will care enough to read them. Publishing fiction every single week is going to be rough, but exciting. My publication has zero followers. That goose egg is scary. I’ll also post sometimes about The 1000 Day MFA experience. My goal is to post one short story every Sunday and one non-fiction post on Wednesday that will help people who are looking at being autodidactic writers. I’m terrifying myself because I love you. This is an experiment I’m going to give it eight weeks before I evaluate how it’s working and I’ll report back. If you’ve been thinking about publishing fiction on Medium, hopefully what I’m doing will be helpful to you. Basically, I want to figure out if there is any benefit to publishing short fiction on Medium. Here are some possible benefits and things I’ll be paying attention to: Being read Ray Bradbury talked a lot about how he got his start writing short stories for fiction magazines in the 1940s. He was paid $20 a pop. In the 1940s, you could make a living with $20 short stories. According to this calculator, to adjust for inflation, that $20 was worth $271 today’s dollars. Stephen King got his start similarly, in the 1960s. The same $20 in 1965 is worth $154 today. In 2017, the paying short story market just isn’t designed to support an upstart storyteller. What markets there are pay the same $20. If you’re lucky. Bradbury and King could both pay rent with one short story sale. The same just isn’t true anymore. So — the currency I’m looking at for this experiment is readers. Eyeballs on my stories. If I publish on Medium, will people read my work? Will they be able to find it? Do people come to Medium to read fiction at all? Getting feedback Obviously, I’m hoping that people will read the short stories I publish in The 1000 Day MFA. On a deeper level, I hope that readers respond to my work. I want feedback. I want to know which stories resonate and which fall flat. Which stories readers want more of. I’m just going to throw this out there: responding to a writer’s work is one of the best gifts you can give them. That little green heart matters. A quick response matters. I’ll be watching over the coming weeks to see if readers respond to my stories. Building an audience At my core, I’m a novelist. I hope that publishing my short fiction here helps me to build an audience for my novels. I’ll post a form for joining my mailing list with each story. I’ve started a publication, so readers can follow it. My big take away from being published by Penguin is that it is very, very important for every writer to work on developing their own audience. Even the biggest traditional publisher won’t do that for you. The effect of publishing I’m not sure what else to call this. I want to pay attention to how putting work out publicly every week affects me as a writer. Does it push me to write better? Does it make me more cautious, since I know other people will for sure read what I’m writing? If you want to follow along with this experiment, follow The 1000 Day MFA publication. Or join my mailing list: If you enjoyed this post, please consider scrolling down and recommending it by clicking the pretty green heart. Also share it with your writer friends. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1956", "parent": "", "sentences": [{"81b8": "Just See What Happens: an Absolutely Terrifying Experiment"}, {"3d76": "Exploring the benefits of publishing fiction on Medium"}, {"425d": "Last night I started a new publication: The 1000 Day MFA."}, {"5b65": "The 1000 Day MFA is a program I run through Ninja Writers. We read a lot (a short story, a poem, and an essay every day), we watch movies, and we write a short story every week."}, {"1954": "That’s Ray Bradbury’s basic advice to writers. This quote basically rules my life and it informs my program:"}, {"f847": "Just write every day of your life. Read intensely. Then see what happens. — Ray Bradbury"}, {"76a1": "We also work toward writing a novel every year and read at least one novel and one craft book a month."}, {"60b4": "You can read more about it here:"}, {"000e": "The 1000 Day MFAmedium.com"}, {"f977": "The publication is a place for me to publish the short stories I write every week. They won’t be perfect. They’ll reflect my learning curve, since I generally write novels and short stories are a whole other animal."}, {"d05b": "I’m going to be very honest here. I’m terrified. I’m a novelist. I don’t write short fiction. I’m scared that people are going to hate my stories. Or (worse?) that no one will care enough to read them. Publishing fiction every single week is going to be rough, but exciting."}, {"32a2": "My publication has zero followers. That goose egg is scary."}, {"77a9": "I’ll also post sometimes about The 1000 Day MFA experience. My goal is to post one short story every Sunday and one non-fiction post on Wednesday that will help people who are looking at being autodidactic writers."}, {"85d5": "I’m terrifying myself because I love you."}, {"f494": "This is an experiment"}, {"a8c3": "I’m going to give it eight weeks before I evaluate how it’s working and I’ll report back."}, {"13cb": "If you’ve been thinking about publishing fiction on Medium, hopefully what I’m doing will be helpful to you."}, {"7ae7": "Basically, I want to figure out if there is any benefit to publishing short fiction on Medium. Here are some possible benefits and things I’ll be paying attention to:"}, {"6358": "Being read"}, {"f5f2": "Ray Bradbury talked a lot about how he got his start writing short stories for fiction magazines in the 1940s. He was paid $20 a pop. In the 1940s, you could make a living with $20 short stories."}, {"bf82": "According to this calculator, to adjust for inflation, that $20 was worth $271 today’s dollars."}, {"2fc9": "Stephen King got his start similarly, in the 1960s."}, {"9525": "The same $20 in 1965 is worth $154 today."}, {"521a": "In 2017, the paying short story market just isn’t designed to support an upstart storyteller. What markets there are pay the same $20. If you’re lucky. Bradbury and King could both pay rent with one short story sale. The same just isn’t true anymore."}, {"9fcc": "So — the currency I’m looking at for this experiment is readers. Eyeballs on my stories. If I publish on Medium, will people read my work? Will they be able to find it? Do people come to Medium to read fiction at all?"}, {"1226": "Getting feedback"}, {"6659": "Obviously, I’m hoping that people will read the short stories I publish in The 1000 Day MFA."}, {"0b9b": "On a deeper level, I hope that readers respond to my work. I want feedback. I want to know which stories resonate and which fall flat. Which stories readers want more of."}, {"2a12": "I’m just going to throw this out there: responding to a writer’s work is one of the best gifts you can give them. That little green heart matters. A quick response matters."}, {"95c4": "I’ll be watching over the coming weeks to see if readers respond to my stories."}, {"ee26": "Building an audience"}, {"be14": "At my core, I’m a novelist."}, {"6c35": "I hope that publishing my short fiction here helps me to build an audience for my novels. I’ll post a form for joining my mailing list with each story. I’ve started a publication, so readers can follow it."}, {"4e67": "My big take away from being published by Penguin is that it is very, very important for every writer to work on developing their own audience. Even the biggest traditional publisher won’t do that for you."}, {"7255": "The effect of publishing"}, {"11d5": "I’m not sure what else to call this."}, {"1fe1": "I want to pay attention to how putting work out publicly every week affects me as a writer. Does it push me to write better? Does it make me more cautious, since I know other people will for sure read what I’m writing?"}, {"f874": "If you want to follow along with this experiment, follow The 1000 Day MFA publication. Or join my mailing list:"}, {"9abc": "If you enjoyed this post, please consider scrolling down and recommending it by clicking the pretty green heart. Also share it with your writer friends."}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}, {"fdd7": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}