{"child": "1957_1\t1957_2\t1957_3\t1957_4\t1957_5\t1957_61957_1\t1957_2\t1957_3\t1957_4\t1957_5\t1957_6", "title": "Open Letter to Editors And a Word of Advice to Writers", "content": "Open Letter to Editors And a Word of Advice to Writers Dear editors! Your demands for pitches are not worth the effort so please stop doing it. It’s time to change the rules. Writers who want to get paid for their work on Medium or elsewhere will sooner or later be asked to pitch. Whenever I’m faced with that I cringe and often do not apply. Why? In most cases, it’s simply not worth the effort. A life of freelance writers feels much like Bill Murray’s in Groundhog Day. We spend most of our time on applying for jobs while doing a bit of writing on the side. Sending out job applications and trying to beat the competition is no fun and even less so when you have to do it regularly and into infinity. Pitching a story is just another way of submitting a job application with a notable distinction that it does not bring you a steady job, work security, and benefits, but a one-time gig that will pay a lousy $50 or so. And after that, you have to do it again, and again, and again… I’ve been working as a freelancer for most of my life, and I’ve done more than a fair share of pitching. To be honest, I’m fed up with it. I love writing for publications, but the pay sucks big time. What’s more, the paying market is only getting worse and there are no signs of improvement. Pitching today doesn’t make the least economic sense and I wish editors would finally stop asking writers to do it. It’s unfair and insulting given the average fee. Editors, I’m sure you are aware of how much time it takes to prepare a pitch, not to mention having to wait for your reply (or the lack of it). Some editors take weeks during which I cannot offer the story to anyone else. Each one of you has different expectations and you tend to come up with various guidelines I am expected to follow. It takes a precious lot of time to come up with a good pitch tailor made especially for you and writing it means that I’m basically writing two stories for the price of one. If I don’t already know you well, I have no clear idea what you might like, so there is quite a bit of guesswork involved in it too. I’m expected to research the publication and half guess whether my work might be considered ‘a good fit.’ I just hate it when I get a generic response from you that my pitch or story ‘wasn’t a good fit.’ Could you, dear editors, please show some appreciation for the time I invested and stop using that annoying phrase? Make an effort, like I did, and at least offer a word of useful feedback in return. The problem is that you all have personal tastes and different expectations. Your choices are as a rule highly subjective and that can make it impossibly hard to predict what a certain editor might find interesting. It also happened to me that although a pitch got approved, the story wasn’t published, so I invested all that time and ended up not getting paid. With the rates these days, even if one gets paid (after having to wait for 30 days or more for the transfer), one is already working for a fee that feels like an insult considering how demanding and time consuming the work is. Some fees sound reasonable enough (considering the market), such as The Establishment’s $150 per 1,000–1,500 words, but turn out to be far less alluring when a writers sends in a thoughtfully prepared pitch only to be thanked for it and told to ‘keep sending ideas.’ When I did send in the next idea, it was ignored and I was left demotivated and unwilling to invest any more time in an endeavor with such an uncertain outcome and no feedback that could help me nail it. It seems that the higher the fee, the higher the chance the pitches will be rejected. One has to spend hours on writing and sending a whole bunch of them with no guarantee of success. So I’m done with playing the pitching game with you, dear editors, unless you come up with something inspiring that will pay well enough to make it worth the effort. Which is highly unlikely and increasingly rare. The time of rising social insecurity and decreasing fees for freelance writers calls for a new approach. So stop placing the full burden of the economic crisis in the media on our shoulders alone. Understand the position of us, writers, too, and not just your own. Show some understanding of how severely our work and time has already been undervalued. So either abandon your request for pitches, or take into consideration how much time creating a pitch takes and be prepared to reciprocate with a higher fee and solid feedback. That would be valuable and it would prevent wasting our time on submitting in vain. As another option, you could stop asking for pitches as the only route for a writer to getting paid for a story, and start accepting story submissions with no additional requests. Be willing to pay your low fees for those, or at least for the best and most successful ones. I’m pretty sure editors do not need to see my bio and hear what makes me qualified to write a certain story in addition to giving you a short description and preferably a title in advance, plus at least three samples of my work on the similar topic, to be able to see whether a story is worth publishing. By burdening us with such requests, you are not making your life any easier, while you unnecessarily make ours much harder. You are wasting our time and since you are not willing or able to pay for it, stop doing that. I get your publication probably cannot afford to raise the fees. What you, however, can do is show some respect for writers and our time. Start sharing the burden and understand that we too struggle for survival in this world of online publishing where everyone wants everything for free. The very least you can do is stop wasting our time. We have no more of it than you, and our is as precious to us as yours is to you. I sincerely hope that Medium’s new approach recently launched by Ev Williams who invited a selected group of us, Medium writers, to participate in the opportunity to get paid for our writing here, will bear fruit. I would also like to ask the Medium Staff to take the above stance into consideration when creating and solidifying their vision of this exciting new project. Thank you, Mateja Mateja started to write short stories at the age of ten and later became a freelance writer, radio personality, and counselor. Her life resembles a roller coaster ride full of ups and downs and some pretty wild turns. Among other things, her car was destroyed by tanks and she survived several brushes with death. She graduated in psychology from Arizona State University and is now a founder and editor at Transform the Pain and Personal Brain Whisperer, but her secret love is writing weird stories for The Rabbit Is In. Connect with Mateja on LinkedIn. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1957", "parent": "", "sentences": [{"4b4b": "Open Letter to Editors And a Word of Advice to Writers"}, {"2289": "Dear editors! Your demands for pitches are not worth the effort so please stop doing it. It’s time to change the rules."}, {"1b8d": "Writers who want to get paid for their work on Medium or elsewhere will sooner or later be asked to pitch. Whenever I’m faced with that I cringe and often do not apply. Why? In most cases, it’s simply not worth the effort."}, {"f7cf": "A life of freelance writers feels much like Bill Murray’s in Groundhog Day. We spend most of our time on applying for jobs while doing a bit of writing on the side. Sending out job applications and trying to beat the competition is no fun and even less so when you have to do it regularly and into infinity."}, {"cc0f": "Pitching a story is just another way of submitting a job application with a notable distinction that it does not bring you a steady job, work security, and benefits, but a one-time gig that will pay a lousy $50 or so. And after that, you have to do it again, and again, and again…"}, {"4411": "I’ve been working as a freelancer for most of my life, and I’ve done more than a fair share of pitching. To be honest, I’m fed up with it. I love writing for publications, but the pay sucks big time. What’s more, the paying market is only getting worse and there are no signs of improvement."}, {"c59d": "Pitching today doesn’t make the least economic sense and I wish editors would finally stop asking writers to do it. It’s unfair and insulting given the average fee."}, {"26f2": "Editors, I’m sure you are aware of how much time it takes to prepare a pitch, not to mention having to wait for your reply (or the lack of it). Some editors take weeks during which I cannot offer the story to anyone else."}, {"77b7": "Each one of you has different expectations and you tend to come up with various guidelines I am expected to follow. It takes a precious lot of time to come up with a good pitch tailor made especially for you and writing it means that I’m basically writing two stories for the price of one."}, {"f6e6": "If I don’t already know you well, I have no clear idea what you might like, so there is quite a bit of guesswork involved in it too. I’m expected to research the publication and half guess whether my work might be considered ‘a good fit.’"}, {"e997": "I just hate it when I get a generic response from you that my pitch or story ‘wasn’t a good fit.’ Could you, dear editors, please show some appreciation for the time I invested and stop using that annoying phrase? Make an effort, like I did, and at least offer a word of useful feedback in return."}, {"14dc": "The problem is that you all have personal tastes and different expectations. Your choices are as a rule highly subjective and that can make it impossibly hard to predict what a certain editor might find interesting."}, {"2df9": "It also happened to me that although a pitch got approved, the story wasn’t published, so I invested all that time and ended up not getting paid."}, {"2d2f": "With the rates these days, even if one gets paid (after having to wait for 30 days or more for the transfer), one is already working for a fee that feels like an insult considering how demanding and time consuming the work is."}, {"c5f1": "Some fees sound reasonable enough (considering the market), such as The Establishment’s $150 per 1,000–1,500 words, but turn out to be far less alluring when a writers sends in a thoughtfully prepared pitch only to be thanked for it and told to ‘keep sending ideas.’"}, {"52ff": "When I did send in the next idea, it was ignored and I was left demotivated and unwilling to invest any more time in an endeavor with such an uncertain outcome and no feedback that could help me nail it."}, {"ff8e": "It seems that the higher the fee, the higher the chance the pitches will be rejected. One has to spend hours on writing and sending a whole bunch of them with no guarantee of success."}, {"8f5a": "So I’m done with playing the pitching game with you, dear editors, unless you come up with something inspiring that will pay well enough to make it worth the effort. Which is highly unlikely and increasingly rare."}, {"28f6": "The time of rising social insecurity and decreasing fees for freelance writers calls for a new approach. So stop placing the full burden of the economic crisis in the media on our shoulders alone. Understand the position of us, writers, too, and not just your own."}, {"88c8": "Show some understanding of how severely our work and time has already been undervalued."}, {"2e25": "So either abandon your request for pitches, or take into consideration how much time creating a pitch takes and be prepared to reciprocate with a higher fee and solid feedback. That would be valuable and it would prevent wasting our time on submitting in vain."}, {"2c07": "As another option, you could stop asking for pitches as the only route for a writer to getting paid for a story, and start accepting story submissions with no additional requests. Be willing to pay your low fees for those, or at least for the best and most successful ones."}, {"c97b": "I’m pretty sure editors do not need to see my bio and hear what makes me qualified to write a certain story in addition to giving you a short description and preferably a title in advance, plus at least three samples of my work on the similar topic, to be able to see whether a story is worth publishing."}, {"391b": "By burdening us with such requests, you are not making your life any easier, while you unnecessarily make ours much harder. You are wasting our time and since you are not willing or able to pay for it, stop doing that."}, {"3790": "I get your publication probably cannot afford to raise the fees. What you, however, can do is show some respect for writers and our time. Start sharing the burden and understand that we too struggle for survival in this world of online publishing where everyone wants everything for free."}, {"91e3": "The very least you can do is stop wasting our time. We have no more of it than you, and our is as precious to us as yours is to you."}, {"9f1e": "I sincerely hope that Medium’s new approach recently launched by Ev Williams who invited a selected group of us, Medium writers, to participate in the opportunity to get paid for our writing here, will bear fruit. I would also like to ask the Medium Staff to take the above stance into consideration when creating and solidifying their vision of this exciting new project."}, {"908d": "Thank you,"}, {"33e8": "Mateja"}, {"27a3": "Mateja started to write short stories at the age of ten and later became a freelance writer, radio personality, and counselor. Her life resembles a roller coaster ride full of ups and downs and some pretty wild turns. Among other things, her car was destroyed by tanks and she survived several brushes with death. She graduated in psychology from Arizona State University and is now a founder and editor at Transform the Pain and Personal Brain Whisperer, but her secret love is writing weird stories for The Rabbit Is In. Connect with Mateja on LinkedIn."}, {"729e": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}