{"child": "1958_1\t1958_2\t1958_3\t1958_4\t1958_51958_1\t1958_2\t1958_3\t1958_4\t1958_51958_1\t1958_2\t1958_3\t1958_4\t1958_5", "title": "5 Steps to Being Traditionally Published.", "content": "5 Steps to Being Traditionally Published. It’s hard, but not impossible. It’s always been hard to have a book traditionally published. It’s really just numbers. There are way more people who want to be published than there are opportunities to be published. High demand equals high difficulty. So, even though the writer hires the agent, the editor, the publisher — the agent, editor, publisher have so many opportunities to do their work that they don’t have to really hustle for clients. People are scrambling, begging them to take most of the proceeds of each book sale. That’s just the way of the world. That being said, though, if traditional publishing is your goal (and let’s be honest, it’s a goal for a lot of writers), it’s not impossible. Here’s how you do it: Write a really good book. If you’re writing fiction, this is a must. No agent will look at you if you don’t have a complete novel, so no traditional publisher will have the chance to consider your work. With non-fiction you can write a proposal instead of the whole book. If you’re a first time writer, though, it wouldn’t hurt to write your whole book even for non-fiction. Regardless, the work you turn into agents (proposal or finished draft) needs to shine. While you’re writing, start building an email list. I wish that someone had given me this advice when I sold my first novel to a traditional publisher. (Not my first ever novel, just the first one that was traditionally published.) I had eighteen months between when my book sold and when it was released. My best use of that time would have been building an email list, but I didn’t know that. No one told me. So, I’m telling you. You’ll have an easier time appealing to an agent (and a publisher) if you have a solid foundation of readers already. It goes without saying, you’ll have an easier time selling your book if you have people waiting to buy it. If you can get to 10,000 on your email list, it will make a difference. If you can get to 100,000 — suddenly you’re not 1 in a million anymore. You’re more rare, which means that suddenly agents and publishers will be more anxious to compete for your business. The truth is, you probably don’t even need an agent or publisher if you build your list to that level. You certainly won’t have trouble attracting one or the other or both if that’s what you want. Here’s one strategy for building an email list through blogging. Look for an agent. This requires you to learn how to write a solid query letter. A query letter is a one-page sales letter that tries to entice the agent to request your manuscript or proposal. Most large traditional publishers require you to have an agent before they’ll look at your work. Here’s some information about writing a query letter. Write the next book. And so on. I guess the real truth is that it’s much harder to get your first book published than your second, and harder for the second than the third, etc. Writing is a skill that takes practice to master. If you keep going, you increase your chances exponentially. And if you quit, you build a block wall that your chances can’t overcome. You aren’t competing against every single writer trying to get a book published. I have a friend who reads an agent’s slush pile. He says that a full 90 percent of the queries that come in are instant rejects — because the writing isn’t there. You’re only competing against the books that are publish-ready. You need to make sure your book is publish-ready. Do what it takes to get there. That means a lot of practice, a lot of reading, a lot of writing. Maybe hiring an editor. Maybe taking some classes. It means behaving like a professional writer. If you stick with it and keep improving, you’ll get there. By time you do, though, you might find that you don’t really want to be there anymore. The world of books is changing way faster than the world of publishing has kept up with. If you enjoyed this post, give it some love with a recommendation heart. ❤ >>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1958", "parent": "", "sentences": [{"b7bd": "5 Steps to Being Traditionally Published."}, {"6efe": "It’s hard, but not impossible."}, {"98a3": "It’s always been hard to have a book traditionally published."}, {"f78b": "It’s really just numbers. There are way more people who want to be published than there are opportunities to be published. High demand equals high difficulty. So, even though the writer hires the agent, the editor, the publisher — the agent, editor, publisher have so many opportunities to do their work that they don’t have to really hustle for clients."}, {"e791": "People are scrambling, begging them to take most of the proceeds of each book sale. That’s just the way of the world."}, {"35fa": "That being said, though, if traditional publishing is your goal (and let’s be honest, it’s a goal for a lot of writers), it’s not impossible."}, {"5cdf": "Here’s how you do it:"}, {"4972": "Write a really good book."}, {"d837": "If you’re writing fiction, this is a must. No agent will look at you if you don’t have a complete novel, so no traditional publisher will have the chance to consider your work."}, {"d898": "With non-fiction you can write a proposal instead of the whole book. If you’re a first time writer, though, it wouldn’t hurt to write your whole book even for non-fiction. Regardless, the work you turn into agents (proposal or finished draft) needs to shine."}, {"35f2": "While you’re writing, start building an email list."}, {"2113": "I wish that someone had given me this advice when I sold my first novel to a traditional publisher. (Not my first ever novel, just the first one that was traditionally published.)"}, {"a361": "I had eighteen months between when my book sold and when it was released. My best use of that time would have been building an email list, but I didn’t know that. No one told me."}, {"7493": "So, I’m telling you."}, {"e336": "You’ll have an easier time appealing to an agent (and a publisher) if you have a solid foundation of readers already. It goes without saying, you’ll have an easier time selling your book if you have people waiting to buy it."}, {"fe0c": "If you can get to 10,000 on your email list, it will make a difference."}, {"349d": "If you can get to 100,000 — suddenly you’re not 1 in a million anymore. You’re more rare, which means that suddenly agents and publishers will be more anxious to compete for your business."}, {"a1ca": "The truth is, you probably don’t even need an agent or publisher if you build your list to that level. You certainly won’t have trouble attracting one or the other or both if that’s what you want."}, {"f685": "Here’s one strategy for building an email list through blogging."}, {"8a86": "Look for an agent."}, {"4818": "This requires you to learn how to write a solid query letter. A query letter is a one-page sales letter that tries to entice the agent to request your manuscript or proposal. Most large traditional publishers require you to have an agent before they’ll look at your work."}, {"c5af": "Here’s some information about writing a query letter."}, {"7337": "Write the next book. And so on."}, {"4a64": "I guess the real truth is that it’s much harder to get your first book published than your second, and harder for the second than the third, etc. Writing is a skill that takes practice to master."}, {"85f6": "If you keep going, you increase your chances exponentially."}, {"7c50": "And if you quit, you build a block wall that your chances can’t overcome."}, {"661f": "You aren’t competing against every single writer trying to get a book published."}, {"2015": "I have a friend who reads an agent’s slush pile. He says that a full 90 percent of the queries that come in are instant rejects — because the writing isn’t there."}, {"1752": "You’re only competing against the books that are publish-ready. You need to make sure your book is publish-ready. Do what it takes to get there. That means a lot of practice, a lot of reading, a lot of writing. Maybe hiring an editor. Maybe taking some classes."}, {"8287": "It means behaving like a professional writer."}, {"077b": "If you stick with it and keep improving, you’ll get there. By time you do, though, you might find that you don’t really want to be there anymore. The world of books is changing way faster than the world of publishing has kept up with."}, {"dec5": "If you enjoyed this post, give it some love with a recommendation heart. ❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}, {"4351": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}