{"child": "1959_1\t1959_2\t1959_31959_1\t1959_2\t1959_31959_1\t1959_2\t1959_31959_1\t1959_2\t1959_3", "title": "Writing as Competitive Sport", "content": "Writing as Competitive Sport Thoughts on rejection, persistence, and why the pursuit of recognition makes writing inherently competitive Over the last half-year or so, I’ve submitted more of my writing to short story and personal essay contests than I ever have before. I’ve pitched articles to newspapers, sent stories to magazines, and emailed novel chapters to lit agents. To date, I’ve sent the entirety of what I believe to be my best work to everyone I’ve been told to send my best work to. And every time I press “Send”, or slip a manilla envelope into a blue mailbox — taking heed of the envelope’s satisfying heft — I feel a jolt of excitement, of anticipation, like I’m making tangible progress towards something I badly want to achieve. This is it, I think, every time. This is going to be my chance. Yesterday, I received a rejection notice from the only editor, agent or judge that I hadn’t yet gotten a rejection notice from. I read only as far as the first conjunction of the second sentence: “We appreciated the opportunity to read your work, but…” At which time I closed my laptop, left my apartment, and walked to a bar. I sat in a booth that overlooked a sidewalk littered with discarded needles and broken beer bottles. The fog outside hung low and thick, as if the city had recently been sedated. This part of San Francisco always smells like pee, but the bar, for what it’s worth, smelled more like the inside of a shed that someone had recently tried to make not smell like the inside of a shed. It felt like a fitting place for self-piteous wallowing. And wallow I did, over several pints of over-priced beer. In retrospect, that I felt an inclination to wallow in pity at all makes me slightly embarrassed. Literary competitions are shitty barometers with which to measure your worth as a writer. One’s “success” in such endeavors hinges inherently upon the opinions of judges and editors whose biases and moods and inclinations are unknowable and random. Plus, writing — like all kinds of art — is something you should do for no reason other than a love and appreciation for the craft. Everything else should be secondary. Right? Yes. Right. All of that is true. And I know this. I know it the same way I know that it’s not about whether you win or you lose, it’s about how you play the game. But just as when I was offered that really kind of sorry-sounding platitude back when I was playing baseball, I can’t shake the sense now that such a polite conception of writing disregards and really actually undermines something essential about what being a writer ultimately entails, and thus doesn’t really mean shit. It’s the aspect of the process and of the experience that makes “becoming a writer” such an esoteric pursuit, in fact — the part that’s maybe most frustrating, and certainly the most scary: that of competition, rejection, and the ongoing pursuit of recognition. All writers feel this, to some degree, a vaguely animal sense of hunger and ambition. This is the competitive side of writing. It’s what compels us to submit our work to literary competitions and pitch our words to agents and, yes, publish our stories on Medium. Some of us probably feel it more than others. I feel it sort of broiling inside of me every time I sit down to write, a certain awareness, like an oil patch of untapped potential. Sometimes I’m aware of it only faintly; sometimes it blares siren-like against my skull. But it’s there, all the time, and one thing I was struggling with at the bar was how much credence I should give it. In considering this question, I thought back to when I used to play baseball. Because what this thing is, ultimately, is a voice. For me, it’s the same voice I became familiar with back when I damn near lived in the batting cages and on the dirt behind third base. In sports, my competitive drive had its roots in a desire to win a championship, and maybe to be remembered, and maybe even to get a scholarship to play in college. In writing, I think, it comes not from a desire not to win, per se, but to be recognized. To be recognized as good. To be recognized for the time you’ve spent improving your abilities at this lonely, often insufferable-seeming thing. And, you see, to get this kind of recognition — whether from friends on Facebook or from other writers on Medium or from the more esoteric echelons of the literary community — you have to compete for it. And in competing, you run the risk of failing. Of losing. Of being rejected. Of your Medium essays going ignored. And no matter which way you look at it, failing, losing, or being rejected in the pursuit something you want — fucking sucks. It’s also, then, a very real component of trying to be a writer. When I left the bar yesterday, I was feeling both the sort of lead-jacket heaviness that accompanies the despair of rejection, as well as a sort of pinched-nerve guilt about being so bothered by it in the first place. In the hours that’ve passed since, however, I’ve resolved not to feel embarrassed about feeling pissed in the face of rejection. I still believe that the gratification one gets from doing a thing is far more important than the recognition they may or may not get for doing it — if you do anything purely out of a desire to be considered good at it, you either won’t end up being very good at it, or you won’t enjoy it in the first place, which means it is pointless. But at the same time, I believe just as wholeheartedly that the desire for recognition broiling inside me is valid, and normal, and even, to some extent, critical, just as it was critical my senior year in high school. I consider it no coincidence that we went 24–3 that year. It’s in this way, I think, that writing is similar to playing a competitive sport. And you know what? I’ve decided to fucking embrace it. To not would be both disingenuous and self-defeating. And so it’s with this in mind that I’m going to keep submitting my work to competitions and to agents and to magazines and to publications here on Medium. Because the alternative — not trying; not competing; not doing this any more — is unthinkable. Rejection is a part of this game. It’s a part of this sport. Now it’s back to the notepad. If you enjoyed this story, feel free to click the little heart so more people can read it :) At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1959", "parent": "", "sentences": [{"8cd0": "Writing as Competitive Sport"}, {"7775": "Thoughts on rejection, persistence, and why the pursuit of recognition makes writing inherently competitive"}, {"0aca": "Over the last half-year or so, I’ve submitted more of my writing to short story and personal essay contests than I ever have before. I’ve pitched articles to newspapers, sent stories to magazines, and emailed novel chapters to lit agents. To date, I’ve sent the entirety of what I believe to be my best work to everyone I’ve been told to send my best work to. And every time I press “Send”, or slip a manilla envelope into a blue mailbox — taking heed of the envelope’s satisfying heft — I feel a jolt of excitement, of anticipation, like I’m making tangible progress towards something I badly want to achieve. This is it, I think, every time. This is going to be my chance."}, {"36a4": "Yesterday, I received a rejection notice from the only editor, agent or judge that I hadn’t yet gotten a rejection notice from."}, {"d304": "I read only as far as the first conjunction of the second sentence: “We appreciated the opportunity to read your work, but…” At which time I closed my laptop, left my apartment, and walked to a bar."}, {"15ca": "I sat in a booth that overlooked a sidewalk littered with discarded needles and broken beer bottles. The fog outside hung low and thick, as if the city had recently been sedated. This part of San Francisco always smells like pee, but the bar, for what it’s worth, smelled more like the inside of a shed that someone had recently tried to make not smell like the inside of a shed. It felt like a fitting place for self-piteous wallowing."}, {"be2a": "And wallow I did, over several pints of over-priced beer."}, {"3d3d": "In retrospect, that I felt an inclination to wallow in pity at all makes me slightly embarrassed. Literary competitions are shitty barometers with which to measure your worth as a writer. One’s “success” in such endeavors hinges inherently upon the opinions of judges and editors whose biases and moods and inclinations are unknowable and random. Plus, writing — like all kinds of art — is something you should do for no reason other than a love and appreciation for the craft. Everything else should be secondary."}, {"4a4a": "Right?"}, {"d4c9": "Yes. Right. All of that is true. And I know this. I know it the same way I know that it’s not about whether you win or you lose, it’s about how you play the game."}, {"ccb6": "But just as when I was offered that really kind of sorry-sounding platitude back when I was playing baseball, I can’t shake the sense now that such a polite conception of writing disregards and really actually undermines something essential about what being a writer ultimately entails, and thus doesn’t really mean shit. It’s the aspect of the process and of the experience that makes “becoming a writer” such an esoteric pursuit, in fact — the part that’s maybe most frustrating, and certainly the most scary: that of competition, rejection, and the ongoing pursuit of recognition."}, {"1a6b": "All writers feel this, to some degree, a vaguely animal sense of hunger and ambition. This is the competitive side of writing. It’s what compels us to submit our work to literary competitions and pitch our words to agents and, yes, publish our stories on Medium. Some of us probably feel it more than others. I feel it sort of broiling inside of me every time I sit down to write, a certain awareness, like an oil patch of untapped potential. Sometimes I’m aware of it only faintly; sometimes it blares siren-like against my skull. But it’s there, all the time, and one thing I was struggling with at the bar was how much credence I should give it."}, {"9608": "In considering this question, I thought back to when I used to play baseball. Because what this thing is, ultimately, is a voice. For me, it’s the same voice I became familiar with back when I damn near lived in the batting cages and on the dirt behind third base."}, {"05dc": "In sports, my competitive drive had its roots in a desire to win a championship, and maybe to be remembered, and maybe even to get a scholarship to play in college."}, {"2cef": "In writing, I think, it comes not from a desire not to win, per se, but to be recognized. To be recognized as good. To be recognized for the time you’ve spent improving your abilities at this lonely, often insufferable-seeming thing."}, {"50cf": "And, you see, to get this kind of recognition — whether from friends on Facebook or from other writers on Medium or from the more esoteric echelons of the literary community — you have to compete for it. And in competing, you run the risk of failing. Of losing. Of being rejected. Of your Medium essays going ignored. And no matter which way you look at it, failing, losing, or being rejected in the pursuit something you want — fucking sucks."}, {"8a2b": "It’s also, then, a very real component of trying to be a writer."}, {"f744": "When I left the bar yesterday, I was feeling both the sort of lead-jacket heaviness that accompanies the despair of rejection, as well as a sort of pinched-nerve guilt about being so bothered by it in the first place."}, {"9c9a": "In the hours that’ve passed since, however, I’ve resolved not to feel embarrassed about feeling pissed in the face of rejection. I still believe that the gratification one gets from doing a thing is far more important than the recognition they may or may not get for doing it — if you do anything purely out of a desire to be considered good at it, you either won’t end up being very good at it, or you won’t enjoy it in the first place, which means it is pointless. But at the same time, I believe just as wholeheartedly that the desire for recognition broiling inside me is valid, and normal, and even, to some extent, critical, just as it was critical my senior year in high school. I consider it no coincidence that we went 24–3 that year."}, {"fccc": "It’s in this way, I think, that writing is similar to playing a competitive sport. And you know what? I’ve decided to fucking embrace it. To not would be both disingenuous and self-defeating."}, {"9181": "And so it’s with this in mind that I’m going to keep submitting my work to competitions and to agents and to magazines and to publications here on Medium. Because the alternative — not trying; not competing; not doing this any more — is unthinkable."}, {"94a1": "Rejection is a part of this game. It’s a part of this sport."}, {"d365": "Now it’s back to the notepad."}, {"b1c6": "If you enjoyed this story, feel free to click the little heart so more people can read it :)"}, {"ac81": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}