{"name": "196", "parent": "", "content": "I’ve grown tired of love. You know how I know? I fall in love fast and made it my craft to be irresistible, thus easy to love. I’ve polished down my edges, sort of speak. I’m layered with years of being concerned with love as the driving force of my existence. I’ve fallen in love in an instant. I’ve fallen in love over time. I’ve waited for love to have sex, and had sex only to find love. I’ve married young, duh! Like any good hopeless romantic. I’ve divorced too, just like my mother. I see stories in people more than I see people. Stories in men that are so willing to tell me their stories. My first dates are never intrascentental-they’ve all had meaning. They’ve turned into friendships; into crushes that swirve in and out of sight and over time into regret or forgiveness; into indeleble marks; even into marriages… For some fucking reason, I’ve gotten away with being this self-involved, this self-confident for this long. But it’s all a lie. I’m really not that self-involved, if I was, I’d be a lot more involved with myself than with “love.” I feel you require an explanation: I’ve recently understood, due to my second divorce, that I’ve placed more value in receiving love, than in giving love. This is a double-edge sword. Edge#1: receiving love isn’t love. It’s the shortest route to not feeling alone, which is one of my biggest fears, according to my fears. Edge#2: receiving love distracted me from having to love myself. This is the kind of stuff that now keeps me up at night. I’ve led a life of super-sensitivity and now find myself numb without the one thing that I’ve found easy to come by: love. But love, I imagine, is more than two strangers connecting over a cigarette one crisp New York night. Or that feeling that the crowd parted perfectly in half so that we could meet. Or a cabin in the Poconos where a hipster and a poet went night fishing. Or a stolen dance in Havana that turned into a ‘this is me and I love you that’s why I kiss you on the forehead’ kind of moment in El Malecón. I’ve grown tired of love, I know it because I’ve started to like myself more lately. There’s something strong developing, against my questionable judgment, inside of me. It’s an uncomfortable feeling, to only have yourself to worry about. Nobody to steer you in the direction of their expectations. No wars to wage for somebody else’s sake. Uff, it feels like I’m doing nothing on a good day. ", "title": "I’ve grown tired of love. You know how I know?", "sentences": [{"fe27": "I’ve grown tired of love. You know how I know?"}, {"312f": "I fall in love fast and made it my craft to be irresistible, thus easy to love. I’ve polished down my edges, sort of speak. I’m layered with years of being concerned with love as the driving force of my existence."}, {"8721": "I’ve fallen in love in an instant. I’ve fallen in love over time. I’ve waited for love to have sex, and had sex only to find love. I’ve married young, duh! Like any good hopeless romantic. I’ve divorced too, just like my mother."}, {"1400": "I see stories in people more than I see people. Stories in men that are so willing to tell me their stories. My first dates are never intrascentental-they’ve all had meaning. They’ve turned into friendships; into crushes that swirve in and out of sight and over time into regret or forgiveness; into indeleble marks; even into marriages…"}, {"ba1b": "For some fucking reason, I’ve gotten away with being this self-involved, this self-confident for this long. But it’s all a lie. I’m really not that self-involved, if I was, I’d be a lot more involved with myself than with “love.”"}, {"7359": "I feel you require an explanation:"}, {"bb00": "I’ve recently understood, due to my second divorce, that I’ve placed more value in receiving love, than in giving love. This is a double-edge sword. Edge#1: receiving love isn’t love. It’s the shortest route to not feeling alone, which is one of my biggest fears, according to my fears. Edge#2: receiving love distracted me from having to love myself."}, {"799e": "This is the kind of stuff that now keeps me up at night. I’ve led a life of super-sensitivity and now find myself numb without the one thing that I’ve found easy to come by: love."}, {"99eb": "But love, I imagine, is more than two strangers connecting over a cigarette one crisp New York night. Or that feeling that the crowd parted perfectly in half so that we could meet. Or a cabin in the Poconos where a hipster and a poet went night fishing. Or a stolen dance in Havana that turned into a ‘this is me and I love you that’s why I kiss you on the forehead’ kind of moment in El Malecón."}, {"823a": "I’ve grown tired of love, I know it because I’ve started to like myself more lately. There’s something strong developing, against my questionable judgment, inside of me. It’s an uncomfortable feeling, to only have yourself to worry about. Nobody to steer you in the direction of their expectations. No wars to wage for somebody else’s sake. Uff, it feels like I’m doing nothing on a good day."}], "child": "196_1\t196_2\t196_3\t196_4\t196_5\t196_6\t196_7\t196_8\t196_9\t196_10"}