{"child": "1960_1\t1960_2\t1960_3\t1960_4\t1960_51960_1\t1960_2\t1960_3\t1960_4\t1960_51960_1\t1960_2\t1960_3\t1960_4\t1960_5", "title": "Marketing the book I haven’t written", "content": "I didn’t write the book I haven’t written on this typewriter Marketing the book I haven’t written Content Strategy for Soon-to-be-but-as-yet-unpublished Authors I sometimes put the cart before the horse. Or maybe I can’t see the forest for the trees. Counting chickens before they’ve hatched. I do that one a lot. Many occasions for chicken counting in my line of work. The point, though, is that I tend to procrastinate. My eyes often stray from the prize. Usually my straying—my dilly-dallying (I’ve always wanted to use that term)—ends up being productive in and of itself, but it’s still procrastination. Take this submission. I should be working on my book. Instead, I’m thinking about how I’ll go about marketing it when I finish. As a quick aside, when I searched for “marketing your first book”, the first result (note, my results are tailored to Canada, because that’s where I’m searching from. Yours may differ based on your search behaviour and location) provided a list of things to do in order to become a best-selling author (first-things-first, if they are promising “bestseller” status, run). Interestingly, “Write a Remarkable Book” was sitting in spot #4, behind nuggets like “start a blog” (check) and “start early”. Early? As in, earlier than now? Early in life? But I digress (well, this whole post is a digression from what I should be doing, but that, too, is another story. This one, in fact). As a content strategist by trade, a former journalist and a would-be writer of fiction, one would think I am well-equipped to market my own material. Yes. One would. One (namely, me). And I am. But that doesn’t mean that I’m not constantly looking (read: procrastinating) for, and learning about new, innovative ways to market. Let’s look at a couple of examples… Brent Underwood. He did what I, perhaps, should have done in the first place (i.e. filed under “Ideas I wish were mine”). He wondered what it would take to achieve “Amazon Bestseller” status, and he put his ideas into action. Behind the Scam: What Does It Take to Be a ‘Best-Selling Author’? $3 and 5 Minutes.I would like to tell you about the biggest lie in book publishing. It appears in the biographies and social media…medium.com He chronicles some amazing, disturbing and downright depressing issues about the publishing (and writing) industry. [I]t’s begun to feel a bit like a losing battle. Because those authors are everywhere these days. The title of my fake book was “Putting My Foot Down” for a reason: I’ve become utterly exhausted with phony “authors” and the scam artists and charlatans who conspire with these folks–the cottage industry that has built up around them, selling courses, instructions and hacks. A quick Google search returns dozens of “bestselling books,” courses, packages, schools, secrets, summits, and webinars teaching you how to become a “bestselling author”. Hell, this guy even promises to show you how to be a bestselling author “Even if You Have No Book Ideas, Writing Skills, or Any Clue Where To Start” in a “5 Phase Formula.” (Behind the Scam: What Does It Take to Be a ‘Best-Selling Author’? $3 and 5 Minutes) All of which isn’t to say that there aren’t good ways to market your book, it’s just increasingly difficult when we take into account the sheer volume of amazing authors out there, and then combine them with the so-called phony ones. Instead, maybe I just won’t write a book at all, but launch a campaign around the idea for a book. If the campaign is a success, and there’s enough interest (and, of course, pre-orders), then I’ll actually write it. Kind of like Kickstarter or (ahem) Patreon. On to the next idea. Litbait. I love this. Well, the idea of this. Clickbait is horrible. Teasing, tricking and ultimately promising one thing but delivering another is a horrible way to engender interest in your product. Until now. This Bookstore's Clickbait Headlines on Facebook Are Actually the Plots of Classic NovelsDoes the end ever justify a means like clickbait? That's debatable. But a new contender in the discussion is Dallas…www.adweek.com This tactic requires that I actually write a/the book, but that was the plan anyway, so no biggie. What The Wild Detectives, a bookstore, did was brilliant: using the plots of classic (copyright-free) novels as clickbait (litbait, get it?) to, of course, encourage reading but, perhaps more importantly, to “remind people that there are way better things to read than clickbaity articles on the internet.” “British guy dies after selfie gone wrong” (The Picture of Dorian Grey), “Teenage girl tricked boyfriend into killing himself” (Romeo and Juliet), “When it’s OKAY to slut shame single mothers” (The Scarlet Letter) and — wait for it! — “This Italian politician makes Trump look like a saint” (The Prince by Machiavelli … which got as passionate a response as you can expect). (AdWeek) Be prolific. (Yes. I just said “be prolific”). Remarkably, it’s hard to find many authors and book publishers who really innovate when it comes to promoting their books. Self-published (self-publishing) authors are forced to be as creative or more in their marketing than they are in their fiction to stand out alone, but still, the larger story of why I should read their books often eludes them. Self-publishing writing duo Tim McBain and L.T. Vargus are examples of authors who grind. They don’t stop. They’ve chosen their channels of choice and they’re doubling down on the message: Read. Our. Books. That’s all they want. Read them. Not buy them. They (usually) give their books away. For free. They pump out newsletters (amusing reads). They are prolific on Twitter and they write manymanymany books. This is what it takes. I don’t know how well they do, to be honest, but they win with sheer determination and pure volume of content alone. By “win” I mean they at least pop up on my radar, which is more than many others can say. So, hopefully my own clickbaity title didn’t lead you too far astray. True, I haven’t really provided a content strategy, per se, for soon-to-be-but-as-yet-unpublished authors, but I’m not done yet! The truth is, every author, every book, should have it’s own, unique strategy. The plug-and-play, templated strategies and tactics that come out of large publishing houses are successful in spite of themselves. Not to say that there isn’t value or merit in what an established, successful book-publishing-and-marketing machine has to offer, but it might be safe to say that we, as authors—as those looking to get our material published and read by our desired audiences—can’t and shouldn’t rely on those tried-and-possibly-not-so-true-anymore tactics. We have to market ourselves. We have to tell our own stories. We have to tell the story of why you’d want to read our stories. We have to build, establish and foster our network, our audience, and give them a reason to encourage others to become a part of it as well. Even if one signs with a big publisher, the days are gone when we could solely rely on their marketing clout, book tours and placement on shelves. So we have to create content around our content. We have to talk about our craft. What makes us tick. Our challenges and disappointments, and our wins. People buy into people, as well as their stories. I think. At least I do. I’d love to hear about your self-publishing/marketing stories. Let me know in the comments below! If you are at all interested in supporting my creative endeavours, you’re in luck! I’ve just joined Patreon, a simple way for people to contribute to Project: Write the Book and get great rewards in return (one of which is immortality. Don’t knock it until you’ve tried it). It’s kind of like Kickstarter (Patreon, not immortality). Project: Write the Book! Thanks for reading. If you enjoyed it, click the heart below. I’d really appreciate it, and it helps other people see the story. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "1960", "parent": "", "sentences": [{"006b": "I didn’t write the book I haven’t written on this typewriter"}, {"c3bc": "Marketing the book I haven’t written"}, {"dcbd": "Content Strategy for Soon-to-be-but-as-yet-unpublished Authors"}, {"551e": "I sometimes put the cart before the horse. Or maybe I can’t see the forest for the trees. Counting chickens before they’ve hatched. I do that one a lot. Many occasions for chicken counting in my line of work. The point, though, is that I tend to procrastinate. My eyes often stray from the prize. Usually my straying—my dilly-dallying (I’ve always wanted to use that term)—ends up being productive in and of itself, but it’s still procrastination. Take this submission. I should be working on my book. Instead, I’m thinking about how I’ll go about marketing it when I finish."}, {"6d02": "As a quick aside, when I searched for “marketing your first book”, the first result (note, my results are tailored to Canada, because that’s where I’m searching from. Yours may differ based on your search behaviour and location) provided a list of things to do in order to become a best-selling author (first-things-first, if they are promising “bestseller” status, run). Interestingly, “Write a Remarkable Book” was sitting in spot #4, behind nuggets like “start a blog” (check) and “start early”. Early? As in, earlier than now? Early in life?"}, {"f160": "But I digress (well, this whole post is a digression from what I should be doing, but that, too, is another story. This one, in fact). As a content strategist by trade, a former journalist and a would-be writer of fiction, one would think I am well-equipped to market my own material. Yes. One would. One (namely, me). And I am. But that doesn’t mean that I’m not constantly looking (read: procrastinating) for, and learning about new, innovative ways to market. Let’s look at a couple of examples…"}, {"e404": "Brent Underwood. He did what I, perhaps, should have done in the first place (i.e. filed under “Ideas I wish were mine”). He wondered what it would take to achieve “Amazon Bestseller” status, and he put his ideas into action."}, {"30a2": "Behind the Scam: What Does It Take to Be a ‘Best-Selling Author’? $3 and 5 Minutes.I would like to tell you about the biggest lie in book publishing. It appears in the biographies and social media…medium.com"}, {"d4cb": "He chronicles some amazing, disturbing and downright depressing issues about the publishing (and writing) industry."}, {"6b2e": "[I]t’s begun to feel a bit like a losing battle. Because those authors are everywhere these days. The title of my fake book was “Putting My Foot Down” for a reason: I’ve become utterly exhausted with phony “authors” and the scam artists and charlatans who conspire with these folks–the cottage industry that has built up around them, selling courses, instructions and hacks. A quick Google search returns dozens of “bestselling books,” courses, packages, schools, secrets, summits, and webinars teaching you how to become a “bestselling author”. Hell, this guy even promises to show you how to be a bestselling author “Even if You Have No Book Ideas, Writing Skills, or Any Clue Where To Start” in a “5 Phase Formula.” (Behind the Scam: What Does It Take to Be a ‘Best-Selling Author’? $3 and 5 Minutes)"}, {"7fb2": "All of which isn’t to say that there aren’t good ways to market your book, it’s just increasingly difficult when we take into account the sheer volume of amazing authors out there, and then combine them with the so-called phony ones. Instead, maybe I just won’t write a book at all, but launch a campaign around the idea for a book. If the campaign is a success, and there’s enough interest (and, of course, pre-orders), then I’ll actually write it. Kind of like Kickstarter or (ahem) Patreon."}, {"f77c": "On to the next idea."}, {"d907": "Litbait. I love this. Well, the idea of this. Clickbait is horrible. Teasing, tricking and ultimately promising one thing but delivering another is a horrible way to engender interest in your product. Until now."}, {"f5a7": "This Bookstore's Clickbait Headlines on Facebook Are Actually the Plots of Classic NovelsDoes the end ever justify a means like clickbait? That's debatable. But a new contender in the discussion is Dallas…www.adweek.com"}, {"6d1e": "This tactic requires that I actually write a/the book, but that was the plan anyway, so no biggie. What The Wild Detectives, a bookstore, did was brilliant: using the plots of classic (copyright-free) novels as clickbait (litbait, get it?) to, of course, encourage reading but, perhaps more importantly, to “remind people that there are way better things to read than clickbaity articles on the internet.”"}, {"0e9a": "“British guy dies after selfie gone wrong” (The Picture of Dorian Grey), “Teenage girl tricked boyfriend into killing himself” (Romeo and Juliet), “When it’s OKAY to slut shame single mothers” (The Scarlet Letter) and — wait for it! — “This Italian politician makes Trump look like a saint” (The Prince by Machiavelli … which got as passionate a response as you can expect). (AdWeek)"}, {"1ed1": "Be prolific. (Yes. I just said “be prolific”). Remarkably, it’s hard to find many authors and book publishers who really innovate when it comes to promoting their books. Self-published (self-publishing) authors are forced to be as creative or more in their marketing than they are in their fiction to stand out alone, but still, the larger story of why I should read their books often eludes them."}, {"d4a3": "Self-publishing writing duo Tim McBain and L.T. Vargus are examples of authors who grind. They don’t stop. They’ve chosen their channels of choice and they’re doubling down on the message: Read. Our. Books. That’s all they want. Read them. Not buy them. They (usually) give their books away. For free. They pump out newsletters (amusing reads). They are prolific on Twitter and they write manymanymany books."}, {"b557": "This is what it takes. I don’t know how well they do, to be honest, but they win with sheer determination and pure volume of content alone. By “win” I mean they at least pop up on my radar, which is more than many others can say."}, {"782e": "So, hopefully my own clickbaity title didn’t lead you too far astray. True, I haven’t really provided a content strategy, per se, for soon-to-be-but-as-yet-unpublished authors, but I’m not done yet! The truth is, every author, every book, should have it’s own, unique strategy. The plug-and-play, templated strategies and tactics that come out of large publishing houses are successful in spite of themselves. Not to say that there isn’t value or merit in what an established, successful book-publishing-and-marketing machine has to offer, but it might be safe to say that we, as authors—as those looking to get our material published and read by our desired audiences—can’t and shouldn’t rely on those tried-and-possibly-not-so-true-anymore tactics."}, {"5162": "We have to market ourselves. We have to tell our own stories. We have to tell the story of why you’d want to read our stories. We have to build, establish and foster our network, our audience, and give them a reason to encourage others to become a part of it as well. Even if one signs with a big publisher, the days are gone when we could solely rely on their marketing clout, book tours and placement on shelves. So we have to create content around our content. We have to talk about our craft. What makes us tick. Our challenges and disappointments, and our wins. People buy into people, as well as their stories. I think. At least I do."}, {"8088": "I’d love to hear about your self-publishing/marketing stories. Let me know in the comments below!"}, {"3ad2": "If you are at all interested in supporting my creative endeavours, you’re in luck! I’ve just joined Patreon, a simple way for people to contribute to Project: Write the Book and get great rewards in return (one of which is immortality. Don’t knock it until you’ve tried it). It’s kind of like Kickstarter (Patreon, not immortality)."}, {"1fdd": "Project: Write the Book!"}, {"67e4": "Thanks for reading. If you enjoyed it, click the heart below. I’d really appreciate it, and it helps other people see the story."}, {"1a9f": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}]}