{"child": "1962_11962_11962_1", "title": "Less Lazy", "content": "Less Lazy Or more talented? I get a daily email from Seth Godin. Not from him personally. We don’t know each other. It’s an automated email that I receive because I asked for it. I signed up for his daily blogging. Clear? I just didn’t want you to think that I was name dropping (so, I was just talking with my buddy Seth, and he said…) or bragging. Although I am kind of a big thing. Cue the fat jokes. So, I was reading my daily email from my buddy Seth and I saw a link that really resonated with me: More Recent Articles Lazy but talented. Hm. Yaaa. I’ll just go ahead and click on that… So I did. And I’m glad. Because it really got me thinking. I’ve been writing a number of posts recently about my writing, my writing challenges, about procrastination, planning, my issue(s) with log lines and like-minded ugh-why-doesn’t-this-guy-just-stop-whining-and-get-on-with-the-writing-already posts. Most of them I’ve attributed to fear. Something that, for some reason, is easier to admit to than, say, laziness. Because if I’m just being lazy, that seems worse. Not being talented, or talented enough, is pretty scary, but an unholy marriage of Fear AND Laziness is even worse. It’s a hard hole to dig out of. You can work really hard to get a little more talented. And you can also work to get a little less lazy. It turns out that getting less lazy, more brave — more clear about your fears, your work and your mission — are all easier than getting more talented. (Seth Godin, if that wasn’t obvious by now) When you (read: Seth) lay it out like this, though, it provides some much-needed perspective. I can work really hard to get more talented. I can. But is that the right direction? Is that the best use of my time? Always trying to improve, always learning, is always good. But it’s not the game changer. So, I can also work really hard on getting less lazy. I don’t know if it’s easier than getting more talented, to be honest, but I do feel that being clear about what I’m afraid of, what I want to accomplish, and how, will help me get across the finish line. By being brave. Braver. Nothing worth doing is ever easy. Somebody said that. It wasn’t me. Except for right now in this post. But it’s true. Most amazing things, most incredible achievements (Editorial aside: I don’t have the statistics or like-minded anecdotal information on hand to prove this, I just have to believe that this is true) couldn’t have been easy to accomplish, or even undertake. They were hard. Writing isn’t hard for me. Well, it isn’t hard if I know what I want to write about. It isn’t hard if I don’t have to write a log line. Or an outline. Or actually start the book. Writing about the book is easy. The book? Not so much. So while writing in general isn’t hard, writing something good, writing something important, writing those works-in-progress is very hard. Harder still when I’m being lazy. And when I’m being afraid. So I’m going to be brave. Braver today than I was yesterday. Hopefully that translates into less lazy. It will still be hard. But it will be worth it. I promise. sethgodin.com If you are at all interested in supporting my creative endeavours, you’re in luck! I’ve just joined Patreon, a simple way for people to contribute to Project: Write the Book and get great rewards in return (one of which is immortality. Don’t knock it until you’ve tried it). It’s kind of like Kickstarter (Patreon, not immortality). Project: Write the Book! Thanks for reading. If you enjoyed it, click the heart below. I’d really appreciate it, and it helps other people see the story. Thank you for reading this article on The Writing Cooperative. Be sure to check out this great editing software from our friends over at ProWritingAid. ", "name": "1962", "parent": "", "sentences": [{"8ea3": "Less Lazy"}, {"4834": "Or more talented?"}, {"518f": "I get a daily email from Seth Godin. Not from him personally. We don’t know each other. It’s an automated email that I receive because I asked for it. I signed up for his daily blogging. Clear? I just didn’t want you to think that I was name dropping (so, I was just talking with my buddy Seth, and he said…) or bragging. Although I am kind of a big thing. Cue the fat jokes."}, {"86bc": "So, I was reading my daily email from my buddy Seth and I saw a link that really resonated with me:"}, {"aa7b": "More Recent Articles"}, {"f490": "Lazy but talented. Hm. Yaaa. I’ll just go ahead and click on that… So I did. And I’m glad. Because it really got me thinking."}, {"e399": "I’ve been writing a number of posts recently about my writing, my writing challenges, about procrastination, planning, my issue(s) with log lines and like-minded ugh-why-doesn’t-this-guy-just-stop-whining-and-get-on-with-the-writing-already posts. Most of them I’ve attributed to fear. Something that, for some reason, is easier to admit to than, say, laziness. Because if I’m just being lazy, that seems worse."}, {"3b85": "Not being talented, or talented enough, is pretty scary, but an unholy marriage of Fear AND Laziness is even worse. It’s a hard hole to dig out of."}, {"dfe8": "You can work really hard to get a little more talented."}, {"eda4": "And you can also work to get a little less lazy."}, {"344e": "It turns out that getting less lazy, more brave — more clear about your fears, your work and your mission — are all easier than getting more talented."}, {"1a96": "(Seth Godin, if that wasn’t obvious by now)"}, {"4375": "When you (read: Seth) lay it out like this, though, it provides some much-needed perspective. I can work really hard to get more talented. I can. But is that the right direction? Is that the best use of my time? Always trying to improve, always learning, is always good. But it’s not the game changer."}, {"b835": "So, I can also work really hard on getting less lazy. I don’t know if it’s easier than getting more talented, to be honest, but I do feel that being clear about what I’m afraid of, what I want to accomplish, and how, will help me get across the finish line. By being brave. Braver."}, {"3566": "Nothing worth doing is ever easy. Somebody said that. It wasn’t me. Except for right now in this post. But it’s true. Most amazing things, most incredible achievements (Editorial aside: I don’t have the statistics or like-minded anecdotal information on hand to prove this, I just have to believe that this is true) couldn’t have been easy to accomplish, or even undertake. They were hard. Writing isn’t hard for me. Well, it isn’t hard if I know what I want to write about. It isn’t hard if I don’t have to write a log line. Or an outline. Or actually start the book. Writing about the book is easy. The book? Not so much. So while writing in general isn’t hard, writing something good, writing something important, writing those works-in-progress is very hard. Harder still when I’m being lazy. And when I’m being afraid."}, {"b69b": "So I’m going to be brave. Braver today than I was yesterday. Hopefully that translates into less lazy. It will still be hard. But it will be worth it. I promise."}, {"5eb9": "sethgodin.com"}, {"8d50": "If you are at all interested in supporting my creative endeavours, you’re in luck! I’ve just joined Patreon, a simple way for people to contribute to Project: Write the Book and get great rewards in return (one of which is immortality. Don’t knock it until you’ve tried it). It’s kind of like Kickstarter (Patreon, not immortality)."}, {"1fdd": "Project: Write the Book!"}, {"67e4": "Thanks for reading. If you enjoyed it, click the heart below. I’d really appreciate it, and it helps other people see the story."}, {"ce74": "Thank you for reading this article on The Writing Cooperative. Be sure to check out this great editing software from our friends over at ProWritingAid."}]}