{"child": "1966_1\t1966_21966_1\t1966_21966_1\t1966_2", "title": "This Is How I Wrote and Published A Book.", "content": "This Is How I Wrote and Published A Book. This is how I wrote and published a book. I’m not saying this is the way everyone should do it, but this is how I did it. It’s not necessarily successful. So keep that in mind. If you disagree, that’s cool, I’d like to hear it. If you agree, then I’d rather hear that (ha). But anyway, this is what I did. I wrote the first draft by hand. Yes, that’s right. I bought a notebook and I wrote in it. I think I bought a blank journal to start and then I finished it in a lined notebook that I got at CVS or something. I can’t remember exactly. But this is why I like to write by hand: I’ve written another novel by hand since then, so it all kind of runs together.. In these notebooks, I wrote long sentences. Not just bullet points and stuff. Or a grocery list. But real sentences. Then I took the notebooks, opened them and began to type in my computer. This is important. At first, I thought about getting a service to type up my important musings (fancy). But then I realized something: I could edit in the process. The re-reading of my own writing, plus me typing it would give me a new opportunity to edit and revise. And you know what? This part was fun. It gave me new ideas and plot points and descriptions and then I moved stuff around once I typed it. I always thought revision was about taking the bad out, but it’s really about putting better stuff in. I worked with a small publisher and then that didn’t work out. The publisher I worked with had put out a few books on his own. It certainly was small, it was one guy and he put out 4 to 5 books that I really enjoyed. And he even paid me and gave me an advance and then he couldn’t do it anymore. It took me and him a little while to realize that he couldn’t do it anymore. But he loved the book. He edited and spent time with it. It’s a better book two or three years after the fact because this guy took an interest in it. He really edited it. But there’s always a risk with small publishers. They will come and they will go. Even if they have a good track record, you never know if the one right before yours will be the last. So then I decided to “self publish.” I’m putting “self publish” in quotes because I didn’t really do anything. I hired someone to do it for me. They edited the book and laid it out and even made a cover (thanks Adam!). I paid them to do it, but it wasn’t a crazy amount. It was cheaper than a band fronting the money to record their own album. It was cheaper than a movie director mortgaging his house to put out a movie you can get Netflix. No, he didn’t pay me. I didn’t make money up front. But I paid for the service and I received the service and Adam even set it up in Amazon and everything and he even knows about printing as well so we talked about that. It was pretty cool and I don’t feel like I did anything at all. Let me tell you, this is the way to go. I used to spend time learning how to lay stuff out and work on the technology and all of that, but you should definitely hire someone to do it for you. Save your Christmas money and birthday money or float a small loan from your family. It’s not that expensive and totally worth it. Then I kinda-sorta promoted the book. There’s a lot more to this. I made a plan, and then didn’t do the plan and had all the steps lined out in the plan. I’ll talk about this soon. Okay, here’s the book. Got questions about Taco Jehovah? Here are the answers.Hey! My new book Taco Jehovah is out and it’s been a long-time coming. Some of you have may have some questions about…medium.com I’m Josh Spilker, a writer and author. I blog about the writing process at Create, Make, Write. My new book is called Taco Jehovah. For more like this, follow this publication: Create Make WriteThoughts on creativity, writing & makingmedium.com ", "name": "1966", "parent": "", "sentences": [{"1625": "This Is How I Wrote and Published A Book."}, {"4323": "This is how I wrote and published a book."}, {"8d57": "I’m not saying this is the way everyone should do it, but this is how I did it. It’s not necessarily successful. So keep that in mind. If you disagree, that’s cool, I’d like to hear it. If you agree, then I’d rather hear that (ha). But anyway, this is what I did."}, {"664e": "I wrote the first draft by hand."}, {"4935": "Yes, that’s right. I bought a notebook and I wrote in it. I think I bought a blank journal to start and then I finished it in a lined notebook that I got at CVS or something. I can’t remember exactly."}, {"1cea": "But this is why I like to write by hand:"}, {"379c": "I’ve written another novel by hand since then, so it all kind of runs together.. In these notebooks, I wrote long sentences. Not just bullet points and stuff. Or a grocery list. But real sentences."}, {"7f43": "Then I took the notebooks, opened them and began to type in my computer. This is important."}, {"3fff": "At first, I thought about getting a service to type up my important musings (fancy). But then I realized something: I could edit in the process. The re-reading of my own writing, plus me typing it would give me a new opportunity to edit and revise. And you know what? This part was fun. It gave me new ideas and plot points and descriptions and then I moved stuff around once I typed it."}, {"1262": "I always thought revision was about taking the bad out, but it’s really about putting better stuff in."}, {"f47a": "I worked with a small publisher and then that didn’t work out."}, {"c90b": "The publisher I worked with had put out a few books on his own. It certainly was small, it was one guy and he put out 4 to 5 books that I really enjoyed. And he even paid me and gave me an advance and then he couldn’t do it anymore. It took me and him a little while to realize that he couldn’t do it anymore. But he loved the book. He edited and spent time with it. It’s a better book two or three years after the fact because this guy took an interest in it. He really edited it."}, {"e422": "But there’s always a risk with small publishers. They will come and they will go. Even if they have a good track record, you never know if the one right before yours will be the last."}, {"f816": "So then I decided to “self publish.”"}, {"222e": "I’m putting “self publish” in quotes because I didn’t really do anything. I hired someone to do it for me. They edited the book and laid it out and even made a cover (thanks Adam!). I paid them to do it, but it wasn’t a crazy amount."}, {"3842": "It was cheaper than a band fronting the money to record their own album. It was cheaper than a movie director mortgaging his house to put out a movie you can get Netflix. No, he didn’t pay me. I didn’t make money up front. But I paid for the service and I received the service and Adam even set it up in Amazon and everything and he even knows about printing as well so we talked about that. It was pretty cool and I don’t feel like I did anything at all."}, {"6782": "Let me tell you, this is the way to go. I used to spend time learning how to lay stuff out and work on the technology and all of that, but you should definitely hire someone to do it for you. Save your Christmas money and birthday money or float a small loan from your family. It’s not that expensive and totally worth it."}, {"aee6": "Then I kinda-sorta promoted the book."}, {"502b": "There’s a lot more to this. I made a plan, and then didn’t do the plan and had all the steps lined out in the plan. I’ll talk about this soon."}, {"68bd": "Okay, here’s the book."}, {"c863": "Got questions about Taco Jehovah? Here are the answers.Hey! My new book Taco Jehovah is out and it’s been a long-time coming. Some of you have may have some questions about…medium.com"}, {"fa46": "I’m Josh Spilker, a writer and author. I blog about the writing process at Create, Make, Write. My new book is called Taco Jehovah. For more like this, follow this publication:"}, {"9e91": "Create Make WriteThoughts on creativity, writing & makingmedium.com"}]}