{"child": "1968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_251968_1\t1968_2\t1968_3\t1968_4\t1968_5\t1968_6\t1968_7\t1968_8\t1968_9\t1968_10\t1968_11\t1968_12\t1968_13\t1968_14\t1968_15\t1968_16\t1968_17\t1968_18\t1968_19\t1968_20\t1968_21\t1968_22\t1968_23\t1968_24\t1968_25", "title": "How a Password Changed My Life", "content": "“How could she do something like this to me?” said a voice in my head. All the time. Every day. Back in 2011, when everything had gradients, iOS icons made sense, and people used deodorants, I was stuck in middle of a pretty bad depression due to my divorce. Thankfully, I think I was smart enough (and had great people around me) so I found ways to stay afloat. One day I walk into the office, and my day begins at my computer screen. It was all great, until I saw this message: Your password has expired.Click ‘Change password’ to change your password. I’m breathing heavily. I’m staring at the mouse arrow. I read this dumb message in my mind with angry grandpa voice: The password has expired. At my workplace, the Microsoft Exchange server is configured to ask thousands of employees around the planet to change their passwords. Every 30 days. Here is what’s annoying: The server forces us to use at least one UPPERCASE character, at least one lowercase alphabetic character, at least one symbol and at least one number. Oh, and the whole thing can’t be less than 8 characters. And I can’t use any of the same passwords I’ve used in the last 3 months. I was furious that morning. Tuesday, 9:40 a.m. -It was so hot that my torso was already sweaty even though I just got to work. I was late. I was still wearing my helmet. I think I forgot breakfast. Something tastes like cigarette in my mouth. I need to get stuff done before my 10 a.m. meeting and all I have in front of me is a huge waste of my time. So there it was… This input field with a pulsating cursor, waiting for me to type a password that I’ll have to re-enter for the next 30 days. Many times during the day. Then, letting all the frustration go, I remembered a tip I heard from my former boss, Rasmus. Somehow he combined to-do lists with passwords, and I thought to use an augmented variation of that. I’m gonna use a password to change my life. It was obvious that I couldn’t focus on getting things done with my current lifestyle and mood. Of course, there were clear indicators of what I needed to do -or what I had to achieve- in order to regain control of my life, but we often don’t pay attention to these clues. My password became the indicator. My password reminded me that I shouldn’t let myself be victim of my recent break up, and that I’m strong enough to do something about it. My password became: “Forgive@h3r” During my meeting I kept thinking on what I just did. Something drew a smirk on my face. During the rest of week, I had to type this password several times a day. Each time my computer would lock. Each time my screensaver with her photo would appear. Each time I would come back from eating lunch alone. In my mind, I went with the mantra that I didn’t type a password. In my mind, I was reminding myself to “Forgive her”. That simple action changed the way I looked at my ex wife. That constant reminder that I should forgive her, led me to accept the way things happened at the end of my marriage, and embrace a new way of dealing with the depression that I was drowning into. In the following days, my mood improved drastically. By the end of the 2nd week, I noticed that this password became less powerful, and it started to lose its effect. A quick refresh of this ‘mantra’ helped me. I thought to myself I forgive her as I typed it, every time. The healing effect of it came back almost immediately. One month later, my dear exchange server asked me again to renew my password. I thought about the next thing I had to get done. My password became Quit@smoking4ever And guess what happened. I’m not kidding you. I quit smoking overnight. I have a ton of witnesses who could not believe how I did it. I had tried books, e-cigarettes, patches, etc. Nothing worked, but this one trick did. This password was a painful one to type during that month, but doing it helped me to yell at myself in my mind, as I typed that statement. It motivated me to follow my monthly goal. One month later, my password became Save4trip@thailand Guess where I went 3 months later. Thailand. With savings. Thank you, password. Seeing how these reminders helped to materialize my goals kept me motivated and excited. I’ll admit this: It is difficult to come up with your next goal. Sometimes it’s hard to identify what we need to change, or where we need to walk towards to. Make sure your goals are realistic, and avoid being too dreamy when you phrase them. It’s important to build a metric around your goal so you can measure its success along the way. For example, if you’re on a hunt to get a better job, don’t use things like BeTh3NumberOne! but instead go with KickASS@LinkedIn! and use the new connections, groups and number of resumes sent as a metric to validate your efforts to land a new job. Being the number one is great, but being able to measure where you are and where you’re going is important, specially when there’s a big gap between those two points. So why does this trick work? In its simplest form, a password enables you to get somewhere, in your digital world. Say, to copy a file, to unlock a computer, to email somebody. This feeling of micro achievements, this thought of ‘my mantra helps me to get things done’ can build up a momentum that motivates you to stay focused on achieving your monthly goals. It’s a tiny habit that has the power to transform. It worked with me. I’m sure it will work with you. This is how I learned that I can truly change my life, if I play it right. I kept doing this repeatedly month after month, with great results. Here is a simplified extract of what some of my passwords have been in the last 2 years, so you get an idea of how my life has changed, thanks to this method: And the one for last month: I still await very anxiously each month so I can change my password into a phrase that motivates me to focus on something that I need to get done. This method has consistently worked for me for the last 2 years, and I have shared it with a few close friends and relatives. I didn’t think it was a breakthrough in tiny-habits but it did have a great impact in my life, so I thought to share it with you all. Give it a try! Write these statements with the right mindset and attitude, and you’ll change your life. Let me know how it works for you! Remember, for added security, try to be more complex with the words. Add symbols or numbers, make it longer, and scramble a bit the beginning or the ending of your password string. S4f3ty_f1rst! Pass the tip to those who might need it. Updated on Jun 21, 2014: She said yes. — Tweet or email me, and spread the ☺ around. Plus, if you’re interested in more of this, I’m writing a book! Subscribe for updates on my site. ", "name": "1968", "parent": "", "sentences": [{"62af": "“How could she do something like this to me?” said a voice in my head. All the time. Every day."}, {"6388": "Back in 2011, when everything had gradients, iOS icons made sense, and people used deodorants, I was stuck in middle of a pretty bad depression due to my divorce."}, {"da8a": "Thankfully, I think I was smart enough (and had great people around me) so I found ways to stay afloat."}, {"32e7": "One day I walk into the office, and my day begins at my computer screen. It was all great, until I saw this message:"}, {"6e87": "Your password has expired.Click ‘Change password’ to change your password."}, {"552d": "I’m breathing heavily. I’m staring at the mouse arrow."}, {"9619": "I read this dumb message in my mind with angry grandpa voice: The password has expired."}, {"7cdd": "At my workplace, the Microsoft Exchange server is configured to ask thousands of employees around the planet to change their passwords. Every 30 days."}, {"8221": "Here is what’s annoying: The server forces us to use at least one UPPERCASE character, at least one lowercase alphabetic character, at least one symbol and at least one number. Oh, and the whole thing can’t be less than 8 characters. And I can’t use any of the same passwords I’ve used in the last 3 months."}, {"1689": "I was furious that morning. Tuesday, 9:40 a.m. -It was so hot that my torso was already sweaty even though I just got to work. I was late. I was still wearing my helmet. I think I forgot breakfast. Something tastes like cigarette in my mouth. I need to get stuff done before my 10 a.m. meeting and all I have in front of me is a huge waste of my time."}, {"d2fe": "So there it was… This input field with a pulsating cursor, waiting for me to type a password that I’ll have to re-enter for the next 30 days. Many times during the day."}, {"af99": "Then, letting all the frustration go, I remembered a tip I heard from my former boss, Rasmus. Somehow he combined to-do lists with passwords, and I thought to use an augmented variation of that."}, {"7e9e": "I’m gonna use a password to change my life."}, {"43ab": "It was obvious that I couldn’t focus on getting things done with my current lifestyle and mood. Of course, there were clear indicators of what I needed to do -or what I had to achieve- in order to regain control of my life, but we often don’t pay attention to these clues."}, {"6434": "My password became the indicator. My password reminded me that I shouldn’t let myself be victim of my recent break up, and that I’m strong enough to do something about it."}, {"5885": "My password became: “Forgive@h3r”"}, {"b55b": "During my meeting I kept thinking on what I just did. Something drew a smirk on my face."}, {"ea41": "During the rest of week, I had to type this password several times a day. Each time my computer would lock. Each time my screensaver with her photo would appear. Each time I would come back from eating lunch alone."}, {"71c7": "In my mind, I went with the mantra that I didn’t type a password. In my mind, I was reminding myself to “Forgive her”."}, {"3492": "That simple action changed the way I looked at my ex wife. That constant reminder that I should forgive her, led me to accept the way things happened at the end of my marriage, and embrace a new way of dealing with the depression that I was drowning into."}, {"c72b": "In the following days, my mood improved drastically. By the end of the 2nd week, I noticed that this password became less powerful, and it started to lose its effect. A quick refresh of this ‘mantra’ helped me. I thought to myself I forgive her as I typed it, every time. The healing effect of it came back almost immediately."}, {"c2da": "One month later, my dear exchange server asked me again to renew my password. I thought about the next thing I had to get done."}, {"c5aa": "My password became Quit@smoking4ever"}, {"b1dc": "And guess what happened. I’m not kidding you. I quit smoking overnight."}, {"a424": "I have a ton of witnesses who could not believe how I did it. I had tried books, e-cigarettes, patches, etc. Nothing worked, but this one trick did."}, {"ff7e": "This password was a painful one to type during that month, but doing it helped me to yell at myself in my mind, as I typed that statement. It motivated me to follow my monthly goal."}, {"bde2": "One month later, my password became Save4trip@thailand"}, {"15f0": "Guess where I went 3 months later. Thailand."}, {"81fc": "With savings."}, {"05d9": "Thank you, password."}, {"682b": "Seeing how these reminders helped to materialize my goals kept me motivated and excited. I’ll admit this: It is difficult to come up with your next goal. Sometimes it’s hard to identify what we need to change, or where we need to walk towards to."}, {"69c3": "Make sure your goals are realistic, and avoid being too dreamy when you phrase them. It’s important to build a metric around your goal so you can measure its success along the way. For example, if you’re on a hunt to get a better job, don’t use things like BeTh3NumberOne! but instead go with KickASS@LinkedIn! and use the new connections, groups and number of resumes sent as a metric to validate your efforts to land a new job. Being the number one is great, but being able to measure where you are and where you’re going is important, specially when there’s a big gap between those two points."}, {"38f4": "So why does this trick work? In its simplest form, a password enables you to get somewhere, in your digital world. Say, to copy a file, to unlock a computer, to email somebody. This feeling of micro achievements, this thought of ‘my mantra helps me to get things done’ can build up a momentum that motivates you to stay focused on achieving your monthly goals. It’s a tiny habit that has the power to transform."}, {"2ecf": "It worked with me. I’m sure it will work with you."}, {"2106": "This is how I learned that I can truly change my life, if I play it right. I kept doing this repeatedly month after month, with great results."}, {"5963": "Here is a simplified extract of what some of my passwords have been in the last 2 years, so you get an idea of how my life has changed, thanks to this method:"}, {"f48b": "And the one for last month:"}, {"a83e": "I still await very anxiously each month so I can change my password into a phrase that motivates me to focus on something that I need to get done."}, {"9776": "This method has consistently worked for me for the last 2 years, and I have shared it with a few close friends and relatives. I didn’t think it was a breakthrough in tiny-habits but it did have a great impact in my life, so I thought to share it with you all."}, {"5133": "Give it a try! Write these statements with the right mindset and attitude, and you’ll change your life. Let me know how it works for you!"}, {"ca3f": "Remember, for added security, try to be more complex with the words. Add symbols or numbers, make it longer, and scramble a bit the beginning or the ending of your password string. S4f3ty_f1rst!"}, {"f3b3": "Pass the tip to those who might need it."}, {"76cc": "Updated on Jun 21, 2014: She said yes."}, {"1a7c": "— Tweet or email me, and spread the ☺ around."}, {"a6a1": "Plus, if you’re interested in more of this, I’m writing a book! Subscribe for updates on my site."}]}