{"child": "1974_1\t1974_2\t1974_31974_1\t1974_2\t1974_31974_1\t1974_2\t1974_3", "title": "Why I’m joining IDAGIO — a classical music startup, and moving to Berlin", "content": "Moving on from MUSIC x TECH x FUTURE as an agency Why I’m joining IDAGIO — a classical music startup, and moving to Berlin Today I’m excited to announce that I’m joining IDAGIO, a streaming service for classical music lovers, as Director of Product. I’m already in the process of relocating to Berlin, where I’ll be joining the team later this month. In this post, I want to explain why I so strongly believe in this niche focused music service and IDAGIO’s mission. I also want to shed light on the future of MUSIC x TECH x FUTURE as a newsletter, a type of media, and an agency. (tl;dr: the newsletter lives on!) Two months ago, a friend whom I had worked with in Moscow, at music streaming service Zvooq, forwarded me a vacancy as a Twitter DM. By then, I had developed a kind of mental auto-ignore, because friends kept sending me junior level vacancies in music companies. I was never looking for a ‘job’ — I had a job (but thanks for thinking of me ❤️). However, I trusted that this friend knew me better as a professional, so I opened the link. I was immediately intrigued. I hadn’t heard of IDAGIO before, but I’ve spent a lot of time thinking about niche services. At one point, the plan for Zvooq was to not build a typical one-size-fits-all app like all the other music streaming services are doing, but instead it would be to split different types of music-related behaviours into smaller apps. The goal would then become to monopolize those behaviours: like Google has monopolized search behaviour (now called Googling), and Shazam has monopolized Shazaming. Long term, it would allow us to expand that ecosystem of apps beyond streaming content, so we would be able to monetize behaviours with higher margins than behaviours related to music listening. We ended up building just one, Fonoteka, before we had to switch strategies due to a mix of market reality, licensing terms, and burn rate. That was fine: it was what the business needed, and what Russia as a market needed. Since then, there have been a number of niche music ideas, like services for indie rock, high quality streaming, etc. And while those are all commendable, I was never quite interested in them, because it just seemed like those services would not have a strong enough strategic competitive advantage in the face of tech giants with bulging coffers. Their offers were often also just marginally better, but getting people to install an app and build a habit around your service, unlearn their old solution, learn to do it your way… that’s a huge thing to ask of people, especially once you need to go beyond the super early adopters. But niche works on a local level. You can see it with Yandex.Music and Zvooq in Russia, with Anghami in the Middle East, and Gaana in India. Over the last decade, I’ve lived in Russia, Bulgaria, Turkey, and The Netherlands (where I’m from). Each country has unique ways of interacting with music. Music has a different place in each culture. I think local music services work, because they combine catalogues and local taste with a deep understanding of how their target audience connects to music. It allows them to build something catering exactly to those behaviours. It’s music and behaviour combined. When I started talking to the IDAGIO team, I soon understood that they too combine these elements. Classical music, in all its shapes and forms, has many peculiarities, which will remain an object of study for me for the next years. The fact that the same work often has a multitude of recordings by different performers already sets it apart. One can map a lot of behaviours around navigation, exploring, and comparison to just this one fact. Despite being younger and having more modest funding, IDAGIO has already built a product that caters better to classical music fans than the other streaming services do (and also serves lossless streams). Understanding that, I was fast convinced that this was something I seriously needed to consider. So I got on a plane and met the team. Over the course of three days, we ran a condensed design sprint, isolated a problem we wanted to tackle together, interviewed expert team members, explored options, drew up solutions, and prototyped a demo to test with the target audience. It’s an intense exercise, especially when you’re also being sized up as a potential team member, but the team did such a good job at making me feel welcome and at home (❤️). Through our conversations, lunches, and collaboration, I was impressed with the team’s intelligence, creativity, and general thoughtfulness. Then I spent some extra time in Berlin — after all, I’d be moving there. Aforementioned friend took me to a medical museum with a room full of glass cabinets containing jars with contents which will give me nightmares for years to come. Besides that, I met a bunch of other friends, music tech professionals, and entrepreneurs, who collectively convinced me of the high caliber of talent and creative inspiration in the city. Returning home, I made a decision I didn’t expect to make this year, nor in the years to come. A decision to make a radical switch in priorities. Motivation, for me, comes from the capacity to grow and to do things with meaningful impact. MUSIC x TECH x FUTURE has exposed me to a lot of different people, a lot of different problems, and has allowed me to do what I find interesting, what I’m good at, but also what I grow and learn from. With IDAGIO I can do all of the latter, but with depth, and with a team. Classical music online has been sidelined a bit. It makes a lot of sense when you place it in a historical perspective: a lot has changed in recent years. The web’s demographic skews older now. You can notice this by counting the number of family members on Facebook. The internet used to be something most adults would just use for work, so if you were building entertainment services, you target the young, early adopter demographic. That’s pop music, rock, electronic, hiphop, etc. Classical was there, sure, but Spotify wasn’t designed around it, iTunes wasn’t, YouTube wasn’t. Now we’re actually reaching a new phase for music online. The streaming foundation has been built. Streaming is going mainstream. The platforms from the 2007–2009 wave are maturing and looking beyond their original early adopter audiences… So we’re going to see a lot of early adopters that are not properly served anymore. They’re going to migrate, look for new homes. A very important segment there, one that has always been underserved, are classical music fans. And now, this niche audience is sizeable enough to actually build a service around. Why? Well, the internet has changed since the large last wave of music startups. Mobile is becoming the default way people connect to the web. For adults, this has made the web less of a thing for ‘work’, and has made entertainment more accessible. Connected environments make it easy to send your mobile audio to your home hifi set, or car speakers. The amount of people on the internet has more than doubled. This makes the niche play so much more viable than just a few years ago. It has to be done with love, care, and a very good understanding of whose problem you’re trying to solve (and what that problem is). IDAGIO has exactly the right brilliant minds in place to pull this off and I’m flattered that in 2 weeks time, I’ll get to spend 2,000 hours a year with them. What happens to the agency? I’ll be winding down the agency side of MxTxF. This means I’m not taking on any more clients, but I’m happy to refer you to great people I know. Some longer term projects, that just take a couple of hours per week, I’ll keep on to bring to completion. What happens to the newsletter? The newsletter goes on! I get a lot of personal fulfilment out of it. The agency was born out of the newsletter, so who knows what more it will spawn. I’m actually figuring out a way to add audio and video content to the mix. I expect Midem and Sónar+D next June will be pilots for that. Berlin is a great place for music tech, so if anything, I hope the newsletter will only get more interesting as time goes on. Besides the personal fulfilment, it allows me to be in touch with this wonderful community, to meet fascinating people, and occasionally to help organise a panel and bring some of my favourite minds into the same room at the same time. If you’d like to support the newsletter, you can help me out on Patreon. You can become a patron of the newsletter — with your support, I can add extra resources to the newsletter, which will let me push the content to the next level (high on the list: a decent camera). Elgar making an early recording of the work in 1920. Those pipes are acoustic recording horns, which were piped to a diaphragm which would vibrate a cutting stylus — directly turning sound waves into a material recording. I leave you with Edward Elgar’s Cello Concerto in E Minor, Op. 85, which I discovered as a student, listening to the brilliant Szamár Madár by Venetian Snares in which it is sampled. ▶️ Cello Concerto in E Minor, Op. 85 You can listen to the work, in full, on IDAGIO. I’d love to hear about your favourite works and recordings. Feel free to email me on bg@idagio.com, with a link, and tell me what I should listen for. ", "name": "1974", "parent": "", "sentences": [{"abd2": "Moving on from MUSIC x TECH x FUTURE as an agency"}, {"5b37": "Why I’m joining IDAGIO — a classical music startup, and moving to Berlin"}, {"97fa": "Today I’m excited to announce that I’m joining IDAGIO, a streaming service for classical music lovers, as Director of Product. I’m already in the process of relocating to Berlin, where I’ll be joining the team later this month."}, {"5411": "In this post, I want to explain why I so strongly believe in this niche focused music service and IDAGIO’s mission. I also want to shed light on the future of MUSIC x TECH x FUTURE as a newsletter, a type of media, and an agency. (tl;dr: the newsletter lives on!)"}, {"2d10": "Two months ago, a friend whom I had worked with in Moscow, at music streaming service Zvooq, forwarded me a vacancy as a Twitter DM. By then, I had developed a kind of mental auto-ignore, because friends kept sending me junior level vacancies in music companies. I was never looking for a ‘job’ — I had a job (but thanks for thinking of me ❤️). However, I trusted that this friend knew me better as a professional, so I opened the link."}, {"4d5d": "I was immediately intrigued. I hadn’t heard of IDAGIO before, but I’ve spent a lot of time thinking about niche services. At one point, the plan for Zvooq was to not build a typical one-size-fits-all app like all the other music streaming services are doing, but instead it would be to split different types of music-related behaviours into smaller apps. The goal would then become to monopolize those behaviours: like Google has monopolized search behaviour (now called Googling), and Shazam has monopolized Shazaming. Long term, it would allow us to expand that ecosystem of apps beyond streaming content, so we would be able to monetize behaviours with higher margins than behaviours related to music listening."}, {"c341": "We ended up building just one, Fonoteka, before we had to switch strategies due to a mix of market reality, licensing terms, and burn rate. That was fine: it was what the business needed, and what Russia as a market needed."}, {"91a4": "Since then, there have been a number of niche music ideas, like services for indie rock, high quality streaming, etc. And while those are all commendable, I was never quite interested in them, because it just seemed like those services would not have a strong enough strategic competitive advantage in the face of tech giants with bulging coffers. Their offers were often also just marginally better, but getting people to install an app and build a habit around your service, unlearn their old solution, learn to do it your way… that’s a huge thing to ask of people, especially once you need to go beyond the super early adopters."}, {"16e2": "But niche works on a local level. You can see it with Yandex.Music and Zvooq in Russia, with Anghami in the Middle East, and Gaana in India."}, {"ae26": "Over the last decade, I’ve lived in Russia, Bulgaria, Turkey, and The Netherlands (where I’m from). Each country has unique ways of interacting with music. Music has a different place in each culture. I think local music services work, because they combine catalogues and local taste with a deep understanding of how their target audience connects to music. It allows them to build something catering exactly to those behaviours. It’s music and behaviour combined."}, {"0c91": "When I started talking to the IDAGIO team, I soon understood that they too combine these elements. Classical music, in all its shapes and forms, has many peculiarities, which will remain an object of study for me for the next years. The fact that the same work often has a multitude of recordings by different performers already sets it apart. One can map a lot of behaviours around navigation, exploring, and comparison to just this one fact."}, {"7b15": "Despite being younger and having more modest funding, IDAGIO has already built a product that caters better to classical music fans than the other streaming services do (and also serves lossless streams). Understanding that, I was fast convinced that this was something I seriously needed to consider."}, {"5f5b": "So I got on a plane and met the team. Over the course of three days, we ran a condensed design sprint, isolated a problem we wanted to tackle together, interviewed expert team members, explored options, drew up solutions, and prototyped a demo to test with the target audience. It’s an intense exercise, especially when you’re also being sized up as a potential team member, but the team did such a good job at making me feel welcome and at home (❤️). Through our conversations, lunches, and collaboration, I was impressed with the team’s intelligence, creativity, and general thoughtfulness."}, {"ce89": "Then I spent some extra time in Berlin — after all, I’d be moving there. Aforementioned friend took me to a medical museum with a room full of glass cabinets containing jars with contents which will give me nightmares for years to come. Besides that, I met a bunch of other friends, music tech professionals, and entrepreneurs, who collectively convinced me of the high caliber of talent and creative inspiration in the city."}, {"23c2": "Returning home, I made a decision I didn’t expect to make this year, nor in the years to come. A decision to make a radical switch in priorities."}, {"3fcd": "Motivation, for me, comes from the capacity to grow and to do things with meaningful impact. MUSIC x TECH x FUTURE has exposed me to a lot of different people, a lot of different problems, and has allowed me to do what I find interesting, what I’m good at, but also what I grow and learn from. With IDAGIO I can do all of the latter, but with depth, and with a team."}, {"31fd": "Classical music online has been sidelined a bit. It makes a lot of sense when you place it in a historical perspective: a lot has changed in recent years. The web’s demographic skews older now. You can notice this by counting the number of family members on Facebook. The internet used to be something most adults would just use for work, so if you were building entertainment services, you target the young, early adopter demographic. That’s pop music, rock, electronic, hiphop, etc. Classical was there, sure, but Spotify wasn’t designed around it, iTunes wasn’t, YouTube wasn’t."}, {"9b83": "Now we’re actually reaching a new phase for music online. The streaming foundation has been built. Streaming is going mainstream. The platforms from the 2007–2009 wave are maturing and looking beyond their original early adopter audiences… So we’re going to see a lot of early adopters that are not properly served anymore. They’re going to migrate, look for new homes. A very important segment there, one that has always been underserved, are classical music fans. And now, this niche audience is sizeable enough to actually build a service around."}, {"e8b9": "Why? Well, the internet has changed since the large last wave of music startups. Mobile is becoming the default way people connect to the web. For adults, this has made the web less of a thing for ‘work’, and has made entertainment more accessible. Connected environments make it easy to send your mobile audio to your home hifi set, or car speakers. The amount of people on the internet has more than doubled."}, {"0838": "This makes the niche play so much more viable than just a few years ago. It has to be done with love, care, and a very good understanding of whose problem you’re trying to solve (and what that problem is). IDAGIO has exactly the right brilliant minds in place to pull this off and I’m flattered that in 2 weeks time, I’ll get to spend 2,000 hours a year with them."}, {"431e": "What happens to the agency?"}, {"63d0": "I’ll be winding down the agency side of MxTxF. This means I’m not taking on any more clients, but I’m happy to refer you to great people I know. Some longer term projects, that just take a couple of hours per week, I’ll keep on to bring to completion."}, {"eab8": "What happens to the newsletter?"}, {"9517": "The newsletter goes on! I get a lot of personal fulfilment out of it. The agency was born out of the newsletter, so who knows what more it will spawn. I’m actually figuring out a way to add audio and video content to the mix. I expect Midem and Sónar+D next June will be pilots for that. Berlin is a great place for music tech, so if anything, I hope the newsletter will only get more interesting as time goes on."}, {"638d": "Besides the personal fulfilment, it allows me to be in touch with this wonderful community, to meet fascinating people, and occasionally to help organise a panel and bring some of my favourite minds into the same room at the same time."}, {"e1c5": "If you’d like to support the newsletter, you can help me out on Patreon. You can become a patron of the newsletter — with your support, I can add extra resources to the newsletter, which will let me push the content to the next level (high on the list: a decent camera)."}, {"dfbb": "Elgar making an early recording of the work in 1920. Those pipes are acoustic recording horns, which were piped to a diaphragm which would vibrate a cutting stylus — directly turning sound waves into a material recording."}, {"ec33": "I leave you with Edward Elgar’s Cello Concerto in E Minor, Op. 85, which I discovered as a student, listening to the brilliant Szamár Madár by Venetian Snares in which it is sampled."}, {"8fb7": "▶️ Cello Concerto in E Minor, Op. 85"}, {"11de": "You can listen to the work, in full, on IDAGIO."}, {"021c": "I’d love to hear about your favourite works and recordings. Feel free to email me on bg@idagio.com, with a link, and tell me what I should listen for."}]}