{"content": "Our Surefire Predictions for Round 1 of the NBA Playoffs Come look into our crystal ball … Finally, the basketball games that matter! The playoffs are here, and we can’t wait to get them started. We’re so excited, we already know what’s going to happen. Have a look into the future with us. Playoff Rondo Will Lead the Bulls Past the Celtics Danny Chau: Now that the dust has settled, allow me to clear my throat and shout from the rooftops: Playoff Rondo is the greatest urban legend of the millennium-era NBA. It is what the Mothman is to West Virginia, what La Llorona is to Mexican American culture. A five-year postseason run was met with a five-year hiatus (Playoff Rondo apostles tend to deny the existence of Rondo’s Dallas and Sacramento years). But now he’s back. The player who once scored 44 points in 53 minutes against LeBron in the playoffs; the player who dropped 20 assists at Madison Square Garden; the player who logged a 29–18–13 triple-double against Cleveland in 2010, the first of three consecutive wins that eliminated LeBron’s no. 1 seed Cavs and forever changed the course of NBA history. THE PLAYER WHO DISLOCATED HIS ELBOW, POPPED IT BACK INTO PLACE, AND PLAYED THE REST OF A BASKETBALL GAME ONE-HANDED. He. Is. Back. And he’s about to help the Bulls fall ass-backward into a first-round series win. Russell Westbrook Will Get Into a Fight With Patrick Beverley Jason Gallagher: Russell Westbrook will get suspended at least one game for trying to punch Patrick Beverley. If you think Russ is going to change his style of play in the playoffs, I have some land to sell you. If you think Patrick Beverley is going to let Russell get away with trying to average a series triple-double on him, I have an island to sell you. And if you think Russ is going to take that well, I have a planet that’s double the size of Westbrook’s hatred for Beverley, gift-wrapped in a black trash bag that’s all yours for only 99 cents. Patrick Beverley Will Get Into a Fight With Russell Westbrook Jonathan Tjarks: The last time these two teams faced off in the playoffs, Beverley tore Westbrook’s meniscus by diving at his knees for a steal on a completely unnecessary play when Westbrook was calling for a timeout and walking off the court. Neither player has gotten any more reasonable in the ensuing years. Westbrook still plays out of control, and Beverley still defends out of control. Westbrook is going to break the NBA record for usage rating in this series with Beverley guarding him, and Beverley is way too competitive to not take that personally. The only question is how many of their teammates get roped into the melee when these two square off, and what suspensions will result from it. There Will Be No Upsets Kevin O’Connor: In only five of the 33 years since the NBA switched to a 16-team playoff format have all four of the top seeds advanced in each conference. It occurred in 1986, 1997, 2002, 2004, and 2008. Every other season had at least one upset. I’m predicting that for the first time since 2008, all eight of the top seeds will win their first-round series. I have little doubt the Celtics, Cavaliers, Raptors, and Wizards all will advance in the East. The Warriors and Spurs will take care of business. The Rockets outscored the Thunder by only 2.3 points per 100 possessions this season, but Houston has more firepower, so it should come out on top. Clippers-Jazz is the series I’m most unsure of. But the Clippers are playing elite basketball with Chris Paul, and they have home-court advantage, so they’re my choice. I’m ready for a playoff in which we see the best of the best duel it out deep into the postseason. Portland Will Push Golden State to Six Juliet Litman: I believe in the Trail Blazers. I don’t believe they’ll be the We Believe Blazers on the 10th anniversary of We Believe Warriors, but I won’t write them off. The Blazers will get two wins and the Portland–Golden State series will be one of the most contested of the first round. Damian Lillard has had so many bust games against Steph Curry and Co. that he is due for a breakout. Jusuf Nurkic is hurt, but if he’s back by game 3 or 4, he could be a problem for the Dubs. Hopefully he will come back, because we deserve to see how Draymond Green combats the Bosnian beast. The Warriors are Finals-bound, but the first round won’t be easy. LeBron and Tyronn Lue Will Butt Heads Haley O’Shaughnessy: Remember David Blatt? LeBron James doesn’t. When Cleveland was looking like the stinkiest selection on the entire cheese board of contenders last season, Blatt was fired. Not only was the man let go before the franchise won its first championship, but Blatt was also part of the year’s most emasculating coaching dynamic. LeBron respected his former coach so little that the King went so far as to wipe Blatt’s play off the whiteboard and call his own. Now Cleveland enters the postseason beginning to smell again: Its defense is the worst of all playoff teams (worse than even Portland) and the team has dropped four straight, each loss more discouraging than the last. In the season and a half since Tyronn Lue took over, his coach-player relationship with his friend LeBron has seemed healthy (or as normal as one can be with a GM who also starts at forward), even during last year’s stressful playoffs. But the Cavaliers’ first-round matchup is against the Pacers, with whom LeBron shares postseason beef. It seems all the less likely that the Cavs will get out of the gate smoothly, and when they don’t, the grace period will be over. It will not only be the refs, or Tristan Thompson, that LeBron absolutely loses his shit to on live television, but also his coach and his friend, Lue. Dahntay Jones Will Get in a Fight Rodger Sherman: I don’t know what to predict from the Cavs. They seem like the obvious best team in the East, and yet they’ve been mediocre lately. But I do know that Dahntay Jones is going to punch somebody in the groin. Jones used to be a competent defender with a reputation for dirtiness. He’s not anymore, but he’s still dirty. He was unsigned for the 2013–14 season, made headlines in 2014–15 only for intentionally bumping Draymond Green after a game Jones didn’t play in, and was signed by the Cavs on the last day of last year’s regular season. Then, in the playoffs, he smacked Bismack Biyombo in the junk. If Cleveland thought Jones was good at basketball, it would have signed him 81 games ago. Instead, it has again signed him on the last day of the regular season. Beware, genitals of the Eastern Conference. The Spurs Will Lose Early Chris Ryan: I am inside the NBA Cerebro right now, and when I look at the San Antonio Spurs, I get real 2010–11 vibrations. Both were 61-win teams with veteran frontcourts (swap Tim Duncan and Antonio McDyess for LaMarcus Aldridge and Pau Gasol). Both had great net ratings (second this year, third in 2010–11) and cruised through the regular season only to face Memphis in the playoffs. In 2011, the Spurs lost to the Grizz in six games, becoming only the second 1-seed to lose to an 8-seed since the switch to a best-of-seven first round. Could history (sort of) repeat itself? I don’t think this Grizz team has the same mythical vibe (no O.J. Mayo, for starters), but I do think this Spurs team is beatable. The underlying numbers — best defense, top-10 offense — suggest title contender, but I still haven’t gotten over them blowing that 22-point lead to the Warriors at home at the end of March. ", "child": "2_1\t2_2\t2_3\t2_4\t2_5\t2_6", "title": "Our Surefire Predictions for Round 1 of the NBA Playoffs", "parent": "", "sentences": [{"83f5": "Our Surefire Predictions for Round 1 of the NBA Playoffs"}, {"60a3": "Come look into our crystal ball …"}, {"c599": "Finally, the basketball games that matter! The playoffs are here, and we can’t wait to get them started. We’re so excited, we already know what’s going to happen. Have a look into the future with us."}, {"8b7f": "Playoff Rondo Will Lead the Bulls Past the Celtics"}, {"624e": "Danny Chau: Now that the dust has settled, allow me to clear my throat and shout from the rooftops:"}, {"92db": "Playoff Rondo is the greatest urban legend of the millennium-era NBA. It is what the Mothman is to West Virginia, what La Llorona is to Mexican American culture. A five-year postseason run was met with a five-year hiatus (Playoff Rondo apostles tend to deny the existence of Rondo’s Dallas and Sacramento years). But now he’s back. The player who once scored 44 points in 53 minutes against LeBron in the playoffs; the player who dropped 20 assists at Madison Square Garden; the player who logged a 29–18–13 triple-double against Cleveland in 2010, the first of three consecutive wins that eliminated LeBron’s no. 1 seed Cavs and forever changed the course of NBA history. THE PLAYER WHO DISLOCATED HIS ELBOW, POPPED IT BACK INTO PLACE, AND PLAYED THE REST OF A BASKETBALL GAME ONE-HANDED."}, {"1182": "He. Is. Back."}, {"463f": "And he’s about to help the Bulls fall ass-backward into a first-round series win."}, {"edee": "Russell Westbrook Will Get Into a Fight With Patrick Beverley"}, {"983f": "Jason Gallagher: Russell Westbrook will get suspended at least one game for trying to punch Patrick Beverley."}, {"b04d": "If you think Russ is going to change his style of play in the playoffs, I have some land to sell you. If you think Patrick Beverley is going to let Russell get away with trying to average a series triple-double on him, I have an island to sell you. And if you think Russ is going to take that well, I have a planet that’s double the size of Westbrook’s hatred for Beverley, gift-wrapped in a black trash bag that’s all yours for only 99 cents."}, {"0a88": "Patrick Beverley Will Get Into a Fight With Russell Westbrook"}, {"d5ec": "Jonathan Tjarks: The last time these two teams faced off in the playoffs, Beverley tore Westbrook’s meniscus by diving at his knees for a steal on a completely unnecessary play when Westbrook was calling for a timeout and walking off the court. Neither player has gotten any more reasonable in the ensuing years. Westbrook still plays out of control, and Beverley still defends out of control. Westbrook is going to break the NBA record for usage rating in this series with Beverley guarding him, and Beverley is way too competitive to not take that personally. The only question is how many of their teammates get roped into the melee when these two square off, and what suspensions will result from it."}, {"9ff7": "There Will Be No Upsets"}, {"a19f": "Kevin O’Connor: In only five of the 33 years since the NBA switched to a 16-team playoff format have all four of the top seeds advanced in each conference. It occurred in 1986, 1997, 2002, 2004, and 2008. Every other season had at least one upset. I’m predicting that for the first time since 2008, all eight of the top seeds will win their first-round series. I have little doubt the Celtics, Cavaliers, Raptors, and Wizards all will advance in the East. The Warriors and Spurs will take care of business. The Rockets outscored the Thunder by only 2.3 points per 100 possessions this season, but Houston has more firepower, so it should come out on top. Clippers-Jazz is the series I’m most unsure of. But the Clippers are playing elite basketball with Chris Paul, and they have home-court advantage, so they’re my choice. I’m ready for a playoff in which we see the best of the best duel it out deep into the postseason."}, {"94b1": "Portland Will Push Golden State to Six"}, {"a1f8": "Juliet Litman: I believe in the Trail Blazers. I don’t believe they’ll be the We Believe Blazers on the 10th anniversary of We Believe Warriors, but I won’t write them off. The Blazers will get two wins and the Portland–Golden State series will be one of the most contested of the first round. Damian Lillard has had so many bust games against Steph Curry and Co. that he is due for a breakout. Jusuf Nurkic is hurt, but if he’s back by game 3 or 4, he could be a problem for the Dubs. Hopefully he will come back, because we deserve to see how Draymond Green combats the Bosnian beast. The Warriors are Finals-bound, but the first round won’t be easy."}, {"d6d0": "LeBron and Tyronn Lue Will Butt Heads"}, {"a048": "Haley O’Shaughnessy: Remember David Blatt? LeBron James doesn’t. When Cleveland was looking like the stinkiest selection on the entire cheese board of contenders last season, Blatt was fired. Not only was the man let go before the franchise won its first championship, but Blatt was also part of the year’s most emasculating coaching dynamic. LeBron respected his former coach so little that the King went so far as to wipe Blatt’s play off the whiteboard and call his own."}, {"da88": "Now Cleveland enters the postseason beginning to smell again: Its defense is the worst of all playoff teams (worse than even Portland) and the team has dropped four straight, each loss more discouraging than the last. In the season and a half since Tyronn Lue took over, his coach-player relationship with his friend LeBron has seemed healthy (or as normal as one can be with a GM who also starts at forward), even during last year’s stressful playoffs. But the Cavaliers’ first-round matchup is against the Pacers, with whom LeBron shares postseason beef. It seems all the less likely that the Cavs will get out of the gate smoothly, and when they don’t, the grace period will be over. It will not only be the refs, or Tristan Thompson, that LeBron absolutely loses his shit to on live television, but also his coach and his friend, Lue."}, {"6115": "Dahntay Jones Will Get in a Fight"}, {"7e02": "Rodger Sherman: I don’t know what to predict from the Cavs. They seem like the obvious best team in the East, and yet they’ve been mediocre lately. But I do know that Dahntay Jones is going to punch somebody in the groin."}, {"481f": "Jones used to be a competent defender with a reputation for dirtiness. He’s not anymore, but he’s still dirty. He was unsigned for the 2013–14 season, made headlines in 2014–15 only for intentionally bumping Draymond Green after a game Jones didn’t play in, and was signed by the Cavs on the last day of last year’s regular season. Then, in the playoffs, he smacked Bismack Biyombo in the junk."}, {"ec03": "If Cleveland thought Jones was good at basketball, it would have signed him 81 games ago. Instead, it has again signed him on the last day of the regular season. Beware, genitals of the Eastern Conference."}, {"c546": "The Spurs Will Lose Early"}, {"80da": "Chris Ryan: I am inside the NBA Cerebro right now, and when I look at the San Antonio Spurs, I get real 2010–11 vibrations. Both were 61-win teams with veteran frontcourts (swap Tim Duncan and Antonio McDyess for LaMarcus Aldridge and Pau Gasol). Both had great net ratings (second this year, third in 2010–11) and cruised through the regular season only to face Memphis in the playoffs. In 2011, the Spurs lost to the Grizz in six games, becoming only the second 1-seed to lose to an 8-seed since the switch to a best-of-seven first round. Could history (sort of) repeat itself? I don’t think this Grizz team has the same mythical vibe (no O.J. Mayo, for starters), but I do think this Spurs team is beatable. The underlying numbers — best defense, top-10 offense — suggest title contender, but I still haven’t gotten over them blowing that 22-point lead to the Warriors at home at the end of March."}], "name": "2"}