{"sentences": [{"59f1": "David Fahrenthold: The behind-the-scenes story of my year covering Trump"}, {"46e8": "How a rally in Iowa and a campaign manager’s falsehood set a year of investigations in motion"}, {"0af6": "“Arnold and Tim, if you’d come up, we’re going to give you a nice, beautiful check,” Donald Trump said. He held up an oversize check, the kind they give to people who win golf tournaments. It was for $100,000. In the top-left corner the check said: “The Donald J. Trump Foundation.”"}, {"f65f": "Along the bottom, it had the slogan of Trump’s presidential campaign: “Make America Great Again.”"}, {"314c": "This was in February."}, {"2cf8": "The beginning of it."}, {"51c7": "Trump was in Waterloo, Iowa, for a caucus-day rally at the Five Sullivan Brothers Convention Center — named for five local siblings who had been assigned to the same Navy cruiser in World War II. They all died when the ship went down at Guadalcanal."}, {"aa02": "Trump had stopped his rally to do something presidential candidates don’t normally do. He was giving away money."}, {"a6f4": "Arnold and Tim, whom he had called to the stage, were from a local veterans group. Although their big check had Trump’s name on it, it wasn’t actually Trump’s money. Instead, the cash had been raised from other donors a few days earlier, at a televised fundraiser that Trump had held while he skipped a GOP debate because of a feud with Fox News."}, {"1463": "Trump said he had raised $6 million that night, including a $1 million gift from his own pocket. Now Trump was giving it, a little at a time, to charities in the towns where he held campaign events."}, {"bb15": "“See you in the White House,” one of the men said to Trump, leaving the stage with this check that married a nonprofit’s name and a campaign’s slogan."}, {"10b3": "“He said, ‘We’ll see you in the White House,’ ” Trump repeated to the crowd. “That’s nice.”"}, {"298f": "After that, Trump lost Iowa."}, {"d6d4": "He won New Hampshire."}, {"233c": "Then he stopped giving away money."}, {"c47f": "But as far as I could tell, just over $1.1 million had been given away. Far less than what Trump said he raised. And there was no sign of the $1 million Trump had promised from his own pocket."}, {"b372": "So what happened to the rest of the money?"}, {"3129": "It sounded like an easy question that the Trump campaign could answer quickly. I thought I’d be through with the story in a day or two."}, {"b509": "I was wrong."}, {"69d8": "That was the start of nine months of work for me, trying to dig up the truth about a part of Trump’s life that he wanted to keep secret. I didn’t understand — and I don’t think Trump understood, either — where that one check, and that one question, would lead."}, {"5408": "President-elect Trump speaks in Iowa at a rally at Hy-Vee Hall, Thursday, Dec. 8, 2016, in Des Moines, Iowa. (AP Photo/Andrew Harnik)"}, {"bf9a": "I’ve been a reporter for The Washington Post since 2000, covering everything from homicide scenes in the District to Congress to the World Championship Muskrat Skinning Contest. (People race to see who skins a dead muskrat the fastest. There’s also a beauty pageant. Some women compete in both.)"}, {"5bec": "By the time I got to that Trump event in Waterloo, I’d been covering the 2016 presidential election for 13 months, since the last weeks of 2014. But I had the track record of a mummy’s curse: Just about every campaign I had touched was dead."}, {"4974": "I had, for instance, covered former New York governor George Pataki’s (failed) attempt to get people to recognize him in a New Hampshire Chipotle. Pataki dropped out. I read the collected works of former Arkansas governor Mike Huckabee and made a list of everything the old Baptist preacher had ever condemned as immoral or untoward. The subjects of his condemnation ranged from college-age women going braless to dogs wearing clothes to Beyoncé. Huckabee condemned me. Then he dropped out, too."}, {"7c4e": "I went to St. Louis to write about a speech given by former Texas governor Rick Perry. In the middle of the speech, Perry dropped out."}, {"7c86": "So by the time the New Hampshire primaries were over, the candidates I had covered were kaput. I needed a new beat. While I pondered what that would be, I decided to do a short story about the money Trump had raised for veterans."}, {"0af9": "I wanted to chase down two suspicions I’d brought home with me from that event in Iowa. For one thing, I thought Trump might have broken the law by improperly mixing his foundation with his presidential campaign. I started calling experts."}, {"b58d": "“I think it’s pretty clear that that’s over the line,” Marc S. Owens, the former longtime head of the Internal Revenue Service’s nonprofit division, told me when I called him."}, {"0a52": "Then Owens kept talking, and the story started deflating."}, {"3d0f": "In theory, Owens said, nonprofit groups like the Trump Foundation are “absolutely prohibited” from participating or intervening in a political campaign. But, he said, if the IRS did investigate, it wouldn’t likely start until the Trump Foundation filed its paperwork for 2016. Which wouldn’t be until late 2017. Then an agent would open a case. There went 2018. Finally, Owens said, the IRS might take action: It might even take away the Trump Foundation’s tax-exempt status."}, {"ba58": "In 2019. Or maybe not ever."}, {"8a19": "Owens doubted that the IRS — already under scrutiny from the GOP-run Congress after allegations it had given undue scrutiny to conservative groups — would ever pick a fight with Trump."}, {"11e7": "“I don’t think anything’s going to happen” to Trump, Owens said. “But, theoretically, it could.”"}, {"5fc5": "My other suspicion was that Trump was still sitting on the bulk of the money he had raised for veterans — including the $1 million he had promised from himself."}, {"c0ab": "I asked Trump’s people to account for all this money. They didn’t."}, {"6174": "Then, finally, I got a call."}, {"4bbb": "“The money is fully spent,” Corey Lewandowski, then Trump’s campaign manager, told me in late May. “Mr. Trump’s money is fully spent.”"}, {"f695": "But, Lewandowski told me, the details of Trump’s $1 million in gifts were secret. He wouldn’t say which groups Trump had donated to. Or when. Or in what amounts."}, {"ad10": "This was an important assertion — that Trump had delivered on a signature campaign promise — made without proof. I didn’t want to just take Lewandowksi’s word for it."}, {"1538": "So I tried to prove him right."}, {"5f6f": "I spent a day searching for Trump’s money on Twitter, asking vets’ organizations if they’d gotten any of it. I used Trump’s Twitter handle, @realdonaldtrump, because I wanted Trump to see me searching."}, {"c0ed": "Trump saw."}, {"ce17": "The next night, he called me to say he had just then given away the $1 million, all in one swoop, to a nonprofit run by a friend. That meant when Lewandowski said Trump’s money was “fully spent,” it was actually still in Trump’s pocket."}, {"47fd": "On the phone, I asked Trump: Would you really have given this money away if I hadn’t been asking about it?"}, {"2430": "“You know, you’re a nasty guy,” he said. “You’re really a nasty guy.”"}, {"0aa4": "A few days later, Trump held a news conference in Trump Tower, where he answered my other question. Where was the remainder of the money Trump had raised from other donors, four months earlier? Turns out, it had been sitting in the Trump Foundation, unspent. In this news conference, Trump announced that he had given the last of it away — and he lashed out at the media for asking him to account for the money."}, {"4e4f": "“Instead of being like, ‘Thank you very much, Mr. Trump,’ or ‘Trump did a good job,’ everyone said : ‘Who got it? Who got it? Who got it?’ And you make me look very bad,” Trump said. “I have never received such bad publicity for doing such a good job.”"}, {"186e": "Because my stories had led to this angry moment, I was on “Morning Joe” and CNN and Lawrence O’Donnell. The New York Times and Le Monde referenced my work. My dad wrote to say how proud he was of me. I read pundits predicting that the presidential race itself would change. They said the old trope about Trump — that he was a Teflon candidate, immune to accountability — was now disproved."}, {"16b4": "When I came home from my last TV hit, the kids, ages 4 and 5 months, were asleep. The house was quiet. I was still full of caffeine and do-gooder energy and decided to tidy up."}, {"1b93": "Among the clutter on the coffee table, I found my 4-year-old’s Party Popper, a bright yellow gun that fired confetti. For some reason, I held the gun up to my eye and looked down the barrel, the way Yosemite Sam always does."}, {"92d4": "It looked unloaded."}, {"dc56": "Then, for some reason, I pulled the trigger."}, {"812c": "When I got to the ER, I had a swollen face, metal-foil confetti in my hair and a faint odor of gun smoke. Finally, the doctor could see me."}, {"5432": "“I shot myself in the eye with a glitter gun,” I said. I showed him the Party Popper, which I had brought with me, in case he wanted to send it off to the National Institute of Morons for further study."}, {"7859": "President-Elect Donald J. Trump speaks during a “USA Thank You Tour 2016” in Des Moines, Iowa on Thursday, Dec. 08, 2016. (Photo by Jabin Botsford/The Washington Post)"}, {"2545": "I got home from the hospital with a scratched cornea and a tube of eye ointment. The next day, with some of my dignity permanently lost, I got started on a bigger story."}, {"861b": "The idea for this story had come from our executive editor, Marty Baron. One night, as we both waited for an elevator, Marty offered a suggestion."}, {"ffff": "Why don’t you go beyond Trump’s promises to give to veterans, he said, and look at Trump’s giving to charity, period?"}, {"18dc": "The logic was that Trump had just tried to wiggle out of a charitable promise he’d made on national TV. What, Marty wondered, had he been doing before the campaign, when nobody was looking?"}, {"c8cb": "That reporting process started with a lot of paper."}, {"c0e5": "Working with one of The Post’s ace researchers, Alice Crites, I went digging for records that would reveal Trump’s charitable giving, going back to his early days as a Manhattan developer in the 1980s. We looked at old news clippings, detailing Trump’s public statements. And we looked at tax filings from the Donald J. Trump Foundation, which had been dug out of storage by New York state."}, {"c1d8": "Those two sources told two very different stories."}, {"59d0": "In the news clippings, you could see that Trump had repeatedly made public promises to donate to charity. In the 1980s, for instance, Trump had promised to give away $4 million from sales of his book “The Art of the Deal.” In more recent years, he said he would give away $2.5 million he made off “The Apprentice.” And donated the profits from Trump University. All told, the pledges in those news clips made it seem that Trump had given away more than $12 million."}, {"fb2e": "In more recent clippings, in fact, Trump’s presidential campaign staff said his actual giving had been far higher than that: “tens of millions ” over his lifetime."}, {"d8ee": "The state’s records showed something else."}, {"2036": "They showed that the Trump Foundation — which Trump had set up to give away his own money — had received only a total of $5.5 million from Trump since 1987."}, {"0a9f": "So where was all that other money that he said he had been donating?"}, {"28d0": "“We want to keep them private. We want to keep them quiet,” Allen Weisselberg, the chief financial officer of Trump’s business, had told me about the missing money. “He doesn’t want other charities to see it. Then it becomes like a feeding frenzy.”"}, {"2ee4": "Once again, I didn’t want to take his word for it."}, {"0e9d": "So I set out — using Twitter — to try to prove Trump right."}, {"31db": "I started making a list of charities I thought were most likely to have received money from Trump’s own pocket. Nonprofits that had received donations from the Trump Foundation. Charities whose galas Trump had attended. Causes he’d praised on Twitter."}, {"a218": "In each case, I called the charity and asked if it had ever received a donation from Trump — and, if so, when. Then, I wrote the charity’s name and its response on a legal pad and posted pictures of the legal pad to Twitter."}, {"8ae3": "My list started to grow: 100 charities. 150. 200."}, {"1c15": "In all those calls, a pattern began to emerge. In the years between 2008 and 2015 — when Trump wasn’t giving money to the Trump Foundation — he didn’t seem to have given much to other people’s charities, either. The only gift I could find in that range was from 2009, when he was credited with giving less than $10,000 to the Police Athletic League of New York City."}, {"dd2a": "250 charities."}, {"9864": "As the circus of the 2016 campaign swirled around me — Twitter beefs, Trump’s criticisms of a Gold Star family and a Mexican American federal judge — I stayed focused on this small slice of Trump’s life. After a while, my 4-year-old daughter started talking about the Trump Foundation at dinner, just because her parents talked about nothing else. “He should give the money to the people, so the people get the money,” she said. “It’s not nice.”"}, {"9b0c": "I called 300 charities."}, {"70b4": "325."}, {"4136": "This story started to remind me of one of the weirdest stories I’ve ever done: a 2014 tale about the federal government’s giant paperwork cave."}, {"7629": "The cave was about 45 minutes north of Pittsburgh. The Office of Personnel Management kept federal employees’ personnel records in 28,000 file cabinets inside the caverns of an abandoned limestone mine. There were 600 federal employees down there. Cave clerks. Their job was to assemble and collate paperwork from the caverns and use that paperwork to compute how much individual federal employees would receive in benefits when they retired. The cave clerks worked in an absurdist parody of government inefficiency, which was as slow in 2014 as it was in the 1970s."}, {"5caf": "In reporting jargon, I’d tried the front door: I asked to tour the mine. OPM said no. So then I went looking for windows. I sought out ex-employees, who had firsthand knowledge of the place but weren’t beholden to OPM’s desire for secrecy."}, {"8b2d": "I found them. By piecing together their recollections, I got the story that the government didn’t want me to find."}, {"4ac9": "Now Trump himself was the abandoned limestone mine."}, {"591f": "If he wouldn’t tell me what he had given away, I’d try to find the answer anyway — by talking to charities with firsthand knowledge of what he had given."}, {"e6ad": "When I reached №325 on my list, I yanked on a window, and it gave."}, {"7fdf": "“They ended up purchasing a Michael Israel portrait of Donald Trump,” said Matthew Ladika, the CEO of a Florida children’s charity called HomeSafe."}, {"4eaf": "I had called this charity — which I knew had received $20,000 from the Trump Foundation — to ask if it had ever received anything else, from Trump’s own pocket. It had not. But Ladika told me something I didn’t expect: the reason for that $20,000 gift from Trump’s charity."}, {"33ab": "Trump had used it to buy a portrait of himself."}, {"44c3": "The portrait had been painted by a “speed painter,” who was the entertainment at a charity gala at Trump’s Mar-a-Lago Club. Melania Trump bought it for $20,000. But then, later, Trump paid for it with a check from the Trump Foundation."}, {"c710": "That raised a new set of questions. Tax law prohibits “self-dealing,” which is when charity leaders use their nonprofits’ money to buy things for themselves. If Trump hung that portrait on the wall at one of his resorts, for instance, he’d be breaking the law. So where was the portrait now?"}, {"2661": "I asked Trump’s people. They didn’t respond."}, {"455f": "I tried a Google Images search, feeding it a photo of the portrait, which showed Trump’s painted face."}, {"5721": "“Best guess for this image: Orange,” Google said."}, {"7eb0": "I got a screen full of oranges. Orange juice. Orange Julius. No portraits."}, {"1fd9": "I kept looking, posting details of my search to Twitter. Soon I had attracted a virtual army, ready to join the scavenger hunt. I had begun the year with 4,700 Twitter followers. By September I had more than 60,000 and climbing fast. I began hearing from celebrities and even a few personal heroes, offering their assistance out of the blue. The barbecue columnist for Texas Monthly — an idol to me, as a journalist and a native Texan — was watching videos of other people’s parties taken at a Trump golf resort. He thought he’d spotted the painting in the background (he hadn’t). Kathy Griffin, the actress, called me with her memories about visiting the set of Trump’s “The Celebrity Apprentice.” Mark Cuban, the Dallas Mavericks owner, was sending me links on Twitter, new leads on Trump promises."}, {"4c48": "That army — almost all of them strangers to me — never found the first portrait. But soon there was a new target and a new scavenger hunt."}, {"07f5": "“Google ‘Havi Art Trump,’ ” said a strange voice on the phone one day, calling from the 561 area code. Palm Beach, Fla."}, {"351b": "I did."}, {"23ca": "The Google search revealed a new portrait of Trump. This one was four feet tall, painted by Miami artist Havi Schanz. After a phone call, I confirmed that Trump had purchased it in 2014 at a charity auction run by the Unicorn Children’s Foundation. Once again, he had the Trump Foundation pay the bill."}, {"7e6b": "I needed to find that portrait. I turned to my Twitter followers, putting out a photo of the new $10,000 portrait."}, {"d3b3": "That was at 10:34 a.m."}, {"a349": "By early evening I knew where it was."}, {"668f": "“The Havi Painting was at Doral National in Miami, you can see two separate pics that tourists have taken of it,” wrote Allison Aguilar."}, {"ae81": "I’ve never met Aguilar. I learned later that she is a former HR manager who is now a stay-at-home mother in Atlanta, writing short stories on the side. Days before, looking for the $20,000 portrait, she had scoured the website for Trump’s golf resort at Doral, in Florida, scanning more than 500 user-generated photos of the resort’s rooms, restaurants and golf course."}, {"70f5": "About halfway through, she had spotted another portrait in a photo, hanging on a wall at the resort."}, {"db5d": "Then she saw my tweet, saying that I was now looking for that portrait, too."}, {"748a": "“Oh, now that I’ve seen,” Aguilar remembered thinking."}, {"c6a2": "The TripAdvisor photo she found was dated February 2016."}, {"8d23": "Was the portrait still there?"}, {"f988": "The answer was provided by another stranger."}, {"660e": "Enrique Acevedo, an anchor at the Spanish-language network Univision, saw my tweet that night, broadcasting that Aguilar had traced the portrait to Doral. Acevedo realized that Doral was just a few blocks from the Univision studios. He booked a room for that night."}, {"74c7": "“I used points,” Acevedo said. “I didn’t want to … spend any money on Trump’s property, so I used points.” After his newscast ended, Acevedo checked in and started quizzing the late-night cleaning crews."}, {"236f": "“Have you seen this picture?” he asked. “They said, ‘Oh yeah, it’s downstairs.’ ”"}, {"db1e": "Bingo. Acevedo found the $10,000 portrait, paid for with charity money, hanging on the wall of the resort’s sports bar."}, {"3cb2": "“Hey @Fahrenthold just checked and the portrait is still hanging at the Champions Lounge. How much did you say it cost the Trump Foundation?” he wrote on Twitter that night."}, {"58df": "All of that — from my first request for help to Acevedo’s discovery — had taken less than 14 hours. Together, we had discovered Trump doing exactly what the law said he couldn’t do: using his charity’s money to decorate his resort."}, {"926c": "A Trump spokesman later offered the explanation that the resort was actually doing the foundation a favor, by storing its art free of charge. Tax experts were not impressed by this reasoning."}, {"22c0": "“It’s hard to make an IRS auditor laugh,” one told me. “But this would do it.”"}, {"8317": "On a morning in October, a month before Election Day, a window opened itself."}, {"10f3": "I got a phone call. It was a source, with a video."}, {"81ae": "The first few seconds were jumpy footage of a bus, lumbering through a bland Hollywood backlot. The soundtrack was indistinct mumbling. But then there was Trump’s voice."}, {"8ed6": "“I moved on her, actually. You know, she was down in Palm Beach. I moved on her. And I failed. I’ll admit it,” he was saying. “I did try and f — — her. She was married.”"}, {"6282": "That was 17 seconds in."}, {"45ea": "On the bus were Trump and “Access Hollywood” host Billy Bush. The video, I figured out, had been shot in 2005. The two men were visiting the set of NBC’s “Days of Our Lives,” where Trump was to make a cameo appearance. In a blaze of network synergy, NBC’s “Access Hollywood” was there to see Trump arrive. Trump and Bush were wearing hot microphones."}, {"2f40": "On the bus, Trump told Bush about trying and failing to seduce a woman in Palm Beach. (“I took her out furniture shopping,” he said.)"}, {"93c5": "Trump also described how he kissed and groped women, without asking first."}, {"9fc1": "“And when you’re a star, they let you do it!” Trump said. The thing that stood out to me was the genuine wonder in his voice. He seemed to be saying: I can’t believe it either, but the world lets you get away with this."}, {"1755": "This was not the first time Trump had been recorded having lewd conversations. BuzzFeed, in particular, had found tapes of Trump talking about women with shock jock Howard Stern. (“You could’ve gotten her, right? You could’ve nailed her,” Stern asked him once about Princess Diana, who at the time had recently died. “I think I could have,” Trump said.) But those had been excused, by some, because they were just words. Trump, it seemed, was playing an outrageous version of himself in public, for the entertainment of Stern and his audience."}, {"6da8": "But this video was different. This was Trump talking, in private, about his own conduct: how, when and why he groped women. It was not a story about words. It was about Trump’s actions, which these words revealed for the first time."}, {"a3e4": "I first made myself into Paul Revere of the cubicles, raising alarms around the newsroom and setting people in motion. The Post’s video team started to edit, transcribe and subtitle the footage. They told me they would be ready to post a version of the video at about 3:30 p.m. That was my deadline."}, {"aa0d": "I called NBC to see if they thought the video was a hoax. I reached out to a spokeswoman for Billy Bush and a publicist for Arianne Zucker, the soap-opera actress in the video who escorted Trump and Bush around the studio. And I reached out to Trump’s spokeswoman, Hope Hicks. I sent her the transcript of the video. I asked:"}, {"ac05": "“1.)Does Mr. Trump have any reason to believe that it is not authentic, and that he did not say these things? 2.)Does Mr. Trump recall that conversation? If so, does he believe there is anything that was *not* captured in this transcript that would make him look better? 3.)Does Mr. Trump have any regrets about this conversation?”"}, {"d797": "Nobody answered right away."}, {"94a5": "In the meantime, I had to start writing. The story was easy to compose, since much of it was simply repeating what Trump had said. The only problem was the bad words."}, {"1331": "The Post is a fairly fusty place when it comes to profanity. If a reporter tries to get a bad word into a story, the word is usually forwarded to top editors, who consider it with the gravity and speed that the Vatican applies to candidates for sainthood. That unwieldy system assumed that bad words would attack one at a time, like bad guys in a kung-fu movie."}, {"ff77": "But in this story, we were dealing with a whole army of bad words at once. The system was overloaded. When Trump said, “Grab ’em by the p — — ,” for instance, the editors weren’t sure people would be able to guess right away what “p — — ” was. They added a letter at the end: “p — -y.”"}, {"03c2": "Other words required a ruling from the bosses."}, {"3fb1": "“Go find out about ‘tits’!” I heard one editor tell another, while the story was being edited — Trump had used the word in criticizing a woman’s appearance. The second editor left to find a higher-ranking editor who could make a ruling. “ ‘Tits’ is all right,” he said when he returned."}, {"3697": "At this point, 3:30 p.m. was getting closer."}, {"3ffc": "We didn’t get any on-the-record response from NBC, Bush or Zucker."}, {"3b1c": "Then we heard from Trump’s spokeswoman."}, {"c65c": "She’d read the transcript. She said: That doesn’t sound like Mr. Trump. She wanted to see the video. We sent it to them at 3:50 p.m., with a warning that we would publish the story soon — with or without their comment."}, {"c294": "Then nothing. Our lawyers and editors were satisfied that the tape was legitimate and newsworthy. The story was edited and ready to go. 4 p.m. arrived. Terri Rupar, the national digital editor, was walking to her desk to hit the button and publish it without comment from Trump."}, {"39d5": "I yelled for Terri to stop."}, {"7e92": "Trump was admitting it."}, {"3f92": "“This was locker room banter, a private conversation that took place many years ago. Bill Clinton has said far worse to me on the golf course — not even close. I apologize if anyone was offended,” he said in a statement that arrived at that moment."}, {"bb49": "The story published at 4:02 p.m. It became the most-read story of all time on The Post’s website, easily surpassing the past champion, a tale about a woman from Burundi who was believed dead but returned to crash her own funeral. At one point, more than 100,000 people were simultaneously reading the story about the video. The servers that measure The Post’s Web traffic actually broke because there was too much traffic."}, {"5ca8": "Afterward, Trump’s deficit in polling averages increased, from a little over 3 points to more than 5 points. Prominent Republicans turned to denounce him. House Speaker Paul D. Ryan (R-Wis.) said he was “sickened.”"}, {"55a2": "Trump’s running mate, Indiana Gov. Mike Pence, was whisked out of a campaign event — viewing a collection of autographed cardboard hot-dog buns in Toledo — without comment."}, {"416a": "Trump himself made a second, more thorough apology in a 90-second Facebook video later that evening. “I said it, I was wrong, and I apologize,” he said."}, {"7010": "I had to buy another suit, for TV appearances. My daughter, now fully over the idea that her father was on TV, began complaining when I came on and she had to switch off “Peppa Pig.” I had to quit doing the cooking at home. (Nobody complained about that.)"}, {"cd16": "On Twitter I watched myself become a minor celebrity — all because of a story that had, essentially, fallen into my lap."}, {"4496": "“My wife says that David @Fahrenthold is a time traveler from the future trying to carefully fix the darkest timeline. I believe her,” wrote James Church , a professor at Austin Peay State University."}, {"546f": "And, after I appeared on Fox News Channel to talk about the story, I heard from a man in Milwaukee. He called The Post but couldn’t say “Fahrenthold” in a way that the voice-mail system recognized."}, {"992b": "He wound up in the voice-mail box of another reporter in Sports."}, {"2ed0": "“I wanna kill him,” the caller said of me. “Thank you.”"}, {"3daa": "The Post took this seriously. I met with the D.C. police and the FBI, and a security consultant the paper hired. She was a congenial woman, a former counterterrorism official. When she arrived at our house she terrified us far more than the actual death threat had."}, {"62ef": "“Your cars are parked too far away for a car bomb,” she said, looking out the front windows at the street. “They’ll probably cut your brake lines.” She recommended having a car patrol the neighborhood. She recommended a safe room."}, {"0b45": "She recommended stocking the safe room with provisions, in case we were under siege so long that we needed snacks."}, {"1ed8": "I had to get back to work. My wife — who hadn’t complained about any of this, the long hours or the missed bedtimes or the early-morning TV appearances — stopped me, shaken at what I’d gotten us into."}, {"1160": "When the leaked Trump video still seemed to have swung the 2016 campaign, I was interviewed by a German reporter, who asked, “Do you have the feeling … ‘This is it, this is the peak of my career?’ ”"}, {"ad03": "The point of my stories was not to defeat Trump. The point was to tell readers the facts about this man running for president. How reliable was he at keeping promises? How much moral responsibility did he feel to help those less fortunate than he?"}, {"dbcb": "By the end of the election, I felt I’d done my job. My last big story about Trump started with an amazing anecdote, which came from a tip from a reader. In 1996, Trump had crashed a ribbon-cutting ceremony for a charity opening a nursery school for children with AIDS. Trump, who had never donated to the charity, stole a seat onstage that had been saved for a big contributor."}, {"21b9": "He sat there through the whole ceremony, singing along with the choir of children as cameras snapped, and then left without giving a dime."}, {"4e1c": "“All of this is completely consistent with who Trump is,” Tony Schwartz, Trump’s co-author on his 1987 book “The Art of the Deal,” told me. “He’s a man who operates inside a tiny bubble that never extends beyond what he believes is his self-interest.”"}, {"6d0f": "“If your worldview is only you — if all you’re seeing is a mirror — then there’s nobody to give money to,” Schwartz said. “Except yourself.”"}, {"6d32": "Election Day came. I thought my time with Trump had come to an end."}, {"f222": "That night, my job was to co-write the main Web story about the election. My colleague Matea Gold and I were supposed to pre-write stories for all the likely outcomes. I volunteered to write the one that said “Trump wins.”"}, {"fd46": "Based on the polling data, it felt fantastical and pointless, like designing a Super Bowl ring for the Cleveland Browns."}, {"0857": "“Biggest upset of the modern era?” I asked Post political reporter Dan Balz, trying to use the right tone in this story that nobody would ever read. Balz said that was right."}, {"c29e": "Then the polls started to close."}, {"777b": "And it turned out that I am not a time traveler."}, {"554f": "About 10 p.m., as the tide turned against Clinton, the editors started killing or reshaping stories they had assigned hours before. They axed CLINTON, a story about the history Clinton would make as the first woman to win the White House. They ordered a rewrite of GOP, which was supposed to tell readers how — with Trump defeated — the GOP was licking its wounds and looking ahead to 2020. Across the newsroom, paragraphs were being deleted en masse. An entire presupposed version of the future was disappearing. It wasn’t the future after all."}, {"1f99": "Finally, at 2:32 a.m., the Associated Press called Wisconsin."}, {"0fb0": "Trump was over the top."}, {"60b1": "“PUB TRUMP WINS STORY,” I wrote to the editors, giving the order to publish the story I’d written earlier."}, {"782b": "“Donald John Trump has been projected as the winner of the presidential election, according to the Associated Press. … His victory on Tuesday was the biggest surprise of the modern presidential era. …”"}, {"8400": "That night, I arrived home about 4 a.m. to a quiet house. I found a stale beer in the back of the fridge."}, {"6887": "In the past, I’d always been able to step out of my job at times like this."}, {"4e1a": "No matter how big the day’s story was, there was always a bigger world, which was still spinning unaffected by the murder I’d covered in Northeast Washington or the natural disaster or the congressional vote I’d just witnessed. But this story was too big to step out of."}, {"6c4e": "As I sat on the couch with my nasty pale ale, it occurred to me that I would be living in the story, from that point on."}, {"87a8": "A few days later, I was interviewed by another German reporter. He asked if these past nine months, the greatest ad­ven­ture in my life as a journalist, had been for naught."}, {"ff89": "“Do you feel like your work perhaps did not matter at all?” he said."}, {"0081": "I didn’t feel like that."}, {"2b1d": "It did matter. But, in an election as long and wild as this, a lot of other stories and other people mattered, too. I did my job. The voters did theirs. Now my job goes on. I’ll seek to cover Trump the president with the same vigor as I scrutinized Trump the candidate."}, {"cfb1": "And now I know how to do it."}, {"0d4c": "This story was originally published in The Washington Post Magazine."}], "content": "David Fahrenthold: The behind-the-scenes story of my year covering Trump How a rally in Iowa and a campaign manager’s falsehood set a year of investigations in motion “Arnold and Tim, if you’d come up, we’re going to give you a nice, beautiful check,” Donald Trump said. He held up an oversize check, the kind they give to people who win golf tournaments. It was for $100,000. In the top-left corner the check said: “The Donald J. Trump Foundation.” Along the bottom, it had the slogan of Trump’s presidential campaign: “Make America Great Again.” This was in February. The beginning of it. Trump was in Waterloo, Iowa, for a caucus-day rally at the Five Sullivan Brothers Convention Center — named for five local siblings who had been assigned to the same Navy cruiser in World War II. They all died when the ship went down at Guadalcanal. Trump had stopped his rally to do something presidential candidates don’t normally do. He was giving away money. Arnold and Tim, whom he had called to the stage, were from a local veterans group. Although their big check had Trump’s name on it, it wasn’t actually Trump’s money. Instead, the cash had been raised from other donors a few days earlier, at a televised fundraiser that Trump had held while he skipped a GOP debate because of a feud with Fox News. Trump said he had raised $6 million that night, including a $1 million gift from his own pocket. Now Trump was giving it, a little at a time, to charities in the towns where he held campaign events. “See you in the White House,” one of the men said to Trump, leaving the stage with this check that married a nonprofit’s name and a campaign’s slogan. “He said, ‘We’ll see you in the White House,’ ” Trump repeated to the crowd. “That’s nice.” After that, Trump lost Iowa. He won New Hampshire. Then he stopped giving away money. But as far as I could tell, just over $1.1 million had been given away. Far less than what Trump said he raised. And there was no sign of the $1 million Trump had promised from his own pocket. So what happened to the rest of the money? It sounded like an easy question that the Trump campaign could answer quickly. I thought I’d be through with the story in a day or two. I was wrong. That was the start of nine months of work for me, trying to dig up the truth about a part of Trump’s life that he wanted to keep secret. I didn’t understand — and I don’t think Trump understood, either — where that one check, and that one question, would lead. President-elect Trump speaks in Iowa at a rally at Hy-Vee Hall, Thursday, Dec. 8, 2016, in Des Moines, Iowa. (AP Photo/Andrew Harnik) I’ve been a reporter for The Washington Post since 2000, covering everything from homicide scenes in the District to Congress to the World Championship Muskrat Skinning Contest. (People race to see who skins a dead muskrat the fastest. There’s also a beauty pageant. Some women compete in both.) By the time I got to that Trump event in Waterloo, I’d been covering the 2016 presidential election for 13 months, since the last weeks of 2014. But I had the track record of a mummy’s curse: Just about every campaign I had touched was dead. I had, for instance, covered former New York governor George Pataki’s (failed) attempt to get people to recognize him in a New Hampshire Chipotle. Pataki dropped out. I read the collected works of former Arkansas governor Mike Huckabee and made a list of everything the old Baptist preacher had ever condemned as immoral or untoward. The subjects of his condemnation ranged from college-age women going braless to dogs wearing clothes to Beyoncé. Huckabee condemned me. Then he dropped out, too. I went to St. Louis to write about a speech given by former Texas governor Rick Perry. In the middle of the speech, Perry dropped out. So by the time the New Hampshire primaries were over, the candidates I had covered were kaput. I needed a new beat. While I pondered what that would be, I decided to do a short story about the money Trump had raised for veterans. I wanted to chase down two suspicions I’d brought home with me from that event in Iowa. For one thing, I thought Trump might have broken the law by improperly mixing his foundation with his presidential campaign. I started calling experts. “I think it’s pretty clear that that’s over the line,” Marc S. Owens, the former longtime head of the Internal Revenue Service’s nonprofit division, told me when I called him. Then Owens kept talking, and the story started deflating. In theory, Owens said, nonprofit groups like the Trump Foundation are “absolutely prohibited” from participating or intervening in a political campaign. But, he said, if the IRS did investigate, it wouldn’t likely start until the Trump Foundation filed its paperwork for 2016. Which wouldn’t be until late 2017. Then an agent would open a case. There went 2018. Finally, Owens said, the IRS might take action: It might even take away the Trump Foundation’s tax-exempt status. In 2019. Or maybe not ever. Owens doubted that the IRS — already under scrutiny from the GOP-run Congress after allegations it had given undue scrutiny to conservative groups — would ever pick a fight with Trump. “I don’t think anything’s going to happen” to Trump, Owens said. “But, theoretically, it could.” My other suspicion was that Trump was still sitting on the bulk of the money he had raised for veterans — including the $1 million he had promised from himself. I asked Trump’s people to account for all this money. They didn’t. Then, finally, I got a call. “The money is fully spent,” Corey Lewandowski, then Trump’s campaign manager, told me in late May. “Mr. Trump’s money is fully spent.” But, Lewandowski told me, the details of Trump’s $1 million in gifts were secret. He wouldn’t say which groups Trump had donated to. Or when. Or in what amounts. This was an important assertion — that Trump had delivered on a signature campaign promise — made without proof. I didn’t want to just take Lewandowksi’s word for it. So I tried to prove him right. I spent a day searching for Trump’s money on Twitter, asking vets’ organizations if they’d gotten any of it. I used Trump’s Twitter handle, @realdonaldtrump, because I wanted Trump to see me searching. Trump saw. The next night, he called me to say he had just then given away the $1 million, all in one swoop, to a nonprofit run by a friend. That meant when Lewandowski said Trump’s money was “fully spent,” it was actually still in Trump’s pocket. On the phone, I asked Trump: Would you really have given this money away if I hadn’t been asking about it? “You know, you’re a nasty guy,” he said. “You’re really a nasty guy.” A few days later, Trump held a news conference in Trump Tower, where he answered my other question. Where was the remainder of the money Trump had raised from other donors, four months earlier? Turns out, it had been sitting in the Trump Foundation, unspent. In this news conference, Trump announced that he had given the last of it away — and he lashed out at the media for asking him to account for the money. “Instead of being like, ‘Thank you very much, Mr. Trump,’ or ‘Trump did a good job,’ everyone said : ‘Who got it? Who got it? Who got it?’ And you make me look very bad,” Trump said. “I have never received such bad publicity for doing such a good job.” Because my stories had led to this angry moment, I was on “Morning Joe” and CNN and Lawrence O’Donnell. The New York Times and Le Monde referenced my work. My dad wrote to say how proud he was of me. I read pundits predicting that the presidential race itself would change. They said the old trope about Trump — that he was a Teflon candidate, immune to accountability — was now disproved. When I came home from my last TV hit, the kids, ages 4 and 5 months, were asleep. The house was quiet. I was still full of caffeine and do-gooder energy and decided to tidy up. Among the clutter on the coffee table, I found my 4-year-old’s Party Popper, a bright yellow gun that fired confetti. For some reason, I held the gun up to my eye and looked down the barrel, the way Yosemite Sam always does. It looked unloaded. Then, for some reason, I pulled the trigger. When I got to the ER, I had a swollen face, metal-foil confetti in my hair and a faint odor of gun smoke. Finally, the doctor could see me. “I shot myself in the eye with a glitter gun,” I said. I showed him the Party Popper, which I had brought with me, in case he wanted to send it off to the National Institute of Morons for further study. President-Elect Donald J. Trump speaks during a “USA Thank You Tour 2016” in Des Moines, Iowa on Thursday, Dec. 08, 2016. (Photo by Jabin Botsford/The Washington Post) I got home from the hospital with a scratched cornea and a tube of eye ointment. The next day, with some of my dignity permanently lost, I got started on a bigger story. The idea for this story had come from our executive editor, Marty Baron. One night, as we both waited for an elevator, Marty offered a suggestion. Why don’t you go beyond Trump’s promises to give to veterans, he said, and look at Trump’s giving to charity, period? The logic was that Trump had just tried to wiggle out of a charitable promise he’d made on national TV. What, Marty wondered, had he been doing before the campaign, when nobody was looking? That reporting process started with a lot of paper. Working with one of The Post’s ace researchers, Alice Crites, I went digging for records that would reveal Trump’s charitable giving, going back to his early days as a Manhattan developer in the 1980s. We looked at old news clippings, detailing Trump’s public statements. And we looked at tax filings from the Donald J. Trump Foundation, which had been dug out of storage by New York state. Those two sources told two very different stories. In the news clippings, you could see that Trump had repeatedly made public promises to donate to charity. In the 1980s, for instance, Trump had promised to give away $4 million from sales of his book “The Art of the Deal.” In more recent years, he said he would give away $2.5 million he made off “The Apprentice.” And donated the profits from Trump University. All told, the pledges in those news clips made it seem that Trump had given away more than $12 million. In more recent clippings, in fact, Trump’s presidential campaign staff said his actual giving had been far higher than that: “tens of millions ” over his lifetime. The state’s records showed something else. They showed that the Trump Foundation — which Trump had set up to give away his own money — had received only a total of $5.5 million from Trump since 1987. So where was all that other money that he said he had been donating? “We want to keep them private. We want to keep them quiet,” Allen Weisselberg, the chief financial officer of Trump’s business, had told me about the missing money. “He doesn’t want other charities to see it. Then it becomes like a feeding frenzy.” Once again, I didn’t want to take his word for it. So I set out — using Twitter — to try to prove Trump right. I started making a list of charities I thought were most likely to have received money from Trump’s own pocket. Nonprofits that had received donations from the Trump Foundation. Charities whose galas Trump had attended. Causes he’d praised on Twitter. In each case, I called the charity and asked if it had ever received a donation from Trump — and, if so, when. Then, I wrote the charity’s name and its response on a legal pad and posted pictures of the legal pad to Twitter. My list started to grow: 100 charities. 150. 200. In all those calls, a pattern began to emerge. In the years between 2008 and 2015 — when Trump wasn’t giving money to the Trump Foundation — he didn’t seem to have given much to other people’s charities, either. The only gift I could find in that range was from 2009, when he was credited with giving less than $10,000 to the Police Athletic League of New York City. 250 charities. As the circus of the 2016 campaign swirled around me — Twitter beefs, Trump’s criticisms of a Gold Star family and a Mexican American federal judge — I stayed focused on this small slice of Trump’s life. After a while, my 4-year-old daughter started talking about the Trump Foundation at dinner, just because her parents talked about nothing else. “He should give the money to the people, so the people get the money,” she said. “It’s not nice.” I called 300 charities. 325. This story started to remind me of one of the weirdest stories I’ve ever done: a 2014 tale about the federal government’s giant paperwork cave. The cave was about 45 minutes north of Pittsburgh. The Office of Personnel Management kept federal employees’ personnel records in 28,000 file cabinets inside the caverns of an abandoned limestone mine. There were 600 federal employees down there. Cave clerks. Their job was to assemble and collate paperwork from the caverns and use that paperwork to compute how much individual federal employees would receive in benefits when they retired. The cave clerks worked in an absurdist parody of government inefficiency, which was as slow in 2014 as it was in the 1970s. In reporting jargon, I’d tried the front door: I asked to tour the mine. OPM said no. So then I went looking for windows. I sought out ex-employees, who had firsthand knowledge of the place but weren’t beholden to OPM’s desire for secrecy. I found them. By piecing together their recollections, I got the story that the government didn’t want me to find. Now Trump himself was the abandoned limestone mine. If he wouldn’t tell me what he had given away, I’d try to find the answer anyway — by talking to charities with firsthand knowledge of what he had given. When I reached №325 on my list, I yanked on a window, and it gave. “They ended up purchasing a Michael Israel portrait of Donald Trump,” said Matthew Ladika, the CEO of a Florida children’s charity called HomeSafe. I had called this charity — which I knew had received $20,000 from the Trump Foundation — to ask if it had ever received anything else, from Trump’s own pocket. It had not. But Ladika told me something I didn’t expect: the reason for that $20,000 gift from Trump’s charity. Trump had used it to buy a portrait of himself. The portrait had been painted by a “speed painter,” who was the entertainment at a charity gala at Trump’s Mar-a-Lago Club. Melania Trump bought it for $20,000. But then, later, Trump paid for it with a check from the Trump Foundation. That raised a new set of questions. Tax law prohibits “self-dealing,” which is when charity leaders use their nonprofits’ money to buy things for themselves. If Trump hung that portrait on the wall at one of his resorts, for instance, he’d be breaking the law. So where was the portrait now? I asked Trump’s people. They didn’t respond. I tried a Google Images search, feeding it a photo of the portrait, which showed Trump’s painted face. “Best guess for this image: Orange,” Google said. I got a screen full of oranges. Orange juice. Orange Julius. No portraits. I kept looking, posting details of my search to Twitter. Soon I had attracted a virtual army, ready to join the scavenger hunt. I had begun the year with 4,700 Twitter followers. By September I had more than 60,000 and climbing fast. I began hearing from celebrities and even a few personal heroes, offering their assistance out of the blue. The barbecue columnist for Texas Monthly — an idol to me, as a journalist and a native Texan — was watching videos of other people’s parties taken at a Trump golf resort. He thought he’d spotted the painting in the background (he hadn’t). Kathy Griffin, the actress, called me with her memories about visiting the set of Trump’s “The Celebrity Apprentice.” Mark Cuban, the Dallas Mavericks owner, was sending me links on Twitter, new leads on Trump promises. That army — almost all of them strangers to me — never found the first portrait. But soon there was a new target and a new scavenger hunt. “Google ‘Havi Art Trump,’ ” said a strange voice on the phone one day, calling from the 561 area code. Palm Beach, Fla. I did. The Google search revealed a new portrait of Trump. This one was four feet tall, painted by Miami artist Havi Schanz. After a phone call, I confirmed that Trump had purchased it in 2014 at a charity auction run by the Unicorn Children’s Foundation. Once again, he had the Trump Foundation pay the bill. I needed to find that portrait. I turned to my Twitter followers, putting out a photo of the new $10,000 portrait. That was at 10:34 a.m. By early evening I knew where it was. “The Havi Painting was at Doral National in Miami, you can see two separate pics that tourists have taken of it,” wrote Allison Aguilar. I’ve never met Aguilar. I learned later that she is a former HR manager who is now a stay-at-home mother in Atlanta, writing short stories on the side. Days before, looking for the $20,000 portrait, she had scoured the website for Trump’s golf resort at Doral, in Florida, scanning more than 500 user-generated photos of the resort’s rooms, restaurants and golf course. About halfway through, she had spotted another portrait in a photo, hanging on a wall at the resort. Then she saw my tweet, saying that I was now looking for that portrait, too. “Oh, now that I’ve seen,” Aguilar remembered thinking. The TripAdvisor photo she found was dated February 2016. Was the portrait still there? The answer was provided by another stranger. Enrique Acevedo, an anchor at the Spanish-language network Univision, saw my tweet that night, broadcasting that Aguilar had traced the portrait to Doral. Acevedo realized that Doral was just a few blocks from the Univision studios. He booked a room for that night. “I used points,” Acevedo said. “I didn’t want to … spend any money on Trump’s property, so I used points.” After his newscast ended, Acevedo checked in and started quizzing the late-night cleaning crews. “Have you seen this picture?” he asked. “They said, ‘Oh yeah, it’s downstairs.’ ” Bingo. Acevedo found the $10,000 portrait, paid for with charity money, hanging on the wall of the resort’s sports bar. “Hey @Fahrenthold just checked and the portrait is still hanging at the Champions Lounge. How much did you say it cost the Trump Foundation?” he wrote on Twitter that night. All of that — from my first request for help to Acevedo’s discovery — had taken less than 14 hours. Together, we had discovered Trump doing exactly what the law said he couldn’t do: using his charity’s money to decorate his resort. A Trump spokesman later offered the explanation that the resort was actually doing the foundation a favor, by storing its art free of charge. Tax experts were not impressed by this reasoning. “It’s hard to make an IRS auditor laugh,” one told me. “But this would do it.” On a morning in October, a month before Election Day, a window opened itself. I got a phone call. It was a source, with a video. The first few seconds were jumpy footage of a bus, lumbering through a bland Hollywood backlot. The soundtrack was indistinct mumbling. But then there was Trump’s voice. “I moved on her, actually. You know, she was down in Palm Beach. I moved on her. And I failed. I’ll admit it,” he was saying. “I did try and f — — her. She was married.” That was 17 seconds in. On the bus were Trump and “Access Hollywood” host Billy Bush. The video, I figured out, had been shot in 2005. The two men were visiting the set of NBC’s “Days of Our Lives,” where Trump was to make a cameo appearance. In a blaze of network synergy, NBC’s “Access Hollywood” was there to see Trump arrive. Trump and Bush were wearing hot microphones. On the bus, Trump told Bush about trying and failing to seduce a woman in Palm Beach. (“I took her out furniture shopping,” he said.) Trump also described how he kissed and groped women, without asking first. “And when you’re a star, they let you do it!” Trump said. The thing that stood out to me was the genuine wonder in his voice. He seemed to be saying: I can’t believe it either, but the world lets you get away with this. This was not the first time Trump had been recorded having lewd conversations. BuzzFeed, in particular, had found tapes of Trump talking about women with shock jock Howard Stern. (“You could’ve gotten her, right? You could’ve nailed her,” Stern asked him once about Princess Diana, who at the time had recently died. “I think I could have,” Trump said.) But those had been excused, by some, because they were just words. Trump, it seemed, was playing an outrageous version of himself in public, for the entertainment of Stern and his audience. But this video was different. This was Trump talking, in private, about his own conduct: how, when and why he groped women. It was not a story about words. It was about Trump’s actions, which these words revealed for the first time. I first made myself into Paul Revere of the cubicles, raising alarms around the newsroom and setting people in motion. The Post’s video team started to edit, transcribe and subtitle the footage. They told me they would be ready to post a version of the video at about 3:30 p.m. That was my deadline. I called NBC to see if they thought the video was a hoax. I reached out to a spokeswoman for Billy Bush and a publicist for Arianne Zucker, the soap-opera actress in the video who escorted Trump and Bush around the studio. And I reached out to Trump’s spokeswoman, Hope Hicks. I sent her the transcript of the video. I asked: “1.)Does Mr. Trump have any reason to believe that it is not authentic, and that he did not say these things? 2.)Does Mr. Trump recall that conversation? If so, does he believe there is anything that was *not* captured in this transcript that would make him look better? 3.)Does Mr. Trump have any regrets about this conversation?” Nobody answered right away. In the meantime, I had to start writing. The story was easy to compose, since much of it was simply repeating what Trump had said. The only problem was the bad words. The Post is a fairly fusty place when it comes to profanity. If a reporter tries to get a bad word into a story, the word is usually forwarded to top editors, who consider it with the gravity and speed that the Vatican applies to candidates for sainthood. That unwieldy system assumed that bad words would attack one at a time, like bad guys in a kung-fu movie. But in this story, we were dealing with a whole army of bad words at once. The system was overloaded. When Trump said, “Grab ’em by the p — — ,” for instance, the editors weren’t sure people would be able to guess right away what “p — — ” was. They added a letter at the end: “p — -y.” Other words required a ruling from the bosses. “Go find out about ‘tits’!” I heard one editor tell another, while the story was being edited — Trump had used the word in criticizing a woman’s appearance. The second editor left to find a higher-ranking editor who could make a ruling. “ ‘Tits’ is all right,” he said when he returned. At this point, 3:30 p.m. was getting closer. We didn’t get any on-the-record response from NBC, Bush or Zucker. Then we heard from Trump’s spokeswoman. She’d read the transcript. She said: That doesn’t sound like Mr. Trump. She wanted to see the video. We sent it to them at 3:50 p.m., with a warning that we would publish the story soon — with or without their comment. Then nothing. Our lawyers and editors were satisfied that the tape was legitimate and newsworthy. The story was edited and ready to go. 4 p.m. arrived. Terri Rupar, the national digital editor, was walking to her desk to hit the button and publish it without comment from Trump. I yelled for Terri to stop. Trump was admitting it. “This was locker room banter, a private conversation that took place many years ago. Bill Clinton has said far worse to me on the golf course — not even close. I apologize if anyone was offended,” he said in a statement that arrived at that moment. The story published at 4:02 p.m. It became the most-read story of all time on The Post’s website, easily surpassing the past champion, a tale about a woman from Burundi who was believed dead but returned to crash her own funeral. At one point, more than 100,000 people were simultaneously reading the story about the video. The servers that measure The Post’s Web traffic actually broke because there was too much traffic. Afterward, Trump’s deficit in polling averages increased, from a little over 3 points to more than 5 points. Prominent Republicans turned to denounce him. House Speaker Paul D. Ryan (R-Wis.) said he was “sickened.” Trump’s running mate, Indiana Gov. Mike Pence, was whisked out of a campaign event — viewing a collection of autographed cardboard hot-dog buns in Toledo — without comment. Trump himself made a second, more thorough apology in a 90-second Facebook video later that evening. “I said it, I was wrong, and I apologize,” he said. I had to buy another suit, for TV appearances. My daughter, now fully over the idea that her father was on TV, began complaining when I came on and she had to switch off “Peppa Pig.” I had to quit doing the cooking at home. (Nobody complained about that.) On Twitter I watched myself become a minor celebrity — all because of a story that had, essentially, fallen into my lap. “My wife says that David @Fahrenthold is a time traveler from the future trying to carefully fix the darkest timeline. I believe her,” wrote James Church , a professor at Austin Peay State University. And, after I appeared on Fox News Channel to talk about the story, I heard from a man in Milwaukee. He called The Post but couldn’t say “Fahrenthold” in a way that the voice-mail system recognized. He wound up in the voice-mail box of another reporter in Sports. “I wanna kill him,” the caller said of me. “Thank you.” The Post took this seriously. I met with the D.C. police and the FBI, and a security consultant the paper hired. She was a congenial woman, a former counterterrorism official. When she arrived at our house she terrified us far more than the actual death threat had. “Your cars are parked too far away for a car bomb,” she said, looking out the front windows at the street. “They’ll probably cut your brake lines.” She recommended having a car patrol the neighborhood. She recommended a safe room. She recommended stocking the safe room with provisions, in case we were under siege so long that we needed snacks. I had to get back to work. My wife — who hadn’t complained about any of this, the long hours or the missed bedtimes or the early-morning TV appearances — stopped me, shaken at what I’d gotten us into. When the leaked Trump video still seemed to have swung the 2016 campaign, I was interviewed by a German reporter, who asked, “Do you have the feeling … ‘This is it, this is the peak of my career?’ ” The point of my stories was not to defeat Trump. The point was to tell readers the facts about this man running for president. How reliable was he at keeping promises? How much moral responsibility did he feel to help those less fortunate than he? By the end of the election, I felt I’d done my job. My last big story about Trump started with an amazing anecdote, which came from a tip from a reader. In 1996, Trump had crashed a ribbon-cutting ceremony for a charity opening a nursery school for children with AIDS. Trump, who had never donated to the charity, stole a seat onstage that had been saved for a big contributor. He sat there through the whole ceremony, singing along with the choir of children as cameras snapped, and then left without giving a dime. “All of this is completely consistent with who Trump is,” Tony Schwartz, Trump’s co-author on his 1987 book “The Art of the Deal,” told me. “He’s a man who operates inside a tiny bubble that never extends beyond what he believes is his self-interest.” “If your worldview is only you — if all you’re seeing is a mirror — then there’s nobody to give money to,” Schwartz said. “Except yourself.” Election Day came. I thought my time with Trump had come to an end. That night, my job was to co-write the main Web story about the election. My colleague Matea Gold and I were supposed to pre-write stories for all the likely outcomes. I volunteered to write the one that said “Trump wins.” Based on the polling data, it felt fantastical and pointless, like designing a Super Bowl ring for the Cleveland Browns. “Biggest upset of the modern era?” I asked Post political reporter Dan Balz, trying to use the right tone in this story that nobody would ever read. Balz said that was right. Then the polls started to close. And it turned out that I am not a time traveler. About 10 p.m., as the tide turned against Clinton, the editors started killing or reshaping stories they had assigned hours before. They axed CLINTON, a story about the history Clinton would make as the first woman to win the White House. They ordered a rewrite of GOP, which was supposed to tell readers how — with Trump defeated — the GOP was licking its wounds and looking ahead to 2020. Across the newsroom, paragraphs were being deleted en masse. An entire presupposed version of the future was disappearing. It wasn’t the future after all. Finally, at 2:32 a.m., the Associated Press called Wisconsin. Trump was over the top. “PUB TRUMP WINS STORY,” I wrote to the editors, giving the order to publish the story I’d written earlier. “Donald John Trump has been projected as the winner of the presidential election, according to the Associated Press. … His victory on Tuesday was the biggest surprise of the modern presidential era. …” That night, I arrived home about 4 a.m. to a quiet house. I found a stale beer in the back of the fridge. In the past, I’d always been able to step out of my job at times like this. No matter how big the day’s story was, there was always a bigger world, which was still spinning unaffected by the murder I’d covered in Northeast Washington or the natural disaster or the congressional vote I’d just witnessed. But this story was too big to step out of. As I sat on the couch with my nasty pale ale, it occurred to me that I would be living in the story, from that point on. A few days later, I was interviewed by another German reporter. He asked if these past nine months, the greatest ad­ven­ture in my life as a journalist, had been for naught. “Do you feel like your work perhaps did not matter at all?” he said. I didn’t feel like that. It did matter. But, in an election as long and wild as this, a lot of other stories and other people mattered, too. I did my job. The voters did theirs. Now my job goes on. I’ll seek to cover Trump the president with the same vigor as I scrutinized Trump the candidate. And now I know how to do it. This story was originally published in The Washington Post Magazine. ", "parent": "", "title": "David Fahrenthold: The behind-the-scenes story of my year covering Trump", "child": "20_1\t20_2\t20_3\t20_4\t20_5\t20_6\t20_7\t20_8\t20_9\t20_10\t20_11\t20_12\t20_13\t20_14\t20_15\t20_16\t20_17\t20_18\t20_19\t20_20\t20_21\t20_22\t20_23\t20_24\t20_25", "name": "20"}