{"child": "2001_1\t2001_2\t2001_3\t2001_4\t2001_5\t2001_6\t2001_7\t2001_8", "title": "Come Back! Go back!", "content": "Come Back! Go back! Urged the grocery and my family. I doubt this is going where you think. I am the exception. I love my weekly trip to the grocery store. I especially like it when I have taken the time to pick out 6 or 7 recipes for the week. I make a list and all is right with the world. Oh sweet certainty, do not leave me. My world is a happier place when the decisions have been made. I hate not having a plan. All of us looking at each other around 6 p.m.. “What do you want?” “I don’t know. What do you want?” “Do we have anything?” “Well this, but it is frozen. Or that, but we are missing x y or z to make it complete.” Ughhhhhhh!!!!! The summer, with its irregular and ever changing venues, puts a real damper on my meal plan and prep. We eat way too much junk and not enough good. I feel bad about not putting tasty and healthy meals on the table and in mouths. I dare say I am a better than average cook and take pride in a nutritious meal on the table. It is the one thing my tribe almost always remembers to thank me for doing. So with the Labor Day weekend behind us, I pulled out my recipe binder. I selected six favorite recipes, made my list and headed for the grocery. Everything has been unpacked. The pantry, refrigerator and freezer are stocked. I have six to seven answers to the question of, “What’s for dinner?” For this, I give thanks. ", "name": "2001", "parent": "", "sentences": [{"3d2e": "Come Back! Go back!"}, {"4914": "Urged the grocery and my family."}, {"ebfc": "I doubt this is going where you think. I am the exception. I love my weekly trip to the grocery store. I especially like it when I have taken the time to pick out 6 or 7 recipes for the week. I make a list and all is right with the world."}, {"450d": "Oh sweet certainty, do not leave me. My world is a happier place when the decisions have been made."}, {"2ad9": "I hate not having a plan. All of us looking at each other around 6 p.m.."}, {"c765": "“What do you want?”"}, {"b16e": "“I don’t know. What do you want?”"}, {"5919": "“Do we have anything?”"}, {"4bea": "“Well this, but it is frozen. Or that, but we are missing x y or z to make it complete.”"}, {"4187": "Ughhhhhhh!!!!!"}, {"ef93": "The summer, with its irregular and ever changing venues, puts a real damper on my meal plan and prep. We eat way too much junk and not enough good. I feel bad about not putting tasty and healthy meals on the table and in mouths."}, {"348a": "I dare say I am a better than average cook and take pride in a nutritious meal on the table. It is the one thing my tribe almost always remembers to thank me for doing."}, {"319d": "So with the Labor Day weekend behind us, I pulled out my recipe binder. I selected six favorite recipes, made my list and headed for the grocery."}, {"c0a8": "Everything has been unpacked. The pantry, refrigerator and freezer are stocked. I have six to seven answers to the question of, “What’s for dinner?”"}, {"1da4": "For this, I give thanks."}]}