{"child": "2012_1", "title": "Hacking electronics at home", "content": "Hacking electronics at home Here are some of the lessons learnt from my hobby project on PCB fabrication and soldering surface mount components. Here is a picture of the final product :) Special credits to this wonderful blog by Johan von Konow from whom the artwork for the USB to serial circuit was borrowed. Perseverance is the key Fabricating PCB at home is a lengthy process and perseverance is the key until one masters the process. The PCB fabrication for this product was performed using the toner transfer method and it took around 4 to 5 hours of multiple iterations. The major challenge was on getting the toner circuit properly transferred to the copper clad. Test frequently As in software, there is no easy undo option, hence frequent testing at each stage was a hard learnt lesson. Twice, I realized the mistakes made during artwork printing only after completing the PCB fabrication. The first time I got the artwork printed with the wrong zoom setting and the second time I failed to mirror the artwork while printing (the original work used a CNC miller and hence did not need the step). Both resulted in painful throw away effort. Order matters It gets complicated if one does not follow the manufacturing steps in the right order. Filing the sides is a nightmare after soldering, it is easier to drill the pin holes before soldering any components, care should be taken to get good solder joints when it comes to surface mount chips as one might not get a second chance due to congestion. Equip yourself Right equipments will make a huge difference. When it comes to surface mounts chips, prefer a good soldering iron, one with the temperature control option. I have got this soldering station from Siron which I am happy with. Tweezers, 2.5x magnifier for soldering and 20x magnifier for circuit inspection, needle files, electric drill tool are some of the other tools that offered great help. Learn soldering Soldering surface mount chips is not as complicate as they appear. Some practice will get you going. There are quite a few video on the internet which explains the procedure in detail. This was my second soldering experience after some basic led soldering for this led cube project. Here is how the product performs on a serial loopback test. Post me the questions you have got. Thank you for reading :) ", "name": "2012", "parent": "", "sentences": [{"a815": "Hacking electronics at home"}, {"034e": "Here are some of the lessons learnt from my hobby project on PCB fabrication and soldering surface mount components."}, {"d57d": "Here is a picture of the final product :)"}, {"17f4": "Special credits to this wonderful blog by Johan von Konow from whom the artwork for the USB to serial circuit was borrowed."}, {"2674": "Perseverance is the key"}, {"c3dc": "Fabricating PCB at home is a lengthy process and perseverance is the key until one masters the process. The PCB fabrication for this product was performed using the toner transfer method and it took around 4 to 5 hours of multiple iterations. The major challenge was on getting the toner circuit properly transferred to the copper clad."}, {"f4b7": "Test frequently"}, {"7a6f": "As in software, there is no easy undo option, hence frequent testing at each stage was a hard learnt lesson. Twice, I realized the mistakes made during artwork printing only after completing the PCB fabrication. The first time I got the artwork printed with the wrong zoom setting and the second time I failed to mirror the artwork while printing (the original work used a CNC miller and hence did not need the step). Both resulted in painful throw away effort."}, {"5177": "Order matters"}, {"4669": "It gets complicated if one does not follow the manufacturing steps in the right order. Filing the sides is a nightmare after soldering, it is easier to drill the pin holes before soldering any components, care should be taken to get good solder joints when it comes to surface mount chips as one might not get a second chance due to congestion."}, {"aed0": "Equip yourself"}, {"a53b": "Right equipments will make a huge difference. When it comes to surface mounts chips, prefer a good soldering iron, one with the temperature control option. I have got this soldering station from Siron which I am happy with. Tweezers, 2.5x magnifier for soldering and 20x magnifier for circuit inspection, needle files, electric drill tool are some of the other tools that offered great help."}, {"dcae": "Learn soldering"}, {"ee29": "Soldering surface mount chips is not as complicate as they appear. Some practice will get you going. There are quite a few video on the internet which explains the procedure in detail. This was my second soldering experience after some basic led soldering for this led cube project."}, {"1f16": "Here is how the product performs on a serial loopback test."}, {"1ec6": "Post me the questions you have got. Thank you for reading :)"}]}