{"name": "202", "parent": "", "content": "I Told My Mother About You I met someone. She has kind eyes and a soft heart, an easy smile and a subtle feistiness about her. She laughs like laughter is air and she cannot get enough of it. She cries shamelessly about things that are worth her tears. In a benumbing world where growing a thick skin seems more important than having a soul that can be touched, this woman is precious. Her head is about as high as my chest but I look up to her. You know there is a tallness that has nothing to do with height. She often prays like the world is at war and everything she cares about is under attack. Something like a righteous hurricane. Sometimes she prays in a near-whisper and I wonder where the thunderstorm went, the air around her as still as the sky after a downpour. She teaches me things without opening her mouth: a nod means approval, an arched brow means disapproval. I am eight again, looking out for your nonverbal clues. You know those rough edges you have always hoped I would lose? She is the sandpaper, the file and the chisel, and I have never been smoother. She adds fuel to the will to be better, to become an improved version of myself, to grow in multiple directions. I still feel lost sometimes, but there is comfort in knowing that someone will come and find me. She reminds me of who I really am under the dust that gathers as we make our way through life. She has been through her own hell and she wears the burn marks so well that it would be inappropriate to call them scars. Mementos, maybe, but not scars. She loves like she has one chance to get it right: with purpose, without restraint. Hers is an affection like rain in April, relentless, and I am drenched to my soul. She has cracks in her walls that I fill, just as she fills cracks in mine. So if there is ever any perfection about us, it will be because we have each other, reinforce each other and support each other. She is not an angel (who is?) and this is not heaven but it is enough. I will pick this concrete reality over the best dreams, because dreams are just dreams. There is a real live person who wants me for a lifetime, someone I can be alone with and not feel crowded. What fantasy can compare? I have been touched by her peace, infected by her joy and lifted above my drowning melancholy. Years after I left the one you provided, I am home again. This is where I belong. ", "title": "I Told My Mother About You", "sentences": [{"7dd9": "I Told My Mother About You"}, {"127f": "I met someone."}, {"b46f": "She has kind eyes and a soft heart, an easy smile and a subtle feistiness about her."}, {"810f": "She laughs like laughter is air and she cannot get enough of it."}, {"cd93": "She cries shamelessly about things that are worth her tears. In a benumbing world where growing a thick skin seems more important than having a soul that can be touched, this woman is precious."}, {"856f": "Her head is about as high as my chest but I look up to her. You know there is a tallness that has nothing to do with height."}, {"507f": "She often prays like the world is at war and everything she cares about is under attack. Something like a righteous hurricane."}, {"25a2": "Sometimes she prays in a near-whisper and I wonder where the thunderstorm went, the air around her as still as the sky after a downpour."}, {"b9a5": "She teaches me things without opening her mouth: a nod means approval, an arched brow means disapproval. I am eight again, looking out for your nonverbal clues."}, {"b42b": "You know those rough edges you have always hoped I would lose? She is the sandpaper, the file and the chisel, and I have never been smoother."}, {"a416": "She adds fuel to the will to be better, to become an improved version of myself, to grow in multiple directions."}, {"2992": "I still feel lost sometimes, but there is comfort in knowing that someone will come and find me. She reminds me of who I really am under the dust that gathers as we make our way through life."}, {"2f7b": "She has been through her own hell and she wears the burn marks so well that it would be inappropriate to call them scars. Mementos, maybe, but not scars."}, {"e29f": "She loves like she has one chance to get it right: with purpose, without restraint. Hers is an affection like rain in April, relentless, and I am drenched to my soul."}, {"2c29": "She has cracks in her walls that I fill, just as she fills cracks in mine. So if there is ever any perfection about us, it will be because we have each other, reinforce each other and support each other."}, {"ab76": "She is not an angel (who is?) and this is not heaven but it is enough."}, {"96a9": "I will pick this concrete reality over the best dreams, because dreams are just dreams."}, {"1dac": "There is a real live person who wants me for a lifetime, someone I can be alone with and not feel crowded. What fantasy can compare?"}, {"5a36": "I have been touched by her peace, infected by her joy and lifted above my drowning melancholy."}, {"4f67": "Years after I left the one you provided, I am home again."}, {"d111": "This is where I belong."}], "child": "202_1\t202_2\t202_3\t202_4\t202_5\t202_6\t202_7\t202_8\t202_9\t202_10\t202_11\t202_12\t202_13\t202_14\t202_15\t202_16\t202_17\t202_18\t202_19\t202_20\t202_21\t202_22\t202_23\t202_24\t202_25"}