{"child": "2027_1\t2027_2\t2027_3\t2027_4\t2027_5\t2027_6", "title": "The Last Great Movie Soundtrack", "content": "The Last Great Movie Soundtrack Remember two-way pagers? Reggaeton? EDM ballads? Pitbull? The soundtracks from the ‘Fast & Furious’ franchise are a time capsule of hip-hop music in the aughts. For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time. The cover art for the soundtrack for the first Fast & Furious movie is a faded portrait shot of a smirking Ja Rule wearing a durag. It’s a fitting image, despite the fact that he has only a minute of screen time in the original film. The movie premiered in 2001, at the height of Ja’s ubiquity, and so naturally the rapper appears on five (of 17) songs on the OST. The two record labels that largely produced the soundtrack, Def Jam and Murder Inc., didn’t skimp on additional talent. Ashanti’s here, plus every other rapper not named Nas or Jay who had some buzz at the time. Here’s the album cover billing: Ja Rule, Faith Evans, Scarface, DMX, Funkmaster Flex feat. Noreaga, R. Kelly, Tank, Limp Bizkit, Redman, Method Man, Caddillac Tah, Vita, Black Child, Petey Pablo, Ashanti, Fat Joe, and more … Ja Rule was the star of the soundtrack, but Caddillac Tah made its best song: “POV City Anthem,” a hardbody ringtone rap anthem. In the spirit of the year that the song was released — 2001 — the producer Mr. Fingaz sampled a two-way pager for its beat. Is the first Fast & Furious soundtrack a great rap album? No. In fact, much of its music has aged poorly and/or was horrible to begin with. Nonetheless, this and all of the other albums from the 16-year-old film franchise are great soundtracks, because they perfectly preserve the sensibilities of urban radio throughout the aughts. Given its surprisingly long life span, the Fast & Furious franchise has yielded soundtracks that have kept definitive track of hip-hop’s pulse. Thus, when Ja Rule fell off, he fell off the Fast soundtracks, too. The 2 Fast 2 Furious soundtrack essentially replaced Ja with 2 Fast costar Ludacris, fresh off his commercial peak as a rapper. Tokyo Drift and Fast & Furious both rode Pharrell and Pitbull during the Neptunes’ post–“Rock Your Body” club rat wave. Fast Five put Don Omar on a “How We Roll” remix with Busta Rhymes, creating a strange mash-up of reggaeton and the post–Lex Luger trap maximalism that was popping among Southern rappers. Fast 6 signaled EDM’s ubiquity by putting late-career Ludacris and late-career Usher together on “Rest of My Life,” produced by David Guetta. Fast 7 yielded the franchise’s biggest single, “See You Again,” a tribute to the late Paul Walker. The Wiz Khalifa and Charlie Puth collaboration is the franchise’s most successful record, and it happens to encapsulate one of the decade’s more insipid pop-crossover formulas, mixing piano sappiness with arena-sized kumbaya wailing and super-sincere Top 40 rapping. For posterity’s sake, as always, The Fate of the Furious soundtrack is an effective summary of urban music in 2017. Migos is on here rapping non sequiturs about bath salts, NASCAR, and David Hasselhoff on “Seize the Block,” with Quavo breaking off to belt a soaring chorus on “Go Off” with Lil Uzi Vert and Travis Scott. Returning champ Wiz Khalifa is on a minor-key trap holler called “Gang Up” with 2 Chainz, Young Thug, and PnB Rock — a cross-gen roster that summarizes hip-hop’s current “rapsung” identity crisis. There’s an even larger crisis afoot in the form of token white rapper G-Eazy, who further ruins an already bad song called “Good Life” with Kehlani. Like it or not, no definitive record of hip-hop in 2017 is complete without accounting for G-Eazy’s unfortunate run of Zara cardigan raps. And then there’s Pitbull. Unlike previous Fast soundtrack MVPs, Pitbull has somehow never appeared in a Fast movie, but he’s been blessing these soundtracks with bilingual bops since 2 Fast 2 Furious. That was 2003, when he still wore massively oversized white tees and made crunk music. These days, Pitbull dresses like a Cuban American 007 and makes Carnival Cruise music. The best song on the Fate soundtrack is Pitbull and the Colombian singer J Balvin’s collaboration “Hey Ma,” which strikes at American pop music’s current obsession with tropical grooves. “Hey Ma” is the slight-but-sensational work of a rapper whose appeal is as broad and enduring as the Fast franchise itself. Both have come a long and lucrative way since their humble early-2000s beginnings. The Fate of the Furious soundtrack is a veritable Shoney’s breakfast buffet of contemporary hip-hop, the common ground where G-Eazy meets Kevin Gates. Big-budget soundtracks like Fifty Shades of Grey can churn out a decent pop single or two, but rarely do they capture the zeitgeist so comprehensively. When Suicide Squad was in theaters, there was a lot of consternation about the movie’s cloying mix of pop and oldies, which were so hyperactive and unsubtle as to be totally overbearing. There is nothing cool or exhilarating about hearing “Bohemian Rhapsody” for the 1,000,000th time in the 1,000th movie that has licensed that song. You know what is cool? Kodak Black rapping about horsepower for a $110 million car movie in A.D. 2017. I don’t know if Kodak Black will be around next year, but he’s here now, and a Fate of the Furious soundtrack placement is the best sort of participation trophy that a young rapper could hope for. These movies are, after all, hypermasculine flicks about street racing, starring cars built for speed, handling, and bass. I’m sure there’s no better setting to hear “POV City Anthem” than in a Porsche GTS. ", "name": "2027", "parent": "", "sentences": [{"4ea1": "The Last Great Movie Soundtrack"}, {"a2b8": "Remember two-way pagers? Reggaeton? EDM ballads? Pitbull? The soundtracks from the ‘Fast & Furious’ franchise are a time capsule of hip-hop music in the aughts."}, {"0c1f": "For more than a decade and a half, the Fast & Furious franchise has ripped, roared, and pressed every last NOS button on its way to action-franchise preeminence. To mark the release of Fate of the Furious, the series’ eighth installment, we’re declaring it Fast 8 Week. Please join us in living life one quarter-mile at a time."}, {"7e97": "The cover art for the soundtrack for the first Fast & Furious movie is a faded portrait shot of a smirking Ja Rule wearing a durag. It’s a fitting image, despite the fact that he has only a minute of screen time in the original film. The movie premiered in 2001, at the height of Ja’s ubiquity, and so naturally the rapper appears on five (of 17) songs on the OST. The two record labels that largely produced the soundtrack, Def Jam and Murder Inc., didn’t skimp on additional talent. Ashanti’s here, plus every other rapper not named Nas or Jay who had some buzz at the time. Here’s the album cover billing:"}, {"c503": "Ja Rule, Faith Evans, Scarface, DMX, Funkmaster Flex feat. Noreaga, R. Kelly, Tank, Limp Bizkit, Redman, Method Man, Caddillac Tah, Vita, Black Child, Petey Pablo, Ashanti, Fat Joe, and more …"}, {"0893": "Ja Rule was the star of the soundtrack, but Caddillac Tah made its best song: “POV City Anthem,” a hardbody ringtone rap anthem. In the spirit of the year that the song was released — 2001 — the producer Mr. Fingaz sampled a two-way pager for its beat."}, {"8354": "Is the first Fast & Furious soundtrack a great rap album? No. In fact, much of its music has aged poorly and/or was horrible to begin with. Nonetheless, this and all of the other albums from the 16-year-old film franchise are great soundtracks, because they perfectly preserve the sensibilities of urban radio throughout the aughts. Given its surprisingly long life span, the Fast & Furious franchise has yielded soundtracks that have kept definitive track of hip-hop’s pulse."}, {"e820": "Thus, when Ja Rule fell off, he fell off the Fast soundtracks, too. The 2 Fast 2 Furious soundtrack essentially replaced Ja with 2 Fast costar Ludacris, fresh off his commercial peak as a rapper. Tokyo Drift and Fast & Furious both rode Pharrell and Pitbull during the Neptunes’ post–“Rock Your Body” club rat wave. Fast Five put Don Omar on a “How We Roll” remix with Busta Rhymes, creating a strange mash-up of reggaeton and the post–Lex Luger trap maximalism that was popping among Southern rappers. Fast 6 signaled EDM’s ubiquity by putting late-career Ludacris and late-career Usher together on “Rest of My Life,” produced by David Guetta. Fast 7 yielded the franchise’s biggest single, “See You Again,” a tribute to the late Paul Walker. The Wiz Khalifa and Charlie Puth collaboration is the franchise’s most successful record, and it happens to encapsulate one of the decade’s more insipid pop-crossover formulas, mixing piano sappiness with arena-sized kumbaya wailing and super-sincere Top 40 rapping."}, {"a352": "For posterity’s sake, as always, The Fate of the Furious soundtrack is an effective summary of urban music in 2017. Migos is on here rapping non sequiturs about bath salts, NASCAR, and David Hasselhoff on “Seize the Block,” with Quavo breaking off to belt a soaring chorus on “Go Off” with Lil Uzi Vert and Travis Scott. Returning champ Wiz Khalifa is on a minor-key trap holler called “Gang Up” with 2 Chainz, Young Thug, and PnB Rock — a cross-gen roster that summarizes hip-hop’s current “rapsung” identity crisis. There’s an even larger crisis afoot in the form of token white rapper G-Eazy, who further ruins an already bad song called “Good Life” with Kehlani. Like it or not, no definitive record of hip-hop in 2017 is complete without accounting for G-Eazy’s unfortunate run of Zara cardigan raps."}, {"d507": "And then there’s Pitbull. Unlike previous Fast soundtrack MVPs, Pitbull has somehow never appeared in a Fast movie, but he’s been blessing these soundtracks with bilingual bops since 2 Fast 2 Furious. That was 2003, when he still wore massively oversized white tees and made crunk music. These days, Pitbull dresses like a Cuban American 007 and makes Carnival Cruise music. The best song on the Fate soundtrack is Pitbull and the Colombian singer J Balvin’s collaboration “Hey Ma,” which strikes at American pop music’s current obsession with tropical grooves. “Hey Ma” is the slight-but-sensational work of a rapper whose appeal is as broad and enduring as the Fast franchise itself. Both have come a long and lucrative way since their humble early-2000s beginnings."}, {"4018": "The Fate of the Furious soundtrack is a veritable Shoney’s breakfast buffet of contemporary hip-hop, the common ground where G-Eazy meets Kevin Gates. Big-budget soundtracks like Fifty Shades of Grey can churn out a decent pop single or two, but rarely do they capture the zeitgeist so comprehensively. When Suicide Squad was in theaters, there was a lot of consternation about the movie’s cloying mix of pop and oldies, which were so hyperactive and unsubtle as to be totally overbearing. There is nothing cool or exhilarating about hearing “Bohemian Rhapsody” for the 1,000,000th time in the 1,000th movie that has licensed that song."}, {"8f86": "You know what is cool? Kodak Black rapping about horsepower for a $110 million car movie in A.D. 2017. I don’t know if Kodak Black will be around next year, but he’s here now, and a Fate of the Furious soundtrack placement is the best sort of participation trophy that a young rapper could hope for. These movies are, after all, hypermasculine flicks about street racing, starring cars built for speed, handling, and bass. I’m sure there’s no better setting to hear “POV City Anthem” than in a Porsche GTS."}]}