{"child": "2028_1\t2028_2\t2028_3\t2028_4\t2028_5\t2028_6\t2028_7", "title": "Crowdaa. Your Crowd Management Platform.", "content": "Crowdaa. Your Crowd Management Platform. I belong to this 90’ hip-hop old-schooler’s generation who started to massively auto-produce music from home studios, to print CDs and sell them from hand to hand. It was all “low-budget”, totally independent and let any kid lend their energy to what Hip-Hop was about to become. Today, producing and distributing music has become an incredibly easy thing to do. With some talent and a laptop, you’re all set for production; add Distrokid or TuneCore and you’ve landed distribution. Your music will instantly be available on every possible online music store in the world… and then, you come to a fundamental point in music, “How do I engage people and build my crowd”, if you fail at that, your track will belong to the 20% of the Spotify catalogue that has never been played by anyone… ever! We’ve created Crowdaa because we believe that distribution, sales and marketing should work in concert and be entirely controlled by the artists. You should be able to set your price on tracks, limit the number of free views, and adjust those numbers if it goes too good or too bad. On Crowdaa, you can! We also believe you should be able to harness fan engagement of your music and transform it into something positive for you. We empower you. Set the limit on the number of free streams per song (or video) and ask your fans to promote you on social media to unlock more content, all while maximizing your exposure and building your crowd. At Crowdaa, we know how hard it is to get heard on the Web, so we’ve included a crazy text-message and email blaster. This tool allows you to collect phone numbers from multiple devices (from each member of your team) and merge all the contacts on your Crowdaa artist account. You can create “lists” (think about “LA people” or “Partners”) and blast this list in a click. No kidding. The entire thing can be done in a minute! That’s enough for an introduction. We’ll keep you in the loop on other powerful features in the coming weeks. Right now, the beta is open. We need you as testers to help us improve the platform. Please use it to upload your music. It’s free. Import your contacts and text your crowd letting them know about your next show. You can shoot 500 text-messages or 10,000 emails for $9.99 without a subscription. You can even ask for a discount… Cause it’s the launch! Find us on www.crowdaa.com. Build your music project and download our Android and iOS app. It’s a real pleasure to start the discussion,For the Crowdaa team, One love,VigileCEO and Co-founder of Crowdaa. ", "name": "2028", "parent": "", "sentences": [{"32d8": "Crowdaa. Your Crowd Management Platform."}, {"03ee": "I belong to this 90’ hip-hop old-schooler’s generation who started to massively auto-produce music from home studios, to print CDs and sell them from hand to hand. It was all “low-budget”, totally independent and let any kid lend their energy to what Hip-Hop was about to become. Today, producing and distributing music has become an incredibly easy thing to do. With some talent and a laptop, you’re all set for production; add Distrokid or TuneCore and you’ve landed distribution. Your music will instantly be available on every possible online music store in the world… and then, you come to a fundamental point in music, “How do I engage people and build my crowd”, if you fail at that, your track will belong to the 20% of the Spotify catalogue that has never been played by anyone… ever! We’ve created Crowdaa because we believe that distribution, sales and marketing should work in concert and be entirely controlled by the artists. You should be able to set your price on tracks, limit the number of free views, and adjust those numbers if it goes too good or too bad. On Crowdaa, you can!"}, {"d0c4": "We also believe you should be able to harness fan engagement of your music and transform it into something positive for you. We empower you. Set the limit on the number of free streams per song (or video) and ask your fans to promote you on social media to unlock more content, all while maximizing your exposure and building your crowd."}, {"8eff": "At Crowdaa, we know how hard it is to get heard on the Web, so we’ve included a crazy text-message and email blaster. This tool allows you to collect phone numbers from multiple devices (from each member of your team) and merge all the contacts on your Crowdaa artist account. You can create “lists” (think about “LA people” or “Partners”) and blast this list in a click. No kidding. The entire thing can be done in a minute!"}, {"18b8": "That’s enough for an introduction. We’ll keep you in the loop on other powerful features in the coming weeks. Right now, the beta is open. We need you as testers to help us improve the platform. Please use it to upload your music. It’s free. Import your contacts and text your crowd letting them know about your next show. You can shoot 500 text-messages or 10,000 emails for $9.99 without a subscription. You can even ask for a discount… Cause it’s the launch!"}, {"2b09": "Find us on www.crowdaa.com. Build your music project and download our Android and iOS app. It’s a real pleasure to start the discussion,For the Crowdaa team, One love,VigileCEO and Co-founder of Crowdaa."}]}