{"child": "2029_1\t2029_2\t2029_3\t2029_4\t2029_5\t2029_6\t2029_7\t2029_8\t2029_9\t2029_10\t2029_11\t2029_12\t2029_13\t2029_14\t2029_15\t2029_16\t2029_17\t2029_18\t2029_19\t2029_20\t2029_21\t2029_22\t2029_23\t2029_24\t2029_25", "title": "Let me break down exactly how we’ve screwed over creative people.", "content": "Let me break down exactly how we’ve screwed over creative people. Creatives are fucked. And it may be too late. The best part of doing creative work online for people is when they email you to say “you used to be good but now you’re a loser.” Or another of my favourites this week, “Fuck off you marketing scum.” Or “websites aren’t real businesses. Go build software asshole.” All of these for people who are consuming work that you’ve done for free. But hey, at least you get offered speaking and performing and writing and creative gigs! …until you tell them you want them to pay for your expenses or even a fee. Then they disappear pretty damn fast. Which is your own fault for violating the golden rule — bloggers and writers must never try to get paid. Once you try and get paid everyone thinks you’ve sold out. And they send you lovely messages yelling at you for it. How dare you! And when they read your free content they think they’re doing you a favour. And tell you that, too. “I gave you 5 minutes of my time reading your shit, so you owe me one.” I love publishing. But it’s a tough racket. And there’s a lot of crap you have to be able to handle from a lot of people. With not a whole lot back. It’s the same for almost any other creative industry. It’s also becoming increasingly difficult to look at publishing online or being an artist or recording music or starting a publication as a full time career. If you do want to get into creative work, you’re going to have to see it as a side hustle. Not your main gig. That’s just the way it is. It could become your main gig — if you’re very, very lucky — but the chances are slim. It’s hard to make it work. But that’s the case for most content creators. Film makers. Artists. Writers. Musicians. We’ve made it easier than ever to make stuff, and harder than ever to make enough money to live. And every day, there’s a new “disruptive” startup that does more damage. What they “disrupt” is creator’s profits, most of the time. That’s what music streaming did. And so now we look at creative work as something that should be free, or close to it. Hey, stuff on YouTube & Medium is “free” so why pay? For example: I started using micropayments recently to charge 10 cents for some articles on the Creatomic Wordpress. I got 5 emails calling me out for caring about money. People thought I was a sell out for charging $0.10 for articles nobody was forcing them to read. People don’t want to pay for content. They want to consume it for free, or monetise it for themselves. There’s never been a greater sense of people feeling entitled to your creative work than there is right now. And in that entitlement, respect for creative work is vanishing. If you tell people you’re an artist, they’ll tell you that’s not much of a career path and you should get a real job. If you tell people you’re building a tech startup platform for artists, they’ll be impressed and want to hear more. Sure, there’s some good people out there. The folks who built Patreon for writers and artists. Bandcamp for musicians. But how many people actually pay using those platforms? Certainly, they’re not the average punter. Or, put it this way. How many people could tell you how much money they’ve given to their favourite artists or writers or creators? Not to platforms, not to businesses, to actual creatives? To put it on a macro scale. Nicki Minaj, for example, has 77,000,000 Instagram followers consuming her free social content. 77,000,000 followers, and her last album sold 800,000 copies. That means that barely 1% of her followers actually purchased an album. The rest? Streaming it, YouTubing it, just following without buying. If a mega star like Nicki Minaj has a conversion rate that low for actual sales, what does that mean for indie creators? Some folks are going to point out that people don’t buy albums anymore, they stream them. Sure. In 2015, Drake made $15,000,000 from Spotify streaming. Nice cash right? Yes, but it took close to 2 billion streams to make that. I’m not saying you have to feel sorry for Nicki Minaj and Drake. I’m just saying that once you reduce those numbers down to the indie level, how do you think they look? Hint — nowhere near as healthy. Maybe $0.00084 a stream. And let me tell you, people spend a lot less on writing than they do on music. How does a writer live, on the money we’re talking right now? To bring this thread back home, we’re basically abolishing the full time musician/writer/filmmaker. We’re abolishing the full time creative. That’s what’s happening. We’re giving money to tech platforms to become “Unicorns” off the backs of creatives, and driving creatives out of business. If you grew up dreaming of being an artist, a writer, a musician, honing your craft, putting in your “10,000” hours, you may not even have the necessary skills to get a full time job to support your creative work. So what happens then? I don’t have any answers right now. But I will say this. I write because I’m passionate about it, and I love it. It’s not going away. I could have a readership of zero and I’d still be here. However, I also don’t see it as a full time gig. It’s something I do for the sake of doing it, because I want to do it. And that’s what creative work is becoming. The thing is, it’s hard to do great creative work at the end of the day when you’re tired and worn down by trying to make a living in a day job, in a business that you’ve founded to bring in income etc. And then when you do get to create something, and you put it out for the world to see, if it’s free you’ll get a bunch of people who hate it, and if it’s not you’ll be called money hungry. We’ve screwed creative people over. We started doing that years ago, and I’m worried that it’s now too late to change it. So the next time someone tells me about their disruptive music startup or publishing startup or filmmaking platform, you’ll forgive me if I look like I’m going to punch their teeth down their throat. ", "name": "2029", "parent": "", "sentences": [{"35d0": "Let me break down exactly how we’ve screwed over creative people."}, {"6ee3": "Creatives are fucked. And it may be too late."}, {"4163": "The best part of doing creative work online for people is when they email you to say “you used to be good but now you’re a loser.” Or another of my favourites this week, “Fuck off you marketing scum.” Or “websites aren’t real businesses. Go build software asshole.” All of these for people who are consuming work that you’ve done for free."}, {"ae35": "But hey, at least you get offered speaking and performing and writing and creative gigs!"}, {"f66f": "…until you tell them you want them to pay for your expenses or even a fee. Then they disappear pretty damn fast."}, {"57b5": "Which is your own fault for violating the golden rule — bloggers and writers must never try to get paid."}, {"6d56": "Once you try and get paid everyone thinks you’ve sold out. And they send you lovely messages yelling at you for it."}, {"6d23": "How dare you!"}, {"f69a": "And when they read your free content they think they’re doing you a favour. And tell you that, too. “I gave you 5 minutes of my time reading your shit, so you owe me one.”"}, {"f7dd": "I love publishing. But it’s a tough racket. And there’s a lot of crap you have to be able to handle from a lot of people. With not a whole lot back. It’s the same for almost any other creative industry."}, {"1bb8": "It’s also becoming increasingly difficult to look at publishing online or being an artist or recording music or starting a publication as a full time career."}, {"ba39": "If you do want to get into creative work, you’re going to have to see it as a side hustle. Not your main gig. That’s just the way it is."}, {"c2df": "It could become your main gig — if you’re very, very lucky — but the chances are slim. It’s hard to make it work."}, {"be22": "But that’s the case for most content creators. Film makers. Artists. Writers. Musicians. We’ve made it easier than ever to make stuff, and harder than ever to make enough money to live. And every day, there’s a new “disruptive” startup that does more damage."}, {"b9ea": "What they “disrupt” is creator’s profits, most of the time. That’s what music streaming did."}, {"d894": "And so now we look at creative work as something that should be free, or close to it. Hey, stuff on YouTube & Medium is “free” so why pay?"}, {"159a": "For example: I started using micropayments recently to charge 10 cents for some articles on the Creatomic Wordpress. I got 5 emails calling me out for caring about money. People thought I was a sell out for charging $0.10 for articles nobody was forcing them to read."}, {"34c6": "People don’t want to pay for content. They want to consume it for free, or monetise it for themselves."}, {"9ff6": "There’s never been a greater sense of people feeling entitled to your creative work than there is right now."}, {"d173": "And in that entitlement, respect for creative work is vanishing."}, {"8a8f": "If you tell people you’re an artist, they’ll tell you that’s not much of a career path and you should get a real job."}, {"0244": "If you tell people you’re building a tech startup platform for artists, they’ll be impressed and want to hear more."}, {"175a": "Sure, there’s some good people out there. The folks who built Patreon for writers and artists. Bandcamp for musicians. But how many people actually pay using those platforms? Certainly, they’re not the average punter."}, {"2384": "Or, put it this way. How many people could tell you how much money they’ve given to their favourite artists or writers or creators? Not to platforms, not to businesses, to actual creatives?"}, {"23be": "To put it on a macro scale. Nicki Minaj, for example, has 77,000,000 Instagram followers consuming her free social content."}, {"6e2f": "77,000,000 followers, and her last album sold 800,000 copies."}, {"94c2": "That means that barely 1% of her followers actually purchased an album. The rest? Streaming it, YouTubing it, just following without buying."}, {"af2b": "If a mega star like Nicki Minaj has a conversion rate that low for actual sales, what does that mean for indie creators?"}, {"d328": "Some folks are going to point out that people don’t buy albums anymore, they stream them. Sure. In 2015, Drake made $15,000,000 from Spotify streaming. Nice cash right? Yes, but it took close to 2 billion streams to make that."}, {"6a56": "I’m not saying you have to feel sorry for Nicki Minaj and Drake. I’m just saying that once you reduce those numbers down to the indie level, how do you think they look? Hint — nowhere near as healthy. Maybe $0.00084 a stream."}, {"404e": "And let me tell you, people spend a lot less on writing than they do on music. How does a writer live, on the money we’re talking right now?"}, {"d9c1": "To bring this thread back home, we’re basically abolishing the full time musician/writer/filmmaker. We’re abolishing the full time creative. That’s what’s happening."}, {"d736": "We’re giving money to tech platforms to become “Unicorns” off the backs of creatives, and driving creatives out of business."}, {"e944": "If you grew up dreaming of being an artist, a writer, a musician, honing your craft, putting in your “10,000” hours, you may not even have the necessary skills to get a full time job to support your creative work. So what happens then?"}, {"2e4d": "I don’t have any answers right now. But I will say this. I write because I’m passionate about it, and I love it. It’s not going away. I could have a readership of zero and I’d still be here. However, I also don’t see it as a full time gig. It’s something I do for the sake of doing it, because I want to do it. And that’s what creative work is becoming."}, {"3322": "The thing is, it’s hard to do great creative work at the end of the day when you’re tired and worn down by trying to make a living in a day job, in a business that you’ve founded to bring in income etc."}, {"4fe0": "And then when you do get to create something, and you put it out for the world to see, if it’s free you’ll get a bunch of people who hate it, and if it’s not you’ll be called money hungry."}, {"5dea": "We’ve screwed creative people over. We started doing that years ago, and I’m worried that it’s now too late to change it."}, {"b905": "So the next time someone tells me about their disruptive music startup or publishing startup or filmmaking platform, you’ll forgive me if I look like I’m going to punch their teeth down their throat."}]}