{"child": "2031_1\t2031_2\t2031_3\t2031_4\t2031_5\t2031_6\t2031_7\t2031_8\t2031_9\t2031_10\t2031_11\t2031_12\t2031_13\t2031_14\t2031_15\t2031_16\t2031_17\t2031_18\t2031_19\t2031_20\t2031_21\t2031_22\t2031_23\t2031_24\t2031_252031_1\t2031_2\t2031_3\t2031_4\t2031_5\t2031_6\t2031_7\t2031_8\t2031_9\t2031_10\t2031_11\t2031_12\t2031_13\t2031_14\t2031_15\t2031_16\t2031_17\t2031_18\t2031_19\t2031_20\t2031_21\t2031_22\t2031_23\t2031_24\t2031_25", "title": "25 Pretty-Fucking-Obvious Signs That He’s Not “the One.”", "content": "25 Pretty-Fucking-Obvious Signs That He’s Not “the One.” Or She. In honor of Valentine’s Day (thank god that greedy excuse to sell pink and red garbage of a holiday’s over) I thought I’d write a little something about relationships. Bad ones. And the inevitable warning signs we sometimes miss along the way. But first, before all the greeting card company reps and the Russell Stover’s fan club members leave a bunch of angry comments claiming I’m a bitter little asshole who hates “love” because I ate too many Hersey’s Kisses as a kid and puked up wax-flavored chocolates all over my first grade crush, let me clarify: I absolutely do NOT hate “love” or high-quality dark chocolates. I actually love love! I just don’t like being told by jewelry stores and Hallmark when or how I should tell my honey pie what he means to me. And let’s be honest — one’s first introduction to Valentine’s Day generally involves a dozen tiny Batman cards that say, “You’re the Greatest Valen-Bat!” and include heart candies that taste like engraved foot powder (I imagine). As far as holidays go, it’s no Halloween. 25 Beet-Red Warning Flags & Relationship Deal-Breakers: Note: I run an equal opportunity blog, so please adjust any gender references as necessary. 1. He has “accidentally” called you mom on more than one occasion. 2. He smells like warm cheese dipped in Polo. BEFORE he goes to the gym. 3. When you call him, sometimes, for no apparent reason, his phone just doesn’t ring. And he “never got your voicemail”… or your text messages. It’s a goddamn unsolved mystery. We can send a man to the bloody moon, but we can’t get this poor bastard’s cell phone out of the Bermuda-fucking-Triangle. And it’s not because he has T-Mobile. 4. You mention you’re into yoga (dodge-ball, stamp-collecting, whatever) so he tells you about his last girlfriend who was also into yoga and how she was absolutely amazing OR a Fatal Attraction psycho. Either way, you’re a disappointment. 5. You’re sure there’s a deep, emotionally-available guy under all the insensitivity and hair gel — and if you’re patient and understanding enough, you’ll eventually get there. Hahahahahahahahaha! Stop it, my stomach hurts. 6. He says he’s totally “over” his ex. Which is why he won’t stop talking about her, meeting her for coffee, or having “just friends” sex with her. 7. He has the sense of humor of an intellectually-stunted corpse… wrapped in plastic and weighed down with cinder blocks, at the bottom of a river. 8. When asked to list his positive traits, the best you can come up with is, “He almost never has food in his teeth.” Almost. 9. He made you watch the entire first season of Entourage. 10. She made you watch the entire first season of ANYTHING on Bravo. 11. His idea of emotional intimacy is letting you stay over… until 3am, when it’s all, “Evvverybody out! You don’t havta go home, but ya can’t stay here.” 12. He has all the introspection of a heavily-sedated bowl of pudding. 13. If you were injured and required immediate medical attention during Sports Center, there’s a good chance he’d let you bleed to death. Because it was pretty selfish of you to get hit by a car during Gatorade Cooler Talk. 14. When you get sick, he suddenly remembers his grandmother just died and he has to leave town for the funeral. 15. When you need a date to a friend’s wedding, he suddenly remembers his grandmother just died and he has to leave town for the funeral. 16. When you want to make out, he suddenly remembers his grandmother didn’t die — it was his friend’s co-worker’s second-cousin’s third-grade music teacher. He’s not going to the funeral. 17. He thinks he looks like Ryan Gosling. He actually looks like Mr. Magoo. 18. She thinks she looks like Scarlett Johansson. She also looks like Mr. Magoo.* *If you’re one of the .0024% of people who find Mr. Magoo attractive, my apologies and… gross. 19. One of you thinks he’s infallible. 20. You spend the entire day together and he barely acknowledges your presence. You’re Bruce Willis in The Sixth Sense. Shit. 21. His pet names for you leave much to be desired: “Hey you,” <finger snapping sound>, or “Maude.” * *If your real name is Maude, and/or you resemble Bea Arthur, this, while lacking in creativity, is fine. 22. You’d rather relive the 9th grade — with the added humiliation of headgear and a lazy eye — than spend the evening with his family. His family must suuuuuck. 23. He’s a The 700 Club kinda guy and you’re more of an Always Sunny In Philadelphia kinda gal. Or he’s a Fox and Friend’s kinda guy and you’re a sentient being. 24. He’s repeatedly expressed his opposition to the concept of monogamy. You’re married with three kids. 25. He has the mental stability of an arsonist in a toothpick factory with a blowtorch. BONUS: He believes his money/success/hair gives him carte blanche to personify both dickholery and douchebaggery. His untreated personality disorder means he’ll take that as a compliment. Okay, I’m out. Which ones did I miss? Let me know! If you read this post and you enjoyed it, or at least most of it — say slightly more than half, or around 52% of it — and you didn’t just hate hate hate the other 48%, then please consider clicking that little heart. More stuff by me: How NOT to Nail that Corporate Gig.You’re Welcome.medium.com ", "name": "2031", "parent": "", "sentences": [{"6b07": "25 Pretty-Fucking-Obvious Signs That He’s Not “the One.”"}, {"1657": "Or She."}, {"634f": "In honor of Valentine’s Day (thank god that greedy excuse to sell pink and red garbage of a holiday’s over) I thought I’d write a little something about relationships. Bad ones. And the inevitable warning signs we sometimes miss along the way."}, {"2255": "But first, before all the greeting card company reps and the Russell Stover’s fan club members leave a bunch of angry comments claiming I’m a bitter little asshole who hates “love” because I ate too many Hersey’s Kisses as a kid and puked up wax-flavored chocolates all over my first grade crush, let me clarify: I absolutely do NOT hate “love” or high-quality dark chocolates."}, {"9c91": "I actually love love! I just don’t like being told by jewelry stores and Hallmark when or how I should tell my honey pie what he means to me. And let’s be honest — one’s first introduction to Valentine’s Day generally involves a dozen tiny Batman cards that say, “You’re the Greatest Valen-Bat!” and include heart candies that taste like engraved foot powder (I imagine). As far as holidays go, it’s no Halloween."}, {"aaaf": "25 Beet-Red Warning Flags & Relationship Deal-Breakers:"}, {"1578": "Note: I run an equal opportunity blog, so please adjust any gender references as necessary."}, {"bd37": "1. He has “accidentally” called you mom on more than one occasion."}, {"9830": "2. He smells like warm cheese dipped in Polo. BEFORE he goes to the gym."}, {"e82b": "3. When you call him, sometimes, for no apparent reason, his phone just doesn’t ring. And he “never got your voicemail”… or your text messages. It’s a goddamn unsolved mystery. We can send a man to the bloody moon, but we can’t get this poor bastard’s cell phone out of the Bermuda-fucking-Triangle."}, {"3a63": "And it’s not because he has T-Mobile."}, {"f998": "4. You mention you’re into yoga (dodge-ball, stamp-collecting, whatever) so he tells you about his last girlfriend who was also into yoga and how she was absolutely amazing OR a Fatal Attraction psycho. Either way, you’re a disappointment."}, {"d396": "5. You’re sure there’s a deep, emotionally-available guy under all the insensitivity and hair gel — and if you’re patient and understanding enough, you’ll eventually get there."}, {"fd52": "Hahahahahahahahaha! Stop it, my stomach hurts."}, {"15f6": "6. He says he’s totally “over” his ex. Which is why he won’t stop talking about her, meeting her for coffee, or having “just friends” sex with her."}, {"e06f": "7. He has the sense of humor of an intellectually-stunted corpse… wrapped in plastic and weighed down with cinder blocks, at the bottom of a river."}, {"d5c3": "8. When asked to list his positive traits, the best you can come up with is, “He almost never has food in his teeth.”"}, {"deed": "Almost."}, {"59e7": "9. He made you watch the entire first season of Entourage."}, {"2195": "10. She made you watch the entire first season of ANYTHING on Bravo."}, {"d41d": "11. His idea of emotional intimacy is letting you stay over… until 3am, when it’s all, “Evvverybody out! You don’t havta go home, but ya can’t stay here.”"}, {"ebaf": "12. He has all the introspection of a heavily-sedated bowl of pudding."}, {"79ca": "13. If you were injured and required immediate medical attention during Sports Center, there’s a good chance he’d let you bleed to death. Because it was pretty selfish of you to get hit by a car during Gatorade Cooler Talk."}, {"9100": "14. When you get sick, he suddenly remembers his grandmother just died and he has to leave town for the funeral."}, {"9711": "15. When you need a date to a friend’s wedding, he suddenly remembers his grandmother just died and he has to leave town for the funeral."}, {"0240": "16. When you want to make out, he suddenly remembers his grandmother didn’t die — it was his friend’s co-worker’s second-cousin’s third-grade music teacher. He’s not going to the funeral."}, {"8fb4": "17. He thinks he looks like Ryan Gosling. He actually looks like Mr. Magoo."}, {"50d6": "18. She thinks she looks like Scarlett Johansson. She also looks like Mr. Magoo.*"}, {"70c2": "*If you’re one of the .0024% of people who find Mr. Magoo attractive, my apologies and… gross."}, {"92a0": "19. One of you thinks he’s infallible."}, {"0fd3": "20. You spend the entire day together and he barely acknowledges your presence. You’re Bruce Willis in The Sixth Sense."}, {"7a9b": "Shit."}, {"0d7c": "21. His pet names for you leave much to be desired: “Hey you,” <finger snapping sound>, or “Maude.” *"}, {"414d": "*If your real name is Maude, and/or you resemble Bea Arthur, this, while lacking in creativity, is fine."}, {"9589": "22. You’d rather relive the 9th grade — with the added humiliation of headgear and a lazy eye — than spend the evening with his family."}, {"7abd": "His family must suuuuuck."}, {"ab54": "23. He’s a The 700 Club kinda guy and you’re more of an Always Sunny In Philadelphia kinda gal. Or he’s a Fox and Friend’s kinda guy and you’re a sentient being."}, {"5818": "24. He’s repeatedly expressed his opposition to the concept of monogamy. You’re married with three kids."}, {"a479": "25. He has the mental stability of an arsonist in a toothpick factory with a blowtorch."}, {"7468": "BONUS: He believes his money/success/hair gives him carte blanche to personify both dickholery and douchebaggery. His untreated personality disorder means he’ll take that as a compliment."}, {"d022": "Okay, I’m out. Which ones did I miss? Let me know!"}, {"423e": "If you read this post and you enjoyed it, or at least most of it — say slightly more than half, or around 52% of it — and you didn’t just hate hate hate the other 48%, then please consider clicking that little heart."}, {"6a97": "More stuff by me:"}, {"9200": "How NOT to Nail that Corporate Gig.You’re Welcome.medium.com"}]}