{"child": "2035_1\t2035_2", "title": "Don’t conquer the world.", "content": "Don’t conquer the world. Don’t conquer the world. Wake up and make your bed. Brush your teeth in circular motion. Don’t forget to floss first. Iron your own clothes. Wash your own clothes. Polish your own shoes. Enjoy the art of cooking. Learn how to kiss. Life is not in order, so why should your life be? Adapt. Observe. If someone insults you, unfriend them. Why did you become friends with them? I know, you were lonely. I know, you felt unwanted. I know, you needed someone, anyone. Love your parents. Love your siblings. I don’t know why. I think it’s a rule written somewhere, but do it. Hate “Lord of the Rings” movies. Love “Lord of the Rings” books. If you enjoy fantasy forget the above and love “Shannara” (everything) by Terry Brooks. He literally saved my life in high school. Be poor financially and live your dream. There are other dreamers that share your spirit. They will make you wealthy. Wealthy, is a definition left up to you. If you want to contribute a short spurt, please send it and I will include it. Hugs, peace and harmony. To be continued… If you like this article please click ❤ and also share it with others. If you would like to check out some of my work, press here. ", "name": "2035", "parent": "", "sentences": [{"c91e": "Don’t conquer the world."}, {"7b58": "Don’t conquer the world."}, {"03c1": "Wake up and make your bed."}, {"6c7f": "Brush your teeth in circular motion. Don’t forget to floss first."}, {"f937": "Iron your own clothes."}, {"19f7": "Wash your own clothes."}, {"ab21": "Polish your own shoes."}, {"3200": "Enjoy the art of cooking."}, {"1956": "Learn how to kiss."}, {"6f96": "Life is not in order, so why should your life be?"}, {"6425": "Adapt."}, {"b3fa": "Observe."}, {"72f1": "If someone insults you, unfriend them."}, {"c205": "Why did you become friends with them?"}, {"2591": "I know, you were lonely."}, {"f91d": "I know, you felt unwanted."}, {"ad54": "I know, you needed someone, anyone."}, {"7fb7": "Love your parents."}, {"831b": "Love your siblings."}, {"f2aa": "I don’t know why. I think it’s a rule written somewhere, but do it."}, {"796a": "Hate “Lord of the Rings” movies."}, {"79d7": "Love “Lord of the Rings” books."}, {"fe74": "If you enjoy fantasy forget the above and love “Shannara” (everything) by Terry Brooks. He literally saved my life in high school."}, {"ec0e": "Be poor financially and live your dream."}, {"7f04": "There are other dreamers that share your spirit."}, {"00ad": "They will make you wealthy."}, {"edf0": "Wealthy, is a definition left up to you."}, {"d9c2": "If you want to contribute a short spurt, please send it and I will include it. Hugs, peace and harmony."}, {"75f9": "To be continued…"}, {"4544": "If you like this article please click ❤ and also share it with others."}, {"1e1c": "If you would like to check out some of my work, press here."}]}