{"child": "2056_1\t2056_2\t2056_3\t2056_4\t2056_5\t2056_62056_1\t2056_2\t2056_3\t2056_4\t2056_5\t2056_6", "title": "Is Instagram the new gateway to photography?", "content": "Is Instagram the new gateway to photography? Instagram: are you on it? Or have you dismissed it? The mobile phone photography app created by American entrepreneur/programmer Kevin Systrom and Brazilian entrepreneur/software engineer Mike Krieger is filled with photography created by amateurs and professionals alike, but is it the new gateway to photography? Let me explain. I’m not an early adopter of any technology, so it took four years for me to open an Instagram account. I just didn’t get why I needed it, despite hearing tales of photographers being discovered by high-paying clients amongst its many supposed features. It seemed like a platform I could take or leave, so for a few years I left it alone. Finally, I dived into its image saturated depths and, lo and behold, I was reborn — or at least my enjoyment of photography was. Once I got over the fact that many professional photographers were using it as a self-promoting digital portfolio by re-posting their archives, I started to discover new work. There were new photographers and those creating and distributing work at a furious pace that gave great insight into their working methods and developing narratives. I started to follow these photographers alongside others I was already interested in. I got it, but I still wasn’t sure how I would use it in my practice. Slowly but surely, I started to realize that I could use both my smartphone and the platform as a form of digital photo sketchbook. This realization soon developed into a process of seeing and documenting that I refer to as #photosketching, which I have shared with the university students I teach as part of their exploration and enjoyment of photography as a visual language. Many of the students — although by no means all — were using Instagram like a photography-only version of their Facebook pages, documenting and posting nights out, boyfriends, girlfriends and holidays, but with little understanding of how it could relate to their photographic studies. It has been two years since I began introducing the #photosketching concept to address this issue. In that time, things have changed and this is how. Recently, when interviewing students looking to join the program I teach, I started hearing the same answer repeatedly given to a range of different questions: Where do you look at photography? Instagram. Where do you find out about photographers? Instagram. Where do you show your photography? Instagram. Do you visit exhibitions? No, I look on Instagram. To these students, Instagram is photography and photography is Instagram. Not many students talk of a passion for looking at or reading books. Very few look at magazines or can name photographers that inspire them. Perhaps most surprisingly, almost none of them look at photographer’s websites for inspiration. In fact, looking at work online is viewed as research based solely on teacher suggestions and seems to be rarely self-initiated. In contrast, Instagram is theirs. It’s free — unlike books and magazines — and they have ownership. It acts as their personal researcher and promoter of images. Instagram is their gateway to photography, feeding them the images they want to see based on what they have seen, but not necessarily the images they need to see. It is not in Instagram’s interest to push their subscribers out of their comfort zones or to introduce them to images that challenge perceptions. The Instagram account holder is a customer and therefore someone to be kept happy with what Instagram knows about them. The students I interviewed spoke positively of their experiences with photography through the app. They are happy customers. But if we are to understand and accept that Instagram is the gateway to photography and potentially photographic education, then those of us in positions of education need to understand how to create a journey for the young photographer once they have come through that gate. To do this requires a respect for the platform and the process of image creation through a smartphone. It also demands personal engagement with the concept of new pathways into photographic creation and study. I have previously written about the negative issues which an over-reliance on single image observation can have, particularly in an understanding of developing narrative. However, by explaining how students can take control of their learning through the use of Instagram, I believe it is possible to not only maintain and develop their excitement with the medium, but also to utilize a tool they are already engaged with to explore photography outside of the app’s contextual parameters. What I mean by this is educators need to introduce students to the concept of photography as part of their lives outside of the smartphone. There is a need to introduce the artistic and commercial contexts for photography, and to explain how work they see on Instagram relates to these areas. If you discovered photography through more conventional and traditional pathways, this may seem to be an irrelevant suggestion. But for those who have come to photography only through the app, it can be a difficult connection to make. This lack of context awareness can also lead to a lack of understanding concerning copyright and image ownership, and the act of commissioning, amongst student photographers. Traditional communication formats such as books, magazines, newspapers, billboards, television and exhibitions have long been recognized as gateways to photography for those taking their first steps into the medium. But these are formats that young students are not engaging with, and it is therefore only natural that the platforms they are engaging with will become the new gateways. To deny this would be to deny that the world of global communication is constantly evolving and that photography has an intrinsic role in that evolution. For a photographer to ignore the impact of Instagram on lens-based image creation could be an act of informed decision making. For a teacher involved in photographic education to ignore Instragram’s impact on the next generation of photographers would be an act of denial and negligence. Grant Scott is the founder/curator of United Nations of Photography, a Senior Lecturer in Editorial and Advertising Photography at the University of Gloucestershire, a working photographer, and the author of Professional Photography: The New Global Landscape Explained (Focal Press 2014) and The Essential Student Guide to Professional Photography (Focal Press 2015). His next book #New Ways of Seeing: The Democratic Language of Photography will be published by Bloomsbury Academic in 2018. You can follow Grant on Twitter and on Instagram @UNofPhoto. Text © Grant Scott 2017 If you liked this article, make sure to click the 💚 below so other people will see it here on Medium. ", "name": "2056", "parent": "", "sentences": [{"b76d": "Is Instagram the new gateway to photography?"}, {"0c9d": "Instagram: are you on it? Or have you dismissed it?"}, {"cd8e": "The mobile phone photography app created by American entrepreneur/programmer Kevin Systrom and Brazilian entrepreneur/software engineer Mike Krieger is filled with photography created by amateurs and professionals alike, but is it the new gateway to photography? Let me explain."}, {"7f30": "I’m not an early adopter of any technology, so it took four years for me to open an Instagram account. I just didn’t get why I needed it, despite hearing tales of photographers being discovered by high-paying clients amongst its many supposed features. It seemed like a platform I could take or leave, so for a few years I left it alone."}, {"4dde": "Finally, I dived into its image saturated depths and, lo and behold, I was reborn — or at least my enjoyment of photography was. Once I got over the fact that many professional photographers were using it as a self-promoting digital portfolio by re-posting their archives, I started to discover new work. There were new photographers and those creating and distributing work at a furious pace that gave great insight into their working methods and developing narratives. I started to follow these photographers alongside others I was already interested in."}, {"1796": "I got it, but I still wasn’t sure how I would use it in my practice. Slowly but surely, I started to realize that I could use both my smartphone and the platform as a form of digital photo sketchbook. This realization soon developed into a process of seeing and documenting that I refer to as #photosketching, which I have shared with the university students I teach as part of their exploration and enjoyment of photography as a visual language."}, {"62c6": "Many of the students — although by no means all — were using Instagram like a photography-only version of their Facebook pages, documenting and posting nights out, boyfriends, girlfriends and holidays, but with little understanding of how it could relate to their photographic studies. It has been two years since I began introducing the #photosketching concept to address this issue. In that time, things have changed and this is how."}, {"0c49": "Recently, when interviewing students looking to join the program I teach, I started hearing the same answer repeatedly given to a range of different questions:"}, {"28dd": "Where do you look at photography? Instagram."}, {"25ba": "Where do you find out about photographers? Instagram."}, {"e4c9": "Where do you show your photography? Instagram."}, {"90af": "Do you visit exhibitions? No, I look on Instagram."}, {"c26a": "To these students, Instagram is photography and photography is Instagram."}, {"effc": "Not many students talk of a passion for looking at or reading books. Very few look at magazines or can name photographers that inspire them. Perhaps most surprisingly, almost none of them look at photographer’s websites for inspiration. In fact, looking at work online is viewed as research based solely on teacher suggestions and seems to be rarely self-initiated."}, {"b69e": "In contrast, Instagram is theirs. It’s free — unlike books and magazines — and they have ownership. It acts as their personal researcher and promoter of images. Instagram is their gateway to photography, feeding them the images they want to see based on what they have seen, but not necessarily the images they need to see."}, {"c811": "It is not in Instagram’s interest to push their subscribers out of their comfort zones or to introduce them to images that challenge perceptions. The Instagram account holder is a customer and therefore someone to be kept happy with what Instagram knows about them."}, {"ac27": "The students I interviewed spoke positively of their experiences with photography through the app. They are happy customers. But if we are to understand and accept that Instagram is the gateway to photography and potentially photographic education, then those of us in positions of education need to understand how to create a journey for the young photographer once they have come through that gate. To do this requires a respect for the platform and the process of image creation through a smartphone. It also demands personal engagement with the concept of new pathways into photographic creation and study."}, {"49d5": "I have previously written about the negative issues which an over-reliance on single image observation can have, particularly in an understanding of developing narrative. However, by explaining how students can take control of their learning through the use of Instagram, I believe it is possible to not only maintain and develop their excitement with the medium, but also to utilize a tool they are already engaged with to explore photography outside of the app’s contextual parameters."}, {"63bf": "What I mean by this is educators need to introduce students to the concept of photography as part of their lives outside of the smartphone. There is a need to introduce the artistic and commercial contexts for photography, and to explain how work they see on Instagram relates to these areas. If you discovered photography through more conventional and traditional pathways, this may seem to be an irrelevant suggestion. But for those who have come to photography only through the app, it can be a difficult connection to make. This lack of context awareness can also lead to a lack of understanding concerning copyright and image ownership, and the act of commissioning, amongst student photographers."}, {"f4aa": "Traditional communication formats such as books, magazines, newspapers, billboards, television and exhibitions have long been recognized as gateways to photography for those taking their first steps into the medium. But these are formats that young students are not engaging with, and it is therefore only natural that the platforms they are engaging with will become the new gateways. To deny this would be to deny that the world of global communication is constantly evolving and that photography has an intrinsic role in that evolution."}, {"727b": "For a photographer to ignore the impact of Instagram on lens-based image creation could be an act of informed decision making. For a teacher involved in photographic education to ignore Instragram’s impact on the next generation of photographers would be an act of denial and negligence."}, {"50d9": "Grant Scott is the founder/curator of United Nations of Photography, a Senior Lecturer in Editorial and Advertising Photography at the University of Gloucestershire, a working photographer, and the author of Professional Photography: The New Global Landscape Explained (Focal Press 2014) and The Essential Student Guide to Professional Photography (Focal Press 2015). His next book #New Ways of Seeing: The Democratic Language of Photography will be published by Bloomsbury Academic in 2018."}, {"22da": "You can follow Grant on Twitter and on Instagram @UNofPhoto."}, {"26c2": "Text © Grant Scott 2017"}, {"0e08": "If you liked this article, make sure to click the 💚 below so other people will see it here on Medium."}]}