{"child": "2059_12059_1", "title": "Meet the Masterclass East Africa: Brian Otieno", "content": "Meet the Masterclass East Africa: Brian Otieno We asked each of the 11 participants of the satellite Masterclass East Africa six questions. Today, we’re talking with Kenyan photographer Brian Otieno. Brian presents his work on the first day of the masterclass. © World Press Photo What was your first encounter with documentary photography? I grew up in this place called Kibera, Nairobi’s biggest slum, where there are so many people and stories. I walk around and see a millions things, so I started taking photos with my cell phone camera and uploading them on social media. I started getting people interested in this place. This is how I started my project Kibera stories, which I mostly post on Instagram because it’s visual and interactive. People will contact me on Instagram and ask me what’s happening in the area. I became the Kibera expert! The project grew and grew. I then bought my first camera, and today I’m still expanding the project. You see, if you google Kibera, most of the images that will pop up only show the poverty side of Kibera. My project was different because it’s mixed up. It shows a lot of things: the good, the bad and everything else. Can you tell us about the photo story you made for the masterclass? I did my photo story about the teenage mums of Kibera. In Kibera, 25 percent of girls aged 15–19 years have already given birth due to lack of sexual health education and a lack of empowerment. The consequences of these early pregnancies has led to approximately 30 percent of the girls in Kibera dropping out of school. They are rejected by the community and driven away from home by their families. Despite several efforts made by non-governmental organizations to bring support to the most serious cases of these teen mothers, the majority of them are not helped and are always on their own. As someone who was born and raised in Kibera by a young mother, I have witnessed so much struggle in such an environment and understand the feeling and importance of a mom in a family. I want to tell the stories of these teen mothers to call for more attention on the real life situations of this marginal group and extend the discussion further to several other vital social issues, such as empowerment and education. Nineteen-year-old Evonne is applying makeup outside her house in Kibera, preparing to go for a girl’s night out party with a group of friends in the city center. At 16, she gave birth and six months later her child died of malaria in the upcountry. © Brian Otieno for the World Press Photo Masterclass East Africa What is the most helpful thing you’ve taken away from the masterclass? The masterclass was a really great experience. It’s really going to build my career as a photojournalist. I’ve made many stories before, and that was it—but now after the masterclass, I’m confident that my stories can reach a global audience. Julien was really helpful in this. I never knew anything like a “pitch” before. Another thing was how amazing it was to be in a room full of young visual journalists from Africa, editing stories, sharing ideas and having fun. Meeting all these participants is something I will never forget. Now I can travel around Africa knowing that I have good friends in Ethiopia, Malawi, Zimbabwe, Uganda, South Africa, Burundi, and my good friend Andrew from Nigeria. The masterclass was intense and terrific. Of course, I had seen the evocative portrait of Bibi Aisha, and here was Jodi Bieber—who won the 2011 World Press Photo of the Year — as one of the masters giving us advice and tips. This really inspired and challenged me. The only complaint I had was that five days was a really short time, but we had the best masters and I came out of the masterclass knowing things I’d have never learned by documenting protests in Nairobi and telling stories from Kibera. Brian and master Thomas Mukoya during a one-on-one session. © World Press Photo What part of the job do you struggle with? Sometimes I have the photos and I know the stories, but I don’t have the captions. I often ask myself how I’m going to put my photos into writing. Master Thomas gave me a simple guide for this, but I never knew how important good captions were to a story. Do you use social media professionally? Yes, I am all about social media! I use it to promote my work and I reach all kinds of people. It’s a fast way to share information. I really only use it professionally. That’s how I started to be known. If you search my name on social media, I’m all over. I’ve even had my own hashtag (#KiberaStories) since 2013. When you research just Kibera, you’ll find a bunch of depressing images, but if you search #KiberaStories, you’ll see some amazing images! It was something completely different than what was out there previously. My Kibera Stories can be found on Facebook, Instagram and Tumblr. How do you see your project and career progressing? Regarding my project, it is a long-term project. I want to follow these young women raising their kids over the years. For my career, I’ve been freelancing for a very long time. I get mostly assignments from NGOs, and those give me an income, but the project that I’m really passionate about is Kibera Stories. As long as I’m alive, I will continue the Kibera Stories. I think of it like Humans of New York. This is what defines me and my work. My goal is to take it globally because I’ve always aimed for it to have a global audience. Sixteen-year-old Valerie poses with her 17-month-old baby girl Trizah Maya. Valerie’s mother was so furious and felt betrayed when her daughter got pregnant. Whenever she’s angry with Valerie, she tells her to go back to where she got pregnant. © Brian Otieno for the World Press Photo Masterclass East Africa Brian was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists. If you liked this article, make sure to click ♡ below so other people will see it here on Medium. ", "name": "2059", "parent": "", "sentences": [{"af74": "Meet the Masterclass East Africa: Brian Otieno"}, {"d029": "We asked each of the 11 participants of the satellite Masterclass East Africa six questions. Today, we’re talking with Kenyan photographer Brian Otieno."}, {"5911": "Brian presents his work on the first day of the masterclass. © World Press Photo"}, {"a63f": "What was your first encounter with documentary photography?"}, {"49e3": "I grew up in this place called Kibera, Nairobi’s biggest slum, where there are so many people and stories. I walk around and see a millions things, so I started taking photos with my cell phone camera and uploading them on social media. I started getting people interested in this place. This is how I started my project Kibera stories, which I mostly post on Instagram because it’s visual and interactive. People will contact me on Instagram and ask me what’s happening in the area. I became the Kibera expert! The project grew and grew. I then bought my first camera, and today I’m still expanding the project. You see, if you google Kibera, most of the images that will pop up only show the poverty side of Kibera. My project was different because it’s mixed up. It shows a lot of things: the good, the bad and everything else."}, {"0ac3": "Can you tell us about the photo story you made for the masterclass?"}, {"c04c": "I did my photo story about the teenage mums of Kibera. In Kibera, 25 percent of girls aged 15–19 years have already given birth due to lack of sexual health education and a lack of empowerment. The consequences of these early pregnancies has led to approximately 30 percent of the girls in Kibera dropping out of school. They are rejected by the community and driven away from home by their families."}, {"fe15": "Despite several efforts made by non-governmental organizations to bring support to the most serious cases of these teen mothers, the majority of them are not helped and are always on their own. As someone who was born and raised in Kibera by a young mother, I have witnessed so much struggle in such an environment and understand the feeling and importance of a mom in a family. I want to tell the stories of these teen mothers to call for more attention on the real life situations of this marginal group and extend the discussion further to several other vital social issues, such as empowerment and education."}, {"9337": "Nineteen-year-old Evonne is applying makeup outside her house in Kibera, preparing to go for a girl’s night out party with a group of friends in the city center. At 16, she gave birth and six months later her child died of malaria in the upcountry. © Brian Otieno for the World Press Photo Masterclass East Africa"}, {"3154": "What is the most helpful thing you’ve taken away from the masterclass?"}, {"5e38": "The masterclass was a really great experience. It’s really going to build my career as a photojournalist. I’ve made many stories before, and that was it—but now after the masterclass, I’m confident that my stories can reach a global audience. Julien was really helpful in this. I never knew anything like a “pitch” before."}, {"9590": "Another thing was how amazing it was to be in a room full of young visual journalists from Africa, editing stories, sharing ideas and having fun. Meeting all these participants is something I will never forget. Now I can travel around Africa knowing that I have good friends in Ethiopia, Malawi, Zimbabwe, Uganda, South Africa, Burundi, and my good friend Andrew from Nigeria."}, {"5627": "The masterclass was intense and terrific. Of course, I had seen the evocative portrait of Bibi Aisha, and here was Jodi Bieber—who won the 2011 World Press Photo of the Year — as one of the masters giving us advice and tips. This really inspired and challenged me."}, {"22af": "The only complaint I had was that five days was a really short time, but we had the best masters and I came out of the masterclass knowing things I’d have never learned by documenting protests in Nairobi and telling stories from Kibera."}, {"e8e2": "Brian and master Thomas Mukoya during a one-on-one session. © World Press Photo"}, {"c0ce": "What part of the job do you struggle with?"}, {"aee7": "Sometimes I have the photos and I know the stories, but I don’t have the captions. I often ask myself how I’m going to put my photos into writing. Master Thomas gave me a simple guide for this, but I never knew how important good captions were to a story."}, {"a89f": "Do you use social media professionally?"}, {"2c1e": "Yes, I am all about social media! I use it to promote my work and I reach all kinds of people. It’s a fast way to share information. I really only use it professionally. That’s how I started to be known. If you search my name on social media, I’m all over. I’ve even had my own hashtag (#KiberaStories) since 2013. When you research just Kibera, you’ll find a bunch of depressing images, but if you search #KiberaStories, you’ll see some amazing images! It was something completely different than what was out there previously. My Kibera Stories can be found on Facebook, Instagram and Tumblr."}, {"44bf": "How do you see your project and career progressing?"}, {"93b6": "Regarding my project, it is a long-term project. I want to follow these young women raising their kids over the years. For my career, I’ve been freelancing for a very long time. I get mostly assignments from NGOs, and those give me an income, but the project that I’m really passionate about is Kibera Stories. As long as I’m alive, I will continue the Kibera Stories. I think of it like Humans of New York. This is what defines me and my work. My goal is to take it globally because I’ve always aimed for it to have a global audience."}, {"9251": "Sixteen-year-old Valerie poses with her 17-month-old baby girl Trizah Maya. Valerie’s mother was so furious and felt betrayed when her daughter got pregnant. Whenever she’s angry with Valerie, she tells her to go back to where she got pregnant. © Brian Otieno for the World Press Photo Masterclass East Africa"}, {"4c31": "Brian was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists."}, {"35ec": "If you liked this article, make sure to click ♡ below so other people will see it here on Medium."}]}