{"name": "206", "parent": "", "content": "12 Reasons Why Being a Woman is Completely Amazing These days, being a woman can be really frustrating. Like sometimes, I can’t help but think that my sad addiction to $5 almond-milk-americano-misto’s wouldn’t be such a big deal if I didn’t make 20% less than my male counterparts. Ugh, sorry, I’m not a political writer and I don’t even want to attempt to be one. All I want to point out on this International Women’s Day is that being a woman is completely f&*king amazing, and these are just a few of the reasons why… 1. The Clothes via Instagram Honestly, there are just so many more options for dressing when you are female. I noticed this recently (though not for the first time) when shopping with my boyfriend. Every store we went into had a massive section for women’s wear. Mannequins with purple hair and polished fingers modeled sequined crop tops and pleather pants tucked into frilly socks (I really like TopShop, okay?). Upbeat music blared overhead and, like clockwork, every 42.3 seconds a sales clerk with an uber trendy haircut would ask if they could start me a fitting room. (I always tell them no, I like to use the weight of clothing in my hands as a budgeting tool. I can only buy as much as I can carry home.) And then, over in the corner near the stockroom and the bathrooms, a lonely area, smaller than my walk-in closet at my parent’s house: the menswear section. A dusty lightbulb flickered overhead. The same button up shirt in seven dull colours lined the barren walls. The selection, overwhelmingly sparse. Within 10 minutes, my boyfriend had sufficiently perused through every article of clothing on every inch of wall and shelf in the men’s section, while I had just barely made it through one rack of diverse clothing: patterns, textures, colours and materials that all just beckoned me to try them on. It’s not fair, really, but as we ladies have learned, sometimes life isn’t fair. 2. Our Miracle Vessels While I haven’t had the pleasure of becoming a mother just yet, it’s something that, when I’m good and ready to become a mother, I’m profoundly looking forward to. Whether you have children or not; whether you ever plan on having children or not, isn’t it totally miraculous to think about what our bodies are capable of? And isn’t that something we should celebrate and honour every single day? Like, yes, go treat yourself simply for the fact that your body is a vessel for the world’s most vital miracle. 3. Our Periods Speaking of miracle vessels… Okay, I know I’ve said, like a million times, that I turn into a total monster when I’m on my period and it’s really painful and I hate it and stuff. But, I also kind of love it. More to the point, I love being able to use my period as an excuse to not get out of bed, or to stay home from work, or eat ALL the chocolate, or watch a marathon of Girls on HBO and not feel guilty about it (this is also a really great example of why I’m not “good and ready” to become a mother, just yet). In ancient times, women used to be celebrated because of their periods, for the sheer fact that they could bleed for several days and still survive. Can we get back to that, please? 4. Boobs I can be hard on my boobs. They are the first place I lose weight and are also slightly more wide-set than mass media leads me to believe is the perfect composition. They naturally lay flat like pancakes (sorry for that visual) when I lay flat, but really, they are beautiful, glorious lumps of fat and there’s no distance too far between them that a good bra can’t fix. 5. The security in the notion of “women and children first!” Anyone who has watched Titanic knows exactly what I’m talking about, here. Call me insensitive, call me a monster, call me what you want to call me, but I find some dreary sense of peace in this notion. There. I said it. 6. Multiple orgasms Need I say more? 7. Our bodies Let’s face it, the female body, in all of its glory is a beautiful thing: gorgeous curves, soft lines, and no hanging appendages. And let’s also make one thing crystal clear: Your body (just like my body) doesn’t have to look a certain way or be a certain size. Your body (just like my body) is a human body. It’s constantly changing, regulating, rebuilding & evolving — and was given to you for a very specific reason. It’s your protector, your warrior, your vessel to experience the world. Every inch of your body holds a sacred piece of who you are. I don’t mean to speak for you, or over-step, but collectively, I think we spend way too much time obsessing over our self-perceived flaws and not enough time obsessing over how insanely amazing our female bodies truly are. Time to show your body some love, babe. 8. Makeup via littlefoolbook Yeah, yeah, I know, I’ve written plenty on the advantages of going au natural and the surprising things that happen when you stop wearing makeup every day, but it’s nice to have options, right? Personally, I love the fact that when I’m feeling a little bold I can gloss on some fuchsia lip stain, or draw on some dramatic eyeliner. I love the fact that when I’m feeling a little less-than-confident (because we all have those days), I can cover up my blemishes with powders and potions that magically match my skin tone. And I really love the way mixing a little shimmer in my everyday SPF makes me glow. 9. We’re, like, really soft. Especially after just shaving. And is it just me or is that feeling of freshly shaved legs in freshly washed sheets comparable to the feeling of cuddling 1000 tiny little kittens all at once in a bed made of clouds? 10. Never having to think about or brainstorm or Google, “good pickup lines.” What a relief, right? Just think of how much time you’ve likely saved yourself simply for the fact that you were born female and cheesy pickup lines are not your responsibility. (Also, if you had been born male, you probably still would have known better than to use the ol’ “Did it hurt when you fell from heaven” line on any unsuspecting woman.) 11. Statistically speaking, women live longer than men. Sorry gentlemen, it’s just fact. (Though, I’m pretty sure I don’t have anyone to apologize to here, considering how many times I’ve used the word “period” on this blog.) 12. Flower crowns via littlefoolbook While all the power to any man who dares to wear a flower crown, can we all just agree that they look better on a lady? Originally published at littlefoolbook.com. Littlefoolbook — true (& LOL-worthy) stories about growing up GIRL in a culture where beauty reigns supreme. If you like this article (or giggled even once), then please hit ❤ and share with others. ", "title": "12 Reasons Why Being a Woman is Completely Amazing", "sentences": [{"1226": "12 Reasons Why Being a Woman is Completely Amazing"}, {"1e7c": "These days, being a woman can be really frustrating."}, {"8004": "Like sometimes, I can’t help but think that my sad addiction to $5 almond-milk-americano-misto’s wouldn’t be such a big deal if I didn’t make 20% less than my male counterparts."}, {"5d8b": "Ugh, sorry, I’m not a political writer and I don’t even want to attempt to be one."}, {"451b": "All I want to point out on this International Women’s Day is that being a woman is completely f&*king amazing, and these are just a few of the reasons why…"}, {"264e": "1. The Clothes"}, {"2b5a": "via Instagram"}, {"6ac0": "Honestly, there are just so many more options for dressing when you are female. I noticed this recently (though not for the first time) when shopping with my boyfriend."}, {"fcbb": "Every store we went into had a massive section for women’s wear. Mannequins with purple hair and polished fingers modeled sequined crop tops and pleather pants tucked into frilly socks (I really like TopShop, okay?)."}, {"83c9": "Upbeat music blared overhead and, like clockwork, every 42.3 seconds a sales clerk with an uber trendy haircut would ask if they could start me a fitting room. (I always tell them no, I like to use the weight of clothing in my hands as a budgeting tool. I can only buy as much as I can carry home.)"}, {"d942": "And then, over in the corner near the stockroom and the bathrooms, a lonely area, smaller than my walk-in closet at my parent’s house: the menswear section. A dusty lightbulb flickered overhead. The same button up shirt in seven dull colours lined the barren walls. The selection, overwhelmingly sparse."}, {"4251": "Within 10 minutes, my boyfriend had sufficiently perused through every article of clothing on every inch of wall and shelf in the men’s section, while I had just barely made it through one rack of diverse clothing: patterns, textures, colours and materials that all just beckoned me to try them on."}, {"c925": "It’s not fair, really, but as we ladies have learned, sometimes life isn’t fair."}, {"6d39": "2. Our Miracle Vessels"}, {"14a3": "While I haven’t had the pleasure of becoming a mother just yet, it’s something that, when I’m good and ready to become a mother, I’m profoundly looking forward to."}, {"0a54": "Whether you have children or not; whether you ever plan on having children or not, isn’t it totally miraculous to think about what our bodies are capable of? And isn’t that something we should celebrate and honour every single day?"}, {"a7a6": "Like, yes, go treat yourself simply for the fact that your body is a vessel for the world’s most vital miracle."}, {"930c": "3. Our Periods"}, {"5fe7": "Speaking of miracle vessels…"}, {"ec3a": "Okay, I know I’ve said, like a million times, that I turn into a total monster when I’m on my period and it’s really painful and I hate it and stuff. But, I also kind of love it."}, {"0bfd": "More to the point, I love being able to use my period as an excuse to not get out of bed, or to stay home from work, or eat ALL the chocolate, or watch a marathon of Girls on HBO and not feel guilty about it (this is also a really great example of why I’m not “good and ready” to become a mother, just yet)."}, {"7994": "In ancient times, women used to be celebrated because of their periods, for the sheer fact that they could bleed for several days and still survive. Can we get back to that, please?"}, {"700f": "4. Boobs"}, {"a29a": "I can be hard on my boobs. They are the first place I lose weight and are also slightly more wide-set than mass media leads me to believe is the perfect composition."}, {"6087": "They naturally lay flat like pancakes (sorry for that visual) when I lay flat, but really, they are beautiful, glorious lumps of fat and there’s no distance too far between them that a good bra can’t fix."}, {"63a0": "5. The security in the notion of “women and children first!”"}, {"cef9": "Anyone who has watched Titanic knows exactly what I’m talking about, here."}, {"edef": "Call me insensitive, call me a monster, call me what you want to call me, but I find some dreary sense of peace in this notion."}, {"9dff": "There. I said it."}, {"30fd": "6. Multiple orgasms"}, {"60e9": "Need I say more?"}, {"3e2c": "7. Our bodies"}, {"99c4": "Let’s face it, the female body, in all of its glory is a beautiful thing: gorgeous curves, soft lines, and no hanging appendages."}, {"2e63": "And let’s also make one thing crystal clear: Your body (just like my body) doesn’t have to look a certain way or be a certain size. Your body (just like my body) is a human body. It’s constantly changing, regulating, rebuilding & evolving — and was given to you for a very specific reason. It’s your protector, your warrior, your vessel to experience the world. Every inch of your body holds a sacred piece of who you are."}, {"aca1": "I don’t mean to speak for you, or over-step, but collectively, I think we spend way too much time obsessing over our self-perceived flaws and not enough time obsessing over how insanely amazing our female bodies truly are. Time to show your body some love, babe."}, {"70b2": "8. Makeup"}, {"87e7": "via littlefoolbook"}, {"ebdc": "Yeah, yeah, I know, I’ve written plenty on the advantages of going au natural and the surprising things that happen when you stop wearing makeup every day, but it’s nice to have options, right?"}, {"8eae": "Personally, I love the fact that when I’m feeling a little bold I can gloss on some fuchsia lip stain, or draw on some dramatic eyeliner. I love the fact that when I’m feeling a little less-than-confident (because we all have those days), I can cover up my blemishes with powders and potions that magically match my skin tone. And I really love the way mixing a little shimmer in my everyday SPF makes me glow."}, {"638d": "9. We’re, like, really soft."}, {"59d3": "Especially after just shaving. And is it just me or is that feeling of freshly shaved legs in freshly washed sheets comparable to the feeling of cuddling 1000 tiny little kittens all at once in a bed made of clouds?"}, {"c534": "10. Never having to think about or brainstorm or Google, “good pickup lines.”"}, {"dde1": "What a relief, right? Just think of how much time you’ve likely saved yourself simply for the fact that you were born female and cheesy pickup lines are not your responsibility."}, {"8215": "(Also, if you had been born male, you probably still would have known better than to use the ol’ “Did it hurt when you fell from heaven” line on any unsuspecting woman.)"}, {"5206": "11. Statistically speaking, women live longer than men."}, {"398a": "Sorry gentlemen, it’s just fact."}, {"6090": "(Though, I’m pretty sure I don’t have anyone to apologize to here, considering how many times I’ve used the word “period” on this blog.)"}, {"d7cb": "12. Flower crowns"}, {"40cc": "via littlefoolbook"}, {"7a12": "While all the power to any man who dares to wear a flower crown, can we all just agree that they look better on a lady?"}, {"73ab": "Originally published at littlefoolbook.com."}, {"eae2": "Littlefoolbook — true (& LOL-worthy) stories about growing up GIRL in a culture where beauty reigns supreme."}, {"c468": "If you like this article (or giggled even once), then please hit ❤ and share with others."}], "child": "206_1\t206_2\t206_3\t206_4\t206_5\t206_6\t206_7206_1\t206_2\t206_3\t206_4\t206_5\t206_6\t206_7"}