{"child": "2060_12060_1", "title": "Meet the Masterclass East Africa: Biko Wesa", "content": "Meet the Masterclass East Africa: Biko Wesa We asked each of the 11 participants of the satellite Masterclass East Africa six questions. Today, we’re talking with Kenyan photographer Biko Wesa. Biko Wesa during his introduction presentation © World Press Photo What was your first encounter with documentary photography? As far as I know, I have always liked looking at pictures like those in National Geographic magazines. One day, a friend of mine recommended the Canon workshop to me and I applied and got accepted. There, I realized that I had an interest in documentary photography. I could finally put into words what I was drawn to subconsciously and put a definition to whatever it was that I was doing. I then started calling myself a storyteller. Ever since then, this is how I define myself. Can you tell us about the photo story you made for the masterclass? I am documenting a community which lives down in the forest at the Kenyan coast, the Mijikenda. I am concentrating more specifically on the Kaya, which means home, village or a settlement of people. Mijikenda people refer to a Kaya as a site where the ancestors were buried; a place where they retreat to make sacrifices to their ancestral spirits when they call; and a spiritual place where religious prayers are held. But more and more, they are moving out of the forest. As a strong symbol of identity for them, their forests are endangered and they are losing their traditions. Only a few Kaya still exist, but I don’t want to see it disappear. They are the ones protecting and respecting nature. This project is not just about a specific community because I am looking at the bigger picture. For me, this project speaks about global social issues such as climate change. Mjeni Mkuzi poses for a portrait outside one of the traditional huts in the Kaya Mudzi Muvya forest. She is a Mijikenda traditional doctor, seer and dancer from the Rabai clan of the Mijikenda Tribe. © Biko Wesa What is the most helpful thing you’ve taken away from the masterclass? The time, intimacy and closeness with the masters. I know some of the masters, but here it is completely different. We all gather together, discussing, eating, joking with the masters. I realized that they are actually humans! I feel that it is possible to become like them. Listening to their thoughts is eye-opening. Up until recently I have been reading quite a lot. I want to get into the creator’s brain to know why they did it, learn about their thought process. Photography is more intellectual than I thought. A lot of people think photography is not so serious, but now I see that you have to really understand things, really read a lot because you cannot tell stories if you don’t have an understanding of your subject. Interacting with the other students is also interesting. I now know people from all over East Africa and those connections are precious. We will probably need each other’s support one day in our career. It is also about bridging the gap and making a strong, sustainable connection between photographers on the continent. We may not be able to physically move as freely as we wish, but we started the conversation and we can each document and combine certain things from the country we are in. Biko edits his story with masters Thomas Mukoya and Jodi Bieber. © World Press Photo What part of the job do you struggle with? I struggle with making a bridge between making money—surviving—and going out and photographing. If you don’t have the money, you can’t go out there and photograph. It has been a real challenge for me. The process always was that I would do a story, it would end up on my blog, people would read it and that would be the end of the story. Now I am looking for sustainability. It is my biggest challenge. Here at the masterclass, I learned that you have to be a great business person too. Being a great photographer is not enough. We need many skills. Do you use social media professionally? I used to do social media professionally, but it ended up being just about creating work for the sake of it to be seen and it was killing my creativity so I stopped. I felt I was just creating for the likes. So, I am now thinking about other ways to use my social media as more of a business platform. I have accounts on Twitter, Facebook, and Instagram. My Instagram is like my visual diary. It is more personal, and I like it this way. How do you see your project and career progressing? About my project, as I said, it is not just about this community, it was about the bigger picture: climate change. I see myself going back and spending more time with the community to get even more access and understanding the traditions and cultures more. I believe that way I’ll be able to help tell their story even better. I believe the story of this community resonates around the world and in other indigenous community. I hope to get it published, and work with WWF because they are interested in forestry issues. I just want it to reach more people. Career-wise, I want to dedicate more time to restructuring myself according to what I have learned from this workshop in terms of my social media and website. I’m also now focusing on a long-term project back in my hometown of Kilifi, but also striving to stretch my self further in creating art. A Kaya elder walks barefoot in the sacred Kaya Mudzi Muvya forest in Rabai, Kilifi County. No shoes are allowed in the sacred forest, they are left at the Kaya entrance. Certain parts of the forest are only accessed by the Kaya elders. Entry to those parts is prohibited. © Biko Wesa Biko was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists. If you liked this article, make sure to click the 💚 below so other people will see it here on Medium. ", "name": "2060", "parent": "", "sentences": [{"1e2f": "Meet the Masterclass East Africa: Biko Wesa"}, {"cccb": "We asked each of the 11 participants of the satellite Masterclass East Africa six questions. Today, we’re talking with Kenyan photographer Biko Wesa."}, {"0351": "Biko Wesa during his introduction presentation © World Press Photo"}, {"76bd": "What was your first encounter with documentary photography?"}, {"ebc8": "As far as I know, I have always liked looking at pictures like those in National Geographic magazines. One day, a friend of mine recommended the Canon workshop to me and I applied and got accepted. There, I realized that I had an interest in documentary photography. I could finally put into words what I was drawn to subconsciously and put a definition to whatever it was that I was doing. I then started calling myself a storyteller. Ever since then, this is how I define myself."}, {"4612": "Can you tell us about the photo story you made for the masterclass?"}, {"c4a2": "I am documenting a community which lives down in the forest at the Kenyan coast, the Mijikenda. I am concentrating more specifically on the Kaya, which means home, village or a settlement of people. Mijikenda people refer to a Kaya as a site where the ancestors were buried; a place where they retreat to make sacrifices to their ancestral spirits when they call; and a spiritual place where religious prayers are held. But more and more, they are moving out of the forest. As a strong symbol of identity for them, their forests are endangered and they are losing their traditions. Only a few Kaya still exist, but I don’t want to see it disappear. They are the ones protecting and respecting nature. This project is not just about a specific community because I am looking at the bigger picture. For me, this project speaks about global social issues such as climate change."}, {"e56e": "Mjeni Mkuzi poses for a portrait outside one of the traditional huts in the Kaya Mudzi Muvya forest. She is a Mijikenda traditional doctor, seer and dancer from the Rabai clan of the Mijikenda Tribe. © Biko Wesa"}, {"2a9b": "What is the most helpful thing you’ve taken away from the masterclass?"}, {"e1fb": "The time, intimacy and closeness with the masters. I know some of the masters, but here it is completely different. We all gather together, discussing, eating, joking with the masters. I realized that they are actually humans! I feel that it is possible to become like them. Listening to their thoughts is eye-opening. Up until recently I have been reading quite a lot. I want to get into the creator’s brain to know why they did it, learn about their thought process. Photography is more intellectual than I thought. A lot of people think photography is not so serious, but now I see that you have to really understand things, really read a lot because you cannot tell stories if you don’t have an understanding of your subject."}, {"5529": "Interacting with the other students is also interesting. I now know people from all over East Africa and those connections are precious. We will probably need each other’s support one day in our career. It is also about bridging the gap and making a strong, sustainable connection between photographers on the continent. We may not be able to physically move as freely as we wish, but we started the conversation and we can each document and combine certain things from the country we are in."}, {"27e8": "Biko edits his story with masters Thomas Mukoya and Jodi Bieber. © World Press Photo"}, {"0c5e": "What part of the job do you struggle with?"}, {"86d0": "I struggle with making a bridge between making money—surviving—and going out and photographing. If you don’t have the money, you can’t go out there and photograph. It has been a real challenge for me. The process always was that I would do a story, it would end up on my blog, people would read it and that would be the end of the story. Now I am looking for sustainability. It is my biggest challenge."}, {"63ca": "Here at the masterclass, I learned that you have to be a great business person too. Being a great photographer is not enough. We need many skills."}, {"720f": "Do you use social media professionally?"}, {"2f95": "I used to do social media professionally, but it ended up being just about creating work for the sake of it to be seen and it was killing my creativity so I stopped. I felt I was just creating for the likes. So, I am now thinking about other ways to use my social media as more of a business platform. I have accounts on Twitter, Facebook, and Instagram. My Instagram is like my visual diary. It is more personal, and I like it this way."}, {"4dee": "How do you see your project and career progressing?"}, {"36aa": "About my project, as I said, it is not just about this community, it was about the bigger picture: climate change. I see myself going back and spending more time with the community to get even more access and understanding the traditions and cultures more. I believe that way I’ll be able to help tell their story even better. I believe the story of this community resonates around the world and in other indigenous community. I hope to get it published, and work with WWF because they are interested in forestry issues. I just want it to reach more people."}, {"7a6d": "Career-wise, I want to dedicate more time to restructuring myself according to what I have learned from this workshop in terms of my social media and website. I’m also now focusing on a long-term project back in my hometown of Kilifi, but also striving to stretch my self further in creating art."}, {"570f": "A Kaya elder walks barefoot in the sacred Kaya Mudzi Muvya forest in Rabai, Kilifi County. No shoes are allowed in the sacred forest, they are left at the Kaya entrance. Certain parts of the forest are only accessed by the Kaya elders. Entry to those parts is prohibited. © Biko Wesa"}, {"b0b4": "Biko was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists."}, {"35ec": "If you liked this article, make sure to click the 💚 below so other people will see it here on Medium."}]}