{"child": "2062_12062_1", "title": "Terminus: Yeoville", "content": "Terminus: Yeoville South Africa was the top destination for asylum seekers between 2006 and 2011, and still today has the second-highest number of currently open asylum cases worldwide after Germany, according to UNHCR reports. Indeed, many African migrants decide not to cross the Mediterranean Sea and head to South Africa for a better life instead. After they land at O.R. Tambo airport, the majority asks their taxi to take them to the same destination: Yeoville. The neighborhood was once a bohemian center, but its white residents fled after the fall of the apartheid regime, giving way to a wave of new residents: working-class (mainly black) South Africans and African migrants. Yeoville has undergone a transformation and is different from the rest of the city, thanks to the African community that redefined its culture in a big way. It is a little corner of Africa in the heart of Johannesburg. It also stands as a proof of peaceful cohabitation in a country that has periodically made headlines for the xenophobic events that happened on its soil. This essay tells the story of migrants trying to reinvent themselves and transform the space they live in. Romeo Gbanoe is praying during a mass in Yeoville, Johannesburg. He is from Ivory Coast and, like many others, he chose to move to South Africa and resettled in the neighborhood considered the safe haven of African migrants in South Africa: Yeoville. Sylvain, a migrant from Ivory Coast, thanks his community during a mass organized by the King of Kings International Mission in Yeoville. He was recently granted the asylum status in South Africa and says that the Yeoville community played a very active role during the application process. Parishioners fervently pray during a mass organized by the King of Kings International Mission in Yeoville. The mass takes place weekly in a classroom providing additional income for the college. The church welcomes a majority of West African migrants. Joseph (far left), a migrant from DRC, has been living in South Africa since 2004 and he is the manager of a hair salon in Yeoville. Hair salons have proliferated in the neighborhood, and hair dresser is seen as a profitable activity in this area where migrants want to have their hair done by fellow country men and women. Joseph lives and works in Yeoville, and admits he “never goes anywhere else”. Patrick, a migrant from the Democratic Republic of Congo, sells DVDs of Congolese movies and music videos in Yeoville. The new wave of immigrants have brought with them their diverse cultures and have redefined the nature of Yeoville in a big way. The frontage of a typical Yeoville house, ornamented with a painting representing Ethiopian Emperor Haile Selassie, an influential leader that advocated for the independence and freedom of Africa and Africans on the world stage, also revered as the returned messiah among the Rastafari movement. View of a stockroom turned into a church in Yeoville. Many church leaders from other parts of Africa migrate to South Africa and settle in Yeoville. They buy existing buildings in the neighborhood and turn them into places of worship. A bride, member of the Congolese community, makes her entry at her wedding in a church in Yeoville. Nationals from the Democratic Republic of Congo are the third largest foreign community in South Africa and the largest one in Yeoville. Wedding guests, mostly from DRC, take pictures of the bride and groom as they enter the church for their wedding. Wedding guests are singing along during a Congolese wedding celebrated in Yeoville. Details of the dresses and shoes worn by women of the Congolese community for a wedding in Yeoville. Nationals from the Democratic Republic of Congo are known throughout Africa for their style. A wedding guest poses for a portrait. He did not want to reveal his name as he left the Democratic Republic of Congo four weeks prior to settle in South Africa. All text and images © Miora Rajaonary Read an interview with the photographer about this story and more. Miora was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists. If you liked this article, click 💚 below so others will see it on Medium. ", "name": "2062", "parent": "", "sentences": [{"c8b0": "Terminus: Yeoville"}, {"044f": "South Africa was the top destination for asylum seekers between 2006 and 2011, and still today has the second-highest number of currently open asylum cases worldwide after Germany, according to UNHCR reports."}, {"abb6": "Indeed, many African migrants decide not to cross the Mediterranean Sea and head to South Africa for a better life instead. After they land at O.R. Tambo airport, the majority asks their taxi to take them to the same destination: Yeoville."}, {"02a3": "The neighborhood was once a bohemian center, but its white residents fled after the fall of the apartheid regime, giving way to a wave of new residents: working-class (mainly black) South Africans and African migrants."}, {"1dc3": "Yeoville has undergone a transformation and is different from the rest of the city, thanks to the African community that redefined its culture in a big way. It is a little corner of Africa in the heart of Johannesburg. It also stands as a proof of peaceful cohabitation in a country that has periodically made headlines for the xenophobic events that happened on its soil."}, {"539d": "This essay tells the story of migrants trying to reinvent themselves and transform the space they live in."}, {"2a30": "Romeo Gbanoe is praying during a mass in Yeoville, Johannesburg. He is from Ivory Coast and, like many others, he chose to move to South Africa and resettled in the neighborhood considered the safe haven of African migrants in South Africa: Yeoville."}, {"9441": "Sylvain, a migrant from Ivory Coast, thanks his community during a mass organized by the King of Kings International Mission in Yeoville. He was recently granted the asylum status in South Africa and says that the Yeoville community played a very active role during the application process."}, {"c5bc": "Parishioners fervently pray during a mass organized by the King of Kings International Mission in Yeoville. The mass takes place weekly in a classroom providing additional income for the college. The church welcomes a majority of West African migrants."}, {"abf3": "Joseph (far left), a migrant from DRC, has been living in South Africa since 2004 and he is the manager of a hair salon in Yeoville. Hair salons have proliferated in the neighborhood, and hair dresser is seen as a profitable activity in this area where migrants want to have their hair done by fellow country men and women. Joseph lives and works in Yeoville, and admits he “never goes anywhere else”."}, {"0970": "Patrick, a migrant from the Democratic Republic of Congo, sells DVDs of Congolese movies and music videos in Yeoville. The new wave of immigrants have brought with them their diverse cultures and have redefined the nature of Yeoville in a big way."}, {"5b8b": "The frontage of a typical Yeoville house, ornamented with a painting representing Ethiopian Emperor Haile Selassie, an influential leader that advocated for the independence and freedom of Africa and Africans on the world stage, also revered as the returned messiah among the Rastafari movement."}, {"3387": "View of a stockroom turned into a church in Yeoville. Many church leaders from other parts of Africa migrate to South Africa and settle in Yeoville. They buy existing buildings in the neighborhood and turn them into places of worship."}, {"99cb": "A bride, member of the Congolese community, makes her entry at her wedding in a church in Yeoville. Nationals from the Democratic Republic of Congo are the third largest foreign community in South Africa and the largest one in Yeoville."}, {"8819": "Wedding guests, mostly from DRC, take pictures of the bride and groom as they enter the church for their wedding."}, {"3ed1": "Wedding guests are singing along during a Congolese wedding celebrated in Yeoville."}, {"3be3": "Details of the dresses and shoes worn by women of the Congolese community for a wedding in Yeoville. Nationals from the Democratic Republic of Congo are known throughout Africa for their style."}, {"247f": "A wedding guest poses for a portrait. He did not want to reveal his name as he left the Democratic Republic of Congo four weeks prior to settle in South Africa."}, {"d895": "All text and images © Miora Rajaonary"}, {"123b": "Read an interview with the photographer about this story and more."}, {"f3ab": "Miora was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists."}, {"e835": "If you liked this article, click 💚 below so others will see it on Medium."}]}