{"child": "2065_12065_1", "title": "The rise of branded journalism", "content": "The rise of branded journalism In a bid to boost revenue streams, publishers will go all out to please advertisers. The distinction between editorial and commercial content can get blurred in the process. © Paul van Riel / Hollandse Hoogte ‘Commercial journalists’ are working side-by-side with editorial journalists. Struggling media companies are re-inventing themselves as ad agencies. What is the impact of packaging advertisement into editorial on the integrity and credibility of news media? No free ride The free press — unbiased, critical and independent — has never been free in economic terms. It is subject to the same laws that govern any business: you have to make a profit, or at least break even, to survive. Advertising has long been a part of the editorial package. You could even say that our appetite for news has been sponsored by advertisers. Readers expect editorial content to be informative: factual, critical, unbiased and truthful. And they know that commercial content is the opposite: seductive, biased, selective and not necessarily truthful. For advertisers, the editorial content is merely an umfelt, a context and means in which to deliver their commercial message. For a reader, the two sides can co-exist just fine as long as it is absolutely clear what is what. That distinction is not necessary from an advertisers’ perspective, though. When print and paper dominated the press, the hierarchy was obvious: editorial content was the king and it wielded its power to keep commercial content at bay. The editorial staff was well protected by a statute against meddling by the publisher or the commercial department. The divide between the two was complete. But that was then. Over time, as audiences and revenues have dwindled, the divide has gone from hard to soft, high to low. And now it’s on the brink of disappearing altogether. Branding journalism Advertisers are aggressively invading the editorial space under various pretexts: advertorial, native content, branded content, paid posts, sponsored stories or partner content. Not only are publishers welcoming these insurgents, they are helping them create their commercial messages and disguise it as editorial content. Both large and small legacy and digital-first publications have set up teams in recent years to produce in-house sponsored content. T Brand Studio, the branded content studio of the New York Times, has a staff of 110 journalists, videographers, designers and engineers. In 2015, the studio generated $35 million, approximately 18 percent of the company’s total digital advertising revenue. That was up from $14 million in 2014, according to Sebastian Tomich, the Times’ VP of advertising and innovation. At the recent annual UBS Global Media Conference, the New York Times CEO Mark Thompson — who had said that the native content business would ‘close to double’ its growth in 2016—admitted that growth was slower this year than he projected, but still significant. “For traditional news outlets such as the Times, The Wall Street Journal, the Washington Post and Time Inc., expanding in promising digital areas like sponsored content is vital,” according to a Wall Street Journal publication. Suggesting that publishers have no choice, the article continues: [Publishers] are expanding into areas that traditionally have been the domain of advertising agencies […] To help accelerate growths, the Times has begun moving deeper into more agency-like services, creating ad campaigns that may show up outside the Times’ own properties or offering consulting and research services. ESI Media, publisher of The Independent and the London Evening Standard, is totally open about mixing marketing and editorial. Managing Director Jon O’Donnell said, “It’s a very joined-up business between commercial, commercial journalists and editorial journalists.” Commercial journalists? Is that news-speak for what we once called a copywriter at an ad agency? According to O’Donnell, “Everyone understands where the lines are drawn. There is respect between editorial and commercial.” Confusion The writers that so eloquently describe the beauty and necessity of branded content do see a possible drawback: critics of branded content suggest that it blurs the traditional boundaries between advertising and editorial, and may risk confusing and alienating some readers. A new survey into the perception of native ads suggests branded content is not just a possible risk of confusing some readers, but is very confusing to many readers. Some numbers: (By the way, millennials were named the most likely age group to trust native ads. Just an interesting tidbit.) It’s no secret that publishers, especially those of legacy media, are facing enormous challenges and are struggling to make ends meet financially. We know that media — and journalism — have to reinvent themselves and rethink the essence of news (both its relevance and value). These things are easy to say, but very hard to do. However, giving away your core values of independence, impartiality, and objectivity to a partner that has proven itself far from loyal in the past looks to me like a very dangerous strategy. Unless those values are no longer important to today’s readers, of course. © Reyer Boxem / Hollandse Hoogte King of content The headline in the New York Times was this: How Sponsored Content is Becoming King in a Facebook World. If sponsored content is the new king, the question then becomes: will legacy media be the new queen at its side? The article raises some serious doubts about whether sponsored content will prove to be an important revenue stream for legacy media in the long term. Sure, there is undoubtedly serious money to be made in branded content. (The average budget for a branded content campaign from the NYT’s own T Brand Studio is $500,000, including production fees and charges for the NYT’s media space.) But as more and more publishers begin competing with ad agencies and production companies for advertising dollars, they’ll have to start betting on their ability to create content in greater quantity, faster and cheaper than the competition. Not to mention campaigns are often expensive to produce and margins can be thin, according to the NYT article. Margins are just one of many challenges that publishers face. As audiences have migrated from news websites to social media platforms, the power and reach of the publishers’ own channels have diminished and — as a consequence — so has its value for advertisers. To improve targeting and reach of the (expensive) branded content, publishers have to turn to Facebook—and that is not without danger. Facebook offers advertisers extremely detailed information about their sponsored posts so they can see exactly how much (or how little) publishers have spent to promote posts and increase traffic in order to meet targets. In the days when editorial content was king, publishers could charge advertisers heavily for driving traffic. These days, transparency has all but killed this practice. With publishers acting as mere middle-men when it comes to distribution on third-party channels, advertisers are now questioning their added value and have started taking distribution of branded content into their own hands. Alternatives It goes without saying that advertising has had a long history of criticism. It even has its own lemma on Wikipedia. The audience-at-large became increasingly annoyed (68 percent of consumers find online ads annoying and distracting) and averse to advertising by its intrusive — almost aggressive — character and the all-over-the-place presence on websites and apps. As it usually does, one thing lead to another and we went from advertising aversion to ad-blockers to branded content. (Just to be clear, ad-blocking did not cause the invention of branded content, which has its origins in radio during the 1930s. However, it certainly plays a big part in the warm embrace that branded content is receiving these days from publishers and advertisers alike.) Personally, I love advertising—good advertising, that is: an intelligent and creative concept that is visually appealing, on the edge and brilliantly executed. You know, the kind of advertising that is basically absent online. Is it possible to have a free press with independent news gathering, critical and unbiased journalism and investigative reporting, without advertising? The irony is that advertising ‘liberated’ newspapers in the 19th century from the influence — and often ownership — of governments, political parties and social movements. To see those powers returning into our news and editorial content — as some do — is not bolstering a free press, on the contrary. Publishers will continue to diversify their revenue streams with e-commerce (books, wine, travel), events and expensive premium products for certain niche markets (need-to-know news), but this will never compensate for the continuous loss in advertising revenues. It’s hard to envision a free press and journalism as we know it without advertising revenues, but when traditional forms of advertising are being replaced by branded content that is increasingly difficult to separate from editorial content, it’s also hard to label our media as free and trust the content to be unbiased and accurate. The organization of the press — legacy media first — in large institutions geared to reach a mass audience with a business model that leans heavily on a single revenue stream seems no longer a viable structure. Transparency In today’s open media environment, everybody can publish and pose as a journalist. Now, more than ever, readers need to know who they can trust to report the facts and serve the public. We expect that our newspapers and magazines inform us correctly and are basically telling the truth. They are supposed to check the facts, ensure impartiality and — last, but not least — vouch for their contributors. Our relation with the media that bring us news, analyses, backgrounds and investigative reporting is based on trust. Without that trust, the media lose their relevancy and role in a democratic society. Branded journalism — both on- and offline — puts a strain on our relation with news media and threatens to undermine their integrity. When authority and credibility is no longer a given, trust can best be built (or restored) on transparency: “In discussions of both social and entrepreneurial journalism, the professional norm of accountability, often translated as ‘transparency’ in a networked media environment, is being evoked with increasing vigor,” according to Jane B. Singer in the first chapter of Boundaries of Journalism. Publications — legacy or new, big and small — should be open and explicit about what they publish and vouch that their (photo)journalists and editors are accountable and subject to the highest professional standards. In the meantime, we have gotten accustomed to getting a lot of news for free. Not totally free, of course, because we pay with our time and privacy. For scores of people, the free news is all they need. They seem to take for granted that not everything they read is true or unbiased. Publishers can hardly overestimate the value of trust, though, as a study released in April by the American Press Institute suggests. One of the findings: “News organizations that earn trust have an advantage in earning money and growing their audience.” If you liked this article, click ♡ below so others will see it on Medium. ", "name": "2065", "parent": "", "sentences": [{"29e8": "The rise of branded journalism"}, {"89fe": "In a bid to boost revenue streams, publishers will go all out to please advertisers. The distinction between editorial and commercial content can get blurred in the process."}, {"508e": "© Paul van Riel / Hollandse Hoogte"}, {"e1fe": "‘Commercial journalists’ are working side-by-side with editorial journalists. Struggling media companies are re-inventing themselves as ad agencies. What is the impact of packaging advertisement into editorial on the integrity and credibility of news media?"}, {"cb09": "No free ride"}, {"dfac": "The free press — unbiased, critical and independent — has never been free in economic terms. It is subject to the same laws that govern any business: you have to make a profit, or at least break even, to survive."}, {"79bb": "Advertising has long been a part of the editorial package. You could even say that our appetite for news has been sponsored by advertisers."}, {"363f": "Readers expect editorial content to be informative: factual, critical, unbiased and truthful. And they know that commercial content is the opposite: seductive, biased, selective and not necessarily truthful."}, {"60c4": "For advertisers, the editorial content is merely an umfelt, a context and means in which to deliver their commercial message."}, {"02e7": "For a reader, the two sides can co-exist just fine as long as it is absolutely clear what is what. That distinction is not necessary from an advertisers’ perspective, though."}, {"8e33": "When print and paper dominated the press, the hierarchy was obvious: editorial content was the king and it wielded its power to keep commercial content at bay. The editorial staff was well protected by a statute against meddling by the publisher or the commercial department. The divide between the two was complete."}, {"e45f": "But that was then."}, {"d948": "Over time, as audiences and revenues have dwindled, the divide has gone from hard to soft, high to low. And now it’s on the brink of disappearing altogether."}, {"4289": "Branding journalism"}, {"9e9c": "Advertisers are aggressively invading the editorial space under various pretexts: advertorial, native content, branded content, paid posts, sponsored stories or partner content. Not only are publishers welcoming these insurgents, they are helping them create their commercial messages and disguise it as editorial content."}, {"ff27": "Both large and small legacy and digital-first publications have set up teams in recent years to produce in-house sponsored content."}, {"6017": "T Brand Studio, the branded content studio of the New York Times, has a staff of 110 journalists, videographers, designers and engineers. In 2015, the studio generated $35 million, approximately 18 percent of the company’s total digital advertising revenue. That was up from $14 million in 2014, according to Sebastian Tomich, the Times’ VP of advertising and innovation."}, {"c8fd": "At the recent annual UBS Global Media Conference, the New York Times CEO Mark Thompson — who had said that the native content business would ‘close to double’ its growth in 2016—admitted that growth was slower this year than he projected, but still significant."}, {"e1e1": "“For traditional news outlets such as the Times, The Wall Street Journal, the Washington Post and Time Inc., expanding in promising digital areas like sponsored content is vital,” according to a Wall Street Journal publication."}, {"2b58": "Suggesting that publishers have no choice, the article continues:"}, {"d055": "[Publishers] are expanding into areas that traditionally have been the domain of advertising agencies […] To help accelerate growths, the Times has begun moving deeper into more agency-like services, creating ad campaigns that may show up outside the Times’ own properties or offering consulting and research services."}, {"e674": "ESI Media, publisher of The Independent and the London Evening Standard, is totally open about mixing marketing and editorial. Managing Director Jon O’Donnell said, “It’s a very joined-up business between commercial, commercial journalists and editorial journalists.”"}, {"eebf": "Commercial journalists? Is that news-speak for what we once called a copywriter at an ad agency?"}, {"76ce": "According to O’Donnell, “Everyone understands where the lines are drawn. There is respect between editorial and commercial.”"}, {"4db6": "Confusion"}, {"aada": "The writers that so eloquently describe the beauty and necessity of branded content do see a possible drawback: critics of branded content suggest that it blurs the traditional boundaries between advertising and editorial, and may risk confusing and alienating some readers."}, {"e516": "A new survey into the perception of native ads suggests branded content is not just a possible risk of confusing some readers, but is very confusing to many readers."}, {"0384": "Some numbers:"}, {"ecfe": "(By the way, millennials were named the most likely age group to trust native ads. Just an interesting tidbit.)"}, {"4255": "It’s no secret that publishers, especially those of legacy media, are facing enormous challenges and are struggling to make ends meet financially. We know that media — and journalism — have to reinvent themselves and rethink the essence of news (both its relevance and value). These things are easy to say, but very hard to do."}, {"f667": "However, giving away your core values of independence, impartiality, and objectivity to a partner that has proven itself far from loyal in the past looks to me like a very dangerous strategy."}, {"0870": "Unless those values are no longer important to today’s readers, of course."}, {"e6b5": "© Reyer Boxem / Hollandse Hoogte"}, {"aa38": "King of content"}, {"a4c4": "The headline in the New York Times was this: How Sponsored Content is Becoming King in a Facebook World."}, {"7a9e": "If sponsored content is the new king, the question then becomes: will legacy media be the new queen at its side?"}, {"24b5": "The article raises some serious doubts about whether sponsored content will prove to be an important revenue stream for legacy media in the long term."}, {"a32a": "Sure, there is undoubtedly serious money to be made in branded content. (The average budget for a branded content campaign from the NYT’s own T Brand Studio is $500,000, including production fees and charges for the NYT’s media space.)"}, {"df8b": "But as more and more publishers begin competing with ad agencies and production companies for advertising dollars, they’ll have to start betting on their ability to create content in greater quantity, faster and cheaper than the competition. Not to mention campaigns are often expensive to produce and margins can be thin, according to the NYT article."}, {"1bde": "Margins are just one of many challenges that publishers face. As audiences have migrated from news websites to social media platforms, the power and reach of the publishers’ own channels have diminished and — as a consequence — so has its value for advertisers."}, {"dd2b": "To improve targeting and reach of the (expensive) branded content, publishers have to turn to Facebook—and that is not without danger. Facebook offers advertisers extremely detailed information about their sponsored posts so they can see exactly how much (or how little) publishers have spent to promote posts and increase traffic in order to meet targets. In the days when editorial content was king, publishers could charge advertisers heavily for driving traffic. These days, transparency has all but killed this practice."}, {"7ae5": "With publishers acting as mere middle-men when it comes to distribution on third-party channels, advertisers are now questioning their added value and have started taking distribution of branded content into their own hands."}, {"9303": "Alternatives"}, {"7851": "It goes without saying that advertising has had a long history of criticism. It even has its own lemma on Wikipedia."}, {"f0b4": "The audience-at-large became increasingly annoyed (68 percent of consumers find online ads annoying and distracting) and averse to advertising by its intrusive — almost aggressive — character and the all-over-the-place presence on websites and apps."}, {"fbbe": "As it usually does, one thing lead to another and we went from advertising aversion to ad-blockers to branded content."}, {"035d": "(Just to be clear, ad-blocking did not cause the invention of branded content, which has its origins in radio during the 1930s. However, it certainly plays a big part in the warm embrace that branded content is receiving these days from publishers and advertisers alike.)"}, {"4534": "Personally, I love advertising—good advertising, that is: an intelligent and creative concept that is visually appealing, on the edge and brilliantly executed. You know, the kind of advertising that is basically absent online."}, {"effd": "Is it possible to have a free press with independent news gathering, critical and unbiased journalism and investigative reporting, without advertising?"}, {"3574": "The irony is that advertising ‘liberated’ newspapers in the 19th century from the influence — and often ownership — of governments, political parties and social movements. To see those powers returning into our news and editorial content — as some do — is not bolstering a free press, on the contrary."}, {"9767": "Publishers will continue to diversify their revenue streams with e-commerce (books, wine, travel), events and expensive premium products for certain niche markets (need-to-know news), but this will never compensate for the continuous loss in advertising revenues."}, {"b597": "It’s hard to envision a free press and journalism as we know it without advertising revenues, but when traditional forms of advertising are being replaced by branded content that is increasingly difficult to separate from editorial content, it’s also hard to label our media as free and trust the content to be unbiased and accurate."}, {"823b": "The organization of the press — legacy media first — in large institutions geared to reach a mass audience with a business model that leans heavily on a single revenue stream seems no longer a viable structure."}, {"bd82": "Transparency"}, {"b2b6": "In today’s open media environment, everybody can publish and pose as a journalist. Now, more than ever, readers need to know who they can trust to report the facts and serve the public."}, {"a1b7": "We expect that our newspapers and magazines inform us correctly and are basically telling the truth. They are supposed to check the facts, ensure impartiality and — last, but not least — vouch for their contributors."}, {"e75e": "Our relation with the media that bring us news, analyses, backgrounds and investigative reporting is based on trust. Without that trust, the media lose their relevancy and role in a democratic society."}, {"7ecd": "Branded journalism — both on- and offline — puts a strain on our relation with news media and threatens to undermine their integrity."}, {"8512": "When authority and credibility is no longer a given, trust can best be built (or restored) on transparency: “In discussions of both social and entrepreneurial journalism, the professional norm of accountability, often translated as ‘transparency’ in a networked media environment, is being evoked with increasing vigor,” according to Jane B. Singer in the first chapter of Boundaries of Journalism."}, {"1941": "Publications — legacy or new, big and small — should be open and explicit about what they publish and vouch that their (photo)journalists and editors are accountable and subject to the highest professional standards."}, {"69b6": "In the meantime, we have gotten accustomed to getting a lot of news for free. Not totally free, of course, because we pay with our time and privacy. For scores of people, the free news is all they need. They seem to take for granted that not everything they read is true or unbiased."}, {"a015": "Publishers can hardly overestimate the value of trust, though, as a study released in April by the American Press Institute suggests. One of the findings: “News organizations that earn trust have an advantage in earning money and growing their audience.”"}, {"be34": "If you liked this article, click ♡ below so others will see it on Medium."}]}