{"child": "2066_1\t2066_22066_1\t2066_2", "title": "Reality check", "content": "Reality check The need for journalism to restore trust and develop a reliable new business model has never been greater. What does this mean for photojournalists? “This is the century of the photojournalists. They have provided us with a visual history unduplicated by images from any comparable period of human existence.” This is how Howard Chapnick – head of renowned international photo agency Blackstar from 1964 until his retirement in 1990 — begins his foreword to the Eyes of Time: Photojournalism in America. Chapnick’s professional career took off when he returned to Blackstar in 1946 after serving in the Air Force during World War II. His career as a photo editor and manager spans the heydays of picture magazines like Life, Look, Collier’s and others. He witnessed — and contributed to — the rise of photojournalism in the media. Chapnick claims the 20th century for photojournalists in 1988. The first digital cameras have just arrived on the market, Photoshop software will be introduced in two years time, and we were about to celebrate photography’s 150th birthday. Chapnick continues: The camera in the hands of better educated and better informed photographers, provides us with images of unprecedented power and indisputable information about the world we live in…The great photojournalists of yesterday, today and tomorrow aim for deeper revelation and insight through the capture of spontaneous, unplanned, unposed, and unpredictable moments. How does Chapnick’s understanding of photojournalism fit with the state of the media today? Fast forward Photography as Howard Chapnick knew it, was the result of a century and a half of continuous development through discoveries, inventions and improvements — big and small — in imaging technology and the printed media. This process of change never stops. New inventions and developments since 1988 have affected photojournalism in many ways. The shift from analog to digital photography, the introduction of Internet and the World Wide Web, has deeply changed photojournalism as a craft, a profession and a business. Great photos still touch people and stir up civic action, but they can as easily come from a bystander with a smartphone, as from a well-trained and experienced photojournalist. Photos now reach us 24/7 through our newspaper, television, online news platforms or social media. Ethical landscape In “The Elements of Journalism,” the 2001 Nieman Reports Special Issue, writers Bill Kovach and Thom Rosenstiel state: “Journalism’s first obligation is to tell the truth.” That being said they observe that people are confused about what “truth” means and they find journalists unhelpful in elucidating this issue: Journalists themselves have never been very clear about what they mean by truthfulness. Journalism by nature is reactive and practical rather than philosophical and introspective…the failure by journalists to articulate what they do leaves citizens all the more suspicious that the press is either deluding itself or hiding something. Kovach and Rosenstiel suggest that journalistic truth is an ongoing process, a kind of conversation, and they urge journalists to be transparent about that process. The commitment to truth and reality, the capturing of unplanned and unposed moments, is still very much at the heart of photojournalism and documentary photography. The code of ethics of the National Press Photographers Association insists (amongst many other things) on “maintain the integrity of the photographic images’ content and context” and to “resist being manipulated by staged photo opportunities.” As for the relationship between a photo and reality there is a consensus, voiced by Arthur Berger in his book Seeing is Believing: An Introduction to Visual Communication : “A photo is always an interpretation of reality, not reality itself.” We accept that photojournalists are subjective, that they have opinions and a point of view that shapes their perception of the world. At the same time we trust them to be aware of possible biases and try to report as accurate, comprehensive and faithful as possible. Together with editorial policies of publications and other media these guidelines and mandates provide the ethical landscape for today’s photojournalist. For those working in journalism and the media the above might feel familiar or maybe even obvious, but what about the general public? Do they understand how it works, do they trust photojournalists and documentary photographers? Trust for sale According to the latest Gallup poll Americans’ trust and confidence in the mass media “to report the news fully, accurately and fairly” has dropped to the lowest level in Gallup polling history, declining 8 percent when compared to 2015. A mere 32 percent of Americans say they have a great deal or a fair amount of trust in the media (newspapers, television, radio). Gallup registered a record high in 1976 when 72 percent expressed their trust in the media. Trust below 50 percent in 2007 and has continued to fall ever since. Gallup explains the sharp fall to the presidential elections (trust amongst Republicans dropping by 18 percent) but also sees that trust “has been eroding over time.” Gallup thinks that reversing the trend is possible: With the explosion of the mass media in recent years, especially the prevalence of blogs, vlogs and social media, perhaps Americans decry lower standards for journalism. When opinion-driven writing becomes something like the norm, Americans may be wary of placing trust on the work of media institutions that have less rigorous reporting criteria than in the past. On the other hand, as blogs and social media ‘mature,’ they may improve in the American public’s eyes. This could, in turn, elevate Americans’ trust and confidence in the mass media as a whole. If maturing means applying traditional journalistic standards and fully informing the public, regaining trust might prove to be an uphill battle. The media are desperately searching for revenues and even traditional mainstream media outlets focus on quick hits and viral stories, even if they have little truth to them. Or in the words of CBS president Les Moonves — commenting on the fact that CBS spend so much time covering then Republican candidate Donald Trump: “It may not be good for America, but it’s damn good for CBS.” What Arianna Huffington lacked in journalistic experience at the time she co-founded the Huffington Post, she made up generously with her Rolodex and a natural, almost innate understanding of what people want on the web. She understood the value of personal and personality-based writing and she instinctively knew that people want to read about things that already had their interest. If the content was slanted, it did not matter much. When media consumers find the truth no big issue, it is hard to see how trust can be restored. Authority in limbo Public faith in many institutions has fallen. Fewer than half of Americans say they trust the church, the medical system, the presidency, the Supreme Court, public schools, banks, organized labor, the criminal justice system, big business and Congress. Or the press. And according to a United Nations report, this is not solely an American problem: “public trust in government and political institutions has been decreasing in all of the advanced industrial democracies.” Renowned Indian-American journalist and author Fareed Zakaria calls it the “death of authority” in his book The Future of Freedom. Zakaria argues that the perceived failures of governments and elite institutions are the result of an increased democratization of (American) society and culture. In contrast, Christopher Hayes (author of Twilight of the Elites) observes that “[institutions] imploded under the weight of corruption and incompetence…the social contract between ordinary citizens and elites lies in tatters.” The consequences of the crises of authority and the falling of trust in institutions can be serious. With traditional gatekeepers struggling to survive, information flows freely. Bad information sits alongside good information, with both equally believable for those who have lost faith in traditional media and their institutional sources. Francis Fukuyama, the American political scientist and economist, warns us that there is no reason to think that good information will win over bad information. He even believes that the current mistrust will eventually destroy our democracy. Post-fact journalism With online media in abundance and traditional media gatekeepers hanging from the drip in the emergency room, people find information and “facts” that suits their interests and supports their beliefs. Social media are keen to built “echo chambers” for any inclination they spot, ensuring you will only get what you want to hear. The audience is liberated from the shackles of corrupt institutions and their messenger, the legacy media. But they pay a price: they are extremely vulnerable tomanipulation by populist politicians, greedy corporations and conspiracy thinkers with a covered and suspect agenda. Journalism has always had kind of a complicated relationship with the truth. Objectivity is a myth; there is always a social, cultural, political perspective from which every (photo)journalist looks at the world. And from a philosophical point of view you can argue that reality is a narrative and that everyone has their own truth. This can lead to the conclusion tht facts are mere opinions, lies an “alternative point of view” and reality becomes endlessly fictile and malleable. During the Brexit campaign and the American presidential elections we have witnessed how lying has been taken to a whole new level. Politicians have always lied, but now they do not even care whether they told the truth or not. ‘Facts don’t work’ — that is how the main funder behind the Leave.EU campaign summed it up. Rise of the reader Fact-based representation distinguishes journalism from all other reporting in words and/or pictures. Facts were the hard currency for (photo)journalism. On facts you built reality and truth. Journalist were held accountable for getting the facts right. When a fact becomes whatever you feel is true, or you want to be true, it’s value for journalism is diminishing fast. Neetzam Zimmerman, the former Gawker specialist in viral stories, could not put it more bluntly: “nowadays it’s not important if a story’s real, the only thing that really matters is whether people click on it.” Facts in his eye are over, a relic from the age of the printing press. He continues: “If a person is not sharing a story it is — at its core — not news.” A viral story is the holy grail for publishers. The new measure for many news organizations is virality rather than truth or quality. Digital publishing has offered journalism many new tools and possibilities to research and produce compelling stories, new ways to tell them and new ways to connect to new readers. It has led to the rise of the reader, as journalist Katherine Viner calls it: “a fundamental redrawing of journalists’ relationship with our audience, how we think about our readers, our perception of our role in society, our status.” All this against a backdrop of an industry in trouble, with a business model under threat. Viner’s colleague at The Guardian, Mary Hamilton (the executive editor for audience) says: “we’ve transformed everything about our journalism and not enough about our business.” Which is a plea for business innovation. Re-thinking (photo)journalism Journalism faces two, related challenges: restoring trust amongst the general public and developing a reliable new business model. Emily Bell, the director of Columbia University’s Tow center for digital journalism is convinced that any solution has to start with a firm and honest collaboration between journalism and technology: Journalism needs a lot more journalists who are technically proficient, and the new gods, the platform companies, social networks and search engines, need to hire a lot more technologists who are proficient in news. Because at the moment we have a situation which is not working for either of us…Engineers are not trained to think about moral consequences, they are educated to produce efficient systems, which they earnestly and often rightly believe will improve society. Similarly most journalists do not know nearly enough about technology to understand that how you design software, what you include in algorithms, are essentially editorial decisions. Both sides of this equation has to change. Photojournalism encompasses a variety of photographic practices: news photography, investigative reporting, sport, celebrity and red carpet, portraiture and more. Even paparazzi photography is part of the palette. They face different challenges and it’s hard to envision there will be a one-fits-all solution. “Tabloids always had the biggest reach, the largest impact and the most flexible standards,” says Emily Bell. It suggests that a big chunk of the general audience prefers speculation, suggestive leads and headlines, and outright gossip to serious reporting with fact checking and truth finding. Tabloid journalism does not have to solve a trust issue with their readers, their main challenge is reach. They have to be omnipresent on all devices, channels and platforms. Speed is crucial, not accuracy or ethics. Tabloid content is relatively cheap. It involves a lot of scheduled photo opportunities and events that take place at a previously known time and venue. Photojournalists working for tabloids have to produce high volume, low cost photographs at great speed to have a viable business model. Or they have to shoot very exclusive, high in demand stories: anything to do with celebrities — portraits, weddings, compromising situations. For serious media — adhering to traditional journalistic value — the challenges are different. They have to restore trust amongst their readership. Their weapons: independency, accuracy, accountability and total transparency. They have to convince their constituency that facts do matter and that the truth is more than just a personal opinion. Another challenge is funding. Serious media cannot compete with the popular press when it comes to reach. As a consequence their advertising revenues are limited. Furthermore partnering with advertisers, businesses, or political and social driven organizations can jeopardize their independence. Support will have to come from readers who value the need for investigative reporting and are able and willing to pay for it. Journalists and photographers will rely on personal funding for in-depth, long-term projects. They have to become business savvy, creative in finding financial sources and proficient in seducing and persuading potential partners. Towards personal gatekeepers Photojournalists and documentary photographers who realized early on that their natural habitat — the picture magazines, the printed press — started to crumble, found a new stage in museums, photo galleries and photo books. In this new environment traditional journalistic values and its code of ethics don’t necessarily apply. And being outside the press, strictly speaking these presentations cannot be labeled photojournalism. It is visual storytelling and the visual authors are personally accountable for the content and presentation. They can work according to strict journalistic values and ethics or give themselves some more leeway. But whatever they do, they are personally responsible and accountable. With traditional, institutional gatekeepers under siege, building relationships with individual visual authors, working inside or outside journalism, is a viable alternative and possibly the beginning of a new surge in — and revaluation of — all forms of responsible, committed, engaged and passionate visual reporting. If you liked this article, make sure to click the green heart below so other people will see it here on Medium. ", "name": "2066", "parent": "", "sentences": [{"38e5": "Reality check"}, {"45e8": "The need for journalism to restore trust and develop a reliable new business model has never been greater. What does this mean for photojournalists?"}, {"e0d0": "“This is the century of the photojournalists. They have provided us with a visual history unduplicated by images from any comparable period of human existence.” This is how Howard Chapnick – head of renowned international photo agency Blackstar from 1964 until his retirement in 1990 — begins his foreword to the Eyes of Time: Photojournalism in America."}, {"ea19": "Chapnick’s professional career took off when he returned to Blackstar in 1946 after serving in the Air Force during World War II. His career as a photo editor and manager spans the heydays of picture magazines like Life, Look, Collier’s and others. He witnessed — and contributed to — the rise of photojournalism in the media."}, {"3b33": "Chapnick claims the 20th century for photojournalists in 1988. The first digital cameras have just arrived on the market, Photoshop software will be introduced in two years time, and we were about to celebrate photography’s 150th birthday. Chapnick continues:"}, {"5723": "The camera in the hands of better educated and better informed photographers, provides us with images of unprecedented power and indisputable information about the world we live in…The great photojournalists of yesterday, today and tomorrow aim for deeper revelation and insight through the capture of spontaneous, unplanned, unposed, and unpredictable moments."}, {"91ea": "How does Chapnick’s understanding of photojournalism fit with the state of the media today?"}, {"d270": "Fast forward"}, {"4065": "Photography as Howard Chapnick knew it, was the result of a century and a half of continuous development through discoveries, inventions and improvements — big and small — in imaging technology and the printed media."}, {"3b6f": "This process of change never stops. New inventions and developments since 1988 have affected photojournalism in many ways. The shift from analog to digital photography, the introduction of Internet and the World Wide Web, has deeply changed photojournalism as a craft, a profession and a business."}, {"33e2": "Great photos still touch people and stir up civic action, but they can as easily come from a bystander with a smartphone, as from a well-trained and experienced photojournalist. Photos now reach us 24/7 through our newspaper, television, online news platforms or social media."}, {"5748": "Ethical landscape"}, {"4e9d": "In “The Elements of Journalism,” the 2001 Nieman Reports Special Issue, writers Bill Kovach and Thom Rosenstiel state: “Journalism’s first obligation is to tell the truth.” That being said they observe that people are confused about what “truth” means and they find journalists unhelpful in elucidating this issue:"}, {"d0e5": "Journalists themselves have never been very clear about what they mean by truthfulness. Journalism by nature is reactive and practical rather than philosophical and introspective…the failure by journalists to articulate what they do leaves citizens all the more suspicious that the press is either deluding itself or hiding something."}, {"3956": "Kovach and Rosenstiel suggest that journalistic truth is an ongoing process, a kind of conversation, and they urge journalists to be transparent about that process."}, {"55aa": "The commitment to truth and reality, the capturing of unplanned and unposed moments, is still very much at the heart of photojournalism and documentary photography. The code of ethics of the National Press Photographers Association insists (amongst many other things) on “maintain the integrity of the photographic images’ content and context” and to “resist being manipulated by staged photo opportunities.” As for the relationship between a photo and reality there is a consensus, voiced by Arthur Berger in his book Seeing is Believing: An Introduction to Visual Communication : “A photo is always an interpretation of reality, not reality itself.”"}, {"69da": "We accept that photojournalists are subjective, that they have opinions and a point of view that shapes their perception of the world. At the same time we trust them to be aware of possible biases and try to report as accurate, comprehensive and faithful as possible. Together with editorial policies of publications and other media these guidelines and mandates provide the ethical landscape for today’s photojournalist."}, {"7949": "For those working in journalism and the media the above might feel familiar or maybe even obvious, but what about the general public? Do they understand how it works, do they trust photojournalists and documentary photographers?"}, {"e671": "Trust for sale"}, {"6a32": "According to the latest Gallup poll Americans’ trust and confidence in the mass media “to report the news fully, accurately and fairly” has dropped to the lowest level in Gallup polling history, declining 8 percent when compared to 2015. A mere 32 percent of Americans say they have a great deal or a fair amount of trust in the media (newspapers, television, radio). Gallup registered a record high in 1976 when 72 percent expressed their trust in the media. Trust below 50 percent in 2007 and has continued to fall ever since."}, {"1173": "Gallup explains the sharp fall to the presidential elections (trust amongst Republicans dropping by 18 percent) but also sees that trust “has been eroding over time.” Gallup thinks that reversing the trend is possible:"}, {"eadf": "With the explosion of the mass media in recent years, especially the prevalence of blogs, vlogs and social media, perhaps Americans decry lower standards for journalism. When opinion-driven writing becomes something like the norm, Americans may be wary of placing trust on the work of media institutions that have less rigorous reporting criteria than in the past. On the other hand, as blogs and social media ‘mature,’ they may improve in the American public’s eyes. This could, in turn, elevate Americans’ trust and confidence in the mass media as a whole."}, {"fbed": "If maturing means applying traditional journalistic standards and fully informing the public, regaining trust might prove to be an uphill battle."}, {"bc3e": "The media are desperately searching for revenues and even traditional mainstream media outlets focus on quick hits and viral stories, even if they have little truth to them. Or in the words of CBS president Les Moonves — commenting on the fact that CBS spend so much time covering then Republican candidate Donald Trump: “It may not be good for America, but it’s damn good for CBS.”"}, {"ee3b": "What Arianna Huffington lacked in journalistic experience at the time she co-founded the Huffington Post, she made up generously with her Rolodex and a natural, almost innate understanding of what people want on the web. She understood the value of personal and personality-based writing and she instinctively knew that people want to read about things that already had their interest. If the content was slanted, it did not matter much. When media consumers find the truth no big issue, it is hard to see how trust can be restored."}, {"90b3": "Authority in limbo"}, {"fa78": "Public faith in many institutions has fallen. Fewer than half of Americans say they trust the church, the medical system, the presidency, the Supreme Court, public schools, banks, organized labor, the criminal justice system, big business and Congress. Or the press. And according to a United Nations report, this is not solely an American problem: “public trust in government and political institutions has been decreasing in all of the advanced industrial democracies.”"}, {"020e": "Renowned Indian-American journalist and author Fareed Zakaria calls it the “death of authority” in his book The Future of Freedom. Zakaria argues that the perceived failures of governments and elite institutions are the result of an increased democratization of (American) society and culture. In contrast, Christopher Hayes (author of Twilight of the Elites) observes that “[institutions] imploded under the weight of corruption and incompetence…the social contract between ordinary citizens and elites lies in tatters.”"}, {"43b6": "The consequences of the crises of authority and the falling of trust in institutions can be serious. With traditional gatekeepers struggling to survive, information flows freely. Bad information sits alongside good information, with both equally believable for those who have lost faith in traditional media and their institutional sources."}, {"1fad": "Francis Fukuyama, the American political scientist and economist, warns us that there is no reason to think that good information will win over bad information. He even believes that the current mistrust will eventually destroy our democracy."}, {"5f51": "Post-fact journalism"}, {"acb1": "With online media in abundance and traditional media gatekeepers hanging from the drip in the emergency room, people find information and “facts” that suits their interests and supports their beliefs. Social media are keen to built “echo chambers” for any inclination they spot, ensuring you will only get what you want to hear."}, {"029c": "The audience is liberated from the shackles of corrupt institutions and their messenger, the legacy media. But they pay a price: they are extremely vulnerable tomanipulation by populist politicians, greedy corporations and conspiracy thinkers with a covered and suspect agenda."}, {"146c": "Journalism has always had kind of a complicated relationship with the truth. Objectivity is a myth; there is always a social, cultural, political perspective from which every (photo)journalist looks at the world. And from a philosophical point of view you can argue that reality is a narrative and that everyone has their own truth. This can lead to the conclusion tht facts are mere opinions, lies an “alternative point of view” and reality becomes endlessly fictile and malleable."}, {"acd7": "During the Brexit campaign and the American presidential elections we have witnessed how lying has been taken to a whole new level. Politicians have always lied, but now they do not even care whether they told the truth or not. ‘Facts don’t work’ — that is how the main funder behind the Leave.EU campaign summed it up."}, {"1ab8": "Rise of the reader"}, {"11f2": "Fact-based representation distinguishes journalism from all other reporting in words and/or pictures. Facts were the hard currency for (photo)journalism. On facts you built reality and truth. Journalist were held accountable for getting the facts right. When a fact becomes whatever you feel is true, or you want to be true, it’s value for journalism is diminishing fast."}, {"5c01": "Neetzam Zimmerman, the former Gawker specialist in viral stories, could not put it more bluntly: “nowadays it’s not important if a story’s real, the only thing that really matters is whether people click on it.” Facts in his eye are over, a relic from the age of the printing press. He continues: “If a person is not sharing a story it is — at its core — not news.” A viral story is the holy grail for publishers. The new measure for many news organizations is virality rather than truth or quality."}, {"6f4c": "Digital publishing has offered journalism many new tools and possibilities to research and produce compelling stories, new ways to tell them and new ways to connect to new readers. It has led to the rise of the reader, as journalist Katherine Viner calls it: “a fundamental redrawing of journalists’ relationship with our audience, how we think about our readers, our perception of our role in society, our status.”"}, {"e6bc": "All this against a backdrop of an industry in trouble, with a business model under threat. Viner’s colleague at The Guardian, Mary Hamilton (the executive editor for audience) says: “we’ve transformed everything about our journalism and not enough about our business.” Which is a plea for business innovation."}, {"6f30": "Re-thinking (photo)journalism"}, {"6b8c": "Journalism faces two, related challenges: restoring trust amongst the general public and developing a reliable new business model."}, {"37bf": "Emily Bell, the director of Columbia University’s Tow center for digital journalism is convinced that any solution has to start with a firm and honest collaboration between journalism and technology:"}, {"d2d1": "Journalism needs a lot more journalists who are technically proficient, and the new gods, the platform companies, social networks and search engines, need to hire a lot more technologists who are proficient in news. Because at the moment we have a situation which is not working for either of us…Engineers are not trained to think about moral consequences, they are educated to produce efficient systems, which they earnestly and often rightly believe will improve society. Similarly most journalists do not know nearly enough about technology to understand that how you design software, what you include in algorithms, are essentially editorial decisions. Both sides of this equation has to change."}, {"0a80": "Photojournalism encompasses a variety of photographic practices: news photography, investigative reporting, sport, celebrity and red carpet, portraiture and more. Even paparazzi photography is part of the palette. They face different challenges and it’s hard to envision there will be a one-fits-all solution."}, {"91be": "“Tabloids always had the biggest reach, the largest impact and the most flexible standards,” says Emily Bell. It suggests that a big chunk of the general audience prefers speculation, suggestive leads and headlines, and outright gossip to serious reporting with fact checking and truth finding. Tabloid journalism does not have to solve a trust issue with their readers, their main challenge is reach. They have to be omnipresent on all devices, channels and platforms. Speed is crucial, not accuracy or ethics."}, {"8691": "Tabloid content is relatively cheap. It involves a lot of scheduled photo opportunities and events that take place at a previously known time and venue. Photojournalists working for tabloids have to produce high volume, low cost photographs at great speed to have a viable business model. Or they have to shoot very exclusive, high in demand stories: anything to do with celebrities — portraits, weddings, compromising situations."}, {"75a9": "For serious media — adhering to traditional journalistic value — the challenges are different. They have to restore trust amongst their readership. Their weapons: independency, accuracy, accountability and total transparency. They have to convince their constituency that facts do matter and that the truth is more than just a personal opinion."}, {"34e4": "Another challenge is funding. Serious media cannot compete with the popular press when it comes to reach. As a consequence their advertising revenues are limited. Furthermore partnering with advertisers, businesses, or political and social driven organizations can jeopardize their independence. Support will have to come from readers who value the need for investigative reporting and are able and willing to pay for it."}, {"da57": "Journalists and photographers will rely on personal funding for in-depth, long-term projects. They have to become business savvy, creative in finding financial sources and proficient in seducing and persuading potential partners."}, {"0bec": "Towards personal gatekeepers"}, {"3ffe": "Photojournalists and documentary photographers who realized early on that their natural habitat — the picture magazines, the printed press — started to crumble, found a new stage in museums, photo galleries and photo books."}, {"f05e": "In this new environment traditional journalistic values and its code of ethics don’t necessarily apply. And being outside the press, strictly speaking these presentations cannot be labeled photojournalism. It is visual storytelling and the visual authors are personally accountable for the content and presentation. They can work according to strict journalistic values and ethics or give themselves some more leeway. But whatever they do, they are personally responsible and accountable."}, {"eb9a": "With traditional, institutional gatekeepers under siege, building relationships with individual visual authors, working inside or outside journalism, is a viable alternative and possibly the beginning of a new surge in — and revaluation of — all forms of responsible, committed, engaged and passionate visual reporting."}, {"a1c8": "If you liked this article, make sure to click the green heart below so other people will see it here on Medium."}]}