{"child": "2068_1\t2068_2\t2068_3\t2068_4\t2068_5\t2068_6\t2068_7", "title": "Where do we go from here?", "content": "Where do we go from here? A wake-up call for visual journalism in the “post-factual” era In the wake of the hate-filled elections in the United States, the president-elect and many of his followers have continued their blistering attacks on media and other “elites” while dismissing facts as impediments to their own particular constructions of reality. (This president-elect’s background as a media invention emerging from the peculiar unreality of “reality television” is pertinent here.) This follows the disconnect that saw nearly all mainstream journalists wrongly assess the mood of the country before the elections, and the widespread sense that the coverage of the Trump campaign was fawning, superficial and disproportionate, so that his platform was enlarged considerably beyond what was merited (“It may not be good for America, but it’s damn good for CBS,” as the chairman of one major news company put it last February, extolling the money to be made from advertisers during the extended Trump coverage). The result is that the traditional role of news media as an important arbiter of contemporary society has been brutally challenged in the United States and, in some camps, dismissed. Can the media in the United States, as well as media outlets throughout the world, continue to help provide a coherent, society-wide, fact-based framework to understand and debate the meaning of contemporary issues and events? Or, in this “post-factual” era, transfixed by the emergence of an energized social media, is the role of the journalist increasingly irrelevant? And if so, does it need to be reinvented? The role of visual journalists is being questioned. Simply put, are we now living in largely consumerist societies in which the image is celebrated as long as it is confined to selfies and personal experience, or as it burnishes the luster of celebrities, but dismissed if attempting to make connections to larger realities that may be painful or discordant with one’s own preconceptions? Or, in an age of antipathy, exacerbated by the unpleasant and at times vicious barbs of social media, can a photographer assume that empathetic imagery will still resonate with large segments of the public for whom the boundaries of citizenship have shrunk and become increasingly local? In today’s media environment, photographs are wildly overabundant, unfiltered, often decontextualized, and free. A situation is created in which a single photograph hardly ever emerges as emblematic of an issue, and as a focus for a societal debate. The evidence of the photograph can be too easily denied by the many others that show other perspectives; by the public’s eroded sense of the credibility of media organizations; by the frequent use of digital manipulation and the setting up of scenes to be photographed; by the rapid replacement of images online by others; and by a growing sense that no matter what is shown, given the current political climate, there may be little to be done about it so why engage with the image? With the disappearance of print media, there is no longer a front page to hold the public’s attention and, in the digital universe, accomplished visual journalists are not accorded the elevated prestige that they would have as an author of a printed book or in a magazine or an exhibition. The online photo essay is usually a slideshow front-loaded with the more exciting imagery in order to keep the reader clicking longer, a boon for advertisers, rather than a carefully laid-out sequence of larger and smaller pictures accorded a specific visual rhythm, advancing both a narrative and a point of view with an accompanying text. As a result, those images that speak to massive problems, such as climate change or economic disparities, have little traction in societal discussions as to our future. The absence of specific emblematic photographs also makes it harder for protesters to galvanize around specific instances of injustice, as happened previously during the Vietnam War, the Civil Rights Movement, the US occupation of Iraq, and many other moments in history. Multimedia projects, while often compelling, are still finding their footing as reference points in such debates — in the sped-up consumption of online media, it is still necessary to complement them with imagery that can be easily approached. For the moment, it is the short videos and Facebook Live broadcasts made primarily by people with cellphone cameras, such as those of police shootings of young black men in the United States, that still serve some of that function. Even then responses of compassion and concern to the plight of these men and to the Black Lives Matter movement that emerged were immediately challenged by those asserting competing perspectives, such as the “White Lives Matter” and “All Lives Matter” slogans that appeared soon afterward. We are now at the point where the death of unarmed civilians in one’s own country can be perceived to be part of a propaganda war. This democratization of information via social media, including the enhanced abilities to produce, distribute and consume “information” according to one’s tastes, has both opened us up to a much larger sense of ourselves, some of it quite distressing, and moved us significantly closer, it seems, to mob-driven rather than crowd-sourced exchanges, leaving many feeling under imminent attack. Rather than a measured debate on the media commons, we have seen the emergence of enormous numbers of flame-throwing attacks on Twitter and other platforms, many based on a person’s race, religion, ethnicity, gender and immigration status, leaving large numbers of people deeply shaken and concerned about their own safety. While in the burgeoning revolution against elites, as we have seen most recently in the US election, there has been an angry resistance to allowing professional journalists to be the lead storytellers and interpreters of contemporary life, one might also now expect there to be a growth in “real news” outlets in response not only to the destructiveness of the political process but also to the prevalence of “fake news” sites. As cited by the New Yorker’s Nathan Heller in a post-election report on the United States, where 44 percent of the general population are said to have used Facebook as a news source: An analysis this week by Craig Silverman, of BuzzFeed, found that the 20 top-performing fake news stories on the network outperformed the 20 top real-news stories during the final three months before the election — and that 17 of those fakes favored the Trump campaign. Trump’s exponents, including the candidate himself, routinely cited fake information on camera. In a moment of enormous global challenges, when facts hardly seem to matter to large swaths of society, and opinion surmounts common sense, the need for a widely shared sphere of contemporary knowledge is urgent and, to many, obvious. For example, the New York Times attracted 41,000 new subscribers in the seven days after the US elections concluded—their largest single-week growth since the digital paywall was enacted five years prior. Democratic societies cannot survive without the ability to have reasonable conversations on issues and events, and these cannot occur without agreed-upon sources of information. Nullifying the power of the press means that there are considerably fewer checks and balances on governments and corporations, encouraging intransigence and corruption on the part of those in power; social media is not capable of this alone. The abandonment or implosion of a reliable journalistic enterprise would accelerate the entrenchment of a form of dictatorship in which freedom of expression would be largely non-existent or meaningless. In this vein, the virulent attacks by the president-elect against the televised satire “Saturday Night Live,” saying it was “biased” and asking for “equal time for us,” and against the cast of the popular Broadway play “Hamilton,” who had lined up on stage to ask the vice-president-elect, in the audience, to support long-standing policies of inclusion, are not heartening. So where do we go from here? Reaffirming core principles, journalists must make it clear that they stand for the essential humanity of every person in accord with the Universal Declaration of Human Rights, recognizing “the inherent dignity” and “the equal and inalienable rights of all members of the human family” as “the foundation of freedom, justice and peace in the world.” Journalism’s mission is, in fact, similar: to report upon and explore contemporary society in order to recognize the rights of all, including the marginalized and oppressed, and to place blame when those rights are compromised. The coverage of issues and events should be done with fairness and in depth, acknowledging that all photography and journalism is interpretive, but that as observers it is incumbent upon each of us to try to overcome any biases. This stance must be transparent, supported by simple and straightforward ethical rules for journalists that are readily available to the reader. For example, “While all photography is interpretive, as a photojournalist my photographs are meant to respect the visible facts of the situations I depict. I do not add or subtract elements to or from my photographs.” Or, “As a fashion photographer, I do not photograph underweight models.” Or, “As a fine art photographer, I may alter my images in pursuit of my own artistic vision.” Such ethics codes do not have to be so complicated that they resemble the fine print of a contract, or if they do, a hyperlink could lead the reader to more information once the essentials are stated. As it stands now, the ethics policies of news outlets are usually extraordinarily difficult to find. In part, the affirmation of such standards helps to answer the question as to how a visual journalist is different than someone who simply happens to have a camera with them. So, too, the investigation and depiction by visual journalists of the systems that are at work, not simply their effects, helps to delineate the difference. Repetitive imagery of the spectacle of war, for example is not conducive to a greater understanding of the causes of conflicts, nor do images alone of bedraggled poor people explain why they are in a difficult situation. Photographs do not only have to be reactive, showing what is, but can be proactive, trying to prevent future problems and disasters (a photography of peace rather than a photography of war, for example). Let’s consider: Social media can be immensely helpful in including more voices and perspectives, but those living in other communities must be invited to curate the media commenting upon their own situations. Extraordinary imagery can emerge, with the appropriate stories contextualizing it by those who are cognizant of the deeper meanings of a photograph. For example, I think of a Chinese student of mine who showed a photograph from social media of his hometown that depicted middle-aged people holding hands in the middle of the street — to block traffic, he explained, so that their children, in an adjacent building, would be surrounded by quiet while taking the examinations to get into university. One can also consider third-person reporting depicting the “other” to be only a single strategy of visual journalism. The French photographer Henri Cartier-Bresson considered photojournalism to be keeping a journal with a camera — this can be a strategy that lets the reader in on the backstory surrounding an image. One fine example of this from photographic history is Raymond Depardon’s Correspondance new-yorkaise (“New York Correspondence”), a 1981 month-long project for the French daily Libération’s foreign affairs pages in which he made a single photograph every day in New York City of whatever he wanted, and added diary-like text describing his own personal feelings. For example, next to a black-and-white photograph of three men, shown from the back, holding umbrellas in the rain and wind on the Staten Island Ferry, Depardon’s text read (in French): July 4, 1981. New York. It rains, it rains. It is Independence Day, a holiday, the city is empty. A visit to the Statue of Liberty. Discussion all night with a girlfriend. I want to go back to France, to let everything go. I force myself to make a photo. I ask myself what am I doing here. All is sad. A bad day. I begin to read G by John Berger. Depardon’s work allows the “camera reality” of the men on the ferry in the rain to be amplified by a text that also calls the viewing into question — would the image have been rendered as sadly were its author in a different frame of mind? And it was also a pioneering effort foreshadowing today’s social media in which the personal and anecdotal are given prominence; the photo-reporter is allowed his or her own personality, making the process much more palpable and evident. There are enormous numbers of artists and documentarians creating new strategies for telling stories, from Chris Johnson and Hank Willis Thomas’s Question Bridge, a platform enabling African-American men to ask and answer questions posed to each other; to Monica Haller’s extensive work with veterans, facilitating the making of books with their own photographs and texts exploring and sharing their experiences; to Gideon Mendel’s proactive use of photography to show the benefits of antiretroviral drugs for people with HIV in Africa, a strategy that led to funding enabling 8 million people to get treatment. It would be narrow-minded for us to not examine their many approaches to see which of them can be configured and applied to our coverage of contemporary societies. Acknowledging the need to reinvent, the Four Corners project (based upon the idea I put forth at the World Press Photo Awards Days in 2004) aims to increase the authorship and authority of the photographer by providing a template to add context to each of the four corners of a photograph online. This contextualization is intended to remain with the photograph as it is republished and travels throughout the Internet, adding to the credibility of the image in an era in which the veracity of media is being constantly challenged. Now that it is being implemented, it is the first major advance in contextualizing the photograph since the caption. A collaboration among the International Center of Photography (New York), the Open Lab at Newcastle University (England), and the World Press Photo Foundation (Amsterdam), the Four Corners project is open source so that anyone can use it, and the code is now available at fourcorners.io. By rolling over on each of the corners with the cursor, the interested reader is able to find out more about what is referenced by the photograph — the Backstory on the lower left (context provided by the photographer, the subject, a witness, etc.); the Image Context on the upper left (photographs made before and after, a video of the scene, a comparative image, etc.); Links on the upper right (articles, videos, maps, etc., that add more information and can be found online); and the Caption/Credit/Code of Ethics (the photographer’s own caption, credit, and copyright, as well as a code of ethics that can be found by clicking on the photographer’s name — the first time in history that a reader will be able to immediately know whether a photographer does or does not manipulate the image with software, sets up photographs, etc.). There are also plans for readers to be able to add insights and ideas as part of a conversation that emerges around the photograph, to embed digital contracts, and to establish the provenance of the image. More such projects need to emerge that recognize the digital image as having expanded potentials that the printed photograph does not. Rather than simply bemoaning what we may have lost in the transition to the online, it makes sense to try and advance visual journalism in part by acknowledging that the digital image has enormously different potentials than the analog photograph; the Four Corners project is only one way to acknowledge and take advantage of these differences. The events of 2016 need to be a wake-up call for the visual journalist, as well as all journalists. It is a moment to recognize what new potentials for journalism emerge with the digital, to acknowledge the standards of the profession and to make the codes of ethics transparent, to relinquish some of the fascination with celebrities and spectacles, and to work harder than ever to explore and articulate the dynamics at work in society. Industry-wide think tanks and other arenas for discussion that include the perspectives of a diverse group of non-journalists would be helpful in formulating these new ideas, and in addressing concerns for the profession’s financial survival. Given current circumstances, a vital, reimagined journalism is more critical than ever. ", "name": "2068", "parent": "", "sentences": [{"37d2": "Where do we go from here?"}, {"1efa": "A wake-up call for visual journalism in the “post-factual” era"}, {"da3b": "In the wake of the hate-filled elections in the United States, the president-elect and many of his followers have continued their blistering attacks on media and other “elites” while dismissing facts as impediments to their own particular constructions of reality. (This president-elect’s background as a media invention emerging from the peculiar unreality of “reality television” is pertinent here.) This follows the disconnect that saw nearly all mainstream journalists wrongly assess the mood of the country before the elections, and the widespread sense that the coverage of the Trump campaign was fawning, superficial and disproportionate, so that his platform was enlarged considerably beyond what was merited (“It may not be good for America, but it’s damn good for CBS,” as the chairman of one major news company put it last February, extolling the money to be made from advertisers during the extended Trump coverage). The result is that the traditional role of news media as an important arbiter of contemporary society has been brutally challenged in the United States and, in some camps, dismissed."}, {"3b14": "Can the media in the United States, as well as media outlets throughout the world, continue to help provide a coherent, society-wide, fact-based framework to understand and debate the meaning of contemporary issues and events? Or, in this “post-factual” era, transfixed by the emergence of an energized social media, is the role of the journalist increasingly irrelevant? And if so, does it need to be reinvented?"}, {"46b3": "The role of visual journalists is being questioned."}, {"54c0": "Simply put, are we now living in largely consumerist societies in which the image is celebrated as long as it is confined to selfies and personal experience, or as it burnishes the luster of celebrities, but dismissed if attempting to make connections to larger realities that may be painful or discordant with one’s own preconceptions? Or, in an age of antipathy, exacerbated by the unpleasant and at times vicious barbs of social media, can a photographer assume that empathetic imagery will still resonate with large segments of the public for whom the boundaries of citizenship have shrunk and become increasingly local?"}, {"b559": "In today’s media environment, photographs are wildly overabundant, unfiltered, often decontextualized, and free. A situation is created in which a single photograph hardly ever emerges as emblematic of an issue, and as a focus for a societal debate. The evidence of the photograph can be too easily denied by the many others that show other perspectives; by the public’s eroded sense of the credibility of media organizations; by the frequent use of digital manipulation and the setting up of scenes to be photographed; by the rapid replacement of images online by others; and by a growing sense that no matter what is shown, given the current political climate, there may be little to be done about it so why engage with the image?"}, {"3b0d": "With the disappearance of print media, there is no longer a front page to hold the public’s attention and, in the digital universe, accomplished visual journalists are not accorded the elevated prestige that they would have as an author of a printed book or in a magazine or an exhibition. The online photo essay is usually a slideshow front-loaded with the more exciting imagery in order to keep the reader clicking longer, a boon for advertisers, rather than a carefully laid-out sequence of larger and smaller pictures accorded a specific visual rhythm, advancing both a narrative and a point of view with an accompanying text."}, {"1d12": "As a result, those images that speak to massive problems, such as climate change or economic disparities, have little traction in societal discussions as to our future."}, {"18bd": "The absence of specific emblematic photographs also makes it harder for protesters to galvanize around specific instances of injustice, as happened previously during the Vietnam War, the Civil Rights Movement, the US occupation of Iraq, and many other moments in history. Multimedia projects, while often compelling, are still finding their footing as reference points in such debates — in the sped-up consumption of online media, it is still necessary to complement them with imagery that can be easily approached. For the moment, it is the short videos and Facebook Live broadcasts made primarily by people with cellphone cameras, such as those of police shootings of young black men in the United States, that still serve some of that function. Even then responses of compassion and concern to the plight of these men and to the Black Lives Matter movement that emerged were immediately challenged by those asserting competing perspectives, such as the “White Lives Matter” and “All Lives Matter” slogans that appeared soon afterward. We are now at the point where the death of unarmed civilians in one’s own country can be perceived to be part of a propaganda war."}, {"345e": "This democratization of information via social media, including the enhanced abilities to produce, distribute and consume “information” according to one’s tastes, has both opened us up to a much larger sense of ourselves, some of it quite distressing, and moved us significantly closer, it seems, to mob-driven rather than crowd-sourced exchanges, leaving many feeling under imminent attack. Rather than a measured debate on the media commons, we have seen the emergence of enormous numbers of flame-throwing attacks on Twitter and other platforms, many based on a person’s race, religion, ethnicity, gender and immigration status, leaving large numbers of people deeply shaken and concerned about their own safety."}, {"badf": "While in the burgeoning revolution against elites, as we have seen most recently in the US election, there has been an angry resistance to allowing professional journalists to be the lead storytellers and interpreters of contemporary life, one might also now expect there to be a growth in “real news” outlets in response not only to the destructiveness of the political process but also to the prevalence of “fake news” sites. As cited by the New Yorker’s Nathan Heller in a post-election report on the United States, where 44 percent of the general population are said to have used Facebook as a news source:"}, {"6446": "An analysis this week by Craig Silverman, of BuzzFeed, found that the 20 top-performing fake news stories on the network outperformed the 20 top real-news stories during the final three months before the election — and that 17 of those fakes favored the Trump campaign. Trump’s exponents, including the candidate himself, routinely cited fake information on camera."}, {"e55f": "In a moment of enormous global challenges, when facts hardly seem to matter to large swaths of society, and opinion surmounts common sense, the need for a widely shared sphere of contemporary knowledge is urgent and, to many, obvious. For example, the New York Times attracted 41,000 new subscribers in the seven days after the US elections concluded—their largest single-week growth since the digital paywall was enacted five years prior."}, {"f054": "Democratic societies cannot survive without the ability to have reasonable conversations on issues and events, and these cannot occur without agreed-upon sources of information. Nullifying the power of the press means that there are considerably fewer checks and balances on governments and corporations, encouraging intransigence and corruption on the part of those in power; social media is not capable of this alone. The abandonment or implosion of a reliable journalistic enterprise would accelerate the entrenchment of a form of dictatorship in which freedom of expression would be largely non-existent or meaningless. In this vein, the virulent attacks by the president-elect against the televised satire “Saturday Night Live,” saying it was “biased” and asking for “equal time for us,” and against the cast of the popular Broadway play “Hamilton,” who had lined up on stage to ask the vice-president-elect, in the audience, to support long-standing policies of inclusion, are not heartening."}, {"ad16": "So where do we go from here?"}, {"c820": "Reaffirming core principles, journalists must make it clear that they stand for the essential humanity of every person in accord with the Universal Declaration of Human Rights, recognizing “the inherent dignity” and “the equal and inalienable rights of all members of the human family” as “the foundation of freedom, justice and peace in the world.” Journalism’s mission is, in fact, similar: to report upon and explore contemporary society in order to recognize the rights of all, including the marginalized and oppressed, and to place blame when those rights are compromised."}, {"700f": "The coverage of issues and events should be done with fairness and in depth, acknowledging that all photography and journalism is interpretive, but that as observers it is incumbent upon each of us to try to overcome any biases. This stance must be transparent, supported by simple and straightforward ethical rules for journalists that are readily available to the reader."}, {"df5c": "For example, “While all photography is interpretive, as a photojournalist my photographs are meant to respect the visible facts of the situations I depict. I do not add or subtract elements to or from my photographs.”"}, {"f459": "Or, “As a fashion photographer, I do not photograph underweight models.”"}, {"cfff": "Or, “As a fine art photographer, I may alter my images in pursuit of my own artistic vision.”"}, {"4f26": "Such ethics codes do not have to be so complicated that they resemble the fine print of a contract, or if they do, a hyperlink could lead the reader to more information once the essentials are stated. As it stands now, the ethics policies of news outlets are usually extraordinarily difficult to find. In part, the affirmation of such standards helps to answer the question as to how a visual journalist is different than someone who simply happens to have a camera with them."}, {"3f63": "So, too, the investigation and depiction by visual journalists of the systems that are at work, not simply their effects, helps to delineate the difference. Repetitive imagery of the spectacle of war, for example is not conducive to a greater understanding of the causes of conflicts, nor do images alone of bedraggled poor people explain why they are in a difficult situation. Photographs do not only have to be reactive, showing what is, but can be proactive, trying to prevent future problems and disasters (a photography of peace rather than a photography of war, for example). Let’s consider:"}, {"afa7": "Social media can be immensely helpful in including more voices and perspectives, but those living in other communities must be invited to curate the media commenting upon their own situations. Extraordinary imagery can emerge, with the appropriate stories contextualizing it by those who are cognizant of the deeper meanings of a photograph. For example, I think of a Chinese student of mine who showed a photograph from social media of his hometown that depicted middle-aged people holding hands in the middle of the street — to block traffic, he explained, so that their children, in an adjacent building, would be surrounded by quiet while taking the examinations to get into university."}, {"ed05": "One can also consider third-person reporting depicting the “other” to be only a single strategy of visual journalism. The French photographer Henri Cartier-Bresson considered photojournalism to be keeping a journal with a camera — this can be a strategy that lets the reader in on the backstory surrounding an image. One fine example of this from photographic history is Raymond Depardon’s Correspondance new-yorkaise (“New York Correspondence”), a 1981 month-long project for the French daily Libération’s foreign affairs pages in which he made a single photograph every day in New York City of whatever he wanted, and added diary-like text describing his own personal feelings."}, {"7898": "For example, next to a black-and-white photograph of three men, shown from the back, holding umbrellas in the rain and wind on the Staten Island Ferry, Depardon’s text read (in French):"}, {"dc43": "July 4, 1981. New York. It rains, it rains. It is Independence Day, a holiday, the city is empty. A visit to the Statue of Liberty. Discussion all night with a girlfriend. I want to go back to France, to let everything go. I force myself to make a photo. I ask myself what am I doing here. All is sad. A bad day. I begin to read G by John Berger."}, {"4466": "Depardon’s work allows the “camera reality” of the men on the ferry in the rain to be amplified by a text that also calls the viewing into question — would the image have been rendered as sadly were its author in a different frame of mind? And it was also a pioneering effort foreshadowing today’s social media in which the personal and anecdotal are given prominence; the photo-reporter is allowed his or her own personality, making the process much more palpable and evident."}, {"5af0": "There are enormous numbers of artists and documentarians creating new strategies for telling stories, from Chris Johnson and Hank Willis Thomas’s Question Bridge, a platform enabling African-American men to ask and answer questions posed to each other; to Monica Haller’s extensive work with veterans, facilitating the making of books with their own photographs and texts exploring and sharing their experiences; to Gideon Mendel’s proactive use of photography to show the benefits of antiretroviral drugs for people with HIV in Africa, a strategy that led to funding enabling 8 million people to get treatment. It would be narrow-minded for us to not examine their many approaches to see which of them can be configured and applied to our coverage of contemporary societies."}, {"3030": "Acknowledging the need to reinvent, the Four Corners project (based upon the idea I put forth at the World Press Photo Awards Days in 2004) aims to increase the authorship and authority of the photographer by providing a template to add context to each of the four corners of a photograph online. This contextualization is intended to remain with the photograph as it is republished and travels throughout the Internet, adding to the credibility of the image in an era in which the veracity of media is being constantly challenged. Now that it is being implemented, it is the first major advance in contextualizing the photograph since the caption. A collaboration among the International Center of Photography (New York), the Open Lab at Newcastle University (England), and the World Press Photo Foundation (Amsterdam), the Four Corners project is open source so that anyone can use it, and the code is now available at fourcorners.io."}, {"53d6": "By rolling over on each of the corners with the cursor, the interested reader is able to find out more about what is referenced by the photograph — the Backstory on the lower left (context provided by the photographer, the subject, a witness, etc.); the Image Context on the upper left (photographs made before and after, a video of the scene, a comparative image, etc.); Links on the upper right (articles, videos, maps, etc., that add more information and can be found online); and the Caption/Credit/Code of Ethics (the photographer’s own caption, credit, and copyright, as well as a code of ethics that can be found by clicking on the photographer’s name — the first time in history that a reader will be able to immediately know whether a photographer does or does not manipulate the image with software, sets up photographs, etc.). There are also plans for readers to be able to add insights and ideas as part of a conversation that emerges around the photograph, to embed digital contracts, and to establish the provenance of the image."}, {"ae6e": "More such projects need to emerge that recognize the digital image as having expanded potentials that the printed photograph does not. Rather than simply bemoaning what we may have lost in the transition to the online, it makes sense to try and advance visual journalism in part by acknowledging that the digital image has enormously different potentials than the analog photograph; the Four Corners project is only one way to acknowledge and take advantage of these differences."}, {"5c72": "The events of 2016 need to be a wake-up call for the visual journalist, as well as all journalists."}, {"056d": "It is a moment to recognize what new potentials for journalism emerge with the digital, to acknowledge the standards of the profession and to make the codes of ethics transparent, to relinquish some of the fascination with celebrities and spectacles, and to work harder than ever to explore and articulate the dynamics at work in society. Industry-wide think tanks and other arenas for discussion that include the perspectives of a diverse group of non-journalists would be helpful in formulating these new ideas, and in addressing concerns for the profession’s financial survival. Given current circumstances, a vital, reimagined journalism is more critical than ever."}]}