{"child": "2086_1\t2086_2\t2086_32086_1\t2086_2\t2086_3", "title": "Little Ethiopia in the U.S.", "content": "Little Ethiopia in the U.S. by Hilina Abebe for the 2016 Masterclass East Africa They try to create a “home away from home”. Even though they have left their country in search of “the American dream”, they long for home and try to bring bits of it with them. This is what I witnessed while photographing the Ethiopian community in the United States, specifically those residing in the Washington D.C. and Virginia area. There is a sense of nostalgia, and of wanting to still keep a part of who they are, while at the same time integrating to the U.S. society as immigrants. A Sunday mass gathers for prayer at the Holy Trinity Ethiopian Orthodox Church in Falls Church, VA. The Church was founded 20 years ago in a rented establishment. A woman waits at the Holy Trinity Ethiopian Orthodox Church in Falls Church, VA after Sunday service. The Washington D.C. area is where Ethiopians started migrating to in large numbers during the Derg Regime in the 1970’s. Since then, Ethiopians have continued to migrate for various reasons, mainly for a “better” life. Today, Ethiopians account for the largest African immigrant groups in the Washington D.C. area. An Arlington-based Ethiopian Community Development Center claims that there are about 100,000 Ethiopians living in the area alone. This presence is strongly evident in some neighborhoods in the U.S. In Washington D.C., for instance, the community has a neighborhood informally dubbed as “Little Ethiopia” where a significant proportion of Ethiopian-owned businesses operate and a large number of the Ethiopian immigrants reside in. The Skyline area in Falls Church, Virginia, is another hub for Ethiopian immigrants with a number of thriving Ethiopian-owned businesses. Most go there looking for Ethiopian coffee, food, spices, clothing or even live Ethiopian music. For others, it is where they get to meet and speak their own language. Faith is a strong part of their identity and religious institutions serve as a linking thread, holding the community together. This is an ongoing project that looks into identity among Ethiopian immigrants and their connection to their homeland while integrating to the American way of life. A sign in Amharic for fresh snack is displayed in one of the Ethiopian owned stores in Falls Church, VA. All text and images © Hilina Abebe Read an interview with the photographer about this story and more. Hilina was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists. ", "name": "2086", "parent": "", "sentences": [{"dc58": "Little Ethiopia in the U.S."}, {"cb96": "by Hilina Abebe for the 2016 Masterclass East Africa"}, {"b9e6": "They try to create a “home away from home”. Even though they have left their country in search of “the American dream”, they long for home and try to bring bits of it with them."}, {"2b23": "This is what I witnessed while photographing the Ethiopian community in the United States, specifically those residing in the Washington D.C. and Virginia area. There is a sense of nostalgia, and of wanting to still keep a part of who they are, while at the same time integrating to the U.S. society as immigrants."}, {"e08a": "A Sunday mass gathers for prayer at the Holy Trinity Ethiopian Orthodox Church in Falls Church, VA. The Church was founded 20 years ago in a rented establishment."}, {"ba8d": "A woman waits at the Holy Trinity Ethiopian Orthodox Church in Falls Church, VA after Sunday service."}, {"02cf": "The Washington D.C. area is where Ethiopians started migrating to in large numbers during the Derg Regime in the 1970’s. Since then, Ethiopians have continued to migrate for various reasons, mainly for a “better” life. Today, Ethiopians account for the largest African immigrant groups in the Washington D.C. area. An Arlington-based Ethiopian Community Development Center claims that there are about 100,000 Ethiopians living in the area alone."}, {"6b6e": "This presence is strongly evident in some neighborhoods in the U.S. In Washington D.C., for instance, the community has a neighborhood informally dubbed as “Little Ethiopia” where a significant proportion of Ethiopian-owned businesses operate and a large number of the Ethiopian immigrants reside in."}, {"3c5a": "The Skyline area in Falls Church, Virginia, is another hub for Ethiopian immigrants with a number of thriving Ethiopian-owned businesses. Most go there looking for Ethiopian coffee, food, spices, clothing or even live Ethiopian music. For others, it is where they get to meet and speak their own language. Faith is a strong part of their identity and religious institutions serve as a linking thread, holding the community together."}, {"ab25": "This is an ongoing project that looks into identity among Ethiopian immigrants and their connection to their homeland while integrating to the American way of life."}, {"d034": "A sign in Amharic for fresh snack is displayed in one of the Ethiopian owned stores in Falls Church, VA."}, {"6806": "All text and images © Hilina Abebe"}, {"123b": "Read an interview with the photographer about this story and more."}, {"f3ab": "Hilina was one of 12 participants selected for the 2016 Masterclass East Africa, the second in the World Press Photo Foundation’s series of satellite masterclasses based on the formula of the annual Joop Swart Masterclass for the world’s most talented upcoming visual journalists."}]}