{"parent": "", "name": "2091", "content": "Meaning in the Mundane {23}: Belief. First off, let me say that I value this community. Medium has been a place where I’ve found support when I’ve doubted, encouragement when I’ve faltered, and inspiration when there was none elsewhere. It is a special place, and I’ve met some exceptional people here — both in spirit and in talent. This being said, I have to say something. It might make me unpopular, and might well open me up to criticism. So be it. I care too much about this community to not address what’s been happening. I’ve now been privy to two circumstances where the authenticity of a writer was questioned. In both circumstances, what began as a “feeling” that something was “off” about a narrative turned into private messages and a fairly overt ganging up on the individuals in question. It has, in both cases, led to blocking, division, and some very hurt feelings. Now, look. You have no idea who I am, if my name is real, if what I write about is fantasy or reality. I have, for the most part, the same information about you. This is the nature of social media — we take what we’re given and make of it what we will. There will be things we believe and things we don’t believe, things that resonate and things that don’t. We may question each other’s truths, and may even discuss them privately among our closer Medium friends. (Or our poor, poor, non-writer partners and friends.) But launching what amounts to full-scale campaigns against other writers here is destructive to what makes Medium such a special place. Indicating your disbelief is your prerogative, I suppose, but isn’t it much kinder to simply unfollow or not respond, or to not get involved with it at all? What does it say if we, as a writing-based community, act in such a way as to actively dissuade someone from writing, simply because their writing doesn’t fit with our collective notion about what writing of a certain type should “feel like”? And even, what does it say if we make this space unsafe for that kind of writing to exist? There are millions of experiences I haven’t had, and I would be lying if I told you I could predict how I would react or recount any one of those millions of experiences. I might even know what I would be expected to sound like, but would my real response reflect that? And if I forced it to, would that make me more or less authentic? No one likes being lied to, and a sense of authenticity is absolutely what makes Medium work. We believe each other, and the threat of being “taken” disrupts us all — it calls into question our own authenticity, makes us question what and who we believe and why. But I’ve been here for a few months, and both times this has happened it’s circled around issues of sexual assault. Given the nature of these writings, I’d rather risk being duped than contribute to a culture that already makes people prove their experiences to an incomprehensible degree. As it stands, my inbox has been inundated with responses to a piece of writing I did wherein literally hundreds of people talked about not being believed, about having to prove, about the different values placed on their lives versus others. And further, as has been pointed out by others, if someone felt compelled to lie about such experiences, perhaps they need support and help, if of a different sort? I understand not being able to actively support something that feels unauthentic, but I do feel that there is an important difference between “not supporting” and “actively inhibiting” — whether this is done intentionally or not. ", "child": "2091_1\t2091_2\t2091_3\t2091_4\t2091_5\t2091_6\t2091_7\t2091_8\t2091_9", "title": "Meaning in the Mundane {23}: Belief.", "sentences": [{"9bda": "Meaning in the Mundane {23}: Belief."}, {"4441": "First off, let me say that I value this community. Medium has been a place where I’ve found support when I’ve doubted, encouragement when I’ve faltered, and inspiration when there was none elsewhere. It is a special place, and I’ve met some exceptional people here — both in spirit and in talent."}, {"f3eb": "This being said, I have to say something. It might make me unpopular, and might well open me up to criticism. So be it. I care too much about this community to not address what’s been happening."}, {"b66e": "I’ve now been privy to two circumstances where the authenticity of a writer was questioned. In both circumstances, what began as a “feeling” that something was “off” about a narrative turned into private messages and a fairly overt ganging up on the individuals in question. It has, in both cases, led to blocking, division, and some very hurt feelings."}, {"0af6": "Now, look. You have no idea who I am, if my name is real, if what I write about is fantasy or reality. I have, for the most part, the same information about you. This is the nature of social media — we take what we’re given and make of it what we will. There will be things we believe and things we don’t believe, things that resonate and things that don’t. We may question each other’s truths, and may even discuss them privately among our closer Medium friends. (Or our poor, poor, non-writer partners and friends.) But launching what amounts to full-scale campaigns against other writers here is destructive to what makes Medium such a special place. Indicating your disbelief is your prerogative, I suppose, but isn’t it much kinder to simply unfollow or not respond, or to not get involved with it at all?"}, {"2f98": "What does it say if we, as a writing-based community, act in such a way as to actively dissuade someone from writing, simply because their writing doesn’t fit with our collective notion about what writing of a certain type should “feel like”? And even, what does it say if we make this space unsafe for that kind of writing to exist?"}, {"0c42": "There are millions of experiences I haven’t had, and I would be lying if I told you I could predict how I would react or recount any one of those millions of experiences. I might even know what I would be expected to sound like, but would my real response reflect that? And if I forced it to, would that make me more or less authentic?"}, {"eb11": "No one likes being lied to, and a sense of authenticity is absolutely what makes Medium work. We believe each other, and the threat of being “taken” disrupts us all — it calls into question our own authenticity, makes us question what and who we believe and why. But I’ve been here for a few months, and both times this has happened it’s circled around issues of sexual assault. Given the nature of these writings, I’d rather risk being duped than contribute to a culture that already makes people prove their experiences to an incomprehensible degree. As it stands, my inbox has been inundated with responses to a piece of writing I did wherein literally hundreds of people talked about not being believed, about having to prove, about the different values placed on their lives versus others. And further, as has been pointed out by others, if someone felt compelled to lie about such experiences, perhaps they need support and help, if of a different sort?"}, {"e5b6": "I understand not being able to actively support something that feels unauthentic, but I do feel that there is an important difference between “not supporting” and “actively inhibiting” — whether this is done intentionally or not."}]}