{"parent": "", "name": "2093", "content": "I Quit the Job that I’m Too Old For But wanted when I was younger It has happened. The moment when you realize that you are finally slipping into the “mature” category. The moment when millennials show off all the reasons why they were born at the right time. The moment your dream comes true and then evolves into a nightmare because of bad timing. I quit my job because I’m too old for it. It took me 15 years to get the offer. Back then, I was a young celebrity-obsessed wanna be (something) who spent summer nights drenched in anything and everything E! had to offer. I watched every award show that was televised and voraciously devoured the glossies with the hopes that my name would one day appear in the masthead. Those days were hopeful, but they now belong to the girl that I remember fondly but don’t quite connect with anymore. The girl today, is now much older and isn’t nearly as carefree and absorbent as she once was. The things that made her pulse race — are no longer able to surmount that level of excitement. In her youth, she embodied a time when expression of any kind didn’t require multiple levels of validation through the sounds of clicks and the sight of numbers glowing with recognition. She understood the value of the written word and that’s how she was raised and taught, but she didn’t garner the advantage of being shown how to sell those words effectively — through carefully manipulated jargon that can be constantly rearranged and besotted with symbols — that are supposed to label your output as worthy. Of a click. Clicks and stones that formed in my abdomen as I clicked with all my might through the hours of the night and recycled drippings from the machine of aggregated output — forced me to visualize how my younger self would receive this excruciating exercise. She would fit right in. She would enjoy the “grabs” and “pick-ups,” and she would be one of the boldest in the newsroom with her suggestions on how to make the scandalous homepage more enticing without skipping a beat. She would be able to tolerate the shitty hours and the social flow of flows without missing a beat. That beat. That beat passed me by. Surrounded by millennials typing away mercilessly as they produce and schedule their breaking stories — I am acutely aware that I’m comically out of place. I don’t give a damn about anything that is happening around me and I am too exhausted to pretend that I do. They are doing exactly what I wish I had been doing back in 1998 — when I was sending query letters to Honey Magazine, Jane Magazine and the rest of the brood that ruled the scene. As the rejection pile grew and the “no responses” cut deep — I knew that my inability to do what I wanted to do when it mattered most would lead to where I am now. Lost, confused, slightly bitter, envious, embarrassingly overwhelmed, and angry that I am paying a high price for being at the right place at the wrong time. Or maybe it’s the wrong place at the right time. Or maybe I just can’t figure out why I am always constipated and sleepy. So, I quit. I’m not quitting the person I am — I like her just fine. I’m just quitting the quest to resurrect her torment in order to fulfill the dream that died without a proper burial. I am at peace. And so is she. ", "child": "2093_1\t2093_2\t2093_3\t2093_4\t2093_5\t2093_6\t2093_7\t2093_8\t2093_9\t2093_10\t2093_11\t2093_12\t2093_13\t2093_14\t2093_15\t2093_16\t2093_17\t2093_18\t2093_19\t2093_20\t2093_21\t2093_22\t2093_23\t2093_24", "title": "I Quit the Job that I’m Too Old For", "sentences": [{"8262": "I Quit the Job that I’m Too Old For"}, {"9129": "But wanted when I was younger"}, {"277b": "It has happened. The moment when you realize that you are finally slipping into the “mature” category. The moment when millennials show off all the reasons why they were born at the right time. The moment your dream comes true and then evolves into a nightmare because of bad timing."}, {"3e42": "I quit my job because I’m too old for it. It took me 15 years to get the offer."}, {"1c85": "Back then, I was a young celebrity-obsessed wanna be (something) who spent summer nights drenched in anything and everything E! had to offer. I watched every award show that was televised and voraciously devoured the glossies with the hopes that my name would one day appear in the masthead."}, {"e8c9": "Those days were hopeful, but they now belong to the girl that I remember fondly but don’t quite connect with anymore."}, {"f115": "The girl today, is now much older and isn’t nearly as carefree and absorbent as she once was. The things that made her pulse race — are no longer able to surmount that level of excitement. In her youth, she embodied a time when expression of any kind didn’t require multiple levels of validation through the sounds of clicks and the sight of numbers glowing with recognition."}, {"19b6": "She understood the value of the written word and that’s how she was raised and taught, but she didn’t garner the advantage of being shown how to sell those words effectively — through carefully manipulated jargon that can be constantly rearranged and besotted with symbols — that are supposed to label your output as worthy."}, {"5907": "Of a click."}, {"27af": "Clicks and stones that formed in my abdomen as I clicked with all my might through the hours of the night and recycled drippings from the machine of aggregated output — forced me to visualize how my younger self would receive this excruciating exercise."}, {"d03f": "She would fit right in."}, {"1381": "She would enjoy the “grabs” and “pick-ups,” and she would be one of the boldest in the newsroom with her suggestions on how to make the scandalous homepage more enticing without skipping a beat."}, {"2c89": "She would be able to tolerate the shitty hours and the social flow of flows without missing a beat."}, {"4a01": "That beat. That beat passed me by."}, {"dab2": "Surrounded by millennials typing away mercilessly as they produce and schedule their breaking stories — I am acutely aware that I’m comically out of place."}, {"923c": "I don’t give a damn about anything that is happening around me and I am too exhausted to pretend that I do. They are doing exactly what I wish I had been doing back in 1998 — when I was sending query letters to Honey Magazine, Jane Magazine and the rest of the brood that ruled the scene."}, {"1225": "As the rejection pile grew and the “no responses” cut deep — I knew that my inability to do what I wanted to do when it mattered most would lead to where I am now."}, {"0f55": "Lost, confused, slightly bitter, envious, embarrassingly overwhelmed, and angry that I am paying a high price for being at the right place at the wrong time. Or maybe it’s the wrong place at the right time. Or maybe I just can’t figure out why I am always constipated and sleepy."}, {"52d6": "So, I quit."}, {"05b9": "I’m not quitting the person I am — I like her just fine. I’m just quitting the quest to resurrect her torment in order to fulfill the dream that died without a proper burial."}, {"a016": "I am at peace. And so is she."}]}