{"sentences": [{"4131": "Here’s the mask you put over your face"}, {"ad34": "“The darkness folded up and you asked yourself, will it eat me?” — Elena Karina Byrne"}, {"5ba4": "There was a time when you were barefaced, lonely, and all your sorrows were violent. How far will you go to sleep? Everyone said, miming concern. That was the winter where there was no snow only sun, and you walked around the foreign parts with two black umbrellas covering your eyes, because you were in hiding. At home, you decided to write a syllabus for the dark days ahead. Every day had become a Halloween and you had grown accustomed to seeing everyone sport their terrifying masks and multiple costume changes. You can’t remember the last time you wore pants."}, {"706d": "2."}, {"268b": "Send up flares to announce your sadness — we want to know, we want to be there for you, we want to hold your hand, arm, elbow, the sides of your face. Until the flares set everyone’s home aflame and the ash-covered flee to their phones for refuge. They scroll through all the half-life photos — contrast maximized, filter applied, witticisms captured and captioned — until they feel better again. They inventory, survey the damage, and tell you that your sadness bears an expiration date. Yours is a story in three acts and they are children in the sense that they demand their happy endings."}, {"c8eb": "You’re considered brave for being so public with your grief until people ask when you’ll stop being so public with your grief. You are muted, hidden, un-friended until conditions improve, meaning, until you improve. A woman who doesn’t suffer from depression publishes a how-to listicle on battling depression, and her advice boils down to think happy thoughts! Hundreds of replies espouse the benefits of green tea, yoga, breathing outdoors, reiki, spin classes, and meditation. Genius! Why didn’t you think of that? Perhaps you were too busy lying on the bathroom floor, crying, that you neglected to schedule that hot yoga class you can’t afford. And how does “breathing outdoors” work when you spend most of your time consumed with the thought of not breathing? How do you manage the steadiness of your unending unhappiness? Drink green tea!"}, {"205e": "You think, you just might, punch everyone in the face."}, {"6f81": "3."}, {"1b42": "Somehow, you get better and you give everyone the show the peanut-crunching crowd paid to see. You show-pony with glossy photos of your own. Look at the food I am eating! The trips I am taking! The friends who have crawled out of their hiding places because I’m no longer in danger of torching! Everyone seal-claps because you made it through that difficult, temporary, time, and now you’re stitched up, fixed up, properly assembled, returned to manufacturer settings — normal."}, {"f9b9": "4."}, {"399d": "For a time you are happy, your life isn’t a fiction until you realize you’re human and not a machine sold for parts. You do the work — talk therapy, pills, exercise, greens with every meal, and you spend less time in the confines of the home you suspect you can’t afford — but still you are sometimes sad."}, {"4243": "You are upset about your book and the fact that nobody cares about it, but don’t talk about it publicly because it might offend, it might make people uncomfortable, it might paint you in a negative light, ruin your chances of, and so on. You are upset about your career and the fact that it’s not where you expected it to be, but don’t talk about it publicly because you might offend, you might appear ungrateful. You’re permitted to talk about your debt, the never-ending pile of it — that’s an acceptable frustration — but don’t dwell. Speak your woes in the context of humor and be done with it. The one and only time you speak publicly about wanting a great love a stranger sends you a message and tells you that you look good for your age and, as a reward, he wants to fuck your face."}, {"8bd1": "That’s not the kind of great love you had in mind."}, {"1d1d": "You spend most of your life easing the mask off your face only to have people affix it back on when it’s convenient for them. Otherwise, they recede."}, {"7dc4": "5."}, {"1f4e": "You explain to everyone that just because you’re sad doesn’t mean you’re going to swallow a bottle of pills. Expressing an emotion isn’t always a harbinger of the extreme, it’s not always a cry for help — it’s what makes us human. You are human and sometimes you are sad and you draw diagrams to explain that sadness is a spectrum. On a scale of 1–10, 10 being it’s impossible to go on, you can’t go on, last year you were an even 20, but this year you’re possibly a 2 or 3, but all everyone remembers was the torching. They sound their five-alarms and the motley lot race to your house with their pain extinguishers and grief hoses, and you tell them, in the calmest voice you can fathom, that you were cooking steak when you set off the fire alarm. See the charred bits. See all the windows open. The smoke rising from the stove. You were just cooking steak; you hadn’t planned on torching the joint."}, {"a174": "Before they leave they offer advice: maybe it’s best you not cook steak in the house. Have you considered greens? A vegan caesar salad? You add don’t make steak to the list of things people don’t want you to say or do lest it make them feel…uncomfortable. Lest it remind them of the dark country to which you so readily booked passage last year."}, {"76a7": "6."}, {"1163": "After they leave, you fry hamburgers with the windows and doors open, fans on full-blast."}, {"ddc2": "7."}, {"b1be": "When will they allow you to remove this mask from your face, because they are smothering you more than yourself?"}], "child": "2098_1\t2098_2\t2098_3\t2098_4\t2098_5\t2098_6\t2098_7\t2098_8", "parent": "", "title": "Here’s the mask you put over your face", "content": "Here’s the mask you put over your face “The darkness folded up and you asked yourself, will it eat me?” — Elena Karina Byrne There was a time when you were barefaced, lonely, and all your sorrows were violent. How far will you go to sleep? Everyone said, miming concern. That was the winter where there was no snow only sun, and you walked around the foreign parts with two black umbrellas covering your eyes, because you were in hiding. At home, you decided to write a syllabus for the dark days ahead. Every day had become a Halloween and you had grown accustomed to seeing everyone sport their terrifying masks and multiple costume changes. You can’t remember the last time you wore pants. 2. Send up flares to announce your sadness — we want to know, we want to be there for you, we want to hold your hand, arm, elbow, the sides of your face. Until the flares set everyone’s home aflame and the ash-covered flee to their phones for refuge. They scroll through all the half-life photos — contrast maximized, filter applied, witticisms captured and captioned — until they feel better again. They inventory, survey the damage, and tell you that your sadness bears an expiration date. Yours is a story in three acts and they are children in the sense that they demand their happy endings. You’re considered brave for being so public with your grief until people ask when you’ll stop being so public with your grief. You are muted, hidden, un-friended until conditions improve, meaning, until you improve. A woman who doesn’t suffer from depression publishes a how-to listicle on battling depression, and her advice boils down to think happy thoughts! Hundreds of replies espouse the benefits of green tea, yoga, breathing outdoors, reiki, spin classes, and meditation. Genius! Why didn’t you think of that? Perhaps you were too busy lying on the bathroom floor, crying, that you neglected to schedule that hot yoga class you can’t afford. And how does “breathing outdoors” work when you spend most of your time consumed with the thought of not breathing? How do you manage the steadiness of your unending unhappiness? Drink green tea! You think, you just might, punch everyone in the face. 3. Somehow, you get better and you give everyone the show the peanut-crunching crowd paid to see. You show-pony with glossy photos of your own. Look at the food I am eating! The trips I am taking! The friends who have crawled out of their hiding places because I’m no longer in danger of torching! Everyone seal-claps because you made it through that difficult, temporary, time, and now you’re stitched up, fixed up, properly assembled, returned to manufacturer settings — normal. 4. For a time you are happy, your life isn’t a fiction until you realize you’re human and not a machine sold for parts. You do the work — talk therapy, pills, exercise, greens with every meal, and you spend less time in the confines of the home you suspect you can’t afford — but still you are sometimes sad. You are upset about your book and the fact that nobody cares about it, but don’t talk about it publicly because it might offend, it might make people uncomfortable, it might paint you in a negative light, ruin your chances of, and so on. You are upset about your career and the fact that it’s not where you expected it to be, but don’t talk about it publicly because you might offend, you might appear ungrateful. You’re permitted to talk about your debt, the never-ending pile of it — that’s an acceptable frustration — but don’t dwell. Speak your woes in the context of humor and be done with it. The one and only time you speak publicly about wanting a great love a stranger sends you a message and tells you that you look good for your age and, as a reward, he wants to fuck your face. That’s not the kind of great love you had in mind. You spend most of your life easing the mask off your face only to have people affix it back on when it’s convenient for them. Otherwise, they recede. 5. You explain to everyone that just because you’re sad doesn’t mean you’re going to swallow a bottle of pills. Expressing an emotion isn’t always a harbinger of the extreme, it’s not always a cry for help — it’s what makes us human. You are human and sometimes you are sad and you draw diagrams to explain that sadness is a spectrum. On a scale of 1–10, 10 being it’s impossible to go on, you can’t go on, last year you were an even 20, but this year you’re possibly a 2 or 3, but all everyone remembers was the torching. They sound their five-alarms and the motley lot race to your house with their pain extinguishers and grief hoses, and you tell them, in the calmest voice you can fathom, that you were cooking steak when you set off the fire alarm. See the charred bits. See all the windows open. The smoke rising from the stove. You were just cooking steak; you hadn’t planned on torching the joint. Before they leave they offer advice: maybe it’s best you not cook steak in the house. Have you considered greens? A vegan caesar salad? You add don’t make steak to the list of things people don’t want you to say or do lest it make them feel…uncomfortable. Lest it remind them of the dark country to which you so readily booked passage last year. 6. After they leave, you fry hamburgers with the windows and doors open, fans on full-blast. 7. When will they allow you to remove this mask from your face, because they are smothering you more than yourself? ", "name": "2098"}