{"sentences": [{"52bc": "Bloggers are a bunch of self-seeking idiots."}, {"030b": "But first, let me clarify something - I love blogging."}, {"0813": "I think it’s one of the most fulfilling, engaging and self-nurturing things that I’ve ever done in my life. I’ve found the process of creatively developing my own ideas, designs, words and photographs, without any client briefs, deadlines or meetings utterly liberating on a creative level. Having the freedom to write whatever the hell I want, whenever I want, has been beautifully empowering."}, {"1d2b": "During two and a half years of blogging, I’ve written thoughts and feelings that I didn’t realise were inside me. I’ve transcended the world of keen amateur photography to become a professional food photographer. Through attending events and meeting people, I’ve gone back to university, to study a Masters degree in Food Policy. My personal and professional world has changed unreservedly, purely as a result of pursuing blogging."}, {"8214": "Therefore, I believe that blogging as a personal indulgence is a fantastic activity."}, {"6359": "Modus Operandi."}, {"b563": "It’s abundantly clear that people blog for many, many different reasons, so I’ve outlined a few of the key stereotypes for a laugh."}, {"2e6c": "You might think you understand where you sit in these categories, but there’s a good chance you’re completely and utterly wrong. Those who are genuinely amazing probably doubt it and therefore thnk they’re attention seeking. Those who desperately seek followers probably think they’re genuinely amazing, etc etc. As humans, we’re far better at working out other people’s behaviour than our own, that’s why therapy works and is such a good thing. Therefore, the category you sit in, is of little relevance to yourself."}, {"8be2": "All That Bubbly Bollocks."}, {"19fb": "Many bloggers emanate a veneer of feigned positivity, desperate to say the right thing, be the most positive, enthusiastic and emotionally generous person, yet it often looks so utterly superficial. Twitter chats are amazing examples, it’s entertaining to watch people desperately clamour to prove their sparkling authenticity and virtue over everyone else. This is not real life."}, {"eb18": "Likewise, witness the fawning desperation around events, brands and exposure, with a frantic aura of FOMO running so deep that it’s mutated into FONLA (Fear Of Not Looking Amazing). The artificial vignette of perfection appears so delicate that I wouldn’t be surprised if it’s backed up with a heady supply of anti-depressants."}, {"7d49": "Besides, when it comes to events, they are not all AMAZING! They’re not always full of INCREDIBLE brands and it’s not necessarily a group of FANTASTIC people. Sometimes they’re small, even tiny events, with 3 brands in attendance who have nothing to do with your blog. Nonetheless, the feedback about these events always propagates in the realms of awe."}, {"34da": "I feel the blogosphere needs a large injection of reality into it’s bubble-like ecosystem. It encourages people to be superlative about experiences, it promotes unalloyed bubbliness about everything that happens in your life. The unwritten code of blogging suggests that negativity is heresy and I get the impression that some people would rather drown kittens in private, than state negative views, publicly, in a blog or social media post."}, {"ea41": "You’re a bunch of amateurs."}, {"da27": "From the very beginning of blogging I had a fear of being seen as terminally amateur. I was concerned about the perception of bloggers and how the barrier to entry is non-existent, anyone can appear online and have a voice. But simply having a voice is very different to having respect, that’s earned through time, engagement and experience."}, {"32e4": "But there’s a damn good reason why we’re seen as amateurs, it’s because 99% of bloggers are very amateur. I’ve been privy to content submissions to brands, and it can be extraordinarily amateur. Companies receive freebie requests from people whose content has awful photos, spelling mistakes and 23 Twitter followers, thereby projecting the amateur-night credentials of bloggers directly into the world of business. Then bloggers get angry when businesses treat us like the amateurs that we are."}, {"4932": "The catch is that blogging is unique, because it spans a vast range of abilities from nervous, first-time bloggers with good intent, through to free-ride blaggers with bad intent. At one end of the content quality scale, we have bloggers producing highly polished work which happily sits alongside the best of the nation’s established media outlets. At the other end is the blogging equivalent of fake news."}, {"5aff": "Full of Tossers."}, {"7787": "I’d happily get away from the huge levels of fake, superficial, self promoting bullshit that pervades many corners of the blogging world. The turgid body of content that gets vomited through social media on a daily basis is unbearable. As Kip Hakes astutely pointed out last week:"}, {"3369": "Yes, exactly. I wondered why I disliked Twitter at the moment, then I realised that my feed is a 20:1 self-promotion to ‘real’ tweet ratio."}, {"8e65": "Fake Currency."}, {"0c71": "I thence came across a storm in an sponsored-post teacup, all provocated by a company tarring bloggers with the same brush."}, {"0f6f": "“Brands copy us now all the time. They try to do what we did with Cocoa Brown when we initially started…working with bloggers to try and grow their brand. But that game is dead now, there’s absolutely no authenticity left in that business."}, {"c132": "When I started Cocoa Brown bloggers still had credibility…they were telling the truth about the products that they tried. Now, the value of a blogger endorsement is nothing — there are no bad reviews anymore."}, {"e156": "There was an authenticity in the market when we started, you sucked up the bad reviews and delighted in the good reviews but at least it was real.”"}, {"c47b": "Cocoa Brown's Marissa Carter on the death of beauty blogging | Her.ieMarissa Carter was self-employed as a beauty salon owner for almost eight years before launching her hugely popular…www.her.ie"}, {"6d17": "Although Marissa Carter was blunt in her appraisal, not to mention it being a broad, sweeping statement, she had a very good point. Bloggers have become a way to populate cyberspace with a product, rather than being independent critics of the product."}, {"1caf": "Blogging has created so many carrots-on-sticks, that people’s motivation for blogging can be utterly questionable at times. It’s true that the shamelessly self-promoting are least likely to post anything negative, for fear of their life looking anything other than intergalactically opulent or missing out on the next batch of free lippy."}, {"59ac": "The concept of authenticity became a buzzword last year, I distinctly remember a Twatter chit[sic] on authenticity, where bloggers were falling over each other to demonstrate their authentic credentials. The psychological roots of authenticity lay in individuation, the ability you have to align your inner and outer expressions, and to differentiate yourself from social norms. You don’t find your authentic self by taking part in Twitter chats or touting fake tan."}, {"e022": "You’re a Liar."}, {"7716": "The final nail in the coffin of tolerance for bloggers came last night, when I stumbled into the Blogtacular chat, purely by chance, as I closed down my phone for the evening."}, {"c4eb": "I saw the question “What holds you back from being open and honest online?”."}, {"8b02": "My understanding of this question sent shivers down my spine, before I became gripped with moral outrage. I want to break that sentence down into it’s constituent parts so that we can think about it’s meaning."}, {"7d63": "The question is asking what stops us from telling the truth. Therefore, it implies that the default position of a blogger is to lie, because the opposite of honest is dishonest. It doesn’t ask if we are open and honest, it asks why we are NOT open and honest."}, {"796e": "I posted a short, marginally ambiguous answer, before going to bed. I woke up today thinking “fuck that, it’s completely unacceptable”. Why do we exist in a world where it’s assumed that people are not being honest? It’s morally reprehensible."}, {"276a": "Serendipity. Clarity. Truth."}, {"5853": "During a period of unprecedented serendipity this morning, everything I needed to learn from life landed in my lap. Many of them are unrelated to this post, but whilst skimming Medium, I read the following article about sticking to your guns and being your own person."}, {"6cc0": "Build your reputation, but don’t be afraid to destroy it and become notoriousA young man was speaking in front of a group of older businessmen.medium.com"}, {"4a31": "I realised that Chad Grills had hit the massive fucking contradiciton in blogging. The bullshit around authenticity, fame, following and personal development leads people into a corner. Website traffic, followers, brand opportunities, event invites and subject matter can lead bloggers into a path of behaviour which might seem scary to break. If you’re new to blogging, then what else do you have to follow apart from what everyone else is doing? Reading that article made me realise that holding on to my frustrations is utterly pointless, which led me to writing this post."}, {"c4ab": "At the London Bloggers meetup last September, I was interviewed on a Facebook live broadcast, they asked for advice to give to new bloggers. In a moment of pure honesty, I told them to ignore everybody else and do what they love. To forget whatever they’ve seen, read or heard and forge their own path based on their own thoughts and ideas, regardless of whether they think it will be popular or not."}, {"85a9": "If people took that advice, then FONLA would disappear overnight, but it’s become the social norm that’s seen upon entry to blogging, therefore getting perpetuated and turning social media into an even more superficial, unbearable ecosystem."}, {"e33f": "Conversely, the term authenticity is over-used and mis-used, but it really is the one place where genuinely great content is guaranteed. The only problem is that if you don’t already possess authenticity, then finding it is a big undertaking, but one which ultimately, pays for itself many times over. The alignment of inner and outer self is so rewarding, fulfilling and calming, that it’s worth seeking at any cost."}, {"84ec": "That, my friends, is the place that people need to learn to write content from, to make the unbearable parts of the world of blogging bearable once more."}, {"2ca6": "Gavin Wren is a professional food photographer, a food blogger at le petit boeuf, an occasional food writer and a Food Policy MSc student at City, University of London. He talks food on Twitter and his photographs are on Flickr."}], "child": "2099_12099_1", "parent": "", "title": "Bloggers are a bunch of self-seeking idiots.", "content": "Bloggers are a bunch of self-seeking idiots. But first, let me clarify something - I love blogging. I think it’s one of the most fulfilling, engaging and self-nurturing things that I’ve ever done in my life. I’ve found the process of creatively developing my own ideas, designs, words and photographs, without any client briefs, deadlines or meetings utterly liberating on a creative level. Having the freedom to write whatever the hell I want, whenever I want, has been beautifully empowering. During two and a half years of blogging, I’ve written thoughts and feelings that I didn’t realise were inside me. I’ve transcended the world of keen amateur photography to become a professional food photographer. Through attending events and meeting people, I’ve gone back to university, to study a Masters degree in Food Policy. My personal and professional world has changed unreservedly, purely as a result of pursuing blogging. Therefore, I believe that blogging as a personal indulgence is a fantastic activity. Modus Operandi. It’s abundantly clear that people blog for many, many different reasons, so I’ve outlined a few of the key stereotypes for a laugh. You might think you understand where you sit in these categories, but there’s a good chance you’re completely and utterly wrong. Those who are genuinely amazing probably doubt it and therefore thnk they’re attention seeking. Those who desperately seek followers probably think they’re genuinely amazing, etc etc. As humans, we’re far better at working out other people’s behaviour than our own, that’s why therapy works and is such a good thing. Therefore, the category you sit in, is of little relevance to yourself. All That Bubbly Bollocks. Many bloggers emanate a veneer of feigned positivity, desperate to say the right thing, be the most positive, enthusiastic and emotionally generous person, yet it often looks so utterly superficial. Twitter chats are amazing examples, it’s entertaining to watch people desperately clamour to prove their sparkling authenticity and virtue over everyone else. This is not real life. Likewise, witness the fawning desperation around events, brands and exposure, with a frantic aura of FOMO running so deep that it’s mutated into FONLA (Fear Of Not Looking Amazing). The artificial vignette of perfection appears so delicate that I wouldn’t be surprised if it’s backed up with a heady supply of anti-depressants. Besides, when it comes to events, they are not all AMAZING! They’re not always full of INCREDIBLE brands and it’s not necessarily a group of FANTASTIC people. Sometimes they’re small, even tiny events, with 3 brands in attendance who have nothing to do with your blog. Nonetheless, the feedback about these events always propagates in the realms of awe. I feel the blogosphere needs a large injection of reality into it’s bubble-like ecosystem. It encourages people to be superlative about experiences, it promotes unalloyed bubbliness about everything that happens in your life. The unwritten code of blogging suggests that negativity is heresy and I get the impression that some people would rather drown kittens in private, than state negative views, publicly, in a blog or social media post. You’re a bunch of amateurs. From the very beginning of blogging I had a fear of being seen as terminally amateur. I was concerned about the perception of bloggers and how the barrier to entry is non-existent, anyone can appear online and have a voice. But simply having a voice is very different to having respect, that’s earned through time, engagement and experience. But there’s a damn good reason why we’re seen as amateurs, it’s because 99% of bloggers are very amateur. I’ve been privy to content submissions to brands, and it can be extraordinarily amateur. Companies receive freebie requests from people whose content has awful photos, spelling mistakes and 23 Twitter followers, thereby projecting the amateur-night credentials of bloggers directly into the world of business. Then bloggers get angry when businesses treat us like the amateurs that we are. The catch is that blogging is unique, because it spans a vast range of abilities from nervous, first-time bloggers with good intent, through to free-ride blaggers with bad intent. At one end of the content quality scale, we have bloggers producing highly polished work which happily sits alongside the best of the nation’s established media outlets. At the other end is the blogging equivalent of fake news. Full of Tossers. I’d happily get away from the huge levels of fake, superficial, self promoting bullshit that pervades many corners of the blogging world. The turgid body of content that gets vomited through social media on a daily basis is unbearable. As Kip Hakes astutely pointed out last week: Yes, exactly. I wondered why I disliked Twitter at the moment, then I realised that my feed is a 20:1 self-promotion to ‘real’ tweet ratio. Fake Currency. I thence came across a storm in an sponsored-post teacup, all provocated by a company tarring bloggers with the same brush. “Brands copy us now all the time. They try to do what we did with Cocoa Brown when we initially started…working with bloggers to try and grow their brand. But that game is dead now, there’s absolutely no authenticity left in that business. When I started Cocoa Brown bloggers still had credibility…they were telling the truth about the products that they tried. Now, the value of a blogger endorsement is nothing — there are no bad reviews anymore. There was an authenticity in the market when we started, you sucked up the bad reviews and delighted in the good reviews but at least it was real.” Cocoa Brown's Marissa Carter on the death of beauty blogging | Her.ieMarissa Carter was self-employed as a beauty salon owner for almost eight years before launching her hugely popular…www.her.ie Although Marissa Carter was blunt in her appraisal, not to mention it being a broad, sweeping statement, she had a very good point. Bloggers have become a way to populate cyberspace with a product, rather than being independent critics of the product. Blogging has created so many carrots-on-sticks, that people’s motivation for blogging can be utterly questionable at times. It’s true that the shamelessly self-promoting are least likely to post anything negative, for fear of their life looking anything other than intergalactically opulent or missing out on the next batch of free lippy. The concept of authenticity became a buzzword last year, I distinctly remember a Twatter chit[sic] on authenticity, where bloggers were falling over each other to demonstrate their authentic credentials. The psychological roots of authenticity lay in individuation, the ability you have to align your inner and outer expressions, and to differentiate yourself from social norms. You don’t find your authentic self by taking part in Twitter chats or touting fake tan. You’re a Liar. The final nail in the coffin of tolerance for bloggers came last night, when I stumbled into the Blogtacular chat, purely by chance, as I closed down my phone for the evening. I saw the question “What holds you back from being open and honest online?”. My understanding of this question sent shivers down my spine, before I became gripped with moral outrage. I want to break that sentence down into it’s constituent parts so that we can think about it’s meaning. The question is asking what stops us from telling the truth. Therefore, it implies that the default position of a blogger is to lie, because the opposite of honest is dishonest. It doesn’t ask if we are open and honest, it asks why we are NOT open and honest. I posted a short, marginally ambiguous answer, before going to bed. I woke up today thinking “fuck that, it’s completely unacceptable”. Why do we exist in a world where it’s assumed that people are not being honest? It’s morally reprehensible. Serendipity. Clarity. Truth. During a period of unprecedented serendipity this morning, everything I needed to learn from life landed in my lap. Many of them are unrelated to this post, but whilst skimming Medium, I read the following article about sticking to your guns and being your own person. Build your reputation, but don’t be afraid to destroy it and become notoriousA young man was speaking in front of a group of older businessmen.medium.com I realised that Chad Grills had hit the massive fucking contradiciton in blogging. The bullshit around authenticity, fame, following and personal development leads people into a corner. Website traffic, followers, brand opportunities, event invites and subject matter can lead bloggers into a path of behaviour which might seem scary to break. If you’re new to blogging, then what else do you have to follow apart from what everyone else is doing? Reading that article made me realise that holding on to my frustrations is utterly pointless, which led me to writing this post. At the London Bloggers meetup last September, I was interviewed on a Facebook live broadcast, they asked for advice to give to new bloggers. In a moment of pure honesty, I told them to ignore everybody else and do what they love. To forget whatever they’ve seen, read or heard and forge their own path based on their own thoughts and ideas, regardless of whether they think it will be popular or not. If people took that advice, then FONLA would disappear overnight, but it’s become the social norm that’s seen upon entry to blogging, therefore getting perpetuated and turning social media into an even more superficial, unbearable ecosystem. Conversely, the term authenticity is over-used and mis-used, but it really is the one place where genuinely great content is guaranteed. The only problem is that if you don’t already possess authenticity, then finding it is a big undertaking, but one which ultimately, pays for itself many times over. The alignment of inner and outer self is so rewarding, fulfilling and calming, that it’s worth seeking at any cost. That, my friends, is the place that people need to learn to write content from, to make the unbearable parts of the world of blogging bearable once more. Gavin Wren is a professional food photographer, a food blogger at le petit boeuf, an occasional food writer and a Food Policy MSc student at City, University of London. He talks food on Twitter and his photographs are on Flickr. ", "name": "2099"}