{"sentences": [{"5b70": "Why Self Love is Difficult and How to Make a Powerful Change"}, {"def5": "This month I’ve decided to tackle self love once and for all. I started the book Learning to Love Yourself by Gay Hendricks Ph.D. on my Kindle and haven’t looked back. The last couple weeks I’ve struggled with feeling worthy enough and lovable. I’ve allowed negativity and insecurities to create a cloud over me."}, {"f833": "The right books come into my life at exactly the right time. God’s way of communicating to me and helping me. Now let’s get to the reason why you’re most likely here: Why is loving yourself so difficult?"}, {"1ed7": "Why Self Love is Difficult"}, {"7f2b": "The antithesis to transformation is resistance which “keeps life painful and complicated”. Hendricks goes on to say, “It seemed like my whole life was one big resistance: against my feelings, against love, against my own energy and potential.”"}, {"4f91": "Once he recognized this resistance he decided to stop resisting. His transformation started with a choice and willingness to accept what he couldn’t before. “When I dropped my stance of resistance, I felt totally connected to myself.”"}, {"7f65": "Download my affirmation card freebie to start cultivating better habits today."}, {"33a5": "There are two things which happen when we resist experiencing our life:"}, {"585d": "Resisting Our Experience"}, {"f307": "When we resist our experience we lose our direct relationship with life. Our personal experience IS a direct response to life. If we resist experiencing, by blocking or ignoring emotions, we only see life “through the fog of our beliefs, opinions, and conditioned responses.”"}, {"3f17": "This hit so close to home for me. I often felt like I was looking in on the world from the outside. I felt detached from my life in my early twenties. Emotions were scary. Learning from others’ mistakes and keeping a safe distance was easier. Rather than vulnerability I chose protection."}, {"2ee2": "Reading this section of the book made sense. We resist experiencing our own life and therefore see life through a fog and limited lens of beliefs and opinions which we create."}, {"90ce": "Dramatizing Our Experience"}, {"200b": "If we don’t allow ourselves to feel deeply the emotions we have then we tend to fantasize. An example Hendricks gives is if someone resists experiencing deeply their sexual feelings the person may “fantasize about sex, flirting, worrying about sex, and forming beliefs about sex”"}, {"b442": "Perhaps this provides a release for some or feels like experience without attached consequence. Either way it’s an effect of resisting emotions."}, {"361e": "Stopping Resistance is a Decision"}, {"91b3": "Most of you instinctively know how to stop resisting. But choosing to start experiencing your life is still difficult enough that people are “content to live in the world of non-experience of drama, of shadow.”"}, {"8d44": "Here are some ways you can start truly experiencing your life:"}, {"a9c4": "Before actually bolting, I noticed how much I was resisting my emotions. So I took a breath and told myself “You’re freaking out because this is hard. It’s supposed to be at first. But you can do this and if you can’t? So what. Nothing physically will happen to you. Keep going, learn another part of German that’s a bit easier, and come back to this section another time.”"}, {"fbaf": "As soon as I said this my mind completely cleared and I was once again present. Peace replaced tension. I became aligned with reality and was able to finish class with joy and peace."}, {"8d92": "Guess what? Those same students started shutting down and struggling on something I thought was really easy towards the end of class. I realized that learning is relative. Everyone struggles at some point."}, {"7b64": "As I continue with the book I’m sure more posts will come but for now this is a great start. Take time to recognize how you stop yourself from experiencing life, commit to being willing to love yourself, then practice those three points above throughout the week. Even if you choose one moment to practice on that’s a great start."}, {"a517": "If you enjoyed my post please hit the heart button below ❤."}, {"1560": "At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that."}], "child": "2110_1\t2110_22110_1\t2110_22110_1\t2110_2", "parent": "", "title": "Why Self Love is Difficult and How to Make a Powerful Change", "content": "Why Self Love is Difficult and How to Make a Powerful Change This month I’ve decided to tackle self love once and for all. I started the book Learning to Love Yourself by Gay Hendricks Ph.D. on my Kindle and haven’t looked back. The last couple weeks I’ve struggled with feeling worthy enough and lovable. I’ve allowed negativity and insecurities to create a cloud over me. The right books come into my life at exactly the right time. God’s way of communicating to me and helping me. Now let’s get to the reason why you’re most likely here: Why is loving yourself so difficult? Why Self Love is Difficult The antithesis to transformation is resistance which “keeps life painful and complicated”. Hendricks goes on to say, “It seemed like my whole life was one big resistance: against my feelings, against love, against my own energy and potential.” Once he recognized this resistance he decided to stop resisting. His transformation started with a choice and willingness to accept what he couldn’t before. “When I dropped my stance of resistance, I felt totally connected to myself.” Download my affirmation card freebie to start cultivating better habits today. There are two things which happen when we resist experiencing our life: Resisting Our Experience When we resist our experience we lose our direct relationship with life. Our personal experience IS a direct response to life. If we resist experiencing, by blocking or ignoring emotions, we only see life “through the fog of our beliefs, opinions, and conditioned responses.” This hit so close to home for me. I often felt like I was looking in on the world from the outside. I felt detached from my life in my early twenties. Emotions were scary. Learning from others’ mistakes and keeping a safe distance was easier. Rather than vulnerability I chose protection. Reading this section of the book made sense. We resist experiencing our own life and therefore see life through a fog and limited lens of beliefs and opinions which we create. Dramatizing Our Experience If we don’t allow ourselves to feel deeply the emotions we have then we tend to fantasize. An example Hendricks gives is if someone resists experiencing deeply their sexual feelings the person may “fantasize about sex, flirting, worrying about sex, and forming beliefs about sex” Perhaps this provides a release for some or feels like experience without attached consequence. Either way it’s an effect of resisting emotions. Stopping Resistance is a Decision Most of you instinctively know how to stop resisting. But choosing to start experiencing your life is still difficult enough that people are “content to live in the world of non-experience of drama, of shadow.” Here are some ways you can start truly experiencing your life: Before actually bolting, I noticed how much I was resisting my emotions. So I took a breath and told myself “You’re freaking out because this is hard. It’s supposed to be at first. But you can do this and if you can’t? So what. Nothing physically will happen to you. Keep going, learn another part of German that’s a bit easier, and come back to this section another time.” As soon as I said this my mind completely cleared and I was once again present. Peace replaced tension. I became aligned with reality and was able to finish class with joy and peace. Guess what? Those same students started shutting down and struggling on something I thought was really easy towards the end of class. I realized that learning is relative. Everyone struggles at some point. As I continue with the book I’m sure more posts will come but for now this is a great start. Take time to recognize how you stop yourself from experiencing life, commit to being willing to love yourself, then practice those three points above throughout the week. Even if you choose one moment to practice on that’s a great start. If you enjoyed my post please hit the heart button below ❤. At the Writing Cooperative, our mission is to help each other write better. We’ve teamed up with ProWritingAid to do just that. ", "name": "2110"}