{"sentences": [{"a1b9": "Why You Should Meditate For No Reason"}, {"ecb2": "Hokusai"}, {"ddcc": "I saw another article this morning titled something like “How Meditation Makes You More Bad-Ass”. It was written in the usual sort of saccharine aspirational ‘hell yeah!’ rhetoric that sometimes makes me feel embarrassed to be a millennial. I’ve spent almost ten years now reading about meditation alongside actually practicing, and I’d like to clear the air a bit about what meditation is and why you shouldn’t be misled by things like this."}, {"7cd3": "Ok, long story short: modern society developed out of the ashes of feudal/religious society. A new secular class of money-managers emerged to take the place of the old church-and-state managers. This modern society’s priorities, especially in the West, are individualism, materialism and productivity, as opposed to piety, collectivism and submission to social hierarchy. The particular problems of our era (neurosis, anxiety, depression, addiction, stress, overwork, aestheticized violence, sexual promiscuity, class warfare, etc) are not exclusively age-old human problems but also age-specific bugs emerging from the software of a hyper-accelerated modern life. These problems are as atomized as society itself and impact everyone slightly differently. Regardless, they impact any person who doesn’t live in a cave, and maybe even some who do."}, {"4637": "Every society in human history has found spiritual methods of coping with the difficulties of its era, some more eccentric than others. Life is hard, and it’s even harder when we don’t try to invent some sort of framework for meaning and value. This could mean strict puritanical values of old, or the similarly puritanical (albeit more open-ended) progressive values of the 20th century. Today’s problems are pressing. We live in an increasingly virtual world in which intimacy, spirituality and work are all filtered through a purely material/digital lens. This makes us feel more alienated than ever. And, like past human epochs, the mobile upper classes are not saved from this alienation. Everyone gets a taste. The reality of life, all its sufferings and confusions, cannot be abated by the Grand March Towards Progress (social, material, technological, or otherwise) any more than Luther or Calvin were able to make everyone go to heaven. The pursuit of happiness won’t make us happy in the same way that Newton was unable to invent anti-gravity."}, {"5806": "Enter stage left: meditation. Meditation first emerged in the West in the early 20th-century, when small groups of esotericists, academics and other weirdos began traveling Eastward and absorbing whatever cultural traditions they liked most. Meditation became more mainstream in the 50’s and 60’s with figures like DT Suzuki and Alan Watts, who understood that Eastern immaterial consciousness (specifically Zen) was a framework of anti-thought that could directly combat the problems of an overthinking and unrealistic modernity. The problem with these popular figures, though, was that they talked a lot about Zen without meditating. Suzuki barely ever spoke about Zazen, and Watts didn’t view it as being particularly important."}, {"5308": "I’ve lately been going back and reading through the great Zen master Dogen, who all the way back in the 1200’s was able to articulate how sitting in Zazen every day helps us transcend materialism and idealism and exist in the purity of each moment. He reminds us that the little daily tasks of life are all we have; they’re not steps to grand achievements. I find these texts brilliantly salient today, when every activity seems to be intended as a stepping stone to something else. This constant desire to be somewhere else or in some moment other than now is what defines our collective anxiety and sense of meaninglessness. We have robbed life of its moment-by-moment meaning and yet are confused about why it feels so vacant!"}, {"079c": "Meditation may make you more “bad-ass”, but not if you use it as a bridge between you and “bad-ass” ness. It may help you self-actualize, have a great idea for a book, learn how to love, make a lot of money, think of your new start up, or whatever the hell else. But this is not the purpose of meditation. If we approach meditation from the goal-oriented perspective of this cancerous money-obsessed era, we will fail every time. The key is to be patient with yourself as you understand the nuance of why meditation is ‘useful’."}, {"4511": "And so, good reader, I implore you: meditate to meditate. Do it every day. Like a good worker, do it without any expectation of reward. Think of it as charity to yourself. Remain consistent and confident in yourself. Let yourself make mistakes. Let yourself be uncomfortable or even pained at times. Let everything wash over you. Just make sure you do it every day and keep your expectations as low as you can. Don’t believe the hype, because the hype will prevent you from completely transcending the pettiness of material life. This is the value of meditation, and it’s difficult to explain to you until you just sit and do it for a while. It’s very simple. Just do it!"}], "child": "2111_1\t2111_2\t2111_3\t2111_4\t2111_5\t2111_6\t2111_7\t2111_8\t2111_9\t2111_10\t2111_11\t2111_12\t2111_13\t2111_14", "parent": "", "title": "Why You Should Meditate For No Reason", "content": "Why You Should Meditate For No Reason Hokusai I saw another article this morning titled something like “How Meditation Makes You More Bad-Ass”. It was written in the usual sort of saccharine aspirational ‘hell yeah!’ rhetoric that sometimes makes me feel embarrassed to be a millennial. I’ve spent almost ten years now reading about meditation alongside actually practicing, and I’d like to clear the air a bit about what meditation is and why you shouldn’t be misled by things like this. Ok, long story short: modern society developed out of the ashes of feudal/religious society. A new secular class of money-managers emerged to take the place of the old church-and-state managers. This modern society’s priorities, especially in the West, are individualism, materialism and productivity, as opposed to piety, collectivism and submission to social hierarchy. The particular problems of our era (neurosis, anxiety, depression, addiction, stress, overwork, aestheticized violence, sexual promiscuity, class warfare, etc) are not exclusively age-old human problems but also age-specific bugs emerging from the software of a hyper-accelerated modern life. These problems are as atomized as society itself and impact everyone slightly differently. Regardless, they impact any person who doesn’t live in a cave, and maybe even some who do. Every society in human history has found spiritual methods of coping with the difficulties of its era, some more eccentric than others. Life is hard, and it’s even harder when we don’t try to invent some sort of framework for meaning and value. This could mean strict puritanical values of old, or the similarly puritanical (albeit more open-ended) progressive values of the 20th century. Today’s problems are pressing. We live in an increasingly virtual world in which intimacy, spirituality and work are all filtered through a purely material/digital lens. This makes us feel more alienated than ever. And, like past human epochs, the mobile upper classes are not saved from this alienation. Everyone gets a taste. The reality of life, all its sufferings and confusions, cannot be abated by the Grand March Towards Progress (social, material, technological, or otherwise) any more than Luther or Calvin were able to make everyone go to heaven. The pursuit of happiness won’t make us happy in the same way that Newton was unable to invent anti-gravity. Enter stage left: meditation. Meditation first emerged in the West in the early 20th-century, when small groups of esotericists, academics and other weirdos began traveling Eastward and absorbing whatever cultural traditions they liked most. Meditation became more mainstream in the 50’s and 60’s with figures like DT Suzuki and Alan Watts, who understood that Eastern immaterial consciousness (specifically Zen) was a framework of anti-thought that could directly combat the problems of an overthinking and unrealistic modernity. The problem with these popular figures, though, was that they talked a lot about Zen without meditating. Suzuki barely ever spoke about Zazen, and Watts didn’t view it as being particularly important. I’ve lately been going back and reading through the great Zen master Dogen, who all the way back in the 1200’s was able to articulate how sitting in Zazen every day helps us transcend materialism and idealism and exist in the purity of each moment. He reminds us that the little daily tasks of life are all we have; they’re not steps to grand achievements. I find these texts brilliantly salient today, when every activity seems to be intended as a stepping stone to something else. This constant desire to be somewhere else or in some moment other than now is what defines our collective anxiety and sense of meaninglessness. We have robbed life of its moment-by-moment meaning and yet are confused about why it feels so vacant! Meditation may make you more “bad-ass”, but not if you use it as a bridge between you and “bad-ass” ness. It may help you self-actualize, have a great idea for a book, learn how to love, make a lot of money, think of your new start up, or whatever the hell else. But this is not the purpose of meditation. If we approach meditation from the goal-oriented perspective of this cancerous money-obsessed era, we will fail every time. The key is to be patient with yourself as you understand the nuance of why meditation is ‘useful’. And so, good reader, I implore you: meditate to meditate. Do it every day. Like a good worker, do it without any expectation of reward. Think of it as charity to yourself. Remain consistent and confident in yourself. Let yourself make mistakes. Let yourself be uncomfortable or even pained at times. Let everything wash over you. Just make sure you do it every day and keep your expectations as low as you can. Don’t believe the hype, because the hype will prevent you from completely transcending the pettiness of material life. This is the value of meditation, and it’s difficult to explain to you until you just sit and do it for a while. It’s very simple. Just do it! ", "name": "2111"}