{"sentences": [{"c16f": "Why Achieving Balance is Smoking Hot BS"}, {"eb37": "Actually this kind of balance is amazeballs, but seriously work/life balance is BS. Join the revolution."}, {"f23c": "I was raised as a girl and I identify as a woman. That means for a good portion (ie: ALL OF IT) of my life I have been told to pursue balance. Work/Life Balance, Family/Work Balance, Nice Girl/Bitch Balance, Weight Loss/ Weight Gain Balance."}, {"b21f": "Media, friends, family, Hollywood — major contributors to a set of beliefs that women CAN have it all. A successful career, a brood of happy children and a sexually satisfied husband."}, {"64b3": "So we spend our lives reading soul sucking savoury articles on how to do it all with time-saving tricks and sneaky tips so no one knows the struggle is real."}, {"b054": "And it feels impossible. Over and over again. Impossible. Because they keep putting out more and more articles, shows and excerpts about the struggle and how the woman gets through it. We only know the struggle. We are told it NEEDS to be a struggle. We’re told to be exhausted so we can practice self-care."}, {"47a9": "But all that does is perpetuate the idea that we need balance. Don’t sell me your capitalist balance!"}, {"7393": "Can someone even tell me how we measure balance? How do we know we HAVE balance? Does someone write a magazine article about us and how we managed to achieve it?"}, {"bfbf": "We’ve seen a few quotes from Elizabeth Gilbert and Sheryl Sandberg about balance being a myth but they come at it from the point of view that it’s unattainable."}, {"9a9d": "I think it doesn’t exist at all. But joy and happiness does. So what can we strive for? Wholeness. Learn to just BE. Because whether we are at home, at work, at play, alone and with others — we are whole. We don’t need to sacrifice or split ourselves into different roles. We must insist on being ourselves."}, {"9bc6": "Enjoying all the moments we have. Thanking each experience with our families, our co-workers and yes, even the challenging moments for coming to us. If we worry that someone is judging us for our decisions, drop that ish like a hot potato because, friends, we do not have time for this. The time we spend worrying about others think about us is better served doing the things we love — like naps, ice cream, creating, having orgasms and running the world."}, {"73d2": "If someone gives you unsolicited feedback about your work, life, kids or relationships — tell them it’s unsolicited and while you value feedback, you’re only available for it when you damn well feel like it. Give them feedback on their feedback. I don’t like to spend a lot of time on that so it mostly looks like my middle finger pointing to the sky — where all my rhymes-with-ducks are currently stored."}, {"df6c": "Create healthy boundaries. Say no when you don’t want to do something. Say yes when it feels so good it scares you. And above all, fight for your right to be."}], "child": "2112_1\t2112_2\t2112_3\t2112_4", "parent": "", "title": "Why Achieving Balance is Smoking Hot BS", "content": "Why Achieving Balance is Smoking Hot BS Actually this kind of balance is amazeballs, but seriously work/life balance is BS. Join the revolution. I was raised as a girl and I identify as a woman. That means for a good portion (ie: ALL OF IT) of my life I have been told to pursue balance. Work/Life Balance, Family/Work Balance, Nice Girl/Bitch Balance, Weight Loss/ Weight Gain Balance. Media, friends, family, Hollywood — major contributors to a set of beliefs that women CAN have it all. A successful career, a brood of happy children and a sexually satisfied husband. So we spend our lives reading soul sucking savoury articles on how to do it all with time-saving tricks and sneaky tips so no one knows the struggle is real. And it feels impossible. Over and over again. Impossible. Because they keep putting out more and more articles, shows and excerpts about the struggle and how the woman gets through it. We only know the struggle. We are told it NEEDS to be a struggle. We’re told to be exhausted so we can practice self-care. But all that does is perpetuate the idea that we need balance. Don’t sell me your capitalist balance! Can someone even tell me how we measure balance? How do we know we HAVE balance? Does someone write a magazine article about us and how we managed to achieve it? We’ve seen a few quotes from Elizabeth Gilbert and Sheryl Sandberg about balance being a myth but they come at it from the point of view that it’s unattainable. I think it doesn’t exist at all. But joy and happiness does. So what can we strive for? Wholeness. Learn to just BE. Because whether we are at home, at work, at play, alone and with others — we are whole. We don’t need to sacrifice or split ourselves into different roles. We must insist on being ourselves. Enjoying all the moments we have. Thanking each experience with our families, our co-workers and yes, even the challenging moments for coming to us. If we worry that someone is judging us for our decisions, drop that ish like a hot potato because, friends, we do not have time for this. The time we spend worrying about others think about us is better served doing the things we love — like naps, ice cream, creating, having orgasms and running the world. If someone gives you unsolicited feedback about your work, life, kids or relationships — tell them it’s unsolicited and while you value feedback, you’re only available for it when you damn well feel like it. Give them feedback on their feedback. I don’t like to spend a lot of time on that so it mostly looks like my middle finger pointing to the sky — where all my rhymes-with-ducks are currently stored. Create healthy boundaries. Say no when you don’t want to do something. Say yes when it feels so good it scares you. And above all, fight for your right to be. ", "name": "2112"}