{"sentences": [{"9048": "Butter Notes…"}, {"3800": "Miles Davis told a young Herbie Hancock, “Don’t Blay the Butter Notes!” Herbie assumed Miles meant not to play the obvious notes and this sparked the opening of a gateway of harmonic resonance that soothed many souls. While Miles never explained what he intended, clearly the interpretation by Herbie moved things along."}, {"6d14": "This message reinforces and uplifts my spirits at the beginning of this day, as I know without humps, there will be no getting over (ala Dr. George Clinton). To be reminded that the easy way may give a result, but as my desire is to maximize the outcomes of all engagements, this reminder is a blessing indeed."}, {"42e6": "A host of other kernels of wisdom come forward such as “look before you leap” rise up to follow the “Butter Notes” reminders….followed by “listen before you speak,” “do what you have to do, but after you do your do — don’t wipe with tee pee, as that is an original house on the prairie,” ending with “Don’t Shine Before Your Time” all become mini-mantras and touchstones throughout my days."}, {"f87c": "My bottom line is to be mindful of my steps as even on my tip-toes, I can still break a vase."}, {"7f86": "Glory Holler — t’noD Stop!"}], "child": "2116_1", "parent": "", "title": "Butter Notes…", "content": "Butter Notes… Miles Davis told a young Herbie Hancock, “Don’t Blay the Butter Notes!” Herbie assumed Miles meant not to play the obvious notes and this sparked the opening of a gateway of harmonic resonance that soothed many souls. While Miles never explained what he intended, clearly the interpretation by Herbie moved things along. This message reinforces and uplifts my spirits at the beginning of this day, as I know without humps, there will be no getting over (ala Dr. George Clinton). To be reminded that the easy way may give a result, but as my desire is to maximize the outcomes of all engagements, this reminder is a blessing indeed. A host of other kernels of wisdom come forward such as “look before you leap” rise up to follow the “Butter Notes” reminders….followed by “listen before you speak,” “do what you have to do, but after you do your do — don’t wipe with tee pee, as that is an original house on the prairie,” ending with “Don’t Shine Before Your Time” all become mini-mantras and touchstones throughout my days. My bottom line is to be mindful of my steps as even on my tip-toes, I can still break a vase. Glory Holler — t’noD Stop! ", "name": "2116"}