{"name": "212", "parent": "", "content": "Looking American can be cool. Fashion Week and Human Weakness How I Learned my Lesson Okay, I will grant that I knew I was going to Milan, one of the world’s major fashion centers. I could only bring one suitcase, and every article of clothing in it was wrong. The harder I tried, the worse it got. I just didn’t have the money or the chops to play in the big leagues. I worked in the field of architecture and design, so dress was pretty laid back. In Milan, that means impeccable threads, meticulously pressed, luxuriously shod. The guy in the chinos and the rolled up shirtsleeves in $500 loafers, worn around the edges, I had been fashion-embarrassed before in New York, but this was worse. Not exactly a melting pot. The first time I went to a social gathering I was really worried about what to wear, but I pulled together something that to me seemed acceptable. I don’t remember where it was or who was there; just that the host opened the door and her eyes dropped down to my shoes. Egad! It’s the shoes. Now, I was making very little money at the time, but every bit of cash I could spare went into the purchase of shoes. I bought one black dress, which I wore every time I got invited someplace like La Scala, and tried my best to be a discreet presence. I wonder now why I found this culture of fashion “language” so incredibly intimidating. I was clearly not wealthy, and they knew it, but I suffered anyway. I didn’t want to stand out as a philistine. Then I met Marietta. I was doing a stint at a communications firm, and she was our PR consultant. She breezed into the office, tall and tan and somewhat Amazonic, with blue eyes and long, curly, golden hair like a figure in a Renaissance painting. She was in her late thirties, a bit seasoned by life, and showed a few wrinkles on her lightly freckled face. She was more striking and powerful looking than beautiful, but I was completely intimidated by her. One day Marietta would show up in a short black evening dress, cut low in the back. She would be leaning over someone’s desk, looking onto their computer screen as if there was nothing unusual about it. Later that week, she showed up in jeans, a western shirt, and cowboy boots. Still looked like Marietta! Once I got to know her, I saw that she was a sensitive, vulnerable woman, insecure about most everything except her social standing. She absolutely didn’t care what anyone thought about the way she looked. One day I told her that I was fascinated by the way she dressed: explain. She told me that she had no “work” clothes; she simply dressed for the most important thing she was doing that day. Whatever else was going on had nothing to do with the persona she decided to assume to partake of the day’s main event. I thought it was brilliant, and it made me feel stupidly liberated. All that time, I could have worn black jeans, T-shirts, and high tops, and everyone would have seen me for what I was; they might even have envied the way I nailed the New York intellectual style. The most important thing I was doing was being an American in Milan. ", "title": "Fashion Week and Human Weakness", "sentences": [{"f10c": "Looking American can be cool."}, {"f1d1": "Fashion Week and Human Weakness"}, {"b530": "How I Learned my Lesson"}, {"60c3": "Okay, I will grant that I knew I was going to Milan, one of the world’s major fashion centers. I could only bring one suitcase, and every article of clothing in it was wrong. The harder I tried, the worse it got. I just didn’t have the money or the chops to play in the big leagues."}, {"a853": "I worked in the field of architecture and design, so dress was pretty laid back. In Milan, that means impeccable threads, meticulously pressed, luxuriously shod. The guy in the chinos and the rolled up shirtsleeves in $500 loafers, worn around the edges, I had been fashion-embarrassed before in New York, but this was worse. Not exactly a melting pot."}, {"1fa1": "The first time I went to a social gathering I was really worried about what to wear, but I pulled together something that to me seemed acceptable. I don’t remember where it was or who was there; just that the host opened the door and her eyes dropped down to my shoes. Egad! It’s the shoes."}, {"7689": "Now, I was making very little money at the time, but every bit of cash I could spare went into the purchase of shoes. I bought one black dress, which I wore every time I got invited someplace like La Scala, and tried my best to be a discreet presence."}, {"d275": "I wonder now why I found this culture of fashion “language” so incredibly intimidating. I was clearly not wealthy, and they knew it, but I suffered anyway. I didn’t want to stand out as a philistine."}, {"b72e": "Then I met Marietta. I was doing a stint at a communications firm, and she was our PR consultant. She breezed into the office, tall and tan and somewhat Amazonic, with blue eyes and long, curly, golden hair like a figure in a Renaissance painting. She was in her late thirties, a bit seasoned by life, and showed a few wrinkles on her lightly freckled face. She was more striking and powerful looking than beautiful, but I was completely intimidated by her."}, {"7059": "One day Marietta would show up in a short black evening dress, cut low in the back. She would be leaning over someone’s desk, looking onto their computer screen as if there was nothing unusual about it. Later that week, she showed up in jeans, a western shirt, and cowboy boots. Still looked like Marietta! Once I got to know her, I saw that she was a sensitive, vulnerable woman, insecure about most everything except her social standing. She absolutely didn’t care what anyone thought about the way she looked. One day I told her that I was fascinated by the way she dressed: explain. She told me that she had no “work” clothes; she simply dressed for the most important thing she was doing that day. Whatever else was going on had nothing to do with the persona she decided to assume to partake of the day’s main event. I thought it was brilliant, and it made me feel stupidly liberated."}, {"7f63": "All that time, I could have worn black jeans, T-shirts, and high tops, and everyone would have seen me for what I was; they might even have envied the way I nailed the New York intellectual style. The most important thing I was doing was being an American in Milan."}], "child": "212_1\t212_2"}