{"name": "213", "parent": "", "content": "When They Stop Your Heart, It Tends To Focus The Mind By: John P. Weiss The emergency room doctor looked squarely into my eyes. She was calm and focused. I spied the syringe in her right hand. Next to her was a nurse. The nurse was holding a syringe of her own. “This can’t be good,” I thought to myself. “John, I’m going to give you an injection and you might feel a slight flutter in your chest. Try to relax.” The doctor meant to reassure me. I tried to relax. No luck. There was an IV slipped into the antecubital area of my arm. That’s the part of your arm that folds inward, opposite the elbow. The doctor then attached the syringe to the IV, delivering the medicine. No pain, but I definitely felt the “flutter” in my chest. At the time, I didn’t understand what was happening. Which was good. Because the doctor just stopped my heart. The jujitsu injury Before the ambulance arrived and rushed me off to the ER, I was participating in a martial arts demonstration. The instructor selected me for the demo because I was a brown belt, which is just below black belt. Sounds impressive, but mostly it meant that I was the “attacker.” The “attacker” is the one the instructor gets to throw around like a rag doll. The jujitsu I trained in was a hard style. Lots of grappling, throws, flips and such. Somewhere in the middle of the demo the instructor performed a dynamic throw. Down I went, into what I thought was a beautifully executed fall. But when I got up, something was wrong. I felt these consistent palpitations in my chest. Nothing like a heart attack, but alarming none the less. One of my fellow students was a doctor and immediately read my behavior. “You okay?” he asked. I told him what I was experiencing. He had me sit down and tried a few tricks, to no avail. Then he said, “I think you’re having SVT. We should run you over to the hospital to straighten that out.” Calm before the storm Don’t you just love doctors? So calm. So unflappable. I’m in the throws of SVT (super ventricular tachycardia) and my doctor buddy suggests I pop over to the ER. Get things “straightened” out. Like I’m going to a hair appointment! But I have to admit, his calm reassurance kept me from panicking. Someone called the ambulance and the EMT’s arrived in short order. I was seated on the dojo floor with the entire class standing around me. Not the way to attract a crowd. The EMT’s foisted me onto a gurney and set about their work. Checking vitals, chattering in medical terms. In hindsight, I shouldn’t have been surprised. I was a police sergeant back then and had just come off a grave yard shift. With no sleep and two coffees under my belt, I rolled into morning class. I should have been in bed. But I’d grown accustomed to sacrificing sleep to reach my goals. Clearly, I was exhausted and running on empty. That reality, combined with the perfect throw to the mat, jarred my heart. The injury was a fluke, really. The emergency room nurse would later tell me about a 35 year old mother they treated the week before. She was wrestling with her young son when he kicked her in the chest. An innocent little kick during horseplay. But that’s all it took, and the mother landed in the ER with SVT. The miracle of modern medicine The injection the doctor gave me effectively stops your heart. But only for a millisecond. The injection causes your heart to return to a normal sinus rhythm. Fortunately for me, it worked like a charm. Which was good. Because the nurse with the other syringe was standing by with medicine to start my heart (in case it didn’t correct on its own.) I also learned that sometimes they have to transition to electric shocks. Once the old ticker was behaving again, the ER doctor and staff said I could sign some papers and head home. I was still freaked out by the whole incident. I would later schedule appointments with my primary care physician, obtain all the ER records, etc. My doctor had me wear a heart monitor for 24 hours. He ran some tests. Long story short, I was fit as a fiddle. Introspection and new directions The whole affair led to some serious introspection. I began to ask myself questions about why I was studying martial arts. What were my goals? My direction? Was I happy? I resumed my martial arts training after the incident but (pardon the pun) my heart was no longer in it. I realized that my true talent and calling involved the creative arts. Painting, cartooning and writing. I enjoyed training in jujitsu and was close to my black belt. But I knew I would only be an adequate martial artist. Why was I spinning my wheels in the dojo when I should be painting, writing and refining my creative potential? So I quit. It wasn’t easy. As a cop, I was trained to “never give up.” But sometimes we need to pivot. We need to look deep inside ourselves and figure out what our calling is. Quitting, when done thoughtfully, can free us to pursue what we were meant to do. I envy my friends who went on to achieve their black belts. It’s an accomplishment to be proud of. But I’m equally proud of my artistic growth. Jujitsu training brought me moments of joy, interspersed with periods of pain, frustration and fear. When I paint and write, time stands still. I am completely immersed. Lost in the moment. My creative efforts bring me great joy. As scary as that day in the ER was, it was a day of clarity. The day I recognized that I was on the wrong path. I don’t recommend suffering a SVT to clarify your true calling, but that’s how it happened for me. And it has made all the difference. What’s Next? For more heart stopping cartoons and articles, get on my email list. No spam, always free and privacy respected! Click here to dive in. ", "title": "When They Stop Your Heart, It Tends To Focus The Mind", "sentences": [{"5bb1": "When They Stop Your Heart, It Tends To Focus The Mind"}, {"eadb": "By: John P. Weiss"}, {"2f55": "The emergency room doctor looked squarely into my eyes. She was calm and focused. I spied the syringe in her right hand. Next to her was a nurse. The nurse was holding a syringe of her own. “This can’t be good,” I thought to myself."}, {"43ad": "“John, I’m going to give you an injection and you might feel a slight flutter in your chest. Try to relax.” The doctor meant to reassure me. I tried to relax. No luck."}, {"7ae8": "There was an IV slipped into the antecubital area of my arm. That’s the part of your arm that folds inward, opposite the elbow. The doctor then attached the syringe to the IV, delivering the medicine. No pain, but I definitely felt the “flutter” in my chest."}, {"de71": "At the time, I didn’t understand what was happening. Which was good. Because the doctor just stopped my heart."}, {"e070": "The jujitsu injury"}, {"d12a": "Before the ambulance arrived and rushed me off to the ER, I was participating in a martial arts demonstration. The instructor selected me for the demo because I was a brown belt, which is just below black belt. Sounds impressive, but mostly it meant that I was the “attacker.” The “attacker” is the one the instructor gets to throw around like a rag doll."}, {"082d": "The jujitsu I trained in was a hard style. Lots of grappling, throws, flips and such. Somewhere in the middle of the demo the instructor performed a dynamic throw."}, {"693f": "Down I went, into what I thought was a beautifully executed fall. But when I got up, something was wrong."}, {"54d1": "I felt these consistent palpitations in my chest. Nothing like a heart attack, but alarming none the less. One of my fellow students was a doctor and immediately read my behavior."}, {"c482": "“You okay?” he asked. I told him what I was experiencing. He had me sit down and tried a few tricks, to no avail. Then he said, “I think you’re having SVT. We should run you over to the hospital to straighten that out.”"}, {"ca53": "Calm before the storm"}, {"857c": "Don’t you just love doctors? So calm. So unflappable. I’m in the throws of SVT (super ventricular tachycardia) and my doctor buddy suggests I pop over to the ER. Get things “straightened” out. Like I’m going to a hair appointment! But I have to admit, his calm reassurance kept me from panicking."}, {"bf3c": "Someone called the ambulance and the EMT’s arrived in short order. I was seated on the dojo floor with the entire class standing around me. Not the way to attract a crowd."}, {"e624": "The EMT’s foisted me onto a gurney and set about their work. Checking vitals, chattering in medical terms."}, {"f77f": "In hindsight, I shouldn’t have been surprised. I was a police sergeant back then and had just come off a grave yard shift. With no sleep and two coffees under my belt, I rolled into morning class. I should have been in bed. But I’d grown accustomed to sacrificing sleep to reach my goals."}, {"0527": "Clearly, I was exhausted and running on empty. That reality, combined with the perfect throw to the mat, jarred my heart. The injury was a fluke, really."}, {"7598": "The emergency room nurse would later tell me about a 35 year old mother they treated the week before. She was wrestling with her young son when he kicked her in the chest. An innocent little kick during horseplay. But that’s all it took, and the mother landed in the ER with SVT."}, {"60e0": "The miracle of modern medicine"}, {"7bdb": "The injection the doctor gave me effectively stops your heart. But only for a millisecond. The injection causes your heart to return to a normal sinus rhythm."}, {"9467": "Fortunately for me, it worked like a charm. Which was good. Because the nurse with the other syringe was standing by with medicine to start my heart (in case it didn’t correct on its own.) I also learned that sometimes they have to transition to electric shocks."}, {"2b37": "Once the old ticker was behaving again, the ER doctor and staff said I could sign some papers and head home. I was still freaked out by the whole incident."}, {"28e0": "I would later schedule appointments with my primary care physician, obtain all the ER records, etc. My doctor had me wear a heart monitor for 24 hours. He ran some tests. Long story short, I was fit as a fiddle."}, {"d338": "Introspection and new directions"}, {"71e1": "The whole affair led to some serious introspection. I began to ask myself questions about why I was studying martial arts. What were my goals? My direction? Was I happy?"}, {"4ebb": "I resumed my martial arts training after the incident but (pardon the pun) my heart was no longer in it. I realized that my true talent and calling involved the creative arts. Painting, cartooning and writing."}, {"f4f7": "I enjoyed training in jujitsu and was close to my black belt. But I knew I would only be an adequate martial artist. Why was I spinning my wheels in the dojo when I should be painting, writing and refining my creative potential?"}, {"864b": "So I quit. It wasn’t easy. As a cop, I was trained to “never give up.” But sometimes we need to pivot. We need to look deep inside ourselves and figure out what our calling is. Quitting, when done thoughtfully, can free us to pursue what we were meant to do."}, {"b5c5": "I envy my friends who went on to achieve their black belts. It’s an accomplishment to be proud of. But I’m equally proud of my artistic growth. Jujitsu training brought me moments of joy, interspersed with periods of pain, frustration and fear."}, {"5e70": "When I paint and write, time stands still. I am completely immersed. Lost in the moment. My creative efforts bring me great joy. As scary as that day in the ER was, it was a day of clarity. The day I recognized that I was on the wrong path."}, {"a23c": "I don’t recommend suffering a SVT to clarify your true calling, but that’s how it happened for me. And it has made all the difference."}, {"15af": "What’s Next?"}, {"2f9d": "For more heart stopping cartoons and articles, get on my email list. No spam, always free and privacy respected! Click here to dive in."}], "child": "213_1\t213_2"}