{"sentences": [{"1bac": "Depression Is An Illness, Not A Weakness"}, {"7814": "My brain feels bruised and abused- please don’t tell me to suck it up."}, {"a2ad": "Everyone gets depressed and ‘anxious.’ Yes, this is true but not everyone develops depression and/or anxiety disorder. Yet, many people will tell you if you finally decide to confide that you are experiencing clinical depression, ‘I know what you mean, I get depressed too but I just think about unicorns farting rainbows- that makes me feel much better.’ Well, maybe I’ve never heard that phrase before but I swear some people might as well just say that because they are clueless when it comes to clinical depression, and what it does to a person physically and mentally."}, {"3133": "Maybe karma decided to kick my ass because I used to think depression was a state of mind that someone could overcome if they just quit feeling so damn sorry for themselves. I used to think depression was a weakness, that was, until it decided to seek me out."}, {"e67d": "I worked in a Hospital for years and had to frequent the psychiatric ward a lot. I honestly had little compassion for people who were diagnosed as depressed and felt they were looking for sympathy or ducking out on life. I wasn’t educated on depression. I had no clue how sick these people truly felt. I had no clue how ill these people were until I was the lucky recipient of depression and anxiety disorder."}, {"e01c": "My illness began with Anxiety Disorder. I experienced my first panic attack when I was 30. As luck would have it, I didn’t have very many panic attacks in my 30’s. I was able to manage by taking medication when necessary."}, {"19c3": "Fast forward to my late 40’s and early 50’s when perimenopause and menopause set in, my anxiety disorder became an unwanted daily visitor. I found myself developing vertigo when I was out in public which made me want to seek a safe place. When vertigo hit, I felt like I was going to pass out, my heart would begin to beat out of my chest, I would break out into a sweat and I literally could not think straight, even my speech became like that of a person who was having a stroke, I would stutter and have a hard time getting entire sentences out during the acute phase, the panic attack which accompanies my anxiety disorder."}, {"608b": "Photo Courtesy of Unsplash"}, {"cf14": "It’s not uncommon to feel the need to run during a panic attack. They relate the phenomenon of the flight or fight response. Unfortunately, the more frequent the attacks become a person may unconsciously begin to retreat, make up excuses to their friends when asked to go out and do something fun, they may avoid something as simple as running to the grocery store. Avoidance is not a conscience effort, but avoidance can lead to agoraphobia, another aspect of anxiety disorder when a person is unable to leave their home. I understood this was possible after reading a lot. I decided to seek help when I felt I was headed in that direction."}, {"4a18": "When anxiety ‘reared it’s ugly head’ ( I blame Putin for this)- it was with me from the time I got out of bed until I went to bed, it made it hard to function. I felt like a wet noodle, I was weak, I had a nervous stomach and my heart raced all day long. I woke up shaking daily, my brain began to obsess over every issue I didn’t tackle or I would worry constantly about things like cancer, my family, finances and on the list goes. Yes, on the list goes… over and over like a bad song playing on a broken record player. They call these thoughts intrusive thought patterns. I was so physically and emotionally tired from my chronic anxiety it eventually led to full blown clinical depression- it became hard to get out of bed. It was hard to sleep at night. It was almost impossible to look forward to anything. I felt like I was in an abyss that I was unable to climb out of. Well meaning loved ones would say things like, “You have so much to be thankful for, you just need to focus on what’s good in life.” Thank You, dear loved one, I know you mean well but don’t you realize those thoughts go through my mind a million times a day which just add to my overwhelming anxiety and depression that I don’t even understand. Well meant, positive phrases can actually have the opposite effect on a person who is suffering from clinical depression."}, {"668b": "When clinical depression hits, your mind is no longer thinking clearly at all. When a someone gives you advice from a place of love, the person who is suffering will tend to feel guiltier (yes, guilt is a major problem too) and the depression can increase. You begin thinking things like, “what the hell, why am I such a loser,” or “I have failed and now I’m failing you” because I can’t live up to the standards you want for me. I can’t live up to your standards because I’m sick and no one can see it! It’s a vicious cycle which can have horrendous consequences if not treated properly along with acknowledged. Now excuse me while I have another panic attack. Sadly panic attacks increase during depression. Doctors will tell you if Anxiety or depression lasts for a certain period of time, one will lead to the other and sometimes they aren’t sure which came first, anxiety or depression."}, {"04be": "A bit of advice for those who live with someone that suffers from Anxiety Disorder and Depression"}, {"e86f": "First and foremost, believe them when they tell you they are suffering. Don’t tell them to get over it, if you love them offer to help them seek medical attention. Hug the person and let them know that you realize they are ill but you will get through this together. If the person won’t seek help, call a Psychiatrist or the person’s family Doctor, make an appointment for your loved one and accompany them. Please don’t tell them to ‘visualize’ or ‘meditate’ during a crisis. When depression strikes it’s hard to take a shower let alone visualize a beautiful situation because beauty isn’t part of the illness. It sucks and life seems to suck even more when clinical depression strikes and that’s an understatement."}, {"838a": "For those who are currently suffering from Depression and Anxiety Disorder there is help"}, {"358c": "I’m currently in therapy after suffering from a long bout of Clinical depression and anxiety. My anxiety began first, I tried to ignore it for almost 4 years, hoping lifestyle changes and my medication would do the trick. I didn’t realize I was clinically depressed until the holidays and I lost my enthusiasm for Thanksgiving and Christmas, along with seeing close loved ones I hadn’t seen in a while, something I always looked forward to. I knew it was time to seek out someone. I did some research and realized that trauma played a large role in my life. Trauma doesn’t have to be one event, it can be a series of events that you’ve never addressed (brushed under the rug) and eventually they become one major cluster *fig* inside of your head. I knew it was time to find a Therapist who used EMDR to treat their patients. Many people would find they not only qualify for EMDR but respond as well."}, {"2e84": "What is EMDR?"}, {"ff65": "Eye Movement Desensitization and Reprocessing, or EMDR, is a powerful new psychotherapy technique which has been very successful in helping people who suffer from trauma, anxiety, panic, disturbing memories, post traumatic stress and many other emotional problems. Until recently, these conditions were difficult and time-consuming to treat. EMDR is considered a breakthrough therapy because of its simplicity and the fact that it can bring quick and lasting relief for most types of emotional distress."}, {"1e7f": "If you have been suffering off and on from clinical depression and/or generalized anxiety disorder, I would highly recommend looking into EMDR. I’m beginning to see a tiny light at the end of the tunnel. I’m looking forward to feeling alive again and not having to depend on my medication on a daily basis. I feel a glimmer of hope. Please click on the link above addressing EMDR to learn more about the therapy, it may just apply to YOU!"}, {"3980": "Don’t ever allow yourself to feel as though you are not worthy or just a weak person if you become ill from depression. Reach out to someone you trust. If you feel there is no-one who will take you seriously, please call your family Dr., a Therapist or Psychiatrist and don’t downplay what you are feeling. You need to be honest in order to get the help you need, which may be help that’s needed ASAP."}, {"914c": "To loved ones, friends and family members"}, {"8c63": "Be patient and kind, the same type of compassion you would offer someone suffering from cancer as one example of many. Depression feels like a terminal illness when it goes untreated and the person may be thinking, death sounds like the ideal way out right now. It’s that serious."}, {"7f62": "Source for EMDR: http://www.emdr-therapy.com/emdr.html"}], "child": "2133_1\t2133_2\t2133_3\t2133_4\t2133_5\t2133_6\t2133_7\t2133_8\t2133_9\t2133_10\t2133_11\t2133_12\t2133_13", "parent": "", "title": "Depression Is An Illness, Not A Weakness", "content": "Depression Is An Illness, Not A Weakness My brain feels bruised and abused- please don’t tell me to suck it up. Everyone gets depressed and ‘anxious.’ Yes, this is true but not everyone develops depression and/or anxiety disorder. Yet, many people will tell you if you finally decide to confide that you are experiencing clinical depression, ‘I know what you mean, I get depressed too but I just think about unicorns farting rainbows- that makes me feel much better.’ Well, maybe I’ve never heard that phrase before but I swear some people might as well just say that because they are clueless when it comes to clinical depression, and what it does to a person physically and mentally. Maybe karma decided to kick my ass because I used to think depression was a state of mind that someone could overcome if they just quit feeling so damn sorry for themselves. I used to think depression was a weakness, that was, until it decided to seek me out. I worked in a Hospital for years and had to frequent the psychiatric ward a lot. I honestly had little compassion for people who were diagnosed as depressed and felt they were looking for sympathy or ducking out on life. I wasn’t educated on depression. I had no clue how sick these people truly felt. I had no clue how ill these people were until I was the lucky recipient of depression and anxiety disorder. My illness began with Anxiety Disorder. I experienced my first panic attack when I was 30. As luck would have it, I didn’t have very many panic attacks in my 30’s. I was able to manage by taking medication when necessary. Fast forward to my late 40’s and early 50’s when perimenopause and menopause set in, my anxiety disorder became an unwanted daily visitor. I found myself developing vertigo when I was out in public which made me want to seek a safe place. When vertigo hit, I felt like I was going to pass out, my heart would begin to beat out of my chest, I would break out into a sweat and I literally could not think straight, even my speech became like that of a person who was having a stroke, I would stutter and have a hard time getting entire sentences out during the acute phase, the panic attack which accompanies my anxiety disorder. Photo Courtesy of Unsplash It’s not uncommon to feel the need to run during a panic attack. They relate the phenomenon of the flight or fight response. Unfortunately, the more frequent the attacks become a person may unconsciously begin to retreat, make up excuses to their friends when asked to go out and do something fun, they may avoid something as simple as running to the grocery store. Avoidance is not a conscience effort, but avoidance can lead to agoraphobia, another aspect of anxiety disorder when a person is unable to leave their home. I understood this was possible after reading a lot. I decided to seek help when I felt I was headed in that direction. When anxiety ‘reared it’s ugly head’ ( I blame Putin for this)- it was with me from the time I got out of bed until I went to bed, it made it hard to function. I felt like a wet noodle, I was weak, I had a nervous stomach and my heart raced all day long. I woke up shaking daily, my brain began to obsess over every issue I didn’t tackle or I would worry constantly about things like cancer, my family, finances and on the list goes. Yes, on the list goes… over and over like a bad song playing on a broken record player. They call these thoughts intrusive thought patterns. I was so physically and emotionally tired from my chronic anxiety it eventually led to full blown clinical depression- it became hard to get out of bed. It was hard to sleep at night. It was almost impossible to look forward to anything. I felt like I was in an abyss that I was unable to climb out of. Well meaning loved ones would say things like, “You have so much to be thankful for, you just need to focus on what’s good in life.” Thank You, dear loved one, I know you mean well but don’t you realize those thoughts go through my mind a million times a day which just add to my overwhelming anxiety and depression that I don’t even understand. Well meant, positive phrases can actually have the opposite effect on a person who is suffering from clinical depression. When clinical depression hits, your mind is no longer thinking clearly at all. When a someone gives you advice from a place of love, the person who is suffering will tend to feel guiltier (yes, guilt is a major problem too) and the depression can increase. You begin thinking things like, “what the hell, why am I such a loser,” or “I have failed and now I’m failing you” because I can’t live up to the standards you want for me. I can’t live up to your standards because I’m sick and no one can see it! It’s a vicious cycle which can have horrendous consequences if not treated properly along with acknowledged. Now excuse me while I have another panic attack. Sadly panic attacks increase during depression. Doctors will tell you if Anxiety or depression lasts for a certain period of time, one will lead to the other and sometimes they aren’t sure which came first, anxiety or depression. A bit of advice for those who live with someone that suffers from Anxiety Disorder and Depression First and foremost, believe them when they tell you they are suffering. Don’t tell them to get over it, if you love them offer to help them seek medical attention. Hug the person and let them know that you realize they are ill but you will get through this together. If the person won’t seek help, call a Psychiatrist or the person’s family Doctor, make an appointment for your loved one and accompany them. Please don’t tell them to ‘visualize’ or ‘meditate’ during a crisis. When depression strikes it’s hard to take a shower let alone visualize a beautiful situation because beauty isn’t part of the illness. It sucks and life seems to suck even more when clinical depression strikes and that’s an understatement. For those who are currently suffering from Depression and Anxiety Disorder there is help I’m currently in therapy after suffering from a long bout of Clinical depression and anxiety. My anxiety began first, I tried to ignore it for almost 4 years, hoping lifestyle changes and my medication would do the trick. I didn’t realize I was clinically depressed until the holidays and I lost my enthusiasm for Thanksgiving and Christmas, along with seeing close loved ones I hadn’t seen in a while, something I always looked forward to. I knew it was time to seek out someone. I did some research and realized that trauma played a large role in my life. Trauma doesn’t have to be one event, it can be a series of events that you’ve never addressed (brushed under the rug) and eventually they become one major cluster *fig* inside of your head. I knew it was time to find a Therapist who used EMDR to treat their patients. Many people would find they not only qualify for EMDR but respond as well. What is EMDR? Eye Movement Desensitization and Reprocessing, or EMDR, is a powerful new psychotherapy technique which has been very successful in helping people who suffer from trauma, anxiety, panic, disturbing memories, post traumatic stress and many other emotional problems. Until recently, these conditions were difficult and time-consuming to treat. EMDR is considered a breakthrough therapy because of its simplicity and the fact that it can bring quick and lasting relief for most types of emotional distress. If you have been suffering off and on from clinical depression and/or generalized anxiety disorder, I would highly recommend looking into EMDR. I’m beginning to see a tiny light at the end of the tunnel. I’m looking forward to feeling alive again and not having to depend on my medication on a daily basis. I feel a glimmer of hope. Please click on the link above addressing EMDR to learn more about the therapy, it may just apply to YOU! Don’t ever allow yourself to feel as though you are not worthy or just a weak person if you become ill from depression. Reach out to someone you trust. If you feel there is no-one who will take you seriously, please call your family Dr., a Therapist or Psychiatrist and don’t downplay what you are feeling. You need to be honest in order to get the help you need, which may be help that’s needed ASAP. To loved ones, friends and family members Be patient and kind, the same type of compassion you would offer someone suffering from cancer as one example of many. Depression feels like a terminal illness when it goes untreated and the person may be thinking, death sounds like the ideal way out right now. It’s that serious. Source for EMDR: http://www.emdr-therapy.com/emdr.html ", "name": "2133"}