{"sentences": [{"4e3c": "Why Diets Don’t Work"}, {"a399": "Lately I’ve been hearing from many clients that the only way to lose weight is to eat lots of protein and cut carbs. “How is a diet that limits many of the foods you love like pasta, crusty French bread, alcohol, etc. going to work long term?” I ask them. “Isn’t enjoying good food with family and friends one of the things you enjoy in life?”"}, {"74c8": "It’s human nature to become blinded by the quick fix, and often cited is The Atkins Diet. This is a high-protein, low-carb diet first offered in 1972 by Dr. Robert C. Atkins. It claims you can lose up to 15 pounds in two weeks without counting calories, no portion control and restrictions on your consumption of fatty foods. No exercise is required to help you do it. Too good to be true?"}, {"f0ce": "Image courtesy of Unsplash"}, {"360c": "The theory on this diet and many similar variations is that carbs are the “gas” that makes our body go, so if you limit them, your “engine” burns fat, and fat burned equals pounds off. You can eat lots of protein and fat and still lose weight. It’s the carb control that is important, according to Dr. Atkins. He says that, if you track your carbs you will burn off your body’s fat stores, regulate your blood sugar and achieve optimal heath without feeling hungry or deprived."}, {"6732": "I don’t know about you but if I had to limit my carbs to below 20 grams a day (an Atkins Diet requirement in the first few weeks) and 12 to15 of them could only come from certain vegetables, I’d quit! I’d probably be constipated, dizzy, weak and mentally fatigued."}, {"4dca": "The way to lose weight is not from mostly water loss, which happens in the first two weeks in this type of diet. Instead, you should do it through eating a balanced diet, including all food groups and one that restricts calories, at least in the short term. A diet that has too much fat, mostly from animal sources, and too few carbs is not healthy. Instead eat lots of veggies, whole grains and fruit in addition to both animal- and plant-based proteins. NOTE: In a recent study conducted by U.S. News & World Report of the 38 best diets, The Atkins diet ranked #35."}, {"99a5": "The top three best diets were the Dash, Mediterranean and MIND diet. With these you get long-term weight loss, and they are easy to follow without having to buy shakes and bars. You can eat foods from all food groups you love, and help prevent chronic diseases such as diabetes, cardiovascular disease, Alzheimer’s and cancer. As a health coach and someone who finds a lot of enjoyment from eating, I can’t argue with any of that!"}], "child": "2134_1", "parent": "", "title": "Why Diets Don’t Work", "content": "Why Diets Don’t Work Lately I’ve been hearing from many clients that the only way to lose weight is to eat lots of protein and cut carbs. “How is a diet that limits many of the foods you love like pasta, crusty French bread, alcohol, etc. going to work long term?” I ask them. “Isn’t enjoying good food with family and friends one of the things you enjoy in life?” It’s human nature to become blinded by the quick fix, and often cited is The Atkins Diet. This is a high-protein, low-carb diet first offered in 1972 by Dr. Robert C. Atkins. It claims you can lose up to 15 pounds in two weeks without counting calories, no portion control and restrictions on your consumption of fatty foods. No exercise is required to help you do it. Too good to be true? Image courtesy of Unsplash The theory on this diet and many similar variations is that carbs are the “gas” that makes our body go, so if you limit them, your “engine” burns fat, and fat burned equals pounds off. You can eat lots of protein and fat and still lose weight. It’s the carb control that is important, according to Dr. Atkins. He says that, if you track your carbs you will burn off your body’s fat stores, regulate your blood sugar and achieve optimal heath without feeling hungry or deprived. I don’t know about you but if I had to limit my carbs to below 20 grams a day (an Atkins Diet requirement in the first few weeks) and 12 to15 of them could only come from certain vegetables, I’d quit! I’d probably be constipated, dizzy, weak and mentally fatigued. The way to lose weight is not from mostly water loss, which happens in the first two weeks in this type of diet. Instead, you should do it through eating a balanced diet, including all food groups and one that restricts calories, at least in the short term. A diet that has too much fat, mostly from animal sources, and too few carbs is not healthy. Instead eat lots of veggies, whole grains and fruit in addition to both animal- and plant-based proteins. NOTE: In a recent study conducted by U.S. News & World Report of the 38 best diets, The Atkins diet ranked #35. The top three best diets were the Dash, Mediterranean and MIND diet. With these you get long-term weight loss, and they are easy to follow without having to buy shakes and bars. You can eat foods from all food groups you love, and help prevent chronic diseases such as diabetes, cardiovascular disease, Alzheimer’s and cancer. As a health coach and someone who finds a lot of enjoyment from eating, I can’t argue with any of that! ", "name": "2134"}