{"sentences": [{"547d": "WHY I TALK OPENLY, AND RELENTLESSLY, ABOUT MENTAL HEALTH"}, {"91c3": "We have an ideas meeting every week at work. It’s the time where we pitch the things we want to write about to our editor, and every week I have at least one idea about mental health."}, {"6c77": "It’s almost become a bit of a running joke, but one that I proudly laugh along with because it’s true! I do always pitch ideas about mental health. I always will do, and I’d like to tell you why."}, {"3d0d": "I’ve always been a worrier. As a child I worried that my parents would get divorced. As a teenager I worried about my lack of facial hair. In my early twenties I worried about my degree."}, {"3614": "Nowadays, I still worry; what sort of life I want to live, what my priorities are, my career choices, love life, health problems, terrorism, the environment…my remaining lack of facial hair. The list could go endlessly on."}, {"4d47": "I always assumed that I simply had an innate inclination, some sort of predetermination, to being a worrier. Maybe to some extent that’s true. I have, though, learned that worrying is pointless. But getting to that point of understanding has been a slog; an arduous, painful, testing, often exhausting but hugely rewarding slog."}, {"ad9c": "When I was 21 I had my first anxiety attack. I didn’t know that’s what it was until a doctor in A&E told me so, as she wrote me a prescription for Valium."}, {"57ce": "I’ve written about the onset of my anxiety before, about how one minute I was fine, and the next I wasn’t, but people often ask me what an anxiety attack feels like. I think they affect people differently, but for me, this is what it’s like."}, {"8f81": "You feel off, unexplainably worried, and just pretty out of sorts."}, {"9a6e": "My heart starts thumping so hard in my chest I feel like it might burst out of me; my tongue feels too big for my mouth; my hands become sweaty and my breathing shallow; it feels like my senses have gone into overdrive, and everything seems too bright and too loud; I feel like I might throw up; my thoughts start racing and I can’t seem to focus on just one, all of them rushing in and out of my head too quickly."}, {"6143": "From that first incident my anxiety attacks continued. The arbitrary nature of them — in the cinema, at home, in the shower, as I was falling asleep, wherever and whenever — only helped to reinforce a more permanent anxious state."}, {"2b65": "Over the years I became anxious about becoming anxious, and I began to associate anxiety with anything I deemed likely to trigger an attack. My mental health deteriorated without me really realising it. I had, gradually over time, developed mental obsessions alongside my anxiety attacks. This culminated in a diagnosis in 2016 of OCD, along with Generalised Anxiety and a weird thing called SPOV (specific phobia of vomiting)."}, {"2cb3": "Again, I’ve written about my OCD before. But I think I would be doing it an injustice if I didn’t explain quite how horribly it affected me."}, {"355d": "OCD made me question whether people who did really terrible things — like rapists or child abusers — had always been capable of these horrific things, or whether they had at one stage in their lives been, comparatively, ‘normal’ people."}, {"7213": "I then wondered if I could be capable of committing any of these offences, and convinced myself that the answer was yes. It wasn’t that I knew I was a child abuser or a rapist, but more that I became scared that I might be. Every time I saw a child in the street, watched a film where somebody got murdered, or even heard about the latest episode of Serial, it would escalate into one of my anxiety attacks."}, {"564f": "On top of all of this, and as a result of not having thrown up since the age of four (aside from a couple of drunken times at university), I became completely phobic of vomiting."}, {"1a2f": "And that was became my life. Carrying on as normal — wandering through the streets of London, going to work, checking in with my family and hanging out with my friends — all while convinced I might be a child abuser, that if I ate meat I might vomit, and scared that I might have an anxiety attack at any moment."}, {"b619": "When you’re living through it, you can’t see how unhealthy your life has become. On the one hand you know your thoughts are irrational, but you are so consumed by them that they have become part of who you are, regardless of how limiting they are on your life."}, {"f016": "I developed ways of living with my mental health problems, coping mechanisms if you will."}, {"0825": "Out of fear of vomiting I started curbing my alcohol intake so as to avoid a hangover, and the inevitable nausea, the next day. I would remove myself from any situation that would involve me coming into contact with somebody who had recently had Norovirus. For a while I stopped taking the tube altogether, and I soon became a vegetarian."}, {"ca8e": "It was easy for me to avoid any sort of media containing graphic content that I thought would act as a trigger; I didn’t read the news so I wouldn’t have to see headlines about Operation Yewtree and I wouldn’t watch anything that I thought might have scenes of rape or murder in them. I would take myself away from any conversation which I felt was about to turn ‘dark’, and I learned to distract myself as soon as my mind went the same way."}, {"3e70": "Candy Crush became my best friend in an attempt to keep my mind away from bad places, and my knuckles would go white as I clutched the little Buddha totem in my pocket, which went everywhere with me and symbolised all things calm."}, {"ca11": "I saw all these behaviours as things that would spare me an anxiety attack; they were my safety net and essential to my survival. But as much as they helped keep me sane, they didn’t lessen the psychological ruminations that my fears had on my mind."}, {"82d8": "When you think you might be something as horrifying as a child abuser, it’s not the type of thing you feel you can casually bring up over dinner. I really thought that I was corrupt, dangerous, and that these intrusive thoughts meant that there was something seriously, fundamentally, wrong with me."}, {"ea4e": "I questioned why this has happened to me, whether I might have done something to deserve it. I wondered what my life would be like if this was my tragically unavoidable reality."}, {"0fb0": "Would I be able to find love, from myself or someone else? Would I ever be able to have a family? Was it just a matter of time before I ended up in prison? What would tip me over the edge and cause me to finally lash out?"}, {"b074": "The realisation that this would happen to me for the indefinite future didn’t exactly sit comfortably. To put it bluntly, the future looked pretty damn bleak."}, {"0811": "I’m not writing these things to get anybody’s sympathy. When I think about what other ailments life could have thrown my way, I know it could have been a lot worse. And I’m grateful for that."}, {"9ee7": "But I remain firmly rooted in the belief that we need to continue talking openly, unashamedly and relentlessly about mental health. I’d shout about it from the rooftops if someone handed me a megaphone."}, {"19b6": "I sought help; from professionals, from friends, from anyone who was willing to give it to me."}, {"4f06": "I learned that so much of what I experience is because of OCD (something I had totally misunderstood before my diagnosis). I educated myself about it, read about it, wrote about it. I started talking more openly about it, sharing my experiences with anyone who was interested."}, {"2a2d": "But every time I do, it is often the first time people have encountered a story like it. Every time I post a blog, or an article, that I’ve written about mental health, I get emails and messages from people telling me that they are going through similar and that reading my story has in some way helped them."}, {"71ae": "I regularly have people come to me, strangers and friends alike, disclosing personal information about the terrible state of their mental health. I’m flattered, humbled even. But I can’t help but question why it’s often the first time they’ve spoken to anyone about it."}, {"c185": "In short, I believe it is because we still aren’t talking about mental health, totally and openly talking about it, enough."}, {"c51a": "There are plentiful statistics that highlight the seriousness of mental health. I heard someone recently, upon being told one statistic about the increased risk of mental health problems in young people, say, “they all just need to get over themselves”."}, {"ba35": "Clearly, mental health remains misunderstood. I was guilty of it, I misunderstood it. I thought my future was bleak, that I was destined for a life behind bars and that I should be written off as a tragic case of genetic mutation."}, {"2e21": "But I’m totally not!"}, {"9247": "I know that now because I educated myself; because I started being open about it, because I got help, because I learned that thousands of people get intrusive thoughts, and that what was happening to me were actually symptoms of something."}, {"a4dd": "As soon as I started surrounding myself with people and conversations that were totally honest about mental health, my life started to get better."}, {"df61": "That’s what I wish for other people too. That’s why I remain dedicated to continuing these discussions, so that maybe I can save someone a little bit of the agonising suffering that I went through."}], "child": "2136_1", "parent": "", "title": "WHY I TALK OPENLY, AND RELENTLESSLY, ABOUT MENTAL HEALTH", "content": "WHY I TALK OPENLY, AND RELENTLESSLY, ABOUT MENTAL HEALTH We have an ideas meeting every week at work. It’s the time where we pitch the things we want to write about to our editor, and every week I have at least one idea about mental health. It’s almost become a bit of a running joke, but one that I proudly laugh along with because it’s true! I do always pitch ideas about mental health. I always will do, and I’d like to tell you why. I’ve always been a worrier. As a child I worried that my parents would get divorced. As a teenager I worried about my lack of facial hair. In my early twenties I worried about my degree. Nowadays, I still worry; what sort of life I want to live, what my priorities are, my career choices, love life, health problems, terrorism, the environment…my remaining lack of facial hair. The list could go endlessly on. I always assumed that I simply had an innate inclination, some sort of predetermination, to being a worrier. Maybe to some extent that’s true. I have, though, learned that worrying is pointless. But getting to that point of understanding has been a slog; an arduous, painful, testing, often exhausting but hugely rewarding slog. When I was 21 I had my first anxiety attack. I didn’t know that’s what it was until a doctor in A&E told me so, as she wrote me a prescription for Valium. I’ve written about the onset of my anxiety before, about how one minute I was fine, and the next I wasn’t, but people often ask me what an anxiety attack feels like. I think they affect people differently, but for me, this is what it’s like. You feel off, unexplainably worried, and just pretty out of sorts. My heart starts thumping so hard in my chest I feel like it might burst out of me; my tongue feels too big for my mouth; my hands become sweaty and my breathing shallow; it feels like my senses have gone into overdrive, and everything seems too bright and too loud; I feel like I might throw up; my thoughts start racing and I can’t seem to focus on just one, all of them rushing in and out of my head too quickly. From that first incident my anxiety attacks continued. The arbitrary nature of them — in the cinema, at home, in the shower, as I was falling asleep, wherever and whenever — only helped to reinforce a more permanent anxious state. Over the years I became anxious about becoming anxious, and I began to associate anxiety with anything I deemed likely to trigger an attack. My mental health deteriorated without me really realising it. I had, gradually over time, developed mental obsessions alongside my anxiety attacks. This culminated in a diagnosis in 2016 of OCD, along with Generalised Anxiety and a weird thing called SPOV (specific phobia of vomiting). Again, I’ve written about my OCD before. But I think I would be doing it an injustice if I didn’t explain quite how horribly it affected me. OCD made me question whether people who did really terrible things — like rapists or child abusers — had always been capable of these horrific things, or whether they had at one stage in their lives been, comparatively, ‘normal’ people. I then wondered if I could be capable of committing any of these offences, and convinced myself that the answer was yes. It wasn’t that I knew I was a child abuser or a rapist, but more that I became scared that I might be. Every time I saw a child in the street, watched a film where somebody got murdered, or even heard about the latest episode of Serial, it would escalate into one of my anxiety attacks. On top of all of this, and as a result of not having thrown up since the age of four (aside from a couple of drunken times at university), I became completely phobic of vomiting. And that was became my life. Carrying on as normal — wandering through the streets of London, going to work, checking in with my family and hanging out with my friends — all while convinced I might be a child abuser, that if I ate meat I might vomit, and scared that I might have an anxiety attack at any moment. When you’re living through it, you can’t see how unhealthy your life has become. On the one hand you know your thoughts are irrational, but you are so consumed by them that they have become part of who you are, regardless of how limiting they are on your life. I developed ways of living with my mental health problems, coping mechanisms if you will. Out of fear of vomiting I started curbing my alcohol intake so as to avoid a hangover, and the inevitable nausea, the next day. I would remove myself from any situation that would involve me coming into contact with somebody who had recently had Norovirus. For a while I stopped taking the tube altogether, and I soon became a vegetarian. It was easy for me to avoid any sort of media containing graphic content that I thought would act as a trigger; I didn’t read the news so I wouldn’t have to see headlines about Operation Yewtree and I wouldn’t watch anything that I thought might have scenes of rape or murder in them. I would take myself away from any conversation which I felt was about to turn ‘dark’, and I learned to distract myself as soon as my mind went the same way. Candy Crush became my best friend in an attempt to keep my mind away from bad places, and my knuckles would go white as I clutched the little Buddha totem in my pocket, which went everywhere with me and symbolised all things calm. I saw all these behaviours as things that would spare me an anxiety attack; they were my safety net and essential to my survival. But as much as they helped keep me sane, they didn’t lessen the psychological ruminations that my fears had on my mind. When you think you might be something as horrifying as a child abuser, it’s not the type of thing you feel you can casually bring up over dinner. I really thought that I was corrupt, dangerous, and that these intrusive thoughts meant that there was something seriously, fundamentally, wrong with me. I questioned why this has happened to me, whether I might have done something to deserve it. I wondered what my life would be like if this was my tragically unavoidable reality. Would I be able to find love, from myself or someone else? Would I ever be able to have a family? Was it just a matter of time before I ended up in prison? What would tip me over the edge and cause me to finally lash out? The realisation that this would happen to me for the indefinite future didn’t exactly sit comfortably. To put it bluntly, the future looked pretty damn bleak. I’m not writing these things to get anybody’s sympathy. When I think about what other ailments life could have thrown my way, I know it could have been a lot worse. And I’m grateful for that. But I remain firmly rooted in the belief that we need to continue talking openly, unashamedly and relentlessly about mental health. I’d shout about it from the rooftops if someone handed me a megaphone. I sought help; from professionals, from friends, from anyone who was willing to give it to me. I learned that so much of what I experience is because of OCD (something I had totally misunderstood before my diagnosis). I educated myself about it, read about it, wrote about it. I started talking more openly about it, sharing my experiences with anyone who was interested. But every time I do, it is often the first time people have encountered a story like it. Every time I post a blog, or an article, that I’ve written about mental health, I get emails and messages from people telling me that they are going through similar and that reading my story has in some way helped them. I regularly have people come to me, strangers and friends alike, disclosing personal information about the terrible state of their mental health. I’m flattered, humbled even. But I can’t help but question why it’s often the first time they’ve spoken to anyone about it. In short, I believe it is because we still aren’t talking about mental health, totally and openly talking about it, enough. There are plentiful statistics that highlight the seriousness of mental health. I heard someone recently, upon being told one statistic about the increased risk of mental health problems in young people, say, “they all just need to get over themselves”. Clearly, mental health remains misunderstood. I was guilty of it, I misunderstood it. I thought my future was bleak, that I was destined for a life behind bars and that I should be written off as a tragic case of genetic mutation. But I’m totally not! I know that now because I educated myself; because I started being open about it, because I got help, because I learned that thousands of people get intrusive thoughts, and that what was happening to me were actually symptoms of something. As soon as I started surrounding myself with people and conversations that were totally honest about mental health, my life started to get better. That’s what I wish for other people too. That’s why I remain dedicated to continuing these discussions, so that maybe I can save someone a little bit of the agonising suffering that I went through. ", "name": "2136"}