{"sentences": [{"665e": "Obamacare Enhances Health Security for Americans with Mental Illness"}, {"d85e": "World Health Day 2017 spotlights epidemic of global depression."}, {"ed35": "Despite persistent threats from the Republican-led Congress and President Trump to “repeal and replace” Obamacare, the landmark law is not dead yet. This is good news for people with mental illness as we approach World Health Day on Friday."}, {"bcba": "Since the enactment of Obamacare, tens of millions of Americans have been able to access affordable healthcare who previously were denied basic coverage due to pre-existing conditions and other discriminatory reasons, including mental illness. That’s why Obamacare — formally known as the Affordable Care Act (ACA) — should be mended, not ended by Congress."}, {"1cab": "Obamacare has played an instrumental role in allowing people with mental illness more opportunity to thrive in their personal and professional lives. This is due to accessing cost effective medical treatment, therapy and prescription drugs, among other health benefits were previously unavailable to uninsured Americans."}, {"608d": "Therefore, as we pause on April 7 to observe World Health Day, let’s not forget how Obamacare has helped to improve the lives of the most vulnerable among us — including individuals with mental illness."}, {"7cc7": "The World Health Organization (WHO) has declared “Depression” as this year’s theme for World Health Day. The campaign slogan is, “Depression: Let’s Talk” (per the WHO image above). Last week, Thrive reported in a headline, “Depression is the Leading Cause of Poor Health and Disability Worldwide” (according to the WHO). This should give us pause."}, {"b66c": "Hidden Disabilities"}, {"0e26": "People affected by mental health issues are not only challenged by specific psychiatric conditions, but those conditions are often invisible to others— per the term “hidden disabilities.”"}, {"40aa": "Unlike physical disabilities, mental disabilities more often go unnoticed and unaddressed because they may appear invisible. Thus, employers and managers may question an employee’s conduct or job performance without knowing the full extent of one’s medical situation. That is, workers who are negatively affected by an untreated or undiagnosed mental illness — the debilitating symptoms of which might otherwise be mitigated with appropriate treatment and medication. But too many people affected by mental illness remain ashamed and embarrassed to publicly discuss it."}, {"8790": "Image courtesy of Unsplash"}, {"4db6": "A major problem area for people with mental illness continue to be myths, fears and stereotypes surrounding their medical condition."}, {"7634": "It’s unfortunate that societal bias against people with mental illness appears lagging behind legislative progress. This is exemplified by the continuing stigma facing those with mental illness in the workplace and many other places, despite groundbreaking laws such as the Americans with Disabilities Act of 1990 (ADA), as amended (which covers psychiatric impairments), in addition to subsequent mental health parity laws."}, {"9fc2": "The American Psychiatric Association (APA) wrote the following in a Jan. 5, 2017, letter to leaders of Congress regarding mental health and Obamacare: “Mental illness is very prevalent in the United States. According to the National Institute of Mental Health, over 68 million Americans experienced a psychiatric or substance use disorder in the past year. That is over 20 percent of the nation’s population.”"}, {"3cc3": "Further, according to the APA: “Individuals with bipolar disorder, schizophrenia, major depressive disorder, substance use disorders, and other mental health issues previously struggled to obtain insurance coverage to help them access care. Current law changed that by requiring coverage of necessary services to treat mental illness.”"}, {"82ae": "“Consequently,” notes the APA, “it has become less burdensome for Americans to access appropriate and evidence-based mental health care, thus improving their chance for healthier and more productive lives while reducing the stigma around mental illness.”"}, {"eaf7": "That’s why Americans should be more mindful that, in addition to providing universal access to affordable healthcare, Obamacare has helped to break down societal barriers associated with mental illness (albeit slowly)."}, {"9663": "However, much more needs to be done to eradicate the prevalent stigmas and stereotypes surrounding mental illness and related medical conditions."}, {"0c7c": "Health Security"}, {"bfcf": "Obamacare remains controversial despite some initial success. The upside is that many fair-minded citizens recognize the critical importance of universal access to affordable healthcare."}, {"2401": "A recent article in The Atlantic points out, “ There has always been government-subsidized health care in the United States. Until just after the Civil War, when state governments took more power, most Americans assumed that their local government would tax and spend to take care of the neediest.”"}, {"4783": "“For about three centuries from the beginning of British North America, almost no one thought government-provided health care for the poor should go away.” — The Atlantic"}, {"372d": "Thanks to Obamacare, people with mental illness now have much needed access to healthcare plans they can afford. Further, the USA now reportedly has the lowest uninsured rate in the nation’s history, according to the prior presidential administration."}, {"c6ec": "The U.S. Department of Health and Human Services (HHS) reminds us:"}, {"d96c": "“The Affordable Care Act provides one of the largest expansions of mental health and substance use disorder coverage in a generation, by requiring that most individual and small employer health insurance plans, including all plans offered through the Health Insurance Marketplace cover mental health and substance use disorder services.”"}, {"56b0": "HHS adds: “These new protections build on the Mental Health Parity and Addiction Equity Act of 2008 (MHPAEA) provisions to expand mental health and substance use disorder benefits and federal parity protections to an estimated 62 million Americans.”"}, {"5160": "Further, a recent article in USA Today points out:"}, {"9dfa": "“The people helped the most by the ACA are the ones most likely to suffer from poor mental health and addiction.”"}, {"81f5": "Mend it, Don’t End It"}, {"7f93": "Although some argue that Obamacare is not a potent panacea for all of the nation’s healthcare ills, the sweeping law has nevertheless established a strong foundation upon which to build and improve."}, {"2de3": "Rather than trying to repeal and replace Obamacare, the main focus should be on mending it, not ending it. Keep what works and fix what doesn’t."}, {"4079": "This was the case with other groundbreaking social laws which created Medicare and Social Security, for instance, in addition to landmark civil rights laws. Regarding healthcare, most Americans appear to understand that no one should be denied basic health insurance due to mental illnesss, low income, pre-existing conditions, or a range of other discriminatory factors."}, {"df9e": "The USA is better than that in maintaining the moral high ground, or at least that’s what we would like to believe. How could the USA continue to uphold our long cherished morals and values by leaving Americans who lack basic healthcare to wither on the vines of desperation?"}, {"43ab": "Put simply, America’s healthcare system had been stuck in the ditch for too long."}, {"ade0": "It’s worth noting that officials with the Centers for Disease Control and Prevention (CDC) stated back in 2012 that, “The U.S. health system ranks 37th in the world — just behind Costa Rica.”"}, {"fd0a": "While Costa Rica is a beautiful place to visit, would you or your family want to travel there strictly for affordable medical treatment? What if that was the only way to receive life-saving surgery?"}, {"59ae": "If not Costa Rica, then how about Canada or the other 30-plus countries which had healthcare systems ranking higher than ours before Obamacare became law?"}, {"74ae": "Fortunately, that’s a choice Americans no longer have to make, including people with mental illness…at least for now."}, {"b05a": "___________________________________________________________"}, {"e331": "Note: Another version of this article appears on award-winning startup beBee Affinity Social Network, where the author is a brand ambassador."}], "child": "2140_1\t2140_2\t2140_3\t2140_4\t2140_5\t2140_6\t2140_7\t2140_8", "parent": "", "title": "Obamacare Enhances Health Security for Americans with Mental Illness", "content": "Obamacare Enhances Health Security for Americans with Mental Illness World Health Day 2017 spotlights epidemic of global depression. Despite persistent threats from the Republican-led Congress and President Trump to “repeal and replace” Obamacare, the landmark law is not dead yet. This is good news for people with mental illness as we approach World Health Day on Friday. Since the enactment of Obamacare, tens of millions of Americans have been able to access affordable healthcare who previously were denied basic coverage due to pre-existing conditions and other discriminatory reasons, including mental illness. That’s why Obamacare — formally known as the Affordable Care Act (ACA) — should be mended, not ended by Congress. Obamacare has played an instrumental role in allowing people with mental illness more opportunity to thrive in their personal and professional lives. This is due to accessing cost effective medical treatment, therapy and prescription drugs, among other health benefits were previously unavailable to uninsured Americans. Therefore, as we pause on April 7 to observe World Health Day, let’s not forget how Obamacare has helped to improve the lives of the most vulnerable among us — including individuals with mental illness. The World Health Organization (WHO) has declared “Depression” as this year’s theme for World Health Day. The campaign slogan is, “Depression: Let’s Talk” (per the WHO image above). Last week, Thrive reported in a headline, “Depression is the Leading Cause of Poor Health and Disability Worldwide” (according to the WHO). This should give us pause. Hidden Disabilities People affected by mental health issues are not only challenged by specific psychiatric conditions, but those conditions are often invisible to others— per the term “hidden disabilities.” Unlike physical disabilities, mental disabilities more often go unnoticed and unaddressed because they may appear invisible. Thus, employers and managers may question an employee’s conduct or job performance without knowing the full extent of one’s medical situation. That is, workers who are negatively affected by an untreated or undiagnosed mental illness — the debilitating symptoms of which might otherwise be mitigated with appropriate treatment and medication. But too many people affected by mental illness remain ashamed and embarrassed to publicly discuss it. Image courtesy of Unsplash A major problem area for people with mental illness continue to be myths, fears and stereotypes surrounding their medical condition. It’s unfortunate that societal bias against people with mental illness appears lagging behind legislative progress. This is exemplified by the continuing stigma facing those with mental illness in the workplace and many other places, despite groundbreaking laws such as the Americans with Disabilities Act of 1990 (ADA), as amended (which covers psychiatric impairments), in addition to subsequent mental health parity laws. The American Psychiatric Association (APA) wrote the following in a Jan. 5, 2017, letter to leaders of Congress regarding mental health and Obamacare: “Mental illness is very prevalent in the United States. According to the National Institute of Mental Health, over 68 million Americans experienced a psychiatric or substance use disorder in the past year. That is over 20 percent of the nation’s population.” Further, according to the APA: “Individuals with bipolar disorder, schizophrenia, major depressive disorder, substance use disorders, and other mental health issues previously struggled to obtain insurance coverage to help them access care. Current law changed that by requiring coverage of necessary services to treat mental illness.” “Consequently,” notes the APA, “it has become less burdensome for Americans to access appropriate and evidence-based mental health care, thus improving their chance for healthier and more productive lives while reducing the stigma around mental illness.” That’s why Americans should be more mindful that, in addition to providing universal access to affordable healthcare, Obamacare has helped to break down societal barriers associated with mental illness (albeit slowly). However, much more needs to be done to eradicate the prevalent stigmas and stereotypes surrounding mental illness and related medical conditions. Health Security Obamacare remains controversial despite some initial success. The upside is that many fair-minded citizens recognize the critical importance of universal access to affordable healthcare. A recent article in The Atlantic points out, “ There has always been government-subsidized health care in the United States. Until just after the Civil War, when state governments took more power, most Americans assumed that their local government would tax and spend to take care of the neediest.” “For about three centuries from the beginning of British North America, almost no one thought government-provided health care for the poor should go away.” — The Atlantic Thanks to Obamacare, people with mental illness now have much needed access to healthcare plans they can afford. Further, the USA now reportedly has the lowest uninsured rate in the nation’s history, according to the prior presidential administration. The U.S. Department of Health and Human Services (HHS) reminds us: “The Affordable Care Act provides one of the largest expansions of mental health and substance use disorder coverage in a generation, by requiring that most individual and small employer health insurance plans, including all plans offered through the Health Insurance Marketplace cover mental health and substance use disorder services.” HHS adds: “These new protections build on the Mental Health Parity and Addiction Equity Act of 2008 (MHPAEA) provisions to expand mental health and substance use disorder benefits and federal parity protections to an estimated 62 million Americans.” Further, a recent article in USA Today points out: “The people helped the most by the ACA are the ones most likely to suffer from poor mental health and addiction.” Mend it, Don’t End It Although some argue that Obamacare is not a potent panacea for all of the nation’s healthcare ills, the sweeping law has nevertheless established a strong foundation upon which to build and improve. Rather than trying to repeal and replace Obamacare, the main focus should be on mending it, not ending it. Keep what works and fix what doesn’t. This was the case with other groundbreaking social laws which created Medicare and Social Security, for instance, in addition to landmark civil rights laws. Regarding healthcare, most Americans appear to understand that no one should be denied basic health insurance due to mental illnesss, low income, pre-existing conditions, or a range of other discriminatory factors. The USA is better than that in maintaining the moral high ground, or at least that’s what we would like to believe. How could the USA continue to uphold our long cherished morals and values by leaving Americans who lack basic healthcare to wither on the vines of desperation? Put simply, America’s healthcare system had been stuck in the ditch for too long. It’s worth noting that officials with the Centers for Disease Control and Prevention (CDC) stated back in 2012 that, “The U.S. health system ranks 37th in the world — just behind Costa Rica.” While Costa Rica is a beautiful place to visit, would you or your family want to travel there strictly for affordable medical treatment? What if that was the only way to receive life-saving surgery? If not Costa Rica, then how about Canada or the other 30-plus countries which had healthcare systems ranking higher than ours before Obamacare became law? Fortunately, that’s a choice Americans no longer have to make, including people with mental illness…at least for now. ___________________________________________________________ Note: Another version of this article appears on award-winning startup beBee Affinity Social Network, where the author is a brand ambassador. ", "name": "2140"}