{"sentences": [{"ee2e": "Are You Able To Talk To Your Boss About Depression?"}, {"b6a9": "Many Employers still don’t understand that Depression is an illness which leads to Anxiety Disorder or vice versa."}, {"90e9": "Unsplash.com by Jeremy Bishop"}, {"fc9f": "How many Employers or those in leadership roles recognize that depression and anxiety disorder are highly prevalent? Do most employers think of depression and/or anxiety as a medical issue? Have you been stigmatized on the job because you do suffer from depression or anxiety? If you’re afraid of the stigma, do you suffer in silence- making up excuses for days missed on the job?"}, {"8001": "I won’t be in today because I have the stomach flu"}, {"0c7c": "According to the NIMH in 2013, an estimated 15.7 million adults aged 18 or older in the U.S. had at least one major depressive episode in the past year. This represented 6.7 percent of all U.S. adults. If you view the graph on the NIMH’s site, you will see that depression is on the rise, not decline."}, {"68b9": "Hi, I won’t be in to work today, because I’m suffering from depression. I need to leave work early, because my anxiety disorder is making it impossible for me to function"}, {"895a": "I’m curious just how many employers have actually received a call from one of their employees stating they can’t work because they are ill from depression? If you did receive that call, how did you react? Has anyone felt they were able to express their need to leave work because their anxiety disease and/or depression is causing them to feel ill enough not to function? If I were a gambler, I would stake a bet that the stats are very low when it comes to employee-employer relations, and sharing the truth about these illnesses. I would love for others to prove me wrong- yes, seriously!"}, {"8eab": "Image courtesy of Jopwell"}, {"6327": "I was talking to someone today about this issue, which prompted me to write this post, and one thing we deduced- the brain is an organ just like any organ in the body. Without your brain, many of your vital organs would cease to function. So, why is there is still such a stigma attached to mental health issues? I would love to read one day that the term ‘mental health’ has been replaced with a more appropriate term like- MEDICAL HEALTH. Until that day arrives, if it ever does people will continue to be stigmatized, misunderstood, and possibly retreat from ‘treatment’ that is vital to their physical health. If your mental health goes untreated, it will affect your physical health."}, {"8627": "Depression Costs U.S. Workplaces $23 Billion in Absenteeism"}, {"db4f": "These findings are based on Gallup-Healthways Well-Being Index data collected between Jan. 2 2011 and Dec. 30, 2012. Gallup surveyed 237,615 full-time employees (those who work at least 30 hours per week) and 66,010 part-time employees during this time period."}, {"a57f": "For leaders of organizations, proven strategies for improving the mental health of employees generally involve the allocation of resources"}, {"7147": "According to a gallup poll early identification and treatment, employee assistance programs, efforts to culturally de-stigmatize depression and its treatment in the workplace, and management education for addressing depression and its causes are proven strategies for improving mental health within an organization. If more employers utilize these strategies, they may find employees are missing less time on the job."}, {"6a6c": "How important is destigmatizing mental health issues to your Organization?"}, {"ca7f": "The 20 million dollar question, at what point do employers recognize that getting treatment for mental health is just as vital as getting treatment for kidney disease as one of many examples? Wouldn’t validation from your employer make you feel as though it’s OK to seek out treatment just as quickly as one would with a bonafide medical illness? Wouldn’t this drive down medical costs, and time lost at work if people were embraced to seek treatment early on?"}, {"d794": "We all get depressed from time to time, and everyone experiences anxiety, you just need to learn how to deal with it."}, {"8144": "I’m going to bet (well I’m fairly certain) most people would not be told they need to ‘learn to deal with it,” if they had cancer, heart disease, a lung disease, shingles, diabetes and on the list goes. I’m fairly certain the few physical diseases mentioned would be viewed by an employer as a legitimate illness. Mental health ILLNESSES, on the other hand, are viewed by many as a weakness and the person should ‘just suck it up’, and nothing more. I’m sure there are some companies/employers who are educated enough to know the difference."}, {"acbe": "DO YOU HAVE VALUABLE, INTELLIGENT EMPLOYEES YOU WANT TO RETAIN?"}, {"9595": "Learn more about mental health issues, and how it affects those who suffer in silence because many do! Many suffer because they don’t want a label attached to them. They don’t want to be viewed as the ‘weak link.’ The point is- they shouldn’t have to feel as though they are the weak link. It’s time to stop the stigma attached to mental health issues that affect so many in our society today."}, {"7899": "“Shit people say to people with Mental Illness”"}, {"0bb6": "I’d like to leave you with a video that’s not only enlightening but a parody of things people say to others who are suffering. The gal who put this video together also suffered from depression and anxiety. She’s young, highly educated, and wants to stop the stigma. I hope others can take a moment to view her video. After you view this you’ll either be extremely amused or have a deeper understanding for those who suffer in silence."}, {"9e1e": "If you are suffering in silence"}, {"2d9b": "I strongly recommend following Rachels blogs on Wordpress, she’s extremely intelligent and doesn’t mince words. If you are an employer overlooking the fact the fact that in 2015 one out of 4 people suffer from depression, I also recommend reading some of her blogs."}, {"b81f": "My goal- to enlighten & empower. I hope in some way I’ve been able to do one or the other. My hope is that one day employees feel as free to share that they are dealing with a sucky brain illness, and their employer understands. Why should anyone feel ostracized for being ill, think about it?!"}, {"d8c4": "If you use twitter and hope to lessen the stigma attached to mental illnesses, please use the hashtag #EndTheStigma or #WeHaveApples."}, {"65fd": "If you work with someone that is dealing with a ‘brain illness,’ please try to empathize, and understand they are not in control of their illness. Treat them with kindness as you would with someone that has diabetes. Encourage your co-worker to seek medical help."}, {"99ef": "Originally posted on Wordpress"}], "child": "2142_1\t2142_2\t2142_3\t2142_4\t2142_5\t2142_6\t2142_7\t2142_8\t2142_9", "parent": "", "title": "Are You Able To Talk To Your Boss About Depression?", "content": "Are You Able To Talk To Your Boss About Depression? Many Employers still don’t understand that Depression is an illness which leads to Anxiety Disorder or vice versa. Unsplash.com by Jeremy Bishop How many Employers or those in leadership roles recognize that depression and anxiety disorder are highly prevalent? Do most employers think of depression and/or anxiety as a medical issue? Have you been stigmatized on the job because you do suffer from depression or anxiety? If you’re afraid of the stigma, do you suffer in silence- making up excuses for days missed on the job? I won’t be in today because I have the stomach flu According to the NIMH in 2013, an estimated 15.7 million adults aged 18 or older in the U.S. had at least one major depressive episode in the past year. This represented 6.7 percent of all U.S. adults. If you view the graph on the NIMH’s site, you will see that depression is on the rise, not decline. Hi, I won’t be in to work today, because I’m suffering from depression. I need to leave work early, because my anxiety disorder is making it impossible for me to function I’m curious just how many employers have actually received a call from one of their employees stating they can’t work because they are ill from depression? If you did receive that call, how did you react? Has anyone felt they were able to express their need to leave work because their anxiety disease and/or depression is causing them to feel ill enough not to function? If I were a gambler, I would stake a bet that the stats are very low when it comes to employee-employer relations, and sharing the truth about these illnesses. I would love for others to prove me wrong- yes, seriously! Image courtesy of Jopwell I was talking to someone today about this issue, which prompted me to write this post, and one thing we deduced- the brain is an organ just like any organ in the body. Without your brain, many of your vital organs would cease to function. So, why is there is still such a stigma attached to mental health issues? I would love to read one day that the term ‘mental health’ has been replaced with a more appropriate term like- MEDICAL HEALTH. Until that day arrives, if it ever does people will continue to be stigmatized, misunderstood, and possibly retreat from ‘treatment’ that is vital to their physical health. If your mental health goes untreated, it will affect your physical health. Depression Costs U.S. Workplaces $23 Billion in Absenteeism These findings are based on Gallup-Healthways Well-Being Index data collected between Jan. 2 2011 and Dec. 30, 2012. Gallup surveyed 237,615 full-time employees (those who work at least 30 hours per week) and 66,010 part-time employees during this time period. For leaders of organizations, proven strategies for improving the mental health of employees generally involve the allocation of resources According to a gallup poll early identification and treatment, employee assistance programs, efforts to culturally de-stigmatize depression and its treatment in the workplace, and management education for addressing depression and its causes are proven strategies for improving mental health within an organization. If more employers utilize these strategies, they may find employees are missing less time on the job. How important is destigmatizing mental health issues to your Organization? The 20 million dollar question, at what point do employers recognize that getting treatment for mental health is just as vital as getting treatment for kidney disease as one of many examples? Wouldn’t validation from your employer make you feel as though it’s OK to seek out treatment just as quickly as one would with a bonafide medical illness? Wouldn’t this drive down medical costs, and time lost at work if people were embraced to seek treatment early on? We all get depressed from time to time, and everyone experiences anxiety, you just need to learn how to deal with it. I’m going to bet (well I’m fairly certain) most people would not be told they need to ‘learn to deal with it,” if they had cancer, heart disease, a lung disease, shingles, diabetes and on the list goes. I’m fairly certain the few physical diseases mentioned would be viewed by an employer as a legitimate illness. Mental health ILLNESSES, on the other hand, are viewed by many as a weakness and the person should ‘just suck it up’, and nothing more. I’m sure there are some companies/employers who are educated enough to know the difference. DO YOU HAVE VALUABLE, INTELLIGENT EMPLOYEES YOU WANT TO RETAIN? Learn more about mental health issues, and how it affects those who suffer in silence because many do! Many suffer because they don’t want a label attached to them. They don’t want to be viewed as the ‘weak link.’ The point is- they shouldn’t have to feel as though they are the weak link. It’s time to stop the stigma attached to mental health issues that affect so many in our society today. “Shit people say to people with Mental Illness” I’d like to leave you with a video that’s not only enlightening but a parody of things people say to others who are suffering. The gal who put this video together also suffered from depression and anxiety. She’s young, highly educated, and wants to stop the stigma. I hope others can take a moment to view her video. After you view this you’ll either be extremely amused or have a deeper understanding for those who suffer in silence. If you are suffering in silence I strongly recommend following Rachels blogs on Wordpress, she’s extremely intelligent and doesn’t mince words. If you are an employer overlooking the fact the fact that in 2015 one out of 4 people suffer from depression, I also recommend reading some of her blogs. My goal- to enlighten & empower. I hope in some way I’ve been able to do one or the other. My hope is that one day employees feel as free to share that they are dealing with a sucky brain illness, and their employer understands. Why should anyone feel ostracized for being ill, think about it?! If you use twitter and hope to lessen the stigma attached to mental illnesses, please use the hashtag #EndTheStigma or #WeHaveApples. If you work with someone that is dealing with a ‘brain illness,’ please try to empathize, and understand they are not in control of their illness. Treat them with kindness as you would with someone that has diabetes. Encourage your co-worker to seek medical help. Originally posted on Wordpress ", "name": "2142"}