{"sentences": [{"b56b": "Easing Overwhelm with More Space"}, {"1d91": "A couple weeks ago, I was feeling overwhelmed. I’m sure it happens to everyone, especially during the holiday season — you’re too busy to even think. It was difficult for me to find time to make dinner, walk the dog, and clean the house, let alone prepare to teach yoga classes and work on my Celebrant projects."}, {"3349": "The things that I really want to do take a lot of time and mental space. How could I find more time for the activities that feed my soul, when I barely had time for what I needed to do? The answer could not be to add more to my schedule."}, {"7cd3": "Image courtesy of Unsplash"}, {"7652": "And then I had a revelation while driving around, running errands: what I need is more space, not more time. I immediately turned the radio off. I used that 20-minute drive to just pay attention to what I was doing. And immediately, ideas started popping into my head about the class I wanted to teach that night."}, {"dfe7": "I started looking at all of my time differently. No more podcasts during walks with the dog — that is now 40 minutes a day for watching the change in seasons, looking at clouds, and laughing at my dog. Along the way, I naturally start to process, dream, plan, and mentally create."}, {"d3a5": "It makes me more efficient with the time I have. I feel less frenzied. Less frustrated. Now, when I have time to do something I want to do, like writing a blog post, I actually have ideas in my head."}, {"f582": "We can all use a reprieve from overwhelm during the holidays. Here are some ways you may be able to find more space:"}, {"e703": "How do you find more mental space when you’re feeling overwhelmed?"}, {"b724": "Originally published at www.carolynwalkley.com on December 20, 2016."}], "child": "2147_1\t2147_22147_1\t2147_2", "parent": "", "title": "Easing Overwhelm with More Space", "content": "Easing Overwhelm with More Space A couple weeks ago, I was feeling overwhelmed. I’m sure it happens to everyone, especially during the holiday season — you’re too busy to even think. It was difficult for me to find time to make dinner, walk the dog, and clean the house, let alone prepare to teach yoga classes and work on my Celebrant projects. The things that I really want to do take a lot of time and mental space. How could I find more time for the activities that feed my soul, when I barely had time for what I needed to do? The answer could not be to add more to my schedule. Image courtesy of Unsplash And then I had a revelation while driving around, running errands: what I need is more space, not more time. I immediately turned the radio off. I used that 20-minute drive to just pay attention to what I was doing. And immediately, ideas started popping into my head about the class I wanted to teach that night. I started looking at all of my time differently. No more podcasts during walks with the dog — that is now 40 minutes a day for watching the change in seasons, looking at clouds, and laughing at my dog. Along the way, I naturally start to process, dream, plan, and mentally create. It makes me more efficient with the time I have. I feel less frenzied. Less frustrated. Now, when I have time to do something I want to do, like writing a blog post, I actually have ideas in my head. We can all use a reprieve from overwhelm during the holidays. Here are some ways you may be able to find more space: How do you find more mental space when you’re feeling overwhelmed? Originally published at www.carolynwalkley.com on December 20, 2016. ", "name": "2147"}