{"sentences": [{"e298": "Your Sleep Probably Shaped How You Saw ‘The Dress’"}, {"3461": "But the verdict is still out on whether it was blue and black or white and gold."}, {"4d0c": "The viral sensation that was “The Dress” (the one that divided friends and family alike) is back. A vision scientist has revived the dress drama by suggesting that how you interpreted the color-quandary depends on whether you’re a lark or a night owl."}, {"5fab": "Scientist Pascal Wallisch, a clinical assistant professor of psychology at New York University, used the dress as the focal point of a new survey of 13,000 people aimed at figuring out why some of us saw blue and black while others saw white and gold. The findings were published in the Journal of Vision."}, {"f46f": "Image courtesy of Twitter"}, {"79c2": "According to Wallisch, it all boils down to people’s assumptions about the lighting in the photo and how those assumptions might be linked to their sleep style. Wallisch writes on Slate that “owls were more likely to assume that the lighting was artificial, not natural,” which means they thought the dress was in shadow and reported that it was blue and black. Self-described larks, on the other hand, were more likely to assume the dress was not in shadow and thus saw the dress as white and gold."}, {"7193": "As intriguing as this theory is, it’s not clear whether this solves the most important mystery of our time. Meaning both owls and larks will continue to wonder what color that dress really was."}, {"e321": "Read more on Slate."}], "child": "2148_1", "parent": "", "title": "Your Sleep Probably Shaped How You Saw ‘The Dress’", "content": "Your Sleep Probably Shaped How You Saw ‘The Dress’ But the verdict is still out on whether it was blue and black or white and gold. The viral sensation that was “The Dress” (the one that divided friends and family alike) is back. A vision scientist has revived the dress drama by suggesting that how you interpreted the color-quandary depends on whether you’re a lark or a night owl. Scientist Pascal Wallisch, a clinical assistant professor of psychology at New York University, used the dress as the focal point of a new survey of 13,000 people aimed at figuring out why some of us saw blue and black while others saw white and gold. The findings were published in the Journal of Vision. Image courtesy of Twitter According to Wallisch, it all boils down to people’s assumptions about the lighting in the photo and how those assumptions might be linked to their sleep style. Wallisch writes on Slate that “owls were more likely to assume that the lighting was artificial, not natural,” which means they thought the dress was in shadow and reported that it was blue and black. Self-described larks, on the other hand, were more likely to assume the dress was not in shadow and thus saw the dress as white and gold. As intriguing as this theory is, it’s not clear whether this solves the most important mystery of our time. Meaning both owls and larks will continue to wonder what color that dress really was. Read more on Slate. ", "name": "2148"}