{"sentences": [{"0687": "Here’s The Reason Deep Breathing Calms You Down"}, {"f042": "There’s science behind the power of your breath."}, {"2768": "You’ve probably been told to take a deep breath when you’re feeling stressed or anxious. New research published in the journal Science suggests you heed that advice, offering novel insights on how breathing affects the brain and body, specifically during moments of stress."}, {"fd2e": "Our breathing is controlled by a “cluster of brain cells,” as Quartz explains in a piece about the findings. Researchers from Stanford and the University of California-San Francisco wanted to find out if certain “subtypes” of neurons are responsible for specific types of breathing (like regular breathing, excited breathing, laughing or sobbing), so they removed a cluster of neurons from mice brains to see how the mice behaved afterward. The researchers anticipated that the mice would start breathing erratically, but instead the mice “had become chill. Mellow fellows,” Krasnow told NPR."}, {"14ca": "Image courtesy of Unsplash"}, {"b570": "Here’s why, according to the researchers. Without these specific neurons, the mices’ arousal level (aka how stressed they were) and their breathing were no longer connected, and since they weren’t receiving messages from the parts of the brain that normally rile them up, their breathing didn’t speed up. Essentially, the researchers discovered a feedback loop between breath and the brain — stress affects breathing and vice versa."}, {"faef": "As NPR reports, past research has found that practices like meditation and yoga — which often include slow, measured breathing — can help alleviate symptoms of depression and anxiety. But until now, the physiological reasons why this happens were unclear."}, {"b9c3": "While this new study has limitations (mice can’t tell us how mellow they actually felt) the findings are important as they could lead to physical treatments for anxiety and depression. Until then, when stress strikes, remember to slow down and take a deep breath."}, {"17f4": "Read more on Quartz."}], "child": "2151_1", "parent": "", "title": "Here’s The Reason Deep Breathing Calms You Down", "content": "Here’s The Reason Deep Breathing Calms You Down There’s science behind the power of your breath. You’ve probably been told to take a deep breath when you’re feeling stressed or anxious. New research published in the journal Science suggests you heed that advice, offering novel insights on how breathing affects the brain and body, specifically during moments of stress. Our breathing is controlled by a “cluster of brain cells,” as Quartz explains in a piece about the findings. Researchers from Stanford and the University of California-San Francisco wanted to find out if certain “subtypes” of neurons are responsible for specific types of breathing (like regular breathing, excited breathing, laughing or sobbing), so they removed a cluster of neurons from mice brains to see how the mice behaved afterward. The researchers anticipated that the mice would start breathing erratically, but instead the mice “had become chill. Mellow fellows,” Krasnow told NPR. Image courtesy of Unsplash Here’s why, according to the researchers. Without these specific neurons, the mices’ arousal level (aka how stressed they were) and their breathing were no longer connected, and since they weren’t receiving messages from the parts of the brain that normally rile them up, their breathing didn’t speed up. Essentially, the researchers discovered a feedback loop between breath and the brain — stress affects breathing and vice versa. As NPR reports, past research has found that practices like meditation and yoga — which often include slow, measured breathing — can help alleviate symptoms of depression and anxiety. But until now, the physiological reasons why this happens were unclear. While this new study has limitations (mice can’t tell us how mellow they actually felt) the findings are important as they could lead to physical treatments for anxiety and depression. Until then, when stress strikes, remember to slow down and take a deep breath. Read more on Quartz. ", "name": "2151"}