{"sentences": [{"d847": "How to Stop Your Brain From Sabotaging Your Goals"}, {"4e92": "Humans are clever creatures."}, {"0e36": "We thought up outer space travel, penicillin, and the Internet. We’ve come a long way in the past hundred years and consider ourselves the most intelligent beings around."}, {"1f36": "And yet, we make irrational decisions to this day."}, {"e127": "We rather stay at a job where we’re unhappy than pursue something else. We don’t start working on a project for months until only a few days are left. We do things that will likely lead to regret down the road…so why do we do them?"}, {"7609": "Image courtesy of Pixabay"}, {"f421": "We’re Not as in Control as We Think"}, {"3b75": "We like to think that we are logical and rational about our decisions. If a problem comes up, we think through each step carefully and find a way to resolve it."}, {"b15d": "That may be true some of the time. But more often than not, we act first, then think later. As a result, we perform an action, and then find a way to logically make sense of it in what is known as the attitude follows behavior principle."}, {"b1d8": "A group of participants in a study were asked to hold a pencil between their teeth as they watched cartoons, which forced them to a smile. Another group of participants were asked to hold the pencil between their lips without touching the teeth, causing them to frown as they watched cartoons."}, {"53a1": "As a result, the participants forced to smile perceived the cartoons as funnier than those forced to frown."}, {"e779": "In real life, the attitude-behavior principle leads to bigger implications. Even if we genuinely want to do something, external circumstances or our emotions get the best of us, causing us to rationalize poor decisions."}, {"7cc0": "For instance, you might:"}, {"a540": "In all of these instances, we do things to feel better in the short-term without taking into full consideration the long-term consequences."}, {"92d0": "We may live to regret our choices down the road, but since we’re doing fine right now, so there’s little incentive for long term thinking."}, {"1851": "It seems silly now to see the rationale behind poor choices. It’s as if we have different personalities waging a war inside of us, pulling us in different directions."}, {"b9e2": "In a sense, that’s exactly what’s happening."}, {"94e2": "The Three Brain Networks"}, {"fc3c": "Humans have three separate components of the brain that act very differently from one another. Over a long period of time, a newer layer developed over the older component to form the modern human brain."}, {"b547": "The first layer, known as the basal ganglia or “reptilian brain”, is the oldest of the three. It focuses on survival, such as nourishment, reproduction, and threat avoidance. While that’s all good, this part of our brain is averse to changes and can be stubborn to the suggestions of other parts of the brain."}, {"3ee5": "The limbic brain emerged next, and it focuses on our emotional responses to situations. The limbic brain causes us to make snap judgments based on past experiences and memories. While these emotions and reactions can protect us, they can also be unfair judges."}, {"9b56": "Finally, the neocortex is the newest part of the brain. It focuses on complex skills such as rational thinking, creativity, and languages. We have the neocortex to thank largely for civilization’s advancements."}, {"dd9c": "These three layers communicate with each other and influence our thoughts and decisions. Unfortunately, the older, powerful parts of our brain can work against what’s best for us."}, {"5a0c": "How Your Brain Makes Decisions"}, {"d640": "As soon as a situation pops up, the three parts of our brain try to resolve the issue in different ways. For instance, let’s say you walk into a room and see a molten lava cake oozing with chocolate sauce."}, {"af06": "You start to salivate (just writing this makes me hungry). Your reptilian brain sees food, while your limbic brain imagines how delicious it would be to bite into the cake."}, {"9618": "On the other hand, your rational neocortex sees the calorie-dense cake and says, “Hold on a second. I’m supposed to be watching my weight. And besides, I’m heading over to Jane’s place tonight, where there will be tons of food and dessert.”"}, {"39d2": "Back before modern civilization was around, eating the cake (or whatever food was around) was a wise decision, since you never knew when the next meal would be. Today though, eating everything you see leads to weight and health problems."}, {"4b05": "So which part of our brain wins in the end? It depends on the scenario. Research from Princeton University concludes that impulsive choices happen when the emotional part of our brains triumphs over the logical one."}, {"b095": "When people get really close to obtaining a reward, their emotional brain takes over. So if a chocolate cake is staring right at you, things will get dicey."}, {"9ad4": "“Our emotional brain has a hard time imagining the future, even though our logical brain clearly sees the future consequences of our current actions,” says Laibson at Harvard University. “Our emotional brain wants to max out the credit card, order dessert and smoke a cigarette. Our logical brain knows we should save for retirement, go for a jog and quit smoking.”"}, {"32d1": "When we see, touch, or smell something that we really want, the temptation is too great to resist. We act impulsively because the dopamine in our brains gets all fired up. When our brain has calmed down afterward, though, we end up regretting our actions."}, {"3986": "Make Peace in Times of War"}, {"2ee0": "With all these temptations, it seems like you and I are doomed to eat whatever we want, shy away from opportunities, and spend lavishly outside our budget. What hope is there if our brains are working against us?"}, {"7d56": "Don’t despair just yet. There’s good news."}, {"6875": "For one, we get wiser as we grow up. Our cortex helps us delay gratification in favor of long-term rewards. As children, this part of the brain isn’t quite developed, which is why kids have a harder time resisting the marshmallow than adults do."}, {"647b": "When we go through our teenage and adult years, our cortex develops and matures, which can then communicate better with the other parts of our brain."}, {"100d": "While that’s an improvement, we still easily get seduced by the bag of Doritos nearby."}, {"f25c": "Here are some methods that I’ve used to help my brain do what’s best for me in the long run."}, {"2106": "1. Manage your environment."}, {"67e1": "I’ve noticed that cravings happen most often when I see an object. My brain then thinks, “I want that!” Since I’ve placed healthier snacks and food nearby, I don’t need to expend energy trying to resist temptation."}, {"e9fe": "Managing your surroundings also works when you want to achieve an important goal. Since I made writing a regular habit, I talk to like-minded people and have resources at hand to help me with this skill. Doing so makes it easier to keep going."}, {"1c68": "2. Tend to basic needs."}, {"48f0": "If possible, find ways to work with your reptilian and limbic brains, not against them. Even if the older parts of your brain don’t always work in your best interest, it doesn’t mean they’re evil. The best way to tend to their needs is to maintain your energy levels."}, {"be7d": "Feeling tired? Take a nap or get more rest. Is your stomach grumbling? Eat balanced meals throughout the day. Cranky from stress? Go and play. When your energy levels aren’t being taken care of, your mood drops and your reasoning skills worsen."}, {"bafa": "3. Tie emotion to your goals."}, {"daf1": "Our emotions can easily overpower any logic deduction skills we have. So if you really want to start creating a habit, then associate it with an emotion. For instance, if you forget to floss your teeth, put a sign up reminding yourself that cavities are painful."}, {"7e7b": "On the other hand, if you find it hard to work on a project, find ways to make it exciting. You can also picture how your life will benefit from completing a task."}, {"28c3": "4. Just do it."}, {"d1e2": "When we feel nervous or scared of doing something, we often try to talk ourselves into becoming more confident. While this method helps boost up our self-esteem, there comes a point when you just have to jump."}, {"544c": "In my case, I felt nervous about sending cold emails to reach out to strangers. I tried to reason to my fears about why it wouldn’t be so bad. But eventually, I just had to go ahead and do it. Now, I don’t mind sending cold emails and actually see it as a fun process."}, {"8ca1": "Tip the Scales In Your Favor"}, {"4fa7": "Our decisions are often driven by factors outside of logic and reasoning. Distractions and emotions can lead us away from where we want to go."}, {"f1bf": "But if you can find ways to get parts of the brain to cooperate and behave according to your goals, then you’re well on your way to tipping the scales back in your favor."}, {"b2cf": "Let’s Connect"}, {"5ede": "If you want to move closer to your goals, then check out my guide How to Get Anything You Want."}, {"b340": "Click here to get the guide."}, {"8b4e": "Enjoy the “not this, then that” strategy to overcoming setbacks!"}, {"84f0": "Show Some Love"}, {"e375": "If you enjoyed this article, please click the💚 below to show your appreciation. Thank you!"}], "child": "2152_1\t2152_2\t2152_3\t2152_4\t2152_52152_1\t2152_2\t2152_3\t2152_4\t2152_5", "parent": "", "title": "How to Stop Your Brain From Sabotaging Your Goals", "content": "How to Stop Your Brain From Sabotaging Your Goals Humans are clever creatures. We thought up outer space travel, penicillin, and the Internet. We’ve come a long way in the past hundred years and consider ourselves the most intelligent beings around. And yet, we make irrational decisions to this day. We rather stay at a job where we’re unhappy than pursue something else. We don’t start working on a project for months until only a few days are left. We do things that will likely lead to regret down the road…so why do we do them? Image courtesy of Pixabay We’re Not as in Control as We Think We like to think that we are logical and rational about our decisions. If a problem comes up, we think through each step carefully and find a way to resolve it. That may be true some of the time. But more often than not, we act first, then think later. As a result, we perform an action, and then find a way to logically make sense of it in what is known as the attitude follows behavior principle. A group of participants in a study were asked to hold a pencil between their teeth as they watched cartoons, which forced them to a smile. Another group of participants were asked to hold the pencil between their lips without touching the teeth, causing them to frown as they watched cartoons. As a result, the participants forced to smile perceived the cartoons as funnier than those forced to frown. In real life, the attitude-behavior principle leads to bigger implications. Even if we genuinely want to do something, external circumstances or our emotions get the best of us, causing us to rationalize poor decisions. For instance, you might: In all of these instances, we do things to feel better in the short-term without taking into full consideration the long-term consequences. We may live to regret our choices down the road, but since we’re doing fine right now, so there’s little incentive for long term thinking. It seems silly now to see the rationale behind poor choices. It’s as if we have different personalities waging a war inside of us, pulling us in different directions. In a sense, that’s exactly what’s happening. The Three Brain Networks Humans have three separate components of the brain that act very differently from one another. Over a long period of time, a newer layer developed over the older component to form the modern human brain. The first layer, known as the basal ganglia or “reptilian brain”, is the oldest of the three. It focuses on survival, such as nourishment, reproduction, and threat avoidance. While that’s all good, this part of our brain is averse to changes and can be stubborn to the suggestions of other parts of the brain. The limbic brain emerged next, and it focuses on our emotional responses to situations. The limbic brain causes us to make snap judgments based on past experiences and memories. While these emotions and reactions can protect us, they can also be unfair judges. Finally, the neocortex is the newest part of the brain. It focuses on complex skills such as rational thinking, creativity, and languages. We have the neocortex to thank largely for civilization’s advancements. These three layers communicate with each other and influence our thoughts and decisions. Unfortunately, the older, powerful parts of our brain can work against what’s best for us. How Your Brain Makes Decisions As soon as a situation pops up, the three parts of our brain try to resolve the issue in different ways. For instance, let’s say you walk into a room and see a molten lava cake oozing with chocolate sauce. You start to salivate (just writing this makes me hungry). Your reptilian brain sees food, while your limbic brain imagines how delicious it would be to bite into the cake. On the other hand, your rational neocortex sees the calorie-dense cake and says, “Hold on a second. I’m supposed to be watching my weight. And besides, I’m heading over to Jane’s place tonight, where there will be tons of food and dessert.” Back before modern civilization was around, eating the cake (or whatever food was around) was a wise decision, since you never knew when the next meal would be. Today though, eating everything you see leads to weight and health problems. So which part of our brain wins in the end? It depends on the scenario. Research from Princeton University concludes that impulsive choices happen when the emotional part of our brains triumphs over the logical one. When people get really close to obtaining a reward, their emotional brain takes over. So if a chocolate cake is staring right at you, things will get dicey. “Our emotional brain has a hard time imagining the future, even though our logical brain clearly sees the future consequences of our current actions,” says Laibson at Harvard University. “Our emotional brain wants to max out the credit card, order dessert and smoke a cigarette. Our logical brain knows we should save for retirement, go for a jog and quit smoking.” When we see, touch, or smell something that we really want, the temptation is too great to resist. We act impulsively because the dopamine in our brains gets all fired up. When our brain has calmed down afterward, though, we end up regretting our actions. Make Peace in Times of War With all these temptations, it seems like you and I are doomed to eat whatever we want, shy away from opportunities, and spend lavishly outside our budget. What hope is there if our brains are working against us? Don’t despair just yet. There’s good news. For one, we get wiser as we grow up. Our cortex helps us delay gratification in favor of long-term rewards. As children, this part of the brain isn’t quite developed, which is why kids have a harder time resisting the marshmallow than adults do. When we go through our teenage and adult years, our cortex develops and matures, which can then communicate better with the other parts of our brain. While that’s an improvement, we still easily get seduced by the bag of Doritos nearby. Here are some methods that I’ve used to help my brain do what’s best for me in the long run. 1. Manage your environment. I’ve noticed that cravings happen most often when I see an object. My brain then thinks, “I want that!” Since I’ve placed healthier snacks and food nearby, I don’t need to expend energy trying to resist temptation. Managing your surroundings also works when you want to achieve an important goal. Since I made writing a regular habit, I talk to like-minded people and have resources at hand to help me with this skill. Doing so makes it easier to keep going. 2. Tend to basic needs. If possible, find ways to work with your reptilian and limbic brains, not against them. Even if the older parts of your brain don’t always work in your best interest, it doesn’t mean they’re evil. The best way to tend to their needs is to maintain your energy levels. Feeling tired? Take a nap or get more rest. Is your stomach grumbling? Eat balanced meals throughout the day. Cranky from stress? Go and play. When your energy levels aren’t being taken care of, your mood drops and your reasoning skills worsen. 3. Tie emotion to your goals. Our emotions can easily overpower any logic deduction skills we have. So if you really want to start creating a habit, then associate it with an emotion. For instance, if you forget to floss your teeth, put a sign up reminding yourself that cavities are painful. On the other hand, if you find it hard to work on a project, find ways to make it exciting. You can also picture how your life will benefit from completing a task. 4. Just do it. When we feel nervous or scared of doing something, we often try to talk ourselves into becoming more confident. While this method helps boost up our self-esteem, there comes a point when you just have to jump. In my case, I felt nervous about sending cold emails to reach out to strangers. I tried to reason to my fears about why it wouldn’t be so bad. But eventually, I just had to go ahead and do it. Now, I don’t mind sending cold emails and actually see it as a fun process. Tip the Scales In Your Favor Our decisions are often driven by factors outside of logic and reasoning. Distractions and emotions can lead us away from where we want to go. But if you can find ways to get parts of the brain to cooperate and behave according to your goals, then you’re well on your way to tipping the scales back in your favor. Let’s Connect If you want to move closer to your goals, then check out my guide How to Get Anything You Want. Click here to get the guide. Enjoy the “not this, then that” strategy to overcoming setbacks! Show Some Love If you enjoyed this article, please click the💚 below to show your appreciation. Thank you! ", "name": "2152"}