{"sentences": [{"8b70": "This Is Why Our Sleep Gets Worse With Age"}, {"da21": "Experts say this is a problem we have to talk about."}, {"6df4": "Older people tend to sleep less, and while we’ve known this for some time, a new review of research published in Neuron today shows that the problem goes far deeper than we thought: Aging actually makes it harder to get the restorative sleep that’s essential for health."}, {"10ac": "The review reports that as we get older, the part of our brain that regulates sleep start to wear away, making it hard to get non-REM sleep — the type of sleep that’s key to memory and cognition. There may be a link between diseases we become prone to with age — like dementia — and an inability to get the right kind of restorative sleep."}, {"6d33": "Lack of sleep may explain a lot about what happens to our minds and bodies as we age, as review co-author Matthew Walker, Ph.D., who leads the Sleep and Neuroimaging Laboratory at the University of California Berkeley, said in the review’s press release. “Every one of the major diseases that are killing us in first-world nations — from diabetes to obesity to Alzheimer’s to cancer — have strong causal links to a lack of sleep,” Walker says, adding that our likelihood of developing these diseases increases with age."}, {"6fe6": "This deterioration of deep sleep starts early — sometimes in our mid-thirties — and we often don’t notice the change. As the review’s press release outlines, the loss of deep sleep has “long flown under the radar,” in part because older adults’ brains may be accustomed to being sleep-deprived, so they might not report sleeplessness to their doctors."}, {"1fd9": "The review authors emphasize that individuals experience sleep loss at different rates — women experience less deterioration of deep non-REM than men, for example — but non-REM sleep seems to be particularly vulnerable. (It’s not exactly clear why this is the case.)"}, {"0814": "The findings shed light on what has been a relatively undiscussed trend: “Sleep decline is one of the most dramatic physiological changes that occurs as we age,” Walker says in the press release, “yet that demonstrable change is not part of the health conversation today.” While more research needs to be done to figure out how we can combat age-related sleep deterioration, the review authors have some suggestions in the meantime. The best strategy, they say, is to cultivate healthy sleep hygiene, including setting a consistent bedtime, avoiding caffeine in the afternoon and limiting other sleep disruptors like alcohol."}, {"9a89": "Read more about the review here."}], "child": "2159_1\t2159_2\t2159_3", "parent": "", "title": "This Is Why Our Sleep Gets Worse With Age", "content": "This Is Why Our Sleep Gets Worse With Age Experts say this is a problem we have to talk about. Older people tend to sleep less, and while we’ve known this for some time, a new review of research published in Neuron today shows that the problem goes far deeper than we thought: Aging actually makes it harder to get the restorative sleep that’s essential for health. The review reports that as we get older, the part of our brain that regulates sleep start to wear away, making it hard to get non-REM sleep — the type of sleep that’s key to memory and cognition. There may be a link between diseases we become prone to with age — like dementia — and an inability to get the right kind of restorative sleep. Lack of sleep may explain a lot about what happens to our minds and bodies as we age, as review co-author Matthew Walker, Ph.D., who leads the Sleep and Neuroimaging Laboratory at the University of California Berkeley, said in the review’s press release. “Every one of the major diseases that are killing us in first-world nations — from diabetes to obesity to Alzheimer’s to cancer — have strong causal links to a lack of sleep,” Walker says, adding that our likelihood of developing these diseases increases with age. This deterioration of deep sleep starts early — sometimes in our mid-thirties — and we often don’t notice the change. As the review’s press release outlines, the loss of deep sleep has “long flown under the radar,” in part because older adults’ brains may be accustomed to being sleep-deprived, so they might not report sleeplessness to their doctors. The review authors emphasize that individuals experience sleep loss at different rates — women experience less deterioration of deep non-REM than men, for example — but non-REM sleep seems to be particularly vulnerable. (It’s not exactly clear why this is the case.) The findings shed light on what has been a relatively undiscussed trend: “Sleep decline is one of the most dramatic physiological changes that occurs as we age,” Walker says in the press release, “yet that demonstrable change is not part of the health conversation today.” While more research needs to be done to figure out how we can combat age-related sleep deterioration, the review authors have some suggestions in the meantime. The best strategy, they say, is to cultivate healthy sleep hygiene, including setting a consistent bedtime, avoiding caffeine in the afternoon and limiting other sleep disruptors like alcohol. Read more about the review here. ", "name": "2159"}