{"name": "216", "parent": "", "content": "Your Second Death And How To Transcend It By: John P. Weiss Ted Strollo was an Italian immigrant and master wood carver who who came to California for a better life. He had few possessions, no family and no job. He built a little cabin in the woods above Los Gatos. He drank acorn coffee. He was a kind man and a master wood worker. Out of a single piece of wood he created an amazing sculpture with perfect cylindrical balls in the middle. He called the piece his “mystery tree of life.” Ted Strollo and his cabin in the woods Ted Strollo’s life was a quiet and solitary one, until the day he was struck by a vehicle and hurled twenty feet through the air. The mystery tree of life My father, an administrative law judge, was on his way home from work when he witnessed the accident. He pulled over and rendered aid as best he could. He followed the ambulance to the hospital and spoke to the police and doctors. My father learned that the victim was an Italian immigrant named Ted Strollo, and that he had no family. He discovered that Ted had no money for legal representation, so he decided to intervene and help. Ted spent over a month at our home recuperating. He stayed in our guest room and my mother prepared his meals and did his laundry. When he recovered my father found him an affordable apartment and secured some state benefits. We used to visit Ted on weekends. My father would buy him Stella Dora cookies and new socks. Dad once told me, “Johnny, the elderly are often forgotten and overlooked. They have much to teach us, if we’re willing to take the time and listen.” I never forgot that. Before Ted Strollo passed away he gave my father his prized wooden sculpture, the “mystery tree of life.” We kept it in our family for many years before Dad donated it to an Italian cultural society. The son became the father My father lost his battle with dementia and renal complications in 2004. It had been a difficult couple of years for me. In many ways, the father became the son and the son became the father. I was so thankful I had the opportunity to be there for him. Respectfully visiting my father, Judge John B. Weiss I shepherded my father through his medical odyssey and handled all the legal arrangements for my mother. We held a beautiful memorial, buried Dad and tried to return to our daily lives. I read once about something called, “the second death.” When we die, our loved ones live on and remember us. They reminisce about the past and our lives together. They look at the old photographs. Sometimes they pass down stories about us to their grandchildren. But eventually, we are forgotten. And that is our “second death. ” The super power in us all Each of us holds a super power within us. Not the kind of super power we see in Spiderman movies. It’s a real super power that can be wielded by young and old alike. I watched my father use his superpower the day he helped Ted Strollo and brought him home to recuperate. My mother used her superpower too, cooking and caring for Ted. What is this mysterious super power? Kindness towards others. Each of us has the power to improve the lives of others. Whether serving the hungry in a soup kitchen, nursing an Italian immigrant back to health, or helping your kids with their homework. Perhaps we will never know how our charitable actions help redirect a wayward soul. Maybe our kindnesses will be forgotten with subsequent generations as we approach our “second death.” That’s okay. True heroes don’t act for personal glory but for the greater good. Who knows how many acts of kindness my father set in motion by helping Ted Strollo? How many people did Ted Strollo positively touch in his remaining years? A sort of grace in this world We may never know, but kindness and charitable actions towards others produce a sort of grace in this world. Such actions make the world a better place. They elevate humanity. We may forget the names of these angels on earth who selflessly help others, but through their kindnesses and charity they make a difference. When we emulate them, we inch a bit closer to the divine. And that is a much greater thing than personal legacy. Learn to wield your superpower. Your act of kindness today may help someone assist another tomorrow. A positive chain reaction will bloom, thus improving the lives of many down through the generations. People who spread kindness and charity among others may never see the positive ripples, but they contribute to the best of us. In this way we transcend our “second death” and become part of the eternal dignity of mankind. Now what? I draw cartoons, paint landscapes and write about life. And I enjoy sharing it with you. If you’d like to receive more articles like this, visit here. ", "title": "Your Second Death And How To Transcend It", "sentences": [{"86ed": "Your Second Death And How To Transcend It"}, {"02e7": "By: John P. Weiss"}, {"3496": "Ted Strollo was an Italian immigrant and master wood carver who who came to California for a better life. He had few possessions, no family and no job."}, {"9b21": "He built a little cabin in the woods above Los Gatos. He drank acorn coffee. He was a kind man and a master wood worker. Out of a single piece of wood he created an amazing sculpture with perfect cylindrical balls in the middle. He called the piece his “mystery tree of life.”"}, {"cabc": "Ted Strollo and his cabin in the woods"}, {"17f7": "Ted Strollo’s life was a quiet and solitary one, until the day he was struck by a vehicle and hurled twenty feet through the air."}, {"7495": "The mystery tree of life"}, {"a6a6": "My father, an administrative law judge, was on his way home from work when he witnessed the accident. He pulled over and rendered aid as best he could. He followed the ambulance to the hospital and spoke to the police and doctors."}, {"71a7": "My father learned that the victim was an Italian immigrant named Ted Strollo, and that he had no family. He discovered that Ted had no money for legal representation, so he decided to intervene and help."}, {"7594": "Ted spent over a month at our home recuperating. He stayed in our guest room and my mother prepared his meals and did his laundry. When he recovered my father found him an affordable apartment and secured some state benefits."}, {"2e32": "We used to visit Ted on weekends. My father would buy him Stella Dora cookies and new socks. Dad once told me, “Johnny, the elderly are often forgotten and overlooked. They have much to teach us, if we’re willing to take the time and listen.” I never forgot that."}, {"03ac": "Before Ted Strollo passed away he gave my father his prized wooden sculpture, the “mystery tree of life.” We kept it in our family for many years before Dad donated it to an Italian cultural society."}, {"5b31": "The son became the father"}, {"f434": "My father lost his battle with dementia and renal complications in 2004. It had been a difficult couple of years for me. In many ways, the father became the son and the son became the father. I was so thankful I had the opportunity to be there for him."}, {"2731": "Respectfully visiting my father, Judge John B. Weiss"}, {"9d4a": "I shepherded my father through his medical odyssey and handled all the legal arrangements for my mother. We held a beautiful memorial, buried Dad and tried to return to our daily lives."}, {"f3a0": "I read once about something called, “the second death.” When we die, our loved ones live on and remember us. They reminisce about the past and our lives together. They look at the old photographs."}, {"bf6d": "Sometimes they pass down stories about us to their grandchildren. But eventually, we are forgotten. And that is our “second death. ”"}, {"7d2f": "The super power in us all"}, {"11ce": "Each of us holds a super power within us. Not the kind of super power we see in Spiderman movies. It’s a real super power that can be wielded by young and old alike."}, {"6bbe": "I watched my father use his superpower the day he helped Ted Strollo and brought him home to recuperate. My mother used her superpower too, cooking and caring for Ted."}, {"3074": "What is this mysterious super power? Kindness towards others."}, {"cb10": "Each of us has the power to improve the lives of others. Whether serving the hungry in a soup kitchen, nursing an Italian immigrant back to health, or helping your kids with their homework."}, {"6e09": "Perhaps we will never know how our charitable actions help redirect a wayward soul. Maybe our kindnesses will be forgotten with subsequent generations as we approach our “second death.”"}, {"b58c": "That’s okay. True heroes don’t act for personal glory but for the greater good."}, {"f16b": "Who knows how many acts of kindness my father set in motion by helping Ted Strollo? How many people did Ted Strollo positively touch in his remaining years?"}, {"d41e": "A sort of grace in this world"}, {"69fa": "We may never know, but kindness and charitable actions towards others produce a sort of grace in this world. Such actions make the world a better place. They elevate humanity."}, {"6be6": "We may forget the names of these angels on earth who selflessly help others, but through their kindnesses and charity they make a difference."}, {"8cc1": "When we emulate them, we inch a bit closer to the divine. And that is a much greater thing than personal legacy."}, {"d37e": "Learn to wield your superpower. Your act of kindness today may help someone assist another tomorrow. A positive chain reaction will bloom, thus improving the lives of many down through the generations."}, {"3351": "People who spread kindness and charity among others may never see the positive ripples, but they contribute to the best of us."}, {"da91": "In this way we transcend our “second death” and become part of the eternal dignity of mankind."}, {"1ee1": "Now what?"}, {"bbaf": "I draw cartoons, paint landscapes and write about life. And I enjoy sharing it with you. If you’d like to receive more articles like this, visit here."}], "child": "216_1\t216_2\t216_3\t216_4\t216_5\t216_6\t216_7\t216_8\t216_9\t216_10\t216_11\t216_12\t216_13\t216_14\t216_15\t216_16\t216_17"}