{"sentences": [{"87ab": "How Writing About Negative Experiences Helps You Move Past Them"}, {"000e": "By Susan David, PhD"}, {"15a2": "James Pennebaker, a distinguished professor at the University of Texas, got married right out of college in the early 70s. Three years after his marriage, he and his wife started to question their relationship, and Pennebaker, confused and unsettled, sank into a depression. He ate less, drank more, and started smoking. Embarrassed by what he saw as emotional weakness, he became more and more isolated."}, {"15b5": "Image courtesy of Pixabay"}, {"d472": "One morning about a month into this decline, Pennebaker climbed out of bed and sat down at a typewriter. He stared at the machine for a moment, then started writing freely and frankly about his marriage, his parents, his sexuality, his career, and even death."}, {"d28e": "As he wrote, and continued to write in the days that followed, something fascinating happened. His depression lifted and he felt liberated. He began to reconnect with his deep love for his wife. But the writing had an even farther-reaching impact. For the first time, he started to see the purpose and possibilities in his life."}, {"9842": "Pennebaker’s own experience getting through this rocky period sparked 40 years of research about the links between writing and emotional processing. Over and over again Pennebaker did studies in which he divided people into two groups and asked some to write about emotionally significant experiences, and the others to write about common things: their shoes, or maybe the cars passing on the street. Both groups wrote for the same span — about 20- minutes a day, three days in a row."}, {"d039": "In Pennebaker’s experiments, some participants wrote about sexual abuse by once-trusted family members; some about catastrophic failures; others about the devastating losses of their deepest relationships through breakups, illness, and death. One woman described unfathomable guilt stemming from an incident that had happened when she was 10. She’d left a toy on the floor on which her grandmother had slipped and fallen, ultimately leading to the grandmother’s death. Another man wrote about a warm summery night when he was nine years old. His father had taken him outside and calmly announced that having children had been the biggest mistake of his life, and that he was leaving."}, {"4105": "In each study, Pennebaker found that the people who wrote about emotionally charged episodes experienced marked improvement in their physical and mental well-being. They were happier, less depressed and less anxious. In the months after the writing sessions, they had lower blood pressure, improved immune function, and fewer visits to the doctor. They also reported better relationships, improved memory, and more success at work."}, {"bb53": "When I first discovered Pennebaker’s research, I was struck by the way it echoed my own teenage experience journaling about my father’s cancer. While my father was dying, and then when he was gone, my life was painfully different, and the writing helped me voice my regret about all the time I hadn’t spent with him and the all the things I hadn’t said. I also wrote about the moments I didn’t regret, and how I’d given what I could. Through that writing, I learned to sit with all of my emotions, both the pleasant and unpleasant ones. This, in turn, gave me insight into myself, the most important revelation being, “I am resilient.” I realized that I can live with my full self, even the parts I’m not so thrilled about."}, {"9366": "Still, I was skeptical of Pennebaker’s results, which seemed too good to be true. How could writing for just 20 minutes a day for three days have such a positive and lasting effect on people’s lives? I kept Pennebaker’s research tagged in my notebooks: then, many years later when I was doing my Ph.D. on emotions I had a chance dinner with him. This meeting led to much animated discussion, after which I took a deeper dive into his work."}, {"6272": "I read about an intervention Pennebaker had conducted at a Dallas computer company that laid off one hundred senior engineers. Most of these were men over 50 who’d worked at the company since college. This was the only work life they knew, and getting pushed out had left them panicked and confused. They faced the real likelihood of never working in their field again. After four months, not one of them had found a new job."}, {"86c7": "Pennebaker and his team wondered if writing about their experiences could help the ‘downsized’ engineers. Eager to try anything that might help their employment prospects, the engineers agreed to participate. Pennebaker had one group of engineers write about being laid- off. They delved into their feelings of humiliation, rejection and outrage; the related strains on their health, marriages and finances and their deep worries about the future. Two control groups either wrote about time management or didn’t write at all."}, {"091e": "Before the writing began, there were no differences between the groups in terms of motivation, or in the effort they were making to land a new job. But afterward, the degree of change between them was astonishing. Just months after the emotionally charged writing sessions, the men who had delved into how they truly felt were three times more likely to have been reemployed compared with those who had not. Not only did the writing help the men process their experiences, it helped them step out from their despondent inertia and into meaningful action."}, {"5c1e": "After many more studies, with many thousands of participants — children and the elderly, students and professionals, healthy and ill –we can say with confidence that showing up and applying words to emotions is a tremendously helpful way to deal with stress, anxiety, and loss. (For people who don’t like putting pen to paper or fingers to keyboard, there is nothing magical about the act of writing. Talking into a voice recorder, for example, can deliver the same results.)"}, {"f114": "But after showing up, there’s another critical aspect of agility: Stepping out. Deeper analysis over the years shows that unlike brooders or bottlers, or those who let it all hang out in big venting rants, the writers who thrived the most began to develop insight, using phrases such as “I have learned,” “It struck me that,” “the reason that,” “I now realize,” and “I understand.” In the process of writing, they were able to create the distance between the thinker and the thought, the feeler and the feeling, that allowed them to gain a new perspective, unhook, and move forward."}, {"1173": "Make no mistake: these people had not found a way to enjoy being betrayed, lost, jobless, or critically ill. But by dissolving the entanglement that had built up between their impulses and their actions to see their experience in context, and from a broader perspective, they flourished despite it all. More often than you might expect, they found ways of turning these obstacles into opportunities to connect more directly with their deepest values."}, {"40ca": "Pennebaker’s Writing Rules."}, {"43c4": "Set a timer for 20 minutes. Open up your notebook (or begin a document on your computer.) When the timer starts, begin writing about your emotional experiences from the past week, month and year. Don’t worry about punctuation, sloppiness or coherence. Simply go wherever your mind takes you, curiously and without judgment. Write just for yourself, and not for some eventual reader. Do this for a few days. Then, close the document without saving it, or throw the paper away. Or stick it in a bottle and cast it out to sea. Or if you’re ready, start a blog or find a literary agent. It doesn’t matter. The point is that those thoughts are now out of you and on the page. You have begun the process of ‘stepping out’ from your experience to gain perspective on it."}, {"e457": "Excerpted from EMOTIONAL AGILITY by arrangement with Avery Books, a member of Penguin Group (USA) LLC, A Penguin Random House Company. Copyright © 2016, Susan David PhD."}, {"d992": "For a limited time, the eBook version of Emotional Agility is available for $1.99 on all major retailers (Amazon Kindle, Barnes & Noble Nook, Google Play, iBooks, and Kobo). Emotional Agility will help you live your most successful life whoever you are and whatever you face. Get your copy, and start your emotional agility journey today."}, {"34dc": "Over 50,000 people have taken the Emotional Agility Insight Quiz. It’s free — just a few minutes, and you get a 10 page report."}], "child": "2161_12161_1", "parent": "", "title": "How Writing About Negative Experiences Helps You Move Past Them", "content": "How Writing About Negative Experiences Helps You Move Past Them By Susan David, PhD James Pennebaker, a distinguished professor at the University of Texas, got married right out of college in the early 70s. Three years after his marriage, he and his wife started to question their relationship, and Pennebaker, confused and unsettled, sank into a depression. He ate less, drank more, and started smoking. Embarrassed by what he saw as emotional weakness, he became more and more isolated. Image courtesy of Pixabay One morning about a month into this decline, Pennebaker climbed out of bed and sat down at a typewriter. He stared at the machine for a moment, then started writing freely and frankly about his marriage, his parents, his sexuality, his career, and even death. As he wrote, and continued to write in the days that followed, something fascinating happened. His depression lifted and he felt liberated. He began to reconnect with his deep love for his wife. But the writing had an even farther-reaching impact. For the first time, he started to see the purpose and possibilities in his life. Pennebaker’s own experience getting through this rocky period sparked 40 years of research about the links between writing and emotional processing. Over and over again Pennebaker did studies in which he divided people into two groups and asked some to write about emotionally significant experiences, and the others to write about common things: their shoes, or maybe the cars passing on the street. Both groups wrote for the same span — about 20- minutes a day, three days in a row. In Pennebaker’s experiments, some participants wrote about sexual abuse by once-trusted family members; some about catastrophic failures; others about the devastating losses of their deepest relationships through breakups, illness, and death. One woman described unfathomable guilt stemming from an incident that had happened when she was 10. She’d left a toy on the floor on which her grandmother had slipped and fallen, ultimately leading to the grandmother’s death. Another man wrote about a warm summery night when he was nine years old. His father had taken him outside and calmly announced that having children had been the biggest mistake of his life, and that he was leaving. In each study, Pennebaker found that the people who wrote about emotionally charged episodes experienced marked improvement in their physical and mental well-being. They were happier, less depressed and less anxious. In the months after the writing sessions, they had lower blood pressure, improved immune function, and fewer visits to the doctor. They also reported better relationships, improved memory, and more success at work. When I first discovered Pennebaker’s research, I was struck by the way it echoed my own teenage experience journaling about my father’s cancer. While my father was dying, and then when he was gone, my life was painfully different, and the writing helped me voice my regret about all the time I hadn’t spent with him and the all the things I hadn’t said. I also wrote about the moments I didn’t regret, and how I’d given what I could. Through that writing, I learned to sit with all of my emotions, both the pleasant and unpleasant ones. This, in turn, gave me insight into myself, the most important revelation being, “I am resilient.” I realized that I can live with my full self, even the parts I’m not so thrilled about. Still, I was skeptical of Pennebaker’s results, which seemed too good to be true. How could writing for just 20 minutes a day for three days have such a positive and lasting effect on people’s lives? I kept Pennebaker’s research tagged in my notebooks: then, many years later when I was doing my Ph.D. on emotions I had a chance dinner with him. This meeting led to much animated discussion, after which I took a deeper dive into his work. I read about an intervention Pennebaker had conducted at a Dallas computer company that laid off one hundred senior engineers. Most of these were men over 50 who’d worked at the company since college. This was the only work life they knew, and getting pushed out had left them panicked and confused. They faced the real likelihood of never working in their field again. After four months, not one of them had found a new job. Pennebaker and his team wondered if writing about their experiences could help the ‘downsized’ engineers. Eager to try anything that might help their employment prospects, the engineers agreed to participate. Pennebaker had one group of engineers write about being laid- off. They delved into their feelings of humiliation, rejection and outrage; the related strains on their health, marriages and finances and their deep worries about the future. Two control groups either wrote about time management or didn’t write at all. Before the writing began, there were no differences between the groups in terms of motivation, or in the effort they were making to land a new job. But afterward, the degree of change between them was astonishing. Just months after the emotionally charged writing sessions, the men who had delved into how they truly felt were three times more likely to have been reemployed compared with those who had not. Not only did the writing help the men process their experiences, it helped them step out from their despondent inertia and into meaningful action. After many more studies, with many thousands of participants — children and the elderly, students and professionals, healthy and ill –we can say with confidence that showing up and applying words to emotions is a tremendously helpful way to deal with stress, anxiety, and loss. (For people who don’t like putting pen to paper or fingers to keyboard, there is nothing magical about the act of writing. Talking into a voice recorder, for example, can deliver the same results.) But after showing up, there’s another critical aspect of agility: Stepping out. Deeper analysis over the years shows that unlike brooders or bottlers, or those who let it all hang out in big venting rants, the writers who thrived the most began to develop insight, using phrases such as “I have learned,” “It struck me that,” “the reason that,” “I now realize,” and “I understand.” In the process of writing, they were able to create the distance between the thinker and the thought, the feeler and the feeling, that allowed them to gain a new perspective, unhook, and move forward. Make no mistake: these people had not found a way to enjoy being betrayed, lost, jobless, or critically ill. But by dissolving the entanglement that had built up between their impulses and their actions to see their experience in context, and from a broader perspective, they flourished despite it all. More often than you might expect, they found ways of turning these obstacles into opportunities to connect more directly with their deepest values. Pennebaker’s Writing Rules. Set a timer for 20 minutes. Open up your notebook (or begin a document on your computer.) When the timer starts, begin writing about your emotional experiences from the past week, month and year. Don’t worry about punctuation, sloppiness or coherence. Simply go wherever your mind takes you, curiously and without judgment. Write just for yourself, and not for some eventual reader. Do this for a few days. Then, close the document without saving it, or throw the paper away. Or stick it in a bottle and cast it out to sea. Or if you’re ready, start a blog or find a literary agent. It doesn’t matter. The point is that those thoughts are now out of you and on the page. You have begun the process of ‘stepping out’ from your experience to gain perspective on it. Excerpted from EMOTIONAL AGILITY by arrangement with Avery Books, a member of Penguin Group (USA) LLC, A Penguin Random House Company. Copyright © 2016, Susan David PhD. For a limited time, the eBook version of Emotional Agility is available for $1.99 on all major retailers (Amazon Kindle, Barnes & Noble Nook, Google Play, iBooks, and Kobo). Emotional Agility will help you live your most successful life whoever you are and whatever you face. Get your copy, and start your emotional agility journey today. Over 50,000 people have taken the Emotional Agility Insight Quiz. It’s free — just a few minutes, and you get a 10 page report. ", "name": "2161"}