{"sentences": [{"6df1": "Unlikely Dance Partners"}, {"a10a": "When Science And Art Form Policy Movements"}, {"0846": "Michael (not his real name) is tall with graying hair and deep-set eyes that close when he talks about a wild child youth studying comparative literature at Columbia University in New York in the 1970s. A sensitive dance artist, now in his early 60s, he accesses movement vocabulary that alternates between tenderness and more percussive gestural phrasing. Michael also has Parkinson’s disease."}, {"1020": "Some people view Parkinson’s as a disability; as many as one million Americans have been diagnosed. Others view the disease as one more identity marker that allows an individual to contribute something unique to an artistic process."}, {"9d6b": "All is a dance film recently produced by Los Angeles-based Flexsus Studios that captures diverse movers’ individual qualities through embodied storytelling. Professional dancers and students perform movement phrases alongside Michael, other dancers with Parkinson’s, and their caretakers to create on-screen narratives about the meaning of “home” and how memory shapes our sense of physical spaces."}, {"6ace": "Sarah Cullen Fuller, a leader on All, said, “This wasn’t therapy designed to mitigate symptoms — this was the artistic process as intervention.”"}, {"154f": "However, choreographers for the film drew upon principles of the Brain Dance to develop dancers’ solo performances. The Brain Dance, developed by Seattle-based dance artist and teacher Anne Green Gilbert in 2000, emphasizes eight movement patterns grounded in neurological functioning and designed to reorient people’s understanding of natural movement."}, {"ea19": "Brain Dance practitioners suggest that individuals with disrupted central nervous systems can develop better proprioception, balance, attention, memory, eye-tracking, sensory integration, and motor skills by regularly performing the movement cycle."}, {"304e": "Recently the wife of U.S. Vice President Mike Pence, Karen Pence, announced her intention to raise awareness about the healing power of art therapy, standing in contrast to President Donald Trump administration’s position on the value of art in American culture."}, {"4318": "Overall, the therapeutic impact of the arts on health is not well understood or widely valued. Research methodologies vary widely, sample sizes are too small, control groups are limited, and extrapolating clear lessons from data is difficult."}, {"bc91": "One relatively unexplored research area where the science of art therapy and performance might connect is within the various practices that promote opportunities for dancers with disabilities — or physically integrated dance."}, {"b27d": "Studies on dance and autism spectrum disorder, Parkinson’s, hypertension, cancer, schizophrenia, depression in older adults, quality of life in long-term care settings, and sexual abuse survivors, represent only a slice of the research on some aspect of movement therapy."}, {"3e5c": "Notable however, is that most art therapy research happens in clinical settings not in dance studios or theaters. The possible health benefits that might result from a community of artists working together on a project ultimately presented for the public, is largely unexplored."}, {"abef": "As a professional performance artist, choreographer of twenty years, and professor of dance at Loyola University Chicago, I suggest that community based professional and training programs connect within a broader network of researchers — especially where their work intersects on disability politics and equity. These partnerships might inspire new ways of thinking about art therapy, provide increased funding and visibility for all collaborators, and lead to far-reaching program developments or policy changes."}, {"4c40": "The stateside convening on physically integrated dance in 2016 coincided with the 25th anniversary of the Americans with Disabilities Act. The same year, Dance/NYC launched an initiative to expand inclusion and access to dance for disabled people with the explicit goals of funding integrated dance in the New York City area. The group is developing quantitative and qualitative analyses at the nexus of disability and dance; increasing targeted leadership training; and publishing a directory of online resources."}, {"62f6": "Teams with reliable research and clinical experts along with professional arts practitioners are needed if this kind of data is to be utilized and applied to programming and policymaking."}, {"8d95": "On the other side of the research spectrum, dance companies such as Oakland’s AXIS Dance Company, DanceAbility International in Oregon, Infinity Dance in New York, and Cleveland’s Dancing Wheels are redefining the ways a body’s movement can be explored as an artistic medium. Part of Axis’ mission includes “championing access, inclusion, and equity for people with disabilities in dance and in the wider community”."}, {"1ac2": "Moving Southwark by Jevan Chowdhury"}, {"20e4": "Unfortunately, these companies and others like them are largely invisible in the world of scientific research. The American Dance Therapy Association, an organization founded in 1966 to support the emerging profession, defines dance therapy solely in terms of “behavior as it emerges in the therapeutic relationship”. The website includes little language related to creative processes and none of the twenty research studies posted on the forum pages between 2016–2017 mention partnerships with professional dance companies."}, {"6122": "It appears that scientists are not looking at movement therapy with aesthetics in mind and dance artists are not honing their craft for therapeutic purposes."}, {"69aa": "However, a mixed methods approach to big questions about disease, dysfunction and disability might revolutionize our cultural experience of these issues in both artistic and medical fields."}, {"cf0e": "Disabled artists are competing within an environment of scarcity. Judith Smith, co-founder of Axis says, “When resources are limited, people are less willing to share. Physically integrated dance companies are like every other dance company: we are competing for performers and funding.”"}, {"5dd9": "If Karen Pence is interested in making art therapy a signature issue, one key first step might be in the support of professional artists."}, {"9806": "Many of the artists who participated in All reported they found the experience transformative. People told stories; the filming validated these stories and connected participants in profound ways."}, {"121c": "Given the uncertain future of affordable healthcare in the U.S., the urgent need for innovation is acute. Research embedded within a creative process like dance filmmaking or choreography created for the stage might open up new fields of study and interventions — as well as support for working artists. That way everyone benefits from the knowledge gained through the partnerships of science and art."}], "child": "2165_1", "parent": "", "title": "Unlikely Dance Partners", "content": "Unlikely Dance Partners When Science And Art Form Policy Movements Michael (not his real name) is tall with graying hair and deep-set eyes that close when he talks about a wild child youth studying comparative literature at Columbia University in New York in the 1970s. A sensitive dance artist, now in his early 60s, he accesses movement vocabulary that alternates between tenderness and more percussive gestural phrasing. Michael also has Parkinson’s disease. Some people view Parkinson’s as a disability; as many as one million Americans have been diagnosed. Others view the disease as one more identity marker that allows an individual to contribute something unique to an artistic process. All is a dance film recently produced by Los Angeles-based Flexsus Studios that captures diverse movers’ individual qualities through embodied storytelling. Professional dancers and students perform movement phrases alongside Michael, other dancers with Parkinson’s, and their caretakers to create on-screen narratives about the meaning of “home” and how memory shapes our sense of physical spaces. Sarah Cullen Fuller, a leader on All, said, “This wasn’t therapy designed to mitigate symptoms — this was the artistic process as intervention.” However, choreographers for the film drew upon principles of the Brain Dance to develop dancers’ solo performances. The Brain Dance, developed by Seattle-based dance artist and teacher Anne Green Gilbert in 2000, emphasizes eight movement patterns grounded in neurological functioning and designed to reorient people’s understanding of natural movement. Brain Dance practitioners suggest that individuals with disrupted central nervous systems can develop better proprioception, balance, attention, memory, eye-tracking, sensory integration, and motor skills by regularly performing the movement cycle. Recently the wife of U.S. Vice President Mike Pence, Karen Pence, announced her intention to raise awareness about the healing power of art therapy, standing in contrast to President Donald Trump administration’s position on the value of art in American culture. Overall, the therapeutic impact of the arts on health is not well understood or widely valued. Research methodologies vary widely, sample sizes are too small, control groups are limited, and extrapolating clear lessons from data is difficult. One relatively unexplored research area where the science of art therapy and performance might connect is within the various practices that promote opportunities for dancers with disabilities — or physically integrated dance. Studies on dance and autism spectrum disorder, Parkinson’s, hypertension, cancer, schizophrenia, depression in older adults, quality of life in long-term care settings, and sexual abuse survivors, represent only a slice of the research on some aspect of movement therapy. Notable however, is that most art therapy research happens in clinical settings not in dance studios or theaters. The possible health benefits that might result from a community of artists working together on a project ultimately presented for the public, is largely unexplored. As a professional performance artist, choreographer of twenty years, and professor of dance at Loyola University Chicago, I suggest that community based professional and training programs connect within a broader network of researchers — especially where their work intersects on disability politics and equity. These partnerships might inspire new ways of thinking about art therapy, provide increased funding and visibility for all collaborators, and lead to far-reaching program developments or policy changes. The stateside convening on physically integrated dance in 2016 coincided with the 25th anniversary of the Americans with Disabilities Act. The same year, Dance/NYC launched an initiative to expand inclusion and access to dance for disabled people with the explicit goals of funding integrated dance in the New York City area. The group is developing quantitative and qualitative analyses at the nexus of disability and dance; increasing targeted leadership training; and publishing a directory of online resources. Teams with reliable research and clinical experts along with professional arts practitioners are needed if this kind of data is to be utilized and applied to programming and policymaking. On the other side of the research spectrum, dance companies such as Oakland’s AXIS Dance Company, DanceAbility International in Oregon, Infinity Dance in New York, and Cleveland’s Dancing Wheels are redefining the ways a body’s movement can be explored as an artistic medium. Part of Axis’ mission includes “championing access, inclusion, and equity for people with disabilities in dance and in the wider community”. Moving Southwark by Jevan Chowdhury Unfortunately, these companies and others like them are largely invisible in the world of scientific research. The American Dance Therapy Association, an organization founded in 1966 to support the emerging profession, defines dance therapy solely in terms of “behavior as it emerges in the therapeutic relationship”. The website includes little language related to creative processes and none of the twenty research studies posted on the forum pages between 2016–2017 mention partnerships with professional dance companies. It appears that scientists are not looking at movement therapy with aesthetics in mind and dance artists are not honing their craft for therapeutic purposes. However, a mixed methods approach to big questions about disease, dysfunction and disability might revolutionize our cultural experience of these issues in both artistic and medical fields. Disabled artists are competing within an environment of scarcity. Judith Smith, co-founder of Axis says, “When resources are limited, people are less willing to share. Physically integrated dance companies are like every other dance company: we are competing for performers and funding.” If Karen Pence is interested in making art therapy a signature issue, one key first step might be in the support of professional artists. Many of the artists who participated in All reported they found the experience transformative. People told stories; the filming validated these stories and connected participants in profound ways. Given the uncertain future of affordable healthcare in the U.S., the urgent need for innovation is acute. Research embedded within a creative process like dance filmmaking or choreography created for the stage might open up new fields of study and interventions — as well as support for working artists. That way everyone benefits from the knowledge gained through the partnerships of science and art. ", "name": "2165"}