{"sentences": [{"420c": "Stop These 4 Common Beliefs Now to Think More Clearly"}, {"cc89": "A long, long time ago, in a world unknown, there were two browsers that ruled internet surfing: Netscape and Internet Explorer; and search engines such as Alta Vista and Excite. They were the kings of Internet browsing."}, {"23c0": "Then more browsers came along: Safari, Firefox, and then Chrome. And with them more search engines. You might have heard of Google. And Bing. And Yahoo is still with us."}, {"0b07": "Google is by far the best search engine we have seen yet, but it would have been very easy to think, “Alta Vista and Excite and Yahoo are already out there, how am I going to compete with them?” And the same reasoning could be applied to building a new browser, but the architects of Firefox and Chrome didn’t let the fact that there were already successful browsers out there stop them."}, {"d504": "The Scrub Daddy is a sponge that won a deal on Shark Tank and is now in every Bed, Bath, & Beyond. Was anyone siting around unhappy with their sponges? Not really, but one person was and they decided to do something about it. The Scrub Daddy is now a huge success."}, {"f930": "Look at the juice market, or the chips market, or the confectionary market, or the hummus market. New brands are always entering the fray and they are gaining shelf space among the giants."}, {"1969": "Of course it’s better to build something the world has never seen, but the truth is, there is very little the world hasn’t seen, and so what? That doesn’t mean you can’t find a niche in whatever it is you aim to build or build something better than the world has ever seen."}, {"b4e4": "The Illusion of Limited Resources"}, {"7c98": "I’m always working as though there’s a finish line and if I don’t get there first someone else will; they’ll win the prize, they’ll take the business I would have won, make the money I would have made, get the rewards I would have received and then there will be nothing left for me or anyone else."}, {"c174": "This attitude creates an anticipatory anxiety that is neither good for business or personal health. It also happens to be a false premise."}, {"b8f7": "The truth is there is always enough to go around for everyone. The belief that there are limited resources and/or opportunities for each of us to be successful is the very belief that will keep success at bay."}, {"af83": "Here are the 4 reasons why, along with ways you can counteract getting in your own way."}, {"c5bc": "The Self-Serving Bias"}, {"41cd": "This bias is the tendency to attribute positive outcomes to our own behavior and negative outcomes to external factors. It is a great way to exonerate yourself and blame the world for why you didn’t get what you want."}, {"ca9e": "For example, your business scores a huge sale and you think, “I did this!” Conversely, your business doesn’t score the huge sale and you think, “They/that did this to me!” It is a self-preservation technique to protect your ego."}, {"4963": "This is biased thinking, meaning it is flawed, and it mentally places the responsibility for your life into the hands of others rather than yourself, even though — ultimately — it is always you who is to credit for your successes and your failures."}, {"ab33": "Protecting your ego is nice but it also prevents you from seeing the facts, dealing with them and having the information you need to make better decisions. When you start blaming, you start losing."}, {"abf6": "Blame creates a feeling of helplessness, that despite your best efforts the world was out to thwart you, so what’s the point. If you feel like everything is futile and there’s no point in pursuing your goals because clearly the world wants to see you fall then you will not have the motivation and willpower to do anything but live a status quo life. You’ll make a living, go through the motions, and in the end hand over the keys to your self-worth to the external world."}, {"afe7": "To persevere you need to keep your willpower intact. And to keep your willpower intact you need to stay motivated."}, {"5230": "Your Beliefs Affect Your Energy Level"}, {"fede": "We begin each day with a full reserve of willpower and as we go through the day and make choices, do our work, complete tasks and so on, our willpower is depleted. It behooves us to keep our willpower reserve as in tact as possible so that we can stay focused and accomplish our goals."}, {"2ee0": "A 2011 study performed by Kathleen D. Vohs, Roy F. Baumeister, and Brandon J. Schmeichel did a study on the effect of our beliefs and motivations on ego depletion."}, {"7efa": "According to the study, “When the [ego] depletion is slight, there is ample and profound room for subjective beliefs and motivations to moderate the effects” but also that “no person can continue running or swimming forever no matter how much he or she may be motivated.”"}, {"62ec": "Meaning, if we are only mildly depleted and we maintain strong self-efficacy we can keep that fatigue from overpowering us. Conversely, if we lack self-efficacy, the fatigue can gain momentum and further deplete our willpower. But at a certain point of exhaustion it doesn’t matter how much we believe in ourselves."}, {"6772": "So, if you’re extremely exhausted it will not matter if you believe someone else’s success has erased your potential, but if you’re not extremely exhausted — the state in which we all typically begin our days — then believing someone else’s success has erased your potential can have a deleterious effect on your willpower, energy level, and ability to stay focused and accomplish your goals."}, {"593d": "It thus stands to reason that you might as well give yourself the best chance you can by A) getting the rest you need and B) starting your day motivated, believing there is a space for you in this world to be successful and achieve your goals."}, {"1bc8": "I want to drive home the point that motivation and self-efficacy can keep your ego depletion at bay."}, {"e142": "Image courtesy of Unsplash"}, {"c788": "Nothing Begets Nothing"}, {"3282": "There are unlimited resources for the things we don’t want to come true."}, {"c0da": "A backwards example of how momentum creates the goals you aspire to achieve is the fact that believing it can’t happen creates the reality where it doesn’t happen."}, {"31d0": "We build whole lives where things we want don’t happen because we don’t try to make them happen because we believe they won’t happen whether we do or don’t try."}, {"12f2": "That in itself is proof of success: we’ve become very good at proving nothing will happen with zero effort."}, {"e105": "The reverse is also true: things happen when you work to make them happen. Why wouldn’t they? Be smart about it, work diligently, get a coach or advisor, learn from others that have done it already, and get crackin’."}, {"142b": "Keep Your Eyes to Yourself"}, {"9094": "You want to stay focused while you’re building your career or business or working towards a goal. What does wishing you had what others do have to do with your goals?"}, {"9024": "You have a limited amount of energy given to you each day and you want to use that wisely. You will be shooting yourself in the foot if you expend your energy on what you don’t have, or focusing on what others have."}, {"9a23": "Instead, use your energy to focus on what you want and what you’re grateful you have already. This strengthens the foundation you’ve already created and builds upon it for what you want to come to you in the future."}, {"0d77": "I don’t mean to suggest that every idea is a winner. Failure is part of life, but the path to failure is part of the path towards success. You’ll learn what to do and not do for the next venture. The key is to start, stay focused, with your eye on the prize, and put in the effort."}, {"431e": "I’d love to hear about your own experiences, thoughts, and beliefs for clear thinking. Please share!"}, {"82e6": "If you enjoyed this article, please click the heart! ❤"}, {"1848": "Follow Nicole on Twitter, Facebook, LinkedIn, and Instagram."}, {"3f50": "Nicole Lipkin, Psy.D., MBA is an organizational psychologist and the CEO of Equilibria Leadership Consulting. She is the author of “What Keeps Leaders Up At Night” and the co-author of “Y in the Workplace: Managing the ‘Me First’ Generation.”"}], "child": "2175_1\t2175_22175_1\t2175_2", "parent": "", "title": "Stop These 4 Common Beliefs Now to Think More Clearly", "content": "Stop These 4 Common Beliefs Now to Think More Clearly A long, long time ago, in a world unknown, there were two browsers that ruled internet surfing: Netscape and Internet Explorer; and search engines such as Alta Vista and Excite. They were the kings of Internet browsing. Then more browsers came along: Safari, Firefox, and then Chrome. And with them more search engines. You might have heard of Google. And Bing. And Yahoo is still with us. Google is by far the best search engine we have seen yet, but it would have been very easy to think, “Alta Vista and Excite and Yahoo are already out there, how am I going to compete with them?” And the same reasoning could be applied to building a new browser, but the architects of Firefox and Chrome didn’t let the fact that there were already successful browsers out there stop them. The Scrub Daddy is a sponge that won a deal on Shark Tank and is now in every Bed, Bath, & Beyond. Was anyone siting around unhappy with their sponges? Not really, but one person was and they decided to do something about it. The Scrub Daddy is now a huge success. Look at the juice market, or the chips market, or the confectionary market, or the hummus market. New brands are always entering the fray and they are gaining shelf space among the giants. Of course it’s better to build something the world has never seen, but the truth is, there is very little the world hasn’t seen, and so what? That doesn’t mean you can’t find a niche in whatever it is you aim to build or build something better than the world has ever seen. The Illusion of Limited Resources I’m always working as though there’s a finish line and if I don’t get there first someone else will; they’ll win the prize, they’ll take the business I would have won, make the money I would have made, get the rewards I would have received and then there will be nothing left for me or anyone else. This attitude creates an anticipatory anxiety that is neither good for business or personal health. It also happens to be a false premise. The truth is there is always enough to go around for everyone. The belief that there are limited resources and/or opportunities for each of us to be successful is the very belief that will keep success at bay. Here are the 4 reasons why, along with ways you can counteract getting in your own way. The Self-Serving Bias This bias is the tendency to attribute positive outcomes to our own behavior and negative outcomes to external factors. It is a great way to exonerate yourself and blame the world for why you didn’t get what you want. For example, your business scores a huge sale and you think, “I did this!” Conversely, your business doesn’t score the huge sale and you think, “They/that did this to me!” It is a self-preservation technique to protect your ego. This is biased thinking, meaning it is flawed, and it mentally places the responsibility for your life into the hands of others rather than yourself, even though — ultimately — it is always you who is to credit for your successes and your failures. Protecting your ego is nice but it also prevents you from seeing the facts, dealing with them and having the information you need to make better decisions. When you start blaming, you start losing. Blame creates a feeling of helplessness, that despite your best efforts the world was out to thwart you, so what’s the point. If you feel like everything is futile and there’s no point in pursuing your goals because clearly the world wants to see you fall then you will not have the motivation and willpower to do anything but live a status quo life. You’ll make a living, go through the motions, and in the end hand over the keys to your self-worth to the external world. To persevere you need to keep your willpower intact. And to keep your willpower intact you need to stay motivated. Your Beliefs Affect Your Energy Level We begin each day with a full reserve of willpower and as we go through the day and make choices, do our work, complete tasks and so on, our willpower is depleted. It behooves us to keep our willpower reserve as in tact as possible so that we can stay focused and accomplish our goals. A 2011 study performed by Kathleen D. Vohs, Roy F. Baumeister, and Brandon J. Schmeichel did a study on the effect of our beliefs and motivations on ego depletion. According to the study, “When the [ego] depletion is slight, there is ample and profound room for subjective beliefs and motivations to moderate the effects” but also that “no person can continue running or swimming forever no matter how much he or she may be motivated.” Meaning, if we are only mildly depleted and we maintain strong self-efficacy we can keep that fatigue from overpowering us. Conversely, if we lack self-efficacy, the fatigue can gain momentum and further deplete our willpower. But at a certain point of exhaustion it doesn’t matter how much we believe in ourselves. So, if you’re extremely exhausted it will not matter if you believe someone else’s success has erased your potential, but if you’re not extremely exhausted — the state in which we all typically begin our days — then believing someone else’s success has erased your potential can have a deleterious effect on your willpower, energy level, and ability to stay focused and accomplish your goals. It thus stands to reason that you might as well give yourself the best chance you can by A) getting the rest you need and B) starting your day motivated, believing there is a space for you in this world to be successful and achieve your goals. I want to drive home the point that motivation and self-efficacy can keep your ego depletion at bay. Image courtesy of Unsplash Nothing Begets Nothing There are unlimited resources for the things we don’t want to come true. A backwards example of how momentum creates the goals you aspire to achieve is the fact that believing it can’t happen creates the reality where it doesn’t happen. We build whole lives where things we want don’t happen because we don’t try to make them happen because we believe they won’t happen whether we do or don’t try. That in itself is proof of success: we’ve become very good at proving nothing will happen with zero effort. The reverse is also true: things happen when you work to make them happen. Why wouldn’t they? Be smart about it, work diligently, get a coach or advisor, learn from others that have done it already, and get crackin’. Keep Your Eyes to Yourself You want to stay focused while you’re building your career or business or working towards a goal. What does wishing you had what others do have to do with your goals? You have a limited amount of energy given to you each day and you want to use that wisely. You will be shooting yourself in the foot if you expend your energy on what you don’t have, or focusing on what others have. Instead, use your energy to focus on what you want and what you’re grateful you have already. This strengthens the foundation you’ve already created and builds upon it for what you want to come to you in the future. I don’t mean to suggest that every idea is a winner. Failure is part of life, but the path to failure is part of the path towards success. You’ll learn what to do and not do for the next venture. The key is to start, stay focused, with your eye on the prize, and put in the effort. I’d love to hear about your own experiences, thoughts, and beliefs for clear thinking. Please share! If you enjoyed this article, please click the heart! ❤ Follow Nicole on Twitter, Facebook, LinkedIn, and Instagram. Nicole Lipkin, Psy.D., MBA is an organizational psychologist and the CEO of Equilibria Leadership Consulting. She is the author of “What Keeps Leaders Up At Night” and the co-author of “Y in the Workplace: Managing the ‘Me First’ Generation.” ", "name": "2175"}