{"sentences": [{"c24e": "We Get From The World What We Invest In Ourselves"}, {"cfe8": "I heard a life-changing story the other day."}, {"6b84": "A man was sitting at the kitchen table, drinking his morning cup of coffee and reading the newspaper when he hears his son sprinting down the stairs."}, {"8454": "The man promised his son the day before that they would spend the entire day together, so he blocked off his schedule."}, {"e7f5": "He wasn’t quite finished with his routine so he thought of an idea to buy himself a little more time before he and his son took on the day."}, {"2e35": "He tore out a section of the newspaper a few pages back; it was a full-sized image of the world. He ripped up the page into twenty small pieces, put it on the glass table and said “let’s play a game, here’s a puzzle, as soon as you can put the picture of the world back together we will start our day.”"}, {"f584": "Then something amazing happened."}, {"c339": "Less than three minutes went by. His father looked up and to his immense astonishment, the boy had already put the world back together."}, {"20a8": "He of course asked him, “how have you managed to put the world back together so quickly?”"}, {"abb6": "His son explained that he had dropped one of the pieces on the floor. As he looked up through the glass table he noticed that there was a picture of a man on the other side of the world. He sat up, flipped all the pieces over, and focused on putting the man back together."}, {"d6ec": "Once he did that, the world just fell into place."}, {"1247": "You Are Your Greatest Investment"}, {"85df": "There is so much meaning and power in that story. When I first heard it, I absolutely teared up with inspirational emotion."}, {"0d30": "Out of all the things you can invest into, investing in yourself will always provide you the greatest returns. For when you dedicate the most time towards your continual improvement you will soon realize how infinitely capable you are."}, {"ad81": "Our minds are capable of learning any skill. Would you like to learn Spanish? How about the piano? Have you always been intrigued by computer programming? Whatever it may be, you already posses the power to bring it to fruition. Yet, to actualize these wanted improvements you must invest the time to see them come to life."}, {"e93a": "Turn Your Shoulds Into Musts"}, {"882d": "Too many of us fall into this loop when it comes to a new interest:"}, {"17f7": "We get REALLY fascinated about something, dive in head first for a few weeks to a month, hit our first wall, and ultimately give up thinking it is not for us. I have been down that road FAR too many times."}, {"7357": "I’m a huge fan of Tony Robbins, one of his key questions in the matter is as followed:"}, {"9291": "If you want to know the difference in people’s lives it all comes down to what are the things that are musts for you versus shoulds?"}, {"69ca": "Before I truly understood this concept I was essentially on a three month rotational workout plan. I did two months of trying to exercise regularly and one month of giving up because I was “too busy”. How many of you know exactly what I am talking about?"}, {"54a5": "As I reflected back on this it is obvious that exercising was only a should for me and not a must. Once I updated my mindset to make exercising a priority in my life I haven’t missed a single day of some form of deliberate exercise for twenty straight weeks."}, {"3e4e": "This concept applies across the board:"}, {"909d": "1. Is your love life lacking? Yeah…you should go out and meet more people but it isn’t a must for you so sex is still a once in a blue moon kind of thing."}, {"dfbb": "2. Are your financials out of whack? Yeah…you should pay off your credit card debt but it isn’t a must for you so the debt keeps piling up."}, {"dd95": "3. How about that online business you’ve always wanted to start? Yeah…you should at least design the website but it isn’t a must for you so you put it off until next year."}, {"d815": "I know I went a little overboard with examples here but I wanted to drive this idea into your fucking heads! Unless you turn your shoulds into musts you will not progress any further than where you are right now."}, {"c277": "We All Start Out At Zero"}, {"18e5": "No one is really born smart. Yeah, you may have inherited the potential for high intelligence but like everyone else you have to learn to walk."}, {"43f6": "Nobody is good at anything when they first start out. Once upon a time…Einstein couldn’t count. Once upon a time…Shakespeare had to learn his ABC’s."}, {"9d3e": "All the greats started out at ground zero and took baby steps towards their high achievements. Luckily for us, we were born to learn!"}, {"c2a7": "We stumble, crawl, fall, wobble, balance one foot in front of the other and soon we walk. We listen, grunt, scream, cry, form one word at a time and soon we can talk."}, {"43f2": "An idea sprouts into a business, a conversation sprouts into a relationship, $1 sprouts into $1 million."}, {"fb0a": "The World Is Yours"}, {"e568": "It is true, you can attain whatever you want in this life. The question is not necessarily “how bad do you want it?”. It is more-so “how much time are you willing to invest in yourself in order to have it?”."}, {"c133": "Just like the little boy who put the man together to create the image of the world you too can have the world if you invest in yourself."}, {"dd47": "Why I Write"}, {"54b2": "I truly believe we are all here for a reason, we all have a purpose. Mine is to understand and apply the mindset of growth and to inspire others to do the same."}, {"116a": "If you felt inspired by my article today please recommend, share, and subscribe to receive inspiration every Sunday!"}], "child": "2179_1\t2179_2\t2179_3", "parent": "", "title": "We Get From The World What We Invest In Ourselves", "content": "We Get From The World What We Invest In Ourselves I heard a life-changing story the other day. A man was sitting at the kitchen table, drinking his morning cup of coffee and reading the newspaper when he hears his son sprinting down the stairs. The man promised his son the day before that they would spend the entire day together, so he blocked off his schedule. He wasn’t quite finished with his routine so he thought of an idea to buy himself a little more time before he and his son took on the day. He tore out a section of the newspaper a few pages back; it was a full-sized image of the world. He ripped up the page into twenty small pieces, put it on the glass table and said “let’s play a game, here’s a puzzle, as soon as you can put the picture of the world back together we will start our day.” Then something amazing happened. Less than three minutes went by. His father looked up and to his immense astonishment, the boy had already put the world back together. He of course asked him, “how have you managed to put the world back together so quickly?” His son explained that he had dropped one of the pieces on the floor. As he looked up through the glass table he noticed that there was a picture of a man on the other side of the world. He sat up, flipped all the pieces over, and focused on putting the man back together. Once he did that, the world just fell into place. You Are Your Greatest Investment There is so much meaning and power in that story. When I first heard it, I absolutely teared up with inspirational emotion. Out of all the things you can invest into, investing in yourself will always provide you the greatest returns. For when you dedicate the most time towards your continual improvement you will soon realize how infinitely capable you are. Our minds are capable of learning any skill. Would you like to learn Spanish? How about the piano? Have you always been intrigued by computer programming? Whatever it may be, you already posses the power to bring it to fruition. Yet, to actualize these wanted improvements you must invest the time to see them come to life. Turn Your Shoulds Into Musts Too many of us fall into this loop when it comes to a new interest: We get REALLY fascinated about something, dive in head first for a few weeks to a month, hit our first wall, and ultimately give up thinking it is not for us. I have been down that road FAR too many times. I’m a huge fan of Tony Robbins, one of his key questions in the matter is as followed: If you want to know the difference in people’s lives it all comes down to what are the things that are musts for you versus shoulds? Before I truly understood this concept I was essentially on a three month rotational workout plan. I did two months of trying to exercise regularly and one month of giving up because I was “too busy”. How many of you know exactly what I am talking about? As I reflected back on this it is obvious that exercising was only a should for me and not a must. Once I updated my mindset to make exercising a priority in my life I haven’t missed a single day of some form of deliberate exercise for twenty straight weeks. This concept applies across the board: 1. Is your love life lacking? Yeah…you should go out and meet more people but it isn’t a must for you so sex is still a once in a blue moon kind of thing. 2. Are your financials out of whack? Yeah…you should pay off your credit card debt but it isn’t a must for you so the debt keeps piling up. 3. How about that online business you’ve always wanted to start? Yeah…you should at least design the website but it isn’t a must for you so you put it off until next year. I know I went a little overboard with examples here but I wanted to drive this idea into your fucking heads! Unless you turn your shoulds into musts you will not progress any further than where you are right now. We All Start Out At Zero No one is really born smart. Yeah, you may have inherited the potential for high intelligence but like everyone else you have to learn to walk. Nobody is good at anything when they first start out. Once upon a time…Einstein couldn’t count. Once upon a time…Shakespeare had to learn his ABC’s. All the greats started out at ground zero and took baby steps towards their high achievements. Luckily for us, we were born to learn! We stumble, crawl, fall, wobble, balance one foot in front of the other and soon we walk. We listen, grunt, scream, cry, form one word at a time and soon we can talk. An idea sprouts into a business, a conversation sprouts into a relationship, $1 sprouts into $1 million. The World Is Yours It is true, you can attain whatever you want in this life. The question is not necessarily “how bad do you want it?”. It is more-so “how much time are you willing to invest in yourself in order to have it?”. Just like the little boy who put the man together to create the image of the world you too can have the world if you invest in yourself. Why I Write I truly believe we are all here for a reason, we all have a purpose. Mine is to understand and apply the mindset of growth and to inspire others to do the same. If you felt inspired by my article today please recommend, share, and subscribe to receive inspiration every Sunday! ", "name": "2179"}