{"name": "218", "parent": "", "content": "Bandagi — Revisiting the Idea of Devotion A Sufi Celebration of Life, Inspired by Urdu Previous in the Series : Aagaaz Bandagi Humne Chod Di Hai ‘Faraz’ Kya Karein Log Jab Khuda Ho Jaayein - Ahmad Faraz I quit my worship, my devotion ‘Faraz’ What else could I have done when men have become Gods Bandagi. Literally translated, Bandagi means worship and/or an act of devotion. Funnily enough, if you Google Bandagi, it tells you that it means Kowtow. And if you don’t know what Kowtow means, like I didn’t, Google will tell you it means an act of extreme subservience or alternately, to kneel and touch the ground in worship or submission . Or in other words prostration. I have never had any doubts about the infinite wisdom of Google. But at least this once, Google has no clue what it is talking about. Google’s evident confusion is however not entirely unfounded. The enigma is inherent in the word. And sometimes, artificial intelligence is way too artificial to make sense of poetry in motion. As with most Urdu words, it is extremely reductive to understand the idea of Bandagi purely as an exercise in religion. It is woefully insufficient to make sense of it as a mere verb. Or noun. Prostrating oneself is an essential act of worship for both Muslims and Hindus. And it is not hard to see why Google would equate prostration with Bandagi. Bandagi also includes and implies an essence of surrender. And to interpret it as subservience is hardly a stretch. Bandagi is not an act. Bandagi is not worship. Bandagi is not subservience. Bandagi is not even surrender. Bandagi is an emotion. An absolute, fluid, powerful emotion. The closest equivalent to the idea of Bandagi in English would be devotion. But then, as is the theme of this series, devotion just doesn’t cut it. Bandagi is so much more than a religious act. So much more than even devotion. It is, as I said above, an emotion in itself. Something singular and powerful. Different from anything and everything else that is usually understood and associated with the idea of religion and God. One of the most remarkable feature of Sufism is that they consider their Gods as their lover. Romantic, platonic, material, physical — these boundaries are irrelevant for the spiritual quintessence of Sufi. All that matters, all that constitutes the essence of their beliefs and faith is love. Pure, simple, unadulterated love. In context of Sufism, Bandagi is an expression of love. And that perhaps is the best definition that can be accorded to this word. Bandagi is independent of religious constraints. It is an idea that has never been bound by the petty human boundaries of religion, dogmas, ideology, nationality, caste, creed, race, belief-systems, manner of worship or anything else that our combined imagination may come up with to deny our shared humanity and divide us into artificial groups based on false identities. Bandagi is an expression of faith. It doesn’t matter if you believe in God or not. God has nothing to do with Bandagi if you don’t want Him to. Bandagi can exist without God, as nothing but an expression of pure love — maybe for the Universe, maybe for humanity, maybe for some Higher Force you don’t want to name, or Sun, or Moon, or Stars, or your mother, or your father or maybe just another human being who happened to be fortunate enough to command and deserve your Bandagi. In my humble opinion, it is extremely difficult, if not entirely impossible to find Bandagi take roots in your love for a human being — mostly because humans were designed to be flawed, and somehow not designed to bear the burden of something as momentous as Bandagi. That, however, has not stopped Shayars or Urdu poets from writing pages and pages of poetry dedicated to their Bandagi for their human lovers, whether deserving or not. As I said, it is not impossible. Only extremely difficult. And totally worthwhile, not to mention the foundation of the kind of relationship heaven people only dream of, if you manage this blessing. Bandagi, however, exists beyond romance and religion. It is a spiritual high, a joy unmatched and unparalleled. Bandagi in its absolute sense is a Banda’s or a devotee’s gateway to the higher spiritual plane promised only to sages, saints and monks. A moment of pure Bandagi is sometimes enough to surpass a lifetime of austerity and devotion. In times like ours, where religion, beliefs and who and how we worship have become relevant to our identities and privilege (or lack of it); the idea of Bandagi is the great equalizer. It defies the notion that we were borne of separate Gods and hence can be split along the lines of our faith. Bandagi reminds us that it doesn’t matter who we are devoted to but how; and that it is ultimately the power and purity of our faith, not the object of it that defines who we are. It doesn’t matter if you are a theist or an atheist; a worshiper of God (of any faith whatsoever), Science or logic; if your pursuit is imbued with the essence of Bandagi, it is the noblest of all pursuits and your pathway to not just materialistic success but also spiritual heights. It is a pity that the matters of faith and beliefs have become germination grounds for strife, resistance, intolerance, violence and shame. The whole idea of religion was meant to be a tool to achieve a Universal Higher end; a spiritual zenith that only humans are capable of. And yet, we had to be literal about the whole enterprise and ruin everything in every possible manner. Bandagi is a reminder to us all to place premium on the strength of our faith — our individual, independent, unconditioned faith, beyond established systems; and on our capability of devotion and harness it to optimize our material and spiritual potential. Bandagi reminds us to be humans. And of the best kind. And that perhaps is the most important lesson all of us ought to remember. Aashiqui Se Milega Ai Zahid Bandagi Se Khuda Nahi Milta - Daag Dehlvi You Will Find God Via The Path of Love, O Devotee Empty Worship Never Leads To Any God Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "title": "Bandagi — Revisiting the Idea of Devotion", "sentences": [{"ee47": "Bandagi — Revisiting the Idea of Devotion"}, {"a960": "A Sufi Celebration of Life, Inspired by Urdu"}, {"6ebd": "Previous in the Series : Aagaaz"}, {"6ec2": "Bandagi Humne Chod Di Hai ‘Faraz’"}, {"0878": "Kya Karein Log Jab Khuda Ho Jaayein"}, {"297c": "- Ahmad Faraz"}, {"b839": "I quit my worship, my devotion ‘Faraz’"}, {"c9bc": "What else could I have done when men have become Gods"}, {"9a19": "Bandagi."}, {"2981": "Literally translated, Bandagi means worship and/or an act of devotion."}, {"9455": "Funnily enough, if you Google Bandagi, it tells you that it means Kowtow. And if you don’t know what Kowtow means, like I didn’t, Google will tell you it means an act of extreme subservience or alternately, to kneel and touch the ground in worship or submission . Or in other words prostration."}, {"ea6d": "I have never had any doubts about the infinite wisdom of Google. But at least this once, Google has no clue what it is talking about."}, {"75b6": "Google’s evident confusion is however not entirely unfounded. The enigma is inherent in the word. And sometimes, artificial intelligence is way too artificial to make sense of poetry in motion."}, {"6728": "As with most Urdu words, it is extremely reductive to understand the idea of Bandagi purely as an exercise in religion. It is woefully insufficient to make sense of it as a mere verb. Or noun."}, {"8f1f": "Prostrating oneself is an essential act of worship for both Muslims and Hindus. And it is not hard to see why Google would equate prostration with Bandagi. Bandagi also includes and implies an essence of surrender. And to interpret it as subservience is hardly a stretch."}, {"1667": "Bandagi is not an act. Bandagi is not worship. Bandagi is not subservience. Bandagi is not even surrender."}, {"f94f": "Bandagi is an emotion. An absolute, fluid, powerful emotion. The closest equivalent to the idea of Bandagi in English would be devotion. But then, as is the theme of this series, devotion just doesn’t cut it."}, {"272e": "Bandagi is so much more than a religious act. So much more than even devotion. It is, as I said above, an emotion in itself. Something singular and powerful. Different from anything and everything else that is usually understood and associated with the idea of religion and God."}, {"66e8": "One of the most remarkable feature of Sufism is that they consider their Gods as their lover. Romantic, platonic, material, physical — these boundaries are irrelevant for the spiritual quintessence of Sufi. All that matters, all that constitutes the essence of their beliefs and faith is love."}, {"8dbd": "Pure, simple, unadulterated love."}, {"d6ee": "In context of Sufism, Bandagi is an expression of love. And that perhaps is the best definition that can be accorded to this word."}, {"50e1": "Bandagi is independent of religious constraints. It is an idea that has never been bound by the petty human boundaries of religion, dogmas, ideology, nationality, caste, creed, race, belief-systems, manner of worship or anything else that our combined imagination may come up with to deny our shared humanity and divide us into artificial groups based on false identities."}, {"962a": "Bandagi is an expression of faith. It doesn’t matter if you believe in God or not. God has nothing to do with Bandagi if you don’t want Him to. Bandagi can exist without God, as nothing but an expression of pure love — maybe for the Universe, maybe for humanity, maybe for some Higher Force you don’t want to name, or Sun, or Moon, or Stars, or your mother, or your father or maybe just another human being who happened to be fortunate enough to command and deserve your Bandagi."}, {"ae47": "In my humble opinion, it is extremely difficult, if not entirely impossible to find Bandagi take roots in your love for a human being — mostly because humans were designed to be flawed, and somehow not designed to bear the burden of something as momentous as Bandagi. That, however, has not stopped Shayars or Urdu poets from writing pages and pages of poetry dedicated to their Bandagi for their human lovers, whether deserving or not."}, {"d4de": "As I said, it is not impossible. Only extremely difficult. And totally worthwhile, not to mention the foundation of the kind of relationship heaven people only dream of, if you manage this blessing."}, {"37a7": "Bandagi, however, exists beyond romance and religion. It is a spiritual high, a joy unmatched and unparalleled. Bandagi in its absolute sense is a Banda’s or a devotee’s gateway to the higher spiritual plane promised only to sages, saints and monks. A moment of pure Bandagi is sometimes enough to surpass a lifetime of austerity and devotion."}, {"1993": "In times like ours, where religion, beliefs and who and how we worship have become relevant to our identities and privilege (or lack of it); the idea of Bandagi is the great equalizer. It defies the notion that we were borne of separate Gods and hence can be split along the lines of our faith. Bandagi reminds us that it doesn’t matter who we are devoted to but how; and that it is ultimately the power and purity of our faith, not the object of it that defines who we are. It doesn’t matter if you are a theist or an atheist; a worshiper of God (of any faith whatsoever), Science or logic; if your pursuit is imbued with the essence of Bandagi, it is the noblest of all pursuits and your pathway to not just materialistic success but also spiritual heights."}, {"3990": "It is a pity that the matters of faith and beliefs have become germination grounds for strife, resistance, intolerance, violence and shame. The whole idea of religion was meant to be a tool to achieve a Universal Higher end; a spiritual zenith that only humans are capable of. And yet, we had to be literal about the whole enterprise and ruin everything in every possible manner."}, {"3094": "Bandagi is a reminder to us all to place premium on the strength of our faith — our individual, independent, unconditioned faith, beyond established systems; and on our capability of devotion and harness it to optimize our material and spiritual potential."}, {"8d79": "Bandagi reminds us to be humans. And of the best kind. And that perhaps is the most important lesson all of us ought to remember."}, {"8b12": "Aashiqui Se Milega Ai Zahid"}, {"682b": "Bandagi Se Khuda Nahi Milta"}, {"d09a": "- Daag Dehlvi"}, {"a8d2": "You Will Find God Via The Path of Love, O Devotee"}, {"c870": "Empty Worship Never Leads To Any God"}, {"d786": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "218_1\t218_2\t218_3\t218_4"}