{"sentences": [{"a629": "Khalis — Why You Need To Unleash The Authentic You"}, {"e487": "A Sufi Celebration of Life, Inspired By You"}, {"5f9c": "Previous Article — Kuch Justuju, Bepanah Jazba — Some Yearning, A Whole Lot of Courage"}, {"8a82": "Kahan Maikhane Ka Darwaza , ‘Ghalib’, Aur Kahan Vaiz"}, {"1ab8": "Par Itna Jante Hain , Kal Wah Jaata Tha, Ki Hum Nikle"}, {"baee": "— Mirza Ghalib"}, {"c37f": "What, pray, could be the relation be between a bar and the holy man"}, {"3617": "What we do know is that yesterday he (the holy man) entered the bar just as we were leaving"}, {"a7dc": "Ghalib was a master of what the internet these days likes to call a ‘burn’. For all memes and gags and sarcasm that internet can muster en masse, Ghalib puts all of it to shame in a single couplet."}, {"8872": "There has never been, and perhaps shall never be a finer commentary on the moral and general fakery of the times we live in. And this was before our time, about 150 years ago."}, {"5128": "Now either Ghalib was Nostradamus in disguise. Or some real life version of Doctor Who. Or maybe and most plausibly, not much has changed since the time Chacha Ghalib was still around to be appalled by the state of the society we live in."}, {"a867": "It is the kind of thought that you usually don’t know what to do with. Because depending on the perspective and circumstances, it can be as profoundly disturbing as it can be comforting."}, {"1b70": "Either way, Ghalib, like all great literary stalwarts, stands the test of time."}, {"f2f4": "Only in context of this particular thought, I’d rather he hadn’t."}, {"b160": "We live in a cosmetic world — airbrushed, touched up and photoshopped for good measure. It is not for nothing that cosmetic industry is a booming sector, right alongside marketing and advertising."}, {"4467": "It is a showman’s world. And it’s all about packaging. It is not just about products and luxuries, much as we wish it was. It is about everything. Ideologies, beliefs, morality, truths, facts, logic, Presidents…if you can package it right, it is going to be sold out in no time."}, {"f1a1": "The word of the day is a tirade against this world we live in, and a wake-up call for all of us. Those of us who still manage to care about these things anyway."}, {"fd48": "Khalis."}, {"8dc3": "Literally, Khalis means pure or true or authentic. I prefer authentic. It comes closest to the lyrical profundity of Khalis."}, {"430d": "Khalis."}, {"187e": "I am in love with this word. It exudes so much power, so much character — like a force that makes you sit up and take notice. It is not just another adjective, not a dead word. It throbs with intent and meaning and power. And that is what makes Khalis, Khalis — so very authentic."}, {"376f": "Native Urdu/Hindi speakers will remember using Khalis as a word usually in association with something patently materialistic — like gold. Khalis sona (pure gold) or maybe khalis ghee (pure purified butter). Something that is ordinary, mundane, laughably forgettable."}, {"efd9": "I wonder if it is because Khalis scares us. Because we find ourselves so woefully incapable of dealing with the questions and intensity that this word encompasses, we want to trap it in linguistic triviality and just not deal with it."}, {"1a9c": "Khalis was never meant to be a Goldsmith’s measuring unit, or something equally materialistic and annoying. Khalis at its core is the idea that challenges everything that we have been conditioned to believe in. Khalis is a call for authenticity; an urge to embrace who we are, as we are — no make-up, literal or metaphorical."}, {"c109": "No wonder Khalis scares us. As individuals and as societies."}, {"e4c2": "Over the centuries, humans have worked really hard to lay down systems for everything — measurable benchmarks for every single human virtue — from beauty to success to talent to even morality. Everything has a set structure, everyone has been provided with a predefined prototype. The only kind of choice you are expected to exercise is to maybe pick the prototype you would want to cut yourself to size to; and even that choice is governed by conditioning and expectations that are systemically and systematically hammered into us from the day we are born."}, {"950d": "We are all expected to be an army of robots. Robots that vary in shape, size and disposition. But robots nevertheless — mass produced and factory manufactured."}, {"aab7": "Students, artists, scientists, politicians, bureaucrats, leaders, introverts, extroverts, leaders, followers, innovators, entrepreneurs, racists, feminists, skinheads, world leaders, even terrorists…"}, {"1629": "It is an endless list — a buffet of prototypes. Look closely, you will find the one you fit in, or are trying to fit in. And for once, in this case, the latter is a better option. Because then, at least you have some hope of saving yourself from being enlisted into the robot army."}, {"95ef": "Khalis is the single biggest threat to this flourishing, expanding army of prototypes that are taking over the world."}, {"e55a": "No wonder, everything, everyone, that is Khalis is perceived and treated like a potential Nuke and every attempt, subtle and overt is made to stifle it before it takes roots. And in the rare instances when it still manages to take roots, an emulation spree is launched whereby the said rebellion is replicated ad nauseum until it ceases to be an exception; and then it is structured and framed into another prototype."}, {"43d8": "I don’t want to break your heart, or have you jump in a nihilistic pit of despair. All I am saying is, irrespective of what we have been told or made to believe, Khalis is what we are supposed to be — authentic, original, true to whatever and however we were designed as an individual by the Universe."}, {"8b6e": "After all, this is the same Universe that does not design two snowflakes, two meager, transient snowflakes to be same."}, {"893d": "What are the chances that this very Universe would have designed this massive, throbbing bundle of humanity in packages of individuals who were same or even similar?"}, {"f9ec": "We were meant to be authentic, each of us blessed with our own quirks and qualities and flaws. It is our society that makes us believe that there are certain traits or qualities or behaviors that we need to acquire and replicate to be a part of the bundle we aspire for."}, {"12a9": "The funny thing is, for all its assurances, the society rarely knows what it is talking about. It is all guess work that fails as often as it succeeds. Whether it is the idea of constructing a good, moral human or a successful one, a corporate mule or an entrepreneurial horse, the rules of this society are no guarantee of the end result."}, {"8962": "In the end, Khalis intervenes, whether we like it or not. Because the Khalis version of us is a force that is difficult if not impossible to rein. Not until we allow it to anyway."}, {"8cb1": "The tragedy is, we are not just allowing — we are aiding and actively collaborating in compromising our own Khalis version."}, {"d723": "Of course, Khalis does not promise perfection. It is merely the truest version of who we are, warts and all. It may not be perfect, but in there is our greatest strength — the one that can set us apart from the crowd — our individuality."}, {"1c0e": "Aaina Dekh Kar Tasalli Hui"}, {"c205": "Humko Is Ghar Me Jaanta Hai Koi"}, {"5257": "— Gulzar"}, {"b0de": "I saw my reflection in the mirror and was relieved"}, {"0e82": "At least someone in this house knows the real me"}, {"145f": "Embracing our Khalis version does not mean that we turn into arrogant assholes who believe in the annoying philosophy of ‘my way or highway’, which is as atrocious in intent as it is in phrasing. To the contrary, embracing Khalis releases us from the shackles of our social, cultural and familial conditioning. It is our first step towards optimizing our strengths; and everything that makes us, us. Khalis does not belie a quest for constant improvement. In fact, our Khalis self is a waste without a true spirit to improve and ensure it reaches its zenith, both material and spiritual. Khalis is the baseline, a solid foundation upon which we can build a self we desire and aspire for. It is not immutable, but it is indisputably fundamental."}, {"0535": "Being Khalis means being you. As the tagline for Ballantine’s says (one of those accidental instances where advertising got it so right, intent notwithstanding) — unflinchingly, unapologetically you."}, {"e5b7": "Just you."}, {"9aa6": "No apologies. No excuses. Only bare and upfront courage, mingled with a little bit of confidence that we are enough."}, {"0f2d": "It is well deserved and much needed. The world after all has only one you. One Khalis you. So why don’t you make the best of it?"}, {"a5b9": "Ye Sir Bulandi Toh Mujhe Khuda Ne Bakhshi Hai"}, {"8b90": "Ye Kaun Hai Jo Mera Sir Jhukana Chahta Hai"}, {"facf": "— Azhar Inayati"}, {"ad04": "My head is held high because it’s God’s grace"}, {"706f": "Who are these people who want me to bow my head?"}, {"fe13": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "2183_1\t2183_2\t2183_3", "parent": "", "title": "Khalis — Why You Need To Unleash The Authentic You", "content": "Khalis — Why You Need To Unleash The Authentic You A Sufi Celebration of Life, Inspired By You Previous Article — Kuch Justuju, Bepanah Jazba — Some Yearning, A Whole Lot of Courage Kahan Maikhane Ka Darwaza , ‘Ghalib’, Aur Kahan Vaiz Par Itna Jante Hain , Kal Wah Jaata Tha, Ki Hum Nikle — Mirza Ghalib What, pray, could be the relation be between a bar and the holy man What we do know is that yesterday he (the holy man) entered the bar just as we were leaving Ghalib was a master of what the internet these days likes to call a ‘burn’. For all memes and gags and sarcasm that internet can muster en masse, Ghalib puts all of it to shame in a single couplet. There has never been, and perhaps shall never be a finer commentary on the moral and general fakery of the times we live in. And this was before our time, about 150 years ago. Now either Ghalib was Nostradamus in disguise. Or some real life version of Doctor Who. Or maybe and most plausibly, not much has changed since the time Chacha Ghalib was still around to be appalled by the state of the society we live in. It is the kind of thought that you usually don’t know what to do with. Because depending on the perspective and circumstances, it can be as profoundly disturbing as it can be comforting. Either way, Ghalib, like all great literary stalwarts, stands the test of time. Only in context of this particular thought, I’d rather he hadn’t. We live in a cosmetic world — airbrushed, touched up and photoshopped for good measure. It is not for nothing that cosmetic industry is a booming sector, right alongside marketing and advertising. It is a showman’s world. And it’s all about packaging. It is not just about products and luxuries, much as we wish it was. It is about everything. Ideologies, beliefs, morality, truths, facts, logic, Presidents…if you can package it right, it is going to be sold out in no time. The word of the day is a tirade against this world we live in, and a wake-up call for all of us. Those of us who still manage to care about these things anyway. Khalis. Literally, Khalis means pure or true or authentic. I prefer authentic. It comes closest to the lyrical profundity of Khalis. Khalis. I am in love with this word. It exudes so much power, so much character — like a force that makes you sit up and take notice. It is not just another adjective, not a dead word. It throbs with intent and meaning and power. And that is what makes Khalis, Khalis — so very authentic. Native Urdu/Hindi speakers will remember using Khalis as a word usually in association with something patently materialistic — like gold. Khalis sona (pure gold) or maybe khalis ghee (pure purified butter). Something that is ordinary, mundane, laughably forgettable. I wonder if it is because Khalis scares us. Because we find ourselves so woefully incapable of dealing with the questions and intensity that this word encompasses, we want to trap it in linguistic triviality and just not deal with it. Khalis was never meant to be a Goldsmith’s measuring unit, or something equally materialistic and annoying. Khalis at its core is the idea that challenges everything that we have been conditioned to believe in. Khalis is a call for authenticity; an urge to embrace who we are, as we are — no make-up, literal or metaphorical. No wonder Khalis scares us. As individuals and as societies. Over the centuries, humans have worked really hard to lay down systems for everything — measurable benchmarks for every single human virtue — from beauty to success to talent to even morality. Everything has a set structure, everyone has been provided with a predefined prototype. The only kind of choice you are expected to exercise is to maybe pick the prototype you would want to cut yourself to size to; and even that choice is governed by conditioning and expectations that are systemically and systematically hammered into us from the day we are born. We are all expected to be an army of robots. Robots that vary in shape, size and disposition. But robots nevertheless — mass produced and factory manufactured. Students, artists, scientists, politicians, bureaucrats, leaders, introverts, extroverts, leaders, followers, innovators, entrepreneurs, racists, feminists, skinheads, world leaders, even terrorists… It is an endless list — a buffet of prototypes. Look closely, you will find the one you fit in, or are trying to fit in. And for once, in this case, the latter is a better option. Because then, at least you have some hope of saving yourself from being enlisted into the robot army. Khalis is the single biggest threat to this flourishing, expanding army of prototypes that are taking over the world. No wonder, everything, everyone, that is Khalis is perceived and treated like a potential Nuke and every attempt, subtle and overt is made to stifle it before it takes roots. And in the rare instances when it still manages to take roots, an emulation spree is launched whereby the said rebellion is replicated ad nauseum until it ceases to be an exception; and then it is structured and framed into another prototype. I don’t want to break your heart, or have you jump in a nihilistic pit of despair. All I am saying is, irrespective of what we have been told or made to believe, Khalis is what we are supposed to be — authentic, original, true to whatever and however we were designed as an individual by the Universe. After all, this is the same Universe that does not design two snowflakes, two meager, transient snowflakes to be same. What are the chances that this very Universe would have designed this massive, throbbing bundle of humanity in packages of individuals who were same or even similar? We were meant to be authentic, each of us blessed with our own quirks and qualities and flaws. It is our society that makes us believe that there are certain traits or qualities or behaviors that we need to acquire and replicate to be a part of the bundle we aspire for. The funny thing is, for all its assurances, the society rarely knows what it is talking about. It is all guess work that fails as often as it succeeds. Whether it is the idea of constructing a good, moral human or a successful one, a corporate mule or an entrepreneurial horse, the rules of this society are no guarantee of the end result. In the end, Khalis intervenes, whether we like it or not. Because the Khalis version of us is a force that is difficult if not impossible to rein. Not until we allow it to anyway. The tragedy is, we are not just allowing — we are aiding and actively collaborating in compromising our own Khalis version. Of course, Khalis does not promise perfection. It is merely the truest version of who we are, warts and all. It may not be perfect, but in there is our greatest strength — the one that can set us apart from the crowd — our individuality. Aaina Dekh Kar Tasalli Hui Humko Is Ghar Me Jaanta Hai Koi — Gulzar I saw my reflection in the mirror and was relieved At least someone in this house knows the real me Embracing our Khalis version does not mean that we turn into arrogant assholes who believe in the annoying philosophy of ‘my way or highway’, which is as atrocious in intent as it is in phrasing. To the contrary, embracing Khalis releases us from the shackles of our social, cultural and familial conditioning. It is our first step towards optimizing our strengths; and everything that makes us, us. Khalis does not belie a quest for constant improvement. In fact, our Khalis self is a waste without a true spirit to improve and ensure it reaches its zenith, both material and spiritual. Khalis is the baseline, a solid foundation upon which we can build a self we desire and aspire for. It is not immutable, but it is indisputably fundamental. Being Khalis means being you. As the tagline for Ballantine’s says (one of those accidental instances where advertising got it so right, intent notwithstanding) — unflinchingly, unapologetically you. Just you. No apologies. No excuses. Only bare and upfront courage, mingled with a little bit of confidence that we are enough. It is well deserved and much needed. The world after all has only one you. One Khalis you. So why don’t you make the best of it? Ye Sir Bulandi Toh Mujhe Khuda Ne Bakhshi Hai Ye Kaun Hai Jo Mera Sir Jhukana Chahta Hai — Azhar Inayati My head is held high because it’s God’s grace Who are these people who want me to bow my head? Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "2183"}