{"sentences": [{"3f8b": "Kuch Justuju, Bepanah Jazba — Some Yearning, A Whole Lot of Courage"}, {"293e": "A Sufi Celebration of Life, Inspired By Urdu"}, {"e7fe": "Previous Article : Ikhtilaf — Of Conflict, Resistance, Opposition and Trolls"}, {"1ae9": "Justju Jiski Thi, Usko Toh Na Paya Humne,"}, {"1005": "Is Bahane Se Magar Dekh Li Duniya Humne"}, {"41b9": "— Shahryar"}, {"2c6f": "What I yearned for, I never attained"}, {"d4aa": "But in its quest, I saw the whole world and its ways"}, {"daf1": "If I had thought ‘I’ was tough, ‘J’ was another story altogether. The options were mind boggling, and all equally tempting. Ultimately, I couldn’t decide. And for this once, I have decided to go with two words instead of one."}, {"5143": "It helped that the two words that caught my fancy were beautifully intertwined in a cycle of cause and effect; ends and means."}, {"755a": "You will see what I mean in a bit."}, {"0e6d": "Justju."}, {"f603": "Literally translated, Justju means yearning or desire or wish. Although, yearning comes the closest to the essence of longing that this word encapsulates."}, {"957f": "And as is the case with many words before this one, yearning is close but not exactly there when it comes to the poetic genius of the expression. The sense of yearning that lies at the heart of Justju is intense and lyrical; just like the word itself which is a phonetic delight. It is as if the word was designed to be part of poems and songs; its inherent musical essence lending itself to known and unknown, heard and unheard melodies."}, {"4d12": "But don’t let its beauty fool you. Because Justju’s aesthetic appeal is merely a cover for the passion that burns bright and blinding at its very core. Justju is not just your ordinary garden variety wish; it is a yearning that can tear your soul into two. It is the fire that can light up your house as easily as it can set it alight. It is a force that can fuel civilizations; it is also the force that can flatten them like sand castles."}, {"3982": "Na Fikr Koi, Na Justuju Hai, Na Khwab Koi, Na Aarzu Hai"}, {"8c98": "Ye Shaḳhs Toh Kab Ka Mar Chuka Hai, Toh Be-kafan Phir Ye Laash Kyun Hai"}, {"2f80": "— Javed Akhtar"}, {"c562": "There is no worry, no yearning, no dream, no wish"}, {"8f7b": "This guy died long ago, why is this corpse roaming without a coffin"}, {"9bd8": "Justju is a lover’s longing; it is also an artist’s wish and a conqueror’s dream. Justju is the sum total of our materialistic wish list; it is also a Sufi’s spiritual longing for his beloved, his Almighty. Jusjtju is the prison you can trap yourself in and languish for life; it is also the sky that can let you soar and reach your spiritual zenith."}, {"7509": "Justju is whatever you do with it. Or don’t. Because when an unattained Justju festers, it becomes a wound that never heals. It is what drives heartbroken lovers to death and failed dreamers to desolation."}, {"8f4c": "And this is where the second word of the day comes into picture."}, {"4d33": "Jazba."}, {"d3f2": "Literally translated, Jazba means passion, and in terms of meaning, overlaps with Justju."}, {"1eb0": "There is, however, a fine but important difference between Justju and Jazba. Justju is an empty longing with no implication of action woven in; Jazba on the other hand implies a passion that drives one towards their goal. For me, Jazba has always been synonymous with courage. It is a passionate, courageous desire to do/get something/someone. It is perhaps the reason why while Justju inevitably has romantic connotations and is usually associated with forlorn lovers; Jazba is almost always associated with the idea of war and warriors, people gearing up for a fight — for their love or their dreams."}, {"87ed": "The way I look at it, Justju and Jazba are intrinsically entwined. Ultimately, a Justju without due Jazba is empty and weak and destructive due to its sheer pointlessness. It is like a bomb that imploded, a fire that burns within, seen by none and serving no purpose, not even of lighting up a room. It is the fire that consumes and destroys our very essence."}, {"17b1": "On the other hand, a Jazba without Justju is like a canon without an aim; bull in the china shop; Trump with Nukes; and every other metaphor that you can think of, that represents a misdirected, massive force with no goal or place to direct its aggression. The result is utter chaos with no substantive result and inevitable destruction."}, {"6836": "You need a desire, a Justju intense enough to rein and harness and direct your Jazba. And you need Jazba to make that first move, take an initiative and then keep at it, hardships notwithstanding, until you achieve what you had set out to do, what you had the Justju for."}, {"59de": "Justju is the ends, Jazba is the means. And in that beautiful, delicate, symbiotic balance is the story of our lives."}, {"1794": "Because even if despite all your Jazba, your Justju remains unattained, as the opening couplet states, by the time you are done, you would have seen the world."}, {"86af": "And that alone is a dream worth having Justju for."}, {"8043": "Hai Justju Ki Khoob Se Hai Khoobtar Kahan"}, {"4250": "Ab Thairti Hai Dekhiye Jaakar Nazar Kahan"}, {"54a5": "— Khwaja Altaf Hussain ‘Haali’"}, {"6e00": "There is desire for better and beyond"}, {"d135": "Let’s see where this yearning leads us"}, {"dd05": "Tum Apne Dil Me Madeene Ki Aarzu Rakhna"}, {"7830": "Phir Uska Kaam Hai Jazbe Ki Aabru Rakhna"}, {"fe18": "You keep your yearning for Madeena (Muslim holy place) alive in your heart"}, {"cc42": "Then leave it to Him (God) to give due respect/consideration to your passion/courage"}, {"c438": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "2184_1\t2184_2\t2184_3\t2184_4\t2184_5", "parent": "", "title": "Kuch Justuju, Bepanah Jazba — Some Yearning, A Whole Lot of Courage", "content": "Kuch Justuju, Bepanah Jazba — Some Yearning, A Whole Lot of Courage A Sufi Celebration of Life, Inspired By Urdu Previous Article : Ikhtilaf — Of Conflict, Resistance, Opposition and Trolls Justju Jiski Thi, Usko Toh Na Paya Humne, Is Bahane Se Magar Dekh Li Duniya Humne — Shahryar What I yearned for, I never attained But in its quest, I saw the whole world and its ways If I had thought ‘I’ was tough, ‘J’ was another story altogether. The options were mind boggling, and all equally tempting. Ultimately, I couldn’t decide. And for this once, I have decided to go with two words instead of one. It helped that the two words that caught my fancy were beautifully intertwined in a cycle of cause and effect; ends and means. You will see what I mean in a bit. Justju. Literally translated, Justju means yearning or desire or wish. Although, yearning comes the closest to the essence of longing that this word encapsulates. And as is the case with many words before this one, yearning is close but not exactly there when it comes to the poetic genius of the expression. The sense of yearning that lies at the heart of Justju is intense and lyrical; just like the word itself which is a phonetic delight. It is as if the word was designed to be part of poems and songs; its inherent musical essence lending itself to known and unknown, heard and unheard melodies. But don’t let its beauty fool you. Because Justju’s aesthetic appeal is merely a cover for the passion that burns bright and blinding at its very core. Justju is not just your ordinary garden variety wish; it is a yearning that can tear your soul into two. It is the fire that can light up your house as easily as it can set it alight. It is a force that can fuel civilizations; it is also the force that can flatten them like sand castles. Na Fikr Koi, Na Justuju Hai, Na Khwab Koi, Na Aarzu Hai Ye Shaḳhs Toh Kab Ka Mar Chuka Hai, Toh Be-kafan Phir Ye Laash Kyun Hai — Javed Akhtar There is no worry, no yearning, no dream, no wish This guy died long ago, why is this corpse roaming without a coffin Justju is a lover’s longing; it is also an artist’s wish and a conqueror’s dream. Justju is the sum total of our materialistic wish list; it is also a Sufi’s spiritual longing for his beloved, his Almighty. Jusjtju is the prison you can trap yourself in and languish for life; it is also the sky that can let you soar and reach your spiritual zenith. Justju is whatever you do with it. Or don’t. Because when an unattained Justju festers, it becomes a wound that never heals. It is what drives heartbroken lovers to death and failed dreamers to desolation. And this is where the second word of the day comes into picture. Jazba. Literally translated, Jazba means passion, and in terms of meaning, overlaps with Justju. There is, however, a fine but important difference between Justju and Jazba. Justju is an empty longing with no implication of action woven in; Jazba on the other hand implies a passion that drives one towards their goal. For me, Jazba has always been synonymous with courage. It is a passionate, courageous desire to do/get something/someone. It is perhaps the reason why while Justju inevitably has romantic connotations and is usually associated with forlorn lovers; Jazba is almost always associated with the idea of war and warriors, people gearing up for a fight — for their love or their dreams. The way I look at it, Justju and Jazba are intrinsically entwined. Ultimately, a Justju without due Jazba is empty and weak and destructive due to its sheer pointlessness. It is like a bomb that imploded, a fire that burns within, seen by none and serving no purpose, not even of lighting up a room. It is the fire that consumes and destroys our very essence. On the other hand, a Jazba without Justju is like a canon without an aim; bull in the china shop; Trump with Nukes; and every other metaphor that you can think of, that represents a misdirected, massive force with no goal or place to direct its aggression. The result is utter chaos with no substantive result and inevitable destruction. You need a desire, a Justju intense enough to rein and harness and direct your Jazba. And you need Jazba to make that first move, take an initiative and then keep at it, hardships notwithstanding, until you achieve what you had set out to do, what you had the Justju for. Justju is the ends, Jazba is the means. And in that beautiful, delicate, symbiotic balance is the story of our lives. Because even if despite all your Jazba, your Justju remains unattained, as the opening couplet states, by the time you are done, you would have seen the world. And that alone is a dream worth having Justju for. Hai Justju Ki Khoob Se Hai Khoobtar Kahan Ab Thairti Hai Dekhiye Jaakar Nazar Kahan — Khwaja Altaf Hussain ‘Haali’ There is desire for better and beyond Let’s see where this yearning leads us Tum Apne Dil Me Madeene Ki Aarzu Rakhna Phir Uska Kaam Hai Jazbe Ki Aabru Rakhna You keep your yearning for Madeena (Muslim holy place) alive in your heart Then leave it to Him (God) to give due respect/consideration to your passion/courage Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "2184"}