{"sentences": [{"a75f": "Fursat — The Forgotten Necessity Called Leisure"}, {"73db": "A Sufi Celebration of Life, Inspired By Urdu"}, {"d3ff": "Previous Article : Ehtiyaat — An Abyss Called ‘Take Care’"}, {"7a31": "Fursat Me Raha Karte Hain Fursat Se Jyada"}, {"4493": "Masruf Hain Hum Log Zarurat Se Jyada"}, {"8792": "— Sultan Akhtar"}, {"dbcf": "We have more leisure to spare than leisure itself"}, {"2e53": "We are way busier than strictly necessary"}, {"04c5": "First off, that translation does not to do any degree of justice to the couplet. Perhaps, because there is a lyrical intensity to the words in there — Masruf (busy), Zarurat (necessity) and Jyada (more) that their English counterparts clearly lack. A literal translation perhaps is not the best approach."}, {"946b": "A better less, literal translation."}, {"8f2b": "It is not so that we don’t have time for leisure; we have more than enough"}, {"2f94": "We are just way too busy to take notice"}, {"bf2d": "Fursat."}, {"8473": "Literally translated, fursat means, as you must have guessed, leisure. As far as day to day parlance is concerned, fursat is a much abused word. Not because people have too much fursat in their lives, but because they have too little."}, {"2cc0": "Fursat nahin hai (I don’t have time/I am too busy)."}, {"293b": "It is a phrase that gets thrown around as an excuse, an apology, an obligation, a dismissal, an all pervasive answer, an unquestionable truth."}, {"357f": "The absence of fursat, it seems, is a panacea."}, {"ebb3": "It is perhaps a function of the times we live in — this is after all a fast moving world and if you don’t run with it, you will be left far behind in the race of life."}, {"f07c": "Or so we believe."}, {"87be": "Being busy is not just a symbol of our productivity; it morphs as a beacon of success; a calling card for social/financial/professional status; a mark of people who have arrived, in every materialistic and worldly sense of that word; a screaming emblem of you being a productive, contributing member of the society, someone who makes their world go round — the metaphorical Atlas holding the weight of the Universe."}, {"3dbc": "I can go on with the analogies. Spoiler alert — they get progressively more ridiculous."}, {"7836": "Remember the time when being busy meant that you were trying to get something done; and that you will get free once the said thing is done."}, {"e801": "Yeah, me neither."}, {"70e8": "There is no denying the fact that we live in difficult, tiring, busy times. We need to get more done in a day than our grandparents got done in an entire month. Making money is tough; keeping it is tougher. Making a family is tough, maintaining it is tougher. We are living under tremendous pressure to do well and build a life that society tells us is a good life."}, {"dc51": "It is not easy."}, {"74ae": "And yet, as the couplet above said, it isn’t that we don’t have time for leisure. We are just too busy to take notice. And the irony in that phrasing is not lost on anybody."}, {"10cf": "Our leisure is passing us by everyday, unused and ignored, hoping that someday we will take note of its presence and take it up on its offer."}, {"ddd5": "We rarely do."}, {"6026": "The fact is irrespective of the times we live in, it is always easy to lose ourselves to a routine; to the so called rush of life; let ourselves be swept away by the flow without any resistance or conscious thought."}, {"4e0c": "Making time, however, is tough. It needs intent and effort and will to resist the flow. Not to mention a great amount of courage to take a moment when you can just sit it out."}, {"ab2c": "In other words, opt for the timeout, just like we used to do during our childhood games. It didn’t matter whether we were winning or losing; we took a timeout whenever the hell we wanted. Sometimes because we were tired; sometimes because we had to snicker and tease the grumpy neighborhood cat and sometimes just because we wanted to."}, {"3790": "It was that simple."}, {"85c9": "Unfortunately, we grew up to be terrible adults, forgetting and forgoing every good thing about our childhood; all in in the name of that illusory, futile, moronic thing called maturity."}, {"8556": "We grew up to give up on our timeouts. And fursat somehow became the thing we never really have."}, {"9e58": "Perhaps as kids we were less afraid of losing and more focused on enjoying whatever was at hand. As adults, we live under a constant fear — fear of not having enough; not doing enough; not being enough. And above all, fear of letting go and risking it all."}, {"d145": "The cool kids have a name for it — FOMO (For the uninitiated, it means Fear of Missing Out). And for all its apparent frivolity, it is a menace that is killing our fursat, and in turn the joy of living."}, {"e9fc": "‘Waseem’ Sadiyon Ki Aankhon Se Dekhiye Mujhe"}, {"3cda": "Wo Lafz Hoon Jo Kabhi Dastan Nahi Hota"}, {"b55f": "— Waseem Barelvi"}, {"22e7": "‘Waseem’ Watch me from the eyes of the centuries"}, {"b774": "I am that word which never becomes a story"}, {"9550": "Our life is full of words that never turn into stories or poems or epics. Most of the times they don’t have to. They are complete, enough, whole as they are — centuries encapsulated in one single word."}, {"f0bf": "Often it is just a moment in time. Sometimes it is a lot more — like a person we met on the train; a movie we watched with our mother; a food that encapsulates our childhood; a lover who left; a friend who stayed."}, {"b192": "Our life is rarely a coherent story; or a multi-stanza poem. More often than not, it is just a series of random words. It is what makes life so maddening; so beautiful and so damn tricky."}, {"a234": "It is easy to flip through a story or skip through a poem; and still make at least some sense of it. But a word — a word needs time and effort and energy. It needs to be cherished and nurtured and absorbed and admired."}, {"4f29": "A word needs fursat to make sense; and to let us access the infinite joys hidden in its depths."}, {"c159": "It is not for nothing that living in the moment is an art that takes a lifetime to master."}, {"6897": "A lifetime full of moments of fursat."}, {"028d": "Fursat reminds us that we have to learn to pause, take a break, catch our breath; we have to learn to remind ourselves that despite all illusions to the contrary, we are no Atlas and the world will go on its own merry course with or without us."}, {"e248": "It may seem like a morbid, nihilistic idea. But in the larger scheme of things, a balanced realization of the materialistic illusion of our existence and our relative insignificance, is a must for us to have the requisite humility. Humility that allows us to cultivate the courage to let go. If not in absolute terms, than at least as a part of a regular routine that can enable us to rest and regroup; not to mention look around and enjoy the view."}, {"8a99": "We have to stop placing premium on the idea of Masrufiyat (being busy) as a token of validation for everything — whether merit, talent or success. We have to stop looking down upon the idea of Fursat; and instead adopt it as a necessary antidote to the life’s inevitable stresses. It may not be a shortcut to your next promotion; but it is definitely a shortcut to a happier, more fulfilling existence(not to mention a much happier circle of family and friends who might finally get to see what you look like when not hunched over your laptop/smartphone/any other technological thingamajig in the vicinity)."}, {"6d10": "I know the shortcut that I want to take. Do you have fursat to figure out yours?"}, {"fe28": "Jee Dhoondta Hai Phir Wahi Fursat Ke Raat Din"}, {"ab92": "Baithe Rahein Tasavvur-e-Jaana Kiye Huye"}, {"8789": "— Mirza Ghalib"}, {"4d0c": "My heart is looking for those moments of leisure again"}, {"f1c9": "When we can lose ourselves to the imagination of our beloved"}, {"3b74": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "2185_1\t2185_2\t2185_3\t2185_4\t2185_5\t2185_6\t2185_7\t2185_8", "parent": "", "title": "Fursat — The Forgotten Necessity Called Leisure", "content": "Fursat — The Forgotten Necessity Called Leisure A Sufi Celebration of Life, Inspired By Urdu Previous Article : Ehtiyaat — An Abyss Called ‘Take Care’ Fursat Me Raha Karte Hain Fursat Se Jyada Masruf Hain Hum Log Zarurat Se Jyada — Sultan Akhtar We have more leisure to spare than leisure itself We are way busier than strictly necessary First off, that translation does not to do any degree of justice to the couplet. Perhaps, because there is a lyrical intensity to the words in there — Masruf (busy), Zarurat (necessity) and Jyada (more) that their English counterparts clearly lack. A literal translation perhaps is not the best approach. A better less, literal translation. It is not so that we don’t have time for leisure; we have more than enough We are just way too busy to take notice Fursat. Literally translated, fursat means, as you must have guessed, leisure. As far as day to day parlance is concerned, fursat is a much abused word. Not because people have too much fursat in their lives, but because they have too little. Fursat nahin hai (I don’t have time/I am too busy). It is a phrase that gets thrown around as an excuse, an apology, an obligation, a dismissal, an all pervasive answer, an unquestionable truth. The absence of fursat, it seems, is a panacea. It is perhaps a function of the times we live in — this is after all a fast moving world and if you don’t run with it, you will be left far behind in the race of life. Or so we believe. Being busy is not just a symbol of our productivity; it morphs as a beacon of success; a calling card for social/financial/professional status; a mark of people who have arrived, in every materialistic and worldly sense of that word; a screaming emblem of you being a productive, contributing member of the society, someone who makes their world go round — the metaphorical Atlas holding the weight of the Universe. I can go on with the analogies. Spoiler alert — they get progressively more ridiculous. Remember the time when being busy meant that you were trying to get something done; and that you will get free once the said thing is done. Yeah, me neither. There is no denying the fact that we live in difficult, tiring, busy times. We need to get more done in a day than our grandparents got done in an entire month. Making money is tough; keeping it is tougher. Making a family is tough, maintaining it is tougher. We are living under tremendous pressure to do well and build a life that society tells us is a good life. It is not easy. And yet, as the couplet above said, it isn’t that we don’t have time for leisure. We are just too busy to take notice. And the irony in that phrasing is not lost on anybody. Our leisure is passing us by everyday, unused and ignored, hoping that someday we will take note of its presence and take it up on its offer. We rarely do. The fact is irrespective of the times we live in, it is always easy to lose ourselves to a routine; to the so called rush of life; let ourselves be swept away by the flow without any resistance or conscious thought. Making time, however, is tough. It needs intent and effort and will to resist the flow. Not to mention a great amount of courage to take a moment when you can just sit it out. In other words, opt for the timeout, just like we used to do during our childhood games. It didn’t matter whether we were winning or losing; we took a timeout whenever the hell we wanted. Sometimes because we were tired; sometimes because we had to snicker and tease the grumpy neighborhood cat and sometimes just because we wanted to. It was that simple. Unfortunately, we grew up to be terrible adults, forgetting and forgoing every good thing about our childhood; all in in the name of that illusory, futile, moronic thing called maturity. We grew up to give up on our timeouts. And fursat somehow became the thing we never really have. Perhaps as kids we were less afraid of losing and more focused on enjoying whatever was at hand. As adults, we live under a constant fear — fear of not having enough; not doing enough; not being enough. And above all, fear of letting go and risking it all. The cool kids have a name for it — FOMO (For the uninitiated, it means Fear of Missing Out). And for all its apparent frivolity, it is a menace that is killing our fursat, and in turn the joy of living. ‘Waseem’ Sadiyon Ki Aankhon Se Dekhiye Mujhe Wo Lafz Hoon Jo Kabhi Dastan Nahi Hota — Waseem Barelvi ‘Waseem’ Watch me from the eyes of the centuries I am that word which never becomes a story Our life is full of words that never turn into stories or poems or epics. Most of the times they don’t have to. They are complete, enough, whole as they are — centuries encapsulated in one single word. Often it is just a moment in time. Sometimes it is a lot more — like a person we met on the train; a movie we watched with our mother; a food that encapsulates our childhood; a lover who left; a friend who stayed. Our life is rarely a coherent story; or a multi-stanza poem. More often than not, it is just a series of random words. It is what makes life so maddening; so beautiful and so damn tricky. It is easy to flip through a story or skip through a poem; and still make at least some sense of it. But a word — a word needs time and effort and energy. It needs to be cherished and nurtured and absorbed and admired. A word needs fursat to make sense; and to let us access the infinite joys hidden in its depths. It is not for nothing that living in the moment is an art that takes a lifetime to master. A lifetime full of moments of fursat. Fursat reminds us that we have to learn to pause, take a break, catch our breath; we have to learn to remind ourselves that despite all illusions to the contrary, we are no Atlas and the world will go on its own merry course with or without us. It may seem like a morbid, nihilistic idea. But in the larger scheme of things, a balanced realization of the materialistic illusion of our existence and our relative insignificance, is a must for us to have the requisite humility. Humility that allows us to cultivate the courage to let go. If not in absolute terms, than at least as a part of a regular routine that can enable us to rest and regroup; not to mention look around and enjoy the view. We have to stop placing premium on the idea of Masrufiyat (being busy) as a token of validation for everything — whether merit, talent or success. We have to stop looking down upon the idea of Fursat; and instead adopt it as a necessary antidote to the life’s inevitable stresses. It may not be a shortcut to your next promotion; but it is definitely a shortcut to a happier, more fulfilling existence(not to mention a much happier circle of family and friends who might finally get to see what you look like when not hunched over your laptop/smartphone/any other technological thingamajig in the vicinity). I know the shortcut that I want to take. Do you have fursat to figure out yours? Jee Dhoondta Hai Phir Wahi Fursat Ke Raat Din Baithe Rahein Tasavvur-e-Jaana Kiye Huye — Mirza Ghalib My heart is looking for those moments of leisure again When we can lose ourselves to the imagination of our beloved Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "2185"}