{"sentences": [{"7aaa": "Ehtiyaat — An Abyss Called ‘Take Care’"}, {"2478": "A Sufi Celebration of Life, Inspired by Urdu"}, {"908b": "Previous article : Dard — Of Heartbreaks, Heartaches and Empathy"}, {"4aab": "Mujhe Sambhalne Me Itni Ehtiyaat Na Kar"}, {"fe02": "Kahin Bikhar Na Jaoon Main Teri Hifajat Me"}, {"29a3": "— Saleem Kausar"}, {"7785": "Don’t be so cautious in handling/protecting/preserving me"}, {"958f": "It is possible your excessive care may be the cause of my shatter"}, {"1fda": "Ehtiyaat."}, {"72e6": "Literally, Ehtiyaat means caution or care. ‘Ehtiyaat Bartein’ , or ‘Ehtiyaat rakhein’ (meaning take care), is a common Urdu phrase that accompanies most well meaning wishes."}, {"a709": "Of all the well meaning if not very substantive wishes in the world, ‘Take Care’ is perhaps the most terrible one. It is thoughtless, inane and lacks any degree of imagination."}, {"566c": "Ehtiyaat, of course, is better placed in terms of linguistic novelty. It is delicate and tender, a beautiful expression of the well-wisher’s feeling. And in a world of tired goodbyes and dull as death wishes, where even a ‘Take care’ seems like too much effort and is conveniently replaced by monumentally annoying and insulting ‘tc’; ehtiyaat is a much needed dose of thoughtfulness in our routine conversations."}, {"4e57": "Next time you want to avoid an awkward ending to your whatsapp chat, don’t say ‘Take care’, or worse still tc. Say, ‘ehtiyat rakhein’…and watch an inane conversation turn into a memorable one."}, {"ab8c": "Between whatsapp and snapchats and insta-whatevers, meaningful conversation is a dying art. And perhaps we all owe it to ourselves to do our bit to prevent our kind from converting into mechanized prototypes incapable of anything beyond text based chats, abbreviated emotions and two syllable conversations."}, {"7063": "A little bit of Ehtiyaat never kills anybody."}, {"6b95": "The trouble is, it doesn’t keep them very alive either."}, {"5893": "And that is why, for all its poetic merits, linguistic value and aesthetic necessity, Ehtiyaat continues to be a terrible wish."}, {"2b5b": "“People who take care never get anywhere”, says Robert H. Schuller in his bestselling book Tough Times Never Last, Tough People Do , “Take chance”, he says."}, {"dd7f": "We live in terribly cautious times. And for all the premium we seem to place on innovation and growth and new ideas, we are, as a society growing increasingly risk averse. We want to take care, play safe, be secure, follow trajectories that have proven track record, follow the rules, always have a gameplan along with a plan A, B and C."}, {"f6ca": "It is a tragedy."}, {"1958": "In Finding Nemo, there is a fantastic instance where Marlin says to Dory that he had promised he’d never let anything happen to his missing son."}, {"b4c7": "“You can’t never let anything happen to him”, said Dory, “Then nothing would ever happen to him. Not much fun for little Harpo.”"}, {"1205": "Dory’s response is perhaps one the finest example of pop culture wisdom; and a validation that often the movies meant for our kids are way wiser than our entire intelligentsia put together."}, {"3b5b": "Our culture is investing an incredible amount of energy in ensuring that nothing ever happens to us or our kids. It is an illusion that is almost laughable in its naivety and infuriating in the extent to which it is a buzzkill."}, {"e012": "We are creatures of choice, sure and most of our life is a product of the kind of choices we make. But we are also creatures of this Universe bound by inevitability of our given circumstances, and of course the cycle of life and death."}, {"0acd": "Andaisha Bhi Bohat Tha Or Ehtiyaat Bhi Bohat Ki,"}, {"408b": "Hote Hote Wo Shakhs Aakhir Judaa Ho Hi Gaya."}, {"ba2d": "There was a premonition, and an equal amount of caution"}, {"4842": "Yet, slowly, steadily, inevitably he parted ways with me"}, {"5834": "At a theoretical level, most of us are aware of these truths. But we allow ourselves to be trapped in the illusion of control — a kind of a mad rush to make life behave the way we want it to, and in the process losing out on the thrill of discovering life as is."}, {"5390": "Simply put, we are so busy taking care that we are losing out on all the fun. We are so occupied by the ends that we are forgetting that sometimes it is the means that are the real point; that matter the most."}, {"4fa3": "Ehtiyaat is messing with our Lutf , or the fun and the relish of being alive. And no amount poetic pleasure is worth that kind of loss."}, {"2bf0": "Ehtiyaat maybe a necessary virtue but it is rarely a desirable wish. Not when our existential narrative is becoming tamer and tamer by the day. What we need is Ehtiyaat, mixed with a thirst for adventure — a survivor’s spirit steeped in thrill and innovation and extreme risk appetite"}, {"aa2c": "Ehtiyaat is a great sounding wish. But perhaps we need to revise our understanding of what our wishes are meant to be; and probably design some better ones. After all, Ehtiyaat was not the root of any human innovation; and is unlikely to become one anytime soon."}, {"2fa8": "So, maybe next time when you say goodbye, you could wish them to have fun (Lutf lein; Maze karein) or even better, urge them to throw caution to the wind and take a chance; or as they would say in Urdu, Khatron se khelein (meaning — play with dangers).It maybe a little morbid for some people’s taste, but the emotion always holds!"}, {"5f35": "Aankhon Me Raha, Dil Me Utar Ke Nahi Dekha"}, {"a5c1": "Kishti Ke Musafir Ne Samandar Nahin Dekha"}, {"4770": "— Bashir Badr"}, {"5bd6": "He who chose to dwell in the eyes, never saw the heart"}, {"5209": "Just like a ship’s traveler who never saw the ocean"}, {"6b39": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "2186_1\t2186_2\t2186_3\t2186_4\t2186_5", "parent": "", "title": "Ehtiyaat — An Abyss Called ‘Take Care’", "content": "Ehtiyaat — An Abyss Called ‘Take Care’ A Sufi Celebration of Life, Inspired by Urdu Previous article : Dard — Of Heartbreaks, Heartaches and Empathy Mujhe Sambhalne Me Itni Ehtiyaat Na Kar Kahin Bikhar Na Jaoon Main Teri Hifajat Me — Saleem Kausar Don’t be so cautious in handling/protecting/preserving me It is possible your excessive care may be the cause of my shatter Ehtiyaat. Literally, Ehtiyaat means caution or care. ‘Ehtiyaat Bartein’ , or ‘Ehtiyaat rakhein’ (meaning take care), is a common Urdu phrase that accompanies most well meaning wishes. Of all the well meaning if not very substantive wishes in the world, ‘Take Care’ is perhaps the most terrible one. It is thoughtless, inane and lacks any degree of imagination. Ehtiyaat, of course, is better placed in terms of linguistic novelty. It is delicate and tender, a beautiful expression of the well-wisher’s feeling. And in a world of tired goodbyes and dull as death wishes, where even a ‘Take care’ seems like too much effort and is conveniently replaced by monumentally annoying and insulting ‘tc’; ehtiyaat is a much needed dose of thoughtfulness in our routine conversations. Next time you want to avoid an awkward ending to your whatsapp chat, don’t say ‘Take care’, or worse still tc. Say, ‘ehtiyat rakhein’…and watch an inane conversation turn into a memorable one. Between whatsapp and snapchats and insta-whatevers, meaningful conversation is a dying art. And perhaps we all owe it to ourselves to do our bit to prevent our kind from converting into mechanized prototypes incapable of anything beyond text based chats, abbreviated emotions and two syllable conversations. A little bit of Ehtiyaat never kills anybody. The trouble is, it doesn’t keep them very alive either. And that is why, for all its poetic merits, linguistic value and aesthetic necessity, Ehtiyaat continues to be a terrible wish. “People who take care never get anywhere”, says Robert H. Schuller in his bestselling book Tough Times Never Last, Tough People Do , “Take chance”, he says. We live in terribly cautious times. And for all the premium we seem to place on innovation and growth and new ideas, we are, as a society growing increasingly risk averse. We want to take care, play safe, be secure, follow trajectories that have proven track record, follow the rules, always have a gameplan along with a plan A, B and C. It is a tragedy. In Finding Nemo, there is a fantastic instance where Marlin says to Dory that he had promised he’d never let anything happen to his missing son. “You can’t never let anything happen to him”, said Dory, “Then nothing would ever happen to him. Not much fun for little Harpo.” Dory’s response is perhaps one the finest example of pop culture wisdom; and a validation that often the movies meant for our kids are way wiser than our entire intelligentsia put together. Our culture is investing an incredible amount of energy in ensuring that nothing ever happens to us or our kids. It is an illusion that is almost laughable in its naivety and infuriating in the extent to which it is a buzzkill. We are creatures of choice, sure and most of our life is a product of the kind of choices we make. But we are also creatures of this Universe bound by inevitability of our given circumstances, and of course the cycle of life and death. Andaisha Bhi Bohat Tha Or Ehtiyaat Bhi Bohat Ki, Hote Hote Wo Shakhs Aakhir Judaa Ho Hi Gaya. There was a premonition, and an equal amount of caution Yet, slowly, steadily, inevitably he parted ways with me At a theoretical level, most of us are aware of these truths. But we allow ourselves to be trapped in the illusion of control — a kind of a mad rush to make life behave the way we want it to, and in the process losing out on the thrill of discovering life as is. Simply put, we are so busy taking care that we are losing out on all the fun. We are so occupied by the ends that we are forgetting that sometimes it is the means that are the real point; that matter the most. Ehtiyaat is messing with our Lutf , or the fun and the relish of being alive. And no amount poetic pleasure is worth that kind of loss. Ehtiyaat maybe a necessary virtue but it is rarely a desirable wish. Not when our existential narrative is becoming tamer and tamer by the day. What we need is Ehtiyaat, mixed with a thirst for adventure — a survivor’s spirit steeped in thrill and innovation and extreme risk appetite Ehtiyaat is a great sounding wish. But perhaps we need to revise our understanding of what our wishes are meant to be; and probably design some better ones. After all, Ehtiyaat was not the root of any human innovation; and is unlikely to become one anytime soon. So, maybe next time when you say goodbye, you could wish them to have fun (Lutf lein; Maze karein) or even better, urge them to throw caution to the wind and take a chance; or as they would say in Urdu, Khatron se khelein (meaning — play with dangers).It maybe a little morbid for some people’s taste, but the emotion always holds! Aankhon Me Raha, Dil Me Utar Ke Nahi Dekha Kishti Ke Musafir Ne Samandar Nahin Dekha — Bashir Badr He who chose to dwell in the eyes, never saw the heart Just like a ship’s traveler who never saw the ocean Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "2186"}