{"sentences": [{"c462": "You’re Actually Trying Your Best"}, {"944c": "“Are you trying your best? “"}, {"fed7": "“…Well, I can probably do better.”"}, {"f4a6": "There are piles and piles of corruptible material you have on yourself that would condemn you if you said otherwise."}, {"0a02": "Just this morning you woke up at 5am like you planned and then went straight back to sleep, having convinced yourself an hour would suffice to finish your work."}, {"575d": "All of last week you skipped your daily dose of reading because you were bogged down with work. You told yourself that Saturday would be the day you would get all of your reading in since it was guaranteed to be sunny. Perfect reading weather."}, {"df2e": "You said you wouldn’t fall for another girl. You said you wouldn’t hurt her the way you hurt the others. And yet, there you are walking away from a pair of tear-filled eyes."}, {"747c": "Everyday it seems like you fail to achieve the lofty goals you set out for yourself, whether it’s your ability to complete tasks, respect others and yourselves, or even keep your thought life under control."}, {"14d2": "But since when did life become a pass/fail test?"}, {"cef6": "I admire you for your ambitions, for the standards you have been placed among the stars and the heroes, but I wonder if you’ll ever raise your head to see that you’ve already begun to fly."}, {"c13a": "Isn’t it okay to sleep in when you were up until 3am taking care of your sick daughter, making sure she had a cup of water by her bedside, a blanket for her shivering, and a hand for to hold onto when she got scared?"}, {"10f1": "Don’t be so hard on yourself because it’s only been two years since you moved to the states, not to mention never having had a chance to learn English formally. It takes a lot more time for you and even making that step towards commitment is what counts."}, {"8597": "And that girl you left? Well, how were you supposed to spare her from watching you deteriorate as the sickness slowly took away your life? You truly loved her. Doesn’t that count?"}, {"960e": "You get on yourself for not being good enough, scrutinizing every single moment of failure and complacency. You live your life under the microscope of your judgement and live in the cycle of guilt and failure when in fact you really are trying your best."}, {"a12c": "“…sometimes when we are beating ourselves up, we need to stop and say to that harassing voice inside, “Man, I’m doing the very best I can right now.” ” ― Brené Brown,"}, {"7968": "For all my perfectionists, my go-getters, and people of the grind, I know you will resonate with these words. After all, we carry the shared weight of our families, our friends, our futures, and even sometimes the future of mankind as well. And quite frankly, it’s heavy."}, {"f700": "And burdened with a task only fit for God, our inner man stands with slumped shoulders, beaten by the apathy necessary for our dreams and visions. Sure, it’s this resilience that’s curated the impervious discipline of a working machine, but it’s also what taunts you, cripples your imagination, and steals your freedom."}, {"42ed": "What’s success and power if you’re trapped in the confines of your self-incrimination? Isn’t it time to liberate yourselves from the chains of your self-condemnation?"}, {"1f2a": "Life is fierce enough as it is, we don’t need to go punching the air too."}, {"804f": "Your best doesn’t always have to equal an “A” or come with a check attached to it. It doesn’t have to light your name up on movie screens or have your face plastered on billboards and magazines. It doesn’t have to resemble a good life or even a smile. Because sometimes, doing your best just looks like gritting your teeth and getting through the pain."}, {"fb42": "Don’t count yourself out from the race just because you’re farther back than you hoped. After all, there’s no one else running except you."}, {"dbc0": "The best time, is your time."}, {"29d6": "Hit the Like button and you’ll make my day. I’m writing to empower dreamers after all :) And check out my blog WritingforTomorrow for more inspiration."}], "child": "2187_1\t2187_2", "parent": "", "title": "You’re Actually Trying Your Best", "content": "You’re Actually Trying Your Best “Are you trying your best? “ “…Well, I can probably do better.” There are piles and piles of corruptible material you have on yourself that would condemn you if you said otherwise. Just this morning you woke up at 5am like you planned and then went straight back to sleep, having convinced yourself an hour would suffice to finish your work. All of last week you skipped your daily dose of reading because you were bogged down with work. You told yourself that Saturday would be the day you would get all of your reading in since it was guaranteed to be sunny. Perfect reading weather. You said you wouldn’t fall for another girl. You said you wouldn’t hurt her the way you hurt the others. And yet, there you are walking away from a pair of tear-filled eyes. Everyday it seems like you fail to achieve the lofty goals you set out for yourself, whether it’s your ability to complete tasks, respect others and yourselves, or even keep your thought life under control. But since when did life become a pass/fail test? I admire you for your ambitions, for the standards you have been placed among the stars and the heroes, but I wonder if you’ll ever raise your head to see that you’ve already begun to fly. Isn’t it okay to sleep in when you were up until 3am taking care of your sick daughter, making sure she had a cup of water by her bedside, a blanket for her shivering, and a hand for to hold onto when she got scared? Don’t be so hard on yourself because it’s only been two years since you moved to the states, not to mention never having had a chance to learn English formally. It takes a lot more time for you and even making that step towards commitment is what counts. And that girl you left? Well, how were you supposed to spare her from watching you deteriorate as the sickness slowly took away your life? You truly loved her. Doesn’t that count? You get on yourself for not being good enough, scrutinizing every single moment of failure and complacency. You live your life under the microscope of your judgement and live in the cycle of guilt and failure when in fact you really are trying your best. “…sometimes when we are beating ourselves up, we need to stop and say to that harassing voice inside, “Man, I’m doing the very best I can right now.” ” ― Brené Brown, For all my perfectionists, my go-getters, and people of the grind, I know you will resonate with these words. After all, we carry the shared weight of our families, our friends, our futures, and even sometimes the future of mankind as well. And quite frankly, it’s heavy. And burdened with a task only fit for God, our inner man stands with slumped shoulders, beaten by the apathy necessary for our dreams and visions. Sure, it’s this resilience that’s curated the impervious discipline of a working machine, but it’s also what taunts you, cripples your imagination, and steals your freedom. What’s success and power if you’re trapped in the confines of your self-incrimination? Isn’t it time to liberate yourselves from the chains of your self-condemnation? Life is fierce enough as it is, we don’t need to go punching the air too. Your best doesn’t always have to equal an “A” or come with a check attached to it. It doesn’t have to light your name up on movie screens or have your face plastered on billboards and magazines. It doesn’t have to resemble a good life or even a smile. Because sometimes, doing your best just looks like gritting your teeth and getting through the pain. Don’t count yourself out from the race just because you’re farther back than you hoped. After all, there’s no one else running except you. The best time, is your time. Hit the Like button and you’ll make my day. I’m writing to empower dreamers after all :) And check out my blog WritingforTomorrow for more inspiration. ", "name": "2187"}