{"sentences": [{"b7ca": "The story of a trapped Moth"}, {"7122": "The moth lay still. Its face against the thick two-inch glass. Its little brain probably stretched to its limits. To make sense of this impossible problem. This quandary it has found itself in. The conundrum of seeing the whole world laid out in front of its eyes. The deep green mountain. The clear blue sky. The little silhouettes of sparrows and pigeons crisscrossing the sky. Everything the way it has been all its life. Everything so close, so near. Still, it can’t fly. Can’t escape. It let out a deep sigh."}, {"5f06": "Then, as if possessed by a mad spirit, a whim sprouting from the deepest of its consciousness, a strength from the reserves it has never known to exist within its tiny heart, it flapped its wings furiously. Back peddling the air with a violent thrust. Pushing its body forward with great force."}, {"9134": "And for a moment the moth felt it would be able to fly this time. Break away from this invisible prison. Breathe in the fresh air. Bathe in the pure light. But only for a moment. A small fleeting moment. For it was pushed back again. Like in all its attempts in the last fifteen minutes,"}, {"7cbe": "Because just as its feet left the ground. Just when it felt to the moth that it was about to soar into the free air, it felt a force, invisible, yet as great as it has never felt before, slapping it hard across its face, stopping its progress and putting it mercilessly back to where it began."}, {"cdfc": "The mad flapping of its wings lasted for a few seconds. Then the moth slipped down the pane, defeated and out of its wits until its body lay still on the window pane."}, {"af86": "It was the tenth time it had repeated this sequence of flapping its wings, rising up a little, until slapped back by the window pane and then laying down confused on the sill. Its fuel was running out. The moth knew it. But more than that it was the hope he was worried out. The reserve was drying up."}, {"727f": "The moth had got struck before. In the tangly web. Among the thick bushes. Even in the soft covers of the towers that moved around and made meaningless sounds. But this time it could feel it was different. Is it the end of life? a thought passed through its mind. Should I just sit now and accept the life as it is. Accept the fate. It never believed fate. But now nothing made sense."}, {"cd6d": "It was then moth felt a juxtaposition of two conflicting thoughts within its heart. One to resign and wait for the fate to play out the story for the moth. And another, wilder, and more primitive feeling, urging it to get up and do something about it."}, {"7e45": "It was tempting to follow the first, for it gave the satisfaction of blaming fate for the situation it was in. To leave it all and lay down and hope for things to happen, on their own. It was easy. It was tempting."}, {"1d54": "But, for the fighter the moth had been all its life, the second thought nudged it to do something. It told him if not you, nothing else would come and pick you up, help you find your way to home. Get up and do something. Doesn’t matter what. Doesn’t matter how. Don’t worry about you don’t know how it will pan out. Right now what matters is that you get up and start. Then things will fall into place."}, {"611e": "And then, hours later, when moth would reflect on this moment, it would find no logical reason why it still rose up. Why it flew the way it did? What possessed its soul? Why it chose that direction when logic said the other? There was no reason. But in that moment of utter desperation, instead of flying against the window pane, it turned back and flew in the direction opposite to the pane. Opposite to the world where it wanted to go to, into the meaningless shapes that existed. But it did. And later, the moth would thank that moment for providing it the wisdom to do that."}, {"3d80": "For just when it flew in the opposite direction, a draft of air pushed it down. Away from the pane that showed it the false world, into the world of unknown, and impossible. But it kept on flying, there was no turning back. And like it happens when you really try and move out of your comfort zone, it found a tiny slice of light high above everything that was out there."}, {"2950": "With single-minded focus it turned towards the light and flew up and up, the air becoming damper, its vision cloudy, for it was now tired, its wings screaming from pain, but still never stopping, for now, there was this hope that filled its heart and powered its body. And when it felt that its body would no more go forward, its wings would break from its body, its heart would stop beating, and it would fall down and never rise again, it felt a streak of light flashing its eyes, so brilliant that the moth was blinded, and then a draft of fresh air filled its lungs and with last two flaps of wings it found itself in the open air, in the world that it had ever seen, and then like a phoenix rising from its ashes, it felt itself born again — happiness like it had never filled — and it soared into the sky like it never had before in its life. For the moth was now free . The moth was born again."}, {"f2c5": "Hi. If you liked the post then recommend it to help it find more readers like you. :)"}], "child": "2188_12188_1", "parent": "", "title": "The story of a trapped Moth", "content": "The story of a trapped Moth The moth lay still. Its face against the thick two-inch glass. Its little brain probably stretched to its limits. To make sense of this impossible problem. This quandary it has found itself in. The conundrum of seeing the whole world laid out in front of its eyes. The deep green mountain. The clear blue sky. The little silhouettes of sparrows and pigeons crisscrossing the sky. Everything the way it has been all its life. Everything so close, so near. Still, it can’t fly. Can’t escape. It let out a deep sigh. Then, as if possessed by a mad spirit, a whim sprouting from the deepest of its consciousness, a strength from the reserves it has never known to exist within its tiny heart, it flapped its wings furiously. Back peddling the air with a violent thrust. Pushing its body forward with great force. And for a moment the moth felt it would be able to fly this time. Break away from this invisible prison. Breathe in the fresh air. Bathe in the pure light. But only for a moment. A small fleeting moment. For it was pushed back again. Like in all its attempts in the last fifteen minutes, Because just as its feet left the ground. Just when it felt to the moth that it was about to soar into the free air, it felt a force, invisible, yet as great as it has never felt before, slapping it hard across its face, stopping its progress and putting it mercilessly back to where it began. The mad flapping of its wings lasted for a few seconds. Then the moth slipped down the pane, defeated and out of its wits until its body lay still on the window pane. It was the tenth time it had repeated this sequence of flapping its wings, rising up a little, until slapped back by the window pane and then laying down confused on the sill. Its fuel was running out. The moth knew it. But more than that it was the hope he was worried out. The reserve was drying up. The moth had got struck before. In the tangly web. Among the thick bushes. Even in the soft covers of the towers that moved around and made meaningless sounds. But this time it could feel it was different. Is it the end of life? a thought passed through its mind. Should I just sit now and accept the life as it is. Accept the fate. It never believed fate. But now nothing made sense. It was then moth felt a juxtaposition of two conflicting thoughts within its heart. One to resign and wait for the fate to play out the story for the moth. And another, wilder, and more primitive feeling, urging it to get up and do something about it. It was tempting to follow the first, for it gave the satisfaction of blaming fate for the situation it was in. To leave it all and lay down and hope for things to happen, on their own. It was easy. It was tempting. But, for the fighter the moth had been all its life, the second thought nudged it to do something. It told him if not you, nothing else would come and pick you up, help you find your way to home. Get up and do something. Doesn’t matter what. Doesn’t matter how. Don’t worry about you don’t know how it will pan out. Right now what matters is that you get up and start. Then things will fall into place. And then, hours later, when moth would reflect on this moment, it would find no logical reason why it still rose up. Why it flew the way it did? What possessed its soul? Why it chose that direction when logic said the other? There was no reason. But in that moment of utter desperation, instead of flying against the window pane, it turned back and flew in the direction opposite to the pane. Opposite to the world where it wanted to go to, into the meaningless shapes that existed. But it did. And later, the moth would thank that moment for providing it the wisdom to do that. For just when it flew in the opposite direction, a draft of air pushed it down. Away from the pane that showed it the false world, into the world of unknown, and impossible. But it kept on flying, there was no turning back. And like it happens when you really try and move out of your comfort zone, it found a tiny slice of light high above everything that was out there. With single-minded focus it turned towards the light and flew up and up, the air becoming damper, its vision cloudy, for it was now tired, its wings screaming from pain, but still never stopping, for now, there was this hope that filled its heart and powered its body. And when it felt that its body would no more go forward, its wings would break from its body, its heart would stop beating, and it would fall down and never rise again, it felt a streak of light flashing its eyes, so brilliant that the moth was blinded, and then a draft of fresh air filled its lungs and with last two flaps of wings it found itself in the open air, in the world that it had ever seen, and then like a phoenix rising from its ashes, it felt itself born again — happiness like it had never filled — and it soared into the sky like it never had before in its life. For the moth was now free . The moth was born again. Hi. If you liked the post then recommend it to help it find more readers like you. :) ", "name": "2188"}