{"sentences": [{"fa8d": "The little joys of life"}, {"39ac": "I wake up this morning, and as always, snooze the alarm, the first of many more to follow. I see them neatly aligned along the top of my phone’s screen, among the usual notifications from Twitter, Gmail and Facebook. Groggily, I go through the motions of carelessly reading them, and swiping away. I’m in for a surprise this morning though. A mail from Medium, congratulating me on being a top writer in the Short Story tag."}, {"5a46": "If only I woke up to something like this everyday"}, {"a2c5": "Wide awake now, I promptly screenshot it, and send it to a friend. She’s someone who believes I write well, and will only get better the more I keep at it. I know for a fact that she can write, if only she chose to. Problem is, she doesn’t write as much as I do, or maybe she does, but chooses not to share it. More often than not, she is the first person to receive a draft of my work, even before I publish it on here, and she is, almost invariably, generous with her praise. It only seemed fitting that she be the first to know of this accolade as well."}, {"d7d3": "A while later, she replies with her typical exuberance that it is AWESOME and that she’s really proud of me. I thank her, and go on to explain how the concept of top writers works. That it is a list of the top 50 writers in a particular tag, selected based on both quality and quantity of your stories under that topic. And that this list is updated on a daily basis. She asks, jokingly (indicated by the :p smiley she so often uses), what if I’m to stay on this list for just one day?"}, {"809e": "Considering the content out there, with so many writers penning numerous works far better than mine, (I know this for a fact because I read a lot more than I write) I know that it is very likely. That I might have this feather in my cap for just one day."}, {"ac9d": "That’s not too bad, I tell myself. Even if it is for a little while, it feels good to be appreciated for something you love doing. I did not set out to write hoping that I’d someday feature as a top writer. If I did, I would never have started. Nevertheless, it gives you a slight sense of accomplishment, and I know my day will be a little less grayer for it. That’s how we live, counting the little joys of life. Somehow makes it seem less dreary."}, {"02dd": "I reply, “Well, if that’s the case, then I’ll just have to keep writing. And you’ll have to keep reading :) ”"}, {"75a5": "I’m taking this chance to thank the Medium Staff for running this platform, where so many writers like myself get to voice their minds, and share it with the community so encouraging and supportive. Had it not been for Medium, I doubt I’d have written even what little I have so far. Keep up the great work!"}, {"b6e8": "And a shout-out to the editors of The Coffeelicious. Thanks to Srinath, Carina Sitkus (and Danna Colman too) for tirelessly editing and publishing my stories. Warning: There’s more where this came from!"}, {"1b1c": "If you liked what you read, please consider hitting the Recommend button. Any feedback or comments you have would be more than welcome. Thanks!"}], "child": "2189_12189_12189_1", "parent": "", "title": "The little joys of life", "content": "The little joys of life I wake up this morning, and as always, snooze the alarm, the first of many more to follow. I see them neatly aligned along the top of my phone’s screen, among the usual notifications from Twitter, Gmail and Facebook. Groggily, I go through the motions of carelessly reading them, and swiping away. I’m in for a surprise this morning though. A mail from Medium, congratulating me on being a top writer in the Short Story tag. If only I woke up to something like this everyday Wide awake now, I promptly screenshot it, and send it to a friend. She’s someone who believes I write well, and will only get better the more I keep at it. I know for a fact that she can write, if only she chose to. Problem is, she doesn’t write as much as I do, or maybe she does, but chooses not to share it. More often than not, she is the first person to receive a draft of my work, even before I publish it on here, and she is, almost invariably, generous with her praise. It only seemed fitting that she be the first to know of this accolade as well. A while later, she replies with her typical exuberance that it is AWESOME and that she’s really proud of me. I thank her, and go on to explain how the concept of top writers works. That it is a list of the top 50 writers in a particular tag, selected based on both quality and quantity of your stories under that topic. And that this list is updated on a daily basis. She asks, jokingly (indicated by the :p smiley she so often uses), what if I’m to stay on this list for just one day? Considering the content out there, with so many writers penning numerous works far better than mine, (I know this for a fact because I read a lot more than I write) I know that it is very likely. That I might have this feather in my cap for just one day. That’s not too bad, I tell myself. Even if it is for a little while, it feels good to be appreciated for something you love doing. I did not set out to write hoping that I’d someday feature as a top writer. If I did, I would never have started. Nevertheless, it gives you a slight sense of accomplishment, and I know my day will be a little less grayer for it. That’s how we live, counting the little joys of life. Somehow makes it seem less dreary. I reply, “Well, if that’s the case, then I’ll just have to keep writing. And you’ll have to keep reading :) ” I’m taking this chance to thank the Medium Staff for running this platform, where so many writers like myself get to voice their minds, and share it with the community so encouraging and supportive. Had it not been for Medium, I doubt I’d have written even what little I have so far. Keep up the great work! And a shout-out to the editors of The Coffeelicious. Thanks to Srinath, Carina Sitkus (and Danna Colman too) for tirelessly editing and publishing my stories. Warning: There’s more where this came from! If you liked what you read, please consider hitting the Recommend button. Any feedback or comments you have would be more than welcome. Thanks! ", "name": "2189"}