{"name": "219", "parent": "", "content": "This Is The Antidote For Digital Narcissism By: John P. Weiss I saw a guy walk into a street sign recently. It was hysterical. He was holding up his smart phone, intently talking to it. I’m pretty sure he was filming himself. After he crashed into the sign, he cursed and dusted himself off. But then he held his phone back up and continued with his selfie monologue. Ah, the things we do for social media. Remember when that Pokemon phone app came out? Everyone was outside walking around like zombies. Some were oblivious to their surroundings and got mugged. Others nearly got run over by traffic. It all seemed a bit silly, but at least they were playing a game. Social media is different. It has become a kind of self esteem narcotic. People thrive on how many “likes” they get. They stage the best photos and curate the glamorous moments of their lives. It has become the new “keeping up with the Joneses.” You log onto Facebook and see your neighbor Joe on vacation in Hawaii. “Man, that guy has the life,” you think to yourself. Or you land on your college friend Becky’s Instagram page and see her feeding starving children in Africa. “That Becky, she’s such a saint,” you conclude. What you don’t know is that Joe got divorced recently and can’t afford that Hawaiian vacation. And Becky? She got all her stuff stolen in Zimbabwe and missed her connecting flight home. What’s sad is that for some people, the vacation didn’t happen and the charitable work doesn’t count unless it’s on social media. It has to be uploaded, seen and liked to matter. What you seldom see are the routine parts of people’s lives. The boring stuff like reading email at work. Poring over spreadsheets and enduring conference calls. Doing the laundry and vacuuming. How boring! People only portray the cool stuff. The coffee shop photos or selfies in the gym, where they’re showing up their sedentary friends. They share this stuff because it reflects well on them. They know it will garner lots of likes. And that makes them feel good. The question we should ask ourselves is this: What’s the point to all of this? Are we really so unfulfilled and shallow that we have to construct a fairy tale life on social media? Look at me! Look at me! Remember when you were a kid playing in the backyard or park? One of the things kids love to do is show off for their parents. Hang upside down on the monkey bars. Go to the top of the slide. Then yell out, “Look at me! Look at me!” When our parents smiled and acknowledged us, it made us feel good. That’s what we’re doing with a lot of social media. We’re documenting the cool parts of our lives and yelling, “Look at me! Look at me!” When people like our post or leave a comment, we feel validated. I totally get it. In fact, I’ve been guilty of the same thing. I put off joining Facebook for a long time. But once I set up my art site and started blogging, I learned that it’s helpful to post content on social media. It helps drive traffic back to your website. So, I got a Facebook page and created a public page, too. Every time I did a new painting or blog post, I put it up on Facebook. I loved getting likes and positive comments. Before long I became more and more immersed in the tactics of online marketing and social media posting. I started to read about the best times to post. I learned about copywriting and online marketing. Website design, email newsletters and the importance of growing your list. Soon, my vanity for more likes on Facebook spread to my appetite for more followers on my email list. I spent hours tweaking my website and honing my art and creativity niche. Just like everybody else, I figured if I could grow a huge list then I could sell a bunch of eBooks and courses and live the laptop lifestyle. Like Tim Ferriss and his 4 hour work week. Along the way, though, I started to notice something. I wasn’t very happy. Yes, my subscriber list grew and I truly value the readers who follow my art and musings. But likes and newsletter subscribers come and go. At best, they might affirm that you’re doing some good work. At worst, they’re just mildly interested folks who visited for a short time. The disease of digital narcissism Social media has become a place for distortions, where our real selves remain backstage. We photograph, photoshop, curate and upload the best we got. Then we hold our breath and pray for some attention. There’s a name for this mindless appetite for attention and validation. It’s called “digital narcissism.” Writer Zoe Williams wrote a piece in The Guardian titled “Me! Me! Me! Are We Living Through A Narcissism Epidemic?” Here’s an excerpt: “Elan Golomb describes narcissistic personality disorder in her seminal book Trapped in the Mirror. She goes on to describe the central symptom of the disorder — the narcissist’s failure to achieve intimacy with anyone — as the result of them seeing other people like items in a vending machine, using them to service their own needs, never being able to acknowledge that others might have needs of their own, still less guess what they might be.” Beyond the digital narcissism of social media lies the conceit and egotism that fuels our blogging and website dreams. We build our sites and create content for an amorphous audience of adulating fans. Or at least that’s the hope. Think for a moment about all those “grow your list” vendors out there. There are endless blogging websites and gurus who promise to help grow your audience. Just buy their killer course for $399 and you’ll even get to join their private Facebook group. It’s not that these folks are evil and I’m sure they have helped a lot of businesses and industrious bloggers get to the next level. But before you dive into any of that stuff, you must come back to my earlier question: What’s the point to all of this? For a lot of people, the point is twofold. Ego and money. Dedicate everything to your passion There was a book that came out many years ago called “Do What You Love And The Money Will Follow.” The message of the book is well intentioned. Namely, that success comes from doing what we’re passionate about. The problem is how we define success. There are plenty of actors waiting tables in Los Angeles. Waiting for their big break. Auditioning and holding on for that chance to find fame and fortune. They may be passionate about their acting, but there’s no guarantee it will lead to money. Better to view success more deeply than just financial rewards. Not that money doesn’t matter. All of us want to make money and enjoy the security and comforts that money can bring. But having money doesn’t always translate to feeling successful. I’ve met people who are financially wealthy but devoid of passion. They found success making money but not with finding a passionate life. I’ve met others who live passionate lives on modest incomes. The latter seem happier to me. Some say the only people who claim money doesn’t buy happiness are people without money. But that’s not true. There are plenty examples of people who walked away from their wealth to find a more fulfilling life. For example, CEO’s who quit the corporate treadmill and stress to have a quieter, more satisfying life. Here’s a quote I like from Indian composer and musician A. R. Rahman: “Success comes to those who dedicate everything to their passion in life. To be successful, it is also very important to be humble and never let fame or money travel to your head.” — A. R. Rahman I’ll bet if we asked A. R. Rahman, he’d agree that being successful isn’t about financial wealth but rather the spiritual nourishment that comes from doing the things we love. All of this gets back to the twofold reason people post like crazy on social media and nearly sell their souls to grow a blog: Ego and money. Their egos crave attention and before long they become full blown digital narcissists. Or their drive to live the laptop lifestyle and make money becomes their singular focus. Readers become abstractions to drive into a sales funnel. Herding nincompoops into sales funnels The founder of my website host, Fine Art Studio Online (FASO), is a guy named Clint Watson. Clint’s a former gallery owner and lover of fine art. He wrote a blog post about why he doesn’t like pop-ups on websites. You know, those annoying messages that suddenly appear, trying to entice you to sign up for their newsletter, free eBook or whatever. Does anyone like pop-ups? I doubt it. They interfere with enjoying the content on a website. Yet all the research shows that they succeed with conversions (getting people to sign up). Clint Watson’s blog post, Why I Don’t Like Email Newsletter Signup Pop-ups, explains how he constantly had to train his art gallery salespeople in the art of “qualifying” their customers. As Clint noted: “At an art opening, you must strive to spend time with the people most serious and most likely to purchase. It’s easy for a salesperson to fall into a routine of talking with the people who most want to talk. It’s easy to sign up the people who are eager to join yet another mailing list.” Now I know what the gang over at Sumo-me (they sell stuff like pop-ups to automate site growth) will probably tell me: “Hey, John, it’s a free country. Don’t use pop-ups if you don’t want to. Good luck with your three subscribers.” But here’s the thing. I want subscribers who sign up and follow my art site because they love the content. Not because I enticed them with a pop-up. As Clint Watson went on to write: “If someone loves your art, they will contact you. They will stay abreast of what you’re doing. And if they like receiving updates via email, they’ll sign up for your mailing list. I’m all for making your signup obvious and easy. Just don’t be the salesperson who gets in your best prospect’s faces, right when they’re studying your artwork or reading your latest blog post.” It’s better to have a small but loyal list of fans than a large group of lukewarm Internet surfers who succumbed to your pop-up. Email pop-ups convert a lot of people who like to sign up for email lists. But how long before they unsubscribe and move on to the next pop-up offer? What do pop-ups have to do with digital narcissism? Everything. They are another example of the pervasive pursuit of ego and money. The whole racket is designed to herd on-line nincompoops into sales funnels for mostly uninspiring courses and products. Fortunately, there’s an answer to all this madness. The privilege of a lifetime There is an antidote for digital narcissism and this misplaced allegiance to ego and money. There is a better way to share your passion with the world. Instead of shamelessly asking people to like you on Facebook or luring lemmings with pop-ups, there is a way forward. The antidote for digital narcissism is this: Authenticity. Remember when you were a teenager and you wanted to be just like your favorite movie star or rock God? Do you remember what your parents told you? “Just be yourself.” People who stop trying to be something they’re not eventually become their true selves. Which is a gift to the world because no-one is interested in cheap imitations. Authenticity works because people are drawn to it. There’s no pretension. No desperate bells and whistles to get people’s attention. Just a quiet, honest presentation of who you really are. “The privilege of a lifetime is to become who you truly are.” ― Carl Jung I’m not saying social media is evil, or that you shouldn’t try to make some money on-line. But don’t lose your soul in the process. Invest in yourself and hone your craft. The cream always rises to the top. All the pop-ups, Facebook likes, photos with “thought leaders” and “social proof” won’t make you a better painter or writer. Only dedicated, hard work will do that. I’ve often noticed that some of the painters I most admire don’t spend a lot of time commenting on social media. They focus on their craft. And because they do, their work seriously stands out. When they do post their art on social media, the response is overwhelming. Why? Because it’s the real deal. It’s authentic. The antidote to digital narcissism is authenticity. Rediscover who you are, devote yourself to improving your craft instead of endlessly tweaking your website. Put in the time to create truly original, authentic art. Remember the humanity in others. If more people shunned the empty rhetoric of the Internet and invested in their own artistic and personal growth, I think we’d see the death spiral of digital narcissism. Maybe even a renaissance like return to deeper, more meaningful art and personal expression. How cool would that be! Be yourself. Love your family. Embrace your authenticity. Hone your craft. See the humanity in others. That’s the path to the kind of life that’s worth living. Now what? Click the heart below to let others know you liked this article. To get free cartoons, stories and artwork, sign up for my email list here. ", "title": "This Is The Antidote For Digital Narcissism", "sentences": [{"dce2": "This Is The Antidote For Digital Narcissism"}, {"b72a": "By: John P. Weiss"}, {"d45b": "I saw a guy walk into a street sign recently. It was hysterical. He was holding up his smart phone, intently talking to it. I’m pretty sure he was filming himself."}, {"2238": "After he crashed into the sign, he cursed and dusted himself off. But then he held his phone back up and continued with his selfie monologue."}, {"8992": "Ah, the things we do for social media."}, {"c80b": "Remember when that Pokemon phone app came out? Everyone was outside walking around like zombies. Some were oblivious to their surroundings and got mugged. Others nearly got run over by traffic. It all seemed a bit silly, but at least they were playing a game."}, {"b63d": "Social media is different. It has become a kind of self esteem narcotic. People thrive on how many “likes” they get. They stage the best photos and curate the glamorous moments of their lives. It has become the new “keeping up with the Joneses.”"}, {"e8b3": "You log onto Facebook and see your neighbor Joe on vacation in Hawaii. “Man, that guy has the life,” you think to yourself. Or you land on your college friend Becky’s Instagram page and see her feeding starving children in Africa. “That Becky, she’s such a saint,” you conclude."}, {"f7c2": "What you don’t know is that Joe got divorced recently and can’t afford that Hawaiian vacation. And Becky? She got all her stuff stolen in Zimbabwe and missed her connecting flight home."}, {"6d68": "What’s sad is that for some people, the vacation didn’t happen and the charitable work doesn’t count unless it’s on social media. It has to be uploaded, seen and liked to matter."}, {"2299": "What you seldom see are the routine parts of people’s lives. The boring stuff like reading email at work. Poring over spreadsheets and enduring conference calls. Doing the laundry and vacuuming. How boring!"}, {"d2b0": "People only portray the cool stuff. The coffee shop photos or selfies in the gym, where they’re showing up their sedentary friends. They share this stuff because it reflects well on them. They know it will garner lots of likes. And that makes them feel good."}, {"bf80": "The question we should ask ourselves is this: What’s the point to all of this? Are we really so unfulfilled and shallow that we have to construct a fairy tale life on social media?"}, {"0021": "Look at me! Look at me!"}, {"2fba": "Remember when you were a kid playing in the backyard or park? One of the things kids love to do is show off for their parents. Hang upside down on the monkey bars. Go to the top of the slide. Then yell out, “Look at me! Look at me!” When our parents smiled and acknowledged us, it made us feel good."}, {"7a80": "That’s what we’re doing with a lot of social media. We’re documenting the cool parts of our lives and yelling, “Look at me! Look at me!” When people like our post or leave a comment, we feel validated."}, {"b29d": "I totally get it. In fact, I’ve been guilty of the same thing. I put off joining Facebook for a long time. But once I set up my art site and started blogging, I learned that it’s helpful to post content on social media. It helps drive traffic back to your website."}, {"3d02": "So, I got a Facebook page and created a public page, too. Every time I did a new painting or blog post, I put it up on Facebook. I loved getting likes and positive comments."}, {"0003": "Before long I became more and more immersed in the tactics of online marketing and social media posting. I started to read about the best times to post. I learned about copywriting and online marketing. Website design, email newsletters and the importance of growing your list."}, {"a050": "Soon, my vanity for more likes on Facebook spread to my appetite for more followers on my email list. I spent hours tweaking my website and honing my art and creativity niche."}, {"194c": "Just like everybody else, I figured if I could grow a huge list then I could sell a bunch of eBooks and courses and live the laptop lifestyle. Like Tim Ferriss and his 4 hour work week."}, {"de54": "Along the way, though, I started to notice something. I wasn’t very happy. Yes, my subscriber list grew and I truly value the readers who follow my art and musings. But likes and newsletter subscribers come and go. At best, they might affirm that you’re doing some good work. At worst, they’re just mildly interested folks who visited for a short time."}, {"89d5": "The disease of digital narcissism"}, {"3f3d": "Social media has become a place for distortions, where our real selves remain backstage. We photograph, photoshop, curate and upload the best we got. Then we hold our breath and pray for some attention."}, {"1e86": "There’s a name for this mindless appetite for attention and validation. It’s called “digital narcissism.”"}, {"43ee": "Writer Zoe Williams wrote a piece in The Guardian titled “Me! Me! Me! Are We Living Through A Narcissism Epidemic?” Here’s an excerpt:"}, {"bc54": "“Elan Golomb describes narcissistic personality disorder in her seminal book Trapped in the Mirror. She goes on to describe the central symptom of the disorder — the narcissist’s failure to achieve intimacy with anyone — as the result of them seeing other people like items in a vending machine, using them to service their own needs, never being able to acknowledge that others might have needs of their own, still less guess what they might be.”"}, {"6871": "Beyond the digital narcissism of social media lies the conceit and egotism that fuels our blogging and website dreams. We build our sites and create content for an amorphous audience of adulating fans. Or at least that’s the hope."}, {"e944": "Think for a moment about all those “grow your list” vendors out there. There are endless blogging websites and gurus who promise to help grow your audience. Just buy their killer course for $399 and you’ll even get to join their private Facebook group."}, {"5182": "It’s not that these folks are evil and I’m sure they have helped a lot of businesses and industrious bloggers get to the next level. But before you dive into any of that stuff, you must come back to my earlier question: What’s the point to all of this?"}, {"aa17": "For a lot of people, the point is twofold. Ego and money."}, {"6cf5": "Dedicate everything to your passion"}, {"7515": "There was a book that came out many years ago called “Do What You Love And The Money Will Follow.” The message of the book is well intentioned. Namely, that success comes from doing what we’re passionate about. The problem is how we define success."}, {"edc2": "There are plenty of actors waiting tables in Los Angeles. Waiting for their big break. Auditioning and holding on for that chance to find fame and fortune. They may be passionate about their acting, but there’s no guarantee it will lead to money."}, {"daba": "Better to view success more deeply than just financial rewards. Not that money doesn’t matter. All of us want to make money and enjoy the security and comforts that money can bring. But having money doesn’t always translate to feeling successful."}, {"8368": "I’ve met people who are financially wealthy but devoid of passion. They found success making money but not with finding a passionate life. I’ve met others who live passionate lives on modest incomes. The latter seem happier to me."}, {"411f": "Some say the only people who claim money doesn’t buy happiness are people without money. But that’s not true. There are plenty examples of people who walked away from their wealth to find a more fulfilling life. For example, CEO’s who quit the corporate treadmill and stress to have a quieter, more satisfying life."}, {"d379": "Here’s a quote I like from Indian composer and musician A. R. Rahman:"}, {"efb1": "“Success comes to those who dedicate everything to their passion in life. To be successful, it is also very important to be humble and never let fame or money travel to your head.” — A. R. Rahman"}, {"0c97": "I’ll bet if we asked A. R. Rahman, he’d agree that being successful isn’t about financial wealth but rather the spiritual nourishment that comes from doing the things we love."}, {"bbfd": "All of this gets back to the twofold reason people post like crazy on social media and nearly sell their souls to grow a blog: Ego and money. Their egos crave attention and before long they become full blown digital narcissists. Or their drive to live the laptop lifestyle and make money becomes their singular focus. Readers become abstractions to drive into a sales funnel."}, {"bcf9": "Herding nincompoops into sales funnels"}, {"ca4d": "The founder of my website host, Fine Art Studio Online (FASO), is a guy named Clint Watson. Clint’s a former gallery owner and lover of fine art. He wrote a blog post about why he doesn’t like pop-ups on websites. You know, those annoying messages that suddenly appear, trying to entice you to sign up for their newsletter, free eBook or whatever."}, {"05e8": "Does anyone like pop-ups? I doubt it. They interfere with enjoying the content on a website. Yet all the research shows that they succeed with conversions (getting people to sign up)."}, {"52f6": "Clint Watson’s blog post, Why I Don’t Like Email Newsletter Signup Pop-ups, explains how he constantly had to train his art gallery salespeople in the art of “qualifying” their customers. As Clint noted:"}, {"8bc1": "“At an art opening, you must strive to spend time with the people most serious and most likely to purchase. It’s easy for a salesperson to fall into a routine of talking with the people who most want to talk. It’s easy to sign up the people who are eager to join yet another mailing list.”"}, {"b8e6": "Now I know what the gang over at Sumo-me (they sell stuff like pop-ups to automate site growth) will probably tell me: “Hey, John, it’s a free country. Don’t use pop-ups if you don’t want to. Good luck with your three subscribers.”"}, {"dcf3": "But here’s the thing. I want subscribers who sign up and follow my art site because they love the content. Not because I enticed them with a pop-up. As Clint Watson went on to write:"}, {"7293": "“If someone loves your art, they will contact you. They will stay abreast of what you’re doing. And if they like receiving updates via email, they’ll sign up for your mailing list. I’m all for making your signup obvious and easy. Just don’t be the salesperson who gets in your best prospect’s faces, right when they’re studying your artwork or reading your latest blog post.”"}, {"30ae": "It’s better to have a small but loyal list of fans than a large group of lukewarm Internet surfers who succumbed to your pop-up. Email pop-ups convert a lot of people who like to sign up for email lists. But how long before they unsubscribe and move on to the next pop-up offer?"}, {"76c3": "What do pop-ups have to do with digital narcissism? Everything. They are another example of the pervasive pursuit of ego and money. The whole racket is designed to herd on-line nincompoops into sales funnels for mostly uninspiring courses and products."}, {"39d1": "Fortunately, there’s an answer to all this madness."}, {"e148": "The privilege of a lifetime"}, {"ef45": "There is an antidote for digital narcissism and this misplaced allegiance to ego and money. There is a better way to share your passion with the world. Instead of shamelessly asking people to like you on Facebook or luring lemmings with pop-ups, there is a way forward. The antidote for digital narcissism is this: Authenticity."}, {"864a": "Remember when you were a teenager and you wanted to be just like your favorite movie star or rock God? Do you remember what your parents told you? “Just be yourself.”"}, {"e142": "People who stop trying to be something they’re not eventually become their true selves. Which is a gift to the world because no-one is interested in cheap imitations."}, {"b53d": "Authenticity works because people are drawn to it. There’s no pretension. No desperate bells and whistles to get people’s attention. Just a quiet, honest presentation of who you really are."}, {"f7c5": "“The privilege of a lifetime is to become who you truly are.” ― Carl Jung"}, {"1403": "I’m not saying social media is evil, or that you shouldn’t try to make some money on-line. But don’t lose your soul in the process. Invest in yourself and hone your craft."}, {"3d78": "The cream always rises to the top. All the pop-ups, Facebook likes, photos with “thought leaders” and “social proof” won’t make you a better painter or writer. Only dedicated, hard work will do that."}, {"a1ca": "I’ve often noticed that some of the painters I most admire don’t spend a lot of time commenting on social media. They focus on their craft. And because they do, their work seriously stands out. When they do post their art on social media, the response is overwhelming. Why? Because it’s the real deal. It’s authentic."}, {"3bec": "The antidote to digital narcissism is authenticity. Rediscover who you are, devote yourself to improving your craft instead of endlessly tweaking your website. Put in the time to create truly original, authentic art. Remember the humanity in others."}, {"505f": "If more people shunned the empty rhetoric of the Internet and invested in their own artistic and personal growth, I think we’d see the death spiral of digital narcissism. Maybe even a renaissance like return to deeper, more meaningful art and personal expression. How cool would that be!"}, {"97db": "Be yourself. Love your family. Embrace your authenticity. Hone your craft. See the humanity in others."}, {"4c8b": "That’s the path to the kind of life that’s worth living."}, {"d45e": "Now what?"}, {"e75b": "Click the heart below to let others know you liked this article. To get free cartoons, stories and artwork, sign up for my email list here."}], "child": "219_1\t219_2\t219_3\t219_4\t219_5\t219_6\t219_7\t219_8\t219_9\t219_10\t219_11\t219_12\t219_13\t219_14\t219_15\t219_16\t219_17\t219_18\t219_19\t219_20\t219_21\t219_22\t219_23\t219_24\t219_25"}