{"sentences": [{"2f6d": "My Coping Strategy Called Tomorrow"}, {"ad24": "There was a point of time in my life when I lived in the fear of no tomorrow."}, {"64ae": "It was a perpetual, clawing, gnawing fear. My father was fighting a losing battle with cancer. And every day we went to bed wondering if this was it."}, {"26e7": "It was a Thursday when the battle was finally over. My father was gone."}, {"1a8f": "And guess what? There was still a tomorrow."}, {"f752": "I was thirteen. And the profound lesson that I learnt that Thursday has stayed with me ever since."}, {"6548": "There is always a tomorrow."}, {"7c6a": "Until there isn’t. And by then, it doesn’t matter anymore anyway."}, {"6e83": "But for as long as it matters, there is a tomorrow."}, {"e11d": "The ever expanding Universe of self help and life lessons is replete with advice of taking it one day at a time."}, {"715e": "They never tell you what day they are talking about. And I am thoroughly convinced that contrary to the popular belief, it is not today. It is tomorrow."}, {"f795": "Because today maybe messy and immediate and a whole lot of trouble. But tomorrow — tomorrow is just right. At just the right amount of distance; with just the right amount of trepidation; and most importantly, just the right amount of hope that maybe, just maybe it will turn out to be okay."}, {"59cc": "Everyone and their grandmother out there is urging us to live in the moment; promising us that present is all we have and we should make the best of it."}, {"4f4d": "It is a terrific advice. But sometimes, it is the present that we need to run from; sometimes the moment we are supposed to live in is so daunting, we’d rather bury our head in sand and risk choking to death instead of actually living it."}, {"ace5": "It is in moments like this we need something to anchor us. Something to keep us afloat and alive. Something to hold on to while the storm passes over."}, {"d355": "Something called tomorrow."}, {"9701": "When I am having a bad day, I tell myself tomorrow will be better. When someone else is having a bad day, I tell them the same thing — go to sleep. Tomorrow will be better."}, {"594a": "It is a small white lie."}, {"6b15": "Because there is no way to tell if tomorrow would be better. Or worse. But tomorrow will be different. And sometimes different is all we need. Especially when it comes wrapped in a promise. A promise, however flimsy, is still a promise. And is often enough to tide us over to the next day. And the day after that. And before we know, we are at the other end. The crisis is over. The promise of a better tomorrow has actually and finally led us to a better tomorrow."}, {"d78a": "I do wish it was as neat as I made it out to be. But, life doesn’t present anything to us on a platter, wrapped up in a neat little bow. There is no magical alleviation of the pain of going through the wall; or swimming through the murky, slimy ocean; or whatever it is your preferred analogy for getting through life."}, {"9f47": "Tomorrow is there to help us cope. It is not a magical remedy. It is just another name for hope. But if we let it, it does work like magic."}, {"b472": "In life, there will be pain; and frustration; and tragedies; and disappointments. There will also be success; and joy; and moments of unmatched happiness."}, {"e328": "Tomorrow is the bridge between the two. And to remember that it is a thoroughfare that works both ways will keep us humble in good times and courageous in bad."}, {"6662": "When my father passed away, the tomorrow sucked. But because it was there, we moved on. And kept moving. And that is how we made it. Beyond a shattering tragedy and more."}, {"edc7": "In the face of failures and tragedies and utter hopelessness, there is one thing we can always do. Put one foot in front of other and keep pushing. Even when it is dark and there is seemingly nowhere to go — no path or destination, one should keep moving. It is a classic survival strategy. It is also a classic success strategy."}, {"a054": "When nothing makes sense, stop thinking. Stop calculating. But don’t stop moving."}, {"0009": "Because irrespective of your predicament today, there is always a tomorrow. And more often than not, that is enough."}], "child": "2190_1\t2190_2\t2190_3\t2190_4\t2190_5\t2190_6", "parent": "", "title": "My Coping Strategy Called Tomorrow", "content": "My Coping Strategy Called Tomorrow There was a point of time in my life when I lived in the fear of no tomorrow. It was a perpetual, clawing, gnawing fear. My father was fighting a losing battle with cancer. And every day we went to bed wondering if this was it. It was a Thursday when the battle was finally over. My father was gone. And guess what? There was still a tomorrow. I was thirteen. And the profound lesson that I learnt that Thursday has stayed with me ever since. There is always a tomorrow. Until there isn’t. And by then, it doesn’t matter anymore anyway. But for as long as it matters, there is a tomorrow. The ever expanding Universe of self help and life lessons is replete with advice of taking it one day at a time. They never tell you what day they are talking about. And I am thoroughly convinced that contrary to the popular belief, it is not today. It is tomorrow. Because today maybe messy and immediate and a whole lot of trouble. But tomorrow — tomorrow is just right. At just the right amount of distance; with just the right amount of trepidation; and most importantly, just the right amount of hope that maybe, just maybe it will turn out to be okay. Everyone and their grandmother out there is urging us to live in the moment; promising us that present is all we have and we should make the best of it. It is a terrific advice. But sometimes, it is the present that we need to run from; sometimes the moment we are supposed to live in is so daunting, we’d rather bury our head in sand and risk choking to death instead of actually living it. It is in moments like this we need something to anchor us. Something to keep us afloat and alive. Something to hold on to while the storm passes over. Something called tomorrow. When I am having a bad day, I tell myself tomorrow will be better. When someone else is having a bad day, I tell them the same thing — go to sleep. Tomorrow will be better. It is a small white lie. Because there is no way to tell if tomorrow would be better. Or worse. But tomorrow will be different. And sometimes different is all we need. Especially when it comes wrapped in a promise. A promise, however flimsy, is still a promise. And is often enough to tide us over to the next day. And the day after that. And before we know, we are at the other end. The crisis is over. The promise of a better tomorrow has actually and finally led us to a better tomorrow. I do wish it was as neat as I made it out to be. But, life doesn’t present anything to us on a platter, wrapped up in a neat little bow. There is no magical alleviation of the pain of going through the wall; or swimming through the murky, slimy ocean; or whatever it is your preferred analogy for getting through life. Tomorrow is there to help us cope. It is not a magical remedy. It is just another name for hope. But if we let it, it does work like magic. In life, there will be pain; and frustration; and tragedies; and disappointments. There will also be success; and joy; and moments of unmatched happiness. Tomorrow is the bridge between the two. And to remember that it is a thoroughfare that works both ways will keep us humble in good times and courageous in bad. When my father passed away, the tomorrow sucked. But because it was there, we moved on. And kept moving. And that is how we made it. Beyond a shattering tragedy and more. In the face of failures and tragedies and utter hopelessness, there is one thing we can always do. Put one foot in front of other and keep pushing. Even when it is dark and there is seemingly nowhere to go — no path or destination, one should keep moving. It is a classic survival strategy. It is also a classic success strategy. When nothing makes sense, stop thinking. Stop calculating. But don’t stop moving. Because irrespective of your predicament today, there is always a tomorrow. And more often than not, that is enough. ", "name": "2190"}