{"sentences": [{"f99c": "How to Stop Holding Yourself Back"}, {"b7b2": "This post will help you identify, understand and change the self-sabotaging behaviours that are holding you back."}, {"ba27": "Note: I wrote this immediately after reading Jen Sincero’s incredible book, You Are A Badass. If you do one thing today, order that book and start over. Seriously, it will change your life. (No hyperbole required)."}, {"c8df": "Ready? Let’s do this."}, {"c86a": "ACKNOWLEDGE YOUR SUBCONSCIOUS"}, {"9a27": "It’s time to wake up."}, {"ead6": "When you were born, you were a blank canvas."}, {"db9d": "Over time, however, you started receiving messages from the people around you about the “way things are”."}, {"6461": "You started filling up with a lifetime’s worth of beliefs, which mostly have nothing to do with who you are or what is even necessarily true."}, {"c18a": "Need some examples?"}, {"0672": "“People like us never make it. Making money is hard. It’s impossible to make money out of creativity. Entrepreneurship is only for rich kids. Security only comes with a 9–5 job.” etc. etc. etc."}, {"a8d3": "The main source of these beliefs were your parents ft. society at large."}, {"0ef0": "Your parents, without even realising it, passed on their beliefs, which they learnt from their parents and they learnt from their parents…"}, {"6adf": "But none of these beliefs have anything to do with your reality or who YOU are. It’s time to wake up."}, {"5213": "UNDERSTAND YOUR SUBCONSCIOUS"}, {"a39d": "You’ve been fed belief systems your whole life. Maybe your parents never said negative things to you directly. Instead, maybe your dad would complain that money doesn’t grow on trees, or your mum would always associate security with a 9–5 full-time job."}, {"3a8f": "In your young and formative mind, this taught you that money and work = a source of negativity, and creative entrepreneurship = an instant path to failure. See? This shit is powerful. And acknowledging it and knowing that it isn’t reality, but totally in your head, is even more powerful."}, {"c058": "Task: identify the areas of your life you’d like to improve, and list the subconscious beliefs that could have caused them. What were your parents beliefs about money? What were the beliefs of the people you grew up around? Write. Them. Down. In doing so, you’ll be amazed at how you start instantly connecting the dots."}, {"115b": "Most people are totally oblivious to the fact they have subconscious belief systems running their lives, but YOU don’t have to be."}, {"42c2": "It’s not your fault that you have inherited beliefs, but it *is* your fault if you stay restricted by them."}, {"cdf4": "CHANGE HOW YOU SPEAK TO YOURSELF"}, {"ee57": "Do you criticise yourself constantly? Do you curse yourself on the regular?"}, {"99b5": "Start being more mindful about your internal monologue. If you wouldn’t say it to your best friend or someone you truly care about, don’t say it to yourself."}, {"8516": "Lesson: Thoughts become things."}, {"6382": "START SAYING AFFIRMATIONS. YES, I’M SERIOUS."}, {"0d06": "I’ll admit it: when Jen Sincero started talking about affirmations in You Are a Badass, I was skeptical. I mean, isn’t that for people who love chanting and dancing around an open fire? But I was wrong. Totally wrong."}, {"5d33": "Because once you identify your subconscious belief system and everything it’s holding you back from doing, you need to get some new beliefs in place."}, {"c9b9": "Sincero advises to choose an area of your life that’s troubling you (whether it’s your career, your love life or otherwise) and focus your affirmations around it Every. Single. Day."}, {"959f": "Some examples:"}, {"6739": "I am amazing, I am smart, I am successful."}, {"2ee2": "I am healthy, I control my body, my body doesn’t control me."}, {"3680": "I am a winner, I have opportunities, any company is lucky to have me."}, {"2c57": "Say them when you wake up, think them when you’re in line at the grocery store, or driving, or at work, repeat them in the mirror before you sleep…"}, {"b54b": "Just try it."}, {"830a": "GET OVER YOURSELF"}, {"9cc7": "Seriously. Get the f*ck over yourself. Do you remember that total catastrophe that happened to you at work five years ago? No? I thought as much."}, {"c6e1": "All of your worries and fears about how you’re coming across or how you might “fail” are irrelevant. I promise nobody’s watching that closely and that’s a fantastic, liberating thing."}, {"4f50": "KNOW THAT FORWARD IS FORWARD"}, {"aeb2": "Stop wasting hours and days and years trying to perfect your next move. You can only read and ponder and overanalyse so much."}, {"6983": "The truth is: You don’t need to have found “your calling” or have a grand plan, you just need to focus on the step in front of you. Because your first step will inform your next."}, {"8001": "You have a choice: You can either stay paralysed and unsatisfied, or you can start designing a life you love."}, {"31f3": "Stop holding yourself back and start moving."}, {"9e48": "Become a doer. Start doing. Learn from that doing. Repeat that doing. Do."}, {"a07f": "Your speed doesn’t matter. Forward is forward."}, {"9b60": "This post originally featured on my blog, BiancaBass.com"}, {"1de6": "Sign up for my free newsletter & you’ll receive insights from great minds + musings on careers, creativity and more."}], "child": "2191_12191_12191_1", "parent": "", "title": "How to Stop Holding Yourself Back", "content": "How to Stop Holding Yourself Back This post will help you identify, understand and change the self-sabotaging behaviours that are holding you back. Note: I wrote this immediately after reading Jen Sincero’s incredible book, You Are A Badass. If you do one thing today, order that book and start over. Seriously, it will change your life. (No hyperbole required). Ready? Let’s do this. ACKNOWLEDGE YOUR SUBCONSCIOUS It’s time to wake up. When you were born, you were a blank canvas. Over time, however, you started receiving messages from the people around you about the “way things are”. You started filling up with a lifetime’s worth of beliefs, which mostly have nothing to do with who you are or what is even necessarily true. Need some examples? “People like us never make it. Making money is hard. It’s impossible to make money out of creativity. Entrepreneurship is only for rich kids. Security only comes with a 9–5 job.” etc. etc. etc. The main source of these beliefs were your parents ft. society at large. Your parents, without even realising it, passed on their beliefs, which they learnt from their parents and they learnt from their parents… But none of these beliefs have anything to do with your reality or who YOU are. It’s time to wake up. UNDERSTAND YOUR SUBCONSCIOUS You’ve been fed belief systems your whole life. Maybe your parents never said negative things to you directly. Instead, maybe your dad would complain that money doesn’t grow on trees, or your mum would always associate security with a 9–5 full-time job. In your young and formative mind, this taught you that money and work = a source of negativity, and creative entrepreneurship = an instant path to failure. See? This shit is powerful. And acknowledging it and knowing that it isn’t reality, but totally in your head, is even more powerful. Task: identify the areas of your life you’d like to improve, and list the subconscious beliefs that could have caused them. What were your parents beliefs about money? What were the beliefs of the people you grew up around? Write. Them. Down. In doing so, you’ll be amazed at how you start instantly connecting the dots. Most people are totally oblivious to the fact they have subconscious belief systems running their lives, but YOU don’t have to be. It’s not your fault that you have inherited beliefs, but it *is* your fault if you stay restricted by them. CHANGE HOW YOU SPEAK TO YOURSELF Do you criticise yourself constantly? Do you curse yourself on the regular? Start being more mindful about your internal monologue. If you wouldn’t say it to your best friend or someone you truly care about, don’t say it to yourself. Lesson: Thoughts become things. START SAYING AFFIRMATIONS. YES, I’M SERIOUS. I’ll admit it: when Jen Sincero started talking about affirmations in You Are a Badass, I was skeptical. I mean, isn’t that for people who love chanting and dancing around an open fire? But I was wrong. Totally wrong. Because once you identify your subconscious belief system and everything it’s holding you back from doing, you need to get some new beliefs in place. Sincero advises to choose an area of your life that’s troubling you (whether it’s your career, your love life or otherwise) and focus your affirmations around it Every. Single. Day. Some examples: I am amazing, I am smart, I am successful. I am healthy, I control my body, my body doesn’t control me. I am a winner, I have opportunities, any company is lucky to have me. Say them when you wake up, think them when you’re in line at the grocery store, or driving, or at work, repeat them in the mirror before you sleep… Just try it. GET OVER YOURSELF Seriously. Get the f*ck over yourself. Do you remember that total catastrophe that happened to you at work five years ago? No? I thought as much. All of your worries and fears about how you’re coming across or how you might “fail” are irrelevant. I promise nobody’s watching that closely and that’s a fantastic, liberating thing. KNOW THAT FORWARD IS FORWARD Stop wasting hours and days and years trying to perfect your next move. You can only read and ponder and overanalyse so much. The truth is: You don’t need to have found “your calling” or have a grand plan, you just need to focus on the step in front of you. Because your first step will inform your next. You have a choice: You can either stay paralysed and unsatisfied, or you can start designing a life you love. Stop holding yourself back and start moving. Become a doer. Start doing. Learn from that doing. Repeat that doing. Do. Your speed doesn’t matter. Forward is forward. This post originally featured on my blog, BiancaBass.com Sign up for my free newsletter & you’ll receive insights from great minds + musings on careers, creativity and more. ", "name": "2191"}