{"sentences": [{"31aa": "Imagine They Are Lonely"}, {"fff2": "Because Maybe They Really Are"}, {"8cd8": "Imagine they are naked."}, {"9cb6": "It is an age old public speaking advice — the ultimate audience hack for jelly kneed speakers who would much rather jump off the nearest cliff instead of taking another dreaded step towards the stage."}, {"68b9": "I tried imagining them naked once. It wasn’t pleasant. Pretty scarring, if you ask me. Also, my giggling fit almost had me barred from all such competitions for rest of the school year."}, {"8cdd": "As I said, not pleasant. Whoever came up with that advice had a weird sense of humor. And weirder coping mechanism."}, {"8ae3": "It is a ridiculous advice. I am told it works. And perhaps those two statements are related."}, {"9127": "Bear with me, this rambling prelude does have a point."}, {"002f": "While this age old speaking wisdom did not really work for me, I recently discovered another kind of (more workable) wisdom inspired by this idea. A kind of a fanfic. Or more accurately, a spinoff. And while the success rate of spinoffs is usually questionable, this particular instance, at least for me, was an exception."}, {"20c7": "I am an introvert. I am also a compulsive talker who was consistently singled out (and sometimes punished) for being too talkative all through my school life. Beyond writing, talking is my second most favorite thing in the Universe."}, {"d3f7": "Actually third. Behaving like a consummate sloth usually takes precedence over the other two."}, {"2f54": "And yet, for all my love of talking, I hate talking to strangers. Making small talk (or whatever it is that functional people do at parties and other horrifying/awkward social situations) is the kind of nightmare whose mere mention gives me chills."}, {"4e28": "I love to talk. I also prefer conversations over small talk. And yes, I’d rather talk at a tree than initiate a conversation with strangers."}, {"db0d": "The dissonance is jarring. But I have had a lot of practice."}, {"35a5": "2016, however, turned out to be the year where life plucked me out of my blissful cocoon of familiar faces and dropped me amidst strangers. Over and over again."}, {"f9c6": "Imagine an invisible hand on your head, pushing you under icy water while you kick, scream and gasp for breath."}, {"d578": "It is a terrifying feeling — a sense of unprecedented fear."}, {"705c": "That is exactly how I felt. Initially, anyway."}, {"ef56": "But as 2016 graduated from a new year to a gradually aging year, something changed."}, {"2edd": "Anyone who has ever been crazy enough to jump headfirst into chilled water will tell you two things."}, {"8732": "First, it feels like a shock to the very core of your nerves. Not in a good way."}, {"8bc2": "Second, do it. The shock is shortlived, lasts only until your body acclimatizes. And it is worth it."}, {"46a5": "I haven’t tried jumping into a cold water pond. Yet."}, {"e0a6": "But I can tell you, both those facts are absolutely true."}, {"837d": "I went from two and a half people in my life to so many people within a few months. It wasn’t like jumping into cold water. It was worse."}, {"694c": "Until it wasn’t."}, {"3b12": "As the initial shock wore off, my fear morphed into minor discomfort which then dissolved into a genuinely pleasant experience."}, {"8d4e": "People. They were not so bad after all. Especially if you manage to find your kind. For most parts, I did. And even when I didn’t, the experience was still instructive."}, {"9928": "Not all people are meant to be your friends. Some of them are just great as colleagues. Some as gossip-buddies. Some as travel partners. Some as drinking buddies. And some as nothing more than the guy you bump into at the water cooler and talk about stuff with no long term implications."}, {"b682": "All of those people matter. All of those people are needed."}, {"c15b": "The problem with being an introvert (with varying degrees of social anxiety) is that even when you do realize the importance of people in your life in a theoretical sense, the practical manifestation of it doesn’t become any less harrowing."}, {"a491": "I wish I could tell you there was a magic solution to that issue. There isn’t. I still don’t like talking to strangers. It will always be a chore — something I will only subject myself to when absolutely necessary, and only via an elaborate roundabout route to trick my brain into it."}, {"6452": "But with 2016 forcing me into interactions, both wanted and unwanted, I had a brainwave."}, {"2e39": "It was more than a brainwave. It was a life hack; a networking hack; a ‘making friends’ hack."}, {"f5e6": "As an introvert, my biggest fear during one on ones of any kind is rejection. There is always a nagging fear of being unwanted; of saying or doing something offensive, something wrong; of being mistreated (where the idea of mistreatment has rather low standards — like someone being rude in a minor sense or simply being ignored)."}, {"b5af": "But as I interacted with more and more people from all walks of life, I discovered something fascinating."}, {"2ca9": "People crave company. Most of them anyway. It does not matter how fulfilled or successful or happy they seem. They are always happy to have someone to share their moments with, in whatever capacity. Perhaps because most of them, most of us, are deep within, a little lonely."}, {"7a79": "Maybe it is a function of the times we live in. Maybe it is an essential, unavoidable human condition. But loneliness is a constant in most of our lives, whether we realize it or not. And some part of us is always willing, more than willing to make space for someone, in one form or another, to alleviate that sense of loneliness. Or maybe share it."}, {"8dba": "People are susceptible to moods and circumstances. And social interactions are riddled with variables that are largely beyond our control. However, human souls are tuned to listen to the sincere sounds of other souls. And that is one advice that everyone needs to pay heed to."}, {"5301": "No advice is foolproof. There is no magic formula to transform an introvert into a social butterfly. And the fear and discomfort never really goes away. But it gets a little easier."}, {"37d5": "It did for me."}, {"c36d": "A friend (also an introvert) who spends most of his day-job fielding calls once told me that one of the ways he gets through his day is by imagining that the other person hates talking on the phone as much as he does."}, {"c80b": "It is an excellent strategy. To imagine the other person is as awkward as you are; as scared as you are; as uncertain as you are; as lonely as you are."}, {"bddf": "It is a trick. A mind game. More often than not, it is also true."}, {"3600": "A realization as simple as the fact that maybe, maybe the other person would like to have our company after all, can go a long way in boosting our interactions and inter-personal skills. With a smattering of sincerity and an honest attempt to just be with other people, you may find your tribe growing. And trust me, you will be better off for it. After all, if you are going to be lonely, it is better to be lonely with someone else. At least, it won’t get boring."}, {"5890": "If by any chance, you are one of those rare humans who are lucky enough to have escaped the demons of their loneliness, be glad and thank your stars. And then, go out and share your blessings with the ones who may not be similarly blessed."}, {"574a": "Ultimately, the easiest way to make friends (and to network) is to give up your many agendas and simply surrender to the ebb and flow of human interactions. And the easiest way to surrender, is to imagine they are all lonely."}, {"9a7e": "Because maybe they really are."}], "child": "2195_1\t2195_2\t2195_3\t2195_4\t2195_5\t2195_6\t2195_7", "parent": "", "title": "Imagine They Are Lonely", "content": "Imagine They Are Lonely Because Maybe They Really Are Imagine they are naked. It is an age old public speaking advice — the ultimate audience hack for jelly kneed speakers who would much rather jump off the nearest cliff instead of taking another dreaded step towards the stage. I tried imagining them naked once. It wasn’t pleasant. Pretty scarring, if you ask me. Also, my giggling fit almost had me barred from all such competitions for rest of the school year. As I said, not pleasant. Whoever came up with that advice had a weird sense of humor. And weirder coping mechanism. It is a ridiculous advice. I am told it works. And perhaps those two statements are related. Bear with me, this rambling prelude does have a point. While this age old speaking wisdom did not really work for me, I recently discovered another kind of (more workable) wisdom inspired by this idea. A kind of a fanfic. Or more accurately, a spinoff. And while the success rate of spinoffs is usually questionable, this particular instance, at least for me, was an exception. I am an introvert. I am also a compulsive talker who was consistently singled out (and sometimes punished) for being too talkative all through my school life. Beyond writing, talking is my second most favorite thing in the Universe. Actually third. Behaving like a consummate sloth usually takes precedence over the other two. And yet, for all my love of talking, I hate talking to strangers. Making small talk (or whatever it is that functional people do at parties and other horrifying/awkward social situations) is the kind of nightmare whose mere mention gives me chills. I love to talk. I also prefer conversations over small talk. And yes, I’d rather talk at a tree than initiate a conversation with strangers. The dissonance is jarring. But I have had a lot of practice. 2016, however, turned out to be the year where life plucked me out of my blissful cocoon of familiar faces and dropped me amidst strangers. Over and over again. Imagine an invisible hand on your head, pushing you under icy water while you kick, scream and gasp for breath. It is a terrifying feeling — a sense of unprecedented fear. That is exactly how I felt. Initially, anyway. But as 2016 graduated from a new year to a gradually aging year, something changed. Anyone who has ever been crazy enough to jump headfirst into chilled water will tell you two things. First, it feels like a shock to the very core of your nerves. Not in a good way. Second, do it. The shock is shortlived, lasts only until your body acclimatizes. And it is worth it. I haven’t tried jumping into a cold water pond. Yet. But I can tell you, both those facts are absolutely true. I went from two and a half people in my life to so many people within a few months. It wasn’t like jumping into cold water. It was worse. Until it wasn’t. As the initial shock wore off, my fear morphed into minor discomfort which then dissolved into a genuinely pleasant experience. People. They were not so bad after all. Especially if you manage to find your kind. For most parts, I did. And even when I didn’t, the experience was still instructive. Not all people are meant to be your friends. Some of them are just great as colleagues. Some as gossip-buddies. Some as travel partners. Some as drinking buddies. And some as nothing more than the guy you bump into at the water cooler and talk about stuff with no long term implications. All of those people matter. All of those people are needed. The problem with being an introvert (with varying degrees of social anxiety) is that even when you do realize the importance of people in your life in a theoretical sense, the practical manifestation of it doesn’t become any less harrowing. I wish I could tell you there was a magic solution to that issue. There isn’t. I still don’t like talking to strangers. It will always be a chore — something I will only subject myself to when absolutely necessary, and only via an elaborate roundabout route to trick my brain into it. But with 2016 forcing me into interactions, both wanted and unwanted, I had a brainwave. It was more than a brainwave. It was a life hack; a networking hack; a ‘making friends’ hack. As an introvert, my biggest fear during one on ones of any kind is rejection. There is always a nagging fear of being unwanted; of saying or doing something offensive, something wrong; of being mistreated (where the idea of mistreatment has rather low standards — like someone being rude in a minor sense or simply being ignored). But as I interacted with more and more people from all walks of life, I discovered something fascinating. People crave company. Most of them anyway. It does not matter how fulfilled or successful or happy they seem. They are always happy to have someone to share their moments with, in whatever capacity. Perhaps because most of them, most of us, are deep within, a little lonely. Maybe it is a function of the times we live in. Maybe it is an essential, unavoidable human condition. But loneliness is a constant in most of our lives, whether we realize it or not. And some part of us is always willing, more than willing to make space for someone, in one form or another, to alleviate that sense of loneliness. Or maybe share it. People are susceptible to moods and circumstances. And social interactions are riddled with variables that are largely beyond our control. However, human souls are tuned to listen to the sincere sounds of other souls. And that is one advice that everyone needs to pay heed to. No advice is foolproof. There is no magic formula to transform an introvert into a social butterfly. And the fear and discomfort never really goes away. But it gets a little easier. It did for me. A friend (also an introvert) who spends most of his day-job fielding calls once told me that one of the ways he gets through his day is by imagining that the other person hates talking on the phone as much as he does. It is an excellent strategy. To imagine the other person is as awkward as you are; as scared as you are; as uncertain as you are; as lonely as you are. It is a trick. A mind game. More often than not, it is also true. A realization as simple as the fact that maybe, maybe the other person would like to have our company after all, can go a long way in boosting our interactions and inter-personal skills. With a smattering of sincerity and an honest attempt to just be with other people, you may find your tribe growing. And trust me, you will be better off for it. After all, if you are going to be lonely, it is better to be lonely with someone else. At least, it won’t get boring. If by any chance, you are one of those rare humans who are lucky enough to have escaped the demons of their loneliness, be glad and thank your stars. And then, go out and share your blessings with the ones who may not be similarly blessed. Ultimately, the easiest way to make friends (and to network) is to give up your many agendas and simply surrender to the ebb and flow of human interactions. And the easiest way to surrender, is to imagine they are all lonely. Because maybe they really are. ", "name": "2195"}