{"sentences": [{"4853": "Why Does Everybody Want to Be Somebody?"}, {"b12c": "From the minute we are born we are encouraged to try and be ‘some-body’."}, {"5860": "Be a good boy. Be a nice girl. Work hard. Listen in class. Don’t be naughty. Eat your dinner if you want to grow up to be big and strong."}, {"14c1": "Before long we are sitting exams attempting to prove our intellectual value, then asked to choose careers or think about what we want to be when we grow up."}, {"b502": "We soon become fixated with achieving and striving towards what we consider ‘success’ to be. This can range from financial and career goals, a special relationship, the perfect body or the perfect cheekbones and lips."}, {"5803": "We are bombarded on tv, film, the internet and social media by people who have apparently ‘made it’. Our celebrity obsession points to an underlying belief that these ordinary human beings, essentially just like you and me, have now transcended ordinariness and stepped into extra-ordinariness and have now become ‘some-body’."}, {"e156": "2016 has been a crazy year and everybody is talking about how a lot of these ‘some-bodies’ have died and what a tragic year it has been. For sure there have been a huge amount of ‘some-bodies’ who sadly passed away this year — David Bowie, Alan Rickman, Muhammed Ali, Prince, George Michael, Rick Parfitt, Terry Wogan, Ronnie Corbett and Pete Burns to name but a few."}, {"d666": "A lot of these people were great, some of them were even exceptional at what they did. They also had to work really, really, really hard to become ‘some-body’. They sacrificed a huge amount and dedicated much of their lives to becoming ‘some-body’, many times driven on by the fear of ever being ‘no-body’."}, {"38b4": "Sometimes it was a pure, honest, selfless drive to create that drove them on — for many it was ego and ambition that drove them on, a desire to be loved and acknowledged, a desire to be famous, a desire to be more famous than other people. A few of them eventually found some contentment and happiness in their lives, but many of them were constantly tortured by their very demons that drove them on to seek that acknowledgement in the first place. ALL of them wanted to be ‘some-body’."}, {"fbc8": "How many times have you read about super famous people who worked their entire lives for that fame, success, recognition and acknowledgement, but then when they achieved their goals began to resent the intrusion and scrutiny and then longed desperately to be normal again and to lead a simpler life and be able to do ordinary things like go to the supermarket like ‘normal’ people?"}, {"0bf6": "This irony in many of their lives is, I believe, the same with everybody on the planet, namely that the only real peace we ever truly achieve in our lives is when we stop trying to be ‘some-body’ and allow ourselves to be ‘no-body’. When we can stop the chase, the hunt, the drive, the strive, the restlessness, the itch and the desire to be something other than we are — then we can finally find peace of mind."}, {"f9ac": "What’s wrong with being ‘no-body’ anyway? The ‘body’ ages, shrivels and eventually dies anyway. Hasn’t 2016 just shown us how some ‘bodies’ have died? No amount of fame, wealth, talent, success, natural beauty or plastic surgery stopped their ‘some-bodies’ from just becoming ‘no-bodies’ anyway. I know that sounds harsh, it isn’t meant in that way, but it is meant to say that it doesn’t matter who you are or what you achieve, you are going to be ‘no-body’ someday anyway."}, {"4a54": "Isn’t it better to spend our lives understanding what lies behind the body? Who are we really? What are we really? What are we doing here? What is our true purpose? Are we happy? Why are we unhappy?"}, {"fbff": "Aren’t our politics and our economies screwed because too many people who were trying to be ‘some-body’ screwed them up. It’s understandable that when you are desperately trying to be ‘some-body’ you will do whatever it takes to get there. That’s going to involve a lot of fear — fear of failure, fear of being ‘no-body’, fear of losing what you’ve created. Fear. Fear. Fear. That’s then going to lead to some really poor judgements and lots of greed, hatred, anger and a few other deadly sins thrown in for good measure. When people who are trying to be ‘some-body’ make decisions from this perspective, is it any wonder we are in the shape we are in ?"}, {"9d25": "Donald Trump, love him or hate him, he really is ‘some-body’. He’s worked his whole life to make sure he was ‘some-body’. He has relentlessly and mercilessly pursued everything he currently has in order to make sure he was never a ‘no-body’. He’s going to be President Of The United States soon. You have to hand it to him, he’s done a great job of being a ‘some-body’."}, {"e5f0": "Wouldn’t the world be a much better place if a ‘no-body’ was in charge? A ‘no-body’ who didn’t want to be special, didn’t need to be acknowledged, wasn’t driven by fame, wealth or power? A ‘no-body’ who just had total acceptance of themselves. It doesn’t mean that ‘no-body’ can’t make decisive, important decisions — it just means that ‘no-body’ wouldn’t have a personal agenda that clouded their decision making. ‘No-body’ would make a great President, a fantastic Prime-Minister. I trust ‘no-body’ to make financial decisions on our behalf."}, {"d561": "It’s like that with mindfulness and meditation. A lot of people worry that if they take up meditation they will lose their edge and their drive. What usually happens is that they may lose their ego based agenda which only clouds their thinking anyway and in return the decisions they do make come from a much clearer place. Their edge becomes razor sharp and their drive more honed and focussed."}, {"c355": "I first heard this idea many, many years ago on an audiobook by the great Ram Dass, ‘The Path To Service’, when he talks about his old friend Wavy Gravy’s political campaigning as NO-body — and funny as it sounds, it would be great."}, {"34fe": "‘No-body’ can really make things change."}, {"fdd5": "‘No-body’ can make the world a better, safer place."}, {"ef82": "‘No-body’ really cares."}, {"011b": "‘No-body’ is looking out for us."}, {"264d": "‘No-body’ loves us."}, {"e559": "Maybe that is what 2016 has been here to show us. Some ‘body’ is always going to die. ‘Some-body’ is always going to be President. ‘Some-body’ is always going to be better than, more talented than, richer than, prettier than you."}, {"6539": "Get over it. Accept it. Move on."}, {"2559": "Try to be the ‘no-body’ you always were, you always are, and you always are going to end up being eventually anyway. Then ironically you’ll really be somebody."}, {"d20e": "If you like my writing then please follow me on Twitter here and I will be able to update you with any future posts."}], "child": "2196_1\t2196_2\t2196_3\t2196_4\t2196_5\t2196_6\t2196_7\t2196_8\t2196_9\t2196_10\t2196_11\t2196_12\t2196_13\t2196_14\t2196_15", "parent": "", "title": "Why Does Everybody Want to Be Somebody?", "content": "Why Does Everybody Want to Be Somebody? From the minute we are born we are encouraged to try and be ‘some-body’. Be a good boy. Be a nice girl. Work hard. Listen in class. Don’t be naughty. Eat your dinner if you want to grow up to be big and strong. Before long we are sitting exams attempting to prove our intellectual value, then asked to choose careers or think about what we want to be when we grow up. We soon become fixated with achieving and striving towards what we consider ‘success’ to be. This can range from financial and career goals, a special relationship, the perfect body or the perfect cheekbones and lips. We are bombarded on tv, film, the internet and social media by people who have apparently ‘made it’. Our celebrity obsession points to an underlying belief that these ordinary human beings, essentially just like you and me, have now transcended ordinariness and stepped into extra-ordinariness and have now become ‘some-body’. 2016 has been a crazy year and everybody is talking about how a lot of these ‘some-bodies’ have died and what a tragic year it has been. For sure there have been a huge amount of ‘some-bodies’ who sadly passed away this year — David Bowie, Alan Rickman, Muhammed Ali, Prince, George Michael, Rick Parfitt, Terry Wogan, Ronnie Corbett and Pete Burns to name but a few. A lot of these people were great, some of them were even exceptional at what they did. They also had to work really, really, really hard to become ‘some-body’. They sacrificed a huge amount and dedicated much of their lives to becoming ‘some-body’, many times driven on by the fear of ever being ‘no-body’. Sometimes it was a pure, honest, selfless drive to create that drove them on — for many it was ego and ambition that drove them on, a desire to be loved and acknowledged, a desire to be famous, a desire to be more famous than other people. A few of them eventually found some contentment and happiness in their lives, but many of them were constantly tortured by their very demons that drove them on to seek that acknowledgement in the first place. ALL of them wanted to be ‘some-body’. How many times have you read about super famous people who worked their entire lives for that fame, success, recognition and acknowledgement, but then when they achieved their goals began to resent the intrusion and scrutiny and then longed desperately to be normal again and to lead a simpler life and be able to do ordinary things like go to the supermarket like ‘normal’ people? This irony in many of their lives is, I believe, the same with everybody on the planet, namely that the only real peace we ever truly achieve in our lives is when we stop trying to be ‘some-body’ and allow ourselves to be ‘no-body’. When we can stop the chase, the hunt, the drive, the strive, the restlessness, the itch and the desire to be something other than we are — then we can finally find peace of mind. What’s wrong with being ‘no-body’ anyway? The ‘body’ ages, shrivels and eventually dies anyway. Hasn’t 2016 just shown us how some ‘bodies’ have died? No amount of fame, wealth, talent, success, natural beauty or plastic surgery stopped their ‘some-bodies’ from just becoming ‘no-bodies’ anyway. I know that sounds harsh, it isn’t meant in that way, but it is meant to say that it doesn’t matter who you are or what you achieve, you are going to be ‘no-body’ someday anyway. Isn’t it better to spend our lives understanding what lies behind the body? Who are we really? What are we really? What are we doing here? What is our true purpose? Are we happy? Why are we unhappy? Aren’t our politics and our economies screwed because too many people who were trying to be ‘some-body’ screwed them up. It’s understandable that when you are desperately trying to be ‘some-body’ you will do whatever it takes to get there. That’s going to involve a lot of fear — fear of failure, fear of being ‘no-body’, fear of losing what you’ve created. Fear. Fear. Fear. That’s then going to lead to some really poor judgements and lots of greed, hatred, anger and a few other deadly sins thrown in for good measure. When people who are trying to be ‘some-body’ make decisions from this perspective, is it any wonder we are in the shape we are in ? Donald Trump, love him or hate him, he really is ‘some-body’. He’s worked his whole life to make sure he was ‘some-body’. He has relentlessly and mercilessly pursued everything he currently has in order to make sure he was never a ‘no-body’. He’s going to be President Of The United States soon. You have to hand it to him, he’s done a great job of being a ‘some-body’. Wouldn’t the world be a much better place if a ‘no-body’ was in charge? A ‘no-body’ who didn’t want to be special, didn’t need to be acknowledged, wasn’t driven by fame, wealth or power? A ‘no-body’ who just had total acceptance of themselves. It doesn’t mean that ‘no-body’ can’t make decisive, important decisions — it just means that ‘no-body’ wouldn’t have a personal agenda that clouded their decision making. ‘No-body’ would make a great President, a fantastic Prime-Minister. I trust ‘no-body’ to make financial decisions on our behalf. It’s like that with mindfulness and meditation. A lot of people worry that if they take up meditation they will lose their edge and their drive. What usually happens is that they may lose their ego based agenda which only clouds their thinking anyway and in return the decisions they do make come from a much clearer place. Their edge becomes razor sharp and their drive more honed and focussed. I first heard this idea many, many years ago on an audiobook by the great Ram Dass, ‘The Path To Service’, when he talks about his old friend Wavy Gravy’s political campaigning as NO-body — and funny as it sounds, it would be great. ‘No-body’ can really make things change. ‘No-body’ can make the world a better, safer place. ‘No-body’ really cares. ‘No-body’ is looking out for us. ‘No-body’ loves us. Maybe that is what 2016 has been here to show us. Some ‘body’ is always going to die. ‘Some-body’ is always going to be President. ‘Some-body’ is always going to be better than, more talented than, richer than, prettier than you. Get over it. Accept it. Move on. Try to be the ‘no-body’ you always were, you always are, and you always are going to end up being eventually anyway. Then ironically you’ll really be somebody. If you like my writing then please follow me on Twitter here and I will be able to update you with any future posts. ", "name": "2196"}