{"sentences": [{"03ac": "Who Am I?"}, {"3b05": "You Don’t Need an Answer. The Question is Enough."}, {"9f21": "Back in law school, when law was still an elephant for us (and that joke still somehow funny), we were introduced to the Pigeon Hole Theory. (Not to be confused with Pigeonhole Principle. That has something to do with Mathematics, and is consequently alien-speak, as far as I am concerned)"}, {"0959": "Apart from the remarkably memorable impression of a pigeon hole that our Professor had so kindly drawn for us on the board, I don’t remember much about the theory. Except that it had something to do with labeling various misdemeanors under predefined categories."}, {"3253": "Labeling things under predefined categories. Minus all the talk about crime and punishment, it almost seems like a theory about human nature."}, {"bbd2": "We love labels. Categories. Boxes. Nomenclatures."}, {"dd74": "It is a part of our attempt to establish our identity. Rationalize our differences."}, {"74a1": "Race. Caste. Class. Gender. Color. Religion. Nationality. Political views. Ideological allegiances. They are the obvious boxes. They are also the tip of the identity iceberg."}, {"4dfc": "Look deeper and you will find yourself drowning in labels."}, {"7af5": "Moody. Volatile. Anxious. Fidgety. Loving. Lonely. Devoted. Flirty. Liar. Ambitious. Risk-averse. Enterprising. Calculating. Idealist."}, {"d4db": "These words are not mere adjectives. These are a symbol of our everyday struggle to understand who we are; understand how we think; why we do what we do; and what does our existence mean?"}, {"a62e": "We need to find who we are. And that quest opens up new pathways for us, new destinations, new horizons."}, {"d96a": "Who am I?"}, {"b916": "The question is fundamental. Essential. Inevitable."}, {"e195": "The answer, however, is elusive. Transient. Transcendental."}, {"0a7f": "For years now, I have struggled with finding an answer to that question; finding my pigeonhole, my box where I was meant to fit in."}, {"c841": "I have, however, failed to find that box. Again. And again."}, {"4522": "Until recently, it had been a crippling struggle; a relentless source of personal frustration. Why couldn’t I, for once, just fit right in?"}, {"b2c5": "Then, I had an epiphany."}, {"3b3f": "Grown ups have a less dramatic term for it. Maturity."}, {"5604": "I prefer epiphany. It has a ring of excitement to it."}, {"149e": "Clearly, maturity is not the word for me."}, {"f3aa": "Anyway, back to my epiphany."}, {"bc09": "I realized that my abject failure in finding a box I could fit in, is perhaps the best thing that could have happened to me."}, {"ee32": "Because I could not fit myself in the first box (in my case a high salaried corporate job), I went looking for a second. Then a third. And fourth."}, {"95c8": "I have slogged like a workaholic (that usually doesn’t last long) and lazed around like a professional sloth."}, {"43e9": "I have been (or am, depending on the moment of time you are seeing this) a lawyer, a dancer, a startup-junkie, a wannabe entrepreneur, a life coach, a screenwriter, an almost filmmaker, a teacher, a content-expert, a blogger and an author."}, {"8412": "Some of those boxes were grueling. Some were plain fun. Most were an exciting mixture of both and subject to perspective management."}, {"e9e7": "Traveling and talking to strangers will never make it to the list of my top ten favorite things. Thanks to my box jumping, it wasn’t a choice. The compulsion of exploring places and people was a boon because otherwise I would have never indulged in either. And would have been worse off for it."}, {"d49a": "Along the way, I made an incredible number of friends and earned a bragging right to be able to belong to groups that are bound by interests as diverse as corporate ambition, spiritual detachment, entrepreneurial passion, misunderstood writing zeal and dancers’ obsession."}, {"3880": "I still don’t fit anywhere. But I belong to a whole lot of anywheres."}, {"473c": "I’d be lying if I said the experience was universally enthralling. There were hits and misses. Besides, box-jumping has its costs — frustration, insecurity, fluctuating bank account and zero stability."}, {"6994": "But if I were to do it again, I would not change a thing."}, {"0632": "Because those experiences, exciting and otherwise, shaped me, helped me identify what matters the most to me; gave me the courage to put up a fight no matter what and most importantly gave me the faith that when the say good things are coming, they are not lying."}, {"eb48": "Hopes, dreams and courage to take leaps of faith. Over and over again. They are my takeaways from all the boxes that I have been to. I am not sure if a single box would have been potent enough to have that degree of impact on me."}, {"5ef7": "A cozy and safe box is tempting. It is also a little limiting. Jumping boxes may be risky. But it is also unbelievably thrilling. It keeps me alive and excited for whatever is next."}, {"e50a": "And the costs — they are all worth it."}, {"57af": "So, who am I?"}, {"344f": "I haven’t the slightest idea. I prefer it that way. I don’t want to stop asking that question. But I don’t want the answer. Yet."}, {"9756": "This is not to say that fitting in a box is per se a bad thing. It is most definitely not. It is the crippling compulsion to find that damn box which is problematic. The find should be as organic as the search. There should be no force-fits, no have tos, no fears governing your decision about your box."}, {"b136": "So, go ahead, look for your box. But don’t be upset if you can’t find it right away. Keep looking. Keep asking."}, {"57f4": "Who am I?"}, {"9aa8": "Sometimes, the question is enough."}], "child": "2197_1\t2197_2\t2197_3\t2197_4\t2197_5\t2197_6\t2197_7\t2197_8", "parent": "", "title": "Who Am I?", "content": "Who Am I? You Don’t Need an Answer. The Question is Enough. Back in law school, when law was still an elephant for us (and that joke still somehow funny), we were introduced to the Pigeon Hole Theory. (Not to be confused with Pigeonhole Principle. That has something to do with Mathematics, and is consequently alien-speak, as far as I am concerned) Apart from the remarkably memorable impression of a pigeon hole that our Professor had so kindly drawn for us on the board, I don’t remember much about the theory. Except that it had something to do with labeling various misdemeanors under predefined categories. Labeling things under predefined categories. Minus all the talk about crime and punishment, it almost seems like a theory about human nature. We love labels. Categories. Boxes. Nomenclatures. It is a part of our attempt to establish our identity. Rationalize our differences. Race. Caste. Class. Gender. Color. Religion. Nationality. Political views. Ideological allegiances. They are the obvious boxes. They are also the tip of the identity iceberg. Look deeper and you will find yourself drowning in labels. Moody. Volatile. Anxious. Fidgety. Loving. Lonely. Devoted. Flirty. Liar. Ambitious. Risk-averse. Enterprising. Calculating. Idealist. These words are not mere adjectives. These are a symbol of our everyday struggle to understand who we are; understand how we think; why we do what we do; and what does our existence mean? We need to find who we are. And that quest opens up new pathways for us, new destinations, new horizons. Who am I? The question is fundamental. Essential. Inevitable. The answer, however, is elusive. Transient. Transcendental. For years now, I have struggled with finding an answer to that question; finding my pigeonhole, my box where I was meant to fit in. I have, however, failed to find that box. Again. And again. Until recently, it had been a crippling struggle; a relentless source of personal frustration. Why couldn’t I, for once, just fit right in? Then, I had an epiphany. Grown ups have a less dramatic term for it. Maturity. I prefer epiphany. It has a ring of excitement to it. Clearly, maturity is not the word for me. Anyway, back to my epiphany. I realized that my abject failure in finding a box I could fit in, is perhaps the best thing that could have happened to me. Because I could not fit myself in the first box (in my case a high salaried corporate job), I went looking for a second. Then a third. And fourth. I have slogged like a workaholic (that usually doesn’t last long) and lazed around like a professional sloth. I have been (or am, depending on the moment of time you are seeing this) a lawyer, a dancer, a startup-junkie, a wannabe entrepreneur, a life coach, a screenwriter, an almost filmmaker, a teacher, a content-expert, a blogger and an author. Some of those boxes were grueling. Some were plain fun. Most were an exciting mixture of both and subject to perspective management. Traveling and talking to strangers will never make it to the list of my top ten favorite things. Thanks to my box jumping, it wasn’t a choice. The compulsion of exploring places and people was a boon because otherwise I would have never indulged in either. And would have been worse off for it. Along the way, I made an incredible number of friends and earned a bragging right to be able to belong to groups that are bound by interests as diverse as corporate ambition, spiritual detachment, entrepreneurial passion, misunderstood writing zeal and dancers’ obsession. I still don’t fit anywhere. But I belong to a whole lot of anywheres. I’d be lying if I said the experience was universally enthralling. There were hits and misses. Besides, box-jumping has its costs — frustration, insecurity, fluctuating bank account and zero stability. But if I were to do it again, I would not change a thing. Because those experiences, exciting and otherwise, shaped me, helped me identify what matters the most to me; gave me the courage to put up a fight no matter what and most importantly gave me the faith that when the say good things are coming, they are not lying. Hopes, dreams and courage to take leaps of faith. Over and over again. They are my takeaways from all the boxes that I have been to. I am not sure if a single box would have been potent enough to have that degree of impact on me. A cozy and safe box is tempting. It is also a little limiting. Jumping boxes may be risky. But it is also unbelievably thrilling. It keeps me alive and excited for whatever is next. And the costs — they are all worth it. So, who am I? I haven’t the slightest idea. I prefer it that way. I don’t want to stop asking that question. But I don’t want the answer. Yet. This is not to say that fitting in a box is per se a bad thing. It is most definitely not. It is the crippling compulsion to find that damn box which is problematic. The find should be as organic as the search. There should be no force-fits, no have tos, no fears governing your decision about your box. So, go ahead, look for your box. But don’t be upset if you can’t find it right away. Keep looking. Keep asking. Who am I? Sometimes, the question is enough. ", "name": "2197"}