{"sentences": [{"505e": "This is a sculpture. Just kidding, it’s Christina’s World, by Andrew Wyeth."}, {"4796": "(220) Ease"}, {"01b6": "Is anything ever truly comfortable, is it ever automatic like blinking or breathing except wait, no, gasping chafes the dry tired edges of my wounds and my eyelids flutter like mosquitos too close to a candle, wings singed and all aching panic."}, {"8acc": "Is anything ever truly familiar, does it ever stop beating faster than you can run or slower than you can idle, or wait, is it always just on the edge of everything you can grab and anything you thought you knew and now nothing in your world fits your palms like you dreamed it did."}, {"333b": "How long on this bleak plain, how much more of callous wind and smirking grass. How many steps, how many mosquitos. How to walk when you can barely stumble."}, {"d1d5": "I thought life was art, and neither had ease because whatever plain rolled beneath my feet was always the plain before and not ahead, because whatever gasp I took was always because I was too slow or too fast and my stumble only walked in my prior prairie."}, {"6a59": "I thought ease was like perfection; always changing, never still."}, {"f174": "And yet, today I realized, as I played, I am easy, here in this note, on this phrase, around this piece."}, {"7cd2": "And it wasn’t elusive. It stayed."}], "child": "2198_1\t2198_2\t2198_3\t2198_4\t2198_5\t2198_6\t2198_7\t2198_8\t2198_9\t2198_10\t2198_11\t2198_12\t2198_13\t2198_14\t2198_15", "parent": "", "title": "(220) Ease", "content": "This is a sculpture. Just kidding, it’s Christina’s World, by Andrew Wyeth. (220) Ease Is anything ever truly comfortable, is it ever automatic like blinking or breathing except wait, no, gasping chafes the dry tired edges of my wounds and my eyelids flutter like mosquitos too close to a candle, wings singed and all aching panic. Is anything ever truly familiar, does it ever stop beating faster than you can run or slower than you can idle, or wait, is it always just on the edge of everything you can grab and anything you thought you knew and now nothing in your world fits your palms like you dreamed it did. How long on this bleak plain, how much more of callous wind and smirking grass. How many steps, how many mosquitos. How to walk when you can barely stumble. I thought life was art, and neither had ease because whatever plain rolled beneath my feet was always the plain before and not ahead, because whatever gasp I took was always because I was too slow or too fast and my stumble only walked in my prior prairie. I thought ease was like perfection; always changing, never still. And yet, today I realized, as I played, I am easy, here in this note, on this phrase, around this piece. And it wasn’t elusive. It stayed. ", "name": "2198"}