{"sentences": [{"f3c5": "Routine Isn’t Boring… It’s Key To Living Better"}, {"d2df": "I recently took two weeks off from my day job. Why? Well, besides feeling burnt out, I was curious about how the everyday would feel without the routine."}, {"6ddf": "No alarm clocks. No commitments. Nowhere to be. It was life on my own terms. The stuff that freelance dreams are made of."}, {"f79c": "I had heard the Internet’s cries to “live a life you love” loud and clear. Routine is the devil, and we should all aim for a life with no set schedule and that elusive “passive income”, right? So I thought I’d try it."}, {"2b6d": "Cue day one and, after a nine-hour sleep, I awoke feeling refreshed and, strangely, juvenile. It felt mischievous to be at home watching the rest of the world rush about their everyday business."}, {"dde3": "I went to the supermarket and enjoyed how empty it was. Hello, the perks of being freelance."}, {"ccb9": "I went for a walk in the park with a good book and then attempted to work on my blog."}, {"3594": "It wasn’t even 11am when I started to feel a little isolated. I felt a pang for tea breaks and mediocre small talk. Strange, I thought."}, {"287d": "I continued."}, {"b656": "I won’t bore you with the intricacies of my two-week sabbatical, but what I will say is that I expected it to be revolutionary. I expected it to show me that I could be productive and happy and content at home or working from my local coffee shop with no set hours. And, as nice as it was to not have to do my hair or get properly dressed for two weeks, I felt lost."}, {"f9cf": "The Internet makes you feel like routine is boring. And that the only life worth posting and tweeting and writing about is the freelance, “solotrepeneur” life. But it’s not."}, {"910a": "It was only when I saw Laura Jane Williams’ tweet that I got it: Routine is not the enemy."}, {"2d66": "Routine keeps my mental health in check, makes me get out of bed (important) and gives me a sense of belonging that, as humans, many of us need."}, {"785f": "I need a routine to get shit done."}, {"ccd8": "I need a routine to be my best self."}, {"5314": "A love for routine doesn’t mean you’re boring. Or playing it safe. Or living a little life."}, {"15c7": "No, a love for routine means you’re finding a life that works for you and leading your life the way you know best."}, {"ef69": "Now if you don’t mind me, I’m off to bed. My alarm is set for 6am and I’m more than ok with that."}, {"77c9": "This post was originally posted on my blog, BiancaBass.com."}, {"1b6f": "Sign up for my free newsletter and you’ll receive insights from great minds, plus musings on careers, creativity and more."}], "child": "2199_1\t2199_2\t2199_3\t2199_4\t2199_5\t2199_6\t2199_7\t2199_8\t2199_9\t2199_10\t2199_11\t2199_12\t2199_13\t2199_14\t2199_15\t2199_16\t2199_17\t2199_18\t2199_19\t2199_20\t2199_212199_1\t2199_2\t2199_3\t2199_4\t2199_5\t2199_6\t2199_7\t2199_8\t2199_9\t2199_10\t2199_11\t2199_12\t2199_13\t2199_14\t2199_15\t2199_16\t2199_17\t2199_18\t2199_19\t2199_20\t2199_21", "parent": "", "title": "Routine Isn’t Boring… It’s Key To Living Better", "content": "Routine Isn’t Boring… It’s Key To Living Better I recently took two weeks off from my day job. Why? Well, besides feeling burnt out, I was curious about how the everyday would feel without the routine. No alarm clocks. No commitments. Nowhere to be. It was life on my own terms. The stuff that freelance dreams are made of. I had heard the Internet’s cries to “live a life you love” loud and clear. Routine is the devil, and we should all aim for a life with no set schedule and that elusive “passive income”, right? So I thought I’d try it. Cue day one and, after a nine-hour sleep, I awoke feeling refreshed and, strangely, juvenile. It felt mischievous to be at home watching the rest of the world rush about their everyday business. I went to the supermarket and enjoyed how empty it was. Hello, the perks of being freelance. I went for a walk in the park with a good book and then attempted to work on my blog. It wasn’t even 11am when I started to feel a little isolated. I felt a pang for tea breaks and mediocre small talk. Strange, I thought. I continued. I won’t bore you with the intricacies of my two-week sabbatical, but what I will say is that I expected it to be revolutionary. I expected it to show me that I could be productive and happy and content at home or working from my local coffee shop with no set hours. And, as nice as it was to not have to do my hair or get properly dressed for two weeks, I felt lost. The Internet makes you feel like routine is boring. And that the only life worth posting and tweeting and writing about is the freelance, “solotrepeneur” life. But it’s not. It was only when I saw Laura Jane Williams’ tweet that I got it: Routine is not the enemy. Routine keeps my mental health in check, makes me get out of bed (important) and gives me a sense of belonging that, as humans, many of us need. I need a routine to get shit done. I need a routine to be my best self. A love for routine doesn’t mean you’re boring. Or playing it safe. Or living a little life. No, a love for routine means you’re finding a life that works for you and leading your life the way you know best. Now if you don’t mind me, I’m off to bed. My alarm is set for 6am and I’m more than ok with that. This post was originally posted on my blog, BiancaBass.com. Sign up for my free newsletter and you’ll receive insights from great minds, plus musings on careers, creativity and more. ", "name": "2199"}