{"name": "22", "parent": "", "content": "What My Stomach Parasite Taught Me About The Male Gaze 2007 on the first hike after not being able to move for 3 weeks When I am slightly overweight, which I have been at various times (including right now according to doctors who look like they survive on kale and mints), men will compliment me with the trembling self-satisfaction of someone who believes that they have just done something noble. It is very easy to tell when someone tells you that they find you attractive because they really do versus when they have deemed you ACCEPTABLY attractive for their needs, but have also measured you against a standing empirical standard and made an evaluation of your worth based on those standards. I promise that I have encountered both and that the latter isn’t necessarily a deal-breaker depending on what MY goals are so I have had the opportunity to get cozy with this mentality and get some insight into what makes it tick. Though my evidence is purely personal and largely based on my subjective intuition about a person’s hidden intent, I believe my experience supports the theory that while feminism has improved women’s ability to live their lives outside of the male gaze*, the male gaze itself is just as fucked up as it has ever been, and the failure to correct for this on both sides is a major barrier to gender equality. *The way in which the male gaze shapes rape culture and violence against women is a different issue, and one that women are busy combating while performative feminist fuckbois sit at home and reflect on how their disapproval of monogamy is making the world a better place. But I digress. My intention at this moment isn’t actually to argue the points above- you’re welcome to contact me directly if you’d like to discuss my views further. What I want to do now is present the story of me and my body and all of its various forms, and how that story has shaped my perspective. — — In early July of 2007, which was between my freshman and sophomore years of college, I did nothing for several weeks but vomit, shit, sleep, and go to the doctor. On a good day I could lie on the couch in the living room but most of the time I either slept in our antique claw-footed bathtub or on the bathroom floor. You might be thinking I was in withdrawal from some kind of substance addiction, but no, I was just normal-ass sick with absolutely no interesting stories or experiences to make it worthwhile. I wouldn’t find out until I had already been sick for several weeks that it was a stomach parasite. The first time I went to the doctor they told me it was a virus that was going around and I just needed to wait for it to pass in a couple days. Several days later I was still sick so I returned. They told me I was clearly not drinking enough water. I responded that I was drinking plenty, but I was throwing up so much I didn’t think it was sticking. They gave me some anti-nausea pills and sent me on my way. Several days later I was still sick so I returned, pre-emptively offering that I didn’t think the anti-nausea medication was working because I was throwing it up along with everything else. So they gave me anti-nausea suppository and sent me on my way. In case you are unfamiliar here is the WebMD definition of suppository: A suppository is another way to deliver a drug. It’s a small, round or cone-shaped object that you put in your body, often into your bottom. Once it’s inside, it melts or dissolves and releases its medication. Suppositories may not be the most pleasant product you’ll ever use. They are roughly the consistency of Babybel cheese wax after you’ve been fiddling with it in your palm for a while. It’s already unpleasant, but when you’ve had diarrhea for two weeks the idea of anything going into your bottom is enough to make you consider having the whole thing removed. They gave me the suppositories on a Friday and by Sunday I was so dehydrated that I had to go to the Emergency Room. By this time I had been sick for two weeks and I had already lost about 15 pounds, mostly of muscle in my legs. I also lost any extra fat on my belly, arms, and face, but the muscle accounted for more of the actual weight. I had more muscle to spare than most due to both genetics and an entire adolescence spent skiing, playing soccer, riding horses, and generally galavanting up and down the hilly landscape of my rural hometown in Vermont. Upon returning home from the hospital I was never “thin” after puberty but I was a pretty intuitive teenager and it only took a couple afternoons of research regarding my male friends’ favorite porn stars to understand that some of my more generous proportioning would not go unappreciated. The pathological implications of measuring oneself against pornstars before actually becoming sexually active is another troubling story for another upsetting day, but for the purposes of this story let it stand as evidence that prior to this unplanned rapid weight loss I was not at all unhappy with my less-than-delicate frame. Senior prom. I am wearing SO MUCH self tanner. The ER wait was brief because this was in Berlin, Vermont which is roughly in the middle of nowhere. The first thing they did was put me on a saline drip to rehydrate me. Once I felt capable of walking they had me leave some samples so they could run tests. While I was still there, back in bed with another bag of saline, the tests came back and the doctor informed me that I had Cryptosporidium Parvum. He also informed me that it had never been diagnosed in that hospital before, and that one thing that might lead to a vulnerability to it was HIV so they had gone ahead and tested me for that as well, just as a precaution. At that point in my life I had never had unprotected sex, done heroin, gotten a tattoo, or participated in any friendship blood rituals so I really had no reason to think I might be HIV positive. That didn’t stop me from deciding that I absolutely was HIV positive with a side of full blown AIDS that just hadn’t manifested yet. This would later be proved false.I left the hospital feeling much better, fear of AIDS aside, with a prescription for a drug that would kill the parasite and a recommendation to eat literally anything that might appeal to me even if it had zero nutritional value. The idea of “flavor” or anything that had any kind of smell was still revolting to me so I mostly ate jell-o and ramen with nothing on it for the next few weeks. My family had a trip to Camden, Maine planned that we left for the day after my hospital stay. It is a 5–6 hour drive and my butt was so drastically reduced from its usual glory that I had to sit on a stack of pillows. I wasn’t used to my coccyx being so poorly insulated from the outside world. I then spent most of the trip lying in a lawn chair telling my cousins, who were all 8 and younger, to kindly leave me alone. Where are my boobs? On this trip I went shopping at a local discount retailer and found that I now comfortably fit into size ZERO in jeans. I had always vacillated between a 4 and a 6 up to that point, with most of my body mass being in my hips, thighs, and buttocks. Now I had a thigh gap that had never been there and my ass protruded far less than I was used to. Even the size zeros slid down in the front, exposing an unfamiliar landscape of hip bones. While I was actively sick it never occurred to me to look in a mirror but now that I had regained some strength I could investigate my newly gaunt physique. I didn’t like it. I thought it made all of my features look too big for my face and my body felt child-like. Keep in mind I was only 19 and I had spent most of my adolescence waiting for my tits to come in. Now that I finally had them and understood their power they were all but taken away. I was not above being furious about this. I was also aware that anyone who didn’t know what happened was probably going to assume I had either developed an eating disorder at college or just decided to abandon strength in favor of a more delicate aesthetic. Later that month, when my energy had rebounded, I went out to lunch with a friend of mine from High School and our waitress was a teacher we both had. She looked at me, and then looked at my friend and told him he had to make sure that I ate. It’s possible that I was being oversensitive but the look on her face as she said it struck me as one of judgement rather than concern. Such vanity. I expected better of you. Before and After I can tell you in no uncertain terms that the way in which I received attention from men changed both in the remainder of that summer and when I returned to school. A stranger approached me in a pizza shop to talk to me about my cowboy boots and because it didn’t occur to me to be suspicious (they were very cool boots) I said “I’m glad you like them because they’re killing my feet!”. I was not flirting intentionally, but he took this as a cue to follow me out to the car and try to get my number, to which I responded by blinking flatly and informing him that my dad was waiting for me in the car. I saw an ex boyfriend whose previous apathy towards me seemed to abruptly shift to a tender eagerness to reignite what we had. I went to an open mic with a friend of mine and three men offered to buy me drinks. I wasn’t talking to them at all, let alone in a friendly manner, but they took my willingness to stand up and sing in public as an open invitation for attention. I tried to politely turn them down by informing them that I was only 19 and couldn’t drink but that actually had the reverse affect. They wondered if I’d like to step out for a cigarette. I did not. Once back at college I felt a distinct change in the way eyes were resting on me. This was in contrast to feeling like I spent the entirety of high school and my first year either at college either hoping for an adamant admirer or going out of my way to get what I wanted from someone I liked. I never felt like I didn’t deserve attention or that it was impossible that someone might be attracted to me, but I also never felt like all I had to do was say the word and suitors would materialize offering to suck face. The previous year in the wake of a breakup I wanted nothing more than to cleanse my system by making out with someone brand new at a party. When I went out with that purpose, though, my chosen mark ended up being the drunkest person there and I spent most of the night soothing him while he threw up and getting him home (who says chivalry is dead?). The next day he had no idea who I was and didn’t seem particularly thrilled to learn that I was his partner in crime for the night. My other experience outside of my relationship that year was equally disastrous. After the weight loss someone in one of my classes moved seats halfway through the semester to sit next to me, invited me to a party, and then very publicly initiated making out in the host’s kitchen. Where it went from there is less important, but I had never experienced that particular kind of courtship (for lack of a better word). I know everyone’s experience is different and I’m sure that women possessing all kinds of body types have always gotten this kind of attention, but I am telling you that not only had this never happened to me before, but it really hasn’t ever happened since. The weight started coming back throughout that year, and then I went on birth control which quickly returned me to my former fleshy glory (and then some). For the past 3+ years I have been actively “on the dating scene” in NYC, which must be the most data-rich environment there is when it comes to observing the behavior of men who, for whatever reason, want a specific outcome in their interactions with women. Of course now I have the element of aging working against me but so far as weight goes I have been on the rounder side. Even with the vastly expanded exposure vs a rural life in Vermont, I still have not received the kind of forceful, hungry attention I recall from when I was what felt like too thin. What I have received is genuine attention from people who actually care who I am, and I am aware that that is better. I’ve met a lot of otherwise kind and thoughtful men whose politics suggest they understand that women do not exist purely for their enjoyment, but who seem to suffer from some internal reckoning that tells them they should be aiming higher than someone with a little extra arm meat. To clarify, weight happens to be the variable that I have personally experienced, but I by no means wish to suggest it is the only factor which poses a problem when it comes to the way the Male Gaze is shaped. It is about having a body that is “wrong” in any way while also being female. Feminist thought asks us to constantly evaluate where the demands of what a woman should be come from and why. Women have come a long way in breaking down these constructs but men are the ones who keep rebuilding them by claiming that they are simply fulfilling some kind of natural order. When I was younger this attitude made me angry but now it just makes me sad for anyone who carries this burden. Like anyone else I have my certain tastes but I have always felt free to let myself be into someone without worrying about how much better I might be able to do. I have sat down to a date a little unsure if I found them attractive and by the end been completely convinced that they are the sexiest thing on earth based only on a particular smile or gesture and if my instincts were contingent upon broader empirical standards I honestly think I’d scrap the whole thing and subscribe to a vibrator of the month club. Some might argue that this is because men are more likely to be up for meeting up, flirting, and exploring the possibilities than women because of, you know, the fear of rape and murder, but Tinder stats alone would suggest that women are dancing over that barrier with grace. Honestly just wanted an excuse to share this. Women are subjected to more objectification on a societal level, but women who aim to enjoy themselves seem to be capable of doing so without assigning a series of qualifiers to the experience in the aftermath. This is not about falling in love or letting yourself get to know someone (I’m not that old fashioned) or even just about getting laid. It’s just about being able to fully enjoy being attracted to someone. Giving someone your attention should feel good and from my experiences as both a slim slice and juicy number men seem to be more tied to a cycle of unkind thoughts, shame, and the intentional erasure of experiences. Feminism doesn’t owe it to men to improve their experience, but I am wary that this dynamic is among the factors halting equality, and it is due to a lack of emotional empowerment in young men. More and more girls are growing up with a message of “girl power”, body positive messaging, and a focus on personal autonomy. My sister was 9 at the time. I was literally child-sized and people wanted to fuck me and it was weird. I know I said that I wasn’t here to defend my stance on the Male Gaze, but I think it’s necessary to respect that Capitalism makes it difficult for women to escape the oppression of the patriarchy due to the influence of the media and corporate advertising interests over our early development, and even more difficult for women of color to transcend their bonds and enjoy the rights and freedoms (as tenuous as they may be) that white women cemented earlier in history. I also believe that women are effectively promoting progress, overall. The next step is to work harder to incorporate boys into the conversation at a younger age so both sides will learn that they should ignore the messages that are intended to manipulate their desires in the name of capital gain. This inclusion would also ease the isolation of anyone questioning their gender to begin with but I have neither the personal experience OR the research to touch that right now, so I think I’ll wrap it up by saying that body freedom starts in the schools and we need to focus just as much on UNLEARNING toxic masculinity* as we do on empowering young women. In summary, I had a lot of diarrhea when I was 19 and while it briefly made me hotter, I think it also made me smarter. *this is a buzz word. I know it’s a buzz word. It is also an accurate word. 2007/2017 (good news: I figured out eyebrows!) 2007/2017 (Other than the weight I also figured out eyebrows) ", "title": "What My Stomach Parasite Taught Me About The Male Gaze", "sentences": [{"7c87": "What My Stomach Parasite Taught Me About The Male Gaze"}, {"baea": "2007 on the first hike after not being able to move for 3 weeks"}, {"a66e": "When I am slightly overweight, which I have been at various times (including right now according to doctors who look like they survive on kale and mints), men will compliment me with the trembling self-satisfaction of someone who believes that they have just done something noble. It is very easy to tell when someone tells you that they find you attractive because they really do versus when they have deemed you ACCEPTABLY attractive for their needs, but have also measured you against a standing empirical standard and made an evaluation of your worth based on those standards. I promise that I have encountered both and that the latter isn’t necessarily a deal-breaker depending on what MY goals are so I have had the opportunity to get cozy with this mentality and get some insight into what makes it tick."}, {"a1f4": "Though my evidence is purely personal and largely based on my subjective intuition about a person’s hidden intent, I believe my experience supports the theory that while feminism has improved women’s ability to live their lives outside of the male gaze*, the male gaze itself is just as fucked up as it has ever been, and the failure to correct for this on both sides is a major barrier to gender equality."}, {"dcd8": "*The way in which the male gaze shapes rape culture and violence against women is a different issue, and one that women are busy combating while performative feminist fuckbois sit at home and reflect on how their disapproval of monogamy is making the world a better place. But I digress."}, {"05b5": "My intention at this moment isn’t actually to argue the points above- you’re welcome to contact me directly if you’d like to discuss my views further. What I want to do now is present the story of me and my body and all of its various forms, and how that story has shaped my perspective."}, {"97e5": "— —"}, {"df4c": "In early July of 2007, which was between my freshman and sophomore years of college, I did nothing for several weeks but vomit, shit, sleep, and go to the doctor. On a good day I could lie on the couch in the living room but most of the time I either slept in our antique claw-footed bathtub or on the bathroom floor."}, {"eee7": "You might be thinking I was in withdrawal from some kind of substance addiction, but no, I was just normal-ass sick with absolutely no interesting stories or experiences to make it worthwhile. I wouldn’t find out until I had already been sick for several weeks that it was a stomach parasite."}, {"3ae0": "The first time I went to the doctor they told me it was a virus that was going around and I just needed to wait for it to pass in a couple days."}, {"7b67": "Several days later I was still sick so I returned. They told me I was clearly not drinking enough water. I responded that I was drinking plenty, but I was throwing up so much I didn’t think it was sticking. They gave me some anti-nausea pills and sent me on my way."}, {"3b9f": "Several days later I was still sick so I returned, pre-emptively offering that I didn’t think the anti-nausea medication was working because I was throwing it up along with everything else. So they gave me anti-nausea suppository and sent me on my way."}, {"c980": "In case you are unfamiliar here is the WebMD definition of suppository: A suppository is another way to deliver a drug. It’s a small, round or cone-shaped object that you put in your body, often into your bottom. Once it’s inside, it melts or dissolves and releases its medication. Suppositories may not be the most pleasant product you’ll ever use."}, {"c39c": "They are roughly the consistency of Babybel cheese wax after you’ve been fiddling with it in your palm for a while. It’s already unpleasant, but when you’ve had diarrhea for two weeks the idea of anything going into your bottom is enough to make you consider having the whole thing removed."}, {"597c": "They gave me the suppositories on a Friday and by Sunday I was so dehydrated that I had to go to the Emergency Room. By this time I had been sick for two weeks and I had already lost about 15 pounds, mostly of muscle in my legs. I also lost any extra fat on my belly, arms, and face, but the muscle accounted for more of the actual weight. I had more muscle to spare than most due to both genetics and an entire adolescence spent skiing, playing soccer, riding horses, and generally galavanting up and down the hilly landscape of my rural hometown in Vermont."}, {"ff86": "Upon returning home from the hospital"}, {"d550": "I was never “thin” after puberty but I was a pretty intuitive teenager and it only took a couple afternoons of research regarding my male friends’ favorite porn stars to understand that some of my more generous proportioning would not go unappreciated. The pathological implications of measuring oneself against pornstars before actually becoming sexually active is another troubling story for another upsetting day, but for the purposes of this story let it stand as evidence that prior to this unplanned rapid weight loss I was not at all unhappy with my less-than-delicate frame."}, {"fc63": "Senior prom. I am wearing SO MUCH self tanner."}, {"eda9": "The ER wait was brief because this was in Berlin, Vermont which is roughly in the middle of nowhere. The first thing they did was put me on a saline drip to rehydrate me. Once I felt capable of walking they had me leave some samples so they could run tests."}, {"0077": "While I was still there, back in bed with another bag of saline, the tests came back and the doctor informed me that I had Cryptosporidium Parvum. He also informed me that it had never been diagnosed in that hospital before, and that one thing that might lead to a vulnerability to it was HIV so they had gone ahead and tested me for that as well, just as a precaution. At that point in my life I had never had unprotected sex, done heroin, gotten a tattoo, or participated in any friendship blood rituals so I really had no reason to think I might be HIV positive. That didn’t stop me from deciding that I absolutely was HIV positive with a side of full blown AIDS that just hadn’t manifested yet. This would later be proved false.I left the hospital feeling much better, fear of AIDS aside, with a prescription for a drug that would kill the parasite and a recommendation to eat literally anything that might appeal to me even if it had zero nutritional value. The idea of “flavor” or anything that had any kind of smell was still revolting to me so I mostly ate jell-o and ramen with nothing on it for the next few weeks."}, {"d48c": "My family had a trip to Camden, Maine planned that we left for the day after my hospital stay. It is a 5–6 hour drive and my butt was so drastically reduced from its usual glory that I had to sit on a stack of pillows. I wasn’t used to my coccyx being so poorly insulated from the outside world. I then spent most of the trip lying in a lawn chair telling my cousins, who were all 8 and younger, to kindly leave me alone."}, {"747b": "Where are my boobs?"}, {"9cda": "On this trip I went shopping at a local discount retailer and found that I now comfortably fit into size ZERO in jeans. I had always vacillated between a 4 and a 6 up to that point, with most of my body mass being in my hips, thighs, and buttocks. Now I had a thigh gap that had never been there and my ass protruded far less than I was used to. Even the size zeros slid down in the front, exposing an unfamiliar landscape of hip bones."}, {"9b6c": "While I was actively sick it never occurred to me to look in a mirror but now that I had regained some strength I could investigate my newly gaunt physique. I didn’t like it. I thought it made all of my features look too big for my face and my body felt child-like. Keep in mind I was only 19 and I had spent most of my adolescence waiting for my tits to come in. Now that I finally had them and understood their power they were all but taken away. I was not above being furious about this."}, {"ba94": "I was also aware that anyone who didn’t know what happened was probably going to assume I had either developed an eating disorder at college or just decided to abandon strength in favor of a more delicate aesthetic. Later that month, when my energy had rebounded, I went out to lunch with a friend of mine from High School and our waitress was a teacher we both had. She looked at me, and then looked at my friend and told him he had to make sure that I ate. It’s possible that I was being oversensitive but the look on her face as she said it struck me as one of judgement rather than concern. Such vanity. I expected better of you."}, {"8c06": "Before and After"}, {"bd38": "I can tell you in no uncertain terms that the way in which I received attention from men changed both in the remainder of that summer and when I returned to school. A stranger approached me in a pizza shop to talk to me about my cowboy boots and because it didn’t occur to me to be suspicious (they were very cool boots) I said “I’m glad you like them because they’re killing my feet!”. I was not flirting intentionally, but he took this as a cue to follow me out to the car and try to get my number, to which I responded by blinking flatly and informing him that my dad was waiting for me in the car."}, {"7511": "I saw an ex boyfriend whose previous apathy towards me seemed to abruptly shift to a tender eagerness to reignite what we had. I went to an open mic with a friend of mine and three men offered to buy me drinks. I wasn’t talking to them at all, let alone in a friendly manner, but they took my willingness to stand up and sing in public as an open invitation for attention. I tried to politely turn them down by informing them that I was only 19 and couldn’t drink but that actually had the reverse affect. They wondered if I’d like to step out for a cigarette. I did not."}, {"79af": "Once back at college I felt a distinct change in the way eyes were resting on me. This was in contrast to feeling like I spent the entirety of high school and my first year either at college either hoping for an adamant admirer or going out of my way to get what I wanted from someone I liked. I never felt like I didn’t deserve attention or that it was impossible that someone might be attracted to me, but I also never felt like all I had to do was say the word and suitors would materialize offering to suck face."}, {"20b9": "The previous year in the wake of a breakup I wanted nothing more than to cleanse my system by making out with someone brand new at a party. When I went out with that purpose, though, my chosen mark ended up being the drunkest person there and I spent most of the night soothing him while he threw up and getting him home (who says chivalry is dead?). The next day he had no idea who I was and didn’t seem particularly thrilled to learn that I was his partner in crime for the night. My other experience outside of my relationship that year was equally disastrous."}, {"51ad": "After the weight loss someone in one of my classes moved seats halfway through the semester to sit next to me, invited me to a party, and then very publicly initiated making out in the host’s kitchen. Where it went from there is less important, but I had never experienced that particular kind of courtship (for lack of a better word)."}, {"ae6a": "I know everyone’s experience is different and I’m sure that women possessing all kinds of body types have always gotten this kind of attention, but I am telling you that not only had this never happened to me before, but it really hasn’t ever happened since. The weight started coming back throughout that year, and then I went on birth control which quickly returned me to my former fleshy glory (and then some)."}, {"6cbb": "For the past 3+ years I have been actively “on the dating scene” in NYC, which must be the most data-rich environment there is when it comes to observing the behavior of men who, for whatever reason, want a specific outcome in their interactions with women. Of course now I have the element of aging working against me but so far as weight goes I have been on the rounder side. Even with the vastly expanded exposure vs a rural life in Vermont, I still have not received the kind of forceful, hungry attention I recall from when I was what felt like too thin."}, {"bfa5": "What I have received is genuine attention from people who actually care who I am, and I am aware that that is better. I’ve met a lot of otherwise kind and thoughtful men whose politics suggest they understand that women do not exist purely for their enjoyment, but who seem to suffer from some internal reckoning that tells them they should be aiming higher than someone with a little extra arm meat."}, {"7275": "To clarify, weight happens to be the variable that I have personally experienced, but I by no means wish to suggest it is the only factor which poses a problem when it comes to the way the Male Gaze is shaped. It is about having a body that is “wrong” in any way while also being female. Feminist thought asks us to constantly evaluate where the demands of what a woman should be come from and why. Women have come a long way in breaking down these constructs but men are the ones who keep rebuilding them by claiming that they are simply fulfilling some kind of natural order."}, {"0e47": "When I was younger this attitude made me angry but now it just makes me sad for anyone who carries this burden. Like anyone else I have my certain tastes but I have always felt free to let myself be into someone without worrying about how much better I might be able to do. I have sat down to a date a little unsure if I found them attractive and by the end been completely convinced that they are the sexiest thing on earth based only on a particular smile or gesture and if my instincts were contingent upon broader empirical standards I honestly think I’d scrap the whole thing and subscribe to a vibrator of the month club."}, {"0f8e": "Some might argue that this is because men are more likely to be up for meeting up, flirting, and exploring the possibilities than women because of, you know, the fear of rape and murder, but Tinder stats alone would suggest that women are dancing over that barrier with grace."}, {"4df2": "Honestly just wanted an excuse to share this."}, {"0fac": "Women are subjected to more objectification on a societal level, but women who aim to enjoy themselves seem to be capable of doing so without assigning a series of qualifiers to the experience in the aftermath."}, {"0ea1": "This is not about falling in love or letting yourself get to know someone (I’m not that old fashioned) or even just about getting laid. It’s just about being able to fully enjoy being attracted to someone. Giving someone your attention should feel good and from my experiences as both a slim slice and juicy number men seem to be more tied to a cycle of unkind thoughts, shame, and the intentional erasure of experiences."}, {"dee0": "Feminism doesn’t owe it to men to improve their experience, but I am wary that this dynamic is among the factors halting equality, and it is due to a lack of emotional empowerment in young men. More and more girls are growing up with a message of “girl power”, body positive messaging, and a focus on personal autonomy."}, {"fff5": "My sister was 9 at the time. I was literally child-sized and people wanted to fuck me and it was weird."}, {"7e32": "I know I said that I wasn’t here to defend my stance on the Male Gaze, but I think it’s necessary to respect that Capitalism makes it difficult for women to escape the oppression of the patriarchy due to the influence of the media and corporate advertising interests over our early development, and even more difficult for women of color to transcend their bonds and enjoy the rights and freedoms (as tenuous as they may be) that white women cemented earlier in history. I also believe that women are effectively promoting progress, overall. The next step is to work harder to incorporate boys into the conversation at a younger age so both sides will learn that they should ignore the messages that are intended to manipulate their desires in the name of capital gain. This inclusion would also ease the isolation of anyone questioning their gender to begin with but I have neither the personal experience OR the research to touch that right now, so I think I’ll wrap it up by saying that body freedom starts in the schools and we need to focus just as much on UNLEARNING toxic masculinity* as we do on empowering young women."}, {"875d": "In summary, I had a lot of diarrhea when I was 19 and while it briefly made me hotter, I think it also made me smarter."}, {"5a51": "*this is a buzz word. I know it’s a buzz word. It is also an accurate word."}, {"9890": "2007/2017 (good news: I figured out eyebrows!)"}, {"ea13": "2007/2017 (Other than the weight I also figured out eyebrows)"}], "child": "22_1\t22_2\t22_3\t22_4\t22_5\t22_6\t22_7\t22_8\t22_9\t22_10\t22_11\t22_12\t22_13\t22_14\t22_15\t22_16\t22_17\t22_18\t22_19\t22_20\t22_21\t22_22\t22_23\t22_24\t22_25"}