{"sentences": [{"078b": "Fearless is a complete crock of bullshit"}, {"5714": "How to look brave when you‘re really not"}, {"d994": "I am pretty much always scared."}, {"39ab": "Fear drives me, so it’s probably okay. I end up working twelve or fourteen hour days. And I get stuff done. I don’t know how healthy that is, but it’s my truth anyway."}, {"1649": "But still, I am always scared."}, {"4ded": "Maybe the next thing I do will be the thing that ruins Ninja Writers and then I’ll slip back into poverty and maybe I’ll struggle to feed my kids like I struggled to feed my brothers a million years ago."}, {"22c4": "Maybe I’ll never have another good idea."}, {"81f2": "Maybe my first indie book is going to completely flop."}, {"62ab": "Maybe I’m really just a fraud and everyone knows it but me."}, {"d7be": "I do this one thing when I’m scared: I make myself stop thinking about the big picture and just focus on the next step."}, {"c5f8": "No. That’s not right. I think about the next half step. Or tiny toe forward. Literally, the tiniest thing I can do next. I keep looking until I find something that A) moves me forward and B) is small enough not to trigger my flight or fight response."}, {"1cf3": "Because I’m a flight-er. A flee-r. I quit. A lot. But there are somethings that are important enough to me that I don’t want to give up. So, I have to trick that instinct and become a fighter on a micro level."}, {"12fd": "Maybe I’ll never be a bestselling author, but I can write the next paragraph."}, {"fb78": "Maybe I’ll never have a mentor, but I can share an idea or ask a question."}, {"5ba2": "Maybe Ninja Writers won’t ever reach it’s potential, but I can ask the Ninjas that have already joined this thing what they’re working on."}, {"6118": "Maybe I’ll choke before I get close to an Iron Man, but I can take a walk today."}, {"99e4": "I’m not really brave, but my willingness to keep doing the next thing sometimes makes me look like I am. And sometimes looking like I am is enough to make me feel like maybe I am brave enough for today, and usually that’s okay."}, {"8613": "Here’s another thing: I look for someone else who’s doing the thing that scares me. I keep looking at them until my brain shifts and I can see that they’re just a regular person."}, {"765a": "And if they were brave enough to do the very next tiny thing, then so am I."}, {"eba9": "Once upon a time, Stephen King was an English teacher writing in the laundry room. And JK Rowling was a single welfare mom on a train. And a legion of other writers who aren’t unicorns were brave enough to write the next paragraph and put the next story out there."}, {"7520": "If they are, I am."}, {"3f9b": "I share ideas, when the opportunity rears its head. Which, let me tell you, is sometimes terrifying. But it works."}, {"5d3e": "I ask questions."}, {"2e72": "And I see if I can be brave, or at least pretend to be, for the next ten seconds. And the next. It stacks up."}, {"a5fe": "If you enjoyed this post, give it some love with a heart. ❤❤❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "child": "2200_1\t2200_2\t2200_3\t2200_4\t2200_5\t2200_62200_1\t2200_2\t2200_3\t2200_4\t2200_5\t2200_6", "parent": "", "title": "Fearless is a complete crock of bullshit", "content": "Fearless is a complete crock of bullshit How to look brave when you‘re really not I am pretty much always scared. Fear drives me, so it’s probably okay. I end up working twelve or fourteen hour days. And I get stuff done. I don’t know how healthy that is, but it’s my truth anyway. But still, I am always scared. Maybe the next thing I do will be the thing that ruins Ninja Writers and then I’ll slip back into poverty and maybe I’ll struggle to feed my kids like I struggled to feed my brothers a million years ago. Maybe I’ll never have another good idea. Maybe my first indie book is going to completely flop. Maybe I’m really just a fraud and everyone knows it but me. I do this one thing when I’m scared: I make myself stop thinking about the big picture and just focus on the next step. No. That’s not right. I think about the next half step. Or tiny toe forward. Literally, the tiniest thing I can do next. I keep looking until I find something that A) moves me forward and B) is small enough not to trigger my flight or fight response. Because I’m a flight-er. A flee-r. I quit. A lot. But there are somethings that are important enough to me that I don’t want to give up. So, I have to trick that instinct and become a fighter on a micro level. Maybe I’ll never be a bestselling author, but I can write the next paragraph. Maybe I’ll never have a mentor, but I can share an idea or ask a question. Maybe Ninja Writers won’t ever reach it’s potential, but I can ask the Ninjas that have already joined this thing what they’re working on. Maybe I’ll choke before I get close to an Iron Man, but I can take a walk today. I’m not really brave, but my willingness to keep doing the next thing sometimes makes me look like I am. And sometimes looking like I am is enough to make me feel like maybe I am brave enough for today, and usually that’s okay. Here’s another thing: I look for someone else who’s doing the thing that scares me. I keep looking at them until my brain shifts and I can see that they’re just a regular person. And if they were brave enough to do the very next tiny thing, then so am I. Once upon a time, Stephen King was an English teacher writing in the laundry room. And JK Rowling was a single welfare mom on a train. And a legion of other writers who aren’t unicorns were brave enough to write the next paragraph and put the next story out there. If they are, I am. I share ideas, when the opportunity rears its head. Which, let me tell you, is sometimes terrifying. But it works. I ask questions. And I see if I can be brave, or at least pretend to be, for the next ten seconds. And the next. It stacks up. If you enjoyed this post, give it some love with a heart. ❤❤❤ >>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "name": "2200"}