{"sentences": [{"f9d7": "Find Your Joy"}, {"fcf3": "Or, you know, a less boring way to think of a decision matrix"}, {"e8d4": "Yes, this is a real photo of me at one of my jobs, and that is actually my dog."}, {"a9de": "I was driving over the Golden Gate Bridge when my iPhone’s caller ID lit up with a recruiter’s number. (I’d memorized it.) Days before, I’d completed a final round interview with the team I hoped to run for my very first Director-level position."}, {"f4c9": "I damn near drove off the bridge."}, {"9608": "Being the law-abiding driver (who is also terrified of bridges), I squealed (alone, in my car) until I pulled off at the Golden Gate Bridge parking lot and visitor’s center. With shaking hands, I called back the recruiter, and she gave me the good news that I had gotten the job."}, {"95c7": "When I called my then-boyfriend (now husband), he was walking down the street with a few friends who were industry journalists. I was shrieking so loudly he had to abruptly break away from them so that they didn’t hear my good news."}, {"4e11": "When I look back on some of my best days, and proudest, happiest moments, those couple minutes rank very high on the list."}, {"5874": "Sure, the thrill was about nailing the interviews, landing the job, getting a coveted promotion and a sizable pay-bump. But I remember exactly what the sunset looked like that day because I’d found joy."}, {"c32d": "I make old-fashioned decisions matrices when I am considering a new role these days, and if enough boxes aren’t checked, no matter the offer, my answer is “no”. The categories change over time and, while they always carry some standards like “compensation” and “perks” and “room for growth”, the most important areas are those that are highly personalized to me. My standards? Dog friendly. Managing a team. Working out of headquarters. Creativity. Risk. Each of these areas has a weight behind them — my last two jobs, for example, were not dog friendly. Not every category is make-or-break, much to the chagrin of the miniature dachshund sitting on my lap right now."}, {"ae00": "I know what I love, and I know what I need, and I’ve worked long enough to know what cannot make me happy, no matter how much of it I have. I was recruited away from that Director role I spoke of above, moving into a job with a sexier title and an enviable compensation package, and while I do not regret the move for what it did for my career, I did not weight my decision matrix properly back then in order to find joy. Money and title gets you a lot, but it doesn’t give you everything, and there are components that make up happiness that can’t be won over by dollars and business cards."}, {"fba2": "Back then, I made a switch to a company with a shorter commute (and a dog friendly office — I really wasn’t kidding about how important that is to me) and I left a very high-stress (although highly rewarding) environment. The trade off seemed obvious. But I didn’t take into account the fact I was leaving a company and product I adored and understood and was inspired by for something that I thought was cool, but didn’t believe in to the marrow of my bones. I also left behind a team, boss, and coworkers who were best-in-class in their own right. And while you can’t know whether you’ll find an even better group of people at a new gig, leaving a company that feels like family is something I have now realized I should never under value."}, {"a78a": "I am immensely fortunate to be in a position where I get to be this choosy with my career. I have declined roles in the past because I don’t believe they will make me happy enough, and as I do that, I feel thankful for everything I have done, and that I have been given, to allow me to have that freedom of choice."}, {"c8f0": "Twelve years ago, I moved from Boston to New York City and spent two miserable weeks at a fairly abusive job. Every day at noon, I’d drive my car away from the corporate parking lot to a place where I could cry until my lunch break was over. I had the good fortune of landing a new job quickly to replace that first one, but I had to wait until payday to give notice in case the owner declined to give me my back pay. Saying I lived paycheck-to-paycheck is kind: I didn’t make enough to cover rent, my car payment, and food, so losing those two weeks of pay would have been a disaster. I think about those days, and they factor in, somewhere in the background, as I navigate my career today, because sometimes, you take the job you need, and you are proud of that, and you work it as hard as you can as you try to find something else that is better for you. But whether you are where I was, at 22, or now, at 33, finding joy in your job should always be a priority — be that the joy of the people that surround you, the work you produce, the finishings of the office you sit in, the fact you have a tiny dog at the foot of your desk."}, {"df18": "We spend so much time talking about career progression, and compensation, and benefits packages, and exit strategies, sometimes we forget the little things: Like how you spent forty to eighty hours a week matters, and who you spend them with matters, and what you do with that time matters. Factor that in, next time you take a recruiter’s call, or consider an offer letter, or go to your boss for your next yearly review. Finding joy at work so often starts with money, but it doesn’t have to end there, and money doesn’t have to trump joy. Your time is worth more than that."}], "child": "2201_12201_12201_1", "parent": "", "title": "Find Your Joy", "content": "Find Your Joy Or, you know, a less boring way to think of a decision matrix Yes, this is a real photo of me at one of my jobs, and that is actually my dog. I was driving over the Golden Gate Bridge when my iPhone’s caller ID lit up with a recruiter’s number. (I’d memorized it.) Days before, I’d completed a final round interview with the team I hoped to run for my very first Director-level position. I damn near drove off the bridge. Being the law-abiding driver (who is also terrified of bridges), I squealed (alone, in my car) until I pulled off at the Golden Gate Bridge parking lot and visitor’s center. With shaking hands, I called back the recruiter, and she gave me the good news that I had gotten the job. When I called my then-boyfriend (now husband), he was walking down the street with a few friends who were industry journalists. I was shrieking so loudly he had to abruptly break away from them so that they didn’t hear my good news. When I look back on some of my best days, and proudest, happiest moments, those couple minutes rank very high on the list. Sure, the thrill was about nailing the interviews, landing the job, getting a coveted promotion and a sizable pay-bump. But I remember exactly what the sunset looked like that day because I’d found joy. I make old-fashioned decisions matrices when I am considering a new role these days, and if enough boxes aren’t checked, no matter the offer, my answer is “no”. The categories change over time and, while they always carry some standards like “compensation” and “perks” and “room for growth”, the most important areas are those that are highly personalized to me. My standards? Dog friendly. Managing a team. Working out of headquarters. Creativity. Risk. Each of these areas has a weight behind them — my last two jobs, for example, were not dog friendly. Not every category is make-or-break, much to the chagrin of the miniature dachshund sitting on my lap right now. I know what I love, and I know what I need, and I’ve worked long enough to know what cannot make me happy, no matter how much of it I have. I was recruited away from that Director role I spoke of above, moving into a job with a sexier title and an enviable compensation package, and while I do not regret the move for what it did for my career, I did not weight my decision matrix properly back then in order to find joy. Money and title gets you a lot, but it doesn’t give you everything, and there are components that make up happiness that can’t be won over by dollars and business cards. Back then, I made a switch to a company with a shorter commute (and a dog friendly office — I really wasn’t kidding about how important that is to me) and I left a very high-stress (although highly rewarding) environment. The trade off seemed obvious. But I didn’t take into account the fact I was leaving a company and product I adored and understood and was inspired by for something that I thought was cool, but didn’t believe in to the marrow of my bones. I also left behind a team, boss, and coworkers who were best-in-class in their own right. And while you can’t know whether you’ll find an even better group of people at a new gig, leaving a company that feels like family is something I have now realized I should never under value. I am immensely fortunate to be in a position where I get to be this choosy with my career. I have declined roles in the past because I don’t believe they will make me happy enough, and as I do that, I feel thankful for everything I have done, and that I have been given, to allow me to have that freedom of choice. Twelve years ago, I moved from Boston to New York City and spent two miserable weeks at a fairly abusive job. Every day at noon, I’d drive my car away from the corporate parking lot to a place where I could cry until my lunch break was over. I had the good fortune of landing a new job quickly to replace that first one, but I had to wait until payday to give notice in case the owner declined to give me my back pay. Saying I lived paycheck-to-paycheck is kind: I didn’t make enough to cover rent, my car payment, and food, so losing those two weeks of pay would have been a disaster. I think about those days, and they factor in, somewhere in the background, as I navigate my career today, because sometimes, you take the job you need, and you are proud of that, and you work it as hard as you can as you try to find something else that is better for you. But whether you are where I was, at 22, or now, at 33, finding joy in your job should always be a priority — be that the joy of the people that surround you, the work you produce, the finishings of the office you sit in, the fact you have a tiny dog at the foot of your desk. We spend so much time talking about career progression, and compensation, and benefits packages, and exit strategies, sometimes we forget the little things: Like how you spent forty to eighty hours a week matters, and who you spend them with matters, and what you do with that time matters. Factor that in, next time you take a recruiter’s call, or consider an offer letter, or go to your boss for your next yearly review. Finding joy at work so often starts with money, but it doesn’t have to end there, and money doesn’t have to trump joy. Your time is worth more than that. ", "name": "2201"}