{"sentences": [{"7a0d": "Rethinking Internet Marketing"}, {"a34b": "I am sick of being sold to. And by extension, I’m dead sick of selling."}, {"e3a7": "Every month my email inbox is clogged with a dozen people all hawking the same products — affiliates taking part in some joint venture. It’s such an overload that even if I was inclined to buy the thing, I’d skip it just on principle."}, {"9245": "I think that a certain type of Internet campaign was once very effective, but it’s jumped the shark. Used to be you could create a class or a coaching program or some other sort of program, slap a $499 (or $1499 or $2499 or . . .) price tag on it, send out a sequence of emails, and make a ton of money."}, {"7011": "If someone can’t afford $499? Well, they’re not trying hard enough. Or they don’t want it badly enough. Or they’re not manifesting with enough intensity. They aren’t using the Law of Attraction properly."}, {"f72c": "And besides, if they don’t pay, they won’t respect the thing anyway."}, {"8e1d": "Just ask any Internet marketer. They’ll tell you."}, {"8fd7": "Maybe there are people who aren’t tired of being sold to, or who aren’t sick of selling. Maybe the old model still works for some people. I don’t know. What I do know is that I want to find a different way."}, {"e489": "Here’s what I want to do: I want to teach people how to write their stories. And I want to write my own stories for people to read."}, {"08fc": "I do not want to be an internet marketer. Even though for me to find students to teach, I kind of have to be. I don’t want to have to go back to my shitty day job, after all."}, {"9b78": "So, let’s put it this way: I don’t want to be THAT KIND of internet marketer."}, {"33da": "I want to create things and trust that if people get something from what I’m offering, they’ll want to be part of and support the community I’m creating. And I want a model that doesn’t require some people to choose between doing the cool thing with me or eating for the next month or two."}, {"2a9a": "About six weeks ago, I started a Patreon page around the idea that I could say to people: hey, I’m doing this cool thing. Want to do it with me? And they would want to. And they’d be willing to support the community in the process."}, {"5432": "And it’s working."}, {"bf0a": "For ten bucks a month any writer can join The 1000 Day MFA. It’s the cool thing I’m doing and inviting other writers to do with me: combining Ray Bradbury’s advice to new writers and my own traditional MFA experience and turning into something that anyone can do, if they put the time and effort into it, without needing to spend $20,000 a semester."}, {"8249": "It’s unaccredited (of course), but seriously fun. And at the end of 1000 days, anyone who joins in will have built a writing community that will support their burgeoning careers, they’ll have become very well read, and they’ll have more than 150 short stories under their writerly belts. Plus three novel drafts."}, {"7dff": "I love that anyone can join in for ten bucks. Maybe it seems weird to you, but I get excited by the idea that anyone can be part of this thing if they want to be. And I really, really enjoy building this thing into a community that has room for everyone who might benefit from it."}, {"7926": "So. I’m doing this cool thing. Want to join me?"}, {"c619": "Don’t forget to click the heart to recommend this article."}, {"1939": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "child": "2202_1\t2202_2\t2202_3\t2202_4\t2202_5\t2202_6\t2202_7\t2202_8\t2202_9\t2202_10\t2202_112202_1\t2202_2\t2202_3\t2202_4\t2202_5\t2202_6\t2202_7\t2202_8\t2202_9\t2202_10\t2202_112202_1\t2202_2\t2202_3\t2202_4\t2202_5\t2202_6\t2202_7\t2202_8\t2202_9\t2202_10\t2202_11", "parent": "", "title": "Rethinking Internet Marketing", "content": "Rethinking Internet Marketing I am sick of being sold to. And by extension, I’m dead sick of selling. Every month my email inbox is clogged with a dozen people all hawking the same products — affiliates taking part in some joint venture. It’s such an overload that even if I was inclined to buy the thing, I’d skip it just on principle. I think that a certain type of Internet campaign was once very effective, but it’s jumped the shark. Used to be you could create a class or a coaching program or some other sort of program, slap a $499 (or $1499 or $2499 or . . .) price tag on it, send out a sequence of emails, and make a ton of money. If someone can’t afford $499? Well, they’re not trying hard enough. Or they don’t want it badly enough. Or they’re not manifesting with enough intensity. They aren’t using the Law of Attraction properly. And besides, if they don’t pay, they won’t respect the thing anyway. Just ask any Internet marketer. They’ll tell you. Maybe there are people who aren’t tired of being sold to, or who aren’t sick of selling. Maybe the old model still works for some people. I don’t know. What I do know is that I want to find a different way. Here’s what I want to do: I want to teach people how to write their stories. And I want to write my own stories for people to read. I do not want to be an internet marketer. Even though for me to find students to teach, I kind of have to be. I don’t want to have to go back to my shitty day job, after all. So, let’s put it this way: I don’t want to be THAT KIND of internet marketer. I want to create things and trust that if people get something from what I’m offering, they’ll want to be part of and support the community I’m creating. And I want a model that doesn’t require some people to choose between doing the cool thing with me or eating for the next month or two. About six weeks ago, I started a Patreon page around the idea that I could say to people: hey, I’m doing this cool thing. Want to do it with me? And they would want to. And they’d be willing to support the community in the process. And it’s working. For ten bucks a month any writer can join The 1000 Day MFA. It’s the cool thing I’m doing and inviting other writers to do with me: combining Ray Bradbury’s advice to new writers and my own traditional MFA experience and turning into something that anyone can do, if they put the time and effort into it, without needing to spend $20,000 a semester. It’s unaccredited (of course), but seriously fun. And at the end of 1000 days, anyone who joins in will have built a writing community that will support their burgeoning careers, they’ll have become very well read, and they’ll have more than 150 short stories under their writerly belts. Plus three novel drafts. I love that anyone can join in for ten bucks. Maybe it seems weird to you, but I get excited by the idea that anyone can be part of this thing if they want to be. And I really, really enjoy building this thing into a community that has room for everyone who might benefit from it. So. I’m doing this cool thing. Want to join me? Don’t forget to click the heart to recommend this article. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "name": "2202"}