{"sentences": [{"466f": "5 Lesson For Young Startups — How To Win As An Underdog?"}, {"3911": "From ISRO’s World Record Launch of 104 Satellites!"}, {"02f6": "India’s Space Program ISRO recently set the record for the most number of satellites launched on a single flight — 104 in one go!"}, {"94fc": "The success story of ISRO is one for the ages. Minimal funding, US sanctions on technology access, shortage of skilled labour (the best of Indians working in NASA, anyway) ensured a pariah-like status for much of ISRO’s existence."}, {"658e": "Then the Mars Orbital Mission (MOM) happened in 2014 at a cost lower than what it took Hollywood to make the movie Gravity, and the world lost its collective sh*t."}, {"a85d": "Before that, not many took ISRO seriously, including a lot of Indians. Therefore, life came a full circle when it recently launched multiple satellites for the US’ NASA, which fought tooth and nail in the 80s and 90s to deny India a place at the elite space high table."}, {"cd80": "Is there a lesson in it for young startups who are fighting a similar battle against global giants with deeper pockets, superior technology and better personnel? Maybe there is."}, {"f671": "1. Customer Acquisition and Retention"}, {"7f1b": "“You can’t win against the top dog with money.”"}, {"fed0": "Something which early-stage startups seriously got wrong in the times gone by. The quality and uniqueness of your product alone will help you acquire loyal customers in a sustainable manner."}, {"8fe5": "ISRO’s trademark beast of a launch vehicle — the PSLV — completed its 38th consecutive successful trip yesterday, out of 39 in total."}, {"7db1": "This near-perfect success rate of the PSLV is what is giving sleepless nights to space programs the world over, including the mighty NASA, which is now collaborating on a joint project named NISAR (NASA + ISRO)."}, {"b5a4": "Other nations and private corporations quickly followed suit, making ISRO the global magnet for low-cost space launches."}, {"774d": "2. Unique Selling Point (USP)"}, {"c3aa": "ISRO very well knew it can’t compete with NASA or ROSCOMOS (Russia) in the heavier launch vehicle category. More so with all the sanctions, it was a lost battle at least in the short-to-medium term."}, {"5922": "So, instead, it focused on the lighter, commercial satellites market and built the PSLV over a period of 3 decades of constant innovation."}, {"1528": "The results are there for everyone to see: PSLV, in present times, is unmatched in terms of cost and accuracy. In fact, NASA is now using the PSLV to launch its lighter satellites at a fraction of its own cost. Poetic justice, much?"}, {"d5f0": "3. Scaling"}, {"c85f": "“You do not scale because you can, but because you should.”"}, {"f533": "Unfortunately, the new breed of innovators lacks the patience which the ISRO showed. As soon as their startup gets funded, the next thing our desi Zuckerbergs know, without giving a second thought, is to scale up exponentially."}, {"4a98": "What you get is an untested product/model splattered across the social space. And then they pay through their nose to keep it afloat in the user’s minds by giving cashbacks, 120% off sale, free movie tickets etc."}, {"51e6": "In contrast, ISRO first built a robust product and tested it over 30 successful trips, bringing down the cost each time, to a miserly INR 15 crore ($2 million) per satellite launch now. Shah Rukh Khan charges more than that to do a (bad) movie."}, {"cc64": "Once ISRO had a strong differentiator in place that also solved a real problem — low-cost satellite launch for developing countries and private corporations — only then they entered the fray through its commercial arm — ANTRIX (what a name, btw!)"}, {"d57d": "For the statistically charged souls, ISRO launched 44 satellites in the last 2 year, but has launched 104 in one go just yesterday, and plans to launch 100 more by the year end. That’s how you scale with zero cost of customer acquisition."}, {"52e0": "4. Unit Economics"}, {"d712": "Indians are historic champions of frugal economics. Thus, it is surprising to see young startups losing the plot when it comes to focusing on profits."}, {"c19b": "From the data available, ANTRIX has always maintained an iron grip over its unit economics. Its revenues tripled from INR 693 crores in 2009–10 to INR 1924 crores in 2014–15; however, more importantly, the profits too have steadily increased — more than doubling in the process — from under INR 100 crores to 209 crores in the same period."}, {"d1b8": "On the other hand, the lesser we speak of Indian startups’ P&L sheets, the better it would be."}, {"7f2f": "5. Product Diversification"}, {"6bf0": "After putting their cash cow in place, ISRO is now going for glory. Last year, it helped put India’s own mini-GPS — the NAVIC — in space. In fact, not just India, it covers most of the Indian subcontinent."}, {"6bbd": "Coupled with the NAVIC, it then built a GPS-based augmentation system — GAGAN — to aid more accurate air traffic management over the India airspace."}, {"0071": "Furthermore, it is fast inching closer to its dream of putting a man in space by building the heavier brother of the PSLV, conveniently called the GSLV. Last, but not the least, it is also within the touching distance of getting its very own cryogenic engine."}, {"6d72": "Once the GSLV (powered by its own cryogenic engine) is in place, even sky won’t be the limit, quite literally."}, {"039b": "All things considered, I am not a cynic and I do maintain my underlying faith in the current crop of startups. However, they can seriously do some good by showing the long-term vision as successfully demonstrated by ISRO."}, {"e75b": "Building a serious business takes years if not decades. Anyone swinging for the fences to make a quick buck will be thwarted by the big players, eventually. ISRO has shown that underdogs can win — and how — if the right sensibilities are in place."}, {"1e24": "ISRO — truly Indian, truly Innovative."}, {"1bce": "Originally published at www.yourshonestly.com on February 16, 2017."}], "child": "2203_1\t2203_22203_1\t2203_2", "parent": "", "title": "5 Lesson For Young Startups — How To Win As An Underdog?", "content": "5 Lesson For Young Startups — How To Win As An Underdog? From ISRO’s World Record Launch of 104 Satellites! India’s Space Program ISRO recently set the record for the most number of satellites launched on a single flight — 104 in one go! The success story of ISRO is one for the ages. Minimal funding, US sanctions on technology access, shortage of skilled labour (the best of Indians working in NASA, anyway) ensured a pariah-like status for much of ISRO’s existence. Then the Mars Orbital Mission (MOM) happened in 2014 at a cost lower than what it took Hollywood to make the movie Gravity, and the world lost its collective sh*t. Before that, not many took ISRO seriously, including a lot of Indians. Therefore, life came a full circle when it recently launched multiple satellites for the US’ NASA, which fought tooth and nail in the 80s and 90s to deny India a place at the elite space high table. Is there a lesson in it for young startups who are fighting a similar battle against global giants with deeper pockets, superior technology and better personnel? Maybe there is. 1. Customer Acquisition and Retention “You can’t win against the top dog with money.” Something which early-stage startups seriously got wrong in the times gone by. The quality and uniqueness of your product alone will help you acquire loyal customers in a sustainable manner. ISRO’s trademark beast of a launch vehicle — the PSLV — completed its 38th consecutive successful trip yesterday, out of 39 in total. This near-perfect success rate of the PSLV is what is giving sleepless nights to space programs the world over, including the mighty NASA, which is now collaborating on a joint project named NISAR (NASA + ISRO). Other nations and private corporations quickly followed suit, making ISRO the global magnet for low-cost space launches. 2. Unique Selling Point (USP) ISRO very well knew it can’t compete with NASA or ROSCOMOS (Russia) in the heavier launch vehicle category. More so with all the sanctions, it was a lost battle at least in the short-to-medium term. So, instead, it focused on the lighter, commercial satellites market and built the PSLV over a period of 3 decades of constant innovation. The results are there for everyone to see: PSLV, in present times, is unmatched in terms of cost and accuracy. In fact, NASA is now using the PSLV to launch its lighter satellites at a fraction of its own cost. Poetic justice, much? 3. Scaling “You do not scale because you can, but because you should.” Unfortunately, the new breed of innovators lacks the patience which the ISRO showed. As soon as their startup gets funded, the next thing our desi Zuckerbergs know, without giving a second thought, is to scale up exponentially. What you get is an untested product/model splattered across the social space. And then they pay through their nose to keep it afloat in the user’s minds by giving cashbacks, 120% off sale, free movie tickets etc. In contrast, ISRO first built a robust product and tested it over 30 successful trips, bringing down the cost each time, to a miserly INR 15 crore ($2 million) per satellite launch now. Shah Rukh Khan charges more than that to do a (bad) movie. Once ISRO had a strong differentiator in place that also solved a real problem — low-cost satellite launch for developing countries and private corporations — only then they entered the fray through its commercial arm — ANTRIX (what a name, btw!) For the statistically charged souls, ISRO launched 44 satellites in the last 2 year, but has launched 104 in one go just yesterday, and plans to launch 100 more by the year end. That’s how you scale with zero cost of customer acquisition. 4. Unit Economics Indians are historic champions of frugal economics. Thus, it is surprising to see young startups losing the plot when it comes to focusing on profits. From the data available, ANTRIX has always maintained an iron grip over its unit economics. Its revenues tripled from INR 693 crores in 2009–10 to INR 1924 crores in 2014–15; however, more importantly, the profits too have steadily increased — more than doubling in the process — from under INR 100 crores to 209 crores in the same period. On the other hand, the lesser we speak of Indian startups’ P&L sheets, the better it would be. 5. Product Diversification After putting their cash cow in place, ISRO is now going for glory. Last year, it helped put India’s own mini-GPS — the NAVIC — in space. In fact, not just India, it covers most of the Indian subcontinent. Coupled with the NAVIC, it then built a GPS-based augmentation system — GAGAN — to aid more accurate air traffic management over the India airspace. Furthermore, it is fast inching closer to its dream of putting a man in space by building the heavier brother of the PSLV, conveniently called the GSLV. Last, but not the least, it is also within the touching distance of getting its very own cryogenic engine. Once the GSLV (powered by its own cryogenic engine) is in place, even sky won’t be the limit, quite literally. All things considered, I am not a cynic and I do maintain my underlying faith in the current crop of startups. However, they can seriously do some good by showing the long-term vision as successfully demonstrated by ISRO. Building a serious business takes years if not decades. Anyone swinging for the fences to make a quick buck will be thwarted by the big players, eventually. ISRO has shown that underdogs can win — and how — if the right sensibilities are in place. ISRO — truly Indian, truly Innovative. Originally published at www.yourshonestly.com on February 16, 2017. ", "name": "2203"}