{"sentences": [{"c290": "New Year’s Resolution: The Year of Failure"}, {"c17d": "It was my last day at the Creative Nonfiction Writers’ Conference. It had been a long three days of workshops and talks, some engaging, some not. I’d forced myself to mingle each night at happy hour in the hotel bar, full of self-consciousness, swallowing my pain when someone walked away to find a more important, interesting conversationalist. Like many, I was ready to leave, but we weren’t quite finished."}, {"68fe": "It was the last panel. Five people sat at a table draped in white cloth stretching across a slightly raised staged. The florescent lights were sharp and dizzying. I squinted, leaning in even though I was in the front row."}, {"2475": "The panelists were from a variety of disciplines, sharing their experiences adapting books to film, radio, or live theatre. I was captivated, the panel not only intelligent, but contributing a new flavor to our three days of writer-oriented talks. I realized I preferred learning about writing from other disciplines; a cross-pollination I somehow found more transformational."}, {"7a72": "A middle-aged filmmaker sprang into a story about a friend of his who’d kept track of how many times he failed in one year. The man laughed. “He even set a goal to fail 100 times. It was his way of gauging if he was working hard enough.”"}, {"606d": "Set a goal to fail 100 times in a year."}, {"31d0": "I stared, caught up in his words, loosing track of what came next. I’d been encountering failure at lot recently. In fact, just a few days before, I’d received a rejection email from another, more prestigious writers’ conference. And it didn’t stop there."}, {"9d1e": "“This year we received a large number of very strong applicants…” “While we enjoyed reading your piece, I am sorry to say…” “I wish I were writing with better news today…”"}, {"aca4": "Rejection. The notices were kind, delicately crafted statements about not liking my writing enough, or not measuring up to greater talent. I got it. Like most writers, I’d be the first to tell you I’m not the best. I was apologetically pushing submission buttons. “Sorry I’m taking time away from your busy life, your family, and far more captivating submissions.”"}, {"5c5d": "I’d been trying to find ways to ease the pain, to make rejection a positive experience, but nothing had worked. Instead, I tasted stale bitterness. I’ll show you! I thought meanly. One day, when I’m big and famous, you’ll regret not selecting me. I could feel the destructiveness of this pattern, and I knew something needed to change. Otherwise, I feared I’d grow rigid and hard; so much so that one day a monkey would be breaking pecans open on my thick exterior, the extent of my usefulness."}, {"0df0": "Set a goal to fail 100 times in a year."}, {"79c8": "It was May. What if I set a goal to receive 100 rejections by the end of the calendar year? What if I embraced this new relationship with failure; saw it as a marker of hard work and progress? If nothing else, it would represent how many people read my work, heard my pitch, held, if just for a moment, a piece of me. That had to count for something, right?"}, {"8e94": "Back home, eager to start, I picked a pretty piece of paper from a Beginner’s Origami kit mom had sent as a birthday present. “100 rejections,” I wrote. I drew two tally marks for the recent rejection letters I’d received. On the back I wrote the organization names. It’d be nice to remember who rejected me, I decided, in case I wanted to try again the following year."}, {"fdd3": "The challenge had begun. I was launching a Kickstarter campaign in less than a month. What a perfect opportunity for rejection! I emailed forty publications with my press release. Two responded. I decided my tallies would represent any time I made a pitch and A. Didn’t hear back, or B. Received a “no.” Thirty-eight vertical lines streaked down my sheet."}, {"0e2f": "I anticipated the disintegration of those meek, sad feelings that used to arise. Instead, they would be replaced by feelings of victory, of pride and accomplishment. But the familiar pain lingered, a palpable sting in my chest. I had a great story to share! Why weren’t these publications interested in covering something heart-felt, life changing? I’ll show them, the habitually thought snapped. But I couldn’t dwell for long. I had a mission to stick to, and there were plenty more rejections to be had."}, {"b919": "It’s almost the end of the year now, and I have over 90 rejections. They’re across the board: writers’ conferences, publications, speaking gigs, freelance work, news stations. I read down the list, remembering my carefully crafted emails or submissions, the love I’d begun injecting into them. Thank you for taking the time to hold a piece of me, I now say as I push the submission button. I appreciate you."}, {"5c0d": "Volume has a way of desensitizing us, but we have to be conscious of the transition, allowing the sting to lessen, but not the importance of what we’re doing, not the awesomeness we feel when following our dreams. And here’s what I’ve learned about dreams: we can know what we want to do, but we can’t exactly know how we’re going to do it. I can send articles to publications, but I can’t control if they’re going to publish them. I can pitch my one-woman performance to conferences, but I can’t control if it’s a good fit for them. The ways in which our dreams manifest aren’t up to us."}, {"44b6": "The ways in which our dreams manifest aren’t up to us."}, {"d8e4": "All we can do is keep trying, seeing rejection and failure as guidance. It doesn’t mean you’re not good, it doesn’t mean you should quit. All it means is not this, not right now. Take that information — and it is just information — and make an informed decision as to how you’ll move forward. Maybe it was a gift you didn’t go that direction! We’ll never know. All we can do is listen to the guidance failure and rejection offer us, let go of judgment, and keep moving forward."}, {"3127": "For your New Year’s resolution, I’d encourage you to incorporate failure. Set a goal: how many times will you fail or get rejected this year? Are you willing to work on your dreams so hard that failure becomes a representation of your passion, not your worth? Because I promise you, with this New Year’s resolution, you’ll be a completely different person by this time next year. You’ll be a person who’s living your dreams."}, {"1fee": "Happy failing,"}, {"06d0": "Laura"}], "child": "2206_1\t2206_2", "parent": "", "title": "New Year’s Resolution: The Year of Failure", "content": "New Year’s Resolution: The Year of Failure It was my last day at the Creative Nonfiction Writers’ Conference. It had been a long three days of workshops and talks, some engaging, some not. I’d forced myself to mingle each night at happy hour in the hotel bar, full of self-consciousness, swallowing my pain when someone walked away to find a more important, interesting conversationalist. Like many, I was ready to leave, but we weren’t quite finished. It was the last panel. Five people sat at a table draped in white cloth stretching across a slightly raised staged. The florescent lights were sharp and dizzying. I squinted, leaning in even though I was in the front row. The panelists were from a variety of disciplines, sharing their experiences adapting books to film, radio, or live theatre. I was captivated, the panel not only intelligent, but contributing a new flavor to our three days of writer-oriented talks. I realized I preferred learning about writing from other disciplines; a cross-pollination I somehow found more transformational. A middle-aged filmmaker sprang into a story about a friend of his who’d kept track of how many times he failed in one year. The man laughed. “He even set a goal to fail 100 times. It was his way of gauging if he was working hard enough.” Set a goal to fail 100 times in a year. I stared, caught up in his words, loosing track of what came next. I’d been encountering failure at lot recently. In fact, just a few days before, I’d received a rejection email from another, more prestigious writers’ conference. And it didn’t stop there. “This year we received a large number of very strong applicants…” “While we enjoyed reading your piece, I am sorry to say…” “I wish I were writing with better news today…” Rejection. The notices were kind, delicately crafted statements about not liking my writing enough, or not measuring up to greater talent. I got it. Like most writers, I’d be the first to tell you I’m not the best. I was apologetically pushing submission buttons. “Sorry I’m taking time away from your busy life, your family, and far more captivating submissions.” I’d been trying to find ways to ease the pain, to make rejection a positive experience, but nothing had worked. Instead, I tasted stale bitterness. I’ll show you! I thought meanly. One day, when I’m big and famous, you’ll regret not selecting me. I could feel the destructiveness of this pattern, and I knew something needed to change. Otherwise, I feared I’d grow rigid and hard; so much so that one day a monkey would be breaking pecans open on my thick exterior, the extent of my usefulness. Set a goal to fail 100 times in a year. It was May. What if I set a goal to receive 100 rejections by the end of the calendar year? What if I embraced this new relationship with failure; saw it as a marker of hard work and progress? If nothing else, it would represent how many people read my work, heard my pitch, held, if just for a moment, a piece of me. That had to count for something, right? Back home, eager to start, I picked a pretty piece of paper from a Beginner’s Origami kit mom had sent as a birthday present. “100 rejections,” I wrote. I drew two tally marks for the recent rejection letters I’d received. On the back I wrote the organization names. It’d be nice to remember who rejected me, I decided, in case I wanted to try again the following year. The challenge had begun. I was launching a Kickstarter campaign in less than a month. What a perfect opportunity for rejection! I emailed forty publications with my press release. Two responded. I decided my tallies would represent any time I made a pitch and A. Didn’t hear back, or B. Received a “no.” Thirty-eight vertical lines streaked down my sheet. I anticipated the disintegration of those meek, sad feelings that used to arise. Instead, they would be replaced by feelings of victory, of pride and accomplishment. But the familiar pain lingered, a palpable sting in my chest. I had a great story to share! Why weren’t these publications interested in covering something heart-felt, life changing? I’ll show them, the habitually thought snapped. But I couldn’t dwell for long. I had a mission to stick to, and there were plenty more rejections to be had. It’s almost the end of the year now, and I have over 90 rejections. They’re across the board: writers’ conferences, publications, speaking gigs, freelance work, news stations. I read down the list, remembering my carefully crafted emails or submissions, the love I’d begun injecting into them. Thank you for taking the time to hold a piece of me, I now say as I push the submission button. I appreciate you. Volume has a way of desensitizing us, but we have to be conscious of the transition, allowing the sting to lessen, but not the importance of what we’re doing, not the awesomeness we feel when following our dreams. And here’s what I’ve learned about dreams: we can know what we want to do, but we can’t exactly know how we’re going to do it. I can send articles to publications, but I can’t control if they’re going to publish them. I can pitch my one-woman performance to conferences, but I can’t control if it’s a good fit for them. The ways in which our dreams manifest aren’t up to us. The ways in which our dreams manifest aren’t up to us. All we can do is keep trying, seeing rejection and failure as guidance. It doesn’t mean you’re not good, it doesn’t mean you should quit. All it means is not this, not right now. Take that information — and it is just information — and make an informed decision as to how you’ll move forward. Maybe it was a gift you didn’t go that direction! We’ll never know. All we can do is listen to the guidance failure and rejection offer us, let go of judgment, and keep moving forward. For your New Year’s resolution, I’d encourage you to incorporate failure. Set a goal: how many times will you fail or get rejected this year? Are you willing to work on your dreams so hard that failure becomes a representation of your passion, not your worth? Because I promise you, with this New Year’s resolution, you’ll be a completely different person by this time next year. You’ll be a person who’s living your dreams. Happy failing, Laura ", "name": "2206"}