{"sentences": [{"700f": "How to Exercise Your Most Important Muscles"}, {"6222": "Curiosity, Courage, Confidence, and Constancy"}, {"27b5": "“Somehow I can’t believe that there are any heights that can’t be scaled by a man who knows the secrets of making dreams come true. This special secret, it seems to me, can be summarized in four Cs. They are curiosity, confidence, courage, and constancy, and the greatest of all is confidence. When you believe in a thing, believe in it all the way, implicitly and unquestionable.”"}, {"caf5": "— Walt Disney"}, {"b0fc": "I love this. An absolute master of making dreams come true giving direct, specific advice about the secret for making dreams come true."}, {"0b15": "Let’s break it down."}, {"2121": "(First, I’m going to give ol’ Walt the benefit of the doubt and believe that by “man,” he meant all people.)"}, {"a81c": "Curiosity"}, {"c52f": "There’s another Disney quote that comes at the end of my very favorite Disney movie, Meet the Robinsons. (I know, I’m probably the only person on Earth whose favorite Disney movie is Meet the Robinsons, but that’s okay.) I’ve had it tacked to my office wall for years."}, {"15f5": "We keep moving forward, opening new doors, and doing new things, because we’re curious and curiosity keeps leading us down new paths. — Walt Disney"}, {"2c6c": "Curiosity is my favorite of Disney’s four Cs, even though it’s not the one that Disney considered the most important. It’s the most fun. The most creative. The most fresh, if that makes sense."}, {"1d29": "Everyone knows that it’s important to be courageous, confident, and consistent. But curious? I think it’s maybe because I’m a writer that it resonates with me so much. Writing often feels like a trip down a rabbit hole, telling a story because I’m curious about how it turns out."}, {"1fc6": "Flex Your Curiosity Muscle: The Wonder Exercise"}, {"b15e": "Make a practice of wondering. When you see a picture, wonder what’s outside the frame. Wonder who took it. Wonder what they were thinking. When you meet a person, wonder about what they’ll do after they leave you. Or where they got that scar. Or what their home is like. (You don’t have to be nosy — keep your wondering to yourself. You’re just flexing your curiosity muscle.)"}, {"02fc": "Courage"}, {"66c3": "I wrote last week about how I feel about the idea of fearlessness."}, {"5469": "Fearless is a complete crock of bullshitHow to look brave when you‘re really notmedium.com"}, {"93f4": "If you’re not afraid, I think there’s a good chance that you’re being too careful. Because, if we’re truthful, often the thing we’re the most afraid of is trading what we have now — what we know — for some unknown thing that we don’t know."}, {"d5db": "No matter how unhappy we are with what we have now."}, {"214e": "Here’s a story that makes me sad every single day."}, {"ab90": "My husband is a craps dealer in a casino in Reno. He’s been a dealer for more than 25 years. He’s very good at it. But he hates it. Really hates everything about it."}, {"8346": "Because he’s done it so long, he can’t wrap his head around doing anything else."}, {"329d": "For the past year I’ve earned enough money to support us, so he could quit his job and go to school or start something new or take a year and spend time on some passion project. God knows he supported my writing long enough. But he won’t."}, {"ba4d": "I love my husband. He’s my best friend. He has the best work ethic of any human I’ve ever met. He’s a fantastic dad. And he’s strong and brave in lots and lots of ways. But he’s got a pocket of fear that keeps him from being able to bust out of work he hates. He can’t see what’s at the bottom of his leap, so (so far) he hasn’t leaped."}, {"8036": "The world will never know my husband’s art, whatever his art might be, if he doesn’t find the courage to go out and find it. That’s the honest, hard truth."}, {"0e71": "Flex Your Courage Muscle: The Eleanor Exercise"}, {"267a": "This exercise is based on another quote, this one from Eleanor Roosevelt: You must do the thing you think you cannot do."}, {"9c8c": "Every single day, practice being brave. It can be small. Say hello to stranger. Or pull the trigger on some silly little thing that you’ve been hesitating over. Sign up for a class. Whatever. It’s practice for when you find yourself at a real fork in the road and you need the courage to make the scarier choice."}, {"4575": "If you find yourself saying (or thinking), “I can’t do that,” think about Eleanor and Walt and do it anyway. Confidence was the one C that Walt thought was the most important. And that makes sense. None of the rest matters is you don’t have the courage to leap."}, {"fc74": "Confidence"}, {"0233": "Confidence is the core of the old advice to fake it until you make it. Do something, anything, with confidence, and the world will assume you know what you’re doing."}, {"24d8": "Have the confidence to do the thing that scares you and you’ll bump yourself over the hump between “I can’t do that” and “I did that.” One you’ve done something once, it makes it easier to do it again."}, {"63e0": "Example: writing my first novel was the scariest, most intense thing I’ve ever done. It was Nanowrimo 2004. I was about fourteen months pregnant. (Okay, I was 8 months pregnant. My daughter, Ruby, was born on December 8.) I had hormones going and I was uncomfortable on every single level. And I got bit right in the ass by the idea that I was going to be a novelist when this baby was finally (FINALLY) born."}, {"fe2d": "It wasn’t the writing that took courage. I could have written WATERMELON 50,000 times and won Nanowrimo 2004. How scary is it to write words? But it was scary. I’d tried to write a novel, over and over, for at least a decade. Longer, even. And I was truly afraid I couldn’t do it. And for sure I was afraid that I couldn’t do it well."}, {"a0ce": "Flex Your Courage Muscle: The Be a Helper Exercise"}, {"a892": "This quote, from Mr. Rogers, is what I think about when I think about courage:"}, {"0814": "“When I was a boy and I would see scary things in the news, my mother would say to me, “Look for the helpers. You will always find people who are helping.”"}, {"dad0": "So . . . when you’re scared, look for the helpers. Mr. Rogers was talking about firemen and policemen in times of tragedy. But I think it fits in every instance."}, {"fe57": "Whatever leap that you’re afraid to take, look for people who have A) already made that leap and B) are sharing their experiences. They are your helpers, in these situations."}, {"332e": "Bonus points for reaching out and being a helper for something that you’ve already worked through, that someone else might be afraid to do."}, {"5d2e": "Constancy"}, {"54e6": "I’ve written quite a lot about my love for daily teeny, tiny goals."}, {"2701": "I even have a whole framework for writers that centers around consistently doing the things that will make you a better writer."}, {"873f": "How to be a good writer with a good lifeThe WRITER Frameworkmedium.com"}, {"08ae": "Bottom line: Whatever you decide to do, keep doing it. Write every day. Draw every day. Make music every day. Build your business every day."}, {"a40c": "Constancy isn’t sexy. It can be boring. It’s the hours of practice that comes before mastery. It’s teaching yourself how to make a Facebook ad when you’d rather be doing anything else. It’s the 10,000 hours that it takes to become an expert."}, {"229b": "Walt Disney knew that showing up every day and not giving up mattered. And so should you and I. Constancy is the heart of the end of Disney’s quote at the top of this post. It’s the believing “all the way, implicitly and unquestionably.”"}, {"9cd3": "Really, if you think about it, it really is kind of sexy."}, {"98e6": "Flex Your Constancy Muscle: The 10 Minute Exercise"}, {"2faf": "Here’s how you can practice showing up for a thing every single day."}, {"4912": "First, pick the thing. Make it something you’ve always wanted to learn. Or something you’re passionate about."}, {"fd36": "Second, do that thing for ten minutes a day. Every single day."}, {"5689": "There is no third."}, {"f0db": "If you want to be someone who writes novels, write for ten minutes a day."}, {"ae29": "If you want to be an artist, draw for ten minutes a day."}, {"63cb": "If you want to learn how to play the guitar, practice for ten minutes a day."}, {"11f2": "Here’s one more quote for you. It’s from Ray Bradbury and it absolutely guides my life:"}, {"ff91": "“Just write every day of your life. Read intensely. Then see what happens.”"}, {"ccb9": "If you enjoyed this post, give it some love with a heart. ❤❤❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "child": "2207_1\t2207_2\t2207_3\t2207_4\t2207_5\t2207_6\t2207_7", "parent": "", "title": "How to Exercise Your Most Important Muscles", "content": "How to Exercise Your Most Important Muscles Curiosity, Courage, Confidence, and Constancy “Somehow I can’t believe that there are any heights that can’t be scaled by a man who knows the secrets of making dreams come true. This special secret, it seems to me, can be summarized in four Cs. They are curiosity, confidence, courage, and constancy, and the greatest of all is confidence. When you believe in a thing, believe in it all the way, implicitly and unquestionable.” — Walt Disney I love this. An absolute master of making dreams come true giving direct, specific advice about the secret for making dreams come true. Let’s break it down. (First, I’m going to give ol’ Walt the benefit of the doubt and believe that by “man,” he meant all people.) Curiosity There’s another Disney quote that comes at the end of my very favorite Disney movie, Meet the Robinsons. (I know, I’m probably the only person on Earth whose favorite Disney movie is Meet the Robinsons, but that’s okay.) I’ve had it tacked to my office wall for years. We keep moving forward, opening new doors, and doing new things, because we’re curious and curiosity keeps leading us down new paths. — Walt Disney Curiosity is my favorite of Disney’s four Cs, even though it’s not the one that Disney considered the most important. It’s the most fun. The most creative. The most fresh, if that makes sense. Everyone knows that it’s important to be courageous, confident, and consistent. But curious? I think it’s maybe because I’m a writer that it resonates with me so much. Writing often feels like a trip down a rabbit hole, telling a story because I’m curious about how it turns out. Flex Your Curiosity Muscle: The Wonder Exercise Make a practice of wondering. When you see a picture, wonder what’s outside the frame. Wonder who took it. Wonder what they were thinking. When you meet a person, wonder about what they’ll do after they leave you. Or where they got that scar. Or what their home is like. (You don’t have to be nosy — keep your wondering to yourself. You’re just flexing your curiosity muscle.) Courage I wrote last week about how I feel about the idea of fearlessness. Fearless is a complete crock of bullshitHow to look brave when you‘re really notmedium.com If you’re not afraid, I think there’s a good chance that you’re being too careful. Because, if we’re truthful, often the thing we’re the most afraid of is trading what we have now — what we know — for some unknown thing that we don’t know. No matter how unhappy we are with what we have now. Here’s a story that makes me sad every single day. My husband is a craps dealer in a casino in Reno. He’s been a dealer for more than 25 years. He’s very good at it. But he hates it. Really hates everything about it. Because he’s done it so long, he can’t wrap his head around doing anything else. For the past year I’ve earned enough money to support us, so he could quit his job and go to school or start something new or take a year and spend time on some passion project. God knows he supported my writing long enough. But he won’t. I love my husband. He’s my best friend. He has the best work ethic of any human I’ve ever met. He’s a fantastic dad. And he’s strong and brave in lots and lots of ways. But he’s got a pocket of fear that keeps him from being able to bust out of work he hates. He can’t see what’s at the bottom of his leap, so (so far) he hasn’t leaped. The world will never know my husband’s art, whatever his art might be, if he doesn’t find the courage to go out and find it. That’s the honest, hard truth. Flex Your Courage Muscle: The Eleanor Exercise This exercise is based on another quote, this one from Eleanor Roosevelt: You must do the thing you think you cannot do. Every single day, practice being brave. It can be small. Say hello to stranger. Or pull the trigger on some silly little thing that you’ve been hesitating over. Sign up for a class. Whatever. It’s practice for when you find yourself at a real fork in the road and you need the courage to make the scarier choice. If you find yourself saying (or thinking), “I can’t do that,” think about Eleanor and Walt and do it anyway. Confidence was the one C that Walt thought was the most important. And that makes sense. None of the rest matters is you don’t have the courage to leap. Confidence Confidence is the core of the old advice to fake it until you make it. Do something, anything, with confidence, and the world will assume you know what you’re doing. Have the confidence to do the thing that scares you and you’ll bump yourself over the hump between “I can’t do that” and “I did that.” One you’ve done something once, it makes it easier to do it again. Example: writing my first novel was the scariest, most intense thing I’ve ever done. It was Nanowrimo 2004. I was about fourteen months pregnant. (Okay, I was 8 months pregnant. My daughter, Ruby, was born on December 8.) I had hormones going and I was uncomfortable on every single level. And I got bit right in the ass by the idea that I was going to be a novelist when this baby was finally (FINALLY) born. It wasn’t the writing that took courage. I could have written WATERMELON 50,000 times and won Nanowrimo 2004. How scary is it to write words? But it was scary. I’d tried to write a novel, over and over, for at least a decade. Longer, even. And I was truly afraid I couldn’t do it. And for sure I was afraid that I couldn’t do it well. Flex Your Courage Muscle: The Be a Helper Exercise This quote, from Mr. Rogers, is what I think about when I think about courage: “When I was a boy and I would see scary things in the news, my mother would say to me, “Look for the helpers. You will always find people who are helping.” So . . . when you’re scared, look for the helpers. Mr. Rogers was talking about firemen and policemen in times of tragedy. But I think it fits in every instance. Whatever leap that you’re afraid to take, look for people who have A) already made that leap and B) are sharing their experiences. They are your helpers, in these situations. Bonus points for reaching out and being a helper for something that you’ve already worked through, that someone else might be afraid to do. Constancy I’ve written quite a lot about my love for daily teeny, tiny goals. I even have a whole framework for writers that centers around consistently doing the things that will make you a better writer. How to be a good writer with a good lifeThe WRITER Frameworkmedium.com Bottom line: Whatever you decide to do, keep doing it. Write every day. Draw every day. Make music every day. Build your business every day. Constancy isn’t sexy. It can be boring. It’s the hours of practice that comes before mastery. It’s teaching yourself how to make a Facebook ad when you’d rather be doing anything else. It’s the 10,000 hours that it takes to become an expert. Walt Disney knew that showing up every day and not giving up mattered. And so should you and I. Constancy is the heart of the end of Disney’s quote at the top of this post. It’s the believing “all the way, implicitly and unquestionably.” Really, if you think about it, it really is kind of sexy. Flex Your Constancy Muscle: The 10 Minute Exercise Here’s how you can practice showing up for a thing every single day. First, pick the thing. Make it something you’ve always wanted to learn. Or something you’re passionate about. Second, do that thing for ten minutes a day. Every single day. There is no third. If you want to be someone who writes novels, write for ten minutes a day. If you want to be an artist, draw for ten minutes a day. If you want to learn how to play the guitar, practice for ten minutes a day. Here’s one more quote for you. It’s from Ray Bradbury and it absolutely guides my life: “Just write every day of your life. Read intensely. Then see what happens.” If you enjoyed this post, give it some love with a heart. ❤❤❤ >>Sign up for the Ninja Writers Newsletter here. (I’m on a mission!)>>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "name": "2207"}