{"sentences": [{"5dac": "Brave Enough"}, {"a4e1": "I want to be brave enough to be in bed by 8:00 p.m. each night so I can ready my book and get a good sleep."}, {"072e": "I want to be brave enough to dress fancy for no reason other than I feel like it."}, {"4187": "I want to be brave enough to wear sweatpants, too, because fuck it, today I didn’t brush my teeth."}, {"215c": "I want to be brave enough to tell people I love them, even when I haven’t known them that long."}, {"9fef": "I want to be brave enough to do pushups anywhere, everywhere, anytime I please, because kids don’t distinguish “playtime” from “life,” so why should I?"}, {"b644": "I want to be brave enough to look at people I judge and take a moment to step into their shoes, feel their pain."}, {"149f": "I want to be brave enough to not wear a bra and walk around with absolute confidence that nothing will fall out. Even if it does."}, {"b93f": "I want to be brave enough to order a decaf coffe in the morning because my brain will thank me in the afternoon."}, {"3812": "I want to be brave enough to tell people who don’t want kids that I do."}, {"188f": "I want to be brave enough to take a Wednesday off."}, {"9876": "I want to be brave enough to take out my “My Spirit Animal is a Unicorn” notebook in a professional setting without quickly covering it up."}, {"af49": "I want to be brave enough to stand on stage and be silent for a long time, knowing we’ll all benefit."}, {"8206": "I want to be brave enough to allow myself, my preferences, my moods to change every sing day, not inhibited by who I “think” I am."}, {"89db": "… Because I’m human. I’m human AF."}, {"c126": "Today is a simple expression of the small things my heart yearns for from time to time. Your turn. What do you wish you were brave enough to do?"}], "child": "2208_1\t2208_2\t2208_3\t2208_4\t2208_5\t2208_6\t2208_72208_1\t2208_2\t2208_3\t2208_4\t2208_5\t2208_6\t2208_7", "parent": "", "title": "Brave Enough", "content": "Brave Enough I want to be brave enough to be in bed by 8:00 p.m. each night so I can ready my book and get a good sleep. I want to be brave enough to dress fancy for no reason other than I feel like it. I want to be brave enough to wear sweatpants, too, because fuck it, today I didn’t brush my teeth. I want to be brave enough to tell people I love them, even when I haven’t known them that long. I want to be brave enough to do pushups anywhere, everywhere, anytime I please, because kids don’t distinguish “playtime” from “life,” so why should I? I want to be brave enough to look at people I judge and take a moment to step into their shoes, feel their pain. I want to be brave enough to not wear a bra and walk around with absolute confidence that nothing will fall out. Even if it does. I want to be brave enough to order a decaf coffe in the morning because my brain will thank me in the afternoon. I want to be brave enough to tell people who don’t want kids that I do. I want to be brave enough to take a Wednesday off. I want to be brave enough to take out my “My Spirit Animal is a Unicorn” notebook in a professional setting without quickly covering it up. I want to be brave enough to stand on stage and be silent for a long time, knowing we’ll all benefit. I want to be brave enough to allow myself, my preferences, my moods to change every sing day, not inhibited by who I “think” I am. … Because I’m human. I’m human AF. Today is a simple expression of the small things my heart yearns for from time to time. Your turn. What do you wish you were brave enough to do? ", "name": "2208"}