{"sentences": [{"04b7": "Getting Used to Sucking"}, {"2997": "Part of being a creative is getting used to sucking. I was going to write a nice, fancy intro for this, but there you have it: today I suck at writing fancy intros."}, {"c008": "In fact, I suck at a lot of the creative things I attempt. I voluntarily stand up in front of people and act. Sometimes I suck. Sometimes I feel badly that they paid to see me standing up in front of them, sucking. Then I start singing and I feel even worse, because some days I suck at singing, too."}, {"ee25": "Sweet Buddha, where did my decades of voice lessons go?!"}, {"b65f": "I write. Some days my sentences are thoughtful, poetic, crisp, and other days I stumble around on the keyboard, typing “somedays” as one word, rereading my sentences with one of those slow, sad headshakes I’d give to a ten-year-old putting their shoes on the wrong feet."}, {"ec02": "You poor, poor soul."}, {"101b": "It’s hard to have perspective, you know? It’s hard to actually know if we’re good at the creative things we attempt. And we only ever “attempt.” Every day I attempt things. Some days they’re alright, some days they’re horrible. Whatever. Tomorrow I’ll attempt again."}, {"770b": "This is what I’ve come to understand about the creative process: it’s one part showing up and attempting, and one part getting used to my own judgments, getting used to the fact that I will suck."}, {"976f": "Please, correct me if I’m wrong — I’d love to hear from those of you who feel amazing at what you do, always, and then I’ll cry myself to sleep in a midday Prosecco nap. However, for the majority of us, our main goal shouldn’t be perfection. It should only be to keep trying and to keep recognizing the ways in which we judge ourselves. We don’t actually know if our stuff sucks — we only think it does. And if you’re working from home with only your own thoughts most of the day, those thoughts can be destructive and seduce you into doing the last thing you should ever do: quit."}, {"03ea": "Don’t quit. Never quit. Instead, just get used to sucking. I’m no New York Time’s Bestselling author, but even if I were, I have a hunch these feelings — the ups and downs of creating — will never go away. A nice award or lots of money won’t change my internal dialogue. Only I can do that. Only I can hold myself back from continuing to pursue my dreams."}, {"33bc": "Thus, to my sucky days, I say: Hello again, misspelled elementary-level words and skipping crafty intros. It’s okay. Let’s keep trying. How does that sound, old friend? Let’s keep moving forward."}], "child": "2210_1\t2210_2\t2210_3\t2210_4\t2210_5\t2210_6\t2210_7\t2210_8\t2210_9\t2210_10\t2210_11\t2210_12\t2210_13\t2210_14\t2210_15\t2210_16\t2210_17\t2210_18\t2210_19\t2210_20\t2210_21\t2210_22\t2210_23\t2210_24\t2210_25", "parent": "", "title": "Getting Used to Sucking", "content": "Getting Used to Sucking Part of being a creative is getting used to sucking. I was going to write a nice, fancy intro for this, but there you have it: today I suck at writing fancy intros. In fact, I suck at a lot of the creative things I attempt. I voluntarily stand up in front of people and act. Sometimes I suck. Sometimes I feel badly that they paid to see me standing up in front of them, sucking. Then I start singing and I feel even worse, because some days I suck at singing, too. Sweet Buddha, where did my decades of voice lessons go?! I write. Some days my sentences are thoughtful, poetic, crisp, and other days I stumble around on the keyboard, typing “somedays” as one word, rereading my sentences with one of those slow, sad headshakes I’d give to a ten-year-old putting their shoes on the wrong feet. You poor, poor soul. It’s hard to have perspective, you know? It’s hard to actually know if we’re good at the creative things we attempt. And we only ever “attempt.” Every day I attempt things. Some days they’re alright, some days they’re horrible. Whatever. Tomorrow I’ll attempt again. This is what I’ve come to understand about the creative process: it’s one part showing up and attempting, and one part getting used to my own judgments, getting used to the fact that I will suck. Please, correct me if I’m wrong — I’d love to hear from those of you who feel amazing at what you do, always, and then I’ll cry myself to sleep in a midday Prosecco nap. However, for the majority of us, our main goal shouldn’t be perfection. It should only be to keep trying and to keep recognizing the ways in which we judge ourselves. We don’t actually know if our stuff sucks — we only think it does. And if you’re working from home with only your own thoughts most of the day, those thoughts can be destructive and seduce you into doing the last thing you should ever do: quit. Don’t quit. Never quit. Instead, just get used to sucking. I’m no New York Time’s Bestselling author, but even if I were, I have a hunch these feelings — the ups and downs of creating — will never go away. A nice award or lots of money won’t change my internal dialogue. Only I can do that. Only I can hold myself back from continuing to pursue my dreams. Thus, to my sucky days, I say: Hello again, misspelled elementary-level words and skipping crafty intros. It’s okay. Let’s keep trying. How does that sound, old friend? Let’s keep moving forward. ", "name": "2210"}