{"sentences": [{"8976": "You See, All I Need Is a True Friend"}, {"7edd": "It was a winter’s day in Massachusetts, a very cold one indeed."}, {"49a8": "I was heading back to my car, and she had just gotten out of hers. She was probably in her fifties or, at most, early sixties."}, {"ec9a": "I was nineteen."}, {"e3c8": "I smiled and said hi. She smiled and said hi."}, {"2829": "The greeting turned into small talk. We talked about where we were from, what we were up to that day, what I was studying, and other generic topics."}, {"33a4": "Little by little, time began to pass, and I noticed that the friendly greeting had turned into a full-fledged conversation. But I couldn’t spend all day speaking to her."}, {"51f3": "I started giving the indirect signs that I had to go, started shortening my replies, looking at my watch, but she didn’t get the hint and kept on talking."}, {"ab19": "Finally, I dropped the axe, stuck out my hand, and said it was nice to meet her."}, {"cab6": "Then she did something totally unexpected."}, {"27de": "Instead of shaking my hand, she extended both of hers and clasped onto mine. Before I could ask what was going on, her expression began to change. Her hands were trembling, her eyes watery and moist, with tears running down her cheeks."}, {"16c5": "And she didn’t stop there. She broke down and was crying her heart out."}, {"3e06": "I repeat, I was nineteen, barely beginning my life as an adult, really little more than a teenager. I didn’t know what to do. I had this stranger, this lady older than my mom breaking down in front of me."}, {"5739": "It was, to say the least, an awkward moment."}, {"2814": "You could imagine my thought process. Should I give her a hug? Tell her it’s okay? Ask her what was going on? Call someone for help? Aaarrrrgghh!!!"}, {"eef5": "I’m the type of person who freezes up in these kinds of situations."}, {"a855": "And that’s what I did."}, {"ee9d": "With a choked up voice, she said that it was her son. She was worried about him. They had gotten into an argument, a really heated one, and he disappeared refusing to have anything to do with her. She was afraid of never seeing him again."}, {"c436": "I know that family arguments aren’t new, but when she shared the big weight on her heart, I saw the suffering in her eyes, felt a lump in my throat, and something moved in my heart."}, {"6ca0": "I couldn’t imagine what she must have been going through or what she must have been feeling or how truly heart-rending it must have been for that to happen to a mother. And not just any mother, but this real, breathing one standing in front of me."}, {"13b7": "At that moment, I didn’t care about what had happened or how common a problem it was. The only thing on my mind was that a suffering soul needed my help in some way somehow."}, {"1151": "I didn’t know what to say, so I just grabbed her hands and looked into her eyes. I wanted her to feel and know that someone was there. That she wasn’t alone."}, {"07a9": "That at that moment, I was there."}, {"4596": "After a while, her weeping turned to sobs and, a little bit later, she got herself back together."}, {"1da4": "Now, I didn’t say anything wise. I didn’t say anything that fixed her problem or that gave her a concrete solution, but I was there for her and, in the end, that seemed to make the difference."}, {"a95b": "And you know what? It didn’t seem to matter that I was some kid or some stranger."}, {"8544": "The fact that somebody, a real somebody was there for her, supporting her, motivating her, feeling with her, helping her get through this moment of suffering, was enough. In some hidden mysterious way, it comforted her and gave her strength."}, {"efee": "How many people are there in the world like that lady? Who live normal lives and make a decent living, but who, deep inside, carry the weight of suffering in their hearts. An interior and hidden anguish which darkens their lives and keeps them wide-eyed night after night. Those who have no one to go to. Those who are hungering and thirsting for an open heart, a shoulder to cry on, a person to be there for them. In other words, a friend."}, {"a834": "When I was nineteen, I knew that people suffered and that, for many people, life weighed upon them like a heavy wet blanket."}, {"d67c": "But big deal, right? Suffering’s human. Our lives move on. So what if someone is lonely or hurting? It’s part of life."}, {"836a": "But can we really live like that? Accepting suffering as some kind of fact of life? Just walking by when we see suffering incarnated in flesh and blood? Do we really see the human being behind the suffering, or rather, the human who is suffering?"}, {"c90d": "That experience changed my life not because it was my first experience of suffering nor because her suffering was beyond anything I’ve ever experienced before."}, {"8716": "It changed my life because I realized that in the face of all the suffering and all the sorrow in this cold, harsh world there was something I could do."}, {"9e50": "I could help."}, {"4c04": "I could make an actual difference in someone’s life."}, {"9889": "I could be a friend."}, {"1937": "In our day and age, there are solutions for almost every problem."}, {"76ec": "But there are problems that the internet, technology, and money cannot solve."}, {"c17f": "These are problems that take root in the depths of our hearts that don’t seem to have a solution. They are the deeper hurts and personal problems which remain, boiling up and growing and causing stress till we can’t take it anymore."}, {"758c": "That lady’s problem was one of these. But she didn’t know where to find the solution."}, {"8b1a": "And where do we go when we don’t know where to go?"}, {"df7f": "We know where a lot of people go: the bottle, the pills, sex, partying, jobs, TV, entertainment, you name it. All of us have our anesthesia."}, {"7cce": "But these do not solve the problem. They only numb it, letting it grow even bigger and more unbearable as time passes."}, {"4d78": "Because they don’t address our hearts’ unspoken plea:"}, {"add0": "Not for a solution."}, {"7e1a": "Not for a pill."}, {"b9fc": "Not for a tip."}, {"3a8c": "But for a person."}, {"51b6": "An open ear."}, {"e91c": "A listening heart."}, {"a0e6": "A friend."}, {"34e0": "That day, I realized that often that’s the secret to suffering."}, {"9e3b": "And it was something that I could give."}, {"9dc3": "Sometimes, when life gets us down and we hurt deep inside, all we want is a friend, someone to be there for us, who really cares, who doesn’t want our money or what we can give, but who is there for us, to support us, to struggle through life with us."}, {"22e2": "And this is what money cannot buy."}, {"e294": "You."}, {"1b82": "Me."}, {"5ec8": "The person next to you."}, {"c9d4": "Without a friend, we cannot live."}, {"c33f": "But there’s good news: no matter who you are, no matter where you’re from or your personal experience, friendship is a gift that you can give."}, {"9e89": "It’s something more precious than a new car, the latest gadget, or a seven-figure income."}, {"1b1c": "Something that we can’t live without, yet at times so hard to find."}, {"d3b9": "Something that is free yet takes so much from us."}, {"619b": "Something so simple, yet so hard to understand."}, {"3fe8": "Something that makes us happy, that helps us go on day after day, that helps us live our lives in the best way that we can."}, {"c7d3": "Something that you can give without losing anything."}, {"a7b6": "Something that can change a life and make it worth living."}, {"caa6": "Something that can fill an empty void in our heart."}, {"c31c": "Something that might not solve the problems, but helps us work through them."}, {"162b": "It’s that simple, free, little, and essential gift called friendship."}, {"2d46": "That day, I learned something simple about suffering: I can do something about it."}, {"9d84": "The question is: Will You?"}, {"3e75": "Thank you for spending your precious time here."}, {"d68d": "Please support my work by hitting the ❤ and sharing it with someone you know."}, {"210d": "Also, I’d love to see you here again , so go ahead and click that little follow button."}, {"332f": "Thanks a million."}, {"5dec": "Can I Really Say I Love You?After everything we’ve been through?medium.com"}], "child": "2212_1\t2212_2\t2212_3\t2212_4\t2212_5\t2212_6\t2212_7\t2212_8\t2212_9\t2212_10\t2212_11\t2212_12\t2212_13\t2212_14\t2212_152212_1\t2212_2\t2212_3\t2212_4\t2212_5\t2212_6\t2212_7\t2212_8\t2212_9\t2212_10\t2212_11\t2212_12\t2212_13\t2212_14\t2212_15", "parent": "", "title": "You See, All I Need Is a True Friend", "content": "You See, All I Need Is a True Friend It was a winter’s day in Massachusetts, a very cold one indeed. I was heading back to my car, and she had just gotten out of hers. She was probably in her fifties or, at most, early sixties. I was nineteen. I smiled and said hi. She smiled and said hi. The greeting turned into small talk. We talked about where we were from, what we were up to that day, what I was studying, and other generic topics. Little by little, time began to pass, and I noticed that the friendly greeting had turned into a full-fledged conversation. But I couldn’t spend all day speaking to her. I started giving the indirect signs that I had to go, started shortening my replies, looking at my watch, but she didn’t get the hint and kept on talking. Finally, I dropped the axe, stuck out my hand, and said it was nice to meet her. Then she did something totally unexpected. Instead of shaking my hand, she extended both of hers and clasped onto mine. Before I could ask what was going on, her expression began to change. Her hands were trembling, her eyes watery and moist, with tears running down her cheeks. And she didn’t stop there. She broke down and was crying her heart out. I repeat, I was nineteen, barely beginning my life as an adult, really little more than a teenager. I didn’t know what to do. I had this stranger, this lady older than my mom breaking down in front of me. It was, to say the least, an awkward moment. You could imagine my thought process. Should I give her a hug? Tell her it’s okay? Ask her what was going on? Call someone for help? Aaarrrrgghh!!! I’m the type of person who freezes up in these kinds of situations. And that’s what I did. With a choked up voice, she said that it was her son. She was worried about him. They had gotten into an argument, a really heated one, and he disappeared refusing to have anything to do with her. She was afraid of never seeing him again. I know that family arguments aren’t new, but when she shared the big weight on her heart, I saw the suffering in her eyes, felt a lump in my throat, and something moved in my heart. I couldn’t imagine what she must have been going through or what she must have been feeling or how truly heart-rending it must have been for that to happen to a mother. And not just any mother, but this real, breathing one standing in front of me. At that moment, I didn’t care about what had happened or how common a problem it was. The only thing on my mind was that a suffering soul needed my help in some way somehow. I didn’t know what to say, so I just grabbed her hands and looked into her eyes. I wanted her to feel and know that someone was there. That she wasn’t alone. That at that moment, I was there. After a while, her weeping turned to sobs and, a little bit later, she got herself back together. Now, I didn’t say anything wise. I didn’t say anything that fixed her problem or that gave her a concrete solution, but I was there for her and, in the end, that seemed to make the difference. And you know what? It didn’t seem to matter that I was some kid or some stranger. The fact that somebody, a real somebody was there for her, supporting her, motivating her, feeling with her, helping her get through this moment of suffering, was enough. In some hidden mysterious way, it comforted her and gave her strength. How many people are there in the world like that lady? Who live normal lives and make a decent living, but who, deep inside, carry the weight of suffering in their hearts. An interior and hidden anguish which darkens their lives and keeps them wide-eyed night after night. Those who have no one to go to. Those who are hungering and thirsting for an open heart, a shoulder to cry on, a person to be there for them. In other words, a friend. When I was nineteen, I knew that people suffered and that, for many people, life weighed upon them like a heavy wet blanket. But big deal, right? Suffering’s human. Our lives move on. So what if someone is lonely or hurting? It’s part of life. But can we really live like that? Accepting suffering as some kind of fact of life? Just walking by when we see suffering incarnated in flesh and blood? Do we really see the human being behind the suffering, or rather, the human who is suffering? That experience changed my life not because it was my first experience of suffering nor because her suffering was beyond anything I’ve ever experienced before. It changed my life because I realized that in the face of all the suffering and all the sorrow in this cold, harsh world there was something I could do. I could help. I could make an actual difference in someone’s life. I could be a friend. In our day and age, there are solutions for almost every problem. But there are problems that the internet, technology, and money cannot solve. These are problems that take root in the depths of our hearts that don’t seem to have a solution. They are the deeper hurts and personal problems which remain, boiling up and growing and causing stress till we can’t take it anymore. That lady’s problem was one of these. But she didn’t know where to find the solution. And where do we go when we don’t know where to go? We know where a lot of people go: the bottle, the pills, sex, partying, jobs, TV, entertainment, you name it. All of us have our anesthesia. But these do not solve the problem. They only numb it, letting it grow even bigger and more unbearable as time passes. Because they don’t address our hearts’ unspoken plea: Not for a solution. Not for a pill. Not for a tip. But for a person. An open ear. A listening heart. A friend. That day, I realized that often that’s the secret to suffering. And it was something that I could give. Sometimes, when life gets us down and we hurt deep inside, all we want is a friend, someone to be there for us, who really cares, who doesn’t want our money or what we can give, but who is there for us, to support us, to struggle through life with us. And this is what money cannot buy. You. Me. The person next to you. Without a friend, we cannot live. But there’s good news: no matter who you are, no matter where you’re from or your personal experience, friendship is a gift that you can give. It’s something more precious than a new car, the latest gadget, or a seven-figure income. Something that we can’t live without, yet at times so hard to find. Something that is free yet takes so much from us. Something so simple, yet so hard to understand. Something that makes us happy, that helps us go on day after day, that helps us live our lives in the best way that we can. Something that you can give without losing anything. Something that can change a life and make it worth living. Something that can fill an empty void in our heart. Something that might not solve the problems, but helps us work through them. It’s that simple, free, little, and essential gift called friendship. That day, I learned something simple about suffering: I can do something about it. The question is: Will You? Thank you for spending your precious time here. Please support my work by hitting the ❤ and sharing it with someone you know. Also, I’d love to see you here again , so go ahead and click that little follow button. Thanks a million. Can I Really Say I Love You?After everything we’ve been through?medium.com ", "name": "2212"}