{"sentences": [{"1c5f": "How to be a better person, with love from Zeus"}, {"3ed8": "Dear Humans of Earth,"}, {"5aa3": "I can’t help but notice from my throne of clouds that some of you suck at being Human. Now, now, don’t take this the wrong way. Indeed you are Human, and the degree to which you are Human doesn’t change based on my judgment. Though I will warn you, some of you do happen to behave more animal-like, and last I checked, Hera was searching for more Humans to turn into animals to do her bidding. Beware the beautiful woman lurking in the corner, looking at you like you’re a bun-wrapped, mustard-smeared hot dog. (Boy, do those things look delicious.)"}, {"8ad4": "Now, I’m not really an expert on being Human. I’m a fricken Greek God, people! But I am an avid spectator. Ha! I do love a good Game of Humans. What will happen when the White Walkers come for you all?"}, {"17b8": "I digress. It strikes me, like a white-hot lightning bolt, that some of you remain, well, unhappy. Now, I’m no Charis, but I do have a certain vantage point, if you will. And today, I feel compelled to offer my generous thoughts. Tomorrow, I might just smite you, but let’s not get ahead of ourselves."}, {"bfa9": "Thus, here is my list for you, dear Humans, of how to be a better person in 9 steps. And if you don’t like it, I know Hades could always use a few more hands Down Under. (No, Australia. Not talking about you.)"}, {"0243": "Here we go, with love from me (Zeus):"}, {"a07d": "1. If you’re going to laugh about it later, you might as well laugh about it now. The way you all get into a tizzy about things! You’d think a Hydra was breathing down your necks! Take a lesson from Dionysis: if you can have fun at any point, why not choose now? And if you need help, he recommends a nice bottle of Chateau Margaux 2009."}, {"b378": "2. Just do the things you want to do, because soon, you’re going to be dead. Whoa, Debbie Downer, right?! But seriously, if I were mortal, I wouldn’t waste a second. And then, spoiler alert: Hades isn’t actually that bad. Even in death, you’ll have a party. You should hear how he laughs at cat memes. Seriously. You would have thought he’d caught Athena doing the hula."}, {"a9f9": "3. Sugar makes you feel like crap. It has always made you feel like crap. It will always make you feel like crap. Stop eating sugar."}, {"ffb4": "4. All those things you spend your time worrying about that you know aren’t worth your time? They’re not worth your time. Stop worrying about them."}, {"19ec": "5. Kiss him. Kiss her. What, you think Eros is flying around like a crazed cupid shooting you in the butt for fun? It’s his job, people. Help him out. Love is always worth the pain. (And I know — those arrows are sharp.)"}, {"fa2d": "6. Clean out your closet and buy some new underwear. Again, help Eros out. For the love of Chimera, you deserve better."}, {"c4b2": "7. Be the first to say “hi.” You might not know this, but the Cyclops is actually a cheery fellow. He always makes eye contact. He invites everyone to sing-along night. He’s the person on Mt. Olympus who will always gives good directions. Because he’s not afraid to say “hi” first. Everyone is dealing with their own demonic marriages, or splitting headaches as children spring forth from their skulls. Be kind. Be the first. A simple “hi” goes a long way."}, {"3861": "8. Do you have to make a decision about something right now? More than often, you don’t. And if you don’t have to make a decision about something right now — if the Titans aren’t actively knocking down my door, why risk developing canker sores in my fretting? Gods, I hate those things — let it go. (Man, that Ice Queen, Elsa! I mean, right?!) There are many other things, better things, you could be putting your precious time and energy towards. Reminder: You’re going to be dead soon."}, {"339e": "9. Fine. You can go on social media again. But call your mother first."}, {"9747": "Till next time."}, {"5e14": "With love,"}, {"7f0e": "Zeus"}], "child": "2214_1\t2214_2\t2214_3\t2214_4\t2214_5\t2214_6\t2214_7\t2214_8\t2214_9\t2214_10\t2214_11\t2214_12", "parent": "", "title": "How to be a better person, with love from Zeus", "content": "How to be a better person, with love from Zeus Dear Humans of Earth, I can’t help but notice from my throne of clouds that some of you suck at being Human. Now, now, don’t take this the wrong way. Indeed you are Human, and the degree to which you are Human doesn’t change based on my judgment. Though I will warn you, some of you do happen to behave more animal-like, and last I checked, Hera was searching for more Humans to turn into animals to do her bidding. Beware the beautiful woman lurking in the corner, looking at you like you’re a bun-wrapped, mustard-smeared hot dog. (Boy, do those things look delicious.) Now, I’m not really an expert on being Human. I’m a fricken Greek God, people! But I am an avid spectator. Ha! I do love a good Game of Humans. What will happen when the White Walkers come for you all? I digress. It strikes me, like a white-hot lightning bolt, that some of you remain, well, unhappy. Now, I’m no Charis, but I do have a certain vantage point, if you will. And today, I feel compelled to offer my generous thoughts. Tomorrow, I might just smite you, but let’s not get ahead of ourselves. Thus, here is my list for you, dear Humans, of how to be a better person in 9 steps. And if you don’t like it, I know Hades could always use a few more hands Down Under. (No, Australia. Not talking about you.) Here we go, with love from me (Zeus): 1. If you’re going to laugh about it later, you might as well laugh about it now. The way you all get into a tizzy about things! You’d think a Hydra was breathing down your necks! Take a lesson from Dionysis: if you can have fun at any point, why not choose now? And if you need help, he recommends a nice bottle of Chateau Margaux 2009. 2. Just do the things you want to do, because soon, you’re going to be dead. Whoa, Debbie Downer, right?! But seriously, if I were mortal, I wouldn’t waste a second. And then, spoiler alert: Hades isn’t actually that bad. Even in death, you’ll have a party. You should hear how he laughs at cat memes. Seriously. You would have thought he’d caught Athena doing the hula. 3. Sugar makes you feel like crap. It has always made you feel like crap. It will always make you feel like crap. Stop eating sugar. 4. All those things you spend your time worrying about that you know aren’t worth your time? They’re not worth your time. Stop worrying about them. 5. Kiss him. Kiss her. What, you think Eros is flying around like a crazed cupid shooting you in the butt for fun? It’s his job, people. Help him out. Love is always worth the pain. (And I know — those arrows are sharp.) 6. Clean out your closet and buy some new underwear. Again, help Eros out. For the love of Chimera, you deserve better. 7. Be the first to say “hi.” You might not know this, but the Cyclops is actually a cheery fellow. He always makes eye contact. He invites everyone to sing-along night. He’s the person on Mt. Olympus who will always gives good directions. Because he’s not afraid to say “hi” first. Everyone is dealing with their own demonic marriages, or splitting headaches as children spring forth from their skulls. Be kind. Be the first. A simple “hi” goes a long way. 8. Do you have to make a decision about something right now? More than often, you don’t. And if you don’t have to make a decision about something right now — if the Titans aren’t actively knocking down my door, why risk developing canker sores in my fretting? Gods, I hate those things — let it go. (Man, that Ice Queen, Elsa! I mean, right?!) There are many other things, better things, you could be putting your precious time and energy towards. Reminder: You’re going to be dead soon. 9. Fine. You can go on social media again. But call your mother first. Till next time. With love, Zeus ", "name": "2214"}