{"sentences": [{"ac5d": "Even Hitler Didn’t Reaccommodate Passengers"}, {"dab5": "This Weak in Politics Vol. LXXI"}, {"32a3": "April 13, 2017"}, {"815a": "It has been quite the week for communicators — from the fine folks at Pepsi who posited that their Coca-Cola alternative can heal all that divides us in 2017, to United Airlines who mistook their Contract of Carriage for a Contract for Carnage, to Sean Spicer, who was apparently a D student at best in History 101."}, {"ebe1": "We’ll start with Spicer, what with this being springtime and all…"}, {"2e2f": "Sean Spicer (SS for short) took to the White House Briefing Room this week and violated two of the most central tenets of public relations of the last 70 years, which are “don’t be a fucking idiot,” and “do not wear a vibrating tie on television, and don’t compare anyone/anything to Hitler/the Holocaust.” (Historical side note: This latter rule has evolved over the years: from approximately 453 AD through about 1227 AD, the rule was “Do not wear a vibrating tie on television, and do not compare anyone/anything to Attila/The Battle of Utus.” And from 1227 through 1938, it was “ телевизээр доргиурт зангиа өмсөж болохгүй вэ болон Чингис хааны / Монгол довтолж нь хэн нэгэн нь / ямар ч харьцуулж болохгүй.” Yeah, the rule was in Mongolian, so it is difficult to follow."}, {"111e": "Spicer’s transgression was when he suggested that “Hitler didn’t even sink to using chemical weapons.” (That is a sentence we never anticipated having to write in all of our years of not going to journalism school — unlike someone who did.) He later “clarified” by saying Hitler didn’t gas his own people. In Spicer’s defense, only the most diligent of historical scholars are aware of Hitler’s use of gas, as the world has long used the euphemism “gas chamber” to describe the “gas chambers” Hitler used on millions of people, including his own. Spicer, sensing (with his Spicey sense?) that he had created the illusion that he was not well-versed in the atrocities of World War II, went on to show his knowledge of Nazism by bringing up the famous “Holocaust Centers (TM)” we have all read about over the years. Finally, in an exclusive to TWITPOL, Spicer informed us that even German soldiers were unaware of the full extent of the horrors of the war, sharing with us footage from a documentary he once saw on the topic."}, {"f333": "We generally don’t take too much umbrage with the media, (particularly the @KatyTurNBC part of the media, or the @oliviamunn part of the media. What? She was a journalism major. Don’t judge us.) but calling Spicer’s statement a ‘gaffe’ seems inaccurate. An intern inadvertently including pictures of Nazi soldiers in a campaign tweet is a gaffe. Stating that Hitler didn’t use chemical weapons or gas his own people is a world class fuck up (note how we didn’t call it “the holocaust of gaffes?” Calling it a gaffe is like calling the Exxon Valdez a “boating mishap.”"}, {"a69f": "Speaking of transportation mishaps, United Airlines made news this week by re-accommodating a passenger directly from row 23F to room 317 at Lutheran General Hospital in Park Ridge, IL (Motto: If Beaten by Dept. of Aviation, Make Lutheran Your Destination!) The passenger, Dr. David Dao, refused to give up his seat to United Airline crew members as he either had to see patients the following morning, or he had a seat at a World Series of Poker qualifying tournament. Regardless, Dao declined repeated “cash” offers for his seat, at which point the airline made him an offer he couldn’t refuse…literally."}, {"7f85": "Chicago Police, immediately upon hearing about someone being roughed up by law enforcement put out a statement saying “officers on scene attempted to carry the individual off of the flight when he fell. His head subsequently struck an armrest causing injuries to his face.” They added, “besides, you can’t blame us, he is Asian. That’s practically black, so we had to act.” When informed that it was actually aviation law enforcement, rather than the Chicago PD, they referred reporters to airport law enforcement/security officials who said, “well, you can’t blame us, he is Asian. That’s practically Muslim, so we had to act.”"}, {"c578": "To mitigate the damage, United has hired ad director Bjorn Charpentier (recently of Pepsi Lives Matter fame) to create an apology ad starring Bill Cosby, which we are told, will air on Fox during the O’Reilly Factor."}, {"c842": "Syrious as a Heart Attack"}, {"2d9a": "In other news, in order to staunch the use of chemical weapons by Bashar al Assad, and to staunch his hemorrhaging poll numbers (man, hemorrhaging is a funny looking word), President Trump (man, President Trump is a scary term) this week bombed the cell phone waiting lot of a Syrian airport."}, {"1598": "Evidence of the effectiveness of the bombings on air transport in Syria has been dubious at best. (Seriously, if we really want to harm Syrian air travel, we shouldn’t have the United States bomb it, we should have United Airlines run it.) Administration officials contend that the attacks seriously damaged the airstrip, while critics say planes were still able to take off the next day. What those critics fail to note is — those were United Airlines planes, and those responsible for the chemical weapons discharge were forced to fly coach — on what may or may not be an overbooked flight."}, {"810b": "Trump’s war advisors, meeting, naturally, at a golf course."}, {"6833": "While consensus on success of the mission may never be achieved, the attacks did serve to give Trump a boost in his poll numbers."}, {"20cf": "Respondents seem to feel taking military action is more presidential than tweet-attacking TV shows for their Nielsen ratings. Apparently Americans want to see Donald trump lob more cruise missiles and fewer crude missives."}, {"f637": "Here are two maps showing the areas of the world that have been of gravest concern to President Trump in April:"}, {"4a79": "Shayrat Airbase — Site of chemical attack departure. Problematic for Trump as damage assessments suggests the airbase may still be functional."}, {"2b44": "Trump International Golf Course at Mar-a-Lago. Problematic for Trump as the 440 yard, par 4 12th hole has a dogleg right that has proven difficult for the president to navigate."}, {"9547": "And while we are discussing maps — Americans are really impassioned about the situation in Syria — regardless of which side of the ideological divide upon which they stand. There also seems to be a plethora of Syrian Civil War experts in the United States, particularly on social media. If you have one of those crazy old uncles who is now an expert on all things Syria — ask him to point to the general vicinity of the airbase on this map. Or even Syria itself."}, {"ed02": "If you’d like, give him this helpful hint: Damascus, the capital of Syria is approximately 114 kilometers southeast of Beirut, and about 203 kilometers North of Amman."}, {"8dbb": "Okay, okay, so the kilometers thing was an unfair trick. We’ll use miles — the capital of Syria is 289 miles south of Iskenderun. Point to it."}, {"e5ac": "In other words, geopolitical affairs and matters of war and peace are difficult to be expert in, and difficult to navigate. (In fact, just this week President Trump said, for instance, that the North Korea situation is not as simple as people think. With all due respect, Mr. President, there is definitely something in this scenario that is exactly as simple as people think.)"}, {"6e83": "But have no fear: before Trump went to the USS Porter and the USS Ross to have them launch tomahawk missiles, he went to Jared."}, {"e3b5": "Yes, Jared Kushner — the same Jared who’s portfolio includes being the president’s son in law, negotiating Middle East peace, arranging Chinese President Xi Jinping’s visit to the US, dealing with Mexico and reorganizing the entire federal government (a task Vice President Al Gore undertook 17 years ago, when Kushner was 13). But again, have no fear, Jareds are known for being able to fill big britches with barely even a hitch."}, {"7089": "On the media front, ratings/sexual harassment giant Bill O’Reilly announced this week he will be taking a short break from his regular activities (the talking thing, not the gawking thing) to spend more time with his family. Close watchers (defined loosely as: the Trump Administration and the state of Kansas) speculate that this may be the end of the road for O’Reilly at Fox. Should O’Reilly leave, it is further speculated that Fox News will cave in to the pressure of women’s rights groups and will give O’Reilly’s slot to…one of the two remaining male employees who have not yet settled a sexual harassment suit."}, {"19e6": "Meanwhile Fox “rival,” CNN, has beefed up its personnel department by bringing on American Urban Radio’s April “Stop shaking your head” Ryan, Pulitzer prize winning NY Times reporter Eric Lichtblau and the Washington Post’s Chris Cillizza. This is a new approach for CNN — hiring journalists. And the Washington Post’s Chris Cillizza."}, {"050e": "Note: we kid Chris Cillizza. We respect him immensely for his journalism. Or because he did this:"}, {"084d": "In other news, the state of Arkansas is running a special on executions holding “two-for-one” nights at least 3 times in April, and sources tell us they are entertaining a Groupon offering that could even bring that up to three per night. Now before you get to thinking that this is insane and that perhaps the system of capital punishment in the United States is a little arbitrary, hurried, willy-nilly and ill maintained, there is a perfectly sound and reasonable explanation for the Twofer Tuesdays special: the jars of execution drugs they have lying around are about to hit their expiration date. It would be a shame to waste perfectly good Midazolam."}, {"40eb": "As we close, despite the busy news week, we still give you yet another installment of:"}, {"64aa": "“Three Things You‘ve Probably Never Seen”"}, {"117e": "And that’s how the weak spent the week in a nation where we lob missiles at a government for killing its people with chemicals while simultaneously rushing to kill our own people before our chemicals pass their “best if used by” date."}, {"13eb": "If you enjoy reading TWITPOL please seek help. But please also follow us, recommend this story, share it, and do all sorts of other things that the kids these days do. Follow us on Medium.com and on twitter at @sbouchard67"}], "child": "2215_1\t2215_2\t2215_3\t2215_4\t2215_5", "parent": "", "title": "Even Hitler Didn’t Reaccommodate Passengers", "content": "Even Hitler Didn’t Reaccommodate Passengers This Weak in Politics Vol. LXXI April 13, 2017 It has been quite the week for communicators — from the fine folks at Pepsi who posited that their Coca-Cola alternative can heal all that divides us in 2017, to United Airlines who mistook their Contract of Carriage for a Contract for Carnage, to Sean Spicer, who was apparently a D student at best in History 101. We’ll start with Spicer, what with this being springtime and all… Sean Spicer (SS for short) took to the White House Briefing Room this week and violated two of the most central tenets of public relations of the last 70 years, which are “don’t be a fucking idiot,” and “do not wear a vibrating tie on television, and don’t compare anyone/anything to Hitler/the Holocaust.” (Historical side note: This latter rule has evolved over the years: from approximately 453 AD through about 1227 AD, the rule was “Do not wear a vibrating tie on television, and do not compare anyone/anything to Attila/The Battle of Utus.” And from 1227 through 1938, it was “ телевизээр доргиурт зангиа өмсөж болохгүй вэ болон Чингис хааны / Монгол довтолж нь хэн нэгэн нь / ямар ч харьцуулж болохгүй.” Yeah, the rule was in Mongolian, so it is difficult to follow. Spicer’s transgression was when he suggested that “Hitler didn’t even sink to using chemical weapons.” (That is a sentence we never anticipated having to write in all of our years of not going to journalism school — unlike someone who did.) He later “clarified” by saying Hitler didn’t gas his own people. In Spicer’s defense, only the most diligent of historical scholars are aware of Hitler’s use of gas, as the world has long used the euphemism “gas chamber” to describe the “gas chambers” Hitler used on millions of people, including his own. Spicer, sensing (with his Spicey sense?) that he had created the illusion that he was not well-versed in the atrocities of World War II, went on to show his knowledge of Nazism by bringing up the famous “Holocaust Centers (TM)” we have all read about over the years. Finally, in an exclusive to TWITPOL, Spicer informed us that even German soldiers were unaware of the full extent of the horrors of the war, sharing with us footage from a documentary he once saw on the topic. We generally don’t take too much umbrage with the media, (particularly the @KatyTurNBC part of the media, or the @oliviamunn part of the media. What? She was a journalism major. Don’t judge us.) but calling Spicer’s statement a ‘gaffe’ seems inaccurate. An intern inadvertently including pictures of Nazi soldiers in a campaign tweet is a gaffe. Stating that Hitler didn’t use chemical weapons or gas his own people is a world class fuck up (note how we didn’t call it “the holocaust of gaffes?” Calling it a gaffe is like calling the Exxon Valdez a “boating mishap.” Speaking of transportation mishaps, United Airlines made news this week by re-accommodating a passenger directly from row 23F to room 317 at Lutheran General Hospital in Park Ridge, IL (Motto: If Beaten by Dept. of Aviation, Make Lutheran Your Destination!) The passenger, Dr. David Dao, refused to give up his seat to United Airline crew members as he either had to see patients the following morning, or he had a seat at a World Series of Poker qualifying tournament. Regardless, Dao declined repeated “cash” offers for his seat, at which point the airline made him an offer he couldn’t refuse…literally. Chicago Police, immediately upon hearing about someone being roughed up by law enforcement put out a statement saying “officers on scene attempted to carry the individual off of the flight when he fell. His head subsequently struck an armrest causing injuries to his face.” They added, “besides, you can’t blame us, he is Asian. That’s practically black, so we had to act.” When informed that it was actually aviation law enforcement, rather than the Chicago PD, they referred reporters to airport law enforcement/security officials who said, “well, you can’t blame us, he is Asian. That’s practically Muslim, so we had to act.” To mitigate the damage, United has hired ad director Bjorn Charpentier (recently of Pepsi Lives Matter fame) to create an apology ad starring Bill Cosby, which we are told, will air on Fox during the O’Reilly Factor. Syrious as a Heart Attack In other news, in order to staunch the use of chemical weapons by Bashar al Assad, and to staunch his hemorrhaging poll numbers (man, hemorrhaging is a funny looking word), President Trump (man, President Trump is a scary term) this week bombed the cell phone waiting lot of a Syrian airport. Evidence of the effectiveness of the bombings on air transport in Syria has been dubious at best. (Seriously, if we really want to harm Syrian air travel, we shouldn’t have the United States bomb it, we should have United Airlines run it.) Administration officials contend that the attacks seriously damaged the airstrip, while critics say planes were still able to take off the next day. What those critics fail to note is — those were United Airlines planes, and those responsible for the chemical weapons discharge were forced to fly coach — on what may or may not be an overbooked flight. Trump’s war advisors, meeting, naturally, at a golf course. While consensus on success of the mission may never be achieved, the attacks did serve to give Trump a boost in his poll numbers. Respondents seem to feel taking military action is more presidential than tweet-attacking TV shows for their Nielsen ratings. Apparently Americans want to see Donald trump lob more cruise missiles and fewer crude missives. Here are two maps showing the areas of the world that have been of gravest concern to President Trump in April: Shayrat Airbase — Site of chemical attack departure. Problematic for Trump as damage assessments suggests the airbase may still be functional. Trump International Golf Course at Mar-a-Lago. Problematic for Trump as the 440 yard, par 4 12th hole has a dogleg right that has proven difficult for the president to navigate. And while we are discussing maps — Americans are really impassioned about the situation in Syria — regardless of which side of the ideological divide upon which they stand. There also seems to be a plethora of Syrian Civil War experts in the United States, particularly on social media. If you have one of those crazy old uncles who is now an expert on all things Syria — ask him to point to the general vicinity of the airbase on this map. Or even Syria itself. If you’d like, give him this helpful hint: Damascus, the capital of Syria is approximately 114 kilometers southeast of Beirut, and about 203 kilometers North of Amman. Okay, okay, so the kilometers thing was an unfair trick. We’ll use miles — the capital of Syria is 289 miles south of Iskenderun. Point to it. In other words, geopolitical affairs and matters of war and peace are difficult to be expert in, and difficult to navigate. (In fact, just this week President Trump said, for instance, that the North Korea situation is not as simple as people think. With all due respect, Mr. President, there is definitely something in this scenario that is exactly as simple as people think.) But have no fear: before Trump went to the USS Porter and the USS Ross to have them launch tomahawk missiles, he went to Jared. Yes, Jared Kushner — the same Jared who’s portfolio includes being the president’s son in law, negotiating Middle East peace, arranging Chinese President Xi Jinping’s visit to the US, dealing with Mexico and reorganizing the entire federal government (a task Vice President Al Gore undertook 17 years ago, when Kushner was 13). But again, have no fear, Jareds are known for being able to fill big britches with barely even a hitch. On the media front, ratings/sexual harassment giant Bill O’Reilly announced this week he will be taking a short break from his regular activities (the talking thing, not the gawking thing) to spend more time with his family. Close watchers (defined loosely as: the Trump Administration and the state of Kansas) speculate that this may be the end of the road for O’Reilly at Fox. Should O’Reilly leave, it is further speculated that Fox News will cave in to the pressure of women’s rights groups and will give O’Reilly’s slot to…one of the two remaining male employees who have not yet settled a sexual harassment suit. Meanwhile Fox “rival,” CNN, has beefed up its personnel department by bringing on American Urban Radio’s April “Stop shaking your head” Ryan, Pulitzer prize winning NY Times reporter Eric Lichtblau and the Washington Post’s Chris Cillizza. This is a new approach for CNN — hiring journalists. And the Washington Post’s Chris Cillizza. Note: we kid Chris Cillizza. We respect him immensely for his journalism. Or because he did this: In other news, the state of Arkansas is running a special on executions holding “two-for-one” nights at least 3 times in April, and sources tell us they are entertaining a Groupon offering that could even bring that up to three per night. Now before you get to thinking that this is insane and that perhaps the system of capital punishment in the United States is a little arbitrary, hurried, willy-nilly and ill maintained, there is a perfectly sound and reasonable explanation for the Twofer Tuesdays special: the jars of execution drugs they have lying around are about to hit their expiration date. It would be a shame to waste perfectly good Midazolam. As we close, despite the busy news week, we still give you yet another installment of: “Three Things You‘ve Probably Never Seen” And that’s how the weak spent the week in a nation where we lob missiles at a government for killing its people with chemicals while simultaneously rushing to kill our own people before our chemicals pass their “best if used by” date. If you enjoy reading TWITPOL please seek help. But please also follow us, recommend this story, share it, and do all sorts of other things that the kids these days do. Follow us on Medium.com and on twitter at @sbouchard67 ", "name": "2215"}