{"sentences": [{"074b": "Hairat — The Wonder of the Sense of Wonder"}, {"b488": "A Sufi Celebration of Life, Inspired By Urdu"}, {"5717": "Previous Article : Gair — The Menace of ‘The Other’"}, {"718c": "Saari Hairat Hai Meri Saari Ada Us Ki Hai"}, {"544f": "Be-gunahi Hai Meri Aur Saza Us Ki Hai"}, {"9836": "— Javed Akhtar"}, {"f68e": "All the wonder is mine, all the grace/style/aesthetic appeal is his"}, {"e0e3": "The innocence is mine, the punishment is his"}, {"f81a": "Hairat."}, {"be27": "Literally translated, Hairat means wonder. And for once, I don’t need to lament the lack of poetic intensity in this word’s English counterpart. Because wonder is perhaps one of the most gorgeous words in English language, an instant mood-lifter, a harbor for innocence and wild dream, the place where echoes of our lost childhood can be still heard, loud and clear."}, {"687f": "Wonder is a wonderful word. In my humble opinion anyway."}, {"ff8c": "And Hairat, well, hairat is the linguistic wonder that the sentiment of wonder truly deserves — a poetic match made in Heaven."}, {"b3dc": "After the due waxing poetic, here is a question for you — when was the last time you had heard or used the word wonder (or Hairat, if you are a native Hindi/Urdu speaker) in a conversation?"}, {"74be": "You can give yourself a pat on your back if it was sometime last year."}, {"f6d4": "Remember, you deserve the pat only if you have used the word ‘wonder’ and not a variation like wonderful."}, {"f3e7": "Definitely not wonderful, because more often than not, it is just another terribly thoughtless expression of fake enthusiasm, like awesome. I am pretty sure most of us don’t even process the meaning of these words before thoughtlessly throwing them around."}, {"87cd": "It is a tragedy of the dude-fied, cool times we live in where nice (or rather naiiiceee…) is not just an acceptable compliment, but often an expression of multiple sentiments. We are in way too much hurry to process our words and give ourselves time to enjoy their aesthetics. We prefer words the way we would prefer our tools — quick, sharp, functional and preferably with 4-in-1 usage."}, {"a253": "I am pretty sure somewhere up there in Heaven, Shakespeare’s soul is awfully upset. Right along with Premchand and Mirza Ghalib."}, {"717e": "Wonder, however, denies us the luxury of casual usage by virtue of its inherent abstraction. If you really want to use ‘wonder’ in a sentence, you will have to think about it. And that genius is the beauty and will eventually be the reason behind the near linguistic extinction of that word."}, {"9cc5": "But as the saying goes (a version of it anyway), it is not just the word, but the world it encompasses that makes it so precious."}, {"f711": "Back during the times when Homo Erectus was yet to become a terrible innuendo, and Homo Sapiens were still discovering wondrous novelties like the fact that fire can kill and stone wheels are incredibly inefficient, wonder was an evolutionary driving force."}, {"8424": "I know this has become a running theme with this series — me lamenting the loss of something that was supposedly an evolutionary necessity. I am no scientist and most of these so called evolutionary compulsions are deductions by virtue of pure common sense. And the loss of these multiple virtues is also substantive and evident and needs no particular empirical research. It is a recurring theme here, probably because we live in such times, when human hubris is at its zenith and enough of a blinding force for us to forget all the things/virtues/ideas/instincts that have actually kept us alive and going on this planet till date."}, {"42ea": "It is a bubble. Someday it will burst. Or probably, it already has."}, {"2ded": "Anyway, Hairat, was an evolutionary instinct that led to new discoveries and inventions. So did curiosity. But curiosity is clinical and has a short half life. Sooner or later, it blows up. And minus Hairat, or a sense of wonder, nothing tangible is left behind."}, {"cd25": "Hairat, on the contrary, is a lasting emotion with enough depth to fuel civilizations. Hairat is what made our ancestors look at the Sun with awed sense of wonder and deem it a God way before Science established it as a life-source for this planet."}, {"aca7": "Hairat is what made humans look at each other and see the possibilities that were the infinite world of human relationships. Hairat was the reason someone looked at a soaring bird with wonder and figured an aeroplane was an invention worth their time. Hairat is the reason why poets write odes about the first blush of morning Sun; why musicians compose songs that pay homage to a lover’s eyes; storytellers narrate stories that celebrate vagaries of human lives; bloggers write whimsical pieces just like this one."}, {"a479": "Hairat is a celebration of all that is wondrous and wonderful; things that we understand and that we don’t; the infinite mysteries and gifts that the Universe has blessed our existence with."}, {"c9db": "Hairat is the pause to reflect on all this and more; and take moment to let the joy of existence seep in."}, {"48cd": "Hairat Hai Tumko Dekhke Masjid Mein Aei ‘Khumar’"}, {"ba07": "Kya Baat Ho Gyi Jo Khuda Yaad Aa Gya"}, {"9cd0": "— Khumar Barabankvi"}, {"adbe": "It is a wonder to find you in a mosque ‘Khumar’"}, {"2a20": "What is the matter that led you to remember your God"}, {"6003": "We live in progressive times; we live in times when our scientists have discovered the undiscoverable (they discovered the God particle for Chrissake); most mysteries have been dwarfed by our scientific advancements and almost every question has an answer that can be found."}, {"8751": "Almost. Not all. Ask the good people who are still confused about whether or not they are allowed to treat Pluto as a planet while the little shit continues to orbit the Sun unhindered, and without the slightest consideration for this great dilemma."}, {"8aef": "Mysteries of this Universe are reachable. They are also infinite. Hairat is our sense of humility; a deference to the fact that for all our intellectual and scientific progress, we are but a mere speck on the vast, endless landscape of the Universe. A shiny, bright, intelligent, probably even slightly important speck — but a speck nevertheless."}, {"3b1a": "Hairat is looking at a sky full of stars and thanking our stars to be alive to witness it; it is dreaming of standing under the Northern Lights and reveling in the very idea of that dream; it is standing in the midst of a dense jungle and straining to catch the gurgle of the river you just crossed; it is looking at the puppy dog eyes of our poodle and wondering where did it learn that sly, manipulative trick from; it is tasting the food our mother has cooked and realizing that your eminent Chef-dom notwithstanding, you will never be that good; it is listening to your father’s stories about humble beginnings with five bucks in a big city, and wondering how were you even brought into existence."}, {"7a53": "‘Don’t let the child in you die’ is a common adage. Hairat is the way to actually do it. Because perhaps one of the most crucial things that differentiates between an adult and a child is latter’s Hairat or sense of wonder. You look at a cockroach and scream. They look at a cockroach and wonder if it would taste of caramel or pizza sauce. Their hairat may not be entirely hygienic or even advisable; but the purity and innocence of that emotion is admirable and what makes their world better than ours. And if it takes tasting a cockroach to reclaim a part of our childhood, I think I will take it. We all should."}, {"a478": "I am kidding about that last part. Mostly. But, I think you get my point."}, {"a6e0": "Hairat is a conscious art that we all need to cultivate and nourish. It is that extra zing, that magic that can make even a crappy day slightly better. It is the art of respecting the fact that we are alive and kicking and doing okay, all things considered; and on those days when you are really not doing okay, hairat is a marvel at your own tenacity and how much you can take and keep standing; and use that strength to push a little harder and just keep going."}, {"4acb": "Hairat is a wonder at how weird your family can be; and how the hell did you get stuck with these friends; and also at the fact that you are lucky enough to get to keep them."}, {"bde0": "Hairat is an art of living. The one that needs no meditation camps or long winded philo-spiritual discourses. It is simple and easy and perhaps one of those precious secrets that nobody wants you to know about living your life to the fullest."}, {"9c2a": "But, now, you know the secret. It is time to allow yourself to wonder and let Hairat redesign your life!"}, {"3d5e": "Vaae Hairat Ki Bhari Mehfil Mein"}, {"f886": "Mujh Ko Tanha Nazar Aata Hai Koi"}, {"af7a": "— Shakeel Badayuni"}, {"ced3": "Alas! It’s a wonder that in a gathering/party full of people"}, {"bc2c": "I can still see people alone and lonely"}, {"a1d2": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "2216_1", "parent": "", "title": "Hairat — The Wonder of the Sense of Wonder", "content": "Hairat — The Wonder of the Sense of Wonder A Sufi Celebration of Life, Inspired By Urdu Previous Article : Gair — The Menace of ‘The Other’ Saari Hairat Hai Meri Saari Ada Us Ki Hai Be-gunahi Hai Meri Aur Saza Us Ki Hai — Javed Akhtar All the wonder is mine, all the grace/style/aesthetic appeal is his The innocence is mine, the punishment is his Hairat. Literally translated, Hairat means wonder. And for once, I don’t need to lament the lack of poetic intensity in this word’s English counterpart. Because wonder is perhaps one of the most gorgeous words in English language, an instant mood-lifter, a harbor for innocence and wild dream, the place where echoes of our lost childhood can be still heard, loud and clear. Wonder is a wonderful word. In my humble opinion anyway. And Hairat, well, hairat is the linguistic wonder that the sentiment of wonder truly deserves — a poetic match made in Heaven. After the due waxing poetic, here is a question for you — when was the last time you had heard or used the word wonder (or Hairat, if you are a native Hindi/Urdu speaker) in a conversation? You can give yourself a pat on your back if it was sometime last year. Remember, you deserve the pat only if you have used the word ‘wonder’ and not a variation like wonderful. Definitely not wonderful, because more often than not, it is just another terribly thoughtless expression of fake enthusiasm, like awesome. I am pretty sure most of us don’t even process the meaning of these words before thoughtlessly throwing them around. It is a tragedy of the dude-fied, cool times we live in where nice (or rather naiiiceee…) is not just an acceptable compliment, but often an expression of multiple sentiments. We are in way too much hurry to process our words and give ourselves time to enjoy their aesthetics. We prefer words the way we would prefer our tools — quick, sharp, functional and preferably with 4-in-1 usage. I am pretty sure somewhere up there in Heaven, Shakespeare’s soul is awfully upset. Right along with Premchand and Mirza Ghalib. Wonder, however, denies us the luxury of casual usage by virtue of its inherent abstraction. If you really want to use ‘wonder’ in a sentence, you will have to think about it. And that genius is the beauty and will eventually be the reason behind the near linguistic extinction of that word. But as the saying goes (a version of it anyway), it is not just the word, but the world it encompasses that makes it so precious. Back during the times when Homo Erectus was yet to become a terrible innuendo, and Homo Sapiens were still discovering wondrous novelties like the fact that fire can kill and stone wheels are incredibly inefficient, wonder was an evolutionary driving force. I know this has become a running theme with this series — me lamenting the loss of something that was supposedly an evolutionary necessity. I am no scientist and most of these so called evolutionary compulsions are deductions by virtue of pure common sense. And the loss of these multiple virtues is also substantive and evident and needs no particular empirical research. It is a recurring theme here, probably because we live in such times, when human hubris is at its zenith and enough of a blinding force for us to forget all the things/virtues/ideas/instincts that have actually kept us alive and going on this planet till date. It is a bubble. Someday it will burst. Or probably, it already has. Anyway, Hairat, was an evolutionary instinct that led to new discoveries and inventions. So did curiosity. But curiosity is clinical and has a short half life. Sooner or later, it blows up. And minus Hairat, or a sense of wonder, nothing tangible is left behind. Hairat, on the contrary, is a lasting emotion with enough depth to fuel civilizations. Hairat is what made our ancestors look at the Sun with awed sense of wonder and deem it a God way before Science established it as a life-source for this planet. Hairat is what made humans look at each other and see the possibilities that were the infinite world of human relationships. Hairat was the reason someone looked at a soaring bird with wonder and figured an aeroplane was an invention worth their time. Hairat is the reason why poets write odes about the first blush of morning Sun; why musicians compose songs that pay homage to a lover’s eyes; storytellers narrate stories that celebrate vagaries of human lives; bloggers write whimsical pieces just like this one. Hairat is a celebration of all that is wondrous and wonderful; things that we understand and that we don’t; the infinite mysteries and gifts that the Universe has blessed our existence with. Hairat is the pause to reflect on all this and more; and take moment to let the joy of existence seep in. Hairat Hai Tumko Dekhke Masjid Mein Aei ‘Khumar’ Kya Baat Ho Gyi Jo Khuda Yaad Aa Gya — Khumar Barabankvi It is a wonder to find you in a mosque ‘Khumar’ What is the matter that led you to remember your God We live in progressive times; we live in times when our scientists have discovered the undiscoverable (they discovered the God particle for Chrissake); most mysteries have been dwarfed by our scientific advancements and almost every question has an answer that can be found. Almost. Not all. Ask the good people who are still confused about whether or not they are allowed to treat Pluto as a planet while the little shit continues to orbit the Sun unhindered, and without the slightest consideration for this great dilemma. Mysteries of this Universe are reachable. They are also infinite. Hairat is our sense of humility; a deference to the fact that for all our intellectual and scientific progress, we are but a mere speck on the vast, endless landscape of the Universe. A shiny, bright, intelligent, probably even slightly important speck — but a speck nevertheless. Hairat is looking at a sky full of stars and thanking our stars to be alive to witness it; it is dreaming of standing under the Northern Lights and reveling in the very idea of that dream; it is standing in the midst of a dense jungle and straining to catch the gurgle of the river you just crossed; it is looking at the puppy dog eyes of our poodle and wondering where did it learn that sly, manipulative trick from; it is tasting the food our mother has cooked and realizing that your eminent Chef-dom notwithstanding, you will never be that good; it is listening to your father’s stories about humble beginnings with five bucks in a big city, and wondering how were you even brought into existence. ‘Don’t let the child in you die’ is a common adage. Hairat is the way to actually do it. Because perhaps one of the most crucial things that differentiates between an adult and a child is latter’s Hairat or sense of wonder. You look at a cockroach and scream. They look at a cockroach and wonder if it would taste of caramel or pizza sauce. Their hairat may not be entirely hygienic or even advisable; but the purity and innocence of that emotion is admirable and what makes their world better than ours. And if it takes tasting a cockroach to reclaim a part of our childhood, I think I will take it. We all should. I am kidding about that last part. Mostly. But, I think you get my point. Hairat is a conscious art that we all need to cultivate and nourish. It is that extra zing, that magic that can make even a crappy day slightly better. It is the art of respecting the fact that we are alive and kicking and doing okay, all things considered; and on those days when you are really not doing okay, hairat is a marvel at your own tenacity and how much you can take and keep standing; and use that strength to push a little harder and just keep going. Hairat is a wonder at how weird your family can be; and how the hell did you get stuck with these friends; and also at the fact that you are lucky enough to get to keep them. Hairat is an art of living. The one that needs no meditation camps or long winded philo-spiritual discourses. It is simple and easy and perhaps one of those precious secrets that nobody wants you to know about living your life to the fullest. But, now, you know the secret. It is time to allow yourself to wonder and let Hairat redesign your life! Vaae Hairat Ki Bhari Mehfil Mein Mujh Ko Tanha Nazar Aata Hai Koi — Shakeel Badayuni Alas! It’s a wonder that in a gathering/party full of people I can still see people alone and lonely Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "name": "2216"}