{"name": "223", "parent": "", "content": "The Hospital We collect experiences like scars on our bodies. When I was admitted to the psychiatric ward yesterday, I thought of how the smell of antiseptic, the groans of the sick and dying, and the anxiety coursing through my veins were going to be spectres haunting the corners of my mind a cold mundane morning five years from now. It was inevitable, really, how our bodies remember pain, suffering and fear — how raging rivers of anxiety will come to permanently alter the geographies of our minds. We won’t know how something will shape our worldview until years after the fact, and it hits you like a truck on the interstate and you can’t breathe from the sheer velocity of the memory. Was it pain? Or was it a crushing sense of emptiness? The nurse put up the safety rails on the hospital bed so that I could not leave. The constant beeping of the machines made me want t0 hurt myself to forget the sound. I counted slowly from 10 to calm myself, but the black hole of my anxiety was too powerful; numbers and whispers and rocking back and forth were weak flickers of a dying lighter in the darkness of my mind. I wanted to escape. My heart pounded and I was slowly but surely driving myself insane as my thoughts began obsessively spiralling downwards into despair. I felt trapped, an animal they caught because I forgot to wear my plastic mask of a smile that day, last week, and last month. But I wanted to don my mask, I didn't mean to forget, I will wear it now if you will let me go. Please just not this again. I swear to god, I will wear a smile on my face. My eyes dart about like a maniac, my breaths caught in the rawness of my throat. I want a cigarette, I need a smoke. Why are they still here? Why am I still here. They won’t let me go. I began scratching myself to distract me from the bodies being wheeled around, from the quiet mutterings and moans of the corpses lying in blanched white sheets opposite me. The nurse tagged my wrist, the plastic rubbing against the soft spot in my inner wrist. She patted my shoulder almost as an afterthought. Female, Chinese, DOB 1993. Foggy, foggy. Words with no meaning. What was that again. Rapid orders cutting through the cold insisting sounds of the machines: “Bipolar”, “Young female”, “Depression”, “Suicidal”, “Observation”… They talk too much. Too many words. Tumbling, rolling about like forgotten clothes in a dryer. These sounds, they fail to penetrate the fog in my mind. I am only conscious of my hyperventilating breaths, my desperation clawing at my gut. I want to go. Why am I still here. I noticed a black fly. It was flying about, a mundane black spot against the blinding white of the hospital wall. If I could be a fly on the wall. It landed on my right toe. I am mesmerized. I don’t move, letting the fly crawl over my feet. A cold dead body. I am suddenly aware of my screaming and clawing as the fly bounces about and decides whether or not to stay on my feet. When did my voice come back? Cold and dead, I hope you like my feet Mr. Fly. The blinding white light burns my retinas. It is the last thought drifting through my mind when the lorazepam enters my veins, a cold icy blue against the bleached ceiling. Each time you lay down with someone, you collect them — the geography of their minds, the map of their personal histories. You never enter these landscapes; they are private property, trespassing will get you shot. You remember how it feels to be invaded, so you never wish that on anybody. Like this, we exist in tandem, parallel universes never touching. But what happens when a violent transgression is made? How can I protect a already fragile, dying forest when it is in your nature to torch everything with wild abandon? The first time I saw you, you were nervous; sweaty hands, fingerprints on wine glasses. It was nearing midnight and we sat in the garden near the woods, mosquitoes sucking my blood. The moon was bright, a glowing orb bathing the soft candlelit patio. It was your second bottle of wine, I was late because this date wasn’t planned, you insisted I show up because you were “already here”. I frown, I don’t like red wine, never have. I ask for white when the wonderful waitress comes by to greet me. I didn’t like how thick your fingers were, or your breath. But I liked your mind sufficiently to kiss you when you leaned in. I was tentative, slow, uncertain, my lips always unsure. The next day I found five bruises claiming the pale skin on my thighs, from when you tried to fuck me in the woods. Your anger was palpable when I said no, my mind still reeling from my attack a month ago. Did you not understand that I am still trying to come back into my own body, that I am only a ghost in the shell? When I pushed you off you got mad, and asked me to leave. I was about to go anyway, I was so drunk I thought there were stars when there were none. The second time I saw you we were at the same bar. You ordered some cheese this time, but I was too tired to eat. I wore jeans and a white shirt, I didn’t want to be bitten again — the mosquitoes there were savage. Living in the tropics sucks for this exact reason. Its the only thing that will drive me away from this island. The mosquitoes and the humidity. I absentmindedly down five glasses of wine as you go on about your mundane ideas, about loving me, about god, about your professional football career. The wine glass is cold in the humid night, condensing quickly so the water drips onto my jeans. I don’t bother moving my leg and slowly a damp spot forms on my knee. I tune out your constant tirade of words; I don’t care but I want to. I am in constant ambivalence, oscillating between liking you and wanting to leave. Eventually I leave when you get jealous — the waiter had hugged me too long and his gaze had lingered for a second too late. I hate you but I want you to want me. I get into a cab and I think how desperate I am for another living being. Am I so alone that I will settle for your anger and pain? We are just bags of guts anyway. On the cab back to my apartment I remember the look on your face when you noticed the purple marks on my neck, the sharp words from your throat cutting through my Xanax-fueled daze — you been fucking around with how many other men? The third time I saw you we went to the bar your friends owned, it was near my apartment so I said yes, even if it was an hour to midnight and I was tired. I am always tired anyway. The night was fueled by a tirade of foreign words, chainsmoked cigarettes, endless bottles of wine, and useless conversations. I remember you chatting other women up. I was a little hurt you disrespected me like that, but I let you be, because who am I to you anyway. I was just a girl you were going to fuck and forget. As the night went on your best friend started touching my hair shyly, he laughs and checks my reaction — he wants to get to know me. What is there to know about me. I almost laugh. I am so empty I can feel the spaces in between. There is nothing left, I want to tell him. There is nothing to know. An hour later you grab me and your best friend and we get into a cab to your place. Your friend wants to leave, but I want him to stay. I craved his touch, it was soft and knowing and familiar. Six lines of powder. Your anger paints the room red again. What is wrong with you. You talk too much. Stop talking. What the fuck is wrong with you. Your best friend nervously tells you to chill, and the next thing I know I am naked and under you. You fucked me rough, stubbing cigarettes out on the softness on the inside of my arm. The pain barely registers. I turn my face away when you lean down to kiss me, your fingers gripping the inside of my wrists so tightly I was sure the blood had already started pooling underneath my skin. You and your friend switched positions as I begin to fade out. My body does not want this, it starts to protest as you moan about how tight I am. I don’t care. My body and mind is separate, I am disassociating again. I want to be used. Fuck my guts out, let the pain spread. Your friend is gentler, at least he holds me and he touches me as softly as he can when you leave. That doesn’t mean shit because bruises will still bloom, my heartache will become a deep dark void, and I will no longer have any brakes on this ricocheting, self-destructive train I am on. The last time I saw you was when you torched the forest of my mind. You haunted the obsessive compulsive thoughts that raced like a whirlpool in my head. Vivid flashbacks of your body and your face and how you felt set me on fire, so that I didn’t know what was normal and what wasn’t anymore. Yesterday my psychologist sent me to the hospital. I found myself screaming and crying from these broken worlds colliding. Why am I here again? ", "title": "The Hospital", "sentences": [{"f928": "The Hospital"}, {"98c2": "We collect experiences like scars on our bodies. When I was admitted to the psychiatric ward yesterday, I thought of how the smell of antiseptic, the groans of the sick and dying, and the anxiety coursing through my veins were going to be spectres haunting the corners of my mind a cold mundane morning five years from now. It was inevitable, really, how our bodies remember pain, suffering and fear — how raging rivers of anxiety will come to permanently alter the geographies of our minds. We won’t know how something will shape our worldview until years after the fact, and it hits you like a truck on the interstate and you can’t breathe from the sheer velocity of the memory. Was it pain? Or was it a crushing sense of emptiness?"}, {"dbfc": "The nurse put up the safety rails on the hospital bed so that I could not leave. The constant beeping of the machines made me want t0 hurt myself to forget the sound. I counted slowly from 10 to calm myself, but the black hole of my anxiety was too powerful; numbers and whispers and rocking back and forth were weak flickers of a dying lighter in the darkness of my mind. I wanted to escape. My heart pounded and I was slowly but surely driving myself insane as my thoughts began obsessively spiralling downwards into despair. I felt trapped, an animal they caught because I forgot to wear my plastic mask of a smile that day, last week, and last month. But I wanted to don my mask, I didn't mean to forget, I will wear it now if you will let me go. Please just not this again. I swear to god, I will wear a smile on my face. My eyes dart about like a maniac, my breaths caught in the rawness of my throat. I want a cigarette, I need a smoke. Why are they still here? Why am I still here."}, {"fe82": "They won’t let me go. I began scratching myself to distract me from the bodies being wheeled around, from the quiet mutterings and moans of the corpses lying in blanched white sheets opposite me. The nurse tagged my wrist, the plastic rubbing against the soft spot in my inner wrist. She patted my shoulder almost as an afterthought. Female, Chinese, DOB 1993. Foggy, foggy. Words with no meaning. What was that again. Rapid orders cutting through the cold insisting sounds of the machines: “Bipolar”, “Young female”, “Depression”, “Suicidal”, “Observation”… They talk too much. Too many words. Tumbling, rolling about like forgotten clothes in a dryer. These sounds, they fail to penetrate the fog in my mind. I am only conscious of my hyperventilating breaths, my desperation clawing at my gut. I want to go. Why am I still here."}, {"3cb5": "I noticed a black fly. It was flying about, a mundane black spot against the blinding white of the hospital wall. If I could be a fly on the wall. It landed on my right toe. I am mesmerized. I don’t move, letting the fly crawl over my feet. A cold dead body. I am suddenly aware of my screaming and clawing as the fly bounces about and decides whether or not to stay on my feet. When did my voice come back? Cold and dead, I hope you like my feet Mr. Fly. The blinding white light burns my retinas. It is the last thought drifting through my mind when the lorazepam enters my veins, a cold icy blue against the bleached ceiling."}, {"e016": "Each time you lay down with someone, you collect them — the geography of their minds, the map of their personal histories. You never enter these landscapes; they are private property, trespassing will get you shot. You remember how it feels to be invaded, so you never wish that on anybody. Like this, we exist in tandem, parallel universes never touching. But what happens when a violent transgression is made? How can I protect a already fragile, dying forest when it is in your nature to torch everything with wild abandon?"}, {"f23b": "The first time I saw you, you were nervous; sweaty hands, fingerprints on wine glasses. It was nearing midnight and we sat in the garden near the woods, mosquitoes sucking my blood. The moon was bright, a glowing orb bathing the soft candlelit patio. It was your second bottle of wine, I was late because this date wasn’t planned, you insisted I show up because you were “already here”. I frown, I don’t like red wine, never have. I ask for white when the wonderful waitress comes by to greet me. I didn’t like how thick your fingers were, or your breath. But I liked your mind sufficiently to kiss you when you leaned in. I was tentative, slow, uncertain, my lips always unsure. The next day I found five bruises claiming the pale skin on my thighs, from when you tried to fuck me in the woods. Your anger was palpable when I said no, my mind still reeling from my attack a month ago. Did you not understand that I am still trying to come back into my own body, that I am only a ghost in the shell? When I pushed you off you got mad, and asked me to leave. I was about to go anyway, I was so drunk I thought there were stars when there were none."}, {"f8dd": "The second time I saw you we were at the same bar. You ordered some cheese this time, but I was too tired to eat. I wore jeans and a white shirt, I didn’t want to be bitten again — the mosquitoes there were savage. Living in the tropics sucks for this exact reason. Its the only thing that will drive me away from this island. The mosquitoes and the humidity. I absentmindedly down five glasses of wine as you go on about your mundane ideas, about loving me, about god, about your professional football career. The wine glass is cold in the humid night, condensing quickly so the water drips onto my jeans. I don’t bother moving my leg and slowly a damp spot forms on my knee. I tune out your constant tirade of words; I don’t care but I want to. I am in constant ambivalence, oscillating between liking you and wanting to leave. Eventually I leave when you get jealous — the waiter had hugged me too long and his gaze had lingered for a second too late. I hate you but I want you to want me. I get into a cab and I think how desperate I am for another living being. Am I so alone that I will settle for your anger and pain? We are just bags of guts anyway. On the cab back to my apartment I remember the look on your face when you noticed the purple marks on my neck, the sharp words from your throat cutting through my Xanax-fueled daze — you been fucking around with how many other men?"}, {"ec26": "The third time I saw you we went to the bar your friends owned, it was near my apartment so I said yes, even if it was an hour to midnight and I was tired. I am always tired anyway. The night was fueled by a tirade of foreign words, chainsmoked cigarettes, endless bottles of wine, and useless conversations. I remember you chatting other women up. I was a little hurt you disrespected me like that, but I let you be, because who am I to you anyway. I was just a girl you were going to fuck and forget. As the night went on your best friend started touching my hair shyly, he laughs and checks my reaction — he wants to get to know me. What is there to know about me. I almost laugh. I am so empty I can feel the spaces in between. There is nothing left, I want to tell him. There is nothing to know. An hour later you grab me and your best friend and we get into a cab to your place. Your friend wants to leave, but I want him to stay. I craved his touch, it was soft and knowing and familiar. Six lines of powder. Your anger paints the room red again. What is wrong with you. You talk too much. Stop talking. What the fuck is wrong with you. Your best friend nervously tells you to chill, and the next thing I know I am naked and under you."}, {"d742": "You fucked me rough, stubbing cigarettes out on the softness on the inside of my arm. The pain barely registers. I turn my face away when you lean down to kiss me, your fingers gripping the inside of my wrists so tightly I was sure the blood had already started pooling underneath my skin. You and your friend switched positions as I begin to fade out. My body does not want this, it starts to protest as you moan about how tight I am. I don’t care. My body and mind is separate, I am disassociating again. I want to be used. Fuck my guts out, let the pain spread. Your friend is gentler, at least he holds me and he touches me as softly as he can when you leave. That doesn’t mean shit because bruises will still bloom, my heartache will become a deep dark void, and I will no longer have any brakes on this ricocheting, self-destructive train I am on."}, {"883e": "The last time I saw you was when you torched the forest of my mind. You haunted the obsessive compulsive thoughts that raced like a whirlpool in my head. Vivid flashbacks of your body and your face and how you felt set me on fire, so that I didn’t know what was normal and what wasn’t anymore. Yesterday my psychologist sent me to the hospital. I found myself screaming and crying from these broken worlds colliding. Why am I here again?"}], "child": "223_1\t223_2223_1\t223_2223_1\t223_2"}