{"name": "224", "parent": "", "content": "An unexpected Conundrum The first date on the internet — 4 The part 4 starts after part 3’s ending here. ‘Don’t you get tired?’ she asked as I got up again and kissed all over her body. ‘Not with you.’ I smiled as I looked at her face. It was glowing with all the lovemaking in the night. ‘I’m infatuated with you,’ she said. ‘I’m too Rhea.’ ‘But only for this night, Ok,’ she said with a naughty smile on her face and immediately rolled back. I tried to reach her but she was too quick. She was out of the bed, standing beside it, with a corner of the duvet stretched in front of her. A smile spread across my face. She realized it a second or two later the other corner still remained in my hand. Her eyes widened in anticipation and before she could plead, I gave a quick jerk to the bed sheet and saw her body as she squirmed like a squirrel in the rain and ran into the kitchen. We made love again. ‘You should go now,’ she crooned in my ear as we lay on the mattress on the floor, ‘it’s getting late. You’ll miss your flight. I checked my watch. It was nearing five. I had to leave. After kissing her for the umpteenth time, I got into the cab. Tired and sleep deprived, I ended up sleeping the whole time in the cab. In airport too before boarding. And even in the two-hour flight from Bangalore to Delhi. By the time I reached my flat, I had more or less made up for the lack of the sleep. As I walked past the mirror, I realized I had a permanent smile pasted across my face. Part II ‘I’m in no mood to talk right now,’ she said with a finality in her voice. It had been three months since I first met Rhea in Bangalore. Everything was going fine initially, in the first month. We were perfect. In fact, we could not get enough of each other. We were spending more and more time talking on the phone or chatting on skype. The Bangalore meeting with the client had gone well and I was shuttling between Delhi and Bangalore for as many as two times every week. Stars couldn’t have got aligned any better. But then after the first-month things started changing. She would hang up the phone after talking only for a few minutes. Her replies to my messages became fewer, sparser. Even when I met her, there was something missing. That smile, even though she tried hard to wear it on her face, she lacked that naturalness which I saw when I met her for the first time. Especially in the last one month or so, something had started bothering her. It was not us, I knew it in my heart. Something external was eating her away. Something was pushing her away from me. And she wasn’t telling me that. ‘Are you sure,’ I asked her, the sound of her labored breath wearing me down. When she didn’t reply, I hung up. It took me one more week and a visit at The Permit Room — the place where we first drank together, to know what was bothering Rhea. It wasn’t easy readying her to join me though. She had a headache, she first told me. Then she said she wanted to spend time at home. But I resisted and made her leave the house for an hour. It paid off when the old memories of our first meeting, that wild dancing episode and the walk on the night streets of Bangalore, rushed to her like the plush rain of the monsoon season and in the glow of those memories, she spilled out everything with the earnestness of a six-year-old child. ‘That bastard thinks he still owes me,’ Rhea was talking about Varun, her ex who was now back to India. ‘How dare he messaged me?’ she was shouting now, a few heads turned towards us as I shushed her. ‘Why don’t you block him?’ I asked as she regained her composure. ‘No,’ she said thumping her hand on the table, ‘I don’t want him to believe that he has any affect on me. Blocking him will make him happy. I don’t want that dog to be happy ever in his life. I don’t care for him. He doesn’t affect me’ I looked at her face. He clearly had an affect on her. She was in awe of him. She still cared whether he messaged her or not. She cared about what he think about her. What he said, how he said. In that moment a wave of mixed emotions washed over me. At once I was pitying this little girl in front of me who had her heart broken by a guy she clearly loved a lot and now instead of moving on, she was trying to mend the broken relationship. Holding on to the jagged pieces. Then I was hating this angry part of her. This hatred for revenge that was boiling insider her, this other person which I hadn’t known until this moment. But most of all, I was falling even more desperately in love with this part of her which was broken, but still was confiding in me, trusting me, not afraid of showing her bruises to me. This part who wanted to love me, for sure, only if this past allowed her, which clung to her like a leech, like a parasite. She needed to get rid of that, at any cost. I stood up from where I was sitting, and sat beside her. ‘You love me Rhea?’ I asked her as I curled my hand around her. I could feel her nodding her head. ‘Then you need to trust me.’ To be continued Every recommend from you takes this story to at least one more reader like you. :) ", "title": "An unexpected Conundrum", "sentences": [{"56a6": "An unexpected Conundrum"}, {"25ec": "The first date on the internet — 4"}, {"acbb": "The part 4 starts after part 3’s ending here."}, {"71ab": "‘Don’t you get tired?’ she asked as I got up again and kissed all over her body. ‘Not with you.’ I smiled as I looked at her face. It was glowing with all the lovemaking in the night."}, {"87df": "‘I’m infatuated with you,’ she said."}, {"e99c": "‘I’m too Rhea.’"}, {"3e4b": "‘But only for this night, Ok,’ she said with a naughty smile on her face and immediately rolled back."}, {"d5a6": "I tried to reach her but she was too quick. She was out of the bed, standing beside it, with a corner of the duvet stretched in front of her. A smile spread across my face. She realized it a second or two later the other corner still remained in my hand. Her eyes widened in anticipation and before she could plead, I gave a quick jerk to the bed sheet and saw her body as she squirmed like a squirrel in the rain and ran into the kitchen."}, {"1bb9": "We made love again."}, {"d025": "‘You should go now,’ she crooned in my ear as we lay on the mattress on the floor, ‘it’s getting late. You’ll miss your flight."}, {"ce9b": "I checked my watch. It was nearing five. I had to leave."}, {"ce4b": "After kissing her for the umpteenth time, I got into the cab. Tired and sleep deprived, I ended up sleeping the whole time in the cab. In airport too before boarding. And even in the two-hour flight from Bangalore to Delhi."}, {"77e5": "By the time I reached my flat, I had more or less made up for the lack of the sleep."}, {"4ac8": "As I walked past the mirror, I realized I had a permanent smile pasted across my face."}, {"009c": "Part II"}, {"df98": "‘I’m in no mood to talk right now,’ she said with a finality in her voice."}, {"62a3": "It had been three months since I first met Rhea in Bangalore. Everything was going fine initially, in the first month. We were perfect. In fact, we could not get enough of each other. We were spending more and more time talking on the phone or chatting on skype. The Bangalore meeting with the client had gone well and I was shuttling between Delhi and Bangalore for as many as two times every week. Stars couldn’t have got aligned any better."}, {"c53b": "But then after the first-month things started changing. She would hang up the phone after talking only for a few minutes. Her replies to my messages became fewer, sparser. Even when I met her, there was something missing. That smile, even though she tried hard to wear it on her face, she lacked that naturalness which I saw when I met her for the first time."}, {"618a": "Especially in the last one month or so, something had started bothering her. It was not us, I knew it in my heart. Something external was eating her away."}, {"e315": "Something was pushing her away from me. And she wasn’t telling me that."}, {"b5d8": "‘Are you sure,’ I asked her, the sound of her labored breath wearing me down."}, {"376b": "When she didn’t reply, I hung up."}, {"b8d4": "It took me one more week and a visit at The Permit Room — the place where we first drank together, to know what was bothering Rhea. It wasn’t easy readying her to join me though. She had a headache, she first told me. Then she said she wanted to spend time at home. But I resisted and made her leave the house for an hour."}, {"a82e": "It paid off when the old memories of our first meeting, that wild dancing episode and the walk on the night streets of Bangalore, rushed to her like the plush rain of the monsoon season and in the glow of those memories, she spilled out everything with the earnestness of a six-year-old child."}, {"4755": "‘That bastard thinks he still owes me,’ Rhea was talking about Varun, her ex who was now back to India. ‘How dare he messaged me?’ she was shouting now, a few heads turned towards us as I shushed her."}, {"5eb2": "‘Why don’t you block him?’ I asked as she regained her composure."}, {"6120": "‘No,’ she said thumping her hand on the table, ‘I don’t want him to believe that he has any affect on me. Blocking him will make him happy. I don’t want that dog to be happy ever in his life. I don’t care for him. He doesn’t affect me’"}, {"c959": "I looked at her face. He clearly had an affect on her. She was in awe of him. She still cared whether he messaged her or not. She cared about what he think about her. What he said, how he said. In that moment a wave of mixed emotions washed over me."}, {"9a5f": "At once I was pitying this little girl in front of me who had her heart broken by a guy she clearly loved a lot and now instead of moving on, she was trying to mend the broken relationship. Holding on to the jagged pieces. Then I was hating this angry part of her. This hatred for revenge that was boiling insider her, this other person which I hadn’t known until this moment. But most of all, I was falling even more desperately in love with this part of her which was broken, but still was confiding in me, trusting me, not afraid of showing her bruises to me. This part who wanted to love me, for sure, only if this past allowed her, which clung to her like a leech, like a parasite. She needed to get rid of that, at any cost."}, {"c100": "I stood up from where I was sitting, and sat beside her."}, {"2318": "‘You love me Rhea?’ I asked her as I curled my hand around her. I could feel her nodding her head."}, {"5c49": "‘Then you need to trust me.’"}, {"857b": "To be continued"}, {"9f93": "Every recommend from you takes this story to at least one more reader like you. :)"}], "child": "224_1224_1224_1224_1224_1224_1"}