{"sentences": [{"ca2e": "The ingenious addiction of Stardew Valley"}, {"9498": "I won’t lie, I wasn’t very sold on Stardew Valley’s concept when I first heard about it. I had not played Harvest Moon — the game Stardew Valley is an ode to — and a farming simulator with no apparent final objective didn’t scream ‘BUY!’ for me. I still bought it on a leap of faith; fast forward 30 hours, sleepless nights, and lots of fishing, it’s fair to say that I’m hooked."}, {"683d": "The core idea of Stardew Valley is simple and refreshing. You inherit a farm from your grandfather, a dilapidated plot of land in a sleepy hamlet called Pelican Town. You then have to go on a therapeutic adventure, making friends and planting parsnips along the way. And after ambling through many in-game seasons in stupefied wonder, I started to analyze and admire the smart game design choices on show."}, {"d387": "Here are some design executions that make Stardew Valley so addictive:"}, {"674f": "Game Flow"}, {"4db5": "Have you ever thought of playing a game (or doing any activity, really) for 15 minutes, only to emerge three hours later, shielding your eyes from sunlight, looking for sustenance, and wondering where all the time had gone? If you have, it’s most likely because you were caught in the throes of game flow."}, {"6010": "In the 1970s, a psychologist named Mihaly Csikszentmihalyi christened a concept called flow (or cognitive flow) which evaluated emotional states of engagement depending upon the difficulty of completing a task and the skill level possessed while completing it. When the skill possessed is low but the task is hard, people become anxious. When the task is easy but the skill level possessed is high, people become bored. In the middle of these two undesirable states is the promised land of flow, characterized by a loss of awareness and complete focus on the task at hand."}, {"9183": "Cognitive flow"}, {"05b5": "Almost every activity in Stardew Valley falls within the zone of flow. Let’s take fishing as an example. After casting your fishing line and waiting for a hit, you enter into a battle of practice and reflexes, trying to keep the ‘green box’ inside the icon of the fish."}, {"4ade": "Fishing"}, {"c358": "In case it isn’t clear from the GIF, this task is far from easy, especially when you’re just starting out. The fish icon flails, jerks, and flies across the screen, making you hurl abuse over essentially failing at a mini-game that even toddlers can understand."}, {"c1ff": "But even after losing a battle, you keep coming back and getting better at it, because it follows the four tenets of game flow:"}, {"d8ae": "Feedback from fishing"}, {"5b71": "4. Diminished extraneous distraction: Once you get a hit, all distractions are off. The rod shows up on the center of your screen, and the game beseeches you to focus all your attention on it. You can’t do anything else until this interaction is over. Until the next interaction, and the hundreds after that."}, {"f9a3": "Take any activity in Stardew Valley, and you’ll probably see these elements of game flow executed excellently. Mining, combat, and even comparatively tedious chores like foraging and watering crops all have the potential to be endlessly immersive."}, {"6472": "Cycles of engagement"}, {"630f": "Do you remember when Facebook was relatively new and you actually visited your email inbox more than social media? Do you remember getting mails from Facebook saying ‘Someone commented on your post!’ and clicking the life out of them, being redirected to Facebook even though you had stuff to do? You just couldn’t handle the suspense and temptation. ‘Someone’ commented on my post? I need to find out who! This is textbook execution of a repeated cycle of engagement."}, {"9ebe": "Not that kind of cycle of engagement…"}, {"b101": "Cycles of engagement are basically how well one isolated interaction of a player with a game feeds into the next isolated interaction. Does playing a game make you want to play it more? Does the game embed incentives into its design to make players want to play it more? For Stardew Valley, the answer to both these questions is a resounding yes."}, {"2d93": "One of the smartest things Eric Barone (sole creator of Stardew Valley) did with the game was divide the playtime into 20 minute in-game days. The game saves at the end of each day, effectively ending a cycle of engagement unless the player wants to continue. The game also provides endless fishhooks to make players want to continue for ‘just one more day’."}, {"3611": "Okay, off to sleep and stop the gam… wait, I leveled up!"}, {"302d": "Let’s look at this through the lens of Fogg’s Behavioral Model. This model states that, for a behavior to occur, three things must be present:"}, {"28e1": "…your mailbox will contain occasional requests…"}, {"2fd4": "…and both basic crops and finished goods might be available for collection in the morning."}, {"769e": "I’ve lost count of the times that I thought ‘let me just water the crops and read the mail’ and ended up playing another in-game week. That’s because Stardew Valley is not a 50 hour game. It is a 20 minute game played 150 times over."}, {"abb9": "There’s so much more to say about Stardew Valley in terms of smart design decisions. Blocking fast travel until the end-game in order to challenge players’ time management skills, foregoing the ability to sprint for the same reason, the interplay between time and energy…I can go on. But in the interest of sanity, I will stop here and go milk some more cows."}, {"f800": "What other games do you think use game flow and cycles of engagement in their design? What other cool things does Stardew Valley do? Let me know in the comments!"}, {"ee42": "If you liked this post, please click that heart to show it. I appreciate it."}], "child": "2253_1\t2253_2\t2253_3\t2253_4\t2253_5\t2253_6\t2253_7\t2253_8\t2253_9\t2253_10\t2253_11\t2253_12\t2253_13\t2253_14\t2253_15\t2253_16\t2253_172253_1\t2253_2\t2253_3\t2253_4\t2253_5\t2253_6\t2253_7\t2253_8\t2253_9\t2253_10\t2253_11\t2253_12\t2253_13\t2253_14\t2253_15\t2253_16\t2253_172253_1\t2253_2\t2253_3\t2253_4\t2253_5\t2253_6\t2253_7\t2253_8\t2253_9\t2253_10\t2253_11\t2253_12\t2253_13\t2253_14\t2253_15\t2253_16\t2253_172253_1\t2253_2\t2253_3\t2253_4\t2253_5\t2253_6\t2253_7\t2253_8\t2253_9\t2253_10\t2253_11\t2253_12\t2253_13\t2253_14\t2253_15\t2253_16\t2253_17", "parent": "", "title": "The ingenious addiction of Stardew Valley", "content": "The ingenious addiction of Stardew Valley I won’t lie, I wasn’t very sold on Stardew Valley’s concept when I first heard about it. I had not played Harvest Moon — the game Stardew Valley is an ode to — and a farming simulator with no apparent final objective didn’t scream ‘BUY!’ for me. I still bought it on a leap of faith; fast forward 30 hours, sleepless nights, and lots of fishing, it’s fair to say that I’m hooked. The core idea of Stardew Valley is simple and refreshing. You inherit a farm from your grandfather, a dilapidated plot of land in a sleepy hamlet called Pelican Town. You then have to go on a therapeutic adventure, making friends and planting parsnips along the way. And after ambling through many in-game seasons in stupefied wonder, I started to analyze and admire the smart game design choices on show. Here are some design executions that make Stardew Valley so addictive: Game Flow Have you ever thought of playing a game (or doing any activity, really) for 15 minutes, only to emerge three hours later, shielding your eyes from sunlight, looking for sustenance, and wondering where all the time had gone? If you have, it’s most likely because you were caught in the throes of game flow. In the 1970s, a psychologist named Mihaly Csikszentmihalyi christened a concept called flow (or cognitive flow) which evaluated emotional states of engagement depending upon the difficulty of completing a task and the skill level possessed while completing it. When the skill possessed is low but the task is hard, people become anxious. When the task is easy but the skill level possessed is high, people become bored. In the middle of these two undesirable states is the promised land of flow, characterized by a loss of awareness and complete focus on the task at hand. Cognitive flow Almost every activity in Stardew Valley falls within the zone of flow. Let’s take fishing as an example. After casting your fishing line and waiting for a hit, you enter into a battle of practice and reflexes, trying to keep the ‘green box’ inside the icon of the fish. Fishing In case it isn’t clear from the GIF, this task is far from easy, especially when you’re just starting out. The fish icon flails, jerks, and flies across the screen, making you hurl abuse over essentially failing at a mini-game that even toddlers can understand. But even after losing a battle, you keep coming back and getting better at it, because it follows the four tenets of game flow: Feedback from fishing 4. Diminished extraneous distraction: Once you get a hit, all distractions are off. The rod shows up on the center of your screen, and the game beseeches you to focus all your attention on it. You can’t do anything else until this interaction is over. Until the next interaction, and the hundreds after that. Take any activity in Stardew Valley, and you’ll probably see these elements of game flow executed excellently. Mining, combat, and even comparatively tedious chores like foraging and watering crops all have the potential to be endlessly immersive. Cycles of engagement Do you remember when Facebook was relatively new and you actually visited your email inbox more than social media? Do you remember getting mails from Facebook saying ‘Someone commented on your post!’ and clicking the life out of them, being redirected to Facebook even though you had stuff to do? You just couldn’t handle the suspense and temptation. ‘Someone’ commented on my post? I need to find out who! This is textbook execution of a repeated cycle of engagement. Not that kind of cycle of engagement… Cycles of engagement are basically how well one isolated interaction of a player with a game feeds into the next isolated interaction. Does playing a game make you want to play it more? Does the game embed incentives into its design to make players want to play it more? For Stardew Valley, the answer to both these questions is a resounding yes. One of the smartest things Eric Barone (sole creator of Stardew Valley) did with the game was divide the playtime into 20 minute in-game days. The game saves at the end of each day, effectively ending a cycle of engagement unless the player wants to continue. The game also provides endless fishhooks to make players want to continue for ‘just one more day’. Okay, off to sleep and stop the gam… wait, I leveled up! Let’s look at this through the lens of Fogg’s Behavioral Model. This model states that, for a behavior to occur, three things must be present: …your mailbox will contain occasional requests… …and both basic crops and finished goods might be available for collection in the morning. I’ve lost count of the times that I thought ‘let me just water the crops and read the mail’ and ended up playing another in-game week. That’s because Stardew Valley is not a 50 hour game. It is a 20 minute game played 150 times over. There’s so much more to say about Stardew Valley in terms of smart design decisions. Blocking fast travel until the end-game in order to challenge players’ time management skills, foregoing the ability to sprint for the same reason, the interplay between time and energy…I can go on. But in the interest of sanity, I will stop here and go milk some more cows. What other games do you think use game flow and cycles of engagement in their design? What other cool things does Stardew Valley do? Let me know in the comments! If you liked this post, please click that heart to show it. I appreciate it. ", "name": "2253"}