{"sentences": [{"d64d": "We Went To Arby’s To Try Venison"}, {"bb47": "by Madison Murray and Libby Torres"}, {"55fe": "The lighting is weirdly tasteful?"}, {"b9dc": "On March 4th, 2017, Arby’s brought its infamous venison sandwich to NYC. The sandwich is usually limited to areas that see a heavy amount of deer hunting, even though the meat is from “free-range farmed deer that feed on fresh grass from New Zealand,” according to an Arby’s spokesperson. Skeptical."}, {"dd3f": "Obviously this is kind of the low brow stunt journalism we at Local thrive on. But we’re busy college students, and are NOT about to wait in a line for some deer meat when we also have a midterm the next day."}, {"6731": "Cut to April 5th, we figure the hype has died down and there should be no problem. Two of our intrepid reporters, Madison Murray and Libby Torres, made the trek to the Murray Hill Arby’s (which is maybe the worst string of words to ever exist)."}, {"33d8": "They decided to dress up a bit so they could attempt to mimic those “sexy” Kate Upton ads where she and her breasts are sensually posing with various fast foods. When told that those ads were for Hardee’s and Carl’s Jr, they responded, “we do not care.”"}, {"2eb4": "Below are some of their musings on the experience. We hope you enjoy, and don’t make the same mistakes they did."}, {"231c": "Madison: On my way out of my dorm to meet Libby, I ran into my boyfriend. “You look really nice, where are you going?” he asked, to which I quickly replied “Arby’s,” and stepped into the elevator."}, {"bad3": "Libby: Our walk to Arby’s was relatively uneventful. Madison and I talked boys, housing, and our mutual distrust of wild game meat on the way there. Once we arrived, we were impressed by the tasteful decor and soft lighting in the 23rd street Arby’s."}, {"1218": "Madison: We walked by a small palm reading business. As we glanced into the window, a woman motioned her hand towards us in an attempt to draw us inside. We continued to walk. Looking back, this was almost definitely an omen warning us to turn back.Nearing our destination, we also spotted a toothbrush on the ground, which we could have easily brushed our teeth with instead of going to Arby’s for essentially the same experience."}, {"f64c": "Libby: We made our way to the cashier, only to be blindsided by the fact that there was NO DEER MEAT WHATSOEVER on the menu. Not even a cute little sign advertising it as a special. Thinking that perhaps this was a super-secret menu item that one had to ask for specifically, we approached the cashier nervously."}, {"a35b": "“Do you guys still have the venison sandwich?” I asked, trying to seem casual. She shook her head solemnly, and our world crumbled. No venison sandwich? What were we gonna do?"}, {"f798": "Ed Note: How sad do you have to be to get 2 for $6 gyros at Arby’s?"}, {"7b37": "Madison: I got the kid’s Roast Beef ‘N Cheese Slider with a Capri Sun and a side of applesauce (only $4.36!). The main component of the slider felt and tasted like paper meat, but it was very small so I did not suffer long."}, {"4050": "Libby: Madison, who was on a budget, ordered the kids meal, complete with a roast beef slider. I wanted to hate-eat my weight in beef, so I ordered the Smokehouse brisket sandwich. The pictures on the menu promised delicious, aesthetically appealing sandwiches brimming with meat. What we got definitely did not live up to the menu-hype."}, {"36ef": "Madison: Contrary to what Libby claims, I was not on such a tight budget that I could not afford Arby’s. I chose to order the kid’s meal because I decided I did not want to put my body under the stress of digesting an industrial amount of meats if it was not the deer meat we came for."}, {"2245": "Our visit to the 23rd St. Arby’s was short, but fulfilling. As we walked back towards the East Village, we discussed detox methods to rid our bodies of the garbage we had just ingested. Libby wondered out loud how serious an “Arby’s-poop” would prove to be. We laughed at our self-inflicted misfortunes. We stopped in front of my dorm, hugged, and went our separate ways."}, {"95d2": "There you have it, NYU Local did not get its hands on the famous Arby’s venison sandwich. But maybe the real venison sandwich is the friends we made along the way…"}], "child": "2254_12254_1", "parent": "", "title": "We Went To Arby’s To Try Venison", "content": "We Went To Arby’s To Try Venison by Madison Murray and Libby Torres The lighting is weirdly tasteful? On March 4th, 2017, Arby’s brought its infamous venison sandwich to NYC. The sandwich is usually limited to areas that see a heavy amount of deer hunting, even though the meat is from “free-range farmed deer that feed on fresh grass from New Zealand,” according to an Arby’s spokesperson. Skeptical. Obviously this is kind of the low brow stunt journalism we at Local thrive on. But we’re busy college students, and are NOT about to wait in a line for some deer meat when we also have a midterm the next day. Cut to April 5th, we figure the hype has died down and there should be no problem. Two of our intrepid reporters, Madison Murray and Libby Torres, made the trek to the Murray Hill Arby’s (which is maybe the worst string of words to ever exist). They decided to dress up a bit so they could attempt to mimic those “sexy” Kate Upton ads where she and her breasts are sensually posing with various fast foods. When told that those ads were for Hardee’s and Carl’s Jr, they responded, “we do not care.” Below are some of their musings on the experience. We hope you enjoy, and don’t make the same mistakes they did. Madison: On my way out of my dorm to meet Libby, I ran into my boyfriend. “You look really nice, where are you going?” he asked, to which I quickly replied “Arby’s,” and stepped into the elevator. Libby: Our walk to Arby’s was relatively uneventful. Madison and I talked boys, housing, and our mutual distrust of wild game meat on the way there. Once we arrived, we were impressed by the tasteful decor and soft lighting in the 23rd street Arby’s. Madison: We walked by a small palm reading business. As we glanced into the window, a woman motioned her hand towards us in an attempt to draw us inside. We continued to walk. Looking back, this was almost definitely an omen warning us to turn back.Nearing our destination, we also spotted a toothbrush on the ground, which we could have easily brushed our teeth with instead of going to Arby’s for essentially the same experience. Libby: We made our way to the cashier, only to be blindsided by the fact that there was NO DEER MEAT WHATSOEVER on the menu. Not even a cute little sign advertising it as a special. Thinking that perhaps this was a super-secret menu item that one had to ask for specifically, we approached the cashier nervously. “Do you guys still have the venison sandwich?” I asked, trying to seem casual. She shook her head solemnly, and our world crumbled. No venison sandwich? What were we gonna do? Ed Note: How sad do you have to be to get 2 for $6 gyros at Arby’s? Madison: I got the kid’s Roast Beef ‘N Cheese Slider with a Capri Sun and a side of applesauce (only $4.36!). The main component of the slider felt and tasted like paper meat, but it was very small so I did not suffer long. Libby: Madison, who was on a budget, ordered the kids meal, complete with a roast beef slider. I wanted to hate-eat my weight in beef, so I ordered the Smokehouse brisket sandwich. The pictures on the menu promised delicious, aesthetically appealing sandwiches brimming with meat. What we got definitely did not live up to the menu-hype. Madison: Contrary to what Libby claims, I was not on such a tight budget that I could not afford Arby’s. I chose to order the kid’s meal because I decided I did not want to put my body under the stress of digesting an industrial amount of meats if it was not the deer meat we came for. Our visit to the 23rd St. Arby’s was short, but fulfilling. As we walked back towards the East Village, we discussed detox methods to rid our bodies of the garbage we had just ingested. Libby wondered out loud how serious an “Arby’s-poop” would prove to be. We laughed at our self-inflicted misfortunes. We stopped in front of my dorm, hugged, and went our separate ways. There you have it, NYU Local did not get its hands on the famous Arby’s venison sandwich. But maybe the real venison sandwich is the friends we made along the way… ", "name": "2254"}