{"name": "226", "parent": "", "content": "A long silence and an inevitable kiss The first date on the Internet — 3 She had difficulty walking straight. After drinking two rounds of cocktails and dancing non-stop on the dance floor, she was visibly flushed, drained off. Two paces ahead of me, one of her hand on her forehead, her senses half numbed, she was walking unsteadily, barely able to keep straight, her legs moving forward gingerly, tracing a zig-zag path on the road. ‘We better sit for some time,’ I said as I took two long strides and caught up with her. She slowed down a little, adjusted the sling of her bag on the shoulder, turned her face towards me, and smiled. In the white light of the half eaten moon, her face lit up and I felt a sudden shock of realization within me. She is the one. And almost on instinct, my hand reached forward and slipped fingers into hers with an ease with which a hot knife cuts the butter. ‘You can’t take advantage of me,’ she giggled and ran forward releasing herself from my grip, ‘I’m not that high.’ I stopped, jammed my hands in the jeans pockets and made a serious face. ‘I will not even try,’ I claimed, a warm tinkling sensation of embarrassment dawning in my cheeks . She laughed out loud, the sound echoed in the empty street. ‘You are so cute,’ she teased me and stopped for me to catch up. The next moment she was walking beside me, her shoulder brushing with mine. ‘When is your flight in the morning?’ she asked as she slipped her hands around my arm. ‘Seven in the morning,’ I replied, cursing myself for not booking the evening flight instead. For a long time she didn’t say anything. We just walked beside each other like a couple with all the time in the world. After it felt like an eternity, she took out her mobile and booked a cab for herself. As we waited for the cab I made short conversation about her career, the work in her office and what she would be doing on the coming weekend. She replied all of the questions with short one liner answers. As I was telling her about the upcoming presentation, bright light poured from the road ahead and bathed our bodies in shimmering yellow. I squinted and saw two beams of light approaching us. It was her cab. It was time to say goodbye. My heart almost ached anticipating a goodbye. ‘Why don’t you spend the night at my place,’ she said as the cab approached us. ‘I have an early morning meeting with my team in USA,’ she explained, ‘so I don’t think I would be catching any sleep. And what would you do till seven in the airport anyways.’ Her flat was on the second floor of a duplex on a posh street.As soon as we entered she started tidying up the hall. ‘Sorry, I know it’s a mess,’ she said as she put a sheet on a chair that was filled with her clothes. The house appeared modest, but spacious enough for a single person. At the far end of the hall, there was a door which probably led to her bedroom. On the left side, there was an entrance to the kitchen which gave way to a balcony. I went into the kitchen and helped myself to a glass of water. ‘It’s perfect,’ I said, ‘don’t worry about it. You should see my room.’ She kept on arranging the hall anyways before disappearing into the bedroom. I undid my shoes and plopped on the comfortable couch. I spotted the TV remote on the table, picked it up and pointed it at the TV hoping to catch some news. When the TV didn’t responded even after trying for many times, I replaced the remote thinking that probably the batteries had gone dead. It was then I felt the light around me dimming and black curtains of sleep falling over me. In the next moment, I was asleep. ‘Sleep here,’ she said as I followed her into the bedroom, protesting that I was not sleeping but was just thinking something with my eyes closed which she mistook for sleeping. ‘Yes, yes. I know, you were doing a thought experiment, Mr. Einstein,’ she said mockingly. ‘Now help me put this mattress on the floor.’ Caught red handed, I could do nothing but oblige. We put the mattress on the floor beside the bed and placed a sheet over it. She pulled out a pillow from the bed and placed it there along with a duvet. She offered to sleep on the floor. But I resisted and plopped down on the mattress before she could. That’s when she had gone out and I had started reading a book on my Kindle. A few minutes after I heard the sound of her footsteps approaching. I looked up and found her entering the room. She had changed into her night clothes. A purple T-Shirt and a white lower that snug tightly over her legs. She doused the main light and turned on the dim neon instead. In that redness, her face assumed a different character. A mature girl. Sensuous and exciting. It was hard not to look at her. Not very far, a record was playing Bach — Double Violin Concerto. I dug my eyes deep into the screen of the Kindle and tried in vain to concentrate on the book. She wasn’t sleeping, I could tell. Neither I could concentrate on the book. The dim light in the room, the cool night wind flowing in through the windows and the fact that I was deeply infatuated with this girl made my heart beat a little faster. I stole a glance at her side. She was lying on her back, her eyes wide open. Slowly, as if she was hearing my thoughts and wanted to listen more, she turned her head towards me. Then her whole body turned, until she was lying on her side. Her gaze soft but deep, looking something within me, beyond me. I couldn’t tell. My heart started beating violently against my chest. Pulse mad with the rush of the blood. Beads of perspiration melting on my forehead. On my back. On my whole body. A thousand creatures crawling. Then, as if by magic, everything became silent. Silent as death. The rustling of the wind outsides, the faint sound of someone playing Bach, the sound of night creatures — all that which were so clearly audible only a moment ago, dissolved into the night, disappeared, leaving behind only us, the two hearts, beating in rhythm, louder and louder, until their sound became deafening. Even the ever rushing time seemed to slow down, froze, in that room, in that gaze with which she weighed upon me, pushing me back, circling me, enveloping me, tightening its grip around me like a dangerous viper, dangerous, but yet, oh so beautiful, until I was enchanted, mesmerized, unable to stop myself no more, and became like that moth that looks at the flame and sees nothing, the whole world a darkness for him, but only that light, that flame, that burns his heart with the single desire of flying to that flame, feel its warmth turning into wild heat and then burn it. Burn and die and in-between, live a lifetime in that single moment. Then, as if we could take it no more, we both rushed forward and kissed each other, devouring each other’s body, consuming each other’s soul… To be continued.. Hi. If you are liking the series then please recommend to help it reach more readers like you. :) Part 4 is available here. You can reach the second part here ", "title": "A long silence and an inevitable kiss", "sentences": [{"5ca2": "A long silence and an inevitable kiss"}, {"3e00": "The first date on the Internet — 3"}, {"f986": "She had difficulty walking straight."}, {"9380": "After drinking two rounds of cocktails and dancing non-stop on the dance floor, she was visibly flushed, drained off. Two paces ahead of me, one of her hand on her forehead, her senses half numbed, she was walking unsteadily, barely able to keep straight, her legs moving forward gingerly, tracing a zig-zag path on the road."}, {"84b7": "‘We better sit for some time,’ I said as I took two long strides and caught up with her."}, {"0862": "She slowed down a little, adjusted the sling of her bag on the shoulder, turned her face towards me, and smiled. In the white light of the half eaten moon, her face lit up and I felt a sudden shock of realization within me. She is the one. And almost on instinct, my hand reached forward and slipped fingers into hers with an ease with which a hot knife cuts the butter."}, {"7a87": "‘You can’t take advantage of me,’ she giggled and ran forward releasing herself from my grip, ‘I’m not that high.’"}, {"0c86": "I stopped, jammed my hands in the jeans pockets and made a serious face. ‘I will not even try,’ I claimed, a warm tinkling sensation of embarrassment dawning in my cheeks . She laughed out loud, the sound echoed in the empty street. ‘You are so cute,’ she teased me and stopped for me to catch up."}, {"cc8f": "The next moment she was walking beside me, her shoulder brushing with mine."}, {"262e": "‘When is your flight in the morning?’ she asked as she slipped her hands around my arm. ‘Seven in the morning,’ I replied, cursing myself for not booking the evening flight instead. For a long time she didn’t say anything. We just walked beside each other like a couple with all the time in the world."}, {"5e41": "After it felt like an eternity, she took out her mobile and booked a cab for herself."}, {"f15e": "As we waited for the cab I made short conversation about her career, the work in her office and what she would be doing on the coming weekend. She replied all of the questions with short one liner answers. As I was telling her about the upcoming presentation, bright light poured from the road ahead and bathed our bodies in shimmering yellow."}, {"59ca": "I squinted and saw two beams of light approaching us. It was her cab. It was time to say goodbye. My heart almost ached anticipating a goodbye."}, {"f4c0": "‘Why don’t you spend the night at my place,’ she said as the cab approached us."}, {"42c5": "‘I have an early morning meeting with my team in USA,’ she explained, ‘so I don’t think I would be catching any sleep. And what would you do till seven in the airport anyways.’"}, {"826d": "Her flat was on the second floor of a duplex on a posh street.As soon as we entered she started tidying up the hall. ‘Sorry, I know it’s a mess,’ she said as she put a sheet on a chair that was filled with her clothes."}, {"6118": "The house appeared modest, but spacious enough for a single person. At the far end of the hall, there was a door which probably led to her bedroom. On the left side, there was an entrance to the kitchen which gave way to a balcony. I went into the kitchen and helped myself to a glass of water."}, {"aba6": "‘It’s perfect,’ I said, ‘don’t worry about it. You should see my room.’ She kept on arranging the hall anyways before disappearing into the bedroom."}, {"dce4": "I undid my shoes and plopped on the comfortable couch. I spotted the TV remote on the table, picked it up and pointed it at the TV hoping to catch some news. When the TV didn’t responded even after trying for many times, I replaced the remote thinking that probably the batteries had gone dead."}, {"e6cd": "It was then I felt the light around me dimming and black curtains of sleep falling over me. In the next moment, I was asleep."}, {"19a9": "‘Sleep here,’ she said as I followed her into the bedroom, protesting that I was not sleeping but was just thinking something with my eyes closed which she mistook for sleeping."}, {"ad20": "‘Yes, yes. I know, you were doing a thought experiment, Mr. Einstein,’ she said mockingly."}, {"6511": "‘Now help me put this mattress on the floor.’ Caught red handed, I could do nothing but oblige."}, {"3010": "We put the mattress on the floor beside the bed and placed a sheet over it. She pulled out a pillow from the bed and placed it there along with a duvet. She offered to sleep on the floor. But I resisted and plopped down on the mattress before she could. That’s when she had gone out and I had started reading a book on my Kindle."}, {"07fe": "A few minutes after I heard the sound of her footsteps approaching. I looked up and found her entering the room. She had changed into her night clothes. A purple T-Shirt and a white lower that snug tightly over her legs."}, {"35c1": "She doused the main light and turned on the dim neon instead. In that redness, her face assumed a different character. A mature girl. Sensuous and exciting. It was hard not to look at her. Not very far, a record was playing Bach — Double Violin Concerto. I dug my eyes deep into the screen of the Kindle and tried in vain to concentrate on the book."}, {"f80b": "She wasn’t sleeping, I could tell. Neither I could concentrate on the book. The dim light in the room, the cool night wind flowing in through the windows and the fact that I was deeply infatuated with this girl made my heart beat a little faster. I stole a glance at her side. She was lying on her back, her eyes wide open."}, {"f61f": "Slowly, as if she was hearing my thoughts and wanted to listen more, she turned her head towards me. Then her whole body turned, until she was lying on her side. Her gaze soft but deep, looking something within me, beyond me. I couldn’t tell. My heart started beating violently against my chest. Pulse mad with the rush of the blood. Beads of perspiration melting on my forehead. On my back. On my whole body. A thousand creatures crawling. Then, as if by magic, everything became silent. Silent as death. The rustling of the wind outsides, the faint sound of someone playing Bach, the sound of night creatures — all that which were so clearly audible only a moment ago, dissolved into the night, disappeared, leaving behind only us, the two hearts, beating in rhythm, louder and louder, until their sound became deafening. Even the ever rushing time seemed to slow down, froze, in that room, in that gaze with which she weighed upon me, pushing me back, circling me, enveloping me, tightening its grip around me like a dangerous viper, dangerous, but yet, oh so beautiful, until I was enchanted, mesmerized, unable to stop myself no more, and became like that moth that looks at the flame and sees nothing, the whole world a darkness for him, but only that light, that flame, that burns his heart with the single desire of flying to that flame, feel its warmth turning into wild heat and then burn it. Burn and die and in-between, live a lifetime in that single moment."}, {"0a8e": "Then, as if we could take it no more, we both rushed forward and kissed each other, devouring each other’s body, consuming each other’s soul…"}, {"7deb": "To be continued.."}, {"7811": "Hi. If you are liking the series then please recommend to help it reach more readers like you. :)"}, {"0a09": "Part 4 is available here."}, {"2505": "You can reach the second part here"}], "child": "226_1\t226_2\t226_3\t226_4\t226_5\t226_6226_1\t226_2\t226_3\t226_4\t226_5\t226_6226_1\t226_2\t226_3\t226_4\t226_5\t226_6226_1\t226_2\t226_3\t226_4\t226_5\t226_6226_1\t226_2\t226_3\t226_4\t226_5\t226_6226_1\t226_2\t226_3\t226_4\t226_5\t226_6"}