{"sentences": [{"5bd1": "Grocery Shopping the Lenny Letter Way: Yes, the Entire Haul Cost Less Than $75"}, {"2cab": "Earlier this week, I read the Lenny Letter’s “Shop Like Your Mom” shopping and meal plan, and decided to test it out to see if it was a realistic option for a person who liked cooking but didn’t want to spend too much time or money on food."}, {"ee06": "I was a little dubious that “Shop Like Your Mom” author Sally Sampson’s 28-item grocery list would come in at the estimated price of “between $50 and $75,” but you know what? I bought everything on the list and it only cost me $72.33."}, {"6ba7": "I’m starting to get very excited about this plan."}, {"7aa5": "So you know—I already had a lot of these items in my kitchen (cans of black beans, cloves of garlic, frozen peas) but I still bought one of everything on the list because I wanted to make sure that the estimated costs came out correct. Plus, it’s always good to have another can of black beans in the cupboard."}, {"d7f2": "Here are the other rules I am setting for myself:"}, {"2c9b": "I got to carry home a baguette, just like people in the movies!"}, {"4184": "I should also note that a tiny thing of sesame seeds costs $5.69, which is ridiculous, and those steel-cut oats cost $8.99, which is super ridiculous. Those two items took up 20 percent of my grocery bill."}, {"74be": "(Unless I am somehow converted to the life-changing magic of steel-cut oats during the course of next week, I am switching back to rolled oats as soon as this experiment is over.)"}, {"18f4": "More updates next week, when I start the actual cooking. Was anyone else surprised that I was able to buy all of these groceries for $72.33?"}], "child": "2260_1\t2260_2\t2260_3\t2260_4\t2260_5\t2260_6\t2260_7\t2260_8\t2260_9\t2260_10\t2260_11\t2260_12\t2260_13\t2260_14\t2260_15\t2260_16\t2260_17\t2260_18\t2260_19\t2260_20\t2260_21\t2260_22\t2260_23", "parent": "", "title": "Grocery Shopping the Lenny Letter Way: Yes, the Entire Haul Cost Less Than $75", "content": "Grocery Shopping the Lenny Letter Way: Yes, the Entire Haul Cost Less Than $75 Earlier this week, I read the Lenny Letter’s “Shop Like Your Mom” shopping and meal plan, and decided to test it out to see if it was a realistic option for a person who liked cooking but didn’t want to spend too much time or money on food. I was a little dubious that “Shop Like Your Mom” author Sally Sampson’s 28-item grocery list would come in at the estimated price of “between $50 and $75,” but you know what? I bought everything on the list and it only cost me $72.33. I’m starting to get very excited about this plan. So you know—I already had a lot of these items in my kitchen (cans of black beans, cloves of garlic, frozen peas) but I still bought one of everything on the list because I wanted to make sure that the estimated costs came out correct. Plus, it’s always good to have another can of black beans in the cupboard. Here are the other rules I am setting for myself: I got to carry home a baguette, just like people in the movies! I should also note that a tiny thing of sesame seeds costs $5.69, which is ridiculous, and those steel-cut oats cost $8.99, which is super ridiculous. Those two items took up 20 percent of my grocery bill. (Unless I am somehow converted to the life-changing magic of steel-cut oats during the course of next week, I am switching back to rolled oats as soon as this experiment is over.) More updates next week, when I start the actual cooking. Was anyone else surprised that I was able to buy all of these groceries for $72.33? ", "name": "2260"}