{"sentences": [{"bf7f": "A Season of Bread"}, {"cc24": "Saving myself one loaf at a time"}, {"2703": "It’s February, the month of gloom. The raw and wretched winter palace of the soul that eats your dearest wishes for breakfast and spits them out like black ice just before bed. My birthday is in February, as is Saint Valentine’s Day, but none of that helps. Birthdays are always a disappointment and Valentine’s Day just makes me think of massacres and Al Capone. There’s something in my chest. It’s sadness, maybe, or bronchitis. I’m not sure, but there it sits, day after day, like some cranky crouched creature, a burr on the inside. It demands my attention and slows me down."}, {"b2e9": "Much has been made of the therapeutic benefits of bread making. I’ve used the kitchen to quiet the demons—sweet tarts and custards, garlicky things roasting in the oven, steaming pots of whatnot on the stove. Once, I made a grand chocolate layered cake with a silky ganache late at night because it quite simply felt like the only way I might make it to sunrise. I survived and the cake was delicious, so I support kitchen therapy."}, {"f31c": "Bread, however, is largely uncharted territory for me. I know my way around the easy stuff — corn bread, lemon loaves and cranberry breads, blueberry-studded muffins and currant-flecked scones. It’s that magic equation of yeast, time, temperature, and muscle that intimidates me. Aside from the odd pizza crust, I am a babe in the woods of real bread."}, {"9c98": "February, with its attendant disturbance in the breast, seems like the perfect time to embark on this new therapy. With the ill wind howling white out the window, I rolled up my sleeves to see if I can solve that magic equation. See if it settles the madness."}, {"2eb1": "The Pullman Loaf and Sally Lunn Bread"}, {"02e9": "Brioche is my holy grail, as I imagine a beautiful, sweet, warm brioche could be the ticket to peace, happiness, and calm in the chest. Alas, those who know have told me that brioche is tricky and requires much work (best accomplished with the big snazzy mixer, which I don’t have and am not buying). For a minute, I thought the whole bread adventure was over before it started and I flailed around unhappily, like a toddler. Then I found a solution."}, {"d323": "The Pullman Loaf."}, {"8006": "Essentially a plain old white sandwich loaf, this was appealing because I had all the ingredients and it seemed easy. I used Chris Kimball’s recipe from The Yellow Farmhouse Cookbook, because I like this sentence:"}, {"0b22": "“Of course, you can simply bake this bread in any old bread pan if you don’t care much about the shape of the loaf, which is what I do.”"}, {"4828": "Key elements here — “simply”, “any old”, “don’t care much” and, from the expert, “which is what I do.” Chris knows his audience."}, {"aade": "This was a great place to start because — it worked! I felt moderately proud of myself because it required yeast and specific temps and time and kneading. I got my hands messy and got a little frustrated, but it was basically a stress-free experience. And, after a little work and a modicum of patience, I was rewarded with very pretty, warm loaves perfect for slicing and slathering with butter all afternoon."}, {"5f6e": "Warm, homemade bread should absolutely be a part of everyone’s therapy."}, {"71e1": "Emboldened, I next chose the Sally Lunn bread, largely because Deb from Smitten Kitchen did such a marvelous job marketing to me. She speaks my language (“lazy”, “weep gently with joy”) and Sally Lunn Bread comes with a story! I’ll let Deb tell you —"}, {"7eba": "Like any food story worth tucking into, the story of Sally Lunn Bread comes with drama over its origins — Was it originally made by Protestant refugees, who called them “soleil et lune” or sun and moon cakes? Was it named for Solange Luyon, a pastry cook in Bath, England who for decades sold these buns on the street? Was knowing how to bake it truly essential to being a successful housekeeper, as this 1884 book, suggests?"}, {"51ab": "I love stories, I am lazy, and I suspect that gentle, joyful weeping could be part of a successful therapeutic regimen. I’m all in."}, {"e9d0": "This bread was so easy, it felt like a cheat. There was yeast, temperature, and time. But there was no kneading, no mess, no fuss. It wasn’t much more trouble than a ‘quick’ bread, but yielded something like a poor-man’s brioche — a hint of egg, a hint of sweet, still warm and slathered with butter. A soft flutter in the chest that could smooth some edges ."}, {"8f5b": "There are too many people in my house and each has his or her own chest-sitter, provoking theatre and delusions of high-flown personal crisis in the midst of what is surely just run-of-the-mill February. There are too many chafing souls in this space."}, {"7027": "To have a thing, a focus, a place for my hands, a reason to watch the clock and, in the end, a product to show the wild-eyed group — see, I’ve been busy — this is the gift of bread making. It feels important, contributory, ancient and real. It’s creative and meditative, a ministration of sorts, leaving the kitchen warm and the air perfumed with civility."}, {"fda6": "The Rustic White Bread"}, {"eaa9": "This feels like a setback."}, {"a3b4": "I was hopeful. It seemed basic and foolproof, but also like “real” bread. It made two loaves, required more time and effort, and the pictures looked like a real baker was involved. Flour on the crust, slashes on the body, important-looking crumb."}, {"f90b": "I’m ‘white’ and I’ve probably been called ‘rustic’ behind my back. This thing was mine for the taking. The making was a pleasure and I felt, briefly, like I might not be rudderless. The kneading was sensuous and hypnotic and felt surprisingly good to my aching thumbs and wrists. The rising was triumphant and the uncooked loaves, with their professional looking slashes across the top, held much promise."}, {"b55b": "The results, however, are now possibly contributing to that tiny vibrating burr in my chest. The finished bread is decidedly mediocre. Kind of dry and heavy and not nearly as pretty as the pictures (is anything ever as pretty?). I substituted bread flour for all-purpose, so it’s probably my own fault (which feeds perfectly into my negative winter narrative). The loaves are now hiding in plastic bags in my kitchen, a seeming poor excuse for lost labor. French toast anyone?"}, {"d065": "I need a victory, as soon as possible. Something lush and gorgeous, something to massage that small crisis from the ribs and rearrange February into a string of worthy days. A decadent, crowning-glory bread."}, {"7917": "The thing about bread-making that elevates it above all else in the kitchen is that it’s alive. Literally bursting and popping with life. You can watch it as it rises, hear it if you bend near. You are, with your life-worn hands, shaping life into artful sustenance, as the earliest hands once did. Massaging tiny beasties into a sustaining thing. This sounds like what needs to happen in my middle, a cycle of creation and consumption to fuel something sane and reliable. Maybe this is why they call the middle ‘the breadbasket’ (though I suspect that’s a little lower, in the stomach, where the bread goes)."}, {"9521": "Challah"}, {"cc81": "I do worry that my motives aren’t noble. I’m all product over process. I love challah, I want challah, I want to have made challah. Do I actually want to make challah? I worry about the burden of expectation and the expectation of disappointment. But then, I worry."}, {"12b7": "Worry is where I begin with the challah, fresh on the heels of the rustic flop. I’m back to Deb at Smitten, as she was so kind to me with that lovely Sally Lunn. Her challah looks gorgeous (of course, marketing, when will I learn) and she doesn’t seem daunted, so I tentatively dive."}, {"6330": "The making of this bread was surprisingly manageable and satisfying. Though I came to it with mild panic, the process settled into a fairly simple, rhythmic activity that wove itself into the business of my day, seamlessly."}, {"ee1f": "It rose, three times, just the way I imagine it should, and smelled of real challah, even before baking. I clumsily braided it, and it forgave me. Once in the oven, if filled the house with such an aroma of good and happy Sunday mornings, that I felt all was well — or, at least, that all could be well. Maybe even would."}, {"2670": "Once out of the oven, I had my victory. My crowning glory bread. The one bread to save me. Aside from a bit too much darkening of the crust, it was luscious. One of the best things I’ve ever made, one of my proudest moments in the kitchen. Two plump, gorgeous loaves — a bread that made me one of those insufferable food posters on social media, a bread that caused me to exclaim, repeatedly, “This tastes like real challah!”"}, {"2489": "Someone told me that, according to Chinese medicine, trouble in the chest is related to grief. Any and all grief, all the way back to childhood. And, unfortunately, the daily bread grief that comes with the paper each morning. Global crisis grief. The grief that none of us escapes. In theory, if we identify and process each incident of grieving, the chest will clear. Easy as bread. Right?"}, {"513b": "I need to make one more. It’s tempting to stop, to end on the high challah note and find a new therapy. But I have days left in this wretched month and no better idea, so I’m going to make one more. I don’t expect to recreate the thrill of victory, I just hope to avoid failure. The burr is back and with it comes that familiar expectation of disappointment."}, {"2c8f": "Lost in my search for the last bread, the bring-it-home bread, I find myself standing in the bathroom at first light, gazing slack-jawed at a miracle sky. February gray shot through with forgotten color. Dawn in the house of too many people, in the brief moment of silence, edged in among the overlapping schedules of pent and agitated winter souls."}, {"2d5a": "It’s memory that I’m chasing, a desire to hold it in my hands and warm it in the oven and eat it. I’m 13, that terrible turning age. It’s a sweltering summer day and, somehow, I am alone with my mother. Just us two, all day — an almost-never thing in a big family. She is painting the outside windows and we struggle together with a comically massive ladder, heaving it around the corner of the house, laughing so hard the tears overtake us and the task threatens to slide into calamity. She is also making bread. Portuguese Sweet Bread, it was called, and it was my favorite."}, {"6aef": "In this memory, when the painting is done and the bread is ready, I eat too much of it and lay baking in the sun on a blanket in the backyard with my mother and a stack of magazines and I can almost feel the bread rising a little more in my overfull stomach. It is a delicious memory, a memory stuffed with sunshine and warmth, laughter and industry, my mother’s undivided attention and sweet warm bread."}, {"239b": "I realize that my memory may be flawed and I hesitate to ask my mother. Why would a middle-aged woman be painting the house and making bread, all on the same stifling hot day? It seems crazy, but perhaps it happened this way. Perhaps she was wrestling the thing in her own chest. Truth and memory have an uneasy relationship. The bread was real, I can still smell it."}, {"8b4c": "Portuguese Sweet Bread"}, {"4801": "Early in this bread project, I off-handedly mentioned this childhood bread to my husband. I told him that the memory reminded me of that Hawaiian grocery store bread and, lo and behold, that’s what it is — Wiki says so. Who knew? I haven’t had it since I was a kid, but I’m hoping a stroll down memory lane is just the thing."}, {"9144": "Using Emeril’s recipe (a thing I thought I’d never say), the process seems familiar and comforting. Just five loaves in, I realize this bread-making business could become an easy habit. Do most of the work in the morning, with my coffee — no more than a half hour of focus — and let the beasties do the rest throughout the day. It’s become a thing I do now, or a thing I can do, instead of a distant aspirational thing. I make bread."}, {"8ae2": "The process is almost ritual — measure, mix, knead, rise, punch, rise again, bake. The dough feels vaguely warm and alive in my hands and the rising is reliable. The result is, likewise, reliable — like a memory. Substantial, satisfying, a comfort. It’s, surprisingly, not that hard. It requires attention. It is rewarding. You will fail. You will thrill. The burr will not be eradicated. It can, however, be placated. Distraction is good."}, {"3723": "I realize that my bread project neglected the thornier corners of baking—the sourdoughs and the whole grains, the boules and the batards. I’m not ready for a ‘starter’, though that sort of sounds like where you begin. I am aware that I skew sweet, but it is February. These were my starter breads and, though I still want to own a brioche, I’m pretty proud of myself. That, combined with all the warm bread in my belly, has lightened the darkest month and calmed the crisis in the chest. I recommend it."}, {"338c": "Go make some bread. I’m going to paint the kitchen."}], "child": "2268_1\t2268_2\t2268_3\t2268_4\t2268_5\t2268_6\t2268_7\t2268_8\t2268_9\t2268_10\t2268_11\t2268_12\t2268_13\t2268_14\t2268_15\t2268_16\t2268_17\t2268_18\t2268_19\t2268_202268_1\t2268_2\t2268_3\t2268_4\t2268_5\t2268_6\t2268_7\t2268_8\t2268_9\t2268_10\t2268_11\t2268_12\t2268_13\t2268_14\t2268_15\t2268_16\t2268_17\t2268_18\t2268_19\t2268_202268_1\t2268_2\t2268_3\t2268_4\t2268_5\t2268_6\t2268_7\t2268_8\t2268_9\t2268_10\t2268_11\t2268_12\t2268_13\t2268_14\t2268_15\t2268_16\t2268_17\t2268_18\t2268_19\t2268_202268_1\t2268_2\t2268_3\t2268_4\t2268_5\t2268_6\t2268_7\t2268_8\t2268_9\t2268_10\t2268_11\t2268_12\t2268_13\t2268_14\t2268_15\t2268_16\t2268_17\t2268_18\t2268_19\t2268_20", "parent": "", "title": "A Season of Bread", "content": "A Season of Bread Saving myself one loaf at a time It’s February, the month of gloom. The raw and wretched winter palace of the soul that eats your dearest wishes for breakfast and spits them out like black ice just before bed. My birthday is in February, as is Saint Valentine’s Day, but none of that helps. Birthdays are always a disappointment and Valentine’s Day just makes me think of massacres and Al Capone. There’s something in my chest. It’s sadness, maybe, or bronchitis. I’m not sure, but there it sits, day after day, like some cranky crouched creature, a burr on the inside. It demands my attention and slows me down. Much has been made of the therapeutic benefits of bread making. I’ve used the kitchen to quiet the demons—sweet tarts and custards, garlicky things roasting in the oven, steaming pots of whatnot on the stove. Once, I made a grand chocolate layered cake with a silky ganache late at night because it quite simply felt like the only way I might make it to sunrise. I survived and the cake was delicious, so I support kitchen therapy. Bread, however, is largely uncharted territory for me. I know my way around the easy stuff — corn bread, lemon loaves and cranberry breads, blueberry-studded muffins and currant-flecked scones. It’s that magic equation of yeast, time, temperature, and muscle that intimidates me. Aside from the odd pizza crust, I am a babe in the woods of real bread. February, with its attendant disturbance in the breast, seems like the perfect time to embark on this new therapy. With the ill wind howling white out the window, I rolled up my sleeves to see if I can solve that magic equation. See if it settles the madness. The Pullman Loaf and Sally Lunn Bread Brioche is my holy grail, as I imagine a beautiful, sweet, warm brioche could be the ticket to peace, happiness, and calm in the chest. Alas, those who know have told me that brioche is tricky and requires much work (best accomplished with the big snazzy mixer, which I don’t have and am not buying). For a minute, I thought the whole bread adventure was over before it started and I flailed around unhappily, like a toddler. Then I found a solution. The Pullman Loaf. Essentially a plain old white sandwich loaf, this was appealing because I had all the ingredients and it seemed easy. I used Chris Kimball’s recipe from The Yellow Farmhouse Cookbook, because I like this sentence: “Of course, you can simply bake this bread in any old bread pan if you don’t care much about the shape of the loaf, which is what I do.” Key elements here — “simply”, “any old”, “don’t care much” and, from the expert, “which is what I do.” Chris knows his audience. This was a great place to start because — it worked! I felt moderately proud of myself because it required yeast and specific temps and time and kneading. I got my hands messy and got a little frustrated, but it was basically a stress-free experience. And, after a little work and a modicum of patience, I was rewarded with very pretty, warm loaves perfect for slicing and slathering with butter all afternoon. Warm, homemade bread should absolutely be a part of everyone’s therapy. Emboldened, I next chose the Sally Lunn bread, largely because Deb from Smitten Kitchen did such a marvelous job marketing to me. She speaks my language (“lazy”, “weep gently with joy”) and Sally Lunn Bread comes with a story! I’ll let Deb tell you — Like any food story worth tucking into, the story of Sally Lunn Bread comes with drama over its origins — Was it originally made by Protestant refugees, who called them “soleil et lune” or sun and moon cakes? Was it named for Solange Luyon, a pastry cook in Bath, England who for decades sold these buns on the street? Was knowing how to bake it truly essential to being a successful housekeeper, as this 1884 book, suggests? I love stories, I am lazy, and I suspect that gentle, joyful weeping could be part of a successful therapeutic regimen. I’m all in. This bread was so easy, it felt like a cheat. There was yeast, temperature, and time. But there was no kneading, no mess, no fuss. It wasn’t much more trouble than a ‘quick’ bread, but yielded something like a poor-man’s brioche — a hint of egg, a hint of sweet, still warm and slathered with butter. A soft flutter in the chest that could smooth some edges . There are too many people in my house and each has his or her own chest-sitter, provoking theatre and delusions of high-flown personal crisis in the midst of what is surely just run-of-the-mill February. There are too many chafing souls in this space. To have a thing, a focus, a place for my hands, a reason to watch the clock and, in the end, a product to show the wild-eyed group — see, I’ve been busy — this is the gift of bread making. It feels important, contributory, ancient and real. It’s creative and meditative, a ministration of sorts, leaving the kitchen warm and the air perfumed with civility. The Rustic White Bread This feels like a setback. I was hopeful. It seemed basic and foolproof, but also like “real” bread. It made two loaves, required more time and effort, and the pictures looked like a real baker was involved. Flour on the crust, slashes on the body, important-looking crumb. I’m ‘white’ and I’ve probably been called ‘rustic’ behind my back. This thing was mine for the taking. The making was a pleasure and I felt, briefly, like I might not be rudderless. The kneading was sensuous and hypnotic and felt surprisingly good to my aching thumbs and wrists. The rising was triumphant and the uncooked loaves, with their professional looking slashes across the top, held much promise. The results, however, are now possibly contributing to that tiny vibrating burr in my chest. The finished bread is decidedly mediocre. Kind of dry and heavy and not nearly as pretty as the pictures (is anything ever as pretty?). I substituted bread flour for all-purpose, so it’s probably my own fault (which feeds perfectly into my negative winter narrative). The loaves are now hiding in plastic bags in my kitchen, a seeming poor excuse for lost labor. French toast anyone? I need a victory, as soon as possible. Something lush and gorgeous, something to massage that small crisis from the ribs and rearrange February into a string of worthy days. A decadent, crowning-glory bread. The thing about bread-making that elevates it above all else in the kitchen is that it’s alive. Literally bursting and popping with life. You can watch it as it rises, hear it if you bend near. You are, with your life-worn hands, shaping life into artful sustenance, as the earliest hands once did. Massaging tiny beasties into a sustaining thing. This sounds like what needs to happen in my middle, a cycle of creation and consumption to fuel something sane and reliable. Maybe this is why they call the middle ‘the breadbasket’ (though I suspect that’s a little lower, in the stomach, where the bread goes). Challah I do worry that my motives aren’t noble. I’m all product over process. I love challah, I want challah, I want to have made challah. Do I actually want to make challah? I worry about the burden of expectation and the expectation of disappointment. But then, I worry. Worry is where I begin with the challah, fresh on the heels of the rustic flop. I’m back to Deb at Smitten, as she was so kind to me with that lovely Sally Lunn. Her challah looks gorgeous (of course, marketing, when will I learn) and she doesn’t seem daunted, so I tentatively dive. The making of this bread was surprisingly manageable and satisfying. Though I came to it with mild panic, the process settled into a fairly simple, rhythmic activity that wove itself into the business of my day, seamlessly. It rose, three times, just the way I imagine it should, and smelled of real challah, even before baking. I clumsily braided it, and it forgave me. Once in the oven, if filled the house with such an aroma of good and happy Sunday mornings, that I felt all was well — or, at least, that all could be well. Maybe even would. Once out of the oven, I had my victory. My crowning glory bread. The one bread to save me. Aside from a bit too much darkening of the crust, it was luscious. One of the best things I’ve ever made, one of my proudest moments in the kitchen. Two plump, gorgeous loaves — a bread that made me one of those insufferable food posters on social media, a bread that caused me to exclaim, repeatedly, “This tastes like real challah!” Someone told me that, according to Chinese medicine, trouble in the chest is related to grief. Any and all grief, all the way back to childhood. And, unfortunately, the daily bread grief that comes with the paper each morning. Global crisis grief. The grief that none of us escapes. In theory, if we identify and process each incident of grieving, the chest will clear. Easy as bread. Right? I need to make one more. It’s tempting to stop, to end on the high challah note and find a new therapy. But I have days left in this wretched month and no better idea, so I’m going to make one more. I don’t expect to recreate the thrill of victory, I just hope to avoid failure. The burr is back and with it comes that familiar expectation of disappointment. Lost in my search for the last bread, the bring-it-home bread, I find myself standing in the bathroom at first light, gazing slack-jawed at a miracle sky. February gray shot through with forgotten color. Dawn in the house of too many people, in the brief moment of silence, edged in among the overlapping schedules of pent and agitated winter souls. It’s memory that I’m chasing, a desire to hold it in my hands and warm it in the oven and eat it. I’m 13, that terrible turning age. It’s a sweltering summer day and, somehow, I am alone with my mother. Just us two, all day — an almost-never thing in a big family. She is painting the outside windows and we struggle together with a comically massive ladder, heaving it around the corner of the house, laughing so hard the tears overtake us and the task threatens to slide into calamity. She is also making bread. Portuguese Sweet Bread, it was called, and it was my favorite. In this memory, when the painting is done and the bread is ready, I eat too much of it and lay baking in the sun on a blanket in the backyard with my mother and a stack of magazines and I can almost feel the bread rising a little more in my overfull stomach. It is a delicious memory, a memory stuffed with sunshine and warmth, laughter and industry, my mother’s undivided attention and sweet warm bread. I realize that my memory may be flawed and I hesitate to ask my mother. Why would a middle-aged woman be painting the house and making bread, all on the same stifling hot day? It seems crazy, but perhaps it happened this way. Perhaps she was wrestling the thing in her own chest. Truth and memory have an uneasy relationship. The bread was real, I can still smell it. Portuguese Sweet Bread Early in this bread project, I off-handedly mentioned this childhood bread to my husband. I told him that the memory reminded me of that Hawaiian grocery store bread and, lo and behold, that’s what it is — Wiki says so. Who knew? I haven’t had it since I was a kid, but I’m hoping a stroll down memory lane is just the thing. Using Emeril’s recipe (a thing I thought I’d never say), the process seems familiar and comforting. Just five loaves in, I realize this bread-making business could become an easy habit. Do most of the work in the morning, with my coffee — no more than a half hour of focus — and let the beasties do the rest throughout the day. It’s become a thing I do now, or a thing I can do, instead of a distant aspirational thing. I make bread. The process is almost ritual — measure, mix, knead, rise, punch, rise again, bake. The dough feels vaguely warm and alive in my hands and the rising is reliable. The result is, likewise, reliable — like a memory. Substantial, satisfying, a comfort. It’s, surprisingly, not that hard. It requires attention. It is rewarding. You will fail. You will thrill. The burr will not be eradicated. It can, however, be placated. Distraction is good. I realize that my bread project neglected the thornier corners of baking—the sourdoughs and the whole grains, the boules and the batards. I’m not ready for a ‘starter’, though that sort of sounds like where you begin. I am aware that I skew sweet, but it is February. These were my starter breads and, though I still want to own a brioche, I’m pretty proud of myself. That, combined with all the warm bread in my belly, has lightened the darkest month and calmed the crisis in the chest. I recommend it. Go make some bread. I’m going to paint the kitchen. ", "name": "2268"}