{"sentences": [{"6b23": "Ask A Swole Woman: Overnight Oats"}, {"7454": "A few recipes to help you stay swole during this bulking season"}, {"a782": "In my journey to also become a Swole Woman, I need to change my bad habit of skipping breakfast and it seems like overnight oats is a good way to ensure I eat the “most important meal of the day.” Do you have any tips on what oats to get, what to mix in with it, etc? (I can’t have dairy and I’m allergic to coconut so I typically use almond milk.) Thanks! — JS"}, {"94c4": "Well first, allow me a preamble. I’m delighted to inform everyone that we are entering bulking season. What is bulking season? Great question — “bulking” is when you eat an excess of calories (10 to 20% over your normal caloric expenditure) while lifting heavy weights — the weights must be heavy — in order to put on muscle. Bulking is typically followed by “cutting,” where you eat at a slight caloric deficit (10% or so less than your normal caloric expenditure) to lose the small amount of fat you put on while you were bulking, revealing your awesome muscles, or in the words of women’s magazines, “toned body.” (If you are new to lifting, it is possible to do something called “recomping,” where you can gain muscle and lose fat simultaneously for a few months if you eat at or a little above your normal caloric expenditure. After you’ve run through this, bulking and cutting is a way of continuing to progress, either strength- or appearance-wise.)"}, {"a711": "“Bulking” is typically followed by “cutting,” where you eat at a slight caloric deficit."}, {"5f07": "As much as I think there are so many reasons to work out above and beyond your appearance, I accept that people will do it for that reason regardless of what I say because the world is dumb and fucked up to women. But if it gets you to put muscles on your body and see the beauty of lifting, then, ok. But I have some news — if you’re a person who does “bikini body” “prep” season and thought it starts like three weeks before Memorial Day, where you consume nothing but Master Cleanse lemonade and pray to Teyana Taylor in the Fade music video? Wrong. It starts now. Please stop crying, let me finish — it starts with you eating a l o t o f f o o d for several months, followed by eating slightly less food for a couple months. If you lift. If you lift. You need to make muscles that will raise your resting metabolism, make your overall life better, and make it easier to lose fat. Muscles and food need each other like Meg Ryan and Tom Hanks. The holidays are a good time to bulk, because food and giant sweaters are ample. But you’ll still feel good because you will be going into the gym and moving iron like never before. (TMI: I even sweat less in the gym when I eat more. I’m sure there’s an explanation, but I don’t know it.)"}, {"7841": "You need to make muscles that will raise your resting metabolism, make your overall life better, and make it easier to lose fat."}, {"cce7": "How do you bulk, and then how do you cut? The answer is overnight swoalts, a variation of overnight oats. Overnight oats are a delicious breakfast for everyone that can take any number of forms. Overnight oats were born of probably Pinterest several years ago, and it was only recently that Quaker Oats figured out this was a thing people were doing, bless their hearts. There is now more overnight oats content on the internet than you can read in your lifetime. Here is more."}, {"b07a": "Overnight oats are usually composed of: Oats, some sort of liquid in which to soak the oats (milk, almond milk, rice milk hemp milk, etc.), and sweeteners and flavorings of some kind"}, {"dcb1": "Now — overnight swoalts are overnight oats that have been optimized for their macro ratios — mainly, they deliver a solid dose of protein, like 35–40g for a reasonable calorie tradeoff (when you lift, you need your protein), plus they are delicious. To this serving, you can add whatever you want — fresh fruit, dried fruit, nuts, cocoa powder, canned pumpkin, chocolate chips, carob chips, etc etc etc. I like to add fruit in the morning when I eat it, but you can mix it in the night before too. Here are the basic components, though you can skip or sub most of these things:"}, {"d7b4": "An individual serving of Basic Overnight Swoalts"}, {"f3b3": "444 calories, 12g fat/46g carbs/40g protein per serving"}, {"7719": "1/2c oats2/3c Greek yogurt1/2c milk1tbsp chia seeds1/3 scoop protein powder2tsp sugar (to taste)"}, {"97e5": "Mix and let sit overnight."}, {"09bf": "Now the power move, what really brings this to the level of swoalts, is mixing a giant volume batch that you scoop out and eat over a few days. I get a nice big vat and do this:"}, {"acb2": "Volume Swoalts (serves 6, or one for 6 days)"}, {"512b": "444 calories, 12g fat/46g carbs/40g protein per serving"}, {"9456": "3c oatsThe largest size tub of Fage 2%3c milk6tbsp chia seeds2 scoops protein powder4tbsp sugar"}, {"d43e": "Combine and churn with a big wooden spoon until all ingredients are integrated; let sit overnight."}, {"a30d": "At this level, it makes sense to have a small kitchen scale in order to correctly measure out your servings. If you’re eating it all yourself, it doesn’t matter day-to-day if you’re off a bit in the serving sizes."}, {"bd39": "Already we have a beautiful and easy breakfast — swoalts can even be portable if you mix them in tupperware containers or mason jars. But if we go a level deeper, the true beauty of swoalts is they are endlessly tweakable to fit your particular nutrition needs. Using an app like MyFitnessPal or LoseIt can help you dial this stuff in."}, {"607b": "Bulking version of Overnight Swoalts"}, {"2422": "595 calories, 13g fat/67g carbs/40g protein"}, {"30c0": "3/4c oats3/4c Greek yogurt2/3c milk1tbsp chia seeds1/2 scoop protein powder1tbsp sugar (to taste)"}, {"def0": "Cutting version of Overnight Swoalts"}, {"0e0a": "358 calories, 11g fat/26g carbs/37g protein"}, {"55fd": "1/4c oat2/3c Greek yogurt1/3c milk1tbsp chia seeds1/2 scoop protein powder"}, {"8663": "I know these recipes cater to the dairy eaters among us, but there are lots of alternatives to milks and yogurts. While Greek yogurt is a protein powerhouse, spiking your swoalts with a protein powder of your choosing is a good move if you have to skip Greek yogurt for whatever reason. Now raise your gloppy, delicious spoonfuls of whatever to bulking season."}, {"e309": "Got a question for A Swole Woman? Email swole@thehairpin.com"}], "child": "2269_12269_1", "parent": "", "title": "Ask A Swole Woman: Overnight Oats", "content": "Ask A Swole Woman: Overnight Oats A few recipes to help you stay swole during this bulking season In my journey to also become a Swole Woman, I need to change my bad habit of skipping breakfast and it seems like overnight oats is a good way to ensure I eat the “most important meal of the day.” Do you have any tips on what oats to get, what to mix in with it, etc? (I can’t have dairy and I’m allergic to coconut so I typically use almond milk.) Thanks! — JS Well first, allow me a preamble. I’m delighted to inform everyone that we are entering bulking season. What is bulking season? Great question — “bulking” is when you eat an excess of calories (10 to 20% over your normal caloric expenditure) while lifting heavy weights — the weights must be heavy — in order to put on muscle. Bulking is typically followed by “cutting,” where you eat at a slight caloric deficit (10% or so less than your normal caloric expenditure) to lose the small amount of fat you put on while you were bulking, revealing your awesome muscles, or in the words of women’s magazines, “toned body.” (If you are new to lifting, it is possible to do something called “recomping,” where you can gain muscle and lose fat simultaneously for a few months if you eat at or a little above your normal caloric expenditure. After you’ve run through this, bulking and cutting is a way of continuing to progress, either strength- or appearance-wise.) “Bulking” is typically followed by “cutting,” where you eat at a slight caloric deficit. As much as I think there are so many reasons to work out above and beyond your appearance, I accept that people will do it for that reason regardless of what I say because the world is dumb and fucked up to women. But if it gets you to put muscles on your body and see the beauty of lifting, then, ok. But I have some news — if you’re a person who does “bikini body” “prep” season and thought it starts like three weeks before Memorial Day, where you consume nothing but Master Cleanse lemonade and pray to Teyana Taylor in the Fade music video? Wrong. It starts now. Please stop crying, let me finish — it starts with you eating a l o t o f f o o d for several months, followed by eating slightly less food for a couple months. If you lift. If you lift. You need to make muscles that will raise your resting metabolism, make your overall life better, and make it easier to lose fat. Muscles and food need each other like Meg Ryan and Tom Hanks. The holidays are a good time to bulk, because food and giant sweaters are ample. But you’ll still feel good because you will be going into the gym and moving iron like never before. (TMI: I even sweat less in the gym when I eat more. I’m sure there’s an explanation, but I don’t know it.) You need to make muscles that will raise your resting metabolism, make your overall life better, and make it easier to lose fat. How do you bulk, and then how do you cut? The answer is overnight swoalts, a variation of overnight oats. Overnight oats are a delicious breakfast for everyone that can take any number of forms. Overnight oats were born of probably Pinterest several years ago, and it was only recently that Quaker Oats figured out this was a thing people were doing, bless their hearts. There is now more overnight oats content on the internet than you can read in your lifetime. Here is more. Overnight oats are usually composed of: Oats, some sort of liquid in which to soak the oats (milk, almond milk, rice milk hemp milk, etc.), and sweeteners and flavorings of some kind Now — overnight swoalts are overnight oats that have been optimized for their macro ratios — mainly, they deliver a solid dose of protein, like 35–40g for a reasonable calorie tradeoff (when you lift, you need your protein), plus they are delicious. To this serving, you can add whatever you want — fresh fruit, dried fruit, nuts, cocoa powder, canned pumpkin, chocolate chips, carob chips, etc etc etc. I like to add fruit in the morning when I eat it, but you can mix it in the night before too. Here are the basic components, though you can skip or sub most of these things: An individual serving of Basic Overnight Swoalts 444 calories, 12g fat/46g carbs/40g protein per serving 1/2c oats2/3c Greek yogurt1/2c milk1tbsp chia seeds1/3 scoop protein powder2tsp sugar (to taste) Mix and let sit overnight. Now the power move, what really brings this to the level of swoalts, is mixing a giant volume batch that you scoop out and eat over a few days. I get a nice big vat and do this: Volume Swoalts (serves 6, or one for 6 days) 444 calories, 12g fat/46g carbs/40g protein per serving 3c oatsThe largest size tub of Fage 2%3c milk6tbsp chia seeds2 scoops protein powder4tbsp sugar Combine and churn with a big wooden spoon until all ingredients are integrated; let sit overnight. At this level, it makes sense to have a small kitchen scale in order to correctly measure out your servings. If you’re eating it all yourself, it doesn’t matter day-to-day if you’re off a bit in the serving sizes. Already we have a beautiful and easy breakfast — swoalts can even be portable if you mix them in tupperware containers or mason jars. But if we go a level deeper, the true beauty of swoalts is they are endlessly tweakable to fit your particular nutrition needs. Using an app like MyFitnessPal or LoseIt can help you dial this stuff in. Bulking version of Overnight Swoalts 595 calories, 13g fat/67g carbs/40g protein 3/4c oats3/4c Greek yogurt2/3c milk1tbsp chia seeds1/2 scoop protein powder1tbsp sugar (to taste) Cutting version of Overnight Swoalts 358 calories, 11g fat/26g carbs/37g protein 1/4c oat2/3c Greek yogurt1/3c milk1tbsp chia seeds1/2 scoop protein powder I know these recipes cater to the dairy eaters among us, but there are lots of alternatives to milks and yogurts. While Greek yogurt is a protein powerhouse, spiking your swoalts with a protein powder of your choosing is a good move if you have to skip Greek yogurt for whatever reason. Now raise your gloppy, delicious spoonfuls of whatever to bulking season. Got a question for A Swole Woman? Email swole@thehairpin.com ", "name": "2269"}