{"name": "227", "parent": "", "content": "What makes work bearable Why do people stay in the same job for years, decades and even their entire lives? Based on most articles on the Internet, experts would cite the feeling of having one’s work appreciated, to serve a cause bigger than oneself or the standard “money” answer. I’m not an expert myself but from my working experience and the colleagues I met over the years, people stay in the company for extended periods of time because of… people. Fellow human beings. In fact, I personally find most of the jobs I worked in so far bearable if I enjoyed my colleagues’ company. As much as business experts would say people stick with the same company for years because they believe in the company’s cause and values, isn’t it too utopian to think everyone in any global company believes in the founder’s vision one-hundred percent? Heck, even medium-sized companies with less than 50 employees wouldn’t deny the fact at least a handful are just in it for the extra bit of glitter on their CV. Of course, I’m not saying there aren’t loyal and devoted employees working in any company — there are plenty. I’m referring to those of us who joined a company because it’s our first job, we don’t really know what we want but the company is kind of cool and offers us a job we’re at least mildly interested in. Or those of us who need to feed a family and the paycheque satisfies that priority. But what is it that makes working in a company whose values don’t necessarily align with ours, bearable? Is it really just money or is there something deeper and more satisfying? Let’s not even talk about doing meaningful or fulfilling work because it is just not possible for every single person on this planet to do exactly what they want to do. If everyone were to just set out to do what might seem like their “true calling”, economies might start to collapse. I’m not an economist, don’t take my word for it. What I’d prefer to discuss is what exactly can make our job bearable when it gets tough, considering the very fact it is impossible for every working adult to be in their dream job? To answer this question, I first asked myself, what would happen if my current colleagues whom I’ve grown pretty close to, were to suddenly leave the company? Just a little background, I joined the company because I wanted to write and I was offered the chance to, so here I am. There are certain company values I don’t particularly believe in but I love my colleagues. So what if one or a few of them were to leave? My Mondays would be a lot bluer, lunch breaks would be quieter, the working days would seem like ages to go through. What would happen to all the laughter when we poke fun at each other? How about the morning chats before starting work? Lesser people will mean the air condition will be a lot colder too. Please, anything but that — I hate the cold. It turns out I’m not the only one who feels the same way. From my chats with friends who are offered better-paying jobs and possibly something more aligned with their interests, they always give me the same answer when asked what is holding them back from moving on to a greener pasture: the people. The colleagues whom we go out to eat and drink with after work. The colleagues who were there for us when things get tough during office hours. The colleagues whose mere presence is sufficient to get us through nights of overtime. This shouldn’t be a surprise, though. Most company employees spend eight hours or one-third of the day in the office for five days a week on the average. Add in our sleeping hours and commuting time and we’re actually spending more time with our colleagues than anyone else in our life. Well, at least on working days. Yes, even if we don’t talk to each other every single moment at work, the occasional glances and smiles at one another, the coincidental encounters in the common toilet, the short few-minute chats while brewing coffee or tea — all these add up. These little bits of personal interaction are what make work bearable even in the hardest of times. Of course, we should never forget the support we get from our loved ones and friends who listen to our complaints and rants about either the job scope, our boss or clients. But the ones who truly understand our problems at work are the very people whom we work with — our colleagues. If there’s anyone who should understand any difficulties at work, it should be them. Sure, there are many ways we can get out of an “ordinary job”, as many successful entrepreneurs and business people teach us in tonnes of viral articles out there. They talk about how everyone is merely settling for a mediocre lifestyle and how we all should set out to build a vision we have. These are all insightful advice and can inspire and motivate people with a clear vision and goal in mind to get off their asses and grind their way to success. But for most of us “average Joes” and “plain Janes” who don’t have either the luck or tenacity to pursue our dreams and venture out to start our own business, we try our best to bear with the hardships and monotony of leading a mediocre lifestyle. Remember, not everyone can and want to build a business from scratch. And the people around us, be it colleagues, friends or family members, are the reasons why work and life can be bearable even in the darkest moments. If you liked what you’ve read, please click on that green heart 💚 for this piece of writing to reach more people. Leave your thoughts below to keep the conversation going. Appreciate it! You can find my other writings here. ", "title": "What makes work bearable", "sentences": [{"5edf": "What makes work bearable"}, {"2519": "Why do people stay in the same job for years, decades and even their entire lives?"}, {"19b6": "Based on most articles on the Internet, experts would cite the feeling of having one’s work appreciated, to serve a cause bigger than oneself or the standard “money” answer."}, {"805c": "I’m not an expert myself but from my working experience and the colleagues I met over the years, people stay in the company for extended periods of time because of… people. Fellow human beings."}, {"521f": "In fact, I personally find most of the jobs I worked in so far bearable if I enjoyed my colleagues’ company."}, {"8b39": "As much as business experts would say people stick with the same company for years because they believe in the company’s cause and values, isn’t it too utopian to think everyone in any global company believes in the founder’s vision one-hundred percent? Heck, even medium-sized companies with less than 50 employees wouldn’t deny the fact at least a handful are just in it for the extra bit of glitter on their CV."}, {"b2a4": "Of course, I’m not saying there aren’t loyal and devoted employees working in any company — there are plenty."}, {"866a": "I’m referring to those of us who joined a company because it’s our first job, we don’t really know what we want but the company is kind of cool and offers us a job we’re at least mildly interested in. Or those of us who need to feed a family and the paycheque satisfies that priority."}, {"c5cc": "But what is it that makes working in a company whose values don’t necessarily align with ours, bearable? Is it really just money or is there something deeper and more satisfying?"}, {"2f58": "Let’s not even talk about doing meaningful or fulfilling work because it is just not possible for every single person on this planet to do exactly what they want to do. If everyone were to just set out to do what might seem like their “true calling”, economies might start to collapse."}, {"643c": "I’m not an economist, don’t take my word for it."}, {"c8a2": "What I’d prefer to discuss is what exactly can make our job bearable when it gets tough, considering the very fact it is impossible for every working adult to be in their dream job?"}, {"1875": "To answer this question, I first asked myself, what would happen if my current colleagues whom I’ve grown pretty close to, were to suddenly leave the company?"}, {"e207": "Just a little background, I joined the company because I wanted to write and I was offered the chance to, so here I am. There are certain company values I don’t particularly believe in but I love my colleagues."}, {"c785": "So what if one or a few of them were to leave?"}, {"d715": "My Mondays would be a lot bluer, lunch breaks would be quieter, the working days would seem like ages to go through. What would happen to all the laughter when we poke fun at each other? How about the morning chats before starting work? Lesser people will mean the air condition will be a lot colder too. Please, anything but that — I hate the cold."}, {"f1c6": "It turns out I’m not the only one who feels the same way. From my chats with friends who are offered better-paying jobs and possibly something more aligned with their interests, they always give me the same answer when asked what is holding them back from moving on to a greener pasture: the people."}, {"91bf": "The colleagues whom we go out to eat and drink with after work. The colleagues who were there for us when things get tough during office hours. The colleagues whose mere presence is sufficient to get us through nights of overtime."}, {"31c8": "This shouldn’t be a surprise, though. Most company employees spend eight hours or one-third of the day in the office for five days a week on the average. Add in our sleeping hours and commuting time and we’re actually spending more time with our colleagues than anyone else in our life. Well, at least on working days."}, {"3e27": "Yes, even if we don’t talk to each other every single moment at work, the occasional glances and smiles at one another, the coincidental encounters in the common toilet, the short few-minute chats while brewing coffee or tea — all these add up. These little bits of personal interaction are what make work bearable even in the hardest of times."}, {"750a": "Of course, we should never forget the support we get from our loved ones and friends who listen to our complaints and rants about either the job scope, our boss or clients. But the ones who truly understand our problems at work are the very people whom we work with — our colleagues. If there’s anyone who should understand any difficulties at work, it should be them."}, {"51d8": "Sure, there are many ways we can get out of an “ordinary job”, as many successful entrepreneurs and business people teach us in tonnes of viral articles out there. They talk about how everyone is merely settling for a mediocre lifestyle and how we all should set out to build a vision we have. These are all insightful advice and can inspire and motivate people with a clear vision and goal in mind to get off their asses and grind their way to success."}, {"0265": "But for most of us “average Joes” and “plain Janes” who don’t have either the luck or tenacity to pursue our dreams and venture out to start our own business, we try our best to bear with the hardships and monotony of leading a mediocre lifestyle. Remember, not everyone can and want to build a business from scratch."}, {"e17c": "And the people around us, be it colleagues, friends or family members, are the reasons why work and life can be bearable even in the darkest moments."}, {"6e51": "If you liked what you’ve read, please click on that green heart 💚 for this piece of writing to reach more people. Leave your thoughts below to keep the conversation going. Appreciate it!"}, {"10ff": "You can find my other writings here."}], "child": "227_1\t227_2227_1\t227_2"}