{"sentences": [{"e617": "In The Kitchen With Céline Dion"}, {"022c": "Meat pies and heartbreak."}, {"58bc": "Céline Dion met her husband, René Angélil when she was a teenager. They married when she was 19 and he was 45 — quite the chasm in years, there, a fact that is brushed under the rug when discussing Céline’s relationship. It was clear that they were very much in love. Their wedding was extravagant, broadcast on Canadian national television. Céline wore white fur and a beaded headpiece that anchored an explosion of white tulle; Rene wore a tux and the cunning smile of a man who married a woman that he truly loved, 26 years his junior."}, {"2340": "It’s easy to compare Céline and René to Tommy Mottola’s discovery of Mariah Carey. Both women possessed powerful voices, were young and had wildly curly hair that has since been tamed. Both men were older and in the industry. Both couples had weddings that could only be described as “fairytale.” But Tommy Mottola and Mariah Carey did not last. Céline and René endured because their love was real."}, {"e713": "The best thing about Céline Dion besides that voice, powerful and tremulous and throaty, is her acute self-awareness. Watching her perform is to watch a woman in complete control. Every movement and pose is precise, imbued with a considerable flair for the dramatic. Her music is CVS lite, the stuff you find yourself humming along to while considering tampons, but that doesn’t make it any less impactful. Her voice! The tiny fist, grabbing the air and slamming into a bony hip, all tightly-wound energy, vibrating like a live wire. I am not a fan of Céline Dion; her music is not the first thing I’d pick to listen to if given the choice, but watching her perform makes me wish her Vegas residency wasn’t over. She is incandescent, a seasoned performer with a strange understanding of how vowels should sound in English."}, {"352e": "When René died in January of this year, after the nurse found him but before they took him away, Céline slipped a stuffed heart under his head, put him in a bathrobe and talked to him for a long time. Recently, Céline Dion mentioned to the press that René was the only man she had ever kissed. The cynic in me understands that this is because they met when she was a teenager; the romantic lets me believe that this is because she loved him very, very much."}, {"465e": "“Céline Dion meat pies” has been on my to-do list for quite some time. Every night when I sit down to make my list for the next day, I dutifully transcribe it to the next. The recipe for Céline’s meat pies was a curious entry in the Today’s Kitchen, smushed in at the beginning of the book alongside other celebrities whose publicists found the time to send something in. The recipe on the facing page is Vanessa Williams’ potato pancakes, a pairing so incongruous that it shook my belief that celebrity cookbooks and the recipes contained within are genuine. Maybe some of them are, but for the most part, I’m certain they are not."}, {"428f": "In the Kitchen With Ann CurryFamily feuds softened with sugar cookiesthehairpin.com"}, {"f711": "But something about Céline Dion’s meat tarts felt real to me. In 2000, René and Céline renewed their vows in a lavish Melkite Byzantine ceremony, a nod to René’s Syrian and Lebanese heritage. Céline wore gold sequins and ten humans’ worth of hair. Does Céline Dion cook? On the one hand, yes, probably makes a lovely sandwich and can pull off a quiche if hard-pressed. The meat tarts are maybe the one recipe she really, really knows — her go-to dinner party appetizer—something she throws together before having friends over for Pinot Grigio and power posing."}, {"2803": "Her recipe for sfihas seemed easy enough and also had the potential to be quite delicious. I made them with a friend the night of the second presidential debate, bopping around his kitchen with a glass of wine in hand. “These seem weird,” I said in passing, only because the recipe made 16 and we were trying to feed just the two of us. The fire alarm went off, naturally, but the sfihas were delicious. We ate them with a salad and sat on the couch, watching Donald Trump follow Hillary Clinton around the stage like a shadowy menace and witnessed the birth of Ken Bone."}, {"1e52": "“I thought these would be really bad,” I told my friend. “But I’m so glad they weren’t.”"}, {"be2b": "Celine Dion’s Sfihas (Meat Tarts)"}, {"65fe": "1 can Pillsbury Refrigerated Crescent Dinner Rolls1 pound ground veal (I used lamb and it was fantastic)1 medium onion, finely chopped1/4 cup plain yogurt2 tablespoons pine nuts, roasted1 eggSalt to tasteArabian Pepper to taste (finely milled white and black pepper, cardamom, nutmeg, 4-spices, cloves and cinnamon. I found a baharat spice blend at my grocery store and it worked out.)"}, {"f0a6": "Heat the oven to 425ºF. Remove the dough from the can and divide each triangle strip into half. Shape dough into 3-inch diameter tarts and flatten edges, leaving the center thicker. Mix all stuffing ingredients with hands. Spread mixture on dough circles to within 1/4 inch of edge."}, {"f2f8": "Place sfihas on greased cookie sheet and bake 7 to 10 minutes on lower rack. Shift cookie sheet to upper rack and bake 5 minutes."}], "child": "2270_1\t2270_2\t2270_3\t2270_4", "parent": "", "title": "In The Kitchen With Céline Dion", "content": "In The Kitchen With Céline Dion Meat pies and heartbreak. Céline Dion met her husband, René Angélil when she was a teenager. They married when she was 19 and he was 45 — quite the chasm in years, there, a fact that is brushed under the rug when discussing Céline’s relationship. It was clear that they were very much in love. Their wedding was extravagant, broadcast on Canadian national television. Céline wore white fur and a beaded headpiece that anchored an explosion of white tulle; Rene wore a tux and the cunning smile of a man who married a woman that he truly loved, 26 years his junior. It’s easy to compare Céline and René to Tommy Mottola’s discovery of Mariah Carey. Both women possessed powerful voices, were young and had wildly curly hair that has since been tamed. Both men were older and in the industry. Both couples had weddings that could only be described as “fairytale.” But Tommy Mottola and Mariah Carey did not last. Céline and René endured because their love was real. The best thing about Céline Dion besides that voice, powerful and tremulous and throaty, is her acute self-awareness. Watching her perform is to watch a woman in complete control. Every movement and pose is precise, imbued with a considerable flair for the dramatic. Her music is CVS lite, the stuff you find yourself humming along to while considering tampons, but that doesn’t make it any less impactful. Her voice! The tiny fist, grabbing the air and slamming into a bony hip, all tightly-wound energy, vibrating like a live wire. I am not a fan of Céline Dion; her music is not the first thing I’d pick to listen to if given the choice, but watching her perform makes me wish her Vegas residency wasn’t over. She is incandescent, a seasoned performer with a strange understanding of how vowels should sound in English. When René died in January of this year, after the nurse found him but before they took him away, Céline slipped a stuffed heart under his head, put him in a bathrobe and talked to him for a long time. Recently, Céline Dion mentioned to the press that René was the only man she had ever kissed. The cynic in me understands that this is because they met when she was a teenager; the romantic lets me believe that this is because she loved him very, very much. “Céline Dion meat pies” has been on my to-do list for quite some time. Every night when I sit down to make my list for the next day, I dutifully transcribe it to the next. The recipe for Céline’s meat pies was a curious entry in the Today’s Kitchen, smushed in at the beginning of the book alongside other celebrities whose publicists found the time to send something in. The recipe on the facing page is Vanessa Williams’ potato pancakes, a pairing so incongruous that it shook my belief that celebrity cookbooks and the recipes contained within are genuine. Maybe some of them are, but for the most part, I’m certain they are not. In the Kitchen With Ann CurryFamily feuds softened with sugar cookiesthehairpin.com But something about Céline Dion’s meat tarts felt real to me. In 2000, René and Céline renewed their vows in a lavish Melkite Byzantine ceremony, a nod to René’s Syrian and Lebanese heritage. Céline wore gold sequins and ten humans’ worth of hair. Does Céline Dion cook? On the one hand, yes, probably makes a lovely sandwich and can pull off a quiche if hard-pressed. The meat tarts are maybe the one recipe she really, really knows — her go-to dinner party appetizer—something she throws together before having friends over for Pinot Grigio and power posing. Her recipe for sfihas seemed easy enough and also had the potential to be quite delicious. I made them with a friend the night of the second presidential debate, bopping around his kitchen with a glass of wine in hand. “These seem weird,” I said in passing, only because the recipe made 16 and we were trying to feed just the two of us. The fire alarm went off, naturally, but the sfihas were delicious. We ate them with a salad and sat on the couch, watching Donald Trump follow Hillary Clinton around the stage like a shadowy menace and witnessed the birth of Ken Bone. “I thought these would be really bad,” I told my friend. “But I’m so glad they weren’t.” Celine Dion’s Sfihas (Meat Tarts) 1 can Pillsbury Refrigerated Crescent Dinner Rolls1 pound ground veal (I used lamb and it was fantastic)1 medium onion, finely chopped1/4 cup plain yogurt2 tablespoons pine nuts, roasted1 eggSalt to tasteArabian Pepper to taste (finely milled white and black pepper, cardamom, nutmeg, 4-spices, cloves and cinnamon. I found a baharat spice blend at my grocery store and it worked out.) Heat the oven to 425ºF. Remove the dough from the can and divide each triangle strip into half. Shape dough into 3-inch diameter tarts and flatten edges, leaving the center thicker. Mix all stuffing ingredients with hands. Spread mixture on dough circles to within 1/4 inch of edge. Place sfihas on greased cookie sheet and bake 7 to 10 minutes on lower rack. Shift cookie sheet to upper rack and bake 5 minutes. ", "name": "2270"}