{"sentences": [{"01c9": "Disgustingly Good Cookies"}, {"68b7": "Excerpted from ‘The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes’"}, {"ea22": "Excerpted from The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes © 2016,edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, published by powerHouse Books."}, {"99e1": "A few years ago, I came across an unusual cookie recipe that called for chickpeas instead of flour. I thought it was potentially gross and too health-foody, but I loved the warning at the end, something along the lines of: do not try the dough, it is disgusting."}, {"bf42": "Laughing, I told my husband: “There’s this cookie recipe that claims that the cookies are good, but the dough is disgusting. Whaaaat?!” He smiled, probably amused more by me and my obsessive recipe hunting and gathering than anything else. Anyhow, I didn’t make them."}, {"be1b": "But I thought about them. The recipe got stuck in my head the way some people get songs stuck in their head. Although my daughter says songs don’t get really stuck in your head, they get stuck “in your mouth,” and maybe it’s the same with recipes? I wanted a taste. I wondered what the texture and smell were like, what dark magic transformed chickpeas into dough. After all, I like chickpeas well enough, and I’ve always enjoyed sweet red bean desserts. And of course chocolate comes from beans, too. Maybe the dough wasn’t even disgusting. Maybe, instead, it was disgustingly good."}, {"2d92": "Six months later, I finally made chickpea cookies, and they changed my life forever. I fixated on them, started writing and publishing my own recipes, and, in an oblique way, they even led me to create this book."}, {"177b": "Since then, I’ve made gobs of these cookies — I’m probably at least 30% chickpea by now — and the taste is strangely addictive, as is the process of making something so mysterious. Over time, I’ve adjusted the recipe while also improvising and honing recipes for other chickpea creations: spicy chickpea brownies, chickpea peanut butter bars with raspberry jam, pumpkin-chickpea-almond-butter bars, roasted maple coconut chickpeas, sour cream blueberry chickpea muffins. For special occasions, I make a divine mint chocolate chickpea cake. My kids even associate sweets with chickpeas, which sometimes makes me feel like I’m “winning” at parenting."}, {"96e4": "This is my recipe for chickpea cookies, originally published in The Hairpin, inspired by Texanerin, and now new and improved. They have a soft, chewy texture, a nutty, lightly sweet flavor, and lots of dark chocolate chips. I dare you to give them a try. And, while you’re at it, please feel free to sample the dough."}, {"f0bc": "Natalie’s Chickpea Chocolate Chip Banana Cookies"}, {"c476": "1 ½ cups chickpeasheaping ½ cup peanut butter (or other nut or seed butter)¼ cup honey2 teaspoons vanilla½ banana1 teaspoon baking powderheaping ½ cup dark chocolate chips¼ teaspoon sea saltextra sea salt for sprinkling on top"}, {"8c28": "Preheat the oven to 350ºF, then line a cookie sheet with parchment paper."}, {"8337": "Measure out your chickpeas. If you’re using canned chickpeas, dry them on paper towels first and peel them if you’ve got the time. (The dough will be slightly smoother if you do, but they’ll be great either way.)"}, {"fcca": "Purée the chickpeas in a food processor fitted with a steel blade. Scrape down the edges, and blend for several minutes until the dough is smooth."}, {"152d": "Add all of the remaining ingredients except the dark chocolate chips and extra sea salt and pulse until combined."}, {"2070": "Add the chocolate chips and mix. The dough will be quite sticky now."}, {"5077": "Spoon the dough onto parchment paper, making approximately 16 cookies. Flatten each cookie very slightly with a fork and sprinkle sea salt to taste."}, {"5b58": "Bake for 11–13 minutes, and let me know what you think."}, {"1c5d": "If you live in NYC, come to the book launch tonight at powerHouse Arena in DUMBO, where Natalie will be chatting with Elissa Schappell and Lev Grossman about their culinary dreams and misadventures. Porochista Khakpour will moderate."}, {"98f6": "Natalie Eve Garrett is an artist, writer, and chickpea. She’s the editor of The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes, which comes out today."}], "child": "2271_12271_1", "parent": "", "title": "Disgustingly Good Cookies", "content": "Disgustingly Good Cookies Excerpted from ‘The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes’ Excerpted from The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes © 2016,edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, published by powerHouse Books. A few years ago, I came across an unusual cookie recipe that called for chickpeas instead of flour. I thought it was potentially gross and too health-foody, but I loved the warning at the end, something along the lines of: do not try the dough, it is disgusting. Laughing, I told my husband: “There’s this cookie recipe that claims that the cookies are good, but the dough is disgusting. Whaaaat?!” He smiled, probably amused more by me and my obsessive recipe hunting and gathering than anything else. Anyhow, I didn’t make them. But I thought about them. The recipe got stuck in my head the way some people get songs stuck in their head. Although my daughter says songs don’t get really stuck in your head, they get stuck “in your mouth,” and maybe it’s the same with recipes? I wanted a taste. I wondered what the texture and smell were like, what dark magic transformed chickpeas into dough. After all, I like chickpeas well enough, and I’ve always enjoyed sweet red bean desserts. And of course chocolate comes from beans, too. Maybe the dough wasn’t even disgusting. Maybe, instead, it was disgustingly good. Six months later, I finally made chickpea cookies, and they changed my life forever. I fixated on them, started writing and publishing my own recipes, and, in an oblique way, they even led me to create this book. Since then, I’ve made gobs of these cookies — I’m probably at least 30% chickpea by now — and the taste is strangely addictive, as is the process of making something so mysterious. Over time, I’ve adjusted the recipe while also improvising and honing recipes for other chickpea creations: spicy chickpea brownies, chickpea peanut butter bars with raspberry jam, pumpkin-chickpea-almond-butter bars, roasted maple coconut chickpeas, sour cream blueberry chickpea muffins. For special occasions, I make a divine mint chocolate chickpea cake. My kids even associate sweets with chickpeas, which sometimes makes me feel like I’m “winning” at parenting. This is my recipe for chickpea cookies, originally published in The Hairpin, inspired by Texanerin, and now new and improved. They have a soft, chewy texture, a nutty, lightly sweet flavor, and lots of dark chocolate chips. I dare you to give them a try. And, while you’re at it, please feel free to sample the dough. Natalie’s Chickpea Chocolate Chip Banana Cookies 1 ½ cups chickpeasheaping ½ cup peanut butter (or other nut or seed butter)¼ cup honey2 teaspoons vanilla½ banana1 teaspoon baking powderheaping ½ cup dark chocolate chips¼ teaspoon sea saltextra sea salt for sprinkling on top Preheat the oven to 350ºF, then line a cookie sheet with parchment paper. Measure out your chickpeas. If you’re using canned chickpeas, dry them on paper towels first and peel them if you’ve got the time. (The dough will be slightly smoother if you do, but they’ll be great either way.) Purée the chickpeas in a food processor fitted with a steel blade. Scrape down the edges, and blend for several minutes until the dough is smooth. Add all of the remaining ingredients except the dark chocolate chips and extra sea salt and pulse until combined. Add the chocolate chips and mix. The dough will be quite sticky now. Spoon the dough onto parchment paper, making approximately 16 cookies. Flatten each cookie very slightly with a fork and sprinkle sea salt to taste. Bake for 11–13 minutes, and let me know what you think. If you live in NYC, come to the book launch tonight at powerHouse Arena in DUMBO, where Natalie will be chatting with Elissa Schappell and Lev Grossman about their culinary dreams and misadventures. Porochista Khakpour will moderate. Natalie Eve Garrett is an artist, writer, and chickpea. She’s the editor of The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes, which comes out today. ", "name": "2271"}