{"sentences": [{"901e": "From Conquerer’s Canapés to Feminist Popcorn"}, {"66b2": "Four recipes from Natalie Eve Garrett’s new collection"}, {"3f6d": "Excerpted from The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes © 2016,edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, published by powerHouse Books."}, {"92dc": "We are delighted to share excerpts from Hairpin contributor Natalie Eve Garrett’s new book, The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes. Inspired by a book from 1961, the book contains personal, food-related stories with recipes from 76 contemporary artists and writers. Below, you’ll find brief excerpts from four of the stories that appear in the book."}, {"d6a0": "I’d like to believe that these lowly marauders, taunting me with their silver trails of slime on my garden walls, would be pained to see that I’m eating their kin — that the sight of me forking the hot, wet-with-butter and fully parsleyed bodies of their brethren into my maw would cause them alarm. I’d like to think that if they had mouths they would cry out, if they had fists they would shake them at me, and that barring that they would retract their eye stalks and hurl themselves against the cold, hard ground until their shells splintered in protest. But they don’t. They are heartless."}, {"3763": "For the past 20 or so odd years, my husband and I have thrown a dinner party to celebrate the beginning of spring. Along with wearing flowers in our hair and rolling empty wine bottles for luck, it’s become a tradition for us to serve escargot. Every year there will be a guest who, pale and trembling, delights me with their confession that they have never had snails before. What an enormous pleasure it is to be the one to give them their first taste. Until the day when I launch my fleet of Escar-Go-Go food carts with go-go dancers in snail pasties, making your own will have to suffice."}, {"0d71": "The first recipe I encountered was in a child’s cookbook; it was for “Candle Salad.” Painstakingly thorough directions led you to put a ring of canned pineapple on a plate, stick the top half of a banana down into the pineapple circle, and balance a maraschino cherry on top."}, {"ff42": "I was enthralled. It was as if I was there at the invention of metaphor. Banana = candle! Cherry = fire! And after wine = blood, it was easy, and it was fun."}, {"003f": "My other memory of early ideas about meals was not a recipe but the concept of a menu for a meal. When the icebox (it was a refrigerator but we called it the icebox) was crowded with little saved portions of leftovers, my father liked to cut up a couple of months from the calendar, producing two sets of numbers from 1 to 30, and put May’s days into his hat, and a June day in front of each of 30 dishes of old food, and what you drew from his hat you ate. He liked it if it was a food you hated. When it was Calendar Lunch, it was Calendar Lunch."}, {"5713": "My mother told me and my sister that we should never learn to cook. “Be careful of what you get good at, because you’ll end up having to do it,” my mom told us. She often delivered pithy life instructions while we waited for dinner."}, {"ffe0": "After our father flew the coop and offered no child support, my mom learned to drive a car. She put herself through school, too, so she could make a better life for us with no help from anyone. She did everything, but one thing she stopped doing with joy was cooking."}, {"c69e": "But, we still popped lots of popcorn. And we had lots of poppers. We had the popcorn pumper that looked like an upright torpedo and the hot air popper that shot popcorn out of what looked like a public hair dryer. We also had the As-Seen-On-TV version where we watched the popcorn explode in an amber plastic dome and when it was done popping, flipped it over and ate it straight out of the plastic. When microwave, fat-free popcorn came along, at first we thought we’d hit prairie gold, but my sister and I were not skilled with heat. The bag would get scorched and there were always lots of charcoal kernels, which we would eat."}, {"a704": "Skinny-Dipping at Dusk"}, {"c9cf": "8 cups water25 pounds cocoa"}, {"6762": "Store the water in a cool place, allowing it to bio-ripen for a period lasting months or even years. Meanwhile, fill your largest roasting pan with cocoa. Roll in cocoa."}, {"fb84": "Gone Fishin’"}, {"63e0": "1 telephone1 couch"}, {"a2ee": "Unplug the telephone and assume a position on your couch which suggests an odalisque or any late-career Ingres portrait. Should people or problems present themselves, bite into a nougatty chocolate and say teasingly, “I can’t help you. I’m very Ingres-y with you.” Let the slipcovers puddle around you like a light vinaigrette."}, {"7a09": "The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes, edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, and published by powerHouse Books, will be out on October 11, 2016."}], "child": "2273_12273_1", "parent": "", "title": "From Conquerer’s Canapés to Feminist Popcorn", "content": "From Conquerer’s Canapés to Feminist Popcorn Four recipes from Natalie Eve Garrett’s new collection Excerpted from The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes © 2016,edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, published by powerHouse Books. We are delighted to share excerpts from Hairpin contributor Natalie Eve Garrett’s new book, The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes. Inspired by a book from 1961, the book contains personal, food-related stories with recipes from 76 contemporary artists and writers. Below, you’ll find brief excerpts from four of the stories that appear in the book. I’d like to believe that these lowly marauders, taunting me with their silver trails of slime on my garden walls, would be pained to see that I’m eating their kin — that the sight of me forking the hot, wet-with-butter and fully parsleyed bodies of their brethren into my maw would cause them alarm. I’d like to think that if they had mouths they would cry out, if they had fists they would shake them at me, and that barring that they would retract their eye stalks and hurl themselves against the cold, hard ground until their shells splintered in protest. But they don’t. They are heartless. For the past 20 or so odd years, my husband and I have thrown a dinner party to celebrate the beginning of spring. Along with wearing flowers in our hair and rolling empty wine bottles for luck, it’s become a tradition for us to serve escargot. Every year there will be a guest who, pale and trembling, delights me with their confession that they have never had snails before. What an enormous pleasure it is to be the one to give them their first taste. Until the day when I launch my fleet of Escar-Go-Go food carts with go-go dancers in snail pasties, making your own will have to suffice. The first recipe I encountered was in a child’s cookbook; it was for “Candle Salad.” Painstakingly thorough directions led you to put a ring of canned pineapple on a plate, stick the top half of a banana down into the pineapple circle, and balance a maraschino cherry on top. I was enthralled. It was as if I was there at the invention of metaphor. Banana = candle! Cherry = fire! And after wine = blood, it was easy, and it was fun. My other memory of early ideas about meals was not a recipe but the concept of a menu for a meal. When the icebox (it was a refrigerator but we called it the icebox) was crowded with little saved portions of leftovers, my father liked to cut up a couple of months from the calendar, producing two sets of numbers from 1 to 30, and put May’s days into his hat, and a June day in front of each of 30 dishes of old food, and what you drew from his hat you ate. He liked it if it was a food you hated. When it was Calendar Lunch, it was Calendar Lunch. My mother told me and my sister that we should never learn to cook. “Be careful of what you get good at, because you’ll end up having to do it,” my mom told us. She often delivered pithy life instructions while we waited for dinner. After our father flew the coop and offered no child support, my mom learned to drive a car. She put herself through school, too, so she could make a better life for us with no help from anyone. She did everything, but one thing she stopped doing with joy was cooking. But, we still popped lots of popcorn. And we had lots of poppers. We had the popcorn pumper that looked like an upright torpedo and the hot air popper that shot popcorn out of what looked like a public hair dryer. We also had the As-Seen-On-TV version where we watched the popcorn explode in an amber plastic dome and when it was done popping, flipped it over and ate it straight out of the plastic. When microwave, fat-free popcorn came along, at first we thought we’d hit prairie gold, but my sister and I were not skilled with heat. The bag would get scorched and there were always lots of charcoal kernels, which we would eat. Skinny-Dipping at Dusk 8 cups water25 pounds cocoa Store the water in a cool place, allowing it to bio-ripen for a period lasting months or even years. Meanwhile, fill your largest roasting pan with cocoa. Roll in cocoa. Gone Fishin’ 1 telephone1 couch Unplug the telephone and assume a position on your couch which suggests an odalisque or any late-career Ingres portrait. Should people or problems present themselves, bite into a nougatty chocolate and say teasingly, “I can’t help you. I’m very Ingres-y with you.” Let the slipcovers puddle around you like a light vinaigrette. The Artists’ and Writers’ Cookbook: A Collection of Stories with Recipes, edited by Natalie Eve Garrett, illustrated by Amy Jean Porter, and published by powerHouse Books, will be out on October 11, 2016. ", "name": "2273"}