{"sentences": [{"3a5a": "In The Kitchen With Miss Piggy"}, {"b8aa": "Stormin’ Norman’s Sour Cream Peach Pie"}, {"fe8d": "At some point in my childhood, my sister and I fought endlessly over a Miss Piggy stuffed animal that came with our Happy Meals. One was a nattily-dressed Kermit the Frog, clad in a plaid vest and no pants. The other was Miss Piggy, resplendent in red and white, complete with a bonnet, dressed up for the holidays. Kermit was fine, but Miss Piggy was the real prize. I was an avid watcher of “Muppet Babies,” and a fan of any strong, independent thing with a penchant for a well-timed karate chop, Miss Piggy spoke to me on a molecular level. I deserved that Miss Piggy toy because I was Miss Piggy. My father saw otherwise. I retaliated by scribbling Magic Marker on the inside of Kermit’s permanently-agape felt mouth and playing with Miss Piggy when my sister wasn’t looking — a fitting tribute to Miss Piggy’s worldview and her distinct lack of fucks to give. As an icon for any young person, you could do worse than Miss Piggy."}, {"7ff3": "First, let’s set aside the fact that Miss Piggy is a puppet, a felt body with a snout and unblinking blue eyes, set aside when the day is over and the gig is done. We know that Miss Piggy’s a puppet, but she is also a celebrity, an entrepreneur, and, if you stretch the definition to include non-sentient beings, a feminist. A cook she is not. Her attitude towards food is a precursor to 2015’s snackwave. Before teens were tweeting about pizza and scrounging around their office’s kitchens for Goldfish and gummy candies, Miss Piggy was in a leotard and leg warmers, espousing the virtues of wearing clothes comfortable enough to consume a chocolate cream pie."}, {"e621": "Miss Piggy never does it herself. Why would she? She’s a glamorous pig with a packed social schedule and an infinite amount of celebrity friends. She’s taking meetings. She’s doing lunch. She’s in the dojo, working on her craft. Miss Piggy simply doesn’t have the time to cook, but she does have the time to outsource the onerous task of writing a cookbook to her many celebrity friends."}, {"7cd0": "The proceeds from “In The Kitchen With Miss Piggy,” her one and only foray into the thickets of celebrity cookery, went to Citymeals-on-Wheels, a charity organization that delivers hot meals to homebound elderly people. That alone is good enough reason to buy it. Miss Piggy’s explanation for why she chose to “write” this cookbook is a close second. The entire book is a master class in delegation, leaning in by leaning all the way out and asking other people to do the work for you. “When I was approached to write this cookbook, moi thought: Why not? If Oprah can do it…” she says. What follows is three instructions that clearly delineate what went into the outsourcing of these recipes. Her people called their people. She selected an outfit, then went on vacation while her people handled the dirty work."}, {"a439": "There are other helpful asides. To avoid eye contact with certain guests, Miss Piggy suggests a strategically placed centerpiece. Mood lighting is only necessary when dining with Kermit — candlelight or moonlight is best. For everyone else, “a bare light bulb will do just fine.” Seating arrangements at a dinner party are just as Piggy-centric as you’d expect, for the pig is nothing if not insatiably horny. A seating chart illustrated in the introduction puts Miss Piggy at the head of the table, surrounded by Kermit to her left, John Travolta to her right and Harry Belafonte, Matt Lauer, Plácido Domingo and Paul McCartney rounding out the group. Miss Piggy loves to love and to be loved and really, who can’t identify with that?"}, {"6583": "The celebrities featured in the book are a real grab bag, an assortment of people willing to help out with this charity while having a sense of humor about the whole thing. Ivana Trump donated a beef goulash recipe that looks tempting but felt inappropriately heavy for September. I briefly considered John Travolta’s Lobsters With Three Sauces, but realized the financial and organizational logistics of making lobster for four on a Monday afternoon were too complicated and set that aside for bougier times in the future. Maya Angelou’s jollof rice recipe will enter my repertoire once the final stickiness of summer leaves the air. Because I am a bad baker and like a challenge, I found the unlikeliest recipe in the book — General Norman Schwarzkopf’s Sour Cream Peach Pie."}, {"1135": "I know very little about Norman Schwarzkopf, save for vague, crackling memories from the news from my youth, around the time of Desert Storm. I never took him for a baker, but maybe in his retirement, he found quiet pleasure in throwing together a pie for the barbecue and placing it on the table. Maybe he was actually a baker, and this pie recipe, which leans heavily on pre-made ingredients, was a specialty of his, passed down from his mother. Quite possibly I’m projecting more onto Stormin’ Norman than is necessary, but his inclusion in this cookbook feels off. Maybe his publicist wanted some good press. We’ll never know."}, {"65a5": "Making the pie was simple enough: Canned peaches, drained of their juice, are sliced and layered into a frozen pie shell, covered in a sour cream, flour and sugar mixture and baked for 45 minutes. The resulting pie tastes like cheesecake: tooth-achingly sweet and much better cold. As a devotee of “The Great British Bake Off,” I feared the dreaded soggy bottom. I am sad to report that the crust was inedible. But, the filling of the pie itself — cakey, sweet, rich — is best eaten out of the pie tin in the morning, with an iced coffee, in silence."}], "child": "2274_1", "parent": "", "title": "In The Kitchen With Miss Piggy", "content": "In The Kitchen With Miss Piggy Stormin’ Norman’s Sour Cream Peach Pie At some point in my childhood, my sister and I fought endlessly over a Miss Piggy stuffed animal that came with our Happy Meals. One was a nattily-dressed Kermit the Frog, clad in a plaid vest and no pants. The other was Miss Piggy, resplendent in red and white, complete with a bonnet, dressed up for the holidays. Kermit was fine, but Miss Piggy was the real prize. I was an avid watcher of “Muppet Babies,” and a fan of any strong, independent thing with a penchant for a well-timed karate chop, Miss Piggy spoke to me on a molecular level. I deserved that Miss Piggy toy because I was Miss Piggy. My father saw otherwise. I retaliated by scribbling Magic Marker on the inside of Kermit’s permanently-agape felt mouth and playing with Miss Piggy when my sister wasn’t looking — a fitting tribute to Miss Piggy’s worldview and her distinct lack of fucks to give. As an icon for any young person, you could do worse than Miss Piggy. First, let’s set aside the fact that Miss Piggy is a puppet, a felt body with a snout and unblinking blue eyes, set aside when the day is over and the gig is done. We know that Miss Piggy’s a puppet, but she is also a celebrity, an entrepreneur, and, if you stretch the definition to include non-sentient beings, a feminist. A cook she is not. Her attitude towards food is a precursor to 2015’s snackwave. Before teens were tweeting about pizza and scrounging around their office’s kitchens for Goldfish and gummy candies, Miss Piggy was in a leotard and leg warmers, espousing the virtues of wearing clothes comfortable enough to consume a chocolate cream pie. Miss Piggy never does it herself. Why would she? She’s a glamorous pig with a packed social schedule and an infinite amount of celebrity friends. She’s taking meetings. She’s doing lunch. She’s in the dojo, working on her craft. Miss Piggy simply doesn’t have the time to cook, but she does have the time to outsource the onerous task of writing a cookbook to her many celebrity friends. The proceeds from “In The Kitchen With Miss Piggy,” her one and only foray into the thickets of celebrity cookery, went to Citymeals-on-Wheels, a charity organization that delivers hot meals to homebound elderly people. That alone is good enough reason to buy it. Miss Piggy’s explanation for why she chose to “write” this cookbook is a close second. The entire book is a master class in delegation, leaning in by leaning all the way out and asking other people to do the work for you. “When I was approached to write this cookbook, moi thought: Why not? If Oprah can do it…” she says. What follows is three instructions that clearly delineate what went into the outsourcing of these recipes. Her people called their people. She selected an outfit, then went on vacation while her people handled the dirty work. There are other helpful asides. To avoid eye contact with certain guests, Miss Piggy suggests a strategically placed centerpiece. Mood lighting is only necessary when dining with Kermit — candlelight or moonlight is best. For everyone else, “a bare light bulb will do just fine.” Seating arrangements at a dinner party are just as Piggy-centric as you’d expect, for the pig is nothing if not insatiably horny. A seating chart illustrated in the introduction puts Miss Piggy at the head of the table, surrounded by Kermit to her left, John Travolta to her right and Harry Belafonte, Matt Lauer, Plácido Domingo and Paul McCartney rounding out the group. Miss Piggy loves to love and to be loved and really, who can’t identify with that? The celebrities featured in the book are a real grab bag, an assortment of people willing to help out with this charity while having a sense of humor about the whole thing. Ivana Trump donated a beef goulash recipe that looks tempting but felt inappropriately heavy for September. I briefly considered John Travolta’s Lobsters With Three Sauces, but realized the financial and organizational logistics of making lobster for four on a Monday afternoon were too complicated and set that aside for bougier times in the future. Maya Angelou’s jollof rice recipe will enter my repertoire once the final stickiness of summer leaves the air. Because I am a bad baker and like a challenge, I found the unlikeliest recipe in the book — General Norman Schwarzkopf’s Sour Cream Peach Pie. I know very little about Norman Schwarzkopf, save for vague, crackling memories from the news from my youth, around the time of Desert Storm. I never took him for a baker, but maybe in his retirement, he found quiet pleasure in throwing together a pie for the barbecue and placing it on the table. Maybe he was actually a baker, and this pie recipe, which leans heavily on pre-made ingredients, was a specialty of his, passed down from his mother. Quite possibly I’m projecting more onto Stormin’ Norman than is necessary, but his inclusion in this cookbook feels off. Maybe his publicist wanted some good press. We’ll never know. Making the pie was simple enough: Canned peaches, drained of their juice, are sliced and layered into a frozen pie shell, covered in a sour cream, flour and sugar mixture and baked for 45 minutes. The resulting pie tastes like cheesecake: tooth-achingly sweet and much better cold. As a devotee of “The Great British Bake Off,” I feared the dreaded soggy bottom. I am sad to report that the crust was inedible. But, the filling of the pie itself — cakey, sweet, rich — is best eaten out of the pie tin in the morning, with an iced coffee, in silence. ", "name": "2274"}