{"sentences": [{"2ebf": "In the Kitchen With Coolio"}, {"b963": "The first installment in a series of Celebrity Cookbook Reviews"}, {"e862": "In 2012, Coolio, the rapper best known for “Gangster’s Paradise” and the theme song to “Kenan & Kel” underwent a career change and did his best to rebrand himself as a celebrity chef. First, there was an appearance on Guy Fieri’s team on the Food Network show “Rachael vs. Guy: Celebrity Cook-off,” in which various celebrities who either can or can’t cook compete in challenges for $50,000 to donate to charity. Coolio, naturally, was on Guy Fieri’s team. In the finale, he competed against Lou Diamond Phillips in a challenge that found both celebrities opening their own fine-dining restaurants and serving a bunch of strangers from the Los Angeles area. Coolio lost to Lou Diamond Phillips."}, {"6f67": "Coolio was undeterred. Riding off the high of his near-win and eager to reinvent himself, his YouTube show “Cookin’ With Coolio” is a peculiar bit of YouTube ephemera that serves as the perfect lead-in to his cookbook of the same name, released in 2012. The show itself is a spin-off of Oxygen’s 2008 reality show “Coolio’s Rules,” which documented the creation of a catering company. It’s filmed in a suburban kitchen in Los Angeles or maybe on a sound stage, it’s hard to tell. Accompanied by his assistant chef and cousin Jarez and two scantily clad sauce girls who do little more than stand awkwardly to the side, Coolio assumes the personality of a self-described “ghetto gourmet.” It’s clear from the show that he loves to cook. The focus is on food that’s easy to make, that tastes good, with simple ingredients that don’t cost an awful lot of money."}, {"1986": "Nothing about this looks like a Caprese salad that you’d order from a restaurant, but the elements are there. Never mind the moat of balsamic surrounding the tomatoes and the mozzarella arranged in a strange barrier wall as if meant to ward off invading enemies. There is basil. There is soft, white cheese. There is acid and a tomato. It’s a Caprese salad for absolute beginners, the kind constructed by someone who would turn the burner on high, place a frozen turkey burger in a pan and walk away, wondering why their house is filled with smoke five minutes later."}, {"dbad": "Every cookbook, celebrity or otherwise, has its own special vocabulary. Even a casual viewer of Rachael Ray’s “30 Minute Meals” knows what “EVOO” means and can properly identify a “stoup.” Coolio understands personal branding; any celebrity who enjoyed a meteoric rise to fame that plateaus is quick to embrace this and run with it. In his cookbook, Cookin’ With Coolio: 5 Star Meals At A 1 Star Price, Coolio is the “ghetto Martha Stewart,” a “kitchen pimp who won’t hesitate to fillet Bobby Flay.” Measurements are doled out in dime bags and nickel bags; ingredients “coagulate” instead of combine in a pan. Instead of the trademark “bam!” of Emeril Lagasse, Coolio punctuates the instructions for his dishes with a “Shaka-Zulu!” — a nod to his “ghetto witch doctor super hero aesthetic.”"}, {"7255": "The driving ethos of all of the recipes is budget. “People always try to tell you that you have to have money to eat well,” he writes in the intro. “I want people to know that just because you’re poor, you don’t have to eat fast food every day.” The ingredients are basic enough that they could be purchased either at a very nice bodega or a Whole Foods, depending on your mood. There is what I consider to be an excess of Balsamic vinegar. Tips for recipe modifications are interspersed throughout. Everything is easy; aside from a fried chicken recipe that would be made a lot easier with a deep fryer, no special equipment is required. Coolio makes food for people who are sick of ramen but disdainful of the fussiness of using a mandoline or julienning anything. A recent college graduate looking to stop ordering out would benefit from his guidance."}, {"d45b": "I made Coolio’s “Chicken Delight” one very hot afternoon because it looked hearty, seemed cheap and didn’t involve much time with the oven. The recipe calls for seven cans of beans: lima, lentils, white, pinto, red, black and butter. I went to Foodtown, eschewing the opulence of the Williamsburg Whole Foods, with its La Croix castle and endless rows of organic greens in plastic clamshells, not out of any statement, but because I like Foodtown and always have."}, {"5d6e": "Something about the finished meal reminded me a little bit of Tamar Adler, an overly precious food writer whose book An Everlasting Meal preaches the gospel of making a lot with very little, with a passion for beans that borders on the obsessive. Adler’s meals are meant for the intentionally austere, a contemporary lifestyle ascetic with GOOP-y tendencies. Her beans are dried, soaked overnight and, like all of her vegetables, boiled within an inch of their lives. Coolio’s beans, while canned, might offend Adler’s sensibilities, but the message is the same: food doesn’t have to cost a lot of money to taste good."}, {"04fa": "Preparing the dish was simple; I dumped six cans of beans into a large pot, sautéed some chicken and garlic and onion in another and then combined the two with at least 2 dime bags’ each of salt and pepper. Coolio recommended French bread as an accompaniment; I didn’t want French bread so I made some brown rice. I found a green onion or two and sliced its ends on top. I did not say “Shaka-Zulu” as Coolio might have asked, but the dish itself, as he said, was motherfuckin’ paradise."}], "child": "2276_1", "parent": "", "title": "In the Kitchen With Coolio", "content": "In the Kitchen With Coolio The first installment in a series of Celebrity Cookbook Reviews In 2012, Coolio, the rapper best known for “Gangster’s Paradise” and the theme song to “Kenan & Kel” underwent a career change and did his best to rebrand himself as a celebrity chef. First, there was an appearance on Guy Fieri’s team on the Food Network show “Rachael vs. Guy: Celebrity Cook-off,” in which various celebrities who either can or can’t cook compete in challenges for $50,000 to donate to charity. Coolio, naturally, was on Guy Fieri’s team. In the finale, he competed against Lou Diamond Phillips in a challenge that found both celebrities opening their own fine-dining restaurants and serving a bunch of strangers from the Los Angeles area. Coolio lost to Lou Diamond Phillips. Coolio was undeterred. Riding off the high of his near-win and eager to reinvent himself, his YouTube show “Cookin’ With Coolio” is a peculiar bit of YouTube ephemera that serves as the perfect lead-in to his cookbook of the same name, released in 2012. The show itself is a spin-off of Oxygen’s 2008 reality show “Coolio’s Rules,” which documented the creation of a catering company. It’s filmed in a suburban kitchen in Los Angeles or maybe on a sound stage, it’s hard to tell. Accompanied by his assistant chef and cousin Jarez and two scantily clad sauce girls who do little more than stand awkwardly to the side, Coolio assumes the personality of a self-described “ghetto gourmet.” It’s clear from the show that he loves to cook. The focus is on food that’s easy to make, that tastes good, with simple ingredients that don’t cost an awful lot of money. Nothing about this looks like a Caprese salad that you’d order from a restaurant, but the elements are there. Never mind the moat of balsamic surrounding the tomatoes and the mozzarella arranged in a strange barrier wall as if meant to ward off invading enemies. There is basil. There is soft, white cheese. There is acid and a tomato. It’s a Caprese salad for absolute beginners, the kind constructed by someone who would turn the burner on high, place a frozen turkey burger in a pan and walk away, wondering why their house is filled with smoke five minutes later. Every cookbook, celebrity or otherwise, has its own special vocabulary. Even a casual viewer of Rachael Ray’s “30 Minute Meals” knows what “EVOO” means and can properly identify a “stoup.” Coolio understands personal branding; any celebrity who enjoyed a meteoric rise to fame that plateaus is quick to embrace this and run with it. In his cookbook, Cookin’ With Coolio: 5 Star Meals At A 1 Star Price, Coolio is the “ghetto Martha Stewart,” a “kitchen pimp who won’t hesitate to fillet Bobby Flay.” Measurements are doled out in dime bags and nickel bags; ingredients “coagulate” instead of combine in a pan. Instead of the trademark “bam!” of Emeril Lagasse, Coolio punctuates the instructions for his dishes with a “Shaka-Zulu!” — a nod to his “ghetto witch doctor super hero aesthetic.” The driving ethos of all of the recipes is budget. “People always try to tell you that you have to have money to eat well,” he writes in the intro. “I want people to know that just because you’re poor, you don’t have to eat fast food every day.” The ingredients are basic enough that they could be purchased either at a very nice bodega or a Whole Foods, depending on your mood. There is what I consider to be an excess of Balsamic vinegar. Tips for recipe modifications are interspersed throughout. Everything is easy; aside from a fried chicken recipe that would be made a lot easier with a deep fryer, no special equipment is required. Coolio makes food for people who are sick of ramen but disdainful of the fussiness of using a mandoline or julienning anything. A recent college graduate looking to stop ordering out would benefit from his guidance. I made Coolio’s “Chicken Delight” one very hot afternoon because it looked hearty, seemed cheap and didn’t involve much time with the oven. The recipe calls for seven cans of beans: lima, lentils, white, pinto, red, black and butter. I went to Foodtown, eschewing the opulence of the Williamsburg Whole Foods, with its La Croix castle and endless rows of organic greens in plastic clamshells, not out of any statement, but because I like Foodtown and always have. Something about the finished meal reminded me a little bit of Tamar Adler, an overly precious food writer whose book An Everlasting Meal preaches the gospel of making a lot with very little, with a passion for beans that borders on the obsessive. Adler’s meals are meant for the intentionally austere, a contemporary lifestyle ascetic with GOOP-y tendencies. Her beans are dried, soaked overnight and, like all of her vegetables, boiled within an inch of their lives. Coolio’s beans, while canned, might offend Adler’s sensibilities, but the message is the same: food doesn’t have to cost a lot of money to taste good. Preparing the dish was simple; I dumped six cans of beans into a large pot, sautéed some chicken and garlic and onion in another and then combined the two with at least 2 dime bags’ each of salt and pepper. Coolio recommended French bread as an accompaniment; I didn’t want French bread so I made some brown rice. I found a green onion or two and sliced its ends on top. I did not say “Shaka-Zulu” as Coolio might have asked, but the dish itself, as he said, was motherfuckin’ paradise. ", "name": "2276"}