{"sentences": [{"90aa": "Can Just Anyone Make a Fancy Tiki Drink?"}, {"e384": "An investigation."}, {"e585": "Art: Kelly"}, {"4231": "Do you make cocktails at home? (Don’t answer.) I like making cocktails at home because you get to do a little something, and then you get a cocktail. Juice a fruit. Muddle mint. Pour “too much” olive juice into a cocktail shaker. Fill a martini glass with “too many” olives. “Freeze” the olives to make “cold olives.” Eat olives “on the side” also, just as a snack. And so on. It’s fun."}, {"f380": "If you’re not at home and are instead at your (my) favorite cocktail bar Clover Club, a cocktail I recommend getting is the “Voodoo Child.” It’s in the “Tiki Drink” section of the menu, which only exists during the summertime. (Though I think the “Voodoo Child” is offered regularly during other seasons, too.) (But I don’t know for sure.) (Find out for yourself.)"}, {"56b4": "It’s tart-y fruity and tastes good."}, {"c405": "“You make it sound so delicious,” you’re thinking, “but what if I am at home and I want to ‘get the “Voodoo Child?”’” Amazing question. I had the same question, and it led me to this video from Fox News, my favorite news outlet:"}, {"86cf": "Wow. I didn’t think the internet would provide me with exactly how to make this drink, but it did in about three seconds. Here are the ingredients:"}, {"edd5": "“Cachaça,” as snobs will eagerly tell you with a tone that indicates they assume you do not know already, is Brazil’s most popular spirit. It’s like rum. Hmm. Would the Rio Olympics have been a better “peg” for this post? Better than “no peg”? Almost certainly. But we’ve gotten off track."}, {"12d3": "Even though we know the ingredients and proportions, this drink still seemed a little daunting to me because what is lili’koi syrup? I wondered: Can just anyone make this drink that I like, from that place?"}, {"2202": "Amazing question."}, {"d4bd": "I thought the hardest part would be finding the cachaça, but that was actually the easiest part. It’s funny how life will surprise you. One minute you’re thinking finding the cachaça will be the hardest part, the next minute you’ve found the cachaça."}, {"44fc": "I found it at Smith & Vine, in case you’re in Carroll Gardens and need to either make this tiki drink or get rid of $40 (!!!!!!!!!!!!!!) real fast."}, {"9ab9": "The hardest part was finding “St. Elizabeth Allspice Dram,” because it was impossible and I did not find it. I looked in two places and then called another place and none of the places had it. Then I looked for allspice bitters at two more places, and couldn’t find that either. So I said, “fuck it.” You only need a ¼ oz anyway, who cares. I wish I never looked."}, {"fb76": "Lili’koi syrup is passion fruit syrup. I could not find passion fruit syrup anywhere, but you know what I did find? Passion fruits."}, {"f016": "Wow. Here’s how I made passion fruit syrup:"}, {"902e": "Boiling passion fruit syrup , yum."}, {"c944": "Honey syrup I made the same way, except with honey and no sugar."}, {"efee": "I juiced the fruits with my citrus juicer. I crushed the ice with my terrible blender that I bought on Amazon because it was the cheapest one."}, {"57ed": "Then I poured the ice into a tall glass, then poured all of the ingredients into a cocktail shaker with ice, then shook it up, and then spilled it everywhere:"}, {"8975": "It’s fine."}, {"c1c7": "I have a citrus zester so I zested some grapefruit zest for the top, but if you don’t have a citrus zester you don’t need the zest, I guess, if that’s the kind of life you want to live."}, {"e3e3": "Guess what: Even without the fucking allspice dram, it tasted great and nearly perfect. Except it had passion fruit seeds, which was unfortunate. Here is a picture of the real cocktail on the left, compared with the fake cocktail on the floor of my apartment:"}, {"9794": "Looks like a different color but I think we can all agree that that doesn’t matter."}, {"1097": "So that brings me to my question:"}, {"966f": "Can just anyone make this drink?"}, {"01bc": "And the answer is:"}, {"8455": "OK."}, {"1f94": "Well, the end."}], "child": "2277_1", "parent": "", "title": "Can Just Anyone Make a Fancy Tiki Drink?", "content": "Can Just Anyone Make a Fancy Tiki Drink? An investigation. Art: Kelly Do you make cocktails at home? (Don’t answer.) I like making cocktails at home because you get to do a little something, and then you get a cocktail. Juice a fruit. Muddle mint. Pour “too much” olive juice into a cocktail shaker. Fill a martini glass with “too many” olives. “Freeze” the olives to make “cold olives.” Eat olives “on the side” also, just as a snack. And so on. It’s fun. If you’re not at home and are instead at your (my) favorite cocktail bar Clover Club, a cocktail I recommend getting is the “Voodoo Child.” It’s in the “Tiki Drink” section of the menu, which only exists during the summertime. (Though I think the “Voodoo Child” is offered regularly during other seasons, too.) (But I don’t know for sure.) (Find out for yourself.) It’s tart-y fruity and tastes good. “You make it sound so delicious,” you’re thinking, “but what if I am at home and I want to ‘get the “Voodoo Child?”’” Amazing question. I had the same question, and it led me to this video from Fox News, my favorite news outlet: Wow. I didn’t think the internet would provide me with exactly how to make this drink, but it did in about three seconds. Here are the ingredients: “Cachaça,” as snobs will eagerly tell you with a tone that indicates they assume you do not know already, is Brazil’s most popular spirit. It’s like rum. Hmm. Would the Rio Olympics have been a better “peg” for this post? Better than “no peg”? Almost certainly. But we’ve gotten off track. Even though we know the ingredients and proportions, this drink still seemed a little daunting to me because what is lili’koi syrup? I wondered: Can just anyone make this drink that I like, from that place? Amazing question. I thought the hardest part would be finding the cachaça, but that was actually the easiest part. It’s funny how life will surprise you. One minute you’re thinking finding the cachaça will be the hardest part, the next minute you’ve found the cachaça. I found it at Smith & Vine, in case you’re in Carroll Gardens and need to either make this tiki drink or get rid of $40 (!!!!!!!!!!!!!!) real fast. The hardest part was finding “St. Elizabeth Allspice Dram,” because it was impossible and I did not find it. I looked in two places and then called another place and none of the places had it. Then I looked for allspice bitters at two more places, and couldn’t find that either. So I said, “fuck it.” You only need a ¼ oz anyway, who cares. I wish I never looked. Lili’koi syrup is passion fruit syrup. I could not find passion fruit syrup anywhere, but you know what I did find? Passion fruits. Wow. Here’s how I made passion fruit syrup: Boiling passion fruit syrup , yum. Honey syrup I made the same way, except with honey and no sugar. I juiced the fruits with my citrus juicer. I crushed the ice with my terrible blender that I bought on Amazon because it was the cheapest one. Then I poured the ice into a tall glass, then poured all of the ingredients into a cocktail shaker with ice, then shook it up, and then spilled it everywhere: It’s fine. I have a citrus zester so I zested some grapefruit zest for the top, but if you don’t have a citrus zester you don’t need the zest, I guess, if that’s the kind of life you want to live. Guess what: Even without the fucking allspice dram, it tasted great and nearly perfect. Except it had passion fruit seeds, which was unfortunate. Here is a picture of the real cocktail on the left, compared with the fake cocktail on the floor of my apartment: Looks like a different color but I think we can all agree that that doesn’t matter. So that brings me to my question: Can just anyone make this drink? And the answer is: OK. Well, the end. ", "name": "2277"}