{"sentences": [{"74c1": "Meet The ‘Cucamelon,’ The Cutest Fruit You’ll Ever See"}, {"7083": "Oh. My. God."}, {"cd7f": "Meet the “cucamelon,” the corgi of the fruit world. They’re an adorable grape-sized fruit in the cucumber family that taste like cucumbers with a hint of lime. How perfect does that sound?"}, {"0b9a": "Cucamelons are sometimes called Melothria scabra, mouse melons (lol) and Mexican sour gherkins, but we’re sticking with good ol’ “cucamelon” until someone tells us otherwise."}, {"df3b": "Homegrown Revolution"}, {"3e8a": "You can find them at many farmers’ markets or natural grocery stores, but they’re also easy to grow yourself. They’re delicious right off the vine, pickled or as a tangy addition to a summer recipe."}, {"0504": "In terms of recipes, try these to start — then get creative with your cucamelons!"}, {"1aac": "1. Cucamelon Bruschetta"}, {"4d56": "Sheeats"}, {"5c7e": "Add a tangy bite to your bruschetta. The cucamelon pairs well with other tangy ingredients like onion and vinaigrette dressing in this appetizer."}, {"c21e": "2. Cucamelon Radish Salad"}, {"64db": "WanderlustandFoodstuff"}, {"84cc": "Make this super simple and colorful side dish with radishes and cucamelons."}, {"b6f6": "3. Cucamelon Mojito"}, {"eff3": "ModMealsonMendenHall"}, {"253b": "And if you’d rather imbibe than eat (hey, we’re not judging) try this cucamelon mojito."}, {"61d2": "Enjoy! 🍸"}], "child": "2278_1\t2278_2\t2278_3", "parent": "", "title": "Meet The ‘Cucamelon,’ The Cutest Fruit You’ll Ever See", "content": "Meet The ‘Cucamelon,’ The Cutest Fruit You’ll Ever See Oh. My. God. Meet the “cucamelon,” the corgi of the fruit world. They’re an adorable grape-sized fruit in the cucumber family that taste like cucumbers with a hint of lime. How perfect does that sound? Cucamelons are sometimes called Melothria scabra, mouse melons (lol) and Mexican sour gherkins, but we’re sticking with good ol’ “cucamelon” until someone tells us otherwise. Homegrown Revolution You can find them at many farmers’ markets or natural grocery stores, but they’re also easy to grow yourself. They’re delicious right off the vine, pickled or as a tangy addition to a summer recipe. In terms of recipes, try these to start — then get creative with your cucamelons! 1. Cucamelon Bruschetta Sheeats Add a tangy bite to your bruschetta. The cucamelon pairs well with other tangy ingredients like onion and vinaigrette dressing in this appetizer. 2. Cucamelon Radish Salad WanderlustandFoodstuff Make this super simple and colorful side dish with radishes and cucamelons. 3. Cucamelon Mojito ModMealsonMendenHall And if you’d rather imbibe than eat (hey, we’re not judging) try this cucamelon mojito. Enjoy! 🍸 ", "name": "2278"}