{"sentences": [{"eec5": "Pana Pani Katha : Tales of Summer Sherbets"}, {"81a0": "#PanaSankranti"}, {"3a53": "The most crucial season of the year is round the corner. Though it’s the official season of Spring, but summer has become too impatient to occupy our lives. What does summer remind you of? The word conjures up images of a long endless journey in my mind- a journey to my grandparents’ home in a reddish government bus, and of my mother buying sleeveless frocks for us, me donning an almost *no-hair* haircut, buying new earthen pots for storing water & glass tumblers brimming with colourful sherbets."}, {"4c13": "An array of nostalgic memories bind my imagination as I sit down to type the memoir. As I close my eyes, I could see my grandmother holding a glass of dahi sherbet and asking me to finish it, as soon as I reach her place. That was the time when aerated cold drinks did not jam up our lives. As we shifted our food habits from home-grown, season-bound local food to canned and preservative-added food, (especially drinks) not only did we disturb the ecosystem, but also broke the harmony that exists between all the components of the earth."}, {"5e97": "We are approaching Maha Bishuba Sankranti or Pana Sankranti — also celebrated as the Odia New Year. I ponder, why have we named a festival after a drink? - ‘Pana’ here implying ‘drink.’ I find how meticulously our ancestors have built this tradition of offering Pana on each occasion. Our gods & godesses are also part of this socio-cultural tradition. If you check the culinary traditions of Shri Mandira, you’ll find that the trinities are offered Pana, in their Madhyahna Dhupa (Principal Mid-Day Bhoga) every single day. Similarly, who does not know about the fiercely Goddess Mangala, in whose offering this very Pana is the key ingredient?"}, {"8caf": "I firmly believe that our traditional wisdom knew the importance of these- Pana & that is why our ancestors made it mandatory for everybody in the form of festive rites."}, {"09a6": "When the trinity return from Ratha Jatra, they are offered, guess what, Pana on the chariot. The drink is offered in earthen pitchers which touch the lips of the deities. This is what is the famous Adhara Pana ritual, ‘Adhara’ being ‘lip’ in Odia.The pitchers are broken in the chariots & it is believed that the pana is relished by the “Parshwa Debata” or the protector god/goddess in the chariot. Many spirits, ghostly bodies who await for salvation are believed to partake this drink during this ritual."}, {"41d8": "Recipe :"}, {"befb": "In a large bowl, mix 2 lit. of water and jaggery together. Allow the jaggery to dissolve completely in water and then add mashed bananas, parched rice, grated coconut & crushed ginger. Mix thoroughly. Add milk and chhena into the bowl and give a swirl by a ladle. Now mix mango pulp, orange juice and grated apple in the bowl. The flavor of the drink comes from the whole spices & edible camphor. Garnish the drink with black pepper, cardamom, clove, edible camphor and nutmeg powder before offering to God.Be very careful, when you add the capmphor. It should not be more than the size of a sugar particle."}, {"2814": "2. Bela Pana : Bela (Bael/wood apple/stone apple)"}, {"fca4": "This humble bael tree has huge medicinal benefits. The leaves and fruits are very effective in maintaining the digestive system of human body. The ripened fruit is often prescribed to be taken as a remedy for gastric, acidity and stomach ulcer."}, {"611e": "Recipe"}, {"0ee0": "First, break the shell of the fruit. You may see some gum oozing out it. Scoop out the pulp (which has seeds as well) and transfer it to a bowl. Add a glass of water into it. Now you have to be little messy. Mash the pulp with water, squeeze out the juice. Throw the fibers, seeds out of it. Since its a pulpy fruit with less water content, straining is not an easy task. But if you want, you can strain through a muslin cloth. Add some more water into it. Now add, sugar, crushed pepper, grated coconut, mashed banana, chhena and ice cubes. Give it a good shake. Pour into individual glasses and enjoy."}, {"3a41": "3. Landa Bagula- Dahi Serbat"}, {"5ee9": "Now a days, the internet is abuzz with this, “Sabza” seeds topping everyone’s kitchen essentials. But do you know long before these internet gurus, our grannies used these seeds to make the drinks? These seeds locally known as Landa Baguli, are good for stomach and helps in reliving summer heat. You can get these seeds in any ayurvedic shop.These tiny black seeds are very useful in maintaining your digestive system in scorching summer."}, {"b82d": "Recipe"}, {"7e41": "To make the drink, whip sugar and curd together, so that sugar dissolves completely. Add the soaked seeds in this mixture. Add chilled water and pour into individual glasses. You can add a dash of lime juice for that fruity punch into this sherbet."}, {"463f": "4. Dahi, Golamaricha & Pudina Sherbet"}, {"d1f2": "This one is a very classic drink & can be prepared with very few ingredients available in your kitchen."}, {"03e8": "Recipe"}, {"0484": "This drink has all that punch you need in a summer afternoon. To make the drink, blend mint, ginger & green chilly together. Transfer this to a bowl and add yogurt, water, lime juice and salt into it. Pour into tall glasses, top with ice cubes and sprinkle some rock salt for extra zing."}, {"8a28": "5. Khajuri Mishri & Lembu Sherbet"}, {"99f3": "Khajuri mishri is the crystallized date palm sugar available in Odisha. The natural sugar in date palm is good for diabetic patients and controls blood pressure."}, {"1fb8": "Recipe"}, {"e80f": "Add the mishri in water and wait till all the crystals dissolve in it. Strain it through a strainer, squeeze lime into it. Add the soaked sabza seeds, top it with ice cubes and enjoy. You can also add some soda for that extra kick. Or may be you can go for some mint mojito for that refreshing splash."}, {"e4be": "Tanka Torani"}, {"47c8": "My article will not be complete without the mention of this quintessential summer drink. Everyone, who has visited Puri temple must have tasted this lip smacking drink in small earthen pots. This is arguably the most popular drink in Odisha."}, {"8d1c": "Generally prepared from the “Mahaprasada”/rice, this can be prepared at home & relished to quench the summer thirst."}, {"03c3": "Recipe"}, {"b5a5": "Add water to cooked rice (at room temperature) and mix them thoroughly.(You may use your hand and mash the rice a bit.) Now add all the ingredients into the rice-water mixture. Chill and serve in earthen pots. The best thing about this drink is, its easy to whip up & customisable."}, {"9a72": "While I am writing this, I am reminded of this particular line from a very famous song by Salabega, a very dear Muslim devotee of Lord Jaganntha & one of the finest composers of Odia literature."}, {"d129": "କ୍ଷୀରି ଖେଚେଡ଼ିରେ ମନ ନ ପୂରଇ ଟଙ୍କ ତୋରାଣିରେ ମନ ତୋଷ"}, {"c0b1": "“Oh, Lord, I am not satisfied with anything other than your Tanka Torani.”"}, {"c3d9": "Today, when I try to replicate all these drinks in my small rented apartment, I am transported back to the by lanes of my village, engulfed in the smell of nostalgia, unalloyed delights & many beautiful stories. May be someday, in this life, I would re live my lost childhood."}, {"c173": "Wishing you all a very happy #OdiaNewYear."}, {"39ba": "(ନବ ବର୍ଷର ଶୁଭକାମନା )"}, {"03cb": "With Love,"}, {"9cdf": "Sweta"}, {"d3f3": "Reference"}, {"53e8": "¹ Recipe of Adhara Pana adapted from the cookbook of Mrs. Prasanna Kumari Debi"}], "child": "2279_12279_1", "parent": "", "title": "Pana Pani Katha : Tales of Summer Sherbets", "content": "Pana Pani Katha : Tales of Summer Sherbets #PanaSankranti The most crucial season of the year is round the corner. Though it’s the official season of Spring, but summer has become too impatient to occupy our lives. What does summer remind you of? The word conjures up images of a long endless journey in my mind- a journey to my grandparents’ home in a reddish government bus, and of my mother buying sleeveless frocks for us, me donning an almost *no-hair* haircut, buying new earthen pots for storing water & glass tumblers brimming with colourful sherbets. An array of nostalgic memories bind my imagination as I sit down to type the memoir. As I close my eyes, I could see my grandmother holding a glass of dahi sherbet and asking me to finish it, as soon as I reach her place. That was the time when aerated cold drinks did not jam up our lives. As we shifted our food habits from home-grown, season-bound local food to canned and preservative-added food, (especially drinks) not only did we disturb the ecosystem, but also broke the harmony that exists between all the components of the earth. We are approaching Maha Bishuba Sankranti or Pana Sankranti — also celebrated as the Odia New Year. I ponder, why have we named a festival after a drink? - ‘Pana’ here implying ‘drink.’ I find how meticulously our ancestors have built this tradition of offering Pana on each occasion. Our gods & godesses are also part of this socio-cultural tradition. If you check the culinary traditions of Shri Mandira, you’ll find that the trinities are offered Pana, in their Madhyahna Dhupa (Principal Mid-Day Bhoga) every single day. Similarly, who does not know about the fiercely Goddess Mangala, in whose offering this very Pana is the key ingredient? I firmly believe that our traditional wisdom knew the importance of these- Pana & that is why our ancestors made it mandatory for everybody in the form of festive rites. When the trinity return from Ratha Jatra, they are offered, guess what, Pana on the chariot. The drink is offered in earthen pitchers which touch the lips of the deities. This is what is the famous Adhara Pana ritual, ‘Adhara’ being ‘lip’ in Odia.The pitchers are broken in the chariots & it is believed that the pana is relished by the “Parshwa Debata” or the protector god/goddess in the chariot. Many spirits, ghostly bodies who await for salvation are believed to partake this drink during this ritual. Recipe : In a large bowl, mix 2 lit. of water and jaggery together. Allow the jaggery to dissolve completely in water and then add mashed bananas, parched rice, grated coconut & crushed ginger. Mix thoroughly. Add milk and chhena into the bowl and give a swirl by a ladle. Now mix mango pulp, orange juice and grated apple in the bowl. The flavor of the drink comes from the whole spices & edible camphor. Garnish the drink with black pepper, cardamom, clove, edible camphor and nutmeg powder before offering to God.Be very careful, when you add the capmphor. It should not be more than the size of a sugar particle. 2. Bela Pana : Bela (Bael/wood apple/stone apple) This humble bael tree has huge medicinal benefits. The leaves and fruits are very effective in maintaining the digestive system of human body. The ripened fruit is often prescribed to be taken as a remedy for gastric, acidity and stomach ulcer. Recipe First, break the shell of the fruit. You may see some gum oozing out it. Scoop out the pulp (which has seeds as well) and transfer it to a bowl. Add a glass of water into it. Now you have to be little messy. Mash the pulp with water, squeeze out the juice. Throw the fibers, seeds out of it. Since its a pulpy fruit with less water content, straining is not an easy task. But if you want, you can strain through a muslin cloth. Add some more water into it. Now add, sugar, crushed pepper, grated coconut, mashed banana, chhena and ice cubes. Give it a good shake. Pour into individual glasses and enjoy. 3. Landa Bagula- Dahi Serbat Now a days, the internet is abuzz with this, “Sabza” seeds topping everyone’s kitchen essentials. But do you know long before these internet gurus, our grannies used these seeds to make the drinks? These seeds locally known as Landa Baguli, are good for stomach and helps in reliving summer heat. You can get these seeds in any ayurvedic shop.These tiny black seeds are very useful in maintaining your digestive system in scorching summer. Recipe To make the drink, whip sugar and curd together, so that sugar dissolves completely. Add the soaked seeds in this mixture. Add chilled water and pour into individual glasses. You can add a dash of lime juice for that fruity punch into this sherbet. 4. Dahi, Golamaricha & Pudina Sherbet This one is a very classic drink & can be prepared with very few ingredients available in your kitchen. Recipe This drink has all that punch you need in a summer afternoon. To make the drink, blend mint, ginger & green chilly together. Transfer this to a bowl and add yogurt, water, lime juice and salt into it. Pour into tall glasses, top with ice cubes and sprinkle some rock salt for extra zing. 5. Khajuri Mishri & Lembu Sherbet Khajuri mishri is the crystallized date palm sugar available in Odisha. The natural sugar in date palm is good for diabetic patients and controls blood pressure. Recipe Add the mishri in water and wait till all the crystals dissolve in it. Strain it through a strainer, squeeze lime into it. Add the soaked sabza seeds, top it with ice cubes and enjoy. You can also add some soda for that extra kick. Or may be you can go for some mint mojito for that refreshing splash. Tanka Torani My article will not be complete without the mention of this quintessential summer drink. Everyone, who has visited Puri temple must have tasted this lip smacking drink in small earthen pots. This is arguably the most popular drink in Odisha. Generally prepared from the “Mahaprasada”/rice, this can be prepared at home & relished to quench the summer thirst. Recipe Add water to cooked rice (at room temperature) and mix them thoroughly.(You may use your hand and mash the rice a bit.) Now add all the ingredients into the rice-water mixture. Chill and serve in earthen pots. The best thing about this drink is, its easy to whip up & customisable. While I am writing this, I am reminded of this particular line from a very famous song by Salabega, a very dear Muslim devotee of Lord Jaganntha & one of the finest composers of Odia literature. କ୍ଷୀରି ଖେଚେଡ଼ିରେ ମନ ନ ପୂରଇ ଟଙ୍କ ତୋରାଣିରେ ମନ ତୋଷ “Oh, Lord, I am not satisfied with anything other than your Tanka Torani.” Today, when I try to replicate all these drinks in my small rented apartment, I am transported back to the by lanes of my village, engulfed in the smell of nostalgia, unalloyed delights & many beautiful stories. May be someday, in this life, I would re live my lost childhood. Wishing you all a very happy #OdiaNewYear. (ନବ ବର୍ଷର ଶୁଭକାମନା ) With Love, Sweta Reference ¹ Recipe of Adhara Pana adapted from the cookbook of Mrs. Prasanna Kumari Debi ", "name": "2279"}