{"name": "228", "parent": "", "content": "How to Live with the Muggle You Love 10 Ways To Survive a Mixed Temperament Relationship My husband is negative by nature. Here’s how he asked me out for the first time: You don’t want to go to a movie, do you? I had to argue with him to give him the answer he wanted. It’s just how he is. How his brain works. He’s my darling curmudgeon. Our daughter calls him a muggle, and the fact that he doesn’t know what a muggle is pretty much ties that one up with a bow. No matter what I bring up with him, his first response is to filter through every possible problem that might possibly ever happen in this or any other universe. Last week I asked him if he wants to spend a day at the beach when we visit Southern California in June. No brainer, right? But I got to hear about how he hates putting on sunblock, all about how there might be sharks, a story about how he was once at the Jersey shore and saw a turd floating in the water, and do I want to know who many dead people are cremated and their remains sprinkled into the ocean? And then: sure, let’s go. It’ll be fun. Only by the time he got around to it, I felt like I might never put a toe in water outside my bathtub again. After fourteen years, I’m used to it. He comes by it naturally, both of his parents are the same. They’re a Pennsylvania Dutch family and I sometimes wonder if it’s cultural. I’m a sunny California girl, and I’m pretty sure my optimism is cultural. I’m not going to lie. It’s rough on a natural optimist to run into a brick wall of pessimism on the regular. My thought process is the inversion of his. If you ask me if I want to go to the beach, I’m halfway there before it occurs to me to remember that I was supposed to work this afternoon or that crowds make me itchy. Thank God I never think of things like cremains in the ocean. The negative filters into me later. It has to drip down through all positive so it just never gets the depth that his does. I’m an idea girl. He’s a results guy. I regularly try to take on the world. He holds on to my tether to make sure I don’t float out into deep space. I’m the mac, he’s the cheese. If you’re an optimist who loves a curmudgeon, here are some ideas that might help you: If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "title": "How to Live with the Muggle You Love", "sentences": [{"afb4": "How to Live with the Muggle You Love"}, {"ea3c": "10 Ways To Survive a Mixed Temperament Relationship"}, {"02ec": "My husband is negative by nature."}, {"5209": "Here’s how he asked me out for the first time:"}, {"4020": "You don’t want to go to a movie, do you?"}, {"3500": "I had to argue with him to give him the answer he wanted. It’s just how he is. How his brain works. He’s my darling curmudgeon."}, {"69df": "Our daughter calls him a muggle, and the fact that he doesn’t know what a muggle is pretty much ties that one up with a bow."}, {"6358": "No matter what I bring up with him, his first response is to filter through every possible problem that might possibly ever happen in this or any other universe."}, {"8a40": "Last week I asked him if he wants to spend a day at the beach when we visit Southern California in June. No brainer, right?"}, {"b73e": "But I got to hear about how he hates putting on sunblock, all about how there might be sharks, a story about how he was once at the Jersey shore and saw a turd floating in the water, and do I want to know who many dead people are cremated and their remains sprinkled into the ocean?"}, {"623a": "And then: sure, let’s go. It’ll be fun."}, {"186d": "Only by the time he got around to it, I felt like I might never put a toe in water outside my bathtub again."}, {"1105": "After fourteen years, I’m used to it. He comes by it naturally, both of his parents are the same. They’re a Pennsylvania Dutch family and I sometimes wonder if it’s cultural. I’m a sunny California girl, and I’m pretty sure my optimism is cultural."}, {"f98b": "I’m not going to lie. It’s rough on a natural optimist to run into a brick wall of pessimism on the regular."}, {"4918": "My thought process is the inversion of his."}, {"5353": "If you ask me if I want to go to the beach, I’m halfway there before it occurs to me to remember that I was supposed to work this afternoon or that crowds make me itchy."}, {"1a7c": "Thank God I never think of things like cremains in the ocean."}, {"2ff1": "The negative filters into me later. It has to drip down through all positive so it just never gets the depth that his does."}, {"fe44": "I’m an idea girl. He’s a results guy."}, {"63b7": "I regularly try to take on the world."}, {"d678": "He holds on to my tether to make sure I don’t float out into deep space."}, {"72bd": "I’m the mac, he’s the cheese."}, {"d6ed": "If you’re an optimist who loves a curmudgeon, here are some ideas that might help you:"}, {"599e": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "child": "228_1\t228_2\t228_3\t228_4\t228_5228_1\t228_2\t228_3\t228_4\t228_5"}