{"sentences": [{"62fa": "I have no appetite until well after noon."}, {"4155": "I’m eating a bowl of cereal now. It’s 8:19am. Three bites in and it just seems gross to continue. I hear it popping at me now. Each pop a tiny cell wall eroded by the almond milk. A tiny scream of saturation and relentless soggification."}, {"832b": "I like coffee. I wish that were enough to live on. The cereal is still popping. Fewer and further between now. It’s becoming mush. I hate wasting food more than just about anything. I must continue. I must think of the energy it will give me in the meeting this morning. Real energy. Not the false hope of my coffee. Coffee is warm and wonderful though! This cereal has now become ….. FUCK!"}, {"7e7e": "Spilled it onto my keyboard. Just spent 5 mins cleaning it up. Hopefully didn't trash my arrow keys. I tried to pour some of the almond milk into my coffee."}, {"045e": "The cereal and milk were mixing into a sickening sweet slurry. I tried to pour it out of the bowl but it grabbed the side, of course, and made a huge mess. THIS IS WHY I HATE EATING IN THE MORNING! Some BS always happens with my food, utensils, or other."}, {"5124": "Coffee. That’s it. Done. I put the rest of the bowl in the fridge. I will eat it. I hate wasting food."}, {"e343": "Maybe just an apple next time."}], "child": "2281_1\t2281_2\t2281_3", "parent": "", "title": "I have no appetite until well after noon.", "content": "I have no appetite until well after noon. I’m eating a bowl of cereal now. It’s 8:19am. Three bites in and it just seems gross to continue. I hear it popping at me now. Each pop a tiny cell wall eroded by the almond milk. A tiny scream of saturation and relentless soggification. I like coffee. I wish that were enough to live on. The cereal is still popping. Fewer and further between now. It’s becoming mush. I hate wasting food more than just about anything. I must continue. I must think of the energy it will give me in the meeting this morning. Real energy. Not the false hope of my coffee. Coffee is warm and wonderful though! This cereal has now become ….. FUCK! Spilled it onto my keyboard. Just spent 5 mins cleaning it up. Hopefully didn't trash my arrow keys. I tried to pour some of the almond milk into my coffee. The cereal and milk were mixing into a sickening sweet slurry. I tried to pour it out of the bowl but it grabbed the side, of course, and made a huge mess. THIS IS WHY I HATE EATING IN THE MORNING! Some BS always happens with my food, utensils, or other. Coffee. That’s it. Done. I put the rest of the bowl in the fridge. I will eat it. I hate wasting food. Maybe just an apple next time. ", "name": "2281"}