{"sentences": [{"2d79": "Don’t Let Me Babysit Your Kids"}, {"71a8": "Let me start off with some unusual honesty. I’m not here to regulate your children. I’m not here to tell them what’s right and what’s wrong. I’m here to give them a new type of experience; a memorable one."}, {"83ab": "If I’m spending time with your children I’ll want to talk to them about the stars and Carl Sagan. We’d build a space ship from discarded boxes and explore the solar system. We’d wrap ourselves in aluminum foil space suits and line our astronaut helmets with the same leftover aluminum before the asteroids get too close. The plastic tupperware squares and rectangles from the pan tree would shield us from intense heat so that we could walk on the sun. We’d encounter extraterrestrial life and have to battle it out with lasers powered by moon rocks when diplomacy failed. Grab those long paper towel rolls and chase after the poor alien moon dog."}, {"f79b": "It never had a chance against our superior technology."}, {"6ac0": "For lunch we’d cook with our hands, and undoubtedly leave a huge mess in the kitchen. We’d experiment with lemons and sugar, and I’d show them the science behind how to make sour cream. I’d explain that science extends into every inch of existence, and that your taste buds are a universe you can explore without a space ship. Don’t be afraid to add salt, or pepper, or to mess up the dish you made. It’s okay, you can just wash it down the drain and start again. They will learn that the process towards a destination is what makes the end result so satisfying, you’ll get it eventually."}, {"bc02": "Let’s just order some pizza."}, {"1c06": "After lunch I’d read them a book on the couch until they fell asleep for a nap; then I’d rest my eyes for a moment. I earned it. We’d wake up twenty minutes later when we hear their former alien dog barking at a squirrel running around outside. I’d ask them if they want to go to the park, they scream yes, and we hop in my car. Everyone will be required to wear their seat belts on this interstellar drive through the black hole void of this town."}, {"6b27": "I’d watch them run around on the playground and remember when I thought playgrounds were just the best . We’d stay there for an hour then get some ice cream. I’d ask them if they had any dreams while they napped, and ask them what they wish they could dream about. We’d talk about our worst dreams, and what they’re most afraid of. After that, tickle attack! The tickle monster is going to get you! Raar! They form a defensive strategy and beat me into submission with wooden clubs, formerly wrapping paper tubes, which then turn into magma cannons."}, {"6965": "Let me be clear, you won’t let me babysit your children. I wouldn’t treat them like mindless beings devoid of critical thinking skills. I’d talk to them like mini-people, constantly observing and trying to figure out the mystery of life they were involuntarily born into. I’d encourage independence and creativity."}, {"8edb": "When their parents come home the house is a mess, but their kids are smiling from ear to ear. I wonder which thing they’d notice."}], "child": "2282_1", "parent": "", "title": "Don’t Let Me Babysit Your Kids", "content": "Don’t Let Me Babysit Your Kids Let me start off with some unusual honesty. I’m not here to regulate your children. I’m not here to tell them what’s right and what’s wrong. I’m here to give them a new type of experience; a memorable one. If I’m spending time with your children I’ll want to talk to them about the stars and Carl Sagan. We’d build a space ship from discarded boxes and explore the solar system. We’d wrap ourselves in aluminum foil space suits and line our astronaut helmets with the same leftover aluminum before the asteroids get too close. The plastic tupperware squares and rectangles from the pan tree would shield us from intense heat so that we could walk on the sun. We’d encounter extraterrestrial life and have to battle it out with lasers powered by moon rocks when diplomacy failed. Grab those long paper towel rolls and chase after the poor alien moon dog. It never had a chance against our superior technology. For lunch we’d cook with our hands, and undoubtedly leave a huge mess in the kitchen. We’d experiment with lemons and sugar, and I’d show them the science behind how to make sour cream. I’d explain that science extends into every inch of existence, and that your taste buds are a universe you can explore without a space ship. Don’t be afraid to add salt, or pepper, or to mess up the dish you made. It’s okay, you can just wash it down the drain and start again. They will learn that the process towards a destination is what makes the end result so satisfying, you’ll get it eventually. Let’s just order some pizza. After lunch I’d read them a book on the couch until they fell asleep for a nap; then I’d rest my eyes for a moment. I earned it. We’d wake up twenty minutes later when we hear their former alien dog barking at a squirrel running around outside. I’d ask them if they want to go to the park, they scream yes, and we hop in my car. Everyone will be required to wear their seat belts on this interstellar drive through the black hole void of this town. I’d watch them run around on the playground and remember when I thought playgrounds were just the best . We’d stay there for an hour then get some ice cream. I’d ask them if they had any dreams while they napped, and ask them what they wish they could dream about. We’d talk about our worst dreams, and what they’re most afraid of. After that, tickle attack! The tickle monster is going to get you! Raar! They form a defensive strategy and beat me into submission with wooden clubs, formerly wrapping paper tubes, which then turn into magma cannons. Let me be clear, you won’t let me babysit your children. I wouldn’t treat them like mindless beings devoid of critical thinking skills. I’d talk to them like mini-people, constantly observing and trying to figure out the mystery of life they were involuntarily born into. I’d encourage independence and creativity. When their parents come home the house is a mess, but their kids are smiling from ear to ear. I wonder which thing they’d notice. ", "name": "2282"}