{"name": "229", "parent": "", "content": "Ladies Whatever You Do Please Avoid This Kind Of Man At All Cost Not every guy you meet wants the same thing you want Disclaimer: I must inform you all that I am not the character in any of these writings, I am simply writing to show the psychology of those whose characterizations I am making. These viewpoints do not demonstrate my own viewpoints. She says, “You are everything I’ve ever wanted,” He thinks, “She wants what she can’t have. ” This is the story of the Loveless One, a character that many men, and many women may identify with. Written by me, to explain how some people think… The “Loveless Man” Every girl I have ever been in a relationship with, I wouldn’t hesitate to cheat on. In fact I’ve cheated on every girl I’ve had: “friends with benefits,” “girlfriend,” “potential romance,” you name it. There was this one time, I had a fiance. I bought her the engagement ring and everything, told her how much I love her, did that thing where you get on one knee. It’s hysterical how much she really believed me, I didn’t feel a thing. I saw her face tear up. I saw it in her eyes, this happiness, the kind that overwhelms a person; the kind that makes one thing that for a second the world stands still. I saw her realization that for once in her life everything is working out for her. Meanwhile, I just wanted to see her face when she realizes it’s all a lie. When her tears don’t overflow in joy, but are withdrawn, puff up the face and are afraid to fall. It’s all a game. She fell for someone who would never fall for her. She says, “I’ve never believed in love until I met you.” And I just think the whole time, “I’ll never believe in love until I break your heart to prove it exist.” I break hearts you might say, but never intentionally. I’d like to think that it is society that breaks their hearts. Teaches these women to depend on a guy like me, teaches them to think there exist a thing like soulmates. What they think they know of me, and what they have been taught to accept of me by generalities based off my natural tendencies to be a “nice” guy. Their misconceptions of what actually is the reality is what breaks their hearts. I am of the school of thought, where to live simply means to adapt and survive. I don’t entangle myself with the peculiarities and subtleties of love. I’m a renaissance man, my freedom is logic- my art is reason. Either I be indulged or indulge. The present moment is my forte. So ladies, if we encounter, I mean no harm. The way I treat a lady, is only an extension of my own conception of love. Some people love differently than others, I love in a way our society may not currently understand. Certainly God Himself would not hold me accountable for my own perception of love, so neither should you. Love is love. ", "title": "Ladies Whatever You Do Please Avoid This Kind Of Man At All Cost", "sentences": [{"a9d4": "Ladies Whatever You Do Please Avoid This Kind Of Man At All Cost"}, {"af61": "Not every guy you meet wants the same thing you want"}, {"2bd9": "Disclaimer: I must inform you all that I am not the character in any of these writings, I am simply writing to show the psychology of those whose characterizations I am making. These viewpoints do not demonstrate my own viewpoints."}, {"cf59": "She says, “You are everything I’ve ever wanted,” He thinks, “She wants what she can’t have. ”"}, {"570d": "This is the story of the Loveless One, a character that many men, and many women may identify with. Written by me, to explain how some people think…"}, {"27df": "The “Loveless Man”"}, {"f8cc": "Every girl I have ever been in a relationship with, I wouldn’t hesitate to cheat on. In fact I’ve cheated on every girl I’ve had: “friends with benefits,” “girlfriend,” “potential romance,” you name it."}, {"4747": "There was this one time, I had a fiance. I bought her the engagement ring and everything, told her how much I love her, did that thing where you get on one knee. It’s hysterical how much she really believed me, I didn’t feel a thing. I saw her face tear up. I saw it in her eyes, this happiness, the kind that overwhelms a person; the kind that makes one thing that for a second the world stands still. I saw her realization that for once in her life everything is working out for her."}, {"039e": "Meanwhile, I just wanted to see her face when she realizes it’s all a lie. When her tears don’t overflow in joy, but are withdrawn, puff up the face and are afraid to fall. It’s all a game. She fell for someone who would never fall for her. She says, “I’ve never believed in love until I met you.” And I just think the whole time, “I’ll never believe in love until I break your heart to prove it exist.”"}, {"2c70": "I break hearts you might say, but never intentionally. I’d like to think that it is society that breaks their hearts. Teaches these women to depend on a guy like me, teaches them to think there exist a thing like soulmates. What they think they know of me, and what they have been taught to accept of me by generalities based off my natural tendencies to be a “nice” guy."}, {"a554": "Their misconceptions of what actually is the reality is what breaks their hearts. I am of the school of thought, where to live simply means to adapt and survive. I don’t entangle myself with the peculiarities and subtleties of love."}, {"5f37": "I’m a renaissance man, my freedom is logic- my art is reason. Either I be indulged or indulge. The present moment is my forte. So ladies, if we encounter, I mean no harm."}, {"d51d": "The way I treat a lady, is only an extension of my own conception of love. Some people love differently than others, I love in a way our society may not currently understand. Certainly God Himself would not hold me accountable for my own perception of love, so neither should you. Love is love."}], "child": "229_1\t229_2\t229_3\t229_4\t229_5"}