{"sentences": [{"512c": "How The Beatles Helped Me Survive Brain Cancer"}, {"9dca": "What stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons"}, {"9934": "By Mark Schoneveld"}, {"aedf": "Rocking out on the proton therapy table."}, {"fb35": "The Beatles’ 1968’s double-disc record The Beatles (often known affectionately as the White Album) has always been one of my all time favorites. But it wasn’t until I got brain cancer that I truly learned to appreciate it, and to understand some of its deeper truths."}, {"3d0a": "For six weeks, I was locked down into a proton therapy machine for 45 minutes at a time, as millions of invisible particles bombarded my brain, trying to burn out the malignant tumor that was growing inside. It may be slightly hyperbolic coming from a music geek like me, but if not for the White Album, I might never have survived that time."}, {"204a": "When I was diagnosed with cancer, I had no knowledge of what proton therapy was, or what it entailed. As I was introduced to the treatment, my doctor described the process. It sounded relatively easy, burning out malignant tumor growth in the center of my brain. I joked with him: “So you’re going to shoot lasers into my head?”"}, {"637a": "“No,” he replied, deadpan-serious. “Proton beams are not lasers.”"}, {"4671": "“Will this be anything like the MRI machine?” I asked. I’d already had a dozen or more MRIs validating the shape and size of my tumor, so I already knew what the experience was like: the claustrophobic feeling of being trapped in that tiny tube, enveloped by blood-curdling blasts of big robotic rumbling. As a professional music critic, I found it especially discordant: an MRI test is the antithesis of music. Luckily they give you earplugs."}, {"8341": "“No,” he told me. “You won’t hear a thing.”"}, {"8dd2": "But, luckily, that wasn’t true."}, {"e01f": "When I disrobed and entered the proton room for the first time, the ambience was forbidding. It was a large space with a high ceiling, and the room was chilly as I lay down on the table. They fitted me with a custom-built hard plastic mask; it fit snugly to my face, assuring that the proton beam could direct its blast to the precise spot of my tumor. Once I lay down, the mask was clipped to the table, locking me — and my head — in place."}, {"23ab": "Bird’s eye view of getting my brain tumor blasted by protons."}, {"54d6": "“Do you like music? We have a few CDs over here if you’d like to listen to something while we go through our business setting up,” the nurse asked me."}, {"efb3": "I get asked about music a lot, but I’m always hesitant to make suggestions. I feel like my brain is so full of music that I can barely pick out one or two songs without worrying that the whole piñata will explode."}, {"4305": "Keep it simple, man, I told myself. “Do you have The Beatles?”"}, {"a218": "“Ah, we do! The White Album, does that work?”"}, {"72c6": "“Oh my god, that’s amazing. Yes, please.”"}, {"a028": "A blessing from the universe. Everything about the White Album has fascinated me, ever since I first heard it. It represents an epochal moment in music history."}, {"d4c1": "John, George, Paul and Ringo"}, {"7931": "The year is 1968. The Beatles were splintering. After a couple months spent hanging out in Rishikesh, India with Maharishi Mahesh Yogi and smoking plenty of grass, The Beatles had written some of the best pop songs ever. But a different kind of cancer than my own had found root in the band. Experts differ on what it was: was it John and Yoko’s relationship? Was it Paul’s perfectionism? Was it Ringo’s feeling disrespected, or George’s deep dive into Hinduism?"}, {"d282": "Whatever it was, by the time they came together to complete one of their last original albums, they could barely be in the same room together. The record is entirely built piece by piece, like slowly healing scars. Each song demonstrated the strength of the writer, but revealed how distant these individual band members had become from the group. Once complete, the work became one of the last records they’d ever make together."}, {"d10e": "The only thing that stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons."}, {"1f31": "Despite the tumult, it just worked. And that record kept me sane, seeming to reflect my own experience of being treated for cancer in a space oddly melodic in its own discord."}, {"674c": "Paul’s tongue-in-cheek rocker “Back in the USSR” starts with the sound of a jet plane taking off. It was an energetic launch pad for my radiation room, but I found the humor in it: it always gave me a smile. The only thing that stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons."}, {"5919": "But that’s just the blast-off. Part of what defines the White Album is its melancholy edge. Although the tracks first seem saccharine sweet, each song has an undercurrent of pain, weeping, and need."}, {"788c": "The only truly silly song, “Ob-La-Di, Ob-La-Da”, may have been a cute track, but it caused tumult within the band. Everyone hated it but Paul. But that song is quickly balanced out by the powerhouse of “While My Guitar Gently Weeps,” where George’s breath itself sounds like it hurts."}, {"2761": "From there, we lead directly into “Happiness is a Warm Gun.” That’s what this album is to me: the happiness of a warm gun. Each and every song has a trigger: my nerves tingle, my body couldn’t move."}, {"4a41": "“Martha My Dear” sings: When you find yourself in the thick of it. Just like I’m in the thick of it now."}, {"94fd": "I read “I’m So Tired” as a cancer song. I don’t know what to do. My mind is set on you? I’d give you everything I’ve got for a piece of mind. And forgiving the pun, do I hear that: I’d give anything for some piece of mind after all this."}, {"76cc": "An original vinyl copy of the White Album."}, {"2a40": "So even though I’ve heard the White Album a thousand times, and will probably hear it a thousand more, I never really heard it like I did then. Every time I left the treatment room, I felt rejuvenated: the war on my cancer, the power of science and my own body, all melting away into the audiophonic bliss of an album that sometimes felt like it had been written just for what I was going through."}, {"ae49": "Not going to lie. Some days I felt the willingness to allow despair to win. Some moments I didn’t want to go to treatment at all. I went day in and day out for weeks. It was a tough time where my heart was constantly racing, and I was battling doubt at every moment. But music puts hope around me… and, more specifically, the White Album does it for me, maybe more than any other. And if I had to explain why, I’d say it’s because it’s an album that prays for you."}, {"aeee": "Since the White Album is 93 minutes long, and my proton beams sessions only half that, the last song I heard every session was “Blackbird.” It’s a deeply peaceful track, where the titular blackbird chirps in the background, while Paul sings a haunting coda:"}, {"7589": "Blackbird singing in the dead of nightTake these broken wings and learn to flyAll your lifeYou were only waiting for this moment to ariseYou were only waiting for this moment to ariseYou were only waiting for this moment to arise"}, {"f019": "Now my kids are asleep, and I’m listening to the record on my headphones, thinking about my treatment. The whole experience feels so distant, like it was all a dream or a strange piece of performance art. Perhaps when the White Album was put together, the band brought back bittersweet moments for them, too."}, {"a67a": "The Beatles playing together for the last time."}, {"fc49": "But the music of the White Album transcends The Beatles’ in-fighting, just like it transcends cancer and proton beams. It’s not about the regrets of the past, or the fears of the future. It’s just a moment, piercing into right now, whether that now is in your headphones or strapped to a table while protons get shot into your brain."}, {"7115": "Later, when they played their last performance standing on a London rooftop, the end happened but then the “you” was the listener, us! We took that music and translated it into something beyond words, beyond The Beatles, beyond proton beams, beyond cancer. It’s just a moment, piercing into the now."}, {"b1bd": "The way music is supposed to be."}, {"b85f": "Right now."}, {"21c0": "Like this story? Read others about amazing individuals living with conditions at Folks!"}], "child": "2295_12295_12295_12295_1", "parent": "", "title": "How The Beatles Helped Me Survive Brain Cancer", "content": "How The Beatles Helped Me Survive Brain Cancer What stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons By Mark Schoneveld Rocking out on the proton therapy table. The Beatles’ 1968’s double-disc record The Beatles (often known affectionately as the White Album) has always been one of my all time favorites. But it wasn’t until I got brain cancer that I truly learned to appreciate it, and to understand some of its deeper truths. For six weeks, I was locked down into a proton therapy machine for 45 minutes at a time, as millions of invisible particles bombarded my brain, trying to burn out the malignant tumor that was growing inside. It may be slightly hyperbolic coming from a music geek like me, but if not for the White Album, I might never have survived that time. When I was diagnosed with cancer, I had no knowledge of what proton therapy was, or what it entailed. As I was introduced to the treatment, my doctor described the process. It sounded relatively easy, burning out malignant tumor growth in the center of my brain. I joked with him: “So you’re going to shoot lasers into my head?” “No,” he replied, deadpan-serious. “Proton beams are not lasers.” “Will this be anything like the MRI machine?” I asked. I’d already had a dozen or more MRIs validating the shape and size of my tumor, so I already knew what the experience was like: the claustrophobic feeling of being trapped in that tiny tube, enveloped by blood-curdling blasts of big robotic rumbling. As a professional music critic, I found it especially discordant: an MRI test is the antithesis of music. Luckily they give you earplugs. “No,” he told me. “You won’t hear a thing.” But, luckily, that wasn’t true. When I disrobed and entered the proton room for the first time, the ambience was forbidding. It was a large space with a high ceiling, and the room was chilly as I lay down on the table. They fitted me with a custom-built hard plastic mask; it fit snugly to my face, assuring that the proton beam could direct its blast to the precise spot of my tumor. Once I lay down, the mask was clipped to the table, locking me — and my head — in place. Bird’s eye view of getting my brain tumor blasted by protons. “Do you like music? We have a few CDs over here if you’d like to listen to something while we go through our business setting up,” the nurse asked me. I get asked about music a lot, but I’m always hesitant to make suggestions. I feel like my brain is so full of music that I can barely pick out one or two songs without worrying that the whole piñata will explode. Keep it simple, man, I told myself. “Do you have The Beatles?” “Ah, we do! The White Album, does that work?” “Oh my god, that’s amazing. Yes, please.” A blessing from the universe. Everything about the White Album has fascinated me, ever since I first heard it. It represents an epochal moment in music history. John, George, Paul and Ringo The year is 1968. The Beatles were splintering. After a couple months spent hanging out in Rishikesh, India with Maharishi Mahesh Yogi and smoking plenty of grass, The Beatles had written some of the best pop songs ever. But a different kind of cancer than my own had found root in the band. Experts differ on what it was: was it John and Yoko’s relationship? Was it Paul’s perfectionism? Was it Ringo’s feeling disrespected, or George’s deep dive into Hinduism? Whatever it was, by the time they came together to complete one of their last original albums, they could barely be in the same room together. The record is entirely built piece by piece, like slowly healing scars. Each song demonstrated the strength of the writer, but revealed how distant these individual band members had become from the group. Once complete, the work became one of the last records they’d ever make together. The only thing that stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons. Despite the tumult, it just worked. And that record kept me sane, seeming to reflect my own experience of being treated for cancer in a space oddly melodic in its own discord. Paul’s tongue-in-cheek rocker “Back in the USSR” starts with the sound of a jet plane taking off. It was an energetic launch pad for my radiation room, but I found the humor in it: it always gave me a smile. The only thing that stopped me from dancing was the fact that I was locked to the table, getting my brain blasted with protons. But that’s just the blast-off. Part of what defines the White Album is its melancholy edge. Although the tracks first seem saccharine sweet, each song has an undercurrent of pain, weeping, and need. The only truly silly song, “Ob-La-Di, Ob-La-Da”, may have been a cute track, but it caused tumult within the band. Everyone hated it but Paul. But that song is quickly balanced out by the powerhouse of “While My Guitar Gently Weeps,” where George’s breath itself sounds like it hurts. From there, we lead directly into “Happiness is a Warm Gun.” That’s what this album is to me: the happiness of a warm gun. Each and every song has a trigger: my nerves tingle, my body couldn’t move. “Martha My Dear” sings: When you find yourself in the thick of it. Just like I’m in the thick of it now. I read “I’m So Tired” as a cancer song. I don’t know what to do. My mind is set on you? I’d give you everything I’ve got for a piece of mind. And forgiving the pun, do I hear that: I’d give anything for some piece of mind after all this. An original vinyl copy of the White Album. So even though I’ve heard the White Album a thousand times, and will probably hear it a thousand more, I never really heard it like I did then. Every time I left the treatment room, I felt rejuvenated: the war on my cancer, the power of science and my own body, all melting away into the audiophonic bliss of an album that sometimes felt like it had been written just for what I was going through. Not going to lie. Some days I felt the willingness to allow despair to win. Some moments I didn’t want to go to treatment at all. I went day in and day out for weeks. It was a tough time where my heart was constantly racing, and I was battling doubt at every moment. But music puts hope around me… and, more specifically, the White Album does it for me, maybe more than any other. And if I had to explain why, I’d say it’s because it’s an album that prays for you. Since the White Album is 93 minutes long, and my proton beams sessions only half that, the last song I heard every session was “Blackbird.” It’s a deeply peaceful track, where the titular blackbird chirps in the background, while Paul sings a haunting coda: Blackbird singing in the dead of nightTake these broken wings and learn to flyAll your lifeYou were only waiting for this moment to ariseYou were only waiting for this moment to ariseYou were only waiting for this moment to arise Now my kids are asleep, and I’m listening to the record on my headphones, thinking about my treatment. The whole experience feels so distant, like it was all a dream or a strange piece of performance art. Perhaps when the White Album was put together, the band brought back bittersweet moments for them, too. The Beatles playing together for the last time. But the music of the White Album transcends The Beatles’ in-fighting, just like it transcends cancer and proton beams. It’s not about the regrets of the past, or the fears of the future. It’s just a moment, piercing into right now, whether that now is in your headphones or strapped to a table while protons get shot into your brain. Later, when they played their last performance standing on a London rooftop, the end happened but then the “you” was the listener, us! We took that music and translated it into something beyond words, beyond The Beatles, beyond proton beams, beyond cancer. It’s just a moment, piercing into the now. The way music is supposed to be. Right now. Like this story? Read others about amazing individuals living with conditions at Folks! ", "name": "2295"}