{"sentences": [{"3def": "The End of Independent Film As We Know It"}, {"7783": "Twenty-five years ago, films emerging from festivals like Sundance disrupted the movie business, producing subversive filmmakers like Quentin Tarantino and insurgent forces like Miramax. Now, thanks to Amazon and Netflix, the disruption is coming for the indies. Filmmakers talk about the shift, and what it means for the future of movies."}, {"8529": "Macon Blair was terrified. The year was 2013 and he was the unknown star of a movie no one had heard of, made on the cheap, and directed by a guy who hadn’t made anything in six years. Blair was sitting in a vast auditorium in France with hundreds of strangers, seated beside his friend and collaborator, the writer-director Jeremy Saulnier, who had risked everything to get their grisly drama, Blue Ruin, into the world. Finally, people were about to see what Saulnier and Blair had accomplished together. They had reason to be scared."}, {"698a": "Several months prior, Saulnier stood in front of a camera and made a pitch. He needed to raise $35,000 via Kickstarter to finance his movie independently. Saulnier described the movie as “a revenge film equally suited for art house cinephiles and die-hard genre fans.” Somehow, he compelled 438 donors to kick in $37,828. But even that wasn’t enough — after reaching the Kickstarter goal, Saulnier dumped thousands of his own savings, mortgaged his house, liquidated his wife’s retirement fund, and dove headlong into credit card debt before Blue Ruin was funded and ultimately completed. Eight months after the Kickstarter campaign, the movie made its premiere at the jeer-happy Cannes Film Festival as part of the Directors’ Fortnight, and that’s where Blair became really nervous. With no distribution, debt looming, and anonymity haunting them, the fate of the movie — and something resembling the future — hung in the balance."}, {"95aa": "“I can’t imagine what it must have felt like for Jeremy,” Blair says. “Even for me, just being secondarily involved, there’s this huge pressure.” Blair knew that it wasn’t just that audiences needed to like Blue Ruin. Someone needed to pay for it."}, {"5285": "“You gotta sell the thing, and if it doesn’t sell,” Blair says, “they might have to move or they’re gonna be broke. Everything was on the line.”"}, {"3aa5": "Later that day, the movie sold to the Weinstein Company’s boutique outfit, Radius, for a reported $500,000 — enough to recoup the Saulniers and provide a budget to distribute the movie. The world would see Blue Ruin, and Jeremy Saulnier would not be homeless. In a statement issued shortly after the deal was made, Radius copresidents Tom Quinn and Jason Janego said: “Blue Ruin is a masterpiece and a future cult classic. It is one of the most exceptional discoveries of the last few years thanks to Jeremy’s deft hand.”"}, {"622a": "Less than one year later, the movie premiered in America. And while it earned less than $1 million during a brief theatrical run, Quinn and Janego were right: Blue Ruin has become a kind of cult classic, a vicious and precise thriller that singes the eyebrows. It lives on, but not through midnight screenings or hipster video store clerks. Blue Ruin entered the wider consciousness when the movie was made available to stream on Netflix — then quaintly known as Netflix Instant — in August 2014. Netflix famously does not reveal streaming viewership data, but the mostly anonymous Saulnier’s little-seen little movie predicted a vast wave of possibility, foretelling a major shift in the industry."}, {"e3b2": "Blue Ruin is a modern indie movie success story; its arc recalls the ’90s heyday of the Weinsteins, Quentin Tarantino, and the acquisition hype cycle. But it leveraged the new vagaries of movie production, including an evolving festival culture, streaming platforms, and crowdfunding. In many ways, Blue Ruin is much like Reservoir Dogs, a movie that arrived like a comet 25 years ago at the Sundance Film Festival. But it’s different, too — Reservoir Dogs was a video store phenomenon made by a director whose cinephilia was forged in a video store. Blue Ruin is a streaming baby, christened by Netflix."}, {"55da": "“When I was working on Blue Ruin, that was the first time we were exposed to this whole world of streaming,” Blair says. “And at first, it’s not that we were suspicious; we were just like, ‘I don’t know how this works. Are people even gonna see it if it’s just on demand?’ And as it turned out, it seems as though people saw that movie much, much more on streaming platforms than they did in the theater. It makes a lot of sense, especially for smaller movies that maybe don’t have a big star in them or maybe they don’t have a ton of money for promotion and they can be discovered by word of mouth.”"}, {"c81e": "With its success has come the spoils of a bona fide indie movie hit: Saulnier has become a name-brand filmmaker after last year’s (even grislier) Green Room, and the sad-eyed Blair has become a working actor in Hollywood — he appeared in the Matthew McConaughey drama Gold earlier this year and will be in the forthcoming Steven Soderbergh comedy Logan Lucky. Blair’s a filmmaker in his own right now, too. His directorial debut, the similarly violent crime drama I Don’t Feel at Home in This World Anymore, premiered at Sundance in January, where it won the Grand Jury Prize. But Blair wasn’t much scared at the premiere of this movie. Its future was clear."}, {"d18f": "“When we took this one to Sundance this year, its distribution was already all stitched up. It had been from the beginning,” Blair says. “It was kind of relaxing because there was nothing to worry about. Obviously you hope people are going to enjoy it and the audience is going to like it and it’s gonna get reviewed nicely, but at the very least, we didn’t have to worry about who was gonna buy it, because it was already a done deal.”"}, {"dd0b": "Blair didn’t have to contend with the typical festival experience: He didn’t have to idly wait to hear about bids on his movie. He didn’t have to field calls from his agent or pitch the marketing vision to executives. He didn’t have to haggle over recutting or reshooting the movie’s violent conclusion. And he didn’t have to wait very long for the rest of the world to discover his movie, and that’s because I Don’t Feel at Home in This World Anymore was paid for and is distributed exclusively by Netflix. In a highly unusual strategy, four weeks after he took home the Grand Jury Prize in Park City, his movie was made available to the streaming service’s approximately 94 million subscribers worldwide."}, {"1732": "“With Blue Ruin … we took pretty much a full year of traveling to different festivals to promote it before it came out,” Blair says of the movie, which appeared in theaters more than 11 months after that fateful night at Cannes. “And in this case, it was like almost less than a month. A much faster turnaround.”"}, {"3df9": "Quentin Tarantino and John Cooper at the 2017 Sundance Film Festival (Getty Images)"}, {"88e3": "Independent cinema is moving out of the art house and into every house. The collapse of this viewing window and the bidding-war armistice has been mitigated by prefab dealmaking. Technocratic distribution companies like Netflix and Amazon have upended the state of independently produced movies. Film festivals that screen these movies were once the bastion for work created beyond the perception of Hollywood’s studio structures — films that were either unable or unwilling to penetrate the cast iron gates that lead to the moviemaking seats of power. The festivals were a home for insurgents, temples that hoisted Tarantino, Michael Moore, Sofia Coppola, Kevin Smith, Allison Anders, Robert Rodriguez, Todd Solondz, Todd Haynes, Ava DuVernay, Paul Thomas Anderson, Wes Anderson, Richard Linklater, and dozens more into the frame. Today, a movie that has been bought, paid for, and strategized against a global calendar by a massive public company is dissonant with the spirit of independent movies."}, {"0c99": "What is happening is not an erosion of indie cinema, per se, nor a dissolution of risk-taking work — Saulnier’s and Blair’s films are unforgiving and uncompromising genre movies, as likely to bleed and wail as anything from 1992. But their parentage raises some fascinating questions about origins, funding, and accessibility in an evolving movie culture. Netflix and Amazon are eating yet another part of the entertainment community. But what happens when everything has been swallowed up?"}, {"1fe2": "“We’re not the same,” Ted Sarandos told Deadline last year. “[Amazon] put themselves in the place of Sony Pictures Classics. That’s not really a disruption as much as it is a replacement. What I’m trying to do is take the benefits and the beautiful byproduct of the internet, which is all about consumer choice, and apply it to movies where no one else has. The theatrical movie window is the only window that really still exists. Every other form of entertainment is pretty much available to consumers where and when they want it. Perpetuating the movie window — adding new money to perpetuate the old system — I don’t think is really that interesting.”"}, {"bdf5": "Sarandos is the chief content officer at Netflix, and his gentle trolling of Amazon is notable. (Amazon and Netflix declined to comment on the record for this story.) Both companies have grand ambitions in the movie business, which consumers will see in releases in coming months. But before that, we can see how they plan to overwhelm the industry in the same way that they have in TV. Netflix goes direct to its service, with virtually no theatrical window. Amazon operates in a more traditional fashion, holding the window open before sending its original films to its streaming platform offered via Amazon Prime. Amazon applies lessons learned from working within the Hollywood studio experience; Netflix defies them at will. Their strategies are different, but the endgame feels largely the same — attack the most vulnerable market in movies: the little guys."}, {"aef4": "In recent years, many of the indie-boutique shingles that the major studios once supported — Paramount Vantage, Warner Independent Pictures — have closed up shop. They’ve become victims of an increasingly corporatized, IP-centric major studio strategy. Those that remain, including Fox Searchlight, Miramax, and Focus Features, have been weakened. These satellite operations working inside corporations supported independent filmmakers and smaller projects, in an effort to serve arthouse audiences, court award season prestige, and provide the corporations a bit of soul. The continued dissolution of these outlets has created an open lane. In their place, a new breed of independent-minded curators — based largely in Silicon Valley and Seattle — has risen. The tension between them starts in theaters and ends at home."}, {"d0cf": "“If Screening Room happened,” Sarandos said last year, “that would be real disruption.”"}, {"7c9e": "The Screening Room is the much-ballyhooed initiative by Sean Parker, onetime Facebook president and entrepreneur. It is meant to redefine the moviegoing experience by changing how consumers see first-run movies: for the price of a $150 set-top box and a $50 screening fee per 48-hour window, new movies would appear in your home on opening day. Want to see Kong: Skull Island from the comfort of your futon? Parker wants you to as well. But most studios have been slow to accept the notion. Ever since news of the potential service — and its fraught negotiations with the major studios — broke last year, Hollywood has whinged and fretted about the future of its business. I wrote about this panic last year. At last month’s CinemaCon, an annual convention of theater owners and major studios, it appeared that the chilliness around the Screening Room has finally begun to thaw. (All this amid a boom in arthouse love in New York.) But in the year since it was announced, and right underneath its nose, Sarandos and his friendly competitors at Amazon have been subverting the very process by which movies are seen, giving people who are uninterested in the theatergoing experience a way to get their content quickly and easily. They have built a Screening Room experience inside their own business model."}, {"631d": "“There’s no physical supply chain,” Sarandos told Deadline. “So the idea that you could do something on a global platform was impossible then and more than possible right now — and the norm. Netflix now, we’re in every country in the world except for Syria, North Korea and China. When we launch our movies and TV shows, we launch them everywhere at the same second. When we buy a movie at Sundance, it’s available to the whole world.”"}, {"29b7": "The whole world. Sarandos fashions himself as an old-school Hollywood Showman–meets–Silicon Valley Great Man — Steve Jobs with a creased copy of The Kid Stays in the Picture. These are incisive and persuasive words from someone who has spent a lot of time imagining how best to completely upend a system he perceives as broken. Or, at least, ready for the taking. It’s Ayn Randian thinking, and perhaps justified. Netflix grew by more than 5 million subscribers last quarter, and its stock price is up 44 percent in the past year, according to The Wall Street Journal. It’s done so by adding more than $5 billion worth of original content, from children’s programming to stand-up comedy. Its strategy is market-based, not revenue-driven — it needs to grow and grow and grow against the perception of success."}, {"6715": "How Netflix Took Over Stand-up ComedyWith new specials coming from Dave Chappelle, Amy Schumer, and Chris Rock, Netflix has officially taken over the stand…theringer.com"}, {"8b65": "But Sarandos’s global conqueror routine is also a boon for filmmakers. Netflix’s insatiable appetite for library-building and content delivery has meant an unceasing, well, stream of new television shows, documentaries, and, increasingly, original feature films delivered to the world. With Blair’s I Don’t Feel at Home in This World Anymore, Netflix unofficially began a new initiative: releasing one new original movie on its streaming service every Friday. Last Friday, it debuted Win It All, the charming new Joe Swanberg movie starring, coproduced, and cowritten by Jake Johnson. The 35-year-old Swanberg has become a kind of paterfamilias of indie cinema in the 10-plus years he’s been making movies. But recently, the visibility of everything he’s made has been elevated on a streaming service."}, {"aa0e": "“Drinking Buddies honestly found its biggest audience on Netflix,” Swanberg tells me after the premiere of Win It All at the South by Southwest Film Festival in March. “It’s become pretty clear to me over the last few years that the work that I’m making is finding its audience there. And so I have [to face] the question as a filmmaker and Jake [Johnson] and I as business partners: Do we go where the audience is or do we make the audience come to us? I just think it’s not our nature, we’re not the kind of guys that are going to put our foot down and be like, ‘No, you have to experience it this way.’ If there’s a big audience over there that wants to watch it, and we already made the movie we want, that makes the most sense to both of us.”"}, {"d6d7": "Win It All, like Swanberg’s previous Netflix-distributed films Digging for Fire and Drinking Buddies, was made for less than $5 million and grossed far less than that; these are movies you can, and maybe should, stream. They are stylistically sturdy but unglamorous and crafted with a workaday mien that suits their makers. They glide, but they don’t necessarily soar. Netflix is the perfect home for them. And it’s the only place Swanberg and Johnson took a rough cut of Win It All, the only partner they were interested in."}, {"ef94": "Swanberg has even expanded to TV with the anthology series Easy (also exclusively available and paid for by Netflix), which resembles the style of his movies. A second season is already in production. Its success insinuates an emerging aesthetic: Netflix-core. Soon, there may be no movies and TV, only Netflix and Amazon and other streaming bankrolled product. In the meantime, for an artist like Swanberg with a modest background and limited reach to this point, the collaboration is a win, no matter the length or form."}, {"7e7d": "“After making Easy, where the show goes up on the same day to 170 countries all around the world, Netflix called me and they were like, ‘It did really well in America. It also did really well in France and Germany,’” Swanberg says. “I was like, ‘Wow, I’ve been trying for a decade to break into [those countries]. I knew they would like my stuff. It’s just that they never had a chance to see it because a French distributor and a German distributor is like, ‘I’m not about to lose $300,000 trying to turn French people on to mumblecore movies. I got better things to do with my time.’"}, {"7fd1": "“It’s interesting to me that it wasn’t about the work necessarily,” he continues. “It was about the accessibility of the work. And the truth is, I don’t have any grudge against that French distributor or German distributor. I wouldn’t even put my movies out in those countries. It’s a losing proposition. But with the Netflix access, those people finally had a chance to see my work and they were like, ‘We like it!’ Now we get to go back to them and say, ‘Check this one out.’”"}, {"363c": "Swanberg is an artistic pragmatist who has found a distribution partner that suits his pragmatism. Swanberg and Johnson, who made his name as one of the stars of Fox’s New Girl, throw their own money in together for these projects — and they both speak forthrightly about upending the financial models of moviemaking, finding ways to get the most money to the people most responsible for their creative execution. It’s an intriguing anti-Hollywood populism, crafted by a mumblecore pioneer and a sitcom star — the duo have formed a sort of modern-day Robert Altman–Elliott Gould–style pairing. Johnson — who was featured in Jurassic World and has a part in the upcoming Mummy reboot starring Tom Cruise — is particularly intimate with the corporate machinery that can envelope a creative project."}, {"940c": "“We get to cut out all middlemen and just make work and say, ‘Do you guys like it? Guess what it’s going to cost you: Nothing, you already have a subscription. So try it! And guess what, click on it, you already pay for Netflix,’” he says. “You either know Joe through Easy and his stuff or you go, ‘Oh, it’s Schmidt from New Girl, should I watch that? That’s not Schmidt! Oh, it’s the other one.’ Just hit it. And you start it and if in those first few minutes, you’re out, I get it. But if you’re in, and you like it, then that’s actually the fan we want who then goes, ‘What else have they done?’ And I’m like, let’s just make movies for that person and say, ‘Yeah, you want to watch this one again?’ You just put your baby to sleep, you got two hours before it starts crying, here’s an hour and a half. And that’s a model I’m very personally excited about.”"}, {"7c2a": "At the SXSW screening that premiered Win It All, the crowd was uproarious — Johnson and Swanberg told me that they always planned to first show the movie at Austin’s Paramount Theatre, which treats movies more like rock concerts than Sunday Mass. So there is something odd about wanting audiences to experience the movie, which follows a hapless Chicago gambler who just so happens to come into the possession of a big bag of cash, at home on Netflix. For Netflix’s part, the equation is still evolving."}, {"5dcc": "“There’s a romantic notion about the film being on a big screen,” said Sarandos last year. “There’s definitely something about a premiere at [main Sundance venue] Eccles that you can’t replicate — that I can’t replicate — but the fact is, that happens for a couple hundred people once a year. We’re doing it every day for the world. People who are discovering a movie that might change their life; that’s who they’re talking to. We have to get rid of the romantic part. I don’t really think that they’re mutually exclusive. I think over time that these films will get booked into theaters at the same time they’re on Netflix.”"}, {"7add": "In the meantime, the freedom and scope of the opportunity provided by the company right now is often too much for young filmmakers to turn away from."}, {"c215": "Netflix’s ‘The Discovery’ Has the Best Opening Scene of the YearThe director of the new high-concept sci-fi drama talks about the afterlife and how to draw in an audiencetheringer.com"}, {"7bd2": "“There’s no excuse. It’s there in your home, it’s on your phone, you can watch it anywhere,” says Charlie McDowell, the director of The Discovery, another Netflix Original that premiered last month. “But I think that hopefully what this does, is people start talking about it on social media in a way that’s intriguing and then it’s like, ‘Well, OK, I’m just gonna go watch it on Netflix.’”"}, {"04c8": "McDowell’s first movie, the twist-filled 2014 romantic drama The One I Love, also found an audience on Netflix, after a Sundance premiere. He didn’t plan for The Discovery to live exclusively on Netflix. But there is some serendipity in the company’s growth plans and his chance to show the biggest possible audience a meditative science fiction drama that may not scream “box office windfall.”"}, {"0323": "“I set out for this movie to be seen in the theater, and then that changed in a way that I’m totally OK with — and the partnership with Netflix has been so successful and so strong and I really respect them and love what they’re doing, especially this year with original films,” McDowell says. “This is the year of original films breaking out for Netflix.”"}, {"9baf": "Terry Crews, Ted Sarandos, and Adam Sandler at the premiere of ‘Sandy Wexler’ (Getty Images)"}, {"67d1": "The service has effectively communicated its plan to filmmakers of all stripes. Later this year, it will release what would have otherwise been major studio pictures starring Brad Pitt (May’s War Machine), Will Smith (December’s Bright, from the director of Suicide Squad), and of course its never-ending string of Adam Sandler features, including this month’s Sandy Wexler. But it’s indie directors who stand to gain the most from the service’s reach."}, {"72dc": "“The only thing I care about is that people see this film. And a lot of people are gonna see this film just based on where it’s available,” McDowell says. “My friends made [the Netflix original series] The OA, which is something [where] if you go to a coffee shop, people are talking about it. And so you know that it hit. And so the next thing is: Can that translate to original films? Which I think for Netflix, that’s the next territory.”"}, {"a4f6": "The protection that these films and filmmakers have from the terror of box office receipts perpetuates a mystery about their own success. Much like the television showrunners, network executives, and agents who have expressed concern over Netflix’s refusal to share internal viewing metrics, filmmakers now have to trust that the corporate steward that has funded their vision and delivered it via a locked service is helping expand their careers, and not limiting them. This is unprecedented. How do we define a hit director in this environment? Will we know a Spielberg when we see one? McDowell acknowledges his metric for success is more ill-defined than ever."}, {"c573": "“I’m not gonna know the numbers of how many people have seen [The Discovery], obviously, but I feel like it’ll just be, Are people talking about it on social media?” McDowell says. “Are people coming up to me saying, ‘I saw your film and discovered it on Netflix’? That’s how I’ll measure it, I guess.”"}, {"2c19": "And what of the festival culture that heretofore announced major independent film talents? That lane is still open. But there are caveats."}, {"edee": "“Sundance actually does a very good job preparing you,” says JD Dillard, whose debut feature, Sleight, played the festival in 2016 and will hit theaters on April 28. “And so much of [what they told me] turned out to be true, which is crazy. We premiered on a Saturday and then starting Sunday, there are phone calls — ‘Oh, we’re gonna do this,’ and, ‘We want to sit down with you, but we want to change these pieces,’ and, ‘We want to take it into direct to VOD, but here’s how we’re gonna do it.’ Other people were like, ‘We’ll just put it on the screen now.’ There were some people who didn’t want to touch it; there were some people who were like, ‘What if we reshoot this piece?’ All that is part of the conversation.”"}, {"8e15": "“We were open to whatever anyone was saying,” Dillard says. “But — and maybe it’s naive — we wanted to see this movie in theaters. I understand that the distribution model is rapidly changing every single day and Netflix and Amazon are just as good as opening on 2,000 screens. But for this movie [theatrical distribution was the right choice], and honestly that was motivated by what the energy of Sleight was at the festival.”"}, {"359b": "Sleight follows a young street magician who gets caught up in a drug dealer’s web and is forced to use some of his skills to escape — it’s a genre movie, craftily made on the cheap. Dillard previously worked at J.J. Abrams’s Bad Robot as a receptionist and later as an assistant on the set of Star Wars: The Force Awakens with Abrams. His ambitions are big, wide-release stories, and he’s reportedly been tapped to direct a remake of The Fly. But unlike Blair, Dillard has had to wait for more than 15 months for the public to see his movie. After brokering a deal with Blumhouse and WWE Films, Dillard entered a period when he was forced to resume his life and earn a living while tuning up his movie for its wide release. Few had seen Sleight and so momentum was difficult to come by. Artistic purgatory doesn’t pay."}, {"502b": "“Here’s the not-so-glamorous side of independent film: All of my student loans defaulted, all my credit cards went into collections, I went back to Bad Robot to help my friends who are chefs there, to help them in the kitchen,” says Dillard. “So I was doing whatever I could, but I still had to keep so much time open for Sleight, and that process sucks — like, it really sucks. And that’s nobody’s fault. It’s the nature of a low-budget [movie], where you can’t just pay somebody 85 grand [to fix all your problems].”"}, {"dea6": "There was no such interregnum for Macon Blair."}, {"055b": "“It seems to me like a cool way of doing things,” Blair says of his movie’s quick arrival on Netflix. “If the temperature is already up on a particular title to not let it cool off and then have to re-remind people about it nine months or 12 months later, just sort of strike while the iron is hot.”"}, {"1844": "“I think it’s a good thing for us because now when I talk about these films, even at a dinner party, I don’t have to go, ‘Oh yeah, that’s right, you weren’t at the festival,’” says John Cooper, longtime director of the Sundance Film Festival. “They become part of the dialogue of our independent community faster.”"}, {"6ce0": "Festival work is difficult, and requires thousands of hours of labor — watching unfinished films, identifying themes, securing contracts, creating a schedule, building atmosphere, arranging countless screenings and panels. Sundance is a machine and the most respected festival of its kind, but that reputation has taken years to acquire and hold. It’s human work. It feels like a strain that would be removed by an AI observing the movie business. Do the closed windows perpetrated by massive, studio-esque corporations obviate the need for film festivals in the first place? Cooper says no."}, {"a2ad": "“I think there’s still a need for us to be curatorial and for us to have — I don’t want to say the word ‘pure’ — but almost have that more noncommercial approach to selecting films and celebrating,” he says. “A noncommercial celebration is important. Even for Netflix.”"}, {"a994": "Twenty-five years ago, no one wanted to touch Reservoir Dogs. Not even Harvey Weinstein, the man who would become Quentin Tarantino’s creative guardian angel. In his book Down and Dirty Pictures, the film industry historian Peter Biskind tracks the parallel arcs of Miramax, Sundance, and a crop of brash young filmmakers that included Tarantino."}, {"e7db": "The Reservoir Dogs director, then a pugnacious 28-year-old video-store clerk and aspirant auteur, had recently felt the sting of rejection at Sundance, where his violent and narratively audacious debut won zero awards."}, {"3d44": "“It wouldn’t have been such a bad thing if I hadn’t been told by everybody I was gonna win — something. But it hurt my feelings,” Tarantino told Biskind. “I was sad, I was mad. When it was over I did a slightly less drastic version of storming out. ‘Fuck all you!’”"}, {"1a8a": "Reservoir Dogs, a pulpy and unlikely festival entrant, made an impression, but there wasn’t much interest in distributing the movie. Biskind recounts the post-Sundance round of screenings to potential distributors:"}, {"848a": "Twenty minutes into it, Harvey was getting a little itchy. [Mark] Tusk told him, “Sit still. Trust me.” The movie ended. Harvey was dubious, afraid it would be a hard sell at the box office even if it got good reviews, which seemed questionable, given the carnage. Back in New York, the brothers screened it again, then went around the room, canvassing the staff. Ben Zinkin, an outside counsel, said, “That was probably the single worst movie I’ve ever seen.”"}, {"73b3": "“Russell?”"}, {"5319": "Russell Schwartz, head of marketing, replied, “Not my cup of tea. For me, it’s a pass.”"}, {"0cba": "Reservoir Dogs would not have gotten past theatrical distributors this year. But it also might not have been able to transcend its origins if it had been scooped up by a major streaming service. There’s no way to know. Sundance showed 119 feature films this year. Forty-one have been sold thus far — Netflix bought 10, Amazon Studios five. Those are by far the highest acquisition totals. They have completely replaced Miramax and Sony Picture Classics as the power brokers of the festival."}, {"76c7": "“The people who are acquiring movies and putting together these deals are a lot of the people I knew back in the day from other companies,” Cooper says. “It’s not necessarily a whole new set of people that are at Amazon, that are at Netflix. It’s the same faces of a lot of people that helped create Miramax and other companies back in the day. So I find that interesting, too — they’re still basically doing the same kind of job. It’s just for a different platform.”"}, {"7a30": "Some say there is reason to be cautious about the long-term viability of this wave."}, {"d436": "“There’s a window right now where they’re all trying to fill up, but at some point, Amazon will have enough titles and all they’ll care about are the big ones that are coming up,” the producer Chris Moore, whose Manchester by the Sea was funded and distributed by Amazon Studios, told me last fall. “And if you’re a subscriber of Prime, which is what they care about, do you care if they have 50,000 titles or 6 million? As long as you get what you want out of the 50,000, what are you going to do with that other 5 million titles, right? They’re just going to sit there.”"}, {"0906": "Netflix and Amazon’s surge presents complications for independent producers and filmmakers, too. Is this an endless waterfall of acquisition and distribution? Or will the water run dry?"}, {"2e33": "“The biggest problem is what you’re selling when you make movies — whether it’s a studio or a guy like me raising independent money — is you’re selling the potential of a hit,” says Moore. “You’re selling that the business and my experience in the business gives you a higher-percentage chance that you’re going to get your money back. And I don’t think you can sell any of that anymore.”"}, {"5484": "Ted Hope and Casey Affleck at Amazon Studios’ Oscars celebration (Getty Images)"}, {"445e": "It’s a fascinating concept, a puzzle box dropped right in the middle of an industry that thrives on metric success, whether box office draw or award hauls. Manchester was an Oscar success story in winning awards for Best Actor and Best Original Screenplay and reeled in $62 million at the box office worldwide, an impressive figure given its dark story line and provenance. Likewise, Amazon helped shepherd the small and heady James Baldwin documentary I Am Not Your Negro to profitability and an Oscar nomination. In just two-plus years, the biggest technology and consumer marketplace company has scaled Hollywood credibility. It’s done so, in part, by playing by traditional rules."}, {"09a7": "Just last week at a keynote discussion at MIPTV in Cannes, Amazon Studios head of media development Roy Price praised the value of theatrical distribution in its movie strategy: “Whatever you may predict to happen six or seven years from now, theaters play an important role in the movie ecosystem now, so why not participate in that? … Once the movie comes on the service having been in theaters, I think there is a perception that it’s a legit movie: It was reviewed, and it was in a theater — it’s like, a movie. It helps with customer perception, it helps with filmmakers, so we’re very supportive of the theatrical window.”"}, {"5e6c": "That sentiment is still powerful for a filmmaker like James Gray, who has released five films with independent distributors. His new movie, the gorgeous period adventure The Lost City of Z, will be distributed by Amazon Studios. He wants his movies in theaters."}, {"48c5": "“Ten years ago, I’d give interviews and we’d talk about the future of cinema and I felt very much like a Cassandra,” Gray says. “Movies reflected a temporary moment. People assume that art forms last forever. But let’s face it: If you were a composer of opera, you would be in deep trouble. Opera was a popular medium in 1860 or 1870 and when Verdi died, 400,000 lined the streets of Rome for his funeral. And today you can go to the opera, but you dress up and it’s $300 for a great seat, which is crazy. And who can pay that? It’s become a rarefied thing. And I started to see that movies, the tradition where you go and sit in the theater and pay your money and eat your popcorn, enjoy that as a communal experience, that that was under grave threat. This was 10 years ago. I don’t think that anything I’ve said then was disproven by anything happening now. I think where we’re headed, which is a world that is [dictated by] Amazon and Netflix, is essentially you watch these things at home on your 60- or 70-inch television. I’m against that.”"}, {"6937": "Netflix has announced at least 20 more original films that will be released on its service this year, ranging in size from Sundance to Sandler. Amazon Studios is newer to the field, releasing one film in 2015 and 15 last year, including major achievements, like Park Chan-wook’s The Handmaiden and Jim Jarmusch’s Paterson, that would otherwise have been forced to find distribution with one of the boutique distribution houses. Amazon has 14 films planned for this year, including production and distribution for Todd Haynes’s followup to Carol, Wonderstruck, as well as Richard Linklater’s Last Flag Flying, a sequel to The Last Detail starring Bryan Cranston; it produced, and will co-distribute, Doug Liman’s John Cena–starring The Wall with Roadside Attractions; it also picked up distribution for the Sundance darling The Big Sick. Amazon’s strategy, overseen by Price, Head of World Wide Film Jason Ropell, and Head of Motion Picture Production Ted Hope, is an amalgam that is driven by taste and inbound experience. Hope, whose Good Machine Films production company was a driving force in ’90s indie cinema, has brought 30 years of knowledge to Amazon. He’s an idealist in a confusing environment."}, {"d790": "“I really do believe that we, the creative community, are on the precipice of what I think will be the greatest period in filmmaking ever,” Hope said last summer at the Seattle Film Festival. “I know you all want to know about the secret Amazon algorithms for how we pick our films and spend money. … I constantly say, ‘Why do movies suck? Why are these scripts just not better?’ This is my first pass at talking about how we can engineer better movies.”"}, {"505e": "Hope buys what he likes, and what he thinks can work, but he’s begun blending social media observation and digital data tracking with gut-level decision-making. He’s an Amazon man now. “I have a personal aesthetic of appreciating noble failures,” he said last summer. “As a student, I learn when it doesn’t work; it helps me as an artist. But I know the audience doesn’t like those, so as an executive, I can’t really go out and try to spend my money on noble failures.”"}, {"5056": "Sometimes that results in a Todd Haynes movie. Sometimes it’s a John Cena war flick. And sometimes it’s a remake of a giallo horror classic, like Luca Guadagnino’s upcoming reimagining of Dario Argento’s Suspiria. Movies are still a mystery, a shot in the dark. But some fear that the unknown is evaporating from the equation."}, {"9939": "“I have a bunch of young filmmakers who come to me and they say, ‘Hey, I made a movie for $800,000 and people like it and it’s getting a small, theatrical release, which is actually costing me money, and then I made this deal with Netflix for $300,000,’” says Chris Moore. “So the next time they go do it, they figure, that movie was pretty good, everybody seemed to like it, all we got was $300,000 from Netflix, so I got to make the next one for $300,000.”"}, {"a3c5": "Just as the viewership data is locked for these movies, so are the budgets. The raft of small films that have been bought and paid for by Netflix enforce a new kind of relationship that more closely resembles the old studio-contractor model that employed actors in the 1930s and ’40s: Netflix owns everything. There are no DVD sales, no international receipts, no TV syndication deals. The only difference is the absence of the creative shackles that Louis B. Mayer and Jack Warner employed. Swanberg returns to Netflix because he likes what he hears from the company and the financial security it provides. McDowell likes the reach. Blair likes the ease of use. The appeal of Netflix, and its war chest, is incalculable right now."}, {"a4cd": "Ted Sarandos is evasive about the financial impact of spending at will and flooding the market with content. His is a scale-building pursuit, the vision of a seemingly never-ending library, each title opening with its very own cherry red, animated Netflix logo at the start."}, {"d15c": "“We don’t spend any time talking about Wall Street when we do content acquisition deals,” Sarandos said last year. “It serves our model probably in the same way it does to make a season of House of Cards. It’s about making content that people love, value and associate their Netflix membership with. So when they say, ‘I’m a subscriber to Netflix because I love Orange Is the New Black,’ or, ‘I can’t wait to see The Crown,’ they know they can’t do it anywhere else."}, {"0c16": "“Movies, it’s tough to have the same economics because it’s two hours of watching instead of 13 hours. But [the forthcoming Will Smith film] Bright is a movie that they would have seen in the theater, yet because they’re Netflix members they get to watch it whenever they want, wherever they want, at the same moment. There’s no window, no waiting. The producers will make money, and they chose this over the other models. They didn’t do it because they had a point to prove or they had any interest in Netflix’s value market gap. They did it because this was a more profitable way to make and release movies. Our first ambition is that it becomes like a major studio slate.”"}, {"0ac4": "For Netflix, that means more, bigger, and wider. But it also means being everything. To be a major movie studio is to serve every so-called quadrant, to market-test and research human interest. And to take chances inside of that research."}, {"a548": "“So when I say I think about it as a slate, I think about it both in volume and scope from a couple of tentpoles, some nice films in the middle, and some great independent,” Sarandos said. “What I’m really excited about is our original films that we’re producing.”"}, {"3f63": "What Sarandos does provide — what differentiates him from, say, Harvey Weinstein — is full-blown creative control to his filmmakers. Every single filmmaker I’ve spoken with this year has testified to the astonishing freedom the companies provide. “If you disagree with a note from Netflix or Amazon, you can have a creative discussion about it,” Gilmore Girls creator Amy Sherman-Palladino recently told The Wall Street Journal. “It’s not viewed as, ‘You didn’t take my notes? You’re an enemy and I’m going to cancel your show.’”"}, {"c5c6": "“I’ve done this one time and I don’t know if my experience is different from other people’s experience, but from what I saw, the sort of creative freedom that was given to me is a really, really attractive feature to this model,” says Macon Blair. “And also the fact that they can get down with stuff that, for whatever reason — whether it’s the cast or the content or the subject matter — might not be viable for other places.”"}, {"7448": "Netflix closing the door for dozens of theatergoing opportunities is a strange conundrum. Would I Don’t Feel at Home in This World Anymore work better in a theater with 200 people? Maybe. But what’s lost in it not appearing on that venue? Blair says the opportunity outweighs the loss."}, {"3b3e": "“I’m not slamming the more theatrical-based distributors either,” Blair says. “There’s just a different set of conditions that have to be met, which is totally valid, but I think it opens up more space that filmmakers who might not otherwise be able to get something done, like in this case me, to be able to do something."}, {"0e5b": "“Jeremy [Saulnier] has a movie [Hold the Dark] that he’s working on right now which is much, much bigger than mine and much bigger than anything that he’s done before. [It’s] also going to be on Netflix, and I can’t say this with any kind of certainty, but I would guess, because the script is very dark and kind of weird and challenging, that Netflix might have been able to confidently take a chance with it in a way that other places wouldn’t. The movie is right in Jeremy’s wheelhouse, so I think fans of his will really enjoy it, but it may not have happened if not for Netflix rolling the dice on it.”"}, {"7653": "Not everyone is so bullish on the future foretold by this brave new independent cinema. Despite the overwhelming opportunity Amazon and Netflix provide, a duopoly is not a democracy. The biases of the people who curate the experiences on these services could dictate the shape of small-scale moviemaking for decades to come. The Teds Hope and Sarandos have proved artist-first executives so far, but that is not a guaranteed future. And furthermore, how long will the Big Two pursue smaller films at this rate? If Bright is an internal mega-hit for Netflix, in the same way the service claims that Sandler’s films are, does that mean a Disney-level pursuit is in the offing? Though it has failed in its efforts thus far, it’s only a matter of time before Netflix muscles its way into the last great movie market: China. Which means more spectacle, more action-based storytelling, and certainly fewer indie-centric acquisitions."}, {"2018": "China Will Not Save HollywoodProjections about the box office future of China — and Hollywood reactions like ‘The Great Wall’ — may be shortsightedtheringer.com"}, {"1c07": "For James Gray, there is a sadness in his experience. His career has been marked by notoriously frustrating encounters with distributors, difficulties marketing his films, and public quarreling with Harvey Weinstein over their content. But even as he finally reaps the benefits of working with a company like Amazon, and as he awaits the release of The Lost City of Z, his most ambitious and uncompromising film, he’s melancholy."}, {"5b52": "“I mourn … I got into movies in 1987 when I started in college in USC film school. And when I graduated in 1991, the scene was still very much the same as it had been in 1935,” Gray says. “It was actually better than it was in 1935, because you would make your film and then it would come out on videotape. And a few years later on DVD. So it had a life that wasn’t only in theaters. So in that sense, it’s better. We can discover these films for years to come. And it can find new audiences."}, {"4635": "“But the major negative,” he says, “is that intimacy — that womblike intimacy — that we have with the screen, no longer speaks to us.”"}], "content": "The End of Independent Film As We Know It Twenty-five years ago, films emerging from festivals like Sundance disrupted the movie business, producing subversive filmmakers like Quentin Tarantino and insurgent forces like Miramax. Now, thanks to Amazon and Netflix, the disruption is coming for the indies. Filmmakers talk about the shift, and what it means for the future of movies. Macon Blair was terrified. The year was 2013 and he was the unknown star of a movie no one had heard of, made on the cheap, and directed by a guy who hadn’t made anything in six years. Blair was sitting in a vast auditorium in France with hundreds of strangers, seated beside his friend and collaborator, the writer-director Jeremy Saulnier, who had risked everything to get their grisly drama, Blue Ruin, into the world. Finally, people were about to see what Saulnier and Blair had accomplished together. They had reason to be scared. Several months prior, Saulnier stood in front of a camera and made a pitch. He needed to raise $35,000 via Kickstarter to finance his movie independently. Saulnier described the movie as “a revenge film equally suited for art house cinephiles and die-hard genre fans.” Somehow, he compelled 438 donors to kick in $37,828. But even that wasn’t enough — after reaching the Kickstarter goal, Saulnier dumped thousands of his own savings, mortgaged his house, liquidated his wife’s retirement fund, and dove headlong into credit card debt before Blue Ruin was funded and ultimately completed. Eight months after the Kickstarter campaign, the movie made its premiere at the jeer-happy Cannes Film Festival as part of the Directors’ Fortnight, and that’s where Blair became really nervous. With no distribution, debt looming, and anonymity haunting them, the fate of the movie — and something resembling the future — hung in the balance. “I can’t imagine what it must have felt like for Jeremy,” Blair says. “Even for me, just being secondarily involved, there’s this huge pressure.” Blair knew that it wasn’t just that audiences needed to like Blue Ruin. Someone needed to pay for it. “You gotta sell the thing, and if it doesn’t sell,” Blair says, “they might have to move or they’re gonna be broke. Everything was on the line.” Later that day, the movie sold to the Weinstein Company’s boutique outfit, Radius, for a reported $500,000 — enough to recoup the Saulniers and provide a budget to distribute the movie. The world would see Blue Ruin, and Jeremy Saulnier would not be homeless. In a statement issued shortly after the deal was made, Radius copresidents Tom Quinn and Jason Janego said: “Blue Ruin is a masterpiece and a future cult classic. It is one of the most exceptional discoveries of the last few years thanks to Jeremy’s deft hand.” Less than one year later, the movie premiered in America. And while it earned less than $1 million during a brief theatrical run, Quinn and Janego were right: Blue Ruin has become a kind of cult classic, a vicious and precise thriller that singes the eyebrows. It lives on, but not through midnight screenings or hipster video store clerks. Blue Ruin entered the wider consciousness when the movie was made available to stream on Netflix — then quaintly known as Netflix Instant — in August 2014. Netflix famously does not reveal streaming viewership data, but the mostly anonymous Saulnier’s little-seen little movie predicted a vast wave of possibility, foretelling a major shift in the industry. Blue Ruin is a modern indie movie success story; its arc recalls the ’90s heyday of the Weinsteins, Quentin Tarantino, and the acquisition hype cycle. But it leveraged the new vagaries of movie production, including an evolving festival culture, streaming platforms, and crowdfunding. In many ways, Blue Ruin is much like Reservoir Dogs, a movie that arrived like a comet 25 years ago at the Sundance Film Festival. But it’s different, too — Reservoir Dogs was a video store phenomenon made by a director whose cinephilia was forged in a video store. Blue Ruin is a streaming baby, christened by Netflix. “When I was working on Blue Ruin, that was the first time we were exposed to this whole world of streaming,” Blair says. “And at first, it’s not that we were suspicious; we were just like, ‘I don’t know how this works. Are people even gonna see it if it’s just on demand?’ And as it turned out, it seems as though people saw that movie much, much more on streaming platforms than they did in the theater. It makes a lot of sense, especially for smaller movies that maybe don’t have a big star in them or maybe they don’t have a ton of money for promotion and they can be discovered by word of mouth.” With its success has come the spoils of a bona fide indie movie hit: Saulnier has become a name-brand filmmaker after last year’s (even grislier) Green Room, and the sad-eyed Blair has become a working actor in Hollywood — he appeared in the Matthew McConaughey drama Gold earlier this year and will be in the forthcoming Steven Soderbergh comedy Logan Lucky. Blair’s a filmmaker in his own right now, too. His directorial debut, the similarly violent crime drama I Don’t Feel at Home in This World Anymore, premiered at Sundance in January, where it won the Grand Jury Prize. But Blair wasn’t much scared at the premiere of this movie. Its future was clear. “When we took this one to Sundance this year, its distribution was already all stitched up. It had been from the beginning,” Blair says. “It was kind of relaxing because there was nothing to worry about. Obviously you hope people are going to enjoy it and the audience is going to like it and it’s gonna get reviewed nicely, but at the very least, we didn’t have to worry about who was gonna buy it, because it was already a done deal.” Blair didn’t have to contend with the typical festival experience: He didn’t have to idly wait to hear about bids on his movie. He didn’t have to field calls from his agent or pitch the marketing vision to executives. He didn’t have to haggle over recutting or reshooting the movie’s violent conclusion. And he didn’t have to wait very long for the rest of the world to discover his movie, and that’s because I Don’t Feel at Home in This World Anymore was paid for and is distributed exclusively by Netflix. In a highly unusual strategy, four weeks after he took home the Grand Jury Prize in Park City, his movie was made available to the streaming service’s approximately 94 million subscribers worldwide. “With Blue Ruin … we took pretty much a full year of traveling to different festivals to promote it before it came out,” Blair says of the movie, which appeared in theaters more than 11 months after that fateful night at Cannes. “And in this case, it was like almost less than a month. A much faster turnaround.” Quentin Tarantino and John Cooper at the 2017 Sundance Film Festival (Getty Images) Independent cinema is moving out of the art house and into every house. The collapse of this viewing window and the bidding-war armistice has been mitigated by prefab dealmaking. Technocratic distribution companies like Netflix and Amazon have upended the state of independently produced movies. Film festivals that screen these movies were once the bastion for work created beyond the perception of Hollywood’s studio structures — films that were either unable or unwilling to penetrate the cast iron gates that lead to the moviemaking seats of power. The festivals were a home for insurgents, temples that hoisted Tarantino, Michael Moore, Sofia Coppola, Kevin Smith, Allison Anders, Robert Rodriguez, Todd Solondz, Todd Haynes, Ava DuVernay, Paul Thomas Anderson, Wes Anderson, Richard Linklater, and dozens more into the frame. Today, a movie that has been bought, paid for, and strategized against a global calendar by a massive public company is dissonant with the spirit of independent movies. What is happening is not an erosion of indie cinema, per se, nor a dissolution of risk-taking work — Saulnier’s and Blair’s films are unforgiving and uncompromising genre movies, as likely to bleed and wail as anything from 1992. But their parentage raises some fascinating questions about origins, funding, and accessibility in an evolving movie culture. Netflix and Amazon are eating yet another part of the entertainment community. But what happens when everything has been swallowed up? “We’re not the same,” Ted Sarandos told Deadline last year. “[Amazon] put themselves in the place of Sony Pictures Classics. That’s not really a disruption as much as it is a replacement. What I’m trying to do is take the benefits and the beautiful byproduct of the internet, which is all about consumer choice, and apply it to movies where no one else has. The theatrical movie window is the only window that really still exists. Every other form of entertainment is pretty much available to consumers where and when they want it. Perpetuating the movie window — adding new money to perpetuate the old system — I don’t think is really that interesting.” Sarandos is the chief content officer at Netflix, and his gentle trolling of Amazon is notable. (Amazon and Netflix declined to comment on the record for this story.) Both companies have grand ambitions in the movie business, which consumers will see in releases in coming months. But before that, we can see how they plan to overwhelm the industry in the same way that they have in TV. Netflix goes direct to its service, with virtually no theatrical window. Amazon operates in a more traditional fashion, holding the window open before sending its original films to its streaming platform offered via Amazon Prime. Amazon applies lessons learned from working within the Hollywood studio experience; Netflix defies them at will. Their strategies are different, but the endgame feels largely the same — attack the most vulnerable market in movies: the little guys. In recent years, many of the indie-boutique shingles that the major studios once supported — Paramount Vantage, Warner Independent Pictures — have closed up shop. They’ve become victims of an increasingly corporatized, IP-centric major studio strategy. Those that remain, including Fox Searchlight, Miramax, and Focus Features, have been weakened. These satellite operations working inside corporations supported independent filmmakers and smaller projects, in an effort to serve arthouse audiences, court award season prestige, and provide the corporations a bit of soul. The continued dissolution of these outlets has created an open lane. In their place, a new breed of independent-minded curators — based largely in Silicon Valley and Seattle — has risen. The tension between them starts in theaters and ends at home. “If Screening Room happened,” Sarandos said last year, “that would be real disruption.” The Screening Room is the much-ballyhooed initiative by Sean Parker, onetime Facebook president and entrepreneur. It is meant to redefine the moviegoing experience by changing how consumers see first-run movies: for the price of a $150 set-top box and a $50 screening fee per 48-hour window, new movies would appear in your home on opening day. Want to see Kong: Skull Island from the comfort of your futon? Parker wants you to as well. But most studios have been slow to accept the notion. Ever since news of the potential service — and its fraught negotiations with the major studios — broke last year, Hollywood has whinged and fretted about the future of its business. I wrote about this panic last year. At last month’s CinemaCon, an annual convention of theater owners and major studios, it appeared that the chilliness around the Screening Room has finally begun to thaw. (All this amid a boom in arthouse love in New York.) But in the year since it was announced, and right underneath its nose, Sarandos and his friendly competitors at Amazon have been subverting the very process by which movies are seen, giving people who are uninterested in the theatergoing experience a way to get their content quickly and easily. They have built a Screening Room experience inside their own business model. “There’s no physical supply chain,” Sarandos told Deadline. “So the idea that you could do something on a global platform was impossible then and more than possible right now — and the norm. Netflix now, we’re in every country in the world except for Syria, North Korea and China. When we launch our movies and TV shows, we launch them everywhere at the same second. When we buy a movie at Sundance, it’s available to the whole world.” The whole world. Sarandos fashions himself as an old-school Hollywood Showman–meets–Silicon Valley Great Man — Steve Jobs with a creased copy of The Kid Stays in the Picture. These are incisive and persuasive words from someone who has spent a lot of time imagining how best to completely upend a system he perceives as broken. Or, at least, ready for the taking. It’s Ayn Randian thinking, and perhaps justified. Netflix grew by more than 5 million subscribers last quarter, and its stock price is up 44 percent in the past year, according to The Wall Street Journal. It’s done so by adding more than $5 billion worth of original content, from children’s programming to stand-up comedy. Its strategy is market-based, not revenue-driven — it needs to grow and grow and grow against the perception of success. How Netflix Took Over Stand-up ComedyWith new specials coming from Dave Chappelle, Amy Schumer, and Chris Rock, Netflix has officially taken over the stand…theringer.com But Sarandos’s global conqueror routine is also a boon for filmmakers. Netflix’s insatiable appetite for library-building and content delivery has meant an unceasing, well, stream of new television shows, documentaries, and, increasingly, original feature films delivered to the world. With Blair’s I Don’t Feel at Home in This World Anymore, Netflix unofficially began a new initiative: releasing one new original movie on its streaming service every Friday. Last Friday, it debuted Win It All, the charming new Joe Swanberg movie starring, coproduced, and cowritten by Jake Johnson. The 35-year-old Swanberg has become a kind of paterfamilias of indie cinema in the 10-plus years he’s been making movies. But recently, the visibility of everything he’s made has been elevated on a streaming service. “Drinking Buddies honestly found its biggest audience on Netflix,” Swanberg tells me after the premiere of Win It All at the South by Southwest Film Festival in March. “It’s become pretty clear to me over the last few years that the work that I’m making is finding its audience there. And so I have [to face] the question as a filmmaker and Jake [Johnson] and I as business partners: Do we go where the audience is or do we make the audience come to us? I just think it’s not our nature, we’re not the kind of guys that are going to put our foot down and be like, ‘No, you have to experience it this way.’ If there’s a big audience over there that wants to watch it, and we already made the movie we want, that makes the most sense to both of us.” Win It All, like Swanberg’s previous Netflix-distributed films Digging for Fire and Drinking Buddies, was made for less than $5 million and grossed far less than that; these are movies you can, and maybe should, stream. They are stylistically sturdy but unglamorous and crafted with a workaday mien that suits their makers. They glide, but they don’t necessarily soar. Netflix is the perfect home for them. And it’s the only place Swanberg and Johnson took a rough cut of Win It All, the only partner they were interested in. Swanberg has even expanded to TV with the anthology series Easy (also exclusively available and paid for by Netflix), which resembles the style of his movies. A second season is already in production. Its success insinuates an emerging aesthetic: Netflix-core. Soon, there may be no movies and TV, only Netflix and Amazon and other streaming bankrolled product. In the meantime, for an artist like Swanberg with a modest background and limited reach to this point, the collaboration is a win, no matter the length or form. “After making Easy, where the show goes up on the same day to 170 countries all around the world, Netflix called me and they were like, ‘It did really well in America. It also did really well in France and Germany,’” Swanberg says. “I was like, ‘Wow, I’ve been trying for a decade to break into [those countries]. I knew they would like my stuff. It’s just that they never had a chance to see it because a French distributor and a German distributor is like, ‘I’m not about to lose $300,000 trying to turn French people on to mumblecore movies. I got better things to do with my time.’ “It’s interesting to me that it wasn’t about the work necessarily,” he continues. “It was about the accessibility of the work. And the truth is, I don’t have any grudge against that French distributor or German distributor. I wouldn’t even put my movies out in those countries. It’s a losing proposition. But with the Netflix access, those people finally had a chance to see my work and they were like, ‘We like it!’ Now we get to go back to them and say, ‘Check this one out.’” Swanberg is an artistic pragmatist who has found a distribution partner that suits his pragmatism. Swanberg and Johnson, who made his name as one of the stars of Fox’s New Girl, throw their own money in together for these projects — and they both speak forthrightly about upending the financial models of moviemaking, finding ways to get the most money to the people most responsible for their creative execution. It’s an intriguing anti-Hollywood populism, crafted by a mumblecore pioneer and a sitcom star — the duo have formed a sort of modern-day Robert Altman–Elliott Gould–style pairing. Johnson — who was featured in Jurassic World and has a part in the upcoming Mummy reboot starring Tom Cruise — is particularly intimate with the corporate machinery that can envelope a creative project. “We get to cut out all middlemen and just make work and say, ‘Do you guys like it? Guess what it’s going to cost you: Nothing, you already have a subscription. So try it! And guess what, click on it, you already pay for Netflix,’” he says. “You either know Joe through Easy and his stuff or you go, ‘Oh, it’s Schmidt from New Girl, should I watch that? That’s not Schmidt! Oh, it’s the other one.’ Just hit it. And you start it and if in those first few minutes, you’re out, I get it. But if you’re in, and you like it, then that’s actually the fan we want who then goes, ‘What else have they done?’ And I’m like, let’s just make movies for that person and say, ‘Yeah, you want to watch this one again?’ You just put your baby to sleep, you got two hours before it starts crying, here’s an hour and a half. And that’s a model I’m very personally excited about.” At the SXSW screening that premiered Win It All, the crowd was uproarious — Johnson and Swanberg told me that they always planned to first show the movie at Austin’s Paramount Theatre, which treats movies more like rock concerts than Sunday Mass. So there is something odd about wanting audiences to experience the movie, which follows a hapless Chicago gambler who just so happens to come into the possession of a big bag of cash, at home on Netflix. For Netflix’s part, the equation is still evolving. “There’s a romantic notion about the film being on a big screen,” said Sarandos last year. “There’s definitely something about a premiere at [main Sundance venue] Eccles that you can’t replicate — that I can’t replicate — but the fact is, that happens for a couple hundred people once a year. We’re doing it every day for the world. People who are discovering a movie that might change their life; that’s who they’re talking to. We have to get rid of the romantic part. I don’t really think that they’re mutually exclusive. I think over time that these films will get booked into theaters at the same time they’re on Netflix.” In the meantime, the freedom and scope of the opportunity provided by the company right now is often too much for young filmmakers to turn away from. Netflix’s ‘The Discovery’ Has the Best Opening Scene of the YearThe director of the new high-concept sci-fi drama talks about the afterlife and how to draw in an audiencetheringer.com “There’s no excuse. It’s there in your home, it’s on your phone, you can watch it anywhere,” says Charlie McDowell, the director of The Discovery, another Netflix Original that premiered last month. “But I think that hopefully what this does, is people start talking about it on social media in a way that’s intriguing and then it’s like, ‘Well, OK, I’m just gonna go watch it on Netflix.’” McDowell’s first movie, the twist-filled 2014 romantic drama The One I Love, also found an audience on Netflix, after a Sundance premiere. He didn’t plan for The Discovery to live exclusively on Netflix. But there is some serendipity in the company’s growth plans and his chance to show the biggest possible audience a meditative science fiction drama that may not scream “box office windfall.” “I set out for this movie to be seen in the theater, and then that changed in a way that I’m totally OK with — and the partnership with Netflix has been so successful and so strong and I really respect them and love what they’re doing, especially this year with original films,” McDowell says. “This is the year of original films breaking out for Netflix.” Terry Crews, Ted Sarandos, and Adam Sandler at the premiere of ‘Sandy Wexler’ (Getty Images) The service has effectively communicated its plan to filmmakers of all stripes. Later this year, it will release what would have otherwise been major studio pictures starring Brad Pitt (May’s War Machine), Will Smith (December’s Bright, from the director of Suicide Squad), and of course its never-ending string of Adam Sandler features, including this month’s Sandy Wexler. But it’s indie directors who stand to gain the most from the service’s reach. “The only thing I care about is that people see this film. And a lot of people are gonna see this film just based on where it’s available,” McDowell says. “My friends made [the Netflix original series] The OA, which is something [where] if you go to a coffee shop, people are talking about it. And so you know that it hit. And so the next thing is: Can that translate to original films? Which I think for Netflix, that’s the next territory.” The protection that these films and filmmakers have from the terror of box office receipts perpetuates a mystery about their own success. Much like the television showrunners, network executives, and agents who have expressed concern over Netflix’s refusal to share internal viewing metrics, filmmakers now have to trust that the corporate steward that has funded their vision and delivered it via a locked service is helping expand their careers, and not limiting them. This is unprecedented. How do we define a hit director in this environment? Will we know a Spielberg when we see one? McDowell acknowledges his metric for success is more ill-defined than ever. “I’m not gonna know the numbers of how many people have seen [The Discovery], obviously, but I feel like it’ll just be, Are people talking about it on social media?” McDowell says. “Are people coming up to me saying, ‘I saw your film and discovered it on Netflix’? That’s how I’ll measure it, I guess.” And what of the festival culture that heretofore announced major independent film talents? That lane is still open. But there are caveats. “Sundance actually does a very good job preparing you,” says JD Dillard, whose debut feature, Sleight, played the festival in 2016 and will hit theaters on April 28. “And so much of [what they told me] turned out to be true, which is crazy. We premiered on a Saturday and then starting Sunday, there are phone calls — ‘Oh, we’re gonna do this,’ and, ‘We want to sit down with you, but we want to change these pieces,’ and, ‘We want to take it into direct to VOD, but here’s how we’re gonna do it.’ Other people were like, ‘We’ll just put it on the screen now.’ There were some people who didn’t want to touch it; there were some people who were like, ‘What if we reshoot this piece?’ All that is part of the conversation.” “We were open to whatever anyone was saying,” Dillard says. “But — and maybe it’s naive — we wanted to see this movie in theaters. I understand that the distribution model is rapidly changing every single day and Netflix and Amazon are just as good as opening on 2,000 screens. But for this movie [theatrical distribution was the right choice], and honestly that was motivated by what the energy of Sleight was at the festival.” Sleight follows a young street magician who gets caught up in a drug dealer’s web and is forced to use some of his skills to escape — it’s a genre movie, craftily made on the cheap. Dillard previously worked at J.J. Abrams’s Bad Robot as a receptionist and later as an assistant on the set of Star Wars: The Force Awakens with Abrams. His ambitions are big, wide-release stories, and he’s reportedly been tapped to direct a remake of The Fly. But unlike Blair, Dillard has had to wait for more than 15 months for the public to see his movie. After brokering a deal with Blumhouse and WWE Films, Dillard entered a period when he was forced to resume his life and earn a living while tuning up his movie for its wide release. Few had seen Sleight and so momentum was difficult to come by. Artistic purgatory doesn’t pay. “Here’s the not-so-glamorous side of independent film: All of my student loans defaulted, all my credit cards went into collections, I went back to Bad Robot to help my friends who are chefs there, to help them in the kitchen,” says Dillard. “So I was doing whatever I could, but I still had to keep so much time open for Sleight, and that process sucks — like, it really sucks. And that’s nobody’s fault. It’s the nature of a low-budget [movie], where you can’t just pay somebody 85 grand [to fix all your problems].” There was no such interregnum for Macon Blair. “It seems to me like a cool way of doing things,” Blair says of his movie’s quick arrival on Netflix. “If the temperature is already up on a particular title to not let it cool off and then have to re-remind people about it nine months or 12 months later, just sort of strike while the iron is hot.” “I think it’s a good thing for us because now when I talk about these films, even at a dinner party, I don’t have to go, ‘Oh yeah, that’s right, you weren’t at the festival,’” says John Cooper, longtime director of the Sundance Film Festival. “They become part of the dialogue of our independent community faster.” Festival work is difficult, and requires thousands of hours of labor — watching unfinished films, identifying themes, securing contracts, creating a schedule, building atmosphere, arranging countless screenings and panels. Sundance is a machine and the most respected festival of its kind, but that reputation has taken years to acquire and hold. It’s human work. It feels like a strain that would be removed by an AI observing the movie business. Do the closed windows perpetrated by massive, studio-esque corporations obviate the need for film festivals in the first place? Cooper says no. “I think there’s still a need for us to be curatorial and for us to have — I don’t want to say the word ‘pure’ — but almost have that more noncommercial approach to selecting films and celebrating,” he says. “A noncommercial celebration is important. Even for Netflix.” Twenty-five years ago, no one wanted to touch Reservoir Dogs. Not even Harvey Weinstein, the man who would become Quentin Tarantino’s creative guardian angel. In his book Down and Dirty Pictures, the film industry historian Peter Biskind tracks the parallel arcs of Miramax, Sundance, and a crop of brash young filmmakers that included Tarantino. The Reservoir Dogs director, then a pugnacious 28-year-old video-store clerk and aspirant auteur, had recently felt the sting of rejection at Sundance, where his violent and narratively audacious debut won zero awards. “It wouldn’t have been such a bad thing if I hadn’t been told by everybody I was gonna win — something. But it hurt my feelings,” Tarantino told Biskind. “I was sad, I was mad. When it was over I did a slightly less drastic version of storming out. ‘Fuck all you!’” Reservoir Dogs, a pulpy and unlikely festival entrant, made an impression, but there wasn’t much interest in distributing the movie. Biskind recounts the post-Sundance round of screenings to potential distributors: Twenty minutes into it, Harvey was getting a little itchy. [Mark] Tusk told him, “Sit still. Trust me.” The movie ended. Harvey was dubious, afraid it would be a hard sell at the box office even if it got good reviews, which seemed questionable, given the carnage. Back in New York, the brothers screened it again, then went around the room, canvassing the staff. Ben Zinkin, an outside counsel, said, “That was probably the single worst movie I’ve ever seen.” “Russell?” Russell Schwartz, head of marketing, replied, “Not my cup of tea. For me, it’s a pass.” Reservoir Dogs would not have gotten past theatrical distributors this year. But it also might not have been able to transcend its origins if it had been scooped up by a major streaming service. There’s no way to know. Sundance showed 119 feature films this year. Forty-one have been sold thus far — Netflix bought 10, Amazon Studios five. Those are by far the highest acquisition totals. They have completely replaced Miramax and Sony Picture Classics as the power brokers of the festival. “The people who are acquiring movies and putting together these deals are a lot of the people I knew back in the day from other companies,” Cooper says. “It’s not necessarily a whole new set of people that are at Amazon, that are at Netflix. It’s the same faces of a lot of people that helped create Miramax and other companies back in the day. So I find that interesting, too — they’re still basically doing the same kind of job. It’s just for a different platform.” Some say there is reason to be cautious about the long-term viability of this wave. “There’s a window right now where they’re all trying to fill up, but at some point, Amazon will have enough titles and all they’ll care about are the big ones that are coming up,” the producer Chris Moore, whose Manchester by the Sea was funded and distributed by Amazon Studios, told me last fall. “And if you’re a subscriber of Prime, which is what they care about, do you care if they have 50,000 titles or 6 million? As long as you get what you want out of the 50,000, what are you going to do with that other 5 million titles, right? They’re just going to sit there.” Netflix and Amazon’s surge presents complications for independent producers and filmmakers, too. Is this an endless waterfall of acquisition and distribution? Or will the water run dry? “The biggest problem is what you’re selling when you make movies — whether it’s a studio or a guy like me raising independent money — is you’re selling the potential of a hit,” says Moore. “You’re selling that the business and my experience in the business gives you a higher-percentage chance that you’re going to get your money back. And I don’t think you can sell any of that anymore.” Ted Hope and Casey Affleck at Amazon Studios’ Oscars celebration (Getty Images) It’s a fascinating concept, a puzzle box dropped right in the middle of an industry that thrives on metric success, whether box office draw or award hauls. Manchester was an Oscar success story in winning awards for Best Actor and Best Original Screenplay and reeled in $62 million at the box office worldwide, an impressive figure given its dark story line and provenance. Likewise, Amazon helped shepherd the small and heady James Baldwin documentary I Am Not Your Negro to profitability and an Oscar nomination. In just two-plus years, the biggest technology and consumer marketplace company has scaled Hollywood credibility. It’s done so, in part, by playing by traditional rules. Just last week at a keynote discussion at MIPTV in Cannes, Amazon Studios head of media development Roy Price praised the value of theatrical distribution in its movie strategy: “Whatever you may predict to happen six or seven years from now, theaters play an important role in the movie ecosystem now, so why not participate in that? … Once the movie comes on the service having been in theaters, I think there is a perception that it’s a legit movie: It was reviewed, and it was in a theater — it’s like, a movie. It helps with customer perception, it helps with filmmakers, so we’re very supportive of the theatrical window.” That sentiment is still powerful for a filmmaker like James Gray, who has released five films with independent distributors. His new movie, the gorgeous period adventure The Lost City of Z, will be distributed by Amazon Studios. He wants his movies in theaters. “Ten years ago, I’d give interviews and we’d talk about the future of cinema and I felt very much like a Cassandra,” Gray says. “Movies reflected a temporary moment. People assume that art forms last forever. But let’s face it: If you were a composer of opera, you would be in deep trouble. Opera was a popular medium in 1860 or 1870 and when Verdi died, 400,000 lined the streets of Rome for his funeral. And today you can go to the opera, but you dress up and it’s $300 for a great seat, which is crazy. And who can pay that? It’s become a rarefied thing. And I started to see that movies, the tradition where you go and sit in the theater and pay your money and eat your popcorn, enjoy that as a communal experience, that that was under grave threat. This was 10 years ago. I don’t think that anything I’ve said then was disproven by anything happening now. I think where we’re headed, which is a world that is [dictated by] Amazon and Netflix, is essentially you watch these things at home on your 60- or 70-inch television. I’m against that.” Netflix has announced at least 20 more original films that will be released on its service this year, ranging in size from Sundance to Sandler. Amazon Studios is newer to the field, releasing one film in 2015 and 15 last year, including major achievements, like Park Chan-wook’s The Handmaiden and Jim Jarmusch’s Paterson, that would otherwise have been forced to find distribution with one of the boutique distribution houses. Amazon has 14 films planned for this year, including production and distribution for Todd Haynes’s followup to Carol, Wonderstruck, as well as Richard Linklater’s Last Flag Flying, a sequel to The Last Detail starring Bryan Cranston; it produced, and will co-distribute, Doug Liman’s John Cena–starring The Wall with Roadside Attractions; it also picked up distribution for the Sundance darling The Big Sick. Amazon’s strategy, overseen by Price, Head of World Wide Film Jason Ropell, and Head of Motion Picture Production Ted Hope, is an amalgam that is driven by taste and inbound experience. Hope, whose Good Machine Films production company was a driving force in ’90s indie cinema, has brought 30 years of knowledge to Amazon. He’s an idealist in a confusing environment. “I really do believe that we, the creative community, are on the precipice of what I think will be the greatest period in filmmaking ever,” Hope said last summer at the Seattle Film Festival. “I know you all want to know about the secret Amazon algorithms for how we pick our films and spend money. … I constantly say, ‘Why do movies suck? Why are these scripts just not better?’ This is my first pass at talking about how we can engineer better movies.” Hope buys what he likes, and what he thinks can work, but he’s begun blending social media observation and digital data tracking with gut-level decision-making. He’s an Amazon man now. “I have a personal aesthetic of appreciating noble failures,” he said last summer. “As a student, I learn when it doesn’t work; it helps me as an artist. But I know the audience doesn’t like those, so as an executive, I can’t really go out and try to spend my money on noble failures.” Sometimes that results in a Todd Haynes movie. Sometimes it’s a John Cena war flick. And sometimes it’s a remake of a giallo horror classic, like Luca Guadagnino’s upcoming reimagining of Dario Argento’s Suspiria. Movies are still a mystery, a shot in the dark. But some fear that the unknown is evaporating from the equation. “I have a bunch of young filmmakers who come to me and they say, ‘Hey, I made a movie for $800,000 and people like it and it’s getting a small, theatrical release, which is actually costing me money, and then I made this deal with Netflix for $300,000,’” says Chris Moore. “So the next time they go do it, they figure, that movie was pretty good, everybody seemed to like it, all we got was $300,000 from Netflix, so I got to make the next one for $300,000.” Just as the viewership data is locked for these movies, so are the budgets. The raft of small films that have been bought and paid for by Netflix enforce a new kind of relationship that more closely resembles the old studio-contractor model that employed actors in the 1930s and ’40s: Netflix owns everything. There are no DVD sales, no international receipts, no TV syndication deals. The only difference is the absence of the creative shackles that Louis B. Mayer and Jack Warner employed. Swanberg returns to Netflix because he likes what he hears from the company and the financial security it provides. McDowell likes the reach. Blair likes the ease of use. The appeal of Netflix, and its war chest, is incalculable right now. Ted Sarandos is evasive about the financial impact of spending at will and flooding the market with content. His is a scale-building pursuit, the vision of a seemingly never-ending library, each title opening with its very own cherry red, animated Netflix logo at the start. “We don’t spend any time talking about Wall Street when we do content acquisition deals,” Sarandos said last year. “It serves our model probably in the same way it does to make a season of House of Cards. It’s about making content that people love, value and associate their Netflix membership with. So when they say, ‘I’m a subscriber to Netflix because I love Orange Is the New Black,’ or, ‘I can’t wait to see The Crown,’ they know they can’t do it anywhere else. “Movies, it’s tough to have the same economics because it’s two hours of watching instead of 13 hours. But [the forthcoming Will Smith film] Bright is a movie that they would have seen in the theater, yet because they’re Netflix members they get to watch it whenever they want, wherever they want, at the same moment. There’s no window, no waiting. The producers will make money, and they chose this over the other models. They didn’t do it because they had a point to prove or they had any interest in Netflix’s value market gap. They did it because this was a more profitable way to make and release movies. Our first ambition is that it becomes like a major studio slate.” For Netflix, that means more, bigger, and wider. But it also means being everything. To be a major movie studio is to serve every so-called quadrant, to market-test and research human interest. And to take chances inside of that research. “So when I say I think about it as a slate, I think about it both in volume and scope from a couple of tentpoles, some nice films in the middle, and some great independent,” Sarandos said. “What I’m really excited about is our original films that we’re producing.” What Sarandos does provide — what differentiates him from, say, Harvey Weinstein — is full-blown creative control to his filmmakers. Every single filmmaker I’ve spoken with this year has testified to the astonishing freedom the companies provide. “If you disagree with a note from Netflix or Amazon, you can have a creative discussion about it,” Gilmore Girls creator Amy Sherman-Palladino recently told The Wall Street Journal. “It’s not viewed as, ‘You didn’t take my notes? You’re an enemy and I’m going to cancel your show.’” “I’ve done this one time and I don’t know if my experience is different from other people’s experience, but from what I saw, the sort of creative freedom that was given to me is a really, really attractive feature to this model,” says Macon Blair. “And also the fact that they can get down with stuff that, for whatever reason — whether it’s the cast or the content or the subject matter — might not be viable for other places.” Netflix closing the door for dozens of theatergoing opportunities is a strange conundrum. Would I Don’t Feel at Home in This World Anymore work better in a theater with 200 people? Maybe. But what’s lost in it not appearing on that venue? Blair says the opportunity outweighs the loss. “I’m not slamming the more theatrical-based distributors either,” Blair says. “There’s just a different set of conditions that have to be met, which is totally valid, but I think it opens up more space that filmmakers who might not otherwise be able to get something done, like in this case me, to be able to do something. “Jeremy [Saulnier] has a movie [Hold the Dark] that he’s working on right now which is much, much bigger than mine and much bigger than anything that he’s done before. [It’s] also going to be on Netflix, and I can’t say this with any kind of certainty, but I would guess, because the script is very dark and kind of weird and challenging, that Netflix might have been able to confidently take a chance with it in a way that other places wouldn’t. The movie is right in Jeremy’s wheelhouse, so I think fans of his will really enjoy it, but it may not have happened if not for Netflix rolling the dice on it.” Not everyone is so bullish on the future foretold by this brave new independent cinema. Despite the overwhelming opportunity Amazon and Netflix provide, a duopoly is not a democracy. The biases of the people who curate the experiences on these services could dictate the shape of small-scale moviemaking for decades to come. The Teds Hope and Sarandos have proved artist-first executives so far, but that is not a guaranteed future. And furthermore, how long will the Big Two pursue smaller films at this rate? If Bright is an internal mega-hit for Netflix, in the same way the service claims that Sandler’s films are, does that mean a Disney-level pursuit is in the offing? Though it has failed in its efforts thus far, it’s only a matter of time before Netflix muscles its way into the last great movie market: China. Which means more spectacle, more action-based storytelling, and certainly fewer indie-centric acquisitions. China Will Not Save HollywoodProjections about the box office future of China — and Hollywood reactions like ‘The Great Wall’ — may be shortsightedtheringer.com For James Gray, there is a sadness in his experience. His career has been marked by notoriously frustrating encounters with distributors, difficulties marketing his films, and public quarreling with Harvey Weinstein over their content. But even as he finally reaps the benefits of working with a company like Amazon, and as he awaits the release of The Lost City of Z, his most ambitious and uncompromising film, he’s melancholy. “I mourn … I got into movies in 1987 when I started in college in USC film school. And when I graduated in 1991, the scene was still very much the same as it had been in 1935,” Gray says. “It was actually better than it was in 1935, because you would make your film and then it would come out on videotape. And a few years later on DVD. So it had a life that wasn’t only in theaters. So in that sense, it’s better. We can discover these films for years to come. And it can find new audiences. “But the major negative,” he says, “is that intimacy — that womblike intimacy — that we have with the screen, no longer speaks to us.” ", "parent": "", "title": "The End of Independent Film As We Know It", "child": "23_1\t23_2\t23_3\t23_4\t23_5\t23_6\t23_7\t23_8\t23_9\t23_10\t23_11\t23_12\t23_13\t23_14\t23_15\t23_16\t23_17\t23_18\t23_19", "name": "23"}