{"name": "230", "parent": "", "content": "A letter to my helpless 4 year old self And to those of us who had difficult childhood http://www.janekahan.com/ Child of the moon, You are still wondering if you should jump off the moon. You should not be jumping on your own. You should not be jumping because “a child of the moon always wanders around the stars. She dances her way through constellations, to the beat of a midnight sky.” I know you are scared. I can see it in the trembling of your spine. You are scared of turning to face the reality of a man you once loved with a gun. You are too scared to run because they told you these walls are here to stay. You want to shrink so they don’t see you anymore. Can they forget you exist? You dreamed of escaping. You dreamed and fantasized and retreated into this other world. Your imagination. You imagined a world where there are trees instead of bullet torn buildings. Where the air smelled of jasmine instead of gunpowder. Where your teta (grand-mother) is your mother. Where you know you can return in her arms for eternity, she plays with your hair, sings to you that you are her heart, and prepare your favorite food, meghleh. A world where screaming is replaced with oriental beats. Where you can dance your heart away, twist and twirl, and people will join you and laugh to the rhythm of your laughter. A world where your dad, is a good, safe, strong man. A world where he would protect you from the dangers of the war, where he will support your mother in providing for the family. Where he does not break your trust, and …A world where you are proud of your father, where you do not have to hide him, lie about him. A world where men do not break your trust. A world where men support you in stepping into your own power, and are not intimidated by you. You dreamed of a world where you can be a child and not a parent. Because you were not ready to be a parent. Where you can play, get curious, be silly, trip, fall, stand up, get lost, and come back home. Child of the moon, I cry your tears. I yell your anger. I feel your fear. I see your scars. I understand your despair.But I also guard your dreams.Will you hold my hand and join me just for a moment? Come off the moon, I will catch you, and take you to a warmer place. They say the moon can be cold.I built this for you. I built this with you. Look around you. Look at California’s redwood trees. They are all yours. Feel the water of the Pacific ocean in the morning. Breathe in the peace of waking up to the chirping of the birds. Look to your right. Look at the faces of the ones that love you, for just being you. The ones that are not expecting anything from you, but to just be. Look to your left. Look at the man that has chosen you for your emotions, your joy of life, your “out there’ ways. Look at this man that keeps you safe, and loves you. Look at you in the mirror. See your beauty. Your wild curls. Your sweet blemishes on your face. Read the words you write, that distill the beauty in the midst of fear. Watch your dance moves. Hear your laugh. Honor that you can feel. You can feel all the human feelings. You have been blessed with an incredible access to emotions. Look at your work. You have helped many see their pearl in the darkness. You have given love and hope to strangers. The love in you can fill up the sky. I know you are tired. I know you are drowning in shame. But listen, we are getting out of this hole. We have made so much progress. I am not giving up on you. I am not leaving. You don’t trust me and you are right. I am learning to earn your trust. I have mixed my voice with theirs. And yelled at you, pushed you, shamed you, belittled you, abused you. Stepped all over your wounds. Will you forgive me? I am committed to restoring safety in your life. I owe this life to you. If it weren’t for your grit, courage, intelligence, strength, and resilience I would not be sitting here today, at a cafe in San Francisco drinking an almond hot chocolate, wearing comfy yoga clothes, on a sunny afternoon, writing a letter to you on an apple laptop, getting ready to go to a Hakomi session. I wouldn’t have gotten the taste of what safe feels like.Thank you for surviving, so we continue thriving. With tears and laughter Your 32 year old self Be a patron of my upcoming poetry book Child of the moon, how I survived and healed trauma. You can give anywhere from $1 — $100. ", "title": "A letter to my helpless 4 year old self", "sentences": [{"e57f": "A letter to my helpless 4 year old self"}, {"37d8": "And to those of us who had difficult childhood"}, {"0a3b": "http://www.janekahan.com/"}, {"cb44": "Child of the moon,"}, {"7361": "You are still wondering if you should jump off the moon. You should not be jumping on your own."}, {"2e76": "You should not be jumping because “a child of the moon always wanders around the stars. She dances her way through constellations, to the beat of a midnight sky.”"}, {"0bc0": "I know you are scared. I can see it in the trembling of your spine. You are scared of turning to face the reality of a man you once loved with a gun. You are too scared to run because they told you these walls are here to stay. You want to shrink so they don’t see you anymore. Can they forget you exist?"}, {"d431": "You dreamed of escaping. You dreamed and fantasized and retreated into this other world. Your imagination. You imagined a world where there are trees instead of bullet torn buildings. Where the air smelled of jasmine instead of gunpowder."}, {"ef15": "Where your teta (grand-mother) is your mother. Where you know you can return in her arms for eternity, she plays with your hair, sings to you that you are her heart, and prepare your favorite food, meghleh."}, {"7f35": "A world where screaming is replaced with oriental beats. Where you can dance your heart away, twist and twirl, and people will join you and laugh to the rhythm of your laughter."}, {"ed1b": "A world where your dad, is a good, safe, strong man. A world where he would protect you from the dangers of the war, where he will support your mother in providing for the family. Where he does not break your trust, and …A world where you are proud of your father, where you do not have to hide him, lie about him. A world where men do not break your trust. A world where men support you in stepping into your own power, and are not intimidated by you."}, {"50fb": "You dreamed of a world where you can be a child and not a parent. Because you were not ready to be a parent. Where you can play, get curious, be silly, trip, fall, stand up, get lost, and come back home."}, {"b8e0": "Child of the moon,"}, {"d825": "I cry your tears. I yell your anger. I feel your fear. I see your scars. I understand your despair.But I also guard your dreams.Will you hold my hand and join me just for a moment? Come off the moon, I will catch you, and take you to a warmer place. They say the moon can be cold.I built this for you. I built this with you."}, {"7430": "Look around you. Look at California’s redwood trees. They are all yours. Feel the water of the Pacific ocean in the morning. Breathe in the peace of waking up to the chirping of the birds."}, {"1af2": "Look to your right. Look at the faces of the ones that love you, for just being you. The ones that are not expecting anything from you, but to just be."}, {"ed6b": "Look to your left. Look at the man that has chosen you for your emotions, your joy of life, your “out there’ ways. Look at this man that keeps you safe, and loves you."}, {"ab00": "Look at you in the mirror. See your beauty. Your wild curls. Your sweet blemishes on your face."}, {"b4b5": "Read the words you write, that distill the beauty in the midst of fear. Watch your dance moves. Hear your laugh. Honor that you can feel. You can feel all the human feelings. You have been blessed with an incredible access to emotions."}, {"17fd": "Look at your work. You have helped many see their pearl in the darkness. You have given love and hope to strangers. The love in you can fill up the sky."}, {"5788": "I know you are tired. I know you are drowning in shame. But listen, we are getting out of this hole. We have made so much progress. I am not giving up on you. I am not leaving."}, {"7801": "You don’t trust me and you are right. I am learning to earn your trust. I have mixed my voice with theirs. And yelled at you, pushed you, shamed you, belittled you, abused you. Stepped all over your wounds."}, {"597a": "Will you forgive me?"}, {"f40e": "I am committed to restoring safety in your life. I owe this life to you. If it weren’t for your grit, courage, intelligence, strength, and resilience I would not be sitting here today, at a cafe in San Francisco drinking an almond hot chocolate, wearing comfy yoga clothes, on a sunny afternoon, writing a letter to you on an apple laptop, getting ready to go to a Hakomi session."}, {"1878": "I wouldn’t have gotten the taste of what safe feels like.Thank you for surviving, so we continue thriving."}, {"616c": "With tears and laughter"}, {"9511": "Your 32 year old self"}, {"0fa1": "Be a patron of my upcoming poetry book Child of the moon, how I survived and healed trauma. You can give anywhere from $1 — $100."}], "child": "230_1\t230_2\t230_3\t230_4\t230_5\t230_6230_1\t230_2\t230_3\t230_4\t230_5\t230_6230_1\t230_2\t230_3\t230_4\t230_5\t230_6"}