{"sentences": [{"f1da": "O que aprendi com o câncer"}, {"ab3d": "Considero-me uma pessoa comum. Nasci, por mero acaso, em Campina Grande, na Paraíba, no nordeste do Brasil há exatos 53 anos. Minha família é meio carioca e meio mineira. Meu bisavô carioca chama-se Mário Queiroz e casou-se com a gaúcha Laura Vargas da Silva. Tiveram dois filhos, meu avô José Henrique e minha tia-avó Célia. Ele era proprietário de um cartório no Rio e morava numa casa na Rua Souza Lima, no posto seis, em Copacabana. Nessa época, Ipanema era ainda um imenso areal, mas meu bisavô vislumbrava que era para lá que a cidade iria crescer e resolveu investir comprando terras ali."}, {"dbcf": "Meu avô, José Henrique, nasceu, cresceu, viveu e morreu — muito precocemente devido a um problema cardíaco congênito — aos 49 anos. Não mais na casa da Souza Lima, mas no edifício Mato Grosso, construído onde antes era a casa do meu bisavô. Os apartamentos 102 e 202 foram deixados de herança para, respetivamente, meu avô e minha tia-avó. Meu avô casou-se com Martha Matthiesen — inglesa de nascimento, porém naturalizada brasileira — e tiveram sete filhos: quatro meninos e três meninas. Dentre as meninas, minha mãe foi a caçula por quase oito anos, quando nasceu minha tia mais nova que, se não me falha a memória, é apenas dez anos mais velha do que eu."}, {"f516": "Meus avós se desquitaram no final dos anos 50. Meu avô ficou morando no Rio e minha avó mudou-se para São Lourenço, Minas Gerais, onde o casal mantinha uma casa de veraneio. Minha mãe e irmãos se dividiam entre Rio e São Lourenço e minha tia-avó, devido ao problema cardíaco do meu avô, assumiu boa parte da responsabilidade de educar os sobrinhos, além, claro, dos três filhos que teve com o médico e pesquisador Flávio Poppe de Figueiredo."}, {"a894": "(Até aí, tudo bem? Está dando para acompanhar? Vou chegar lá.)"}, {"51b0": "Voltando ao que interessa, foi numa dessas idas e vindas a São Lourenço, que minha mãe conheceu meu pai, um jovem mancebo da família Junqueira. E numa escapadela, lá estava eu, crescendo no ventre da minha mãe, uma linda jovem de 19 anos. Aí o bicho pegou. A família do meu pai, tradicionalíssima e muito católica, fez questão do casamento. Minha mãe não teve alternativa e… casou, claro. Um ano e oito meses depois, numa terça-feira de carnaval, nasceu minha doce, meiga, linda e amadíssima irmã, no apartamento 202 do prédio da Rua Souza Lima. Minha mãe estava na praia porque o parto estava previsto para inicio de abril E o casamento dos meus pais terminou cerca de seis meses depois."}, {"6f72": "Minha mãe casou-se novamente — e está casada até hoje — com um ex-namorado que morava no mesmo prédio e era amigo dos meus tios. Já meu pai, uma pessoa complicada, casou-se também novamente, teve mais duas filhas e tornou a se separar. Nunca tive com ele uma ligação afetiva e convivi muito pouco apesar de ter morado com ele e a mulher por dois anos. Meus laços afetivos eram com meus avós, principalmente com meu avô, que representava muito bem a figura paterna. O carinho e o amor que existia entre nós — eu, minha irmã e meu avô — não deixaram margem para nenhuma frustração ou carência de afeto paternal. Vovô Dirceu foi um senhor pai!"}, {"1dd6": "Meu avô querido morreu em 1975 em consequência de dois infartos. Acredito que as estripulias do meu pai — alcoólatra (me recuso a usar o termo alcoólico, porque considero uma tradução mal feita do inglês alcoholic), imaturo, megalômano, mitômano, entre outras patologias psiquiátricas –, criou tantas situações difíceis e complicadas, que acabaram estourando sobre os ombros do meu avô, que não aguentou a pressão."}, {"71dd": "Resumindo, tive até aqui, uma vida comum, com altos e baixos, sucessos e fracassos, idas e vindas, como a maioria dos mortais. Tive uma certa dificuldade em escolher o que eu queria fazer profissionalmente. Aos 17 anos resolvi que ia fazer medicina. Fiz o vestibular da falecida Cesgranrio e passei mara medicina sem sequer ter concluído o que na época chama-se de segundo grau. Porém, para conseguir cursar a faculdade teria que entrar com mandado de segurança e minha mãe, apesar dos meus apelos, se recusou a fazer qualquer coisa nesse sentido. Respondeu simplesmente o seguinte: “Se você passou agora, vai passar ano que vem”. Engoli e acatei."}, {"801d": "Só que no ano seguinte eu não queria mais estudar medicina, eu não queria mais estudar. Queria trabalhar e ter meu próprio dinheiro. Foi o que fiz. Comecei a trabalhar e a ganhar um dinheirinho. Enquanto isso, minha irmã, também resolveu largar os estudos e foi trabalhar na Editora Abril ganhando um salário astronômico para os padrões da época. (Esqueci de dizer que toda a família, minha mãe, meu padrasto e minha irmã eram jornalistas e/ou trabalhavam em empresas de comunicação.)"}, {"97a5": "Diante disso, preciso confessar, me bateu uma certa depressão. Não sabia mais o que eu queria ser quando crescesse. Até que um belo dia, um grande amigo que estudava Design Gráfico e Desenho Industrial na PUC, lendo meus textos, sugeriu que eu fizesse Comunicação. Aceitei na hora e fui estudar Comunicação na Faculdade da Cidade. Em 1990 estava formada em jornalismo. Mas meu primeiro emprego foi numa agência de publicidade. Fiquei por lá até ter certeza que aquela não era aminha praia. Seis meses bastaram para que eu chegasse a essa conclusão."}, {"f11d": "Foi nesse momento que me enchi de coragem e fui até à redação de O Globo, cujo chefe de reportagem era amigo da minha mãe e pedi a ele uma chance, caso houvesse vaga. Comecei no dia seguinte, como repórter free-lancer do finado Globo Barra. Adorei o novo trabalho e em pouco tempo eu estava trabalhando para outras editorias, como Informática e Jornal da Família. Estava feliz da vida, apesar do salário não ser lá essas coisas e a contratação ainda não ter saído. Depois de um ano e pouco, avisei ao chefe de reportagem que não ia ficar porque eu precisava que assinassem minha carteira. Me afastei por uns seis meses e fui convidada a voltar para trabalhar com o Zózimo. Mal pude acreditar. Fui à entrevista com o Zózimo, fiz uma espécie de test drive durante um mês e ele me aprovou. No entanto, a pessoa que assinava a coluna com ele, não gostou nadinha. O clima foi ficando pesado, a situação foi ficando insustentável por causa do ciúme e das fofocas e eu me demeti."}, {"7d80": "E foi aí que minha vida deu uma guinada. Me separei, fiquei sem trabalho, sem o meu amor e sem saber que rumo tomar. Me mudei para Itaipava, distrito da cidade serrana de Petrópolis e resolvi recomeçar minha vida aqui. Segui no jornalismo até 2000. No ano seguinte, influenciada pela médica veterinária que cuidava dos meus bichinhos, resolvi fazer outra faculdade: medicina veterinária. E hoje, formada há 11 anos, estou tentando implementar um projeto bastante audacioso, em parceria com alguns colegas. No entanto, para que seja um empreendimento bem sucedido, vamos ter que aguardar os rumos da economia e da política nacionais. No momento, os projetos estão em fase de maturação e se tudo der certo — e vai dar! — a partir de 2017, poderemos começar a pensar em por em prática os planos que a atual conjutura econômica e política nos obrigaram a adiar."}, {"f256": "E tudo isso começou porque minha doce irmã teve um câncer: linfoma não-rodgikin folicular, grau 2 e eu aprendi algumas lições:"}, {"65f5": "- a força do paciente vem de dentro;"}, {"c62d": "- a rotina do paciente e dos familiares é alterada de forma abrupta;"}, {"41ca": "- ouvir os conselhos médicos é fundamental, assim como não ter medo de perguntar nada, por mais idiota que isso possa parecer;"}, {"a55c": "- descobrir que a simples menção da palavra câncer provoca reações diversas nas pessoas;"}, {"d635": "- jamais supervalorizar o câncer;"}, {"1bc8": "- evitar dramas, estados depressivos e conhecer a fundo a doença;"}, {"e98d": "- não é uma sentença de morte;"}, {"8295": "- cada caso é um caso;"}, {"21b9": "- os amigos de verdade se sobressaem e o resto, não tem importância porque não são amigos, são conhecidos;"}, {"7107": "- 50 porcento da cura depende do paciente, os outros 50 porcento do médico, das drogas e do carinho e força dos mais próximos"}, {"2442": "E para finalizar, essa experiência com o câncer da minha irmã mudou minha forma de enxergar a vida, mudou meus valores e minhas prioridades e a principal lição é que a força e a coragem dela me inspiraram, me serviram de incentivo para levar adiante meu projeto na veterinária. Precisei tirar força do âmago para lidar com essa nova realidade e Deus sabe o quanto foi difícil, mas valeu cada segundo, porque ela me fez ver que a força, a vontade, a fé, a alegria de viver e, sobretudo, a maneira de encarar a vida e o mundo ao redor, fazem a grande diferença entre vida e morte, entre sucesso e fracasso, entre ser e ter. Ela optou pela vida e eu também"}], "child": "2303_1", "parent": "", "title": "O que aprendi com o câncer", "content": "O que aprendi com o câncer Considero-me uma pessoa comum. Nasci, por mero acaso, em Campina Grande, na Paraíba, no nordeste do Brasil há exatos 53 anos. Minha família é meio carioca e meio mineira. Meu bisavô carioca chama-se Mário Queiroz e casou-se com a gaúcha Laura Vargas da Silva. Tiveram dois filhos, meu avô José Henrique e minha tia-avó Célia. Ele era proprietário de um cartório no Rio e morava numa casa na Rua Souza Lima, no posto seis, em Copacabana. Nessa época, Ipanema era ainda um imenso areal, mas meu bisavô vislumbrava que era para lá que a cidade iria crescer e resolveu investir comprando terras ali. Meu avô, José Henrique, nasceu, cresceu, viveu e morreu — muito precocemente devido a um problema cardíaco congênito — aos 49 anos. Não mais na casa da Souza Lima, mas no edifício Mato Grosso, construído onde antes era a casa do meu bisavô. Os apartamentos 102 e 202 foram deixados de herança para, respetivamente, meu avô e minha tia-avó. Meu avô casou-se com Martha Matthiesen — inglesa de nascimento, porém naturalizada brasileira — e tiveram sete filhos: quatro meninos e três meninas. Dentre as meninas, minha mãe foi a caçula por quase oito anos, quando nasceu minha tia mais nova que, se não me falha a memória, é apenas dez anos mais velha do que eu. Meus avós se desquitaram no final dos anos 50. Meu avô ficou morando no Rio e minha avó mudou-se para São Lourenço, Minas Gerais, onde o casal mantinha uma casa de veraneio. Minha mãe e irmãos se dividiam entre Rio e São Lourenço e minha tia-avó, devido ao problema cardíaco do meu avô, assumiu boa parte da responsabilidade de educar os sobrinhos, além, claro, dos três filhos que teve com o médico e pesquisador Flávio Poppe de Figueiredo. (Até aí, tudo bem? Está dando para acompanhar? Vou chegar lá.) Voltando ao que interessa, foi numa dessas idas e vindas a São Lourenço, que minha mãe conheceu meu pai, um jovem mancebo da família Junqueira. E numa escapadela, lá estava eu, crescendo no ventre da minha mãe, uma linda jovem de 19 anos. Aí o bicho pegou. A família do meu pai, tradicionalíssima e muito católica, fez questão do casamento. Minha mãe não teve alternativa e… casou, claro. Um ano e oito meses depois, numa terça-feira de carnaval, nasceu minha doce, meiga, linda e amadíssima irmã, no apartamento 202 do prédio da Rua Souza Lima. Minha mãe estava na praia porque o parto estava previsto para inicio de abril E o casamento dos meus pais terminou cerca de seis meses depois. Minha mãe casou-se novamente — e está casada até hoje — com um ex-namorado que morava no mesmo prédio e era amigo dos meus tios. Já meu pai, uma pessoa complicada, casou-se também novamente, teve mais duas filhas e tornou a se separar. Nunca tive com ele uma ligação afetiva e convivi muito pouco apesar de ter morado com ele e a mulher por dois anos. Meus laços afetivos eram com meus avós, principalmente com meu avô, que representava muito bem a figura paterna. O carinho e o amor que existia entre nós — eu, minha irmã e meu avô — não deixaram margem para nenhuma frustração ou carência de afeto paternal. Vovô Dirceu foi um senhor pai! Meu avô querido morreu em 1975 em consequência de dois infartos. Acredito que as estripulias do meu pai — alcoólatra (me recuso a usar o termo alcoólico, porque considero uma tradução mal feita do inglês alcoholic), imaturo, megalômano, mitômano, entre outras patologias psiquiátricas –, criou tantas situações difíceis e complicadas, que acabaram estourando sobre os ombros do meu avô, que não aguentou a pressão. Resumindo, tive até aqui, uma vida comum, com altos e baixos, sucessos e fracassos, idas e vindas, como a maioria dos mortais. Tive uma certa dificuldade em escolher o que eu queria fazer profissionalmente. Aos 17 anos resolvi que ia fazer medicina. Fiz o vestibular da falecida Cesgranrio e passei mara medicina sem sequer ter concluído o que na época chama-se de segundo grau. Porém, para conseguir cursar a faculdade teria que entrar com mandado de segurança e minha mãe, apesar dos meus apelos, se recusou a fazer qualquer coisa nesse sentido. Respondeu simplesmente o seguinte: “Se você passou agora, vai passar ano que vem”. Engoli e acatei. Só que no ano seguinte eu não queria mais estudar medicina, eu não queria mais estudar. Queria trabalhar e ter meu próprio dinheiro. Foi o que fiz. Comecei a trabalhar e a ganhar um dinheirinho. Enquanto isso, minha irmã, também resolveu largar os estudos e foi trabalhar na Editora Abril ganhando um salário astronômico para os padrões da época. (Esqueci de dizer que toda a família, minha mãe, meu padrasto e minha irmã eram jornalistas e/ou trabalhavam em empresas de comunicação.) Diante disso, preciso confessar, me bateu uma certa depressão. Não sabia mais o que eu queria ser quando crescesse. Até que um belo dia, um grande amigo que estudava Design Gráfico e Desenho Industrial na PUC, lendo meus textos, sugeriu que eu fizesse Comunicação. Aceitei na hora e fui estudar Comunicação na Faculdade da Cidade. Em 1990 estava formada em jornalismo. Mas meu primeiro emprego foi numa agência de publicidade. Fiquei por lá até ter certeza que aquela não era aminha praia. Seis meses bastaram para que eu chegasse a essa conclusão. Foi nesse momento que me enchi de coragem e fui até à redação de O Globo, cujo chefe de reportagem era amigo da minha mãe e pedi a ele uma chance, caso houvesse vaga. Comecei no dia seguinte, como repórter free-lancer do finado Globo Barra. Adorei o novo trabalho e em pouco tempo eu estava trabalhando para outras editorias, como Informática e Jornal da Família. Estava feliz da vida, apesar do salário não ser lá essas coisas e a contratação ainda não ter saído. Depois de um ano e pouco, avisei ao chefe de reportagem que não ia ficar porque eu precisava que assinassem minha carteira. Me afastei por uns seis meses e fui convidada a voltar para trabalhar com o Zózimo. Mal pude acreditar. Fui à entrevista com o Zózimo, fiz uma espécie de test drive durante um mês e ele me aprovou. No entanto, a pessoa que assinava a coluna com ele, não gostou nadinha. O clima foi ficando pesado, a situação foi ficando insustentável por causa do ciúme e das fofocas e eu me demeti. E foi aí que minha vida deu uma guinada. Me separei, fiquei sem trabalho, sem o meu amor e sem saber que rumo tomar. Me mudei para Itaipava, distrito da cidade serrana de Petrópolis e resolvi recomeçar minha vida aqui. Segui no jornalismo até 2000. No ano seguinte, influenciada pela médica veterinária que cuidava dos meus bichinhos, resolvi fazer outra faculdade: medicina veterinária. E hoje, formada há 11 anos, estou tentando implementar um projeto bastante audacioso, em parceria com alguns colegas. No entanto, para que seja um empreendimento bem sucedido, vamos ter que aguardar os rumos da economia e da política nacionais. No momento, os projetos estão em fase de maturação e se tudo der certo — e vai dar! — a partir de 2017, poderemos começar a pensar em por em prática os planos que a atual conjutura econômica e política nos obrigaram a adiar. E tudo isso começou porque minha doce irmã teve um câncer: linfoma não-rodgikin folicular, grau 2 e eu aprendi algumas lições: - a força do paciente vem de dentro; - a rotina do paciente e dos familiares é alterada de forma abrupta; - ouvir os conselhos médicos é fundamental, assim como não ter medo de perguntar nada, por mais idiota que isso possa parecer; - descobrir que a simples menção da palavra câncer provoca reações diversas nas pessoas; - jamais supervalorizar o câncer; - evitar dramas, estados depressivos e conhecer a fundo a doença; - não é uma sentença de morte; - cada caso é um caso; - os amigos de verdade se sobressaem e o resto, não tem importância porque não são amigos, são conhecidos; - 50 porcento da cura depende do paciente, os outros 50 porcento do médico, das drogas e do carinho e força dos mais próximos E para finalizar, essa experiência com o câncer da minha irmã mudou minha forma de enxergar a vida, mudou meus valores e minhas prioridades e a principal lição é que a força e a coragem dela me inspiraram, me serviram de incentivo para levar adiante meu projeto na veterinária. Precisei tirar força do âmago para lidar com essa nova realidade e Deus sabe o quanto foi difícil, mas valeu cada segundo, porque ela me fez ver que a força, a vontade, a fé, a alegria de viver e, sobretudo, a maneira de encarar a vida e o mundo ao redor, fazem a grande diferença entre vida e morte, entre sucesso e fracasso, entre ser e ter. Ela optou pela vida e eu também ", "name": "2303"}