{"sentences": [{"6d6d": "What Do You Say To Someone Who Has Cancer?"}, {"61b8": "by Tom Chick"}, {"6abd": "Some subjects aren’t as hard to talk about as people think."}, {"a2cc": "Nora leans in and whispers, “He’s the one with cancer.”"}, {"46b0": "We’re at a party in someone’s backyard in a really nice part of the Valley."}, {"ce99": "“Which one?”"}, {"2158": "“Him. There.”"}, {"14dc": "The guy Nora nods toward can’t be much older than thirty. He’s standing by the pool, holding a drink, laughing with a group of people."}, {"045b": "He has cancer? Shouldn’t he be in a bed? Shouldn’t his hair have fallen out from chemotherapy? Should his skin be that tan? I didn’t think that’s how someone with cancer would look. Happy. Even healthy. An easy fit in a cluster of shining beautiful people milling about on someone’s expensive real estate."}, {"dd13": "At this point, I’m pretty young myself, and my only real reference point for cancer is what I’ve seen in movies. And being very confused as a child that one time I saw my grandmother without her wig. She had cancer. Brain cancer. She was what people with cancer look like. Frail, wan, aggrieved, quietly suffering, tragic. Movies corroborated this."}, {"7544": "Do you offer condolences to someone with cancer? Or is that just when someone’s died?"}, {"1aa2": "Nora had told me about this guy on the drive over. That he had been diagnosed with testicular cancer. That it had spread to his liver. When she introduces me, I shake his hand. His grip isn’t weak. It’s the normal handshake of someone who doesn’t have cancer."}, {"2b7e": "I try to fall into whatever conversation is happening. Something about someone’s audition. His boyfriend is an actor. They’re laughing. He’s happy. He has testicular cancer and liver cancer and he’s standing here beside the pool on a Saturday afternoon, holding a beer and hanging out and we’re all talking."}, {"2860": "I don’t know what to say. So I don’t say anything. Instead, I relate my own story about an audition. I eventually drift away and talk to people who don’t have cancer."}, {"9836": "When Nora comes to get me because we have to leave — her cat is diabetic and needs a shot every night at 7pm — I make a point to find the guy who has testicular cancer that has spread to his liver. I don’t really know why. I just do."}, {"61c8": "“Nice to meet you, ” I say. Should I say something to let him know I know? Should I take him aside? Would it be crass to say “good luck”? Do you offer condolences to people with cancer, or is that just when someone has died? Or is he happy because he’s not thinking about it and I’ll just bring him down by mentioning it and reminding him?"}, {"9a69": "I don’t know the answers to any of these things. So I just leave it at “nice to meet you.” Nora and I go to give the cat her insulin and I don’t think about it for ten years."}, {"b6ef": "Ten years later, I will be at another party. My friend Elise has gotten married and moved into her husband’s house, so it’s sort of a housewarming party."}, {"fe25": "Except now I’m the guy at the party with cancer."}, {"cbc8": "Throat cancer. Hypopharyngeal, to be precise. When an oncologist was going over the biopsy results with me, she kept using that word — hypopharyngeal — and talking about my larynx and epiglottis and lymph nodes and thyroid gland."}, {"6c54": "“You mean throat cancer?” I finally asked."}, {"8c94": "She seemed taken aback."}, {"d18b": "“Well, I don’t really think of it that way, but I guess you could say that.”"}, {"b6e8": "That’s the only cancer I figured you could get in your throat, but I now know that’s not even a thing. Calling it “throat cancer” is like calling lung cancer “chest cancer”."}, {"1abf": "Calling it “throat cancer” is like calling lung cancer “chest cancer”."}, {"46c5": "Either way, because of my throat cancer, I had about a dozen reasons not to come here, the least of which was that I wouldn’t know a lot of the people."}, {"da7a": "It’s still difficult for me to speak. I have to catch my breath more frequently, so I talk at an unfamiliar pace. It’s not my natural cadence. It’s as if someone else was talking. Eating and drinking is still difficult. Better than it has been. As my radiation treatment progressed, searing my throat from the inside, I got to the point where I couldn’t swallow. The pain was too great in my esophagus. My throat stopped working. The muscles in my neck atrophied. For months, nothing but air moved through it. Not even water. After a few sessions taking fluids through an IV, a tube was surgically implanted in my abdomen, going directly into my stomach. Instead of drinking, I let water trickle through the tube. Instead of eating, I let liquid nutrients trickle through the tube. I’ve healed enough to eat and drink, but with some difficulty. I cough a lot. It’s unpleasant. Thirst doesn’t mean what it used to mean, because drinking comes with a certain reluctance. I have to eat very slowly and everything I swallow has to be washed down with water."}, {"5c70": "The tube in my abdomen will eventually be removed, but for many months, it will be a constant reminder coiled up beneath my shirt. I’ve lost a lot of weight, so even with what used to be a tight T-shirt, even with the tube’s bulky valve, it doesn’t show. It will take me a long time to regain the lost weight. Years later, I’m still down thirty pounds from my original weight. None of my pants fit anymore. When I’m lying down to sleep, my legs don’t fall against each other the way they used to. Like so much of the rest of my body, they don’t feel like my legs anymore."}, {"1099": "But after these many months of letting reasons stop me from doing things, I have to simply start doing them anyway. Talking, eating, drinking, going to my friend Elise’s housewarming party. I’m mindful not to sip casually from my drink when I’m talking to people. Just hold it. I have always been an excited talker, but I force myself to talk slower, to say a little less, to take a bit more time to say it. Everyone else is eating forkfuls of Elise’s lasagna from paper plates while they stand around. They go in for seconds. They have salad. I sit on a couch and focus on the small square of lasagna on my paper plate, taking sips of water to wash it down, discreetly coughing into a napkin. But I’m here and I’m managing and I’m very glad to be here. It’s one of the most normal things I’ve done in months."}, {"0ed1": "A handful of new people arrive. Elise is doing the rounds of introductions in front of about ten of us in the living room. “Tom, this is Paul,” she says. “Tom was just treated for throat cancer at the hospital where you work,” she tells him. In front of all these people. As casual as could be. In the same tone of voice she would use to tell us we go to the same gym."}, {"eddd": "Now everyone knows I’m the guy with cancer. But it doesn’t matter. The introductions have moved on."}, {"ebc3": "“Paul, this is Donna. Donna, Paul. Donna works with me. Have you met Chris?”"}, {"1d27": "Paul goes into the kitchen to put down a bottle of wine he’d brought. We’ll later talk very briefly about the hospital, where I was bolted down daily for eight weeks with a hard mesh over my face to hold me immobile for the radiation treatment; where I sat for hours of chemotherapy, not because it took that long to drip the chemicals into my veins, but because it took that long to drip fluids into my veins to wash the toxin out of my kidneys; where I was given hearing tests to assess the nerve damage from the cisplatin; where a dietician worked with me for as long as I could still swallow before handing me over to the GI surgeon who implanted a PEG tube in my abdomen; where I stood in front of an x-ray machine and ate barium-infused food to see where it gets stuck; where I’ve been closed up in a frighteningly loud MRI machine; where a pharmacy has filled my prescription for anti-nausea medication, for painkillers, for hormones to make up for what the damaged thyroid gland in my neck is no longer doing."}, {"05a9": "Although I am grateful to be here and to pretend to be a normal person, I felt like a Frankenstein’s monster who has lumbered into a wedding party. I felt like I was tricking everyone by seeming normal. I felt like I was hiding something. Maybe some of them knew, maybe someone whispered to her date, “He’s the one with cancer.”"}, {"9319": "I felt like a Frankenstein’s monster who has lumbered into a wedding party."}, {"ef5f": "And now that Elise has mentioned it as casual as could be, I don’t have to feel that way. My secret isn’t secret. No one has to whisper. I am relieved. I am now fully who I am."}, {"125a": "Paul works in the administrative part of the hospital. “They do good work,” we will agree. That will be the extent of our conversation about the hospital. Paul will move along to talk to the people he came to see. I will sit with a couple of my friends and focus on carefully finishing my plate of lasagna just to get it out of the way."}, {"fde0": "Someone who wasn’t in the living room when Paul arrived comes up to me later while I’m in the kitchen."}, {"46a7": "“So you’re a cancer survivor?” she says. She tells me about her father, who died of brain cancer when she was a little girl. I remember my own grandmother’s brain cancer. I remember her without her wig. I remember her frail, wan, aggrieved, quietly suffering, tragic. I remember how suddenly she died. I remember she never told me she had brain cancer. It was only something my mother ever told me."}, {"00d6": "A few people join us in the kitchen. I’m trying not to hold forth about how much it sucks to have cancer, but they’re asking me sincere questions. It means a lot to be able to answer these questions, to have these conversations. They have a few common elements. The first is people wanting to know if I’m better. Not cured. Better. People don’t say “cured” when they talk about cancer. We’re conditioned to think a cure for cancer is an elusive medical discovery, pending and perhaps inevitable, but as indeterminate as landing on Mars. At this point, I’m still waiting for my post-treatment scans, but under the weight of my doctor’s caution that a recurrence is “not uncommon”."}, {"ce7d": "People don’t say “cured” when they talk about cancer."}, {"6635": "The second element is people wanting to know how I found out. Their subtext is fear, doubt, the nagging feeling of inevitability. People ask that when they’ve had a tiny lump under their skin or a persistent cough or something that feels wrong in their stomach. When you’re younger, your body fixes things in due time. When you get older, that doesn’t always happen. I’m not a doctor, so I’m not the person to talk about specifics. But if you ever think something is wrong, if something doesn’t go away, you should see a doctor. It’s that simple. In my case, it was a lump in my neck that didn’t go away, and the subsequent swelling, and a feeling of discomfort in my throat. The moment a doctor saw me, I could tell from his tone of voice. He made a half-hearted attempt to list things it could be other than cancer. But I could tell he knew. The biopsy was almost a formality."}, {"9bf4": "The third part of these conversations, and the part that means the most to me, is people telling me about their own experiences. Their friends, their family, their grandparents, their parents. I’m constantly surprised at how many people’s lives have been affected by cancer, their own or someone else’s. I am constantly surprised at how far it reaches, at how connected we all are, at the sheer commonness of this condition. I am constantly surprised at how many of us understand each other. At how normal I am. When I was diagnosed, I only thought of cancer as a disease. I didn’t realize it was also a community."}, {"259e": "Then the conversation moves naturally to something else and I feel lighter. I feel an immense sense of gratitude. Toward Elise for mentioning it when Paul arrived. Toward this woman for describing me as a cancer survivor, not because it’s how I think of myself, but because of the intent behind her comment. Toward the people who have moseyed into the kitchen and stuck around to join the conversation, which has now moved on to the Star Wars movie. For the opportunity to be the guy with cancer who is standing in the kitchen, laughing, holding a drink, happy."}, {"ca37": "If someone showed up with a platter of fruit on his head, you wouldn’t ignore it. Cancer is like that."}, {"f331": "It didn’t feel odd to talk about it. On the contrary, it felt odd not to talk about it."}, {"04bf": "If someone showed up with a platter of fruit on his head, you wouldn’t ignore it. Cancer is like that. It is as absurd and inconvenient as a platter of fruit on top of your head. When you see it, you cannot ignore it. And if you are ignoring it, you’re doing it through sheer force of will. “Is that platter heavy? How long has it been there? Do you sleep with it?” Those are natural questions. If you instead say, “How about the weather?” to someone with a platter of fruit on his head, he will be embarrassed. He will realize you don’t want to talk about it. And he won’t want to talk about it, although it’s a significant part of his experience. Because it is heavy. However long it’s been there almost doesn’t matter because it is possibly the end of time. And sleeping with it isn’t the problem. The problem is waking up and remembering it all over again every day."}, {"1c07": "What people may not realize is that we’re used to talking about it. People with cancer talk about it a lot. With their families. With their doctors. With their friends. With their colleagues. Perhaps in support groups. Talking about it is nothing new to us. If someone has a cast on his arm, you wouldn’t hesitate to ask him about it. “What happened?” you would ask, nodding at the cast. He’s used to telling people. It makes him feel less self-conscious."}, {"94b6": "At the time I didn’t know why I made a point to find that guy to say good-bye before Nora and I left to give her cat an insulin shot. Now I know. Now I know what I should have said to him. Now I know what he would have wanted me to say."}, {"3796": "All illustrations by Shannon Wheeler."}, {"de4f": "Like this story? Read others about amazing individuals living with conditions at Folks!"}], "child": "2306_1", "parent": "", "title": "What Do You Say To Someone Who Has Cancer?", "content": "What Do You Say To Someone Who Has Cancer? by Tom Chick Some subjects aren’t as hard to talk about as people think. Nora leans in and whispers, “He’s the one with cancer.” We’re at a party in someone’s backyard in a really nice part of the Valley. “Which one?” “Him. There.” The guy Nora nods toward can’t be much older than thirty. He’s standing by the pool, holding a drink, laughing with a group of people. He has cancer? Shouldn’t he be in a bed? Shouldn’t his hair have fallen out from chemotherapy? Should his skin be that tan? I didn’t think that’s how someone with cancer would look. Happy. Even healthy. An easy fit in a cluster of shining beautiful people milling about on someone’s expensive real estate. At this point, I’m pretty young myself, and my only real reference point for cancer is what I’ve seen in movies. And being very confused as a child that one time I saw my grandmother without her wig. She had cancer. Brain cancer. She was what people with cancer look like. Frail, wan, aggrieved, quietly suffering, tragic. Movies corroborated this. Do you offer condolences to someone with cancer? Or is that just when someone’s died? Nora had told me about this guy on the drive over. That he had been diagnosed with testicular cancer. That it had spread to his liver. When she introduces me, I shake his hand. His grip isn’t weak. It’s the normal handshake of someone who doesn’t have cancer. I try to fall into whatever conversation is happening. Something about someone’s audition. His boyfriend is an actor. They’re laughing. He’s happy. He has testicular cancer and liver cancer and he’s standing here beside the pool on a Saturday afternoon, holding a beer and hanging out and we’re all talking. I don’t know what to say. So I don’t say anything. Instead, I relate my own story about an audition. I eventually drift away and talk to people who don’t have cancer. When Nora comes to get me because we have to leave — her cat is diabetic and needs a shot every night at 7pm — I make a point to find the guy who has testicular cancer that has spread to his liver. I don’t really know why. I just do. “Nice to meet you, ” I say. Should I say something to let him know I know? Should I take him aside? Would it be crass to say “good luck”? Do you offer condolences to people with cancer, or is that just when someone has died? Or is he happy because he’s not thinking about it and I’ll just bring him down by mentioning it and reminding him? I don’t know the answers to any of these things. So I just leave it at “nice to meet you.” Nora and I go to give the cat her insulin and I don’t think about it for ten years. Ten years later, I will be at another party. My friend Elise has gotten married and moved into her husband’s house, so it’s sort of a housewarming party. Except now I’m the guy at the party with cancer. Throat cancer. Hypopharyngeal, to be precise. When an oncologist was going over the biopsy results with me, she kept using that word — hypopharyngeal — and talking about my larynx and epiglottis and lymph nodes and thyroid gland. “You mean throat cancer?” I finally asked. She seemed taken aback. “Well, I don’t really think of it that way, but I guess you could say that.” That’s the only cancer I figured you could get in your throat, but I now know that’s not even a thing. Calling it “throat cancer” is like calling lung cancer “chest cancer”. Calling it “throat cancer” is like calling lung cancer “chest cancer”. Either way, because of my throat cancer, I had about a dozen reasons not to come here, the least of which was that I wouldn’t know a lot of the people. It’s still difficult for me to speak. I have to catch my breath more frequently, so I talk at an unfamiliar pace. It’s not my natural cadence. It’s as if someone else was talking. Eating and drinking is still difficult. Better than it has been. As my radiation treatment progressed, searing my throat from the inside, I got to the point where I couldn’t swallow. The pain was too great in my esophagus. My throat stopped working. The muscles in my neck atrophied. For months, nothing but air moved through it. Not even water. After a few sessions taking fluids through an IV, a tube was surgically implanted in my abdomen, going directly into my stomach. Instead of drinking, I let water trickle through the tube. Instead of eating, I let liquid nutrients trickle through the tube. I’ve healed enough to eat and drink, but with some difficulty. I cough a lot. It’s unpleasant. Thirst doesn’t mean what it used to mean, because drinking comes with a certain reluctance. I have to eat very slowly and everything I swallow has to be washed down with water. The tube in my abdomen will eventually be removed, but for many months, it will be a constant reminder coiled up beneath my shirt. I’ve lost a lot of weight, so even with what used to be a tight T-shirt, even with the tube’s bulky valve, it doesn’t show. It will take me a long time to regain the lost weight. Years later, I’m still down thirty pounds from my original weight. None of my pants fit anymore. When I’m lying down to sleep, my legs don’t fall against each other the way they used to. Like so much of the rest of my body, they don’t feel like my legs anymore. But after these many months of letting reasons stop me from doing things, I have to simply start doing them anyway. Talking, eating, drinking, going to my friend Elise’s housewarming party. I’m mindful not to sip casually from my drink when I’m talking to people. Just hold it. I have always been an excited talker, but I force myself to talk slower, to say a little less, to take a bit more time to say it. Everyone else is eating forkfuls of Elise’s lasagna from paper plates while they stand around. They go in for seconds. They have salad. I sit on a couch and focus on the small square of lasagna on my paper plate, taking sips of water to wash it down, discreetly coughing into a napkin. But I’m here and I’m managing and I’m very glad to be here. It’s one of the most normal things I’ve done in months. A handful of new people arrive. Elise is doing the rounds of introductions in front of about ten of us in the living room. “Tom, this is Paul,” she says. “Tom was just treated for throat cancer at the hospital where you work,” she tells him. In front of all these people. As casual as could be. In the same tone of voice she would use to tell us we go to the same gym. Now everyone knows I’m the guy with cancer. But it doesn’t matter. The introductions have moved on. “Paul, this is Donna. Donna, Paul. Donna works with me. Have you met Chris?” Paul goes into the kitchen to put down a bottle of wine he’d brought. We’ll later talk very briefly about the hospital, where I was bolted down daily for eight weeks with a hard mesh over my face to hold me immobile for the radiation treatment; where I sat for hours of chemotherapy, not because it took that long to drip the chemicals into my veins, but because it took that long to drip fluids into my veins to wash the toxin out of my kidneys; where I was given hearing tests to assess the nerve damage from the cisplatin; where a dietician worked with me for as long as I could still swallow before handing me over to the GI surgeon who implanted a PEG tube in my abdomen; where I stood in front of an x-ray machine and ate barium-infused food to see where it gets stuck; where I’ve been closed up in a frighteningly loud MRI machine; where a pharmacy has filled my prescription for anti-nausea medication, for painkillers, for hormones to make up for what the damaged thyroid gland in my neck is no longer doing. Although I am grateful to be here and to pretend to be a normal person, I felt like a Frankenstein’s monster who has lumbered into a wedding party. I felt like I was tricking everyone by seeming normal. I felt like I was hiding something. Maybe some of them knew, maybe someone whispered to her date, “He’s the one with cancer.” I felt like a Frankenstein’s monster who has lumbered into a wedding party. And now that Elise has mentioned it as casual as could be, I don’t have to feel that way. My secret isn’t secret. No one has to whisper. I am relieved. I am now fully who I am. Paul works in the administrative part of the hospital. “They do good work,” we will agree. That will be the extent of our conversation about the hospital. Paul will move along to talk to the people he came to see. I will sit with a couple of my friends and focus on carefully finishing my plate of lasagna just to get it out of the way. Someone who wasn’t in the living room when Paul arrived comes up to me later while I’m in the kitchen. “So you’re a cancer survivor?” she says. She tells me about her father, who died of brain cancer when she was a little girl. I remember my own grandmother’s brain cancer. I remember her without her wig. I remember her frail, wan, aggrieved, quietly suffering, tragic. I remember how suddenly she died. I remember she never told me she had brain cancer. It was only something my mother ever told me. A few people join us in the kitchen. I’m trying not to hold forth about how much it sucks to have cancer, but they’re asking me sincere questions. It means a lot to be able to answer these questions, to have these conversations. They have a few common elements. The first is people wanting to know if I’m better. Not cured. Better. People don’t say “cured” when they talk about cancer. We’re conditioned to think a cure for cancer is an elusive medical discovery, pending and perhaps inevitable, but as indeterminate as landing on Mars. At this point, I’m still waiting for my post-treatment scans, but under the weight of my doctor’s caution that a recurrence is “not uncommon”. People don’t say “cured” when they talk about cancer. The second element is people wanting to know how I found out. Their subtext is fear, doubt, the nagging feeling of inevitability. People ask that when they’ve had a tiny lump under their skin or a persistent cough or something that feels wrong in their stomach. When you’re younger, your body fixes things in due time. When you get older, that doesn’t always happen. I’m not a doctor, so I’m not the person to talk about specifics. But if you ever think something is wrong, if something doesn’t go away, you should see a doctor. It’s that simple. In my case, it was a lump in my neck that didn’t go away, and the subsequent swelling, and a feeling of discomfort in my throat. The moment a doctor saw me, I could tell from his tone of voice. He made a half-hearted attempt to list things it could be other than cancer. But I could tell he knew. The biopsy was almost a formality. The third part of these conversations, and the part that means the most to me, is people telling me about their own experiences. Their friends, their family, their grandparents, their parents. I’m constantly surprised at how many people’s lives have been affected by cancer, their own or someone else’s. I am constantly surprised at how far it reaches, at how connected we all are, at the sheer commonness of this condition. I am constantly surprised at how many of us understand each other. At how normal I am. When I was diagnosed, I only thought of cancer as a disease. I didn’t realize it was also a community. Then the conversation moves naturally to something else and I feel lighter. I feel an immense sense of gratitude. Toward Elise for mentioning it when Paul arrived. Toward this woman for describing me as a cancer survivor, not because it’s how I think of myself, but because of the intent behind her comment. Toward the people who have moseyed into the kitchen and stuck around to join the conversation, which has now moved on to the Star Wars movie. For the opportunity to be the guy with cancer who is standing in the kitchen, laughing, holding a drink, happy. If someone showed up with a platter of fruit on his head, you wouldn’t ignore it. Cancer is like that. It didn’t feel odd to talk about it. On the contrary, it felt odd not to talk about it. If someone showed up with a platter of fruit on his head, you wouldn’t ignore it. Cancer is like that. It is as absurd and inconvenient as a platter of fruit on top of your head. When you see it, you cannot ignore it. And if you are ignoring it, you’re doing it through sheer force of will. “Is that platter heavy? How long has it been there? Do you sleep with it?” Those are natural questions. If you instead say, “How about the weather?” to someone with a platter of fruit on his head, he will be embarrassed. He will realize you don’t want to talk about it. And he won’t want to talk about it, although it’s a significant part of his experience. Because it is heavy. However long it’s been there almost doesn’t matter because it is possibly the end of time. And sleeping with it isn’t the problem. The problem is waking up and remembering it all over again every day. What people may not realize is that we’re used to talking about it. People with cancer talk about it a lot. With their families. With their doctors. With their friends. With their colleagues. Perhaps in support groups. Talking about it is nothing new to us. If someone has a cast on his arm, you wouldn’t hesitate to ask him about it. “What happened?” you would ask, nodding at the cast. He’s used to telling people. It makes him feel less self-conscious. At the time I didn’t know why I made a point to find that guy to say good-bye before Nora and I left to give her cat an insulin shot. Now I know. Now I know what I should have said to him. Now I know what he would have wanted me to say. All illustrations by Shannon Wheeler. Like this story? Read others about amazing individuals living with conditions at Folks! ", "name": "2306"}