{"sentences": [{"1b14": "One Thing You Can Learn In 2 Minutes That Will Be Useful For The Rest Of Your Life"}, {"490b": "In 430 BC, the second year of the Peloponnesian War, Greek general Pericles led a fleet of over 100 ships towards the enemy island."}, {"a431": "Charge!"}, {"c65b": "As they were charging ahead at full speed, suddenly, a solar eclipse cast the entire fleet into darkness."}, {"9a01": "They weren’t as well-explained back then, you know?"}, {"1012": "Unaware of the scientific nature of this unexpected and shocking event, panic befell the soldiers and sailors. But not Pericles."}, {"64c9": "Pericles"}, {"e94a": "He took off his black cloak, walked to the navigator of his ship, held it around his head and asked the man: “Are you afraid of what you see?”"}, {"48a8": "Looking at nothing but a piece of black cloth…"}, {"7e50": "Dark is dark is dark."}, {"99a3": "…the man replied: “No, of course not!”"}, {"b009": "Pericles countered: “So what does it matter, if the cause of the darkness is a different one?”"}, {"a050": "When we don’t understand something, our minds conjure the wildest, most sinister and dismal explanations. The result is fear and fear leads to bad decisions."}, {"5c39": "But when we question our own perspective, we find we can often explain the fear away."}, {"a01f": "Perspective is everything."}, {"12ff": "The beauty in that is we’re free to change our perspective at any second."}, {"1880": "We can choose to try different angles of looking at any situation, to break it down into its parts, to look past it, around it or through it, until we find the perspective we need to move forward."}, {"198e": "“Man does not simply exist but always decides what his existence will be, what he will become the next moment. By the same token, every human being has the freedom to change at any instant.”"}, {"c840": "~Viktor Frankl"}, {"144f": "If you pause for a moment to remember this story, it’ll be useful for the rest of your life."}, {"8dd2": "I myself first learned it from Ryan Holiday’s book, The Obstacle Is The Way, for which I wrote a summary here."}, {"c87e": "This article started as an answer on quora.com."}], "child": "2309_1\t2309_2\t2309_3\t2309_4\t2309_5\t2309_6\t2309_7\t2309_8\t2309_9\t2309_10\t2309_112309_1\t2309_2\t2309_3\t2309_4\t2309_5\t2309_6\t2309_7\t2309_8\t2309_9\t2309_10\t2309_11", "parent": "", "title": "One Thing You Can Learn In 2 Minutes That Will Be Useful For The Rest Of Your Life", "content": "One Thing You Can Learn In 2 Minutes That Will Be Useful For The Rest Of Your Life In 430 BC, the second year of the Peloponnesian War, Greek general Pericles led a fleet of over 100 ships towards the enemy island. Charge! As they were charging ahead at full speed, suddenly, a solar eclipse cast the entire fleet into darkness. They weren’t as well-explained back then, you know? Unaware of the scientific nature of this unexpected and shocking event, panic befell the soldiers and sailors. But not Pericles. Pericles He took off his black cloak, walked to the navigator of his ship, held it around his head and asked the man: “Are you afraid of what you see?” Looking at nothing but a piece of black cloth… Dark is dark is dark. …the man replied: “No, of course not!” Pericles countered: “So what does it matter, if the cause of the darkness is a different one?” When we don’t understand something, our minds conjure the wildest, most sinister and dismal explanations. The result is fear and fear leads to bad decisions. But when we question our own perspective, we find we can often explain the fear away. Perspective is everything. The beauty in that is we’re free to change our perspective at any second. We can choose to try different angles of looking at any situation, to break it down into its parts, to look past it, around it or through it, until we find the perspective we need to move forward. “Man does not simply exist but always decides what his existence will be, what he will become the next moment. By the same token, every human being has the freedom to change at any instant.” ~Viktor Frankl If you pause for a moment to remember this story, it’ll be useful for the rest of your life. I myself first learned it from Ryan Holiday’s book, The Obstacle Is The Way, for which I wrote a summary here. This article started as an answer on quora.com. ", "name": "2309"}