{"sentences": [{"1cfa": "Great People Fire Themselves"}, {"e120": "In the years since I left my career in government, I have taken the time to understand why I left my eight year career in public service. A number of people assumed that I got tired of the bureaucracy, lost my love of the work, or wanted to make money in the private sector. But all of that is wrong. And in speaking with others like myself, I found an important trend: really great people fire themselves."}, {"de55": "That’s nice and provocative — but what does it mean?"}, {"67f7": "Most people believe that people either quit or they get fired. But the choice is not binary. In fact, great people often create the circumstances of their own departure."}, {"7b5a": "This is the story of how I did that. There are some important lessons for others like me and context that can help people understand what goes on inside the mind of a challenger."}, {"c490": "Challengers Make The World Go Round"}, {"faf5": "People who move fast, stand strong, and push towards progress lack the capacity to deal with bullshit. I call them challengers. They are invaluable to the success of organizations and are those critical members of the team who do not quite fit. They’re equally as likely to drag the organization over the goal line as they are to move on from them if they cannot make change."}, {"d45b": "Progress is often ugly and hard. It does not come easy. But challengers make it happen. They are committed and thoughtful, grinders and movers, and the kind of forward-thinking people that make good organizations great. Because of this, it is worth your time to work to find them, given them a real role and authority, and work to make them succeed."}, {"598a": "Good managers hire people they can direct and work with to bring about a goal. Great managers hire people who are fantastic at bringing about change on their own. Those are the challengers."}, {"bbb5": "Challengers have the capacity to work on their own without the hand holding of their peers because they have vision and are both motivated and mission-driven. They respond well to signaling and direction but respond poorly to micro-managing and roadblocks. They are wired differently and are driven to succeed often in spite of the rules."}, {"a2d0": "The Mind of a Challenger"}, {"1008": "Challengers often create the circumstances of their own departure. They can become so fed up with the interminable realities of the machina that their lingering discontent crescendos. Organizations, groaning from the weight of their own bureaucracy are no place for the entrepreneurial mindsets of the challenger. Upon realizing that the challenger has reached the limits of what the bureaucracy will allow, those truly talented people, often unknowingly, engineer the circumstances of their own exit."}, {"64e1": "In my case, I was pushing very hard for my government colleagues and partners to wake up and take the threat of mobile and IoT security seriously. This was not something that was in line with their thinking at the time. Mobile and IoT platforms are often small, cheap, and are comparatively underwhelming when stacked up against gigantic telecom networks or large cloud computing environments. As such, I was told over and over again that I was wasting my time focusing on these issues in secure mobility. The orthogonality of that instruction did did not sit well with me."}, {"a160": "I think I just saw the world differently. I became convinced that if I pushed hard enough, I could basically ram my agenda through — and yes, I had an agenda as all challengers do. But the bureaucracy has an agenda too. And it was at odds with mine as a challenger."}, {"ea04": "Challengers are essentially asking the bureaucracy to do something different, to learn, to see the world in a new way, and to experiment. Frankly, bureaucracies are not set up to do that well. Challengers make people uncomfortable and are then often seen as a problem. What naturally shakes out over time is a circumstance in which challengers find their way to leaving the organization because they encounter the irreconcilable end of the road."}, {"da93": "An Object Lesson In Challenger Thinking"}, {"6d55": "I think that at this time, it is important to mention that I was totally on the money. Empirically, mobile and IoT platforms are terribly at risk and are used to compromise much larger systems such as those gigantic telecom network and large cloud computing environments. Knowing that the future of hacking would prove me correct I did not manage to act, I found it outrageous that those who fundamentally disagreed with me could be in charge."}, {"8908": "The reality is that I pushed so hard and worked so fast that I became an anathema to the normal operations of my organization. And like white blood cells to an infection, the bureaucracy did what it does best: protecting itself."}, {"1da3": "Many people called me arrogant, inconvenient, crazy, and challenging. But after years of work, no one once said I was wrong."}, {"170c": "Challengers like me see their reality so clearly that they often do not understand how people can meet them with resistance. They’re actually not arrogant — they just see things differently and often more clearly. That does not mean that they are always right — but it does mean that they believe with the best of intentions. They see people who chose to stop their progress as the enemy of their vision."}, {"29b0": "End Of The Road"}, {"dc2d": "It was around 2:00pm on a sunny day in March 2014 when I got a call from an attorney in the counsel’s office in the office directly superior to me. She had seen the report, which I had been trying to publish for some time focusing on mobile and IoT security risks. It’s purpose was to inform network operators about the risks involved in underestimating cybersecurity vulnerabilities and threats involved with those platforms. And despite the fact that the report was focused on engineering and technical implementations, this particular lawyer took it upon herself to intercede as it did not comport with her baseless perspective."}, {"3ba6": "In her assessment, my risks assessment had identified too many risks. Take a moment and let that marinate."}, {"5c07": "When I pointed out that the purpose of a risk assessment is to identify risks, she responded predictably:"}, {"61a5": "The report could be used by attackers to identify those weaknesses that enable them to attack mobile and IoT platforms."}, {"2f05": "I asked her how that could be when the report did not disclose any specific technical vulnerabilities (e.g., software flaws in a particular Cisco router). Her response:"}, {"4ebb": "If the report does not go that deep then it cannot be of value."}, {"7e90": "And it was at this moment that I realized that she had never read the report."}, {"eb70": "After I pressed her, she admitted that she had not read past the fourth page of the 75-page report. And despite having no evidence, she branded my work was wrong for the Department to publish."}, {"aecb": "The irony is that one of the top risks we identified was that mobile network and IoT platform operators would never know the true risks involved in their operations. The bureaucracy saw fit to make that the case."}, {"2f65": "Within three weeks, I came to the conclusion that I could not make the kind of contribution that I set out to make. I had pushed too much. Even though I knew it was the right thing to do for the country, my work was not the normal safe stuff that everyone else works on. And because so many people had gotten so far by being safe, they saw no reason to try."}, {"d34f": "On a warm day that March, I submitted my letter of resignation."}, {"2998": "What I Learned"}, {"eb58": "It is hard for challengers to be marginalized. I joined government because of my love of country. I believe that a small group of committed citizens can change the world. I am mission-driven and in it to win it. But not everyone is."}, {"8746": "A lot of people work to live. I live to work. I love my field, am constantly trying to get better in my job, and believe that debate and research are the ways to improve. But so many people just want to put in the minimal effort. They’re happier not becoming invested in their work. Not only do they not want to be challenged, they don’t want to work with challengers. It reveals their lack of ability and makes them look bad by comparison."}, {"bff9": "When challengers like me come to terms with the realities of those circumstances, we tend to exit."}, {"e705": "The Secret Of My Departure"}, {"e5fe": "I knew that I was going to get shut down. I had heard that someone in my office in charge of governmental outreach had gone behind my back to the lawyers and asked them to kill the program. Ultimately, he did not disagree with it — he just did not understand it. To correct that, he would have to work too hard to learn and contribute. Ultimately, it would create too much work for him."}, {"967a": "Understanding the opposition, I pushed harder and reaped the results that stemmed from their lack of fortitude and vision. I needed to understand that their opposition would manifest itself. I could have laid low — but I am just not built like that."}, {"d1c3": "I was sad when I got the call — but not at all surprised."}, {"dafa": "I Will Always Be A Challenger"}, {"2bf9": "I am not wired to change the way I think. I have firm beliefs and value hard work, teams, and challenging the status quo as a method for making progress. And while I have figured out how to be a challenger within an organization and with a diverse group of people, I am still one of those who pushes."}, {"5239": "When I was recently asked by someone if I ever expect to change, I responded by saying the following:"}, {"27df": "“No. I sleep better at night having left it all out on the field — and you will too”"}], "child": "2315_1\t2315_2\t2315_3\t2315_4\t2315_5", "parent": "", "title": "Great People Fire Themselves", "content": "Great People Fire Themselves In the years since I left my career in government, I have taken the time to understand why I left my eight year career in public service. A number of people assumed that I got tired of the bureaucracy, lost my love of the work, or wanted to make money in the private sector. But all of that is wrong. And in speaking with others like myself, I found an important trend: really great people fire themselves. That’s nice and provocative — but what does it mean? Most people believe that people either quit or they get fired. But the choice is not binary. In fact, great people often create the circumstances of their own departure. This is the story of how I did that. There are some important lessons for others like me and context that can help people understand what goes on inside the mind of a challenger. Challengers Make The World Go Round People who move fast, stand strong, and push towards progress lack the capacity to deal with bullshit. I call them challengers. They are invaluable to the success of organizations and are those critical members of the team who do not quite fit. They’re equally as likely to drag the organization over the goal line as they are to move on from them if they cannot make change. Progress is often ugly and hard. It does not come easy. But challengers make it happen. They are committed and thoughtful, grinders and movers, and the kind of forward-thinking people that make good organizations great. Because of this, it is worth your time to work to find them, given them a real role and authority, and work to make them succeed. Good managers hire people they can direct and work with to bring about a goal. Great managers hire people who are fantastic at bringing about change on their own. Those are the challengers. Challengers have the capacity to work on their own without the hand holding of their peers because they have vision and are both motivated and mission-driven. They respond well to signaling and direction but respond poorly to micro-managing and roadblocks. They are wired differently and are driven to succeed often in spite of the rules. The Mind of a Challenger Challengers often create the circumstances of their own departure. They can become so fed up with the interminable realities of the machina that their lingering discontent crescendos. Organizations, groaning from the weight of their own bureaucracy are no place for the entrepreneurial mindsets of the challenger. Upon realizing that the challenger has reached the limits of what the bureaucracy will allow, those truly talented people, often unknowingly, engineer the circumstances of their own exit. In my case, I was pushing very hard for my government colleagues and partners to wake up and take the threat of mobile and IoT security seriously. This was not something that was in line with their thinking at the time. Mobile and IoT platforms are often small, cheap, and are comparatively underwhelming when stacked up against gigantic telecom networks or large cloud computing environments. As such, I was told over and over again that I was wasting my time focusing on these issues in secure mobility. The orthogonality of that instruction did did not sit well with me. I think I just saw the world differently. I became convinced that if I pushed hard enough, I could basically ram my agenda through — and yes, I had an agenda as all challengers do. But the bureaucracy has an agenda too. And it was at odds with mine as a challenger. Challengers are essentially asking the bureaucracy to do something different, to learn, to see the world in a new way, and to experiment. Frankly, bureaucracies are not set up to do that well. Challengers make people uncomfortable and are then often seen as a problem. What naturally shakes out over time is a circumstance in which challengers find their way to leaving the organization because they encounter the irreconcilable end of the road. An Object Lesson In Challenger Thinking I think that at this time, it is important to mention that I was totally on the money. Empirically, mobile and IoT platforms are terribly at risk and are used to compromise much larger systems such as those gigantic telecom network and large cloud computing environments. Knowing that the future of hacking would prove me correct I did not manage to act, I found it outrageous that those who fundamentally disagreed with me could be in charge. The reality is that I pushed so hard and worked so fast that I became an anathema to the normal operations of my organization. And like white blood cells to an infection, the bureaucracy did what it does best: protecting itself. Many people called me arrogant, inconvenient, crazy, and challenging. But after years of work, no one once said I was wrong. Challengers like me see their reality so clearly that they often do not understand how people can meet them with resistance. They’re actually not arrogant — they just see things differently and often more clearly. That does not mean that they are always right — but it does mean that they believe with the best of intentions. They see people who chose to stop their progress as the enemy of their vision. End Of The Road It was around 2:00pm on a sunny day in March 2014 when I got a call from an attorney in the counsel’s office in the office directly superior to me. She had seen the report, which I had been trying to publish for some time focusing on mobile and IoT security risks. It’s purpose was to inform network operators about the risks involved in underestimating cybersecurity vulnerabilities and threats involved with those platforms. And despite the fact that the report was focused on engineering and technical implementations, this particular lawyer took it upon herself to intercede as it did not comport with her baseless perspective. In her assessment, my risks assessment had identified too many risks. Take a moment and let that marinate. When I pointed out that the purpose of a risk assessment is to identify risks, she responded predictably: The report could be used by attackers to identify those weaknesses that enable them to attack mobile and IoT platforms. I asked her how that could be when the report did not disclose any specific technical vulnerabilities (e.g., software flaws in a particular Cisco router). Her response: If the report does not go that deep then it cannot be of value. And it was at this moment that I realized that she had never read the report. After I pressed her, she admitted that she had not read past the fourth page of the 75-page report. And despite having no evidence, she branded my work was wrong for the Department to publish. The irony is that one of the top risks we identified was that mobile network and IoT platform operators would never know the true risks involved in their operations. The bureaucracy saw fit to make that the case. Within three weeks, I came to the conclusion that I could not make the kind of contribution that I set out to make. I had pushed too much. Even though I knew it was the right thing to do for the country, my work was not the normal safe stuff that everyone else works on. And because so many people had gotten so far by being safe, they saw no reason to try. On a warm day that March, I submitted my letter of resignation. What I Learned It is hard for challengers to be marginalized. I joined government because of my love of country. I believe that a small group of committed citizens can change the world. I am mission-driven and in it to win it. But not everyone is. A lot of people work to live. I live to work. I love my field, am constantly trying to get better in my job, and believe that debate and research are the ways to improve. But so many people just want to put in the minimal effort. They’re happier not becoming invested in their work. Not only do they not want to be challenged, they don’t want to work with challengers. It reveals their lack of ability and makes them look bad by comparison. When challengers like me come to terms with the realities of those circumstances, we tend to exit. The Secret Of My Departure I knew that I was going to get shut down. I had heard that someone in my office in charge of governmental outreach had gone behind my back to the lawyers and asked them to kill the program. Ultimately, he did not disagree with it — he just did not understand it. To correct that, he would have to work too hard to learn and contribute. Ultimately, it would create too much work for him. Understanding the opposition, I pushed harder and reaped the results that stemmed from their lack of fortitude and vision. I needed to understand that their opposition would manifest itself. I could have laid low — but I am just not built like that. I was sad when I got the call — but not at all surprised. I Will Always Be A Challenger I am not wired to change the way I think. I have firm beliefs and value hard work, teams, and challenging the status quo as a method for making progress. And while I have figured out how to be a challenger within an organization and with a diverse group of people, I am still one of those who pushes. When I was recently asked by someone if I ever expect to change, I responded by saying the following: “No. I sleep better at night having left it all out on the field — and you will too” ", "name": "2315"}