{"sentences": [{"4525": "The Beauty of Giving Up"}, {"ffa7": "The benefit of abandoning your business structure"}, {"1c2e": "THE PROBLEM"}, {"598d": "In the early winter of 2015, I found myself in the midst of what amounted to a mutiny within my business. The rumor mill was abuzz that my entire staff was abandoning ship. Four people had already quit, and over the next several weeks, three more would follow suit. This was in a business that only employed around 10 people at any given time."}, {"49fc": "I had lost control of the situation. Every attempt at creating a structured work environment with rules, deadlines, and quotas was met with opposition. Instead of being viewed as a boss, I was viewed as a peer. The tension in the environment was palpable, and we all harbored resentments that were constantly leaking into every day work life. I had little faith and trust in my employees, and my formerly high expectations had been crushed."}, {"4750": "It was after a whirlwind of circumstances and crises that I realized it was time to give up. Not on my business, heavens no. If I didn’t fight it out until the bitter end I faced certain financial ruin. The least I could do was keep pushing until there were no other options. A re-evaluation of what I believed to be my role as a leader had become necessary. What I was doing obviously didn’t work, so I had to abandon it and correct course or risk losing everything."}, {"e140": "THE SOLUTION"}, {"860e": "Let me take a step back and explain what I do. I own a very busy, high performing tattoo studio. I work with artists. Do you work with creatives? Getting them to follow instruction is like herding tigers. I had essentially tried to be an alpha pack leader to 9 other alphas. Artists are aloof, often transient, and value freedom over just about everything. I was holding a tight leash in an attempt to optimize performance, and instead it created a stifling, tense environment."}, {"d057": "I stopped trying to give rules. Instead, I began to give guidelines and make suggestions based on my own experience. While in the past I barked out the law of the land, I instead decided to stop and listen to their needs. Caught up in my own expectations, I failed to see the growing problems that eventually caused a rift that couldn’t be bridged."}, {"a6ec": "Employee career goals are often completely different from that of a business owner. As the boss, you can’t fully expect your staff to understand and care about the issues regarding the day to day workings of your business; in fact, many business owners put double the man hours into their workweek than their employees."}, {"67e0": "However, you should keep in mind that as you perform actions to purposely propel you toward your goals, your employees are also pursuing their own. Acknowledging that you understand and respect their quest to accomplish their own set of goals is a good way to cultivate a good relationship with your staff. In the end, all anyone wants is to feel as if they are a happy and fulfilled individual."}, {"b847": "The quotas I had in the past became a suggestive guideline. All projections had been based on my own level of work, instead of each individual employee. I understood now that I couldn’t force their hand to work beyond their capacity. Each employee hits a level of productivity that is based on their speed, skill level, and attention to detail. Short term profits mean nothing if there is no retention of employees, and employees mean nothing if they’re not doing quality work and making their clients happy."}, {"3f64": "My entire focus shifted to the culture and environment of the workplace. Instead of laying out rules, I encouraged my employees to find a way that works best for them to reach the result we both desire. If you want your employees to put in their best work, you have to give them a place they want to work. Previously, I had created a space that emphasized hard work and extreme productivity, but did very little to harbor growth and fulfillment on a personal level."}, {"2c0d": "THE RESULT"}, {"87a7": "It’s been two years since I began implementing a new approach and making service to my employees my focus as a leader. I became more conscientious about the type of people I hired, seeking those who appeared to align closely with my personal mission. This resulted in an atmosphere of camaraderie, where everyone could freely exchange ideas to help improve performance and quality at both the business and personal levels."}, {"5f7d": "Leadership and management isn’t only about enforcing a list of rules. It’s also about encouraging your team to problem solve and get into routines that allow them to work at peak performance. Giving them some space to make mistakes and allow correction is an important aspect of career growth. Too often, we are focused on the short term, instead of investing in our employees and aiding in their development."}, {"86a1": "In the end, learning to give my team space to breathe resulted in long term, sustainable growth. The work culture that has been created lets everyone know that we stand on a solid foundation, and that I value the contributions they make to the business. It turns out that giving up was exactly what I needed. That, and tacos."}], "child": "2316_1\t2316_2", "parent": "", "title": "The Beauty of Giving Up", "content": "The Beauty of Giving Up The benefit of abandoning your business structure THE PROBLEM In the early winter of 2015, I found myself in the midst of what amounted to a mutiny within my business. The rumor mill was abuzz that my entire staff was abandoning ship. Four people had already quit, and over the next several weeks, three more would follow suit. This was in a business that only employed around 10 people at any given time. I had lost control of the situation. Every attempt at creating a structured work environment with rules, deadlines, and quotas was met with opposition. Instead of being viewed as a boss, I was viewed as a peer. The tension in the environment was palpable, and we all harbored resentments that were constantly leaking into every day work life. I had little faith and trust in my employees, and my formerly high expectations had been crushed. It was after a whirlwind of circumstances and crises that I realized it was time to give up. Not on my business, heavens no. If I didn’t fight it out until the bitter end I faced certain financial ruin. The least I could do was keep pushing until there were no other options. A re-evaluation of what I believed to be my role as a leader had become necessary. What I was doing obviously didn’t work, so I had to abandon it and correct course or risk losing everything. THE SOLUTION Let me take a step back and explain what I do. I own a very busy, high performing tattoo studio. I work with artists. Do you work with creatives? Getting them to follow instruction is like herding tigers. I had essentially tried to be an alpha pack leader to 9 other alphas. Artists are aloof, often transient, and value freedom over just about everything. I was holding a tight leash in an attempt to optimize performance, and instead it created a stifling, tense environment. I stopped trying to give rules. Instead, I began to give guidelines and make suggestions based on my own experience. While in the past I barked out the law of the land, I instead decided to stop and listen to their needs. Caught up in my own expectations, I failed to see the growing problems that eventually caused a rift that couldn’t be bridged. Employee career goals are often completely different from that of a business owner. As the boss, you can’t fully expect your staff to understand and care about the issues regarding the day to day workings of your business; in fact, many business owners put double the man hours into their workweek than their employees. However, you should keep in mind that as you perform actions to purposely propel you toward your goals, your employees are also pursuing their own. Acknowledging that you understand and respect their quest to accomplish their own set of goals is a good way to cultivate a good relationship with your staff. In the end, all anyone wants is to feel as if they are a happy and fulfilled individual. The quotas I had in the past became a suggestive guideline. All projections had been based on my own level of work, instead of each individual employee. I understood now that I couldn’t force their hand to work beyond their capacity. Each employee hits a level of productivity that is based on their speed, skill level, and attention to detail. Short term profits mean nothing if there is no retention of employees, and employees mean nothing if they’re not doing quality work and making their clients happy. My entire focus shifted to the culture and environment of the workplace. Instead of laying out rules, I encouraged my employees to find a way that works best for them to reach the result we both desire. If you want your employees to put in their best work, you have to give them a place they want to work. Previously, I had created a space that emphasized hard work and extreme productivity, but did very little to harbor growth and fulfillment on a personal level. THE RESULT It’s been two years since I began implementing a new approach and making service to my employees my focus as a leader. I became more conscientious about the type of people I hired, seeking those who appeared to align closely with my personal mission. This resulted in an atmosphere of camaraderie, where everyone could freely exchange ideas to help improve performance and quality at both the business and personal levels. Leadership and management isn’t only about enforcing a list of rules. It’s also about encouraging your team to problem solve and get into routines that allow them to work at peak performance. Giving them some space to make mistakes and allow correction is an important aspect of career growth. Too often, we are focused on the short term, instead of investing in our employees and aiding in their development. In the end, learning to give my team space to breathe resulted in long term, sustainable growth. The work culture that has been created lets everyone know that we stand on a solid foundation, and that I value the contributions they make to the business. It turns out that giving up was exactly what I needed. That, and tacos. ", "name": "2316"}