{"child": "2339_1\t2339_2\t2339_3\t2339_4\t2339_5\t2339_6\t2339_7\t2339_8\t2339_9\t2339_10\t2339_11\t2339_12\t2339_13", "content": "It is Not OK to be a content consultant, an online content marketer, a personal development specialist, a twenty years old and write inspirational advice about careers, entrepreneurship and money. As any of the above you have a direct vested interest in people quitting their jobs, following their dreams, starting up companies, as many as possible, loosing sight of the immediate to focus on some hazy future success, feel under appreciated, feel like they’re lost, feel like a failure, feel bad in general, or mediocre. As any of the above you will want people to risk, to fall and then lick their wounds in one day only to restart, to stay free of strings attached and any dependencies, to hustle, to be more like you, to confirm your social position, to confirm your world view, to see things as you do, to ease your entry into the world of living, business, success and networking. As any of the above you will dispense advice exactly as your situation is, advice as copywriting, advice as pub philosophy, advice as listicle, advice as pretentious universal truths, advice as pink paint painted over the grey of reality, advice as you’ve just bred the first unicorn to be seen in the last hundred thousand years. You didn’t. You don’t even have a damn horse. As any of the above you will be able to offer advice about your humanity as everyone else, about the days of your life, about your personal stories, about the things you have learned, but not about careers, entrepreneurship and money. Don’t do it, it’s not ok. You’re cheating your audience. There are many others than what I’ve listed above because anyone can title themselves anything when no track record is required, and as far as Internet publishing goes none is. As any of the above please consider dispensing advice without hijacking someone else who has actually lived to tell the story. That means no name dropping. None. You should stop daring to sell dreams. Dreams should not be sold. Dreams should be free. And individual. What do you mean nobody should work for a salary? What do you mean we should all be founders and entrepreneurs? What do you mean I should read a book a week? What do you mean I should do all these lists of random things to be happy and successful? All these articles written like Hollywood choses to portray any physical work, with uplifting music, bright colours and wide smiles. What do you mean? What do all these scenes of people building houses in thirty seconds of clear weather, make up on, hair perfect dances with tools mean? Companies are shit. Entrepreneurship is shit. Most chances are you will fail. They will fail. All these people you sell the dreams to will fail. They will fail at doing your 100 item daily checklist for success. They will fail to pay the money they owe because of the great idea they founded on their own. They will fail because you sold them a bad product. Stop. You should stop. You should be kinder to people. Start suggesting. Stop being so fucking decisive. No, salaries will not die, success does not come from hustle, there is no success without hustle, there is no recipe for building the next unicorn. Etcetera. Start mentioning luck folks. Call luck what it is. Pull the luck stick and point it at all those people you’re quoting. Stop encouraging people to quit, as if impulsive quitting by itself will solve anything, ever. It doesn’t, it just makes quitting at the right time imposible. Dreams are a bad product to sell. Dreams are intoxicating if they’re someone else’s. Dreams hurt worse if they fail and they’re not your own. Careers, entrepreneurship and money are things for which advice should be taken with a sack of salt, not a mere grain. You know why? Because once they go wrong they take half your life to be put back on track. Self esteem advice by personal example is atrocious. You are not really helping anyone, except those people who inflate your ego by congratulating you and who don’t really require any help anyway, either because of their narcissistic shields or because they don’t really want any help, they just had some endorphin ride and feel good. Stop building business by selling dreams. Sell products. What am I saying, I’m an advertiser. Once an advertiser, always an advertiser. I know all products are dreams. But some dreams are not products. Dreams about career, entrepreneurship and money are not products. They are personal lifelong investments into an idea. All hype infests ideas with false hope and bitter disillusionment. It is like the priests who never had sex but lecture people about sex. It is like the spiritual gurus who never had anyone depend on them but lecture about detachment. It is like the serial monogamists who lecture about marriage. It is like the eternally single who lecture about polyamory. It is like all these people who have no depth. Stop being one of them. You are a good communicator. Use that. Do it better than me, better than anyone else, even better than you at some point in time. Look back and be happy you’ve sold people things they could use and some used them to follow their dreams. ", "title": "It is Not OK to be a content consultant, an online content marketer, a personal development specialist, a twenty years old and write inspirational advice about careers, entrepreneurship and money.", "sentences": [{"6a99": "It is Not OK to be a content consultant, an online content marketer, a personal development specialist, a twenty years old and write inspirational advice about careers, entrepreneurship and money."}, {"279e": "As any of the above you have a direct vested interest in people quitting their jobs, following their dreams, starting up companies, as many as possible, loosing sight of the immediate to focus on some hazy future success, feel under appreciated, feel like they’re lost, feel like a failure, feel bad in general, or mediocre."}, {"aa05": "As any of the above you will want people to risk, to fall and then lick their wounds in one day only to restart, to stay free of strings attached and any dependencies, to hustle, to be more like you, to confirm your social position, to confirm your world view, to see things as you do, to ease your entry into the world of living, business, success and networking."}, {"8036": "As any of the above you will dispense advice exactly as your situation is, advice as copywriting, advice as pub philosophy, advice as listicle, advice as pretentious universal truths, advice as pink paint painted over the grey of reality, advice as you’ve just bred the first unicorn to be seen in the last hundred thousand years. You didn’t. You don’t even have a damn horse."}, {"4aef": "As any of the above you will be able to offer advice about your humanity as everyone else, about the days of your life, about your personal stories, about the things you have learned, but not about careers, entrepreneurship and money. Don’t do it, it’s not ok. You’re cheating your audience."}, {"50f3": "There are many others than what I’ve listed above because anyone can title themselves anything when no track record is required, and as far as Internet publishing goes none is."}, {"e97f": "As any of the above please consider dispensing advice without hijacking someone else who has actually lived to tell the story. That means no name dropping. None."}, {"adf4": "You should stop daring to sell dreams."}, {"35c4": "Dreams should not be sold."}, {"43da": "Dreams should be free."}, {"81e9": "And individual."}, {"619e": "What do you mean nobody should work for a salary? What do you mean we should all be founders and entrepreneurs? What do you mean I should read a book a week? What do you mean I should do all these lists of random things to be happy and successful?"}, {"bdd9": "All these articles written like Hollywood choses to portray any physical work, with uplifting music, bright colours and wide smiles. What do you mean? What do all these scenes of people building houses in thirty seconds of clear weather, make up on, hair perfect dances with tools mean?"}, {"0f1d": "Companies are shit. Entrepreneurship is shit. Most chances are you will fail. They will fail. All these people you sell the dreams to will fail. They will fail at doing your 100 item daily checklist for success. They will fail to pay the money they owe because of the great idea they founded on their own. They will fail because you sold them a bad product."}, {"90b1": "Stop. You should stop. You should be kinder to people."}, {"81c9": "Start suggesting. Stop being so fucking decisive. No, salaries will not die, success does not come from hustle, there is no success without hustle, there is no recipe for building the next unicorn. Etcetera."}, {"fd24": "Start mentioning luck folks. Call luck what it is. Pull the luck stick and point it at all those people you’re quoting."}, {"5579": "Stop encouraging people to quit, as if impulsive quitting by itself will solve anything, ever. It doesn’t, it just makes quitting at the right time imposible."}, {"de9d": "Dreams are a bad product to sell."}, {"0e21": "Dreams are intoxicating if they’re someone else’s."}, {"f7e7": "Dreams hurt worse if they fail and they’re not your own."}, {"a900": "Careers, entrepreneurship and money are things for which advice should be taken with a sack of salt, not a mere grain."}, {"d879": "You know why? Because once they go wrong they take half your life to be put back on track."}, {"5e99": "Self esteem advice by personal example is atrocious. You are not really helping anyone, except those people who inflate your ego by congratulating you and who don’t really require any help anyway, either because of their narcissistic shields or because they don’t really want any help, they just had some endorphin ride and feel good."}, {"41f8": "Stop building business by selling dreams. Sell products."}, {"805d": "What am I saying, I’m an advertiser. Once an advertiser, always an advertiser. I know all products are dreams. But some dreams are not products."}, {"b7e1": "Dreams about career, entrepreneurship and money are not products. They are personal lifelong investments into an idea. All hype infests ideas with false hope and bitter disillusionment."}, {"ad75": "It is like the priests who never had sex but lecture people about sex."}, {"2e79": "It is like the spiritual gurus who never had anyone depend on them but lecture about detachment."}, {"9775": "It is like the serial monogamists who lecture about marriage."}, {"2fbc": "It is like the eternally single who lecture about polyamory."}, {"3188": "It is like all these people who have no depth. Stop being one of them."}, {"0165": "You are a good communicator. Use that. Do it better than me, better than anyone else, even better than you at some point in time. Look back and be happy you’ve sold people things they could use and some used them to follow their dreams."}], "name": "2339", "parent": ""}