{"child": "2343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_6\t2343_7\t2343_8\t2343_9\t2343_10\t2343_11\t2343_12\t2343_13\t2343_14\t2343_152343_1\t2343_2\t2343_3\t2343_4\t2343_5\t2343_6\t2343_7\t2343_8\t2343_9\t2343_10\t2343_11\t2343_12\t2343_13\t2343_14\t2343_15", "content": "Strong leadership is gentle Leadership requires vision, daring, and organization, but it also requires the creation of strong communities that can withstand failure, uncertainty, and competing job offers. Strong communities form when leaders show care and invest in the success of their reports. Showing care means that the leader can gently navigate all of the various emotions that life triggers for an individual, because they all happen at work. There’s euphoria and heartbreak, excitement and jealousy, friendship and rivalry. Leaders who enroll in supporting individuals through all these ups and downs inspire their people to higher performance, selflessness, and loyalty. These are the foundations of communities where people thrive and consistently outperform other teams. There are right and wrong ways to practice gentleness and care, so it’s important to explore what this means. Kind > Cool People wilt when they don’t feel appreciated for what they do. They retreat when they don’t get positive signals from you when you interact. Even high performers who prefer autonomy want to know that their work matters, and that you want to work with them. People often confuse leadership with suaveness or aloofness, but being cool doesn’t promote long-term success or high retention — being kind does. When you provide positive reinforcement, you develop deeper bonds, and more importantly, you inspire that person’s creativity and increase their desire to repeat winning behaviors. You also model the behavior you want your team to show to others. Positive leaders cultivate positive teams, and studies show that teams with positive leaders outperform other teams by 4x. But like any craft, being a positive leader isn’t as straightforward as it sounds, so let’s break it down into concrete actions. Becoming a positivity pro Feedback Inspiring self-confidence in another person can have radical effects on their work and their life beyond work. Positive reinforcement puts light in people’s eyes and fire in their heart to achieve consistently greater results. Acknowledge someone when they’ve exhibited your most important team values, and do it with specificity and frequency. This feedback lands best when it’s done without prompting. When it comes during a review cycle or other ‘forced’ feedback point, it’s often dismissed as required and inauthentic. Instead, remember to provide unprompted reinforcement as positive actions are happening. This connects the resulting positive mentality with the successful behavior you’d like to reinforce. But there are still times when tough conversations are necessary. People have blindspots, and people benefit from hearing alternative points of view. The key is to make those conversations into relationship builders instead of destroyers. One way to do that is to avoid the old adage about packing bad feedback into a sandwich of good feedback. How you present information matters, but the ‘sh*t sandwich’ technique tends to seem inauthentic, and worse, it often fails to successfully deliver your key critique. Instead, clearly state your desire to help, compassionately provide the constructive feedback, and request their point of view in return. Ultimately, you’re aiming to create a positive change, so you should focus on what can help the person get there. Of course, the key to landing your feedback with others is by showing that it’s a two-way street. Building a powerful culture of feedback requires that the manager be purposefully vulnerable in asking for (and pivoting on) feedback from the people she manages, even if it’s hard to accept at first. Appreciation It’s not enough to tell people that they did a good job. What’s even more important is how you show thankfulness. Gratitude is a key contributor for team performance. It’s also something that improves your own happiness the more you use it. Say ‘thank you’ for someone’s efforts to deliver excellent work. Say ‘thank you’ for feedback. Say ‘thank you’ when a teammate helps another teammate. Copy the person’s boss in an email when you thank them for their contributions to your project. Of course, these are just suggestions — remember that people have (sometimes radically different) preferences for how they receive recognition, so personalizing your approach based on those preferences can have a big impact on how well your message lands. All these things also tend to be reciprocal. If your team is not getting recognition for its contributions to a larger goal, it often helps to thank your cross-functional peers for their efforts. It’s natural to share feelings of gratitude once one side has taken the first step. Attention & care The majority of communication is non-verbal. People can tell when someone is being present, and they can tell if the person is genuinely interested. If you can’t authentically commit to giving your full self to another person’s success, then none of the tips above can pass people’s natural bullshit-detector. You genuinely have to care about each person on your team. When you care, you naturally follow up with acts of care that people notice. As General Powell revealed, even the military’s leadership centers on care. “The day soldiers stop bringing you their problems is the day you have stopped leading them. They have either lost confidence that you can help them or concluded that you do not care. Either case is a failure of leadership.” — Colin Powell Care and active help are critical components to leadership success, so you must be especially mindful of requests for help. Often, these aren’t explicitly stated, so be observant. When you’re able to find opportunities to help people before they’ve even asked, you’re demonstrating the kind of care for their success that inspires loyalty and mutual respect. Their success is your success No matter how you act, or what success you’ve driven in the past, your success as a leader in your current role will be defined by the success of your team. Strong communities are more resilient, more inspiring, and higher performing than aggregations of unconnected individuals. Forming communities out of individuals is the first step in leadership success, and centering your approach in the gentle arts of feedback, gratitude, and care will foster the strong bonds that communities need to thrive. So, be bold, move fast, but always remember that you can’t do it alone. Ultimately, you can only lead people who choose to work for you, and those people want to know that you’ll care enough about them to invest in their success. I hope this was helpful to you. I’m trying to spread my writing, so click the ❤ if you’d like others to find this! Follow me for more writing here on Medium. Other articles you might like: Managers: let your reports fail Open and connected: How I learned to manage myself and others Find your career sound Advice for interns ", "title": "Strong leadership is gentle", "sentences": [{"3a95": "Strong leadership is gentle"}, {"f1da": "Leadership requires vision, daring, and organization, but it also requires the creation of strong communities that can withstand failure, uncertainty, and competing job offers."}, {"2299": "Strong communities form when leaders show care and invest in the success of their reports. Showing care means that the leader can gently navigate all of the various emotions that life triggers for an individual, because they all happen at work. There’s euphoria and heartbreak, excitement and jealousy, friendship and rivalry. Leaders who enroll in supporting individuals through all these ups and downs inspire their people to higher performance, selflessness, and loyalty. These are the foundations of communities where people thrive and consistently outperform other teams."}, {"628b": "There are right and wrong ways to practice gentleness and care, so it’s important to explore what this means."}, {"ba86": "Kind > Cool"}, {"076b": "People wilt when they don’t feel appreciated for what they do. They retreat when they don’t get positive signals from you when you interact. Even high performers who prefer autonomy want to know that their work matters, and that you want to work with them."}, {"a90a": "People often confuse leadership with suaveness or aloofness, but being cool doesn’t promote long-term success or high retention — being kind does."}, {"cf9e": "When you provide positive reinforcement, you develop deeper bonds, and more importantly, you inspire that person’s creativity and increase their desire to repeat winning behaviors."}, {"73f6": "You also model the behavior you want your team to show to others. Positive leaders cultivate positive teams, and studies show that teams with positive leaders outperform other teams by 4x."}, {"fd88": "But like any craft, being a positive leader isn’t as straightforward as it sounds, so let’s break it down into concrete actions."}, {"e183": "Becoming a positivity pro"}, {"9386": "Feedback"}, {"9df1": "Inspiring self-confidence in another person can have radical effects on their work and their life beyond work. Positive reinforcement puts light in people’s eyes and fire in their heart to achieve consistently greater results. Acknowledge someone when they’ve exhibited your most important team values, and do it with specificity and frequency."}, {"cfc9": "This feedback lands best when it’s done without prompting. When it comes during a review cycle or other ‘forced’ feedback point, it’s often dismissed as required and inauthentic. Instead, remember to provide unprompted reinforcement as positive actions are happening. This connects the resulting positive mentality with the successful behavior you’d like to reinforce."}, {"a2a7": "But there are still times when tough conversations are necessary. People have blindspots, and people benefit from hearing alternative points of view. The key is to make those conversations into relationship builders instead of destroyers."}, {"774a": "One way to do that is to avoid the old adage about packing bad feedback into a sandwich of good feedback. How you present information matters, but the ‘sh*t sandwich’ technique tends to seem inauthentic, and worse, it often fails to successfully deliver your key critique."}, {"c97f": "Instead, clearly state your desire to help, compassionately provide the constructive feedback, and request their point of view in return. Ultimately, you’re aiming to create a positive change, so you should focus on what can help the person get there."}, {"a681": "Of course, the key to landing your feedback with others is by showing that it’s a two-way street. Building a powerful culture of feedback requires that the manager be purposefully vulnerable in asking for (and pivoting on) feedback from the people she manages, even if it’s hard to accept at first."}, {"687d": "Appreciation"}, {"4958": "It’s not enough to tell people that they did a good job. What’s even more important is how you show thankfulness."}, {"bd3d": "Gratitude is a key contributor for team performance. It’s also something that improves your own happiness the more you use it."}, {"c3cf": "Say ‘thank you’ for someone’s efforts to deliver excellent work. Say ‘thank you’ for feedback. Say ‘thank you’ when a teammate helps another teammate. Copy the person’s boss in an email when you thank them for their contributions to your project."}, {"79c3": "Of course, these are just suggestions — remember that people have (sometimes radically different) preferences for how they receive recognition, so personalizing your approach based on those preferences can have a big impact on how well your message lands."}, {"9d40": "All these things also tend to be reciprocal. If your team is not getting recognition for its contributions to a larger goal, it often helps to thank your cross-functional peers for their efforts. It’s natural to share feelings of gratitude once one side has taken the first step."}, {"f7d9": "Attention & care"}, {"dcb6": "The majority of communication is non-verbal. People can tell when someone is being present, and they can tell if the person is genuinely interested."}, {"af8c": "If you can’t authentically commit to giving your full self to another person’s success, then none of the tips above can pass people’s natural bullshit-detector."}, {"88b9": "You genuinely have to care about each person on your team. When you care, you naturally follow up with acts of care that people notice. As General Powell revealed, even the military’s leadership centers on care."}, {"17d0": "“The day soldiers stop bringing you their problems is the day you have stopped leading them. They have either lost confidence that you can help them or concluded that you do not care. Either case is a failure of leadership.” — Colin Powell"}, {"e415": "Care and active help are critical components to leadership success, so you must be especially mindful of requests for help. Often, these aren’t explicitly stated, so be observant. When you’re able to find opportunities to help people before they’ve even asked, you’re demonstrating the kind of care for their success that inspires loyalty and mutual respect."}, {"8438": "Their success is your success"}, {"ff80": "No matter how you act, or what success you’ve driven in the past, your success as a leader in your current role will be defined by the success of your team."}, {"f8f2": "Strong communities are more resilient, more inspiring, and higher performing than aggregations of unconnected individuals. Forming communities out of individuals is the first step in leadership success, and centering your approach in the gentle arts of feedback, gratitude, and care will foster the strong bonds that communities need to thrive."}, {"f1c7": "So, be bold, move fast, but always remember that you can’t do it alone. Ultimately, you can only lead people who choose to work for you, and those people want to know that you’ll care enough about them to invest in their success."}, {"7059": "I hope this was helpful to you. I’m trying to spread my writing, so click the ❤ if you’d like others to find this! Follow me for more writing here on Medium."}, {"7572": "Other articles you might like: Managers: let your reports fail"}, {"1ec5": "Open and connected: How I learned to manage myself and others"}, {"9656": "Find your career sound"}, {"27bd": "Advice for interns"}], "name": "2343", "parent": ""}