{"child": "2347_1\t2347_2\t2347_3", "content": "(336) Things That Are Ill Advised If I Have Cramps 1. Telling me about a missed capital letter in my Facebook status 2. Telling me your tummy feels off too whilst having a penis simultaneously 3. Telling me you do not have coffee, wines, chocolate, or steak 4. Not telling me you don’t have those things and then not having them 5. Pretending like you totally remembered that I feel like a flesh sac of scorpions and roasting turds right after you just asked me if I could explain what ‘derailing’ is and also how come impact over intent again wait why how 6. Thinking the heat waves off my lower belly are cute whilst not being my husband 7. Trying to fondle them 8. Thinking fondling my heat waves is cute 9. Still not having chocolate 10. Also I missed a semi colon, did I spot that 11. Confusing my emotions with my hormones and thinking you have any fucking claim on how either presents 12. Asking if I feel better five times in twelve minutes then being annoyed when I insist on still having cramps 13. Again with this no chocolate having 14. Not practicing for your lesson 15. Telling me you have an audition in three days after not having practiced for your lesson 16. Pretending like you take that audition seriously 17. Bullying within smacking distance of me. I don’t care you’re 43. 18. Cutting me off when there is zero traffic 19. The god unfucked chocolate tho 20. Uteri. As a concept. Pay Heejin Weisbrod using PayPal.MeGo to paypal.me/ClassicalSass and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me ", "title": "(336) Things That Are Ill Advised If I Have Cramps", "sentences": [{"c9da": "(336) Things That Are Ill Advised If I Have Cramps"}, {"b41c": "1. Telling me about a missed capital letter in my Facebook status"}, {"9e79": "2. Telling me your tummy feels off too whilst having a penis simultaneously"}, {"b3c3": "3. Telling me you do not have coffee, wines, chocolate, or steak"}, {"e738": "4. Not telling me you don’t have those things and then not having them"}, {"16fb": "5. Pretending like you totally remembered that I feel like a flesh sac of scorpions and roasting turds right after you just asked me if I could explain what ‘derailing’ is and also how come impact over intent again wait why how"}, {"ff46": "6. Thinking the heat waves off my lower belly are cute whilst not being my husband"}, {"8bb9": "7. Trying to fondle them"}, {"1ed0": "8. Thinking fondling my heat waves is cute"}, {"e690": "9. Still not having chocolate"}, {"f89b": "10. Also I missed a semi colon, did I spot that"}, {"f6b9": "11. Confusing my emotions with my hormones and thinking you have any fucking claim on how either presents"}, {"6974": "12. Asking if I feel better five times in twelve minutes then being annoyed when I insist on still having cramps"}, {"aab2": "13. Again with this no chocolate having"}, {"9267": "14. Not practicing for your lesson"}, {"e8a9": "15. Telling me you have an audition in three days after not having practiced for your lesson"}, {"aa8b": "16. Pretending like you take that audition seriously"}, {"e577": "17. Bullying within smacking distance of me. I don’t care you’re 43."}, {"64d5": "18. Cutting me off when there is zero traffic"}, {"b606": "19. The god unfucked chocolate tho"}, {"6538": "20. Uteri. As a concept."}, {"945b": "Pay Heejin Weisbrod using PayPal.MeGo to paypal.me/ClassicalSass and type in the amount. Since it's PayPal, it's easy and secure. Don't have a PayPal…www.paypal.me"}], "name": "2347", "parent": ""}