{"name": "235", "parent": "", "content": "What brings you joy? And why it’s hard to answer this question Sometimes the experience of joy can be more uncomfortable than the one of pain. Dr. Brené Brown even states that joy is the most terrifying emotion we feel as humans. Last week, I wrote a piece about my greatest fears. Richard Childs responded back with the following: “I think if simultaneously you answered your greatest loves, you’d recognize the holistic, loving Jessica I am coming to know through your writing. And this would be a much more accurate and balanced picture. More importantly a better foundation to focus on your continuous development.” In writing my greatest loves, or what brings me joy, I encountered a lot of resistance. In Brown’s words, I was experiencing the foreboding joy. Everything on this list, I might lose tomorrow, and I know I will lose eventually. But I kept writing. One of the many gifts of experiencing the darkness deeply, is it allows me to experience the light more fully. Ten things that bring me joy: What brings you joy? Feel free to share in the comments, it will bring me joy to read through them. If you like what you read, please give it a ❤ below Stay in touch by subscribing to my bi-weekly newsletter here ", "title": "What brings you joy?", "sentences": [{"6eb4": "What brings you joy?"}, {"4f5d": "And why it’s hard to answer this question"}, {"7fb1": "Sometimes the experience of joy can be more uncomfortable than the one of pain. Dr. Brené Brown even states that joy is the most terrifying emotion we feel as humans."}, {"1d9a": "Last week, I wrote a piece about my greatest fears. Richard Childs responded back with the following:"}, {"03b0": "“I think if simultaneously you answered your greatest loves, you’d recognize the holistic, loving Jessica I am coming to know through your writing. And this would be a much more accurate and balanced picture. More importantly a better foundation to focus on your continuous development.”"}, {"9b43": "In writing my greatest loves, or what brings me joy, I encountered a lot of resistance. In Brown’s words, I was experiencing the foreboding joy. Everything on this list, I might lose tomorrow, and I know I will lose eventually. But I kept writing."}, {"56e6": "One of the many gifts of experiencing the darkness deeply, is it allows me to experience the light more fully. Ten things that bring me joy:"}, {"a081": "What brings you joy? Feel free to share in the comments, it will bring me joy to read through them."}, {"7321": "If you like what you read, please give it a ❤ below"}, {"9b2d": "Stay in touch by subscribing to my bi-weekly newsletter here"}], "child": "235_1\t235_2\t235_3\t235_4\t235_5\t235_6\t235_7\t235_8\t235_9\t235_10\t235_11\t235_12\t235_13\t235_14\t235_15\t235_16\t235_17\t235_18\t235_19\t235_20\t235_21\t235_22\t235_23\t235_24\t235_25235_1\t235_2\t235_3\t235_4\t235_5\t235_6\t235_7\t235_8\t235_9\t235_10\t235_11\t235_12\t235_13\t235_14\t235_15\t235_16\t235_17\t235_18\t235_19\t235_20\t235_21\t235_22\t235_23\t235_24\t235_25235_1\t235_2\t235_3\t235_4\t235_5\t235_6\t235_7\t235_8\t235_9\t235_10\t235_11\t235_12\t235_13\t235_14\t235_15\t235_16\t235_17\t235_18\t235_19\t235_20\t235_21\t235_22\t235_23\t235_24\t235_25"}