{"child": "2357_1\t2357_2", "content": "4 techniques to create eye-catching banners Competition is fierce in affiliate marketing right now. To get leads and installs at a reasonable price, you need to use a variety of different approaches and constantly experiment with new ones. You can always copy ready-made banners from different tools, but that won’t get you very far. To get really high volumes, you need to keep the creative juices flowing and design your own banners. How do you do it? Our team has been creating banners for mobile ads for four years now. Let me tell you what technics we use. Life Force 8 The first technic I would like to talk about — Life Force 8. This approach is based on universal desires and needs that have been identified by psychologists and market researchers. The list looks like this: Experience pleasure from eating and drinking Live without fear or pain Experience sexual attraction Have comfortable surroundings Be no worse than others Care for loved ones Gain social approval Live a long life So you need to create banners using creatives or words that will express the abovementioned desires and needs. Ca$hvertising When you are creating ads, follow Drew Eric Whitman’s advice from the book “Ca$hvertising”. His tips are based on the fundamental principles of consumer psychology. Help visualize the product We like to see our dreams and wishes come true. We love to read about or watch how other people achieve goals they have set. We imagine ourselves as these people and put ourselves in their place: we become happy or rich. The visualization process helps us achieve the desired results. Use well-designed visual ads to show customers how much they will enjoy your product before they actually buy it. Use fear Fear is one of the most powerful motivators. When you warn consumers of a possible threat, whether it’s dust mites in pillows or bacteria on the floor, people get worried. They start looking for a solution to avoid the potential problem. Show them that your product can free them from fear. Use fear as an incentive to buy. For instance, if you are advertising new brake pads, you can hint to customers that worn brakes could cause a terrible accident. Change the buyer’s thinking Make consumers associate themselves with the product. Use images and pictures of celebrities that people want to identify with either before or after the product is purchased. Just look at Victoria’s Secret. Their glamorous models aren’t just showing off lingerie, but suggesting that women can be like them if they just buy the underwear. In these cases, the images do most of the work. Show that the product is trustworthy Trust is a significant component of an advertisement. If people don’t believe what you’re saying about your product, they won’t buy it. Reinforce the ad with the opinions or endorsements of credible people, experts, or reputable organizations. This will boost consumer confidence in the product. For example, celebrity reviews can attract customers and increase sales funnel conversions (“I’ve already tried it, and it really works, so go ahead and try it yourself!”). Supply evidence, facts, research, references, recommendations, and reviews. This will emphasize the product’s value. The more you include numbers, statistics, and graphs, the more valuable it will appear to consumers. Take advantage of the “herd instinct” People need to belong to a social group. They come together over common interests or join groups as a status symbol. Marketers can sell products or services by targeting people’s desire to belong to such communities. For instance, marketers promoted Jif peanut butter with the slogan “Choosy Moms Choose Jif”. The people who bought Jif after watching this commercial didn’t buy it because the peanut butter is so amazing. They bought it because they wanted to associate themselves with a group of responsible parents. Talk about the benefits People buy a product when they understand how it will benefit them. For instance, real estate agents buy expensive cars to show potential clients how successful they are. This helps them to close more deals. The main thing is for the ad to get across the idea of a future benefit. This strategy works well for advertising expensive products and services. Persuade gradually The biggest challenge is selling products or services to people who have never heard of you or your products. Consumers find out about the product in stages, and their purchase won’t be fast. They go through several stages : unawareness — familiarity — desire to buy — purchase. In the end, these consumers become loyal customers because they understand the product. Create ads that educate consumers at each stage. In most cases, this won’t be a single ad message, but rather a series of ads that walk people through the stages of getting to know the product and making a purchase. Break the stereotypes Change the customer’s ideas about the product. Switch the focus from one characteristic of the product to something else, or undermine the beliefs that are preventing consumers from making a purchase. Support your words with successful cases. If you are trying to make someone doubt their convictions, don’t do so aggressively. Offer an alternative viewpoint that discretely encourages the buyer to look at the product in a new way. Most importantly, don’t be negative. Explore behavior patterns There are two ways to influence buyer behavior. You can create ads that target the rational component. These ads are most suitable for serious purchases like a house or a car. For example, “House with land starting at 490,000 rubles just 77 km from Moscow”. The alternative is ads that play on the emotions. These are for everyday purchases, such as food, clothing, and so on. Use weapons of influence Psychologist Robert Cialdini spent three years studying influence for his book, “The Psychology of Persuasion”. As a result, he defined seven powerful principles of persuasion. The principle of social proof Show consumers that purchasing an item will make them belong to a specific group of people. (“Many successful entrepreneurs read our magazine — so should you!”) The principle of reciprocity. People usually feel the need to reciprocate when something is done for them. So if they are given a free sample or a gift, they feel obligated to do something in return. The principle of consistency People demonstrate a certain type of behavior by keeping their actions consistent. If someone installs the demo version of a product, then leaves feedback about their experience and points out all the negatives while talking to tech support, they feel that the next logical step is to purchase the product. The principle of authority “19 out of 20 cosmetologists agree that this product is the best way to combat the first signs of aging.” The principle of scarcity If there isn’t enough of it, people must be buying it, which means it must be good. Draw attention to the low supply of a product and limited time left to buy it: “Only 15 TVs left! Just $499 while supplies last.” The principle of personal affinity People are more apt to agree with the assertions of someone they like. The principle of consensus If you have something in common with your audience, you will inevitably bring them around to your point of view. 7 sins This approach takes advantage of traditional human weaknesses: laziness, greed, envy, pride, wrath, sloth and lust. This method is very effective for dating sites if you create a separate ad message targeted at each “vice”. Examples: Laziness: “Guaranteed dates in your city. Search within 3 km of your location. All beautiful women. 30-second signup. Many of our ladies are ready to go out today.” Greed: “Prepare to date at least one new woman every week after signing up in this app.” Envy: “7% of men get 54% of all likes and comments from women. How do they do it? First they sign up on our site.” Pride: “Your ex will hate you when she sees you with these gorgeous women.” Wrath: “How could she dare to not reply? Don’t lose hope — keep calm! And sign up on this site to meet girls who will give you a chance.” Sloth: “Are you embarrassed that you still don’t have a girlfriend? Are you lonely? Sign up on the site.” Lust: “Are you looking for a good time tonight? A lot of ladies on our site are looking for a guy to spend tonight with.” The market is saturated with products and advertising. To spend the advertiser’s money wisely, analyze your audience first, and use a variety of methods and approaches when creating ads. If you don’t know how to do it, just contact Mobio team. We have over 25 affiliate marketers, and designers who will help you. To get TH’s new articles, subscribe to our FB bot. ", "title": "4 techniques to create eye-catching banners", "sentences": [{"d3c7": "4 techniques to create eye-catching banners"}, {"5a5a": "Competition is fierce in affiliate marketing right now. To get leads and installs at a reasonable price, you need to use a variety of different approaches and constantly experiment with new ones."}, {"f7f7": "You can always copy ready-made banners from different tools, but that won’t get you very far. To get really high volumes, you need to keep the creative juices flowing and design your own banners."}, {"832d": "How do you do it? Our team has been creating banners for mobile ads for four years now. Let me tell you what technics we use."}, {"bce9": "Life Force 8"}, {"c7d8": "The first technic I would like to talk about — Life Force 8. This approach is based on universal desires and needs that have been identified by psychologists and market researchers. The list looks like this:"}, {"bc09": "Experience pleasure from eating and drinking"}, {"e53f": "Live without fear or pain"}, {"c51a": "Experience sexual attraction"}, {"7169": "Have comfortable surroundings"}, {"c144": "Be no worse than others"}, {"e504": "Care for loved ones"}, {"e460": "Gain social approval"}, {"72fc": "Live a long life"}, {"68fa": "So you need to create banners using creatives or words that will express the abovementioned desires and needs."}, {"d89d": "Ca$hvertising"}, {"18e4": "When you are creating ads, follow Drew Eric Whitman’s advice from the book “Ca$hvertising”. His tips are based on the fundamental principles of consumer psychology."}, {"ab00": "Help visualize the product"}, {"8331": "We like to see our dreams and wishes come true. We love to read about or watch how other people achieve goals they have set. We imagine ourselves as these people and put ourselves in their place: we become happy or rich. The visualization process helps us achieve the desired results. Use well-designed visual ads to show customers how much they will enjoy your product before they actually buy it."}, {"b4f3": "Use fear"}, {"60f3": "Fear is one of the most powerful motivators. When you warn consumers of a possible threat, whether it’s dust mites in pillows or bacteria on the floor, people get worried. They start looking for a solution to avoid the potential problem. Show them that your product can free them from fear. Use fear as an incentive to buy. For instance, if you are advertising new brake pads, you can hint to customers that worn brakes could cause a terrible accident."}, {"562d": "Change the buyer’s thinking"}, {"8824": "Make consumers associate themselves with the product. Use images and pictures of celebrities that people want to identify with either before or after the product is purchased. Just look at Victoria’s Secret. Their glamorous models aren’t just showing off lingerie, but suggesting that women can be like them if they just buy the underwear. In these cases, the images do most of the work."}, {"c050": "Show that the product is trustworthy"}, {"38c6": "Trust is a significant component of an advertisement. If people don’t believe what you’re saying about your product, they won’t buy it. Reinforce the ad with the opinions or endorsements of credible people, experts, or reputable organizations. This will boost consumer confidence in the product."}, {"a75a": "For example, celebrity reviews can attract customers and increase sales funnel conversions (“I’ve already tried it, and it really works, so go ahead and try it yourself!”). Supply evidence, facts, research, references, recommendations, and reviews."}, {"a4b8": "This will emphasize the product’s value. The more you include numbers, statistics, and graphs, the more valuable it will appear to consumers."}, {"00ec": "Take advantage of the “herd instinct”"}, {"30ce": "People need to belong to a social group. They come together over common interests or join groups as a status symbol. Marketers can sell products or services by targeting people’s desire to belong to such communities. For instance, marketers promoted Jif peanut butter with the slogan “Choosy Moms Choose Jif”."}, {"bf60": "The people who bought Jif after watching this commercial didn’t buy it because the peanut butter is so amazing. They bought it because they wanted to associate themselves with a group of responsible parents."}, {"c95a": "Talk about the benefits"}, {"e587": "People buy a product when they understand how it will benefit them. For instance, real estate agents buy expensive cars to show potential clients how successful they are. This helps them to close more deals. The main thing is for the ad to get across the idea of a future benefit. This strategy works well for advertising expensive products and services."}, {"7c3c": "Persuade gradually"}, {"07b5": "The biggest challenge is selling products or services to people who have never heard of you or your products. Consumers find out about the product in stages, and their purchase won’t be fast. They go through several stages : unawareness — familiarity — desire to buy — purchase. In the end, these consumers become loyal customers because they understand the product. Create ads that educate consumers at each stage."}, {"6dd7": "In most cases, this won’t be a single ad message, but rather a series of ads that walk people through the stages of getting to know the product and making a purchase."}, {"deb1": "Break the stereotypes"}, {"b301": "Change the customer’s ideas about the product. Switch the focus from one characteristic of the product to something else, or undermine the beliefs that are preventing consumers from making a purchase. Support your words with successful cases. If you are trying to make someone doubt their convictions, don’t do so aggressively."}, {"8d80": "Offer an alternative viewpoint that discretely encourages the buyer to look at the product in a new way. Most importantly, don’t be negative."}, {"338c": "Explore behavior patterns"}, {"9b87": "There are two ways to influence buyer behavior. You can create ads that target the rational component. These ads are most suitable for serious purchases like a house or a car."}, {"e715": "For example, “House with land starting at 490,000 rubles just 77 km from Moscow”. The alternative is ads that play on the emotions. These are for everyday purchases, such as food, clothing, and so on."}, {"9d48": "Use weapons of influence"}, {"dc4a": "Psychologist Robert Cialdini spent three years studying influence for his book, “The Psychology of Persuasion”. As a result, he defined seven powerful principles of persuasion."}, {"200b": "The principle of social proof"}, {"d366": "Show consumers that purchasing an item will make them belong to a specific group of people. (“Many successful entrepreneurs read our magazine — so should you!”) The principle of reciprocity. People usually feel the need to reciprocate when something is done for them. So if they are given a free sample or a gift, they feel obligated to do something in return."}, {"c11d": "The principle of consistency"}, {"4593": "People demonstrate a certain type of behavior by keeping their actions consistent. If someone installs the demo version of a product, then leaves feedback about their experience and points out all the negatives while talking to tech support, they feel that the next logical step is to purchase the product."}, {"5297": "The principle of authority"}, {"79bd": "“19 out of 20 cosmetologists agree that this product is the best way to combat the first signs of aging.”"}, {"257f": "The principle of scarcity"}, {"598e": "If there isn’t enough of it, people must be buying it, which means it must be good. Draw attention to the low supply of a product and limited time left to buy it: “Only 15 TVs left! Just $499 while supplies last.”"}, {"031d": "The principle of personal affinity"}, {"d2e7": "People are more apt to agree with the assertions of someone they like."}, {"f390": "The principle of consensus"}, {"011d": "If you have something in common with your audience, you will inevitably bring them around to your point of view."}, {"9974": "7 sins"}, {"49ce": "This approach takes advantage of traditional human weaknesses: laziness, greed, envy, pride, wrath, sloth and lust."}, {"3d86": "This method is very effective for dating sites if you create a separate ad message targeted at each “vice”. Examples:"}, {"0994": "Laziness: “Guaranteed dates in your city. Search within 3 km of your location. All beautiful women. 30-second signup. Many of our ladies are ready to go out today.”"}, {"2fd8": "Greed: “Prepare to date at least one new woman every week after signing up in this app.”"}, {"ea16": "Envy: “7% of men get 54% of all likes and comments from women. How do they do it? First they sign up on our site.”"}, {"b356": "Pride: “Your ex will hate you when she sees you with these gorgeous women.”"}, {"0bd1": "Wrath: “How could she dare to not reply? Don’t lose hope — keep calm! And sign up on this site to meet girls who will give you a chance.”"}, {"ae95": "Sloth: “Are you embarrassed that you still don’t have a girlfriend? Are you lonely? Sign up on the site.”"}, {"76f7": "Lust: “Are you looking for a good time tonight? A lot of ladies on our site are looking for a guy to spend tonight with.”"}, {"7294": "The market is saturated with products and advertising. To spend the advertiser’s money wisely, analyze your audience first, and use a variety of methods and approaches when creating ads."}, {"db46": "If you don’t know how to do it, just contact Mobio team. We have over 25 affiliate marketers, and designers who will help you."}, {"8203": "To get TH’s new articles, subscribe to our FB bot."}], "name": "2357", "parent": ""}