{"child": "2360_1\t2360_22360_1\t2360_22360_1\t2360_2", "content": "Am I the First Indonesian Guy Who Spends $5 Extra Monthly on Medium? If someone who also Indonesian have been there before, don’t be hesitate to follow me. My simple reflection for being thankful — grateful, for helping my vulnerable journey in life caused of excellent posts here. For certain people, saw a lil bit controversy during membership features. On other side there are also some people praise at. It’s normally. As plus — minus things. There’ll be a pairs of our rational thinking in life right. We just need to appreciate it Since i broke up two years ago, i red many books in how to release your painful moment by let it go what should we’ve been through in life. Then i red a lot about the things i was looking for: growth hacking, life lessons and many posts are excellent here. I was entertained — encouraged enough. I have theee main reasons as my simple reflection why i choose medium membership: I was born from startup environment. I know how they hardly build the product with many concepts of growth hacking Secondly. I appreciate many great writers here, Darius Foroux Thomas Oppong Benjamin P. Hardy and James Clear helps me a lot with their ‘concrete’ story. It works reshaped my perception to be more positive The last one, Encourage myself for having daily habit on writing — reading more without any distraction No matter what, are you subscribers or not. This place is rejuvenation, a place where we must unlearn what we’ve learned in real world, real life. Which full of ambiguity and conservative society thinking. Cheers for those who inspired me a lot :) Egi is a lone-ranger digitalism addict who loves read — explore new things in life. Awarded digital bronze awards when at overseas working time. Currently running local startup business. Spent his rest of spare time by researching — actively on Indonesian Flat Earth Society. ", "title": "Am I the First Indonesian Guy Who Spends $5 Extra Monthly on Medium?", "sentences": [{"09b5": "Am I the First Indonesian Guy Who Spends $5 Extra Monthly on Medium?"}, {"15ac": "If someone who also Indonesian have been there before, don’t be hesitate to follow me."}, {"6683": "My simple reflection for being thankful — grateful, for helping my vulnerable journey in life caused of excellent posts here."}, {"7d37": "For certain people, saw a lil bit controversy during membership features. On other side there are also some people praise at."}, {"5c15": "It’s normally. As plus — minus things. There’ll be a pairs of our rational thinking in life right. We just need to appreciate it"}, {"18de": "Since i broke up two years ago, i red many books in how to release your painful moment by let it go what should we’ve been through in life."}, {"3ea2": "Then i red a lot about the things i was looking for: growth hacking, life lessons and many posts are excellent here."}, {"2b8d": "I was entertained — encouraged enough."}, {"ce72": "I have theee main reasons as my simple reflection why i choose medium membership:"}, {"53d2": "I was born from startup environment. I know how they hardly build the product with many concepts of growth hacking"}, {"bde8": "Secondly."}, {"afc8": "I appreciate many great writers here, Darius Foroux Thomas Oppong Benjamin P. Hardy and James Clear helps me a lot with their ‘concrete’ story. It works reshaped my perception to be more positive"}, {"82d7": "The last one,"}, {"9ed0": "Encourage myself for having daily habit on writing — reading more without any distraction"}, {"ce20": "No matter what, are you subscribers or not. This place is rejuvenation, a place where we must unlearn what we’ve learned in real world, real life. Which full of ambiguity and conservative society thinking."}, {"83dd": "Cheers for those who inspired me a lot :)"}, {"ba3a": "Egi is a lone-ranger digitalism addict who loves read — explore new things in life."}, {"7ac6": "Awarded digital bronze awards when at overseas working time. Currently running local startup business. Spent his rest of spare time by researching — actively on Indonesian Flat Earth Society."}], "name": "2360", "parent": ""}