{"child": "2387_1\t2387_2\t2387_3\t2387_4\t2387_5\t2387_6\t2387_7\t2387_8\t2387_9\t2387_10\t2387_11\t2387_12\t2387_13\t2387_14\t2387_15", "content": "How Google sets goals: OKRs On the day Google’s acquisition of FeedBurner closed in 2007, it was also the first day of a new quarter at Google. My new manager at Google asked me to draft my OKRs for him to review. I had no idea what he was talking about. I’ve now gone through the process of setting my Objectives and Key Results (OKRs) 24 times, and each time I marvel at what an effective mechanism they are for focusing my effort as well as aligning my work with the company’s objectives. Last fall, I led a workshop about OKRs at the Startup Lab, which we’re making public today. John Doerr originally presented OKRs to Google’s leadership in 1999 when Google was less than a year old, and they’ve been in use ever since. In the video, I present a portion of John’s original deck, then lay out how we’ve implemented them at Google over the years. I also shared a few of my OKRs from my time as a Product Manager on Blogger, and answered some questions from the employees at our portfolio companies who were present for the workshop. Though the video goes into more detail, here are a few keys to what make OKRs work at Google: One comment: in talking recently with one portfolio company who’s implemented OKRs, I realized that I should have been more emphatic in pointing out that OKRs are not synonymous with employee evaluations. OKRs are about the company’s goals and how each employee contributes to those goals. Performance evaluations — which are entirely about evaluating how an employee performed in a given period — should be independent from their OKRs. We’ll cover employee evaluations in an upcoming workshop. ", "title": "How Google sets goals: OKRs", "sentences": [{"ead2": "How Google sets goals: OKRs"}, {"bcd9": "On the day Google’s acquisition of FeedBurner closed in 2007, it was also the first day of a new quarter at Google. My new manager at Google asked me to draft my OKRs for him to review. I had no idea what he was talking about."}, {"a9de": "I’ve now gone through the process of setting my Objectives and Key Results (OKRs) 24 times, and each time I marvel at what an effective mechanism they are for focusing my effort as well as aligning my work with the company’s objectives. Last fall, I led a workshop about OKRs at the Startup Lab, which we’re making public today."}, {"d4ef": "John Doerr originally presented OKRs to Google’s leadership in 1999 when Google was less than a year old, and they’ve been in use ever since. In the video, I present a portion of John’s original deck, then lay out how we’ve implemented them at Google over the years. I also shared a few of my OKRs from my time as a Product Manager on Blogger, and answered some questions from the employees at our portfolio companies who were present for the workshop."}, {"076e": "Though the video goes into more detail, here are a few keys to what make OKRs work at Google:"}, {"da0e": "One comment: in talking recently with one portfolio company who’s implemented OKRs, I realized that I should have been more emphatic in pointing out that OKRs are not synonymous with employee evaluations. OKRs are about the company’s goals and how each employee contributes to those goals. Performance evaluations — which are entirely about evaluating how an employee performed in a given period — should be independent from their OKRs. We’ll cover employee evaluations in an upcoming workshop."}], "name": "2387", "parent": ""}