{"name": "239", "parent": "", "content": "6 Things You Can Do Immediately To Design A Better Life Create your day. Design Your Life. ~ Anonymous. If you had your choice, what life would you live? Would you live in a city and work hard to climb the corporate ladder? Would you live as an artist in a coastal enclave? Would you be semi-nomadic, making your way as a digital freelancer — a modern day tradesman of sorts? We have, at least those of us living in a developed country, some degree of freedom about where we live, what we do and how we do it. We may not be able to have everything in our life that we wish for, but we can definitely come closer and closer over time. Optimizing your life requires a set of decisions. Decisions about what you want. Decisions about what you don’t want. Decisions about trade-offs you are willing to make. This post shares a few steps that you can apply to design your optimal life. I’m not trying to tell you what you should do. Instead, I’m sharing the steps that I actually took in my own life over the past few years. I’ve moved closer to a lifestyle that is fulfilling and rewarding for both my wife and I (and our dog Duke). I know that since these steps have worked for me, that they might work for many others. So here they are. 1. Take a Step Back “To fully experience this life as a human being, we all need to connect with our desire to realize something larger than our individual selves.”~ Thich Nhat Hanh Three and a half years ago I held a very well-paying and rewarding job. It was the sort of job that friends and peers would kill for. I was leading a skilled team of professionals at a world-class software company. I was being compensated very well. The work was challenging and stimulating. Everything seemed great from the outside. Yet, I knew that the life I was living was not the life I wanted. While my corporate career was excellent during my 20’s (I started working before I was of drinking age in the USA!), as I moved into my 30’s and got married, I realized that my values shifted. I valued my freedom and free time to a much higher degree. I appreciated contribution much more, that is to say, making a direct impact on people. I cared less about money and extrinsic rewards and far more about my own feelings of creating something worthwhile through my work. A meaningful life was more important a successful life. While I didn’t know what my next steps would be in my career, I knew that I wouldn’t be able to find the answer by staying put. I needed to take a big step away from my world of work to see what the right next step would be. Weekend jaunts wouldn’t cut it. Neither would multi-week adventures suffice (e.g. I had been to India several times, Peru, Ecuador, The Galapagos and all over the USA during my annual travels). For me, taking a step away from work first meant a sabbatical (for a few months) and then a gap year to explore the world (together with my wife). The lesson I learned in all this is that creating space outside of your normal routines and workday is a vital step to building a better lifestyle. If you aren’t able to take an extended break as I did, make use of nights and weekends to shut off your smartphone and explore the world around you. Allow yourself to settle down and tap into your inner wisdom. If you are like me, over time, it will guide you in a better direction. 2. Figure Out Your Money Needs Money creates a huge burden on life, and financial issues are said to be a leading cause of divorce in the USA. Just think about it, if you would make the same amount of money as you currently make doing any job in the world, would you be doing what you are doing right now? If the answer is no, you have a direct sense of the impact money (in particular, concerns over not having enough) has on your life. A crucial step in designing an optimal life is to be clear on how much money you need to afford the lifestyle you wish to have. A key component of this exercise is to clarify the type of lifestyle you want to have. Do you enjoy cooking great food at home or eating at white tablecloth fine dining establishments a few times a week? Do you want to travel in business or first-class seats wherever you go? Do you need one (or two) luxury cars? Is your idea of a great weekend filled with camping and hiking, or is more about staying in nice hotels and seeing the latest plays and musical acts? When I left my corporate job, without a clear idea of what my next income source would be, I made several important and radical changes to my financial situation. I moved out of the gorgeous home that I had purchased a few years prior, renting it to another family, yielding a small monthly income stream. I sold my fancy SUV. I minimized all extraneous expenses to focus on the things that were of the highest value. During a lengthy sabbatical and year of travel, my wife and I acted like we were college students on a tight budget, staying in youth hostels and camping along the way (often for free while in the USA). This form of travel opened our eyes to more affordable locations to live in (at least related to Seattle, WA, USA). We also experienced how much fun we could have while living on less. This is me, on a three-week backpacking adventure during my time away from work. When it came time to figure out what our next careers would be, our lower required monthly expenses made it workable for us to live well on much less than we were making before. If you are looking to design your best life, take the time to create a budget. Get a handle on your monthly cash flow. Examine your expenses to determine which are essential and contributing to your satisfaction, and which are a drain on your time and energy. Ruthlessly cut extraneous spending, while spending freely on the things that bring you deep joy and meaning. Once you know your typical monthly spending rate, you will be more apt to change other aspects of life (e.g. like leaving a well-paying job to do something different) if that is what you want to do. 3. Examine Your Entire Lifestyle When I work with coaching clients, the first conversation we have is what it means for them to live a great life. This might seems like an obvious conversation for a coach to have, but it isn’t. Most of my clients are successful professionals, hiring me to find higher performance in their careers (or grow their businesses or find better jobs). When I ask them to paint me a picture of their ideal life, in vivid detail, it throws them for a loop. They expect our conversations to stick to career and productivity related topics. After a few moments, however, it all makes sense. After all, a great job in the midst of a terrible life is not a good way to live at all. It’s crucial to design the life you want in the broadest possible terms at the start — spanning career, health, relationships, hobbies, etc. Tools like the Wheel of Life help, but it’s through conversations with a trusted partner (or coach) that unlock the big picture. A sample “Wheel of Life” In my own journey, it wasn’t until I reflected on what I wanted for my life (beyond my career) that I was able to start moving forward. I saw how my home environment, sunny skies, and daily exercise were crucial to my living a happy life. I also noticed that contributing to society and travel were vital. A career was also important, but not in the way I previous defined it. Instead of a career, I needed a vocation. 4. Find Your Vocation “Everyone has his own specific vocation or mission in life; everyone must carry out a concrete assignment that demands fulfillment. Therein he cannot be replaced, nor can his life be repeated, thus, everyone’s task is unique as his specific opportunity to implement it.” ~ Viktor E. Frankl My belief is that a job is important for everyone, even if money is no object. The best careers have a quality to them that transcends the paycheck, career ladder progression or recognition that come from a job well done. The best careers are a more than a job, they are a vocation. A vocation is a calling. It is the difference between compelled to do something due to intrinsic motivation and doing something out of force. When I was wrapping up my extended travels, I deliberated for a long time over what to do. Do I go back to my old company? Do I stay in my field (technology product management), and join a new business? Do I start my own? Do I do something entirely different? I sat with these questions for a long time. Towards the end of my travels, I realized that even more intriguing than building technology products was the challenge of building great lives and careers. Yet, I had an identity crisis. I never saw myself as a coach and never thought I could pay the bills as one, and as such never gave it much thought. But, I kept ruminating on the idea of being a coach. After all, I studied psychology and personal development in my free time (and had done so as a kid). I was an avid and long-term devotee of Advaita Vedanta (the oldest personal development system in the world). I had worked with coaches in the past and knew the value they could offer. I also had noticed that for years my friends and co-workers would often come to me on their own for “coaching” on their career issues (pro-bono of course). Surprisingly, after leaving my corporate job, the number of people reaching out to me to discuss various career issues increased! Eventually, I realized the answer to the question of “What should I do for work?”. I’m now and have been for several years, an Executive and Career Coach. My current career is less of a job and more of a vocation — a calling. I work for myself. It’s enjoyable enough that I would do it for free (and sometimes do if there is a specific need). It’s challenging and fulfilling. It generates enough income for my newly optimized lifestyle. What would you do for work if you could have your way? Here’s a simple framework to help you figure that out. 5. Choose Your Ideal Environment I don’t live here, but would love to visit! Our environment has a massive impact on our lives. Exposure to people can help the exchange of certain types of ideas (or not). Proximity to recreation activities can make a big difference in the daily happiness you experience. A major part of my lifestyle design was picking a location that had the qualities that mattered most to my wife and I. This meant a few things: ample sunshine, proximity to great trails for running and hiking, lots of Nordic skiing routes and great snow quality for winter sports, an easy drive to a major airport, reasonable housing prices, a large city within a days drive, etc. Once we were clear on the type of environment we wanted, we explored a variety of cities — including Bend, OR, Flagstaff, AZ, Boulder, CO, Tahoe, CA, San Francisco Bay Area towns, Asheville, NC — eventually choosing a western suburb of Denver, CO at the foothills of the Rocky Mountains (not Boulder!). What is your perfect environment? What are the qualities of a city or town that matter most to you? How can you move towards that ideal (either in one fell swoop or in baby steps)? 6. Craft Your Daily Routine “One of the huge imbalances in life is the disparity between your daily existence, with its routines and habits, and the dream you have within yourself of some extraordinarily satisfying way of living.” ~ Wayne Dyer Let me walk you through my typical day (Monday — Thursday): 5:00 AM Wake Up5:20 AM Complete meditation5:30 AM Drink coffee, read and write7:30 AM Make smoothie for breakfast7:45 AM Head to my home office to prepare for day8:00 AM 2–4 coaching calls with current/potential clientsMid-Morning 3–5 mile run Noon LunchAfternoon Have 2–3 coaching calls, administrative tasks, play withe Duke!5:00 PM Dinner, reading, house chores, occasional Netflix binge!8:00 PM Head to bed, for more reading9:00 PM Sleep To me, my current routine is ideal. On Fridays and during the weekends, I might wake up a bit later and don’t have client calls. If the weather is good, I’ll spend time outside on an adventure (Nordic skiing or hiking). If the weather is bad, I’ll head to a yoga class. I will read a lot more. I might see a movie. When designing your optimal life, it’s easy to spend too much time thinking about the big picture. Where to live. The ideal career. Who to spend life with. In the midst of these big picture thoughts, spend the time to think about your perfect day. It’s the daily memories that shape yourself in a profound way over the long term. If you don’t have control over your entire day, you can start with the small parts that you can impact. For example, wake up earlier and enjoy the productivity, and creative benefits many early risers attest to. Make time for your favorite daily exercise routine. Set boundaries at work to get home at specific times for a family meal. Conclusion These six steps outlined in this post are clear for me as I look backward over my life during the past several years. Unfortunately, when I was going through them, the process was opaque and at times gut-wrenching. Hindsight has brought the clarity. In sharing these with you, I hope it motivates you to ask some important questions about the life you want to live. No matter your current situation, how can you take even small steps forward toward what you desire? Perhaps like me, you will take radical action and shake everything up. Perhaps like many others, you will decide to move slowly and surely closer to the life you want, and away from the life you don’t, one small step at a time. Either way, you won’t regret it. Thanks for reading! :) If you enjoyed it, hit that heart button below. It would mean a lot to me and it helps other people see the story. Sign up to get my best career and personal development tips at http://RaviRaman.com ", "title": "6 Things You Can Do Immediately To Design A Better Life", "sentences": [{"5dd7": "6 Things You Can Do Immediately To Design A Better Life"}, {"e9aa": "Create your day. Design Your Life. ~ Anonymous."}, {"7d62": "If you had your choice, what life would you live? Would you live in a city and work hard to climb the corporate ladder? Would you live as an artist in a coastal enclave? Would you be semi-nomadic, making your way as a digital freelancer — a modern day tradesman of sorts?"}, {"93cc": "We have, at least those of us living in a developed country, some degree of freedom about where we live, what we do and how we do it. We may not be able to have everything in our life that we wish for, but we can definitely come closer and closer over time."}, {"fe8b": "Optimizing your life requires a set of decisions. Decisions about what you want. Decisions about what you don’t want. Decisions about trade-offs you are willing to make."}, {"201f": "This post shares a few steps that you can apply to design your optimal life. I’m not trying to tell you what you should do. Instead, I’m sharing the steps that I actually took in my own life over the past few years. I’ve moved closer to a lifestyle that is fulfilling and rewarding for both my wife and I (and our dog Duke)."}, {"962b": "I know that since these steps have worked for me, that they might work for many others."}, {"95ff": "So here they are."}, {"f020": "1. Take a Step Back"}, {"ca3e": "“To fully experience this life as a human being, we all need to connect with our desire to realize something larger than our individual selves.”~ Thich Nhat Hanh"}, {"d8d6": "Three and a half years ago I held a very well-paying and rewarding job. It was the sort of job that friends and peers would kill for. I was leading a skilled team of professionals at a world-class software company. I was being compensated very well. The work was challenging and stimulating. Everything seemed great from the outside."}, {"0e8c": "Yet, I knew that the life I was living was not the life I wanted. While my corporate career was excellent during my 20’s (I started working before I was of drinking age in the USA!), as I moved into my 30’s and got married, I realized that my values shifted."}, {"54a6": "I valued my freedom and free time to a much higher degree. I appreciated contribution much more, that is to say, making a direct impact on people. I cared less about money and extrinsic rewards and far more about my own feelings of creating something worthwhile through my work."}, {"82f5": "A meaningful life was more important a successful life."}, {"d0f6": "While I didn’t know what my next steps would be in my career, I knew that I wouldn’t be able to find the answer by staying put. I needed to take a big step away from my world of work to see what the right next step would be."}, {"f630": "Weekend jaunts wouldn’t cut it. Neither would multi-week adventures suffice (e.g. I had been to India several times, Peru, Ecuador, The Galapagos and all over the USA during my annual travels). For me, taking a step away from work first meant a sabbatical (for a few months) and then a gap year to explore the world (together with my wife)."}, {"99b8": "The lesson I learned in all this is that creating space outside of your normal routines and workday is a vital step to building a better lifestyle. If you aren’t able to take an extended break as I did, make use of nights and weekends to shut off your smartphone and explore the world around you."}, {"8fa0": "Allow yourself to settle down and tap into your inner wisdom. If you are like me, over time, it will guide you in a better direction."}, {"5a18": "2. Figure Out Your Money Needs"}, {"7b0b": "Money creates a huge burden on life, and financial issues are said to be a leading cause of divorce in the USA. Just think about it, if you would make the same amount of money as you currently make doing any job in the world, would you be doing what you are doing right now?"}, {"53cc": "If the answer is no, you have a direct sense of the impact money (in particular, concerns over not having enough) has on your life."}, {"fa24": "A crucial step in designing an optimal life is to be clear on how much money you need to afford the lifestyle you wish to have. A key component of this exercise is to clarify the type of lifestyle you want to have."}, {"02f8": "Do you enjoy cooking great food at home or eating at white tablecloth fine dining establishments a few times a week? Do you want to travel in business or first-class seats wherever you go? Do you need one (or two) luxury cars? Is your idea of a great weekend filled with camping and hiking, or is more about staying in nice hotels and seeing the latest plays and musical acts?"}, {"b82f": "When I left my corporate job, without a clear idea of what my next income source would be, I made several important and radical changes to my financial situation. I moved out of the gorgeous home that I had purchased a few years prior, renting it to another family, yielding a small monthly income stream. I sold my fancy SUV. I minimized all extraneous expenses to focus on the things that were of the highest value."}, {"cc85": "During a lengthy sabbatical and year of travel, my wife and I acted like we were college students on a tight budget, staying in youth hostels and camping along the way (often for free while in the USA). This form of travel opened our eyes to more affordable locations to live in (at least related to Seattle, WA, USA). We also experienced how much fun we could have while living on less."}, {"c8ce": "This is me, on a three-week backpacking adventure during my time away from work."}, {"def4": "When it came time to figure out what our next careers would be, our lower required monthly expenses made it workable for us to live well on much less than we were making before."}, {"f44d": "If you are looking to design your best life, take the time to create a budget. Get a handle on your monthly cash flow. Examine your expenses to determine which are essential and contributing to your satisfaction, and which are a drain on your time and energy. Ruthlessly cut extraneous spending, while spending freely on the things that bring you deep joy and meaning."}, {"62e2": "Once you know your typical monthly spending rate, you will be more apt to change other aspects of life (e.g. like leaving a well-paying job to do something different) if that is what you want to do."}, {"197b": "3. Examine Your Entire Lifestyle"}, {"b4d6": "When I work with coaching clients, the first conversation we have is what it means for them to live a great life. This might seems like an obvious conversation for a coach to have, but it isn’t."}, {"7a21": "Most of my clients are successful professionals, hiring me to find higher performance in their careers (or grow their businesses or find better jobs). When I ask them to paint me a picture of their ideal life, in vivid detail, it throws them for a loop. They expect our conversations to stick to career and productivity related topics."}, {"7572": "After a few moments, however, it all makes sense. After all, a great job in the midst of a terrible life is not a good way to live at all. It’s crucial to design the life you want in the broadest possible terms at the start — spanning career, health, relationships, hobbies, etc. Tools like the Wheel of Life help, but it’s through conversations with a trusted partner (or coach) that unlock the big picture."}, {"8888": "A sample “Wheel of Life”"}, {"ee08": "In my own journey, it wasn’t until I reflected on what I wanted for my life (beyond my career) that I was able to start moving forward. I saw how my home environment, sunny skies, and daily exercise were crucial to my living a happy life. I also noticed that contributing to society and travel were vital. A career was also important, but not in the way I previous defined it."}, {"6ceb": "Instead of a career, I needed a vocation."}, {"aa66": "4. Find Your Vocation"}, {"a704": "“Everyone has his own specific vocation or mission in life; everyone must carry out a concrete assignment that demands fulfillment. Therein he cannot be replaced, nor can his life be repeated, thus, everyone’s task is unique as his specific opportunity to implement it.” ~ Viktor E. Frankl"}, {"14c9": "My belief is that a job is important for everyone, even if money is no object. The best careers have a quality to them that transcends the paycheck, career ladder progression or recognition that come from a job well done. The best careers are a more than a job, they are a vocation."}, {"5bdd": "A vocation is a calling. It is the difference between compelled to do something due to intrinsic motivation and doing something out of force."}, {"6ce1": "When I was wrapping up my extended travels, I deliberated for a long time over what to do. Do I go back to my old company? Do I stay in my field (technology product management), and join a new business? Do I start my own? Do I do something entirely different?"}, {"cd1f": "I sat with these questions for a long time. Towards the end of my travels, I realized that even more intriguing than building technology products was the challenge of building great lives and careers. Yet, I had an identity crisis. I never saw myself as a coach and never thought I could pay the bills as one, and as such never gave it much thought."}, {"72c2": "But, I kept ruminating on the idea of being a coach. After all, I studied psychology and personal development in my free time (and had done so as a kid). I was an avid and long-term devotee of Advaita Vedanta (the oldest personal development system in the world). I had worked with coaches in the past and knew the value they could offer."}, {"a002": "I also had noticed that for years my friends and co-workers would often come to me on their own for “coaching” on their career issues (pro-bono of course). Surprisingly, after leaving my corporate job, the number of people reaching out to me to discuss various career issues increased! Eventually, I realized the answer to the question of “What should I do for work?”."}, {"337a": "I’m now and have been for several years, an Executive and Career Coach."}, {"b388": "My current career is less of a job and more of a vocation — a calling. I work for myself. It’s enjoyable enough that I would do it for free (and sometimes do if there is a specific need). It’s challenging and fulfilling. It generates enough income for my newly optimized lifestyle."}, {"53e1": "What would you do for work if you could have your way? Here’s a simple framework to help you figure that out."}, {"df4d": "5. Choose Your Ideal Environment"}, {"a751": "I don’t live here, but would love to visit!"}, {"dfe6": "Our environment has a massive impact on our lives. Exposure to people can help the exchange of certain types of ideas (or not). Proximity to recreation activities can make a big difference in the daily happiness you experience."}, {"7ab4": "A major part of my lifestyle design was picking a location that had the qualities that mattered most to my wife and I. This meant a few things: ample sunshine, proximity to great trails for running and hiking, lots of Nordic skiing routes and great snow quality for winter sports, an easy drive to a major airport, reasonable housing prices, a large city within a days drive, etc."}, {"e181": "Once we were clear on the type of environment we wanted, we explored a variety of cities — including Bend, OR, Flagstaff, AZ, Boulder, CO, Tahoe, CA, San Francisco Bay Area towns, Asheville, NC — eventually choosing a western suburb of Denver, CO at the foothills of the Rocky Mountains (not Boulder!)."}, {"079f": "What is your perfect environment? What are the qualities of a city or town that matter most to you? How can you move towards that ideal (either in one fell swoop or in baby steps)?"}, {"a63f": "6. Craft Your Daily Routine"}, {"c010": "“One of the huge imbalances in life is the disparity between your daily existence, with its routines and habits, and the dream you have within yourself of some extraordinarily satisfying way of living.” ~ Wayne Dyer"}, {"2302": "Let me walk you through my typical day (Monday — Thursday):"}, {"afd8": "5:00 AM Wake Up5:20 AM Complete meditation5:30 AM Drink coffee, read and write7:30 AM Make smoothie for breakfast7:45 AM Head to my home office to prepare for day8:00 AM 2–4 coaching calls with current/potential clientsMid-Morning 3–5 mile run Noon LunchAfternoon Have 2–3 coaching calls, administrative tasks, play withe Duke!5:00 PM Dinner, reading, house chores, occasional Netflix binge!8:00 PM Head to bed, for more reading9:00 PM Sleep"}, {"a240": "To me, my current routine is ideal."}, {"5955": "On Fridays and during the weekends, I might wake up a bit later and don’t have client calls. If the weather is good, I’ll spend time outside on an adventure (Nordic skiing or hiking). If the weather is bad, I’ll head to a yoga class. I will read a lot more. I might see a movie."}, {"e90b": "When designing your optimal life, it’s easy to spend too much time thinking about the big picture. Where to live. The ideal career. Who to spend life with. In the midst of these big picture thoughts, spend the time to think about your perfect day. It’s the daily memories that shape yourself in a profound way over the long term."}, {"f753": "If you don’t have control over your entire day, you can start with the small parts that you can impact. For example, wake up earlier and enjoy the productivity, and creative benefits many early risers attest to. Make time for your favorite daily exercise routine. Set boundaries at work to get home at specific times for a family meal."}, {"b4dd": "Conclusion"}, {"c8cf": "These six steps outlined in this post are clear for me as I look backward over my life during the past several years. Unfortunately, when I was going through them, the process was opaque and at times gut-wrenching. Hindsight has brought the clarity. In sharing these with you, I hope it motivates you to ask some important questions about the life you want to live."}, {"c8df": "No matter your current situation, how can you take even small steps forward toward what you desire? Perhaps like me, you will take radical action and shake everything up. Perhaps like many others, you will decide to move slowly and surely closer to the life you want, and away from the life you don’t, one small step at a time."}, {"e011": "Either way, you won’t regret it."}, {"776e": "Thanks for reading! :) If you enjoyed it, hit that heart button below. It would mean a lot to me and it helps other people see the story. Sign up to get my best career and personal development tips at http://RaviRaman.com"}], "child": "239_1\t239_2\t239_3\t239_4\t239_5\t239_6"}