{"child": "2398_12398_1", "content": "Pixar Homepage Redesign A few months ago, the Brave team gathered on one of our weekly internal days to brainstorm exciting new projects that we wish we could work on. What emerged was this idea to search for major brands with unusually minor websites and give them a homepage makeover in under 24 hours. Challenge accepted. Over the course of several weeks, our team began finding more and more eligible brands for this digital salon trip. The first of which was one of our feel-good favorites, Pixar. As a global content creator, Pixar’s contributions to design and entertainment are nearly second to none. Naturally, we felt that their digital presence should speak more definitively to that truth. After a highly truncated strategy and wireframing session, we landed on a vibrant, character and content driven web experience that not only reminds audiences of Pixar’s brilliant legacy but also their forward facing innovation: The close up you know you wanted: Disclaimer: no stock vectors were used, all illustrations were hand-made at Brave. And no, Pixar is not our client — all for fun :) Next Up So far, this spec work experiment has been incredibly rewarding for our entire team. In fact, we plan to continue sharing the results of our makeover madness over the coming weeks. Have a suggestion for a major brand you’d like to see undergo a Brave overhaul? Hit us up in the comments and we’ll play your favorite tune, Fonzie-style. Originally published at notes.bravepeople.co on July 17, 2016. ", "title": "Pixar Homepage Redesign", "sentences": [{"a9cd": "Pixar Homepage Redesign"}, {"3860": "A few months ago, the Brave team gathered on one of our weekly internal days to brainstorm exciting new projects that we wish we could work on. What emerged was this idea to search for major brands with unusually minor websites and give them a homepage makeover in under 24 hours."}, {"f760": "Challenge accepted."}, {"972c": "Over the course of several weeks, our team began finding more and more eligible brands for this digital salon trip. The first of which was one of our feel-good favorites, Pixar."}, {"7ec6": "As a global content creator, Pixar’s contributions to design and entertainment are nearly second to none. Naturally, we felt that their digital presence should speak more definitively to that truth. After a highly truncated strategy and wireframing session, we landed on a vibrant, character and content driven web experience that not only reminds audiences of Pixar’s brilliant legacy but also their forward facing innovation:"}, {"b525": "The close up you know you wanted:"}, {"0ef8": "Disclaimer: no stock vectors were used, all illustrations were hand-made at Brave. And no, Pixar is not our client — all for fun :)"}, {"1e8f": "Next Up"}, {"5c7c": "So far, this spec work experiment has been incredibly rewarding for our entire team. In fact, we plan to continue sharing the results of our makeover madness over the coming weeks. Have a suggestion for a major brand you’d like to see undergo a Brave overhaul? Hit us up in the comments and we’ll play your favorite tune, Fonzie-style."}, {"0e7c": "Originally published at notes.bravepeople.co on July 17, 2016."}], "name": "2398", "parent": ""}