{"child": "2403_12403_1", "content": "Design Inc. Case Study: Redkix by Leigh Taylor An ongoing showcase of projects from the Design Inc. platform Could you share about your experience using Design Inc.? I’ve found Design Inc. to be a great connector to some amazing clients. Quick and easy to set up a beautiful portfolio and establish a ballpark price around core design tasks. In a couple of hours I had a new marketing channel that gives potential clients a lot of reassurance in connecting with me for work. Expectations around type of work, scope, skills, price point and availability are all answered before they get in touch. Simply put, it takes the hassle out of the hustle. Describe the project needs and/or scope? The primary goal for Redkix was to establish high quality design and design thinking as one of the key pillars within their culture and business. Beyond the strategic goals, the more tactical approach was to have a fresh look at the business holistically and reimagine the brand inline with their learned vision, values and goals. With a coherent direction set across both marketing and product. The breakdown of the project looked like this… Please describe a little bit about your process and iteration through the design/creation process. The nuts and bolts of the process I communicate with client is here: Fidelity focused design. This is not a prescriptive process but a guide to educate the team when, where and what type of questions to ask at each step. While directing the feedback to streamline time spent talking so more time can be spent doing. It is usually broken down in 8/9 steps. A small addition worth mentioning. At every stage the first I do is identify people within the team that know more about me at any particular part or step. The whole heartedly allow them to actively filter out options for me. The notion of share often and early because if I can have a conversation for 10 minutes that saves 4 hours R&D, I am absolutely going to throw myself at them. This process is more of a collaborative effort in optimizing communication and expectations. If you want my personalized approach I wrote about it here: The Search for Curves in a Rectangle World. Feel free to discuss through some of the challenges and success of the design process. The main challenges were establishing a clear direction early and managing time due to such a tight deadline. Six weeks were agreed, in order to get a brand identity, new website design and direction on the product — it was a lot of ground to cover and one that I knew would be more difficult doing alone. My primary focus was to establish a team that, at short notice, could band together and tackle the milestones with energy and optimism. Fortunately, that help came via Rosie Manning and Nick Jones. Rosie helped massively with contributing to the brand direction and production. Nick came in a little later and transitioned the brand work into an amazing web design and experience. I have worked with both a lot in the past and, first and foremost, the amount of confidence they give me in delivering the highest quality work for client is unrivaled, in my experience. Also, David Malpass was point man at Redkix and his understanding, support and responsiveness throughout the project was admirable. The brand wouldn’t have been as good without these people. View the Redkix site here. Download for Mac, Windows, iOS and Android Huge thanks to Leigh for sharing this project and all the amazing work & process. You can follow him on Twitter, Instagram, Dribbble and Behance. If you need help on your next project, add your request to Design Inc.If you are a designer and want to Apply, we would love to see your work. ", "title": "Design Inc. Case Study: Redkix by Leigh Taylor", "sentences": [{"a1b2": "Design Inc. Case Study: Redkix by Leigh Taylor"}, {"dc17": "An ongoing showcase of projects from the Design Inc. platform"}, {"8e9b": "Could you share about your experience using Design Inc.?"}, {"e1de": "I’ve found Design Inc. to be a great connector to some amazing clients. Quick and easy to set up a beautiful portfolio and establish a ballpark price around core design tasks. In a couple of hours I had a new marketing channel that gives potential clients a lot of reassurance in connecting with me for work. Expectations around type of work, scope, skills, price point and availability are all answered before they get in touch. Simply put, it takes the hassle out of the hustle."}, {"5b76": "Describe the project needs and/or scope?"}, {"7378": "The primary goal for Redkix was to establish high quality design and design thinking as one of the key pillars within their culture and business."}, {"23e5": "Beyond the strategic goals, the more tactical approach was to have a fresh look at the business holistically and reimagine the brand inline with their learned vision, values and goals. With a coherent direction set across both marketing and product."}, {"996d": "The breakdown of the project looked like this…"}, {"9f35": "Please describe a little bit about your process and iteration through the design/creation process."}, {"ea9e": "The nuts and bolts of the process I communicate with client is here: Fidelity focused design. This is not a prescriptive process but a guide to educate the team when, where and what type of questions to ask at each step. While directing the feedback to streamline time spent talking so more time can be spent doing."}, {"b8cb": "It is usually broken down in 8/9 steps."}, {"56f6": "A small addition worth mentioning. At every stage the first I do is identify people within the team that know more about me at any particular part or step. The whole heartedly allow them to actively filter out options for me. The notion of share often and early because if I can have a conversation for 10 minutes that saves 4 hours R&D, I am absolutely going to throw myself at them."}, {"90a8": "This process is more of a collaborative effort in optimizing communication and expectations. If you want my personalized approach I wrote about it here: The Search for Curves in a Rectangle World."}, {"ffb7": "Feel free to discuss through some of the challenges and success of the design process."}, {"29e2": "The main challenges were establishing a clear direction early and managing time due to such a tight deadline. Six weeks were agreed, in order to get a brand identity, new website design and direction on the product — it was a lot of ground to cover and one that I knew would be more difficult doing alone. My primary focus was to establish a team that, at short notice, could band together and tackle the milestones with energy and optimism. Fortunately, that help came via Rosie Manning and Nick Jones."}, {"0a40": "Rosie helped massively with contributing to the brand direction and production. Nick came in a little later and transitioned the brand work into an amazing web design and experience. I have worked with both a lot in the past and, first and foremost, the amount of confidence they give me in delivering the highest quality work for client is unrivaled, in my experience. Also, David Malpass was point man at Redkix and his understanding, support and responsiveness throughout the project was admirable. The brand wouldn’t have been as good without these people."}, {"b360": "View the Redkix site here. Download for Mac, Windows, iOS and Android"}, {"9058": "Huge thanks to Leigh for sharing this project and all the amazing work & process. You can follow him on Twitter, Instagram, Dribbble and Behance."}, {"51a2": "If you need help on your next project, add your request to Design Inc.If you are a designer and want to Apply, we would love to see your work."}], "name": "2403", "parent": ""}