{"child": "2404_1\t2404_2\t2404_3\t2404_4\t2404_5\t2404_6\t2404_7\t2404_82404_1\t2404_2\t2404_3\t2404_4\t2404_5\t2404_6\t2404_7\t2404_8", "content": "F-Shaped Pattern for Reading Content by Nick Babich This article will walk you through the principles of the F-Layout, why it works, and how you can create your own. What is the F-Pattern and how it works? The F-Pattern describes the most common user eye-scanning patterns when it comes to blocks of content. F for fast. That’s how users read your content. In a few seconds, their eyes move at amazing speeds across your website\u0092s page. The pattern was popularized by NNGroup eyetracking study which recorded more than 200 users looked at thousands of web pages and found that users’ main reading behavior was fairly consistent across many different sites and tasks. This reading pattern looked somewhat like an F and has the following three components: Our eyes are trained to start at the top-left corner, scan horizontally, then drop down to the next line and do the same until we find something of interest. The NNGroup demonstrates how eye-tracking studies revealed that users (in left-to-right reading cultures) typically scan heavy blocks of content in a pattern that looks like the letter F or E. The areas where users looked the most are colored red; the yellow areas indicate fewer views, followed by the least-viewed blue areas. Gray areas didn’t attract any fixations. Obviously, users’ scan patterns are not always comprised of exactly three parts. When the reader finds something they like, they begin reading normally, forming horizontal lines. Why should I use it? F-shaped pattern will help you create a design with good visual hierarchy, a design that people can scan easily. F-shaped layout feels comfortable for the most western readers, because they have been reading top to bottom, left to right for their entire lives. When should I use it? The F-pattern is the go-to layout for text-heavy websites like blogs and news sites. If there is a lot of content — especially text — users will respond better with the layout that designed according to the natural scanning format. CNN uses the F-Shapen pattern How to use F-Shapen pattern F-Layout literally gives the designer more control over what gets seen. Prioritize your content Before arranging the elements on your page, prioritize the most and least important ones. Once you know what you want your users to see, you can simply place them in the pattern’s ‘hot spots’ for the right interactions. Set initial expectations The first two paragraphs are the most important. Place the most important content near to the top of the page as possible in an attempt to communicate the site’s (or page) purpose quickly. The user will usually read horizontally across the header, so here’s a good place for a navigation bar. The most important content on this page can be seen in a few seconds. Image credits: tutsplus Design for scanning, not reading When applying the pattern think scanners and place content these scanners would most likely be interested in along the F: Utilize the sidebar Sidebar exists to get users involved in a deeper level, so use it to drive user engagement: Medium placing a sub-navigation in sidebar. Avoid boring layouts The main drawback to this F-shapen layout is its predisposition to monotony. It’s easy to bore your users with repetitive and similar content in rows. You certainly don’t benefit from a bored user if they begin to dull everything out, so add one “awkward” element within the scanning area to keep the user engaged. Image credit: tutsplus This technique of “breaking the expectations” of the layout can be useful when you have really long vertical spans of content that feel dull or boring once you scroll past the first couple sections. Conclusion F-shapen pattern simply follows the common trends of the human eye so that you can optimize the structure of your layout. But you don’t need to follow it rigidly — it’s a guideline, not a template. Thank you! Follow UX Planet: Twitter | Facebook Originally published at babich.biz ", "title": "F-Shaped Pattern for Reading Content", "sentences": [{"b2ae": "F-Shaped Pattern for Reading Content"}, {"cf04": "by Nick Babich"}, {"f011": "This article will walk you through the principles of the F-Layout, why it works, and how you can create your own."}, {"4a50": "What is the F-Pattern and how it works?"}, {"2f5c": "The F-Pattern describes the most common user eye-scanning patterns when it comes to blocks of content. F for fast. That’s how users read your content. In a few seconds, their eyes move at amazing speeds across your website\u0092s page."}, {"07e9": "The pattern was popularized by NNGroup eyetracking study which recorded more than 200 users looked at thousands of web pages and found that users’ main reading behavior was fairly consistent across many different sites and tasks. This reading pattern looked somewhat like an F and has the following three components:"}, {"3d87": "Our eyes are trained to start at the top-left corner, scan horizontally, then drop down to the next line and do the same until we find something of interest."}, {"ce50": "The NNGroup demonstrates how eye-tracking studies revealed that users (in left-to-right reading cultures) typically scan heavy blocks of content in a pattern that looks like the letter F or E. The areas where users looked the most are colored red; the yellow areas indicate fewer views, followed by the least-viewed blue areas. Gray areas didn’t attract any fixations."}, {"621b": "Obviously, users’ scan patterns are not always comprised of exactly three parts. When the reader finds something they like, they begin reading normally, forming horizontal lines."}, {"a9c2": "Why should I use it?"}, {"5252": "F-shaped pattern will help you create a design with good visual hierarchy, a design that people can scan easily. F-shaped layout feels comfortable for the most western readers, because they have been reading top to bottom, left to right for their entire lives."}, {"5d3b": "When should I use it?"}, {"da60": "The F-pattern is the go-to layout for text-heavy websites like blogs and news sites. If there is a lot of content — especially text — users will respond better with the layout that designed according to the natural scanning format."}, {"f35b": "CNN uses the F-Shapen pattern"}, {"27ca": "How to use F-Shapen pattern"}, {"70e7": "F-Layout literally gives the designer more control over what gets seen."}, {"1270": "Prioritize your content"}, {"cd13": "Before arranging the elements on your page, prioritize the most and least important ones. Once you know what you want your users to see, you can simply place them in the pattern’s ‘hot spots’ for the right interactions."}, {"efc4": "Set initial expectations"}, {"45a9": "The first two paragraphs are the most important. Place the most important content near to the top of the page as possible in an attempt to communicate the site’s (or page) purpose quickly. The user will usually read horizontally across the header, so here’s a good place for a navigation bar."}, {"e9d8": "The most important content on this page can be seen in a few seconds. Image credits: tutsplus"}, {"8be8": "Design for scanning, not reading"}, {"e603": "When applying the pattern think scanners and place content these scanners would most likely be interested in along the F:"}, {"2689": "Utilize the sidebar"}, {"6776": "Sidebar exists to get users involved in a deeper level, so use it to drive user engagement:"}, {"3879": "Medium placing a sub-navigation in sidebar."}, {"c759": "Avoid boring layouts"}, {"e299": "The main drawback to this F-shapen layout is its predisposition to monotony. It’s easy to bore your users with repetitive and similar content in rows. You certainly don’t benefit from a bored user if they begin to dull everything out, so add one “awkward” element within the scanning area to keep the user engaged."}, {"534b": "Image credit: tutsplus"}, {"4add": "This technique of “breaking the expectations” of the layout can be useful when you have really long vertical spans of content that feel dull or boring once you scroll past the first couple sections."}, {"2b09": "Conclusion"}, {"8beb": "F-shapen pattern simply follows the common trends of the human eye so that you can optimize the structure of your layout. But you don’t need to follow it rigidly — it’s a guideline, not a template."}, {"087d": "Thank you!"}, {"07a6": "Follow UX Planet: Twitter | Facebook"}, {"aed5": "Originally published at babich.biz"}], "name": "2404", "parent": ""}