{"child": "2407_1\t2407_2\t2407_3\t2407_4\t2407_5\t2407_6\t2407_72407_1\t2407_2\t2407_3\t2407_4\t2407_5\t2407_6\t2407_7", "content": "Best Practices for Search Results by Nick Babich Search is like a conversation between the user and system: the user expresses their information need as a query, and the system expresses its response as a set of results. The results page is a crucial piece of the search experience: it presents an opportunity to engage a dialogue that guides users’ information needs. In this article I would like to share 10 practices that will help you improve the search results UX. 1. Don’t erase users’ query after they hit Search button Keep the original text. Query reformulation is a critical step in many information journeys. If users don’t find what they’re looking for then they might want to search again using a slightly modified query. To make it easier for them, leave the initial search term in the search box so they don’t have to re-type the entire query again. 2. Provide accurate and relevant results First results page is golden. The search results page is the prime focus of the search experience, and can make or break a site’s conversion rates. Users typically make very quick judgments about a website’s value based on the quality of one or two sets of search results. It’s clearly important to return accurate results to users, otherwise they won’t trust the search tool. It is thus essential that your search prioritize results in a useful way and that all the most important hits appear on the first page. 3. Use effective autosuggest Ineffective autosuggestions deliver a poor search experience. Ensure that autosuggest is useful. Some helpful functions include recognition of root words, predictive text and suggestions while the user enters text. They help speed up the search process and keep users on-task toward conversion. Image credits: ThinkWithGoogle 4. Correct typos Typing is error prone. If a user mistypes a search term and you’re able to detect this, you could show them results for the guessed and ‘corrected’ search term instead. This avoids the frustration that could be caused by returning no results and forcing the user to enter the search term again. There’s no support for query reformulation on the Apple store zero results page Asos does a good job of displaying alternative results when a typo occurs without offending the user. It has a subtle messaging like ‘we also searched for Overcoats’ with the original search term of ‘Overcoatt’ 5. Show the number of search results Show the number of search items available, so that users can make a decision on how long they want to spend looking through results. The number of matching results helps the user make more informed query reformulations. 6. Keep recent user’s search queries Even when users are familiar with the search feature, search requires them to recall information from their memory. To come up with a meaningful query, a user needs to think about attributes that are relevant for his goal and incorporate them in the query. When designing a search experience you should keep in mind a basic usability rule: Respect the users effort You site should store all recent searches, in order to provide this data to the user the next time they conduct a search. Recent searches benefit the user in saving them time and effort in searching for the same item again. Tip: Present less than 10 items (and without a scroll bar) so the information doesn’t become overwhelming. 7. Choose proper page layout One of the challenges of displaying search results is that different types of content require different layouts. Two basic layouts for content presentation are list view and grid view. A rule of thumb: Details in lists, pictures in grids Let’s examine this rule in cotext of product page. Product’s specifics is very important moment. For products like appliances where details like model numbers, ratings and dimensions are major factors in the selection process — the list view makes most sense. List view is better suited to a detail-oriented layout A grid view is a good option for apps with products that require less product information or for similar products. Products like apparel, where less text-based product information needs to be considered when choosing between items and you make your decision by the appearance of the product. For this type of products users care about the visual distinctions between items, and would rather scroll through a single long page than repeatedly switch between the list page and product-detail pages. Grid view is better suited to a visually-oriented layout Tips: Allow users to change the layout by offering a range of views. 8. Show search progress Ideally search results should be displayed immediately, but if it’s not possible — a progress indicator should be used as system feedback for user. You should give your users a clear indication of how long they need to wait. Aviasales website notify users that search will take some time. Tip: If search takes too long you can use animation. Good animation can distract your visitors and make them ignore long searching times. 9. Provide sort and filter options Users become overwhelmed when their search terms result in seemingly irrelevant and/or too many results. You should provide the user with filtering options that are relevant for their search, and enable them to select multiple options each time they apply to filter results. Filter options can help users narrow and organize their results, which otherwise requires extensive (and excessive) scrolling or pagination. Tips: 10. Don’t return ‘no results’ Dropping someone on a page with no results can be frustrating. Especially if they have tried the search a couple of times. You should avoid giving users dead-ends in their experience when their search produces no matching results. Provide valuable for user alternatives when there are no matching search results (e.g. online shop can suggest alternative products from the similar category). A “no results” page as seen at HP example is essentially a dead-end for the user. It stands in sharp contrast to the page that had contextual category or search query suggestions at the no-results page, as seen in the Amazon example. Conclusion Search is a critical element of building a profitable site. Users expect smooth experiences when finding and learning about things and they typically make very quick judgments about site’s value based on the quality of one or two sets of search results. An excellent search facility should help users find what they want quickly and easily. Thank you! Follow UX Planet: Twitter | Facebook Originally published at babich.biz ", "title": "Best Practices for Search Results", "sentences": [{"4642": "Best Practices for Search Results"}, {"62b3": "by Nick Babich"}, {"f7b6": "Search is like a conversation between the user and system: the user expresses their information need as a query, and the system expresses its response as a set of results. The results page is a crucial piece of the search experience: it presents an opportunity to engage a dialogue that guides users’ information needs."}, {"97bf": "In this article I would like to share 10 practices that will help you improve the search results UX."}, {"e2ce": "1. Don’t erase users’ query after they hit Search button"}, {"7a07": "Keep the original text. Query reformulation is a critical step in many information journeys. If users don’t find what they’re looking for then they might want to search again using a slightly modified query. To make it easier for them, leave the initial search term in the search box so they don’t have to re-type the entire query again."}, {"3b82": "2. Provide accurate and relevant results"}, {"1b8a": "First results page is golden. The search results page is the prime focus of the search experience, and can make or break a site’s conversion rates. Users typically make very quick judgments about a website’s value based on the quality of one or two sets of search results."}, {"5ffc": "It’s clearly important to return accurate results to users, otherwise they won’t trust the search tool. It is thus essential that your search prioritize results in a useful way and that all the most important hits appear on the first page."}, {"1ce7": "3. Use effective autosuggest"}, {"4f69": "Ineffective autosuggestions deliver a poor search experience. Ensure that autosuggest is useful. Some helpful functions include recognition of root words, predictive text and suggestions while the user enters text. They help speed up the search process and keep users on-task toward conversion."}, {"36cb": "Image credits: ThinkWithGoogle"}, {"7aa9": "4. Correct typos"}, {"eed6": "Typing is error prone. If a user mistypes a search term and you’re able to detect this, you could show them results for the guessed and ‘corrected’ search term instead. This avoids the frustration that could be caused by returning no results and forcing the user to enter the search term again."}, {"73fe": "There’s no support for query reformulation on the Apple store zero results page"}, {"cbe5": "Asos does a good job of displaying alternative results when a typo occurs without offending the user. It has a subtle messaging like ‘we also searched for Overcoats’ with the original search term of ‘Overcoatt’"}, {"f33f": "5. Show the number of search results"}, {"e80e": "Show the number of search items available, so that users can make a decision on how long they want to spend looking through results."}, {"a381": "The number of matching results helps the user make more informed query reformulations."}, {"23ea": "6. Keep recent user’s search queries"}, {"d560": "Even when users are familiar with the search feature, search requires them to recall information from their memory. To come up with a meaningful query, a user needs to think about attributes that are relevant for his goal and incorporate them in the query. When designing a search experience you should keep in mind a basic usability rule:"}, {"5c52": "Respect the users effort"}, {"c83b": "You site should store all recent searches, in order to provide this data to the user the next time they conduct a search."}, {"48ec": "Recent searches benefit the user in saving them time and effort in searching for the same item again."}, {"7878": "Tip: Present less than 10 items (and without a scroll bar) so the information doesn’t become overwhelming."}, {"ac44": "7. Choose proper page layout"}, {"9afb": "One of the challenges of displaying search results is that different types of content require different layouts. Two basic layouts for content presentation are list view and grid view. A rule of thumb:"}, {"bdc0": "Details in lists, pictures in grids"}, {"9c13": "Let’s examine this rule in cotext of product page. Product’s specifics is very important moment. For products like appliances where details like model numbers, ratings and dimensions are major factors in the selection process — the list view makes most sense."}, {"1401": "List view is better suited to a detail-oriented layout"}, {"7d6f": "A grid view is a good option for apps with products that require less product information or for similar products. Products like apparel, where less text-based product information needs to be considered when choosing between items and you make your decision by the appearance of the product. For this type of products users care about the visual distinctions between items, and would rather scroll through a single long page than repeatedly switch between the list page and product-detail pages."}, {"6fe8": "Grid view is better suited to a visually-oriented layout"}, {"a9ae": "Tips:"}, {"a1d7": "Allow users to change the layout by offering a range of views."}, {"aa5a": "8. Show search progress"}, {"85c5": "Ideally search results should be displayed immediately, but if it’s not possible — a progress indicator should be used as system feedback for user. You should give your users a clear indication of how long they need to wait."}, {"03ea": "Aviasales website notify users that search will take some time."}, {"f060": "Tip: If search takes too long you can use animation. Good animation can distract your visitors and make them ignore long searching times."}, {"8a33": "9. Provide sort and filter options"}, {"eff6": "Users become overwhelmed when their search terms result in seemingly irrelevant and/or too many results. You should provide the user with filtering options that are relevant for their search, and enable them to select multiple options each time they apply to filter results."}, {"1be4": "Filter options can help users narrow and organize their results, which otherwise requires extensive (and excessive) scrolling or pagination."}, {"a1ed": "Tips:"}, {"5d07": "10. Don’t return ‘no results’"}, {"6c17": "Dropping someone on a page with no results can be frustrating. Especially if they have tried the search a couple of times. You should avoid giving users dead-ends in their experience when their search produces no matching results. Provide valuable for user alternatives when there are no matching search results (e.g. online shop can suggest alternative products from the similar category)."}, {"350e": "A “no results” page as seen at HP example is essentially a dead-end for the user. It stands in sharp contrast to the page that had contextual category or search query suggestions at the no-results page, as seen in the Amazon example."}, {"7eaf": "Conclusion"}, {"2e71": "Search is a critical element of building a profitable site. Users expect smooth experiences when finding and learning about things and they typically make very quick judgments about site’s value based on the quality of one or two sets of search results. An excellent search facility should help users find what they want quickly and easily."}, {"d113": "Thank you!"}, {"dcb8": "Follow UX Planet: Twitter | Facebook"}, {"6219": "Originally published at babich.biz"}], "name": "2407", "parent": ""}