{"child": "2409_1\t2409_2\t2409_3\t2409_4\t2409_52409_1\t2409_2\t2409_3\t2409_4\t2409_5", "content": "Image credits: icons8 Trends in Modern Web Photography by Nick Babich Lately, photography has been playing bigger and bigger roles on the internet, furthering web design as a visual medium. As stunning photography continues as a timeless technique, especially as HD screens become more affordable. In this article, we’ll take a look at 6 most popular trends for web photography. Eye-Catching Hero Images Full-width above the scroll images are one of the most popular trends in website design. Their value lies in creating an immersive experience right away: since vision is the strongest human sense, HD hero images are one of the fastest ways to grab a user’s attention. They draw the user in immediately give users a sense of what to expect from the rest of the site. An image is the first thing on a page that gets all user’s attention. Hero images are the perfect container for one bit of information. Tips: Showing Objects in a Natural Environment Showing objects in context is a popular strategy for ecommerce sites. It’s a proven fact that such photos boost conversion rates. For example, the GorillaPod shown below. The hero background shows the device in a possible real-life situation. With the tripod large in the focus and no head to distract from it, the product is displayed creatively and efficiently. You can make your products come alive via excellent photography. Credits: joby Juliana Bicycles is another site that uses a photo of the product in action. Credits: julianabicycles Compared to colorful design where catchy colors help the design to stand out, in black and white designs the ability to stand out depends only on its ability to communicate rather than on its appealing visual presentation. Modern black and white photography at it’s best is art, and many photographers regard it as the purest form of photography. Credits: switzerlandinc But why does black and white photography command such acclaim? One reason is that color is a distraction Color takes attention away from the visual building blocks of a the photo itself; and it also takes attention away from other important elements on the page such as CTA buttons. Tip: If you have black and white photo as a background, you can use a bright color to drive user attention towards the CTAs. As you can see in example below, a black-and-white photo background amplifies colorful accents. Credits: Uber Color Overlays Color overlay is a cover for the image with a semi-transparent colored box. This technique can modify images to suit more specific goals such as brand identity (using a brand’s color scheme) or emotional response (for instance, a sepia overlay might give a neutral photo a sense of old). Color overlays enhance the impact of a photograph. Similar to black and white backgrounds, color overlays can also intensify the power of colorful accents. However, this only works well if the colors are chosen correctly. Credits: timbdesign Tips: Photo Paired with Dramatic Typography Custom typography can enhance your brand’s personality. When combined with custom photo, the effects can multiply. The style or message of the text influences how the user interprets the photo. Mixing type and photos doesn’t have to be an uphill battle. Credit: Peugeot Credits: allbirds Tip: Asymmetrical Layouts Asymmetrical layout is a popular choice among many web desiners. It helps designers create a visual flow that matches the user’s scanning patterns: this technique helps to direct the eye around the page in a smooth, logical way. You can create asymmetry by shifting either text or visuals to a certain side of the page. While the composition may be the same, the visual weight is equal on both sides of the screen. For example, one large element balanced by several smaller elements. As you can see below, the large visual on the left is balanced by the copy and CTA button on the right. Asymmetry works well as long as it’s visually balanced. Credits: nikoskoulis Conclusion Design trends keep on changing with time, but the basic idea of providing a pleasant user experience remains the same. As long as your photography are high quality, interesting to look at and works well with your content, they are a great option for you design. Thank you! Follow UX Planet: Twitter | Facebook Originally published at babich.biz ", "title": "Trends in Modern Web Photography", "sentences": [{"51b0": "Image credits: icons8"}, {"f5a6": "Trends in Modern Web Photography"}, {"d7b9": "by Nick Babich"}, {"2fe8": "Lately, photography has been playing bigger and bigger roles on the internet, furthering web design as a visual medium. As stunning photography continues as a timeless technique, especially as HD screens become more affordable."}, {"86ca": "In this article, we’ll take a look at 6 most popular trends for web photography."}, {"a023": "Eye-Catching Hero Images"}, {"36ff": "Full-width above the scroll images are one of the most popular trends in website design. Their value lies in creating an immersive experience right away: since vision is the strongest human sense, HD hero images are one of the fastest ways to grab a user’s attention. They draw the user in immediately give users a sense of what to expect from the rest of the site."}, {"658a": "An image is the first thing on a page that gets all user’s attention."}, {"62ef": "Hero images are the perfect container for one bit of information."}, {"f223": "Tips:"}, {"3db8": "Showing Objects in a Natural Environment"}, {"0b29": "Showing objects in context is a popular strategy for ecommerce sites. It’s a proven fact that such photos boost conversion rates. For example, the GorillaPod shown below. The hero background shows the device in a possible real-life situation. With the tripod large in the focus and no head to distract from it, the product is displayed creatively and efficiently."}, {"350a": "You can make your products come alive via excellent photography. Credits: joby"}, {"3da9": "Juliana Bicycles is another site that uses a photo of the product in action."}, {"2f73": "Credits: julianabicycles"}, {"4589": "Compared to colorful design where catchy colors help the design to stand out, in black and white designs the ability to stand out depends only on its ability to communicate rather than on its appealing visual presentation. Modern black and white photography at it’s best is art, and many photographers regard it as the purest form of photography."}, {"ada8": "Credits: switzerlandinc"}, {"9a19": "But why does black and white photography command such acclaim?"}, {"2e18": "One reason is that color is a distraction"}, {"4e52": "Color takes attention away from the visual building blocks of a the photo itself; and it also takes attention away from other important elements on the page such as CTA buttons."}, {"2e16": "Tip: If you have black and white photo as a background, you can use a bright color to drive user attention towards the CTAs. As you can see in example below, a black-and-white photo background amplifies colorful accents."}, {"e0d7": "Credits: Uber"}, {"0e62": "Color Overlays"}, {"2936": "Color overlay is a cover for the image with a semi-transparent colored box. This technique can modify images to suit more specific goals such as brand identity (using a brand’s color scheme) or emotional response (for instance, a sepia overlay might give a neutral photo a sense of old)."}, {"c138": "Color overlays enhance the impact of a photograph."}, {"167b": "Similar to black and white backgrounds, color overlays can also intensify the power of colorful accents. However, this only works well if the colors are chosen correctly."}, {"4c6d": "Credits: timbdesign"}, {"31fc": "Tips:"}, {"fa8a": "Photo Paired with Dramatic Typography"}, {"d9e9": "Custom typography can enhance your brand’s personality. When combined with custom photo, the effects can multiply. The style or message of the text influences how the user interprets the photo."}, {"7a0f": "Mixing type and photos doesn’t have to be an uphill battle. Credit: Peugeot"}, {"141a": "Credits: allbirds"}, {"62c4": "Tip:"}, {"d9b3": "Asymmetrical Layouts"}, {"d50d": "Asymmetrical layout is a popular choice among many web desiners. It helps designers create a visual flow that matches the user’s scanning patterns: this technique helps to direct the eye around the page in a smooth, logical way."}, {"f5c5": "You can create asymmetry by shifting either text or visuals to a certain side of the page. While the composition may be the same, the visual weight is equal on both sides of the screen. For example, one large element balanced by several smaller elements. As you can see below, the large visual on the left is balanced by the copy and CTA button on the right."}, {"cc5e": "Asymmetry works well as long as it’s visually balanced. Credits: nikoskoulis"}, {"aa85": "Conclusion"}, {"1552": "Design trends keep on changing with time, but the basic idea of providing a pleasant user experience remains the same. As long as your photography are high quality, interesting to look at and works well with your content, they are a great option for you design."}, {"2b2d": "Thank you!"}, {"0654": "Follow UX Planet: Twitter | Facebook"}, {"1097": "Originally published at babich.biz"}], "name": "2409", "parent": ""}