{"child": "2415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_52415_1\t2415_2\t2415_3\t2415_4\t2415_5", "content": "How to prepare for your first UX interview Some tips on what you need to do beforehand, during and after your interview Introduction I decided to write this piece because in the past few months, many people asked me about my interview experiences for UX related positions. Every time I sat down to talk about it, I realized there were certain things that were commonly asked. So, I decided to share some of my own thoughts here on this blog post. I hope there are some useful information and insight for those of you who are interested! *Although the title says UX interviews, it’s not limited to just UX. I guess this will apply in general as well. Before the interview Practice your opening pitch One of the most important thing that I stress to others is to practice your opening pitch well and unique. You know what they say — first impression lasts a long time. During the start of your interview, whether it’s a phone call or a video call, most of the interviewers ask to briefly introduce yourself. Here, you probably have 2–3 minutes to tell a story of how you came this far into the field of UX (ex. what you are/were doing at school previously, your current passion and interests) and how interviewing at this company excites you a lot. Since this is a great opportunity to quickly unravel your past, current and/or future, I suggest really focusing a lot on your opening pitch to impress the interviewer and to hand over that energy. Once you start getting more and more interviews and even talking to people at the career fairs, you’ll gradually become more and more comfortable with the interviews. Here are some resources for preparing your perfect elevator pitch: The Perfect Elevator Pitch To Land A JobIf you're looking for a job, one of the first tasks on your to-do list should be crafting an ideal \"elevator pitch.\" It…www.forbes.com How To Write A Killer Elevator Pitch (Examples Included)Please share this post on social media by clicking the buttons below: You're on the elevator, riding up from the lobby…theinterviewguys.com Familiarize yourself with the company Getting an interview happens mostly occurs in two ways: you apply for the position or you get contacted by the recruiter for an interview. Especially if YOU are the one who submitted the application, then YOU must know about the company that made you decide on the application submission (right?). Obviously, the amount of knowledge that you know about each of the companies that you are interviewing with will vary and that’s okay. However, once you start scheduling all your interviews, I suggest you to go onto each of the companies’ websites (and many other places like Youtube, Quora etc) to discover not only their products but also their culture, visions and goals. Expect a question from the interviewer asking about why you decided to apply for the company. For the interviewer, it’s a great way to find out more about you, your motivation and why you are different from other candidates. Therefore, it’s recommended to prepare an answer in advance for this question also. There are other websites you can visit to find out more about the company and also get some interview insights like the ones here: Glassdoor Job Search | Find the job that fits your lifeSearch millions of jobs and get the inside scoop on companies with employee reviews, personalized salary tools, and…www.glassdoor.com QuoraQuora is a place to gain and share knowledge. It&#039;s a platform to ask questions and connect with people who…www.quora.com Check the time and date of your interview Please, please and please check your phone/video call time and date. I’ve seen people messing up the time between EST, PST and CST. When you get the email from the recruiter about the time, make sure you check the time zone in which the interview is scheduled for. Also, make sure you mark the day in your calendar. Also, before scheduling it, make sure you have no other conflicts. Remember the name of your interviewer Make sure you know the interviewer’s name! Sometimes, you might be so stressed out about reviewing your portfolio over an over again and practicing your opening pitch that you completely forgot the name of your interviewer. It always sucks when you try to engage in a conversation but you have completely no idea what the other person’s name is. So please, write it down somewhere or remember it for sure. Also, there are a lot of names that you might not be familiar with (such as my name which is “Geunbae”) which might give you a hard time pronouncing the name correctly. If you are not sure of how to pronounce it during your interview, please ask them the correct pronunciation at the start of your interview. This might even give a good impression of your personality and that you pay attention to details (and that you want to address the him/her correctly). Make a good first impression for the call For the phone interviews, when your phone starts vibrating, try to answer like, “Hi, this is Geunbae” instead of just being “Hi.” Just think about it, if you don’t say your name, the interviewer would have to confirm that the person on the other side is you. On the other side, if you do say your name when you first answer the call, it makes things much easier and the initial phase of your interview will be smoother. I really think this is a much more professional way of answering your phone if you are expecting a call from someone. For the video interviews, it should be obvious that your surroundings should be nice and tidy. Also, you could even be creative and put some UX related books on the side, hang your project posters on the wall or whatever…as long as it doesn’t grab too much attention from the interviewer, I guess it’s fine. However, I personally just like the white background behind me so that the interviewer can just stare at me without no distractions. Anyways, please don’t have any silly stuff lying around. Try to find out more about the interviewer When you are assigned an interviewer, you will have enough time to find out about the person. Try searching about your interviewer on social media to extract some valuable information you might relate to during your interview. If you can, check out their profile on LinkedIn because it might benefit you in getting to know slightly more about your interviewer. For example, if you came into the field of UX with a certain degree and your interviewer also graduated with the same degree, you might have certain things to talk about during the interview that help you to build a rapport with the interviewer. However, you shouldn’t try so hard to relate everything with that other person. In addition to taking a glance at the LinkedIn profiles or other kind of social media profiles, looking over the interviewer’s UX portfolio website might also be helpful to you. By looking at their past work, you might discover some of the things that resonate and overlap with your own skills or experiences. Sometimes, this even alleviates the stress that you have for the upcoming interview date. During the interview Answer “tell me about yourself” well Just like I said in the previous section, your opening pitch, the “tell me about yourself” part is very, very important. Not only it’s a spot where you can say the most interesting thing about yourself but also, it’s where the interviewer might have his/her’s maximum concentration (because it’s at the very early stage of the interview and both parties are excited). For example, if you came into the field of UX without a design degree (sorry, this is me… haha), tell a story of how you got interested in UX to begin with. Try to start going through the things you discovered, felt interested in and also intimidated about the field of UX. Since you are going into the field of UX, storytelling is a great skill to have not only for your interview but also for your future career. Here is a great article about the importance of story telling in UX: BlogOne of the most challenging and exciting aspects of a career in UX is that it requires a broad skill set - encompassing…www.filterdigital.com For me, I talked about how having a psychology degree was related to UX but as a aspiring designer who wanted to solve problems, I wanted to dive deeper into the tools and code that allow me to express my ideas. As you are telling a story about yourself, try to include some laughing points (funny moments) or even stressful moments so that the person who’s sitting quietly and listening to you can really “feel” the story. Just like in any conversation, keeping things dry sometimes is a huge minus because it’s easy to lose concentration (and it’s boring). Furthermore, answering this section of the interview really well might start off your interview process in a more positive direction. If you had built a great relationship with the person on the other side already during this phase, who knows, you might end up feeling like you’re explaining your projects to your friends and be more confident about it. Request interviewer’s preference during the portfolio review As you pass the initial phases, you will be asked to explain about your past experiences, specifically about some of your portfolio pieces. Sometimes, the interviewers have already visited your portfolio website, but many times (because they are busy) during the interview might actually be their first time taking a look at your portfolio. This also could happen when the recruiter does the initial screening and passes onto the interviewers. If you are worried about how to present your portfolio, just like I mentioned in “How to structure your first UX portfolio”, it’s a good idea to focus on your best projects which typically are the ones that are firstly listed on your website or are highlighted. Since other projects that you didn’t anticipate to be asked could also be brought up, you should be prepared to present all of them and be confident with your presentation. So, how do you then start discussing your project when asked? Firstly, I usually ask the interviewer if he/she has any preferences in how they want to go through. In some of my past interviews, I asked the interviewer, “would you like to hear about this project in a chronological order or do you have any specific part that you want to hear about?” For me, most of the times, the interviewer wanted to hear in a chronological order. However, I addressed the problem domain, me and my team’s approach, briefly introduced our solution and then went onto explaining each steps. And depending on the interest of the interviewer, I was asked questions on specific parts of my process. To be honest, once you get into the interview and start talking about your portfolio, it will be likely that you will feel what should and shouldn’t be explained. Some of the things I thought were asked a lot were: Like I mentioned, I’ve written an article about UX Portfolio: How to Structure Your First UX Design PortfolioLooking to get your first UX Design job? This blog post might help you a lot.uxplanet.org Don’t lean back against the chair This is a common sense (even when you are on a date) that leaning your back against the chair implies a meaning that you are not fully engaged in a conversation or the conversation is too boring. It’s a simple gesture that you need to keep in mind because I felt like I was able to perform better when my back wasn’t against the chair and that I was rather leaning towards the screen. Check this out to find out more about why you shouldn’t lean back in your chair: The Biology of AttractionIn an apocryphal story, a colleague once turned to the great British geneticist J.B.S. Haldane, and said, \"Tell me, Mr…www.psychologytoday.com Be honest and optimistic — admit and don’t be shy on not knowing certain things Many times, you want to look perfect in front of other people and especially during your interview where you really want the job, you might want to look like you know everything. Well, it would be great if you did and others will appreciate you highly of what you know but honestly, if you don’t know what the interviewer is talking about, feel free to say, “I’m sorry but could you elaborate (or clarify) more on it?” In one of my interviews, the interviewer questioned me about a feature that the company had on the website. I was asked to explain how I felt about it as a design perspective as well as the user’s perspective. Instead of being scared that I might be portrayed as a person who didn’t do my homework, I politely asked my interviewer to explain where the feature is located at. I thought instead of pretending that I knew about it would make things worse if he/she was to ask deeper questions or even possibly ask me questions that I would not possibly answer if I didn’t know where that feature was. Admitting the fact that there are things you are not sure of is not an embarrassing to do. Since you are just getting into UX, there are way more things to learn and experience. Rather than being scared, I suggest you to be honest and optimistic about it. Also, I think showing the passion to learn even during your interview could be a plus to your interview. Here is a tip on the right way to say “I don’t know” during the interview: The Right Way To Say \"I Don't Know\" In An Interview - Triple CrownAs a job candidate, your goal is to show your best and most knowledgeable side throughout the hiring process, but…www.tripleco.com Smoothly add positive things about yourself whenever you answer questions As you are answering the interviewer’s questions, try to mix positive aspects about you in your responses. For example, if you are asked on maybe you’re own role during the project, you could say things like, “for this project, I designed the UI of the app. At first, I was hesitant because I wasn’t familiar with the iOS guidelines and I didn’t design a lot of apps before. However, if I reflect back on this project, I think that learning these valuable information and really working hard on getting the work done as a team member was definitely worth the experience. ” So, here it is again: everything is about telling a story. There are a lot of cases, probably so many situations where you can incorporate your own story in your responses. However, I would strongly stay away from always talking good about yourself. Because we are social animals and that there are so many little tensions and emotions that go into conversations that sometimes, bragging about your success all the time might turn things the other way around. So, if you are smart, I suggest you to look more human-like, rather than a superman. Build rapport as much as you can with the interviewer As I slightly mentioned this in other parts of this article, building a rapport with the interviewer is great. However, just because you and your interviewer like to go on hiking during the weekend as a hobby, it doesn’t mean that you got the job. The importance of building a good rapport simply means that you are able to share your information and your story more comfortably rather than having a feeling of being interrogated (a little harsh..?). In a much more friendly and positive setting, as an interviewee, you will be much more successful in conveying information. Here are some ways to build rapport with your interviewer: How to Build Instant Rapport in an InterviewJob seekers who don’t get a call back after an interview often wonder where they went wrong. One factor, new research…www.wsj.com How to build rapport during your interview | Michael PageSuccessful interviews usually happen when the interviewer and interviewee are, at some level, on the same page…www.michaelpage.co.uk Ask appropriate questions Throughout your interview, only ask questions when it’s necessary. The interviewers are called interviewers because they came to interview you, not to be interviewed. If there are questions that you must ask or if the interviewer set aside a time (at the end of the interview perhaps) for you to ask questions, then ask only the appropriate questions. Please don’t ask stupid things like: Rather, ask questions like: Here are more resources here so please feel free to check them out: The 7 Questions You’ll Be Asked at a UX Design Interview(And how to prepare for them)medium.com 10 Questions You Should Ask in a UX InterviewInterviewing your interviewer is critical in determining whether a design job is the right fit for you, toomedium.com 10 Useful Questions to Ask in UX InterviewsWhen it comes to UX interviews, it's easy to feel like you're the one getting grilled. But remember, you're…www.uxbeginner.com After the interview Follow up with the people that helped you and thank them, always This doesn’t just apply to after your phone/video interview… A lot of the times, especially when you’re at school, you will probably be applying to so many companies that you don’t even keep track of where you submitted your application anymore. On top of that, you’ve probably reached out to a lot of recruiters on LinkedIn and email about the jobs and how you are so enthusiastic about working there. By the time you finish all your interviews and start to get offers from the companies, there will be one company that you will be going to work for. For some reason, I think the recruiters and the interviewers (based on their past experiences) know that there will be a lot of enthusiasms and excitements during the start of the process but suddenly after an interviewee gets an offer form somewhere he/she wanted to go, the communication will become slower and slower or even end there for good. Please, thank all those people that helped you out during all of your job hunting processes when you have time. And to be honest, you might meet them later in the future again. Here are some resources here about sending a thank you email: Send This Thank You Email After Interview (Templates Included)Please share these templates with your social networks! Ok, so you're feeling like a \"big shot.\" Your cover letter and…theinterviewguys.com Here's What To Write In Your Thank-You Note After A Job Interview | Fast CompanyIf you were Googling \"thank-you note after interview\" in the hopes that someone on the World Wide Web would tell you…www.fastcompany.com Reflect back on your interview and make improvements I came across some people that record their interviews for future references. Also, it seems like doing that might provide you with another perspective of your entire process as a third person watching / listening to the call. Honestly, I think this is a great strategy to improve not only your speaking skills but also to fix your mistakes and point out where you did well. Even though every interview will be different, there are still takeaways that you can digest for the future. (Just like you have mock exams for your real exams!) Don’t be too stressed out about it Lastly, don’t be too stressed about the the interview. I know, this is easier said than done. Even I always stress out about the result. I mean who wouldn’t right? Well you know, what is done is done and sometimes in life, you don’t always get what you want. That’s why living as a human being is very interesting because life is like a rollercoaster — there are times when you struggle but that’s what makes us stronger. Thanks for reading and best of luck in your future! More articles written by me: And find me here: LinkedIn / Dribbble / Medium Please press ❤️ if you liked reading this! ", "title": "How to prepare for your first UX interview", "sentences": [{"d902": "How to prepare for your first UX interview"}, {"2811": "Some tips on what you need to do beforehand, during and after your interview"}, {"1157": "Introduction"}, {"5e0f": "I decided to write this piece because in the past few months, many people asked me about my interview experiences for UX related positions. Every time I sat down to talk about it, I realized there were certain things that were commonly asked. So, I decided to share some of my own thoughts here on this blog post. I hope there are some useful information and insight for those of you who are interested!"}, {"ea3c": "*Although the title says UX interviews, it’s not limited to just UX. I guess this will apply in general as well."}, {"5e22": "Before the interview"}, {"e299": "Practice your opening pitch"}, {"ccb3": "One of the most important thing that I stress to others is to practice your opening pitch well and unique. You know what they say — first impression lasts a long time. During the start of your interview, whether it’s a phone call or a video call, most of the interviewers ask to briefly introduce yourself."}, {"10bd": "Here, you probably have 2–3 minutes to tell a story of how you came this far into the field of UX (ex. what you are/were doing at school previously, your current passion and interests) and how interviewing at this company excites you a lot. Since this is a great opportunity to quickly unravel your past, current and/or future, I suggest really focusing a lot on your opening pitch to impress the interviewer and to hand over that energy."}, {"a0d8": "Once you start getting more and more interviews and even talking to people at the career fairs, you’ll gradually become more and more comfortable with the interviews."}, {"ec45": "Here are some resources for preparing your perfect elevator pitch:"}, {"2819": "The Perfect Elevator Pitch To Land A JobIf you're looking for a job, one of the first tasks on your to-do list should be crafting an ideal \"elevator pitch.\" It…www.forbes.com"}, {"1b6a": "How To Write A Killer Elevator Pitch (Examples Included)Please share this post on social media by clicking the buttons below: You're on the elevator, riding up from the lobby…theinterviewguys.com"}, {"3dd1": "Familiarize yourself with the company"}, {"97ec": "Getting an interview happens mostly occurs in two ways: you apply for the position or you get contacted by the recruiter for an interview. Especially if YOU are the one who submitted the application, then YOU must know about the company that made you decide on the application submission (right?). Obviously, the amount of knowledge that you know about each of the companies that you are interviewing with will vary and that’s okay. However, once you start scheduling all your interviews, I suggest you to go onto each of the companies’ websites (and many other places like Youtube, Quora etc) to discover not only their products but also their culture, visions and goals."}, {"9d2e": "Expect a question from the interviewer asking about why you decided to apply for the company. For the interviewer, it’s a great way to find out more about you, your motivation and why you are different from other candidates. Therefore, it’s recommended to prepare an answer in advance for this question also."}, {"cc94": "There are other websites you can visit to find out more about the company and also get some interview insights like the ones here:"}, {"009a": "Glassdoor Job Search | Find the job that fits your lifeSearch millions of jobs and get the inside scoop on companies with employee reviews, personalized salary tools, and…www.glassdoor.com"}, {"6068": "QuoraQuora is a place to gain and share knowledge. It&#039;s a platform to ask questions and connect with people who…www.quora.com"}, {"a321": "Check the time and date of your interview"}, {"b93e": "Please, please and please check your phone/video call time and date. I’ve seen people messing up the time between EST, PST and CST. When you get the email from the recruiter about the time, make sure you check the time zone in which the interview is scheduled for. Also, make sure you mark the day in your calendar. Also, before scheduling it, make sure you have no other conflicts."}, {"03ff": "Remember the name of your interviewer"}, {"8e25": "Make sure you know the interviewer’s name! Sometimes, you might be so stressed out about reviewing your portfolio over an over again and practicing your opening pitch that you completely forgot the name of your interviewer. It always sucks when you try to engage in a conversation but you have completely no idea what the other person’s name is. So please, write it down somewhere or remember it for sure. Also, there are a lot of names that you might not be familiar with (such as my name which is “Geunbae”) which might give you a hard time pronouncing the name correctly. If you are not sure of how to pronounce it during your interview, please ask them the correct pronunciation at the start of your interview. This might even give a good impression of your personality and that you pay attention to details (and that you want to address the him/her correctly)."}, {"041b": "Make a good first impression for the call"}, {"5dd1": "For the phone interviews, when your phone starts vibrating, try to answer like, “Hi, this is Geunbae” instead of just being “Hi.” Just think about it, if you don’t say your name, the interviewer would have to confirm that the person on the other side is you. On the other side, if you do say your name when you first answer the call, it makes things much easier and the initial phase of your interview will be smoother. I really think this is a much more professional way of answering your phone if you are expecting a call from someone."}, {"496a": "For the video interviews, it should be obvious that your surroundings should be nice and tidy. Also, you could even be creative and put some UX related books on the side, hang your project posters on the wall or whatever…as long as it doesn’t grab too much attention from the interviewer, I guess it’s fine. However, I personally just like the white background behind me so that the interviewer can just stare at me without no distractions. Anyways, please don’t have any silly stuff lying around."}, {"94e9": "Try to find out more about the interviewer"}, {"aa17": "When you are assigned an interviewer, you will have enough time to find out about the person. Try searching about your interviewer on social media to extract some valuable information you might relate to during your interview. If you can, check out their profile on LinkedIn because it might benefit you in getting to know slightly more about your interviewer."}, {"5c6c": "For example, if you came into the field of UX with a certain degree and your interviewer also graduated with the same degree, you might have certain things to talk about during the interview that help you to build a rapport with the interviewer. However, you shouldn’t try so hard to relate everything with that other person."}, {"514f": "In addition to taking a glance at the LinkedIn profiles or other kind of social media profiles, looking over the interviewer’s UX portfolio website might also be helpful to you. By looking at their past work, you might discover some of the things that resonate and overlap with your own skills or experiences. Sometimes, this even alleviates the stress that you have for the upcoming interview date."}, {"dbbe": "During the interview"}, {"e365": "Answer “tell me about yourself” well"}, {"1419": "Just like I said in the previous section, your opening pitch, the “tell me about yourself” part is very, very important. Not only it’s a spot where you can say the most interesting thing about yourself but also, it’s where the interviewer might have his/her’s maximum concentration (because it’s at the very early stage of the interview and both parties are excited)."}, {"bfca": "For example, if you came into the field of UX without a design degree (sorry, this is me… haha), tell a story of how you got interested in UX to begin with. Try to start going through the things you discovered, felt interested in and also intimidated about the field of UX. Since you are going into the field of UX, storytelling is a great skill to have not only for your interview but also for your future career."}, {"291c": "Here is a great article about the importance of story telling in UX:"}, {"9a50": "BlogOne of the most challenging and exciting aspects of a career in UX is that it requires a broad skill set - encompassing…www.filterdigital.com"}, {"68fe": "For me, I talked about how having a psychology degree was related to UX but as a aspiring designer who wanted to solve problems, I wanted to dive deeper into the tools and code that allow me to express my ideas. As you are telling a story about yourself, try to include some laughing points (funny moments) or even stressful moments so that the person who’s sitting quietly and listening to you can really “feel” the story. Just like in any conversation, keeping things dry sometimes is a huge minus because it’s easy to lose concentration (and it’s boring)."}, {"7fc0": "Furthermore, answering this section of the interview really well might start off your interview process in a more positive direction. If you had built a great relationship with the person on the other side already during this phase, who knows, you might end up feeling like you’re explaining your projects to your friends and be more confident about it."}, {"f4fa": "Request interviewer’s preference during the portfolio review"}, {"7f07": "As you pass the initial phases, you will be asked to explain about your past experiences, specifically about some of your portfolio pieces. Sometimes, the interviewers have already visited your portfolio website, but many times (because they are busy) during the interview might actually be their first time taking a look at your portfolio. This also could happen when the recruiter does the initial screening and passes onto the interviewers."}, {"5faf": "If you are worried about how to present your portfolio, just like I mentioned in “How to structure your first UX portfolio”, it’s a good idea to focus on your best projects which typically are the ones that are firstly listed on your website or are highlighted. Since other projects that you didn’t anticipate to be asked could also be brought up, you should be prepared to present all of them and be confident with your presentation."}, {"39f1": "So, how do you then start discussing your project when asked? Firstly, I usually ask the interviewer if he/she has any preferences in how they want to go through. In some of my past interviews, I asked the interviewer, “would you like to hear about this project in a chronological order or do you have any specific part that you want to hear about?” For me, most of the times, the interviewer wanted to hear in a chronological order. However, I addressed the problem domain, me and my team’s approach, briefly introduced our solution and then went onto explaining each steps. And depending on the interest of the interviewer, I was asked questions on specific parts of my process."}, {"bec2": "To be honest, once you get into the interview and start talking about your portfolio, it will be likely that you will feel what should and shouldn’t be explained. Some of the things I thought were asked a lot were:"}, {"f728": "Like I mentioned, I’ve written an article about UX Portfolio:"}, {"53c4": "How to Structure Your First UX Design PortfolioLooking to get your first UX Design job? This blog post might help you a lot.uxplanet.org"}, {"b797": "Don’t lean back against the chair"}, {"dbcd": "This is a common sense (even when you are on a date) that leaning your back against the chair implies a meaning that you are not fully engaged in a conversation or the conversation is too boring. It’s a simple gesture that you need to keep in mind because I felt like I was able to perform better when my back wasn’t against the chair and that I was rather leaning towards the screen."}, {"7043": "Check this out to find out more about why you shouldn’t lean back in your chair:"}, {"2172": "The Biology of AttractionIn an apocryphal story, a colleague once turned to the great British geneticist J.B.S. Haldane, and said, \"Tell me, Mr…www.psychologytoday.com"}, {"e0b2": "Be honest and optimistic — admit and don’t be shy on not knowing certain things"}, {"c838": "Many times, you want to look perfect in front of other people and especially during your interview where you really want the job, you might want to look like you know everything. Well, it would be great if you did and others will appreciate you highly of what you know but honestly, if you don’t know what the interviewer is talking about, feel free to say, “I’m sorry but could you elaborate (or clarify) more on it?”"}, {"4c9f": "In one of my interviews, the interviewer questioned me about a feature that the company had on the website. I was asked to explain how I felt about it as a design perspective as well as the user’s perspective. Instead of being scared that I might be portrayed as a person who didn’t do my homework, I politely asked my interviewer to explain where the feature is located at. I thought instead of pretending that I knew about it would make things worse if he/she was to ask deeper questions or even possibly ask me questions that I would not possibly answer if I didn’t know where that feature was."}, {"c789": "Admitting the fact that there are things you are not sure of is not an embarrassing to do. Since you are just getting into UX, there are way more things to learn and experience. Rather than being scared, I suggest you to be honest and optimistic about it. Also, I think showing the passion to learn even during your interview could be a plus to your interview."}, {"a31a": "Here is a tip on the right way to say “I don’t know” during the interview:"}, {"1620": "The Right Way To Say \"I Don't Know\" In An Interview - Triple CrownAs a job candidate, your goal is to show your best and most knowledgeable side throughout the hiring process, but…www.tripleco.com"}, {"5f01": "Smoothly add positive things about yourself whenever you answer questions"}, {"1cd9": "As you are answering the interviewer’s questions, try to mix positive aspects about you in your responses. For example, if you are asked on maybe you’re own role during the project, you could say things like, “for this project, I designed the UI of the app. At first, I was hesitant because I wasn’t familiar with the iOS guidelines and I didn’t design a lot of apps before. However, if I reflect back on this project, I think that learning these valuable information and really working hard on getting the work done as a team member was definitely worth the experience. ”"}, {"af09": "So, here it is again: everything is about telling a story. There are a lot of cases, probably so many situations where you can incorporate your own story in your responses. However, I would strongly stay away from always talking good about yourself. Because we are social animals and that there are so many little tensions and emotions that go into conversations that sometimes, bragging about your success all the time might turn things the other way around. So, if you are smart, I suggest you to look more human-like, rather than a superman."}, {"01cd": "Build rapport as much as you can with the interviewer"}, {"959d": "As I slightly mentioned this in other parts of this article, building a rapport with the interviewer is great. However, just because you and your interviewer like to go on hiking during the weekend as a hobby, it doesn’t mean that you got the job. The importance of building a good rapport simply means that you are able to share your information and your story more comfortably rather than having a feeling of being interrogated (a little harsh..?). In a much more friendly and positive setting, as an interviewee, you will be much more successful in conveying information."}, {"84f7": "Here are some ways to build rapport with your interviewer:"}, {"6400": "How to Build Instant Rapport in an InterviewJob seekers who don’t get a call back after an interview often wonder where they went wrong. One factor, new research…www.wsj.com"}, {"16b0": "How to build rapport during your interview | Michael PageSuccessful interviews usually happen when the interviewer and interviewee are, at some level, on the same page…www.michaelpage.co.uk"}, {"f5d7": "Ask appropriate questions"}, {"7f4a": "Throughout your interview, only ask questions when it’s necessary. The interviewers are called interviewers because they came to interview you, not to be interviewed. If there are questions that you must ask or if the interviewer set aside a time (at the end of the interview perhaps) for you to ask questions, then ask only the appropriate questions."}, {"a0ed": "Please don’t ask stupid things like:"}, {"d178": "Rather, ask questions like:"}, {"7353": "Here are more resources here so please feel free to check them out:"}, {"56c5": "The 7 Questions You’ll Be Asked at a UX Design Interview(And how to prepare for them)medium.com"}, {"eef1": "10 Questions You Should Ask in a UX InterviewInterviewing your interviewer is critical in determining whether a design job is the right fit for you, toomedium.com"}, {"5f8b": "10 Useful Questions to Ask in UX InterviewsWhen it comes to UX interviews, it's easy to feel like you're the one getting grilled. But remember, you're…www.uxbeginner.com"}, {"4b84": "After the interview"}, {"be30": "Follow up with the people that helped you and thank them, always"}, {"6798": "This doesn’t just apply to after your phone/video interview…"}, {"53ea": "A lot of the times, especially when you’re at school, you will probably be applying to so many companies that you don’t even keep track of where you submitted your application anymore. On top of that, you’ve probably reached out to a lot of recruiters on LinkedIn and email about the jobs and how you are so enthusiastic about working there. By the time you finish all your interviews and start to get offers from the companies, there will be one company that you will be going to work for."}, {"bf07": "For some reason, I think the recruiters and the interviewers (based on their past experiences) know that there will be a lot of enthusiasms and excitements during the start of the process but suddenly after an interviewee gets an offer form somewhere he/she wanted to go, the communication will become slower and slower or even end there for good."}, {"2f65": "Please, thank all those people that helped you out during all of your job hunting processes when you have time. And to be honest, you might meet them later in the future again."}, {"f705": "Here are some resources here about sending a thank you email:"}, {"6652": "Send This Thank You Email After Interview (Templates Included)Please share these templates with your social networks! Ok, so you're feeling like a \"big shot.\" Your cover letter and…theinterviewguys.com"}, {"671e": "Here's What To Write In Your Thank-You Note After A Job Interview | Fast CompanyIf you were Googling \"thank-you note after interview\" in the hopes that someone on the World Wide Web would tell you…www.fastcompany.com"}, {"ff8a": "Reflect back on your interview and make improvements"}, {"bfb1": "I came across some people that record their interviews for future references. Also, it seems like doing that might provide you with another perspective of your entire process as a third person watching / listening to the call. Honestly, I think this is a great strategy to improve not only your speaking skills but also to fix your mistakes and point out where you did well. Even though every interview will be different, there are still takeaways that you can digest for the future. (Just like you have mock exams for your real exams!)"}, {"0a8d": "Don’t be too stressed out about it"}, {"bcb2": "Lastly, don’t be too stressed about the the interview. I know, this is easier said than done. Even I always stress out about the result. I mean who wouldn’t right? Well you know, what is done is done and sometimes in life, you don’t always get what you want. That’s why living as a human being is very interesting because life is like a rollercoaster — there are times when you struggle but that’s what makes us stronger."}, {"ac4a": "Thanks for reading and best of luck in your future!"}, {"3677": "More articles written by me:"}, {"281d": "And find me here:"}, {"cae6": "LinkedIn / Dribbble / Medium"}, {"a76f": "Please press ❤️ if you liked reading this!"}], "name": "2415", "parent": ""}