{"name": "244", "parent": "", "content": "3 carências humanas que você já sabia; mas não presta atenção Se resolvidas, muita coisa melhoraria em cascata Tenho uma amiga filósofa de botequim maravilhosa. Ela é capaz de escarafunchar um bom pensamento de absolutamente qualquer coisa, incluindo músicas carnavalescas, best-sellers de autoajuda e perfis populares das redes sociais. E como sabe que eu gosto desse tipo de conversa, vira e mexe ela me liga para tomarmos um café. Ou uma cerveja, nas épocas em que bebo um pouco. Esta semana combinamos de nos encontrar para papear por duas horas. Acabamos ficando seis, como é de praxe. De tudo o que conversamos, três coisas me chamaram atenção. Geralmente eu anoto em algum lugar mas, desta vez, pensei: porquê não compartilhar? Racquel e eu estávamos falando sobre a situação não apenas daqui, deste país, mas da humanidade. É óbvio que os nossos desafios são numericamente muito maiores mas, depois de muita saliva, chegamos a uma conclusão interessante. Dentro, naturalmente, da nossa imensa despretensão filosófica. Enumeramos três carências humanas atuais que, se resolvidas, muita coisa melhoraria em cascata. A real é que, na minha opinião, esses três itens — a falta deles — são verdadeiras epidemias. Eu sempre saio diferente depois de uma conversa com a Racquel. Diferente pra melhor. Acho que na próxima vez vou filmar. Daí posto aqui ;-) ", "title": "3 carências humanas que você já sabia; mas não presta atenção", "sentences": [{"dfad": "3 carências humanas que você já sabia; mas não presta atenção"}, {"2c70": "Se resolvidas, muita coisa melhoraria em cascata"}, {"e14b": "Tenho uma amiga filósofa de botequim maravilhosa. Ela é capaz de escarafunchar um bom pensamento de absolutamente qualquer coisa, incluindo músicas carnavalescas, best-sellers de autoajuda e perfis populares das redes sociais. E como sabe que eu gosto desse tipo de conversa, vira e mexe ela me liga para tomarmos um café. Ou uma cerveja, nas épocas em que bebo um pouco."}, {"ec69": "Esta semana combinamos de nos encontrar para papear por duas horas. Acabamos ficando seis, como é de praxe."}, {"b9c6": "De tudo o que conversamos, três coisas me chamaram atenção. Geralmente eu anoto em algum lugar mas, desta vez, pensei: porquê não compartilhar?"}, {"d08a": "Racquel e eu estávamos falando sobre a situação não apenas daqui, deste país, mas da humanidade. É óbvio que os nossos desafios são numericamente muito maiores mas, depois de muita saliva, chegamos a uma conclusão interessante. Dentro, naturalmente, da nossa imensa despretensão filosófica."}, {"a463": "Enumeramos três carências humanas atuais que, se resolvidas, muita coisa melhoraria em cascata. A real é que, na minha opinião, esses três itens — a falta deles — são verdadeiras epidemias."}, {"6693": "Eu sempre saio diferente depois de uma conversa com a Racquel."}, {"3f61": "Diferente pra melhor."}, {"bbe2": "Acho que na próxima vez vou filmar."}, {"2f04": "Daí posto aqui ;-)"}], "child": "244_1\t244_2"}