{"name": "247", "parent": "", "content": "3 Life Lessons to Turn the Negative into Positive — Inspired by March Madness “It’s what you learn after you know it all that counts.” — Coach John Wooden Can you feel the excitement??!! It’s Final Four weekend in men’s and women’s college basketball. This is an incredible time of year for excitement, emotion and dreams to come true. Whether you’re a basketball fan or just a casual observer, it’s hard not to get wrapped up in the excitement of March Madness. As a high school basketball coach — and former college player — I live for this time of year. Basketball is one of the biggest parts of my life. I’ve learned such a tremendous amount about life, helping others and myself through the game. Today’s lessons are from my freshman year of college basketball and my first two coaching stops in northern Virginia. I hope you see the value in these lessons and apply them to your life! 1. Show People You Care — Lead with Empathy! “You can’t win, unless you learn to lose.” — Kareem Abdul Jabbar One Win. That was all I had to my name during my first season as an assistant high school basketball coach. Taking the positive out of a one-win season is not easy, but it is essential. I learned during my first season that winning is not the only thing that matters — it’s what you learn about yourself, the game and life that are far more important. It is truly the journey — not the destination — that matters most! My coaching career started in northern Virginia at one of the most ethnically diverse high schools in America. Situated just outside of Washington D.C., the school has a large Muslim, Latino and African-American population. Our team’s diversity was a perfect representation of the overall student body. Hard-working, respectful kids who cared for one another. This made for a wonderful experience where the coaches and players could all learn about each other’s backgrounds. I learned my first Arabic words and gained insights into the culture of the various communities in the town. The previous season, the team had a .500 winning percentage and left over from that squad were some legitimately talented athletes. I figured there was room for growth. Instead, it was a season of close losses but priceless life lessons. Empathy, understanding and positive encouragement are the best operating bases from which to teach people. Particularly during times of adversity, you have to stay positive. This is as true on the basketball court as it is in life! Think about it — what are you facing today that has you down? Change and tough times are going to affect all of us. If we turn and run away, or face them with a poor attitude, we’ll never learn and improve. In basketball, they say every team “makes a run.” This means, every team gets some momentum going and plays well in spurts for certain parts of a game. This is when everything coalesces and starts gelling for the unit. Think about what “your run” looks like. How you will get your momentum and inspiration. You’ll find that you inspire others AND yourself when you are a person of empathy and integrity. To form deep connections, show from the beginning that you care about people — beyond a shared objective. When you genuinely care for others, they know it. It’s real and authentic. Empathy builds trust and forms long-lasting relationships. 2. There is ALWAYS a Way to Get Better “There is always someone better than you. Whatever it is that you do for a living, chances are, you will run into a situation in which you are not as talented as the person next to you. That’s when being a competitor can make a difference in your fortunes.” — Coach Pat Summitt My passion for the game of basketball, competing and helping others grow is through the roof. I get the chills just thinking about building a winning team and doing the work necessary to achieve success. I love the process. I love the camaraderie of being around a group of people who are committed to winning and reaching their potential. During my second season coaching, after losing an especially tough game, I vividly remember telling our kids to look at what we could do to get better. As a coach, I’ve always believed the next game would be our best. I follow the example of always finding a way to help the team and looking at what we don’t do well, to know what is required for improvement. In life, after each loss, mistake or failure, I encourage you to concentrate on what you need to do to get better and move on. Always have something to look forward to in life! You can draw a tremendous amount of inspiration by having events and goals to aspire to and work towards. My dreams and goals, times with my family, vacations and growth opportunities are all things that get me excited. They get my adrenaline flowing. I refuse to dwell in the negative. There’s always another game, another moment, another way to get better if we’re willing to pursue it. What is your passion? I ask you: what do you find to be the intersection — in your life — between your passion and your natural talents? Identify this! Pursue this! And never, ever give up on improving your skill in this area. This may be coding, writing, coaching or painting. If you have natural talent for something and you love doing it — you have struck gold, my friend. 3. Keep a Positive Attitude at All Times “Like life, basketball is messy and unpredictable. It has its way with you, no matter how hard you try to control it. The trick is to experience each moment with a clear mind and open heart. When you do that, the game — and life — will take care of itself.” — Phil Jackson Let’s be honest — losing and adversity can take its toll on even the most sanguine of people. Losing is not easy, it never has been and never will be. But “losing” is absolutely a part of life. Michael Jordan, Tom Brady, Simone Biles and Maya Moore have all lost and learned from those games. We tend to learn and grow the most from some of our worst experiences and biggest losses. My freshman year of playing college basketball was the biggest challenge I’ve ever had for staying positive. Basketball had always been fun. Suddenly, it no longer was. I had competitively-fueled, broken relationships with players on the team who feared I might take their spot. This led to a negative environment. Most guys were always on-guard and very defensive. Not just on the court! I had to stay positive if I’d survive the season and excel in the classroom. I learned that season the importance of a positive attitude. If you’re willing to stay positive and faithful, this attitude of expectancy, when mixed with hard work, will carry you a long way. Recognize when people are trying to rob you of your joy. Don’t let anyone every deny you of your dreams. Move forward with positive energy and belief in what you can accomplish. Stay positive through the good times and the bad. You never know when your breakthrough moment will come! Better to be prepared and open to opportunity and new relationships, while in a positive state of mind. Oh yeah, enjoy the Final Four this weekend. Hopefully you catch the good-kind of fever that is March Madness! Live Boldly! My upcoming book on Values is due out this Spring. Subscribe for awesome updates on my Newsletter! Like my Facebook writer’s page here! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! KEEP GOING! Good luck! ", "title": "3 Life Lessons to Turn the Negative into Positive — Inspired by March Madness", "sentences": [{"6127": "3 Life Lessons to Turn the Negative into Positive — Inspired by March Madness"}, {"4667": "“It’s what you learn after you know it all that counts.” — Coach John Wooden"}, {"e7d8": "Can you feel the excitement??!! It’s Final Four weekend in men’s and women’s college basketball. This is an incredible time of year for excitement, emotion and dreams to come true. Whether you’re a basketball fan or just a casual observer, it’s hard not to get wrapped up in the excitement of March Madness. As a high school basketball coach — and former college player — I live for this time of year."}, {"9301": "Basketball is one of the biggest parts of my life. I’ve learned such a tremendous amount about life, helping others and myself through the game."}, {"588b": "Today’s lessons are from my freshman year of college basketball and my first two coaching stops in northern Virginia. I hope you see the value in these lessons and apply them to your life!"}, {"5ba9": "1. Show People You Care — Lead with Empathy!"}, {"257b": "“You can’t win, unless you learn to lose.” — Kareem Abdul Jabbar"}, {"2b4f": "One Win. That was all I had to my name during my first season as an assistant high school basketball coach. Taking the positive out of a one-win season is not easy, but it is essential. I learned during my first season that winning is not the only thing that matters — it’s what you learn about yourself, the game and life that are far more important. It is truly the journey — not the destination — that matters most!"}, {"0321": "My coaching career started in northern Virginia at one of the most ethnically diverse high schools in America. Situated just outside of Washington D.C., the school has a large Muslim, Latino and African-American population. Our team’s diversity was a perfect representation of the overall student body. Hard-working, respectful kids who cared for one another."}, {"2630": "This made for a wonderful experience where the coaches and players could all learn about each other’s backgrounds. I learned my first Arabic words and gained insights into the culture of the various communities in the town. The previous season, the team had a .500 winning percentage and left over from that squad were some legitimately talented athletes. I figured there was room for growth."}, {"5b08": "Instead, it was a season of close losses but priceless life lessons."}, {"3979": "Empathy, understanding and positive encouragement are the best operating bases from which to teach people. Particularly during times of adversity, you have to stay positive. This is as true on the basketball court as it is in life! Think about it — what are you facing today that has you down?"}, {"e17b": "Change and tough times are going to affect all of us. If we turn and run away, or face them with a poor attitude, we’ll never learn and improve. In basketball, they say every team “makes a run.” This means, every team gets some momentum going and plays well in spurts for certain parts of a game. This is when everything coalesces and starts gelling for the unit."}, {"ebb0": "Think about what “your run” looks like. How you will get your momentum and inspiration. You’ll find that you inspire others AND yourself when you are a person of empathy and integrity. To form deep connections, show from the beginning that you care about people — beyond a shared objective. When you genuinely care for others, they know it. It’s real and authentic."}, {"3779": "Empathy builds trust and forms long-lasting relationships."}, {"3fd1": "2. There is ALWAYS a Way to Get Better"}, {"5e76": "“There is always someone better than you. Whatever it is that you do for a living, chances are, you will run into a situation in which you are not as talented as the person next to you. That’s when being a competitor can make a difference in your fortunes.” — Coach Pat Summitt"}, {"33fc": "My passion for the game of basketball, competing and helping others grow is through the roof. I get the chills just thinking about building a winning team and doing the work necessary to achieve success. I love the process. I love the camaraderie of being around a group of people who are committed to winning and reaching their potential."}, {"ef6f": "During my second season coaching, after losing an especially tough game, I vividly remember telling our kids to look at what we could do to get better. As a coach, I’ve always believed the next game would be our best. I follow the example of always finding a way to help the team and looking at what we don’t do well, to know what is required for improvement."}, {"91ce": "In life, after each loss, mistake or failure, I encourage you to concentrate on what you need to do to get better and move on. Always have something to look forward to in life! You can draw a tremendous amount of inspiration by having events and goals to aspire to and work towards."}, {"66ac": "My dreams and goals, times with my family, vacations and growth opportunities are all things that get me excited. They get my adrenaline flowing. I refuse to dwell in the negative. There’s always another game, another moment, another way to get better if we’re willing to pursue it."}, {"1069": "What is your passion? I ask you: what do you find to be the intersection — in your life — between your passion and your natural talents? Identify this! Pursue this! And never, ever give up on improving your skill in this area. This may be coding, writing, coaching or painting. If you have natural talent for something and you love doing it — you have struck gold, my friend."}, {"2e08": "3. Keep a Positive Attitude at All Times"}, {"2c5a": "“Like life, basketball is messy and unpredictable. It has its way with you, no matter how hard you try to control it. The trick is to experience each moment with a clear mind and open heart. When you do that, the game — and life — will take care of itself.” — Phil Jackson"}, {"b8b9": "Let’s be honest — losing and adversity can take its toll on even the most sanguine of people. Losing is not easy, it never has been and never will be. But “losing” is absolutely a part of life. Michael Jordan, Tom Brady, Simone Biles and Maya Moore have all lost and learned from those games. We tend to learn and grow the most from some of our worst experiences and biggest losses."}, {"7654": "My freshman year of playing college basketball was the biggest challenge I’ve ever had for staying positive. Basketball had always been fun. Suddenly, it no longer was. I had competitively-fueled, broken relationships with players on the team who feared I might take their spot. This led to a negative environment. Most guys were always on-guard and very defensive. Not just on the court!"}, {"9fff": "I had to stay positive if I’d survive the season and excel in the classroom. I learned that season the importance of a positive attitude."}, {"c01f": "If you’re willing to stay positive and faithful, this attitude of expectancy, when mixed with hard work, will carry you a long way. Recognize when people are trying to rob you of your joy. Don’t let anyone every deny you of your dreams. Move forward with positive energy and belief in what you can accomplish."}, {"86e8": "Stay positive through the good times and the bad. You never know when your breakthrough moment will come! Better to be prepared and open to opportunity and new relationships, while in a positive state of mind. Oh yeah, enjoy the Final Four this weekend. Hopefully you catch the good-kind of fever that is March Madness!"}, {"0197": "Live Boldly!"}, {"a59d": "My upcoming book on Values is due out this Spring. Subscribe for awesome updates on my Newsletter! Like my Facebook writer’s page here! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! KEEP GOING! Good luck!"}], "child": "247_1\t247_2\t247_3\t247_4\t247_5\t247_6\t247_7\t247_8"}