{"name": "249", "parent": "", "content": "The Blueprint for Each Final Four Coach to Guarantee His Team a National Title Coach Titus dishes out some of his infinite wisdom to the programs still vying to cut down the nets I’will be honest: I thought I had a legitimate shot at being named the new Duquesne head basketball coach. For the past few weeks, the Duquesne athletic department seemingly couldn’t find anyone to take the job, mostly because it’s as close to a career-killing gig as exists in the Division I ranks. The Dukes have posted one 20-win season (2008–09) in the past 35 years and haven’t made an NCAA tournament since 1977. The school considers it a success when 1,500 fans show up for a home game. And virtually everyone who was supposed to play a significant role on the 2017–18 roster has recently transferred or decommitted. In the end, the job went to 58-year-old Keith Dambrot, alumnus and former head coach of the University of Akron who is an Akron native, has spent the past 20 years coaching in Akron, and definitely didn’t take the Duquesne job just so he could make a bunch of money and promptly retire. Anyway, as the Duquesne coaching search dragged on and I appeared to be the only candidate willing to accept the job, I slowly started talking myself into my chances. The tiny corner of the internet that I occupy rallied behind me, the Pittsburgh Post-Gazette endorsed me, and most importantly, at least 10 people sent me emails that were addressed to “Coach Titus.” Honestly, once things got to that point, it no longer mattered whether I got the job. What mattered is that strangers were calling me “Coach,” which is all I ever really wanted. Because as has been proved by Grant Hill calling Bill Raftery “Coach,” even though Raftery never accomplished anything of significance as a coach and hasn’t coached since 1981, getting tagged with the “Coach” label is something that you carry for life. So with that, allow me to introduce myself. I’m Coach Titus, and I’m here to break down the Final Four. More specifically, I’m here to explain how I’d approach each coaching situation for the teams still vying for the title. South Carolina Motivational angle: South Carolina, the no. 7 seed in the East region, is the closest thing the 2017 Final Four has to a Cinderella. If I’m Frank Martin, I tap into that as much as I can. I’d go all in with the “nobody believes in us” trope, and I’d sprinkle in some “we have nothing to lose because we’re not even supposed to be here” messaging to keep the team loose. The one thing I’d be careful to avoid is telling the players that everyone thinks they suck too much, as that runs the risk of guys shifting their mind-set from “let’s prove them wrong!” to “maybe everyone is right and we really aren’t that good.” Considering that the Gamecocks weren’t supposed to win any of their past three games, I’m confident Martin long ago figured out how to strike the right balance. Biggest off-court challenge: South Carolina is the media darling of this Final Four, which is great in the sense that America is learning all sorts of cool things about the Gamecocks. For instance: Did you know there’s more to Frank Martin than him just losing his goddamn mind every so often, and that he’s actually a real person who had a real life before becoming Kansas State’s head coach in 2007? I know. I couldn’t believe it either. Sindarius Thornwell (Getty Images) The downside to getting all this publicity, though, is that it can sometimes become a distraction. As someone who has been on the bench for a Final Four, Coach Titus knows the issues that Martin is facing. The lead-up to Saturday is absolute chaos: There’s the multitude of media requests; the dinner, banquet, and ring-sizing procedures; the practicing in different environments; and the fans waiting in the lobby to kiss your ass and tell you how great you are every time you enter or leave the hotel. It’s hard enough for Final Four teams to navigate everything and remain focused on the game. Now, on top of that, Martin has to convince his guys to stay locked in and disregard how he told America that he basically stalked his wife. Then again, there isn’t a ton of strategy that South Carolina needs to worry about, since nothing about Gonzaga’s system is unique. In that regard, Coach Titus would let the players enjoy this week as much as possible. My only demand would be a couple of film sessions where we would discuss little things like how often we should double-team Przemek Karnowski and whether Zach Collins looks like T.J. McConnell. Biggest strategic decision: Sindarius Thornwell is the best player remaining in this tournament and the only reliable source of offense that South Carolina has, so I’d expect Gonzaga to do all it can to take Thornwell out of Saturday’s game. The Zags are great defensively and seem unlikely to turn to a junk zone (like a triangle-and-2 or a box-and-1), but they might throw double-teams at Thornwell, or at the very least pack the paint when he catches the ball to ensure that a ton of help is always nearby. Knowing this, Martin should make two things clear to his team: (1) Thornwell can’t fall into Gonzaga’s trap and force things because he thinks he has to do all the scoring, and (2) someone else on South Carolina — most likely point guard PJ Dozier, who should have a size advantage no matter who is matched up with him — has to step up and have a monster game. Frank Martin Is So Mad That South Carolina Made the Final FourMartin may look like the maddest man on the planet, but his players say they love him, and his teams play some of the…theringer.com Gonzaga Motivational angle: Most of the talk surrounding Gonzaga concerns how the program finally broke through and made its first Final Four after almost two decades of building a (completely ridiculous and inaccurate) reputation as a choker in March. This would worry me a bit if I were Mark Few. Regardless of what the Zags’ history might suggest, this team is no Cinderella, and it would be a shame to pretend like it’s reached the top of the mountain when there are two more games to be won. Still, this has been a magical year for Gonzaga, which has a real chance to become the first mid-major to win a national championship since UNLV in 1990. Taking all of this into account, Coach Titus would give a pregame speech that blends the “we still have work to do” sentiment with a little “be sure to soak this all in because you’ll forever be a part of history” talk. In other words, a hybrid of Jake Taylor from Major League and Merle from Hoosiers: “Well, I guess there’s only one thing left to do. Let’s go win the whole fucking thing for all the small schools that never had a chance to get here.” Biggest off-court challenge: I’m not saying that Gonzaga faces a ton of pressure to win the title. I’m just saying that ESPN’s Dana O’Neil wrote an article on Wednesday that made the case the entire university was saved by Few’s program. Just think about that for a second. The big North Carolina story right now is that Luke Maye went to class at 8 a.m. the morning after hitting the game winner to beat Kentucky. The South Carolina story is that Frank Martin is an actual human being. The Oregon story is, well, we’ll get to that in a second. The Gonzaga story is, “Hey, congrats on your first Final Four! Did you know that the entire economy of Eastern Washington is counting on you guys to not screw this up? Welp, good luck!” Przemek Karnowski (Getty Images) I doubt that Gonzaga’s players are even aware that the Bulldogs teams of the early 2000s kept the university from going under, but it’s clear that no college basketball team means as much to its local community as the Zags. That’s why I’m guessing fans have had mixed emotions all week, alternating between celebrating the Final Four and being nervous as balls that Gonzaga is going to blow it and everyone will revert to saying this team is overrated and never played anybody. Coach Titus would address this by reminding the players that the program and university will be in good shape moving forward no matter what happens this weekend, and that they have nothing to be nervous about because they’re the best team left in the field. Biggest strategic decision: South Carolina’s defense, which is essentially what you’d get if you condensed West Virginia’s press into a half-court format, could pose problems for a Gonzaga team that struggled with turnovers in its Sweet 16 win over the Mountaineers. But there’s nothing Few can do about that. The Zags will run the same stuff they have all year, and it will be up to the players to avoid panicking and be strong with the ball. That’s why I think the real strategy will come on the other end of the floor, where Few will have to decide how many defenders he wants to throw at Thornwell. Coach Titus would just play Thornwell straight up to start, pack the paint on the weak side and offer aggressive help, and live with giving up some open 3-point looks to guys not named Thornwell. Thornwell is 11-of-26 from deep in the tourney; South Carolina’s other players are a combined 14-of-50. The Three Most Important Matchups to Watch in Each Final Four GameHow will Gonzaga defend the SEC Player of the Year? How will Oregon handle the ACC Player of the Year?theringer.com Oregon Motivational angle: Remember when I said we’d get to the big Oregon story in a second? Well, here’s the thing: There doesn’t seem to be one. Maybe I’m just looking in the wrong places, but I’m pretty sure the Ducks are the most underrepresented Final Four team in terms of media coverage. That may be a product of East Coast bias, of people assuming that North Carolina is going to steamroll them, or of the notion that there’s just nothing about Oregon that’s as interesting as Frank Martin, Luke Maye, or a Cinderella blossoming into a juggernaut. Whatever the case, Coach Titus would bring this up all week and utilize a cousin of the “nobody believes in us” approach by going with the “they don’t want you here” speech. I might even take things one step further and convince my team that the NCAA has devised a conspiracy to make North Carolina meet Gonzaga in the title game “for ratings,” and that the only way we can stop it is by leaving no doubt that we’re the better team on Saturday. Dillon Brooks (Getty Images) Biggest off-court challenge: If there are stories surrounding Oregon this week, they likely have to do with shooting guard Tyler Dorsey and forward Jordan Bell comprising one hell of an NBA Jam duo throughout this tournament. This is obviously great news for the Ducks. It’s just that the explosion of those two guys comes at an interesting time, as on Tuesday Pac-12 Player of the Year Dillon Brooks was named an AP second-team All-American. The concern for Dana Altman is that a power struggle might unfold against North Carolina, where Brooks forces the action in an attempt to reclaim his throne as Oregon’s alpha dog. And no, I don’t have reason to believe that Brooks is petty enough to worry about bullshit like that when a national title is on the line. But it’s human nature to have some ego, and Brooks might feel like he has to carry the team anyway, as he figures to be matched up with a Carolina big all game, while Dorsey could have Justin Jackson, who is four inches taller than he is, draped all over him. Coach Titus would handle this by going to one of the oldest moves in the coaching playbook: I’d tell Brooks to stay patient and take what comes to him, because even if he ends up with mediocre stats, I can always just “make some calls to the NBA” to take care of his draft stock. Biggest strategic decision: Oregon is in a bind defensively given that the Ducks really have only two serviceable big men while North Carolina has somewhere in the neighborhood of a shit ton. If the Ducks play straight-up man-to-man, they’ll be stuck with Brooks having to guard Isaiah Hicks, a matchup that would likely go poorly for them. But if Oregon goes to a zone (or to a switching man-to-man, which is basically a zone) and dares Carolina to make 3s, it becomes susceptible to giving up offensive rebounds to the best rebounding team in the country. This is truly a terrible matchup for a Ducks defense that has been pretty good all season. Coach Titus would regularly switch things up, try to disrupt Carolina’s rhythm, and hope that the players score enough on the other end to pull out a win. Oregon’s Tyler Dorsey Has Turned the NCAA Tournament Into a Video GameCan he keep setting the nets on fire for two more games?theringer.com North Carolina Motivational angle: It’s going to be difficult for Roy Williams to play the underdog card with this group, seeing as North Carolina is a no. 1 seed, the Vegas favorite to win the championship, and a team that’s been ranked in the top 10 of the AP poll for most of the season. But he does have an ace up his sleeve with the Kris Jenkins shot that sunk the Heels in last year’s title game. Coach Titus would harp on that as much as possible and throw in some shit about how “we have unfinished business” and how “all these other teams are just happy to be here.” That’s really the only approach to take in this situation. The other programs can all convince themselves that they’re Cinderellas to some degree, and that they have nothing to lose in the Final Four. North Carolina should go in the opposite direction, become pissed off and businesslike, and try to crush its opponents in the next two games so badly that the NCAA will retroactively give the program the 2016 title, too. Joel Berry II (Getty Images) Biggest off-court challenge: Carolina’s system is a machine that, when running properly, doesn’t have to rely on any one player like many other offenses around the country do. The paradox to it is that the only way the machine can run properly is if the point guard — in this case, Joel Berry II — pushes the tempo, gets the ball where it needs to be, and picks spots to chase his own points. The problem is that Berry’s health for Saturday’s game is in question because he’s currently nursing two sprained ankles, which, if my math checks out, leaves him with zero good ones. And while North Carolina’s massive size advantage over Oregon could help the Tar Heels overcome an ineffective Berry on Saturday, the same can’t be said about a potential national championship matchup against either Gonzaga or South Carolina. Coach Titus’s top priority would be giving Berry ice packs, hot tubs, PEDs, Robitussin, Icy Hot, Bojangles’, fake classes, and anything else he needs to get back to 100 percent. Biggest strategic decision: I wrote on Monday about how I expect Luke Maye, North Carolina’s hero against Kentucky, to stay in the spotlight in the Final Four, mostly because I expect Oregon to play a lot of zone against the Heels and because Maye is the perfect high-post zonebuster on North Carolina’s roster. But here’s the inconvenient truth: Maye is ninth on the team in minutes for a reason, and that’s because he is a defensive liability. This is worrisome because Maye figures to play a significant chunk of minutes on Saturday and might have to guard Dillon Brooks in stretches, a hypothetical that would give me night sweats if I were a North Carolina fan. You can live with all of this if Maye is continuing his offensive hot streak, but what happens if he goes cold? And how many freebie misses is Williams going to give him? If you bench Maye after he misses one shot, you could prematurely stifle the South region’s Most Outstanding Player and the hottest hand on your team. But if Maye loses the magic touch and you leave him on the floor in hopes that he rediscovers it, you’ve put yourself in a position where you’re trusting a bad defender who isn’t scoring. In other words, Williams just might have the Spike Albrecht Conundrum on his hands, a situation that even an advanced basketball mind like Coach Titus isn’t sure how to handle. I can tell you this, though: I’ll know for certain what Roy should have done after Saturday’s game is over. Hindsight armchair coaching is where Coach Titus truly excels. ", "title": "The Blueprint for Each Final Four Coach to Guarantee His Team a National Title", "sentences": [{"c6e4": "The Blueprint for Each Final Four Coach to Guarantee His Team a National Title"}, {"90f7": "Coach Titus dishes out some of his infinite wisdom to the programs still vying to cut down the nets"}, {"08c6": "I’will be honest: I thought I had a legitimate shot at being named the new Duquesne head basketball coach. For the past few weeks, the Duquesne athletic department seemingly couldn’t find anyone to take the job, mostly because it’s as close to a career-killing gig as exists in the Division I ranks. The Dukes have posted one 20-win season (2008–09) in the past 35 years and haven’t made an NCAA tournament since 1977. The school considers it a success when 1,500 fans show up for a home game. And virtually everyone who was supposed to play a significant role on the 2017–18 roster has recently transferred or decommitted. In the end, the job went to 58-year-old Keith Dambrot, alumnus and former head coach of the University of Akron who is an Akron native, has spent the past 20 years coaching in Akron, and definitely didn’t take the Duquesne job just so he could make a bunch of money and promptly retire."}, {"2f82": "Anyway, as the Duquesne coaching search dragged on and I appeared to be the only candidate willing to accept the job, I slowly started talking myself into my chances. The tiny corner of the internet that I occupy rallied behind me, the Pittsburgh Post-Gazette endorsed me, and most importantly, at least 10 people sent me emails that were addressed to “Coach Titus.” Honestly, once things got to that point, it no longer mattered whether I got the job. What mattered is that strangers were calling me “Coach,” which is all I ever really wanted. Because as has been proved by Grant Hill calling Bill Raftery “Coach,” even though Raftery never accomplished anything of significance as a coach and hasn’t coached since 1981, getting tagged with the “Coach” label is something that you carry for life."}, {"c3bd": "So with that, allow me to introduce myself. I’m Coach Titus, and I’m here to break down the Final Four. More specifically, I’m here to explain how I’d approach each coaching situation for the teams still vying for the title."}, {"da3f": "South Carolina"}, {"75dc": "Motivational angle: South Carolina, the no. 7 seed in the East region, is the closest thing the 2017 Final Four has to a Cinderella. If I’m Frank Martin, I tap into that as much as I can. I’d go all in with the “nobody believes in us” trope, and I’d sprinkle in some “we have nothing to lose because we’re not even supposed to be here” messaging to keep the team loose. The one thing I’d be careful to avoid is telling the players that everyone thinks they suck too much, as that runs the risk of guys shifting their mind-set from “let’s prove them wrong!” to “maybe everyone is right and we really aren’t that good.” Considering that the Gamecocks weren’t supposed to win any of their past three games, I’m confident Martin long ago figured out how to strike the right balance."}, {"ceba": "Biggest off-court challenge: South Carolina is the media darling of this Final Four, which is great in the sense that America is learning all sorts of cool things about the Gamecocks. For instance: Did you know there’s more to Frank Martin than him just losing his goddamn mind every so often, and that he’s actually a real person who had a real life before becoming Kansas State’s head coach in 2007? I know. I couldn’t believe it either."}, {"a4de": "Sindarius Thornwell (Getty Images)"}, {"979c": "The downside to getting all this publicity, though, is that it can sometimes become a distraction. As someone who has been on the bench for a Final Four, Coach Titus knows the issues that Martin is facing. The lead-up to Saturday is absolute chaos: There’s the multitude of media requests; the dinner, banquet, and ring-sizing procedures; the practicing in different environments; and the fans waiting in the lobby to kiss your ass and tell you how great you are every time you enter or leave the hotel. It’s hard enough for Final Four teams to navigate everything and remain focused on the game. Now, on top of that, Martin has to convince his guys to stay locked in and disregard how he told America that he basically stalked his wife."}, {"3dc5": "Then again, there isn’t a ton of strategy that South Carolina needs to worry about, since nothing about Gonzaga’s system is unique. In that regard, Coach Titus would let the players enjoy this week as much as possible. My only demand would be a couple of film sessions where we would discuss little things like how often we should double-team Przemek Karnowski and whether Zach Collins looks like T.J. McConnell."}, {"c412": "Biggest strategic decision: Sindarius Thornwell is the best player remaining in this tournament and the only reliable source of offense that South Carolina has, so I’d expect Gonzaga to do all it can to take Thornwell out of Saturday’s game. The Zags are great defensively and seem unlikely to turn to a junk zone (like a triangle-and-2 or a box-and-1), but they might throw double-teams at Thornwell, or at the very least pack the paint when he catches the ball to ensure that a ton of help is always nearby. Knowing this, Martin should make two things clear to his team: (1) Thornwell can’t fall into Gonzaga’s trap and force things because he thinks he has to do all the scoring, and (2) someone else on South Carolina — most likely point guard PJ Dozier, who should have a size advantage no matter who is matched up with him — has to step up and have a monster game."}, {"9c88": "Frank Martin Is So Mad That South Carolina Made the Final FourMartin may look like the maddest man on the planet, but his players say they love him, and his teams play some of the…theringer.com"}, {"f1b8": "Gonzaga"}, {"95a5": "Motivational angle: Most of the talk surrounding Gonzaga concerns how the program finally broke through and made its first Final Four after almost two decades of building a (completely ridiculous and inaccurate) reputation as a choker in March. This would worry me a bit if I were Mark Few. Regardless of what the Zags’ history might suggest, this team is no Cinderella, and it would be a shame to pretend like it’s reached the top of the mountain when there are two more games to be won. Still, this has been a magical year for Gonzaga, which has a real chance to become the first mid-major to win a national championship since UNLV in 1990. Taking all of this into account, Coach Titus would give a pregame speech that blends the “we still have work to do” sentiment with a little “be sure to soak this all in because you’ll forever be a part of history” talk. In other words, a hybrid of Jake Taylor from Major League and Merle from Hoosiers: “Well, I guess there’s only one thing left to do. Let’s go win the whole fucking thing for all the small schools that never had a chance to get here.”"}, {"a465": "Biggest off-court challenge: I’m not saying that Gonzaga faces a ton of pressure to win the title. I’m just saying that ESPN’s Dana O’Neil wrote an article on Wednesday that made the case the entire university was saved by Few’s program. Just think about that for a second. The big North Carolina story right now is that Luke Maye went to class at 8 a.m. the morning after hitting the game winner to beat Kentucky. The South Carolina story is that Frank Martin is an actual human being. The Oregon story is, well, we’ll get to that in a second. The Gonzaga story is, “Hey, congrats on your first Final Four! Did you know that the entire economy of Eastern Washington is counting on you guys to not screw this up? Welp, good luck!”"}, {"276e": "Przemek Karnowski (Getty Images)"}, {"ea59": "I doubt that Gonzaga’s players are even aware that the Bulldogs teams of the early 2000s kept the university from going under, but it’s clear that no college basketball team means as much to its local community as the Zags. That’s why I’m guessing fans have had mixed emotions all week, alternating between celebrating the Final Four and being nervous as balls that Gonzaga is going to blow it and everyone will revert to saying this team is overrated and never played anybody. Coach Titus would address this by reminding the players that the program and university will be in good shape moving forward no matter what happens this weekend, and that they have nothing to be nervous about because they’re the best team left in the field."}, {"bea6": "Biggest strategic decision: South Carolina’s defense, which is essentially what you’d get if you condensed West Virginia’s press into a half-court format, could pose problems for a Gonzaga team that struggled with turnovers in its Sweet 16 win over the Mountaineers. But there’s nothing Few can do about that. The Zags will run the same stuff they have all year, and it will be up to the players to avoid panicking and be strong with the ball. That’s why I think the real strategy will come on the other end of the floor, where Few will have to decide how many defenders he wants to throw at Thornwell. Coach Titus would just play Thornwell straight up to start, pack the paint on the weak side and offer aggressive help, and live with giving up some open 3-point looks to guys not named Thornwell. Thornwell is 11-of-26 from deep in the tourney; South Carolina’s other players are a combined 14-of-50."}, {"175e": "The Three Most Important Matchups to Watch in Each Final Four GameHow will Gonzaga defend the SEC Player of the Year? How will Oregon handle the ACC Player of the Year?theringer.com"}, {"3c97": "Oregon"}, {"c49b": "Motivational angle: Remember when I said we’d get to the big Oregon story in a second? Well, here’s the thing: There doesn’t seem to be one. Maybe I’m just looking in the wrong places, but I’m pretty sure the Ducks are the most underrepresented Final Four team in terms of media coverage. That may be a product of East Coast bias, of people assuming that North Carolina is going to steamroll them, or of the notion that there’s just nothing about Oregon that’s as interesting as Frank Martin, Luke Maye, or a Cinderella blossoming into a juggernaut. Whatever the case, Coach Titus would bring this up all week and utilize a cousin of the “nobody believes in us” approach by going with the “they don’t want you here” speech."}, {"e539": "I might even take things one step further and convince my team that the NCAA has devised a conspiracy to make North Carolina meet Gonzaga in the title game “for ratings,” and that the only way we can stop it is by leaving no doubt that we’re the better team on Saturday."}, {"7077": "Dillon Brooks (Getty Images)"}, {"30dd": "Biggest off-court challenge: If there are stories surrounding Oregon this week, they likely have to do with shooting guard Tyler Dorsey and forward Jordan Bell comprising one hell of an NBA Jam duo throughout this tournament. This is obviously great news for the Ducks. It’s just that the explosion of those two guys comes at an interesting time, as on Tuesday Pac-12 Player of the Year Dillon Brooks was named an AP second-team All-American. The concern for Dana Altman is that a power struggle might unfold against North Carolina, where Brooks forces the action in an attempt to reclaim his throne as Oregon’s alpha dog. And no, I don’t have reason to believe that Brooks is petty enough to worry about bullshit like that when a national title is on the line. But it’s human nature to have some ego, and Brooks might feel like he has to carry the team anyway, as he figures to be matched up with a Carolina big all game, while Dorsey could have Justin Jackson, who is four inches taller than he is, draped all over him."}, {"ef69": "Coach Titus would handle this by going to one of the oldest moves in the coaching playbook: I’d tell Brooks to stay patient and take what comes to him, because even if he ends up with mediocre stats, I can always just “make some calls to the NBA” to take care of his draft stock."}, {"dcf8": "Biggest strategic decision: Oregon is in a bind defensively given that the Ducks really have only two serviceable big men while North Carolina has somewhere in the neighborhood of a shit ton. If the Ducks play straight-up man-to-man, they’ll be stuck with Brooks having to guard Isaiah Hicks, a matchup that would likely go poorly for them. But if Oregon goes to a zone (or to a switching man-to-man, which is basically a zone) and dares Carolina to make 3s, it becomes susceptible to giving up offensive rebounds to the best rebounding team in the country. This is truly a terrible matchup for a Ducks defense that has been pretty good all season. Coach Titus would regularly switch things up, try to disrupt Carolina’s rhythm, and hope that the players score enough on the other end to pull out a win."}, {"cc41": "Oregon’s Tyler Dorsey Has Turned the NCAA Tournament Into a Video GameCan he keep setting the nets on fire for two more games?theringer.com"}, {"52ff": "North Carolina"}, {"4fcf": "Motivational angle: It’s going to be difficult for Roy Williams to play the underdog card with this group, seeing as North Carolina is a no. 1 seed, the Vegas favorite to win the championship, and a team that’s been ranked in the top 10 of the AP poll for most of the season. But he does have an ace up his sleeve with the Kris Jenkins shot that sunk the Heels in last year’s title game. Coach Titus would harp on that as much as possible and throw in some shit about how “we have unfinished business” and how “all these other teams are just happy to be here.” That’s really the only approach to take in this situation. The other programs can all convince themselves that they’re Cinderellas to some degree, and that they have nothing to lose in the Final Four. North Carolina should go in the opposite direction, become pissed off and businesslike, and try to crush its opponents in the next two games so badly that the NCAA will retroactively give the program the 2016 title, too."}, {"e6ca": "Joel Berry II (Getty Images)"}, {"811c": "Biggest off-court challenge: Carolina’s system is a machine that, when running properly, doesn’t have to rely on any one player like many other offenses around the country do. The paradox to it is that the only way the machine can run properly is if the point guard — in this case, Joel Berry II — pushes the tempo, gets the ball where it needs to be, and picks spots to chase his own points. The problem is that Berry’s health for Saturday’s game is in question because he’s currently nursing two sprained ankles, which, if my math checks out, leaves him with zero good ones. And while North Carolina’s massive size advantage over Oregon could help the Tar Heels overcome an ineffective Berry on Saturday, the same can’t be said about a potential national championship matchup against either Gonzaga or South Carolina. Coach Titus’s top priority would be giving Berry ice packs, hot tubs, PEDs, Robitussin, Icy Hot, Bojangles’, fake classes, and anything else he needs to get back to 100 percent."}, {"ed5f": "Biggest strategic decision: I wrote on Monday about how I expect Luke Maye, North Carolina’s hero against Kentucky, to stay in the spotlight in the Final Four, mostly because I expect Oregon to play a lot of zone against the Heels and because Maye is the perfect high-post zonebuster on North Carolina’s roster. But here’s the inconvenient truth: Maye is ninth on the team in minutes for a reason, and that’s because he is a defensive liability. This is worrisome because Maye figures to play a significant chunk of minutes on Saturday and might have to guard Dillon Brooks in stretches, a hypothetical that would give me night sweats if I were a North Carolina fan."}, {"edb1": "You can live with all of this if Maye is continuing his offensive hot streak, but what happens if he goes cold? And how many freebie misses is Williams going to give him? If you bench Maye after he misses one shot, you could prematurely stifle the South region’s Most Outstanding Player and the hottest hand on your team. But if Maye loses the magic touch and you leave him on the floor in hopes that he rediscovers it, you’ve put yourself in a position where you’re trusting a bad defender who isn’t scoring. In other words, Williams just might have the Spike Albrecht Conundrum on his hands, a situation that even an advanced basketball mind like Coach Titus isn’t sure how to handle."}, {"afd7": "I can tell you this, though: I’ll know for certain what Roy should have done after Saturday’s game is over. Hindsight armchair coaching is where Coach Titus truly excels."}], "child": "249_1\t249_2\t249_3\t249_4\t249_5\t249_6\t249_7\t249_8"}