{"name": "253", "parent": "", "content": "Stop Complaining & Start Creating the World You Want to Live In This morning, Jonas Ellison issued a call to action. Not the typical “hey, grab this 5-page pdf that does nothing valuable” call to action. But a real, human-centric urging for readers to make a difference, not in their life, but in the life of another. After receiving hundreds of emails from readers who found themselves in a dark place, Jonas wanted to help. Not merely by giving advice, because if you have ever gone through a dark night of the soul, you know that most “advice” does very little to help your situation. Instead, he wanted to be there with them. To offer them his loving eyes, without the need to “fix” the problem. One reader, in particular, Jennifer Marie Gady, reached out to Jonas and opened her soul to him. She, like I have many times, was looking for answers. I’m not sure exactly what she said or what she is going through, but what I do know is she is a human that is trying to create beauty with her art, and along with that comes a lot of self-doubt, loneliness, and darkness. Something I understand very intimately. However, if you have ever studied any wisdom tradition you know that peace does not come from advice or answers, but from the acceptance of nuance and cognitive dissonance in the world. It comes not from filling the void, but from letting the void remain empty. But most potently, healing comes from a sense of belonging. So, as a means to offer love to Jennifer, Jonas came up with an alternative solution to let her know that she is loved and not alone. Be The Love You Desire His call to action, and now mine to you, is this. 1. Meditate, pray, go for a run, listen to the Mighty Ducks Theme song or do whatever you need to do to cultivate a deep sense of love2. Take a picture of your loving eyes3. Post it on Medium in a new Story or Series4. Tag @ Jennifer Marie Gady & @ Jonas Ellison (Do not copy this it won’t work)5. Done. I promise it will make YOUR day better too. Sending Love to Jennifer Marie Gady with Jonas Ellison If we are to change the world, it starts with you and me. Not the politicians. Not with the rainforest. Not by posting another comment on a Facebook thread. No, it starts, and ultimately ends with, human beings standing united for one another. By choosing love over fear. By following Gandhi’s declaration to be the change you wish to see in the world. The Simple “United” Truth I find it ironic that an airline branded as United, is in the throes of a national scandal caused by utter separation. I deeply feel for the dear doctor who was dragged off the plane for failing to give up the seat he paid for, but at the same time how the hell did it come to that. Instead of video taping the disaster, was there not a single person on the entire plane willing to give up their seat (and receive compensation), so that the doctor could get home to his patients? And what is worse is that the majority of people on that plane have probably spent the last several months complaining on their various social channels about the state of our country. But when tasked with doing something about it themselves, no one stood up and said, “you know what, I can get home a couple hours late. Take my seat.” Take A Stand It’s easy to sit behind a computer screen and shout about your beliefs, but much harder to act them out. Today, Jonas offered us all an opportunity to mobilize our beliefs and helps someone that needs it. It’s our call to action as humans to help others, and who knows, in the process you may just help yourself too. My purpose in life is to create a tribe (similar to Jonas Ellison’s) that empowers the beautiful people of the world to stand up for themselves and others and create a business and life that matters. I want to help people act from a place of grounded love and compassion to make this world better. For people who are struggling, sometimes all they need is to know that they are loved. That they are not alone. That there are amazing people all over the world with loving eyes waiting to show them love. If we all do a little bit every day to help one another, the macro effects will be tremendous, but even if it’s just a couple people sending selfies to someone else who needs some love that’s fine. It’s why you are here right? Stop complaining about the world you want. And start creating it. Go Deeper Are you ready to wake up, get more focused, and find more happiness in your life? If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness! If you are ready to take back control of your life and start living above stress and overwhelm… Sign Up Here! One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. ", "title": "Stop Complaining & Start Creating the World You Want to Live In", "sentences": [{"825e": "Stop Complaining & Start Creating the World You Want to Live In"}, {"fd04": "This morning, Jonas Ellison issued a call to action."}, {"032d": "Not the typical “hey, grab this 5-page pdf that does nothing valuable” call to action. But a real, human-centric urging for readers to make a difference, not in their life, but in the life of another."}, {"2737": "After receiving hundreds of emails from readers who found themselves in a dark place, Jonas wanted to help. Not merely by giving advice, because if you have ever gone through a dark night of the soul, you know that most “advice” does very little to help your situation. Instead, he wanted to be there with them. To offer them his loving eyes, without the need to “fix” the problem."}, {"cbe6": "One reader, in particular, Jennifer Marie Gady, reached out to Jonas and opened her soul to him. She, like I have many times, was looking for answers. I’m not sure exactly what she said or what she is going through, but what I do know is she is a human that is trying to create beauty with her art, and along with that comes a lot of self-doubt, loneliness, and darkness."}, {"0aa8": "Something I understand very intimately."}, {"7782": "However, if you have ever studied any wisdom tradition you know that peace does not come from advice or answers, but from the acceptance of nuance and cognitive dissonance in the world. It comes not from filling the void, but from letting the void remain empty."}, {"7ddb": "But most potently, healing comes from a sense of belonging."}, {"4321": "So, as a means to offer love to Jennifer, Jonas came up with an alternative solution to let her know that she is loved and not alone."}, {"0607": "Be The Love You Desire"}, {"b6c0": "His call to action, and now mine to you, is this."}, {"574c": "1. Meditate, pray, go for a run, listen to the Mighty Ducks Theme song or do whatever you need to do to cultivate a deep sense of love2. Take a picture of your loving eyes3. Post it on Medium in a new Story or Series4. Tag @ Jennifer Marie Gady & @ Jonas Ellison (Do not copy this it won’t work)5. Done."}, {"8b1d": "I promise it will make YOUR day better too."}, {"060e": "Sending Love to Jennifer Marie Gady with Jonas Ellison"}, {"0f25": "If we are to change the world, it starts with you and me. Not the politicians. Not with the rainforest. Not by posting another comment on a Facebook thread."}, {"282a": "No, it starts, and ultimately ends with, human beings standing united for one another. By choosing love over fear. By following Gandhi’s declaration to be the change you wish to see in the world."}, {"ed01": "The Simple “United” Truth"}, {"0595": "I find it ironic that an airline branded as United, is in the throes of a national scandal caused by utter separation."}, {"f1ee": "I deeply feel for the dear doctor who was dragged off the plane for failing to give up the seat he paid for, but at the same time how the hell did it come to that."}, {"a067": "Instead of video taping the disaster, was there not a single person on the entire plane willing to give up their seat (and receive compensation), so that the doctor could get home to his patients?"}, {"fe3a": "And what is worse is that the majority of people on that plane have probably spent the last several months complaining on their various social channels about the state of our country."}, {"fe99": "But when tasked with doing something about it themselves, no one stood up and said, “you know what, I can get home a couple hours late. Take my seat.”"}, {"103a": "Take A Stand"}, {"c0c0": "It’s easy to sit behind a computer screen and shout about your beliefs, but much harder to act them out."}, {"cc63": "Today, Jonas offered us all an opportunity to mobilize our beliefs and helps someone that needs it. It’s our call to action as humans to help others, and who knows, in the process you may just help yourself too."}, {"e379": "My purpose in life is to create a tribe (similar to Jonas Ellison’s) that empowers the beautiful people of the world to stand up for themselves and others and create a business and life that matters. I want to help people act from a place of grounded love and compassion to make this world better."}, {"5966": "For people who are struggling, sometimes all they need is to know that they are loved. That they are not alone. That there are amazing people all over the world with loving eyes waiting to show them love."}, {"260d": "If we all do a little bit every day to help one another, the macro effects will be tremendous, but even if it’s just a couple people sending selfies to someone else who needs some love that’s fine. It’s why you are here right?"}, {"daf7": "Stop complaining about the world you want. And start creating it."}, {"98d9": "Go Deeper"}, {"2df0": "Are you ready to wake up, get more focused, and find more happiness in your life?"}, {"c4f9": "If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness!"}, {"2536": "If you are ready to take back control of your life and start living above stress and overwhelm…"}, {"6f22": "Sign Up Here!"}, {"5a33": "One last thing…"}, {"336f": "If you liked this article, click the💚 below so other people will see it here on Medium."}], "child": "253_1\t253_2\t253_3\t253_4\t253_5\t253_6"}