{"name": "257", "parent": "", "content": "8 Things That Will Stop You From Being A Successful Phenomenon Disempowering habits are what are holding you back from having similar success to Elon Musk. The trick is that you need to have discipline about the tasks that you repeat daily. The more you repeat something, the more it becomes ingrained into your being. So why would you want to repeat a task that hijacks your future success? There are so many events in your life that begin with a choice. Success is not about being lucky and it’s not just about hard work. Becoming successful is about making tiny shifts in your decision-making power. Making empowering choices instead of following what everyone is doing is what will help you carve your own path. The idea is that you want to be you and stand out from all the failures that you come into contact with every day. In this post, I am going to focus on what is holding you back. Each point may seem insignificant, although, when you practice all of them together, the result is an increased level of consciousness and understanding about what you need to achieve greatness consistently. Below are the 8 things that you should stop if you want to be a successful phenomenon: 1. Turn off the news “There is no news like bad news.” This quote comes from the James Bond movie “Tomorrow Never Dies.” It’s the best way I can describe what the traditional media is feeding your mind. The junk food they serve is designed to get your attention, not make you successful. It’s a practice that many of us find challenging to change because we grew up on bad news. I am now four years clean (from the news). It’s blocked on my internet browser, iPhone, Facebook and anywhere else that they might be able to infect my life. It took about twelve months, but once the disease was cured, I began to think differently. The news does keep you informed, but it’s laced with cyanide. The perspective that is often given doesn’t build people up and encourage us to crush our goals. Instead, the news tells you how everything is going wrong in the world and how you should stay at home, lock your door, and not take any risks in life because you might fail. This way of thinking will permanently separate you from your dream. Your world inside your head is crucial to you finding your way in life. You can’t break through the barriers of failure if you surround yourself with solutions that highlight people who haven’t achieved their dreams. “It’s easy to find people who have messed up or who are out of control; it’s much more difficult to find the 0.01% who achieve their dreams” — Tim Denning 2. Dressing poorly The way you look matters despite what some people might tell you. Before you even open your mouth people are judging you, and you want to give off a feeling of success as soon as you meet someone. Even a minimalist like me understands that presentation is something you should strive for. Time is not an excuse, and there are always well-priced clothes available if you know where to look. For guys, get yourself a few nice suits and if you have no idea what to wear, then wear a suit. A suit takes away all the decision making because it screams success and makes you look good. Here are a few tips to wearing a suit:– It has to be tailored otherwise it will look sloppy– Add some bright colors with a shirt or tie– Make sure you wear shiny black shoes (shoes make or break a good suit)– Get your suit dry cleaned once or twice a year– Hang your suit up after you wear it– Iron your shirts well (see Youtube for tips) For girls, your options are limitless. Clothes that aren’t baggy and fit well, with a touch of facial makeup, can make all the difference. (I’ll leave it there as I am not an expert in female fashion). Even when you are going to the grocery store, take pride in what you’re wearing — you never know who you will meet. I read in Napoleon Hill’s book “The Law Of Success” about a man that wore his best clothes when he would walk down the street every day. People would see him walk past and assume he was a multi-millionaire. What they didn’t know was that he was poor and looking for his next break. Eventually, he was discovered by a successful businessman, given a job, and he was able to build a career that many of us could only dream of. That’s the power of dressing well. Clothes change your mood too. When you dress well, you feel successful, and you become more confident. It’s the little things that add up to you becoming a successful phenomenon. Next time you’re feeling down, pop on your best outfit, put on a smile, and go be you! 3. Lack of self-control All day, as we walk around our cities, we are confronted by people that are doing things which annoy us. This is a fact of life, and there are two choices we can make: 1. We can react and yell abuse or give a look of disgust2. We can take control, breathe, and make a conscious decision not to react I see people all the time who choose the first option, and then they wonder why they have a bad day. When you do something unkind to someone else, they only replicate the same behavior back at you. By having more self-control and choosing the second option, you become more resilient. You learn to adapt to stressful situations and people. Your mind becomes less noisy, and you have more room to create ideas that can change the world. Again, everything you do is a choice. Your success is a choice, and you can make a new decision if you want to. 4. Keeping information and contacts secret A mindset of scarcity will stop you from being successful. All the time, when I try and get in contact with influential people, there are others that stand in my way and don’t allow me to have access to the contacts and resources I need to fulfill my vision. In the last six months, I have made it a habit of sharing my knowledge and success with anyone who wants it. By coming from a controlled state of abundance, it has allowed me to build deep relationships with some incredible people. Sharing everything I know has also brought me closer to many new opportunities and concepts that I wouldn’t have come across any other way. The bottom line is the more you share, the better your chances are of success and the more likely it is that you will do something incredible, which will be remembered long after you have left this world.An excellent example of this occurred in my life today. A young man emailed me asking me if I could help make his dream come true with an idea he had about traffic patterns. I politely told him that partnering with me on this project was not a good idea because it didn’t align with my vision or passion. Instead of telling him to get lost, I gave him a solution that was the best I could come up with. I told him that through my daily work, I knew that Jack Dorsey (founder of Twitter) had a life mission to solve traffic problems by adjusting traffic patterns. The young man then came back to me via email and asked if I could introduce him to Jack. I told him the truth which is I have never had the privilege of talking with Jack and didn’t have his contact details. I told him that if I were him, I would go to an event where Jack was speaking, and then afterward, I would try to get a minute with Jack and see if I could talk with him about traffic patterns. Maybe the strategy I gave will work and maybe it won’t — it doesn’t matter. What matters is that you go out of your way to share everything you have, and you never look back. 5. Too much time spent on the problem A crisis is going to arrive every once in a while, and if you focus all of your energy on the problem, you will distance yourself from success. Successful people that have done things we can only dream of known that you have to take a timeout from the problem and go straight into a positive mindset of finding the solution. Let’s face it; the problem can get depressing quickly, and it can make your mind go down all sorts of rabbit holes. Get used to going into solution mode and having a sense that you will figure out the answer when the time is right. 6. Having zero confidence Being a successful phenomenon requires you to have faith in yourself and be confident. Even when you are scared, the best thing you can do is stand up straight and be confident. Blind confidence is the little trick that entrepreneurs use when they enter an industry and start a business. You have got to stop having zero confidence if you ever want to break through your inherent fear and be successful. 7. Not having a purpose Failures lack purpose, and if you haven’t found yours, then you need to spend every waking hour discovering what it is for you. There is no excuse not to have a purpose in life, and all it takes is time. Without a purpose to guide you, you will be stuck in-between where you need to go and where you are right now. Get to work, start mind mapping all the things you love to do. One question that I teach is to ask yourself: What activity would I be happy to do for free and be involved with, that begins at 7 am every Saturday and finished at 5 pm? 8. A belief that you deserve more Believing that you deserve more is a fantastically stupid way to sabotage your success. You don’t deserve jack. What you deserve is what you put in. What you deserve is what you sacrifice and what you are willing to give to the world without expecting anything in return. “Success is not free, and it’s not going to be dished out to you with a serving of fries and ketchup on the side” — Tim Denning What do you think is stopping you from being a successful phenomenon? Originally posted on Addicted2Success.com Call To Action If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online. Click here to subscribe right now! ", "title": "8 Things That Will Stop You From Being A Successful Phenomenon", "sentences": [{"fb72": "8 Things That Will Stop You From Being A Successful Phenomenon"}, {"0a15": "Disempowering habits are what are holding you back from having similar success to Elon Musk. The trick is that you need to have discipline about the tasks that you repeat daily. The more you repeat something, the more it becomes ingrained into your being."}, {"bbf2": "So why would you want to repeat a task that hijacks your future success? There are so many events in your life that begin with a choice. Success is not about being lucky and it’s not just about hard work. Becoming successful is about making tiny shifts in your decision-making power."}, {"5284": "Making empowering choices instead of following what everyone is doing is what will help you carve your own path. The idea is that you want to be you and stand out from all the failures that you come into contact with every day."}, {"b9cf": "In this post, I am going to focus on what is holding you back. Each point may seem insignificant, although, when you practice all of them together, the result is an increased level of consciousness and understanding about what you need to achieve greatness consistently."}, {"c51b": "Below are the 8 things that you should stop if you want to be a successful phenomenon:"}, {"b6b2": "1. Turn off the news"}, {"865c": "“There is no news like bad news.” This quote comes from the James Bond movie “Tomorrow Never Dies.” It’s the best way I can describe what the traditional media is feeding your mind. The junk food they serve is designed to get your attention, not make you successful."}, {"7d29": "It’s a practice that many of us find challenging to change because we grew up on bad news. I am now four years clean (from the news). It’s blocked on my internet browser, iPhone, Facebook and anywhere else that they might be able to infect my life."}, {"2ec9": "It took about twelve months, but once the disease was cured, I began to think differently. The news does keep you informed, but it’s laced with cyanide. The perspective that is often given doesn’t build people up and encourage us to crush our goals."}, {"6c06": "Instead, the news tells you how everything is going wrong in the world and how you should stay at home, lock your door, and not take any risks in life because you might fail. This way of thinking will permanently separate you from your dream."}, {"fab3": "Your world inside your head is crucial to you finding your way in life. You can’t break through the barriers of failure if you surround yourself with solutions that highlight people who haven’t achieved their dreams."}, {"3ca8": "“It’s easy to find people who have messed up or who are out of control; it’s much more difficult to find the 0.01% who achieve their dreams” — Tim Denning"}, {"ee0f": "2. Dressing poorly"}, {"91d2": "The way you look matters despite what some people might tell you. Before you even open your mouth people are judging you, and you want to give off a feeling of success as soon as you meet someone."}, {"d330": "Even a minimalist like me understands that presentation is something you should strive for. Time is not an excuse, and there are always well-priced clothes available if you know where to look. For guys, get yourself a few nice suits and if you have no idea what to wear, then wear a suit."}, {"0243": "A suit takes away all the decision making because it screams success and makes you look good."}, {"3b54": "Here are a few tips to wearing a suit:– It has to be tailored otherwise it will look sloppy– Add some bright colors with a shirt or tie– Make sure you wear shiny black shoes (shoes make or break a good suit)– Get your suit dry cleaned once or twice a year– Hang your suit up after you wear it– Iron your shirts well (see Youtube for tips)"}, {"06c5": "For girls, your options are limitless. Clothes that aren’t baggy and fit well, with a touch of facial makeup, can make all the difference. (I’ll leave it there as I am not an expert in female fashion). Even when you are going to the grocery store, take pride in what you’re wearing — you never know who you will meet."}, {"6482": "I read in Napoleon Hill’s book “The Law Of Success” about a man that wore his best clothes when he would walk down the street every day. People would see him walk past and assume he was a multi-millionaire."}, {"052e": "What they didn’t know was that he was poor and looking for his next break. Eventually, he was discovered by a successful businessman, given a job, and he was able to build a career that many of us could only dream of. That’s the power of dressing well."}, {"66dd": "Clothes change your mood too. When you dress well, you feel successful, and you become more confident. It’s the little things that add up to you becoming a successful phenomenon."}, {"a104": "Next time you’re feeling down, pop on your best outfit, put on a smile, and go be you!"}, {"dfbd": "3. Lack of self-control"}, {"5c99": "All day, as we walk around our cities, we are confronted by people that are doing things which annoy us. This is a fact of life, and there are two choices we can make:"}, {"c102": "1. We can react and yell abuse or give a look of disgust2. We can take control, breathe, and make a conscious decision not to react"}, {"1002": "I see people all the time who choose the first option, and then they wonder why they have a bad day. When you do something unkind to someone else, they only replicate the same behavior back at you. By having more self-control and choosing the second option, you become more resilient."}, {"a7b4": "You learn to adapt to stressful situations and people. Your mind becomes less noisy, and you have more room to create ideas that can change the world. Again, everything you do is a choice. Your success is a choice, and you can make a new decision if you want to."}, {"47ca": "4. Keeping information and contacts secret"}, {"128c": "A mindset of scarcity will stop you from being successful. All the time, when I try and get in contact with influential people, there are others that stand in my way and don’t allow me to have access to the contacts and resources I need to fulfill my vision."}, {"51df": "In the last six months, I have made it a habit of sharing my knowledge and success with anyone who wants it. By coming from a controlled state of abundance, it has allowed me to build deep relationships with some incredible people."}, {"4947": "Sharing everything I know has also brought me closer to many new opportunities and concepts that I wouldn’t have come across any other way."}, {"80fc": "The bottom line is the more you share, the better your chances are of success and the more likely it is that you will do something incredible, which will be remembered long after you have left this world.An excellent example of this occurred in my life today."}, {"7d4d": "A young man emailed me asking me if I could help make his dream come true with an idea he had about traffic patterns. I politely told him that partnering with me on this project was not a good idea because it didn’t align with my vision or passion."}, {"21be": "Instead of telling him to get lost, I gave him a solution that was the best I could come up with. I told him that through my daily work, I knew that Jack Dorsey (founder of Twitter) had a life mission to solve traffic problems by adjusting traffic patterns."}, {"7403": "The young man then came back to me via email and asked if I could introduce him to Jack. I told him the truth which is I have never had the privilege of talking with Jack and didn’t have his contact details. I told him that if I were him, I would go to an event where Jack was speaking, and then afterward, I would try to get a minute with Jack and see if I could talk with him about traffic patterns."}, {"978f": "Maybe the strategy I gave will work and maybe it won’t — it doesn’t matter. What matters is that you go out of your way to share everything you have, and you never look back."}, {"935c": "5. Too much time spent on the problem"}, {"300c": "A crisis is going to arrive every once in a while, and if you focus all of your energy on the problem, you will distance yourself from success. Successful people that have done things we can only dream of known that you have to take a timeout from the problem and go straight into a positive mindset of finding the solution."}, {"3be3": "Let’s face it; the problem can get depressing quickly, and it can make your mind go down all sorts of rabbit holes. Get used to going into solution mode and having a sense that you will figure out the answer when the time is right."}, {"7148": "6. Having zero confidence"}, {"62e9": "Being a successful phenomenon requires you to have faith in yourself and be confident. Even when you are scared, the best thing you can do is stand up straight and be confident. Blind confidence is the little trick that entrepreneurs use when they enter an industry and start a business."}, {"e6b0": "You have got to stop having zero confidence if you ever want to break through your inherent fear and be successful."}, {"4cb3": "7. Not having a purpose"}, {"6acd": "Failures lack purpose, and if you haven’t found yours, then you need to spend every waking hour discovering what it is for you. There is no excuse not to have a purpose in life, and all it takes is time. Without a purpose to guide you, you will be stuck in-between where you need to go and where you are right now."}, {"9f11": "Get to work, start mind mapping all the things you love to do. One question that I teach is to ask yourself: What activity would I be happy to do for free and be involved with, that begins at 7 am every Saturday and finished at 5 pm?"}, {"d3b0": "8. A belief that you deserve more"}, {"626a": "Believing that you deserve more is a fantastically stupid way to sabotage your success. You don’t deserve jack. What you deserve is what you put in. What you deserve is what you sacrifice and what you are willing to give to the world without expecting anything in return."}, {"410e": "“Success is not free, and it’s not going to be dished out to you with a serving of fries and ketchup on the side” — Tim Denning"}, {"cdb8": "What do you think is stopping you from being a successful phenomenon?"}, {"cf1d": "Originally posted on Addicted2Success.com"}, {"ce94": "Call To Action"}, {"104d": "If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online."}, {"60a1": "Click here to subscribe right now!"}], "child": "257_1\t257_2\t257_3\t257_4"}