{"name": "259", "parent": "", "content": "3 Secrets for Growing Your Personal Brand All of us, in every industry, are trying to grow our personal brand. We may not realize it, but we all truly “work for ourselves.” We’re all looking to grow our personal brand, even while we create for a unique audience. We try our best to do a great job and, to get others to notice the output we create. What we create affects our reputation (how others perceive us) and how many people know who we are. When I launched my business and personal development coaching business last year, I was so thrilled to “strike it out on my own.” What I quickly learned, was that any measure of success I would enjoy, would be based on my ability to grow my personal brand. The linkage between building our brand and growing our audience are symbiotic — meaning they are united. Even when I was working in management consulting, or leading project initiatives for a major government organization, in many respects, I was already working for myself. Allow me to explain. When you work for a company, client, agency or department, you might receive your paycheck from that organization or sole proprietor, and you might handle your business on their terms — not yours. But that’s truly where the line ends. No matter your age, level of experience or skill, you’re always building and growing your personal brand. You’re doing this for yourself, for others and for the world to see. I refer back to my first paragraph to illustrate what I mean: The output you create will vary depending on what you do. If you’re a marketer, you likely create marketing briefs and generate strategy and ideas for clients to grow their business. If you’re a home builder, then you’re physically creating an end-product where a family or individual will live. You’re fashioning work from your hands that delivers value for others. If you’re a social media strategist, you’re creating digital content that you’re hoping clients and prospective customers will consume. You’re also hoping people will notice the thought impressions you bestow upon the universe. Which leads me to reputation, and why this matters. While character ultimately means much more than reputation, in business, your reputation is how others perceive you. This could be the way your boss or company respects you. Relationships matter, so the better your reputation, the greater your likelihood at generating more opportunities. It is opportunity that comes knocking when you have built positive, synergetic relationships. This will be the lifeblood of your future success, whether you work for “the man” or yourself. It’s also how you will build future business, regardless of which industry or space you occupy. Let’s face it — we all want other people to notice what we’re doing. I love to write. It’s my biggest personal ambition and passion. I want an audience — awesome readers like you — to read my content and gain value. You might want to become the thought leader in the Artificial Intelligence space. Or the creator of the newest social media app. Whatever your endeavor, I encourage you to focus on these three areas to grow your personal brand. Good luck! 1. Value Your Audience When you’re looking to grow your personal brand, you might think it’s all about you. Well, it is, and it isn’t. You are simultaneously attempting to grow your output and brand recognition, while also delivering value to your audience. But know this crucially important truth: Your audience only cares about the value to them! They are concerned with the value they derive from what you create. When you’re creating something, you may have altruistic motives and concerns at heart. You may want to give back to the world. But ultimately, you take pride in the work you do and how you do it. Just understand one very simple truth: The customer’s needs matter most. They are your audience. And they are a major part of how you grow your personal brand. 2. Meet Your Audience Exactly Where They Are Make it easy for people. If your primary demographic is 18–25 year-old Southern women, then you need to identify and market to the verticals where those women spend time. Perhaps that could be Snapchat, Instagram, online magazines or specific TV shows. In other words, where are they consuming their content? Study your market. Do the research. You ALWAYS have to do the research to understand your segment. Give your audience a compelling reason to want to learn more about you, while making it simple for them to gain access to the output you provide. Your customers will gain the most value when you create a great product/content and make it easy for them to get it. 3. Focus on Telling a Unique Story What’s your story? Who are you and what do you do? You know, the mundane questions that you get at every alumni or business professional networking event in major cities. Those questions. While your answers may or not matter in those conversations, they absolutely do when you’re telling your personal story in an effort to grow your brand. Your personal story should be unique! You should continue to refine your story and improve upon it each week. This is where faith and confidence matter a great deal. You have to belief and have conviction in what you’re doing. Without this, you may as well stop right now. Because without these things, you’ll never build the courage and persistence to tell your story. Think about how much information exists in print, digital, TV and all forms of media. There’s so many products and so much content. Which means you must give people a reason to want to know your story. Once you have a compelling story, the door is open. Then, you need to seize the moment to help them, and build your brand at the same time. The more unique and original your voice, the more intriguing it is. What makes you stand out? How authentic is your story? Master these three keys and you’ll be on the road to building a personal brand you can be proud of. And, one that gets people flocking to what you’re selling. Live Boldly! My upcoming book on Values is due out this Spring. Subscribe for awesome updates on my Newsletter! Like my Facebook writer’s page here! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! KEEP GOING! Good luck! ", "title": "3 Secrets for Growing Your Personal Brand", "sentences": [{"23fa": "3 Secrets for Growing Your Personal Brand"}, {"a9cf": "All of us, in every industry, are trying to grow our personal brand. We may not realize it, but we all truly “work for ourselves.” We’re all looking to grow our personal brand, even while we create for a unique audience. We try our best to do a great job and, to get others to notice the output we create. What we create affects our reputation (how others perceive us) and how many people know who we are."}, {"8f3d": "When I launched my business and personal development coaching business last year, I was so thrilled to “strike it out on my own.” What I quickly learned, was that any measure of success I would enjoy, would be based on my ability to grow my personal brand. The linkage between building our brand and growing our audience are symbiotic — meaning they are united."}, {"7e1a": "Even when I was working in management consulting, or leading project initiatives for a major government organization, in many respects, I was already working for myself. Allow me to explain."}, {"411c": "When you work for a company, client, agency or department, you might receive your paycheck from that organization or sole proprietor, and you might handle your business on their terms — not yours. But that’s truly where the line ends. No matter your age, level of experience or skill, you’re always building and growing your personal brand."}, {"96f8": "You’re doing this for yourself, for others and for the world to see. I refer back to my first paragraph to illustrate what I mean: The output you create will vary depending on what you do. If you’re a marketer, you likely create marketing briefs and generate strategy and ideas for clients to grow their business."}, {"d58f": "If you’re a home builder, then you’re physically creating an end-product where a family or individual will live. You’re fashioning work from your hands that delivers value for others. If you’re a social media strategist, you’re creating digital content that you’re hoping clients and prospective customers will consume."}, {"e619": "You’re also hoping people will notice the thought impressions you bestow upon the universe. Which leads me to reputation, and why this matters. While character ultimately means much more than reputation, in business, your reputation is how others perceive you. This could be the way your boss or company respects you. Relationships matter, so the better your reputation, the greater your likelihood at generating more opportunities."}, {"273b": "It is opportunity that comes knocking when you have built positive, synergetic relationships. This will be the lifeblood of your future success, whether you work for “the man” or yourself. It’s also how you will build future business, regardless of which industry or space you occupy."}, {"920f": "Let’s face it — we all want other people to notice what we’re doing. I love to write. It’s my biggest personal ambition and passion. I want an audience — awesome readers like you — to read my content and gain value. You might want to become the thought leader in the Artificial Intelligence space. Or the creator of the newest social media app."}, {"fb9a": "Whatever your endeavor, I encourage you to focus on these three areas to grow your personal brand. Good luck!"}, {"c27e": "1. Value Your Audience"}, {"b87d": "When you’re looking to grow your personal brand, you might think it’s all about you. Well, it is, and it isn’t. You are simultaneously attempting to grow your output and brand recognition, while also delivering value to your audience. But know this crucially important truth: Your audience only cares about the value to them!"}, {"1088": "They are concerned with the value they derive from what you create. When you’re creating something, you may have altruistic motives and concerns at heart. You may want to give back to the world. But ultimately, you take pride in the work you do and how you do it. Just understand one very simple truth: The customer’s needs matter most. They are your audience. And they are a major part of how you grow your personal brand."}, {"0197": "2. Meet Your Audience Exactly Where They Are"}, {"ffd7": "Make it easy for people. If your primary demographic is 18–25 year-old Southern women, then you need to identify and market to the verticals where those women spend time. Perhaps that could be Snapchat, Instagram, online magazines or specific TV shows. In other words, where are they consuming their content?"}, {"34ba": "Study your market. Do the research. You ALWAYS have to do the research to understand your segment. Give your audience a compelling reason to want to learn more about you, while making it simple for them to gain access to the output you provide. Your customers will gain the most value when you create a great product/content and make it easy for them to get it."}, {"9dc1": "3. Focus on Telling a Unique Story"}, {"cc86": "What’s your story? Who are you and what do you do? You know, the mundane questions that you get at every alumni or business professional networking event in major cities. Those questions. While your answers may or not matter in those conversations, they absolutely do when you’re telling your personal story in an effort to grow your brand."}, {"44c0": "Your personal story should be unique! You should continue to refine your story and improve upon it each week. This is where faith and confidence matter a great deal. You have to belief and have conviction in what you’re doing. Without this, you may as well stop right now. Because without these things, you’ll never build the courage and persistence to tell your story."}, {"7fc2": "Think about how much information exists in print, digital, TV and all forms of media. There’s so many products and so much content. Which means you must give people a reason to want to know your story. Once you have a compelling story, the door is open."}, {"5225": "Then, you need to seize the moment to help them, and build your brand at the same time. The more unique and original your voice, the more intriguing it is. What makes you stand out? How authentic is your story? Master these three keys and you’ll be on the road to building a personal brand you can be proud of. And, one that gets people flocking to what you’re selling."}, {"827f": "Live Boldly!"}, {"a59d": "My upcoming book on Values is due out this Spring. Subscribe for awesome updates on my Newsletter! Like my Facebook writer’s page here! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! KEEP GOING! Good luck!"}], "child": "259_1\t259_2\t259_3\t259_4\t259_5\t259_6\t259_7\t259_8\t259_9\t259_10\t259_11\t259_12\t259_13\t259_14\t259_15\t259_16\t259_17\t259_18\t259_19\t259_20\t259_21"}