{"name": "26", "parent": "", "content": "The 10 Best Individual Stat Lines of the NBA Season From Anthony Davis’s blinding opening night to James Harden’s Wilt-like triple-double, here are the best lines of the year This season, the typical question of What did he finish with? became Did he get it? It, of course, meaning a triple-double, like that kind of line is to be expected. One point guard is proof of this escalation, and no, it’s not the one who just broke Oscar Robertson’s seemingly unachievable record. Ricky Rubio made history a month ago, in what seemed like a normal outing for the Timberwolves: Minnesota lost to San Antonio on the road, and the Spaniard finished that night shooting a mediocre 33 percent from the field. Still, Rubio ended with 11 points that game, adding 13 rebounds and 10 assists — his first triple-double in 734 days, and the league’s 79th on the year, a new single-season record. Individual nightly stat lines have calloused our threshold for wonderment. Rubio’s triple-double, only the fifth of his seven-year career, will be forgotten. This season, each game felt like appointment viewing, because someone might randomly go off. 2014 doesn’t seem so long ago, but three seasons have passed since it was Lance Stephenson who led the league in triple-doubles … with five. Russ, by the way, finished with two that year. Here’s to hoping he doesn’t experience a similar season-after slump. That’s unlikely. These inflated stats look more like a shift than an aberration. After James Harden transformed into a stork and birthed the first 50–15–15 line against the Knicks, FiveThirtyEight’s Neil Paine looked into this year’s numbers. The popular explanation for the increase is pretty straightforward: faster pace. But Paine also found today’s talent pool to be wider than ever. And before you demand immediate removal of the kids from your lawn — excellent shrub work here, by the way — whatever the reason behind these swelling lines, the numbers are still historic. This season, 33 players combined to total 110 40-point games. Last year, just 22 guys combined for 67 40-point performances, and the year before that, 20 players scored 40 points 52 times — less than half as many as this year. Even this past weekend, Damian Lillard invited himself to the playoffs with a 59-point performance Saturday, followed Sunday by Westbrook ringing in 50 with a last-second shot. Of all the aggrandized lines over the course of this highly irregular regular season, whose was the most remarkable? Shout-out to Bill Simmons reader Mark Halfnights, who suggested ranking the best lines of the year in an email. (I’m disappointed it’s me, too, Mark.) Ten spectacular lines are ranked below, positioned for season relevance, player milestones, and obscurities. 10. Isaiah Thomas December 30, 2016, against the Heat: 52 points, two rebounds, one steal Of every player’s 50-plus-point game this season, Thomas’s was the least well-rounded. His career-high 52-point night against Miami came with zero assists, two rebounds, and a single steal. Still, IT4 solidified his status as a fourth-quarter legend, dropping 29 in the final frame — that’s more in a single quarter than all but three players average per game; Thomas being one of those three — scoring the fourth-most single-game points in Boston history. It’s far from Thomas’s only notable stat line of the year. He went for 44 points, six assists, and three rebounds against the Grizzlies, sinking all 17 attempts from the line. But this matchup against Miami came on the second night of a back-to-back, and the score was tight until the end. His automatic catch-and-shoot turned into a catch-and-make for point 50 of the night and the win. 9. Giannis Antetokounmpo December 31, 2016, against the Bulls: 35 points, nine rebounds, eight assists, seven blocks, two steals If a stat box is ever a perfect metaphor for a player, this is the case. Giannis’s do-it-all ability for this team — leading the Bucks in all five major statistical categories, just the fifth player to ever do so — created multiple nightmares for Chicago. He oozed with versatility: dunking, hitting the midrange jumper, finishing with his left, and sinking 3s, all while leading the defense. Saying “Giannis” to remark on his execution became so repetitive for the broadcast team that they began to dig deep, reverting to phrases like, “Why not?” and “Look at that youngster play basketball!” 8. Anthony Davis October 26, 2016, against the Nuggets: 50 points, 15 rebounds, five assists, four blocks, five steals Watching Anthony Davis do work, especially record-breaking work, and especially, especially opening-night, record-breaking work, even in a loss, hit a soft spot. The Brow kicked off what became a leaguewide stat-heavy season with the first 50-point game, becoming only the fourth player to ever hit that mark during his first contest of the season. 7. Devin Booker March 24, 2017, against the Celtics: 70 points, eight rebounds, six assists, three steals, one block With a little over three minutes left in the third quarter, in a late-March game against Boston, Booker had racked up 35 points. The question was whether he could manage another 15 to in the final quarter to hit 50 on the night. Instead, with the remaining time, he doubled that. Yes, the 20-year-old did so with a feeding tube from his teammates, but still, he doubled that. Booker should still be breaking into his parents’ liquor cabinet, and instead he took ownership of a single-game franchise scoring record, topped the list of most points scored against Boston, and became the youngest player to ever score 70. Phoenix lost, which was as confounding as the scoring feat itself. But considering how late it was in the season (very late) and the Suns’ place in the standings (very bad) and hopes for the lottery (very high), losing was actually a win. 6. DeMarcus Cousins December 20, 2016, against the Trail Blazers: 55 points, 13 rebounds, three blocks, one assist, one steal What should be most memorable from Boogie’s 55-point game against the Blazers are his 3-pointers for the lead. He hit two of them, one with under two minutes left in the fourth, and another just 20 seconds later. After successful trips from Portland on offense each time prior to the shot, both regained the lead for Sacramento. Even Cousins’s block, the one that stopped Damian Lillard from driving his way to a one-point game with 30 seconds left, should be the reason we remember this outing. This line is deserving of a spot on this list, but Cousins sprinkled a little Boogie on it, making the final 35 remaining seconds of the game against Portland especially memorable. After his mouthpiece inadvertently flew out while talking shit to the Blazers bench, Boogie was hit with his second tech of the game. Ejected, he sprinted off the court, as an ejected big man does, then had his technical rescinded and was brought back. He shot a free throw, good for his 55th point. When the game ended, the broadcast crew pulled him over for an interview and gave him the chance at more free throws — this time verbal and directed at the officiating crew. He hit every last one of them, calling it “ridiculous” so many times that his mic was eventually cut on live television. 5. Damian Lillard April 8, 2017, against the Jazz: 59 points, six rebounds, five assists, one steal, zero turnovers Lillard notched a career high and franchise high for points scored in a game, and tied a Blazers record for most 3-pointers with nine — all against a team that holds opponents to the fewest points in the league. Though Denver’s loss Sunday sealed the Nuggets’ elimination from postseason contention, it was this Portland win that set the Blazers up for the final playoff spot. This was also Lillard’s first 50-point game of the season, and he became the 10th player to hit the landmark this year, a new NBA record — but more importantly, he did a polite thing and made his mom proud. 4. Russell Westbrook April 9, 2017, against the Nuggets: 50 points, 16 rebounds, 10 assists, one steal Which stat line to choose from the human triple-double? In the loss against Orlando, Russ was 41/12/16 and shot 67 percent from the field; against Memphis, he was 17-for-17 from the line. In fact, this whole post could be a long list commemorating Westbrook’s season, but we’ve already made one of those. It could be recency bias, but this game against Denver had the most on the line — the Nuggets’ playoff contention, the single-season triple-double record, and a game-winning buzzer-beater for the cherry on top. Westbrook is often knocked for his inefficient shooting; he’s been called a selfish guard before, and his board crashing has been called stat-stuffing. But there’s no denying that the fullest box scores consistently came from no. 0 this season. 3. Klay Thompson December 5, 2017, against the Pacers: 60 points, two rebounds, one assist, 29 minutes, 21–33 FG, 8–14 3PT When Kevin Durant made Golden State his free-agency destination, Klay Thompson garnered the most sympathy outside of Oklahoma. With Steph running the show, surely it was Thompson whose game would suffer. Except Klay’s highlight videos are a Quavo verse, smooth for only the two seconds he needs to lift the shot into the air; quick and choppy by default; his catch-and-shoot mastery doesn’t need the ball for any longer. So a feat like 60 points in less than half the minutes, with Durant, Curry, and Draymond all on the court, became possible with a player like Klay. It doesn’t hurt to be 8-of-14 from behind the arc, either. 2. Jimmy Butler January 2, 2017, against the Hornets: 52 points, 12 rebounds, six assists, three steals, one block This performance came right after the no. 1 stat line on this list, unfairly dulling its awe. Butler’s 3-point accuracy was worse than James Harden’s, but his overall shooting percentage was greater, and nearly every other category — turnovers, steals, blocks, field goal percentage — looked better. It was the most efficient, but it wasn’t the most absurd. 1. James Harden December 31, 2016, against the Knicks: 53 points, 17 assists, 16 rebounds When we think of this season, we will think of Westbrook — he took the triple-double cake, ate it, threw it up, ordered another, and put it on the rest of the league’s tab — but the Beard had the best night of the season. He tied Wilt Chamberlain for the highest-scoring triple-double in history, and with it, scored his career high in points. This is Exhibit A for his MVP case, and if the race had ended the day after, it would have been his for the taking. Nods to Karl-Anthony Towns, who managed the Timberwolves franchise’s first 40-and-20 game against the Lakers, and to Paul George and Kyle Lowry for other incredible stat lines this season. Most bizarre of all is making a list of 10 box scores and not throwing the greatest player in the world on it once. LeBron’s sheet was stuffed quite a few times this year — most notably against Washington, when he scored 32 points with just two free throws and added seven boards, 17 assists, two steals, and two blocks — but much like the argument to dissuade from his MVP-worthiness, we’re used to it with him. And somehow, I think he’ll Liv — I mean, live. ", "title": "The 10 Best Individual Stat Lines of the NBA Season", "sentences": [{"5ceb": "The 10 Best Individual Stat Lines of the NBA Season"}, {"e83a": "From Anthony Davis’s blinding opening night to James Harden’s Wilt-like triple-double, here are the best lines of the year"}, {"203a": "This season, the typical question of What did he finish with? became Did he get it? It, of course, meaning a triple-double, like that kind of line is to be expected. One point guard is proof of this escalation, and no, it’s not the one who just broke Oscar Robertson’s seemingly unachievable record."}, {"438f": "Ricky Rubio made history a month ago, in what seemed like a normal outing for the Timberwolves: Minnesota lost to San Antonio on the road, and the Spaniard finished that night shooting a mediocre 33 percent from the field. Still, Rubio ended with 11 points that game, adding 13 rebounds and 10 assists — his first triple-double in 734 days, and the league’s 79th on the year, a new single-season record."}, {"d150": "Individual nightly stat lines have calloused our threshold for wonderment. Rubio’s triple-double, only the fifth of his seven-year career, will be forgotten. This season, each game felt like appointment viewing, because someone might randomly go off. 2014 doesn’t seem so long ago, but three seasons have passed since it was Lance Stephenson who led the league in triple-doubles … with five. Russ, by the way, finished with two that year. Here’s to hoping he doesn’t experience a similar season-after slump."}, {"effe": "That’s unlikely. These inflated stats look more like a shift than an aberration. After James Harden transformed into a stork and birthed the first 50–15–15 line against the Knicks, FiveThirtyEight’s Neil Paine looked into this year’s numbers. The popular explanation for the increase is pretty straightforward: faster pace. But Paine also found today’s talent pool to be wider than ever. And before you demand immediate removal of the kids from your lawn — excellent shrub work here, by the way — whatever the reason behind these swelling lines, the numbers are still historic. This season, 33 players combined to total 110 40-point games. Last year, just 22 guys combined for 67 40-point performances, and the year before that, 20 players scored 40 points 52 times — less than half as many as this year."}, {"2e4a": "Even this past weekend, Damian Lillard invited himself to the playoffs with a 59-point performance Saturday, followed Sunday by Westbrook ringing in 50 with a last-second shot. Of all the aggrandized lines over the course of this highly irregular regular season, whose was the most remarkable?"}, {"e99a": "Shout-out to Bill Simmons reader Mark Halfnights, who suggested ranking the best lines of the year in an email. (I’m disappointed it’s me, too, Mark.) Ten spectacular lines are ranked below, positioned for season relevance, player milestones, and obscurities."}, {"54ca": "10. Isaiah Thomas"}, {"6bdb": "December 30, 2016, against the Heat: 52 points, two rebounds, one steal"}, {"9724": "Of every player’s 50-plus-point game this season, Thomas’s was the least well-rounded. His career-high 52-point night against Miami came with zero assists, two rebounds, and a single steal. Still, IT4 solidified his status as a fourth-quarter legend, dropping 29 in the final frame — that’s more in a single quarter than all but three players average per game; Thomas being one of those three — scoring the fourth-most single-game points in Boston history."}, {"2ec1": "It’s far from Thomas’s only notable stat line of the year. He went for 44 points, six assists, and three rebounds against the Grizzlies, sinking all 17 attempts from the line. But this matchup against Miami came on the second night of a back-to-back, and the score was tight until the end. His automatic catch-and-shoot turned into a catch-and-make for point 50 of the night and the win."}, {"a142": "9. Giannis Antetokounmpo"}, {"7e2f": "December 31, 2016, against the Bulls: 35 points, nine rebounds, eight assists, seven blocks, two steals"}, {"8f7c": "If a stat box is ever a perfect metaphor for a player, this is the case. Giannis’s do-it-all ability for this team — leading the Bucks in all five major statistical categories, just the fifth player to ever do so — created multiple nightmares for Chicago. He oozed with versatility: dunking, hitting the midrange jumper, finishing with his left, and sinking 3s, all while leading the defense. Saying “Giannis” to remark on his execution became so repetitive for the broadcast team that they began to dig deep, reverting to phrases like, “Why not?” and “Look at that youngster play basketball!”"}, {"126f": "8. Anthony Davis"}, {"a52d": "October 26, 2016, against the Nuggets: 50 points, 15 rebounds, five assists, four blocks, five steals"}, {"1c4a": "Watching Anthony Davis do work, especially record-breaking work, and especially, especially opening-night, record-breaking work, even in a loss, hit a soft spot. The Brow kicked off what became a leaguewide stat-heavy season with the first 50-point game, becoming only the fourth player to ever hit that mark during his first contest of the season."}, {"465c": "7. Devin Booker"}, {"86be": "March 24, 2017, against the Celtics: 70 points, eight rebounds, six assists, three steals, one block"}, {"0001": "With a little over three minutes left in the third quarter, in a late-March game against Boston, Booker had racked up 35 points. The question was whether he could manage another 15 to in the final quarter to hit 50 on the night. Instead, with the remaining time, he doubled that. Yes, the 20-year-old did so with a feeding tube from his teammates, but still, he doubled that. Booker should still be breaking into his parents’ liquor cabinet, and instead he took ownership of a single-game franchise scoring record, topped the list of most points scored against Boston, and became the youngest player to ever score 70."}, {"c2d5": "Phoenix lost, which was as confounding as the scoring feat itself. But considering how late it was in the season (very late) and the Suns’ place in the standings (very bad) and hopes for the lottery (very high), losing was actually a win."}, {"4a9e": "6. DeMarcus Cousins"}, {"0d35": "December 20, 2016, against the Trail Blazers: 55 points, 13 rebounds, three blocks, one assist, one steal"}, {"129b": "What should be most memorable from Boogie’s 55-point game against the Blazers are his 3-pointers for the lead. He hit two of them, one with under two minutes left in the fourth, and another just 20 seconds later. After successful trips from Portland on offense each time prior to the shot, both regained the lead for Sacramento. Even Cousins’s block, the one that stopped Damian Lillard from driving his way to a one-point game with 30 seconds left, should be the reason we remember this outing."}, {"8963": "This line is deserving of a spot on this list, but Cousins sprinkled a little Boogie on it, making the final 35 remaining seconds of the game against Portland especially memorable. After his mouthpiece inadvertently flew out while talking shit to the Blazers bench, Boogie was hit with his second tech of the game. Ejected, he sprinted off the court, as an ejected big man does, then had his technical rescinded and was brought back. He shot a free throw, good for his 55th point. When the game ended, the broadcast crew pulled him over for an interview and gave him the chance at more free throws — this time verbal and directed at the officiating crew. He hit every last one of them, calling it “ridiculous” so many times that his mic was eventually cut on live television."}, {"bc31": "5. Damian Lillard"}, {"7925": "April 8, 2017, against the Jazz: 59 points, six rebounds, five assists, one steal, zero turnovers"}, {"44d3": "Lillard notched a career high and franchise high for points scored in a game, and tied a Blazers record for most 3-pointers with nine — all against a team that holds opponents to the fewest points in the league. Though Denver’s loss Sunday sealed the Nuggets’ elimination from postseason contention, it was this Portland win that set the Blazers up for the final playoff spot."}, {"afd1": "This was also Lillard’s first 50-point game of the season, and he became the 10th player to hit the landmark this year, a new NBA record — but more importantly, he did a polite thing and made his mom proud."}, {"9cb6": "4. Russell Westbrook"}, {"8171": "April 9, 2017, against the Nuggets: 50 points, 16 rebounds, 10 assists, one steal"}, {"8b9b": "Which stat line to choose from the human triple-double? In the loss against Orlando, Russ was 41/12/16 and shot 67 percent from the field; against Memphis, he was 17-for-17 from the line. In fact, this whole post could be a long list commemorating Westbrook’s season, but we’ve already made one of those."}, {"e17e": "It could be recency bias, but this game against Denver had the most on the line — the Nuggets’ playoff contention, the single-season triple-double record, and a game-winning buzzer-beater for the cherry on top. Westbrook is often knocked for his inefficient shooting; he’s been called a selfish guard before, and his board crashing has been called stat-stuffing. But there’s no denying that the fullest box scores consistently came from no. 0 this season."}, {"6741": "3. Klay Thompson"}, {"fbdd": "December 5, 2017, against the Pacers: 60 points, two rebounds, one assist, 29 minutes, 21–33 FG, 8–14 3PT"}, {"2701": "When Kevin Durant made Golden State his free-agency destination, Klay Thompson garnered the most sympathy outside of Oklahoma. With Steph running the show, surely it was Thompson whose game would suffer. Except Klay’s highlight videos are a Quavo verse, smooth for only the two seconds he needs to lift the shot into the air; quick and choppy by default; his catch-and-shoot mastery doesn’t need the ball for any longer. So a feat like 60 points in less than half the minutes, with Durant, Curry, and Draymond all on the court, became possible with a player like Klay. It doesn’t hurt to be 8-of-14 from behind the arc, either."}, {"0fee": "2. Jimmy Butler"}, {"0f48": "January 2, 2017, against the Hornets: 52 points, 12 rebounds, six assists, three steals, one block"}, {"9c5e": "This performance came right after the no. 1 stat line on this list, unfairly dulling its awe. Butler’s 3-point accuracy was worse than James Harden’s, but his overall shooting percentage was greater, and nearly every other category — turnovers, steals, blocks, field goal percentage — looked better. It was the most efficient, but it wasn’t the most absurd."}, {"80bb": "1. James Harden"}, {"0470": "December 31, 2016, against the Knicks: 53 points, 17 assists, 16 rebounds"}, {"e5aa": "When we think of this season, we will think of Westbrook — he took the triple-double cake, ate it, threw it up, ordered another, and put it on the rest of the league’s tab — but the Beard had the best night of the season. He tied Wilt Chamberlain for the highest-scoring triple-double in history, and with it, scored his career high in points. This is Exhibit A for his MVP case, and if the race had ended the day after, it would have been his for the taking."}, {"59b2": "Nods to Karl-Anthony Towns, who managed the Timberwolves franchise’s first 40-and-20 game against the Lakers, and to Paul George and Kyle Lowry for other incredible stat lines this season. Most bizarre of all is making a list of 10 box scores and not throwing the greatest player in the world on it once. LeBron’s sheet was stuffed quite a few times this year — most notably against Washington, when he scored 32 points with just two free throws and added seven boards, 17 assists, two steals, and two blocks — but much like the argument to dissuade from his MVP-worthiness, we’re used to it with him. And somehow, I think he’ll Liv — I mean, live."}], "child": "26_1\t26_2\t26_3\t26_4\t26_5\t26_6\t26_7\t26_8\t26_9\t26_10\t26_11\t26_12\t26_13\t26_14\t26_15\t26_16\t26_17"}