{"name": "260", "parent": "", "content": "9 Mantras That Changed My Life Forever Almost a year ago, all of this started by accident. I found myself muttering the same phrase every morning as I walked my dog. 2 words: “Thank you.” I would say those two words over and over again. A kind of chant. I probably looked a little crazy. “Thank you, rock.” “Thank you, tree.” “Thank you, home.” “Thank you, shoes.” As the months passed, I realized I was actually becoming more grateful by default. Weird. A few weeks after “the becoming,” I found this story, which somehow passed me when it was published: How a Password Changed my Life.The following events occurred between ☹ and ☺.medium.com The guy quit smoking by changing a password?? You’ve got to be kidding me. Then, Tony Robbins proclamation in “I Am Not Your Guru.” “I would say to myself every morning: I am unstoppable. I am unstoppable. I am unstoppable.” He would say this for hours on end as he ran. Is he unstoppable? I don’t know. He believes he is unstoppable, though, and that apparently matters. I wanted more. Could there be something to this mantra thing? Does it really change you? “Mantra” comes from a Sanskrit root meaning “a sacred message or text, charm, spell” “Sacred.” “Charm.” “Spell.” These are all words we don’t care for much in this day and age. They scare us because we can’t see them. It’s funny how a lot of the best outcomes in life require faith. I actually got a frustrated researching this phenomenon. Most of what comes up when you look for “how words affect the brain,” is anecdotal information from adrenaline-fueled-entrepreneur corners of the Internet. The rest is difficult to separate from the religious roots from which the practice began. Nothing wrong with that, of course, but I was curious how language specifically affects the body. Instead, I came away with “SPEAK YOUR DREAMS INTO REALITY(!),” and other such high-flying quotables. (By the way, this is not the first time I’ve run into this missing facts problem. It’s becoming more plain to me people spout catchy-sounding stat bites without sources. Our blind trust of the Internet is very scary. “9 out of 10 businesses fail.” Do they really? Where is your source? What time frame are you talking about? For that matter, what does “failure” really mean? And what qualifies as a “business.” But I digress.) So it seems, on the matter of mantras, that I will have to ask you for a little faith. This is my experience, which is all I can ever offer you anyway. As I looked back, I’ve had different mantras through the years — those which have been a point of constant focus and attention for an extended amount of time. Each of them has changed my life in a profound way. Thinking these things did not change my life. I spoke them aloud as often as possible. Like a crazy person. 1. “LOVE IS SACRIFICE” Romantic or platonic, not much speaks louder than giving up something you care about for another person. 2. “FOCUS ON FOUR” This connected culture makes us think we have to impact 4,000 people to be important — maybe 4 MILLION! That’s too many friends. Instead, focus on four. If four people are bawling at your funeral, you nailed it. 3. “NO DAYS OFF” When I left on my 5 A.M. alarm for Saturday and Sunday, these things happened: (See also — What Tweak Has Made All the Difference In Your Life?) 4. “THERE’S MORE WHERE THAT CAME FROM” Most people have a deep fear: One day, they will run out of ideas. (gasp) Writer’s block specifically has reached legendary status over the years. The word has a plague-like reputation. Once you are afflicted, you will be doomed to a life with the “normies.” Here’s the truth: All blocks are self-inflicted. The human brain is infinite, constantly processing new thoughts and emotions and stimuli and interactions. It is ever-searching, ever-seeking, and rarely at rest. I heard recently that Scott Adams (creator of Dilbert) doesn’t even plan comics ahead of time now. He just sits at the desk and starts. Even though he’s been making office jokes since 1989, there’s more where that came from. 5. “30 x 30 x 30” If you do just 30 seconds more of what you love day after day, you will likely be much more fulfilled at the end of a year. If you spend 30 consecutive days acting on an interest and don’t hate it, you have likely found a potential career. (If you do hate it, at least you explored the option.) If you plan on taking 30 years to build exactly the life you want, you will have much more patience for the little bumps along the way. 6. “I LOVE YOU, BUT I CAN’T GIVE YOU MY FOCUS RIGHT NOW.” What has suffered in this generation is our ability to work deeply. We settle for shallow interactions, quick dopamine hits, and endless entertainment. Ignore things that are mildly important to obsess over that which is most important. 7. “HEALTH COMES FIRST” I wasn’t able to accomplish much in 2014. A large reason for this was because it felt like my guts were about to fall out of my stomach at any moment. Sustainable health is the foundation to sustainable anything else. 8. “80% LOVE, 20% BUSINESS” My friend told me once: “SEO is the only way to win.” No. The only way to win is doing things that energize you at least 80% of the time. Use the other 20% to set up a structure which will increase that 80% to 100%. 9. “CREATION BEATS AFFIRMATION” One of the great ironies of life is this: the praise which follows success can stonewall your progress. Affirmation is a fickle, hollow drug. Do not allow it to own your self esteem. Instead, create new work. Improve your process. Continue to grow. These things you control. There’s (Even) More Where This Came From Have you ever worried you might become worthless? I know I did. Once I wrote my first viral hit, I would terrified I could never write another. First I was paralyzed. Then I was liberated. Now, millions of people have read my work all over the world. I’ve wrapped up the epiphany between paralyzed and liberated in my book: The Ultimate Guide to Infinite Ideas, which I’m giving away for free. Get your copy right here. ", "title": "9 Mantras That Changed My Life Forever", "sentences": [{"05c5": "9 Mantras That Changed My Life Forever"}, {"b2f3": "Almost a year ago, all of this started by accident."}, {"b7a0": "I found myself muttering the same phrase every morning as I walked my dog. 2 words:"}, {"605a": "“Thank you.”"}, {"a93f": "I would say those two words over and over again. A kind of chant. I probably looked a little crazy."}, {"b993": "“Thank you, rock.”"}, {"bdaa": "“Thank you, tree.”"}, {"a393": "“Thank you, home.”"}, {"82d9": "“Thank you, shoes.”"}, {"9dde": "As the months passed, I realized I was actually becoming more grateful by default."}, {"112c": "Weird."}, {"0003": "A few weeks after “the becoming,” I found this story, which somehow passed me when it was published:"}, {"0190": "How a Password Changed my Life.The following events occurred between ☹ and ☺.medium.com"}, {"2b28": "The guy quit smoking by changing a password?? You’ve got to be kidding me."}, {"4685": "Then, Tony Robbins proclamation in “I Am Not Your Guru.”"}, {"95a7": "“I would say to myself every morning:"}, {"7974": "I am unstoppable."}, {"4ea9": "I am unstoppable."}, {"27a3": "I am unstoppable.”"}, {"44cf": "He would say this for hours on end as he ran. Is he unstoppable? I don’t know. He believes he is unstoppable, though, and that apparently matters."}, {"b502": "I wanted more. Could there be something to this mantra thing? Does it really change you?"}, {"f2bc": "“Mantra” comes from a Sanskrit root meaning “a sacred message or text, charm, spell”"}, {"b271": "“Sacred.”"}, {"8ca7": "“Charm.”"}, {"f10d": "“Spell.”"}, {"d728": "These are all words we don’t care for much in this day and age. They scare us because we can’t see them."}, {"cd20": "It’s funny how a lot of the best outcomes in life require faith."}, {"8dda": "I actually got a frustrated researching this phenomenon. Most of what comes up when you look for “how words affect the brain,” is anecdotal information from adrenaline-fueled-entrepreneur corners of the Internet. The rest is difficult to separate from the religious roots from which the practice began. Nothing wrong with that, of course, but I was curious how language specifically affects the body. Instead, I came away with “SPEAK YOUR DREAMS INTO REALITY(!),” and other such high-flying quotables."}, {"65c4": "(By the way, this is not the first time I’ve run into this missing facts problem. It’s becoming more plain to me people spout catchy-sounding stat bites without sources. Our blind trust of the Internet is very scary. “9 out of 10 businesses fail.” Do they really? Where is your source? What time frame are you talking about? For that matter, what does “failure” really mean? And what qualifies as a “business.”"}, {"96f0": "But I digress.)"}, {"9c74": "So it seems, on the matter of mantras, that I will have to ask you for a little faith. This is my experience, which is all I can ever offer you anyway."}, {"bc42": "As I looked back, I’ve had different mantras through the years — those which have been a point of constant focus and attention for an extended amount of time."}, {"8f9d": "Each of them has changed my life in a profound way. Thinking these things did not change my life. I spoke them aloud as often as possible."}, {"c8bb": "Like a crazy person."}, {"2671": "1. “LOVE IS SACRIFICE”"}, {"0485": "Romantic or platonic, not much speaks louder than giving up something you care about for another person."}, {"c7c1": "2. “FOCUS ON FOUR”"}, {"8a9c": "This connected culture makes us think we have to impact 4,000 people to be important — maybe 4 MILLION!"}, {"6dae": "That’s too many friends. Instead, focus on four."}, {"6fb6": "If four people are bawling at your funeral, you nailed it."}, {"11dd": "3. “NO DAYS OFF”"}, {"8955": "When I left on my 5 A.M. alarm for Saturday and Sunday, these things happened:"}, {"69b4": "(See also — What Tweak Has Made All the Difference In Your Life?)"}, {"65c1": "4. “THERE’S MORE WHERE THAT CAME FROM”"}, {"0ec2": "Most people have a deep fear: One day, they will run out of ideas."}, {"50b6": "(gasp)"}, {"4709": "Writer’s block specifically has reached legendary status over the years. The word has a plague-like reputation. Once you are afflicted, you will be doomed to a life with the “normies.”"}, {"d66f": "Here’s the truth:"}, {"27b9": "All blocks are self-inflicted."}, {"bfdc": "The human brain is infinite, constantly processing new thoughts and emotions and stimuli and interactions. It is ever-searching, ever-seeking, and rarely at rest."}, {"6fc5": "I heard recently that Scott Adams (creator of Dilbert) doesn’t even plan comics ahead of time now. He just sits at the desk and starts. Even though he’s been making office jokes since 1989, there’s more where that came from."}, {"584a": "5. “30 x 30 x 30”"}, {"e871": "If you do just 30 seconds more of what you love day after day, you will likely be much more fulfilled at the end of a year."}, {"5289": "If you spend 30 consecutive days acting on an interest and don’t hate it, you have likely found a potential career. (If you do hate it, at least you explored the option.)"}, {"1a74": "If you plan on taking 30 years to build exactly the life you want, you will have much more patience for the little bumps along the way."}, {"fad2": "6. “I LOVE YOU, BUT I CAN’T GIVE YOU MY FOCUS RIGHT NOW.”"}, {"66f2": "What has suffered in this generation is our ability to work deeply. We settle for shallow interactions, quick dopamine hits, and endless entertainment."}, {"3a44": "Ignore things that are mildly important to obsess over that which is most important."}, {"e29c": "7. “HEALTH COMES FIRST”"}, {"f77b": "I wasn’t able to accomplish much in 2014. A large reason for this was because it felt like my guts were about to fall out of my stomach at any moment."}, {"d653": "Sustainable health is the foundation to sustainable anything else."}, {"4f90": "8. “80% LOVE, 20% BUSINESS”"}, {"ebd1": "My friend told me once:"}, {"ce70": "“SEO is the only way to win.”"}, {"f344": "No."}, {"1829": "The only way to win is doing things that energize you at least 80% of the time. Use the other 20% to set up a structure which will increase that 80% to 100%."}, {"ddb3": "9. “CREATION BEATS AFFIRMATION”"}, {"4aba": "One of the great ironies of life is this: the praise which follows success can stonewall your progress."}, {"c4e2": "Affirmation is a fickle, hollow drug. Do not allow it to own your self esteem."}, {"3965": "Instead, create new work. Improve your process. Continue to grow."}, {"68e6": "These things you control."}, {"5eaf": "There’s (Even) More Where This Came From"}, {"d7fb": "Have you ever worried you might become worthless?"}, {"f0e6": "I know I did. Once I wrote my first viral hit, I would terrified I could never write another."}, {"df4e": "First I was paralyzed. Then I was liberated. Now, millions of people have read my work all over the world."}, {"546e": "I’ve wrapped up the epiphany between paralyzed and liberated in my book: The Ultimate Guide to Infinite Ideas, which I’m giving away for free."}, {"9295": "Get your copy right here."}], "child": "260_1\t260_2\t260_3\t260_4\t260_5\t260_6\t260_7\t260_8\t260_9\t260_10\t260_11\t260_12\t260_13\t260_14\t260_15\t260_16\t260_17\t260_18\t260_19260_1\t260_2\t260_3\t260_4\t260_5\t260_6\t260_7\t260_8\t260_9\t260_10\t260_11\t260_12\t260_13\t260_14\t260_15\t260_16\t260_17\t260_18\t260_19260_1\t260_2\t260_3\t260_4\t260_5\t260_6\t260_7\t260_8\t260_9\t260_10\t260_11\t260_12\t260_13\t260_14\t260_15\t260_16\t260_17\t260_18\t260_19260_1\t260_2\t260_3\t260_4\t260_5\t260_6\t260_7\t260_8\t260_9\t260_10\t260_11\t260_12\t260_13\t260_14\t260_15\t260_16\t260_17\t260_18\t260_19"}