{"name": "261", "parent": "", "content": "Meet Jason and Gunnar. GoFundMe Heroes celebrates the everyday people who do extraordinary things on GoFundMe. “Gunnar was hit by a truck on February 16th of 2014. I don’t know if he smelled my scent, but he’d followed my tracks down the driveway to the mailbox, which I’d gone out to check before work. That’s when a passing truck hit him. My wife called me at work, and I raced to meet them at the vet. Gunnar was crying, and his nose was bleeding. I’d never heard him cry before, and it just about broke my heart.” On that cold winter day in a rural Wisconsin vet clinic, Jason Parker made a decision that altered the course of his life. His black lab had a spinal injury, and the vet offered euthanasia. Instead, Jason chose to fight for Gunnar. “The next day we took him home, and I slept with him that night on the floor. In the morning, I got up to find Gunnar awake but not moving. I called a vet friend of mine, and she told me to go to the university vet clinic ASAP.” Jason is a volunteer firefighter, so he knows how to stabilize patients with spinal injuries. He and his wife, Stephanie, strapped up Gunnar and hit the icy roads for the two-hour drive west to the University of Minnesota. That’s where they discovered Gunnar’s two broken vertebrae. His lower body was paralyzed, and his chance of recovery was only 50/50. Again, they offered to put Gunnar down. Again, Jason refused. “The problem with traumatic injury, especially for an animal, is you’re never prepared for it — mentally or financially. It pretty much drained us.” Jason and Stephanie laid out their credit cards for the over $6,000 in surgery bills that day, and then again for Gunnar’s second surgery for slipped pins and the months of physical therapy that followed. But Gunnar’s hind legs still didn’t move—and with immobility came pressure sores. Something needed to be done. Jason started researching paraplegic dogs and discovered canine wheelchairs — at a hefty price of $600, which after all the bills they just couldn’t afford. That’s when friends stepped up and chipped in for the cart. The day Gunnar got his wheels, he took off rolling — mobile again at last. Inspired by his friends’ kindness, Jason decided then and there that one day he’d pay it forward. In August 2016, an animal rescue in Texas reached out to Jason after finding Gunnar’s story on social media. They had a pit mix stray named Hope, who was paralyzed like Gunnar. They asked if he could help. Jason turned to Stephanie and said, “This is where it’s gonna start.” Jason found a used cart online and sent it to the shelter — addressed to Hope herself. Soon after, Jason set up a GoFundMe to collect donations for his new organization. He wanted to help other animals regain mobility and freedom. Gunnar’s Wheels was born. Seven months later, Gunnar’s Wheels has sent over 100 free loaner carts to animals in 30 states and three countries—and Jason can still recount every animal’s name and story by heart. Animals are free to use their carts until they recover or pass on, at which point Gunnar’s Wheels arranges for the loaner cart to go to a new recipient. Thanks to their GoFundMe donations, Gunnar’s Wheels hasn’t had to turn away a single animal yet. Gunnar’s Wheels has become a family affair. Jason wakes up at 5am to respond to emails before heading to work. He’s partnered with three canine wheelchair manufacturers to help cut costs, and his sister reaches out to universities and vet clinics to find spare carts. Stephanie recently filed their 501(c)(3) forms and helped Gunnar’s Wheels become a registered nonprofit. “I hope that Gunnar’s Wheels will live on. If everyone who’s ever loved an animal just gave $1, we could fund this thing into the next generation,” says Jason. “I’m hoping my kids will run this after I’m gone.” Jason still holds down a full-time job as a car parts salesman and helps out as a volunteer firefighter. As a first-responder in rural Wisconsin, Jason often sees a lot of high-speed freeway accidents, where he helps operate the Jaws of Life. Gunnar’s Wheels has helped him cope. “You can get hard as a volunteer firefighter. You see so much tragedy you almost lose your feelings. Since Gunnar’s accident, I’ve really softened up. His injury, while tragic, was a blessing for me personally and I think for animals all over. “I want people to realize that handicapped animals have options. We don’t have to give up on them. So many times vets asked me if I wanted to put Gunnar down. If I had, all of this never would’ve happened.” Jason still makes an effort to talk to every animal owner on the phone before he sends out a cart: “I give them advice on taking care of paraplegic animals. I want owners to know I’m there for them. I try to let them know, ‘Don’t worry. Help is on the way.’” Learn how you can support Gunnar’s Wheels. If Jason & Gunnar’s story inspires you, please ❤ and share. Change someone’s life — and your own. Start a GoFundMe. Photos by Andy Richter Photography.Special thanks to Jason, Gunnar, and all involved with Gunnar’s Wheels. ", "title": "Meet Jason and Gunnar.", "sentences": [{"94b8": "Meet Jason and Gunnar."}, {"2b5e": "GoFundMe Heroes celebrates the everyday people who do extraordinary things on GoFundMe."}, {"beb5": "“Gunnar was hit by a truck on February 16th of 2014."}, {"b806": "I don’t know if he smelled my scent, but he’d followed my tracks down the driveway to the mailbox, which I’d gone out to check before work. That’s when a passing truck hit him. My wife called me at work, and I raced to meet them at the vet. Gunnar was crying, and his nose was bleeding. I’d never heard him cry before, and it just about broke my heart.”"}, {"ed6b": "On that cold winter day in a rural Wisconsin vet clinic, Jason Parker made a decision that altered the course of his life. His black lab had a spinal injury, and the vet offered euthanasia. Instead, Jason chose to fight for Gunnar."}, {"906c": "“The next day we took him home, and I slept with him that night on the floor. In the morning, I got up to find Gunnar awake but not moving. I called a vet friend of mine, and she told me to go to the university vet clinic ASAP.”"}, {"64fe": "Jason is a volunteer firefighter, so he knows how to stabilize patients with spinal injuries. He and his wife, Stephanie, strapped up Gunnar and hit the icy roads for the two-hour drive west to the University of Minnesota."}, {"78c6": "That’s where they discovered Gunnar’s two broken vertebrae. His lower body was paralyzed, and his chance of recovery was only 50/50. Again, they offered to put Gunnar down. Again, Jason refused."}, {"6989": "“The problem with traumatic injury, especially for an animal, is you’re never prepared for it — mentally or financially. It pretty much drained us.”"}, {"4f84": "Jason and Stephanie laid out their credit cards for the over $6,000 in surgery bills that day, and then again for Gunnar’s second surgery for slipped pins and the months of physical therapy that followed. But Gunnar’s hind legs still didn’t move—and with immobility came pressure sores. Something needed to be done."}, {"5fe0": "Jason started researching paraplegic dogs and discovered canine wheelchairs — at a hefty price of $600, which after all the bills they just couldn’t afford. That’s when friends stepped up and chipped in for the cart. The day Gunnar got his wheels, he took off rolling — mobile again at last."}, {"483b": "Inspired by his friends’ kindness, Jason decided then and there that one day he’d pay it forward."}, {"8421": "In August 2016, an animal rescue in Texas reached out to Jason after finding Gunnar’s story on social media. They had a pit mix stray named Hope, who was paralyzed like Gunnar. They asked if he could help."}, {"000c": "Jason turned to Stephanie and said, “This is where it’s gonna start.” Jason found a used cart online and sent it to the shelter — addressed to Hope herself."}, {"be87": "Soon after, Jason set up a GoFundMe to collect donations for his new organization. He wanted to help other animals regain mobility and freedom. Gunnar’s Wheels was born."}, {"b440": "Seven months later, Gunnar’s Wheels has sent over 100 free loaner carts to animals in 30 states and three countries—and Jason can still recount every animal’s name and story by heart."}, {"cc1b": "Animals are free to use their carts until they recover or pass on, at which point Gunnar’s Wheels arranges for the loaner cart to go to a new recipient."}, {"9fa9": "Thanks to their GoFundMe donations, Gunnar’s Wheels hasn’t had to turn away a single animal yet."}, {"d632": "Gunnar’s Wheels has become a family affair. Jason wakes up at 5am to respond to emails before heading to work. He’s partnered with three canine wheelchair manufacturers to help cut costs, and his sister reaches out to universities and vet clinics to find spare carts. Stephanie recently filed their 501(c)(3) forms and helped Gunnar’s Wheels become a registered nonprofit."}, {"fa31": "“I hope that Gunnar’s Wheels will live on. If everyone who’s ever loved an animal just gave $1, we could fund this thing into the next generation,” says Jason. “I’m hoping my kids will run this after I’m gone.”"}, {"2b7e": "Jason still holds down a full-time job as a car parts salesman and helps out as a volunteer firefighter. As a first-responder in rural Wisconsin, Jason often sees a lot of high-speed freeway accidents, where he helps operate the Jaws of Life. Gunnar’s Wheels has helped him cope."}, {"42be": "“You can get hard as a volunteer firefighter. You see so much tragedy you almost lose your feelings. Since Gunnar’s accident, I’ve really softened up. His injury, while tragic, was a blessing for me personally and I think for animals all over."}, {"ee4b": "“I want people to realize that handicapped animals have options. We don’t have to give up on them. So many times vets asked me if I wanted to put Gunnar down. If I had, all of this never would’ve happened.”"}, {"b6d8": "Jason still makes an effort to talk to every animal owner on the phone before he sends out a cart: “I give them advice on taking care of paraplegic animals. I want owners to know I’m there for them. I try to let them know, ‘Don’t worry. Help is on the way.’”"}, {"b27f": "Learn how you can support Gunnar’s Wheels."}, {"be85": "If Jason & Gunnar’s story inspires you, please ❤ and share."}, {"6121": "Change someone’s life — and your own. Start a GoFundMe."}, {"8b0a": "Photos by Andy Richter Photography.Special thanks to Jason, Gunnar, and all involved with Gunnar’s Wheels."}], "child": "261_1\t261_2\t261_3\t261_4\t261_5\t261_6\t261_7\t261_8\t261_9\t261_10\t261_11\t261_12\t261_13261_1\t261_2\t261_3\t261_4\t261_5\t261_6\t261_7\t261_8\t261_9\t261_10\t261_11\t261_12\t261_13261_1\t261_2\t261_3\t261_4\t261_5\t261_6\t261_7\t261_8\t261_9\t261_10\t261_11\t261_12\t261_13"}