{"name": "265", "parent": "", "content": "This is the Way to Overcome Laziness and Find Greatness As human beings, our greatness lies not so much in being able to remake the world. It is in being able to remake ourselves. — Mahatma Gandhi The best way to defeat laziness — or inactivity in general — is to adopt an attitude of intelligent, hard work in everything you do on a daily basis. To paraphrase former UCLA Head Basketball Coach John Wooden: Imagine your happiness and definition of success. This is the self-satisfaction that comes from knowing you put in your best effort to achieve something special. Starting out, it could simply be training your mind to win the small battles. Maybe it’s just one activity or one hour each day of dedicating your mind to working hard and concentrating on the task at hand (washing the dishes, finishing off the laundry or completing a spreadsheet at work, etc.). Never, ever dismiss the quick wins! Even if you intend to win the favor of others, particularly through business or volunteer work, you’ll realize huge gains in self-satisfaction by working hard. Your sacrifice will be for others, but your increase in service and character will be immeasurable. You’ll gain so much value for yourself. This is critical to understand! Make a Change To Avoid Laziness Laziness never arrived at the attainment of a good wish. — Miguel de Cervantes I spent a good portion of my 20’s struggling mightily (at times) with laziness and inactivity in the workplace. This sometimes trickled into other areas of my life, either in home chores or my self-improvement and professional development. I often thought and analyzed these feelings but I failed to take action at the time it was happening. After one too many inner battles of strife, I resolved to turn things around and make a change. I focused my attack and planning around incorporating activities into my daily life for which I have passion. I decided to place an acute emphasis on linking hard work to happiness and enjoyment. I came to realize the net effect would be a feeling of accomplishment. What about you? Do you find yourself putting off your dreams? When do you find your biggest moments of laziness? Most importantly — what are you doing about it right now? For your life’s work, you should strive to do what makes you happy and what you believe you have been called to do. The reality is, the earlier you start, the better. But know this — all hope is not lost by getting a late start on things. The more experience you gain, the more you’ll be able to discern and make sense of what you’ve done on your way to the top. Depending on your age, you’ll realize at some point in time, you’re not just accountable in this life to yourself. You’ll need to support not only yourself, but very likely your birth family, maybe even friends and your future family. This is worth understanding. It’s not just about you. Always understand this! We cannot live in a utopia where we only do what we want, when we want. There are repercussions to that approach. We need to have skills in life that enable us to not just survive — but thrive in a capitalist economy. We should not be content with toiling in a job that isn’t for us (to the extent we can control this). We have to aspire and work for more than the status quo. If we’re not careful, doing things we don’t enjoy can lead to laziness. Laziness can lead to apathy, disillusionment and depression. It’s a path we should avoid at all costs. There are outside factors that can bind us to various roles (money, lack of choice to name a few). Some of us will find ourselves in unsatisfying positions at times. That’s a fact of life for most people. Live Above the Line Being confident and believing in your own self-worth is necessary to achieving your potential. — Sheryl Sandberg To the extent we can control things, we need to persevere and align our end destination with our interests and skills. The best part is, if you’re willing to analyze yourself and come to peace with that which makes you happy, you’ll already have fought half the battle. So much of living “above the line” in our lives, and making smart decisions, is realizing we’re living, “below the line.” What I mean by this is, we need to develop keen self-awareness to realize that some of our behaviors are not leading us to success, happiness or peace of mind. Living below the line means negative thoughts, lack of energy and making excuses. Simply put- living below the line is reactive, whereas living above the line is proactive. Self-awareness is one of the most valuable skills in life and the more of it you have, the wiser you are. This is an absolutely essential and critical underpinning of emotional intelligence! source: Daniel Goleman’s Emotional Intelligence Theory Self-Awareness and Emotional Intelligence Daniel Goleman, the author of the wildly successful book, Emotional Intelligence, has written extensively about self-awareness. In fact, it’s one of his four realms of emotional intelligence. The other three are self-regulation, empathy and social skill. Goleman writes about the self-aware individual possessing a bit picture view that enables them to make the best decisions: “Emotional self-awareness is a leadership competency that shows up in model after model. These are the leaders attuned to their inner signals, recognizing how their feelings affect them and their job performance. They integrate their guiding values into their work. They can deduce the best course of action. They see the big picture and they’re genuine.” When you are self-aware, you are then able to determine the mediums where you can add value in life, while cutting out laziness. You can decide where to best invest your time and resources. The rest is simply a matter of maintaining a positive attitude and working hard to achieve your planned goals. You can eradicate laziness by filling your plate with daily work, activities and hobbies that matter to your life. It is always best when these activities are things you have passions for. Things that mesh with your mission in life and your outlook for who you want to be. You are meant to live boldly! You are destined for greatness. When you work hard, great things are possible. You leave nothing up to chance and you eliminate laziness- and all its drawbacks- from invading your life. Live Boldly! Want more great content like this? Find my absolute best, plus a free offer by subscribing for awesome updates on my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! Good luck! ", "title": "This is the Way to Overcome Laziness and Find Greatness", "sentences": [{"5307": "This is the Way to Overcome Laziness and Find Greatness"}, {"5c21": "As human beings, our greatness lies not so much in being able to remake the world. It is in being able to remake ourselves. — Mahatma Gandhi"}, {"d818": "The best way to defeat laziness — or inactivity in general — is to adopt an attitude of intelligent, hard work in everything you do on a daily basis. To paraphrase former UCLA Head Basketball Coach John Wooden: Imagine your happiness and definition of success. This is the self-satisfaction that comes from knowing you put in your best effort to achieve something special."}, {"6bee": "Starting out, it could simply be training your mind to win the small battles. Maybe it’s just one activity or one hour each day of dedicating your mind to working hard and concentrating on the task at hand (washing the dishes, finishing off the laundry or completing a spreadsheet at work, etc.). Never, ever dismiss the quick wins!"}, {"7aae": "Even if you intend to win the favor of others, particularly through business or volunteer work, you’ll realize huge gains in self-satisfaction by working hard. Your sacrifice will be for others, but your increase in service and character will be immeasurable. You’ll gain so much value for yourself. This is critical to understand!"}, {"ad0c": "Make a Change To Avoid Laziness"}, {"78f0": "Laziness never arrived at the attainment of a good wish. — Miguel de Cervantes"}, {"05b5": "I spent a good portion of my 20’s struggling mightily (at times) with laziness and inactivity in the workplace. This sometimes trickled into other areas of my life, either in home chores or my self-improvement and professional development. I often thought and analyzed these feelings but I failed to take action at the time it was happening."}, {"ce2a": "After one too many inner battles of strife, I resolved to turn things around and make a change. I focused my attack and planning around incorporating activities into my daily life for which I have passion. I decided to place an acute emphasis on linking hard work to happiness and enjoyment. I came to realize the net effect would be a feeling of accomplishment."}, {"5c45": "What about you? Do you find yourself putting off your dreams? When do you find your biggest moments of laziness? Most importantly — what are you doing about it right now?"}, {"99cd": "For your life’s work, you should strive to do what makes you happy and what you believe you have been called to do. The reality is, the earlier you start, the better. But know this — all hope is not lost by getting a late start on things. The more experience you gain, the more you’ll be able to discern and make sense of what you’ve done on your way to the top."}, {"ca22": "Depending on your age, you’ll realize at some point in time, you’re not just accountable in this life to yourself. You’ll need to support not only yourself, but very likely your birth family, maybe even friends and your future family. This is worth understanding. It’s not just about you. Always understand this!"}, {"a7b0": "We cannot live in a utopia where we only do what we want, when we want. There are repercussions to that approach. We need to have skills in life that enable us to not just survive — but thrive in a capitalist economy. We should not be content with toiling in a job that isn’t for us (to the extent we can control this). We have to aspire and work for more than the status quo."}, {"fca6": "If we’re not careful, doing things we don’t enjoy can lead to laziness. Laziness can lead to apathy, disillusionment and depression. It’s a path we should avoid at all costs. There are outside factors that can bind us to various roles (money, lack of choice to name a few). Some of us will find ourselves in unsatisfying positions at times. That’s a fact of life for most people."}, {"2e5d": "Live Above the Line"}, {"cc58": "Being confident and believing in your own self-worth is necessary to achieving your potential. — Sheryl Sandberg"}, {"2721": "To the extent we can control things, we need to persevere and align our end destination with our interests and skills. The best part is, if you’re willing to analyze yourself and come to peace with that which makes you happy, you’ll already have fought half the battle."}, {"2d2d": "So much of living “above the line” in our lives, and making smart decisions, is realizing we’re living, “below the line.” What I mean by this is, we need to develop keen self-awareness to realize that some of our behaviors are not leading us to success, happiness or peace of mind. Living below the line means negative thoughts, lack of energy and making excuses."}, {"1d76": "Simply put- living below the line is reactive, whereas living above the line is proactive. Self-awareness is one of the most valuable skills in life and the more of it you have, the wiser you are. This is an absolutely essential and critical underpinning of emotional intelligence!"}, {"2e0d": "source: Daniel Goleman’s Emotional Intelligence Theory"}, {"3316": "Self-Awareness and Emotional Intelligence"}, {"c14c": "Daniel Goleman, the author of the wildly successful book, Emotional Intelligence, has written extensively about self-awareness. In fact, it’s one of his four realms of emotional intelligence. The other three are self-regulation, empathy and social skill. Goleman writes about the self-aware individual possessing a bit picture view that enables them to make the best decisions:"}, {"e90b": "“Emotional self-awareness is a leadership competency that shows up in model after model. These are the leaders attuned to their inner signals, recognizing how their feelings affect them and their job performance. They integrate their guiding values into their work. They can deduce the best course of action. They see the big picture and they’re genuine.”"}, {"07f0": "When you are self-aware, you are then able to determine the mediums where you can add value in life, while cutting out laziness. You can decide where to best invest your time and resources. The rest is simply a matter of maintaining a positive attitude and working hard to achieve your planned goals."}, {"bc19": "You can eradicate laziness by filling your plate with daily work, activities and hobbies that matter to your life. It is always best when these activities are things you have passions for. Things that mesh with your mission in life and your outlook for who you want to be."}, {"35e9": "You are meant to live boldly! You are destined for greatness. When you work hard, great things are possible. You leave nothing up to chance and you eliminate laziness- and all its drawbacks- from invading your life."}, {"2c38": "Live Boldly!"}, {"a59d": "Want more great content like this? Find my absolute best, plus a free offer by subscribing for awesome updates on my Newsletter! Like my Facebook writer’s page here and follow me on Instagram! If you enjoyed reading this piece, please be so kind as to share and recommend to others. Also, please consider following me here on Medium! Good luck!"}], "child": "265_1\t265_2\t265_3\t265_4\t265_5\t265_6\t265_7\t265_8\t265_9"}