{"name": "267", "parent": "", "content": "Are engineers the best product designers? Maybe budding designers should get comp sci. degrees instead. Pfft, No. Of course not. Look at some of the design thought leaders of today — Matias Duarte (Google), Julie Zhuo (Facebook), or even some old timers (no offence) like Jared Spool and Don Norman. Their job titles, the books they write, their talks and seminars are all to do with design. Except… A quick Google search will show you that all of the people I just mentioned started as engineers or have a science background. I see what you did there. Of course I’m leaving out a ton of amazing designers who are from design backgrounds like Tim Brown, Jony Ive, etc. but why is it that when we look at some of the biggest movers and shakers of the design industry today, we see engineering as the basis of their successes? Design and engineering have been linked as fields since as far back as we can remember. One prescribes a solution, the other makes the solution possible. John Lasseter, one of the original minds behind Pixar who is now CCO of Disney, is oft quoted for saying: The art challenges the technology, and the technology inspires the art. If you replace art with design, and technology with engineering, the same quote is true. Dory, hate to break it to you, but you were manufactured by over 100 engineers Dreamers vs Pragmatists When humans wanted to cross the ocean, we first needed someone to dream about the possibility of being able to cross the ocean on a ship. That person needed to be able to see something that had not yet physically manifested itself in the minds of his or her peers, and design a solution that would fit the ideal version of a solution to the problem. The designer(s) could have been inspired by an engineering breakthrough at the time for nautical travel, or perhaps the then impossible dream of a trans-continental ship is what challenged the engineers to make it feasible. Of course, design is design because it has constraints. The designer had to dream of an ideal solution but be pragmatic enough to understand what was possible with what he or she knew could be done. The ideal design would have at that time pushed the limits of Human desirability, technical feasibility, and economic viability — Tim Brown The designer could have dreamt of airplanes, but if at that time travel by water was already a technically challenging endeavour, then he or she would have to work within that constraint. So really, the designer to some degree also had to understand engineering, or else he’d just be a quack who thought that one day humans would be able to fly to other continents in giant tubes. What folly. Make Design Great Again I’m not just talking about old boats here either. Look at the products you use. Your kettle had to be designed, and then engineered. Your rain jacket would be useless if it was easy to put on, looked great but didn’t actually repel water (well, unless it made you look fantastic). Heck — let’s take a quick pop back in time, and remember the renaissance man; the term was coined for a reason. Michelangelo was not just a sculptor, Da Vinci not just a painter. Brunelleschi had great works of art but also built the then-deemed-impossible dome of the Florence Duomo. We can see that design and engineering have been inextricably linked for a very long time — and not only that, but that a lot of products in the past were designed and engineered by the same people. For your next design gig, please build the ceiling of the palace AND paint it with lots of naked people Of course in today’s world, when our roles are so specific, an engineer is usually just an engineer, and a designer is just a designer. We profile people’s skill sets with simple titles that are supposed to be exclusive to our abilities when in fact we are never only capable of what our job titles say we are. Sir, could I have some more UX problems please? My role at my current position is as a UX designer at a software startup. During design & product meetings, it’s really common that the engineers and I will constantly debate about the placement of buttons, the hierarchy of information, even aesthetics and other things that would be under the umbrella of design. All of that chatter kept leading me to think — would they make better design decisions than me? (I’m a classically trained graphic designer/illustrator.) And the thing is, they had awesome points of views and really great insights. One thing led to another, and soon I was on the streets without a job, begging for design consultancy gigs from engineering firms. Just kidding. What I did notice was that the debates back and forth came rooted from different perspectives — theirs were strongly from logical reasoning, factual data, etc. And mine a lot of the times were simply from experience, watching users interact with products, talking to them and trying to understand their motives, etc. They would argue that a button should be on the left because users read left to right, and I would argue that it feels awkward for users because they write with their right hands. Then it hit me. Both sides of the discussion were productive because the study of UX design is ultimately the study of human behaviour, and humans are inherently both logical and emotional. If you don’t intimately know these guys, you won’t be a good designer. Good luck with Mr. anger. Some neuroscientists like Antonio Damasio even claim that humans are primarily emotional, logic comes second. Regardless, very few will disagree that humans base their decision-making around both, often depending on historical habits, moods, value/cost calculations, etc. The Verdict So where does that leave us on our original conclusion then? Well, the answer is, engineers win. The end. Jokes aside, does it really matter? The best designers at the end of the day are the best designers, whether they came from an engineering background or not. Here’s the real conclusion — as a designer, you need to have both empathy for the user, and also understand logically how they make decisions. In that sense, it is very difficult for a designer who doesn’t understand engineering to be a great designer, and vice versa. If an engineering background locks the designer into only thinking logically, he or she is bound to fail. The most successful designers in the world will be the ones who understand humans needs, wants and behaviours the most deeply. If those folks started as engineers, then so be it. Heck, as an industry we could use all the help we can get. Scientists solve the problems of the present, mathematicians solve problems independent of time, but designers— designers solve the problems of the future. — Anon. If you liked this post, please ♥ it, and follow me for more! I write about learning, design, entrepreneurship and life. Follow me for more good, scrumptious perspectives on all things this side of heaven. My writing is meh, but I like to think my ideas are worth a dime or two. ", "title": "Are engineers the best product designers?", "sentences": [{"cb3e": "Are engineers the best product designers?"}, {"31db": "Maybe budding designers should get comp sci. degrees instead."}, {"738e": "Pfft, No. Of course not. Look at some of the design thought leaders of today — Matias Duarte (Google), Julie Zhuo (Facebook), or even some old timers (no offence) like Jared Spool and Don Norman. Their job titles, the books they write, their talks and seminars are all to do with design."}, {"8a4a": "Except…"}, {"d05e": "A quick Google search will show you that all of the people I just mentioned started as engineers or have a science background."}, {"0d38": "I see what you did there."}, {"35e0": "Of course I’m leaving out a ton of amazing designers who are from design backgrounds like Tim Brown, Jony Ive, etc. but why is it that when we look at some of the biggest movers and shakers of the design industry today, we see engineering as the basis of their successes?"}, {"cc1c": "Design and engineering have been linked as fields since as far back as we can remember. One prescribes a solution, the other makes the solution possible. John Lasseter, one of the original minds behind Pixar who is now CCO of Disney, is oft quoted for saying:"}, {"252b": "The art challenges the technology, and the technology inspires the art."}, {"60de": "If you replace art with design, and technology with engineering, the same quote is true."}, {"9553": "Dory, hate to break it to you, but you were manufactured by over 100 engineers"}, {"4fcb": "Dreamers vs Pragmatists"}, {"eece": "When humans wanted to cross the ocean, we first needed someone to dream about the possibility of being able to cross the ocean on a ship. That person needed to be able to see something that had not yet physically manifested itself in the minds of his or her peers, and design a solution that would fit the ideal version of a solution to the problem. The designer(s) could have been inspired by an engineering breakthrough at the time for nautical travel, or perhaps the then impossible dream of a trans-continental ship is what challenged the engineers to make it feasible."}, {"96d0": "Of course, design is design because it has constraints. The designer had to dream of an ideal solution but be pragmatic enough to understand what was possible with what he or she knew could be done. The ideal design would have at that time pushed the limits of"}, {"ea61": "Human desirability, technical feasibility, and economic viability"}, {"fa9d": "— Tim Brown"}, {"a263": "The designer could have dreamt of airplanes, but if at that time travel by water was already a technically challenging endeavour, then he or she would have to work within that constraint. So really, the designer to some degree also had to understand engineering, or else he’d just be a quack who thought that one day humans would be able to fly to other continents in giant tubes. What folly."}, {"b1e5": "Make Design Great Again"}, {"4189": "I’m not just talking about old boats here either. Look at the products you use. Your kettle had to be designed, and then engineered. Your rain jacket would be useless if it was easy to put on, looked great but didn’t actually repel water (well, unless it made you look fantastic). Heck — let’s take a quick pop back in time, and remember the renaissance man; the term was coined for a reason."}, {"c314": "Michelangelo was not just a sculptor, Da Vinci not just a painter. Brunelleschi had great works of art but also built the then-deemed-impossible dome of the Florence Duomo. We can see that design and engineering have been inextricably linked for a very long time — and not only that, but that a lot of products in the past were designed and engineered by the same people."}, {"a293": "For your next design gig, please build the ceiling of the palace AND paint it with lots of naked people"}, {"6ca8": "Of course in today’s world, when our roles are so specific, an engineer is usually just an engineer, and a designer is just a designer. We profile people’s skill sets with simple titles that are supposed to be exclusive to our abilities when in fact we are never only capable of what our job titles say we are."}, {"162c": "Sir, could I have some more UX problems please?"}, {"5416": "My role at my current position is as a UX designer at a software startup. During design & product meetings, it’s really common that the engineers and I will constantly debate about the placement of buttons, the hierarchy of information, even aesthetics and other things that would be under the umbrella of design."}, {"5de6": "All of that chatter kept leading me to think — would they make better design decisions than me? (I’m a classically trained graphic designer/illustrator.) And the thing is, they had awesome points of views and really great insights. One thing led to another, and soon I was on the streets without a job, begging for design consultancy gigs from engineering firms."}, {"a953": "Just kidding."}, {"ecb5": "What I did notice was that the debates back and forth came rooted from different perspectives — theirs were strongly from logical reasoning, factual data, etc. And mine a lot of the times were simply from experience, watching users interact with products, talking to them and trying to understand their motives, etc. They would argue that a button should be on the left because users read left to right, and I would argue that it feels awkward for users because they write with their right hands."}, {"70cd": "Then it hit me."}, {"ab25": "Both sides of the discussion were productive because the study of UX design is ultimately the study of human behaviour, and humans are inherently both logical and emotional."}, {"ed20": "If you don’t intimately know these guys, you won’t be a good designer. Good luck with Mr. anger."}, {"cc85": "Some neuroscientists like Antonio Damasio even claim that humans are primarily emotional, logic comes second. Regardless, very few will disagree that humans base their decision-making around both, often depending on historical habits, moods, value/cost calculations, etc."}, {"9438": "The Verdict"}, {"bf62": "So where does that leave us on our original conclusion then? Well, the answer is, engineers win. The end."}, {"84be": "Jokes aside, does it really matter? The best designers at the end of the day are the best designers, whether they came from an engineering background or not. Here’s the real conclusion — as a designer, you need to have both empathy for the user, and also understand logically how they make decisions. In that sense, it is very difficult for a designer who doesn’t understand engineering to be a great designer, and vice versa. If an engineering background locks the designer into only thinking logically, he or she is bound to fail."}, {"4267": "The most successful designers in the world will be the ones who understand humans needs, wants and behaviours the most deeply. If those folks started as engineers, then so be it. Heck, as an industry we could use all the help we can get."}, {"e220": "Scientists solve the problems of the present, mathematicians solve problems independent of time, but designers— designers solve the problems of the future. — Anon."}, {"c6cb": "If you liked this post, please ♥ it, and follow me for more! I write about learning, design, entrepreneurship and life. Follow me for more good, scrumptious perspectives on all things this side of heaven. My writing is meh, but I like to think my ideas are worth a dime or two."}], "child": "267_1\t267_2267_1\t267_2267_1\t267_2267_1\t267_2"}