{"name": "275", "parent": "", "content": "10 annoying issues in Sketch and 9 easy solutions for them Get monthly cutting edge emails for designers: https://upscri.be/bb0afd/ I am a big Sketch fan since I moved from Adobe Photoshop. We designers love it, seriously! But … sometimes this app is driving me nuts. So what is wrong there? List of issues: And I solved 9 of 10 issues. I hope together in comments we will figure out what to do with the #7. Fixing the issues 1. Half pixels What is a magical trick on the GIF below? Look at the values on a right side. Solutions: Done. Go back to your project, select the top group and press a shortcut. This “Round to Pixel” will be applied to any object inside, except “Lines”, although. It does not work for them. I recommend using “Rectangles” instead. 2. With “Command + v” Sketch inserts objects to a random position on the artboard. Solution: Use “Paste Here” option. It will arrange an object right there. 3. Sketch works slowly and drive is running out of space. Screen with the .sketch files which store on your hard drive Solution: Here is an instruction how to solve it. I got 130gb free space on my MacBook, for instance! 4. Mess within an artboard panel. We can follow the rules of the naming of groups but anyway it is completely impossible to find something while so many groups are open. Now your life is way easier. Press shortcut if you are lost somewhere between groups on the left panel. Solution: Assign a new shortcut to fold/collapse it! 5. Selecting of objects is painful. How many times should I click to select an object? Sometimes 6. Then deeper that layer in structure than more clicks it requires. Here I clicked only 1 time instead of 3. How? Solution: Hold “Command” key when you click on an object. That is it. 6. Lack of collaboration. We don’t have any Sketch solution out from the box that just works. However, we have some good solutions from Craft and Picnic Plugins. Sharing sketch files with the colleagues is just bad. These guys are developing good solution — auto syncing with sketch files in real time! Unfortunately, plugin is still under development. Waiting for a beta! Solution: Craft already has a solution to move discussions into good workspace. 7. Can not apply “Shared style” to the layer’s group. Very often I need to apply new color for SVG icon wich stays somewhere in a deep into group or I want to apply the new Shared Style for each icon inside a group. In current condition, shared styles can not be applied to the layer’s group. Very sad. On this icon is not blue, although should be like this due to applied style. It does not work. Send a comment you know how to fix it, dear friend. Not solved yet. 8. Zooming. How to find zooming range that I need? 100%, 50%, 25% — poor choice. Solution: There is a shortcut for it, indeed. Hold a “Command” key and use mouse scroll. It will zoom-in or zoom-out by 4% on an each step. 9. When I move several artboards with “Shift” key on hold one artboard becomes unselected. The reason for using it — each time when you hold “Shift” and move artboards by mouse they move only vertically or horizontally. It helps to move things in strong order. That “Bug” is shown here Solution: Select the artboards, click and hold on artboard name (like on a screenshot below), hold “Shift”. Drag them around. It works. 10. Sketch doesn’t fill “line-height” value for text correctly. With each newly added text layer, you may notice that line height is not good for reading. We have to count each time a formula — text size * 1.5 = good line-height. For example: 14px * 1.5 = 21px. Solution: There is a plugin for it, and it is awesome!Press Command + L to set the line-height ratio. The final word Issue number #7 is not solved yet. Does somebody know that way to fix it? What is your struggle in Sketch? What should I solve with the next article? Add your email to my list and share this article with other Sketch-addicted designers 😍 ", "title": "10 annoying issues in Sketch and 9 easy solutions for them", "sentences": [{"1d43": "10 annoying issues in Sketch and 9 easy solutions for them"}, {"7a06": "Get monthly cutting edge emails for designers: https://upscri.be/bb0afd/"}, {"e0e3": "I am a big Sketch fan since I moved from Adobe Photoshop. We designers love it, seriously!"}, {"1f0e": "But … sometimes this app is driving me nuts. So what is wrong there?"}, {"db6e": "List of issues:"}, {"3694": "And I solved 9 of 10 issues. I hope together in comments we will figure out what to do with the #7."}, {"d5d6": "Fixing the issues"}, {"9fc9": "1. Half pixels"}, {"8c99": "What is a magical trick on the GIF below? Look at the values on a right side."}, {"579c": "Solutions:"}, {"3dc3": "Done. Go back to your project, select the top group and press a shortcut. This “Round to Pixel” will be applied to any object inside, except “Lines”, although. It does not work for them. I recommend using “Rectangles” instead."}, {"0e84": "2. With “Command + v” Sketch inserts objects to a random position on the artboard."}, {"5bf0": "Solution: Use “Paste Here” option. It will arrange an object right there."}, {"144c": "3. Sketch works slowly and drive is running out of space."}, {"d913": "Screen with the .sketch files which store on your hard drive"}, {"ec55": "Solution: Here is an instruction how to solve it. I got 130gb free space on my MacBook, for instance!"}, {"485e": "4. Mess within an artboard panel."}, {"270a": "We can follow the rules of the naming of groups but anyway it is completely impossible to find something while so many groups are open."}, {"8183": "Now your life is way easier. Press shortcut if you are lost somewhere between groups on the left panel."}, {"2dcb": "Solution: Assign a new shortcut to fold/collapse it!"}, {"f962": "5. Selecting of objects is painful."}, {"cc40": "How many times should I click to select an object? Sometimes 6. Then deeper that layer in structure than more clicks it requires."}, {"ca13": "Here I clicked only 1 time instead of 3. How? Solution: Hold “Command” key when you click on an object. That is it."}, {"4811": "6. Lack of collaboration."}, {"10a8": "We don’t have any Sketch solution out from the box that just works. However, we have some good solutions from Craft and Picnic Plugins."}, {"007c": "Sharing sketch files with the colleagues is just bad. These guys are developing good solution — auto syncing with sketch files in real time! Unfortunately, plugin is still under development. Waiting for a beta!"}, {"45da": "Solution: Craft already has a solution to move discussions into good workspace."}, {"1e5e": "7. Can not apply “Shared style” to the layer’s group."}, {"5219": "Very often I need to apply new color for SVG icon wich stays somewhere in a deep into group or I want to apply the new Shared Style for each icon inside a group. In current condition, shared styles can not be applied to the layer’s group. Very sad."}, {"a60e": "On this icon is not blue, although should be like this due to applied style. It does not work."}, {"20d3": "Send a comment you know how to fix it, dear friend. Not solved yet."}, {"3add": "8. Zooming."}, {"e8e1": "How to find zooming range that I need? 100%, 50%, 25% — poor choice."}, {"679f": "Solution: There is a shortcut for it, indeed. Hold a “Command” key and use mouse scroll. It will zoom-in or zoom-out by 4% on an each step."}, {"1a8d": "9. When I move several artboards with “Shift” key on hold one artboard becomes unselected."}, {"72aa": "The reason for using it — each time when you hold “Shift” and move artboards by mouse they move only vertically or horizontally. It helps to move things in strong order."}, {"1447": "That “Bug” is shown here"}, {"79ee": "Solution: Select the artboards, click and hold on artboard name (like on a screenshot below), hold “Shift”. Drag them around. It works."}, {"c5d5": "10. Sketch doesn’t fill “line-height” value for text correctly."}, {"b3bf": "With each newly added text layer, you may notice that line height is not good for reading. We have to count each time a formula — text size * 1.5 = good line-height. For example: 14px * 1.5 = 21px."}, {"153b": "Solution: There is a plugin for it, and it is awesome!Press Command + L to set the line-height ratio."}, {"b070": "The final word"}, {"a308": "Issue number #7 is not solved yet. Does somebody know that way to fix it? What is your struggle in Sketch? What should I solve with the next article? Add your email to my list and share this article with other Sketch-addicted designers 😍"}], "child": "275_1\t275_2\t275_3\t275_4\t275_5\t275_6\t275_7\t275_8\t275_9\t275_10\t275_11\t275_12\t275_13\t275_14\t275_15\t275_16\t275_17\t275_18\t275_19\t275_20\t275_21\t275_22\t275_23275_1\t275_2\t275_3\t275_4\t275_5\t275_6\t275_7\t275_8\t275_9\t275_10\t275_11\t275_12\t275_13\t275_14\t275_15\t275_16\t275_17\t275_18\t275_19\t275_20\t275_21\t275_22\t275_23"}