{"name": "288", "parent": "", "content": "How to be a good writer with a good life The WRITER Framework I have a thing about teeny, tiny goals. They’ve changed my life, more than once. For the last couple of months, I’ve been kicking around the idea of stacking teeny, tiny goals. I can (obviously) fit six in an hour. So, I started thinking about the things that might help me to become a more well-rounded writer and generally happy human being. Writing and reading, of course. But also physical, mental, and emotional well-being. Here’s what I came up with: The WRITER Framework. WRITER stands for Writing, Reading, Ideation, Talking, Exercising, and Regrouping. Everyday, for at least ten minutes a day, I do these things. I write fiction. I read fiction. I make a list of ten ideas. (Thanks James Altucher!) I talk to someone I don’t live with. I exercise. I review my day and plan for tomorrow. The first two are all about being a writer. They’re the building blocks of your craft and if you do them everyday, even for a few minutes, you won’t be able to help improving. The rest about the good life part of the equation. The secret sauce. The best thing about teeny, tiny goals is that they’re so small — it’s easier to just do them than it is to skip them. Psychologically. An hour long goal? Not so much. You can skip an hour. No problem. So, the key is to keep the goals separate in your head. That way, if you skip your walk, or have a recluse day, you might not skip everything else. Also, for everything on this list, ten minutes is a guilt-free minimum. Hit ten minutes and you can stop. You’re a rock star! You’ve hit your goal. Give yourself a gold star. (I mean it. Get a calendar and some star stickers. Do it up.) But, I can almost guarantee that one day you’ll find yourself writing for an hour or you’ll take a nice long walk or fall into a great conversation with someone. I followed the Framework everyday for a month. Here’s what happened. I wrote nearly 19,000 words toward my new novel. Incidentally, I also wrote on Medium every day. I clearly write more than ten minutes a day. What this little goal does for me is simple. It keeps me writing every single days. There was at least one day a week over the last month where I would have just skipped writing. But, because I had this goal, I didn’t. Which is good, because I know from long experience that skipping one day leads so easily into skipping two. I read eleven books. I’m in an MFA program and I have to read a lot. Ten books a month. Plus, I read a poem, an essay, and a short story every day for the 1000 Day MFA program I run through Ninja Writers. So, the ten minutes a day? That represents the extra book. I read that one just for pure pleasure. In ten minutes a day. It was Blackbirds by Chuck Wendig. I had 300 ideas! A couple of them were even good. I came up with ideas for friends. Ideas for silly apps I’d love to have. Books I want to write. Fairy tale tropes. Ideas for a new newsletter. Ten people I want to meet and how I can do that. One of them was James Altucher, who writes a lot about the power of writing down ten ideas a day. I asked him if he minded if I included it as the I in WRITER. He didn’t. (This counts for T, too!) I reached out to people and some of them reached back. That was huge fun. Besides James, I also had coffee with Jonas Ellison. And lunch with my friend Tracy. I talked to the lady who works at the fabric counter at Wal-mart about her grandchildren. I called my sister. I talked a couple of times to my friend Amy. I talked to my ex-husband’s sister, who is also called Amy. I spoke to the other soccer moms, instead of sitting by myself feeling awkward. I lost seven pounds. This is about 100 percent because exercising everyday made me more mindful of what I was eating. I started a new note keeping system and set up a writing accountability tool that I love. I can’t believe that I’ve never heard of a Commonplace Book before. This feels like a pivotal moment. Before and after my Commonplace Book. I wrote an ebook about this thing. It’s the reward for patrons at the $3 level and above on the Ninja Writer Patreon account. It goes into much greater detail about each aspect of the WRITER framework and there are a couple of printables, too. You can get it here. The past $3 awards were The Writing Planner, The Plotting Workshop eBook, and an eBook called 31 Days of Ninja Writing. You’ll get all of those, too. Here’s a sneak peak at the printables: Liked this piece? Give it a ❤ & join us on Facebook & our Patreon page! Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "title": "How to be a good writer with a good life", "sentences": [{"643d": "How to be a good writer with a good life"}, {"5f3c": "The WRITER Framework"}, {"8e22": "I have a thing about teeny, tiny goals."}, {"8245": "They’ve changed my life, more than once."}, {"9caa": "For the last couple of months, I’ve been kicking around the idea of stacking teeny, tiny goals. I can (obviously) fit six in an hour. So, I started thinking about the things that might help me to become a more well-rounded writer and generally happy human being."}, {"95f9": "Writing and reading, of course."}, {"bc96": "But also physical, mental, and emotional well-being."}, {"8912": "Here’s what I came up with: The WRITER Framework."}, {"b485": "WRITER stands for Writing, Reading, Ideation, Talking, Exercising, and Regrouping."}, {"9cc9": "Everyday, for at least ten minutes a day, I do these things."}, {"b56b": "I write fiction."}, {"1cd7": "I read fiction."}, {"3a4a": "I make a list of ten ideas. (Thanks James Altucher!)"}, {"70d6": "I talk to someone I don’t live with."}, {"d70a": "I exercise."}, {"9828": "I review my day and plan for tomorrow."}, {"2552": "The first two are all about being a writer. They’re the building blocks of your craft and if you do them everyday, even for a few minutes, you won’t be able to help improving."}, {"bd8d": "The rest about the good life part of the equation."}, {"49d5": "The secret sauce."}, {"cd8f": "The best thing about teeny, tiny goals is that they’re so small — it’s easier to just do them than it is to skip them. Psychologically."}, {"9038": "An hour long goal? Not so much. You can skip an hour. No problem. So, the key is to keep the goals separate in your head. That way, if you skip your walk, or have a recluse day, you might not skip everything else."}, {"46fb": "Also, for everything on this list, ten minutes is a guilt-free minimum. Hit ten minutes and you can stop. You’re a rock star! You’ve hit your goal. Give yourself a gold star. (I mean it. Get a calendar and some star stickers. Do it up.)"}, {"058a": "But, I can almost guarantee that one day you’ll find yourself writing for an hour or you’ll take a nice long walk or fall into a great conversation with someone."}, {"8208": "I followed the Framework everyday for a month. Here’s what happened."}, {"3595": "I wrote nearly 19,000 words toward my new novel."}, {"4667": "Incidentally, I also wrote on Medium every day."}, {"5efc": "I clearly write more than ten minutes a day. What this little goal does for me is simple. It keeps me writing every single days. There was at least one day a week over the last month where I would have just skipped writing. But, because I had this goal, I didn’t. Which is good, because I know from long experience that skipping one day leads so easily into skipping two."}, {"267c": "I read eleven books."}, {"57ea": "I’m in an MFA program and I have to read a lot. Ten books a month. Plus, I read a poem, an essay, and a short story every day for the 1000 Day MFA program I run through Ninja Writers."}, {"995d": "So, the ten minutes a day? That represents the extra book. I read that one just for pure pleasure. In ten minutes a day. It was Blackbirds by Chuck Wendig."}, {"e4aa": "I had 300 ideas! A couple of them were even good."}, {"ef1b": "I came up with ideas for friends. Ideas for silly apps I’d love to have. Books I want to write. Fairy tale tropes. Ideas for a new newsletter. Ten people I want to meet and how I can do that."}, {"8bf1": "One of them was James Altucher, who writes a lot about the power of writing down ten ideas a day. I asked him if he minded if I included it as the I in WRITER. He didn’t. (This counts for T, too!)"}, {"560a": "I reached out to people and some of them reached back. That was huge fun."}, {"2c8f": "Besides James, I also had coffee with Jonas Ellison. And lunch with my friend Tracy. I talked to the lady who works at the fabric counter at Wal-mart about her grandchildren. I called my sister. I talked a couple of times to my friend Amy. I talked to my ex-husband’s sister, who is also called Amy. I spoke to the other soccer moms, instead of sitting by myself feeling awkward."}, {"1f55": "I lost seven pounds."}, {"8b19": "This is about 100 percent because exercising everyday made me more mindful of what I was eating."}, {"8641": "I started a new note keeping system and set up a writing accountability tool that I love."}, {"9f3b": "I can’t believe that I’ve never heard of a Commonplace Book before. This feels like a pivotal moment. Before and after my Commonplace Book."}, {"5198": "I wrote an ebook about this thing."}, {"40a8": "It’s the reward for patrons at the $3 level and above on the Ninja Writer Patreon account. It goes into much greater detail about each aspect of the WRITER framework and there are a couple of printables, too."}, {"e294": "You can get it here. The past $3 awards were The Writing Planner, The Plotting Workshop eBook, and an eBook called 31 Days of Ninja Writing. You’ll get all of those, too."}, {"32e2": "Here’s a sneak peak at the printables:"}, {"92f7": "Liked this piece? Give it a ❤ & join us on Facebook & our Patreon page!"}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "child": "288_1\t288_2\t288_3\t288_4\t288_5\t288_6288_1\t288_2\t288_3\t288_4\t288_5\t288_6"}