{"name": "289", "parent": "", "content": "Hey, Pepsi. Here Are 25 Free Ideas. Take Them. Please. There is no shortage of hot takes about Pepsi’s latest advertising failure. And now that the campaign has been officially killed, piling on just doesn’t make any sense. So, let’s try something different. I know I’m supposed to be outraged about the appropriation of serious things (and the insinuation that sugar water is the answer to police brutality), but I really just have questions about Kendall’s pants. I’d estimate that Pepsi spent somewhere in the $5–10million range in production on that spot (including talent fees for Ms. Jenner, civil rights activist). It’s also not hard to imagine that there was a $20million media buy associated with the campaign. That means Pepsi effectively flushed $30million down the toilet. What could Pepsi have done with $30million that would’ve been better for their brand? Lots of things! Here are 25 ways that Pepsi could’ve spent that money. 1 Do nothing. Seriously. Don’t make a commercial. Don’t buy any media. Leave the money in your giant corporate mattress. 2 Make a commercial about bubbly sugar water that fits your brand. You know, kind of like THIS ONE your competitor made. It might cost you $300,000. Buy $4million in media. Change the other $25.7million into a Scrooge MacDuck pool of coins. Swim laps. Invite other people over to do the same. Serve Pepsi. 3 You know how Pepsi is all about the next/new/millennial generation? Do something to show that the new generation is way more awesome than anyone thinks they are. Donate $30million to Meals on Wheels or other community-based senior programs. Then start an initiative to connect young people with these organizations. Generations are all connected. We’re all part of the same circle. This stuff writes itself. Also, you’ll be a hero for saving Meals on Wheels. You can even put Pepsi in all the meals. You’ve earned it. 4 Sometimes there are frozen burritos at the grocery store on sale for 99¢/ea. Buy 30 million burritos. Hand them out at after-school programs. This is a stupid idea, but still not at stupid as this: 5 This one come courtesy of the inimitable Dustin Davis: Buy a Snapchat filter. Or a whole bunch of them. For every person who uses your stupid filter, donate a dollar to the National Endowment for the Arts. Your brand is all about music/entertainment, right? Perfect. Support the next wave of artists and virtuosos. 6 Offer a $30million prize to anyone who steals the secret Coke recipe and can get it to you without being caught. 7 Spend $25million improving the flavor of Diet Pepsi. Then use the other $5million to tell everyone you’re sorry that it’s tasted like garbage since forever and that now it tastes more like Diet Coke. 8 Llamas. I don’t know. Just $30million of llama-assorted shenanigans. 9 Give $1million to 30 different small, independent creative agencies that would never pitch you this kind of nonsense. 10 Offer someone $30million to tell you the truth before you start production on a tv spot this fundamentally flawed. (Sidenote: The most amazing thing about any advertising dumpster fire is trying to figure out how there wasn’t a single person who threw their body in front of a concept like this. Or that the culture is so poisonous that no one felt they could speak up. Either way, it’s fascinating in the worst possible way.) 11 Tell the Kardashian Jenner Industrial Complex that they get $30million if they can stay out of the tabloids for six months. “This brief respite from the KJIC brought to you by Pepsi.” You’re heroes. 12 Buy the house from Ferris Bueller ($1million). Then buy the Ferrari ($15.1million). Reenact the famous scene, launching the car into the woods. Then buy the same car again (negotiate down to $13.9million, please) and do it again. Take some pictures and post them on Instagram. #pepsi #justwastingmoney #resist #womensmarch #kylie #kendall #blessed 13 Buy 2,307,692 copies of Shea Serrano’s upcoming Basketball And Other Things. #FOHArmy 14 Buy 66 pairs of season tickets for every NBA franchise. Give a pair to anyone who can drink two liters of Pepsi in less than a minute without burping, vomiting, and/or blowing cola out their nostrils. 15 Donate $25million to Planned Parenthood. Use the other $5million to give Pepsi to protesters who hate the fact that you’ve donated $25million to Planned Parenthood. Maybe throw in some Quaker granola bars or a few bottles of Gatorade. Everyone wins. 16 Write 30 checks for $1million/each. Maybe them payable to cash. Leave them in subway stations, train depots and bus stops. The checks are printed on Pepsi paper, whatever that is. 17 Have Cindy Crawford’s DNA cryogenically preserved so that we can make an island of Cindy Crawfords who mostly just want to drink Pepsi at rundown gas stations but also sometimes attack tourists, Chris Pratt, and Bryce Dallas Howard. 18Pay Beyoncé $30million dollars to name her twins Crystal and Pepsi. There’s no way she’ll do it because Beyoncé probably already has a naming/licensing deal with another international corporation (Exxon Carter-Knowles and Mobil Carter-Knowles?). So I guess you get to the keep the money and tell everyone that Beyoncé hates Crystal Pepsi. Everyone hates Crystal Pepsi, so this is a win-win. That’s not how a win-win works? I always hated math. 19 Give $65.22 to each one of the 460,000 NCAA athletes. Plus some Taco Bell gift cards. And lots of free Gatorade. 20 Send 150 people to Mars. With lots of Pepsi and some GoPros. #brandedcontent #elonmusk #mars #jointheconversation 21 Let’s go ahead and spend $30million on Season 2 of Big Little Lies. I haven’t even watched Season 1 yet, but my friend Jacob Hinmon says it’s pretty much the best. I really like Laura Dern and Reese Witherspoon, so why not? The internet is a pretty chill place with very few opinions about television shows and product placement, so I don’t think anyone will notice (or care) if the characters drink Pepsi Max instead of $5,000 bottles of Chardonnay while they stare at the ocean. 22Since we’re already talking Prestige TV™, here’s another solid use of $30million—True Detective Season 3! A young, comely civil rights activist (Kendall Jenner) thwarts injustice around the country. Actually, this sounds like a Highway to Heaven reboot. Whatever. The Yellow King reappears as a Coke delivery driver, Colin Farrell enjoys low-calorie cola options, Woody Harrelson prefers Wild Cherry Pepsi, and Vince Vaughn um, does stuff. 23 Go to the bank and ask for 30 million one-dollar bills. Write “PEPSI IS LIT, FAM!” on each one. Drop them from an airplane over the Bermuda Triangle. 24 Build a giant Pepsi can, bigger than the Empire State building. Fill it with Pepsi. Drop some Mentos into the giant Pepsi can. Put the video on YouTube or something. Hold on… Does that work with Pepsi? Doesn’t mixing Mentos with Pepsi cause instant death? Good luck out there! 25 Redesign the Pepsi logo 30 times. Matt Anderson is the CEO/ECD at Struck. He’s also a husband, a father, a San Francisco Giants fan, a vinyl collector and a book reader. You can find him on Twitter, LinkedIn and Instagram. Looking for more insights, facebooking, twittering, ramblings, musings and other thoughts? Follow our Greater Than collection. ", "title": "Hey, Pepsi. Here Are 25 Free Ideas. Take Them. Please.", "sentences": [{"5ce9": "Hey, Pepsi. Here Are 25 Free Ideas. Take Them. Please."}, {"c71d": "There is no shortage of hot takes about Pepsi’s latest advertising failure. And now that the campaign has been officially killed, piling on just doesn’t make any sense. So, let’s try something different."}, {"5c6a": "I know I’m supposed to be outraged about the appropriation of serious things (and the insinuation that sugar water is the answer to police brutality), but I really just have questions about Kendall’s pants."}, {"bb86": "I’d estimate that Pepsi spent somewhere in the $5–10million range in production on that spot (including talent fees for Ms. Jenner, civil rights activist). It’s also not hard to imagine that there was a $20million media buy associated with the campaign. That means Pepsi effectively flushed $30million down the toilet. What could Pepsi have done with $30million that would’ve been better for their brand? Lots of things! Here are 25 ways that Pepsi could’ve spent that money."}, {"7bc1": "1 Do nothing. Seriously. Don’t make a commercial. Don’t buy any media. Leave the money in your giant corporate mattress."}, {"c68c": "2 Make a commercial about bubbly sugar water that fits your brand. You know, kind of like THIS ONE your competitor made. It might cost you $300,000. Buy $4million in media. Change the other $25.7million into a Scrooge MacDuck pool of coins. Swim laps. Invite other people over to do the same. Serve Pepsi."}, {"4db7": "3 You know how Pepsi is all about the next/new/millennial generation? Do something to show that the new generation is way more awesome than anyone thinks they are. Donate $30million to Meals on Wheels or other community-based senior programs. Then start an initiative to connect young people with these organizations. Generations are all connected. We’re all part of the same circle. This stuff writes itself. Also, you’ll be a hero for saving Meals on Wheels. You can even put Pepsi in all the meals. You’ve earned it."}, {"25e2": "4 Sometimes there are frozen burritos at the grocery store on sale for 99¢/ea. Buy 30 million burritos. Hand them out at after-school programs. This is a stupid idea, but still not at stupid as this:"}, {"514c": "5 This one come courtesy of the inimitable Dustin Davis: Buy a Snapchat filter. Or a whole bunch of them. For every person who uses your stupid filter, donate a dollar to the National Endowment for the Arts. Your brand is all about music/entertainment, right? Perfect. Support the next wave of artists and virtuosos."}, {"c84d": "6 Offer a $30million prize to anyone who steals the secret Coke recipe and can get it to you without being caught."}, {"8d60": "7 Spend $25million improving the flavor of Diet Pepsi. Then use the other $5million to tell everyone you’re sorry that it’s tasted like garbage since forever and that now it tastes more like Diet Coke."}, {"3982": "8 Llamas. I don’t know. Just $30million of llama-assorted shenanigans."}, {"8f5e": "9 Give $1million to 30 different small, independent creative agencies that would never pitch you this kind of nonsense."}, {"ef7a": "10 Offer someone $30million to tell you the truth before you start production on a tv spot this fundamentally flawed. (Sidenote: The most amazing thing about any advertising dumpster fire is trying to figure out how there wasn’t a single person who threw their body in front of a concept like this. Or that the culture is so poisonous that no one felt they could speak up. Either way, it’s fascinating in the worst possible way.)"}, {"bf8d": "11 Tell the Kardashian Jenner Industrial Complex that they get $30million if they can stay out of the tabloids for six months. “This brief respite from the KJIC brought to you by Pepsi.” You’re heroes."}, {"7fc4": "12 Buy the house from Ferris Bueller ($1million). Then buy the Ferrari ($15.1million). Reenact the famous scene, launching the car into the woods. Then buy the same car again (negotiate down to $13.9million, please) and do it again. Take some pictures and post them on Instagram. #pepsi #justwastingmoney #resist #womensmarch #kylie #kendall #blessed"}, {"2997": "13 Buy 2,307,692 copies of Shea Serrano’s upcoming Basketball And Other Things. #FOHArmy"}, {"547f": "14 Buy 66 pairs of season tickets for every NBA franchise. Give a pair to anyone who can drink two liters of Pepsi in less than a minute without burping, vomiting, and/or blowing cola out their nostrils."}, {"67c9": "15 Donate $25million to Planned Parenthood. Use the other $5million to give Pepsi to protesters who hate the fact that you’ve donated $25million to Planned Parenthood. Maybe throw in some Quaker granola bars or a few bottles of Gatorade. Everyone wins."}, {"7f0a": "16 Write 30 checks for $1million/each. Maybe them payable to cash. Leave them in subway stations, train depots and bus stops. The checks are printed on Pepsi paper, whatever that is."}, {"e30d": "17 Have Cindy Crawford’s DNA cryogenically preserved so that we can make an island of Cindy Crawfords who mostly just want to drink Pepsi at rundown gas stations but also sometimes attack tourists, Chris Pratt, and Bryce Dallas Howard."}, {"4a92": "18Pay Beyoncé $30million dollars to name her twins Crystal and Pepsi. There’s no way she’ll do it because Beyoncé probably already has a naming/licensing deal with another international corporation (Exxon Carter-Knowles and Mobil Carter-Knowles?). So I guess you get to the keep the money and tell everyone that Beyoncé hates Crystal Pepsi. Everyone hates Crystal Pepsi, so this is a win-win. That’s not how a win-win works? I always hated math."}, {"36f7": "19 Give $65.22 to each one of the 460,000 NCAA athletes. Plus some Taco Bell gift cards. And lots of free Gatorade."}, {"c836": "20 Send 150 people to Mars. With lots of Pepsi and some GoPros. #brandedcontent #elonmusk #mars #jointheconversation"}, {"9459": "21 Let’s go ahead and spend $30million on Season 2 of Big Little Lies. I haven’t even watched Season 1 yet, but my friend Jacob Hinmon says it’s pretty much the best. I really like Laura Dern and Reese Witherspoon, so why not? The internet is a pretty chill place with very few opinions about television shows and product placement, so I don’t think anyone will notice (or care) if the characters drink Pepsi Max instead of $5,000 bottles of Chardonnay while they stare at the ocean."}, {"c6ae": "22Since we’re already talking Prestige TV™, here’s another solid use of $30million—True Detective Season 3! A young, comely civil rights activist (Kendall Jenner) thwarts injustice around the country. Actually, this sounds like a Highway to Heaven reboot. Whatever. The Yellow King reappears as a Coke delivery driver, Colin Farrell enjoys low-calorie cola options, Woody Harrelson prefers Wild Cherry Pepsi, and Vince Vaughn um, does stuff."}, {"1b09": "23 Go to the bank and ask for 30 million one-dollar bills. Write “PEPSI IS LIT, FAM!” on each one. Drop them from an airplane over the Bermuda Triangle."}, {"3f2a": "24 Build a giant Pepsi can, bigger than the Empire State building. Fill it with Pepsi. Drop some Mentos into the giant Pepsi can. Put the video on YouTube or something. Hold on… Does that work with Pepsi? Doesn’t mixing Mentos with Pepsi cause instant death? Good luck out there!"}, {"75dd": "25 Redesign the Pepsi logo 30 times."}, {"ccc4": "Matt Anderson is the CEO/ECD at Struck. He’s also a husband, a father, a San Francisco Giants fan, a vinyl collector and a book reader."}, {"a46b": "You can find him on Twitter, LinkedIn and Instagram."}, {"e14e": "Looking for more insights, facebooking, twittering, ramblings, musings and other thoughts? Follow our Greater Than collection."}], "child": "289_1\t289_2\t289_3\t289_4\t289_5\t289_6\t289_7\t289_8\t289_9\t289_10\t289_11\t289_12289_1\t289_2\t289_3\t289_4\t289_5\t289_6\t289_7\t289_8\t289_9\t289_10\t289_11\t289_12289_1\t289_2\t289_3\t289_4\t289_5\t289_6\t289_7\t289_8\t289_9\t289_10\t289_11\t289_12"}