{"name": "29", "parent": "", "content": "The Ringer’s Unreal NBA Ballot Bill Simmons and friends look back on the best Woj scoop, the best in-game dunker, the most improbable turnaround, sweet Jokic passing, the glories of Waiters Island, and much more If you were expecting to read my choices for Most Valuable Player, All-NBA and every other major NBA award on the official ballot, you’ll have to wait until next week. What about the unreal ballot? What about the real heroes of the NBA regular season — guys like Chandler Parsons, Alan Anderson, Dion Waiters, Joel Embiid and Jusuf Nurkic, the ones who kept us engaged every time the A-listers weren’t playing? What about the overachievers, underachievers and head-scratchers? What about the unintentional-comedy and irrational-confidence MVPs? My Ringer teammates Chris Ryan, Shea Serrano and Jason Concepcion and I honored these greats by slapping together the Ringer Independent Spirit Awards for the 2016–17 NBA season. 1. The Lou Brown Award for Overachieving Team That Surprised You Most Bill Simmons: Shouldn’t we be a little more collectively stupefied by the 2017 Bucks? The Freak becoming a top-12 player? No Khris Middleton, then no Jabari Parker … and they’re fine? Matthew Dellavedova, Tony Snell and Greg Monroe as valuable role players? Thon Maker looking increasingly … competent? The Rookie of the Year (maybe) … Malcolm Brogdon???? Jason Kidd pulling the strings without a tie? Jeff Schwartz pulling the GM strings without the actual GM title? 43–44 wins and a 5-seed? What? How? Why? Jason Concepcion: In December, Miami Heat bossman Pat Riley went on local sports radio and, using a flurry of euphemisms that sounded like a mob boss discussing a hit over an open phone line, admitted that his plan was to tank. “I think the number-one asset that we have right now is our flexibility moving forward.” Ashing his cigar. “We have a first-round pick this year.” Smoothing the front of his track suit. “So we’re dealing with it.” You understand what I’m telling ya? “We’re dealing with that word that you hate to use” — Tell us, Don Patricio — “that we have to rebuild. But we will rebuild quick.” Yeah, sure, sure. Suffice to say, everyone, including the iconic Mr. Riley, has been surprised by the Heat. They are the surprise of the season. Miami is contending for the playoffs (!!!). There are a variety of factors behind this: Glengarry Dion Waiters subprime island real estate maturing into a legitimate beachfront resort property; Goran Dragic recapturing his late-period Phoenix Suns form; Hassan Whiteside, whose entire NBA career is a series of improbable events, continuing to do Hassan Whiteside things; a slimmed-down 30-year-old James Johnson putting up career numbers; Tyler Johnson in general. Don’t act like you aren’t surprised too. 2. The We Believe Warriors Award for Most Improbable Turnaround Bill: Instead of giving this to the Heat (too easy), I’m giving it to Svelte James Johnson, who magically transformed his body from 275 pounds and 14.5 percent body fat to 238 pounds and 6.75 percent body fat AS THE SEASON WAS GOING ON. You see it happen every Survivor season, but during an NBA season with a multimillionaire who already got paid? James Johnson is definitely hiding an immunity idol in his pants. Shea Serrano: Imagine all the worst things you can think of. Picture them. Close your eyes and really see them. Got it? OK, good. Now put them all on a list. And now take that list, and at the top of it write: “These Are All Things That Were Better Than Watching The Houston Rockets Play During The 2015–16 Season.” No team was less enjoyable to be around, to watch, or to experience than the Rockets. Do you remember the magic that the Warriors had as they rolled toward 73 wins? OK, the Rockets were like the counterpoint to that. The players openly hated each other (James Harden vs. Dwight Howard was the most passive-aggressive Greek tragedy I’ve ever seen), the coach openly hated the team, the fans openly hated everything. The Rockets went from making the Western Conference finals for the first time in two decades the season before, to, I mean, they were basically just like if you poured a big bucket of acid down a slide at a playground. That’s what they were like. This season, though? A complete and total turnaround. Harden is all of a sudden one of the four best basketball players on the planet again. New coach Mike D’Antoni has them scoring 215 points a game. Literally every single meaningful statistic by which you would measure how good or bad a basketball team is has improved over last season. I wonder what the difference is. I wonder what the missing 6-foot-11, 265-pound difference is. 3. The Unicorn of the Year Bill: With apologies to the Freak (don’t worry, I’m voting for him for second-team All-NBA), the Joker (a legit threat to recreate the ’77 Blazers) and the Zinger (who spent the season in Melo-Rose purgatory), I’m voting for Joel Embiid, a 7-foot-2 behemoth with 3-point range who averaged 20 and eight in 25 minutes a game, sent Sixers fans into a Process tizzy, never even cracked the 800-minute mark, then disappeared. Did we imagine it? Did Joel Embiid even exist? That’s a true unicorn — when you don’t even know if it happened. Jason: The usage of “unicorn” as it pertains to the NBA is interesting. It’s come to mean: 7-footer (or thereabouts) with guard-type skills. Mythical, magical cryptozoological creatures are supposed to be rare. And they are … sort of. Current unicorns include Karl-Anthony Towns (a bona fide inside-outside savage), Anthony Davis (makes 50–20 games look effortless), Giannis Antetokounmpo (god help this plane of reality if he ever gets his jumper working), my son Kristaps (has taken a worrying step back that I blame fully on the Knicks’ institutional ineptitude), and, the UotY, Nikola “Joker” Jokic. Here are the top-five PER seasons by players 21 years old or younger: 2014–15 Anthony Davis: 30.8 1993–94 Shaquille O’Neal: 28.5 2005–06 LeBron James: 28.1 2013–14 Anthony Davis: 26.5 2016–17 Nikola Jokic: 26.2 (tied with 2009–10 Kevin Durant) NIKOLA JOKIC IS MAKING HISTORY! 4. The White Chocolate Award for Most Creative Passer Bill: Was there a bigger League Pass revelation than Jokic’s nightly Sabonis/Walton routine? He will single-handedly make Gary Harris an extra $50 million this summer. My dream NBA lottery order: Boston lands the first pick, Denver jumps into the second pick, the Lakers fall out of the top three (and lose their pick to Philly) … and we get 12 to 15 years of Jokic and Lonzo joining forces to create the greatest passing team since God decided that Bill Walton could stay healthy for one season to play with Larry Legend. Sign me up. Jason: Nikola Jokic’s passes are like underwear at the Playboy Mansion: filthy, varied, and silky. Two or three times a game, Jokic throws the pass that I consider to be his signature dime: a loping, feather-light changeup that crests a defender’s fingertips and drops into a cutting teammate’s hands as if it were placed there by the stork. His flashiest assist is a Larry Bird–esque two-handed over-the-head blindside flick that’s as on the money as a dead president. His most utilitarian assist is a faked-jumper push pass that short-circuits a defender’s central nervous system. Nikola Jokic: Best passing big man in the league; most entertaining passer in the league. 5. The Dwight Howard Award for Best Statistical Season From a Guy It Seems Miserable to Play With Bill: Hey, everybody, it’s Dwight Howard again! You’re not gonna believe it, but he put up solid stats on a team that played OK for a while, then tailed off late thanks to chemistry problems, trade rumors and general apathy. As I said on my NBA awards podcast this week, Dwight Howard is the guy who spends six hours coughing on your cross-country flight. When you get sick within the next 48 hours, you don’t know for sure that he did it, but you blame him anyway. That’s every Dwight Howard season. Rob Hennigan’s last two Magic acts should be trading for Chandler Parsons and bringing Dwight Howard home. Chris Ryan: Chris Paul. His numbers have tailed off a bit from his 2011–12 Clippers high, but he’s still in the top 10 in PER, averaging about 18 points and nine assists per game, and is quite clearly the best point guard of his generation and still one of the best two or three in the game. That being said, he kind of reminds me of Manchester United manager José Mourinho. He’s so smart, and understands his sport so well, that every foul call is an affront to good taste, and every defensive lapse is a blindingly obvious screw-up, and he takes it out on those around him. CP3 has made Blake and DeAndre into household names, but I wouldn’t be surprised if those guys wanted to switch households. 6. Best Woj Bomb Jason: Where were you when the Kings flipped the irascible, inconsistent, and devastatingly talented DeMarcus Cousins to the Pelicans for the impressively shitty return of Buddy Hield, Tyreke Evans, Langston Galloway and a first- and second-round pick? I know where Boogie was: IN NEW ORLEANS, FOR THE ALL-STAR GAME. It’s almost like Vivek and Vlade didn’t want to risk seeing Boogie in person ever again. In trading Boogie, the Kings brain trust, such as it is, effectively reversed Psalm 118:22, made famous by Bob Marley, among many others: “The stone that the builder refused / Will always be the head cornerstone.” Vlade Divac proclaimed loudly and often that Cousins was untouchable, a cornerstone. The last statement came only two weeks before the trade. From the Pelicans’ perspective, it’s a fascinating time-travel experiment at a bargain-basement price. The league’s best teams have long since committed to lineups featuring lone bigs anchoring four similarly sized players. New Orleans zigged hard, pairing the two best big men in the NBA in the seldom-seen twin towers format. If it doesn’t work out, and early returns have ranged from scary-bad to inconsistent, the Pels can always let Boogie strut out of town. 7. The Carroll Dawson Award for Most Unabashed Tank Job Bill: Kudos to the Suns for dropping 15 of their last 16 while enjoying a feel-good moment (Devin Booker’s 70-pointer) and developing Tyler Ulis as their own version of The One That Got Away (Isaiah Thomas). Seriously, kudos. When you can tank AND build hope, that’s the Tankapalooza 2017 dream personified. But nothing tops the Lakers for paying Luol Deng and Timofey Mozgov $34 million this year combined to go away, then trotting out Metta World Peace for 17 minutes of an actual NBA game to blow this week’s unexpected lead over the Spurs (and it didn’t work — they won!). Shea: There was a moment — this was back in early in December or late November — when the Lakers looked like a not-terrible team. The Lakers Love BasketballHow Luke Walton made playing in purple and gold fun againtheringer.com I remember it because they got out to a super-surprising 10–10 start, and if that doesn’t sound impressive, I’ll remind you that in the prior season, they didn’t win their 10th game of the season until February. Anyway, the Lakers looked decent, and it was all great and good and fun. And then all of the wheels fell off, and the engine fell out, and the doors caught fire, and then the back seats caught fire, too, and then Coach Luke just went ahead and decided to go on and drive their bus into the Pacific Ocean. It’s fine, sure. I get it. Everyone does. The whole purpose of this season has been to get to the next season. The only thing I’m sad about is that they actually are not in last place (they’re in second to last place), and I need for them to be in last place so that Jonathan Tjarks can write a column about their rebuild during the offseason and call it “The Last and the Furious.” 8. The Allan Houston Award for Dumbest Contract Bill: After the 2016 Summer Spending Spree, you knew this category would be loaded — but did you ever think the inexplicable Mozgov-Deng contracts and Joakim Noah’s $73 million fiasco could take such a decided backseat to a much, much, much, much dumber contract? Grit ’n’ Grind … and $94 million of Chandler Parsons? An 82-game schedule … and Chandler Parsons’s ravaged knees? The city of Memphis … and Chandler Parsons’s Instagram account? When Mark Cuban says, “That contract is too risky,” that’s the basketball equivalent of Kris Jenner saying, “We probably shouldn’t do that; it’s in bad taste.” In other words, there’s no bigger red flag. And Memphis plowed ahead anyway. The least they could do is make Parsons their overpaid color analyst or something. Jason: Joakim Noah played just 29 games in 2015–16, due to a panoply of shoulder injuries and the accrued effects of his never-say-die playing style amplified by Tom Thibodeau’s sadistic tendency to crush his dudes under heaping piles of minutes. Jo also shot just 38 percent, a chilling number for a big, and turned a wizened 31 years old. But Phil Jackson’s triangle-shaped heart wants what it wants, and he signed Noah to a four-year, $73 million contract. That’s just what the Knicks do. Of course, the move has turned out to be an even deeper and darker money pit than it initially appeared. Noah was recently suspended for 20 games after testing positive for a banned substance, LGD-4033. Anytime you get the chance to take a suspect, over-the-counter dietary supplement with an active ingredient that sounds like what the Weyland-Yutani Corporation would name a planet, you simply must do it. Whatever. Shoot your shot. 9. The LaBradford Smith Award for Saddest NBA Feud Bill: Shaq bullying JaVale McGee for reasons that remain unclear gets the nod, but don’t sleep on Draymond Green’s biting on-court trash talk at Paul Pierce during a Clips-Warriors game. You can’t get no farewell tour, they don’t love you like that. You thought you were Kobe? STOP THE FIGHT!!!!! By the way, Draymond’s after-the-incident explanation — “If you gonna talk junk, I don’t hold anything back when I’m talking junk. If I’ma talk, I’ma talk. And I’ma take it where it needs to go” — would be a great high school yearbook quote for any of you young’uns out there. 10. The Coach Bud Award for the Hiring That Inspired the Most “Great Hire” Tweets Bill: Ha: kenny atkinson great hire - Twitter SearchThe latest Tweets on kenny atkinson great hire. Read what people are saying and join the conversation.twitter.com Jason: The Wolves handing the horses, reins, and ranch to Tom Thibodeau. It was such a no-brainer that its greatness was obvious to plant life. He had coached the Bulls to four straight top-10 defensive seasons. If you take into account his days as an assistant, Thibs has been involved with 16 top-10 defenses dating back to 1996–97. The Wolves, meanwhile, had young wolf Karl-Anthony Towns, Canadian Kobe Andrew Wiggins, and a bunch of talented young players who don’t really know how to play. Thibs has turned the likes of Nate Robinson and D.J. Augustin into LEGIT IMPACT PLAYERS WHO DID BIG THINGS IN ACTUAL PLAYOFF GAMES. Towns, Wiggins, Ricky Rubio and Kris Dunn have arguably as much raw talent as any four players he’s ever coached. Several sober, professional and serious NBA analysts looked at this marriage and predicted 50 wins. Thibs’s baby Timberwolves put up one of the worst defensive ratings in the league this season. Thibs has been his roaring, bellicose self, to little obvious effect. But these Timberpups have been receptive, even eager, for the challenge. KAT’s general bad-assness, Rubio’s recent streak of confident play, among other glimmers of light, keep the original premise — GREAT HIRE — much in force. 11. The Ann Iverson Award for Best/Most Polarizing NBA Family Member (Getty Images) Bill: Can we give it to LaVar Ball one year early? Did you ever think an NBA dad would be battling Stephen A. on First Take? Starting next season, LaVar Ball is locking up this award like The Daily Show locked up that decade of Outstanding Variety Show Emmys. Might as well give him one early. Honorable mention: Dennis Schröder’s mom, Austin Rivers, LeBron James Jr., Wanda Durant, Dwyane Wade’s ex-wife. Shea: Without Googling, I honestly do not know one single thing about DeMarcus Cousins’s brother, Jaleel. I don’t know if he’s an older brother or a younger brother. I don’t know if he’s a blood brother or an adopted brother. I don’t know if he’s an only brother or if there is a gaggle of Cousins boys running around. I don’t know any of that. The only thing that I do know is that when Andy Furillo, a reporter from the Sacramento Bee, mentioned Jaleel in an column, DeMarcus got very upset and confronted him, cussing at him and yelling at him and pointing his finger at him. That, to me, seems like enough for him to win this award. 12. The Shane Battier Award for Sloan Conference/Stat Nerd Darling Du Jour Bill: With apologies to Robert Covington’s deflections, let’s acknowledge the Crown Prince of the Moreyball Era, James Harden, for his third straight season of 200-plus made 3s and 700-plus made free throws. With four games to play, he’s sitting at 244 made 3s and 713 made free throws, giving him an outside chance of creating the 250/750 club. But he’s also sitting at 861 assists, opening the door for the 250/750/900 WHAT THE FUCK IS GOING ON Club. Jimmy Harden, everybody! 13. The Joel Embiid Award for Best Social Media Persona Bill: Embiid didn’t play enough games to win his own award, giving Chandler Parsons’s Instagram account the nudge it needed. Hitting on Instagram models? Feuding with Joel Embiid? Dolphins? La familia? Chancun? Putting Chandler Parsons in Memphis was like putting Vincent Chase in Memphis — only if Vincent Chase was killing the Grizzlies’ salary cap by more than 20 percent every season. The good news: Parsons still has enough in the tank to make Rob Hennigan’s infamous whiteboard of hybrids! Sadly, Parsons took so much shit in Memphis for the Cancun Instagrams that he stopped posting. Or, Zach Randolph threatened to kill him. It’s unclear. But we’ll always have Chancun. 14. The Vin Baker Award for Riskiest Idea That Became an Unsurprising Failure Bill: (Search this piece for “Chancun.”) Chris: So wait, the crippled core of a Chicago Bulls team that had been mortared, pestled, Vitamixed, and pulverized into a fine powder by Tom Thibodeau’s DNP strategy didn’t work out in New York? You’re telling me Joakim Noah and Derrick Rose weren’t able to Nicolas Cage the national treasure that is the triangle offense? And that’s why Jeff Hornacek is the NBA coaching equivalent of the This Is Fine meme? Weird! 15. The Damon Jones Award for Best Bench Chemist Bill: Alan Anderson’s handshake routine on the (occasionally dysfunctional) Clippers bench has to be seen in person to be believed; it’s like the Clips offered him a bonus for every game with at least 250 handshakes/hand slaps/fist bumps. Anderson doesn’t listen to Doc Rivers in the timeout huddles; he’s too busy grabbing prime real estate between the Clips bench and the scorer’s table so he can dap everyone heading back on the court. If anyone tries to go around him, he chases them down from behind like J.J. Watt. YOU WILL SLAP MY HAND IN MULTIPLE STEPS! We need SportVU to keep track of hand taps; I think Anderson had the bench chemist version of Westbrook’s triple-double season. Even Chris Paul seems to enjoy him, and Chris Paul hates everything and everyone. Alan Anderson is my favorite chemist since Walter White. Shea: Quincy Acy should win this award for every season that he’s in the league, because nobody celebrates a good thing that’s happened on the court from the bench like he does. He was on the Kings last year, and there was a play where DeMarcus Cousins dunked on Robin Lopez, and Quincy for real just jumped up off the bench with his hands in the air and ran down the sideline off camera. When DeMarcus dunked on Mason Plumlee two weeks later, Acy did the exact same celebration, and it was twice as funny the second time. The best one, though, was when Rajon Rondo dunked during a game and Acy, a darling, stood up and then fell backward pretending to faint from excitement. It was great, and probably the best dunk reaction of the last five years. Here’s the thing of it, though, and I’m telling you this because I’m going to cheat a little: Quincy played for the Nets this season, and nothing good has happened to the Nets in at least 10 years, so there just hasn’t been much for him to celebrate. Still, though, I think he gets here just off of pedigree. 16. The Jail Blazers Award for Best Ongoing Train Wreck Bill: With apologies to Vlade & Vivek (the next great NBC comedy), Philly’s medical staff (seriously, would you let them treat your sprained ankle?), the Brooklyn Nyets (no hope for the present or the future, but at least their owner has a good in with one of the co-presidents of the United States), and Phil/Melo/Dolan/Rose (I like Knicks fans, so that one just makes me sad), how can the Buss family NOT win this? You have, by all accounts, the greatest NBA owner of the last 35 years … and somehow he spawned the most dysfunctional group of heirs that’s ever owned an NBA team? The Buss siblings make the Maloofs look like the Emanuel brothers. Jeanie Buss seems like the most competent of the bunch; would you trust her to run a lemonade stand at this point? Since when did a bunch of related-by-blood NBA owners just start suing each other during a season? This was Game of Thrones after five drinks and a head injury. 17. The Hardwood Classics Award for Best Regular-Season Game Bill: With apologies to Christmas Day (Cavs 109, Warriors 108), Rockets-Warriors (132–127 OT), Cavs-Wizards (LeBron’s big 3) and both OKC-Boston games, I’m picking the night that Zach Lowe and I finally fixed the septic tank on Waiters Island, reconnected the electricity and opened the island’s airport back up for visitors: Miami’s big win over Oakland! Waiters Island dropped 33 (including the game winner) that jump-started Miami’s eventual 13-game winning streak (and the Spoelstrassaince). There might have been better Irrational Confidence Guys, just not lately. Come to Waiters Island, use your Amex points. Chris: This is recency bias at work, but Pacers-Cavs! Two overtimes, LeBron getting tested on every possession by Paul George (who also had the stones to guard Bron for most of the game), an intra-Cavs squabble live on TV … … and the return of Lance Stephenson, the Great American LeBron Troll! What more do you want from a sporting event?! 18. The Skip Bayless Trophy for Best Straw Man Media Argument Bill: I loved when advanced metrics showed Kawhi Leonard’s defensive impact slipping a little, followed by some wondering if his defensive impact might be just a smidge overrated, then someone else doing research and realizing that Kawhi’s opponents just randomly shot better than expected when he was out there, so actually, Kawhi Leonard WAS still great at defense. Or something. So … I don’t have to feel bad about believing that Kawhi is one of the best two perimeter defenders I’ve ever seen in my life because his slightly-lower-than-usual defensive RPMs might be a little goofy this year? Thanks! Chris: I am Russell Westbrook’s Kellyanne Conway, but even so, this is my reaction to people who say Russ stat-pads his rebounding numbers because nobody boxes him out: 19. The Vinnie Johnson Award for Best Heat Check Guy Bill: I know Devin Booker dropped 70, and I know some other dudes (Klay, Dame, Isaiah, Waiters Island, etc.) can sprout those NBA Jam flames, but still, there’s nothing more fun than when Steph gets hot. Sorry. Chris: Damian Lillard took a bit of a hit this year, enough that there was a semi-serious debate about whether the Blazers were better with C.J. McCollum at the controls. But Clutch Lillard is still one of the best reasons to watch the game. 20. The Virginia Beach Kings Award for Most Contrived Story on a Slow News Day Bill: Kyrie Irving thinks the earth is flat? Can Becky Hammon be an NBA head coach? (Someone) is mad at (Charles Barkley or Shaquille O’Neal)? Should NBA players rest during national TV games? Apologies to all of them: I vote for any story that glorifies triple-doubles like they’re anything other than an arbitrary stat that we started to acknowledge 30–35 years ago because we were bored, then Ice Cube made it sound cool and now we’re here. Chris: Kyrie Copernicus! This isn’t even a conversation! 21. The Charles Oakley Award for the Teammate You’d Want Getting Your Back in a Dark Alley Bill: I would walk into any alley with Jusuf Nurkic. He’s our best bet to pull a Willis Reed during an NBA game and punch out three opponents in 10 seconds. 22. The Nique Award for Best In-Game Dunker Bill: You wouldn’t put him in the Nique/Young MJ/Young Vince/Early Blake stratosphere, but Westbrook’s occasional “Grab the Rebound, Turn on the Jets, Slice Through Three Guys and Dunk on the Biggest One, Then Scowl at Everybody” routine doubled as the most reliably exciting dunk-related League Pass moment. Honorable mention: Greek Freak on the break, Larry Nance Jr. in traffic, Jaylen Brown or Marquese Chriss in garbage time, the three times a year when Chris Paul dunks. Shea: A good Dominique Wilkins dunk had four parts. First, it was obviously a forceful, energetic, kinetic thing. Second, it had a great big spoonful of anger. Third, it was remarkably athletic. And fourth — and this is maybe the most important part — it had an echo. It lived on and rang out farther than Atlanta (or wherever the Hawks happened to playing the night when he dunked the flesh off someone’s skeleton). These are just a few of the headlines that were on the internet the day after James Johnson, our basketball lord and flavor, mega-dunked on Marcus Morris during a game last month: Earning this award is difficult, given that Wilkins was one of the three greatest in-game dunkers of all time. And so we have to be careful with who we hand it out to, but I feel confident in awarding James Johnson, who has been circling this award since he took Andre Drummond’s head off in 2014. ", "title": "The Ringer’s Unreal NBA Ballot", "sentences": [{"da73": "The Ringer’s Unreal NBA Ballot"}, {"54e9": "Bill Simmons and friends look back on the best Woj scoop, the best in-game dunker, the most improbable turnaround, sweet Jokic passing, the glories of Waiters Island, and much more"}, {"9509": "If you were expecting to read my choices for Most Valuable Player, All-NBA and every other major NBA award on the official ballot, you’ll have to wait until next week. What about the unreal ballot? What about the real heroes of the NBA regular season — guys like Chandler Parsons, Alan Anderson, Dion Waiters, Joel Embiid and Jusuf Nurkic, the ones who kept us engaged every time the A-listers weren’t playing? What about the overachievers, underachievers and head-scratchers? What about the unintentional-comedy and irrational-confidence MVPs? My Ringer teammates Chris Ryan, Shea Serrano and Jason Concepcion and I honored these greats by slapping together the Ringer Independent Spirit Awards for the 2016–17 NBA season."}, {"7951": "1. The Lou Brown Award for Overachieving Team That Surprised You Most"}, {"dcc8": "Bill Simmons: Shouldn’t we be a little more collectively stupefied by the 2017 Bucks? The Freak becoming a top-12 player? No Khris Middleton, then no Jabari Parker … and they’re fine? Matthew Dellavedova, Tony Snell and Greg Monroe as valuable role players? Thon Maker looking increasingly … competent? The Rookie of the Year (maybe) … Malcolm Brogdon???? Jason Kidd pulling the strings without a tie? Jeff Schwartz pulling the GM strings without the actual GM title? 43–44 wins and a 5-seed? What? How? Why?"}, {"455a": "Jason Concepcion: In December, Miami Heat bossman Pat Riley went on local sports radio and, using a flurry of euphemisms that sounded like a mob boss discussing a hit over an open phone line, admitted that his plan was to tank. “I think the number-one asset that we have right now is our flexibility moving forward.” Ashing his cigar. “We have a first-round pick this year.” Smoothing the front of his track suit. “So we’re dealing with it.” You understand what I’m telling ya? “We’re dealing with that word that you hate to use” — Tell us, Don Patricio — “that we have to rebuild. But we will rebuild quick.” Yeah, sure, sure."}, {"038c": "Suffice to say, everyone, including the iconic Mr. Riley, has been surprised by the Heat. They are the surprise of the season. Miami is contending for the playoffs (!!!). There are a variety of factors behind this: Glengarry Dion Waiters subprime island real estate maturing into a legitimate beachfront resort property; Goran Dragic recapturing his late-period Phoenix Suns form; Hassan Whiteside, whose entire NBA career is a series of improbable events, continuing to do Hassan Whiteside things; a slimmed-down 30-year-old James Johnson putting up career numbers; Tyler Johnson in general."}, {"573b": "Don’t act like you aren’t surprised too."}, {"4e46": "2. The We Believe Warriors Award for Most Improbable Turnaround"}, {"c3fd": "Bill: Instead of giving this to the Heat (too easy), I’m giving it to Svelte James Johnson, who magically transformed his body from 275 pounds and 14.5 percent body fat to 238 pounds and 6.75 percent body fat AS THE SEASON WAS GOING ON. You see it happen every Survivor season, but during an NBA season with a multimillionaire who already got paid? James Johnson is definitely hiding an immunity idol in his pants."}, {"c860": "Shea Serrano: Imagine all the worst things you can think of. Picture them. Close your eyes and really see them. Got it? OK, good. Now put them all on a list. And now take that list, and at the top of it write: “These Are All Things That Were Better Than Watching The Houston Rockets Play During The 2015–16 Season.”"}, {"884d": "No team was less enjoyable to be around, to watch, or to experience than the Rockets. Do you remember the magic that the Warriors had as they rolled toward 73 wins? OK, the Rockets were like the counterpoint to that. The players openly hated each other (James Harden vs. Dwight Howard was the most passive-aggressive Greek tragedy I’ve ever seen), the coach openly hated the team, the fans openly hated everything. The Rockets went from making the Western Conference finals for the first time in two decades the season before, to, I mean, they were basically just like if you poured a big bucket of acid down a slide at a playground. That’s what they were like."}, {"5da2": "This season, though? A complete and total turnaround. Harden is all of a sudden one of the four best basketball players on the planet again. New coach Mike D’Antoni has them scoring 215 points a game. Literally every single meaningful statistic by which you would measure how good or bad a basketball team is has improved over last season. I wonder what the difference is. I wonder what the missing 6-foot-11, 265-pound difference is."}, {"4464": "3. The Unicorn of the Year"}, {"40e4": "Bill: With apologies to the Freak (don’t worry, I’m voting for him for second-team All-NBA), the Joker (a legit threat to recreate the ’77 Blazers) and the Zinger (who spent the season in Melo-Rose purgatory), I’m voting for Joel Embiid, a 7-foot-2 behemoth with 3-point range who averaged 20 and eight in 25 minutes a game, sent Sixers fans into a Process tizzy, never even cracked the 800-minute mark, then disappeared. Did we imagine it? Did Joel Embiid even exist? That’s a true unicorn — when you don’t even know if it happened."}, {"ed32": "Jason: The usage of “unicorn” as it pertains to the NBA is interesting. It’s come to mean: 7-footer (or thereabouts) with guard-type skills. Mythical, magical cryptozoological creatures are supposed to be rare. And they are … sort of. Current unicorns include Karl-Anthony Towns (a bona fide inside-outside savage), Anthony Davis (makes 50–20 games look effortless), Giannis Antetokounmpo (god help this plane of reality if he ever gets his jumper working), my son Kristaps (has taken a worrying step back that I blame fully on the Knicks’ institutional ineptitude), and, the UotY, Nikola “Joker” Jokic."}, {"0215": "Here are the top-five PER seasons by players 21 years old or younger:"}, {"2bcb": "2014–15 Anthony Davis: 30.8"}, {"dfed": "1993–94 Shaquille O’Neal: 28.5"}, {"b938": "2005–06 LeBron James: 28.1"}, {"462d": "2013–14 Anthony Davis: 26.5"}, {"4a0d": "2016–17 Nikola Jokic: 26.2 (tied with 2009–10 Kevin Durant)"}, {"2f46": "NIKOLA JOKIC IS MAKING HISTORY!"}, {"003e": "4. The White Chocolate Award for Most Creative Passer"}, {"f285": "Bill: Was there a bigger League Pass revelation than Jokic’s nightly Sabonis/Walton routine? He will single-handedly make Gary Harris an extra $50 million this summer. My dream NBA lottery order: Boston lands the first pick, Denver jumps into the second pick, the Lakers fall out of the top three (and lose their pick to Philly) … and we get 12 to 15 years of Jokic and Lonzo joining forces to create the greatest passing team since God decided that Bill Walton could stay healthy for one season to play with Larry Legend. Sign me up."}, {"5838": "Jason: Nikola Jokic’s passes are like underwear at the Playboy Mansion: filthy, varied, and silky."}, {"d260": "Two or three times a game, Jokic throws the pass that I consider to be his signature dime: a loping, feather-light changeup that crests a defender’s fingertips and drops into a cutting teammate’s hands as if it were placed there by the stork."}, {"39de": "His flashiest assist is a Larry Bird–esque two-handed over-the-head blindside flick that’s as on the money as a dead president. His most utilitarian assist is a faked-jumper push pass that short-circuits a defender’s central nervous system."}, {"ecf6": "Nikola Jokic: Best passing big man in the league; most entertaining passer in the league."}, {"427b": "5. The Dwight Howard Award for Best Statistical Season From a Guy It Seems Miserable to Play With"}, {"a1d3": "Bill: Hey, everybody, it’s Dwight Howard again! You’re not gonna believe it, but he put up solid stats on a team that played OK for a while, then tailed off late thanks to chemistry problems, trade rumors and general apathy."}, {"5f92": "As I said on my NBA awards podcast this week, Dwight Howard is the guy who spends six hours coughing on your cross-country flight. When you get sick within the next 48 hours, you don’t know for sure that he did it, but you blame him anyway. That’s every Dwight Howard season. Rob Hennigan’s last two Magic acts should be trading for Chandler Parsons and bringing Dwight Howard home."}, {"8b62": "Chris Ryan: Chris Paul. His numbers have tailed off a bit from his 2011–12 Clippers high, but he’s still in the top 10 in PER, averaging about 18 points and nine assists per game, and is quite clearly the best point guard of his generation and still one of the best two or three in the game. That being said, he kind of reminds me of Manchester United manager José Mourinho. He’s so smart, and understands his sport so well, that every foul call is an affront to good taste, and every defensive lapse is a blindingly obvious screw-up, and he takes it out on those around him. CP3 has made Blake and DeAndre into household names, but I wouldn’t be surprised if those guys wanted to switch households."}, {"0507": "6. Best Woj Bomb"}, {"c7a1": "Jason: Where were you when the Kings flipped the irascible, inconsistent, and devastatingly talented DeMarcus Cousins to the Pelicans for the impressively shitty return of Buddy Hield, Tyreke Evans, Langston Galloway and a first- and second-round pick? I know where Boogie was: IN NEW ORLEANS, FOR THE ALL-STAR GAME. It’s almost like Vivek and Vlade didn’t want to risk seeing Boogie in person ever again."}, {"c7d7": "In trading Boogie, the Kings brain trust, such as it is, effectively reversed Psalm 118:22, made famous by Bob Marley, among many others: “The stone that the builder refused / Will always be the head cornerstone.” Vlade Divac proclaimed loudly and often that Cousins was untouchable, a cornerstone. The last statement came only two weeks before the trade."}, {"a082": "From the Pelicans’ perspective, it’s a fascinating time-travel experiment at a bargain-basement price. The league’s best teams have long since committed to lineups featuring lone bigs anchoring four similarly sized players. New Orleans zigged hard, pairing the two best big men in the NBA in the seldom-seen twin towers format. If it doesn’t work out, and early returns have ranged from scary-bad to inconsistent, the Pels can always let Boogie strut out of town."}, {"83e1": "7. The Carroll Dawson Award for Most Unabashed Tank Job"}, {"670e": "Bill: Kudos to the Suns for dropping 15 of their last 16 while enjoying a feel-good moment (Devin Booker’s 70-pointer) and developing Tyler Ulis as their own version of The One That Got Away (Isaiah Thomas). Seriously, kudos. When you can tank AND build hope, that’s the Tankapalooza 2017 dream personified. But nothing tops the Lakers for paying Luol Deng and Timofey Mozgov $34 million this year combined to go away, then trotting out Metta World Peace for 17 minutes of an actual NBA game to blow this week’s unexpected lead over the Spurs (and it didn’t work — they won!)."}, {"63d4": "Shea: There was a moment — this was back in early in December or late November — when the Lakers looked like a not-terrible team."}, {"238a": "The Lakers Love BasketballHow Luke Walton made playing in purple and gold fun againtheringer.com"}, {"e6fc": "I remember it because they got out to a super-surprising 10–10 start, and if that doesn’t sound impressive, I’ll remind you that in the prior season, they didn’t win their 10th game of the season until February. Anyway, the Lakers looked decent, and it was all great and good and fun. And then all of the wheels fell off, and the engine fell out, and the doors caught fire, and then the back seats caught fire, too, and then Coach Luke just went ahead and decided to go on and drive their bus into the Pacific Ocean. It’s fine, sure. I get it. Everyone does. The whole purpose of this season has been to get to the next season. The only thing I’m sad about is that they actually are not in last place (they’re in second to last place), and I need for them to be in last place so that Jonathan Tjarks can write a column about their rebuild during the offseason and call it “The Last and the Furious.”"}, {"eb44": "8. The Allan Houston Award for Dumbest Contract"}, {"817b": "Bill: After the 2016 Summer Spending Spree, you knew this category would be loaded — but did you ever think the inexplicable Mozgov-Deng contracts and Joakim Noah’s $73 million fiasco could take such a decided backseat to a much, much, much, much dumber contract? Grit ’n’ Grind … and $94 million of Chandler Parsons? An 82-game schedule … and Chandler Parsons’s ravaged knees? The city of Memphis … and Chandler Parsons’s Instagram account? When Mark Cuban says, “That contract is too risky,” that’s the basketball equivalent of Kris Jenner saying, “We probably shouldn’t do that; it’s in bad taste.” In other words, there’s no bigger red flag. And Memphis plowed ahead anyway. The least they could do is make Parsons their overpaid color analyst or something."}, {"360a": "Jason: Joakim Noah played just 29 games in 2015–16, due to a panoply of shoulder injuries and the accrued effects of his never-say-die playing style amplified by Tom Thibodeau’s sadistic tendency to crush his dudes under heaping piles of minutes. Jo also shot just 38 percent, a chilling number for a big, and turned a wizened 31 years old. But Phil Jackson’s triangle-shaped heart wants what it wants, and he signed Noah to a four-year, $73 million contract. That’s just what the Knicks do. Of course, the move has turned out to be an even deeper and darker money pit than it initially appeared. Noah was recently suspended for 20 games after testing positive for a banned substance, LGD-4033. Anytime you get the chance to take a suspect, over-the-counter dietary supplement with an active ingredient that sounds like what the Weyland-Yutani Corporation would name a planet, you simply must do it. Whatever. Shoot your shot."}, {"ee28": "9. The LaBradford Smith Award for Saddest NBA Feud"}, {"aae7": "Bill: Shaq bullying JaVale McGee for reasons that remain unclear gets the nod, but don’t sleep on Draymond Green’s biting on-court trash talk at Paul Pierce during a Clips-Warriors game. You can’t get no farewell tour, they don’t love you like that. You thought you were Kobe? STOP THE FIGHT!!!!! By the way, Draymond’s after-the-incident explanation — “If you gonna talk junk, I don’t hold anything back when I’m talking junk. If I’ma talk, I’ma talk. And I’ma take it where it needs to go” — would be a great high school yearbook quote for any of you young’uns out there."}, {"99f8": "10. The Coach Bud Award for the Hiring That Inspired the Most “Great Hire” Tweets"}, {"27e6": "Bill: Ha:"}, {"e3ab": "kenny atkinson great hire - Twitter SearchThe latest Tweets on kenny atkinson great hire. Read what people are saying and join the conversation.twitter.com"}, {"5d6e": "Jason: The Wolves handing the horses, reins, and ranch to Tom Thibodeau. It was such a no-brainer that its greatness was obvious to plant life. He had coached the Bulls to four straight top-10 defensive seasons. If you take into account his days as an assistant, Thibs has been involved with 16 top-10 defenses dating back to 1996–97. The Wolves, meanwhile, had young wolf Karl-Anthony Towns, Canadian Kobe Andrew Wiggins, and a bunch of talented young players who don’t really know how to play. Thibs has turned the likes of Nate Robinson and D.J. Augustin into LEGIT IMPACT PLAYERS WHO DID BIG THINGS IN ACTUAL PLAYOFF GAMES. Towns, Wiggins, Ricky Rubio and Kris Dunn have arguably as much raw talent as any four players he’s ever coached. Several sober, professional and serious NBA analysts looked at this marriage and predicted 50 wins."}, {"3c13": "Thibs’s baby Timberwolves put up one of the worst defensive ratings in the league this season. Thibs has been his roaring, bellicose self, to little obvious effect. But these Timberpups have been receptive, even eager, for the challenge. KAT’s general bad-assness, Rubio’s recent streak of confident play, among other glimmers of light, keep the original premise — GREAT HIRE — much in force."}, {"8753": "11. The Ann Iverson Award for Best/Most Polarizing NBA Family Member"}, {"6eb2": "(Getty Images)"}, {"41d5": "Bill: Can we give it to LaVar Ball one year early? Did you ever think an NBA dad would be battling Stephen A. on First Take? Starting next season, LaVar Ball is locking up this award like The Daily Show locked up that decade of Outstanding Variety Show Emmys. Might as well give him one early. Honorable mention: Dennis Schröder’s mom, Austin Rivers, LeBron James Jr., Wanda Durant, Dwyane Wade’s ex-wife."}, {"f6b1": "Shea: Without Googling, I honestly do not know one single thing about DeMarcus Cousins’s brother, Jaleel. I don’t know if he’s an older brother or a younger brother. I don’t know if he’s a blood brother or an adopted brother. I don’t know if he’s an only brother or if there is a gaggle of Cousins boys running around. I don’t know any of that. The only thing that I do know is that when Andy Furillo, a reporter from the Sacramento Bee, mentioned Jaleel in an column, DeMarcus got very upset and confronted him, cussing at him and yelling at him and pointing his finger at him. That, to me, seems like enough for him to win this award."}, {"c401": "12. The Shane Battier Award for Sloan Conference/Stat Nerd Darling Du Jour"}, {"572f": "Bill: With apologies to Robert Covington’s deflections, let’s acknowledge the Crown Prince of the Moreyball Era, James Harden, for his third straight season of 200-plus made 3s and 700-plus made free throws. With four games to play, he’s sitting at 244 made 3s and 713 made free throws, giving him an outside chance of creating the 250/750 club. But he’s also sitting at 861 assists, opening the door for the 250/750/900 WHAT THE FUCK IS GOING ON Club. Jimmy Harden, everybody!"}, {"5ff0": "13. The Joel Embiid Award for Best Social Media Persona"}, {"4d03": "Bill: Embiid didn’t play enough games to win his own award, giving Chandler Parsons’s Instagram account the nudge it needed. Hitting on Instagram models? Feuding with Joel Embiid? Dolphins? La familia? Chancun?"}, {"b3dd": "Putting Chandler Parsons in Memphis was like putting Vincent Chase in Memphis — only if Vincent Chase was killing the Grizzlies’ salary cap by more than 20 percent every season. The good news: Parsons still has enough in the tank to make Rob Hennigan’s infamous whiteboard of hybrids! Sadly, Parsons took so much shit in Memphis for the Cancun Instagrams that he stopped posting. Or, Zach Randolph threatened to kill him. It’s unclear. But we’ll always have Chancun."}, {"05a5": "14. The Vin Baker Award for Riskiest Idea That Became an Unsurprising Failure"}, {"ce9b": "Bill: (Search this piece for “Chancun.”)"}, {"89b7": "Chris: So wait, the crippled core of a Chicago Bulls team that had been mortared, pestled, Vitamixed, and pulverized into a fine powder by Tom Thibodeau’s DNP strategy didn’t work out in New York? You’re telling me Joakim Noah and Derrick Rose weren’t able to Nicolas Cage the national treasure that is the triangle offense? And that’s why Jeff Hornacek is the NBA coaching equivalent of the This Is Fine meme? Weird!"}, {"ef83": "15. The Damon Jones Award for Best Bench Chemist"}, {"bc87": "Bill: Alan Anderson’s handshake routine on the (occasionally dysfunctional) Clippers bench has to be seen in person to be believed; it’s like the Clips offered him a bonus for every game with at least 250 handshakes/hand slaps/fist bumps."}, {"167a": "Anderson doesn’t listen to Doc Rivers in the timeout huddles; he’s too busy grabbing prime real estate between the Clips bench and the scorer’s table so he can dap everyone heading back on the court. If anyone tries to go around him, he chases them down from behind like J.J. Watt. YOU WILL SLAP MY HAND IN MULTIPLE STEPS! We need SportVU to keep track of hand taps; I think Anderson had the bench chemist version of Westbrook’s triple-double season. Even Chris Paul seems to enjoy him, and Chris Paul hates everything and everyone. Alan Anderson is my favorite chemist since Walter White."}, {"150f": "Shea: Quincy Acy should win this award for every season that he’s in the league, because nobody celebrates a good thing that’s happened on the court from the bench like he does. He was on the Kings last year, and there was a play where DeMarcus Cousins dunked on Robin Lopez, and Quincy for real just jumped up off the bench with his hands in the air and ran down the sideline off camera."}, {"bc93": "When DeMarcus dunked on Mason Plumlee two weeks later, Acy did the exact same celebration, and it was twice as funny the second time. The best one, though, was when Rajon Rondo dunked during a game and Acy, a darling, stood up and then fell backward pretending to faint from excitement. It was great, and probably the best dunk reaction of the last five years."}, {"da8a": "Here’s the thing of it, though, and I’m telling you this because I’m going to cheat a little: Quincy played for the Nets this season, and nothing good has happened to the Nets in at least 10 years, so there just hasn’t been much for him to celebrate. Still, though, I think he gets here just off of pedigree."}, {"0bdd": "16. The Jail Blazers Award for Best Ongoing Train Wreck"}, {"31fe": "Bill: With apologies to Vlade & Vivek (the next great NBC comedy), Philly’s medical staff (seriously, would you let them treat your sprained ankle?), the Brooklyn Nyets (no hope for the present or the future, but at least their owner has a good in with one of the co-presidents of the United States), and Phil/Melo/Dolan/Rose (I like Knicks fans, so that one just makes me sad), how can the Buss family NOT win this? You have, by all accounts, the greatest NBA owner of the last 35 years … and somehow he spawned the most dysfunctional group of heirs that’s ever owned an NBA team? The Buss siblings make the Maloofs look like the Emanuel brothers. Jeanie Buss seems like the most competent of the bunch; would you trust her to run a lemonade stand at this point? Since when did a bunch of related-by-blood NBA owners just start suing each other during a season? This was Game of Thrones after five drinks and a head injury."}, {"7979": "17. The Hardwood Classics Award for Best Regular-Season Game"}, {"8e5d": "Bill: With apologies to Christmas Day (Cavs 109, Warriors 108), Rockets-Warriors (132–127 OT), Cavs-Wizards (LeBron’s big 3) and both OKC-Boston games, I’m picking the night that Zach Lowe and I finally fixed the septic tank on Waiters Island, reconnected the electricity and opened the island’s airport back up for visitors: Miami’s big win over Oakland! Waiters Island dropped 33 (including the game winner) that jump-started Miami’s eventual 13-game winning streak (and the Spoelstrassaince). There might have been better Irrational Confidence Guys, just not lately. Come to Waiters Island, use your Amex points."}, {"d00f": "Chris: This is recency bias at work, but Pacers-Cavs!"}, {"1436": "Two overtimes, LeBron getting tested on every possession by Paul George (who also had the stones to guard Bron for most of the game), an intra-Cavs squabble live on TV …"}, {"7e41": "… and the return of Lance Stephenson, the Great American LeBron Troll! What more do you want from a sporting event?!"}, {"c131": "18. The Skip Bayless Trophy for Best Straw Man Media Argument"}, {"34e9": "Bill: I loved when advanced metrics showed Kawhi Leonard’s defensive impact slipping a little, followed by some wondering if his defensive impact might be just a smidge overrated, then someone else doing research and realizing that Kawhi’s opponents just randomly shot better than expected when he was out there, so actually, Kawhi Leonard WAS still great at defense. Or something. So … I don’t have to feel bad about believing that Kawhi is one of the best two perimeter defenders I’ve ever seen in my life because his slightly-lower-than-usual defensive RPMs might be a little goofy this year? Thanks!"}, {"8898": "Chris: I am Russell Westbrook’s Kellyanne Conway, but even so, this is my reaction to people who say Russ stat-pads his rebounding numbers because nobody boxes him out:"}, {"5422": "19. The Vinnie Johnson Award for Best Heat Check Guy"}, {"5cee": "Bill: I know Devin Booker dropped 70, and I know some other dudes (Klay, Dame, Isaiah, Waiters Island, etc.) can sprout those NBA Jam flames, but still, there’s nothing more fun than when Steph gets hot. Sorry."}, {"b602": "Chris: Damian Lillard took a bit of a hit this year, enough that there was a semi-serious debate about whether the Blazers were better with C.J. McCollum at the controls. But Clutch Lillard is still one of the best reasons to watch the game."}, {"3db1": "20. The Virginia Beach Kings Award for Most Contrived Story on a Slow News Day"}, {"8142": "Bill: Kyrie Irving thinks the earth is flat? Can Becky Hammon be an NBA head coach? (Someone) is mad at (Charles Barkley or Shaquille O’Neal)? Should NBA players rest during national TV games? Apologies to all of them: I vote for any story that glorifies triple-doubles like they’re anything other than an arbitrary stat that we started to acknowledge 30–35 years ago because we were bored, then Ice Cube made it sound cool and now we’re here."}, {"8823": "Chris: Kyrie Copernicus!"}, {"d836": "This isn’t even a conversation!"}, {"ab47": "21. The Charles Oakley Award for the Teammate You’d Want Getting Your Back in a Dark Alley"}, {"c980": "Bill: I would walk into any alley with Jusuf Nurkic. He’s our best bet to pull a Willis Reed during an NBA game and punch out three opponents in 10 seconds."}, {"8106": "22. The Nique Award for Best In-Game Dunker"}, {"addc": "Bill: You wouldn’t put him in the Nique/Young MJ/Young Vince/Early Blake stratosphere, but Westbrook’s occasional “Grab the Rebound, Turn on the Jets, Slice Through Three Guys and Dunk on the Biggest One, Then Scowl at Everybody” routine doubled as the most reliably exciting dunk-related League Pass moment."}, {"ee31": "Honorable mention: Greek Freak on the break, Larry Nance Jr. in traffic, Jaylen Brown or Marquese Chriss in garbage time, the three times a year when Chris Paul dunks."}, {"984d": "Shea: A good Dominique Wilkins dunk had four parts. First, it was obviously a forceful, energetic, kinetic thing. Second, it had a great big spoonful of anger. Third, it was remarkably athletic. And fourth — and this is maybe the most important part — it had an echo. It lived on and rang out farther than Atlanta (or wherever the Hawks happened to playing the night when he dunked the flesh off someone’s skeleton)."}, {"5ef6": "These are just a few of the headlines that were on the internet the day after James Johnson, our basketball lord and flavor, mega-dunked on Marcus Morris during a game last month:"}, {"e751": "Earning this award is difficult, given that Wilkins was one of the three greatest in-game dunkers of all time. And so we have to be careful with who we hand it out to, but I feel confident in awarding James Johnson, who has been circling this award since he took Andre Drummond’s head off in 2014."}], "child": "29_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_10\t29_11\t29_12\t29_13\t29_14\t29_15\t29_16\t29_17\t29_18\t29_19\t29_20\t29_21\t29_22\t29_23\t29_24\t29_25"}