{"content": "“Am I Going to Have to Vote for Westbrook?” Bill Simmons doesn’t want to pick an MVP who has no shot at the title, but this season may leave him no choice (Getty Images) This is the most exciting MVP debate in ages. Russell Westbrook and James Harden are testing what voters value more. Does the award need to go to a player on a contender, or is Westbrook’s ground-breaking performance enough to earn it? Bill Simmons, who has an MVP vote, discussed the conundrum with Joe House on the latest Bill Simmons Podcast. Listen to the full podcast here. This transcript has been edited and condensed. Westbrook’s Surge Might Put Him Over the Top Bill Simmons: I’m not ready to make a decision yet. I wrote about Westbrook a [few weeks] ago and since then he’s single-handedly won three games by himself. Two he pulled out of the deep recesses of Oklahoma City’s sphincter. It was all the way in and he just reached in there and pulled them out. And then [Wednesday] he had 45, 9, and 10, and they beat Memphis by three. It just feels like he’s peaking at the end here, and there’s recency bias, but also he’s peaking because he wants to win the award and he wants to finish with a triple-double [average], and he’s actually delivering. Whereas Harden [and the Rockets] totally outplayed Oklahoma City on Sunday on ABC — I watched that game for three quarters, [and] Westbrook put up a bunch of cheap stats in the fourth quarter when the game was over. And I left that game thinking, “It’s over, Harden won the MVP.” Harden hurts his wrist at the end of the game, has not been the same since, he left the door a crack open; Kawhi hasn’t been shooting as well since the All-Star break. He might have had a chance, if he really played lights out, but he just hasn’t. LeBron, that team went in the tank for some degree there, they rallied back [Wednesday] night, but they have not played well. Kevin Durant almost broke his leg and he’s been out, so he’s out of the running. Isaiah Thomas can’t win. And the more I stare at this, I’m like, “Fuck, am I going to have to vote for Westbrook?” I hate when it seems like guys are chasing stats. I don’t like voting for MVPs that aren’t on a team that I think can win the title. I can only remember doing that one other time, with Kobe in ’06, and there were just no other candidates. I felt like, by default, I had to vote for him. Joe House: That’s interesting. I’m curious to take a one-level-deeper dive with you on your thinking [as] to why it is that Westbrook, and you mentioned recency bias, has asserted himself in such a way that would change your overall philosophy. I think there is a very good reason that over the course of recent NBA history, no MVP has come from a team that’s won less than 50 games. The MVP is a mantle, it’s an important stamp for the league. Westbrook is fascinating and deserves all of the credit that he is receiving. It’s eye-opening, it’s mind-boggling what he is achieving. But at the end of the season, it strikes me as not much more than a neat curiosity. Video: NBA MVP Attack AdsA close look at Westbrook, LeBron, Kawhi, and Hardentheringer.com Does Being on a Contender Matter? House: Oklahoma City was forecast before the season started as a 44-win team, and they’re going to come in around 46, 47. Houston was also forecast to come in in the mid-40s, and they’re going to be 12 or 13 or 14 games better. And Harden has been the straw stirring that drink from the minute the season started. He’s been on a relentless redemption tear. That team has genuine ambitions and genuine aspirations to threaten the Western Conference. You think that Houston has the best chance of challenging the Warriors in the West. Simmons: I do. House: Much better than the Spurs. Is it just the fact that [Westbrook is] going to end up averaging a triple-double and it’s such a unique mark that you think he deserves the recognition of the league mantle? Simmons: I hate triple-doubles, it just seems like a totally arbitrary number to me. If somebody has 38 points, 13 rebounds, and 8 assists and somebody else has 19 points, 10 rebounds, and 10 assists, the triple-double is the one that gets the pat on the back? I don’t get that, it’s just fucking arbitrary. Rebounds Might Make the Difference House: The thing that’s going to keep Harden from averaging a triple-double this season is about 160 rebounds. So that’s a little less than two rebounds a game. It’s not a huge leap. Simmons: That’s the thing. From an assist-points standpoint, they’re pretty much even, and Harden just shoots better. Westbrook has taken 350 more field goals than anybody else in the league. So he takes over four shots a game more than anybody else in the league. He’s also averaging 10 free throws a game. His usage rate is almost 42 percent, which is by far the highest total in the history of the league. His assist rate is 57. I laid this all out when I wrote the Westbrook column a few weeks ago. Nothing has really changed from the ball-dominance standpoint. Harden has just done it more efficiently. The difference is that Westbrook is getting these two and a half, three extra rebounds a game. The Russell Westbrook ProblemThe most amazing athlete in the NBA? The biggest ball hog in history? Oklahoma City’s triple-double machine could be…theringer.com I will say, this is a credit to Oklahoma City, the team wants him to get the rebounds. On free throws, you see the two [Thunder] guys box out their guys so Westbrook can come get it. It’s a smart play because you want your point guard to get the ball and go or to be throwing the outlet pass to him. They want him to get these 10 rebounds a game. My question is, “Should that swing the MVP?” If he was at eight rebounds a game, I don’t know if it would totally be in the conversation. But It’s Westbrook’s Season Simmons: Here’s the other part to this: He’s resonating with fans in a different way than Harden does. I think that has to count for something when you think about MVP. I think we’re going to remember this as the Westbrook-Durant season. Ten years from now, it’ll be like what was the ’16–17 season? Oh, that was the Westbrook-Durant season. That was the year Westbrook [averaged] a triple-double [and] Durant left to go to Golden State. He’s more fun to watch than Harden. [Houston’s offense is] the same thing every time. He’s out in the front, everybody is standing there. Westbrook, at least, he does the fast breaks, I think he’s a little more fun game to game than Harden is. [People] love that he’s a man possessed and a man scorned, so the story line is a little bit sexier than the Harden thing. I get the Westbrook thing. [But] I just can’t wrap my head around voting for MVP for somebody who has no chance to win the title. ", "child": "29_1\t29_2\t29_3\t29_4\t29_5\t29_6\t29_7\t29_8\t29_9\t29_10\t29_11\t29_12\t29_13\t29_14", "title": "“Am I Going to Have to Vote for Westbrook?”", "parent": "", "sentences": [{"8390": "“Am I Going to Have to Vote for Westbrook?”"}, {"99fc": "Bill Simmons doesn’t want to pick an MVP who has no shot at the title, but this season may leave him no choice"}, {"3ef4": "(Getty Images)"}, {"ee95": "This is the most exciting MVP debate in ages. Russell Westbrook and James Harden are testing what voters value more. Does the award need to go to a player on a contender, or is Westbrook’s ground-breaking performance enough to earn it? Bill Simmons, who has an MVP vote, discussed the conundrum with Joe House on the latest Bill Simmons Podcast."}, {"1e2b": "Listen to the full podcast here. This transcript has been edited and condensed."}, {"dd8e": "Westbrook’s Surge Might Put Him Over the Top"}, {"7738": "Bill Simmons: I’m not ready to make a decision yet. I wrote about Westbrook a [few weeks] ago and since then he’s single-handedly won three games by himself. Two he pulled out of the deep recesses of Oklahoma City’s sphincter. It was all the way in and he just reached in there and pulled them out. And then [Wednesday] he had 45, 9, and 10, and they beat Memphis by three. It just feels like he’s peaking at the end here, and there’s recency bias, but also he’s peaking because he wants to win the award and he wants to finish with a triple-double [average], and he’s actually delivering."}, {"fa7a": "Whereas Harden [and the Rockets] totally outplayed Oklahoma City on Sunday on ABC — I watched that game for three quarters, [and] Westbrook put up a bunch of cheap stats in the fourth quarter when the game was over. And I left that game thinking, “It’s over, Harden won the MVP.” Harden hurts his wrist at the end of the game, has not been the same since, he left the door a crack open; Kawhi hasn’t been shooting as well since the All-Star break. He might have had a chance, if he really played lights out, but he just hasn’t. LeBron, that team went in the tank for some degree there, they rallied back [Wednesday] night, but they have not played well. Kevin Durant almost broke his leg and he’s been out, so he’s out of the running. Isaiah Thomas can’t win. And the more I stare at this, I’m like, “Fuck, am I going to have to vote for Westbrook?”"}, {"9149": "I hate when it seems like guys are chasing stats. I don’t like voting for MVPs that aren’t on a team that I think can win the title. I can only remember doing that one other time, with Kobe in ’06, and there were just no other candidates. I felt like, by default, I had to vote for him."}, {"9256": "Joe House: That’s interesting. I’m curious to take a one-level-deeper dive with you on your thinking [as] to why it is that Westbrook, and you mentioned recency bias, has asserted himself in such a way that would change your overall philosophy. I think there is a very good reason that over the course of recent NBA history, no MVP has come from a team that’s won less than 50 games. The MVP is a mantle, it’s an important stamp for the league."}, {"dc99": "Westbrook is fascinating and deserves all of the credit that he is receiving. It’s eye-opening, it’s mind-boggling what he is achieving. But at the end of the season, it strikes me as not much more than a neat curiosity."}, {"a42a": "Video: NBA MVP Attack AdsA close look at Westbrook, LeBron, Kawhi, and Hardentheringer.com"}, {"2b72": "Does Being on a Contender Matter?"}, {"4973": "House: Oklahoma City was forecast before the season started as a 44-win team, and they’re going to come in around 46, 47. Houston was also forecast to come in in the mid-40s, and they’re going to be 12 or 13 or 14 games better. And Harden has been the straw stirring that drink from the minute the season started. He’s been on a relentless redemption tear. That team has genuine ambitions and genuine aspirations to threaten the Western Conference. You think that Houston has the best chance of challenging the Warriors in the West."}, {"f2eb": "Simmons: I do."}, {"7adb": "House: Much better than the Spurs. Is it just the fact that [Westbrook is] going to end up averaging a triple-double and it’s such a unique mark that you think he deserves the recognition of the league mantle?"}, {"a0b3": "Simmons: I hate triple-doubles, it just seems like a totally arbitrary number to me. If somebody has 38 points, 13 rebounds, and 8 assists and somebody else has 19 points, 10 rebounds, and 10 assists, the triple-double is the one that gets the pat on the back? I don’t get that, it’s just fucking arbitrary."}, {"2e7e": "Rebounds Might Make the Difference"}, {"dd25": "House: The thing that’s going to keep Harden from averaging a triple-double this season is about 160 rebounds. So that’s a little less than two rebounds a game. It’s not a huge leap."}, {"1972": "Simmons: That’s the thing. From an assist-points standpoint, they’re pretty much even, and Harden just shoots better. Westbrook has taken 350 more field goals than anybody else in the league. So he takes over four shots a game more than anybody else in the league. He’s also averaging 10 free throws a game. His usage rate is almost 42 percent, which is by far the highest total in the history of the league. His assist rate is 57. I laid this all out when I wrote the Westbrook column a few weeks ago. Nothing has really changed from the ball-dominance standpoint. Harden has just done it more efficiently. The difference is that Westbrook is getting these two and a half, three extra rebounds a game."}, {"b474": "The Russell Westbrook ProblemThe most amazing athlete in the NBA? The biggest ball hog in history? Oklahoma City’s triple-double machine could be…theringer.com"}, {"f534": "I will say, this is a credit to Oklahoma City, the team wants him to get the rebounds. On free throws, you see the two [Thunder] guys box out their guys so Westbrook can come get it. It’s a smart play because you want your point guard to get the ball and go or to be throwing the outlet pass to him. They want him to get these 10 rebounds a game. My question is, “Should that swing the MVP?” If he was at eight rebounds a game, I don’t know if it would totally be in the conversation."}, {"1ba3": "But It’s Westbrook’s Season"}, {"cde1": "Simmons: Here’s the other part to this: He’s resonating with fans in a different way than Harden does. I think that has to count for something when you think about MVP. I think we’re going to remember this as the Westbrook-Durant season. Ten years from now, it’ll be like what was the ’16–17 season? Oh, that was the Westbrook-Durant season. That was the year Westbrook [averaged] a triple-double [and] Durant left to go to Golden State."}, {"7aed": "He’s more fun to watch than Harden. [Houston’s offense is] the same thing every time. He’s out in the front, everybody is standing there. Westbrook, at least, he does the fast breaks, I think he’s a little more fun game to game than Harden is. [People] love that he’s a man possessed and a man scorned, so the story line is a little bit sexier than the Harden thing. I get the Westbrook thing."}, {"a5ba": "[But] I just can’t wrap my head around voting for MVP for somebody who has no chance to win the title."}], "name": "29"}