{"name": "293", "parent": "", "content": "How to Become a Goddamn Idea Machine James Altucher is my new best friend. Okay, not really. But for real — I read about this thing he does and then I did it, too. And it changed my life. It’s only been a week or so, but I feel like I’ve leveled up in a way that doesn’t happen too super often. James (I can call him by his first name, right?) says that if you write a list of 10 ideas a day, you’ll turn yourself into an idea machine. I’m all about ideas, thanks to my wiring. I found a copy of Strengthfinders at a thrift store last year for $3, with the code in tact. I took the test and by a whole lot my #1 strength is ideation. That manifests, for me, as a love of ideas. I get good ones. I get (maybe over) enthusiastic about other people’s ideas. I think ideas are at the root of my deep, sustaining love for stories. I get so excited about ideas that I leap into them without a ton of planning. I can clearly see the potential end point. I’m great at taking the first steps toward that great, magical place. But I get lost in the middle. I’m not great with all of the steps between here and there. I take off on the Yellow Brick Road, and I know that Oz is at the end, but I hit a fork in the road and realize that if I do this other thing I can get to Wonderland instead of Oz, and Wonderland sounds awesome. I can totally imagine being there. Well, you get the picture. Great starts, pretty much non-existent follow through about 80 percent of the time. And because of my propensity for cannon balling into ideas, that 80 percent of the time often happens publicly and embarrassingly. All this time, though, and I’ve never thought about letting myself have bad ideas. Even encouraging bad ideas. Or ideas that I’ll never even get started on. Or ideas I’ll pass off to someone else who might make better use of it than I might. Or ideas that will get me through the middle steps of my last great idea. In the last week I’ve made a list of: The upside to ten problems. Ten apps I wish I had. Ten good things about having my parents-in-law (and their dementia) living in my basement apartment. Ten ways I might get myself to the World Domination Summit this summer. Ten books I want to write. Ten ideas for my friend Amy. (I may or may not have freaked her out with an effervescent text and random late night phone call, because . . . IDEAS!) Ten breakfasts that are healthier than Poptarts. Ten people I wish I knew and one idea for how I might meet each one. And this week I: Outlined a book I really do want to write. Had a great conversation with Amy about the ideas I came up with for her. Ate zero Poptarts. Had two amazing friends surprise me with a ticket to the World Domination Summit. (Are you going to be there?) Reached out to someone I wished I knew. And they reached back. The most important thing though, the real point of this exercise I think, is that even after just a week I can feel my brain opening up to the idea of ideas. I was able to connect deeper with the world around me because I was primed for ideas. I was hunting them. I can’t wait to see what six months does. I’ll let you know. If you enjoyed this post, give it some love with a recommendation heart. ❤ >>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer. ", "title": "How to Become a Goddamn Idea Machine", "sentences": [{"ca77": "How to Become a Goddamn Idea Machine"}, {"e907": "James Altucher is my new best friend."}, {"87ff": "Okay, not really. But for real — I read about this thing he does and then I did it, too. And it changed my life. It’s only been a week or so, but I feel like I’ve leveled up in a way that doesn’t happen too super often."}, {"5265": "James (I can call him by his first name, right?) says that if you write a list of 10 ideas a day, you’ll turn yourself into an idea machine."}, {"81a0": "I’m all about ideas, thanks to my wiring. I found a copy of Strengthfinders at a thrift store last year for $3, with the code in tact. I took the test and by a whole lot my #1 strength is ideation."}, {"5ba6": "That manifests, for me, as a love of ideas. I get good ones. I get (maybe over) enthusiastic about other people’s ideas. I think ideas are at the root of my deep, sustaining love for stories."}, {"2f70": "I get so excited about ideas that I leap into them without a ton of planning. I can clearly see the potential end point. I’m great at taking the first steps toward that great, magical place. But I get lost in the middle."}, {"460f": "I’m not great with all of the steps between here and there. I take off on the Yellow Brick Road, and I know that Oz is at the end, but I hit a fork in the road and realize that if I do this other thing I can get to Wonderland instead of Oz, and Wonderland sounds awesome. I can totally imagine being there."}, {"765f": "Well, you get the picture. Great starts, pretty much non-existent follow through about 80 percent of the time. And because of my propensity for cannon balling into ideas, that 80 percent of the time often happens publicly and embarrassingly."}, {"1ad7": "All this time, though, and I’ve never thought about letting myself have bad ideas. Even encouraging bad ideas. Or ideas that I’ll never even get started on. Or ideas I’ll pass off to someone else who might make better use of it than I might."}, {"d870": "Or ideas that will get me through the middle steps of my last great idea."}, {"015d": "In the last week I’ve made a list of:"}, {"1acb": "The upside to ten problems."}, {"c6f4": "Ten apps I wish I had."}, {"8517": "Ten good things about having my parents-in-law (and their dementia) living in my basement apartment."}, {"4fbc": "Ten ways I might get myself to the World Domination Summit this summer."}, {"ace9": "Ten books I want to write."}, {"3be9": "Ten ideas for my friend Amy. (I may or may not have freaked her out with an effervescent text and random late night phone call, because . . . IDEAS!)"}, {"de36": "Ten breakfasts that are healthier than Poptarts."}, {"3470": "Ten people I wish I knew and one idea for how I might meet each one."}, {"a681": "And this week I:"}, {"b75a": "Outlined a book I really do want to write."}, {"1a9c": "Had a great conversation with Amy about the ideas I came up with for her."}, {"f06b": "Ate zero Poptarts."}, {"80e3": "Had two amazing friends surprise me with a ticket to the World Domination Summit. (Are you going to be there?)"}, {"666c": "Reached out to someone I wished I knew. And they reached back."}, {"e5d8": "The most important thing though, the real point of this exercise I think, is that even after just a week I can feel my brain opening up to the idea of ideas. I was able to connect deeper with the world around me because I was primed for ideas. I was hunting them."}, {"ae80": "I can’t wait to see what six months does. I’ll let you know."}, {"025f": "If you enjoyed this post, give it some love with a recommendation heart. ❤"}, {"522d": ">>Sign up for the Ninja Writers Newsletter here. >>Or come hang out with the Ninjas on Facebook.>>There are some pretty kickass rewards on our Patreon page."}, {"b426": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and the original Ninja Writer."}], "child": "293_1\t293_2\t293_3\t293_4\t293_5\t293_6\t293_7\t293_8\t293_9\t293_10\t293_11\t293_12\t293_13\t293_14\t293_15\t293_16\t293_17\t293_18\t293_19\t293_20293_1\t293_2\t293_3\t293_4\t293_5\t293_6\t293_7\t293_8\t293_9\t293_10\t293_11\t293_12\t293_13\t293_14\t293_15\t293_16\t293_17\t293_18\t293_19\t293_20"}