{"name": "294", "parent": "", "content": "How Coworking Saved My Life Whenever I meet students and young professionals to discuss freelancing, entrepreneurship, or other unconventional paths, I tend to share the same piece of advice: Join a coworking center. It may seem simple, but there is so much more value than you may think. I’ve been working for myself since I graduated, and like many other freelancers and entrepreneurs, I used to work from home. In the beginning, setting up a home office can be the ultimate time-and-money-saver. You don’t have to pay rent for a separate office, waste time on a morning commute, and you can even write-off part of your lease or mortgage as tax-deductible. However, the longer you work from home, the more lines begin to blur. You start waking up a little later, distracting yourself with Netflix a little more, and leaving the house less and less. In my case, I had been working from the front room in my apartment. This was fine for about a year and a half until I realized I felt disconnected from the outside world, professionally speaking. I got drinks with friends and hung out on the weekends, but these things didn’t replace my feelings of isolation during most of the week. At the end of the day, I lacked a sense of camaraderie because I didn’t have coworkers. This is something a lot of freelancers and solo founders experience day-to-day when working on their own. Granted, there are virtual communities, from Slack accounts to Facebook groups, made to fill this gap. As great as these are, they can’t replace genuine, face-to-face interaction. Human beings are social creatures. Whether introverted or extroverted, we all yearn for real-life connection with others. This is why I started my search for the perfect coworking center, which fortunately didn’t last very long. After looking all over St. Louis for a week or two, I received a Facebook event invite to the opening of a new coworking center called TechArtista CWE. As soon as I left the happy hour, I knew I had found my new home. Over two years later, I’m still here, for one very good reason: I found my own community of comrades, collaborators, cofounders, clients, coaches, companions, and confidants. When working on your own, it’s easy to feel lonely and disconnected. For me, it was hard to relate with friends who chose full-time employment. I would never judge anyone for choosing a different life; I just needed to interact with others who understood sacrificing short-term stability for the chance to forge their own path. Once I found this, everything changed. I received a newfound sense of purpose, daily motivation to keep trudging forward, and accountability for my goals, both short-term and in the future. If you work for yourself and are desperate for human connection, I strongly suggest finding a coworking community that mirrors your own personal values. Once you do, you’ll be surprised at what happens next. Do you work on your own? Have you considered joining a coworking community? Please feel free to share your thoughts in the comments below or on Twitter at @williamfrazr. If you found value in this article, please click the 💚 icon below and share with your friends so others can enjoy too! Check out The Imperfectionist for more articles that discuss turning ideas into action! ", "title": "How Coworking Saved My Life", "sentences": [{"c9f1": "How Coworking Saved My Life"}, {"571d": "Whenever I meet students and young professionals to discuss freelancing, entrepreneurship, or other unconventional paths, I tend to share the same piece of advice:"}, {"614d": "Join a coworking center."}, {"7ea4": "It may seem simple, but there is so much more value than you may think."}, {"cff5": "I’ve been working for myself since I graduated, and like many other freelancers and entrepreneurs, I used to work from home."}, {"accb": "In the beginning, setting up a home office can be the ultimate time-and-money-saver. You don’t have to pay rent for a separate office, waste time on a morning commute, and you can even write-off part of your lease or mortgage as tax-deductible."}, {"c94c": "However, the longer you work from home, the more lines begin to blur. You start waking up a little later, distracting yourself with Netflix a little more, and leaving the house less and less."}, {"93f4": "In my case, I had been working from the front room in my apartment. This was fine for about a year and a half until I realized I felt disconnected from the outside world, professionally speaking."}, {"fb25": "I got drinks with friends and hung out on the weekends, but these things didn’t replace my feelings of isolation during most of the week. At the end of the day, I lacked a sense of camaraderie because I didn’t have coworkers."}, {"a755": "This is something a lot of freelancers and solo founders experience day-to-day when working on their own."}, {"9fbe": "Granted, there are virtual communities, from Slack accounts to Facebook groups, made to fill this gap. As great as these are, they can’t replace genuine, face-to-face interaction."}, {"09c9": "Human beings are social creatures. Whether introverted or extroverted, we all yearn for real-life connection with others."}, {"4412": "This is why I started my search for the perfect coworking center, which fortunately didn’t last very long."}, {"0887": "After looking all over St. Louis for a week or two, I received a Facebook event invite to the opening of a new coworking center called TechArtista CWE."}, {"c71b": "As soon as I left the happy hour, I knew I had found my new home."}, {"c33d": "Over two years later, I’m still here, for one very good reason:"}, {"16eb": "I found my own community of comrades, collaborators, cofounders, clients, coaches, companions, and confidants."}, {"ca67": "When working on your own, it’s easy to feel lonely and disconnected."}, {"ff06": "For me, it was hard to relate with friends who chose full-time employment. I would never judge anyone for choosing a different life; I just needed to interact with others who understood sacrificing short-term stability for the chance to forge their own path."}, {"2973": "Once I found this, everything changed."}, {"8d42": "I received a newfound sense of purpose, daily motivation to keep trudging forward, and accountability for my goals, both short-term and in the future."}, {"40ce": "If you work for yourself and are desperate for human connection, I strongly suggest finding a coworking community that mirrors your own personal values. Once you do, you’ll be surprised at what happens next."}, {"127d": "Do you work on your own? Have you considered joining a coworking community? Please feel free to share your thoughts in the comments below or on Twitter at @williamfrazr."}, {"1d64": "If you found value in this article, please click the 💚 icon below and share with your friends so others can enjoy too!"}, {"c477": "Check out The Imperfectionist for more articles that discuss turning ideas into action!"}], "child": "294_1\t294_2294_1\t294_2"}