{"name": "296", "parent": "", "content": "Peter Drucker: How to (Actually) Manage Your Time Many consider Peter Drucker the most influential thinker in the history of management. His prolific writings — over 30 books — have gone on to sell millions of copies and inspire young managers all over the world. That’s great. But what if you’re not a manager? What if you’re a freelancer, an office grunt, or just a hermit living in the woods? Can Drucker still help you? You bet. There’s one thing that everyone has to manage. It’s something very close to us — ourselves. For Drucker, this self-management starts with time. In The Essential Drucker — an excellent intro to Drucker’s prolific writings (over 30 books!) — there’s an entire chapter devoted to his method of time management. I’ve used a variant Drucker’s method on and off for a while now. When I do use it, I am a productive beast, averaging 7–8 hours of quality work a day. When I don’t, I average 2–3 hours — no better than the average American. Let’s take a look at Drucker’s method. Why Time? I have a friend who never runs out of startup ideas. Every few weeks, he sends me an excited message that goes something like this: HEYYYY MANNN! I’ve got this AWESOME idea. Nobody’s thought of it. There’s an inefficiency in the market. All I have to do is exploit it, and BAM!!!!11!!! It’s gonna be the next Facebook!” Five years later, there’s still only one Facebook. My friend is still teaching English. What’s wrong here? Well, a lot is wrong. But, according to Drucker, the most obvious mistake is that he is starting in the wrong place: “Effective knowledge workers, in my observation, do not start with their tasks. They start with their time.” I see this often. People make intricate plans for diets, businesses, or world travel and, well, none of it happens. It’s a pleasant fantasy. If you want results instead of fantasies, the first step is to start executing. And execution starts by mastering your time. The Three Steps to Master Your Time Drucker’s method can be roughly divided into three steps. The first step is to understand. 1. Record Your Time If you’re like me, you probably read “record your time” and thought something like this: Pshhhh. Are you kidding? I’m me. ME. I lived it, so I know where my time goes. Why bother to track it? Nope. Our minds are fickle, says Drucker: “Man is ill-equipped to manage his time. Even in total darkness, most people retain their sense of space. But even with the lights on, a few hours in a sealed room render most people incapable of estimating how much time has elapsed. […] If we rely on our memory, therefore, we do not know how time has been spent.” The only way to stay honest is to track in the moment. There are countless ways to do this: “The specific method in which the record is put together need not concern us here. … The important thing is that it gets done, and that the record is made in “real” time…“ It doesn’t matter how you do it. Just make sure that you do. Here are some ways you can try: Personally, I track on paper and record everything to a spreadsheet at the end of the day. Drucker recommends doing this for 3–4 weeks. I think 1 is probably enough, for starters. Either way, take your records and… 2. Diagnose Your Time The next step is to analyze your records. Nobody spends their time perfectly, says Drucker: “I have yet to see a knowledge worker, regardless of rank or station, who could not consign something like a quarter of the demands on his time to the wastepaper basket without anybody’s noticing their disappearance.” I find that, without time-tracking, more than half of my time goes towards “useless” activities. (Note that is work time. Whether or not to track your social life is a topic for another time.) The goal during this step is to figure out where time is being wasted. To help figure it out, Drucker gives two questions we can ask. Question One: “What would happen if this were not done at all?” “[Ask:] What would happen if this were not done at all? And if the answer is, Nothing would happen, then obviously the conclusion is to stop doing it.” This is pretty straightforward. If you think something might be useless, take it out and see what happens. Question Two: “What activities could someone else do better?” I get stuck here a lot. I tend to think I can do things better than anybody else. Even if that’s true (it’s not), that’s not the point. The point is that I do some things better than other things. It makes sense to delegate, outsource, automate things that I am less good at so I can do more of what I excel at. Some things you can try: 3. Consolidate Your Time Step two was about finding wasted time and eliminating it. But there’s another way to manage your time: you can reorganize it. A one-hour block is not the same as ten six-minute blocks. High-level creative work needs around two hours of focus. If you’re always interrupted by meetings (or kids), no real work will happen. Drucker recommends that we “block off” at least a quarter of our day to do private, focused work: “Even one-quarter of the working day, if consolidated in large time units, is usually enough to get the important things done.” If your work is highly creative (writing, etc.), you might need to block off a lot more. One Last Thing Try doing the above three things for a few weeks. I’ve seen impressive results from it. But there’s a caveat. This is not one of the things that you just do once in a lifetime. Without periodic attention, we “decay” to our old selves, says Drucker: “…effective executives have the log run on themselves for three to four weeks at a stretch twice a year or so, on a regular schedule.” And, when you’ve made the time, consider checking out The Essential Drucker. There’s a lot more good stuff in there. Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. Originally published at marketmeditations.com. ", "title": "Peter Drucker: How to (Actually) Manage Your Time", "sentences": [{"7461": "Peter Drucker: How to (Actually) Manage Your Time"}, {"941b": "Many consider Peter Drucker the most influential thinker in the history of management."}, {"f6b7": "His prolific writings — over 30 books — have gone on to sell millions of copies and inspire young managers all over the world."}, {"0976": "That’s great. But what if you’re not a manager?"}, {"ce45": "What if you’re a freelancer, an office grunt, or just a hermit living in the woods? Can Drucker still help you?"}, {"6fd8": "You bet. There’s one thing that everyone has to manage. It’s something very close to us — ourselves."}, {"0aab": "For Drucker, this self-management starts with time."}, {"2317": "In The Essential Drucker — an excellent intro to Drucker’s prolific writings (over 30 books!) — there’s an entire chapter devoted to his method of time management."}, {"4e86": "I’ve used a variant Drucker’s method on and off for a while now. When I do use it, I am a productive beast, averaging 7–8 hours of quality work a day. When I don’t, I average 2–3 hours — no better than the average American."}, {"f74d": "Let’s take a look at Drucker’s method."}, {"03bb": "Why Time?"}, {"300a": "I have a friend who never runs out of startup ideas. Every few weeks, he sends me an excited message that goes something like this:"}, {"5751": "HEYYYY MANNN! I’ve got this AWESOME idea. Nobody’s thought of it. There’s an inefficiency in the market. All I have to do is exploit it, and BAM!!!!11!!! It’s gonna be the next Facebook!”"}, {"6f06": "Five years later, there’s still only one Facebook. My friend is still teaching English."}, {"cd40": "What’s wrong here?"}, {"33f0": "Well, a lot is wrong. But, according to Drucker, the most obvious mistake is that he is starting in the wrong place:"}, {"5f6c": "“Effective knowledge workers, in my observation, do not start with their tasks. They start with their time.”"}, {"5c14": "I see this often. People make intricate plans for diets, businesses, or world travel and, well, none of it happens. It’s a pleasant fantasy. If you want results instead of fantasies, the first step is to start executing."}, {"41e6": "And execution starts by mastering your time."}, {"99b1": "The Three Steps to Master Your Time"}, {"4c0b": "Drucker’s method can be roughly divided into three steps."}, {"a86c": "The first step is to understand."}, {"dd21": "1. Record Your Time"}, {"c481": "If you’re like me, you probably read “record your time” and thought something like this:"}, {"47df": "Pshhhh. Are you kidding? I’m me. ME. I lived it, so I know where my time goes. Why bother to track it?"}, {"02ce": "Nope."}, {"860f": "Our minds are fickle, says Drucker:"}, {"9948": "“Man is ill-equipped to manage his time. Even in total darkness, most people retain their sense of space. But even with the lights on, a few hours in a sealed room render most people incapable of estimating how much time has elapsed. […] If we rely on our memory, therefore, we do not know how time has been spent.”"}, {"642b": "The only way to stay honest is to track in the moment. There are countless ways to do this:"}, {"de2b": "“The specific method in which the record is put together need not concern us here. … The important thing is that it gets done, and that the record is made in “real” time…“"}, {"3275": "It doesn’t matter how you do it. Just make sure that you do."}, {"5934": "Here are some ways you can try:"}, {"ff3b": "Personally, I track on paper and record everything to a spreadsheet at the end of the day. Drucker recommends doing this for 3–4 weeks. I think 1 is probably enough, for starters."}, {"e938": "Either way, take your records and…"}, {"6c95": "2. Diagnose Your Time"}, {"cf9f": "The next step is to analyze your records."}, {"9423": "Nobody spends their time perfectly, says Drucker:"}, {"7744": "“I have yet to see a knowledge worker, regardless of rank or station, who could not consign something like a quarter of the demands on his time to the wastepaper basket without anybody’s noticing their disappearance.”"}, {"63e1": "I find that, without time-tracking, more than half of my time goes towards “useless” activities. (Note that is work time. Whether or not to track your social life is a topic for another time.)"}, {"e8e5": "The goal during this step is to figure out where time is being wasted. To help figure it out, Drucker gives two questions we can ask."}, {"9a66": "Question One: “What would happen if this were not done at all?”"}, {"f2cc": "“[Ask:] What would happen if this were not done at all? And if the answer is, Nothing would happen, then obviously the conclusion is to stop doing it.”"}, {"c695": "This is pretty straightforward. If you think something might be useless, take it out and see what happens."}, {"18da": "Question Two: “What activities could someone else do better?”"}, {"e36e": "I get stuck here a lot. I tend to think I can do things better than anybody else. Even if that’s true (it’s not), that’s not the point."}, {"9dda": "The point is that I do some things better than other things. It makes sense to delegate, outsource, automate things that I am less good at so I can do more of what I excel at."}, {"c1c2": "Some things you can try:"}, {"9f8e": "3. Consolidate Your Time"}, {"9366": "Step two was about finding wasted time and eliminating it. But there’s another way to manage your time: you can reorganize it."}, {"f352": "A one-hour block is not the same as ten six-minute blocks. High-level creative work needs around two hours of focus. If you’re always interrupted by meetings (or kids), no real work will happen."}, {"e710": "Drucker recommends that we “block off” at least a quarter of our day to do private, focused work:"}, {"c2a7": "“Even one-quarter of the working day, if consolidated in large time units, is usually enough to get the important things done.”"}, {"6d63": "If your work is highly creative (writing, etc.), you might need to block off a lot more."}, {"bcb6": "One Last Thing"}, {"99f5": "Try doing the above three things for a few weeks. I’ve seen impressive results from it."}, {"152f": "But there’s a caveat."}, {"d16b": "This is not one of the things that you just do once in a lifetime. Without periodic attention, we “decay” to our old selves, says Drucker:"}, {"1ba6": "“…effective executives have the log run on themselves for three to four weeks at a stretch twice a year or so, on a regular schedule.”"}, {"3306": "And, when you’ve made the time, consider checking out The Essential Drucker. There’s a lot more good stuff in there."}, {"7f5e": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}, {"4c0d": "Originally published at marketmeditations.com."}], "child": "296_1\t296_2\t296_3\t296_4\t296_5\t296_6\t296_7\t296_8\t296_9\t296_10\t296_11\t296_12\t296_13296_1\t296_2\t296_3\t296_4\t296_5\t296_6\t296_7\t296_8\t296_9\t296_10\t296_11\t296_12\t296_13296_1\t296_2\t296_3\t296_4\t296_5\t296_6\t296_7\t296_8\t296_9\t296_10\t296_11\t296_12\t296_13"}