{"name": "297", "parent": "", "content": "Advice On Anxiety No One Tells You “Tomorrow and plans for tomorrow can have no significance at all unless you are in full contact with the reality of the present, since it is in the present and only in the present that you live.” — Alan Watts Enough is enough. You and I need to have a conversation. Why is it that some people heal their anxiety and some don’t? Is it because of their race? Or their geographic location? Maybe it’s because they make more money? No, no. Those don’t sound right. Okay, so what is it then that leaves some people debilitated by their “disorder” and allows others to break free from it? In my opinion, the difference comes down to their ability to ignore the standard prescriptions. Their belief that the cure lies within them, not outside of them. Their ability to not be the victim of their situation. They had to view their “condition” as a challenge that requires strategy, skill, and wisdom to complete. It would not have been possible to overcome their anxiety if they had believed it could never be cured. After spending months healing myself and learning from those who had gone before me, I came across some uncanny advice that I wish I would have learned sooner. Every lesson may not be for you, but I hope that you will find some more healing from this piece. Hiding Behind Labels Is Killing You The majority of people that reach out to me tell me that they have been diagnosed with an anxiety disorder. They shoot out new and elongated acronyms that are supposed to describe what is going on inside their mind. Now, I’m sure these labels help some people come to grips with their mental state, but for the majority of us, all these labels do is kill our chance of healing. If you tell yourself that you are an anxious person, then that label becomes your identity, making it next to impossible to ever break free. Anxiety is an emotion, not an identity. Realize that the emotion will always be there, but that you don’t have to be its slave. Lean Into Your Fear After months of working at a job I hated, I quit and moved to an entirely new city. The thought of doing this scared the shit out of me, so I knew it had to be done. I feared to be alone in a new city with my “condition.” What if I had a panic attack? Would I be close enough to a hospital? Who would I call? Oh, the pleasures of neuroses. Being viewed less successful by taking a job with a low salary terrified me. But mostly, I feared the idea of getting back on the subway where I had my first panic attack. Lo in behold, the moment I stepped into what I feared most I began to gain confidence in my ability to tackle the next challenge. I lived a full year in New York, and it was a year of tremendous growth and healing. If I never stepped into that fear, I may still be the slave of my anxiety. But because I took that leap of faith, I’m now able to be in control. Panic Is Controllable For eighteen months straight, I feared panic. It was brutal. I was always on edge. On the subway. At work. In meetings. The fear of panic peeping its head up and exploding my insides was an ever-present thought, just enough off the surface for me to live a pseudo-normal life. Then one day I had had enough. I knew that there had to be someone else out there that had learned to stop panic attacks naturally. As dumb as it sounds, I had never thought to look for resources that could help me. I wanted to do it on my own. And I thought I could. I couldn’t. After mere minutes of searching on the internet, I came across thousands of great, free resources on stopping panic attacks. Why had I never thought to research before? Well, that has to deal with the next piece of advice. Do Your Own Research First off, I know the internet can be a terrifying place filled with fake news and unreliable sources, but books, on the other hand, tend to be less so. I wish I would have realized that all of the answers to my questions were in a book somewhere. All I had to do was look. After I had my first panic attack, a close friend warned me against reading about anxiety. She said it had upset her and feared it would do the same to me. So I took her advice. It took me a year and a half before I discovered the incredible amount of resources out there to help people going through what I was experiencing. It was a revelation that was paramount to my healing. Do your research. If you are struggling with something, I guarantee you someone has gone through something similar and written about it. Use the power of the internet to find these resources and connect with the creators. Please, if you haven’t already, search Amazon for books on healing anxiety. I have listed some favorites below. Play It Away — Charlie Hoehn Mindful Way Through Anxiety — Susan Orsillo & Lizabeth Roemer Wisdom of Insecurity — Alan Watts The Five W’s The five W’s are the base of a good story line. They can also be used to highlight the areas of your life they may be in misalignment. Who: do you spend most of your time with? Are they adding stress or aiding your growth? No one is sacred here. Remove anyone that is not helping you heal or else you may always stay anxious. What: are you working on/do you do between 8–6? What do you spend your time doing? What do you consume through your five senses? What are you waiting for? What is holding you back? What do you believe that is keeping you from healing? When: do you go to bed? When do you wake up? When do you leave work? When are you going to make a move? When are you going to start healing yourself? When were you the happiest? Why: are you in your job? Why do you feel like you need to get the next thing? Why do you need external validation? Why are you reading this article? Why do you do anything that you do? Where: in the world do you live? Where do you sleep? Where do you work? Where are you trying to get to? Where is this path leading you? Where do you want to be? I have found a close examination of the five W’s to be revealing of where in my life I need to make significant changes. Often it is right in front of our eyes. You Can Heal Without Drugs I followed the typical American path. I had a problem, so I went to a doctor to get the easy fix. Instead of looking at the root of the problem, I wanted medication to heal the branches. Of course, this did nothing to solve the actual problem causing my anxiety. Rather, it exacerbated it. I felt lost and foggy. I needed a new route to healing that didn’t involve medication. And I found one by looking at the problem itself, me. My life was in misalignment in almost every facet. I was eating poorly. I was getting terrible sleep. Working all the time with an insatiable desire to “be someone.” I had alienated myself from those closest to me. So, piece by piece, I started patching up the holes in my life. And day by day I began to feel less anxious. Until one day I felt normal again. I’m not saying you should get off your medication or never take them. I’m just urging you to use it as a supplement to other lifestyle changes. There are other ways, more sustainable ways, to heal yourself without reliance on medication. You have the power. Radical Self Introspection Is a Must; Not an Option It’s funny that we humans spend so much time preparing to live, but rarely live. The living is brutal. Knowing your true self is not a fun endeavor as some portray it to be. You will have to wrestle with darkness as you go down and in. But… It is a critical step that you must take on your path to healing. You can learn so much by looking deeply into your inner life. Self-awareness is a force multiplier. For the next 21 days pose this question to yourself and try to answer it without thinking: What do you want? You will be surprised by what you find. It Will Take Time, But It Will Be Worth It The climb out of the pit takes time. At times you will slip and fall a couple of lengths. But keep climbing. Even if it feels like you are walking in quicksand, keep walking. It will take longer than you want it to, but the journey is worth it. Anxiety Is Your Friend In Parker Palmer’s Let Your Life Speak, he articulates a great analogy for associating with negative emotions. In a conversation with a trusted counselor, he was asked if he had ever viewed depression as a friend. Someone who wanted to ground him, rather than kill him. He hadn’t. He then goes on to explain how he realized that this friend had been there his whole life. Calling him to his true self. Trying to get his attention. But he always had ignored it, focusing on ambition and external validation, instead of inner peace and vocation. By ignoring his friend for so long, it was only possible to get his attention by dropping a nuclear bomb on Palmer’s head. This bomb was depression. Palmer’s story speaks so true to my life. My friend had also always been there, and I too had always ignored him. For fear that listening to this inner voice would leave me at odds with the success I so longed to achieve. Then, just like Palmer’s story, my friend couldn’t watch this destruction anymore and dropped a nuclear bomb, anxiety, on my head. The bomb worked. I woke up. I now view anxiety as my friend. Someone that is trying to pull me to the live I am meant to live, not the one I think I “should” be living. It’s my very own bullshit detector that knows me more than I do. What is your friend trying to tell you? Have there been times early on in your life when it sought to get your attention, but you didn’t listen? Maybe you got fired, or you had a sudden deep inspiration or left a relationship? If so, look deeper. Did you take it as a sign and change your life, or did you let it pass and move on living almost the same way? Listen to your inner self. It’s your true self. It knows the path that you long to take. Stop being afraid to follow it. You Are Not Alone Last, and most importantly, the advice that everyone fails to tell you when you are in the depths of this type of darkness is that YOU ARE NOT ALONE. A vast majority of people go through spells of depression and anxiety sometime during their life. It may seem that your experience is one of a kind, but I promise you it is not. There are so many people out there willing to help you and show you the way. Individuals who have been where you are today. Take their help. Get better. So you can give the world your gifts. We are waiting for you! Go Deeper Are you ready to wake up, get more focused, and find more happiness in your life? If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness! If you are ready to take back control of your life and start living above stress and overwhelm… Sign Up Here! One last thing… If you liked this article, click the💚 below so other people will see it here on Medium. Originally published at www.fullyrichlife.com on April 9, 2017. ", "title": "Advice On Anxiety No One Tells You", "sentences": [{"2053": "Advice On Anxiety No One Tells You"}, {"2a6f": "“Tomorrow and plans for tomorrow can have no significance at all unless you are in full contact with the reality of the present, since it is in the present and only in the present that you live.” — Alan Watts"}, {"67f9": "Enough is enough. You and I need to have a conversation."}, {"8a58": "Why is it that some people heal their anxiety and some don’t?"}, {"b517": "Is it because of their race? Or their geographic location? Maybe it’s because they make more money?"}, {"bf99": "No, no. Those don’t sound right."}, {"3109": "Okay, so what is it then that leaves some people debilitated by their “disorder” and allows others to break free from it?"}, {"16bc": "In my opinion, the difference comes down to their ability to ignore the standard prescriptions."}, {"fc1d": "Their belief that the cure lies within them, not outside of them."}, {"5bdb": "Their ability to not be the victim of their situation."}, {"20ef": "They had to view their “condition” as a challenge that requires strategy, skill, and wisdom to complete. It would not have been possible to overcome their anxiety if they had believed it could never be cured."}, {"e569": "After spending months healing myself and learning from those who had gone before me, I came across some uncanny advice that I wish I would have learned sooner. Every lesson may not be for you, but I hope that you will find some more healing from this piece."}, {"d66e": "Hiding Behind Labels Is Killing You"}, {"7a13": "The majority of people that reach out to me tell me that they have been diagnosed with an anxiety disorder. They shoot out new and elongated acronyms that are supposed to describe what is going on inside their mind."}, {"4ff8": "Now, I’m sure these labels help some people come to grips with their mental state, but for the majority of us, all these labels do is kill our chance of healing."}, {"649a": "If you tell yourself that you are an anxious person, then that label becomes your identity, making it next to impossible to ever break free."}, {"192b": "Anxiety is an emotion, not an identity. Realize that the emotion will always be there, but that you don’t have to be its slave."}, {"4ab8": "Lean Into Your Fear"}, {"473c": "After months of working at a job I hated, I quit and moved to an entirely new city. The thought of doing this scared the shit out of me, so I knew it had to be done."}, {"0a3e": "I feared to be alone in a new city with my “condition.” What if I had a panic attack? Would I be close enough to a hospital? Who would I call?"}, {"2dcd": "Oh, the pleasures of neuroses."}, {"583f": "Being viewed less successful by taking a job with a low salary terrified me."}, {"d325": "But mostly, I feared the idea of getting back on the subway where I had my first panic attack."}, {"5304": "Lo in behold, the moment I stepped into what I feared most I began to gain confidence in my ability to tackle the next challenge. I lived a full year in New York, and it was a year of tremendous growth and healing."}, {"055b": "If I never stepped into that fear, I may still be the slave of my anxiety. But because I took that leap of faith, I’m now able to be in control."}, {"a1ce": "Panic Is Controllable"}, {"10b9": "For eighteen months straight, I feared panic. It was brutal. I was always on edge."}, {"539c": "On the subway. At work. In meetings. The fear of panic peeping its head up and exploding my insides was an ever-present thought, just enough off the surface for me to live a pseudo-normal life."}, {"c428": "Then one day I had had enough. I knew that there had to be someone else out there that had learned to stop panic attacks naturally."}, {"f858": "As dumb as it sounds, I had never thought to look for resources that could help me. I wanted to do it on my own. And I thought I could."}, {"fbf6": "I couldn’t."}, {"53b2": "After mere minutes of searching on the internet, I came across thousands of great, free resources on stopping panic attacks."}, {"b670": "Why had I never thought to research before? Well, that has to deal with the next piece of advice."}, {"2f9b": "Do Your Own Research"}, {"d51c": "First off, I know the internet can be a terrifying place filled with fake news and unreliable sources, but books, on the other hand, tend to be less so. I wish I would have realized that all of the answers to my questions were in a book somewhere. All I had to do was look."}, {"940b": "After I had my first panic attack, a close friend warned me against reading about anxiety. She said it had upset her and feared it would do the same to me. So I took her advice."}, {"1817": "It took me a year and a half before I discovered the incredible amount of resources out there to help people going through what I was experiencing. It was a revelation that was paramount to my healing."}, {"4dff": "Do your research. If you are struggling with something, I guarantee you someone has gone through something similar and written about it. Use the power of the internet to find these resources and connect with the creators."}, {"c6ce": "Please, if you haven’t already, search Amazon for books on healing anxiety. I have listed some favorites below."}, {"ddac": "Play It Away — Charlie Hoehn"}, {"3c73": "Mindful Way Through Anxiety — Susan Orsillo & Lizabeth Roemer"}, {"536b": "Wisdom of Insecurity — Alan Watts"}, {"2f5f": "The Five W’s"}, {"8635": "The five W’s are the base of a good story line. They can also be used to highlight the areas of your life they may be in misalignment."}, {"78eb": "Who: do you spend most of your time with? Are they adding stress or aiding your growth? No one is sacred here. Remove anyone that is not helping you heal or else you may always stay anxious."}, {"b2ca": "What: are you working on/do you do between 8–6? What do you spend your time doing? What do you consume through your five senses? What are you waiting for? What is holding you back? What do you believe that is keeping you from healing?"}, {"cca5": "When: do you go to bed? When do you wake up? When do you leave work? When are you going to make a move? When are you going to start healing yourself? When were you the happiest?"}, {"614a": "Why: are you in your job? Why do you feel like you need to get the next thing? Why do you need external validation? Why are you reading this article? Why do you do anything that you do?"}, {"c54e": "Where: in the world do you live? Where do you sleep? Where do you work? Where are you trying to get to? Where is this path leading you? Where do you want to be?"}, {"e855": "I have found a close examination of the five W’s to be revealing of where in my life I need to make significant changes. Often it is right in front of our eyes."}, {"6d6e": "You Can Heal Without Drugs"}, {"742b": "I followed the typical American path."}, {"1a17": "I had a problem, so I went to a doctor to get the easy fix. Instead of looking at the root of the problem, I wanted medication to heal the branches. Of course, this did nothing to solve the actual problem causing my anxiety. Rather, it exacerbated it. I felt lost and foggy."}, {"9f79": "I needed a new route to healing that didn’t involve medication. And I found one by looking at the problem itself, me."}, {"6326": "My life was in misalignment in almost every facet. I was eating poorly. I was getting terrible sleep. Working all the time with an insatiable desire to “be someone.” I had alienated myself from those closest to me."}, {"9285": "So, piece by piece, I started patching up the holes in my life. And day by day I began to feel less anxious. Until one day I felt normal again."}, {"e1a4": "I’m not saying you should get off your medication or never take them. I’m just urging you to use it as a supplement to other lifestyle changes. There are other ways, more sustainable ways, to heal yourself without reliance on medication."}, {"d47e": "You have the power."}, {"04ec": "Radical Self Introspection Is a Must; Not an Option"}, {"202e": "It’s funny that we humans spend so much time preparing to live, but rarely live. The living is brutal. Knowing your true self is not a fun endeavor as some portray it to be. You will have to wrestle with darkness as you go down and in."}, {"9c58": "But…"}, {"70ce": "It is a critical step that you must take on your path to healing. You can learn so much by looking deeply into your inner life. Self-awareness is a force multiplier."}, {"e9cf": "For the next 21 days pose this question to yourself and try to answer it without thinking:"}, {"28aa": "What do you want?"}, {"1b29": "You will be surprised by what you find."}, {"00d6": "It Will Take Time, But It Will Be Worth It"}, {"36e1": "The climb out of the pit takes time. At times you will slip and fall a couple of lengths. But keep climbing. Even if it feels like you are walking in quicksand, keep walking."}, {"b0ee": "It will take longer than you want it to, but the journey is worth it."}, {"3c84": "Anxiety Is Your Friend"}, {"ed10": "In Parker Palmer’s Let Your Life Speak, he articulates a great analogy for associating with negative emotions. In a conversation with a trusted counselor, he was asked if he had ever viewed depression as a friend. Someone who wanted to ground him, rather than kill him."}, {"3c85": "He hadn’t."}, {"72ef": "He then goes on to explain how he realized that this friend had been there his whole life. Calling him to his true self. Trying to get his attention. But he always had ignored it, focusing on ambition and external validation, instead of inner peace and vocation. By ignoring his friend for so long, it was only possible to get his attention by dropping a nuclear bomb on Palmer’s head."}, {"dff6": "This bomb was depression."}, {"a3c4": "Palmer’s story speaks so true to my life. My friend had also always been there, and I too had always ignored him. For fear that listening to this inner voice would leave me at odds with the success I so longed to achieve. Then, just like Palmer’s story, my friend couldn’t watch this destruction anymore and dropped a nuclear bomb, anxiety, on my head."}, {"a44f": "The bomb worked. I woke up."}, {"338d": "I now view anxiety as my friend. Someone that is trying to pull me to the live I am meant to live, not the one I think I “should” be living. It’s my very own bullshit detector that knows me more than I do."}, {"4b0e": "What is your friend trying to tell you?"}, {"8030": "Have there been times early on in your life when it sought to get your attention, but you didn’t listen? Maybe you got fired, or you had a sudden deep inspiration or left a relationship?"}, {"f155": "If so, look deeper."}, {"10e2": "Did you take it as a sign and change your life, or did you let it pass and move on living almost the same way?"}, {"a9b9": "Listen to your inner self. It’s your true self. It knows the path that you long to take. Stop being afraid to follow it."}, {"450c": "You Are Not Alone"}, {"f631": "Last, and most importantly, the advice that everyone fails to tell you when you are in the depths of this type of darkness is that YOU ARE NOT ALONE."}, {"815c": "A vast majority of people go through spells of depression and anxiety sometime during their life. It may seem that your experience is one of a kind, but I promise you it is not."}, {"ca2e": "There are so many people out there willing to help you and show you the way. Individuals who have been where you are today. Take their help. Get better. So you can give the world your gifts. We are waiting for you!"}, {"8b78": "Go Deeper"}, {"2df0": "Are you ready to wake up, get more focused, and find more happiness in your life?"}, {"c4f9": "If so, sign up for my free 21 Day Mindfulness Email Course. I’ll be sending you an email every day that will help you reduce stress, increase focus, and find more happiness!"}, {"2536": "If you are ready to take back control of your life and start living above stress and overwhelm…"}, {"6f22": "Sign Up Here!"}, {"5a33": "One last thing…"}, {"336f": "If you liked this article, click the💚 below so other people will see it here on Medium."}, {"e12f": "Originally published at www.fullyrichlife.com on April 9, 2017."}], "child": "297_1\t297_2\t297_3\t297_4\t297_5\t297_6\t297_7\t297_8\t297_9\t297_10\t297_11\t297_12\t297_13\t297_14\t297_15\t297_16\t297_17\t297_18\t297_19\t297_20\t297_21\t297_22\t297_23\t297_24\t297_25297_1\t297_2\t297_3\t297_4\t297_5\t297_6\t297_7\t297_8\t297_9\t297_10\t297_11\t297_12\t297_13\t297_14\t297_15\t297_16\t297_17\t297_18\t297_19\t297_20\t297_21\t297_22\t297_23\t297_24\t297_25"}