{"name": "299", "parent": "", "content": "The Ultimate Guide to Achieving Big Goals Do you have big goals you long to achieve? Do you promise yourself someday you’ll get started? Someday you’ll make it happen? Someday the time will be right? There’s an old Chinese proverb that says, “The best time to plant a tree was twenty years ago. The second best time is now.” In this post, you’re going to learn a wholistic approach for achieving big goals. If you’ve tried before and failed, chances are you were missing a crucial ingredient for success. This post will give you a well-rounded framework to follow. Better than that, I’m going to help you plan out your goal on a handy notecard so you can stay focused and motivated. (Shoutout to my bookkeeper Alex Hubenthal, who inspired this notecard method). So grab a notecard or cut one from a piece of cardstock paper. Then write today’s date in the top right corner. It should look something like this: Step 1: Identify what. If you chase two rabbits, both will escape. — Chinese Proverb. When I first launched my blog, I remember spending three hours writing the about page. I scolded myself thinking, “What is wrong with you, Kyle? How are a few hundred words taking you THREE HOURS to write?” That’s when the epiphany hit me. The reason I spent three hours writing an about page for my blog… I didn’t know what my blog was about. I thought I knew. I certainly had a general idea. But when it came time to put something specific in writing, I realized I wasn’t quite clear. Chances are, you’re bumping into a similar problem in pursuit of your goals. You have a general idea of what you want, but you still need to pinpoint it. Maybe you think “I want to be a writer.” But that’s hardly a goal. Do you want to write a poem, a book, or a blog? Fiction or non? The questions go on and on. Knowing what you want is the first step to achieving it. Skip this step and you have nowhere to go. So take the time to really ask yourself, “What do I want to accomplish?” Make sure your goal is specific enough that you’ll know the moment you succeed. Exercise: On the front of your notecard, write exactly what you want to accomplish using the following template: “By [INSERT BLANK SPACE] I will have [WRITE YOUR GOAL].” Your notecard should look something like this: Step 2. Identify when. A goal is a dream with a deadline. — Napoleon Hill Think about the goal you just identified. How long have you wanted to accomplish it? Chances are, if it’s a big goal, you’ve been wanting it for years. You’ve had the desire but lacked a clear deadline. Pick a date that is both realistic and challenging. Too little time will tempt you to give up. Too much time will invite you to slack off. Pro tip: When you’re setting a deadline for a goal, don’t pick December 31st unless that’s really the intersection of realistic and challenging. I got my date by dividing my goal of 50 posts into two posts per week (25 weeks) and finding that date on the calendar. Exercise: On your notecard, fill in the space you left for the date. It should look something like this: Step 3. Identify how. Successful people are simply those with successful habits. — Brian Tracy Even with a deadline, a goal without a plan is doomed to fail. And the only thing worse than no plan…is a complicated plan. Before you start chasing a big goal, you should identify the key habits you’ll need to succeed. Limit yourself to two or three. For example, if your goal is to become a popular blogger, writing weekly or bi-weekly is a habit you might consider. When you’re chasing a big goal, the kind of goal that takes months or years to accomplish, your biggest enemy will be complacency — letting days go by without any forward motion. The single best strategy to set yourself up for daily progress is routine. And the #1 hack for creating routine is called Implementation Intentions. At least, that’s what researchers, call it. I prefer my friend Lonnie’s label: The When/Then Strategy. The When/Then Strategy establishes new routines by building them onto existing routines. Think about the activities you do daily. You get out of bed, brush your teeth, eat meals. You might go to work or drive your kids to school. These are all habits you never break, and the When/Then Strategy builds on this solid foundation. For example, if your goal is to write a book, you might resolve, “WHEN I finish putting the kids to bed THEN I’ll write for half an hour.” Or, WHEN I’m driving to work every morning THEN I’ll listen to a book or podcast about writing. The When/Then Strategy helps you form routines that fend off inactivity. Exercise: Write your #1 When/Then on the bottom half of your card. Pick a routine that is so fundamental to your success it deserves your top priority. It should look something like this: Step 4: Identify where. There is no problem that doesn’t have some underlying need for more optimism, stamina, resilience and collaboration. And games are, I believe, the best platform we have for providing that. —Jane McGonigal Progress sparks momentum. And to persevere in the pursuit of big goals, you’ll need momentum on your side. One reason games like Angry Birds are so addictive is the pride you feel after beating a level and moving forward to the next one. You can harness some of this addictive energy by breaking your goal into levels. Deciding where you’ll pause to celebrate on your journey to success. For example, if your goal is to write a book, your milestones might be the different chapters you’ll need to write. If your goal is to build an email list, the milestones might be 100 subscribers, 250 subscribers, 500 subscribers, etc. What you don’t want is an all-or-nothing scenario, where you’ve failed until you finally win. Small wins build confidence and strengthen your odds of success. But these crucial victories will slip by unnoticed unless you watch for them. Where will you pause to celebrate? Exercise: Plot out 4–5 milestones for your goal on the bottom of your note card. The bigger the goal, the more milestones you should have. Include your start date at the beginning and your deadline at the end. It should look something like this: Step 5: Identify why. The secret of our success is that we never, never give up.— Wilma Mankiller The key to motivation is simple… Always have more than one reason to keep going. Imagine driving home from work and experiencing an intense craving for something salty. What foods might you stop and buy? You could grab chips, peanuts, french fries, chicken nuggets…the list goes on an on. But what if you were craving something salty, warm, soft, toasted, and bready? You’d need to find a pretzel. Chips, fries, peanuts — none of that would satisfy your craving because none of those foods have all the ingredients you’re looking for. My point is this: When you have only one motivator, you’re set up to fail. Because there will be myriad substitutes to scratch that itch than working hard towards your goal. You’ll find easier ways to make money than launching a business. You’ll find easier ways to help others than founding a charity. You’ll find easier ways to be creative than writing an entire novel. But when you’re craving an accomplishment driven by a unique recipe of motivators, your goal will have no rivals. In other words… Don’t crave salt. Crave pretzels. Exercise: On the back of your card, split the card with a vertical line, and on the left side write 5 reasons you’re motivated to hit your goal. Pro tip: Think about how your life will improve after you succeed. What skills will you learn? What opportunities will you create? How will your success help the people you love? What will you miss out on if you quit too soon? Your note card should look like this: Step 6: Identify Who. Two people are better off than one, for they can help each other succeed. If one person falls, the other can reach out and help. But someone who falls alone is in real trouble […] A person standing alone can be attacked and defeated, but two can stand back-to-back and conquer... — Ecclesiastes 4:9–10,12 NLT If you want to minimize your odds of success, chase your goal alone. Trust me. I’ve tried. You need the support, accountability, and advice of friends to persevere in pursuit of your goal. Currently, if I run into trouble, I have roughly 17 people I can call for help and encouragement. These friends cheer me on when I’m stuck, coach me when I’m lost, and celebrate with me when I reach new milestones. I feel incredibly blessed to have so many amazing men and women supporting me. And I realize not everyone can relate. But the point I’m driving home is you need a community. You need to find and help people who will help you in return. And when you feel like you have enough people on your team, go find a few more. You’ll need all of them. I promise. Exercise: Write down the names of 3–5 people you can call when you get stuck or need support. Your card should look like this: Step 7: Make a commitment Now you have a game plan for achieving big goals that have eluded you in the past. This system has brought me great results so I wanted to share it with you. I keep my notecard on my nightstand so I can read it out loud every morning when I wake up and every night before I go to bed. You should try it too. This simple ritual keeps me focused and reminds me that I have the power to work for what I want. I don’t have to surrender my dreams to my doubts. Final exercise: Join me in assembling a diverse community of people who dream big dreams and work hard to achieve them. Want to go deeper? Do you have big goals you long to achieve? The biggest threat to your success is simply giving up. Become a finisher with my short book QuitterProof: The 5 Beliefs of Highly Successful People. Download your free copy right here. ", "title": "The Ultimate Guide to Achieving Big Goals", "sentences": [{"7210": "The Ultimate Guide to Achieving Big Goals"}, {"65a2": "Do you have big goals you long to achieve?"}, {"2fc4": "Do you promise yourself someday you’ll get started? Someday you’ll make it happen? Someday the time will be right?"}, {"4491": "There’s an old Chinese proverb that says, “The best time to plant a tree was twenty years ago. The second best time is now.”"}, {"a9f7": "In this post, you’re going to learn a wholistic approach for achieving big goals."}, {"f471": "If you’ve tried before and failed, chances are you were missing a crucial ingredient for success. This post will give you a well-rounded framework to follow."}, {"d749": "Better than that, I’m going to help you plan out your goal on a handy notecard so you can stay focused and motivated."}, {"c0ba": "(Shoutout to my bookkeeper Alex Hubenthal, who inspired this notecard method)."}, {"5333": "So grab a notecard or cut one from a piece of cardstock paper. Then write today’s date in the top right corner."}, {"b94a": "It should look something like this:"}, {"fdc6": "Step 1: Identify what."}, {"4553": "If you chase two rabbits, both will escape. — Chinese Proverb."}, {"ddbc": "When I first launched my blog, I remember spending three hours writing the about page."}, {"c287": "I scolded myself thinking, “What is wrong with you, Kyle? How are a few hundred words taking you THREE HOURS to write?”"}, {"4430": "That’s when the epiphany hit me. The reason I spent three hours writing an about page for my blog…"}, {"725a": "I didn’t know what my blog was about."}, {"56e7": "I thought I knew. I certainly had a general idea. But when it came time to put something specific in writing, I realized I wasn’t quite clear."}, {"694c": "Chances are, you’re bumping into a similar problem in pursuit of your goals. You have a general idea of what you want, but you still need to pinpoint it."}, {"6e9d": "Maybe you think “I want to be a writer.”"}, {"9c33": "But that’s hardly a goal."}, {"d6a4": "Do you want to write a poem, a book, or a blog?"}, {"bc00": "Fiction or non?"}, {"457d": "The questions go on and on."}, {"9e9c": "Knowing what you want is the first step to achieving it. Skip this step and you have nowhere to go."}, {"3f27": "So take the time to really ask yourself, “What do I want to accomplish?”"}, {"7f52": "Make sure your goal is specific enough that you’ll know the moment you succeed."}, {"51f5": "Exercise: On the front of your notecard, write exactly what you want to accomplish using the following template: “By [INSERT BLANK SPACE] I will have [WRITE YOUR GOAL].”"}, {"ed56": "Your notecard should look something like this:"}, {"6412": "Step 2. Identify when."}, {"b5b3": "A goal is a dream with a deadline. — Napoleon Hill"}, {"d694": "Think about the goal you just identified. How long have you wanted to accomplish it?"}, {"d8ef": "Chances are, if it’s a big goal, you’ve been wanting it for years. You’ve had the desire but lacked a clear deadline."}, {"3eaf": "Pick a date that is both realistic and challenging. Too little time will tempt you to give up. Too much time will invite you to slack off."}, {"c66d": "Pro tip: When you’re setting a deadline for a goal, don’t pick December 31st unless that’s really the intersection of realistic and challenging. I got my date by dividing my goal of 50 posts into two posts per week (25 weeks) and finding that date on the calendar."}, {"b116": "Exercise: On your notecard, fill in the space you left for the date."}, {"eac4": "It should look something like this:"}, {"4a98": "Step 3. Identify how."}, {"f2be": "Successful people are simply those with successful habits. — Brian Tracy"}, {"803f": "Even with a deadline, a goal without a plan is doomed to fail. And the only thing worse than no plan…is a complicated plan."}, {"ea0e": "Before you start chasing a big goal, you should identify the key habits you’ll need to succeed. Limit yourself to two or three."}, {"743a": "For example, if your goal is to become a popular blogger, writing weekly or bi-weekly is a habit you might consider."}, {"0190": "When you’re chasing a big goal, the kind of goal that takes months or years to accomplish, your biggest enemy will be complacency — letting days go by without any forward motion."}, {"f70b": "The single best strategy to set yourself up for daily progress is routine. And the #1 hack for creating routine is called Implementation Intentions. At least, that’s what researchers, call it. I prefer my friend Lonnie’s label: The When/Then Strategy."}, {"e50d": "The When/Then Strategy establishes new routines by building them onto existing routines."}, {"f5d8": "Think about the activities you do daily. You get out of bed, brush your teeth, eat meals. You might go to work or drive your kids to school. These are all habits you never break, and the When/Then Strategy builds on this solid foundation."}, {"e3f1": "For example, if your goal is to write a book, you might resolve, “WHEN I finish putting the kids to bed THEN I’ll write for half an hour.”"}, {"eed2": "Or, WHEN I’m driving to work every morning THEN I’ll listen to a book or podcast about writing."}, {"c366": "The When/Then Strategy helps you form routines that fend off inactivity."}, {"6873": "Exercise: Write your #1 When/Then on the bottom half of your card. Pick a routine that is so fundamental to your success it deserves your top priority."}, {"5966": "It should look something like this:"}, {"ffd1": "Step 4: Identify where."}, {"081c": "There is no problem that doesn’t have some underlying need for more optimism, stamina, resilience and collaboration. And games are, I believe, the best platform we have for providing that. —Jane McGonigal"}, {"1d39": "Progress sparks momentum. And to persevere in the pursuit of big goals, you’ll need momentum on your side."}, {"3a4e": "One reason games like Angry Birds are so addictive is the pride you feel after beating a level and moving forward to the next one."}, {"18f1": "You can harness some of this addictive energy by breaking your goal into levels. Deciding where you’ll pause to celebrate on your journey to success."}, {"2726": "For example, if your goal is to write a book, your milestones might be the different chapters you’ll need to write."}, {"bb58": "If your goal is to build an email list, the milestones might be 100 subscribers, 250 subscribers, 500 subscribers, etc."}, {"244a": "What you don’t want is an all-or-nothing scenario, where you’ve failed until you finally win."}, {"470d": "Small wins build confidence and strengthen your odds of success. But these crucial victories will slip by unnoticed unless you watch for them. Where will you pause to celebrate?"}, {"12e5": "Exercise: Plot out 4–5 milestones for your goal on the bottom of your note card. The bigger the goal, the more milestones you should have. Include your start date at the beginning and your deadline at the end."}, {"4164": "It should look something like this:"}, {"0236": "Step 5: Identify why."}, {"c824": "The secret of our success is that we never, never give up.— Wilma Mankiller"}, {"5d51": "The key to motivation is simple…"}, {"cdc2": "Always have more than one reason to keep going."}, {"9c17": "Imagine driving home from work and experiencing an intense craving for something salty."}, {"06d0": "What foods might you stop and buy? You could grab chips, peanuts, french fries, chicken nuggets…the list goes on an on."}, {"bee4": "But what if you were craving something salty, warm, soft, toasted, and bready?"}, {"c1f9": "You’d need to find a pretzel."}, {"2ccc": "Chips, fries, peanuts — none of that would satisfy your craving because none of those foods have all the ingredients you’re looking for."}, {"8a86": "My point is this:"}, {"8999": "When you have only one motivator, you’re set up to fail. Because there will be myriad substitutes to scratch that itch than working hard towards your goal."}, {"24ad": "You’ll find easier ways to make money than launching a business."}, {"5293": "You’ll find easier ways to help others than founding a charity."}, {"2d09": "You’ll find easier ways to be creative than writing an entire novel."}, {"d8df": "But when you’re craving an accomplishment driven by a unique recipe of motivators, your goal will have no rivals."}, {"5a52": "In other words…"}, {"8053": "Don’t crave salt. Crave pretzels."}, {"94b4": "Exercise: On the back of your card, split the card with a vertical line, and on the left side write 5 reasons you’re motivated to hit your goal."}, {"923c": "Pro tip: Think about how your life will improve after you succeed. What skills will you learn? What opportunities will you create? How will your success help the people you love? What will you miss out on if you quit too soon?"}, {"ecd7": "Your note card should look like this:"}, {"a2e7": "Step 6: Identify Who."}, {"c46b": "Two people are better off than one, for they can help each other succeed. If one person falls, the other can reach out and help. But someone who falls alone is in real trouble […] A person standing alone can be attacked and defeated, but two can stand back-to-back and conquer... — Ecclesiastes 4:9–10,12 NLT"}, {"94b7": "If you want to minimize your odds of success, chase your goal alone."}, {"ede5": "Trust me. I’ve tried."}, {"3df1": "You need the support, accountability, and advice of friends to persevere in pursuit of your goal."}, {"00b0": "Currently, if I run into trouble, I have roughly 17 people I can call for help and encouragement."}, {"b7a6": "These friends cheer me on when I’m stuck, coach me when I’m lost, and celebrate with me when I reach new milestones."}, {"aa1c": "I feel incredibly blessed to have so many amazing men and women supporting me. And I realize not everyone can relate. But the point I’m driving home is you need a community."}, {"9566": "You need to find and help people who will help you in return."}, {"4564": "And when you feel like you have enough people on your team, go find a few more. You’ll need all of them. I promise."}, {"b718": "Exercise: Write down the names of 3–5 people you can call when you get stuck or need support."}, {"acc1": "Your card should look like this:"}, {"1e47": "Step 7: Make a commitment"}, {"7264": "Now you have a game plan for achieving big goals that have eluded you in the past."}, {"c8da": "This system has brought me great results so I wanted to share it with you."}, {"5a24": "I keep my notecard on my nightstand so I can read it out loud every morning when I wake up and every night before I go to bed."}, {"5fc4": "You should try it too. This simple ritual keeps me focused and reminds me that I have the power to work for what I want. I don’t have to surrender my dreams to my doubts."}, {"1ba5": "Final exercise:"}, {"c215": "Join me in assembling a diverse community of people who dream big dreams and work hard to achieve them."}, {"d5b8": "Want to go deeper?"}, {"edf6": "Do you have big goals you long to achieve? The biggest threat to your success is simply giving up."}, {"c1de": "Become a finisher with my short book QuitterProof: The 5 Beliefs of Highly Successful People."}, {"edbf": "Download your free copy right here."}], "child": "299_1\t299_2\t299_3\t299_4\t299_5\t299_6\t299_7"}