{"name": "303", "parent": "", "content": "How I Beat Procrastination: Do It Today, Not Tomorrow Every time I put off a decision, hit the snooze button, skipped the gym, or didn’t complete my tasks because I didn’t feel like it, I always had an explanation for my continual procrastination. I told myself I was tired. Or that it could wait until tomorrow. Who cares if you put off something, right? Well, you should care. Because you’re the one who’s responsible for your life. Too often, we look at productivity tips, apps or tools as the magic answer to our problems. But that also means we allow ourselves to blame external things for our lack of productivity. Battling procrastination is an inner battle. I have many examples of that in my personal life. In 2013, I felt my career was stuck. Two years before that, I started a company with my dad. But after two years, I became restless because I wanted to do more and learn more. So I did some freelancing. I built websites, did copywriting, content marketing, and some design work. But it didn’t take off. Why? I never did the uncomfortable work. Instead, I found a job to escape those hard tasks. We all escape at times. Building a business or career is hard. It requires you to do difficult, tedious, and unsatisfying tasks. If you want more clients or work, no one is going to hand it to you. You have to hustle. Do content marketing, one-on-one sales, network, or whatever method you use to grow your business. And if you want to climb the corporate ladder, you have to form alliances, be strategic, outperform your targets, and be great at what you do. That’s what you SHOULD do, right? Most of us already know these things. Or, you will find out about it. There’s no such thing as a secret to succeeding at work. However, we prefer to escape work. And that’s at the core of procrastination to me. You know what you have to do, but you don’t do it. Instead, you open a news site and start reading useless news items. Or you browse your Instagram feed without liking one picture because you hate your life. Maybe you browse Zara, H&M, Net-A-Porter, Mr. Porter, or whatever online shop you like. That was, and to a degree still is, the story of my life. For example, I’m now working on a new book. I know what it’s about and I also have a title. But writing is also very difficult work to me. So I look for relief. I answer emails, read articles, go for coffee, do some online shopping, and work on recurring tasks to run my business. It’s not that I’m disorganized. It’s because I’m battling myself. Steven Pressfield calls this inner enemy Resistance in his classic, The War Of Art. And this is what he says about it: “Resistance is always lying and always full of shit.” Do It Today, Not Tomorrow I always have to keep reminding myself of that. When you procrastinate, you always want to do it tomorrow. I’m still like that. I think that’s hardwired into us. The difference between me now, and three years ago is small but simple: I rely on a system to live a productive, happy, and purposeful life. Back then I had no idea how to get things done. I always gave up quickly, felt stuck, unhappy, and frustrated. But now, I’ve found a way to overcome my challenges. Here’s how I did it: Of course, it takes time to develop the foundation of this strategy. And there’s a lot more to it. But it’s not magic. However, it’s also not easy to live a productive life. And it’s definitely not about technology or hacks. It’s about developing a sustainable system to build your life, career, and business on. What’s your system for living a productive life? Whatever it is: Work on it today. Not tomorrow. Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "How I Beat Procrastination: Do It Today, Not Tomorrow", "sentences": [{"6240": "How I Beat Procrastination: Do It Today, Not Tomorrow"}, {"d5ce": "Every time I put off a decision, hit the snooze button, skipped the gym, or didn’t complete my tasks because I didn’t feel like it, I always had an explanation for my continual procrastination."}, {"9a11": "I told myself I was tired. Or that it could wait until tomorrow. Who cares if you put off something, right?"}, {"a03c": "Well, you should care."}, {"9686": "Because you’re the one who’s responsible for your life. Too often, we look at productivity tips, apps or tools as the magic answer to our problems. But that also means we allow ourselves to blame external things for our lack of productivity."}, {"760e": "Battling procrastination is an inner battle. I have many examples of that in my personal life. In 2013, I felt my career was stuck. Two years before that, I started a company with my dad. But after two years, I became restless because I wanted to do more and learn more."}, {"b65c": "So I did some freelancing. I built websites, did copywriting, content marketing, and some design work. But it didn’t take off. Why? I never did the uncomfortable work. Instead, I found a job to escape those hard tasks."}, {"61d2": "We all escape at times."}, {"1984": "Building a business or career is hard. It requires you to do difficult, tedious, and unsatisfying tasks. If you want more clients or work, no one is going to hand it to you. You have to hustle. Do content marketing, one-on-one sales, network, or whatever method you use to grow your business."}, {"82dc": "And if you want to climb the corporate ladder, you have to form alliances, be strategic, outperform your targets, and be great at what you do."}, {"209e": "That’s what you SHOULD do, right? Most of us already know these things. Or, you will find out about it. There’s no such thing as a secret to succeeding at work."}, {"27a1": "However, we prefer to escape work. And that’s at the core of procrastination to me."}, {"8557": "You know what you have to do, but you don’t do it. Instead, you open a news site and start reading useless news items. Or you browse your Instagram feed without liking one picture because you hate your life. Maybe you browse Zara, H&M, Net-A-Porter, Mr. Porter, or whatever online shop you like."}, {"ce50": "That was, and to a degree still is, the story of my life. For example, I’m now working on a new book. I know what it’s about and I also have a title. But writing is also very difficult work to me."}, {"ecc9": "So I look for relief. I answer emails, read articles, go for coffee, do some online shopping, and work on recurring tasks to run my business. It’s not that I’m disorganized. It’s because I’m battling myself."}, {"f460": "Steven Pressfield calls this inner enemy Resistance in his classic, The War Of Art. And this is what he says about it:"}, {"cff7": "“Resistance is always lying and always full of shit.”"}, {"d9cc": "Do It Today, Not Tomorrow"}, {"3ffd": "I always have to keep reminding myself of that. When you procrastinate, you always want to do it tomorrow. I’m still like that. I think that’s hardwired into us."}, {"307f": "The difference between me now, and three years ago is small but simple: I rely on a system to live a productive, happy, and purposeful life."}, {"0751": "Back then I had no idea how to get things done. I always gave up quickly, felt stuck, unhappy, and frustrated."}, {"f022": "But now, I’ve found a way to overcome my challenges. Here’s how I did it:"}, {"79a2": "Of course, it takes time to develop the foundation of this strategy. And there’s a lot more to it. But it’s not magic."}, {"cccb": "However, it’s also not easy to live a productive life. And it’s definitely not about technology or hacks. It’s about developing a sustainable system to build your life, career, and business on."}, {"e839": "What’s your system for living a productive life?"}, {"3f7b": "Whatever it is: Work on it today. Not tomorrow."}, {"4f6d": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "303_1\t303_2\t303_3\t303_4\t303_5\t303_6\t303_7\t303_8\t303_9\t303_10\t303_11\t303_12\t303_13\t303_14\t303_15\t303_16\t303_17\t303_18\t303_19\t303_20\t303_21\t303_22\t303_23303_1\t303_2\t303_3\t303_4\t303_5\t303_6\t303_7\t303_8\t303_9\t303_10\t303_11\t303_12\t303_13\t303_14\t303_15\t303_16\t303_17\t303_18\t303_19\t303_20\t303_21\t303_22\t303_23"}