{"name": "306", "parent": "", "content": "I camped out with a tech billionaire. The advice he gave me was priceless. We sat around a small campfire, gazing up through the cold California air at a dazzling canopy of stars. My friends and I began talking with a member of the group. I didn’t know who he was, but he immediately struck me as interesting. The man led our conversation as it spanned from education to design to the role of serendipity in innovation. Only later did I learn that this man was the inventor of technology that most of us use every day, and that he was a self-made billionaire. I never would have guessed this, though. He was humble, kind, and funny. The man had an impressive and arching vision of history. He had strong opinions about the role of technology in society. And he shared his thoughts as eloquently as if he were giving a TED talk. The words he spoke on that starry night left an indelible impression on me. The values he shared have changed me. And now I want to share those values with you. Value #1: Embrace change He told me that many people are too conservative in their careers. Often young people — especially those who make good money — are scared to change industries, roles, companies, cities, organizational structures, or career paths. People miss worthwhile opportunities because their fear of failure blinds them from seeing the potential upsides. This made me think of many of my former coworkers back at Google, who had ideas for startups but were reluctant to take the plunge. His advice was to “embrace change and feel comfortable with it. Much of the technology we use today will be discarded in the future, and that is OK.” “Be the change that you wish to see in the world.” — Mahatma Gandhi Value #2: Create new markets, not just new products He observed that most people focus on just building new products, apps, or software. Instead they should be aiming to create new markets that have never existed before. Imagine what markets might exist in the future, and ask why they don’t yet exist. Leverage existing technological trends to power futuristic ideas that can give birth to new industries. He observed that “the most valuable companies and ideas spark entirely new industries.” “The present is theirs; the future, for which I really worked, is mine.” — Nikola Tesla Value #3: Embrace lifelong learning On the topic of education, one thing was clear to him: no matter what you do, you can do it better. He encouraged me to read, travel, practice listening, fail quickly, engage the world, embrace diversity, and hone my craft. “Challenge yourself to learn eclectic and varied skills and have fun in the process.” “Learn a computer language — or another spoken one — and become an expert,” he said. “Learn not only for the sake of learning, but learn to obtain mastery.” “Intellectual growth should commence at birth and cease only at death.” — Albert Einstein Value #4: Invest in skills that the future will value He observed that if you want to be successful, you need to start saving up two things: money and time. Then you can use these resources to invest in the skills and technology that the future will cherish. Invest in people, concepts, and industries that will add value a decade or more from now. Arguing for a better tomorrow, he said: “build for the future and develop ideas that have a genuine, scalable, and demonstrable impact on humanity.” “One never notices what has been done; one can only see what remains to be done. I was taught that the way of progress was neither swift nor easy.” — Marie Curie Returning from the camping trip, I thought about how I could be a better leader at the company I started, Pennybox. While many of his views were specific to the many successes of his life, I thought about how I might apply them to the betterment of my team and our users. I placed this list of his values on the garage door of my parent’s home, which now serves as our makeshift office. Imagine a world in which people embrace change, strive to create new markets, never stop learning, and are constantly investing in future skills. This is the kind of world I want to live in. I hope that one star-lit night I can encounter a group of entrepreneurs around a campfire, and that I too can pass these values on down to the next generation. Thanks for reading. I’m doing my best to heed this advice as I develop new technology that helps kids and families become financially literate. If you’re interested in this cause, you can gain early access here. ", "title": "I camped out with a tech billionaire. The advice he gave me was priceless.", "sentences": [{"b4fd": "I camped out with a tech billionaire. The advice he gave me was priceless."}, {"6682": "We sat around a small campfire, gazing up through the cold California air at a dazzling canopy of stars."}, {"44c9": "My friends and I began talking with a member of the group. I didn’t know who he was, but he immediately struck me as interesting."}, {"7f97": "The man led our conversation as it spanned from education to design to the role of serendipity in innovation."}, {"00ff": "Only later did I learn that this man was the inventor of technology that most of us use every day, and that he was a self-made billionaire."}, {"d664": "I never would have guessed this, though. He was humble, kind, and funny."}, {"9f07": "The man had an impressive and arching vision of history. He had strong opinions about the role of technology in society. And he shared his thoughts as eloquently as if he were giving a TED talk."}, {"81d6": "The words he spoke on that starry night left an indelible impression on me. The values he shared have changed me. And now I want to share those values with you."}, {"30bf": "Value #1: Embrace change"}, {"91b5": "He told me that many people are too conservative in their careers."}, {"2ede": "Often young people — especially those who make good money — are scared to change industries, roles, companies, cities, organizational structures, or career paths."}, {"c6bc": "People miss worthwhile opportunities because their fear of failure blinds them from seeing the potential upsides."}, {"f0f0": "This made me think of many of my former coworkers back at Google, who had ideas for startups but were reluctant to take the plunge."}, {"fea6": "His advice was to “embrace change and feel comfortable with it. Much of the technology we use today will be discarded in the future, and that is OK.”"}, {"0270": "“Be the change that you wish to see in the world.” — Mahatma Gandhi"}, {"17c7": "Value #2: Create new markets, not just new products"}, {"86c4": "He observed that most people focus on just building new products, apps, or software. Instead they should be aiming to create new markets that have never existed before."}, {"e81d": "Imagine what markets might exist in the future, and ask why they don’t yet exist. Leverage existing technological trends to power futuristic ideas that can give birth to new industries."}, {"81e8": "He observed that “the most valuable companies and ideas spark entirely new industries.”"}, {"6a12": "“The present is theirs; the future, for which I really worked, is mine.” — Nikola Tesla"}, {"eebd": "Value #3: Embrace lifelong learning"}, {"3112": "On the topic of education, one thing was clear to him: no matter what you do, you can do it better."}, {"7a11": "He encouraged me to read, travel, practice listening, fail quickly, engage the world, embrace diversity, and hone my craft. “Challenge yourself to learn eclectic and varied skills and have fun in the process.”"}, {"0942": "“Learn a computer language — or another spoken one — and become an expert,” he said. “Learn not only for the sake of learning, but learn to obtain mastery.”"}, {"b934": "“Intellectual growth should commence at birth and cease only at death.” — Albert Einstein"}, {"81af": "Value #4: Invest in skills that the future will value"}, {"328c": "He observed that if you want to be successful, you need to start saving up two things: money and time. Then you can use these resources to invest in the skills and technology that the future will cherish. Invest in people, concepts, and industries that will add value a decade or more from now."}, {"87e0": "Arguing for a better tomorrow, he said: “build for the future and develop ideas that have a genuine, scalable, and demonstrable impact on humanity.”"}, {"8295": "“One never notices what has been done; one can only see what remains to be done. I was taught that the way of progress was neither swift nor easy.” — Marie Curie"}, {"d0cf": "Returning from the camping trip, I thought about how I could be a better leader at the company I started, Pennybox."}, {"4670": "While many of his views were specific to the many successes of his life, I thought about how I might apply them to the betterment of my team and our users."}, {"981a": "I placed this list of his values on the garage door of my parent’s home, which now serves as our makeshift office."}, {"6a70": "Imagine a world in which people embrace change, strive to create new markets, never stop learning, and are constantly investing in future skills. This is the kind of world I want to live in."}, {"fe1c": "I hope that one star-lit night I can encounter a group of entrepreneurs around a campfire, and that I too can pass these values on down to the next generation."}, {"d359": "Thanks for reading. I’m doing my best to heed this advice as I develop new technology that helps kids and families become financially literate. If you’re interested in this cause, you can gain early access here."}], "child": "306_1\t306_2\t306_3\t306_4\t306_5\t306_6\t306_7\t306_8\t306_9\t306_10\t306_11\t306_12\t306_13\t306_14\t306_15\t306_16\t306_17\t306_18\t306_19\t306_20\t306_21\t306_22\t306_23\t306_24\t306_25306_1\t306_2\t306_3\t306_4\t306_5\t306_6\t306_7\t306_8\t306_9\t306_10\t306_11\t306_12\t306_13\t306_14\t306_15\t306_16\t306_17\t306_18\t306_19\t306_20\t306_21\t306_22\t306_23\t306_24\t306_25"}