{"name": "309", "parent": "", "content": "30 Things About Life I Wish I Had Known 10 Years Ago Last week I turned 30. Unlike most people, I do like getting older. 10 years ago, I was a complete idiot. Now, a decade later, I still know nothing, but I do feel more in control of my life. I thank that personal growth to an idea I stole from Socrates, the person who was once named the wisest man on earth by the Oracle of Delphi. When Socrates heard that the oracle had made such a comment, he believed that the statement was wrong. Socrates said: “I know one thing: that I know nothing.” How can the smartest man on earth know nothing? I heard this paradoxical wisdom for the first time from my school teacher when I was 14 or 15. That humility made such an impact on me that I used Socrates’s quote as my learning strategy. What you will find below is a list of the most important things I learned from others. We might learn things quickly, but we often forget things at the same rate — and sometimes we need to remind ourselves of the things we’ve learned. Here are 30 of those reminders that others taught me. You might know a lot. But like Socrates, you and I know nothing at all. So we have to keep learning. Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "30 Things About Life I Wish I Had Known 10 Years Ago", "sentences": [{"f2cf": "30 Things About Life I Wish I Had Known 10 Years Ago"}, {"4bf5": "Last week I turned 30. Unlike most people, I do like getting older. 10 years ago, I was a complete idiot."}, {"08d6": "Now, a decade later, I still know nothing, but I do feel more in control of my life. I thank that personal growth to an idea I stole from Socrates, the person who was once named the wisest man on earth by the Oracle of Delphi."}, {"2057": "When Socrates heard that the oracle had made such a comment, he believed that the statement was wrong. Socrates said:"}, {"5804": "“I know one thing: that I know nothing.”"}, {"08fb": "How can the smartest man on earth know nothing? I heard this paradoxical wisdom for the first time from my school teacher when I was 14 or 15. That humility made such an impact on me that I used Socrates’s quote as my learning strategy."}, {"46d7": "What you will find below is a list of the most important things I learned from others. We might learn things quickly, but we often forget things at the same rate — and sometimes we need to remind ourselves of the things we’ve learned."}, {"3040": "Here are 30 of those reminders that others taught me."}, {"5f35": "You might know a lot. But like Socrates, you and I know nothing at all. So we have to keep learning."}, {"4b6c": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "309_1\t309_2\t309_3\t309_4\t309_5\t309_6\t309_7\t309_8\t309_9\t309_10\t309_11\t309_12\t309_13\t309_14\t309_15\t309_16\t309_17\t309_18\t309_19\t309_20\t309_21\t309_22\t309_23\t309_24\t309_25309_1\t309_2\t309_3\t309_4\t309_5\t309_6\t309_7\t309_8\t309_9\t309_10\t309_11\t309_12\t309_13\t309_14\t309_15\t309_16\t309_17\t309_18\t309_19\t309_20\t309_21\t309_22\t309_23\t309_24\t309_25"}