{"content": "Where You Stand in the Westbrook-Harden MVP Debate Says a Lot About You In one of the most contentious MVP races ever, Russell Westbrook, James Harden, Kawhi Leonard, and LeBron James are all vying for the award. But it is ultimately the Russ vs. Beard argument that reflects how you define “most valuable.” Russell Westbrook’s 48th, 49th, and 50th points in Wednesday’s game against Orlando were as good as fated. They came on a game-tying leaner from 31 feet out with only seconds remaining in regulation, because of course they did. Westbrook has become the patron saint of round numbers, and every MVP debate this season starts with Russ’s triple-double average (and ends with obscenities and unwarranted, moralizing judgments). Russ neutralized a 21-point deficit, and turned the Orlando crowd into zealots on his behalf. With three minutes remaining in the extra session, MVP chants rained down from the Amway Center. The Thunder would go on to win 114–106 in overtime, with Westbrook recording a 57-point triple-double, the highest-scoring triple-double in NBA history. But it’s that 3 at the end of regulation that could be remembered as his defining moment of the regular season. Why? Let’s watch it again: Once airborne, Westbrook leans in to split the difference between Elfrid Payton and Terrence Ross, but immediately starts drifting right, because he’s actually in the presence of a third defender, his own teammate Steven Adams, who is late trying to set a screen. Russ, as always, is a step ahead, and rises up to fire a beat before Adams gets in position; by the time Adams slips the play, Westbrook is already on his way down. He was flanked by two guards on each side of him, but really, he was shooting over a 7-footer to tie the game. In real time, Westbrook animated the most persistent argument for his claim to the highest individual award in the league: he’s doing it all in spite of his teammates. An MVP moment was born. MVP moments are … having a moment. In the past month, most of the leading Most Valuable Player Award candidates have essentially submitted their reels to the Academy, encapsulating a year’s worth of excellence in one definitive sequence. It’s been an unprecedented year for an individual’s impact on his team, which, naturally, has only amplified the significance of the MVP moment this season. It operates as a moving metaphor, constructing an entire mini-narrative that not only burnishes a candidate’s qualifications, but unmasks his character as an athlete. Steph Curry’s game-winning pull-up 3 over the Thunder in overtime last season was his MVP moment, a heaven-sent Molotov cocktail of hubris, glee, and chosen-one assuredness — it was Chance’s “Blessings” in the form of a 37-foot heave. Curry stood peerless then; he would go on to become the first unanimous MVP in league history. To reset the balance this season, the basketball gods have given us one of the most contentious races ever: four players — Westbrook, James Harden, Kawhi Leonard, LeBron James — all deserving, all representative of a different way in which to remember this season. Leonard had his moment on March 6 against Houston in one of the best games of the year. On one end, a Spurs possession that Manu Ginobili might have tried (and failed) to put past Gregg Popovich more than a decade ago: 13 seconds of Kawhi pounding the basketball, straight into a pull-up jumper from the left wing. Seconds later, on defense, Kawhi is bumped on a high screen, giving Harden a free lane to the rim. Harden lays the ball up and — thwack. Leonard pins the ball with his off hand. Harden doesn’t bother to even feign outrage at a potential goaltend. He knew it was clean; that’s just how Kawhi plays defense. Most years, the MVP race is an offensive pissing contest along parallel lines. That’s what makes Leonard’s MVP moment unique. Kawhi’s was the only one this season to prop up his own credibility by diminishing one of his competitors’. It was Leonard’s entire career in a nutshell: quietly, insistently gaining on his peers. It was confrontational and, for an internet second, made it seem as though Leonard had truly taken over the discussion. It was Kendrick Lamar’s “Control” verse, played at 10 percent volume. A low, menacing hum on the periphery. Harden’s moment arrived on March 20 against the Nuggets, in a showcase of two top-five offenses. With six seconds remaining in the game, and Denver up, 124–123, Harden fights for a defensive rebound with Gary Harris right at the baseline — the only thing keeping Harden from stepping out of bounds is the heel that he miraculously keeps arched. He swivels around Harris on such a tight turn radius that not only does Harden dislodge himself from Harris’s immediate vicinity, but he actually creates about five feet of distance between them. Harden drives straight down the middle of the court, all 94 feet, past every player on the Nuggets defense, for a game-winning layup. By the end of the play, he’s completely gassed. Is that not the physical embodiment of Mike D’Antoni’s greatest hits? A one-man buzzsaw finding potential in every inch of the court as he pioneers one of the best offenses in the league; he runs himself ragged, but he persists. That exhaustion has become a part of Harden’s platform. He’s played in every game this season, and has missed only one practice. He’s played through a left wrist injury for the past two weeks. “[I’m] not leaving [my] teammates out there to dry, “ Harden told reporters earlier this week. “For me, I worry about always having my teammates’ back and always being out there.” Ironically, rest is the most convincing argument for LeBron’s candidacy. The Cavs are 0–6 when James is inactive; his best shot at winning it all might be sitting out the rest of the season and seeing just how bad things can get. While I’ve argued LeBron’s case before — and still think it’s a good one — as far as optics go, he’s fallen to fourth. In a race this close, momentum matters. The Cavs have sputtered, losing five of their past seven games. LeBron’s MVP moment — a game-tying fadeaway 3 from the corner against the Wizards — happened in February, which is like dropping an award-worthy movie in the Oscars dry season. Why does Harden’s opinion on rest matter in the race? Why does Orlando’s sudden Westbrook evangelism matter? Why does it matter who is MVP? Because it’s easier to discuss broader issues through icons and avatars; because the winner becomes evocative of the thoughts and attitudes of a given season; because the award is the epitaph for the 82-game experience. In some circles, the MVP debate highlights the limitations of modern basketball statistics to quantify the impact of any one player. For instance, how LeBron, 14 years into his career, has become unto himself a grand unified theory of everything, becoming the most efficient he’s ever been as an all-around offensive playmaker. Or how Kawhi Leonard’s once-in-a-generation perimeter D registers as a net negative through defensive metrics, effectively resurfacing the once-thought-to-be-lost Revis Island in San Antonio, of all places. The Harden v. Westbrook debate becomes a conversation about who gets to be remembered as the rightful heir to Oscar Robertson, and who officially gets to carry that lineage — both have maintained season averages last achieved only by the Big O. Westbrook’s 57-point triple-double was certainly the best game of his career: Counting his point total and the point total from his assists, Russ accounted for 82 of the Thunder’s 114 points (71.9 percent). Harden’s best game, his 53–16–17 New Year’s Eve ball-out against the Knicks, accounted for 95 of the Rockets’ 129 points (73.6 percent). These figures are completely unprecedented in the modern era. The NBA tracks “potential assists,” which basically counts the number of times a player passes to a teammate for a shot, whether that shot goes in or not. Harden leads all players in potential assists; Westbrook is in third, trailing John Wall. But between the two leading MVP candidates, the percentage of potential assists that become actual assists slightly favors Westbrook, 53.3 percent compared to 52.5 percent (the undisputed king of potentiating assists is Ricky Rubio, who turns 58.4 of his potential assists into actual ones). At surface level, this suggests that Westbrook is a slightly more efficient passer, but when you consider that Harden has nearly 50 percent more hockey assists than Westbrook, it becomes clear that Harden has access to more release valves on offense than his OKC counterpart. All this more or less confirms what we know anecdotally: the Rockets have a team built perfectly around Harden’s talents; the Thunder have a team built around Westbrook’s insistence on doing everything. We’ve set the stage for a compelling four-man finish, but if this still feels like a two-man race to you, it’s because Westbrook and Harden most clearly represent the two most basic schools of thought when it comes to determining the meaning of “most valuable.” Is it fair to penalize a player for being on a team complementary to his talents? Is it fair to champion a player whose extraordinary effort still only amounts to being the best option on a middling team? Every year, MVP voters grapple with the significance of individual and collective success and how one informs the other — and every year, the rationale changes. That there is no hardline answer is both beautiful and frustrating. Because all we want is for sports to align with how we see the world. (My theoretical vote would go to Harden. Disagree? Let’s be friends.) We are all basketball analysts and annalists, and how the league reflects upon itself will affect the way we reflect upon it down the line. The fans at the Amway Center eschewing their values as home-team loyalists did so in celebration of something greater. There was a collective feeling that history was being made. Simply being there established a level of involvement, of being part of the stakes. Should Westbrook win the MVP this season, the chants he got in Orlando will live on as a footnote in his campaign. If history is written by the victors, we’ll settle for a shout-out in the acknowledgments. ", "child": "31_1\t31_2\t31_3\t31_4\t31_5\t31_6\t31_7\t31_8\t31_9\t31_10\t31_11\t31_12\t31_13\t31_14\t31_15\t31_16\t31_17\t31_18\t31_19\t31_20\t31_21\t31_22", "title": "Where You Stand in the Westbrook-Harden MVP Debate Says a Lot About You", "parent": "", "sentences": [{"2726": "Where You Stand in the Westbrook-Harden MVP Debate Says a Lot About You"}, {"8541": "In one of the most contentious MVP races ever, Russell Westbrook, James Harden, Kawhi Leonard, and LeBron James are all vying for the award. But it is ultimately the Russ vs. Beard argument that reflects how you define “most valuable.”"}, {"43fc": "Russell Westbrook’s 48th, 49th, and 50th points in Wednesday’s game against Orlando were as good as fated. They came on a game-tying leaner from 31 feet out with only seconds remaining in regulation, because of course they did. Westbrook has become the patron saint of round numbers, and every MVP debate this season starts with Russ’s triple-double average (and ends with obscenities and unwarranted, moralizing judgments). Russ neutralized a 21-point deficit, and turned the Orlando crowd into zealots on his behalf. With three minutes remaining in the extra session, MVP chants rained down from the Amway Center. The Thunder would go on to win 114–106 in overtime, with Westbrook recording a 57-point triple-double, the highest-scoring triple-double in NBA history. But it’s that 3 at the end of regulation that could be remembered as his defining moment of the regular season. Why? Let’s watch it again:"}, {"730d": "Once airborne, Westbrook leans in to split the difference between Elfrid Payton and Terrence Ross, but immediately starts drifting right, because he’s actually in the presence of a third defender, his own teammate Steven Adams, who is late trying to set a screen. Russ, as always, is a step ahead, and rises up to fire a beat before Adams gets in position; by the time Adams slips the play, Westbrook is already on his way down. He was flanked by two guards on each side of him, but really, he was shooting over a 7-footer to tie the game. In real time, Westbrook animated the most persistent argument for his claim to the highest individual award in the league: he’s doing it all in spite of his teammates. An MVP moment was born."}, {"8932": "MVP moments are … having a moment. In the past month, most of the leading Most Valuable Player Award candidates have essentially submitted their reels to the Academy, encapsulating a year’s worth of excellence in one definitive sequence. It’s been an unprecedented year for an individual’s impact on his team, which, naturally, has only amplified the significance of the MVP moment this season. It operates as a moving metaphor, constructing an entire mini-narrative that not only burnishes a candidate’s qualifications, but unmasks his character as an athlete."}, {"a706": "Steph Curry’s game-winning pull-up 3 over the Thunder in overtime last season was his MVP moment, a heaven-sent Molotov cocktail of hubris, glee, and chosen-one assuredness — it was Chance’s “Blessings” in the form of a 37-foot heave. Curry stood peerless then; he would go on to become the first unanimous MVP in league history. To reset the balance this season, the basketball gods have given us one of the most contentious races ever: four players — Westbrook, James Harden, Kawhi Leonard, LeBron James — all deserving, all representative of a different way in which to remember this season."}, {"fec8": "Leonard had his moment on March 6 against Houston in one of the best games of the year. On one end, a Spurs possession that Manu Ginobili might have tried (and failed) to put past Gregg Popovich more than a decade ago: 13 seconds of Kawhi pounding the basketball, straight into a pull-up jumper from the left wing. Seconds later, on defense, Kawhi is bumped on a high screen, giving Harden a free lane to the rim. Harden lays the ball up and — thwack. Leonard pins the ball with his off hand. Harden doesn’t bother to even feign outrage at a potential goaltend. He knew it was clean; that’s just how Kawhi plays defense."}, {"90de": "Most years, the MVP race is an offensive pissing contest along parallel lines. That’s what makes Leonard’s MVP moment unique. Kawhi’s was the only one this season to prop up his own credibility by diminishing one of his competitors’. It was Leonard’s entire career in a nutshell: quietly, insistently gaining on his peers. It was confrontational and, for an internet second, made it seem as though Leonard had truly taken over the discussion. It was Kendrick Lamar’s “Control” verse, played at 10 percent volume. A low, menacing hum on the periphery."}, {"4a96": "Harden’s moment arrived on March 20 against the Nuggets, in a showcase of two top-five offenses. With six seconds remaining in the game, and Denver up, 124–123, Harden fights for a defensive rebound with Gary Harris right at the baseline — the only thing keeping Harden from stepping out of bounds is the heel that he miraculously keeps arched. He swivels around Harris on such a tight turn radius that not only does Harden dislodge himself from Harris’s immediate vicinity, but he actually creates about five feet of distance between them. Harden drives straight down the middle of the court, all 94 feet, past every player on the Nuggets defense, for a game-winning layup. By the end of the play, he’s completely gassed."}, {"cbb6": "Is that not the physical embodiment of Mike D’Antoni’s greatest hits? A one-man buzzsaw finding potential in every inch of the court as he pioneers one of the best offenses in the league; he runs himself ragged, but he persists."}, {"d249": "That exhaustion has become a part of Harden’s platform. He’s played in every game this season, and has missed only one practice. He’s played through a left wrist injury for the past two weeks. “[I’m] not leaving [my] teammates out there to dry, “ Harden told reporters earlier this week. “For me, I worry about always having my teammates’ back and always being out there.”"}, {"a168": "Ironically, rest is the most convincing argument for LeBron’s candidacy. The Cavs are 0–6 when James is inactive; his best shot at winning it all might be sitting out the rest of the season and seeing just how bad things can get. While I’ve argued LeBron’s case before — and still think it’s a good one — as far as optics go, he’s fallen to fourth. In a race this close, momentum matters. The Cavs have sputtered, losing five of their past seven games. LeBron’s MVP moment — a game-tying fadeaway 3 from the corner against the Wizards — happened in February, which is like dropping an award-worthy movie in the Oscars dry season."}, {"b802": "Why does Harden’s opinion on rest matter in the race? Why does Orlando’s sudden Westbrook evangelism matter? Why does it matter who is MVP? Because it’s easier to discuss broader issues through icons and avatars; because the winner becomes evocative of the thoughts and attitudes of a given season; because the award is the epitaph for the 82-game experience."}, {"ddb4": "In some circles, the MVP debate highlights the limitations of modern basketball statistics to quantify the impact of any one player. For instance, how LeBron, 14 years into his career, has become unto himself a grand unified theory of everything, becoming the most efficient he’s ever been as an all-around offensive playmaker. Or how Kawhi Leonard’s once-in-a-generation perimeter D registers as a net negative through defensive metrics, effectively resurfacing the once-thought-to-be-lost Revis Island in San Antonio, of all places."}, {"596e": "The Harden v. Westbrook debate becomes a conversation about who gets to be remembered as the rightful heir to Oscar Robertson, and who officially gets to carry that lineage — both have maintained season averages last achieved only by the Big O. Westbrook’s 57-point triple-double was certainly the best game of his career: Counting his point total and the point total from his assists, Russ accounted for 82 of the Thunder’s 114 points (71.9 percent). Harden’s best game, his 53–16–17 New Year’s Eve ball-out against the Knicks, accounted for 95 of the Rockets’ 129 points (73.6 percent). These figures are completely unprecedented in the modern era."}, {"79ba": "The NBA tracks “potential assists,” which basically counts the number of times a player passes to a teammate for a shot, whether that shot goes in or not. Harden leads all players in potential assists; Westbrook is in third, trailing John Wall. But between the two leading MVP candidates, the percentage of potential assists that become actual assists slightly favors Westbrook, 53.3 percent compared to 52.5 percent (the undisputed king of potentiating assists is Ricky Rubio, who turns 58.4 of his potential assists into actual ones). At surface level, this suggests that Westbrook is a slightly more efficient passer, but when you consider that Harden has nearly 50 percent more hockey assists than Westbrook, it becomes clear that Harden has access to more release valves on offense than his OKC counterpart."}, {"2b9b": "All this more or less confirms what we know anecdotally: the Rockets have a team built perfectly around Harden’s talents; the Thunder have a team built around Westbrook’s insistence on doing everything. We’ve set the stage for a compelling four-man finish, but if this still feels like a two-man race to you, it’s because Westbrook and Harden most clearly represent the two most basic schools of thought when it comes to determining the meaning of “most valuable.” Is it fair to penalize a player for being on a team complementary to his talents? Is it fair to champion a player whose extraordinary effort still only amounts to being the best option on a middling team? Every year, MVP voters grapple with the significance of individual and collective success and how one informs the other — and every year, the rationale changes. That there is no hardline answer is both beautiful and frustrating. Because all we want is for sports to align with how we see the world. (My theoretical vote would go to Harden. Disagree? Let’s be friends.)"}, {"ada2": "We are all basketball analysts and annalists, and how the league reflects upon itself will affect the way we reflect upon it down the line. The fans at the Amway Center eschewing their values as home-team loyalists did so in celebration of something greater. There was a collective feeling that history was being made. Simply being there established a level of involvement, of being part of the stakes. Should Westbrook win the MVP this season, the chants he got in Orlando will live on as a footnote in his campaign. If history is written by the victors, we’ll settle for a shout-out in the acknowledgments."}], "name": "31"}