{"name": "310", "parent": "", "content": "Two Tips That Instantly Improve Your Everyday Writing Forever Do you see yourself as a writer? If not, it’s time to change that perception. Because you are a writer. In fact, everyone is. And I’ll tell you this: Writing is the most important skill in today’s attention economy. And it’s not the best writer that wins; it’s the most effective. It’s especially relevant to people who’re not full-time writers (probably 99.99% of all people). We almost only communicate in the written form these days. Our careers truly depend on it. Do you know the feeling of going back and forth with someone who misunderstood your email or text message? How about writing website copy that no one responds to? Or resumes and cover letters that get zero response? You can’t escape writing. We all communicate with words. And every time you fail to achieve your goal with writing, it has nothing to do with your literary qualities: It has everything to do with its effectiveness. Everyday writing has only one goal: Get people to act. Write it down, take a picture of it, or do anything to remember that. Because that’s the single most important thing I’ve learned about writing. And that’s not even one of the two practical tips that I’m sharing in this article. Most writers are pretentious. They endlessly talk about literature and poetry, but no one is ever moved by their work. That’s because they might be wonderful writers, but they are not effective if there’s no outcome. Stephen King put it very directly: “Writing is seduction.” Seduction, persuasion, we all do it (at least, we try). You want attention, the pretty boy/girl, a job, money, or whatever it is that you’re trying to get with your words. And when you get what you want with writing, your writing is effective. So let’s talk about two tips that can help you with that. Tip #1: Stop Using Standard Phrases The first thing that I had to unlearn when I came out of college was academic writing. Just like business writing, it’s not how humans interact with each other. Our writing is often unclear and doesn’t sound like us at all. For instance, when’s the last time you said these phrases? Those are academic phrases that many people who went to college still use. No one talks like that. Or how about business phrases: It’s all meaningless. Empty. Faceless. And these phrases exist in most languages. You can cut out all the above stuff (unless you’re a lawyer or work in an extremely formal industry). It’s just not effective because people will think you’re a robot. If you want to write in a way that will make people take action after reading your words, you want to sound like a human. That’s what makes writing effective. Here’s a rule of thumb: Not using a word in speech? Don’t use it in writing. Tip #2: Always Edit Your Writing For Visual Appeal Let’s talk about something that has nothing to do with words. The way writing looks also determines how effective it is. Most writing looks something like this (not only emails): The problem is that we live in a ‘scan’ economy. People scan and skim everything before they read it. Why? There are literally a million other things you can do with your time. Before you read something, you want to know if it’s any good, useful, or important. More like this: Unless you’re an academic, journalist or person who’s writing a book, you want your writing to look easily digestible. That means this: Writing that looks predictable and boring doesn’t move people. The key is to never overdo it. Editing for eye appeal means variety. Switch it up. Make your writing look good by using different formatting. You can apply that strategy to almost everything. Articles, emails, reports, cover letters, etc. Those two tips make every day writing more effective. Because to me, that’s what writing is about. Get people to act with your words. Did you act? If not, my writing sucks and I need improvement. That reminds me of something that Hemingway once said: “We are all apprentices in a craft where no one ever becomes a master.” We all suck. But as long as your writing is effective, it will get the job done. And that’s the only thing that matters. Are You A Writer? The Answer is, “Yes.” We’re all writers. We write text messages, emails, blogs, landing pages, FAQs, reports, etc. Our careers depend on the effectiveness of our words. Want to stand out from the crowd through writing? Enroll for my new class, Effective Writing. Get Instant Access. Start Learning On Any Device. Anywhere In The World. ", "title": "Two Tips That Instantly Improve Your Everyday Writing Forever", "sentences": [{"0092": "Two Tips That Instantly Improve Your Everyday Writing Forever"}, {"61df": "Do you see yourself as a writer?"}, {"d12b": "If not, it’s time to change that perception. Because you are a writer. In fact, everyone is."}, {"827d": "And I’ll tell you this: Writing is the most important skill in today’s attention economy."}, {"5df3": "And it’s not the best writer that wins; it’s the most effective."}, {"d4fb": "It’s especially relevant to people who’re not full-time writers (probably 99.99% of all people). We almost only communicate in the written form these days. Our careers truly depend on it."}, {"555a": "Do you know the feeling of going back and forth with someone who misunderstood your email or text message? How about writing website copy that no one responds to? Or resumes and cover letters that get zero response?"}, {"afbb": "You can’t escape writing. We all communicate with words. And every time you fail to achieve your goal with writing, it has nothing to do with your literary qualities: It has everything to do with its effectiveness."}, {"2d34": "Everyday writing has only one goal: Get people to act."}, {"271b": "Write it down, take a picture of it, or do anything to remember that. Because that’s the single most important thing I’ve learned about writing."}, {"3110": "And that’s not even one of the two practical tips that I’m sharing in this article."}, {"b807": "Most writers are pretentious. They endlessly talk about literature and poetry, but no one is ever moved by their work. That’s because they might be wonderful writers, but they are not effective if there’s no outcome."}, {"15f8": "Stephen King put it very directly:"}, {"2555": "“Writing is seduction.”"}, {"2683": "Seduction, persuasion, we all do it (at least, we try). You want attention, the pretty boy/girl, a job, money, or whatever it is that you’re trying to get with your words."}, {"2ccd": "And when you get what you want with writing, your writing is effective. So let’s talk about two tips that can help you with that."}, {"03de": "Tip #1: Stop Using Standard Phrases"}, {"8fee": "The first thing that I had to unlearn when I came out of college was academic writing. Just like business writing, it’s not how humans interact with each other."}, {"d28d": "Our writing is often unclear and doesn’t sound like us at all. For instance, when’s the last time you said these phrases?"}, {"9058": "Those are academic phrases that many people who went to college still use. No one talks like that. Or how about business phrases:"}, {"df57": "It’s all meaningless. Empty. Faceless. And these phrases exist in most languages."}, {"2cef": "You can cut out all the above stuff (unless you’re a lawyer or work in an extremely formal industry). It’s just not effective because people will think you’re a robot."}, {"7446": "If you want to write in a way that will make people take action after reading your words, you want to sound like a human. That’s what makes writing effective."}, {"c2d4": "Here’s a rule of thumb: Not using a word in speech? Don’t use it in writing."}, {"017f": "Tip #2: Always Edit Your Writing For Visual Appeal"}, {"aa02": "Let’s talk about something that has nothing to do with words. The way writing looks also determines how effective it is."}, {"8f52": "Most writing looks something like this (not only emails):"}, {"7616": "The problem is that we live in a ‘scan’ economy. People scan and skim everything before they read it. Why? There are literally a million other things you can do with your time."}, {"6e99": "Before you read something, you want to know if it’s any good, useful, or important. More like this:"}, {"bb66": "Unless you’re an academic, journalist or person who’s writing a book, you want your writing to look easily digestible. That means this:"}, {"4108": "Writing that looks predictable and boring doesn’t move people."}, {"e522": "The key is to never overdo it. Editing for eye appeal means variety. Switch it up. Make your writing look good by using different formatting."}, {"f4de": "You can apply that strategy to almost everything. Articles, emails, reports, cover letters, etc."}, {"7ef0": "Those two tips make every day writing more effective. Because to me, that’s what writing is about. Get people to act with your words."}, {"bed7": "Did you act? If not, my writing sucks and I need improvement. That reminds me of something that Hemingway once said:"}, {"2cc4": "“We are all apprentices in a craft where no one ever becomes a master.”"}, {"2b27": "We all suck. But as long as your writing is effective, it will get the job done. And that’s the only thing that matters."}, {"9ded": "Are You A Writer? The Answer is, “Yes.”"}, {"6536": "We’re all writers. We write text messages, emails, blogs, landing pages, FAQs, reports, etc. Our careers depend on the effectiveness of our words."}, {"73da": "Want to stand out from the crowd through writing? Enroll for my new class, Effective Writing."}, {"578d": "Get Instant Access. Start Learning On Any Device. Anywhere In The World."}], "child": "310_1\t310_2\t310_3\t310_4\t310_5\t310_6\t310_7\t310_8\t310_9\t310_10\t310_11\t310_12\t310_13\t310_14\t310_15\t310_16\t310_17\t310_18\t310_19\t310_20\t310_21\t310_22\t310_23\t310_24\t310_25310_1\t310_2\t310_3\t310_4\t310_5\t310_6\t310_7\t310_8\t310_9\t310_10\t310_11\t310_12\t310_13\t310_14\t310_15\t310_16\t310_17\t310_18\t310_19\t310_20\t310_21\t310_22\t310_23\t310_24\t310_25"}