{"name": "312", "parent": "", "content": "7 Productivity Apps That Shave 10 Hours Off Your Work Week Start living more consciously of your time and productivity so you can save your time for other, more important, things. Tools don’t matter. But if you use the right tools, your life can be a lot easier and better. My general opinion about apps, tools, and resources is this: It doesn’t matter. I say that because most people hide behind their apps. We’re always looking for the ONE app that will turn us into a productivity monster. Or we believe that tools or other resources will help us do better work. YouTuber and filmmaker Casey Neistat makes this point very clear, he says: “The gear never matters. Tell a great story really well, and people will forgive whatever gear you shoot it on.” When it comes to writing, Stephen King has a similar approach. Whenever he’s asked about tools, he doesn’t even answer. If you want to become a better writer, he says: “You learn best by reading a lot and writing a lot, and the most valuable lessons of all are the ones you teach yourself.” I’m sure you know there’s only one way to get things done: Put your head down and work fucking hard. But often, we still think these type of thoughts: These are all reasons we procrastinate. Now, of course, tools matter. But they are not the determining factor. You are. It’s not about the resources you have; it’s about what you do with them. Life is about resourcefulness. And that’s the point people like Casey Neistat and Stephen King want to make. What you’ll find next is a list of 7 of my favorite apps and how I use them. When you use the tools in the right way, you can easily save 10 hours per week. 1. Grammarly If you’re reading this, you’re probably a knowledge worker. And a knowledge worker’s primary weapon is her words. I strongly believe that if you want to become a better communicator, it all starts on paper. Learn how to think and write well, and you will ultimately become better at speaking, sales, copywriting, programming, doing interviews, leading, etc. The very words you use are EVERYTHING in how you conduct yourself. Especially in an increasingly digital world where people shy away from face-to-face contact. And Grammarly is the best tool to help you with communicating. Most people think a grammar checker is only for writers. But I mainly use Grammarly’s browser extension for daily use. I use it for writing emails in Gmail, responding to comments, or any other site I have to write something. I also edit my articles with Grammarly (they also have an MS Office add-on). It checks for passive voice, grammatical, spelling, and punctuation mistakes. All in all, this app saves me about 30 minutes a day in sheer brainpower. With Grammarly, I can just focus on writing and communicating my message; they do the rest. 2. Blinkist Reading improves focus, productivity, creativity, and it reduces stress. The benefits are so great that it makes you think everybody should be reading books like crazy. Nope. 23% of Americans have not read a single book in the past year. And the number of books people read per year are also not pretty. Only 28% reads more than 11 books per year. And I get it. Reading takes time. Plus, one of my main challenges is to select which books I’m going to read. In the past, I’ve often bought books, and quit them half-way through because they were not useful or interesting. That costs me time and money. That’s frustrating, especially because you can only read so many books every year. If you’re like me, your reading list grows faster than you cross off books, and that’s a problem. Why? You want to read the RIGHT books. You want to read books that make you grow; personally, professionally, financially. And I’ve finally found a solution to the question of: “What book should I read next?” Blinkist creates quality summaries of non-fiction books. Every day I read one book summary, and if I want to learn more, I get the actual book. If not, I just eliminate the book from my reading list. You have to be realistic; you just can’t read all the books in the world. And it’s important to figure out how you decide which books you’re going to read. Also, I don’t rely on reviews to select books because a book that’s useless to you can be valuable to me. 3. Trello You should eliminate those two thoughts from your head. Why? Because they plant the seeds of something that’s called: WASTING TIME. I use Trello as a backlog of tasks that I have to do. If you don’t know Trello; it’s a versatile project management tool that can be used in many ways. With Trello you can create ‘boards’ for every project you have. And on every board, you can list all the actions you have to complete for that project. Every week I take some time to update my projects. That helps me to improve my focus, so I know what I have to do. Whenever I don’t know what to do, I open Trello: There’s ALWAYS something to do. 4. Feedly / Medium Browsing blogs remains one of the main sources of wasting time for most of us. I have a simple tip for you: Stop clicking on articles you see in your social feeds. Most people open Facebook, Twitter, or even news sites, and they click on anything thing that looks slightly interesting. DON’T. Instead, make a list of 5–10 blogs/authors you love to read. Then, add them to Feedly or follow the bloggers/publications on Medium. Every day, only read your articles through Feedly and Medium. This saves at least 1 hour of mindless browsing per week. 5. Office 365 / Google Docs I still meet a lot of entrepreneurs and freelancers who don’t work in the cloud. If you’re one of them, you’re wasting a lot of time. Just the few minutes it takes to open files from folders, save them on external drives, or share your documents with others, adds up quickly. A few minutes here and there become a few hours a week, and hundreds of hours per year. I use Office 365 because I like to work offline too (plus, I’m a little old school — I’m used to Office). But Google Docs also works well. Let’s keep this short: If you’re not working in the cloud, it’s time to move there. I save about 1 hour per week by having easy access to all my documents (on all my devices) in the cloud. I only focus on working and sharing documents, spreadsheets, and presentations. I don’t want to think about anything else that’s involved with productivity. And that’s what these apps are great at. 6. The Free Calendar App On Your Phone Forget about to-do lists, fancy productivity apps, or anything else that promises you to get shit done. There’s only one thing that helps you to get things done: Your calendar. It’s so obvious that most of us ignore it. We prefer fancy looking to-do lists with all colors of the rainbow, and that make sounds when you check off an item. The research is clear: To-do lists don’t work. And yet, most people stick to them. Ditch the to-do list and use your calendar as your number one productivity tool. Take some time to plan your week. Ask: When will I do what? Then, schedule it in your calendar. I do this exercise every day. I promise that it will save you at least 15 minutes a day of updating your to-do list. 7. Tomighty I love working with the Pomodoro method. Research shows that it improves focus and the quality of your output. Whenever I don’t use an app like Tomighty, I just waste hours every day. This app can easily save you one hour per DAY. How? When you work in intervals, you get more done in less time because of the improved focus. In total, these 7 apps will shave at least 10 hours off your work week. And with practice, you can even double your time savings. As you might have noticed, productivity is all about eliminating time-wasting activities, and improving your focus. In that way you get the RIGHT things done, and you ultimately save a lot of hours every week. Start living more consciously of your time and productivity: Save your time for other, more important, things. If you do that, you can use those precious hours with your family, friends, spouse. Or you can spend the time to improve your skills. Because at the end of the ride, when you’re on your deathbed, you won’t think about all apps, tools, or resources you used. No, you’ll reflect on all the great things you did with them. So what are you waiting for? You have the tools you need to be successful. Only thing left is this: Go out and DO things with the resources you have. Originally posted on dariusforoux.com. Still curious? Hey, I’m Darius Foroux; thank you for reading this article. I research how to (1) overcome procrastination, (2) improve productivity, and (3) get things done. Every Monday and Thursday I publish a practical article related to those 3 topics. You can also sign up for my free newsletter receive my articles in your inbox. Little over 14,000 people have clicked the subscribe button already. Click here to join us. ", "title": "7 Productivity Apps That Shave 10 Hours Off Your Work Week", "sentences": [{"6c94": "7 Productivity Apps That Shave 10 Hours Off Your Work Week"}, {"132b": "Start living more consciously of your time and productivity so you can save your time for other, more important, things."}, {"2636": "Tools don’t matter. But if you use the right tools, your life can be a lot easier and better."}, {"80c8": "My general opinion about apps, tools, and resources is this: It doesn’t matter."}, {"90d1": "I say that because most people hide behind their apps. We’re always looking for the ONE app that will turn us into a productivity monster."}, {"1df8": "Or we believe that tools or other resources will help us do better work."}, {"f5f4": "YouTuber and filmmaker Casey Neistat makes this point very clear, he says:"}, {"dd13": "“The gear never matters. Tell a great story really well, and people will forgive whatever gear you shoot it on.”"}, {"e74c": "When it comes to writing, Stephen King has a similar approach. Whenever he’s asked about tools, he doesn’t even answer. If you want to become a better writer, he says:"}, {"3807": "“You learn best by reading a lot and writing a lot, and the most valuable lessons of all are the ones you teach yourself.”"}, {"6602": "I’m sure you know there’s only one way to get things done: Put your head down and work fucking hard. But often, we still think these type of thoughts:"}, {"3ef7": "These are all reasons we procrastinate. Now, of course, tools matter. But they are not the determining factor. You are."}, {"6c8e": "It’s not about the resources you have; it’s about what you do with them. Life is about resourcefulness. And that’s the point people like Casey Neistat and Stephen King want to make."}, {"5e7a": "What you’ll find next is a list of 7 of my favorite apps and how I use them. When you use the tools in the right way, you can easily save 10 hours per week."}, {"b4be": "1. Grammarly"}, {"1d64": "If you’re reading this, you’re probably a knowledge worker. And a knowledge worker’s primary weapon is her words."}, {"06ee": "I strongly believe that if you want to become a better communicator, it all starts on paper. Learn how to think and write well, and you will ultimately become better at speaking, sales, copywriting, programming, doing interviews, leading, etc."}, {"b889": "The very words you use are EVERYTHING in how you conduct yourself. Especially in an increasingly digital world where people shy away from face-to-face contact."}, {"4753": "And Grammarly is the best tool to help you with communicating. Most people think a grammar checker is only for writers."}, {"0337": "But I mainly use Grammarly’s browser extension for daily use. I use it for writing emails in Gmail, responding to comments, or any other site I have to write something."}, {"ccbd": "I also edit my articles with Grammarly (they also have an MS Office add-on). It checks for passive voice, grammatical, spelling, and punctuation mistakes."}, {"5335": "All in all, this app saves me about 30 minutes a day in sheer brainpower. With Grammarly, I can just focus on writing and communicating my message; they do the rest."}, {"0e1d": "2. Blinkist"}, {"1497": "Reading improves focus, productivity, creativity, and it reduces stress. The benefits are so great that it makes you think everybody should be reading books like crazy."}, {"f8fd": "Nope."}, {"6255": "23% of Americans have not read a single book in the past year. And the number of books people read per year are also not pretty. Only 28% reads more than 11 books per year."}, {"5770": "And I get it. Reading takes time. Plus, one of my main challenges is to select which books I’m going to read."}, {"3392": "In the past, I’ve often bought books, and quit them half-way through because they were not useful or interesting. That costs me time and money. That’s frustrating, especially because you can only read so many books every year."}, {"3e4f": "If you’re like me, your reading list grows faster than you cross off books, and that’s a problem. Why? You want to read the RIGHT books. You want to read books that make you grow; personally, professionally, financially."}, {"c5e9": "And I’ve finally found a solution to the question of: “What book should I read next?”"}, {"4f13": "Blinkist creates quality summaries of non-fiction books. Every day I read one book summary, and if I want to learn more, I get the actual book. If not, I just eliminate the book from my reading list."}, {"e8e6": "You have to be realistic; you just can’t read all the books in the world. And it’s important to figure out how you decide which books you’re going to read."}, {"68de": "Also, I don’t rely on reviews to select books because a book that’s useless to you can be valuable to me."}, {"1088": "3. Trello"}, {"f8be": "You should eliminate those two thoughts from your head. Why? Because they plant the seeds of something that’s called: WASTING TIME."}, {"9c67": "I use Trello as a backlog of tasks that I have to do. If you don’t know Trello; it’s a versatile project management tool that can be used in many ways."}, {"8e50": "With Trello you can create ‘boards’ for every project you have. And on every board, you can list all the actions you have to complete for that project."}, {"f759": "Every week I take some time to update my projects. That helps me to improve my focus, so I know what I have to do."}, {"f268": "Whenever I don’t know what to do, I open Trello: There’s ALWAYS something to do."}, {"635a": "4. Feedly / Medium"}, {"8776": "Browsing blogs remains one of the main sources of wasting time for most of us."}, {"06b1": "I have a simple tip for you: Stop clicking on articles you see in your social feeds."}, {"fbbc": "Most people open Facebook, Twitter, or even news sites, and they click on anything thing that looks slightly interesting."}, {"55c9": "DON’T."}, {"3fa3": "Instead, make a list of 5–10 blogs/authors you love to read. Then, add them to Feedly or follow the bloggers/publications on Medium. Every day, only read your articles through Feedly and Medium."}, {"28e4": "This saves at least 1 hour of mindless browsing per week."}, {"9c6c": "5. Office 365 / Google Docs"}, {"cd88": "I still meet a lot of entrepreneurs and freelancers who don’t work in the cloud. If you’re one of them, you’re wasting a lot of time."}, {"4ebb": "Just the few minutes it takes to open files from folders, save them on external drives, or share your documents with others, adds up quickly."}, {"c25a": "A few minutes here and there become a few hours a week, and hundreds of hours per year."}, {"1e97": "I use Office 365 because I like to work offline too (plus, I’m a little old school — I’m used to Office). But Google Docs also works well."}, {"635b": "Let’s keep this short: If you’re not working in the cloud, it’s time to move there."}, {"fbae": "I save about 1 hour per week by having easy access to all my documents (on all my devices) in the cloud. I only focus on working and sharing documents, spreadsheets, and presentations."}, {"88ec": "I don’t want to think about anything else that’s involved with productivity. And that’s what these apps are great at."}, {"49da": "6. The Free Calendar App On Your Phone"}, {"8c38": "Forget about to-do lists, fancy productivity apps, or anything else that promises you to get shit done."}, {"bf53": "There’s only one thing that helps you to get things done: Your calendar."}, {"c09b": "It’s so obvious that most of us ignore it. We prefer fancy looking to-do lists with all colors of the rainbow, and that make sounds when you check off an item."}, {"f5dd": "The research is clear: To-do lists don’t work. And yet, most people stick to them."}, {"e960": "Ditch the to-do list and use your calendar as your number one productivity tool. Take some time to plan your week. Ask: When will I do what? Then, schedule it in your calendar. I do this exercise every day."}, {"90ba": "I promise that it will save you at least 15 minutes a day of updating your to-do list."}, {"3635": "7. Tomighty"}, {"f71c": "I love working with the Pomodoro method. Research shows that it improves focus and the quality of your output."}, {"01bf": "Whenever I don’t use an app like Tomighty, I just waste hours every day. This app can easily save you one hour per DAY."}, {"45f2": "How? When you work in intervals, you get more done in less time because of the improved focus."}, {"5a8c": "In total, these 7 apps will shave at least 10 hours off your work week. And with practice, you can even double your time savings."}, {"8bf8": "As you might have noticed, productivity is all about eliminating time-wasting activities, and improving your focus."}, {"9617": "In that way you get the RIGHT things done, and you ultimately save a lot of hours every week."}, {"454e": "Start living more consciously of your time and productivity: Save your time for other, more important, things."}, {"958b": "If you do that, you can use those precious hours with your family, friends, spouse. Or you can spend the time to improve your skills."}, {"e60d": "Because at the end of the ride, when you’re on your deathbed, you won’t think about all apps, tools, or resources you used. No, you’ll reflect on all the great things you did with them."}, {"e30e": "So what are you waiting for? You have the tools you need to be successful. Only thing left is this: Go out and DO things with the resources you have."}, {"29f8": "Originally posted on dariusforoux.com."}, {"237d": "Still curious?"}, {"d606": "Hey, I’m Darius Foroux; thank you for reading this article."}, {"56f6": "I research how to (1) overcome procrastination, (2) improve productivity, and (3) get things done."}, {"c739": "Every Monday and Thursday I publish a practical article related to those 3 topics. You can also sign up for my free newsletter receive my articles in your inbox."}, {"de9b": "Little over 14,000 people have clicked the subscribe button already."}, {"14a6": "Click here to join us."}], "child": "312_1\t312_2\t312_3\t312_4\t312_5\t312_6\t312_7\t312_8\t312_9\t312_10\t312_11\t312_12\t312_13\t312_14\t312_15\t312_16\t312_17\t312_18\t312_19\t312_20\t312_21\t312_22\t312_23\t312_24\t312_25312_1\t312_2\t312_3\t312_4\t312_5\t312_6\t312_7\t312_8\t312_9\t312_10\t312_11\t312_12\t312_13\t312_14\t312_15\t312_16\t312_17\t312_18\t312_19\t312_20\t312_21\t312_22\t312_23\t312_24\t312_25"}