{"name": "317", "parent": "", "content": "Stop Chasing Opportunities Do you believe that more opportunities equal more chances of success? I sure did. And since we all want to feel important in this world, we think that the way to achieve that is to chase every single opportunity out there. I hear it often: “This is a big opportunity for me.” But that idea is broken. Chasing opportunities is a bad strategy. It’s more practical to chase skills, and PREPARE for opportunities. That’s a small tweak in your mindset, but it changes everything. Abraham Lincoln put it best: “I will prepare and some day my chance will come.” We’re always desperately looking for the next big opportunity. The next big business idea, technology to adopt, holiday to plan, house to buy, person to seduce, promotion to acquire. What are you pursuing in your life? Are you all over the place? Trying to make the best of everything? Chasing every single opportunity on your path? If you do that, this is you: Many opportunities. You’re just fooling yourself. You want it all, but you lack the courage to say no. So you say yes, and you put yourself in an impossible situation. Many priorities equal NO focus I must be honest — I’m talking to myself here. For most of my life, I’ve been moving from one opportunity to the other. That changed about two years ago when I decided to only focus on growing Vartex, my family business, and my blog. And that went well. I said no to everything else. But I was tempted by opportunities the last few months. Consulting, coaching, speaking, writing more books, starting other businesses, creating YouTube videos — things I either did or considered. But all it did was confuse me. I had too many priorities and zero focus. It was time for me to rethink my opportunities. However, it’s never a matter of finding opportunities. Everyone has opportunities. So it’s not about how many opportunities you have, it’s about how many opportunities you eliminate from your life. And that’s not easy. I decided to only focus on my business, blog, online courses, and podcasting. Just four things. They’re all very closely related. And I say no to every other opportunity. Opportunities are not only external Most opportunities come from within. Every time you think: “Should I pursue this?” You’re evaluating an opportunity. And that requires a lot of brainpower. So make your life easy, and DECIDE. Decide what you want to focus on in your career. What do you want to excel at? And do exactly that. Nothing else. “How many things should I focus on?” That’s a tough one. It depends on where you are in life. In the beginning of your career, I would pick one to make things easy. Just pick one skill and give it all your attention. But having just one skill in life will not get you far. When I look at people who are doing well in life, they often have combined several skills to get a competitive advantage. You also don’t want to be a jack of all trades. Otherwise, you’re okay at many things, but never exceptional at a few. “How do I know when opportunity knocks?” When you know that it requires hard work to actualize the opportunity. Thomas Edison put it nicely: “Opportunity is missed by most people because it is dressed in overalls and looks like work.” At the end of the day, an opportunity is just a chance of making something good happen. An opportunity alone means nothing. Give ten people the same opportunity, and you’ll get ten different outcomes. Opportunity = More Work (which is not always a good thing) Because you don’t want to work yourself to death, it’s best to pick your opportunities wisely. How? I ask myself two questions. And when you answer those questions honestly, you always get a handful of career opportunities. No one is good at 107 skills. And no one enjoys doing everything in the world. Remember that drawing from earlier? You’re chasing all opportunities, but you end up confused. Now, when you decide to pursue a few good opportunities that knock on your door, you get this: A few opportunities. Look, life is full of opportunity. You just have to figure out which opportunities you’re going after. And yes, that’s a hard thing to figure out. You also don’t control the opportunities that come your way. What do you control? How prepared you are. So stop chasing everything like a happy dog in the park on a summer day. Just keep things simple, work on your skills, character, and become better at a few things every single day. And when opportunity knocks, don’t be afraid of the work, grab it by the head and give it EVERYTHING YOU GOT. Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "Stop Chasing Opportunities", "sentences": [{"05c2": "Stop Chasing Opportunities"}, {"9cf5": "Do you believe that more opportunities equal more chances of success? I sure did."}, {"8ce5": "And since we all want to feel important in this world, we think that the way to achieve that is to chase every single opportunity out there."}, {"fa5a": "I hear it often: “This is a big opportunity for me.”"}, {"4181": "But that idea is broken. Chasing opportunities is a bad strategy. It’s more practical to chase skills, and PREPARE for opportunities."}, {"9687": "That’s a small tweak in your mindset, but it changes everything. Abraham Lincoln put it best:"}, {"8d34": "“I will prepare and some day my chance will come.”"}, {"ad5f": "We’re always desperately looking for the next big opportunity. The next big business idea, technology to adopt, holiday to plan, house to buy, person to seduce, promotion to acquire."}, {"a466": "What are you pursuing in your life?"}, {"3757": "Are you all over the place? Trying to make the best of everything? Chasing every single opportunity on your path? If you do that, this is you:"}, {"4643": "Many opportunities."}, {"f52a": "You’re just fooling yourself. You want it all, but you lack the courage to say no. So you say yes, and you put yourself in an impossible situation."}, {"6610": "Many priorities equal NO focus"}, {"ef77": "I must be honest — I’m talking to myself here. For most of my life, I’ve been moving from one opportunity to the other. That changed about two years ago when I decided to only focus on growing Vartex, my family business, and my blog."}, {"5edf": "And that went well. I said no to everything else. But I was tempted by opportunities the last few months. Consulting, coaching, speaking, writing more books, starting other businesses, creating YouTube videos — things I either did or considered."}, {"d87a": "But all it did was confuse me. I had too many priorities and zero focus. It was time for me to rethink my opportunities."}, {"0e77": "However, it’s never a matter of finding opportunities. Everyone has opportunities. So it’s not about how many opportunities you have, it’s about how many opportunities you eliminate from your life. And that’s not easy."}, {"9cb7": "I decided to only focus on my business, blog, online courses, and podcasting. Just four things. They’re all very closely related. And I say no to every other opportunity."}, {"cdd9": "Opportunities are not only external"}, {"d2b7": "Most opportunities come from within. Every time you think: “Should I pursue this?” You’re evaluating an opportunity."}, {"53d5": "And that requires a lot of brainpower. So make your life easy, and DECIDE."}, {"3ff1": "Decide what you want to focus on in your career."}, {"be81": "What do you want to excel at? And do exactly that. Nothing else."}, {"2c69": "“How many things should I focus on?”"}, {"1a22": "That’s a tough one. It depends on where you are in life. In the beginning of your career, I would pick one to make things easy. Just pick one skill and give it all your attention."}, {"0f07": "But having just one skill in life will not get you far. When I look at people who are doing well in life, they often have combined several skills to get a competitive advantage."}, {"7fc6": "You also don’t want to be a jack of all trades. Otherwise, you’re okay at many things, but never exceptional at a few."}, {"3267": "“How do I know when opportunity knocks?”"}, {"8920": "When you know that it requires hard work to actualize the opportunity. Thomas Edison put it nicely:"}, {"867c": "“Opportunity is missed by most people because it is dressed in overalls and looks like work.”"}, {"c03f": "At the end of the day, an opportunity is just a chance of making something good happen. An opportunity alone means nothing. Give ten people the same opportunity, and you’ll get ten different outcomes."}, {"2401": "Opportunity = More Work (which is not always a good thing)"}, {"4f56": "Because you don’t want to work yourself to death, it’s best to pick your opportunities wisely. How? I ask myself two questions."}, {"ab2f": "And when you answer those questions honestly, you always get a handful of career opportunities. No one is good at 107 skills. And no one enjoys doing everything in the world."}, {"5451": "Remember that drawing from earlier? You’re chasing all opportunities, but you end up confused."}, {"6019": "Now, when you decide to pursue a few good opportunities that knock on your door, you get this:"}, {"e19b": "A few opportunities."}, {"b6a9": "Look, life is full of opportunity. You just have to figure out which opportunities you’re going after. And yes, that’s a hard thing to figure out. You also don’t control the opportunities that come your way."}, {"b60e": "What do you control? How prepared you are. So stop chasing everything like a happy dog in the park on a summer day. Just keep things simple, work on your skills, character, and become better at a few things every single day."}, {"d4ac": "And when opportunity knocks, don’t be afraid of the work, grab it by the head and give it EVERYTHING YOU GOT."}, {"47c2": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "317_1\t317_2\t317_3\t317_4\t317_5\t317_6\t317_7\t317_8\t317_9\t317_10\t317_11\t317_12\t317_13\t317_14\t317_15\t317_16\t317_17\t317_18\t317_19\t317_20\t317_21\t317_22\t317_23\t317_24\t317_25317_1\t317_2\t317_3\t317_4\t317_5\t317_6\t317_7\t317_8\t317_9\t317_10\t317_11\t317_12\t317_13\t317_14\t317_15\t317_16\t317_17\t317_18\t317_19\t317_20\t317_21\t317_22\t317_23\t317_24\t317_25"}