{"name": "318", "parent": "", "content": "Get Rid Of Your High Expectations How many times in your life have you experienced hurt, disappointment, anger, or stress, from the difference between your imagination and reality? We’re very creative creatures. And when we set out to do things, we always expect that everything will turn out exactly the way we want. Does this sound familiar? Chances of those scenarios coming true? I don’t know exactly. But I guess it’s somewhere close to ZERO. I’m not trying to bash your dreams here. But a little pragmatism can never hurt. It’s not practical to have high expectations because they hardly come true. So why have them in the first place? They do more harm than good. When I was getting a master’s degree in business administration, I was secretly rubbing my hands all time. I thought that all the multinationals would line up to hire me. And because I specialized in marketing, I thought I could start any company and turn it into a success. But when I got my degree over six years ago, there was a financial crisis going on. Only one or two of my friends, classmates, and people I knew got hired by large firms. The rest took shitty jobs because it was slim pickings. I started a business. But that wasn’t too pretty either. We bootstrapped the business. And I basically earned enough money to pay for my living expenses for the first three years. That was my goodbye to high expectations. Don’t get me wrong: I’m not saying you shouldn’t have high standards or aim high in life. Those things are good. But just don’t rely on your imagination for timelines and outcomes. It’s counterproductive. Barry Schwartz, a psychologist, and author of The Paradox of Choice, put it best: “The secret to happiness is low expectations.” Now, this is not new information. Most of us know that high expectations are not helpful. Why do we still have them? We still desire more, more, more. And when you want more, you expect more. You see? You can’t fix your expectations without fixing your desires. “But how can you get the most out of life and not strive for more? That doesn’t make sense.” Well, a lot of things in life don’t make sense. But here’s the thing: When you desire more, you also have more options. “What should I do? Work more? Earn more money? Help more people? Spend more time with my family?” In general, having more options is a bad thing. More means confusion. And confusion often results in anxiety and regret. Do you know this feeling: “What if I made the wrong decision?” So more isn’t better. What’s wrong with 0.1% growth? Or with making less money and having more time for personal things? “Yeah, but I want it all!” Now we’re getting somewhere. You want it all! And I’m not saying that it’s not possible. Just don’t expect it. Don’t expect the world from yourself. And more importantly: Don’t expect so much from others. No one’s perfect. People will disappoint you sometimes. And vice versa. Accept that it’s not the end of the world. When you live your life free of expectations, you see things for what they are. Don’t wish that things were better. Make them better. Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "Get Rid Of Your High Expectations", "sentences": [{"4a14": "Get Rid Of Your High Expectations"}, {"218f": "How many times in your life have you experienced hurt, disappointment, anger, or stress, from the difference between your imagination and reality?"}, {"f427": "We’re very creative creatures. And when we set out to do things, we always expect that everything will turn out exactly the way we want. Does this sound familiar?"}, {"309b": "Chances of those scenarios coming true? I don’t know exactly. But I guess it’s somewhere close to ZERO."}, {"a8f2": "I’m not trying to bash your dreams here. But a little pragmatism can never hurt. It’s not practical to have high expectations because they hardly come true. So why have them in the first place?"}, {"f53e": "They do more harm than good. When I was getting a master’s degree in business administration, I was secretly rubbing my hands all time."}, {"a3fe": "I thought that all the multinationals would line up to hire me. And because I specialized in marketing, I thought I could start any company and turn it into a success."}, {"cb7e": "But when I got my degree over six years ago, there was a financial crisis going on. Only one or two of my friends, classmates, and people I knew got hired by large firms. The rest took shitty jobs because it was slim pickings."}, {"c820": "I started a business. But that wasn’t too pretty either. We bootstrapped the business. And I basically earned enough money to pay for my living expenses for the first three years."}, {"0e6e": "That was my goodbye to high expectations."}, {"eab4": "Don’t get me wrong: I’m not saying you shouldn’t have high standards or aim high in life. Those things are good. But just don’t rely on your imagination for timelines and outcomes."}, {"0204": "It’s counterproductive."}, {"b360": "Barry Schwartz, a psychologist, and author of The Paradox of Choice, put it best:"}, {"2c0b": "“The secret to happiness is low expectations.”"}, {"e6cf": "Now, this is not new information. Most of us know that high expectations are not helpful. Why do we still have them?"}, {"a01a": "We still desire more, more, more. And when you want more, you expect more."}, {"da2a": "You see? You can’t fix your expectations without fixing your desires."}, {"a78a": "“But how can you get the most out of life and not strive for more? That doesn’t make sense.”"}, {"ef84": "Well, a lot of things in life don’t make sense. But here’s the thing: When you desire more, you also have more options."}, {"a2aa": "“What should I do? Work more? Earn more money? Help more people? Spend more time with my family?”"}, {"0c66": "In general, having more options is a bad thing. More means confusion. And confusion often results in anxiety and regret. Do you know this feeling: “What if I made the wrong decision?”"}, {"b587": "So more isn’t better. What’s wrong with 0.1% growth? Or with making less money and having more time for personal things?"}, {"776e": "“Yeah, but I want it all!”"}, {"7fb8": "Now we’re getting somewhere. You want it all! And I’m not saying that it’s not possible. Just don’t expect it. Don’t expect the world from yourself."}, {"7765": "And more importantly: Don’t expect so much from others. No one’s perfect. People will disappoint you sometimes. And vice versa. Accept that it’s not the end of the world."}, {"f14b": "When you live your life free of expectations, you see things for what they are."}, {"0546": "Don’t wish that things were better. Make them better."}, {"2b00": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "318_1\t318_2\t318_3\t318_4\t318_5\t318_6\t318_7\t318_8\t318_9\t318_10\t318_11\t318_12\t318_13\t318_14\t318_15\t318_16\t318_17\t318_18\t318_19\t318_20\t318_21\t318_22\t318_23\t318_24\t318_25318_1\t318_2\t318_3\t318_4\t318_5\t318_6\t318_7\t318_8\t318_9\t318_10\t318_11\t318_12\t318_13\t318_14\t318_15\t318_16\t318_17\t318_18\t318_19\t318_20\t318_21\t318_22\t318_23\t318_24\t318_25"}