{"name": "319", "parent": "", "content": "I Have 15 ideas To Change Your Life. Do you Have 5 Minutes? I’m the last person to say that life is easy. I don’t think that’s the case at all. But there’s one thing I’ve learned in recent years that changed everything. They way you THINK determines the outcome of your life. But thinking is hard. That’s why we don’t do it often enough. Helen Keller said it best: “People don’t like to think, if one thinks, one must reach conclusions. Conclusions are not always pleasant.” I’ll show you 15 thoughts about life that will forever transform the way you live. Ready? Let’s go. 1: Think big, act small Want to build a big company? Change people’s lives? Make a contribution to the world? Earn a million bucks? Never let anything hold you back when you think of ideas. So what? You might as well aim high. You’ve got nothing to lose. Just make sure you act small. Put in the work and stay practical. All you need is one big win anyway. But when you aim low, the outcome is always low. 2: Problems are unanswered questions I don’t get why people freak out when they encounter a problem. “This is the worst thing ever!” Every time you experience stress over a problem, you’re basically sabotaging your life. It’s completely unnecessary to ever freak out. Remember this: A problem is nothing but an unanswered question. So stay calm. And figure out the answer. 3: Build relationships on a firm foundation Here are some wrong reasons to be in a relationship: Money, fear of being alone, abuse, needing attention. If your relationship sucks, and you’ve tried to improve it multiple times, it’s time to move on. Love has no opposite. When you love someone, you can’t hate them at the same time. The foundation of all relationships should be based on: Love, respect, support, trust, patience, good company, laughter, sadness, and more support. 4: Nothing in life is free No matter how you spin it, you always pay for something with money, time (the most valuable thing you have), or other resources. Life is business. And smart business people spend their resources wisely. How? Be calculated. Never waste resources (especially time). 5: Never be afraid of making decisions You might think that making no decision at all can do no harm, but you’re wrong. The worst thing about making decisions is when you don’t pull the trigger. Waiting, postponing, doubting, researching too much — it’s all not useful. Get your act together, and decide firmly whenever you have to make one. And when you made the wrong decision, apologize, and make another decision. 6: Decide to become a leader today Sometimes you’re a leader, sometimes you’re a follower. You can be a leader at work, and a follower at home. There’s nothing wrong with that. And being a leader also has nothing to do with your title. You know what is wrong? When everyone looks at each other because no one wants to take responsibility. Decide that you will take responsibility. There you go: You’re a leader now. 7: Productivity yields results There’s only one thing that helps you to go from nothing to something: Work. I don’t care how smart you work, you still have to put in the work. Just make sure you value effectiveness over everything. Results matter. Get things done and move on to the next thing. 8: See yourself as a salesperson Everyone is a salesperson. When you’re dating, you’re selling yourself. Same is true when you’re applying for a job. When you sell, be transparent, honest, and to the point. Don’t waste your time on people who don’t like you anyway. Sales is not about how many people don’t want you or your product. It’s about finding the people who do. 9: If you want to improve your self-confidence, improve your skills If you don’t believe in yourself, don’t try to search for it in motivational posts, talks, or books. You only improve your self-confidence by becoming good at something. How do you get good? By learning, doing, seeing results, and repeating that process for years. Your confidence will grow slowly every day. 10: Value your friends We’re social animals. When we’re alone, we die early. You might think you don’t need friends, but you do. So be nice to each other. And respect that your friends also have lives of their own. Especially when you grow older, and have more responsibilities (and less time). Things change. People also change. But the connection stays. 11: Don’t believe everything you see We live in a “Look at me! Look at me!” world. Everyone wants to be famous and they do everything to keep up appearances. Don’t believe all the success stories you see everywhere. YouTubers, Instagram models, millionaire entrepreneurs: They seem perfect. But you only see the outside. You don’t have to be a cynic. Just don’t take appearances for facts. 12: Learn to love criticism When someone takes the time to give you criticism, you should be thankful. Why? It’s fuel for you. You can use criticism to improve yourself, your product, or your service. Or, if the criticism makes no sense, it can make you angry, which is also a good thing. That type of anger is useful. “I’ll show them!” Never be a wimp. Take criticism like a champ. 13: If you can’t take care of your body, you can’t take care of anything Whether you like it or not, you don’t fully control your health. You can only influence it by eating healthy, exercising, and not using your body as a toilet. Just get off your ass and get moving, you lazy mofo. And I’m not talking about keeping it up for a few days. No, do it every single day of your healthy life. Because if you can’t do that, what can you do? See it as practice for the difficult times of life because the stronger you are, the better. 14: Happiness is a choice You control your thoughts. That means you decide what you do with your life. If you’re unsatisfied, angry, or frustrated, that’s all you. I always thought: “I can never be happy. I need to be rich, own a fancy car, and buy a big house.” But I was thinking all wrong. You can be happy with your current life. All it takes is a decision. And when it improves, you’ll still be happy. 15: Create something When you create something (doesn’t matter what it is), you’re actively doing something. You either solve a problem or entertain people. So instead of consuming so much information, products, and entertainment from others, spend a fraction of that time on creating something yourself. You don’t have to create something by yourself, you can also do it with others. No matter what you do: Make yourself useful. So don’t just sit there and read another article; go out and do something. What are you still doing here anyway? Go on already! Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "I Have 15 ideas To Change Your Life. Do you Have 5 Minutes?", "sentences": [{"6707": "I Have 15 ideas To Change Your Life. Do you Have 5 Minutes?"}, {"e344": "I’m the last person to say that life is easy. I don’t think that’s the case at all. But there’s one thing I’ve learned in recent years that changed everything."}, {"cd34": "They way you THINK determines the outcome of your life. But thinking is hard. That’s why we don’t do it often enough. Helen Keller said it best:"}, {"f8df": "“People don’t like to think, if one thinks, one must reach conclusions. Conclusions are not always pleasant.”"}, {"d0c3": "I’ll show you 15 thoughts about life that will forever transform the way you live. Ready? Let’s go."}, {"8a14": "1: Think big, act small"}, {"3223": "Want to build a big company? Change people’s lives? Make a contribution to the world? Earn a million bucks?"}, {"f0bc": "Never let anything hold you back when you think of ideas."}, {"83fb": "So what? You might as well aim high. You’ve got nothing to lose. Just make sure you act small. Put in the work and stay practical. All you need is one big win anyway. But when you aim low, the outcome is always low."}, {"b4d3": "2: Problems are unanswered questions"}, {"3f8f": "I don’t get why people freak out when they encounter a problem. “This is the worst thing ever!” Every time you experience stress over a problem, you’re basically sabotaging your life. It’s completely unnecessary to ever freak out."}, {"be55": "Remember this: A problem is nothing but an unanswered question. So stay calm. And figure out the answer."}, {"d0e7": "3: Build relationships on a firm foundation"}, {"23ca": "Here are some wrong reasons to be in a relationship: Money, fear of being alone, abuse, needing attention. If your relationship sucks, and you’ve tried to improve it multiple times, it’s time to move on."}, {"a7da": "Love has no opposite. When you love someone, you can’t hate them at the same time. The foundation of all relationships should be based on: Love, respect, support, trust, patience, good company, laughter, sadness, and more support."}, {"e709": "4: Nothing in life is free"}, {"f8e9": "No matter how you spin it, you always pay for something with money, time (the most valuable thing you have), or other resources."}, {"b0c3": "Life is business. And smart business people spend their resources wisely. How? Be calculated. Never waste resources (especially time)."}, {"37f8": "5: Never be afraid of making decisions"}, {"b6dd": "You might think that making no decision at all can do no harm, but you’re wrong. The worst thing about making decisions is when you don’t pull the trigger."}, {"84b2": "Waiting, postponing, doubting, researching too much — it’s all not useful. Get your act together, and decide firmly whenever you have to make one. And when you made the wrong decision, apologize, and make another decision."}, {"bd04": "6: Decide to become a leader today"}, {"717b": "Sometimes you’re a leader, sometimes you’re a follower. You can be a leader at work, and a follower at home. There’s nothing wrong with that. And being a leader also has nothing to do with your title."}, {"4d15": "You know what is wrong? When everyone looks at each other because no one wants to take responsibility. Decide that you will take responsibility. There you go: You’re a leader now."}, {"9454": "7: Productivity yields results"}, {"55e4": "There’s only one thing that helps you to go from nothing to something: Work. I don’t care how smart you work, you still have to put in the work."}, {"551b": "Just make sure you value effectiveness over everything. Results matter. Get things done and move on to the next thing."}, {"bcdf": "8: See yourself as a salesperson"}, {"8597": "Everyone is a salesperson. When you’re dating, you’re selling yourself. Same is true when you’re applying for a job."}, {"95a5": "When you sell, be transparent, honest, and to the point. Don’t waste your time on people who don’t like you anyway. Sales is not about how many people don’t want you or your product. It’s about finding the people who do."}, {"094b": "9: If you want to improve your self-confidence, improve your skills"}, {"76a3": "If you don’t believe in yourself, don’t try to search for it in motivational posts, talks, or books."}, {"8144": "You only improve your self-confidence by becoming good at something. How do you get good? By learning, doing, seeing results, and repeating that process for years. Your confidence will grow slowly every day."}, {"68ee": "10: Value your friends"}, {"4028": "We’re social animals. When we’re alone, we die early. You might think you don’t need friends, but you do. So be nice to each other. And respect that your friends also have lives of their own."}, {"e840": "Especially when you grow older, and have more responsibilities (and less time). Things change. People also change. But the connection stays."}, {"2e09": "11: Don’t believe everything you see"}, {"20bf": "We live in a “Look at me! Look at me!” world. Everyone wants to be famous and they do everything to keep up appearances."}, {"6eda": "Don’t believe all the success stories you see everywhere. YouTubers, Instagram models, millionaire entrepreneurs: They seem perfect. But you only see the outside. You don’t have to be a cynic. Just don’t take appearances for facts."}, {"976e": "12: Learn to love criticism"}, {"4f42": "When someone takes the time to give you criticism, you should be thankful. Why? It’s fuel for you."}, {"efe3": "You can use criticism to improve yourself, your product, or your service. Or, if the criticism makes no sense, it can make you angry, which is also a good thing. That type of anger is useful. “I’ll show them!”"}, {"6659": "Never be a wimp. Take criticism like a champ."}, {"c720": "13: If you can’t take care of your body, you can’t take care of anything"}, {"8c4e": "Whether you like it or not, you don’t fully control your health. You can only influence it by eating healthy, exercising, and not using your body as a toilet."}, {"288c": "Just get off your ass and get moving, you lazy mofo. And I’m not talking about keeping it up for a few days. No, do it every single day of your healthy life. Because if you can’t do that, what can you do? See it as practice for the difficult times of life because the stronger you are, the better."}, {"1b62": "14: Happiness is a choice"}, {"d80b": "You control your thoughts. That means you decide what you do with your life. If you’re unsatisfied, angry, or frustrated, that’s all you."}, {"fdde": "I always thought: “I can never be happy. I need to be rich, own a fancy car, and buy a big house.”"}, {"3bb5": "But I was thinking all wrong. You can be happy with your current life. All it takes is a decision. And when it improves, you’ll still be happy."}, {"0753": "15: Create something"}, {"f0c7": "When you create something (doesn’t matter what it is), you’re actively doing something. You either solve a problem or entertain people."}, {"17df": "So instead of consuming so much information, products, and entertainment from others, spend a fraction of that time on creating something yourself. You don’t have to create something by yourself, you can also do it with others."}, {"6598": "No matter what you do: Make yourself useful."}, {"e522": "So don’t just sit there and read another article; go out and do something."}, {"43ea": "What are you still doing here anyway? Go on already!"}, {"2f55": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "319_1\t319_2\t319_3\t319_4\t319_5\t319_6\t319_7\t319_8\t319_9\t319_10\t319_11\t319_12\t319_13\t319_14\t319_15\t319_16\t319_17\t319_18\t319_19\t319_20\t319_21\t319_22\t319_23\t319_24\t319_25319_1\t319_2\t319_3\t319_4\t319_5\t319_6\t319_7\t319_8\t319_9\t319_10\t319_11\t319_12\t319_13\t319_14\t319_15\t319_16\t319_17\t319_18\t319_19\t319_20\t319_21\t319_22\t319_23\t319_24\t319_25"}