{"content": "The Rockets May Have Lost, but James Harden’s Crossover Won The probable MVP showed off his signature move against the Warriors The Rockets played the Warriors at home on Tuesday, in a clash with zero playoff implications. With a handful of games to go — and barring supernatural, mathematically impossible collapses — the 1–4 seeds in the Western Conference are locked up. San Antonio can light a fire under Golden State by winning out, but the latter closes with six of its last seven games at home, in Oracle Arena, where it’s too loud to see. So Tuesday night’s game was an opportunity for statements, and statements were made. The Warriors continued on looking a lot like their 2014–15 selves and, with some suspense, eventually won 113–106. But this ain’t ’bout that. Before we go any further, I want to ask for forgiveness. 2015 was a different time, and I was a different person. A few months ago, my colleague Shea Serrano named James Harden’s signature move the Extend-o-Arms Drive, a dreadfully inevitable thing that occurs in three parts. While that last part — dragging the ball up through a thicket of swaying arms to somehow twist it in off the glass — is the most infuriating, that first part — the crossover that starts the drive — is the most crucial. It’s also the most mesmerizing, because it’s both the fastest and slowest thing I’ve ever seen. Each time I watch it, I feel wrong-footed — even when I’m sitting down — and steam billows from my ears while my brain attempts to keep pace with my eyes. At least that’s what happened when Harden put Draymond Green on an island in the first quarter. James Michael McAdoo batted away the layup attempt, but we’re not going to complicate this appreciation with something as pointless as results. A hypothetical: If you had to guard James Harden one-on-one, do you think you could stop him from getting to the basket? I’ll even give Harden ankle weights. Show of hands. Liars. A second hypothetical: If this matchup was to be filmed by smartphones from every possible angle and then immediately uploaded to YouTube for all posterity, would you even try? I wouldn’t. Harden finished with 24 points, 11 rebounds, and 13 assists for his 20th triple-double of the season, and did it all with a jammed left wrist. ", "child": "32_1\t32_2\t32_3\t32_4\t32_5\t32_6\t32_7\t32_8\t32_9", "title": "The Rockets May Have Lost, but James Harden’s Crossover Won", "parent": "", "sentences": [{"8a71": "The Rockets May Have Lost, but James Harden’s Crossover Won"}, {"fff6": "The probable MVP showed off his signature move against the Warriors"}, {"4be7": "The Rockets played the Warriors at home on Tuesday, in a clash with zero playoff implications. With a handful of games to go — and barring supernatural, mathematically impossible collapses — the 1–4 seeds in the Western Conference are locked up. San Antonio can light a fire under Golden State by winning out, but the latter closes with six of its last seven games at home, in Oracle Arena, where it’s too loud to see."}, {"cb80": "So Tuesday night’s game was an opportunity for statements, and statements were made."}, {"1b58": "The Warriors continued on looking a lot like their 2014–15 selves and, with some suspense, eventually won 113–106. But this ain’t ’bout that."}, {"1285": "Before we go any further, I want to ask for forgiveness. 2015 was a different time, and I was a different person."}, {"90d1": "A few months ago, my colleague Shea Serrano named James Harden’s signature move the Extend-o-Arms Drive, a dreadfully inevitable thing that occurs in three parts. While that last part — dragging the ball up through a thicket of swaying arms to somehow twist it in off the glass — is the most infuriating, that first part — the crossover that starts the drive — is the most crucial. It’s also the most mesmerizing, because it’s both the fastest and slowest thing I’ve ever seen."}, {"0614": "Each time I watch it, I feel wrong-footed — even when I’m sitting down — and steam billows from my ears while my brain attempts to keep pace with my eyes. At least that’s what happened when Harden put Draymond Green on an island in the first quarter."}, {"9bfe": "James Michael McAdoo batted away the layup attempt, but we’re not going to complicate this appreciation with something as pointless as results."}, {"8c14": "A hypothetical: If you had to guard James Harden one-on-one, do you think you could stop him from getting to the basket? I’ll even give Harden ankle weights. Show of hands."}, {"3452": "Liars."}, {"0060": "A second hypothetical: If this matchup was to be filmed by smartphones from every possible angle and then immediately uploaded to YouTube for all posterity, would you even try? I wouldn’t."}, {"8c9e": "Harden finished with 24 points, 11 rebounds, and 13 assists for his 20th triple-double of the season, and did it all with a jammed left wrist."}], "name": "32"}