{"name": "321", "parent": "", "content": "The Habits Of Unproductive People You Don’t Want To Copy The reason I study productivity is because I’m an unproductive person. I truly am. I sleep too much. I talk too much. I read too much. I listen to music all day. I watch movies. I buy gadgets that turn me into a zombie. If it wasn’t for my productivity system, get nothing done. I wouldn’t even write this article. But if you browse social media, all you see is super productive, healthy, and wealthy people. Is that really the case? I don’t know. I just know this: You can’t be productive 24/7. And a big part of being productive is about getting rid of unproductive habits we all have. What follows is a list of ten unproductive habits that I learned to do less, or eliminate. Do you have a few of these habits? Don’t worry, we’re all unproductive at times. But if you have five or more, it might be time to change. One thing is sure: No one wants to be an unproductive person. Working Too Much Some days I can work 12 or 13 hours straight. I just take a break for exercising and eating. And I can keep that up for a few days. But after a few days, there always comes a crash. Big time. I struggle. I can’t get stuff done. I don’ even want to get stuff done. It’s not good. So I learned to be more calculated with how much I work. Hemingway tried to stop when he was going good. That’s also my new goal. But that’s hard because we always want things fast, fast, quick, quick, now, now. Just know yourself, your work, and your deadlines. Don’t have a deadline? Take it easy because you need that juice for stressful times. And most importantly: Have patience. Worrying Too Much What if I go broke? What if I lose my job? What if she doesn’t love me? What if I get cancer? What if this plane crashes? What if I lose my sight? What if I…? You got your head so far in the sand like an ostrich that you can’t see how self-absorbed that way of thinking is. It’s always about me, me, me. I know all about it. The above examples are all from my personal life. I used to be the king of the ‘what if’ game. But here’s the thing: YOU’RE NOT GOING TO DIE RIGHT THIS SECOND. Get over yourself. Stop worrying. And do something useful. (I know, it’s not that simple, but still: You can learn how to stop worrying.) Being Stubborn We deal with people all the time. Do you ever think: “Why should I listen to this guy?” Or: “What does she know?” I don’t know. Maybe more than you do? We just don’t know until we listen to others. But if you always think you’re the best in the world, you never give people a chance. I think everyone is stubborn. Some are extreme, and some are just a little stubborn. I must say, stubbornness is also a good trait. It’s good to be deaf to critics and not about care what people think. But being stubborn in relationships is plain frustrating. That kind of stubbornness is not good. And it just so happens to be that life is based on relationships. And your career too. So when you refuse to work with others, you’re sabotaging everyone else that’s involved. Just remember that. I try to remind myself often that stubbornness can be bad. But sometimes it’s so bad I don’t even listen to myself. But I keep trying. Checking Things What are you doing? “I was just checking Facebook.” What are you ‘checking’? Email? TMZ? CNN? NBA? NFL? Instagram? Twitter? Snapchat? Checking is not a useful thing. It might be a verb, but it’s not a real action. When I started blogging, I always checked my stats for no reason. Then I thought: What’s the outcome of checking? Nothing. You just consume information. I try to keep my ‘checking’ at a minimum. That’s why deleted all news and social media apps on my phone. I don’t even have email on my phone. Otherwise, I check it all the time. I don’t want that. I only want to check my email when I have time to answer emails. Checking is a habit that you can never fully eliminate. I still follow the NBA because I like it. Pick only one or two ‘checking’ vices you actually like. Eliminate the rest. You’re not missing anything anyway. Escaping Life Until two years ago, every time I’d get stressed out, I said stuff like: “I need a drink.” Or: “I have to go on a vacation.” And when I had issues at work or in my relationship that became too much to handle, I preferred to pretend they didn’t exist. Sometimes I would take some time to talk about it. But there are always deeper issues at play. Back then I didn’t like my job, relationship, and the city I lived in. I basically didn’t like my life. Did I change it? Nope. I always tried to escape my issues. Escaping problems gives you some stamina to face your shitty life again. But you and I both know that problems never go away until you grab them by the root and extinguish them. I learned that the hard way. These days I deal with problems before they become big problems. Saying Yes Most people are afraid to say no. Maybe you don’t want to let people down. Maybe you are uncomfortable with the word no. I don’t know. Doesn’t matter, really. What matters is this: If you keep saying yes, you’re living someone else’s life. Think about it. Deep down, we all know that it’s true. We’re not even in control of our own time. Want to be in full control of your life? Say no to a million things and yes to a few things that matter. Not Writing Things Down Yeah, yeah, you have the memory of an elephant. Or you’re so smart that you remember everything, right? WRONG. Not writing down your thoughts, ideas, tasks, etc, is stupid. Why? Because you’re wasting a lot of brain power when you rely on your memory. When you write everything down, you can use your brainpower for other things. Like solving problems. That’s actually useful and advances your career. If you journal, that’s even better. But I’ve found that not everyone likes the idea of journaling. So let’s just call it ‘writing things down.’ What did you write down while you’re reading this article? Being Hard On Yourself “I suck!” No, you don’t. “Why?” You got out of bed this morning, right? “Yeah.” Congratulations. You survived this fucking hard thing called LIFE. Be proud of yourself. Everything you do after getting out of bed is a win. Neglecting Your Personal Education “Woohoo! I finished college. Goodbye lame old books!” If that was you, no matter how long ago, you DO suck. Who learns one thing and stops forever? I don’t even know why we have that idea planted in our brain. I always thought that learning stops when you get out of school. But the truth is: Your life stops when learning stops. Invest in yourself. Learn something. Read books. Get courses. Watch videos. Do it from home or go places. It doesn’t matter. Just learn new things. You’ll be more productive and more excited about life. Hating Rules I saved the best for last. Most people hate rules, right? It starts when we’re kids. “Why do I have to do this? Why do I have to do that?” Because it’s better for you! That’s why! (you weird kid) But when we’re adults, we don’t have to follow rules (other than actual rules set by the government, but you get what I’m talking about.) “Rules are dumb!” That’s what I always believed. I thought I was a maverick. But I was an idiot. Rules are actually THE BEST thing about life. Without rules, we would be hot dog eating pigs right now. And when it comes to productivity, the first rule is: Have rules. If you want to live without rules, go ahead. But life is not Fight Club. Rules actually help us to solve problems and get the most out of life. Josh Weltman, an advertising creative director for 25+ years, and the co-producer of Mad Men, put it well in his book Seducing Strangers: “Solving a problem requires a weird combination of freedom and constraint. Whenever I hear “Just have fun with it” or “Think outside the box,” I know from experience that things are about to turn into a colossal waste of time.” Good news: You make up the rules. For example, one of my personal rules is this: Never complain. Another one is: Read and exercise every day. And: Close the day every evening by setting your next day’s priorities. When you combine all your productivity rules, you have a system. Voila! And a system changes everything. I rely on my system to work smarter, better, happier, and effectively. It took me years to figure out that a system is a good thing, and a few more years to create one, but it was worth it. Because now, I get to be a productive person. Not bad for an unproductive person, huh? Thanks for reading! This article was originally published on dariusforoux.com. ", "title": "The Habits Of Unproductive People You Don’t Want To Copy", "sentences": [{"c8dd": "The Habits Of Unproductive People You Don’t Want To Copy"}, {"8995": "The reason I study productivity is because I’m an unproductive person. I truly am."}, {"f300": "I sleep too much. I talk too much. I read too much. I listen to music all day. I watch movies. I buy gadgets that turn me into a zombie."}, {"ff38": "If it wasn’t for my productivity system, get nothing done. I wouldn’t even write this article. But if you browse social media, all you see is super productive, healthy, and wealthy people. Is that really the case?"}, {"c5d0": "I don’t know. I just know this: You can’t be productive 24/7. And a big part of being productive is about getting rid of unproductive habits we all have."}, {"65b3": "What follows is a list of ten unproductive habits that I learned to do less, or eliminate."}, {"be29": "Do you have a few of these habits? Don’t worry, we’re all unproductive at times. But if you have five or more, it might be time to change."}, {"fd11": "One thing is sure: No one wants to be an unproductive person."}, {"9420": "Working Too Much"}, {"fe1f": "Some days I can work 12 or 13 hours straight. I just take a break for exercising and eating. And I can keep that up for a few days."}, {"b527": "But after a few days, there always comes a crash. Big time. I struggle. I can’t get stuff done. I don’ even want to get stuff done."}, {"2ce2": "It’s not good. So I learned to be more calculated with how much I work. Hemingway tried to stop when he was going good."}, {"1461": "That’s also my new goal. But that’s hard because we always want things fast, fast, quick, quick, now, now."}, {"de1e": "Just know yourself, your work, and your deadlines. Don’t have a deadline? Take it easy because you need that juice for stressful times."}, {"ed83": "And most importantly: Have patience."}, {"25d4": "Worrying Too Much"}, {"3c0b": "What if I go broke? What if I lose my job? What if she doesn’t love me? What if I get cancer? What if this plane crashes? What if I lose my sight? What if I…?"}, {"5986": "You got your head so far in the sand like an ostrich that you can’t see how self-absorbed that way of thinking is. It’s always about me, me, me."}, {"660b": "I know all about it. The above examples are all from my personal life. I used to be the king of the ‘what if’ game. But here’s the thing:"}, {"62ea": "YOU’RE NOT GOING TO DIE RIGHT THIS SECOND."}, {"c84a": "Get over yourself. Stop worrying. And do something useful."}, {"c4cb": "(I know, it’s not that simple, but still: You can learn how to stop worrying.)"}, {"e400": "Being Stubborn"}, {"2f2a": "We deal with people all the time. Do you ever think: “Why should I listen to this guy?” Or: “What does she know?”"}, {"45fe": "I don’t know. Maybe more than you do? We just don’t know until we listen to others."}, {"824f": "But if you always think you’re the best in the world, you never give people a chance. I think everyone is stubborn. Some are extreme, and some are just a little stubborn."}, {"4dc2": "I must say, stubbornness is also a good trait. It’s good to be deaf to critics and not about care what people think."}, {"2a97": "But being stubborn in relationships is plain frustrating. That kind of stubbornness is not good. And it just so happens to be that life is based on relationships. And your career too."}, {"eee9": "So when you refuse to work with others, you’re sabotaging everyone else that’s involved. Just remember that."}, {"8cff": "I try to remind myself often that stubbornness can be bad. But sometimes it’s so bad I don’t even listen to myself. But I keep trying."}, {"0048": "Checking Things"}, {"882d": "What are you doing? “I was just checking Facebook.”"}, {"82e4": "What are you ‘checking’?"}, {"7a9d": "Email? TMZ? CNN? NBA? NFL? Instagram? Twitter? Snapchat?"}, {"a752": "Checking is not a useful thing. It might be a verb, but it’s not a real action."}, {"2539": "When I started blogging, I always checked my stats for no reason. Then I thought: What’s the outcome of checking?"}, {"c63e": "Nothing."}, {"20a2": "You just consume information. I try to keep my ‘checking’ at a minimum. That’s why deleted all news and social media apps on my phone."}, {"4984": "I don’t even have email on my phone. Otherwise, I check it all the time. I don’t want that. I only want to check my email when I have time to answer emails."}, {"c31a": "Checking is a habit that you can never fully eliminate. I still follow the NBA because I like it. Pick only one or two ‘checking’ vices you actually like. Eliminate the rest. You’re not missing anything anyway."}, {"246b": "Escaping Life"}, {"898e": "Until two years ago, every time I’d get stressed out, I said stuff like: “I need a drink.” Or: “I have to go on a vacation.”"}, {"6496": "And when I had issues at work or in my relationship that became too much to handle, I preferred to pretend they didn’t exist. Sometimes I would take some time to talk about it."}, {"5561": "But there are always deeper issues at play. Back then I didn’t like my job, relationship, and the city I lived in. I basically didn’t like my life."}, {"3ae0": "Did I change it? Nope. I always tried to escape my issues. Escaping problems gives you some stamina to face your shitty life again. But you and I both know that problems never go away until you grab them by the root and extinguish them."}, {"018e": "I learned that the hard way. These days I deal with problems before they become big problems."}, {"6e52": "Saying Yes"}, {"e420": "Most people are afraid to say no. Maybe you don’t want to let people down. Maybe you are uncomfortable with the word no."}, {"35de": "I don’t know. Doesn’t matter, really. What matters is this: If you keep saying yes, you’re living someone else’s life."}, {"c9b2": "Think about it. Deep down, we all know that it’s true. We’re not even in control of our own time."}, {"ec44": "Want to be in full control of your life? Say no to a million things and yes to a few things that matter."}, {"c776": "Not Writing Things Down"}, {"d3fc": "Yeah, yeah, you have the memory of an elephant. Or you’re so smart that you remember everything, right?"}, {"2ac0": "WRONG."}, {"8f78": "Not writing down your thoughts, ideas, tasks, etc, is stupid. Why? Because you’re wasting a lot of brain power when you rely on your memory."}, {"5bbb": "When you write everything down, you can use your brainpower for other things. Like solving problems. That’s actually useful and advances your career."}, {"d80b": "If you journal, that’s even better. But I’ve found that not everyone likes the idea of journaling. So let’s just call it ‘writing things down.’"}, {"a76b": "What did you write down while you’re reading this article?"}, {"c0e5": "Being Hard On Yourself"}, {"55b9": "“I suck!”"}, {"5507": "No, you don’t."}, {"7198": "“Why?”"}, {"d543": "You got out of bed this morning, right?"}, {"d598": "“Yeah.”"}, {"88ff": "Congratulations. You survived this fucking hard thing called LIFE. Be proud of yourself. Everything you do after getting out of bed is a win."}, {"1f3f": "Neglecting Your Personal Education"}, {"0037": "“Woohoo! I finished college. Goodbye lame old books!”"}, {"4cc1": "If that was you, no matter how long ago, you DO suck. Who learns one thing and stops forever? I don’t even know why we have that idea planted in our brain."}, {"0b57": "I always thought that learning stops when you get out of school. But the truth is: Your life stops when learning stops."}, {"0057": "Invest in yourself. Learn something. Read books. Get courses. Watch videos. Do it from home or go places. It doesn’t matter. Just learn new things. You’ll be more productive and more excited about life."}, {"a88d": "Hating Rules"}, {"2f3f": "I saved the best for last. Most people hate rules, right? It starts when we’re kids. “Why do I have to do this? Why do I have to do that?”"}, {"27b8": "Because it’s better for you! That’s why! (you weird kid)"}, {"f206": "But when we’re adults, we don’t have to follow rules (other than actual rules set by the government, but you get what I’m talking about.)"}, {"0609": "“Rules are dumb!”"}, {"6877": "That’s what I always believed. I thought I was a maverick. But I was an idiot."}, {"f0d5": "Rules are actually THE BEST thing about life. Without rules, we would be hot dog eating pigs right now."}, {"5516": "And when it comes to productivity, the first rule is: Have rules."}, {"d012": "If you want to live without rules, go ahead. But life is not Fight Club. Rules actually help us to solve problems and get the most out of life."}, {"510a": "Josh Weltman, an advertising creative director for 25+ years, and the co-producer of Mad Men, put it well in his book Seducing Strangers:"}, {"bafe": "“Solving a problem requires a weird combination of freedom and constraint. Whenever I hear “Just have fun with it” or “Think outside the box,” I know from experience that things are about to turn into a colossal waste of time.”"}, {"3bc7": "Good news: You make up the rules."}, {"f9a8": "For example, one of my personal rules is this: Never complain. Another one is: Read and exercise every day. And: Close the day every evening by setting your next day’s priorities."}, {"8e4b": "When you combine all your productivity rules, you have a system. Voila! And a system changes everything."}, {"7481": "I rely on my system to work smarter, better, happier, and effectively. It took me years to figure out that a system is a good thing, and a few more years to create one, but it was worth it."}, {"766c": "Because now, I get to be a productive person."}, {"5fbf": "Not bad for an unproductive person, huh?"}, {"4ba9": "Thanks for reading! This article was originally published on dariusforoux.com."}], "child": "321_1\t321_2\t321_3\t321_4\t321_5\t321_6\t321_7\t321_8\t321_9\t321_10\t321_11\t321_12\t321_13\t321_14\t321_15\t321_16\t321_17\t321_18\t321_19\t321_20\t321_21\t321_22\t321_23\t321_24\t321_25321_1\t321_2\t321_3\t321_4\t321_5\t321_6\t321_7\t321_8\t321_9\t321_10\t321_11\t321_12\t321_13\t321_14\t321_15\t321_16\t321_17\t321_18\t321_19\t321_20\t321_21\t321_22\t321_23\t321_24\t321_25"}