{"name": "325", "parent": "", "content": "How This Founder Wants to Apply Her Technology to Help Save the Planet’s Resources There are so many moments from the Upfront Summit that I want to share with you — it just takes time to watch through all the videos, do write ups and still do my day job. One of the most exciting thinkers at Summit was Rebecca Kantar, the founder of Imbellus. I was excited to see her perform on stage because I’ve long been telling people how crazy smart, ambitious and talented she is but I was excited for people to hear for themselves. I wrote up the background of her company Imbellus here — essentially she’s building world simulations to assess human potential with the short-term goal of helping the most advanced companies have break-throughs on recruiting top talent but her longer term goal is to help use this rubric to help change how we teach children in America. If you want to know more about her company you should read the above link because her presentation at the Upfront Summit was taking her vision several steps beyond the current scope of our next few years plans and talking about her hope of helping to develop systems to save humanity. I’ve long told friends & colleagues that when I meet with Rebecca I feel like a need a human record player where I can slow down the RPMs so I can actually follow what she’s saying as she’s always two steps ahead of what my 386-processor brain can compute. If you watch this amazing video I think you’ll get a sense for what inspires me about Rebecca’s potential as a visionary and thinker and also have some sympathy for me trying to keep up with her. At least it’s recorded so we can hit the stop & rewind button :) I think you’ll really enjoy this talk on human potential. I know I did. And I think we’re all rooting for the Rebecca’s of the world to develop platforms to help us evolve our world and deal with the kind of resource-constrained systems we will likely encounter. ", "title": "How This Founder Wants to Apply Her Technology to Help Save the Planet’s Resources", "sentences": [{"26b0": "How This Founder Wants to Apply Her Technology to Help Save the Planet’s Resources"}, {"e592": "There are so many moments from the Upfront Summit that I want to share with you — it just takes time to watch through all the videos, do write ups and still do my day job."}, {"a307": "One of the most exciting thinkers at Summit was Rebecca Kantar, the founder of Imbellus. I was excited to see her perform on stage because I’ve long been telling people how crazy smart, ambitious and talented she is but I was excited for people to hear for themselves."}, {"6bfc": "I wrote up the background of her company Imbellus here — essentially she’s building world simulations to assess human potential with the short-term goal of helping the most advanced companies have break-throughs on recruiting top talent but her longer term goal is to help use this rubric to help change how we teach children in America."}, {"3831": "If you want to know more about her company you should read the above link because her presentation at the Upfront Summit was taking her vision several steps beyond the current scope of our next few years plans and talking about her hope of helping to develop systems to save humanity."}, {"baf6": "I’ve long told friends & colleagues that when I meet with Rebecca I feel like a need a human record player where I can slow down the RPMs so I can actually follow what she’s saying as she’s always two steps ahead of what my 386-processor brain can compute."}, {"eafc": "If you watch this amazing video I think you’ll get a sense for what inspires me about Rebecca’s potential as a visionary and thinker and also have some sympathy for me trying to keep up with her. At least it’s recorded so we can hit the stop & rewind button :)"}, {"6dd3": "I think you’ll really enjoy this talk on human potential. I know I did."}, {"180b": "And I think we’re all rooting for the Rebecca’s of the world to develop platforms to help us evolve our world and deal with the kind of resource-constrained systems we will likely encounter."}], "child": "325_1\t325_2\t325_3\t325_4\t325_5\t325_6"}