{"name": "33", "parent": "", "content": "Oscar Robertson’s Triple-Doubles Look Nothing Like Russell Westbrook’s There’s a reason why no one has matched the Big O’s record in 55 years Russell Westbrook has accomplished something that nobody has since 1962, and when a sports thing happens for the first time in a few decades, we’re often reminded about what has changed in the world since the last time. In 1962, stamps didn’t even cost a nickel! People used vinyl records for reasons besides the vintage-chic factor! Barely anybody had Facebook! What a strange time!! It’s also worth noting what’s changed in the sport since then. For example: The last time anybody did the thing Russell Westbrook just did, the NBA was a nine-team league that played a game vaguely resembling modern basketball. Westbrook’s 41st triple-double of the season tied an NBA single-season record set by Oscar Robertson, and he has five games left to break that record; he probably will, considering he’s had a triple-double in each of his last seven games. He also needs only 16 assists in his five remaining games to become the first person since Robertson to average a triple-double over the course of a season. After a season of averaging over 10 assists per game, it seems likely he’ll be able to average 3.2 down the stretch. Russell Westbrook’s Season Is Officially As Mythical As Oscar Robertson’s 1962Russ has tied one of the most ridiculous individual records in NBA history, and he isn’t donetheringer.com There are a few reasons nobody has averaged a triple-double since the Kennedy administration. For one, the pace of games was much faster back then, when the NBA was still less than 20 years old. In the year Robertson averaged a triple-double, the average game featured 126.2 possessions in 48 minutes. The average game in today’s NBA features 96.4 possessions in 48 minutes. There were about 30 more plays per game on which players could get stats. Westbrook’s 31.6 points per game leads the NBA by over two points per game; Robertson’s 30.8 points in 1961–62 was tied for fifth — and almost 20 points behind Wilt Chamberlain’s lead. And, well, players missed a crap ton of shots back in the day. In 1961–62, the average team shot 42.6 percent from the field and missed 61.8 shots per game. This year, the average team has missed 46.4 shots per game. For the few players ridiculous enough to approach triple-double-dom since Robertson, the rebounds have been the holdup: Jason Kidd averaged a points-assists double-double with at least seven rebounds twice; Magic Johnson did it four times; no player has averaged a points-rebounds double-double with at least seven assists since Wilt Chamberlain. It’s generally said that assists weren’t given as generously in the early NBA, but the sheer amount of missed shots back in the day made a versatile player achieving 10 rebounds more feasible. But here’s the most important reason nobody has averaged a triple-double since Oscar Robertson: Look at what basketball looked like when Oscar Robertson played basketball: That is an Oscar Robertson highlight tape made by the NBA. I laughed while watching it, because every play is just a normal basketball play. The clip contains about 14 midrange jumpers, about three tightly contested layups, about three uncontested layups, a few (really nice!) passes, and some regular-looking rebounds. Average-ass plays were world-shaking highlights in the early NBA, and Robertson was a transcendent force. Here, let’s watch another highlight reel of Robertson making comically regular plays: As unremarkable as the plays look, you can tell how extraordinary he was back then. He was bigger than guards and faster than everybody. He was a better athlete, and also a better shooter, passer, and dribbler than pretty much anyone. He’s radically different than any other person on the court. He was revolutionary at every level he played: He won Indiana state high school championships at a segregated school that didn’t even have a usable gym; he led the nation in scoring each of the three years he played at Cincinnati and took the Bearcats to two Final Fours; he won an MVP trophy and was an All-Star in the first 12 years of his career. Now let’s watch a Russell Westbrook highlight reel, where he drills 3s, dunks with nuclear power, and finishes over 7-footers. The first two clips do not look like the same sport as the third. It’s immediately clear that Westbrook is better at shooting, dribbling, and passing than Robertson, and is also significantly faster and capable of jumping higher. (Robertson never dunked in an NBA game, although we’re led to believe he was capable of it: His high school coach told him not to and he once crashed into a pole while dunking.) I say this not to denigrate Robertson. Surely, if the Big O were born today, he’d be a better player. He’d have learned to shoot more accurately and from farther away; he’d train his body to make himself faster and stronger and increase his vertical leap. I say this to draw attention to the ridiculous thing Westbrook just did. A triple-double is a weird combination of stats that suggests domination of multiple unrelated facets of a basketball game. The last time somebody was capable of regularly achieving that weird combination of stats, basketball was so different that you could dominate it with a skill set that almost certainly wouldn’t earn you a Division I scholarship in 2017. I assumed Robertson’s triple-double season was the type of thing that could never be done again. Robertson could put together those stat lines because he was one of the first humans to approach what we now consider basic basketball competence. But nowadays everybody is a speedy giant with a jumper. Westbrook shouldn’t be able to achieve the same level of greatness, and yet he’s doing it. ", "title": "Oscar Robertson’s Triple-Doubles Look Nothing Like Russell Westbrook’s", "sentences": [{"7408": "Oscar Robertson’s Triple-Doubles Look Nothing Like Russell Westbrook’s"}, {"0482": "There’s a reason why no one has matched the Big O’s record in 55 years"}, {"9623": "Russell Westbrook has accomplished something that nobody has since 1962, and when a sports thing happens for the first time in a few decades, we’re often reminded about what has changed in the world since the last time. In 1962, stamps didn’t even cost a nickel! People used vinyl records for reasons besides the vintage-chic factor! Barely anybody had Facebook! What a strange time!! It’s also worth noting what’s changed in the sport since then. For example: The last time anybody did the thing Russell Westbrook just did, the NBA was a nine-team league that played a game vaguely resembling modern basketball."}, {"a790": "Westbrook’s 41st triple-double of the season tied an NBA single-season record set by Oscar Robertson, and he has five games left to break that record; he probably will, considering he’s had a triple-double in each of his last seven games. He also needs only 16 assists in his five remaining games to become the first person since Robertson to average a triple-double over the course of a season. After a season of averaging over 10 assists per game, it seems likely he’ll be able to average 3.2 down the stretch."}, {"c95c": "Russell Westbrook’s Season Is Officially As Mythical As Oscar Robertson’s 1962Russ has tied one of the most ridiculous individual records in NBA history, and he isn’t donetheringer.com"}, {"d414": "There are a few reasons nobody has averaged a triple-double since the Kennedy administration. For one, the pace of games was much faster back then, when the NBA was still less than 20 years old. In the year Robertson averaged a triple-double, the average game featured 126.2 possessions in 48 minutes. The average game in today’s NBA features 96.4 possessions in 48 minutes. There were about 30 more plays per game on which players could get stats. Westbrook’s 31.6 points per game leads the NBA by over two points per game; Robertson’s 30.8 points in 1961–62 was tied for fifth — and almost 20 points behind Wilt Chamberlain’s lead."}, {"5dc0": "And, well, players missed a crap ton of shots back in the day. In 1961–62, the average team shot 42.6 percent from the field and missed 61.8 shots per game. This year, the average team has missed 46.4 shots per game. For the few players ridiculous enough to approach triple-double-dom since Robertson, the rebounds have been the holdup: Jason Kidd averaged a points-assists double-double with at least seven rebounds twice; Magic Johnson did it four times; no player has averaged a points-rebounds double-double with at least seven assists since Wilt Chamberlain. It’s generally said that assists weren’t given as generously in the early NBA, but the sheer amount of missed shots back in the day made a versatile player achieving 10 rebounds more feasible."}, {"a520": "But here’s the most important reason nobody has averaged a triple-double since Oscar Robertson: Look at what basketball looked like when Oscar Robertson played basketball:"}, {"3578": "That is an Oscar Robertson highlight tape made by the NBA. I laughed while watching it, because every play is just a normal basketball play. The clip contains about 14 midrange jumpers, about three tightly contested layups, about three uncontested layups, a few (really nice!) passes, and some regular-looking rebounds. Average-ass plays were world-shaking highlights in the early NBA, and Robertson was a transcendent force."}, {"64dc": "Here, let’s watch another highlight reel of Robertson making comically regular plays:"}, {"380b": "As unremarkable as the plays look, you can tell how extraordinary he was back then. He was bigger than guards and faster than everybody. He was a better athlete, and also a better shooter, passer, and dribbler than pretty much anyone. He’s radically different than any other person on the court. He was revolutionary at every level he played: He won Indiana state high school championships at a segregated school that didn’t even have a usable gym; he led the nation in scoring each of the three years he played at Cincinnati and took the Bearcats to two Final Fours; he won an MVP trophy and was an All-Star in the first 12 years of his career."}, {"9c72": "Now let’s watch a Russell Westbrook highlight reel, where he drills 3s, dunks with nuclear power, and finishes over 7-footers."}, {"1dfb": "The first two clips do not look like the same sport as the third. It’s immediately clear that Westbrook is better at shooting, dribbling, and passing than Robertson, and is also significantly faster and capable of jumping higher. (Robertson never dunked in an NBA game, although we’re led to believe he was capable of it: His high school coach told him not to and he once crashed into a pole while dunking.)"}, {"623a": "I say this not to denigrate Robertson. Surely, if the Big O were born today, he’d be a better player. He’d have learned to shoot more accurately and from farther away; he’d train his body to make himself faster and stronger and increase his vertical leap."}, {"73e4": "I say this to draw attention to the ridiculous thing Westbrook just did. A triple-double is a weird combination of stats that suggests domination of multiple unrelated facets of a basketball game. The last time somebody was capable of regularly achieving that weird combination of stats, basketball was so different that you could dominate it with a skill set that almost certainly wouldn’t earn you a Division I scholarship in 2017."}, {"767f": "I assumed Robertson’s triple-double season was the type of thing that could never be done again. Robertson could put together those stat lines because he was one of the first humans to approach what we now consider basic basketball competence. But nowadays everybody is a speedy giant with a jumper. Westbrook shouldn’t be able to achieve the same level of greatness, and yet he’s doing it."}], "child": "33_1\t33_2\t33_3\t33_4\t33_5\t33_6\t33_7\t33_8\t33_9\t33_10\t33_11\t33_12\t33_13\t33_14\t33_15\t33_16\t33_17\t33_18\t33_19\t33_20\t33_21\t33_22\t33_23\t33_24\t33_25"}