{"name": "330", "parent": "", "content": "What is it Like to Wake Up and Have the Press Ready to Torpedo Your Business? In case you missed it, the press yesterday ran several stories questioning the viability of a wireless charging company I invested in called uBeam. Obviously my day turned out very differently than I had anticipated when I woke up, but it wasn’t half as bad as the entire team at uBeam must have felt yesterday. I received a flurry of emails and texts and I was going to write a letter to the many investors in uBeam reassuring them that we are indeed making strong progress on releasing a product but then it occurred to me that it may be more constructive to do so here since so many people are asking. So What Happened? Several months ago the VP of Acoustics for uBeam, Paul Reynolds left the company on his own volition. I was disappointed to see him go because he was technically very strong and throughout my time working with him he reassured me we could solve the technical challenges and our approach was viable. I asked him to reconsider leaving but when it was clear that he had made up his mind I realized we couldn’t change it. I knew he wasn’t happy for reasons I won’t go into. He recently wrote a series of blog posts that were negative about the company and spoke with several journalists about his views. Throughout my many discussions with Paul over our time together, he never questioned the viability of uBeam and the technology that he was critical in developing. Instead he expressed concerns that we not overstate our capabilities or fall prey to hyperbole. I don’t want to put words in Paul’s mouth — but that’s how I’d characterize our many discussions. Obviously I wish he wouldn’t have written negative posts but it’s a decision he made and we can’t erase his words or actions. Of course I wish he understood that the consequences of his actions are much wider than he may have thought when he began his critiques. But there’s no reason to spend undue time getting angry about what’s been said. I’m pretty on record as saying that if you harbor anger, you lose twice. What is the Reality? Wireless electricity using ultrasound works — that isn’t in question. The questions that arise are: can it work at long distances, can you produce equipment cost effectively and will it be useful enough that businesses will install it or consumers will want to use it. Yes, there are other questions skeptics have raised as well — but it’s not worth trying to refute every point. We have a lot to prove. The team knows that. It’s hard work. We haven’t yet shipped product or shown the public our prototypes. The product isn’t yet where we want it to be — like most startup products, it is a work in progress. But we do have detailed plans for four generations of product releases through 2019 and we have a very talented COO, Jeff Devine, who is leading our efforts. He was VP of Global Supply Chain for Cisco and held similar roles at Nokia and Palm. He is a calming force, an experienced hand, a straight shooter and a great long-term planner. I have huge confidence in Jeff. We also have a very talented VP of Engineering, Sean Taffler, who is a Phd from Oxford, and has been with the company since shortly after I funded it. We have a VP of Acoustics, Paul Chandler who is a Phd from UC Irvine and formerly with Philips Ultrasound. Of course no amount of Phd’s guarantee that uBeam will deliver a successful and compelling product but as a board member and as the investor closest to the company I can tell you that this team is incredibly hard working, heads down and making progress every day and week. Ultimately we know that if we deliver product the market will judge us for the quality of what is produced and its efficacy. Are we behind schedule? Of course. But the overwhelming majority of products I’ve ever built have been late or cut scope and I’ve never personally built anything nearly as ambitious as what uBeam’s engineers are attempting. What I can tell you is that Meredith Perry is amongst the most driven, committed, hard-working and smart entrepreneurs with whom I have worked. Meredith is in her twenties and this is her first rodeo. I wish I had half of the determination, grit and ambition at her age. Has the company received enormous press? Sure. Has Meredith at times been prone to promising revolution or hubris? Of course. I think she would even acknowledge this, but having a grand vision is vastly different from making fraudulent claims. Has her vision risen to the level of personal attacks she has to receive in the press or the claims of falsifying information? No. These claims are abjectly false. Any references to Theranos are spurious at best. At heart Meredith is a nerd and loves the most inane, geeky things to do with space or scientists or technology theory. Were she a shy, pimply, awkward male engineer with a pocket protector she would fit an archetype that would make sense to observers. But she’s not. She’s confident, communicative, outspoken, young and blonde. She’s still a geek. And a geek in the way I appreciate and respect. And on occasion she makes some really strange video or joke or comment that makes me think she’s from a different planet and then I remember that looks can be deceiving. Geeks come in all packages. Meredith has made claims that she will deliver a working product and I believe her whole heartedly based on my experience in working with the team over the past 18 months. She has never lost her confidence or determination in doing so and she knows the world is watching her. How would you fare under this pressure? Wouldn’t you want the time and space to deliver without vitriol? uBeam is far more than any one individual and there are an entire team of engineers working hard on delivering product to the market. I continue to be encouraged that this group of people will deliver a working product and I have seen nearly every version of the hardware, software, prototypes and algorithms. But. If for any reason we fall short of expectations we have set in the market, I will be the first person in line to admit it and then to immediately fund Meredith’s next company. Her strengths so vastly outweigh any weaknesses and her vision, tenacity and resiliency far exceed any perceived limitations. What are the Consequences to the Company? Of course we lost two full days of productivity. We had an all hands meeting yesterday and Meredith and I encouraged the team to do their best to ignore the constant emails and texts from friends and family members — but how can you, really? Nevertheless they are already back at work delivering a product that they plan to demonstrate when it’s ready. Of course it will make it harder to recruit candidates because we’ll now have to spend more time explaining the situation. But we’ll redouble our efforts and continue to persuade engineers who join by showing them actual products in progress. The uBeam team will keep their heads down and either deliver or not. That’s what the startup industry does. And if you are afraid of failure and if you never take risks and if you never try to push the boundaries of what is possible — then you certainly will never succeed in break-through innovation. I’m not at all afraid to put my name behind Meredith, Jeff, Sean, Paul Chandler and all the other great engineers hard at work. I feel confident they will exceed expectations. What Next? Back to work, I hope. I told Meredith I would write this because I really want her focusing her energy on the only thing that ultimately will decide the fate of uBeam — shipping a product. I’d rather be asleep right now. It’s nearly 2:00am and I have a board meeting in the morning and I could do without all of the drama. But that’s startup life. I wrote a little post a few years ago to try and help others who have to go through this situation, “What Startups Can Learn about PR and Crisis Management.” While I don’t envy any of you who have to go through this — I hope this guide can be of some comfort in moments like this. ", "title": "What is it Like to Wake Up and Have the Press Ready to Torpedo Your Business?", "sentences": [{"cdc3": "What is it Like to Wake Up and Have the Press Ready to Torpedo Your Business?"}, {"2ae2": "In case you missed it, the press yesterday ran several stories questioning the viability of a wireless charging company I invested in called uBeam. Obviously my day turned out very differently than I had anticipated when I woke up, but it wasn’t half as bad as the entire team at uBeam must have felt yesterday."}, {"4ea1": "I received a flurry of emails and texts and I was going to write a letter to the many investors in uBeam reassuring them that we are indeed making strong progress on releasing a product but then it occurred to me that it may be more constructive to do so here since so many people are asking."}, {"9875": "So What Happened?"}, {"6bad": "Several months ago the VP of Acoustics for uBeam, Paul Reynolds left the company on his own volition. I was disappointed to see him go because he was technically very strong and throughout my time working with him he reassured me we could solve the technical challenges and our approach was viable."}, {"f046": "I asked him to reconsider leaving but when it was clear that he had made up his mind I realized we couldn’t change it. I knew he wasn’t happy for reasons I won’t go into."}, {"a19d": "He recently wrote a series of blog posts that were negative about the company and spoke with several journalists about his views. Throughout my many discussions with Paul over our time together, he never questioned the viability of uBeam and the technology that he was critical in developing. Instead he expressed concerns that we not overstate our capabilities or fall prey to hyperbole. I don’t want to put words in Paul’s mouth — but that’s how I’d characterize our many discussions."}, {"6a35": "Obviously I wish he wouldn’t have written negative posts but it’s a decision he made and we can’t erase his words or actions. Of course I wish he understood that the consequences of his actions are much wider than he may have thought when he began his critiques."}, {"a899": "But there’s no reason to spend undue time getting angry about what’s been said. I’m pretty on record as saying that if you harbor anger, you lose twice."}, {"da61": "What is the Reality?"}, {"f578": "Wireless electricity using ultrasound works — that isn’t in question. The questions that arise are: can it work at long distances, can you produce equipment cost effectively and will it be useful enough that businesses will install it or consumers will want to use it. Yes, there are other questions skeptics have raised as well — but it’s not worth trying to refute every point."}, {"22d5": "We have a lot to prove. The team knows that. It’s hard work. We haven’t yet shipped product or shown the public our prototypes. The product isn’t yet where we want it to be — like most startup products, it is a work in progress."}, {"9e90": "But we do have detailed plans for four generations of product releases through 2019 and we have a very talented COO, Jeff Devine, who is leading our efforts. He was VP of Global Supply Chain for Cisco and held similar roles at Nokia and Palm. He is a calming force, an experienced hand, a straight shooter and a great long-term planner. I have huge confidence in Jeff."}, {"233f": "We also have a very talented VP of Engineering, Sean Taffler, who is a Phd from Oxford, and has been with the company since shortly after I funded it. We have a VP of Acoustics, Paul Chandler who is a Phd from UC Irvine and formerly with Philips Ultrasound."}, {"b44f": "Of course no amount of Phd’s guarantee that uBeam will deliver a successful and compelling product but as a board member and as the investor closest to the company I can tell you that this team is incredibly hard working, heads down and making progress every day and week."}, {"728b": "Ultimately we know that if we deliver product the market will judge us for the quality of what is produced and its efficacy. Are we behind schedule? Of course. But the overwhelming majority of products I’ve ever built have been late or cut scope and I’ve never personally built anything nearly as ambitious as what uBeam’s engineers are attempting."}, {"9ee1": "What I can tell you is that Meredith Perry is amongst the most driven, committed, hard-working and smart entrepreneurs with whom I have worked. Meredith is in her twenties and this is her first rodeo. I wish I had half of the determination, grit and ambition at her age."}, {"5090": "Has the company received enormous press? Sure. Has Meredith at times been prone to promising revolution or hubris? Of course. I think she would even acknowledge this, but having a grand vision is vastly different from making fraudulent claims. Has her vision risen to the level of personal attacks she has to receive in the press or the claims of falsifying information?"}, {"2b73": "No. These claims are abjectly false. Any references to Theranos are spurious at best."}, {"1947": "At heart Meredith is a nerd and loves the most inane, geeky things to do with space or scientists or technology theory. Were she a shy, pimply, awkward male engineer with a pocket protector she would fit an archetype that would make sense to observers. But she’s not. She’s confident, communicative, outspoken, young and blonde."}, {"e6e6": "She’s still a geek. And a geek in the way I appreciate and respect. And on occasion she makes some really strange video or joke or comment that makes me think she’s from a different planet and then I remember that looks can be deceiving. Geeks come in all packages."}, {"e98a": "Meredith has made claims that she will deliver a working product and I believe her whole heartedly based on my experience in working with the team over the past 18 months. She has never lost her confidence or determination in doing so and she knows the world is watching her. How would you fare under this pressure? Wouldn’t you want the time and space to deliver without vitriol?"}, {"9a38": "uBeam is far more than any one individual and there are an entire team of engineers working hard on delivering product to the market. I continue to be encouraged that this group of people will deliver a working product and I have seen nearly every version of the hardware, software, prototypes and algorithms."}, {"cde8": "But."}, {"2d50": "If for any reason we fall short of expectations we have set in the market, I will be the first person in line to admit it and then to immediately fund Meredith’s next company. Her strengths so vastly outweigh any weaknesses and her vision, tenacity and resiliency far exceed any perceived limitations."}, {"cfae": "What are the Consequences to the Company?"}, {"e36b": "Of course we lost two full days of productivity. We had an all hands meeting yesterday and Meredith and I encouraged the team to do their best to ignore the constant emails and texts from friends and family members — but how can you, really? Nevertheless they are already back at work delivering a product that they plan to demonstrate when it’s ready."}, {"f04b": "Of course it will make it harder to recruit candidates because we’ll now have to spend more time explaining the situation. But we’ll redouble our efforts and continue to persuade engineers who join by showing them actual products in progress."}, {"13a3": "The uBeam team will keep their heads down and either deliver or not. That’s what the startup industry does. And if you are afraid of failure and if you never take risks and if you never try to push the boundaries of what is possible — then you certainly will never succeed in break-through innovation."}, {"5592": "I’m not at all afraid to put my name behind Meredith, Jeff, Sean, Paul Chandler and all the other great engineers hard at work. I feel confident they will exceed expectations."}, {"6651": "What Next?"}, {"032c": "Back to work, I hope. I told Meredith I would write this because I really want her focusing her energy on the only thing that ultimately will decide the fate of uBeam — shipping a product."}, {"9f1f": "I’d rather be asleep right now. It’s nearly 2:00am and I have a board meeting in the morning and I could do without all of the drama. But that’s startup life."}, {"e1c5": "I wrote a little post a few years ago to try and help others who have to go through this situation, “What Startups Can Learn about PR and Crisis Management.” While I don’t envy any of you who have to go through this — I hope this guide can be of some comfort in moments like this."}], "child": "330_1\t330_2\t330_3\t330_4\t330_5\t330_6\t330_7\t330_8\t330_9\t330_10\t330_11\t330_12\t330_13\t330_14\t330_15\t330_16\t330_17\t330_18\t330_19\t330_20\t330_21\t330_22\t330_23\t330_24\t330_25"}