{"name": "331", "parent": "", "content": "Getting Your Series A Mojo Back You Need to Find Your Mojo A Chip On Your Shoulder A few years ago I wrote a blog post on entrepreneurs with a chip on their shoulders. I think it’s an important read. A chip on one’s shoulder as in, “Fuck the system, it’s broken and I want to fix it” is exactly the energy I look for in entrepreneurs. My internal compass says that “country-club” entrepreneurs struggle to make as big of an impact because it’s really hard to totally change a system that you’re part of and have a vested interest in. So positive chips are a great signal for me. But chips come in multiple flavors and it’s a fine line between positive and negative. If the chip on your shoulder is, “I’m not treated fairly by the system, boo hoo, I’m different and that’s why you aren’t helping me” that chip can be a big negative in getting others to want to back or help you. I see this a lot in funding where an entrepreneur has struggled to raise money and spends all his or her time lamenting how lame investors are. The best lesson to learn for yourself if you’re struggling is self reflection. “If my objective is raising capital and I’m struggling, what can I learn about those who do get funded and how can I improve my odds by changing me?” Maybe it’s the system, maybe it’s me — but either way what could I do differently to change outcomes? From Aspiration to Hero For companies that do have that moment of success where everything seems to come together: funding, hiring, customers, PR, product releases and so forth — you have a “hero” moment where you feel invincible. This is a very predictable phase of the startup journey and a lot of good can come from it. The founders and team develop a huge confidence level that appropriately increases risk-taking, output, expansion, deals, revenue, press and everything that is a consequence of initial successes. This is a very common post Series A phenomenon. Everything has gone well to date. Everything seems possible. Nothing has started to sour, nobody is frustrated, nobody has move on because it all still seems possible that you’re the next great company. Of course it’s a fine line between hero and hubris. There is also a predictable moment in many companies where teams convince themselves that everything they’re doing is great. It’s why sometimes I fear when teams raise too much money too early in a startup because capital can mask underlying problems for a long time. One example is that capital funds team growth which funds product output which funds press coverage and accolades which becomes a self-fulfilling prophecy. Without the tension of scarce capital some teams paper over the fact that eventually money must be made. Or some teams who start driving revenue paper over the fact that they aren’t acquiring customers profitably. Another predictable sign of hubris in startups is when the founders start looking for other companies to buy. If you’re an early-stage startup and even contemplating acquiring other companies slap yourself in the face and focus on your own business instead. M&A junkies are hatched from businesses where the core isn’t working and it seems far easier to acquire another startup than to do the hard work of refining your own. When Hero Slips Into Failure, Self Doubt and Anxiety As predictable as the hero’s journey is — so, too, are the conflicts and bumps along the road. Almost all companies hit those tough moments when customer growth slows down, competitors launch products and dilute your good press coverage, employees start doubting the future and cash reserves start to dwindle. It’s what you do in these moments that often determine success from failure. It’s really important to get control of your own emotions as you go through this phase of your startup journey as your non-verbal queues will be picked up by the entire team. A lack of confidence will also cloud your ability to take positive steps in tough times. When you started you had the youthful (from a company perspective not age) energy, enthusiasm and naïveté that comes from actually thinking you can change the world. Nobody goes into a startup expecting to fail — we all imagine the next big startup movie is going to be about us. Our inner script is heroic and the struggles are mere battle scars on the inevitable journey to slay King Joffrey. In your hero phase you got invited to speak on panels. You attended speaker dinners, went to entrepreneur parties on ships or in Europe. Your high school friends sent you messages on Facebook that maybe you were “most likely to succeed.” But building a successful startup is hard. And back home when you land and come into the office on Monday your staff still knows the truth. Your app isn’t getting enough repeat visitors. Your churn rates are too high. Your eCommerce company has too much unsold inventory. Your lead developer quit to join the new, new thing. We’ve all been there — every entrepreneur. You start off by believing your own hype, drinking your own Kool Aid. And then you meet reality. And some entrepreneurs can maintain their enthusiasm, optimism and energy: Working hard and staying positive. But that’s hard. Many still put in the hours but you can see the stress in their eyes and hear it in their voices. In stead of telling people how they are going to change the world they start to show self doubt. They qualify every initiative with, “well this didn’t prove viral adoption last time so I don’t expect a silver bullet this time.” Sometimes the silver bullet does come. Often it doesn’t. Usually success is about working hard enough and long enough and eventually getting a lucky break. In order to make the magic work another few months, years, you need to keep up blind belief in yourself. Confidence is THE single most important attribute in being able to attract money, hire staff, stave off creditors, get press, do biz dev deals, close big sales and one day sell your company. I really fear this phase of a company’s journey and if you’re perceptive and have seen many startup journeys before it is really easy to pick up on that moment where the entrepreneur has self doubt. Confidence. That magic you had at your Series A — at the start of your hero’s journey. Mojo. You need to dig deep. Athletes visualize and focus on positive energy and confidence and we don’t think that’s strange yet too few startup entrepreneurs focus on their own mental states and self-confidence. And too few visual success. Here’s the truth — even to this day I still daydream about the future. I think about what Upfront needs to become and what we can do differently. Better. And as I zone out sometimes I visualize things I wasn’t thinking about before. Mind matters. I do it in the shower, on the treadmill or on long drives. These are the three biggest sources of my creative breakthroughs for a reason. I’ve written before about visualization and creativity and how important this has been to my career. Mental toughness matters. Confidence matters even more. I wish more startups would get personal coaches so they could let out their angst to neutral people — not staff, not investors. It’s why YPO is such an important organization. If you’re in a startup that has struggled know that you’re not alone — we’re all naked in the mirror in the morning. We all have self doubt and anxiety. We all have set backs. Don’t let the press about others in the industry fool you into thinking everybody else’s life is perfect. If you’re in really bad shape (10% of you) — seek help. Life is more important than your startup and there is always another day. Your reputation won’t suffer if your business does. You can evolve. If you’re in the norm (90% of you) please think about how to let out your steam, talk to others, get mentors, re-find the energy / confidence, or bring in new staff who can help re-energize you and/or your business. If you plan to raise more money, improve your business ops, or sell your company you need your Series A mojo back. You need to rekindle that feeling, rediscover that belief in you and your company’s mission. And if you can’t find the mojo then you need to think about whether it’s time to let somebody else pick up the baton at your business or whether it’s time to find a safe landing for your employees’ sake. ", "title": "Getting Your Series A Mojo Back", "sentences": [{"97d2": "Getting Your Series A Mojo Back"}, {"30a7": "You Need to Find Your Mojo"}, {"29af": "A Chip On Your Shoulder"}, {"271b": "A few years ago I wrote a blog post on entrepreneurs with a chip on their shoulders."}, {"398a": "I think it’s an important read. A chip on one’s shoulder as in, “Fuck the system, it’s broken and I want to fix it” is exactly the energy I look for in entrepreneurs."}, {"39a0": "My internal compass says that “country-club” entrepreneurs struggle to make as big of an impact because it’s really hard to totally change a system that you’re part of and have a vested interest in."}, {"65f4": "So positive chips are a great signal for me. But chips come in multiple flavors and it’s a fine line between positive and negative."}, {"8372": "If the chip on your shoulder is, “I’m not treated fairly by the system, boo hoo, I’m different and that’s why you aren’t helping me” that chip can be a big negative in getting others to want to back or help you."}, {"cf4e": "I see this a lot in funding where an entrepreneur has struggled to raise money and spends all his or her time lamenting how lame investors are."}, {"e769": "The best lesson to learn for yourself if you’re struggling is self reflection."}, {"b2a3": "“If my objective is raising capital and I’m struggling, what can I learn about those who do get funded and how can I improve my odds by changing me?”"}, {"b3d1": "Maybe it’s the system, maybe it’s me — but either way what could I do differently to change outcomes?"}, {"8470": "From Aspiration to Hero"}, {"756c": "For companies that do have that moment of success where everything seems to come together: funding, hiring, customers, PR, product releases and so forth — you have a “hero” moment where you feel invincible."}, {"aa74": "This is a very predictable phase of the startup journey and a lot of good can come from it. The founders and team develop a huge confidence level that appropriately increases risk-taking, output, expansion, deals, revenue, press and everything that is a consequence of initial successes."}, {"6c48": "This is a very common post Series A phenomenon. Everything has gone well to date. Everything seems possible. Nothing has started to sour, nobody is frustrated, nobody has move on because it all still seems possible that you’re the next great company."}, {"5041": "Of course it’s a fine line between hero and hubris. There is also a predictable moment in many companies where teams convince themselves that everything they’re doing is great. It’s why sometimes I fear when teams raise too much money too early in a startup because capital can mask underlying problems for a long time."}, {"7b4a": "One example is that capital funds team growth which funds product output which funds press coverage and accolades which becomes a self-fulfilling prophecy. Without the tension of scarce capital some teams paper over the fact that eventually money must be made. Or some teams who start driving revenue paper over the fact that they aren’t acquiring customers profitably."}, {"4076": "Another predictable sign of hubris in startups is when the founders start looking for other companies to buy. If you’re an early-stage startup and even contemplating acquiring other companies slap yourself in the face and focus on your own business instead. M&A junkies are hatched from businesses where the core isn’t working and it seems far easier to acquire another startup than to do the hard work of refining your own."}, {"fab7": "When Hero Slips Into Failure, Self Doubt and Anxiety"}, {"3594": "As predictable as the hero’s journey is — so, too, are the conflicts and bumps along the road. Almost all companies hit those tough moments when customer growth slows down, competitors launch products and dilute your good press coverage, employees start doubting the future and cash reserves start to dwindle."}, {"662e": "It’s what you do in these moments that often determine success from failure. It’s really important to get control of your own emotions as you go through this phase of your startup journey as your non-verbal queues will be picked up by the entire team. A lack of confidence will also cloud your ability to take positive steps in tough times."}, {"0a51": "When you started you had the youthful (from a company perspective not age) energy, enthusiasm and naïveté that comes from actually thinking you can change the world. Nobody goes into a startup expecting to fail — we all imagine the next big startup movie is going to be about us. Our inner script is heroic and the struggles are mere battle scars on the inevitable journey to slay King Joffrey."}, {"be27": "In your hero phase you got invited to speak on panels. You attended speaker dinners, went to entrepreneur parties on ships or in Europe. Your high school friends sent you messages on Facebook that maybe you were “most likely to succeed.”"}, {"0ae4": "But building a successful startup is hard. And back home when you land and come into the office on Monday your staff still knows the truth. Your app isn’t getting enough repeat visitors. Your churn rates are too high. Your eCommerce company has too much unsold inventory. Your lead developer quit to join the new, new thing."}, {"b909": "We’ve all been there — every entrepreneur. You start off by believing your own hype, drinking your own Kool Aid. And then you meet reality."}, {"7ea8": "And some entrepreneurs can maintain their enthusiasm, optimism and energy: Working hard and staying positive. But that’s hard."}, {"aa1a": "Many still put in the hours but you can see the stress in their eyes and hear it in their voices. In stead of telling people how they are going to change the world they start to show self doubt. They qualify every initiative with, “well this didn’t prove viral adoption last time so I don’t expect a silver bullet this time.”"}, {"50db": "Sometimes the silver bullet does come. Often it doesn’t. Usually success is about working hard enough and long enough and eventually getting a lucky break."}, {"e112": "In order to make the magic work another few months, years, you need to keep up blind belief in yourself. Confidence is THE single most important attribute in being able to attract money, hire staff, stave off creditors, get press, do biz dev deals, close big sales and one day sell your company."}, {"b8b0": "I really fear this phase of a company’s journey and if you’re perceptive and have seen many startup journeys before it is really easy to pick up on that moment where the entrepreneur has self doubt."}, {"daa7": "Confidence."}, {"dbad": "That magic you had at your Series A — at the start of your hero’s journey."}, {"ee7d": "Mojo."}, {"e424": "You need to dig deep."}, {"6782": "Athletes visualize and focus on positive energy and confidence and we don’t think that’s strange yet too few startup entrepreneurs focus on their own mental states and self-confidence. And too few visual success."}, {"8f37": "Here’s the truth — even to this day I still daydream about the future. I think about what Upfront needs to become and what we can do differently. Better. And as I zone out sometimes I visualize things I wasn’t thinking about before. Mind matters. I do it in the shower, on the treadmill or on long drives. These are the three biggest sources of my creative breakthroughs for a reason."}, {"8b45": "I’ve written before about visualization and creativity and how important this has been to my career."}, {"593a": "Mental toughness matters. Confidence matters even more."}, {"24a2": "I wish more startups would get personal coaches so they could let out their angst to neutral people — not staff, not investors. It’s why YPO is such an important organization."}, {"4b74": "If you’re in a startup that has struggled know that you’re not alone — we’re all naked in the mirror in the morning. We all have self doubt and anxiety. We all have set backs. Don’t let the press about others in the industry fool you into thinking everybody else’s life is perfect."}, {"2bc6": "If you’re in really bad shape (10% of you) — seek help. Life is more important than your startup and there is always another day. Your reputation won’t suffer if your business does. You can evolve."}, {"c168": "If you’re in the norm (90% of you) please think about how to let out your steam, talk to others, get mentors, re-find the energy / confidence, or bring in new staff who can help re-energize you and/or your business."}, {"96ba": "If you plan to raise more money, improve your business ops, or sell your company you need your Series A mojo back. You need to rekindle that feeling, rediscover that belief in you and your company’s mission."}, {"d035": "And if you can’t find the mojo then you need to think about whether it’s time to let somebody else pick up the baton at your business or whether it’s time to find a safe landing for your employees’ sake."}], "child": "331_1\t331_2\t331_3\t331_4\t331_5\t331_6\t331_7\t331_8\t331_9\t331_10\t331_11\t331_12\t331_13\t331_14\t331_15\t331_16"}