{"name": "333", "parent": "", "content": "Why 2017 Should be a Great Year to Raise Venture Capital Recently Upfront Ventures published its outlook for the technology startup world and venture capital overall titled it “WTF Happened to Winter?” The conclusion of our report was that winter did come, but it was mild and short. This was driven by the influx of corporate VCs, foreign VC money, sovereign wealth funds and the new war chests of VCs who raised new funds in the past 18 months. We are now publishing some of the VC survey data the report used and the results are clear — it’s a great time to be a startup raising venture capital. The results are in (full deck is published here) but a summary would be: So here are some details (please thank & follow! Chang Xu for her tireless effort in helping me prepare and analyze the data) Starting with the good news — as you can see from the chart below last year at this time 82% of VCs were either “very concerned” or “didn’t feel compelled to do deals given uncertainty” and that has totally reversed with 62% being optimistic or bullish. Unsurprisingly with VCs being more optimistic the number of VCs who planned to increased their investment activities doubled in 2017 while the number who planned to do fewer deals went down by nearly 2/3rds. And as VCs get more bullish on the investment environment and pick up the pace of their activities a natural result is the valuations tend to hold up, which bodes will for entrepreneurs raising capital in 2017. As you can see from the chart below, very few VCs are forecasting significant price drops (2%) versus a year ago when a large number were bracing for price drops (30%). We also asked VCs to weigh in on the areas of technology that most interested them in the coming 5 years and the overwhelming winner was in startups focused on machine learning / artificial intelligence (AI). And as a result of this interest you can expect an increase of activity in investments in the space in the coming year, whereas many VCs thought AR / VR and Blockchain investments would be more ripe as opportunities in the 3–5 year time horizon. Since the change in government is still fresh on people’s minds we asked what VCs thought about the Trump Administration. This was anonymously conducted after the election but a couple of weeks before the inauguration and the data were very clear — VCs don’t like Trump. 85% of VCs polled had a negative view of Donald Trump and I suspect if we re-polled them today it would be even worse. (I promise I didn’t vote twice — in fact I didn’t vote in our poll at all. Nor did 3 million Americans — but if Trump sees this poll I’m sure he’ll assert that they did). The biggest area of concerns for VCs were Trump’s policy issues regarding international trade — especially China, cyber security and immigration. But when all is said and done VCs don’t think that Trump will have much of an impact overall on the tech ecosystem. Again, I suspect they would be more concerned today about net neutrality, cyber security, immigration and trade more broadly. Below is the full deck with a lot more data and insights and if you missed the recently published LP Survey Results you can find them here. ", "title": "Why 2017 Should be a Great Year to Raise Venture Capital", "sentences": [{"fe0d": "Why 2017 Should be a Great Year to Raise Venture Capital"}, {"2e23": "Recently Upfront Ventures published its outlook for the technology startup world and venture capital overall titled it “WTF Happened to Winter?” The conclusion of our report was that winter did come, but it was mild and short. This was driven by the influx of corporate VCs, foreign VC money, sovereign wealth funds and the new war chests of VCs who raised new funds in the past 18 months."}, {"0813": "We are now publishing some of the VC survey data the report used and the results are clear — it’s a great time to be a startup raising venture capital."}, {"84a3": "The results are in (full deck is published here) but a summary would be:"}, {"3f55": "So here are some details (please thank & follow! Chang Xu for her tireless effort in helping me prepare and analyze the data)"}, {"3830": "Starting with the good news — as you can see from the chart below last year at this time 82% of VCs were either “very concerned” or “didn’t feel compelled to do deals given uncertainty” and that has totally reversed with 62% being optimistic or bullish."}, {"234f": "Unsurprisingly with VCs being more optimistic the number of VCs who planned to increased their investment activities doubled in 2017 while the number who planned to do fewer deals went down by nearly 2/3rds."}, {"3418": "And as VCs get more bullish on the investment environment and pick up the pace of their activities a natural result is the valuations tend to hold up, which bodes will for entrepreneurs raising capital in 2017. As you can see from the chart below, very few VCs are forecasting significant price drops (2%) versus a year ago when a large number were bracing for price drops (30%)."}, {"9e60": "We also asked VCs to weigh in on the areas of technology that most interested them in the coming 5 years and the overwhelming winner was in startups focused on machine learning / artificial intelligence (AI)."}, {"43e1": "And as a result of this interest you can expect an increase of activity in investments in the space in the coming year, whereas many VCs thought AR / VR and Blockchain investments would be more ripe as opportunities in the 3–5 year time horizon."}, {"13c4": "Since the change in government is still fresh on people’s minds we asked what VCs thought about the Trump Administration. This was anonymously conducted after the election but a couple of weeks before the inauguration and the data were very clear — VCs don’t like Trump. 85% of VCs polled had a negative view of Donald Trump and I suspect if we re-polled them today it would be even worse. (I promise I didn’t vote twice — in fact I didn’t vote in our poll at all. Nor did 3 million Americans — but if Trump sees this poll I’m sure he’ll assert that they did)."}, {"9b52": "The biggest area of concerns for VCs were Trump’s policy issues regarding international trade — especially China, cyber security and immigration."}, {"9967": "But when all is said and done VCs don’t think that Trump will have much of an impact overall on the tech ecosystem. Again, I suspect they would be more concerned today about net neutrality, cyber security, immigration and trade more broadly."}, {"8334": "Below is the full deck with a lot more data and insights and if you missed the recently published LP Survey Results you can find them here."}], "child": "333_1\t333_2\t333_3\t333_4\t333_5\t333_6\t333_7\t333_8"}