{"name": "334", "parent": "", "content": "Why the LP Outlook is Good for Venture and Startups in 2017–2020 Every year Upfront Ventures surveys Limited Partners (LPs) who are the main source of capital that invests in VC funds and thus the main source of capital that goes to startups to get an early-warning sense of the year ahead, leaving aside any Black Swans. The results are in (and the full deck available) and a few things are clear: So here are some details (please thank & follow! Chang Xu for her tireless effort in helping me prepare and analyze the data) If you met with LPs to raise a fund in 2009–2012 the most common refrain was, “We have too many managers and too many dollars in venture. We’re trying to limit our exposure.” That has changed dramatically in the past five years. At the tail end of this period when demand was picking up for the industry there was still a belief that in venture it only mattered that you got into the top 10 funds in Silicon Valley. There is no doubt LPs still want access to the most elite funds but increasingly LPs have acknowledged that the industry has changed and some of the best performing managers have come from new firms and even many are outside of Silicon Valley thus LPs are more open to “new names.” And while our entire industry’s riches have grown and as startups have stayed private for longer periods of time and raised significantly more private capital than they did in the past, an increasing number of LPs have sought to do “co-investments” win the funds that they back giving them more exposure to what they hope will be the better performing portfolio companies If you want to understand why LPs are so active in venture these days, the most obvious reason is that technology startups have paid off handsomely for many LPs but a more nuanced answer would also include “relative to other asset classes.” This is key because in a permanently low-interest-rate environment parking large pools of capital in assets that benefit from interest is not possible so LPs seek “higher yield.” I know most startups (or even VCs) tend not to think about this but when you ask LPs the data are clear: Another trend we’ve noticed in LP opinions is regarding seed funds. When people like Michael Kim at Cendana or Hans Swildens at Industry Ventures started focused on “Micro VCs” a decade ago or so we heard many LPs saying, “I’m not sure if seed fund investing is really a smart strategy. Will it last? Will they get squeezed? Will they have enough capital?” We never hear that any more. Seed fund investing is acknowledged likely to be a permanent force in our industry with too many great funds to list but aside from those I listed previously there is obviously Felicis, Softtech, Floodgate, K9, Forerunner, Cowboy and so, so many more that I’m already in trouble for not naming another 20 I respect. Late stage / growth VC sucks up the most amount of capital in aggregate in our industry and there was a movement by some of the larger VCs to say that traditional VCs would “get squeezed” but LPs don’t buy it. More LPs said that traditional A/B VC funds were the “best fit” for them than any other kind but the reality is that the largest response was that LPs wanted a “healthy mix” of Seed, A/B and Growth. So … Not a single LP surveyed said Trump was the right leader for the United States and a clear 71% said they disliked Trump, were anti-Trump or were “deeply offended” by Trump. But at the end of the day most LPs (like most VCs we surveyed) believe that the president likely won’t have a major impact one way or the other on how the venture capital markets and therefore the underlying technology startup markets perform. If the mood of LPs that we surveyed is a reflection on how VCs get financed in the coming three years then a natural conclusion would be that entrepreneurs should continue to find the venture markets robust and capital available for great ideas and businesses with early traction. That said, of course all bets are off if there are unforeseen world events that cause markets to panic and one has to believe the chances of such a “black swan” are greater under a Trump presidency than any presidency in recent history. Here is the entire survey, which can also be downloaded and shared. If you need the original keynote slides for any reason — just ask. ", "title": "Why the LP Outlook is Good for Venture and Startups in 2017–2020", "sentences": [{"8d27": "Why the LP Outlook is Good for Venture and Startups in 2017–2020"}, {"45b4": "Every year Upfront Ventures surveys Limited Partners (LPs) who are the main source of capital that invests in VC funds and thus the main source of capital that goes to startups to get an early-warning sense of the year ahead, leaving aside any Black Swans."}, {"a928": "The results are in (and the full deck available) and a few things are clear:"}, {"9eef": "So here are some details (please thank & follow! Chang Xu for her tireless effort in helping me prepare and analyze the data)"}, {"93ec": "If you met with LPs to raise a fund in 2009–2012 the most common refrain was, “We have too many managers and too many dollars in venture. We’re trying to limit our exposure.” That has changed dramatically in the past five years. At the tail end of this period when demand was picking up for the industry there was still a belief that in venture it only mattered that you got into the top 10 funds in Silicon Valley."}, {"d3d9": "There is no doubt LPs still want access to the most elite funds but increasingly LPs have acknowledged that the industry has changed and some of the best performing managers have come from new firms and even many are outside of Silicon Valley thus LPs are more open to “new names.”"}, {"256f": "And while our entire industry’s riches have grown and as startups have stayed private for longer periods of time and raised significantly more private capital than they did in the past, an increasing number of LPs have sought to do “co-investments” win the funds that they back giving them more exposure to what they hope will be the better performing portfolio companies"}, {"62cc": "If you want to understand why LPs are so active in venture these days, the most obvious reason is that technology startups have paid off handsomely for many LPs but a more nuanced answer would also include “relative to other asset classes.” This is key because in a permanently low-interest-rate environment parking large pools of capital in assets that benefit from interest is not possible so LPs seek “higher yield.” I know most startups (or even VCs) tend not to think about this but when you ask LPs the data are clear:"}, {"c9eb": "Another trend we’ve noticed in LP opinions is regarding seed funds. When people like Michael Kim at Cendana or Hans Swildens at Industry Ventures started focused on “Micro VCs” a decade ago or so we heard many LPs saying, “I’m not sure if seed fund investing is really a smart strategy. Will it last? Will they get squeezed? Will they have enough capital?” We never hear that any more. Seed fund investing is acknowledged likely to be a permanent force in our industry with too many great funds to list but aside from those I listed previously there is obviously Felicis, Softtech, Floodgate, K9, Forerunner, Cowboy and so, so many more that I’m already in trouble for not naming another 20 I respect."}, {"f4b2": "Late stage / growth VC sucks up the most amount of capital in aggregate in our industry and there was a movement by some of the larger VCs to say that traditional VCs would “get squeezed” but LPs don’t buy it. More LPs said that traditional A/B VC funds were the “best fit” for them than any other kind but the reality is that the largest response was that LPs wanted a “healthy mix” of Seed, A/B and Growth."}, {"e30b": "So …"}, {"e622": "Not a single LP surveyed said Trump was the right leader for the United States and a clear 71% said they disliked Trump, were anti-Trump or were “deeply offended” by Trump."}, {"822c": "But at the end of the day most LPs (like most VCs we surveyed) believe that the president likely won’t have a major impact one way or the other on how the venture capital markets and therefore the underlying technology startup markets perform."}, {"ed79": "If the mood of LPs that we surveyed is a reflection on how VCs get financed in the coming three years then a natural conclusion would be that entrepreneurs should continue to find the venture markets robust and capital available for great ideas and businesses with early traction. That said, of course all bets are off if there are unforeseen world events that cause markets to panic and one has to believe the chances of such a “black swan” are greater under a Trump presidency than any presidency in recent history."}, {"3659": "Here is the entire survey, which can also be downloaded and shared. If you need the original keynote slides for any reason — just ask."}], "child": "334_1\t334_2\t334_3"}