{"name": "337", "parent": "", "content": "Why Was Winter in Venture Capital Funding so Short? It was only a year ago that many in the Venture Capital industry were predicting that “winter was coming” and to be fair the author of this post was chief amongst them. Yet as we enter February 2017 the VC funding markets are booming, Snap, Inc has filed for its IPO, AppDynamics was just purchased for $3.7 billion by Cisco and the only winter that can be found is at the ski resorts following California’s epic snowy and rainy January. Ok, Suster. So WTF happened? Why no winter? Actually, winter did come and I have the data that shows it. But the reality is that “global warming” massively blunted the effects of winter and my prognosis for VC fundings of entrepreneurs in 2017–2018 is now very sunny indeed. Unless of course something Trumps our good weather. WINTER For starters when we conducted our annual VC & LP survey in December of 2016 to prepare our annual Upfront State of the VC Industry report we found that twice as many VCs cut their investments in 2016 relative to 2015 with > 30% of VCs having cut investments. And it’s not just that VCs cut their investment pace but they also indicated overwhelmingly that valuations of investments had dropped with 76% of all VCs surveyed suggesting 2016 had lower valuations than 2015. So VCs made fewer investments at lower prices and generally on terms that were more favorable to investors relative to 2015. This past year was also the year that startup boards also got more disciplined about containing burn rates and pushing for companies to be run more pragmatically. With nearly 2/3rd of all VCs citing cost-cutting in 2016 as the norm — this is a clear indication that winter made an appearance. So if funding from VCs slowed, valuations dropped and burn rates were slashed, WTF happened to winter again? “GLOBAL” Warming The first thing that’s clear is that global investors from China, Singapore, UAE, Saudi Arabia, Japan and elsewhere stepped in to fill the gap that was initially created by the VC pull back. One stark graph should give you a sense of the picture. Chinese Foreign Direct Investment (FDI, excluding real estate) skyrocketed in 2016 as Chinese investors seek diversification out of their domestic markets. While this is total FDI as opposed to just venture, it should give you an indication of the international trend. And while the US had FANG (Facebook, Amazon/Apple, Netflix and Google) China has BAT (Baidu, Alibaba and Tencent). Baidu alone raised $3.2 billion in venture capital funds with one A-round fund and one late-stage fund. In case you’re keeping score at home — that’s approximately the size of 65 US seed-stage funds managed by one company. Alibaba invested $800 million in just one deal — Magic Leap and Temasik (Singapore sovereign wealth fund) invested $800 million in Verily. Those two investments represent the equivalent of another 32 US seed-stage funds just in two deals. WeWork raised $690 million from Chinese investors, NextVR $80 million and Meta AR $50 million. In fact there are now so many Chinese VC funds chasing returns and also with the mandate to bring US innovation back to China that it would require an entire presentation just to talk about them all. But it’s not just China and Singapore. Saudi’s PIF + UAE’s Mubadala teamed up with Japan’s SoftBank to launch a new $100 billion fund. With oil prices dropping it’s clear that the region also had to diversify assets and also bring innovation back to their doorsteps. Perhaps this is why the Kuwait Investment Authority put $165 million into Jawbone and Saudi’s PIF put $3.5 billion into Uber. GLOBAL seems here to stay unless something stupid Trump’s it. Global “WARMING” But “global” isn’t the only story, warning is at least half of the equation. One big factor that is helping to push the VC markets is that frankly many other asset classes don’t have the return profiles asset managers desire given the perpetually low interest rates and 77% of LPs & VCs we surveyed felt this was a significant contributor to the booming VC markets. And while VCs had pulled back in 2016 it wasn’t only foreign investors who filled in the gap. One major group that has ramped up its venture investments have been corporates. Of course there’s the usual suspects like Google, Intel, Salesforce.com and Qualcomm but the total number of corporate VCs has more than doubled in the past 4 years from 61 major programs to 131. So you have GM investing $500 million in Lyft, BMW starting a $530 million venture fund, Comcast/NBCU investing $200 million into BuzzFeed and even Sesame Street now has a venture capital fund! And while twice as many VCs dialed back investments in 2016 over 2015 it was the exact opposite for Corporate VCs (CVCs) who filled in the gap for the market. And more than 50% of CVCs said they plan to invest even more in 2017. Corporations in the past 18 months have not only ramped up venture capital investments but they’ve also picked up the pace of mega-deals to buy startup companies and often from companies not always associated with big tech purchases like Unilever buying DollarShaveClub for $1 billion (go LA!) or Walmart buying Jet for $3 billion. We all know that M&A begets more venture investing. While the M&A story has been widely reported perhaps far fewer people know that Limited Partners (LPs), the people who fund VC firms, have finally been able to restock their coffers in the past 4 years with significantly more money coming to them in distributions than capital calls to fund VC firm investments. This chart surprised me the most. When LPs get distributions back they reinvest it into new asset programs in a diversified manner but when VC investments are yielding higher returns than other asset classes even this percentage is getting bigger so VCs are not only able to more easily raise funds but they’re also getting a large slice of the pie. It should therefore come as no surprise that both the number of funds and the amount of dollars raised have both doubled. And while this author would find it hard to ever say anything positive about the current president of the United States there is perhaps one decision that he seems likely to take that would likely benefit the US technology sector — a tax holiday on the repatriation of foreign capital. Many tech companies have earned huge profits overseas and since there is a tax on bringing it back into the US they leave it abroad. We estimate that the top 5 US tech firms have more than $500 billion in cash sitting abroad and if this is brought back to the US it is likely to increase: R&D expenditure, M&A deals and Venture Capital financings. So if I had to sum up for you what I see coming in the next two year’s of VC financings and why it will likely be a great time to be an entrepreneur in the US in 2017–2018 it’s this But while funding for VCs and funding for tech startups should remain robust, funding is not the same thing as returns. And if the industry becomes over-funded I suspect it will lead to bad behavior at startups, bad behavior at VCs and thus overall depressed returns relative to smaller funding cycles. But this is normal business known as an “economic cycle.” If you want to read the full report it is here on SlideShare. We will also be publishing the full VC Survey and LP Survey over the course of the next couple of weeks. ", "title": "Why Was Winter in Venture Capital Funding so Short?", "sentences": [{"4770": "Why Was Winter in Venture Capital Funding so Short?"}, {"d186": "It was only a year ago that many in the Venture Capital industry were predicting that “winter was coming” and to be fair the author of this post was chief amongst them. Yet as we enter February 2017 the VC funding markets are booming, Snap, Inc has filed for its IPO, AppDynamics was just purchased for $3.7 billion by Cisco and the only winter that can be found is at the ski resorts following California’s epic snowy and rainy January."}, {"4606": "Ok, Suster. So WTF happened? Why no winter?"}, {"89f3": "Actually, winter did come and I have the data that shows it. But the reality is that “global warming” massively blunted the effects of winter and my prognosis for VC fundings of entrepreneurs in 2017–2018 is now very sunny indeed. Unless of course something Trumps our good weather."}, {"88d8": "WINTER"}, {"7173": "For starters when we conducted our annual VC & LP survey in December of 2016 to prepare our annual Upfront State of the VC Industry report we found that twice as many VCs cut their investments in 2016 relative to 2015 with > 30% of VCs having cut investments."}, {"8cb3": "And it’s not just that VCs cut their investment pace but they also indicated overwhelmingly that valuations of investments had dropped with 76% of all VCs surveyed suggesting 2016 had lower valuations than 2015."}, {"fd67": "So VCs made fewer investments at lower prices and generally on terms that were more favorable to investors relative to 2015. This past year was also the year that startup boards also got more disciplined about containing burn rates and pushing for companies to be run more pragmatically. With nearly 2/3rd of all VCs citing cost-cutting in 2016 as the norm — this is a clear indication that winter made an appearance."}, {"d85a": "So if funding from VCs slowed, valuations dropped and burn rates were slashed, WTF happened to winter again?"}, {"907e": "“GLOBAL” Warming"}, {"e90b": "The first thing that’s clear is that global investors from China, Singapore, UAE, Saudi Arabia, Japan and elsewhere stepped in to fill the gap that was initially created by the VC pull back."}, {"376f": "One stark graph should give you a sense of the picture. Chinese Foreign Direct Investment (FDI, excluding real estate) skyrocketed in 2016 as Chinese investors seek diversification out of their domestic markets. While this is total FDI as opposed to just venture, it should give you an indication of the international trend."}, {"b6ee": "And while the US had FANG (Facebook, Amazon/Apple, Netflix and Google) China has BAT (Baidu, Alibaba and Tencent). Baidu alone raised $3.2 billion in venture capital funds with one A-round fund and one late-stage fund. In case you’re keeping score at home — that’s approximately the size of 65 US seed-stage funds managed by one company."}, {"8d0a": "Alibaba invested $800 million in just one deal — Magic Leap and Temasik (Singapore sovereign wealth fund) invested $800 million in Verily. Those two investments represent the equivalent of another 32 US seed-stage funds just in two deals."}, {"8d95": "WeWork raised $690 million from Chinese investors, NextVR $80 million and Meta AR $50 million. In fact there are now so many Chinese VC funds chasing returns and also with the mandate to bring US innovation back to China that it would require an entire presentation just to talk about them all."}, {"487b": "But it’s not just China and Singapore. Saudi’s PIF + UAE’s Mubadala teamed up with Japan’s SoftBank to launch a new $100 billion fund. With oil prices dropping it’s clear that the region also had to diversify assets and also bring innovation back to their doorsteps. Perhaps this is why the Kuwait Investment Authority put $165 million into Jawbone and Saudi’s PIF put $3.5 billion into Uber."}, {"1d0e": "GLOBAL seems here to stay unless something stupid Trump’s it."}, {"848e": "Global “WARMING”"}, {"5d74": "But “global” isn’t the only story, warning is at least half of the equation."}, {"2b85": "One big factor that is helping to push the VC markets is that frankly many other asset classes don’t have the return profiles asset managers desire given the perpetually low interest rates and 77% of LPs & VCs we surveyed felt this was a significant contributor to the booming VC markets."}, {"227f": "And while VCs had pulled back in 2016 it wasn’t only foreign investors who filled in the gap. One major group that has ramped up its venture investments have been corporates. Of course there’s the usual suspects like Google, Intel, Salesforce.com and Qualcomm but the total number of corporate VCs has more than doubled in the past 4 years from 61 major programs to 131."}, {"dbad": "So you have GM investing $500 million in Lyft, BMW starting a $530 million venture fund, Comcast/NBCU investing $200 million into BuzzFeed and even Sesame Street now has a venture capital fund!"}, {"cee8": "And while twice as many VCs dialed back investments in 2016 over 2015 it was the exact opposite for Corporate VCs (CVCs) who filled in the gap for the market. And more than 50% of CVCs said they plan to invest even more in 2017."}, {"b009": "Corporations in the past 18 months have not only ramped up venture capital investments but they’ve also picked up the pace of mega-deals to buy startup companies and often from companies not always associated with big tech purchases like Unilever buying DollarShaveClub for $1 billion (go LA!) or Walmart buying Jet for $3 billion. We all know that M&A begets more venture investing."}, {"019b": "While the M&A story has been widely reported perhaps far fewer people know that Limited Partners (LPs), the people who fund VC firms, have finally been able to restock their coffers in the past 4 years with significantly more money coming to them in distributions than capital calls to fund VC firm investments. This chart surprised me the most."}, {"e4c2": "When LPs get distributions back they reinvest it into new asset programs in a diversified manner but when VC investments are yielding higher returns than other asset classes even this percentage is getting bigger so VCs are not only able to more easily raise funds but they’re also getting a large slice of the pie. It should therefore come as no surprise that both the number of funds and the amount of dollars raised have both doubled."}, {"38bf": "And while this author would find it hard to ever say anything positive about the current president of the United States there is perhaps one decision that he seems likely to take that would likely benefit the US technology sector — a tax holiday on the repatriation of foreign capital. Many tech companies have earned huge profits overseas and since there is a tax on bringing it back into the US they leave it abroad. We estimate that the top 5 US tech firms have more than $500 billion in cash sitting abroad and if this is brought back to the US it is likely to increase: R&D expenditure, M&A deals and Venture Capital financings."}, {"4905": "So if I had to sum up for you what I see coming in the next two year’s of VC financings and why it will likely be a great time to be an entrepreneur in the US in 2017–2018 it’s this"}, {"7a69": "But while funding for VCs and funding for tech startups should remain robust, funding is not the same thing as returns. And if the industry becomes over-funded I suspect it will lead to bad behavior at startups, bad behavior at VCs and thus overall depressed returns relative to smaller funding cycles. But this is normal business known as an “economic cycle.”"}, {"2057": "If you want to read the full report it is here on SlideShare. We will also be publishing the full VC Survey and LP Survey over the course of the next couple of weeks."}], "child": "337_1\t337_2\t337_3\t337_4\t337_5\t337_6\t337_7\t337_8\t337_9\t337_10\t337_11\t337_12\t337_13"}