{"name": "338", "parent": "", "content": "Welcoming the Newest Partner to Upfront Ventures Today is amongst the proudest days I’ve had at Upfront Ventures — getting the chance to announce that Kevin Zhang has been promoted to Partner. Watching him develop over the past 4.5 years at Upfront has been both a pleasure and also has taught me a lot about venture capital. Kevin joined Upfront in 2012 as an Associate. We generally look for associates who are deeply quantitative, have great research & analytical skills and often have the tool kit for framing and making complex decisions. We also look for a cultural fit with Upfront, which includes the gravitas to deal with executives and founders at the startups we back as well as the other board members. This latter bit is very important to us and very hard to achieve. How do you find somebody that is exceptionally bright, driven and accomplished and yet still be humble enough to understand that the founders we back are the ones who have invented technologies and have to live with the day-to-day decision-making and hard choices. I mean this seriously. It’s very easy in venture capital when you’ve seen thousands of companies have read thousands of decks and spreadsheets and been to numerous conferences and exchanged ideas with other investors and entrepreneurs to feel like “you know better” and that’s precisely what we try to encourage Team Upfront not to feel or how not to behave. We are sparring partners, not “deciders.” We roll up our sleeves and help you do the work and analysis and try to be supportive but then we step back and you own the next move. Watching Kevin play this role side-by-side with me at companies like MakeSpace, DataSift and uBeam has been very instructive of how valuable he would eventually become as a board member and investor. Kevin built a lot of our internal processes at Upfront including our associate training program to make sure the future associates that we onboard have the tools and leverage of our combined learnings. He built an internal database of downstream VC investors so that as each company is ready to raise more capital they don’t have to start from scratch. We track which investment firms and which investment partners are a good fit for each company we have back so that we don’t have a scattergun approach to fund raising. We like to know that when we call our peers they truly are the best fit for the company in which we’ve invested. We had previously promoted Kevin to Principal a couple of years ago and in this role we asked him to start sourcing more deals for partners and that if there were any that were in his focus area he could lead a few deals on his own with the oversight of a Partner who was championing the deal. Kevin has been instrumental in sourcing deals including Teforia and Nima as well as lead our investments in Grove Labs & VREAL (our first VR deal). As an area of investment focus Kevin has been our primary lead in video games, health sciences and agriculture technologies and played a key support role for Yves at Apeel Sciences (just announced a $30m funding from Andreessen Horowitz and DBL). What the journalist from the NY Times failed to mention was that Upfront led the Seed and the A-Rounds and is the largest shareholder in the company, which apparently didn’t warrant a mention. The take-away I’d love to leave you with is that we love to back entrepreneurs super early and if we lead a seed we will often offer to proactively lead an A-round or graciously step back if another lead comes to the table that the founder wants to include. Kevin has been instrumental in supporting our investment in Health Data Vision given his knowledge in the healthcare sector and is the board member at Seriously, creator of the hit game series Best Fiends, that has won several awards. Aside from deal work, analytical support and sourcing Kevin proactively set out as a Principal to build VC relationships. In our industry one of the most important, seldom discussed realities of the investment is VC-to-VC relationships and anybody wanting to succeed in our world needs to be amazing in this realm. The reality is the best angels, the best seed funds and the best A-round investors have choices about whom they will refer deals to and are very selective. Having a great co-investor (in good times and bad times, till death do we part) can make all the difference in critical moments of a company’s trajectory. Bad investors can cause management teams to burn immeasurable calories on wasted efforts and harm companies in vulnerable moments. Great investors know whom to trust and whom not to. Because investor-to-investor relationships are so important in our industry if you can become a trusted peer you become infinitely more valuable to the entrepreneurs with whom you work. It’s not only that you need to be able to source great deals from earlier-stage investors you also need to be respected and trusted by investors who may look at your deals in the next round. It takes years to establish these trusted relationships and watching Kevin build out his network has been an inspiration and gives me the confidence that Upfront itself has greatly broadened its relationships in the industry. Kevin not only built relationships with many of the younger, more emerging professionals in all of the US funds but he has also developed a very active investor relationships with Asian funds in particular in Japan, South Korea and China and in Northern Europe. He took his role in the games industry and set out to get to know every fund in the sector, which has taken him internationally. Both Yves Sisteron and I have long, established networks in Europe since we’re both dual citizens (France and England) who have spent long periods of our lives abroad. We also recognize how important it is to have relationships in Asia given the development of the next 50 years of the world so watching us grow our connective tissue to the East has been wonderful. And of course it doesn’t hurt that Kevin is fluent in Mandarin. I mentioned at the start that Kevin has taught me something about Venture Capital. I have long believed in diversity of thought and diversity of experiences in leadership teams and in decision making. I recognize my own blind spots from seeing the world with just one lens. Anybody who wants to better understand your own biases and limitations should read Thinking, Fast and Slow and if you enjoy that then also The Black Swan. I try hard not to fall prey to “The Narrative Fallacy” where your own past experience overly guides your decision-making in the future. Of course as hard as we try we’re all guilty to some degree of this — it’s human nature. Like many in the venture world we can at times be a team of “chest pounders” self assured of our opinions and loud & vociferous in defense of our ideas. This is the quintessential trait when you think of a room full of smart people amongst other smart people in order to win over others to advocate for deals that seem improbable, which is a trait we look for in our investments. I think the “strong opinion, loudly expressed” personality trait is what has made for such a successful working relationship amongst Greg, Kara and myself. Yves Sisteron, our founder and still a full-time and very active member of our partnership, has the opposite style. He is more soft-spoken, speaks more seldom and advocates with a softer stick. In a way I think I had mentally banked this as his prerogative given his long, successful track record where everybody is willing to show more deference given he has been our most successful investor and has the most experience. But Kevin has made me realize that having multiple styles in our own decision-making framework is valuable and that Yves’ skills in this regard don’t eminent purely from seniority. Kevin is soft-spoken but always supported by facts. He doesn’t feel the need to always speak first but when he weighs in he is respected. His style has allowed him to more easily source deals with more introverted founders who gravitate towards his quieter approach. We always preach the need to build management teams with players of complementary skills and of course we believe in practicing what we preach. It has been such a pleasure working with Kevin these past 4.5 years and he has definitely earned the trust and respect of all of his peer group of Partners at Upfront Ventures. Please help me in congratulating him. And if you’re not already following him on Twitter you would benefit from being connected. ", "title": "Welcoming the Newest Partner to Upfront Ventures", "sentences": [{"fc02": "Welcoming the Newest Partner to Upfront Ventures"}, {"c9f9": "Today is amongst the proudest days I’ve had at Upfront Ventures — getting the chance to announce that Kevin Zhang has been promoted to Partner. Watching him develop over the past 4.5 years at Upfront has been both a pleasure and also has taught me a lot about venture capital."}, {"bcf2": "Kevin joined Upfront in 2012 as an Associate. We generally look for associates who are deeply quantitative, have great research & analytical skills and often have the tool kit for framing and making complex decisions. We also look for a cultural fit with Upfront, which includes the gravitas to deal with executives and founders at the startups we back as well as the other board members."}, {"0fff": "This latter bit is very important to us and very hard to achieve. How do you find somebody that is exceptionally bright, driven and accomplished and yet still be humble enough to understand that the founders we back are the ones who have invented technologies and have to live with the day-to-day decision-making and hard choices. I mean this seriously."}, {"60a5": "It’s very easy in venture capital when you’ve seen thousands of companies have read thousands of decks and spreadsheets and been to numerous conferences and exchanged ideas with other investors and entrepreneurs to feel like “you know better” and that’s precisely what we try to encourage Team Upfront not to feel or how not to behave. We are sparring partners, not “deciders.” We roll up our sleeves and help you do the work and analysis and try to be supportive but then we step back and you own the next move."}, {"6138": "Watching Kevin play this role side-by-side with me at companies like MakeSpace, DataSift and uBeam has been very instructive of how valuable he would eventually become as a board member and investor."}, {"d9e1": "Kevin built a lot of our internal processes at Upfront including our associate training program to make sure the future associates that we onboard have the tools and leverage of our combined learnings. He built an internal database of downstream VC investors so that as each company is ready to raise more capital they don’t have to start from scratch. We track which investment firms and which investment partners are a good fit for each company we have back so that we don’t have a scattergun approach to fund raising. We like to know that when we call our peers they truly are the best fit for the company in which we’ve invested."}, {"c410": "We had previously promoted Kevin to Principal a couple of years ago and in this role we asked him to start sourcing more deals for partners and that if there were any that were in his focus area he could lead a few deals on his own with the oversight of a Partner who was championing the deal."}, {"b3d4": "Kevin has been instrumental in sourcing deals including Teforia and Nima as well as lead our investments in Grove Labs & VREAL (our first VR deal). As an area of investment focus Kevin has been our primary lead in video games, health sciences and agriculture technologies and played a key support role for Yves at Apeel Sciences (just announced a $30m funding from Andreessen Horowitz and DBL). What the journalist from the NY Times failed to mention was that Upfront led the Seed and the A-Rounds and is the largest shareholder in the company, which apparently didn’t warrant a mention. The take-away I’d love to leave you with is that we love to back entrepreneurs super early and if we lead a seed we will often offer to proactively lead an A-round or graciously step back if another lead comes to the table that the founder wants to include."}, {"969a": "Kevin has been instrumental in supporting our investment in Health Data Vision given his knowledge in the healthcare sector and is the board member at Seriously, creator of the hit game series Best Fiends, that has won several awards."}, {"6290": "Aside from deal work, analytical support and sourcing Kevin proactively set out as a Principal to build VC relationships. In our industry one of the most important, seldom discussed realities of the investment is VC-to-VC relationships and anybody wanting to succeed in our world needs to be amazing in this realm. The reality is the best angels, the best seed funds and the best A-round investors have choices about whom they will refer deals to and are very selective. Having a great co-investor (in good times and bad times, till death do we part) can make all the difference in critical moments of a company’s trajectory. Bad investors can cause management teams to burn immeasurable calories on wasted efforts and harm companies in vulnerable moments. Great investors know whom to trust and whom not to."}, {"66fa": "Because investor-to-investor relationships are so important in our industry if you can become a trusted peer you become infinitely more valuable to the entrepreneurs with whom you work. It’s not only that you need to be able to source great deals from earlier-stage investors you also need to be respected and trusted by investors who may look at your deals in the next round. It takes years to establish these trusted relationships and watching Kevin build out his network has been an inspiration and gives me the confidence that Upfront itself has greatly broadened its relationships in the industry."}, {"4baf": "Kevin not only built relationships with many of the younger, more emerging professionals in all of the US funds but he has also developed a very active investor relationships with Asian funds in particular in Japan, South Korea and China and in Northern Europe. He took his role in the games industry and set out to get to know every fund in the sector, which has taken him internationally."}, {"49dd": "Both Yves Sisteron and I have long, established networks in Europe since we’re both dual citizens (France and England) who have spent long periods of our lives abroad. We also recognize how important it is to have relationships in Asia given the development of the next 50 years of the world so watching us grow our connective tissue to the East has been wonderful. And of course it doesn’t hurt that Kevin is fluent in Mandarin."}, {"b69f": "I mentioned at the start that Kevin has taught me something about Venture Capital. I have long believed in diversity of thought and diversity of experiences in leadership teams and in decision making. I recognize my own blind spots from seeing the world with just one lens. Anybody who wants to better understand your own biases and limitations should read Thinking, Fast and Slow and if you enjoy that then also The Black Swan. I try hard not to fall prey to “The Narrative Fallacy” where your own past experience overly guides your decision-making in the future. Of course as hard as we try we’re all guilty to some degree of this — it’s human nature."}, {"06d0": "Like many in the venture world we can at times be a team of “chest pounders” self assured of our opinions and loud & vociferous in defense of our ideas. This is the quintessential trait when you think of a room full of smart people amongst other smart people in order to win over others to advocate for deals that seem improbable, which is a trait we look for in our investments. I think the “strong opinion, loudly expressed” personality trait is what has made for such a successful working relationship amongst Greg, Kara and myself."}, {"7e70": "Yves Sisteron, our founder and still a full-time and very active member of our partnership, has the opposite style. He is more soft-spoken, speaks more seldom and advocates with a softer stick. In a way I think I had mentally banked this as his prerogative given his long, successful track record where everybody is willing to show more deference given he has been our most successful investor and has the most experience."}, {"b768": "But Kevin has made me realize that having multiple styles in our own decision-making framework is valuable and that Yves’ skills in this regard don’t eminent purely from seniority. Kevin is soft-spoken but always supported by facts. He doesn’t feel the need to always speak first but when he weighs in he is respected. His style has allowed him to more easily source deals with more introverted founders who gravitate towards his quieter approach."}, {"b960": "We always preach the need to build management teams with players of complementary skills and of course we believe in practicing what we preach. It has been such a pleasure working with Kevin these past 4.5 years and he has definitely earned the trust and respect of all of his peer group of Partners at Upfront Ventures."}, {"d728": "Please help me in congratulating him. And if you’re not already following him on Twitter you would benefit from being connected."}], "child": "338_1\t338_2\t338_3\t338_4\t338_5\t338_6\t338_7\t338_8"}