{"name": "341", "parent": "", "content": "How Do VCs Choose Their Investors (and should entrepreneurs care?) I recently read a blog post by Beezer Clarkson, Managing Director of Sapphire Ventures about why entrepreneurs should care about from whom their VC funds raise their capital. I spent a bunch of time thinking about this position — especially since Beezer is an investor in Upfront Ventures. There are a lot of things I think entrepreneurs should care about when raising from a VC: I could go on for a long time. Maybe I’ll save that for a future post. But should entrepreneurs really care whom the LPs of a fund are? I’m still not sure. But I do know that VCs should care a great deal about whom their LPs are and I find that some are less thoughtful than they could or should be. We were in the very fortunate position of having more than $425 million in commitments for our last fund, which only raised $280 million. We capped our fund size so that we would stay true to our investment strategy in terms of size, scope and number of partners as we stood in 2014 when we raised the fund. And we felt terrible not being able to let every LP in but we were forced to make some hard compromises yet we opened up our fund to Sapphire even though they were a first time LP. Why? 1. Truly Focused on VC / Knowledgeable About How Partnerships Work One of the things I value in an LP is a really passionate and inside knowledge of the venture capital industry. There are many LPs who invest in VC one day, oil & gas the next and timber on Wednesday. I’ve met many smart and capable people like this but it was also clear that many of them didn’t have an intimate knowledge of what is truly unique to venture. Beezer did. She has formerly worked at a VC fund (DFJ) and worked closely with the partners and the network at DFJ and knew what it was like to build, manage and evolve a VC partnership. So I immediately felt like I had a partner whom I could call for sensitive advice on topics where there aren’t many sources of input or mentorship. It’s the same reason I think many entrepreneurs like working with VCs who had formerly been entrepreneurs. 2. Help with Hard-to-Access People Of course I also appreciate the fact that with Sapphire came better access to the executive team at SAP, including organizing a small dinner with their CEO so I could learn first hand where they see the future going. We have many LPs who come from industry and this is truly a value-add in a LP/VC relationship 3. Stable Capital Amongst the hardest things to find when one raises a new fund is ability to have stable capital. Many of the sources of capital for new funds come from investors who can’t necessarily back you in good times and bad. We lived that first hand. Our first LPs from 1996 were industry players who put us in business: Carrefour (the large European retailer), DLJ (the former investment bank) and a billionaire software exec. As venture fell out of favor all three pulled out of the asset class. Even though our 2000 fund was the single best performing fund in the United States for that vintage, continuing to get investments wasn’t possible so we had to rebuild. We rebuilt our base and secured what we thought was the perfect anchor only to find out that a strategy change for the firm meant our lead was moving from VC to timber and they pulled out of VC altogether. This was in 2010 — exactly the wrong time to be pulling out of venture. So you really want LPs who invest in the category in good markets and bad. And as a VC you still need to earn the right to get allocations when you raise new funds but that’s within your control. Many VCs have turned to Foundations and University Endowments (F&Es) as a source of stable capital and this has certainly been a strong pillar for many a VC fund. We ourselves decided to build > 35% of our fund with F&Es. What’s interesting about Sapphire is that they have now raised on an “evergreen structure” with $1 billion new fund (across LP investing and direct investing into portfolio). So we see them with the same long-term eye as we would our other sources of capital. Summary Should entrepreneurs care that we have Sapphire as an LP? Well — only in so much as we have an easier time than others in getting technology entrepreneurs in front of executives at SAP when appropriate. But to other VCs — when you go to raise money — we’ve been thrilled with our choice to work with Sapphire. They’ve been a great partner, delivered on what they said they would do and working with Beezer has felt like working with any other VC I work with. She knows our business and often acts like an entrepreneur herself. For that — I’m grateful. Congrats on your new fund, Beezer and Nino. And thank you for having the conviction to back Upfront. ", "title": "How Do VCs Choose Their Investors (and should entrepreneurs care?)", "sentences": [{"be62": "How Do VCs Choose Their Investors (and should entrepreneurs care?)"}, {"041d": "I recently read a blog post by Beezer Clarkson, Managing Director of Sapphire Ventures about why entrepreneurs should care about from whom their VC funds raise their capital."}, {"fe17": "I spent a bunch of time thinking about this position — especially since Beezer is an investor in Upfront Ventures. There are a lot of things I think entrepreneurs should care about when raising from a VC:"}, {"6f27": "I could go on for a long time. Maybe I’ll save that for a future post. But should entrepreneurs really care whom the LPs of a fund are? I’m still not sure."}, {"27e1": "But I do know that VCs should care a great deal about whom their LPs are and I find that some are less thoughtful than they could or should be. We were in the very fortunate position of having more than $425 million in commitments for our last fund, which only raised $280 million. We capped our fund size so that we would stay true to our investment strategy in terms of size, scope and number of partners as we stood in 2014 when we raised the fund."}, {"4c52": "And we felt terrible not being able to let every LP in but we were forced to make some hard compromises yet we opened up our fund to Sapphire even though they were a first time LP."}, {"3255": "Why?"}, {"bf78": "1. Truly Focused on VC / Knowledgeable About How Partnerships Work"}, {"b6b6": "One of the things I value in an LP is a really passionate and inside knowledge of the venture capital industry. There are many LPs who invest in VC one day, oil & gas the next and timber on Wednesday. I’ve met many smart and capable people like this but it was also clear that many of them didn’t have an intimate knowledge of what is truly unique to venture."}, {"a73e": "Beezer did. She has formerly worked at a VC fund (DFJ) and worked closely with the partners and the network at DFJ and knew what it was like to build, manage and evolve a VC partnership. So I immediately felt like I had a partner whom I could call for sensitive advice on topics where there aren’t many sources of input or mentorship. It’s the same reason I think many entrepreneurs like working with VCs who had formerly been entrepreneurs."}, {"c5d8": "2. Help with Hard-to-Access People"}, {"875d": "Of course I also appreciate the fact that with Sapphire came better access to the executive team at SAP, including organizing a small dinner with their CEO so I could learn first hand where they see the future going. We have many LPs who come from industry and this is truly a value-add in a LP/VC relationship"}, {"d1a3": "3. Stable Capital"}, {"5ea5": "Amongst the hardest things to find when one raises a new fund is ability to have stable capital. Many of the sources of capital for new funds come from investors who can’t necessarily back you in good times and bad."}, {"17d0": "We lived that first hand. Our first LPs from 1996 were industry players who put us in business: Carrefour (the large European retailer), DLJ (the former investment bank) and a billionaire software exec. As venture fell out of favor all three pulled out of the asset class. Even though our 2000 fund was the single best performing fund in the United States for that vintage, continuing to get investments wasn’t possible so we had to rebuild."}, {"a8a1": "We rebuilt our base and secured what we thought was the perfect anchor only to find out that a strategy change for the firm meant our lead was moving from VC to timber and they pulled out of VC altogether. This was in 2010 — exactly the wrong time to be pulling out of venture."}, {"8380": "So you really want LPs who invest in the category in good markets and bad. And as a VC you still need to earn the right to get allocations when you raise new funds but that’s within your control."}, {"0927": "Many VCs have turned to Foundations and University Endowments (F&Es) as a source of stable capital and this has certainly been a strong pillar for many a VC fund. We ourselves decided to build > 35% of our fund with F&Es."}, {"f4e8": "What’s interesting about Sapphire is that they have now raised on an “evergreen structure” with $1 billion new fund (across LP investing and direct investing into portfolio). So we see them with the same long-term eye as we would our other sources of capital."}, {"09ab": "Summary"}, {"f8df": "Should entrepreneurs care that we have Sapphire as an LP? Well — only in so much as we have an easier time than others in getting technology entrepreneurs in front of executives at SAP when appropriate."}, {"c659": "But to other VCs — when you go to raise money — we’ve been thrilled with our choice to work with Sapphire. They’ve been a great partner, delivered on what they said they would do and working with Beezer has felt like working with any other VC I work with. She knows our business and often acts like an entrepreneur herself."}, {"b8c9": "For that — I’m grateful. Congrats on your new fund, Beezer and Nino. And thank you for having the conviction to back Upfront."}], "child": "341_1\t341_2\t341_3\t341_4\t341_5\t341_6"}