{"name": "342", "parent": "", "content": "The Snap IPO Happened. What Next LA? Mayor Eric Garcetti at Upfront Summit, February 2017 I first sat down with then councilman Eric Garcetti on the Ides of March 2012 — almost 5 years ago exactly. He was running to be the 42nd mayor of Los Angeles and he outlined his vision to “open up the city government to technology and innovation” if he were elected. He wanted to bring the same level of technology focus and energy that Mayor Bloomberg had brought to New York City. It’s amazing to see the success of LA under Mayor Garcetti and that’s why I urge you to turn out to reelect him tomorrow — March 7, 2017 - every single vote matters. But this post is about the broader context of LA. It’s hard to remember that in 2012 it was still hard for LA VCs to persuade investors into funds that LA was a viable market for great venture capital funds or convince many VCs that LA was a market worth investing dollars into startups. It’s amazing how much has changed in the past five years, 4 of which have coincided with Mayor Garcetti’s tenure. It is fitting that 2012 is the year that Snapchat really took off in Los Angeles and raised its first venture capital and began a five year ascent to becoming LA’s most recognizable startup company and largest IPO alongside LA’s other great startup brands such as Riot Games and Tinder. Every LP I speak with these days tells me, “We need to have coverage in Los Angeles — we know that” and it’s no coincidence that we’ve seen the explosion in emerging managers covering the Seed and A-round investment scene in LA. They always ask whether I see this as threatening as Upfront Ventures. “Are you kidding me? Having more great investors is critical to more entrepreneurs staying in LA, which is critical to my long-term success!” And this is true. Snap, Riot Games, Tinder, SpaceX and on and on — these are great things for LA as is every new VC fund launching in LA to create the next big innovation. LA has only just begun. As Mayor Garcetti recently said at the Upfront Summit, “If you can make your product or service succeed in LA, it’s almost like you’re testing it in beta on the entire world in one place” Why is LA so important and relevant? But startup success, technology success, and even immigrant success are not things that we can take for granted. Many cities have been “future phobic” and cracked down on the innovations that have helped reduce drunk driving like ride-sharing platforms or helped increase the inventory of affordable temporary housing like Airbnb. In the coming decade, we will look at American cities to solve technology meets legislation challenges of autonomous vehicles, robotic automation, and artificial intelligence. We will need to address the benefits but also the protection and safety from drones. We will need to understand how to promote augmented reality and holograms while at the same time protecting us from further erosions of trust due to the inability to distinguish real from fake. Innovation is our greatest savior as a city and as a nation, but we need to be sure it is carefully integrated into society in a way that doesn’t undermine our most vulnerable citizens or our basic civic unity. In these trying times I can think of no better leader for our city than Eric Garcetti and no better shining example for our country than the leader of the second most populous city in our country. Mayor Garcetti is up for reelection tomorrow, March 7th 2017. I urge every Angelino to turn out and vote and do your civic duty. This matters even more in city races where just 400,000 citizens turned out to vote in the 2013 mayoral election and 20,000 votes could have switched the mayoral outcome. And whether you live in LA or not, you will gain much from listening to Mayor Garcetti’s 10-minute speech from the Upfront Summit that outlines why this city is worthy of your dollars, your employment, and your time. He truly is a gifted thinker, orator and more importantly doer. ", "title": "The Snap IPO Happened. What Next LA?", "sentences": [{"22ed": "The Snap IPO Happened. What Next LA?"}, {"0572": "Mayor Eric Garcetti at Upfront Summit, February 2017"}, {"5ddc": "I first sat down with then councilman Eric Garcetti on the Ides of March 2012 — almost 5 years ago exactly. He was running to be the 42nd mayor of Los Angeles and he outlined his vision to “open up the city government to technology and innovation” if he were elected. He wanted to bring the same level of technology focus and energy that Mayor Bloomberg had brought to New York City."}, {"47d8": "It’s amazing to see the success of LA under Mayor Garcetti and that’s why I urge you to turn out to reelect him tomorrow — March 7, 2017 - every single vote matters."}, {"06cf": "But this post is about the broader context of LA."}, {"98ad": "It’s hard to remember that in 2012 it was still hard for LA VCs to persuade investors into funds that LA was a viable market for great venture capital funds or convince many VCs that LA was a market worth investing dollars into startups. It’s amazing how much has changed in the past five years, 4 of which have coincided with Mayor Garcetti’s tenure."}, {"c867": "It is fitting that 2012 is the year that Snapchat really took off in Los Angeles and raised its first venture capital and began a five year ascent to becoming LA’s most recognizable startup company and largest IPO alongside LA’s other great startup brands such as Riot Games and Tinder."}, {"d9f3": "Every LP I speak with these days tells me, “We need to have coverage in Los Angeles — we know that” and it’s no coincidence that we’ve seen the explosion in emerging managers covering the Seed and A-round investment scene in LA. They always ask whether I see this as threatening as Upfront Ventures. “Are you kidding me? Having more great investors is critical to more entrepreneurs staying in LA, which is critical to my long-term success!”"}, {"baee": "And this is true. Snap, Riot Games, Tinder, SpaceX and on and on — these are great things for LA as is every new VC fund launching in LA to create the next big innovation."}, {"fef0": "LA has only just begun. As Mayor Garcetti recently said at the Upfront Summit,"}, {"bd92": "“If you can make your product or service succeed in LA, it’s almost like you’re testing it in beta on the entire world in one place”"}, {"1391": "Why is LA so important and relevant?"}, {"02de": "But startup success, technology success, and even immigrant success are not things that we can take for granted. Many cities have been “future phobic” and cracked down on the innovations that have helped reduce drunk driving like ride-sharing platforms or helped increase the inventory of affordable temporary housing like Airbnb. In the coming decade, we will look at American cities to solve technology meets legislation challenges of autonomous vehicles, robotic automation, and artificial intelligence. We will need to address the benefits but also the protection and safety from drones. We will need to understand how to promote augmented reality and holograms while at the same time protecting us from further erosions of trust due to the inability to distinguish real from fake."}, {"7989": "Innovation is our greatest savior as a city and as a nation, but we need to be sure it is carefully integrated into society in a way that doesn’t undermine our most vulnerable citizens or our basic civic unity."}, {"eb52": "In these trying times I can think of no better leader for our city than Eric Garcetti and no better shining example for our country than the leader of the second most populous city in our country. Mayor Garcetti is up for reelection tomorrow, March 7th 2017. I urge every Angelino to turn out and vote and do your civic duty."}, {"e768": "This matters even more in city races where just 400,000 citizens turned out to vote in the 2013 mayoral election and 20,000 votes could have switched the mayoral outcome."}, {"c9f5": "And whether you live in LA or not, you will gain much from listening to Mayor Garcetti’s 10-minute speech from the Upfront Summit that outlines why this city is worthy of your dollars, your employment, and your time. He truly is a gifted thinker, orator and more importantly doer."}], "child": "342_1\t342_2\t342_3\t342_4\t342_5\t342_6"}