{"name": "346", "parent": "", "content": "A fast new way to find people in your city to code with Our open source community now has study groups in almost every major city on earth — 1,800 of them. A map with the locations of some of our study groups With so many study groups, exploring them used to be inconvenient. You had to scroll through a list of posts on our forum. Well today, I’m thrilled to announce a much simpler way to find study groups in your city. Introducing our new study group directory. Here’s what it currently looks like: Our directory will automatically show you the study group that’s closest to you. You can also search by city, state/province, and country. Some major cities have several study groups to choose from: freeCodeCamp South Los Angeles Most freeCodeCamp study groups are organized around Facebook groups. (Facebook groups are free, and since most people have Facebook accounts, they’re easy to join.) We also have groups on MeetUp and WeChat. Each study group is run fully autonomously. They can make their own decisions about where to meet and what to do. Some of them meet in cafes or libraries. Others have made arrangements with local schools, companies, or governments to set up designated venues. freeCodeCamp Coro, Venezuela It takes effort to achieve a consistent turnout at these events. If your city’s group isn’t yet meeting every week, I recommend starting small with coffee-and-code events. It’s all about consistency. freeCodeCamp New York City If you’re interested in taking your city’s study group to the next level, I recommend reading these articles: Free Code Camp’s 1,000+ study groups are now fully autonomousWhen the first local Free Code Camp (FCC) study group popped up, we had no idea that within less than a year, nearly…medium.freecodecamp.com How Free Code Camp keeps me grounded as a recent bootcamp gradThe past year was insane. Yeah, I transitioned from truck driving into a full time junior developer role. But this isn…medium.freecodecamp.com I hosted 40 coding events last year. Here’s what I learned.Here are three links worth your time:medium.freecodecamp.com How we built the study group directory app Our study group directory app is a simple single-page static web app that runs on GitHub Pages. This way, we can easily add new study groups and instantly deploy improvements to the code. William McDonald — a teacher and developer based in San Antonio, Texas — built this app and maintains it. Like everything we do, it’s entirely open source. If you happen to run an organization, and you want a directory like this for all your local chapters, feel free to use this. We welcome your issues and pull requests. 😉 Thanks for reading. I hope you make it out to a study group event this month. Happy coding! ", "title": "A fast new way to find people in your city to code with", "sentences": [{"0096": "A fast new way to find people in your city to code with"}, {"47e1": "Our open source community now has study groups in almost every major city on earth — 1,800 of them."}, {"5fda": "A map with the locations of some of our study groups"}, {"9cf3": "With so many study groups, exploring them used to be inconvenient. You had to scroll through a list of posts on our forum."}, {"c499": "Well today, I’m thrilled to announce a much simpler way to find study groups in your city."}, {"66fd": "Introducing our new study group directory."}, {"6f8b": "Here’s what it currently looks like:"}, {"11d9": "Our directory will automatically show you the study group that’s closest to you. You can also search by city, state/province, and country."}, {"ecad": "Some major cities have several study groups to choose from:"}, {"cdcd": "freeCodeCamp South Los Angeles"}, {"c052": "Most freeCodeCamp study groups are organized around Facebook groups. (Facebook groups are free, and since most people have Facebook accounts, they’re easy to join.) We also have groups on MeetUp and WeChat."}, {"0a25": "Each study group is run fully autonomously. They can make their own decisions about where to meet and what to do. Some of them meet in cafes or libraries. Others have made arrangements with local schools, companies, or governments to set up designated venues."}, {"4a64": "freeCodeCamp Coro, Venezuela"}, {"166a": "It takes effort to achieve a consistent turnout at these events. If your city’s group isn’t yet meeting every week, I recommend starting small with coffee-and-code events. It’s all about consistency."}, {"a965": "freeCodeCamp New York City"}, {"29d3": "If you’re interested in taking your city’s study group to the next level, I recommend reading these articles:"}, {"48ac": "Free Code Camp’s 1,000+ study groups are now fully autonomousWhen the first local Free Code Camp (FCC) study group popped up, we had no idea that within less than a year, nearly…medium.freecodecamp.com"}, {"0f50": "How Free Code Camp keeps me grounded as a recent bootcamp gradThe past year was insane. Yeah, I transitioned from truck driving into a full time junior developer role. But this isn…medium.freecodecamp.com"}, {"e32f": "I hosted 40 coding events last year. Here’s what I learned.Here are three links worth your time:medium.freecodecamp.com"}, {"5bd7": "How we built the study group directory app"}, {"14b3": "Our study group directory app is a simple single-page static web app that runs on GitHub Pages. This way, we can easily add new study groups and instantly deploy improvements to the code."}, {"4622": "William McDonald — a teacher and developer based in San Antonio, Texas — built this app and maintains it."}, {"0438": "Like everything we do, it’s entirely open source."}, {"89c1": "If you happen to run an organization, and you want a directory like this for all your local chapters, feel free to use this."}, {"94d5": "We welcome your issues and pull requests. 😉"}, {"d3f8": "Thanks for reading. I hope you make it out to a study group event this month. Happy coding!"}], "child": "346_1\t346_2\t346_3\t346_4"}