{"name": "347", "parent": "", "content": "If You Knew Something Would Improve Your Life, Why Wouldn’t You? When you’re caught in a self-defeating cycle, it can feel impossible to get out. Quite disturbingly, you begin to believe the suffocation of negativity is “normal.” As Dr. Joe Dispenza has said, “What if just by thinking we make our inner alchemy out of the normal state, the self-regulation system of the body eventually considers this abnormal state to be the normal one?” Put simply, your mind, body, and emotions adapt to your expectations and standards. If you become comfortable in the “abnormal” state of self-defeat and skepticism, your body and brain literally adjust themselves to meet that reality. Your inner-state and outer-state are mirrors, reflecting back and forth at each other. When you see one, you also see the other. As James Allen said in As a Man Thinketh, “Circumstances do not make the man, they reveal him.” Which brings up a very interesting question: If you knew something would improve your life, why wouldn’t you do it? Everyone knows what they should do. It’s intuitive that keeping your body, mind, emotions, and relationships healthy is a good thing. It’s human nature to desire improvement and growth. Yet, on a daily-basis, how often do you impulsively act in ways you know contradict your own happiness? Knowing what to do is easy. Doing what you know, however, is rare. And that, right there, is the dividing line between happiness and misery, failure and success. As Woody Allen explained, “Eighty percent of success is showing up.” It’s really that simple. If you simply show up and do what you intuitively believe you should, success and happiness naturally ensue. If you keep showing up, you can’t help but succeed. Why? Because it’s rare. Most people are in a state of consumption, not creation. Most people are in a state of skepticism and scarcity, not gratitude and abundance. Most people are in a state of passivity, not activity. Getting Out of the Negative Cycle Getting out of a self-sabotaging and negative cycle is surprisingly easy. All it takes is one good decision. Not one good desire or intention. But actually acting on that intention. For example, if you believe you should get up in the morning and exercise. Do it. Follow through. Do it, one time. What will happen? A small spark will ignite within you. What will happen next? Other quality choices will seem easier, like eating a healthy breakfast, being positive toward your loved ones, and focusing while you’re at work. The science is quite clear on “confidence” — it’s the product of previous performance. If, then, you have a good morning, your chances of having a good afternoon are almost guaranteed. If you have a good day, your chances of having a good week are high. It becomes cyclical. Your positive behavior creates confidence (which is nothing more than self-trust), which then increases subsequent performance. You’ll stop worrying about how something feels in the moment and simply act. Consistently. Knowing what you should do isn’t going to improve your life. As Tony Robbins has said, “Knowledge is not power. Knowledge is only potential power. Action is power.” Wisdom and understanding are the product of consistently living what you know. And it’s the difference between happiness and misery, failure and success. So I ask, one more time: If you knew something would improve your life, why wouldn’t you do it? Why choose misery? It is a choice. If you don’t believe misery it’s a choice, you’ve already forfeited your power to someone or something outside of yourself, and thus are enslaved to that thing. Choose happiness. Live what you believe. It’s worth it, for you and for everyone you come in contact with. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "title": "If You Knew Something Would Improve Your Life, Why Wouldn’t You?", "sentences": [{"1782": "If You Knew Something Would Improve Your Life, Why Wouldn’t You?"}, {"b043": "When you’re caught in a self-defeating cycle, it can feel impossible to get out. Quite disturbingly, you begin to believe the suffocation of negativity is “normal.”"}, {"2d1a": "As Dr. Joe Dispenza has said, “What if just by thinking we make our inner alchemy out of the normal state, the self-regulation system of the body eventually considers this abnormal state to be the normal one?” Put simply, your mind, body, and emotions adapt to your expectations and standards. If you become comfortable in the “abnormal” state of self-defeat and skepticism, your body and brain literally adjust themselves to meet that reality."}, {"64c4": "Your inner-state and outer-state are mirrors, reflecting back and forth at each other. When you see one, you also see the other. As James Allen said in As a Man Thinketh, “Circumstances do not make the man, they reveal him.”"}, {"b34c": "Which brings up a very interesting question: If you knew something would improve your life, why wouldn’t you do it?"}, {"b08e": "Everyone knows what they should do. It’s intuitive that keeping your body, mind, emotions, and relationships healthy is a good thing. It’s human nature to desire improvement and growth."}, {"0753": "Yet, on a daily-basis, how often do you impulsively act in ways you know contradict your own happiness?"}, {"7156": "Knowing what to do is easy. Doing what you know, however, is rare. And that, right there, is the dividing line between happiness and misery, failure and success. As Woody Allen explained, “Eighty percent of success is showing up.”"}, {"2e84": "It’s really that simple. If you simply show up and do what you intuitively believe you should, success and happiness naturally ensue."}, {"63a8": "If you keep showing up, you can’t help but succeed. Why? Because it’s rare. Most people are in a state of consumption, not creation. Most people are in a state of skepticism and scarcity, not gratitude and abundance. Most people are in a state of passivity, not activity."}, {"7654": "Getting Out of the Negative Cycle"}, {"cdbd": "Getting out of a self-sabotaging and negative cycle is surprisingly easy."}, {"5fe0": "All it takes is one good decision. Not one good desire or intention. But actually acting on that intention."}, {"8605": "For example, if you believe you should get up in the morning and exercise. Do it."}, {"96c0": "Follow through."}, {"edcc": "Do it, one time."}, {"cc97": "What will happen?"}, {"6df1": "A small spark will ignite within you."}, {"f916": "What will happen next? Other quality choices will seem easier, like eating a healthy breakfast, being positive toward your loved ones, and focusing while you’re at work."}, {"5835": "The science is quite clear on “confidence” — it’s the product of previous performance. If, then, you have a good morning, your chances of having a good afternoon are almost guaranteed. If you have a good day, your chances of having a good week are high."}, {"2e4e": "It becomes cyclical. Your positive behavior creates confidence (which is nothing more than self-trust), which then increases subsequent performance."}, {"8b30": "You’ll stop worrying about how something feels in the moment and simply act. Consistently."}, {"9316": "Knowing what you should do isn’t going to improve your life. As Tony Robbins has said, “Knowledge is not power. Knowledge is only potential power. Action is power.”"}, {"9d56": "Wisdom and understanding are the product of consistently living what you know. And it’s the difference between happiness and misery, failure and success."}, {"86ce": "So I ask, one more time: If you knew something would improve your life, why wouldn’t you do it?"}, {"7bb4": "Why choose misery?"}, {"dd62": "It is a choice."}, {"1b95": "If you don’t believe misery it’s a choice, you’ve already forfeited your power to someone or something outside of yourself, and thus are enslaved to that thing."}, {"3331": "Choose happiness."}, {"61f7": "Live what you believe."}, {"8639": "It’s worth it, for you and for everyone you come in contact with."}, {"68a7": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "child": "347_1\t347_2\t347_3\t347_4\t347_5\t347_6\t347_7\t347_8\t347_9\t347_10\t347_11\t347_12\t347_13\t347_14\t347_15\t347_16\t347_17\t347_18\t347_19\t347_20\t347_21\t347_22\t347_23\t347_24\t347_25"}