{"name": "349", "parent": "", "content": "A Letter To My Grandfather, Whom I’ll Never Forget Just because you don’t remember, doesn’t mean you can’t know Dear Grandpa, My name is Dan. I am your grandson. I’m writing you from a plane on its way to San Francisco, where I live with a woman named Alex, whom you met a couple of days ago, inside the living room of the house you and Grandma now share in Holliston. You don’t remember, but for much of my life, you were my best friend. In your living room, when you asked, that’s what I told you: That my name is Dan, and that we used to be best friends. But it occurs to me now that you never called me Dan. You usually opted for Danny. Or Danny boy. Or — more often — “soldier.” “What do you think, soldier?” you asked me one morning when I was about seven. We were crouched behind a log somewhere in the woods that flanked the house you and Grandma used to live in. My little brother, Scotty — here age five — stood up straight beside us, but still he shared our vantage. Scotty and I grew up in California, but my parents flew us out to visit you and Grandma every year. Whenever we did, any time not spent at Dunkin’ Donuts or at Fenway Park was spent doing this: Trampling around the woods, pretending to kill Nazis. As usual, the smell of cigarette smoke hung on your breath. “How in the hell are we going to infiltrate this line?” “I don’t know,” I said, trying to convey how hard I was thinking. “I don’t know, either,” Scotty said, a second later, trying to do the same. You pushed your big clear glasses a little higher on your nose, shifted in your crouch. It was autumn. The leaves crunching below our feet were the color of old pennies. “Let me think,” you said. Your tone was bristled yet restrained, burdened by the gravity of our situation: The Germans — or so we’d learned from base — were camped out, unsuspecting but dangerous, a mere 50 yards ahead. I motioned to our left. “How about down through the creek.” You followed my finger. Paused. “You wanna approach from the creek?” you said after a moment, turning back to me, your eyes wide with shock. “Danny, we know from base that there are Nazis hiding out all along that waterway.” I considered this. I lifted a finger to my ear. “Wait. I just got word from base that the Germans are actually hiding in the trees to our right. If we approach from the creek, we can sneak up on them.” “I don’t know,” Scotty said again, suspicious this time. You shifted again in your crouch, readjusted your glasses, considered this new intelligence. ~ The Germans were a mere 50 yards ahead ~ “Hold on,” you said, all jaw and determination. “Better get a word from the Captain on this.” You stood up. Opened your hand, flattened your palm. You typed something and then lifted your hand to your ear. Your eyes turned stern and resolute as you waited. A patter of auburn trickled through the branches, speckling your face. “Cap, this is Lieutenant Colonel Hansen, my First Lieutenant here says he has knowledge that the Germans have relocated from the creek to the woods. Is that correct?” You waited, nodded, cursed under your breath. “How in the hell did they know we were comin’?” You waited again. “No, I’d like to know how they got that intel is what I’d like to know, Captain.” You smirked and gave me and Scotty a little wink. So you wouldn’t see me smile, I looked down and tightened the sweatshirt tied around my waist. “Alright, Captain,” you said after a beat. “Over and out.” You slipped your hand back into your pocket. “You were right, Danny. The sons of bitches knew we were comin’.” “Those sons of bitches,” Scotty said. “What should we do?” I asked. You kneeled back down to share my perspective, gathered your thoughts in the trees in the distance. After a second you turned back to me, eyeing me with a new kind of excitement, a spark of anticipation. “See that tree about 20 feet to our left?” I nodded. “Yeah.” “You lead the way. I’ll cover you.” Then you sprang to your feet, shuffle-stepped behind a bush on the left-hand side of the trail, lifted the plastic toy gun in your hand, and whisper-yelled, “Go go go!” I took off. Uninstructed, Scotty immediately did the same, bellowing arrrhhhh with his face flexed in fury and his toy gun raised high the whole way. After the mission, we sat on a log overlooking the creek bed. Silence. The smell of earth. A ribbon of smoke danced skyward from your cigarette. “Good work today, soldier,” you said to me. “Thank God you got that intel.” When your cigarette was finished, we walked home. About nine years later, as you were walking to work, you slipped on some ice and hit your head on the sidewalk. A subsequent trip to the hospital revealed brain damage, and resulted in a diagnosis of vascular dementia, which is irreversible, and for which there is no cure. Over the next few years, your mind would be stolen from you, and as a result you would forget about me, about Scotty, and about all the imaginary worlds we created together in the woods. My Grandpa It’s probably no surprise that, for a long time after you were diagnosed, thinking of you and your illness filled me with sadness, and also a bit of cynicism. I remember one year we came out to visit a few years after you fell. You and I were sitting on the porch of a new, slightly smaller house. We’d been talking baseball, trading platitudes about players you still remembered, like Ted Williams, but inevitably the conversation waned, and eventually we resigned to silence. It was winter, and a white film of snow blanketed the lawn. I remember missing you so badly, right then. I felt as if I were saying goodbye to you, like you were drifting away from me slowly yet unstoppably, a boat untethered from a dock. But I also remember the way your eyes looked, as we sat and you stared into the frozen grass — fragile and tenuous, little pools of light blue. I thought I could see fear in them, in the way they shimmered, wet and pearlescent. I could see the muscles in your jaw — clenching, straining, like gears of a machine at work against some impending menace. It was the first time I’d ever seen you afraid. For so long, I’d imagined you as infallible, as fundamental, impervious somehow to the appetite of time. It was shocking, realizing that you were not — realizing that, no matter what, nature is cruel, and time eats everything. And so for a long time, in addition to sadness, when I thought of you, I thought of this — cruelty, death, inevitability. And I hated it — both that you were being taken from me, as well as the fact that, as your degeneration made so unavoidably clear, the nature of the world we live in is in no way governed by anything as neat or as just or as sensible as karma. I hated it, but I couldn’t help it. Each time I saw you, every time I thought of you, even, I was reminded of what I was losing. At some point, though — maybe once I got to college, or once I started teaching, or after I met Alex — I realized how stupid this was of me, not to mention selfish, succumbing to such solipsistic and self-piteous inclinations. It fills me with guilt, now, thinking about how focused on myself I was. Every time I saw you or spoke with you or even thought of you, after your diagnosis, I should have striven to be brave, and empathetic, and conscious of what aspects of my life and the relationships I keep are actually in my control. Around the same time, I realized that, even though you had been taken from me, the worlds you and I created — the worlds you gave me — those had not been taken. On the contrary, they were still around, and I in fact still had them. Whenever I wanted to, I could pull them out and hold them in my palm, like little blue marbles to be kept in my pocket, the same color as your eyes. I want you to know, Grandpa, just how grateful I am to have those. I want you to know how much I appreciate the fact that, growing up, you treated me like a real person. That you treated me like an equal, like a friend, like someone who mattered, as opposed to just a kid, some kind of subordinate. I want you to know how much I treasured the fact that you considered my contributions to our war games valuable. I will never forget that day you told me: “Thank God you got that intel.” Of course I told you all this last week, when Alex and Grandma and Auntie Rhonda and I were sitting around your coffee table in Holliston, after I introduced you to Alex (and after you told her she was beautiful). I told you again before we left, too, pausing for a second by your chair and looking you once again in your still-pearlescent eyes. I told you just as I should have been telling you all along, every chance I got. I appreciated that opportunity. But now that I’ve left you — now that I’m gone and I don’t know when I’m going to see you again — simply having told you all that doesn’t feel like enough. I want you to know how important of a person you were to me the same way that I know. I want you to know how much I loved being with you. It’s my belief that, just because you don’t remember, doesn’t mean you can’t know. And that’s why I’m writing you now. I want to give you something that’s tangible. That you can hold on to. My hope is that, from time to time, you can pick up this letter and read it with Grandma, and remind yourself that you were — for one boy, at the very least — the most important thing in the world. That you were a source of happiness and pride and confidence and joy, that you were the best grandfather any boy could ever have, and that somewhere, wherever that boy has gone to next, he still loves you, more than he can really describe, and he will not, until the day he dies, forget about you, nor the memories you created for him — memories he keeps in his pocket, everywhere he goes. Thank you again, Grandpa, for everything. Know how loved you are. Always, Your soldier I sent this to my Grandpa earlier today. I posted it here because I thought others who’ve gone through something similar might relate. If this resonated with you, please click the heart so more people can see it. ", "title": "A Letter To My Grandfather, Whom I’ll Never Forget", "sentences": [{"b0d0": "A Letter To My Grandfather, Whom I’ll Never Forget"}, {"3bea": "Just because you don’t remember, doesn’t mean you can’t know"}, {"5b7b": "Dear Grandpa,"}, {"1075": "My name is Dan. I am your grandson. I’m writing you from a plane on its way to San Francisco, where I live with a woman named Alex, whom you met a couple of days ago, inside the living room of the house you and Grandma now share in Holliston. You don’t remember, but for much of my life, you were my best friend."}, {"3c29": "In your living room, when you asked, that’s what I told you: That my name is Dan, and that we used to be best friends. But it occurs to me now that you never called me Dan. You usually opted for Danny. Or Danny boy. Or — more often — “soldier.”"}, {"8152": "“What do you think, soldier?” you asked me one morning when I was about seven. We were crouched behind a log somewhere in the woods that flanked the house you and Grandma used to live in. My little brother, Scotty — here age five — stood up straight beside us, but still he shared our vantage. Scotty and I grew up in California, but my parents flew us out to visit you and Grandma every year. Whenever we did, any time not spent at Dunkin’ Donuts or at Fenway Park was spent doing this: Trampling around the woods, pretending to kill Nazis."}, {"0f55": "As usual, the smell of cigarette smoke hung on your breath."}, {"5d06": "“How in the hell are we going to infiltrate this line?”"}, {"04b8": "“I don’t know,” I said, trying to convey how hard I was thinking."}, {"56fd": "“I don’t know, either,” Scotty said, a second later, trying to do the same."}, {"c8f6": "You pushed your big clear glasses a little higher on your nose, shifted in your crouch. It was autumn. The leaves crunching below our feet were the color of old pennies."}, {"7399": "“Let me think,” you said."}, {"5be6": "Your tone was bristled yet restrained, burdened by the gravity of our situation: The Germans — or so we’d learned from base — were camped out, unsuspecting but dangerous, a mere 50 yards ahead."}, {"48b6": "I motioned to our left."}, {"fe95": "“How about down through the creek.”"}, {"3fbe": "You followed my finger. Paused."}, {"ec65": "“You wanna approach from the creek?” you said after a moment, turning back to me, your eyes wide with shock. “Danny, we know from base that there are Nazis hiding out all along that waterway.”"}, {"312d": "I considered this. I lifted a finger to my ear."}, {"6e38": "“Wait. I just got word from base that the Germans are actually hiding in the trees to our right. If we approach from the creek, we can sneak up on them.”"}, {"378b": "“I don’t know,” Scotty said again, suspicious this time."}, {"314b": "You shifted again in your crouch, readjusted your glasses, considered this new intelligence."}, {"481f": "~ The Germans were a mere 50 yards ahead ~"}, {"b99d": "“Hold on,” you said, all jaw and determination. “Better get a word from the Captain on this.”"}, {"bc12": "You stood up. Opened your hand, flattened your palm. You typed something and then lifted your hand to your ear. Your eyes turned stern and resolute as you waited. A patter of auburn trickled through the branches, speckling your face."}, {"5420": "“Cap, this is Lieutenant Colonel Hansen, my First Lieutenant here says he has knowledge that the Germans have relocated from the creek to the woods. Is that correct?”"}, {"0817": "You waited, nodded, cursed under your breath."}, {"217c": "“How in the hell did they know we were comin’?”"}, {"80fe": "You waited again."}, {"8d8d": "“No, I’d like to know how they got that intel is what I’d like to know, Captain.”"}, {"11dd": "You smirked and gave me and Scotty a little wink. So you wouldn’t see me smile, I looked down and tightened the sweatshirt tied around my waist."}, {"04d4": "“Alright, Captain,” you said after a beat. “Over and out.”"}, {"c4c6": "You slipped your hand back into your pocket."}, {"bb61": "“You were right, Danny. The sons of bitches knew we were comin’.”"}, {"6622": "“Those sons of bitches,” Scotty said."}, {"0a87": "“What should we do?” I asked."}, {"a28c": "You kneeled back down to share my perspective, gathered your thoughts in the trees in the distance. After a second you turned back to me, eyeing me with a new kind of excitement, a spark of anticipation."}, {"7b29": "“See that tree about 20 feet to our left?”"}, {"2502": "I nodded."}, {"1154": "“Yeah.”"}, {"b348": "“You lead the way. I’ll cover you.”"}, {"d32c": "Then you sprang to your feet, shuffle-stepped behind a bush on the left-hand side of the trail, lifted the plastic toy gun in your hand, and whisper-yelled, “Go go go!”"}, {"41db": "I took off. Uninstructed, Scotty immediately did the same, bellowing arrrhhhh with his face flexed in fury and his toy gun raised high the whole way."}, {"479e": "After the mission, we sat on a log overlooking the creek bed. Silence. The smell of earth. A ribbon of smoke danced skyward from your cigarette."}, {"1685": "“Good work today, soldier,” you said to me. “Thank God you got that intel.”"}, {"e9a7": "When your cigarette was finished, we walked home. About nine years later, as you were walking to work, you slipped on some ice and hit your head on the sidewalk. A subsequent trip to the hospital revealed brain damage, and resulted in a diagnosis of vascular dementia, which is irreversible, and for which there is no cure. Over the next few years, your mind would be stolen from you, and as a result you would forget about me, about Scotty, and about all the imaginary worlds we created together in the woods."}, {"6241": "My Grandpa"}, {"866f": "It’s probably no surprise that, for a long time after you were diagnosed, thinking of you and your illness filled me with sadness, and also a bit of cynicism. I remember one year we came out to visit a few years after you fell. You and I were sitting on the porch of a new, slightly smaller house. We’d been talking baseball, trading platitudes about players you still remembered, like Ted Williams, but inevitably the conversation waned, and eventually we resigned to silence. It was winter, and a white film of snow blanketed the lawn. I remember missing you so badly, right then. I felt as if I were saying goodbye to you, like you were drifting away from me slowly yet unstoppably, a boat untethered from a dock. But I also remember the way your eyes looked, as we sat and you stared into the frozen grass — fragile and tenuous, little pools of light blue. I thought I could see fear in them, in the way they shimmered, wet and pearlescent. I could see the muscles in your jaw — clenching, straining, like gears of a machine at work against some impending menace. It was the first time I’d ever seen you afraid. For so long, I’d imagined you as infallible, as fundamental, impervious somehow to the appetite of time. It was shocking, realizing that you were not — realizing that, no matter what, nature is cruel, and time eats everything."}, {"0201": "And so for a long time, in addition to sadness, when I thought of you, I thought of this — cruelty, death, inevitability. And I hated it — both that you were being taken from me, as well as the fact that, as your degeneration made so unavoidably clear, the nature of the world we live in is in no way governed by anything as neat or as just or as sensible as karma. I hated it, but I couldn’t help it. Each time I saw you, every time I thought of you, even, I was reminded of what I was losing."}, {"bf30": "At some point, though — maybe once I got to college, or once I started teaching, or after I met Alex — I realized how stupid this was of me, not to mention selfish, succumbing to such solipsistic and self-piteous inclinations. It fills me with guilt, now, thinking about how focused on myself I was. Every time I saw you or spoke with you or even thought of you, after your diagnosis, I should have striven to be brave, and empathetic, and conscious of what aspects of my life and the relationships I keep are actually in my control."}, {"9eb6": "Around the same time, I realized that, even though you had been taken from me, the worlds you and I created — the worlds you gave me — those had not been taken. On the contrary, they were still around, and I in fact still had them. Whenever I wanted to, I could pull them out and hold them in my palm, like little blue marbles to be kept in my pocket, the same color as your eyes."}, {"0b1f": "I want you to know, Grandpa, just how grateful I am to have those. I want you to know how much I appreciate the fact that, growing up, you treated me like a real person. That you treated me like an equal, like a friend, like someone who mattered, as opposed to just a kid, some kind of subordinate. I want you to know how much I treasured the fact that you considered my contributions to our war games valuable. I will never forget that day you told me: “Thank God you got that intel.”"}, {"6208": "Of course I told you all this last week, when Alex and Grandma and Auntie Rhonda and I were sitting around your coffee table in Holliston, after I introduced you to Alex (and after you told her she was beautiful). I told you again before we left, too, pausing for a second by your chair and looking you once again in your still-pearlescent eyes. I told you just as I should have been telling you all along, every chance I got."}, {"0c1b": "I appreciated that opportunity. But now that I’ve left you — now that I’m gone and I don’t know when I’m going to see you again — simply having told you all that doesn’t feel like enough. I want you to know how important of a person you were to me the same way that I know. I want you to know how much I loved being with you."}, {"6867": "It’s my belief that, just because you don’t remember, doesn’t mean you can’t know."}, {"0ed3": "And that’s why I’m writing you now. I want to give you something that’s tangible. That you can hold on to. My hope is that, from time to time, you can pick up this letter and read it with Grandma, and remind yourself that you were — for one boy, at the very least — the most important thing in the world. That you were a source of happiness and pride and confidence and joy, that you were the best grandfather any boy could ever have, and that somewhere, wherever that boy has gone to next, he still loves you, more than he can really describe, and he will not, until the day he dies, forget about you, nor the memories you created for him — memories he keeps in his pocket, everywhere he goes."}, {"c39e": "Thank you again, Grandpa, for everything. Know how loved you are."}, {"1235": "Always,"}, {"bea6": "Your soldier"}, {"fec6": "I sent this to my Grandpa earlier today. I posted it here because I thought others who’ve gone through something similar might relate. If this resonated with you, please click the heart so more people can see it."}], "child": "349_1\t349_2\t349_3\t349_4\t349_5\t349_6\t349_7\t349_8\t349_9\t349_10\t349_11\t349_12\t349_13\t349_14\t349_15\t349_16\t349_17\t349_18\t349_19\t349_20\t349_21\t349_22\t349_23\t349_24\t349_25349_1\t349_2\t349_3\t349_4\t349_5\t349_6\t349_7\t349_8\t349_9\t349_10\t349_11\t349_12\t349_13\t349_14\t349_15\t349_16\t349_17\t349_18\t349_19\t349_20\t349_21\t349_22\t349_23\t349_24\t349_25"}