{"content": "Dwyane Wade Is Done for the Season, and So Are the Bulls Bad news for Wade is good news for the Bucks, Pistons, and Heat This thing nobody thought would work really, really didn’t work. And now it’s over. After Dwyane Wade collided with Zach Randolph in a Wednesday-night game against Memphis, the Chicago Bulls announced Thursday that the guard has a fracture in his elbow and will miss the remainder of the season, pushing this Bulls campaign from 4 to 6 feet deep. “It sucks,” Wade said Thursday morning. “It’s not the way I would’ve written it. But it is what it is.” Wade’s Chicago homecoming always felt a little awkward — a few years too late to really energize the franchise — and the smart money would suggest that the final chapters of his career will be written somewhere else. Chicago began the season with, in Rajon Rondo’s words, “three alphas,” and that trio of Wade, Rondo, and Jimmy Butler could never sing in harmony, much less read from coach Fred Hoiberg’s sheet music. The season has been marred by Rondo meltdowns; public feuding among factions of players; the trading of Taj Gibson, the team’s heart and soul; the heavily rumored exit of franchise player Butler, and some of the most unwatchable basketball in recent memory. Chicago was one game out of the Eastern Conference playoff hunt, but was trending downward, going 3–7 in its last 10. While this news is sad for Wade, Bulls fans, anyone who likes long-range 2s, and reports of players-only meetings, it’s a boost for the conference’s playoff wannabes in Milwaukee, Miami, and Detroit. This will be an offseason of change for the Bulls. It has to be. Butler will no doubt be part of trade rumors again (whenever you’re ready, Danny), and there could even be institutional change with coaching or in the front office. This biggest question is what happens to Flash. Wade has a player option for the next season and is due to make a very healthy $23.8 million. You could see him opt in and continue to make up some of the money he lost while sacrificing pay for title contention in Miami. But after the misery of this season, and the likely coming rebuild, he hit the market as a rich man’s David West, shoring a team who could use his playmaking, scoring, and big-game credentials. His 18.6 points per game this season was his lowest since his rookie year, but is nothing to sneeze at, and could definitely be improved upon in a better situation. I hear Cleveland is lovely this time of year. ", "child": "35_1\t35_2\t35_3\t35_4\t35_5\t35_6\t35_7", "title": "Dwyane Wade Is Done for the Season, and So Are the Bulls", "parent": "", "sentences": [{"9810": "Dwyane Wade Is Done for the Season, and So Are the Bulls"}, {"18d4": "Bad news for Wade is good news for the Bucks, Pistons, and Heat"}, {"3872": "This thing nobody thought would work really, really didn’t work. And now it’s over. After Dwyane Wade collided with Zach Randolph in a Wednesday-night game against Memphis, the Chicago Bulls announced Thursday that the guard has a fracture in his elbow and will miss the remainder of the season, pushing this Bulls campaign from 4 to 6 feet deep. “It sucks,” Wade said Thursday morning. “It’s not the way I would’ve written it. But it is what it is.”"}, {"627f": "Wade’s Chicago homecoming always felt a little awkward — a few years too late to really energize the franchise — and the smart money would suggest that the final chapters of his career will be written somewhere else. Chicago began the season with, in Rajon Rondo’s words, “three alphas,” and that trio of Wade, Rondo, and Jimmy Butler could never sing in harmony, much less read from coach Fred Hoiberg’s sheet music. The season has been marred by Rondo meltdowns; public feuding among factions of players; the trading of Taj Gibson, the team’s heart and soul; the heavily rumored exit of franchise player Butler, and some of the most unwatchable basketball in recent memory."}, {"d503": "Chicago was one game out of the Eastern Conference playoff hunt, but was trending downward, going 3–7 in its last 10. While this news is sad for Wade, Bulls fans, anyone who likes long-range 2s, and reports of players-only meetings, it’s a boost for the conference’s playoff wannabes in Milwaukee, Miami, and Detroit."}, {"9792": "This will be an offseason of change for the Bulls. It has to be. Butler will no doubt be part of trade rumors again (whenever you’re ready, Danny), and there could even be institutional change with coaching or in the front office. This biggest question is what happens to Flash."}, {"8e24": "Wade has a player option for the next season and is due to make a very healthy $23.8 million. You could see him opt in and continue to make up some of the money he lost while sacrificing pay for title contention in Miami. But after the misery of this season, and the likely coming rebuild, he hit the market as a rich man’s David West, shoring a team who could use his playmaking, scoring, and big-game credentials. His 18.6 points per game this season was his lowest since his rookie year, but is nothing to sneeze at, and could definitely be improved upon in a better situation."}, {"e7c7": "I hear Cleveland is lovely this time of year."}], "name": "35"}