{"name": "350", "parent": "", "content": "What I Told My Daughter When She Asked Why I Lost My Job: on Cheating, Mental Illness, and How Much to Tell the Kids “Did you lose your job for the same reason Mom divorced you?”  It is Sunday afternoon, we are in the car, coming back from a birthday party. As so often with my first born, Heloise has wrestled with a question for days before asking it. In recent months, she has been assembling in her mind the story of her parents’ breakup. She’s also been piecing together a timeline for how the world of her early childhood — a world of nannies, new cars, a huge house with a yard –became a world of a small apartment with bars on the windows.  Two weeks ago, she asked why we’d left that first big house. “Daddy lost his job, bunny.” She nodded. Based on experience, I knew the follow-ups were coming soon. My ex and I agreed long ago never to lie to the kids, and to give them honest answers when they ask. With each passing month, the task gets more challenging. As almost everyone reading this probably knows, I lost my college teaching job after confessing to sleeping with my students. I lost my marriage for essentially the same reason; my ex left me after finding about my many affairs. My daughter found out about my affairs last year, when kids in her school (ours is a close-knit community) told her the truth. When Heloise came home confused, her mother and I explained, separately, what “cheating” was and how it could end a marriage.   Heloise was seven when we told her this. I wasn’t ready. Judging by the equanimity with which she received the news, she was. So when she asks this question on Sunday, there’s no need to stall. I smile slightly at her in the rear-view mirror. “Yes, baby. I lost my job for more or less the same reason your mom and I got divorced.” “So you were a teacher, and you cheated, and they made you leave your job?”  “Yes.” I hesitate. I know exactly what the follow-up is that’s coming. “Why would they care? Was cheating against the rules for teachers?” Heloise is always willing to ask harder questions when her little brother isn’t around. David has a playdate, and we’ll pick him up later. I breathe very calmly. “It wasn’t just that I was cheating. I was cheating with students in my classes. These students were grown-ups, but it was still against the rules.” “How old were they?”  Tempting to lie. Best not to. “They were in their teens and twenties.” Heloise is silent for a moment. One last question for the car ride. “Did you cheat because you were sick?”  Heloise has seen me hospitalized more than once. She knows I take medication, and knows the word “bipolar.” Every summer at the beach or pool, when my shirt comes off, she sees the scars from all my self-injuring behavior. And my God, how tempting it is to blame everything on my mental illness! I’d love to be able to say, “Yes, sweetheart, abba cheated and did those bad things because he was sick. It wasn’t his fault!”  I won’t lie to her. I am bipolar af, as they say these days, with a personality disorder to go with it, but I wasn’t manic when I went back to sleeping with my students. The truth is, time and again, calm and sober and clear-headed, I chose the rush of a new connection over my obligations and my promises. I chose and chose and chose and chose. The disease explains a lot about why I reacted so destructively when caught; it does not explain why I screwed up in the first place.   So I may be the most indiscreet father south of the Tehachapis, but I’ll be damned if I’ll be the most dishonest one. “No, baby, I didn’t cheat because I was sick. I’m afraid I just made some serious mistakes.”  I almost say “I’m sorry,” but I don’t want her to come back with her reflexive “It’s okay.” The hardest part of being a mentally ill parent is making sure that you never put your kids in the position to have to soothe you. On my fragile days, that’s tougher than it should be. Heloise looks out the window. I get a flash of her as a teen in therapy, calling me up on the phone to tell me she hates my guts. I get a flash of her as a teen a year later, hugging me and telling me she doesn’t hate me anymore. I know the arc of adolescent reckoning with parental narratives better than many; I spent decades teaching students how to write their way through the process.  I think of something Danielle, my therapist, always says. “It doesn’t matter what you did before. All your kids will care about in the end is that you fought for them and did everything you could to stay in their lives.” I know she’s right, but I wonder quite what she means by “the end.” When Heloise and David are grown? When I’m dead?  “I’m hungry,” Heloise says as I pull up outside the apartment. “Do we have mac and cheese? The orange kind, not the white?” “We do,” I say. “Come help me make it.” We bolt from the car. In the Kabbalah Centre, where my kids are being raised, they teach that children pick their parents. Before it’s born, a preborn soul selects the exact environment it will need in order to experience the spiritual growth it needs. This is, of course, immensely comforting to parents; how can you truly fail your kids when their little souls already “knew” everything you’d do? I don’t believe in a lot of woo, and I don’t believe in this, but it’s the most tempting tenet of the faith that I know. I’ve already longed to throw a “Hey, you chose me!” at the kids when they’re upset. I would never dare, but still.  Heloise and David probably didn’t choose me, but here they are with me regardless. Here they are with this man as loving as he is embarrassing, as flawed as he is devoted, as incapable of being quiet as he is of quitting caffeine. So no, I didn’t want my daughter to find out this early that her father lost his job and threw away his marriage to their mother because he was unfaithful. But the lies that would have been required to prevent her from finding out would have done far more damage in the long run. I’m gambling that if I’m willing to tell her hard truths about my private life now, she’ll be willing to do the same when she’s older and going through a difficult time. Candor is an investment.  We make the mac and cheese together, and eat it. I make it her way, with the cheese powder only partly stirred in, so it clumps together into savory golden nuggets. “Do you have any more questions?” I ask as we eat.  Heloise nods. “Can I have three Oreos instead of two after dinner?”  “I suppose. Is that your only question?”  My daughter shrugs happily. “For now, abba. That’s enough for now.” ", "title": "What I Told My Daughter When She Asked Why I Lost My Job: on Cheating, Mental Illness, and How Much to Tell the Kids", "sentences": [{"f909": "What I Told My Daughter When She Asked Why I Lost My Job: on Cheating, Mental Illness, and How Much to Tell the Kids"}, {"de5d": "“Did you lose your job for the same reason Mom divorced you?”  It is Sunday afternoon, we are in the car, coming back from a birthday party. As so often with my first born, Heloise has wrestled with a question for days before asking it. In recent months, she has been assembling in her mind the story of her parents’ breakup. She’s also been piecing together a timeline for how the world of her early childhood — a world of nannies, new cars, a huge house with a yard –became a world of a small apartment with bars on the windows.  Two weeks ago, she asked why we’d left that first big house. “Daddy lost his job, bunny.” She nodded."}, {"ed10": "Based on experience, I knew the follow-ups were coming soon. My ex and I agreed long ago never to lie to the kids, and to give them honest answers when they ask. With each passing month, the task gets more challenging."}, {"4200": "As almost everyone reading this probably knows, I lost my college teaching job after confessing to sleeping with my students. I lost my marriage for essentially the same reason; my ex left me after finding about my many affairs. My daughter found out about my affairs last year, when kids in her school (ours is a close-knit community) told her the truth. When Heloise came home confused, her mother and I explained, separately, what “cheating” was and how it could end a marriage.   Heloise was seven when we told her this. I wasn’t ready. Judging by the equanimity with which she received the news, she was."}, {"3b3f": "So when she asks this question on Sunday, there’s no need to stall. I smile slightly at her in the rear-view mirror. “Yes, baby. I lost my job for more or less the same reason your mom and I got divorced.”"}, {"c4c7": "“So you were a teacher, and you cheated, and they made you leave your job?”  “Yes.” I hesitate. I know exactly what the follow-up is that’s coming."}, {"6f2a": "“Why would they care? Was cheating against the rules for teachers?”"}, {"abeb": "Heloise is always willing to ask harder questions when her little brother isn’t around. David has a playdate, and we’ll pick him up later."}, {"c8da": "I breathe very calmly. “It wasn’t just that I was cheating. I was cheating with students in my classes. These students were grown-ups, but it was still against the rules.”"}, {"82c6": "“How old were they?”  Tempting to lie. Best not to. “They were in their teens and twenties.”"}, {"581b": "Heloise is silent for a moment. One last question for the car ride. “Did you cheat because you were sick?”  Heloise has seen me hospitalized more than once. She knows I take medication, and knows the word “bipolar.” Every summer at the beach or pool, when my shirt comes off, she sees the scars from all my self-injuring behavior. And my God, how tempting it is to blame everything on my mental illness! I’d love to be able to say, “Yes, sweetheart, abba cheated and did those bad things because he was sick. It wasn’t his fault!”  I won’t lie to her. I am bipolar af, as they say these days, with a personality disorder to go with it, but I wasn’t manic when I went back to sleeping with my students. The truth is, time and again, calm and sober and clear-headed, I chose the rush of a new connection over my obligations and my promises. I chose and chose and chose and chose. The disease explains a lot about why I reacted so destructively when caught; it does not explain why I screwed up in the first place.   So I may be the most indiscreet father south of the Tehachapis, but I’ll be damned if I’ll be the most dishonest one. “No, baby, I didn’t cheat because I was sick. I’m afraid I just made some serious mistakes.”  I almost say “I’m sorry,” but I don’t want her to come back with her reflexive “It’s okay.” The hardest part of being a mentally ill parent is making sure that you never put your kids in the position to have to soothe you. On my fragile days, that’s tougher than it should be."}, {"dde8": "Heloise looks out the window. I get a flash of her as a teen in therapy, calling me up on the phone to tell me she hates my guts. I get a flash of her as a teen a year later, hugging me and telling me she doesn’t hate me anymore. I know the arc of adolescent reckoning with parental narratives better than many; I spent decades teaching students how to write their way through the process.  I think of something Danielle, my therapist, always says. “It doesn’t matter what you did before. All your kids will care about in the end is that you fought for them and did everything you could to stay in their lives.” I know she’s right, but I wonder quite what she means by “the end.” When Heloise and David are grown? When I’m dead?  “I’m hungry,” Heloise says as I pull up outside the apartment. “Do we have mac and cheese? The orange kind, not the white?”"}, {"1385": "“We do,” I say. “Come help me make it.” We bolt from the car."}, {"c187": "In the Kabbalah Centre, where my kids are being raised, they teach that children pick their parents. Before it’s born, a preborn soul selects the exact environment it will need in order to experience the spiritual growth it needs. This is, of course, immensely comforting to parents; how can you truly fail your kids when their little souls already “knew” everything you’d do? I don’t believe in a lot of woo, and I don’t believe in this, but it’s the most tempting tenet of the faith that I know. I’ve already longed to throw a “Hey, you chose me!” at the kids when they’re upset. I would never dare, but still.  Heloise and David probably didn’t choose me, but here they are with me regardless. Here they are with this man as loving as he is embarrassing, as flawed as he is devoted, as incapable of being quiet as he is of quitting caffeine."}, {"216f": "So no, I didn’t want my daughter to find out this early that her father lost his job and threw away his marriage to their mother because he was unfaithful. But the lies that would have been required to prevent her from finding out would have done far more damage in the long run."}, {"d059": "I’m gambling that if I’m willing to tell her hard truths about my private life now, she’ll be willing to do the same when she’s older and going through a difficult time. Candor is an investment.  We make the mac and cheese together, and eat it. I make it her way, with the cheese powder only partly stirred in, so it clumps together into savory golden nuggets. “Do you have any more questions?” I ask as we eat.  Heloise nods. “Can I have three Oreos instead of two after dinner?”  “I suppose. Is that your only question?”  My daughter shrugs happily. “For now, abba. That’s enough for now.”"}], "child": "350_1\t350_2\t350_3\t350_4\t350_5\t350_6\t350_7\t350_8"}