{"name": "352", "parent": "", "content": "The Heart Of The Matter Sometimes all we need is another human being to be a compassionate witness to our wounds without judgement. I was in upstate New York for a retreat, a spiritual workshop. “Get in, lady,” the cab driver said to me. He had a rather unpleasant tone. After I told him my destination, he resumed ranting about his life with the other passenger, who commiserated with him the entire way. “My life sucks,” I heard him say. “Nobody would believe how bad it sucks, and now I drive cabs for a living.” He glanced in the rear view mirror and zeroed in on me. “What’s your story, lady?” I had been looking out the window at the beautiful scenery. “I don’t have a story,” I said. “I’m just here to enjoy the retreat.” He dropped us off at the retreat office and sped off without a “Thank you” or “Have a good day.” That evening, the same cab driver was waiting to pick me up. I slid into the back seat, energized from the day. Almost immediately, he said, “I’ve had a crappy day. I’ve had to carry all these workshop people back and forth. And you know what? They aren’t the nicest people. What phonies!” When I didn’t take the bait, he eyed me again through the rear view mirror. “Where are you from?” he prodded, determined to have a conversation. “North Carolina,” I replied and waited for whatever blast was to come. His eyes lit up instead. “I was in the military, the Marines, and I was stationed in NC. I love that area.” It was the first time I had heard anything positive come from his mouth. He was quiet for a moment and then ventured further. “Life hands you a lot of crap. Being in the Marines, being on the ground, made me see how life really is. People are shitty. Nobody cares.” I looked at this young guy; he couldn’t have been out of his 20’s. His face was already weathered, and his heart was already hard. “Don’t you think so, too?” he asked. Now he was earnestly studying me, waiting on an answer. “You know,” I said, “I don’t feel the same way. I feel we all have hearts; some are open, and some are closed. I can always see the highest good in anyone — human or animal. I can always see their beauty inside.” We rode the rest of the way in silence. The next day my cab driver friend showed up. He leaned over to the front passenger side, opened the door, and said, “Get in front, please. I’ve got other passengers to pick up.” Great, I thought. Lucky me! A photo of a child who was maybe 2 or 3 hung from his rearview mirror. “Is that your son?” I asked. “Yeah,” he replied. “He’s mine. Don’t get to see him much. Don’t get to see him at all. Restraining order.” “I’m sorry,” I answered softly. “I bet you miss him.” We rode for awhile in silence. “I’ve lived here all my life, and I’ve got two dogs,” he offered. Then, as if he couldn’t not tell me, he blurted out, “I like to cook and create recipes, too. I watch Rachel Ray all the time.” I had to smile. The door to his heart had cracked open. When he dropped me off, he said, “Don’t think I’m this nice to everyone. I kick people out of my cab every day.” “That’s okay,” I said before I closed the door. “Even if you kicked me out on the curb, I would still see your kind heart.” The look on his face was priceless. On the last day, he took me to the train station. When we arrived, he unloaded my bags and told me to wait by the cab. I heard him go inside and talk to the train depot attendant. “Hey, Bill. Take good care of my friend.” He didn’t know I had heard it. When he came back out, I handed him the money for the ride. Shaking his head no, he pushed the money aside and said, “The ride’s on me.” Then, all of the sudden, he gave me a quick hug. “You’d better go; your train is about here.” He had a huge smile on his face. Of all the things I’ll remember about that retreat, it will be James, the cab driver with an attitude, who stands out the most. The most spiritual part of the weekend was my experience with him. He may have been on the ground in the military, but we all are on the ground in our everyday lives, battling it out with life. Daily combat can harden us and close our hearts. Sometimes all we need is another human being to be a compassionate witness to our wounds without judgement. What reveals itself is a heart that can hold it all. I write more stories like this one every few weeks. If you’re interested, you can receive them by email when I publish them by signing up here. ", "title": "The Heart Of The Matter", "sentences": [{"b54c": "The Heart Of The Matter"}, {"91bd": "Sometimes all we need is another human being to be a compassionate witness to our wounds without judgement."}, {"60df": "I was in upstate New York for a retreat, a spiritual workshop."}, {"e579": "“Get in, lady,” the cab driver said to me. He had a rather unpleasant tone. After I told him my destination, he resumed ranting about his life with the other passenger, who commiserated with him the entire way."}, {"8090": "“My life sucks,” I heard him say. “Nobody would believe how bad it sucks, and now I drive cabs for a living.”"}, {"287e": "He glanced in the rear view mirror and zeroed in on me."}, {"4f0c": "“What’s your story, lady?” I had been looking out the window at the beautiful scenery."}, {"0bc6": "“I don’t have a story,” I said. “I’m just here to enjoy the retreat.”"}, {"4a0f": "He dropped us off at the retreat office and sped off without a “Thank you” or “Have a good day.” That evening, the same cab driver was waiting to pick me up. I slid into the back seat, energized from the day."}, {"7f70": "Almost immediately, he said, “I’ve had a crappy day. I’ve had to carry all these workshop people back and forth. And you know what? They aren’t the nicest people. What phonies!”"}, {"30d0": "When I didn’t take the bait, he eyed me again through the rear view mirror."}, {"ebba": "“Where are you from?” he prodded, determined to have a conversation."}, {"ec32": "“North Carolina,” I replied and waited for whatever blast was to come."}, {"5c68": "His eyes lit up instead."}, {"38a4": "“I was in the military, the Marines, and I was stationed in NC. I love that area.”"}, {"f46a": "It was the first time I had heard anything positive come from his mouth. He was quiet for a moment and then ventured further."}, {"ffcd": "“Life hands you a lot of crap. Being in the Marines, being on the ground, made me see how life really is. People are shitty. Nobody cares.”"}, {"d5ff": "I looked at this young guy; he couldn’t have been out of his 20’s. His face was already weathered, and his heart was already hard."}, {"e743": "“Don’t you think so, too?” he asked."}, {"ba14": "Now he was earnestly studying me, waiting on an answer."}, {"577b": "“You know,” I said, “I don’t feel the same way. I feel we all have hearts; some are open, and some are closed. I can always see the highest good in anyone — human or animal. I can always see their beauty inside.”"}, {"16e9": "We rode the rest of the way in silence."}, {"247c": "The next day my cab driver friend showed up. He leaned over to the front passenger side, opened the door, and said, “Get in front, please. I’ve got other passengers to pick up.”"}, {"96bc": "Great, I thought. Lucky me!"}, {"a879": "A photo of a child who was maybe 2 or 3 hung from his rearview mirror."}, {"69a0": "“Is that your son?” I asked."}, {"944f": "“Yeah,” he replied. “He’s mine. Don’t get to see him much. Don’t get to see him at all. Restraining order.”"}, {"6bfc": "“I’m sorry,” I answered softly. “I bet you miss him.”"}, {"c3b0": "We rode for awhile in silence."}, {"9bdd": "“I’ve lived here all my life, and I’ve got two dogs,” he offered. Then, as if he couldn’t not tell me, he blurted out, “I like to cook and create recipes, too. I watch Rachel Ray all the time.”"}, {"3576": "I had to smile. The door to his heart had cracked open."}, {"e8ba": "When he dropped me off, he said, “Don’t think I’m this nice to everyone. I kick people out of my cab every day.”"}, {"49f8": "“That’s okay,” I said before I closed the door. “Even if you kicked me out on the curb, I would still see your kind heart.”"}, {"17a2": "The look on his face was priceless."}, {"1aa5": "On the last day, he took me to the train station. When we arrived, he unloaded my bags and told me to wait by the cab. I heard him go inside and talk to the train depot attendant."}, {"5ca4": "“Hey, Bill. Take good care of my friend.”"}, {"341f": "He didn’t know I had heard it. When he came back out, I handed him the money for the ride."}, {"d86d": "Shaking his head no, he pushed the money aside and said, “The ride’s on me.”"}, {"adde": "Then, all of the sudden, he gave me a quick hug."}, {"0396": "“You’d better go; your train is about here.” He had a huge smile on his face."}, {"2f34": "Of all the things I’ll remember about that retreat, it will be James, the cab driver with an attitude, who stands out the most. The most spiritual part of the weekend was my experience with him. He may have been on the ground in the military, but we all are on the ground in our everyday lives, battling it out with life. Daily combat can harden us and close our hearts. Sometimes all we need is another human being to be a compassionate witness to our wounds without judgement. What reveals itself is a heart that can hold it all."}, {"f4e5": "I write more stories like this one every few weeks. If you’re interested, you can receive them by email when I publish them by signing up here."}], "child": "352_1\t352_2"}