{"name": "353", "parent": "", "content": "Submit Your Name to Write — The Unending Tales For those who wish to contribute to one of our books (The Afterworld Saga is the only one right now), simply comment below if you are interested in writing a chapter. Once you comment below, you will be given a chapter number and a due date/deadline. Our story is coming along great so far, thanks to the efforts of Abby O. Akoto and Joshua Valdivia. It is honestly an extremely entertaining experiment at this point and we’re excited to see where it goes. If you’ve been tagged in this post, it is because I either believe you are interested (from past comments) in contributing or I believe that you have the ability to help make the story as special as possible. If The Afterworld Saga isn’t your style and you’d like to contribute by submitting your own short story, don’t hesitate to submit. We’re always looking for more plots to learn from and develop further. For The Afterworld Saga Be sure to read the chapters leading up to the one you are assigned, starting with Chapter 1, all of which can be found here: The Afterworld Saga — 1Chapter One: And Death Rejected Hermedium.com The Afterworld Saga — 2Chapter Two: Along King’s Waymedium.com The Afterworld Saga — 3Chapter Three: Nobody’s Foolmedium.com The Afterworld Saga — 4Chapter Four: Her Storymedium.com Those who I think would contribute to this awesome saga are: Abby O. Akoto, Anneliese Fox, C.R. Misty, Cory Mogk, Erika Sauter, Parabolical, Michael Kennedy, Mary Alice Long, PhD, Kristofer Mac Cormaic, Yola Kema, Emily Smith, S Lynn Knight, your name here, Charlie Homerding, Jessie Pocock, Leo Charles M., Jamie Howard, Wes Allen, Lincoln Michel, and Mike Essig. If you haven’t been tagged, don’t feel that you are excluded from participating. Please comment below if you want in. (UPDATE: Chapters 5–11 have been assigned) ", "title": "Submit Your Name to Write — The Unending Tales", "sentences": [{"fad2": "Submit Your Name to Write — The Unending Tales"}, {"2051": "For those who wish to contribute to one of our books (The Afterworld Saga is the only one right now), simply comment below if you are interested in writing a chapter. Once you comment below, you will be given a chapter number and a due date/deadline."}, {"d251": "Our story is coming along great so far, thanks to the efforts of Abby O. Akoto and Joshua Valdivia. It is honestly an extremely entertaining experiment at this point and we’re excited to see where it goes."}, {"2769": "If you’ve been tagged in this post, it is because I either believe you are interested (from past comments) in contributing or I believe that you have the ability to help make the story as special as possible."}, {"20d6": "If The Afterworld Saga isn’t your style and you’d like to contribute by submitting your own short story, don’t hesitate to submit. We’re always looking for more plots to learn from and develop further."}, {"bec8": "For The Afterworld Saga"}, {"f4e5": "Be sure to read the chapters leading up to the one you are assigned, starting with Chapter 1, all of which can be found here:"}, {"7d8f": "The Afterworld Saga — 1Chapter One: And Death Rejected Hermedium.com"}, {"1e8c": "The Afterworld Saga — 2Chapter Two: Along King’s Waymedium.com"}, {"4647": "The Afterworld Saga — 3Chapter Three: Nobody’s Foolmedium.com"}, {"a0b3": "The Afterworld Saga — 4Chapter Four: Her Storymedium.com"}, {"39bf": "Those who I think would contribute to this awesome saga are:"}, {"0734": "Abby O. Akoto, Anneliese Fox, C.R. Misty, Cory Mogk, Erika Sauter, Parabolical, Michael Kennedy, Mary Alice Long, PhD, Kristofer Mac Cormaic, Yola Kema, Emily Smith, S Lynn Knight, your name here, Charlie Homerding, Jessie Pocock, Leo Charles M., Jamie Howard, Wes Allen, Lincoln Michel, and Mike Essig."}, {"f9e7": "If you haven’t been tagged, don’t feel that you are excluded from participating. Please comment below if you want in."}, {"1a0d": "(UPDATE: Chapters 5–11 have been assigned)"}], "child": "353_1\t353_2\t353_3\t353_4\t353_5\t353_6\t353_7\t353_8\t353_9\t353_10\t353_11\t353_12\t353_13\t353_14\t353_15\t353_16\t353_17\t353_18\t353_19\t353_20\t353_21\t353_22\t353_23"}