{"name": "355", "parent": "", "content": "The Afterworld Saga — 4 Chapter Four: Her Story Tamra gulped, her throat bobbing beneath the knife’s edge. She blocked out Leida’s panic when memories of her martial training came flooding back. Through keen eyes, she assessed the threat to her life and saw an opening to disarm Roy. “I said who are you?” he barked. “And where’s my sister?” She raised both hands slowly, as if in surrender. If she didn’t execute her move carefully, she’d die again; and this time, she’d be dragging Leida along with her. Her muscles tensed as she prepared to counter-attack. “Don’t!” Leida’s voice pierced through the haze. “He thinks I’m in danger. Just tell him the truth.” Tamra hesitated; then she relaxed. “As you wish, but pray he doesn’t slit our throat before I get the chance.” She drew a deep breath. “You’re right. I’m not Leida, but if you kill me, you’d be killing her too.” Roy glared at her a minute longer before he removed the knife and backed away. “Talk.” She sat up and rubbed the front part of her neck where she could still feel the blade’s imprint. “Where’s my sister?” he demanded. “She’s…” Tamra faltered. She’d been about to say Leida was inside her but she thought it had a salacious ring Roy wouldn’t find the least bit amusing. “She’s with me,” she said instead, pressing a palm to her chest. “In here.” “What in the gods’ name are you talking about?” He stepped forward, the knife pointed at her. With a good distance now between them, she could easily wrest it away from him. But he didn’t need to know that. She needed him to think he was fully in control. She held up a hand. “Listen, my name is Tamra. I’m the dead girl you saw on King’s Way.” He didn’t say a word. He just stared at her. “Believe me, I know how absurd it sounds but it’s the truth.” He crossed his arms and stared harder. “You’re holding a knife to me. If I was going to lie, wouldn’t I have concocted something a little more believable?” He uncrossed his arms. “Very well,” he sat on the stool in front of the dressing table, “let’s assume for a fleeting moment that I believe this nonsense. How did it happen?” “I don’t know.” He sneered. “All I know is that when I jumped from the tower, I died but somehow I ended up in your sister’s body,” she said. “With her.” He squinted at her, no doubt trying to determine if she was telling the truth. “How did you come to be in the castle in the first place?” She bit her lower lip. “I was captured by The Shadows.” Leida gasped. A tic moved in Roy’s jaw at the mention of the notorious order of assassins who’d taken their name from one of the feared demon classes in the Afterworld. “And what would The Shadows want with you? Why did they capture you?” Tamra desperately wanted to lie. She wanted to say they’d planned to use her to collect a king’s ransom from her father. Or that they’d bought her at a slave market in Galene. But she couldn’t. “Because I killed our leader.” Leida gasped again. Roy’s grip tightened around the knife’s hilt. “You were one of them.” “Yes.” In the quiet that followed, she sensed Leida’s terror and urge to get as far away from her as possible. For some reason, Tamra couldn’t bear for them to see her as a cold-blooded murderess. “I was born in Elpis.” Roy stirred when she spoke. “I was the daughter of the wealthiest silk merchant in the city.” She smiled from nostalgia. “Life was wonderful. Perfect, even.” The smile vanished. “And then one night, a man garbed in black crept into our home and slaughtered my entire family.” Both Leida and Roy were completely silent. “He killed my mother first.” Her voice trembled. “Then my father, and my younger brother and sister. He was going to kill me too, but I managed to escape. I wandered the streets and eventually ended up in the fighting pits where I learned to be strong.” “When I later discovered he was the Shadow Caliph, leader of The Shadows, I plotted my revenge and infiltrated their organization. It took a long time but I finally got the opportunity to make him pay for what he did. I tried to find out who contracted him but he refused to tell me.” “I fled after killing him but they found me and took me to the Shadow Keep, that’s what they call the abandoned castle on King’s Way. It’s their secret lair here in Damaris.” Roy cursed. “They were waiting for Nasim, brother and successor of the Shadow Caliph, to arrive. They would have tortured me before killing me and I refused to grant them that satisfaction.” Her features hardened. “Vengeance was mine alone. And so I jumped to my death, but by some quirk of fate or jest of the gods, I was still alive. In someone else’s body.” “And Leida?” Roy asked. “How is she taking all of this?” “She was terrified at first. But when she realized I was more disoriented than she was, she felt calmer,” Tamra said. “We intended to consult with the oracle of Themis to — ” “We?” he said. Then he shook his head, a pained expression on his face. “She asked you to keep it from me, didn’t she?” Guilt overcame Leida. “She didn’t want to worry you.” Tamra tried to defend her. “She wanted to wait till — ” “I want to speak to her.” “I don’t know how to give her control.” He snorted. “How convenient.” “Believe me — ” “Believe you?” he scoffed. “An assassin?” She lowered her head. “While your motives are understandable, the fact remains that you took lives to earn a place among The Shadows. So how do I know my sister isn’t one of your victims?” “Ask me something,” Tamra said. “Something only Leida would know.” His eyes narrowed. “We have a shared telepathy. She’ll tell me the answer and I’ll relay it.” “Describe the time of her birth to me.” Leida told Tamra what to say. “She was born on the night of a full moon in Baukis. Your mother often boasted that she laughed through Leida’s birth because it was so easy. Unlike yours.” His mouth fell open. “Your father’s pet name for her was moon-cub.” “She really is in there,” Roy whispered, his eyes shining. He sheathed the knife and tucked it into his left boot. “All right, this is what will happen. I’ll go with you to the oracle tomorrow.” He got up. “I believe you, but that doesn’t mean I trust you so I’ll stand sentry all night to make sure you don’t try to flee.” He turned when he reached the door. “And given your penchant for jumping through windows, I’ll have someone on watch outside too.” After he left, Tamra lay back down. “Your brother is ferocious.” “Only where I’m concerned,” Leida said. “Tamra, I’m very sorry about your family.” “You’re not the only one who suffered an unspeakable family tragedy.” “Except in my case, my mother was the villain.” “What?” “She went berserk one day and murdered our father and some of the townsfolk. She would have killed us too had the guards not arrived and struck her down. We were shunned by the town and forced to carry the shame of her atrocity.” “That’s why you went to the cliffs.” “Yes, and after my epiphany, I packed up our things and we moved here.” Tamra wanted to ask more questions, but she felt it was a sore point for Leida. At first light, they went to the Temple of Themis. Although they were early, they still met a queue waiting to see the oracle. When one of the acolytes saw them, he ushered them into the temple, ignoring the queue’s grumbles. The oracle stood at the altar, her back to them. “My, my,” she spoke without turning, “it’s been a while since I encountered a Vessel.” Tamra and Roy glanced at each other, and back at the oracle. Together with Leida, they asked in unison, “What’s a Vessel?” ", "title": "The Afterworld Saga — 4", "sentences": [{"270a": "The Afterworld Saga — 4"}, {"e863": "Chapter Four: Her Story"}, {"eb62": "Tamra gulped, her throat bobbing beneath the knife’s edge. She blocked out Leida’s panic when memories of her martial training came flooding back. Through keen eyes, she assessed the threat to her life and saw an opening to disarm Roy."}, {"af48": "“I said who are you?” he barked. “And where’s my sister?”"}, {"51be": "She raised both hands slowly, as if in surrender. If she didn’t execute her move carefully, she’d die again; and this time, she’d be dragging Leida along with her."}, {"fb7e": "Her muscles tensed as she prepared to counter-attack."}, {"9120": "“Don’t!” Leida’s voice pierced through the haze. “He thinks I’m in danger. Just tell him the truth.”"}, {"f5cb": "Tamra hesitated; then she relaxed. “As you wish, but pray he doesn’t slit our throat before I get the chance.”"}, {"c772": "She drew a deep breath. “You’re right. I’m not Leida, but if you kill me, you’d be killing her too.”"}, {"148b": "Roy glared at her a minute longer before he removed the knife and backed away. “Talk.”"}, {"e9d4": "She sat up and rubbed the front part of her neck where she could still feel the blade’s imprint."}, {"5c98": "“Where’s my sister?” he demanded."}, {"a605": "“She’s…” Tamra faltered. She’d been about to say Leida was inside her but she thought it had a salacious ring Roy wouldn’t find the least bit amusing."}, {"2ea8": "“She’s with me,” she said instead, pressing a palm to her chest. “In here.”"}, {"0fb6": "“What in the gods’ name are you talking about?” He stepped forward, the knife pointed at her."}, {"a326": "With a good distance now between them, she could easily wrest it away from him. But he didn’t need to know that. She needed him to think he was fully in control."}, {"2ff3": "She held up a hand. “Listen, my name is Tamra. I’m the dead girl you saw on King’s Way.”"}, {"d03d": "He didn’t say a word. He just stared at her."}, {"f0b4": "“Believe me, I know how absurd it sounds but it’s the truth.”"}, {"0268": "He crossed his arms and stared harder."}, {"bfe9": "“You’re holding a knife to me. If I was going to lie, wouldn’t I have concocted something a little more believable?”"}, {"bcec": "He uncrossed his arms. “Very well,” he sat on the stool in front of the dressing table, “let’s assume for a fleeting moment that I believe this nonsense. How did it happen?”"}, {"7d80": "“I don’t know.”"}, {"d3db": "He sneered."}, {"6f55": "“All I know is that when I jumped from the tower, I died but somehow I ended up in your sister’s body,” she said. “With her.”"}, {"7a17": "He squinted at her, no doubt trying to determine if she was telling the truth. “How did you come to be in the castle in the first place?”"}, {"2e53": "She bit her lower lip. “I was captured by The Shadows.”"}, {"a1b1": "Leida gasped."}, {"e715": "A tic moved in Roy’s jaw at the mention of the notorious order of assassins who’d taken their name from one of the feared demon classes in the Afterworld."}, {"cd58": "“And what would The Shadows want with you? Why did they capture you?”"}, {"d174": "Tamra desperately wanted to lie. She wanted to say they’d planned to use her to collect a king’s ransom from her father. Or that they’d bought her at a slave market in Galene."}, {"5523": "But she couldn’t."}, {"63ea": "“Because I killed our leader.”"}, {"b185": "Leida gasped again."}, {"2ef3": "Roy’s grip tightened around the knife’s hilt. “You were one of them.”"}, {"a00e": "“Yes.”"}, {"af54": "In the quiet that followed, she sensed Leida’s terror and urge to get as far away from her as possible. For some reason, Tamra couldn’t bear for them to see her as a cold-blooded murderess."}, {"85f9": "“I was born in Elpis.”"}, {"7311": "Roy stirred when she spoke."}, {"283d": "“I was the daughter of the wealthiest silk merchant in the city.” She smiled from nostalgia. “Life was wonderful. Perfect, even.”"}, {"c979": "The smile vanished. “And then one night, a man garbed in black crept into our home and slaughtered my entire family.”"}, {"a814": "Both Leida and Roy were completely silent."}, {"d763": "“He killed my mother first.” Her voice trembled. “Then my father, and my younger brother and sister. He was going to kill me too, but I managed to escape. I wandered the streets and eventually ended up in the fighting pits where I learned to be strong.”"}, {"cd28": "“When I later discovered he was the Shadow Caliph, leader of The Shadows, I plotted my revenge and infiltrated their organization. It took a long time but I finally got the opportunity to make him pay for what he did. I tried to find out who contracted him but he refused to tell me.”"}, {"f09a": "“I fled after killing him but they found me and took me to the Shadow Keep, that’s what they call the abandoned castle on King’s Way. It’s their secret lair here in Damaris.”"}, {"f91a": "Roy cursed."}, {"20ed": "“They were waiting for Nasim, brother and successor of the Shadow Caliph, to arrive. They would have tortured me before killing me and I refused to grant them that satisfaction.” Her features hardened. “Vengeance was mine alone. And so I jumped to my death, but by some quirk of fate or jest of the gods, I was still alive. In someone else’s body.”"}, {"058f": "“And Leida?” Roy asked. “How is she taking all of this?”"}, {"e50f": "“She was terrified at first. But when she realized I was more disoriented than she was, she felt calmer,” Tamra said. “We intended to consult with the oracle of Themis to — ”"}, {"aca6": "“We?” he said. Then he shook his head, a pained expression on his face. “She asked you to keep it from me, didn’t she?”"}, {"0790": "Guilt overcame Leida."}, {"d3b3": "“She didn’t want to worry you.” Tamra tried to defend her. “She wanted to wait till — ”"}, {"dc33": "“I want to speak to her.”"}, {"586f": "“I don’t know how to give her control.”"}, {"63da": "He snorted. “How convenient.”"}, {"2b1c": "“Believe me — ”"}, {"5739": "“Believe you?” he scoffed. “An assassin?”"}, {"f8ea": "She lowered her head."}, {"d60f": "“While your motives are understandable, the fact remains that you took lives to earn a place among The Shadows. So how do I know my sister isn’t one of your victims?”"}, {"2f4a": "“Ask me something,” Tamra said. “Something only Leida would know.”"}, {"dc56": "His eyes narrowed."}, {"0106": "“We have a shared telepathy. She’ll tell me the answer and I’ll relay it.”"}, {"0bec": "“Describe the time of her birth to me.”"}, {"66d0": "Leida told Tamra what to say."}, {"52ad": "“She was born on the night of a full moon in Baukis. Your mother often boasted that she laughed through Leida’s birth because it was so easy. Unlike yours.”"}, {"4e9c": "His mouth fell open."}, {"c446": "“Your father’s pet name for her was moon-cub.”"}, {"e4b1": "“She really is in there,” Roy whispered, his eyes shining."}, {"abc7": "He sheathed the knife and tucked it into his left boot. “All right, this is what will happen. I’ll go with you to the oracle tomorrow.” He got up. “I believe you, but that doesn’t mean I trust you so I’ll stand sentry all night to make sure you don’t try to flee.”"}, {"c72e": "He turned when he reached the door. “And given your penchant for jumping through windows, I’ll have someone on watch outside too.”"}, {"d626": "After he left, Tamra lay back down. “Your brother is ferocious.”"}, {"924d": "“Only where I’m concerned,” Leida said. “Tamra, I’m very sorry about your family.”"}, {"c932": "“You’re not the only one who suffered an unspeakable family tragedy.”"}, {"ffce": "“Except in my case, my mother was the villain.”"}, {"b558": "“What?”"}, {"6d8b": "“She went berserk one day and murdered our father and some of the townsfolk. She would have killed us too had the guards not arrived and struck her down. We were shunned by the town and forced to carry the shame of her atrocity.”"}, {"b116": "“That’s why you went to the cliffs.”"}, {"7e80": "“Yes, and after my epiphany, I packed up our things and we moved here.”"}, {"e0da": "Tamra wanted to ask more questions, but she felt it was a sore point for Leida."}, {"fdf4": "At first light, they went to the Temple of Themis. Although they were early, they still met a queue waiting to see the oracle. When one of the acolytes saw them, he ushered them into the temple, ignoring the queue’s grumbles."}, {"2884": "The oracle stood at the altar, her back to them. “My, my,” she spoke without turning, “it’s been a while since I encountered a Vessel.”"}, {"1f85": "Tamra and Roy glanced at each other, and back at the oracle. Together with Leida, they asked in unison, “What’s a Vessel?”"}], "child": "355_1\t355_2\t355_3"}