{"content": "The Phantom Blockbuster Paul George and Jimmy Butler were in the middle of trade rumors, but general managers chose to wait for the summer market to develop rather than pounce midseason The NBA trade deadline was a dud, but not making a trade isn’t the same thing as doing nothing. Inaction could turn out to be beneficial for most organizations: Some teams acquired players for cheap, while the benefits of standing pat may manifest down the line for others. Patience was the winner of the 2017 deadline. Paul George was wrapped up in trade rumors involving the Lakers, Celtics, and Nuggets, and he didn’t seem happy when talking to reporters Thursday afternoon. “I kind of was on the ropes just like you guys were on what was about to happen. It was kind of a dark moment of uncertainty,” George said. “That was the frustrating part. You want me to be your guy here, I thought I would’ve been in the loop a little more on that.” George has said publicly he’s committed to the Pacers, but like a politician, he has his private position, too. The Pacers star forward is “hell-bent on heading to Laker Land,” USA Today’s Sam Amick reported Thursday, which my sources indicate, as well; there’s little doubt that George will opt out of his contract at the end of the 2017–18 season. Pacers president of basketball operations Larry Bird will have to address this decision eventually. That time is coming, but George’s value has not yet reached its peak. And besides, the Pacers need to give this a few months to see if there’s any chance of retaining their superstar. One Eastern Conference executive who didn’t expect a deadline deal for George told The Ringer early Thursday that there was “no pressure” on the Pacers to trade their two-way dynamo — at least until he doesn’t make an All-NBA team this season. The Pacers are hoping they can convince George to stay with a significant extension and by improving the roster. Under the new collective bargaining agreement, players who make one of the All-NBA teams in the previous season (or two of the previous three) are eligible to sign designated-player extensions; this mega-extension would add five years to George’s current deal, bringing its value to six years and over $200 million, whereas other teams could offer only four years and roughly $125 million on the free-agent market. That type of money could be hard to pass on. But that extension might not be an option because George is unlikely to be named to an All-NBA team due to the wealth of forwards having significantly better seasons. The Pacers could still offer a wealthier contract than other teams, but the difference isn’t as significant. Despite that likelihood, despite the Nuggets reportedly making a “monster” offer for George on Thursday, despite George being a free-agent flight risk, Bird opted to wait. Bird is institutionally safe and had little reason to rush into a deal. Money isn’t the primary factor in retaining George. Building a winning roster is. The Pacers can realistically create max cap space. Gordon Hayward could have an Indiana homecoming, or adding second-tier players like Otto Porter or Kentavious Caldwell-Pope could increase the chances George extends or renegotiates and extends his contract like Russell Westbrook did for the Thunder. This isn’t a DeMarcus Cousins situation for the Pacers — they won’t entertain lowball offers. Nor is it a Jimmy Butler scenario where there’s a fundamental disagreement within the front office on the direction of the team. Even if George is unhappy and goes as far as to demand a trade, teams will line up for a chance at his services. Understanding the NBA Trade Deadline Leverage GameIf they wait too long to trade a star, teams can find themselves making pennies on the dollartheringer.com And that line could get longer after the lottery. Sports Illustrated’s Jake Fischer reported Tuesday that the Lakers withheld rookie Brandon Ingram from any Cousins offer; Los Angeles presently doesn’t have enough to get a deal done for George, but if the Lakers retain their top-three protected lottery pick, they could conceivably package the pick with Ingram and other pieces to make a run at him. Think about the Kevin Love blockbuster: No one would’ve expected the Cavaliers to be an option for Love at the 2014 deadline, but they won the draft lottery, LeBron James came home, and the Timberwolves got Andrew Wiggins in return. The Sixers could always end the Process if they receive the Lakers’ first by packaging it with their own pick plus other assets to make a run at George. Though George is drawn to the Lakers, two separate front-office sources indicated to me prior to the deadline that he isn’t opposed to committing elsewhere if it’s the right situation that gives him a title chance. The only way a George deal would’ve made sense now is if the Pacers were overwhelmed by an offer that couldn’t have been refused — the type of deal they’d like to receive this summer. But it didn’t come, and you can’t blame other teams for waiting, either. As Celtics president of basketball operations Danny Ainge told reporters Thursday, “We’re trying to upgrade our team, but it is a delicate balance of short-term goals and long-term goals.” The lottery will bring a lot of clarity, and at that point, negotiations for stars like George and Butler can escalate. Here are some other thoughts from a quiet deadline day … LeBron Will Get His Playmaker Even if Boston had added Butler, the Celtics would have still been a level below the Cavaliers. While the Raptors made low-mid-level additions like Serge Ibaka and P.J. Tucker to bolster their team, the Celtics would’ve had to mortgage the future for an All-Star. The Cavaliers also got better by simply not doing anything. LeBron Needs Playmaking Help Now to Help Prepare for the Postseason to ComeThe grind is getting to the Kingtheringer.com “We’re a top-heavy team. We have a top-heavy team. We top-heavy as shit,” LeBron James said one month ago. “For the most part, all championship-contending teams has got guys that are ready to step in. Knock on wood, what if [Kyrie Irving] goes down? For two weeks. Let’s say two. What if I went down for three weeks?” The Cavaliers listened to King James’s cry for a playmaker and brought in the following for a workout: LeBron’s former teammate Mario Chalmers; LeBron’s least favorite opponent, Lance Stephenson; 36-year-old former Bulls legend Kirk Hinrich; and two-time NBA champion Jordan Farmar. USA Today’s Sam Amick also reported that Mavericks guard Deron Williams was a trade target. Cavaliers general manager David Griffin could’ve buckled under LeBron’s demands, but instead waited. Now that the deadline has passed, the Mavericks are working on a buyout with Williams, and all indications are that he’ll sign with the Cavaliers. Williams’s decline has been steep, but he’s still a reliable point guard. All the Cavs need on offense from Williams is playmaking and spot-up shooting. Williams makes pinpoint passes and leads the NBA with 1.3 points created per possession in pick-and-roll passes, per Synergy. Though his scoring has declined, he’s completely capable of running an offense and occasionally making spectacular plays. Williams is a knockdown shooter off the catch; since 2013, he’s shot 41.2 percent on catch-and-shoot 3s, per SportVU. LeBron and Kyrie will have the ball in their hands the majority of the time, so it’s crucial that Williams serves a role as a complementary floor spacer. Deron is the new Delly. Last year, Matthew Dellavedova played 24.6 minutes per game during the regular season, then saw his minutes drop in each successive round of the playoffs, going from 18.1 in the first round to 7.6 in the Finals. The Cavaliers should now be the beneficiaries of Williams’s experience and reliability as they chase another title. The Sixers and the Other Side of Patience The Sixers Have a Big Problem, but They’ll Wait It OutThe organization is optimistic on media day, even as some players openly express concernstheringer.com The patient loser of the deadline is Sixers general manager Bryan Colangelo, who underestimated the probability he’d lose leverage. Colangelo was unable to find a trade partner for Jahlil Okafor and traded Nerlens Noel to Dallas for a subpar return. Justin Anderson is nice (he has Jae Crowder 2.0 potential), but Noel is talented enough to warrant at least a first-round pick without top-18 protection. The Sixers probably weren’t re-signing Noel, but if they knew that prior to the season, it’s hard to understand why they waited till Thursday to move him. Colangelo, you played yourself. Bogut Could Help a Playoff Team The Sixers also acquired Andrew Bogut, who will be bought out, according to multiple reports. Bogut is 32, injury prone, and a pizzagate truther, but he’s also massive, an elite rebounder, a gorgeous passer, and a devastating screener. A team in need of rim protection is about to win big; the Spurs, Celtics, and Rockets are all reportedly interested and could’ve offered picks in the late-20s-to-mid-40s range, but instead will bank on the chance of signing him without surrendering an asset. The Cavaliers also reportedly have interest, and according to The Vertical’s Bobby Marks, a loophole in the collective bargaining agreement could allow Bogut to sign with the Warriors depending on the NBA’s interpretation of the rule. No matter where he winds up, a contending team is about to land an impactful center without giving up a valuable asset. For most top teams, patience could prove to be a virtue — as long as patience doesn’t turn into inaction when the summer approaches. ", "child": "36_1\t36_2\t36_3\t36_4\t36_5\t36_6\t36_7\t36_8", "title": "The Phantom Blockbuster", "parent": "", "sentences": [{"b7c4": "The Phantom Blockbuster"}, {"8911": "Paul George and Jimmy Butler were in the middle of trade rumors, but general managers chose to wait for the summer market to develop rather than pounce midseason"}, {"ab1c": "The NBA trade deadline was a dud, but not making a trade isn’t the same thing as doing nothing. Inaction could turn out to be beneficial for most organizations: Some teams acquired players for cheap, while the benefits of standing pat may manifest down the line for others. Patience was the winner of the 2017 deadline."}, {"d0ae": "Paul George was wrapped up in trade rumors involving the Lakers, Celtics, and Nuggets, and he didn’t seem happy when talking to reporters Thursday afternoon. “I kind of was on the ropes just like you guys were on what was about to happen. It was kind of a dark moment of uncertainty,” George said. “That was the frustrating part. You want me to be your guy here, I thought I would’ve been in the loop a little more on that.” George has said publicly he’s committed to the Pacers, but like a politician, he has his private position, too. The Pacers star forward is “hell-bent on heading to Laker Land,” USA Today’s Sam Amick reported Thursday, which my sources indicate, as well; there’s little doubt that George will opt out of his contract at the end of the 2017–18 season."}, {"e61a": "Pacers president of basketball operations Larry Bird will have to address this decision eventually. That time is coming, but George’s value has not yet reached its peak. And besides, the Pacers need to give this a few months to see if there’s any chance of retaining their superstar."}, {"6737": "One Eastern Conference executive who didn’t expect a deadline deal for George told The Ringer early Thursday that there was “no pressure” on the Pacers to trade their two-way dynamo — at least until he doesn’t make an All-NBA team this season. The Pacers are hoping they can convince George to stay with a significant extension and by improving the roster. Under the new collective bargaining agreement, players who make one of the All-NBA teams in the previous season (or two of the previous three) are eligible to sign designated-player extensions; this mega-extension would add five years to George’s current deal, bringing its value to six years and over $200 million, whereas other teams could offer only four years and roughly $125 million on the free-agent market. That type of money could be hard to pass on. But that extension might not be an option because George is unlikely to be named to an All-NBA team due to the wealth of forwards having significantly better seasons. The Pacers could still offer a wealthier contract than other teams, but the difference isn’t as significant."}, {"124a": "Despite that likelihood, despite the Nuggets reportedly making a “monster” offer for George on Thursday, despite George being a free-agent flight risk, Bird opted to wait. Bird is institutionally safe and had little reason to rush into a deal. Money isn’t the primary factor in retaining George. Building a winning roster is. The Pacers can realistically create max cap space. Gordon Hayward could have an Indiana homecoming, or adding second-tier players like Otto Porter or Kentavious Caldwell-Pope could increase the chances George extends or renegotiates and extends his contract like Russell Westbrook did for the Thunder."}, {"9a1c": "This isn’t a DeMarcus Cousins situation for the Pacers — they won’t entertain lowball offers. Nor is it a Jimmy Butler scenario where there’s a fundamental disagreement within the front office on the direction of the team. Even if George is unhappy and goes as far as to demand a trade, teams will line up for a chance at his services."}, {"3b21": "Understanding the NBA Trade Deadline Leverage GameIf they wait too long to trade a star, teams can find themselves making pennies on the dollartheringer.com"}, {"4774": "And that line could get longer after the lottery. Sports Illustrated’s Jake Fischer reported Tuesday that the Lakers withheld rookie Brandon Ingram from any Cousins offer; Los Angeles presently doesn’t have enough to get a deal done for George, but if the Lakers retain their top-three protected lottery pick, they could conceivably package the pick with Ingram and other pieces to make a run at him."}, {"9ac7": "Think about the Kevin Love blockbuster: No one would’ve expected the Cavaliers to be an option for Love at the 2014 deadline, but they won the draft lottery, LeBron James came home, and the Timberwolves got Andrew Wiggins in return. The Sixers could always end the Process if they receive the Lakers’ first by packaging it with their own pick plus other assets to make a run at George. Though George is drawn to the Lakers, two separate front-office sources indicated to me prior to the deadline that he isn’t opposed to committing elsewhere if it’s the right situation that gives him a title chance."}, {"91e6": "The only way a George deal would’ve made sense now is if the Pacers were overwhelmed by an offer that couldn’t have been refused — the type of deal they’d like to receive this summer. But it didn’t come, and you can’t blame other teams for waiting, either."}, {"beca": "As Celtics president of basketball operations Danny Ainge told reporters Thursday, “We’re trying to upgrade our team, but it is a delicate balance of short-term goals and long-term goals.” The lottery will bring a lot of clarity, and at that point, negotiations for stars like George and Butler can escalate."}, {"2219": "Here are some other thoughts from a quiet deadline day …"}, {"9dca": "LeBron Will Get His Playmaker"}, {"0ccb": "Even if Boston had added Butler, the Celtics would have still been a level below the Cavaliers. While the Raptors made low-mid-level additions like Serge Ibaka and P.J. Tucker to bolster their team, the Celtics would’ve had to mortgage the future for an All-Star. The Cavaliers also got better by simply not doing anything."}, {"5202": "LeBron Needs Playmaking Help Now to Help Prepare for the Postseason to ComeThe grind is getting to the Kingtheringer.com"}, {"56fa": "“We’re a top-heavy team. We have a top-heavy team. We top-heavy as shit,” LeBron James said one month ago. “For the most part, all championship-contending teams has got guys that are ready to step in. Knock on wood, what if [Kyrie Irving] goes down? For two weeks. Let’s say two. What if I went down for three weeks?” The Cavaliers listened to King James’s cry for a playmaker and brought in the following for a workout: LeBron’s former teammate Mario Chalmers; LeBron’s least favorite opponent, Lance Stephenson; 36-year-old former Bulls legend Kirk Hinrich; and two-time NBA champion Jordan Farmar. USA Today’s Sam Amick also reported that Mavericks guard Deron Williams was a trade target."}, {"68a2": "Cavaliers general manager David Griffin could’ve buckled under LeBron’s demands, but instead waited. Now that the deadline has passed, the Mavericks are working on a buyout with Williams, and all indications are that he’ll sign with the Cavaliers. Williams’s decline has been steep, but he’s still a reliable point guard. All the Cavs need on offense from Williams is playmaking and spot-up shooting."}, {"af82": "Williams makes pinpoint passes and leads the NBA with 1.3 points created per possession in pick-and-roll passes, per Synergy. Though his scoring has declined, he’s completely capable of running an offense and occasionally making spectacular plays. Williams is a knockdown shooter off the catch; since 2013, he’s shot 41.2 percent on catch-and-shoot 3s, per SportVU. LeBron and Kyrie will have the ball in their hands the majority of the time, so it’s crucial that Williams serves a role as a complementary floor spacer."}, {"2e80": "Deron is the new Delly. Last year, Matthew Dellavedova played 24.6 minutes per game during the regular season, then saw his minutes drop in each successive round of the playoffs, going from 18.1 in the first round to 7.6 in the Finals. The Cavaliers should now be the beneficiaries of Williams’s experience and reliability as they chase another title."}, {"2b59": "The Sixers and the Other Side of Patience"}, {"a5dc": "The Sixers Have a Big Problem, but They’ll Wait It OutThe organization is optimistic on media day, even as some players openly express concernstheringer.com"}, {"d6bb": "The patient loser of the deadline is Sixers general manager Bryan Colangelo, who underestimated the probability he’d lose leverage. Colangelo was unable to find a trade partner for Jahlil Okafor and traded Nerlens Noel to Dallas for a subpar return. Justin Anderson is nice (he has Jae Crowder 2.0 potential), but Noel is talented enough to warrant at least a first-round pick without top-18 protection. The Sixers probably weren’t re-signing Noel, but if they knew that prior to the season, it’s hard to understand why they waited till Thursday to move him."}, {"8e69": "Colangelo, you played yourself."}, {"e88a": "Bogut Could Help a Playoff Team"}, {"4183": "The Sixers also acquired Andrew Bogut, who will be bought out, according to multiple reports. Bogut is 32, injury prone, and a pizzagate truther, but he’s also massive, an elite rebounder, a gorgeous passer, and a devastating screener. A team in need of rim protection is about to win big; the Spurs, Celtics, and Rockets are all reportedly interested and could’ve offered picks in the late-20s-to-mid-40s range, but instead will bank on the chance of signing him without surrendering an asset. The Cavaliers also reportedly have interest, and according to The Vertical’s Bobby Marks, a loophole in the collective bargaining agreement could allow Bogut to sign with the Warriors depending on the NBA’s interpretation of the rule. No matter where he winds up, a contending team is about to land an impactful center without giving up a valuable asset."}, {"b118": "For most top teams, patience could prove to be a virtue — as long as patience doesn’t turn into inaction when the summer approaches."}], "name": "36"}