{"name": "360", "parent": "", "content": "Excalibur, vedi alla voce “esagerare” Storia e analisi di un film che contribuì a rilanciare il genere fantasy Da ragazzino ero un secchione (ma va?) e amavo due cose in particolare: la mitologia greca e il ciclo arturiano. La prima mi era rimasta attaccata leggendo un libro per bambini chiamato “Storie della storia del mondo”, il secondo era merito di “La spada nella roccia” della Disney. Una volta approdato in quella fase dell’adolescenza in cui ripudi tutto ciò che è infantile perché devi dimostrare che sei cresciuto, non so come mai entrai in contatto con Excalibur, un film uscito nell’anno in cui ero nato e che sulla copertina della VHS mostrava una spettacolare immagine di un tizio che ti guardava serissimo e una spada, non male. Excalibur è un favoloso polpettone di due ore e mezza che condensa tutte le avventure di Artù, dal concepimento ad opera di quello che probabilmente è il padre col nome più figo della storia, Uther Pendragon, alla morte per mano del figlio Mordred. Nel mezzo c’è tutta la storia di un mondo che passa lentamente dal paganesimo al cristianesimo e abbandona il suo lato più selvaggio e magico, rappresentato da Merlino, in favore di una scintillante nuova religione alla quale verrà chiesto il conto da Morgana. Tra i meriti del film ricordiamo l’aver ufficialmente sdoganato i Carmina Burana come musica solenne e tenebrosa con cui girare scene d’azione e l’aver dato ad attori sconosciuti o noti solo in patria un palcoscenico internazionale come Liam Neeson, qua praticamente al debutto insieme a Gabriel Byrne, Hellen Mirren e Patrick Stewart. Boorman voleva che il pubblico si concentrasse sulla storia, non sugli attori. Excalibur fu anche il suo ritorno in sella, perché dopo Un tranquillo weekend di Paura aveva inanellato la combo Zardoz+L’esorcista II che non furono propriamente dei successi al botteghino. Per uno spettatore cresciuto a peplum, scontri epici e battaglie campali ma tendenzialmente ordinate, la visione di Excalibur era una sorta di rivelazione, un po’ come assaggiare una bistecca dopo anni di cotolette, come vedere la Battaglia di Anghiari prendere vita di fronte ai tuoi occhi. Scontri bui, pieni di fango, urla, Wagner e sangue, con gente che si muove lenta e impacciata in armature enormi (con cui tra l’altro riesce miracolosamente a fare sesso senza uccidere la compagna) e urla più per la fatica che per il dolore. Tutto è buio, scuro, fumoso e violento. Gli uomini sono fondamentalmente cavernicoli in armatura mossi solo dai propri istinti verso donne che o li subiscono o li manipolano. Nella sua follia visionaria, Excalibur rimane comunque molto più simile al vero medioevo di quanto possa raccontarti un libro di storia. In contrasto con tutto questo realismo Boorman schierava un uso esagerato di riflessi e luccichii che in certi momenti trasformano il film in una televendita di argenteria. Le armature scintillano, i gioielli delle donne scintillano, la famigerata capoccia di Merlino scintilla, i denti scintillano, le mura del castello scintillano, persino la natura manda bagliori verdi. E poi c’è l’armatura finale di Mordred che è un capolavoro del camp e lo trasforma in una specie di David di Michelangelo dorato e vendicativo (estetica ripresa ne Il Gladiatore), o l’affascinante litania della Magia del Fare recitata da Merlino in una specie di inglese arcaico: Analnathrakt Udvas Bethod Dokiel Dien-ve. In italiano vuol dire più o meno “Per il respiro del drago, per la magia della vita e della morte, io ti ordino di fare” e sappiate che è stata anche utilizzata da Undertaker per alcune sue entrate in scena. Nella versione italiana il doppiaggio con un registro solenne rende tutte le interpretazioni uniformi e azzeccate, ma in lingua originale Excalibur diventa uno spettacolare campionario di overacting assurdo ed enfatico. Basta ascoltare gli spezzoni di questo articolo per essere investiti da un treno di gente che sembra uscita da Boris. La Mirren sembra sul palco alla recita del liceo, la maggior parte dei cavalieri parla come se fossero usciti ora da un corso di recitazione per posta, si salvano in corner Neeson, Stewart e Nigel Terry nei panni di Arthur, ma a volte anche loro strappano un sorriso. Su tutti svetta Nicol Williamson, ovvero Merlino, che gigioneggia passando dal falsetto alla declamazione teatrale, alternando ritmi, toni, timbri e accenti e conferendo al personaggio un’anima mutevole, sfuggente e misteriosa, un po’ mago potentissimo, un po’ giullare di un altro mondo che si diverte nel contemplare le stranezze degli umani. Se il film porta a casa il risultato è merito anche suo. Come molte produzioni gigantesche e sperimentali, d’altronde Boorman è lo stesso che ritenne necessario vestire Sean Connery come un viados in Zardoz, Excalibur non ebbe assolutamente vita facile, per colpa del cast e perché si rivelò costoso come giocare all’autoscontro con le Ferrari. I produttori della United Artists odiavano Williamson perché si erano trovati male in passato, ma Boorman si impuntò perché lo riteneva talentuoso. Williamson odiava la Mirren perché si era trovato male in passato, ma Boorman si impuntò perché i loro dissapori potevano essere funzionali sullo schermo per la rivalità tra Merlino e Morgana. Non mancarono neppure problemi sul set, che per tutti i mesi di riprese fu funestato da una continua e incessante pioggia. Il che fu perfetto per le battaglie campali e il finale lugubre, ma era un po’ meno bello tutto il resto del tempo, soprattutto quando devi tenere pulite e scintillanti centinaia di armature o girare una scena all’aperto in cui non dovrebbe piovere. A proposito di battaglie campali, quella iniziale dovettero ripeterla TRE volte, perché la luce era sbagliata. Potete immaginare da soli il costo dell’operazione. Nonostante alcune performance e l’essere fondamentalmente un polpettone proto-fantasy abbastanza lungo, Excalibur spicca e resiste nel nostro immaginario grazie al talento visionario di Boorman in grado di trasmettere sensazioni terribilmente grezze, tetre e terrene, ma anche divine ed eroiche. Il fascino di un Merlino, più vicino come aspetto a un negromante che a un maghetto Disney, allucinazioni, magie, armature in penombra con forme animalesche (ben prima del Mastino di Game of Thrones), il Graal che scintilla come una visione paradisiaca, corvi che beccano occhi e infine l’uso di Wagner non è casuale, ma legato alla grandiosità eccessiva del Crepuscolo degli dei e del Ragnarok, in cui ogni eroe trova la morte contro la propria nemesi. Excalibur nacque sull’onda di un ritrovato fascino per il fantasy all’inizio degli anni ’80 che si lega in qualche modo al successo nello stesso periodo di Dungeons & Dragons e ai romanzi di Conan, che arrivò nelle sale l’anno successivo e fece da apripista a un’intera generazione di film come La Storia Infinita, Legend, Labyrinth, La Storia Fantasitca, Willow. Non male per un film nato dopo che Boorman fallì nell’acquisire i diritti de Il Signore degli Anelli. ", "title": "Excalibur, vedi alla voce “esagerare”", "sentences": [{"27e8": "Excalibur, vedi alla voce “esagerare”"}, {"5549": "Storia e analisi di un film che contribuì a rilanciare il genere fantasy"}, {"f718": "Da ragazzino ero un secchione (ma va?) e amavo due cose in particolare: la mitologia greca e il ciclo arturiano. La prima mi era rimasta attaccata leggendo un libro per bambini chiamato “Storie della storia del mondo”, il secondo era merito di “La spada nella roccia” della Disney."}, {"9c42": "Una volta approdato in quella fase dell’adolescenza in cui ripudi tutto ciò che è infantile perché devi dimostrare che sei cresciuto, non so come mai entrai in contatto con Excalibur, un film uscito nell’anno in cui ero nato e che sulla copertina della VHS mostrava una spettacolare immagine di un tizio che ti guardava serissimo e una spada, non male."}, {"a562": "Excalibur è un favoloso polpettone di due ore e mezza che condensa tutte le avventure di Artù, dal concepimento ad opera di quello che probabilmente è il padre col nome più figo della storia, Uther Pendragon, alla morte per mano del figlio Mordred. Nel mezzo c’è tutta la storia di un mondo che passa lentamente dal paganesimo al cristianesimo e abbandona il suo lato più selvaggio e magico, rappresentato da Merlino, in favore di una scintillante nuova religione alla quale verrà chiesto il conto da Morgana."}, {"88de": "Tra i meriti del film ricordiamo l’aver ufficialmente sdoganato i Carmina Burana come musica solenne e tenebrosa con cui girare scene d’azione e l’aver dato ad attori sconosciuti o noti solo in patria un palcoscenico internazionale come Liam Neeson, qua praticamente al debutto insieme a Gabriel Byrne, Hellen Mirren e Patrick Stewart."}, {"1db3": "Boorman voleva che il pubblico si concentrasse sulla storia, non sugli attori. Excalibur fu anche il suo ritorno in sella, perché dopo Un tranquillo weekend di Paura aveva inanellato la combo Zardoz+L’esorcista II che non furono propriamente dei successi al botteghino."}, {"2952": "Per uno spettatore cresciuto a peplum, scontri epici e battaglie campali ma tendenzialmente ordinate, la visione di Excalibur era una sorta di rivelazione, un po’ come assaggiare una bistecca dopo anni di cotolette, come vedere la Battaglia di Anghiari prendere vita di fronte ai tuoi occhi."}, {"650b": "Scontri bui, pieni di fango, urla, Wagner e sangue, con gente che si muove lenta e impacciata in armature enormi (con cui tra l’altro riesce miracolosamente a fare sesso senza uccidere la compagna) e urla più per la fatica che per il dolore. Tutto è buio, scuro, fumoso e violento. Gli uomini sono fondamentalmente cavernicoli in armatura mossi solo dai propri istinti verso donne che o li subiscono o li manipolano."}, {"d277": "Nella sua follia visionaria, Excalibur rimane comunque molto più simile al vero medioevo di quanto possa raccontarti un libro di storia."}, {"08b8": "In contrasto con tutto questo realismo Boorman schierava un uso esagerato di riflessi e luccichii che in certi momenti trasformano il film in una televendita di argenteria. Le armature scintillano, i gioielli delle donne scintillano, la famigerata capoccia di Merlino scintilla, i denti scintillano, le mura del castello scintillano, persino la natura manda bagliori verdi."}, {"6abd": "E poi c’è l’armatura finale di Mordred che è un capolavoro del camp e lo trasforma in una specie di David di Michelangelo dorato e vendicativo (estetica ripresa ne Il Gladiatore), o l’affascinante litania della Magia del Fare recitata da Merlino in una specie di inglese arcaico: Analnathrakt Udvas Bethod Dokiel Dien-ve."}, {"15d5": "In italiano vuol dire più o meno “Per il respiro del drago, per la magia della vita e della morte, io ti ordino di fare” e sappiate che è stata anche utilizzata da Undertaker per alcune sue entrate in scena."}, {"4fe6": "Nella versione italiana il doppiaggio con un registro solenne rende tutte le interpretazioni uniformi e azzeccate, ma in lingua originale Excalibur diventa uno spettacolare campionario di overacting assurdo ed enfatico. Basta ascoltare gli spezzoni di questo articolo per essere investiti da un treno di gente che sembra uscita da Boris."}, {"e280": "La Mirren sembra sul palco alla recita del liceo, la maggior parte dei cavalieri parla come se fossero usciti ora da un corso di recitazione per posta, si salvano in corner Neeson, Stewart e Nigel Terry nei panni di Arthur, ma a volte anche loro strappano un sorriso."}, {"8a16": "Su tutti svetta Nicol Williamson, ovvero Merlino, che gigioneggia passando dal falsetto alla declamazione teatrale, alternando ritmi, toni, timbri e accenti e conferendo al personaggio un’anima mutevole, sfuggente e misteriosa, un po’ mago potentissimo, un po’ giullare di un altro mondo che si diverte nel contemplare le stranezze degli umani. Se il film porta a casa il risultato è merito anche suo."}, {"61f1": "Come molte produzioni gigantesche e sperimentali, d’altronde Boorman è lo stesso che ritenne necessario vestire Sean Connery come un viados in Zardoz, Excalibur non ebbe assolutamente vita facile, per colpa del cast e perché si rivelò costoso come giocare all’autoscontro con le Ferrari."}, {"20cb": "I produttori della United Artists odiavano Williamson perché si erano trovati male in passato, ma Boorman si impuntò perché lo riteneva talentuoso. Williamson odiava la Mirren perché si era trovato male in passato, ma Boorman si impuntò perché i loro dissapori potevano essere funzionali sullo schermo per la rivalità tra Merlino e Morgana."}, {"9de3": "Non mancarono neppure problemi sul set, che per tutti i mesi di riprese fu funestato da una continua e incessante pioggia. Il che fu perfetto per le battaglie campali e il finale lugubre, ma era un po’ meno bello tutto il resto del tempo, soprattutto quando devi tenere pulite e scintillanti centinaia di armature o girare una scena all’aperto in cui non dovrebbe piovere. A proposito di battaglie campali, quella iniziale dovettero ripeterla TRE volte, perché la luce era sbagliata. Potete immaginare da soli il costo dell’operazione."}, {"77e2": "Nonostante alcune performance e l’essere fondamentalmente un polpettone proto-fantasy abbastanza lungo, Excalibur spicca e resiste nel nostro immaginario grazie al talento visionario di Boorman in grado di trasmettere sensazioni terribilmente grezze, tetre e terrene, ma anche divine ed eroiche."}, {"83df": "Il fascino di un Merlino, più vicino come aspetto a un negromante che a un maghetto Disney, allucinazioni, magie, armature in penombra con forme animalesche (ben prima del Mastino di Game of Thrones), il Graal che scintilla come una visione paradisiaca, corvi che beccano occhi e infine l’uso di Wagner non è casuale, ma legato alla grandiosità eccessiva del Crepuscolo degli dei e del Ragnarok, in cui ogni eroe trova la morte contro la propria nemesi."}, {"ebe5": "Excalibur nacque sull’onda di un ritrovato fascino per il fantasy all’inizio degli anni ’80 che si lega in qualche modo al successo nello stesso periodo di Dungeons & Dragons e ai romanzi di Conan, che arrivò nelle sale l’anno successivo e fece da apripista a un’intera generazione di film come La Storia Infinita, Legend, Labyrinth, La Storia Fantasitca, Willow."}, {"f7b0": "Non male per un film nato dopo che Boorman fallì nell’acquisire i diritti de Il Signore degli Anelli."}], "child": "360_1\t360_2"}