{"name": "363", "parent": "", "content": "The Afterworld Saga — 3 Chapter Three: Nobody’s Fool “He knows something is amiss.” Tamra projected the thought to Leida when she caught Roy looking her way more than once during the walk home. Leida sighed. “He’s worried about me, thanks to your hostile reaction earlier, which he perceived to be mine.” When Roy’s shock on seeing Tamra’s bloody corpse had worn off, he’d insisted they leave right away before someone came along and blamed them for her death. In his urgency, he’d reached for Leida’s hand, but Tamra had recoiled from his touch. He’d been watching Leida like a hawk since. “But why don’t you want him to know what’s going on? He’s your brother.” “Precisely. And I’ve troubled him enough these past few months. I want to first find out how and why this happened, and how to undo it.” Dusk had fallen by the time they reached the stone house adjacent to the infamous Chalice tavern on Trident Way. After Roy left his cart in a neighbor's barn, they ascended the short steps into their home. Tamra hovered while he lit a dozen fat candles seated on sconces. Through the soft candlelight, she surveyed the modest hall which doubled as a kitchen. Her gaze fell first on the cupboard standing in a dim corner, its shelves packed with crockery and utensils. It looked like a daunting figure lurking in the shadows. She followed a whiff of rosemary and lavender, and found the herbs on a long table with a bench on either side of it. Tamra jerked when a draught rattled the pitchers and ladles hanging on the bare walls. “You’re giving yourself away,” Leida whispered. Roy was leaning against the wall, watching her. Behind him, a crackling fire blew smoke up the chimney. “Excuse yourself and head for my bedchamber.” Tamra pretended to yawn. “I’m feeling a bit tired. I think I’ll go lie down for a while.” He nodded. “Go ahead, I’ll start supper.” She felt his eyes bore into her back when she turned on her heel, his ears deaf to his sister’s voice guiding her along the narrow hallway and into a dark chamber. With Leida’s instructions, she lit the room’s candles. Their flickering light showed her a foreign reflection in the mirror facing the east wall. She sat in front of the dressing table and peered into the glass. A dusky maiden stared back. Tamra watched her fingers trace smooth skin the colour of black walnut, and thick eyebrows that arched to the heavens. Dark brown eyes, just like Roy’s, blinked when she did. And beneath a flat nose that gently flared at the nostrils, her lips were fuller. She slid off the caul to reveal tightly twisted braids — also just like Roy’s but longer — held back with a hairpin. She rose and took a step back to better assess her now slim, curvy physique. She patted her chest, and despite the heavy layers of clothing, she could tell the new bosom was more generous than her original flat one. Tamra grinned. She was spectacular. “I’m well aware but thank you,” Leida said. “Now if you’ve finished groping me, I’d like to know why you killed yourself.” Tamra sighed. “It’s a long story, one I wouldn’t have minded sharing if I wasn’t so tired, famished and,” she eyed the washstand in the corner, “probably in need of a bath.” Leida snorted. “Forget it. I’m not sharing any more of my body with you.” She laughed. “And what if our union is permanent? You’ll never bathe again?” “I’ll let you know after we visit the oracle of Themis tomorrow.” Tamra groaned. “Oracles,” she spat. “I don’t know which of their attributes I loathe more. Their superior airs or their cryptic insights.” Leida smiled. “I’m not fond of them either, but an oracle is our best chance at finding out how this happened.” “What will you tell your brother?” “Nothing. Roy’s a porter. He’ll leave for the market at first light.” Tamra rushed to the bed when a knock sounded on the door. Roy entered bearing a tray; the food’s aroma crept up her nose, and her stomach growled in response. He placed the tray on one of the massive oak chests beside the bed. Steaming pottage rich with meat, vegetables and bread nearly had her drivelling. She looked at Roy. “Thank you.” Her left hand was reaching for the cup on the tray when Leida snarled at her to use her right. She took a sip and wrinkled her face at the taste of ale. Roy frowned. “Is something wrong?” “Don’t tell me,” Leida said. “You loathe ale just as much as oracles.” “No, I tolerate ale better than oracles. But mead is my preferred choice of alcohol.” “Well, I love ale and so should you if you don’t want to rouse his suspicions any further.” Tamra took another sip and beamed at Roy. “No, it’s perfect.” Although he smiled back, she thought she detected a certain cynicism behind it. “I’ll go bolt the doors,” he said. “Rest well, sister.” When the door shut behind him, Tamra attacked the meal like it was her last. “Believe me,” she bit into the bread, “dying and coming back to life in someone else’s body is very hungry work.” After she cleared the last morsel from the bowl, she downed the rest of the ale and set the dishes aside. She kicked off her shoes and reclined on the bed, a purr escaping her lips as a cool breeze caressed her cheek. The candles burned brighter, refusing to cower before the wind. “On our way here,” Tamra began, “when you said you tried to stop me from jumping, I thought I heard a measure of guilt in your voice. Can I ask why?” It was a while before Leida answered. “Because three years ago, after an unspeakable family tragedy that changed mine and Roy’s lives forever, I stood in your shoes on the edge of a lofty cliff. And if I hadn’t found the will to save myself, I would have been a heap of broken bones too.” “How did you find the will?” “When I slipped on the stones and found myself dangling over the edge, I knew in my soul that I wanted to live, that I needed to live. I also thought of Roy and what my death would have done to him. So I pulled myself up and vowed to the gods that I would never again try to take my own life.” They lay in silence, listening to each other ponder the outcome of their impending visit to the oracle, each for her own reasons. Tamra let the noises outside lull her; she was drifting off when a cool blade pressed against her throat. Her eyes shot open, all traces of sleep gone. Roy loomed over her, his teeth bared. “I don’t know what manner of sorcery you used to disguise yourself as Leida, but I know as sure as the gods that you’re not her.” He pressed the blade harder. “So who are you? And what have you done with my sister?” ", "title": "The Afterworld Saga — 3", "sentences": [{"eb23": "The Afterworld Saga — 3"}, {"61c8": "Chapter Three: Nobody’s Fool"}, {"7165": "“He knows something is amiss.” Tamra projected the thought to Leida when she caught Roy looking her way more than once during the walk home."}, {"a922": "Leida sighed. “He’s worried about me, thanks to your hostile reaction earlier, which he perceived to be mine.”"}, {"4968": "When Roy’s shock on seeing Tamra’s bloody corpse had worn off, he’d insisted they leave right away before someone came along and blamed them for her death. In his urgency, he’d reached for Leida’s hand, but Tamra had recoiled from his touch."}, {"7e3c": "He’d been watching Leida like a hawk since."}, {"95d3": "“But why don’t you want him to know what’s going on? He’s your brother.”"}, {"6010": "“Precisely. And I’ve troubled him enough these past few months. I want to first find out how and why this happened, and how to undo it.”"}, {"04d7": "Dusk had fallen by the time they reached the stone house adjacent to the infamous Chalice tavern on Trident Way. After Roy left his cart in a neighbor's barn, they ascended the short steps into their home. Tamra hovered while he lit a dozen fat candles seated on sconces. Through the soft candlelight, she surveyed the modest hall which doubled as a kitchen."}, {"538a": "Her gaze fell first on the cupboard standing in a dim corner, its shelves packed with crockery and utensils. It looked like a daunting figure lurking in the shadows. She followed a whiff of rosemary and lavender, and found the herbs on a long table with a bench on either side of it."}, {"8ff8": "Tamra jerked when a draught rattled the pitchers and ladles hanging on the bare walls."}, {"281d": "“You’re giving yourself away,” Leida whispered."}, {"dab5": "Roy was leaning against the wall, watching her. Behind him, a crackling fire blew smoke up the chimney."}, {"9ffe": "“Excuse yourself and head for my bedchamber.”"}, {"7609": "Tamra pretended to yawn. “I’m feeling a bit tired. I think I’ll go lie down for a while.”"}, {"7ef6": "He nodded. “Go ahead, I’ll start supper.”"}, {"69dc": "She felt his eyes bore into her back when she turned on her heel, his ears deaf to his sister’s voice guiding her along the narrow hallway and into a dark chamber."}, {"3979": "With Leida’s instructions, she lit the room’s candles. Their flickering light showed her a foreign reflection in the mirror facing the east wall. She sat in front of the dressing table and peered into the glass."}, {"acbb": "A dusky maiden stared back."}, {"52c1": "Tamra watched her fingers trace smooth skin the colour of black walnut, and thick eyebrows that arched to the heavens. Dark brown eyes, just like Roy’s, blinked when she did. And beneath a flat nose that gently flared at the nostrils, her lips were fuller."}, {"410c": "She slid off the caul to reveal tightly twisted braids — also just like Roy’s but longer — held back with a hairpin. She rose and took a step back to better assess her now slim, curvy physique. She patted her chest, and despite the heavy layers of clothing, she could tell the new bosom was more generous than her original flat one."}, {"7167": "Tamra grinned. She was spectacular."}, {"bdfb": "“I’m well aware but thank you,” Leida said. “Now if you’ve finished groping me, I’d like to know why you killed yourself.”"}, {"0951": "Tamra sighed. “It’s a long story, one I wouldn’t have minded sharing if I wasn’t so tired, famished and,” she eyed the washstand in the corner, “probably in need of a bath.”"}, {"83fc": "Leida snorted. “Forget it. I’m not sharing any more of my body with you.”"}, {"997f": "She laughed. “And what if our union is permanent? You’ll never bathe again?”"}, {"d29d": "“I’ll let you know after we visit the oracle of Themis tomorrow.”"}, {"19af": "Tamra groaned. “Oracles,” she spat. “I don’t know which of their attributes I loathe more. Their superior airs or their cryptic insights.”"}, {"2728": "Leida smiled. “I’m not fond of them either, but an oracle is our best chance at finding out how this happened.”"}, {"625a": "“What will you tell your brother?”"}, {"585e": "“Nothing. Roy’s a porter. He’ll leave for the market at first light.”"}, {"14de": "Tamra rushed to the bed when a knock sounded on the door. Roy entered bearing a tray; the food’s aroma crept up her nose, and her stomach growled in response. He placed the tray on one of the massive oak chests beside the bed."}, {"7fcc": "Steaming pottage rich with meat, vegetables and bread nearly had her drivelling."}, {"c382": "She looked at Roy. “Thank you.”"}, {"d06f": "Her left hand was reaching for the cup on the tray when Leida snarled at her to use her right. She took a sip and wrinkled her face at the taste of ale."}, {"841d": "Roy frowned. “Is something wrong?”"}, {"7dde": "“Don’t tell me,” Leida said. “You loathe ale just as much as oracles.”"}, {"5cc6": "“No, I tolerate ale better than oracles. But mead is my preferred choice of alcohol.”"}, {"ffcd": "“Well, I love ale and so should you if you don’t want to rouse his suspicions any further.”"}, {"acd7": "Tamra took another sip and beamed at Roy. “No, it’s perfect.”"}, {"67b5": "Although he smiled back, she thought she detected a certain cynicism behind it."}, {"e1d6": "“I’ll go bolt the doors,” he said. “Rest well, sister.”"}, {"071d": "When the door shut behind him, Tamra attacked the meal like it was her last."}, {"1afc": "“Believe me,” she bit into the bread, “dying and coming back to life in someone else’s body is very hungry work.”"}, {"7cfa": "After she cleared the last morsel from the bowl, she downed the rest of the ale and set the dishes aside. She kicked off her shoes and reclined on the bed, a purr escaping her lips as a cool breeze caressed her cheek. The candles burned brighter, refusing to cower before the wind."}, {"784c": "“On our way here,” Tamra began, “when you said you tried to stop me from jumping, I thought I heard a measure of guilt in your voice. Can I ask why?”"}, {"d076": "It was a while before Leida answered."}, {"bf69": "“Because three years ago, after an unspeakable family tragedy that changed mine and Roy’s lives forever, I stood in your shoes on the edge of a lofty cliff. And if I hadn’t found the will to save myself, I would have been a heap of broken bones too.”"}, {"91bc": "“How did you find the will?”"}, {"daee": "“When I slipped on the stones and found myself dangling over the edge, I knew in my soul that I wanted to live, that I needed to live. I also thought of Roy and what my death would have done to him. So I pulled myself up and vowed to the gods that I would never again try to take my own life.”"}, {"1cd2": "They lay in silence, listening to each other ponder the outcome of their impending visit to the oracle, each for her own reasons."}, {"9ccb": "Tamra let the noises outside lull her; she was drifting off when a cool blade pressed against her throat. Her eyes shot open, all traces of sleep gone."}, {"d811": "Roy loomed over her, his teeth bared. “I don’t know what manner of sorcery you used to disguise yourself as Leida, but I know as sure as the gods that you’re not her.” He pressed the blade harder. “So who are you? And what have you done with my sister?”"}], "child": "363_1\t363_2\t363_3\t363_4\t363_5\t363_6\t363_7\t363_8\t363_9"}