{"name": "364", "parent": "", "content": "Flavors Beyond Vanilla _ 1 For all these years I did the deedperformed as expectednever exceedednever asked for more than what was therestayed within the city limitslooked away from open roadsdrove defensivelycolored inside the lines never stepped beyond until… It is hard to say what tempted me to fill out the profile. It wasn’t any single reason, nothing compelling. I wasn’t driven. At lunch with former colleagues the day before, we joked about dating after so long. They were both recently divorced and talked about creating profiles on sites like Tinder and Match. I joked that they were lighting up again. We laughed. That night, I found myself searching, clicking through sites designed to entice and connect. I told myself I was just looking to see what they were talking about. So I could keep up with the conversation next time. A social experiment, I thought. Just that and nothing more. I’d only fill out a profile to see what they asked. Honestly, it wasn’t as if anyone would respond. And it wouldn’t be me, I’d make up a persona, like trying on a dress you’d never wear outside the changing room. Just to see. Nothing more. I read through profiles and descriptions, just to see what people were up to. Not comparing, just to know what flavors there were beyond my oh, so ordinary vanilla. The categories took my thoughts to places I’d never dared to go. I had to look some of them up. Reading them I felt a vague disquiet, as though someone was talking about me and saying things I’d never known. I was suddenly restless and flushed with the sort of inner agitation that I’d only experienced in conversation when I felt a reaction to what was being said, and could sense the response building deep within but was unsure what would actually come out. A sort of unpredictable energy. A need I’d never known I had. I wrote the introduction last. I wanted it to be slyly wicked, sharp, provocative and most definitely not me. After many years making the same choices for the same reasons, I am ready for something new. I’ve licked too many vanilla cones and it is time for new flavors. I’ve been quietly conforming but now I am ready to take matters into my own hands. Secure in the professional world. Looking to bring the same level of control into the personal sphere. Earthy and elegant, creative and decisive, above all a lady who knows what she wants and will make sure she gets it. I read it twice and clicked submit before I could change my mind. It’s not like anything will come of it, I told myself. ", "title": "Flavors Beyond Vanilla _ 1", "sentences": [{"8557": "Flavors Beyond Vanilla _ 1"}, {"cda6": "For all these years I did the deedperformed as expectednever exceedednever asked for more than what was therestayed within the city limitslooked away from open roadsdrove defensivelycolored inside the lines"}, {"b0ab": "never stepped beyond until…"}, {"1d79": "It is hard to say what tempted me to fill out the profile. It wasn’t any single reason, nothing compelling. I wasn’t driven. At lunch with former colleagues the day before, we joked about dating after so long. They were both recently divorced and talked about creating profiles on sites like Tinder and Match. I joked that they were lighting up again. We laughed."}, {"2d75": "That night, I found myself searching, clicking through sites designed to entice and connect. I told myself I was just looking to see what they were talking about. So I could keep up with the conversation next time. A social experiment, I thought. Just that and nothing more. I’d only fill out a profile to see what they asked. Honestly, it wasn’t as if anyone would respond. And it wouldn’t be me, I’d make up a persona, like trying on a dress you’d never wear outside the changing room. Just to see. Nothing more."}, {"7bee": "I read through profiles and descriptions, just to see what people were up to. Not comparing, just to know what flavors there were beyond my oh, so ordinary vanilla. The categories took my thoughts to places I’d never dared to go. I had to look some of them up. Reading them I felt a vague disquiet, as though someone was talking about me and saying things I’d never known. I was suddenly restless and flushed with the sort of inner agitation that I’d only experienced in conversation when I felt a reaction to what was being said, and could sense the response building deep within but was unsure what would actually come out. A sort of unpredictable energy. A need I’d never known I had."}, {"56c4": "I wrote the introduction last. I wanted it to be slyly wicked, sharp, provocative and most definitely not me."}, {"45f2": "After many years making the same choices for the same reasons, I am ready for something new. I’ve licked too many vanilla cones and it is time for new flavors. I’ve been quietly conforming but now I am ready to take matters into my own hands. Secure in the professional world. Looking to bring the same level of control into the personal sphere. Earthy and elegant, creative and decisive, above all a lady who knows what she wants and will make sure she gets it."}, {"6b3d": "I read it twice and clicked submit before I could change my mind."}, {"4379": "It’s not like anything will come of it, I told myself."}], "child": "364_1\t364_2"}