{"name": "365", "parent": "", "content": "Getting Started: Rules and Guidelines Getting Started In order to get started at The Unending Tales, you’ve got two choices: contribute to the next chapter of a book (The Afterworld Saga is the only one right now) by submitting your name on the list of people who want to write. You will be designated a chapter and a deadline. or you can submit a short story which will always be accepted and will additionally be considered for becoming the opening chapter in your own book. Rules Joshua Valdivia and I have spoken a bit more about what this publication is going to be like and we are going to need to set some ground rules, just so it doesn’t get too crazy. Anyone is welcome to try out their stuff for each “next chapter.” The point of of this publication is to get as many people as possible to submit so we can develop this story in as awesome a way as we can muster. In order to involve as many people as possible, we’re going to try to wait a week or so between posting each additional section. This post will be updated with new rules and guidelines as the story progresses so be sure to check back in order to see what new criteria need to be met in order to be accepted. As of right now, this is all we got. Happy writing folks. ", "title": "Getting Started: Rules and Guidelines", "sentences": [{"8f18": "Getting Started: Rules and Guidelines"}, {"46aa": "Getting Started"}, {"04e3": "In order to get started at The Unending Tales, you’ve got two choices: contribute to the next chapter of a book (The Afterworld Saga is the only one right now) by submitting your name on the list of people who want to write. You will be designated a chapter and a deadline."}, {"cc7f": "or"}, {"67c6": "you can submit a short story which will always be accepted and will additionally be considered for becoming the opening chapter in your own book."}, {"e928": "Rules"}, {"8a76": "Joshua Valdivia and I have spoken a bit more about what this publication is going to be like and we are going to need to set some ground rules, just so it doesn’t get too crazy. Anyone is welcome to try out their stuff for each “next chapter.” The point of of this publication is to get as many people as possible to submit so we can develop this story in as awesome a way as we can muster."}, {"7ffb": "In order to involve as many people as possible, we’re going to try to wait a week or so between posting each additional section. This post will be updated with new rules and guidelines as the story progresses so be sure to check back in order to see what new criteria need to be met in order to be accepted. As of right now, this is all we got. Happy writing folks."}], "child": "365_1\t365_2\t365_3\t365_4\t365_5\t365_6\t365_7\t365_8\t365_9\t365_10\t365_11\t365_12"}