{"name": "366", "parent": "", "content": "Wants of a Wanton The Adonis Plant by Katsushika Hokusai The thrill of having His caramel voice whisper dirty things in my ear has me on my toes. He’s so fucking wrong for me, but I’m obsessed, I want His darkness, I want it underneath me, on top of me. I want to consume it, at the same time to let it devour me, to bathe in the ever loving fallen grace that’s been keeping me on the edge for the past few days. Orpheus sang for his dead wife, a great tragedy for love, but I do not want to use You for that. I don’t want to hear love songs that talk about hearts and flowers from You, and I don’t want whispered words of how gentle and soft my skin feels, but I do want to hear You sing, I want to hear You sing songs of the dead while You moan my name in the grip of pleasure, I want You to recite odes in this ancient language where bodies intertwine with dead leaves and a taste of paradise awaits those who come for the pilgrimage. I want to sit on Your face, riding wave upon wave of sweet, ecstatic lust, to let You tie me up and fuck me into oblivion until the only thing that would matter is the purple marks You’ll leave on my skin. I want You to defile me, I want You to paint my body with sin. ", "title": "Wants of a Wanton", "sentences": [{"3f7a": "Wants of a Wanton"}, {"2f40": "The Adonis Plant by Katsushika Hokusai"}, {"5c31": "The thrill of having His caramel voice whisper dirty things in my ear has me on my toes."}, {"5ead": "He’s so fucking wrong for me, but I’m obsessed, I want His darkness, I want it underneath me, on top of me. I want to consume it, at the same time to let it devour me, to bathe in the ever loving fallen grace that’s been keeping me on the edge for the past few days."}, {"7576": "Orpheus sang for his dead wife, a great tragedy for love, but I do not want to use You for that. I don’t want to hear love songs that talk about hearts and flowers from You, and I don’t want whispered words of how gentle and soft my skin feels, but I do want to hear You sing, I want to hear You sing songs of the dead while You moan my name in the grip of pleasure, I want You to recite odes in this ancient language where bodies intertwine with dead leaves and a taste of paradise awaits those who come for the pilgrimage. I want to sit on Your face, riding wave upon wave of sweet, ecstatic lust, to let You tie me up and fuck me into oblivion until the only thing that would matter is the purple marks You’ll leave on my skin."}, {"bd35": "I want You to defile me, I want You to paint my body with sin."}], "child": "366_1"}