{"name": "367", "parent": "", "content": "My first spanking I am on my hands and knees, tied up. I hate being bound. It makes me crazy not being able to feel you. I prefer to wrap my arms around you and caress your naked body with my own. But you want to try something new, and I obey because I belong to you. I am for your will and pleasure only. My sin is telling you about my thoughts of you with someone else. Forgive me, for I am jealous. Forgive me, for I am imperfect. Here I am all yours to command. Once, then twice, then three times I am struck. Paying penance for my pride. My bottom is red. My body is aching. Never mind the pain now. Not being able to touch you causes more sorrow than this whip. I want to scream but I can barely breathe. At this moment the pain is turning into something more. I feel like my mind and body are trading places. My nerves are all directed to my pussy. Each time I feel the sting of your whip I feel elevated. I am rising to the ceiling but my feet are on the ground. I cannot explain it in any other term than pure pleasure. This rope no longer feels rough around my body. It feels like protection. Still, all I can think about is your mouth. All I want is to kiss you and make love to you. Thinking about it makes my pussy wet. One more strike and I swear I will cum without even being touched there. I can tell you enjoy this. You like watching me shaking. I see that you want me. When I look at you I can almost feel your thoughts. You plan the next move to drive me mad. I am sinking now. My head weighs heavy. I can no longer stay in position. You spank me again and then it happens. I orgasm! I do not know how it happened but my pussy is pounding. I collapse. You finally untie me and hold me in your arms. I weep on your shoulders and you tell me it’s going to be okay. It’s going to be fine. Being in your arms feels new somehow. You are not the same person you were a moment ago. Your heart is revealed to me again and I am once again your love. You kiss me so softly. It’s just like our first time. You caress me gently. Your magical hands make me hot and wet. You spread my legs apart. You kiss my neck and massage my pussy with your fingers. It’s as if you are playing me like an instrument and my moans are the music. I only take seconds to cum again and your fingers are not even done. I know you will not stop. That’s never your style. Sit on my face, you say. Put your legs here and relax your body. I do it and hold on to the padded headboard. Your tongue is circling slowly on my pussy and I feel like cumming again. I cannot believe I am not done. My pussy does that for no one. Not even my own hands. You hold me still so I do not fall backwards as I dig my nails into the headboard. I need to hold on to something. I feel straps behind the bedposts and manage to hold them with my arms wide apart, spread cruciform. I dip up and down on your mouth until my pussy melts to your touch. My orgasm is so strong it makes me scream out loud. I never make such noises as this. It’s like my body is screaming for me. You sit up and hold me again and wrap my legs around your waist. Your pussy is juicing on mine. Although my back and bottom are still stinging it feels so good when you hold me close like this. I like it when you touch me there and make my hips dance on you. This time it is you who is shaking. I feel you are going to cum at any moment. I hold you close and grind my pussy on yours. I do it fast then do it slowly, making you shake some more. You are screaming at me and begging, faster, please don’t slow down! You hold my waist tightly and slide back and forth on me. I love that you are beneath me and still in control. The way your pussy rubs mine hits the spot for me too, and we cum together. I never experienced this before. It feels like both our pussies are leaking faucets that cannot turn off. I pump my hips on your pussy again and smile at you. That’s right, I say. Give me everything you’ve got! And you do. I love watching your face when you climax. It’s beautiful to see you like this. Surrendering and finally at peace. I’m thinking to myself as I kiss your lips that you are the best sex of my life. I will do anything to keep you. You are smiling at me and start to joke and play with me. So how was your first taste of spanking? you ask me. I say, I liked it. Let’s do it again. ", "title": "My first spanking", "sentences": [{"9807": "My first spanking"}, {"61e8": "I am on my hands and knees, tied up. I hate being bound. It makes me crazy not being able to feel you. I prefer to wrap my arms around you and caress your naked body with my own. But you want to try something new, and I obey because I belong to you. I am for your will and pleasure only. My sin is telling you about my thoughts of you with someone else. Forgive me, for I am jealous. Forgive me, for I am imperfect. Here I am all yours to command. Once, then twice, then three times I am struck. Paying penance for my pride. My bottom is red. My body is aching. Never mind the pain now. Not being able to touch you causes more sorrow than this whip. I want to scream but I can barely breathe."}, {"cb6b": "At this moment the pain is turning into something more. I feel like my mind and body are trading places. My nerves are all directed to my pussy. Each time I feel the sting of your whip I feel elevated. I am rising to the ceiling but my feet are on the ground. I cannot explain it in any other term than pure pleasure. This rope no longer feels rough around my body. It feels like protection. Still, all I can think about is your mouth. All I want is to kiss you and make love to you. Thinking about it makes my pussy wet. One more strike and I swear I will cum without even being touched there."}, {"6a0a": "I can tell you enjoy this. You like watching me shaking. I see that you want me. When I look at you I can almost feel your thoughts. You plan the next move to drive me mad. I am sinking now. My head weighs heavy. I can no longer stay in position. You spank me again and then it happens. I orgasm! I do not know how it happened but my pussy is pounding. I collapse."}, {"3af5": "You finally untie me and hold me in your arms. I weep on your shoulders and you tell me it’s going to be okay. It’s going to be fine. Being in your arms feels new somehow. You are not the same person you were a moment ago. Your heart is revealed to me again and I am once again your love. You kiss me so softly. It’s just like our first time. You caress me gently. Your magical hands make me hot and wet. You spread my legs apart. You kiss my neck and massage my pussy with your fingers. It’s as if you are playing me like an instrument and my moans are the music. I only take seconds to cum again and your fingers are not even done. I know you will not stop. That’s never your style."}, {"112a": "Sit on my face, you say. Put your legs here and relax your body. I do it and hold on to the padded headboard. Your tongue is circling slowly on my pussy and I feel like cumming again. I cannot believe I am not done. My pussy does that for no one. Not even my own hands. You hold me still so I do not fall backwards as I dig my nails into the headboard. I need to hold on to something. I feel straps behind the bedposts and manage to hold them with my arms wide apart, spread cruciform. I dip up and down on your mouth until my pussy melts to your touch. My orgasm is so strong it makes me scream out loud. I never make such noises as this. It’s like my body is screaming for me."}, {"3b2b": "You sit up and hold me again and wrap my legs around your waist. Your pussy is juicing on mine. Although my back and bottom are still stinging it feels so good when you hold me close like this. I like it when you touch me there and make my hips dance on you. This time it is you who is shaking. I feel you are going to cum at any moment. I hold you close and grind my pussy on yours. I do it fast then do it slowly, making you shake some more. You are screaming at me and begging, faster, please don’t slow down! You hold my waist tightly and slide back and forth on me. I love that you are beneath me and still in control. The way your pussy rubs mine hits the spot for me too, and we cum together. I never experienced this before. It feels like both our pussies are leaking faucets that cannot turn off."}, {"ca4c": "I pump my hips on your pussy again and smile at you. That’s right, I say. Give me everything you’ve got!"}, {"6a9c": "And you do. I love watching your face when you climax. It’s beautiful to see you like this. Surrendering and finally at peace. I’m thinking to myself as I kiss your lips that you are the best sex of my life. I will do anything to keep you. You are smiling at me and start to joke and play with me."}, {"b9fe": "So how was your first taste of spanking? you ask me."}, {"d977": "I say, I liked it. Let’s do it again."}], "child": "367_1\t367_2\t367_3\t367_4\t367_5\t367_6\t367_7\t367_8\t367_9\t367_10"}