{"name": "368", "parent": "", "content": "Rebirth of my Sadomasochism I stared at the flaming embers of my cigarette as it burned to its filter, feeling the edge of my frustration dull down to a faint hum. You’ve been glancing at me across the room for the past hour, and I needed a little break, for the urge to fuck, to copulate, to have you slam me against the nearest wall was overpowering and my resolve was getting weaker by the minute. I had to get out. I took another drag; inhale, exhale. I was blindfolded and face down on a hard metal surface breathing heavily, my wrists tied up together above my head, ankles to each corner. Inhale. Exhale. “Enchanté.” The heat from your lips briefly touching the skin behind my ear, reminding me of our safe word, rolling the French off of your tongue so naturally. I nodded and felt your smile and the sudden cold that instantly replaced your presence. I could feel you watching me and that was enough to make my cunt drip with keen anticipation. Inhale. Exhale. The first strike took me by surprise. I couldn’t tell if it was a belt or a new whip, but my toes curled and I gripped the rope tighter. You marked me 12 times, and I’ve never felt so devastatingly liberated with each blow; the pain that I felt was exquisite, and I was exhilarated beyond belief. My skin sang with sensitivity and ambrosia. You untied my wrists and retied them to my back, pushing my ass up, burying my face deeper into the cold. Inhale. Exhale. You traced the entrance of my pussy with your cock, gently massaging the soft bundle of nerves, and entering me violently with one jerk of your hips, pushing in and out hard and fast; everything you did were antonyms of everything else, and the fierce flare of yearning for my release evident, I could not keep still. I couldn’t think of anything aside from getting off. In and out. You pulled my hair and tugged on the forgotten chain clipped on the buds of my tits: “Bite on this.” My mind was in another place. In and out. In and out. “Come for me,” you whispered, and poured hot candle wax from my neck, down, down my thighs making it easier to jump down the cliff and explode into bits and pieces of stardust scattered across the galaxies. You made me come and scream at the feel of the tectonic plates moving and introducing me to the old lands and gods, I came to the edge of the world, to where the sun and the earth tilted at another axis. I came and saw how the universe become, I saw it from the ashes, and ashes I was… until you cried out my name, I was reborn. ", "title": "Rebirth of my Sadomasochism", "sentences": [{"6f29": "Rebirth of my Sadomasochism"}, {"db8c": "I stared at the flaming embers of my cigarette as it burned to its filter, feeling the edge of my frustration dull down to a faint hum. You’ve been glancing at me across the room for the past hour, and I needed a little break, for the urge to fuck, to copulate, to have you slam me against the nearest wall was overpowering and my resolve was getting weaker by the minute. I had to get out. I took another drag; inhale, exhale."}, {"f776": "I was blindfolded and face down on a hard metal surface breathing heavily, my wrists tied up together above my head, ankles to each corner. Inhale. Exhale."}, {"6f56": "“Enchanté.” The heat from your lips briefly touching the skin behind my ear, reminding me of our safe word, rolling the French off of your tongue so naturally. I nodded and felt your smile and the sudden cold that instantly replaced your presence. I could feel you watching me and that was enough to make my cunt drip with keen anticipation."}, {"1db5": "Inhale."}, {"a1e9": "Exhale."}, {"c647": "The first strike took me by surprise. I couldn’t tell if it was a belt or a new whip, but my toes curled and I gripped the rope tighter. You marked me 12 times, and I’ve never felt so devastatingly liberated with each blow; the pain that I felt was exquisite, and I was exhilarated beyond belief. My skin sang with sensitivity and ambrosia. You untied my wrists and retied them to my back, pushing my ass up, burying my face deeper into the cold."}, {"a4c0": "Inhale."}, {"a2ba": "Exhale."}, {"5fd5": "You traced the entrance of my pussy with your cock, gently massaging the soft bundle of nerves, and entering me violently with one jerk of your hips, pushing in and out hard and fast; everything you did were antonyms of everything else, and the fierce flare of yearning for my release evident, I could not keep still. I couldn’t think of anything aside from getting off. In and out."}, {"aa4d": "You pulled my hair and tugged on the forgotten chain clipped on the buds of my tits: “Bite on this.” My mind was in another place. In and out. In and out. “Come for me,” you whispered, and poured hot candle wax from my neck, down, down my thighs making it easier to jump down the cliff and explode into bits and pieces of stardust scattered across the galaxies. You made me come and scream at the feel of the tectonic plates moving and introducing me to the old lands and gods, I came to the edge of the world, to where the sun and the earth tilted at another axis. I came and saw how the universe become, I saw it from the ashes, and ashes I was… until you cried out my name, I was reborn."}], "child": "368_1\t368_2"}