{"name": "369", "parent": "", "content": "The Waterwheel Water trickling water gurgling surging splashing sploshy burbling Wooden wheel tirelessly turning spun by cascading torrents churning O I’m such a naughty girl! On sunny days I love to take A whippy whacking rod One to make my bottom ache Naughty me, I’m quite undressed Soft lush grass, bare feet caressed A sunlit stroll, by gleaming brook Down to my secret spanking nook Passers-by would not believe What devious imagination first conceived Of harnessing pure water’s flow To whack naughty bottoms so I bend across the wooden bench And slot the cane into the post I feel it press upon my cheeks Then the bit I love the most On the wheel there is a peg It lifts the cane and makes it creak Up and up it bends until it slips Whacking back to make me squeak A short pause to catch my breath Cane upon my stinging cheeks The peg will soon be round again Do any ever hear my shrieks? My merciless water-powered imagination machine Whisks my mind away to waking dreams I imagine wrist and ankle stocks They place a rod across my bum Leaving me struggling against my locks My shouts receding as they walk away Leaving me at the mercy of the wheel Perhaps they’ll not return today Or I’m a naughty miller’s daughter Sent to the wheel, discovered wanking I’m disciplined by gushing water Returning home to show my spanking Afterwards I love to lie On the dewy riverbank under sky Damp grass soothing poor pink bum Slow filthy rubbing ’til I come Mesmerised by the turning wheel I rub to the rhythm of the lifting cane Massaging deep within my crack Pleasure overwhelming pain O how it bends, and then whips back Where my bottom used to be My ears fill with an imagined thwack Until I’m swept away excitedly At night I listen to the rain A trillion raindrops fill my dreams Uniting… merging… surging… Into torrential bottom smacking streams . . . ", "title": "The Waterwheel", "sentences": [{"7e19": "The Waterwheel"}, {"032f": "Water trickling"}, {"47f9": "water gurgling"}, {"bdec": "surging splashing"}, {"6b35": "sploshy burbling"}, {"a7f2": "Wooden wheel"}, {"08cd": "tirelessly turning"}, {"6dc0": "spun by cascading"}, {"59f2": "torrents churning"}, {"cfeb": "O I’m such a naughty girl!"}, {"f84a": "On sunny days I love to take"}, {"9fdf": "A whippy whacking rod"}, {"66d3": "One to make my bottom ache"}, {"b9a2": "Naughty me, I’m quite undressed"}, {"e352": "Soft lush grass, bare feet caressed"}, {"6cd8": "A sunlit stroll, by gleaming brook"}, {"9676": "Down to my secret spanking nook"}, {"92aa": "Passers-by would not believe"}, {"132d": "What devious imagination first conceived"}, {"d199": "Of harnessing pure water’s flow"}, {"6bd6": "To whack naughty bottoms so"}, {"15b4": "I bend across the wooden bench"}, {"ed7d": "And slot the cane into the post"}, {"3ad3": "I feel it press upon my cheeks"}, {"8293": "Then the bit I love the most"}, {"2aed": "On the wheel there is a peg"}, {"96b9": "It lifts the cane and makes it creak"}, {"5e92": "Up and up it bends until it slips"}, {"088a": "Whacking back to make me squeak"}, {"6252": "A short pause to catch my breath"}, {"fb3e": "Cane upon my stinging cheeks"}, {"5f4e": "The peg will soon be round again"}, {"f02c": "Do any ever hear my shrieks?"}, {"de97": "My merciless water-powered imagination machine"}, {"21f7": "Whisks my mind away to waking dreams"}, {"a4c4": "I imagine wrist and ankle stocks"}, {"6e23": "They place a rod across my bum"}, {"ccb1": "Leaving me struggling against my locks"}, {"e0bb": "My shouts receding as they walk away"}, {"7fe1": "Leaving me at the mercy of the wheel"}, {"bb15": "Perhaps they’ll not return today"}, {"14e8": "Or I’m a naughty miller’s daughter"}, {"3a97": "Sent to the wheel, discovered wanking"}, {"8a89": "I’m disciplined by gushing water"}, {"1646": "Returning home to show my spanking"}, {"8e5e": "Afterwards I love to lie"}, {"1f0e": "On the dewy riverbank under sky"}, {"2562": "Damp grass soothing poor pink bum"}, {"47be": "Slow filthy rubbing ’til I come"}, {"a504": "Mesmerised by the turning wheel"}, {"fdd6": "I rub to the rhythm of the lifting cane"}, {"95d6": "Massaging deep within my crack"}, {"5d41": "Pleasure overwhelming pain"}, {"15cf": "O how it bends, and then whips back"}, {"35c9": "Where my bottom used to be"}, {"d6d4": "My ears fill with an imagined thwack"}, {"20a0": "Until I’m swept away excitedly"}, {"95f8": "At night I listen to the rain"}, {"99f4": "A trillion raindrops fill my dreams"}, {"0765": "Uniting… merging… surging…"}, {"aaa1": "Into torrential bottom smacking streams"}, {"dd67": "."}, {"3f77": "."}, {"9e85": "."}], "child": "369_1369_1369_1369_1369_1369_1369_1369_1369_1369_1369_1369_1369_1369_1"}