{"content": "Understanding the NBA Trade Deadline Leverage Game If they wait too long to trade a star, teams can find themselves making pennies on the dollar The promise of change can be invigorating. We Trade Machine Picassos spend countless hours debating on Twitter and Reddit about transaction rumors because we want to remix the song we’re hearing. But trades aren’t made to satisfy our desire for upheaval. Roster turnover usually occurs steadily rather than abruptly, and a superstar’s tenure on a team is difficult to end. Even if Sunday’s DeMarcus Cousins–to-the-Pelicans trade seemed sudden, it was clearly the product of years of internal debate among the Kings leadership, and was executed with an eye toward the future. The Kings decided they did not want to pay the approximately $200 million Cousins would make in a contract extension. And as that same deal showed, trading a star in the prime of his career can enrage and estrange a fan base. The Sacramento Kings Fan Base Has Been Demoralized Once MoreLosing Boogie Cousins is the latest indignity Sac-Town fans must endure. And there’s only one man who can save this…theringer.com Keep that in mind as the trade deadline approaches: these deals are business decisions, as well as basketball ones. Fans can casually throw around the idea of tanking, but for the team that bottoms out, there are consequences — ticket sales may plummet, and interest may be slow to return, especially in small-market cities. The NBA’s dirty little secret is that winning a championship isn’t the only goal for every franchise. The objective is often to compete, make playoff runs, sustain fan interest, and, of course, make money. Just take the recent comments from Timberwolves owner Glen Taylor: “Our guys can’t see anything positive about losing games. They must win games, and then if we can win enough to get into the playoffs, that in and of itself would be a major step for our young players.” That’s not an ultimatum from Taylor, but think about how that attitude can impact Minnesota’s personnel decisions. They may be currently out of the playoffs, but they don’t see themselves as sellers planning for future campaigns. They want in. Some teams want to win now; some teams want to win it all. But doing the former can get in the way of the latter. The pressure to “win now” can override the prudence of taking one step back to make a huge leap forward. The Kings waited too long to deal Cousins and settled for a paltry offer from the Pelicans — Buddy Hield and New Orleans’s 2017 protected first-round pick. The longest view in the room usually wins, and the Kings are as shortsighted as it gets. It took Sacramento owner Vivek Ranadivé too long to see that the team couldn’t build around Boogie (and, as I wrote Monday, once Ranadivé did, his fixation on Hield led them to take a poor deal). Now an already-irrelevant franchise will bottom out with no top-end assets to show for it. Breaking Down the DeMarcus Cousins–Pelicans TradeIt isn’t about who won and who lost. It’s about how badly the Kings got swindled.theringer.com On the other hand, that’s what made Sam Hinkie’s Philadelphia experiment so fascinating. The agony that Sixers fans experienced has now blossomed into an immense sense of hope. They might be on the outside looking in at the playoff race, but the aroma of a potential championship probably smells stronger to Sixers fans than it does to fans of fringe playoff teams like the Kings, or the Bulls and Pacers, both of which have superstars but no realistic path to adding more stars or making the Finals. The Bulls Are in a Full-on Meltdown [Updated]Dwyane Wade, Rajon Rondo, and Jimmy Butler are acting like teenagerstheringer.com Take Chicago, for example. Last summer, there were reported draft night trade talks with both the Celtics and Timberwolves involving Bulls star Jimmy Butler. The Bulls have once again “engaged” with the Celtics on the potential of a Jimmy Butler trade, The Vertical’s Adrian Wojnarowski reported Saturday. It’s easy to armchair general manage a deal between the two teams if we assume the Bulls are rebuilding — Boston and Chicago each have what the other wants (a star player and assets, respectively). But it’s not that simple. When the Bulls and Celtics talked Butler last summer, there was organizational disharmony between Chicago’s four primary decision-makers (owner Jerry Reinsdorf, president Michael Reinsdorf, general manager Gar Forman, and vice president of basketball operations John Paxson). Not all of them were committed to rebuilding; according to a league front-office executive, Paxson “sees the writing on the wall,” whereas Forman is comfortable with the status quo, while ownership is not amenable to any potential trades. A league source with knowledge of the Bulls situation indicated to me last summer that the Bulls demanded Jae Crowder and the no. 3 pick, as well as an additional starter-level player and another pick (likely one of the Nets picks). With the third pick, the Bulls had their eyes on point guard Kris Dunn. That would have kept the Bulls floating right in the middle, as the Celtics would be primed to make a now-or-never run at the title while mortgaging their future. It fundamentally wasn’t a match, though you can understand the Bulls’ insistence on maximizing a return. Butler’s contract is guaranteed through 2019, so Chicago has time to make its roster appealing enough to retain its star forward. But with each month that goes by, progress continues to stall, and the urgency for a trade only increases. (Getty Images) It’s not dissimilar to the Pacers’ trade of Jermaine O’Neal in 2008. The year before, O’Neal expressed a desire to be dealt to the Lakers, but Pacers general manager Larry Bird wanted both youth (Andrew Bynum) and veterans (Lamar Odom), just like the Bulls last summer for Butler. At the time, O’Neal remarked: “Larry Bird is a hard man to deal with … He tries to make unfair trades. He wants to gut a team, but the Lakers are trying to get over the hump. I want Indiana to benefit, but with some nice young players and draft picks. I want to make it clear that I don’t want to gut a team that I come to because then it’ll be like I’m in Indiana all over again.” In the summer of 2008, Bird finally dealt O’Neal to Toronto, for (among other players) T.J. Ford and Roy Hibbert (the 17th pick) in return. It’s hard not to wonder what the haul could’ve been had Bird only sought assets in return, rather than an assets-and-vets combination. Indiana could soon find itself in a similar situation with Paul George, who has already expressed his displeasure about the state of the team. Then–Lakers general manager Mitch Kupchak was wise not to cave into Bird’s demands. Los Angeles bided its time and waited for a better deal. Their patience paid off the following year when they dealt Javaris Crittenton, Kwame Brown, the rights to Marc Gasol, a 2008 first (Donte Greene), and a 2010 first (Greivis Vasquez) to the Grizzlies for Pau Gasol and a 2010 second (Devin Ebanks). The Lakers managed to retain their core players and went to three straight NBA Finals, winning two. Had they made the proposed trade for O’Neal, they would’ve lost two key NBA Finals contributors. (Getty Images) The Bulls should be wary of backing themselves into a corner and losing leverage like the Pacers did, or like the Kings and Knicks have done. After Phil Jackson’s longtime confidante Charley Rosen wrote a scorching critique of Carmelo Anthony in early January, the Knicks forward and Jackson met to discuss their future. Melo took the piece as a message from Jackson himself: We want you gone. But with a deal signed through 2019 and a no-trade clause, Anthony has all the power. If he were going to be dealt, he’d dictate his destination. There’s No Home for CarmeloDespite beef with Phil Jackson, Anthony’s no-trade clause and burned bridges means he’s staying with the Knickstheringer.com Since then, a lot has happened: Jackson has sent cryptic tweets, reports have emerged that the Knicks were attempting to swap Carmelo for Kevin Love or that the Clippers were trying to add a third team to facilitate a deal. There was momentum to finally end the tenuous Melo-Knicks relationship. The Melo-Blake-Celtics Deal That Would Make the Clippers ContendersIf the Clippers want to compete with Golden State, they need to roll the dicetheringer.com But with just a few days until the deadline, sources around the league indicate that Melo will remain a Knick through the end of the season. There simply isn’t a workable trade for a team receiving Melo. Furthermore, over the past few weeks a couple of executives have suggested to me that they think Melo would be a negative addition to any playoff contender. One said that the Clippers would become so top-heavy that their bench units would get roasted by nearly any Western Conference opponent, while another suggested Melo’s bad habits are unbreakable, and his archaic style is unchangeable at this stage of his career. If things don’t get better in Chicago, there will come a time when it may be forced to make a trade (like the Kings felt they had to do with Boogie). That’s when leverage is gone. There are limited viable destinations for Carmelo because his no-trade clause gives him all the power; the receiving team would need to feel confident it could re-sign him, like with Butler or George. When it comes to trading a star, it’s important to enter the market at the right time — not so early that there’s no competition among offers, but not so late that opposing teams know you’re desperate to move your player. Think about how the Jazz played the 2011 Deron Williams trade. Williams was Utah’s franchise point guard, but was beginning to wear out his welcome in Salt Lake City. The Jazz moved in relative secrecy, pulling off the rare feat of trading a star player before a huge market develops. They dealt Williams to the Nets, and the ramifications of the deal can still be felt today. Just look at the standings. The Grizzlies received criticism for making the 2008 Gasol-for-Gasol trade. Pau Gasol, like Butler, had two years left on a team-friendly contract, so it appeared there was little urgency to make a trade. Adrian Wojnarowski called it “one of the NBA’s worst trades in years.” My boss, Bill Simmons, wrote that it “would have caused complete chaos in any of my fantasy leagues,” and even Grizzlies owner Michael Heisley questioned the deal. “I don’t know if I got the most value,” Heisley admitted to Yahoo Sports. “Maybe our people should’ve shopped [Pau Gasol] more and maybe we would’ve gotten more, done a better deal.” Woj, Simmons, and Heisley weren’t wrong, but the assessment of a trade can change as time passes. The process can still be questioned to this day, but the results can’t. At the time, Grizzlies general manager Chris Wallace said Marc Gasol was “one of the best young big men in Spain” and would’ve been a high first-rounder had he come out in the 2008 draft rather than 2007. True! Wallace said recently on the NBA A to Z podcast that the deal “set the team up for the future,” giving them asset and cap flexibility to react to opportunities that could present themselves. Also true! That opportunity ended up being Zach Randolph, who they acquired for a bargain in 2009, and they later had the space to re-sign Mike Conley and Rudy Gay. The Grizzlies haven’t won a title, but by trading Gasol early rather than late, they — at least in Wallace’s eyes — maximized the return and accelerated the retooling phase. And yet all of the aforementioned approaches required top-down organizational consensus. The Kings were too late, and as it stands, the Bulls don’t have that consensus. Unless they come to an understanding soon, they’ll keep puttering along as a sub-.500 team that signs past-their-prime players like Rajon Rondo and Dwyane Wade with hopes of sneaking into the playoffs; that might be enough to keep casual fans interested and Reinsdorf satisfied, but once 2019 free agency comes, Butler could be sprinting out the door. Then what? ", "child": "37_1\t37_2\t37_3\t37_4\t37_5\t37_6\t37_7\t37_8\t37_9\t37_10\t37_11\t37_12\t37_13\t37_14", "title": "Understanding the NBA Trade Deadline Leverage Game", "parent": "", "sentences": [{"34ad": "Understanding the NBA Trade Deadline Leverage Game"}, {"7441": "If they wait too long to trade a star, teams can find themselves making pennies on the dollar"}, {"a5fc": "The promise of change can be invigorating. We Trade Machine Picassos spend countless hours debating on Twitter and Reddit about transaction rumors because we want to remix the song we’re hearing. But trades aren’t made to satisfy our desire for upheaval. Roster turnover usually occurs steadily rather than abruptly, and a superstar’s tenure on a team is difficult to end. Even if Sunday’s DeMarcus Cousins–to-the-Pelicans trade seemed sudden, it was clearly the product of years of internal debate among the Kings leadership, and was executed with an eye toward the future. The Kings decided they did not want to pay the approximately $200 million Cousins would make in a contract extension."}, {"4586": "And as that same deal showed, trading a star in the prime of his career can enrage and estrange a fan base."}, {"21f0": "The Sacramento Kings Fan Base Has Been Demoralized Once MoreLosing Boogie Cousins is the latest indignity Sac-Town fans must endure. And there’s only one man who can save this…theringer.com"}, {"614c": "Keep that in mind as the trade deadline approaches: these deals are business decisions, as well as basketball ones. Fans can casually throw around the idea of tanking, but for the team that bottoms out, there are consequences — ticket sales may plummet, and interest may be slow to return, especially in small-market cities."}, {"3d17": "The NBA’s dirty little secret is that winning a championship isn’t the only goal for every franchise. The objective is often to compete, make playoff runs, sustain fan interest, and, of course, make money. Just take the recent comments from Timberwolves owner Glen Taylor: “Our guys can’t see anything positive about losing games. They must win games, and then if we can win enough to get into the playoffs, that in and of itself would be a major step for our young players.” That’s not an ultimatum from Taylor, but think about how that attitude can impact Minnesota’s personnel decisions. They may be currently out of the playoffs, but they don’t see themselves as sellers planning for future campaigns. They want in."}, {"c9d7": "Some teams want to win now; some teams want to win it all. But doing the former can get in the way of the latter."}, {"f5aa": "The pressure to “win now” can override the prudence of taking one step back to make a huge leap forward. The Kings waited too long to deal Cousins and settled for a paltry offer from the Pelicans — Buddy Hield and New Orleans’s 2017 protected first-round pick. The longest view in the room usually wins, and the Kings are as shortsighted as it gets. It took Sacramento owner Vivek Ranadivé too long to see that the team couldn’t build around Boogie (and, as I wrote Monday, once Ranadivé did, his fixation on Hield led them to take a poor deal). Now an already-irrelevant franchise will bottom out with no top-end assets to show for it."}, {"7aad": "Breaking Down the DeMarcus Cousins–Pelicans TradeIt isn’t about who won and who lost. It’s about how badly the Kings got swindled.theringer.com"}, {"5823": "On the other hand, that’s what made Sam Hinkie’s Philadelphia experiment so fascinating. The agony that Sixers fans experienced has now blossomed into an immense sense of hope. They might be on the outside looking in at the playoff race, but the aroma of a potential championship probably smells stronger to Sixers fans than it does to fans of fringe playoff teams like the Kings, or the Bulls and Pacers, both of which have superstars but no realistic path to adding more stars or making the Finals."}, {"5f11": "The Bulls Are in a Full-on Meltdown [Updated]Dwyane Wade, Rajon Rondo, and Jimmy Butler are acting like teenagerstheringer.com"}, {"590a": "Take Chicago, for example. Last summer, there were reported draft night trade talks with both the Celtics and Timberwolves involving Bulls star Jimmy Butler. The Bulls have once again “engaged” with the Celtics on the potential of a Jimmy Butler trade, The Vertical’s Adrian Wojnarowski reported Saturday. It’s easy to armchair general manage a deal between the two teams if we assume the Bulls are rebuilding — Boston and Chicago each have what the other wants (a star player and assets, respectively). But it’s not that simple. When the Bulls and Celtics talked Butler last summer, there was organizational disharmony between Chicago’s four primary decision-makers (owner Jerry Reinsdorf, president Michael Reinsdorf, general manager Gar Forman, and vice president of basketball operations John Paxson). Not all of them were committed to rebuilding; according to a league front-office executive, Paxson “sees the writing on the wall,” whereas Forman is comfortable with the status quo, while ownership is not amenable to any potential trades. A league source with knowledge of the Bulls situation indicated to me last summer that the Bulls demanded Jae Crowder and the no. 3 pick, as well as an additional starter-level player and another pick (likely one of the Nets picks). With the third pick, the Bulls had their eyes on point guard Kris Dunn."}, {"79ee": "That would have kept the Bulls floating right in the middle, as the Celtics would be primed to make a now-or-never run at the title while mortgaging their future. It fundamentally wasn’t a match, though you can understand the Bulls’ insistence on maximizing a return. Butler’s contract is guaranteed through 2019, so Chicago has time to make its roster appealing enough to retain its star forward. But with each month that goes by, progress continues to stall, and the urgency for a trade only increases."}, {"d120": "(Getty Images)"}, {"03af": "It’s not dissimilar to the Pacers’ trade of Jermaine O’Neal in 2008. The year before, O’Neal expressed a desire to be dealt to the Lakers, but Pacers general manager Larry Bird wanted both youth (Andrew Bynum) and veterans (Lamar Odom), just like the Bulls last summer for Butler. At the time, O’Neal remarked:"}, {"804e": "“Larry Bird is a hard man to deal with … He tries to make unfair trades. He wants to gut a team, but the Lakers are trying to get over the hump. I want Indiana to benefit, but with some nice young players and draft picks. I want to make it clear that I don’t want to gut a team that I come to because then it’ll be like I’m in Indiana all over again.”"}, {"211a": "In the summer of 2008, Bird finally dealt O’Neal to Toronto, for (among other players) T.J. Ford and Roy Hibbert (the 17th pick) in return. It’s hard not to wonder what the haul could’ve been had Bird only sought assets in return, rather than an assets-and-vets combination. Indiana could soon find itself in a similar situation with Paul George, who has already expressed his displeasure about the state of the team."}, {"d8a1": "Then–Lakers general manager Mitch Kupchak was wise not to cave into Bird’s demands. Los Angeles bided its time and waited for a better deal. Their patience paid off the following year when they dealt Javaris Crittenton, Kwame Brown, the rights to Marc Gasol, a 2008 first (Donte Greene), and a 2010 first (Greivis Vasquez) to the Grizzlies for Pau Gasol and a 2010 second (Devin Ebanks). The Lakers managed to retain their core players and went to three straight NBA Finals, winning two. Had they made the proposed trade for O’Neal, they would’ve lost two key NBA Finals contributors."}, {"4342": "(Getty Images)"}, {"a433": "The Bulls should be wary of backing themselves into a corner and losing leverage like the Pacers did, or like the Kings and Knicks have done. After Phil Jackson’s longtime confidante Charley Rosen wrote a scorching critique of Carmelo Anthony in early January, the Knicks forward and Jackson met to discuss their future. Melo took the piece as a message from Jackson himself: We want you gone. But with a deal signed through 2019 and a no-trade clause, Anthony has all the power. If he were going to be dealt, he’d dictate his destination."}, {"bc01": "There’s No Home for CarmeloDespite beef with Phil Jackson, Anthony’s no-trade clause and burned bridges means he’s staying with the Knickstheringer.com"}, {"d6aa": "Since then, a lot has happened: Jackson has sent cryptic tweets, reports have emerged that the Knicks were attempting to swap Carmelo for Kevin Love or that the Clippers were trying to add a third team to facilitate a deal. There was momentum to finally end the tenuous Melo-Knicks relationship."}, {"fc28": "The Melo-Blake-Celtics Deal That Would Make the Clippers ContendersIf the Clippers want to compete with Golden State, they need to roll the dicetheringer.com"}, {"7672": "But with just a few days until the deadline, sources around the league indicate that Melo will remain a Knick through the end of the season. There simply isn’t a workable trade for a team receiving Melo. Furthermore, over the past few weeks a couple of executives have suggested to me that they think Melo would be a negative addition to any playoff contender. One said that the Clippers would become so top-heavy that their bench units would get roasted by nearly any Western Conference opponent, while another suggested Melo’s bad habits are unbreakable, and his archaic style is unchangeable at this stage of his career."}, {"02ac": "If things don’t get better in Chicago, there will come a time when it may be forced to make a trade (like the Kings felt they had to do with Boogie). That’s when leverage is gone. There are limited viable destinations for Carmelo because his no-trade clause gives him all the power; the receiving team would need to feel confident it could re-sign him, like with Butler or George."}, {"edaf": "When it comes to trading a star, it’s important to enter the market at the right time — not so early that there’s no competition among offers, but not so late that opposing teams know you’re desperate to move your player. Think about how the Jazz played the 2011 Deron Williams trade. Williams was Utah’s franchise point guard, but was beginning to wear out his welcome in Salt Lake City. The Jazz moved in relative secrecy, pulling off the rare feat of trading a star player before a huge market develops. They dealt Williams to the Nets, and the ramifications of the deal can still be felt today. Just look at the standings."}, {"6a7f": "The Grizzlies received criticism for making the 2008 Gasol-for-Gasol trade. Pau Gasol, like Butler, had two years left on a team-friendly contract, so it appeared there was little urgency to make a trade. Adrian Wojnarowski called it “one of the NBA’s worst trades in years.” My boss, Bill Simmons, wrote that it “would have caused complete chaos in any of my fantasy leagues,” and even Grizzlies owner Michael Heisley questioned the deal. “I don’t know if I got the most value,” Heisley admitted to Yahoo Sports. “Maybe our people should’ve shopped [Pau Gasol] more and maybe we would’ve gotten more, done a better deal.”"}, {"821c": "Woj, Simmons, and Heisley weren’t wrong, but the assessment of a trade can change as time passes. The process can still be questioned to this day, but the results can’t. At the time, Grizzlies general manager Chris Wallace said Marc Gasol was “one of the best young big men in Spain” and would’ve been a high first-rounder had he come out in the 2008 draft rather than 2007. True! Wallace said recently on the NBA A to Z podcast that the deal “set the team up for the future,” giving them asset and cap flexibility to react to opportunities that could present themselves. Also true! That opportunity ended up being Zach Randolph, who they acquired for a bargain in 2009, and they later had the space to re-sign Mike Conley and Rudy Gay. The Grizzlies haven’t won a title, but by trading Gasol early rather than late, they — at least in Wallace’s eyes — maximized the return and accelerated the retooling phase."}, {"5438": "And yet all of the aforementioned approaches required top-down organizational consensus. The Kings were too late, and as it stands, the Bulls don’t have that consensus. Unless they come to an understanding soon, they’ll keep puttering along as a sub-.500 team that signs past-their-prime players like Rajon Rondo and Dwyane Wade with hopes of sneaking into the playoffs; that might be enough to keep casual fans interested and Reinsdorf satisfied, but once 2019 free agency comes, Butler could be sprinting out the door. Then what?"}], "name": "37"}