{"name": "372", "parent": "", "content": "Mind Fuck “How do those cuffs feel?” I ask. “Tight enough?” Your eager eyes look up at me. You are bursting with anticipation. I press down on your thighs and run my fingers up to your hips. The chains clank between your wrists. You can barely stay still. “Are my hands too rough?” I ask. “No, Mistress!” you reply. Your voice switching from words to sounds. I can hear your heartbeat in the still air. The rain, trailing and dripping down the windows. Candles flicker around us, making our shadows dance on the ceiling. “Turn over,” I command. You move to your hands and knees, your posture unsteady. Your hands are bound as if in prayer, your face buried in the sheets. “You’re being such a good girl,” I say. My palms caress your ass. Swat… smack! My palms sting your flesh. You’re probably thinking, If I’m being a good girl, why are you spanking me? I answer you with more slaps. “You are not being punished,” I say. “This is my way of pleasuring you.” Your body tenses. I spank you again, harder than before. Bright red, glowing handprints form on your flesh. I turn to the side and spank you again. Abruptly, I push my fingers inside you. “You’re absolutely soaked!” I smile. “Are you enjoying this?” You nod, no longer able to form words. Smack! My hand sends jolts of pain through your ass. I lean forward and kiss your hip softly. I slide my fingers inside you again, and keep them deep. I can feel your wet walls twitching. I spank you, the sudden impact making your hips rock. “Tonight, your body is not your own. Your entire being belongs to me and you will obey my every command,” I declare. You nod again. I smile. You are right where I want you. You are right where I need you. “Bend over my lap,” I say coolly; and when you move too slowly: “Do it!” You crawl over my thighs hesitantly, reluctant to make a false move. I graze my nails over your ass and swat each cheek with full force. I hear you whimper. I spank you again. Your entire body is shaking. Sweat trickles down your face. I keep spanking you until you cry out. I don’t stop. I feel your pelvis throb against my knee. I spank you again. Your pussy is twitching right over my lap. I spank you again. You can no longer raise your head. I spank you again. Your breath hitches. I stop. Your pussy is spasming, convulsing. “Mmmm… did you just come for me, my beautiful girl?” I murmur. The tone of my voice now demure and sweet. “Yes, Mistress!” you moan. “The pain was so good!” “Turn over and let me see,” I command. You lie down and spread your legs wide. I can see strings of wetness leak out as your lips stretch apart. I trail my middle finger over the crease of your pussy. There isn’t a dry spot on you. I kneel between your legs and taste your clit. Your flesh warms my tongue. The taste is delicate and arousing. I suction my lips around your protruding clit and flick my tongue gently. I purr on it. I slurp it. Then, I slide my fingers inside you. “Come for me again,” I tell you. After only a moment, your clit is rumbling between my lips, your hips jerking up and down against my face. “That’s not enough,” I say. “Again!” I lick and suck your clit firmly. The swollen hump of flesh stays erect, wanting more. I flick my fingers harder inside you, hard enough to hear each squelch. I have never seen you this wet before. I lick harder, suck softly. The ebb and flow of pressure is driving you crazy. I whirl my tongue rapidly, slow down drastically. Your legs won’t stop shaking. Your hands grip the sheets. I squeeze three fingers inside your tight cunt and suck your clit steadily. I can feel it. I can taste it. You are so close that if I stop again, I think you will burst into tears. I press my lips closed around your clit and let you grind on my face. Then, you come. You come so hard, your sounds don’t even form words. Your entire body twitches and judders until you can no longer move. I take you in my arms. “Good girl,” I say gently, stroking your face. “You are such a good girl.” Your body curls into my touch like a purring kitten. Your eyes barely open. “Thank you, Mistress.” You smile. ", "title": "Mind Fuck", "sentences": [{"8a76": "Mind Fuck"}, {"739f": "“How do those cuffs feel?” I ask. “Tight enough?”"}, {"b643": "Your eager eyes look up at me. You are bursting with anticipation. I press down on your thighs and run my fingers up to your hips. The chains clank between your wrists. You can barely stay still."}, {"899b": "“Are my hands too rough?” I ask."}, {"af2e": "“No, Mistress!” you reply. Your voice switching from words to sounds. I can hear your heartbeat in the still air. The rain, trailing and dripping down the windows. Candles flicker around us, making our shadows dance on the ceiling."}, {"49a1": "“Turn over,” I command."}, {"f845": "You move to your hands and knees, your posture unsteady. Your hands are bound as if in prayer, your face buried in the sheets."}, {"9294": "“You’re being such a good girl,” I say."}, {"be36": "My palms caress your ass. Swat… smack! My palms sting your flesh."}, {"9800": "You’re probably thinking, If I’m being a good girl, why are you spanking me? I answer you with more slaps."}, {"068e": "“You are not being punished,” I say. “This is my way of pleasuring you.”"}, {"8ab7": "Your body tenses. I spank you again, harder than before. Bright red, glowing handprints form on your flesh. I turn to the side and spank you again. Abruptly, I push my fingers inside you."}, {"f3b6": "“You’re absolutely soaked!” I smile. “Are you enjoying this?”"}, {"9dfd": "You nod, no longer able to form words."}, {"0062": "Smack! My hand sends jolts of pain through your ass. I lean forward and kiss your hip softly."}, {"b82d": "I slide my fingers inside you again, and keep them deep. I can feel your wet walls twitching. I spank you, the sudden impact making your hips rock."}, {"49e8": "“Tonight, your body is not your own. Your entire being belongs to me and you will obey my every command,” I declare."}, {"d70d": "You nod again. I smile. You are right where I want you. You are right where I need you."}, {"67a8": "“Bend over my lap,” I say coolly; and when you move too slowly: “Do it!”"}, {"c8a4": "You crawl over my thighs hesitantly, reluctant to make a false move. I graze my nails over your ass and swat each cheek with full force. I hear you whimper. I spank you again. Your entire body is shaking. Sweat trickles down your face. I keep spanking you until you cry out. I don’t stop."}, {"7116": "I feel your pelvis throb against my knee. I spank you again. Your pussy is twitching right over my lap. I spank you again. You can no longer raise your head. I spank you again. Your breath hitches. I stop. Your pussy is spasming, convulsing."}, {"8a9a": "“Mmmm… did you just come for me, my beautiful girl?” I murmur. The tone of my voice now demure and sweet."}, {"f133": "“Yes, Mistress!” you moan. “The pain was so good!”"}, {"5525": "“Turn over and let me see,” I command."}, {"c5fd": "You lie down and spread your legs wide. I can see strings of wetness leak out as your lips stretch apart. I trail my middle finger over the crease of your pussy. There isn’t a dry spot on you. I kneel between your legs and taste your clit. Your flesh warms my tongue. The taste is delicate and arousing."}, {"f24e": "I suction my lips around your protruding clit and flick my tongue gently. I purr on it. I slurp it. Then, I slide my fingers inside you."}, {"7c6e": "“Come for me again,” I tell you."}, {"0024": "After only a moment, your clit is rumbling between my lips, your hips jerking up and down against my face."}, {"cdfd": "“That’s not enough,” I say. “Again!”"}, {"f45f": "I lick and suck your clit firmly. The swollen hump of flesh stays erect, wanting more. I flick my fingers harder inside you, hard enough to hear each squelch. I have never seen you this wet before. I lick harder, suck softly. The ebb and flow of pressure is driving you crazy. I whirl my tongue rapidly, slow down drastically. Your legs won’t stop shaking. Your hands grip the sheets."}, {"155f": "I squeeze three fingers inside your tight cunt and suck your clit steadily. I can feel it. I can taste it. You are so close that if I stop again, I think you will burst into tears. I press my lips closed around your clit and let you grind on my face. Then, you come. You come so hard, your sounds don’t even form words. Your entire body twitches and judders until you can no longer move."}, {"1467": "I take you in my arms. “Good girl,” I say gently, stroking your face. “You are such a good girl.”"}, {"cc2f": "Your body curls into my touch like a purring kitten. Your eyes barely open."}, {"2044": "“Thank you, Mistress.” You smile."}], "child": "372_1\t372_2\t372_3\t372_4\t372_5\t372_6"}