{"name": "375", "parent": "", "content": "Forest It’s dark in here. The tree trunks may not be too close together, but the leaves block the faint moonlight from above. Just enough filters through the branches to make the shadows deeper, darker. More mysterious. You follow the barest hint of a path, warm in the darkness, not hurrying, relaxed. Until you hear the footsteps. Although you look back, there is nothing visible in the gloom. Whoever is behind you, they are out of sight. Suddenly the darkness is threatening, perhaps foreboding. You walk faster. And still the sounds follow you. Glancing back, now you imagine that you can see something there. Just beyond the limits of your sight in this darkness, a figure follows the path. Follows you. Pursues you. Wants you. Moving more quickly now, you curse the heels you wear. They seemed such a good idea, the final touch for the outfit, dark blouse, short black skirt. But now they slow you down and although you are not afraid yet, you are nervous. The footsteps grow closer. You look back once more, still unable to make out any more than a figure, dark even in the darkness. Turning to see the path again, a sound reaches your ears from behind you. Before you can escape, or even cry out, strong arms wrap around you, one catching your arms by your side, the other clasping a hand to your mouth. “Quiet.” I’m taller than you, bent over slightly to hold you tight. You can feel the strength in my arms, in the length of my body, held close to your back. Breathing heavily through your nose, you are aware that I even smell dark, a male, musky scent. Somehow you expected something lighter. A shudder of fear and arousal runs through you as you realise you are in the darkness, vulnerable, and this could be anyone at all holding your body… “No-one can hear you. You can’t get away. I can do anything at all I want with you.” My hand releases your mouth to wander over your body, casually, not asking permission. I cup your breast through the blouse, the bra not hiding your erect nipple from me. Lower, over your stomach, smoothing over the material of the skirt, then your thigh, down to your knee and up again. “And I think I will.” Slowly, easily, I stroke over your skin. From collarbone to the low cut blouse, partially unbuttoned to show off your gorgeous figure. Fingertips caressing you, gentle now, in contrast to the firm grip of my arm around your body, trapping your arms by your sides, hands flexing impotently. You cannot get away. You cannot move without my agreement, my permission. I undo another button, a second. Despite the warm night the air feels cool on your exposed flesh, perhaps because it was not your choice to bare it to my gaze. I cannot see your eyes. Are they tight shut, trying not to react to this stimulation, or are they wide open, seeking an escape that will not come? My hand slips under your blouse now, exploring you, the warmth of your body in the night air, the firmness of your skin, the tightness of your nipple. You gasp as my thumb rubs over the point, then around, circling you through the bra. Higher, over your skin, fingertips just slightly delving under the cup. You arch your back, struggling with me, with your body’s own reactions to my touch. You can feel me hard against you, aroused by the feel of your skin, by your response to me. Maybe by the fact that I have taken without asking? I lean over and you almost cry out as we slowly slip to the ground, my shoulder taking the gentle impact but my strength still holding you tight. You shake your shoulders as my hand moves lower again, stroking over your skirt. There is no escape, my leg wrapping around your ankle to hold you down, at the same time parting your legs slightly. And my hand moves up your leg, under the hem of the skirt, barely touching the skin of your inner thigh. Barely. You almost cry out, feeling me shake my head behind you, brushing your hair as I clearly gesture. No. Instead, you whimper, lost in denial of what is happening as my hand reaches higher to graze your heat through your underwear. You’re hot, almost enough to make me flinch in reaction, my touch firming, stroking along you through the material, as I realise that you are not just warm. You are wet. That simple fact is almost too much for me to handle. My fingers pause on you, feeling you groan against me, and then they move again, caressing you so intimately, so deliberately. Up to your mons, then down over the curls I can feel through the underwear, fingertips rubbing gently at the edge, where flesh meets cotton. Further still, feeling the tiny scrap of material, realising you are wearing a thong, so little to hide you from me. I want to see you. But I am holding you down, holding you against me, and so I must feel. My hands are my eyes, examining you, feeling every detail, from the smoothness of your skin to the growing dampness that seeps through the thong to my fingers. My hand leaves you, abruptly, and your soft cry is somewhere between relief and disappointment. My arm scoops under your knees, lifting them up and you find yourself grasped completely now, knees to your breasts, my left arm holding them there. You are completely exposed now, my right hand flipping up your skirt, and with your legs so high you are open for me. Your murmur of objection falters as you realise that, as you feel how vulnerable you are to me. I rub against you, denim against the bare skin of your bottom, rough on your soft skin. I pull back just enough to push my jeans down to mid-thigh, hearing your stifled cry as you feel my erection between your cheeks, touching the cotton thong there. I whisper in your ear as my hand returns to your thigh, sliding the thong to one side, now touching your bare, moist folds. “I’m going to enjoy this.” A finger slides between your lips, not penetrating, just making you gasp with the invasion as I touch you, your skin wet and welcoming despite your gasp of denial. “And I think you are, too…” Your gasp becomes a groan as that finger presses all the way into you, parting your labia, thumb rubbing over your clitoris, the swollen bud responding as I penetrate you for the first time. I feel you tight around me, wanting to pull away, your body betraying you as you press back against me. Rubbing against you, I slowly withdraw my finger, thumb still caressing your clit, then releasing you completely to hold me, guiding the tip of me to you, rubbing myself against you. I almost cry out myself. You’re so hot, so wet, and it’s easy to slide in just a little, back and forth, rocking myself against you. You’re not even fighting me now, wriggling to press down harder, not to escape. Your movements to get away have changed, now focused on enjoying this, but still aware with every moment, every breath, that this is my choice, my doing. Further inside, each stroke deeper, holding you tight against me, both arms around your body to pull you on to my erection, pressing myself more inside you with every movement. Your arms by your sides are struggling, but I hold you tight, feeling your hands tighten and relax, your every muscle fighting the arousal, knowing how excited you are, as I gradually penetrate you, take you… The first stroke is long, slow, deep, pressing myself into you all the way. I hold you like that against me, grinding against your entrance, feeling you groan in response, arousal and defiance, perfectly matched, perfectly balanced. That is the only slow stroke. I move fast, eager, in and out of you, almost slipping from you each time, more urgent than I had expected. You grunt as I thrust into you, matching the soft sounds that escape my lips, inches from your ear. I pull you hard onto me each time I press forward, my desperation, my real need shocking even me. It is overwhelming, the knowledge of what I have done, of what I am doing to you. I followed you, grabbed you from behind, pulled you to the ground and touched you. I did what I wanted to you, pulled your legs up and held you open, pressed into you, without asking, without foreplay, without permission. I’m fucking you, as simple as that. And not asking first makes it something else, too. It doesn’t take long. Minutes, no more, until I feel myself tighten. I do not try and hold myself back. This is not about self-restraint, about control. Quite the opposite. I feel you press back harder, sensing me swelling inside you, pressing deeper. That is too much, holding you tight, you still moving in my arms, eagerly taking me to you now, for this moment more aroused than afraid. And I come inside you, the heat overwhelming me, the world dark for a moment, then brighter than the stars can explain, heat running through my body as I thrust so deep, so hard into you… Slowly I relax, coming back to my senses, aware that you are silent, breathing hard, not trying to struggle now, though my arms have loosened around you in the aftermath of my climax. Deep inside you, I feel your heartbeat against my body. And, finally, your voice. “Are you going to let me go now?” I laugh against you, turning to a groan at the feel of slipping from you, holding you tight once more as I answer. “Only if you’ll tell me how it matched up to the fantasy…” ", "title": "Forest", "sentences": [{"76f8": "Forest"}, {"f1e5": "It’s dark in here."}, {"6823": "The tree trunks may not be too close together, but the leaves block the faint moonlight from above. Just enough filters through the branches to make the shadows deeper, darker. More mysterious. You follow the barest hint of a path, warm in the darkness, not hurrying, relaxed."}, {"1884": "Until you hear the footsteps."}, {"2137": "Although you look back, there is nothing visible in the gloom. Whoever is behind you, they are out of sight. Suddenly the darkness is threatening, perhaps foreboding. You walk faster. And still the sounds follow you."}, {"a7f4": "Glancing back, now you imagine that you can see something there. Just beyond the limits of your sight in this darkness, a figure follows the path. Follows you. Pursues you."}, {"37c0": "Wants you."}, {"eaa2": "Moving more quickly now, you curse the heels you wear. They seemed such a good idea, the final touch for the outfit, dark blouse, short black skirt. But now they slow you down and although you are not afraid yet, you are nervous."}, {"2d10": "The footsteps grow closer."}, {"9baf": "You look back once more, still unable to make out any more than a figure, dark even in the darkness. Turning to see the path again, a sound reaches your ears from behind you. Before you can escape, or even cry out, strong arms wrap around you, one catching your arms by your side, the other clasping a hand to your mouth."}, {"8024": "“Quiet.”"}, {"99b9": "I’m taller than you, bent over slightly to hold you tight. You can feel the strength in my arms, in the length of my body, held close to your back. Breathing heavily through your nose, you are aware that I even smell dark, a male, musky scent. Somehow you expected something lighter. A shudder of fear and arousal runs through you as you realise you are in the darkness, vulnerable, and this could be anyone at all holding your body…"}, {"4bbf": "“No-one can hear you. You can’t get away. I can do anything at all I want with you.” My hand releases your mouth to wander over your body, casually, not asking permission. I cup your breast through the blouse, the bra not hiding your erect nipple from me. Lower, over your stomach, smoothing over the material of the skirt, then your thigh, down to your knee and up again."}, {"e819": "“And I think I will.”"}, {"cd16": "Slowly, easily, I stroke over your skin. From collarbone to the low cut blouse, partially unbuttoned to show off your gorgeous figure. Fingertips caressing you, gentle now, in contrast to the firm grip of my arm around your body, trapping your arms by your sides, hands flexing impotently. You cannot get away. You cannot move without my agreement, my permission. I undo another button, a second. Despite the warm night the air feels cool on your exposed flesh, perhaps because it was not your choice to bare it to my gaze."}, {"78f8": "I cannot see your eyes. Are they tight shut, trying not to react to this stimulation, or are they wide open, seeking an escape that will not come?"}, {"d0d2": "My hand slips under your blouse now, exploring you, the warmth of your body in the night air, the firmness of your skin, the tightness of your nipple. You gasp as my thumb rubs over the point, then around, circling you through the bra. Higher, over your skin, fingertips just slightly delving under the cup. You arch your back, struggling with me, with your body’s own reactions to my touch."}, {"d38e": "You can feel me hard against you, aroused by the feel of your skin, by your response to me. Maybe by the fact that I have taken without asking? I lean over and you almost cry out as we slowly slip to the ground, my shoulder taking the gentle impact but my strength still holding you tight."}, {"47f2": "You shake your shoulders as my hand moves lower again, stroking over your skirt. There is no escape, my leg wrapping around your ankle to hold you down, at the same time parting your legs slightly. And my hand moves up your leg, under the hem of the skirt, barely touching the skin of your inner thigh."}, {"9901": "Barely."}, {"6480": "You almost cry out, feeling me shake my head behind you, brushing your hair as I clearly gesture. No. Instead, you whimper, lost in denial of what is happening as my hand reaches higher to graze your heat through your underwear."}, {"1ac6": "You’re hot, almost enough to make me flinch in reaction, my touch firming, stroking along you through the material, as I realise that you are not just warm."}, {"0297": "You are wet."}, {"2220": "That simple fact is almost too much for me to handle. My fingers pause on you, feeling you groan against me, and then they move again, caressing you so intimately, so deliberately. Up to your mons, then down over the curls I can feel through the underwear, fingertips rubbing gently at the edge, where flesh meets cotton. Further still, feeling the tiny scrap of material, realising you are wearing a thong, so little to hide you from me."}, {"43e7": "I want to see you."}, {"d66e": "But I am holding you down, holding you against me, and so I must feel. My hands are my eyes, examining you, feeling every detail, from the smoothness of your skin to the growing dampness that seeps through the thong to my fingers. My hand leaves you, abruptly, and your soft cry is somewhere between relief and disappointment. My arm scoops under your knees, lifting them up and you find yourself grasped completely now, knees to your breasts, my left arm holding them there."}, {"4feb": "You are completely exposed now, my right hand flipping up your skirt, and with your legs so high you are open for me. Your murmur of objection falters as you realise that, as you feel how vulnerable you are to me. I rub against you, denim against the bare skin of your bottom, rough on your soft skin. I pull back just enough to push my jeans down to mid-thigh, hearing your stifled cry as you feel my erection between your cheeks, touching the cotton thong there. I whisper in your ear as my hand returns to your thigh, sliding the thong to one side, now touching your bare, moist folds."}, {"7553": "“I’m going to enjoy this.” A finger slides between your lips, not penetrating, just making you gasp with the invasion as I touch you, your skin wet and welcoming despite your gasp of denial. “And I think you are, too…”"}, {"a028": "Your gasp becomes a groan as that finger presses all the way into you, parting your labia, thumb rubbing over your clitoris, the swollen bud responding as I penetrate you for the first time. I feel you tight around me, wanting to pull away, your body betraying you as you press back against me."}, {"a28b": "Rubbing against you, I slowly withdraw my finger, thumb still caressing your clit, then releasing you completely to hold me, guiding the tip of me to you, rubbing myself against you."}, {"06a2": "I almost cry out myself."}, {"6703": "You’re so hot, so wet, and it’s easy to slide in just a little, back and forth, rocking myself against you. You’re not even fighting me now, wriggling to press down harder, not to escape. Your movements to get away have changed, now focused on enjoying this, but still aware with every moment, every breath, that this is my choice, my doing."}, {"2d9c": "Further inside, each stroke deeper, holding you tight against me, both arms around your body to pull you on to my erection, pressing myself more inside you with every movement. Your arms by your sides are struggling, but I hold you tight, feeling your hands tighten and relax, your every muscle fighting the arousal, knowing how excited you are, as I gradually penetrate you, take you…"}, {"5aed": "The first stroke is long, slow, deep, pressing myself into you all the way. I hold you like that against me, grinding against your entrance, feeling you groan in response, arousal and defiance, perfectly matched, perfectly balanced."}, {"4fe5": "That is the only slow stroke."}, {"dc05": "I move fast, eager, in and out of you, almost slipping from you each time, more urgent than I had expected. You grunt as I thrust into you, matching the soft sounds that escape my lips, inches from your ear. I pull you hard onto me each time I press forward, my desperation, my real need shocking even me."}, {"2df9": "It is overwhelming, the knowledge of what I have done, of what I am doing to you. I followed you, grabbed you from behind, pulled you to the ground and touched you. I did what I wanted to you, pulled your legs up and held you open, pressed into you, without asking, without foreplay, without permission. I’m fucking you, as simple as that."}, {"3425": "And not asking first makes it something else, too."}, {"544b": "It doesn’t take long. Minutes, no more, until I feel myself tighten. I do not try and hold myself back. This is not about self-restraint, about control. Quite the opposite."}, {"f7b2": "I feel you press back harder, sensing me swelling inside you, pressing deeper. That is too much, holding you tight, you still moving in my arms, eagerly taking me to you now, for this moment more aroused than afraid."}, {"aa3c": "And I come inside you, the heat overwhelming me, the world dark for a moment, then brighter than the stars can explain, heat running through my body as I thrust so deep, so hard into you…"}, {"6d3d": "Slowly I relax, coming back to my senses, aware that you are silent, breathing hard, not trying to struggle now, though my arms have loosened around you in the aftermath of my climax. Deep inside you, I feel your heartbeat against my body. And, finally, your voice."}, {"4fe6": "“Are you going to let me go now?”"}, {"9930": "I laugh against you, turning to a groan at the feel of slipping from you, holding you tight once more as I answer."}, {"4acd": "“Only if you’ll tell me how it matched up to the fantasy…”"}], "child": "375_1\t375_2\t375_3"}