{"name": "379", "parent": "", "content": "Sensual Anarchy Breathe on me. Your love is cold and clothed. Your brutal indifference. I’m bringing needy back. It’s become such a curse, it’s a shame, an embarrassment to need someone. Why. We want to be needed but we don’t want to need. Vulnerability is a dirty feeling, like insecurity and failure. It’s the newest taboo. No one will admit to disappointment. No one wants their imperfections shown. What a waste. Who will step forward and say, “I need something. I need you. I am confused and helpless at times and you heal me. It’s you. It’s you that I need.” I need you. You and your no fucks given. There’s no appeal in that for me. I have lots of fucks to give. I care too much, too quickly, too fervently. Can you imagine there is such a thing as loving too much? Loving too much! I love too much! It’s a curse! It’s a shame! I am humiliated by my wanting. I don’t want your rehearsed sex, with your props and your disengaged urgency. I don’t need batteries and gadgets. Don’t swing me from ceilings. Don’t tie me up in ropes. Use your hands, use your lips, use your spit, use your imagination. Breathe on me. You and your twisted porn. Your glowing screen. Your vibrators and videos. Buy now! Cum now! No kissing! No undressing! Look away from my eyes! No needing! Self-sufficient! No strings! No Feelings! No Regrets! No fucks given! No love. You and your artificial risk of handcuffs and chains. Your fake danger in whips and wax. Pretend slavery and pretend submission. Your gags, your safe words and costumes. It’s your need for safety is what it is. You’re the one who’s scared. Hiding behind your kinks and costumes. Protected. You know what’s risky? Loving completely. You know what’s dangerous? Needing someone without guarantees. You know what’s scary? Not knowing what happens next. Will I ever be loved? You’re a coward with your practiced indifference. You’re an actor playing house, like an amusement park character assigned duties of sex and dinners. Scripted conversation. But you never stay to clean up the trash, open the rides, repair and replace the squeaky gears. You don’t know how hard it is to carry the weight. You don’t know how beautiful it is when the park is empty with the sun rising. You go home too soon. You’re a mannequin, a robot. You’ve abandoned your heart. Traded it in for security and assurance, sold it for a guarantee. You’ve got your rules and requirements. You have checklists and criteria. You have your ego and your walls. I don’t need your vacant stares; your clever texts, your discipline. I don’t need your distance. I need your reckless abandon, your over-sharing, your lust and your wanting. Talk to me. Give me sensual anarchy. Give me lawless love. Take away the restraints. I’m giving in, I’m giving up, I’m giving everything. Just your skin and mine. Undressed, touching with every inch, sweating, breathing, eyes locking, stinking like passion and wanting. Let it kill me. ", "title": "Sensual Anarchy", "sentences": [{"2f07": "Sensual Anarchy"}, {"c9b0": "Breathe on me."}, {"1702": "Your love is cold and clothed. Your brutal indifference. I’m bringing needy back. It’s become such a curse, it’s a shame, an embarrassment to need someone. Why."}, {"f283": "We want to be needed but we don’t want to need. Vulnerability is a dirty feeling, like insecurity and failure. It’s the newest taboo. No one will admit to disappointment. No one wants their imperfections shown. What a waste."}, {"4b9e": "Who will step forward and say, “I need something. I need you. I am confused and helpless at times and you heal me. It’s you. It’s you that I need.” I need you."}, {"1724": "You and your no fucks given. There’s no appeal in that for me. I have lots of fucks to give. I care too much, too quickly, too fervently. Can you imagine there is such a thing as loving too much? Loving too much! I love too much! It’s a curse! It’s a shame! I am humiliated by my wanting."}, {"c8e8": "I don’t want your rehearsed sex, with your props and your disengaged urgency. I don’t need batteries and gadgets. Don’t swing me from ceilings. Don’t tie me up in ropes. Use your hands, use your lips, use your spit, use your imagination. Breathe on me."}, {"54cc": "You and your twisted porn. Your glowing screen. Your vibrators and videos. Buy now! Cum now! No kissing! No undressing! Look away from my eyes! No needing! Self-sufficient! No strings! No Feelings! No Regrets! No fucks given! No love."}, {"b5d9": "You and your artificial risk of handcuffs and chains. Your fake danger in whips and wax. Pretend slavery and pretend submission. Your gags, your safe words and costumes. It’s your need for safety is what it is. You’re the one who’s scared. Hiding behind your kinks and costumes. Protected."}, {"1830": "You know what’s risky? Loving completely. You know what’s dangerous? Needing someone without guarantees. You know what’s scary? Not knowing what happens next. Will I ever be loved?"}, {"9017": "You’re a coward with your practiced indifference. You’re an actor playing house, like an amusement park character assigned duties of sex and dinners. Scripted conversation. But you never stay to clean up the trash, open the rides, repair and replace the squeaky gears. You don’t know how hard it is to carry the weight. You don’t know how beautiful it is when the park is empty with the sun rising. You go home too soon."}, {"0620": "You’re a mannequin, a robot. You’ve abandoned your heart. Traded it in for security and assurance, sold it for a guarantee. You’ve got your rules and requirements. You have checklists and criteria. You have your ego and your walls."}, {"9f5e": "I don’t need your vacant stares; your clever texts, your discipline. I don’t need your distance. I need your reckless abandon, your over-sharing, your lust and your wanting. Talk to me."}, {"012a": "Give me sensual anarchy. Give me lawless love. Take away the restraints. I’m giving in, I’m giving up, I’m giving everything. Just your skin and mine. Undressed, touching with every inch, sweating, breathing, eyes locking, stinking like passion and wanting. Let it kill me."}], "child": "379_1\t379_2\t379_3\t379_4\t379_5\t379_6\t379_7\t379_8"}