{"name": "381", "parent": "", "content": "WORDPLAY with FOREPLAY for ROLE PLAYING…. The R-Rated Version Image source: Fierce Force The Roles Her- A MILF, mid 40's. Anglo. Long blonde hair. A Senior Sales Director who crushes her territory and is the envy of every competitor. Him- A competitor. Latino with beautiful brown skin as hairless and soft as a baby’s bottom. Mid 30's. And would be the envy of every other competitor, if they only knew. She owns the house. He has flown in to visit her for 48 hours before heading out into the field for work. His Uber arrives and she has left the door unlocked for him, instructing him to follow the path of candles to where she awaits in her dimly lit room. She is lying back on the bed. Black lacy garter, corset, thigh highs, and stilettos. She is the fucking queen of her domain. Oops!!!! Oh fuck. Sorry, this isn’t a role play at all. It’s the real deal! And…. It’s fucking hott AF right? Because, she is sleeping with the Enemy. So, let’s just continue shall we? I’m sure Rose MyErotica will give her blessing. Ok, so he had texted her when he left the airport, and she had made sure she was fresh and ready for him and was eagerly waiting. Three times that day she had taken her trusty silver bullet to her hungry clit and teased herself to just before the edge. But then she cut herself off. On purpose. She is so ready for her man. God he is such a man, with the stamina of a really young man. Who knows to please a woman like a really mature man. With the excitement to do it like a teenager. Usually she would get wet when they first kissed. This time though, mariposa juice was fluttering out of her just from the anticipation! This man, yup the one you know and love, the famous Latino Lover, the one that gets to fuck the famous Fierce Force💃. Those arms! Those eyes! Those lips! His passion. Sigh. He tiptoes into the house, he enters the bedroom, he doesn’t say a word. Jeans, black shirt. Cologne only a Latino can get away with. He removes his shirt to reveal an undershirt tank. The kind only a Latino can get away with. His dick hardens with the whiff of her perfume as he dives right in. To her mariposa (as he rips off her panties with one hard tug) with his warm tongue. She is turned on by the direction he heads. No hello kiss. No hug. Just straight on full on bonita mariposa eating — that would mean pussy eating to those of you who have not adopted my official name change yet (see attached). Is anyone else getting turned on reading this? I’m getting turned on writing it! Oh god yes!!! Flickers, swirls, and the wetness keeps on coming. This MILF could fill up a lake. His face is soaked. He loves it. It doesn’t take long because she is so damn ready and he is just that good. Her orgasm is strong AF. After that deliciousness, he comes up for air. This cutie says hi to her, and he kisses her with everything he has. She tastes herself on his mouth. Which makes her convulse even more. He whispers in Spanish how good she tastes. He tells her how much he loves how wet she gets. He whispers that she looks gorgeous in her outfit. Holy shit he knows everything about her. How to touch her, how to feel her, how to love her, how to get to her. Damn. Total Drunk in Love Story. So, what’s next? Well here’s the thing… the Latino Lover? Este hombre no sabe lo que es un ‘quickie.’ He has never understood a ‘quickie.’ Like the man has never taken less then 45 minutes to come in his life! What can I say? The man likes sex and is only 33 and has never been responsible for anyone but himself. As in, diapers never got in the way. If he were your husband, and you were a working exhausted mother who was having sex more out of feeling obligated in the spirit of trying to have a functional marriage on top of all this? He would be your worst nightmare. However, if you were feeling desired and wanted AF and divorced with no responsibility for a weekend and your kids were at your ex’s??? Well then, live vicariously through me. That is all. In the meantime, I’m too turned on to keep writing, especially for 45 minutes. It’s time to go over the edge. This woman needs to go find the silver bullet stat. #blueballs Stay Fierce! 💃. Happy Spring! I’m not sure how we went from a one lined poem prompt on Spring to this, but it happened quickly and organically. Sorry Dry Monkey Philosophy and Indira I got so distracted I forgot about the food! So I’m so glad Indira you delivered quite nicely! ❤ Here it is for everyone to enjoy as well as some background leading up to this short story. Soon to be non-fiction😜 Dark Chocolate IcecreamOn a hot summer eveningSweating in 90% humidityWe walk on the beachStopping sometimes to coolOverheated bodies with a dipOf our feet…medium.com SPRING IS WET!!!!!!Inspiration is Abundant !!!!!medium.com Attention Attention! The Official Announcement!An Ode to the Pussy.bullshit.ist ", "title": "WORDPLAY with FOREPLAY for ROLE PLAYING….", "sentences": [{"2737": "WORDPLAY with FOREPLAY for ROLE PLAYING…."}, {"896f": "The R-Rated Version"}, {"8185": "Image source: Fierce Force"}, {"7480": "The Roles"}, {"1ff3": "Her- A MILF, mid 40's. Anglo. Long blonde hair. A Senior Sales Director who crushes her territory and is the envy of every competitor."}, {"a527": "Him- A competitor. Latino with beautiful brown skin as hairless and soft as a baby’s bottom. Mid 30's. And would be the envy of every other competitor, if they only knew."}, {"5bc0": "She owns the house. He has flown in to visit her for 48 hours before heading out into the field for work."}, {"70c7": "His Uber arrives and she has left the door unlocked for him, instructing him to follow the path of candles to where she awaits in her dimly lit room. She is lying back on the bed. Black lacy garter, corset, thigh highs, and stilettos. She is the fucking queen of her domain."}, {"62e9": "Oops!!!! Oh fuck. Sorry, this isn’t a role play at all. It’s the real deal! And…. It’s fucking hott AF right? Because, she is sleeping with the Enemy. So, let’s just continue shall we? I’m sure Rose MyErotica will give her blessing."}, {"c04f": "Ok, so he had texted her when he left the airport, and she had made sure she was fresh and ready for him and was eagerly waiting. Three times that day she had taken her trusty silver bullet to her hungry clit and teased herself to just before the edge. But then she cut herself off. On purpose. She is so ready for her man. God he is such a man, with the stamina of a really young man. Who knows to please a woman like a really mature man. With the excitement to do it like a teenager. Usually she would get wet when they first kissed. This time though, mariposa juice was fluttering out of her just from the anticipation!"}, {"8a82": "This man, yup the one you know and love, the famous Latino Lover, the one that gets to fuck the famous Fierce Force💃. Those arms! Those eyes! Those lips! His passion. Sigh."}, {"75b9": "He tiptoes into the house, he enters the bedroom, he doesn’t say a word. Jeans, black shirt. Cologne only a Latino can get away with. He removes his shirt to reveal an undershirt tank. The kind only a Latino can get away with. His dick hardens with the whiff of her perfume as he dives right in. To her mariposa (as he rips off her panties with one hard tug) with his warm tongue. She is turned on by the direction he heads. No hello kiss. No hug. Just straight on full on bonita mariposa eating — that would mean pussy eating to those of you who have not adopted my official name change yet (see attached). Is anyone else getting turned on reading this? I’m getting turned on writing it!"}, {"3666": "Oh god yes!!! Flickers, swirls, and the wetness keeps on coming. This MILF could fill up a lake. His face is soaked. He loves it. It doesn’t take long because she is so damn ready and he is just that good. Her orgasm is strong AF."}, {"e705": "After that deliciousness, he comes up for air. This cutie says hi to her, and he kisses her with everything he has. She tastes herself on his mouth. Which makes her convulse even more. He whispers in Spanish how good she tastes. He tells her how much he loves how wet she gets. He whispers that she looks gorgeous in her outfit. Holy shit he knows everything about her. How to touch her, how to feel her, how to love her, how to get to her. Damn. Total Drunk in Love Story."}, {"6fac": "So, what’s next? Well here’s the thing… the Latino Lover? Este hombre no sabe lo que es un ‘quickie.’ He has never understood a ‘quickie.’ Like the man has never taken less then 45 minutes to come in his life! What can I say? The man likes sex and is only 33 and has never been responsible for anyone but himself. As in, diapers never got in the way. If he were your husband, and you were a working exhausted mother who was having sex more out of feeling obligated in the spirit of trying to have a functional marriage on top of all this? He would be your worst nightmare. However, if you were feeling desired and wanted AF and divorced with no responsibility for a weekend and your kids were at your ex’s??? Well then, live vicariously through me. That is all."}, {"ac4a": "In the meantime, I’m too turned on to keep writing, especially for 45 minutes. It’s time to go over the edge. This woman needs to go find the silver bullet stat."}, {"ad0a": "#blueballs"}, {"9aa0": "Stay Fierce! 💃. Happy Spring!"}, {"7699": "I’m not sure how we went from a one lined poem prompt on Spring to this, but it happened quickly and organically."}, {"70fb": "Sorry Dry Monkey Philosophy and Indira I got so distracted I forgot about the food! So I’m so glad Indira you delivered quite nicely! ❤ Here it is for everyone to enjoy as well as some background leading up to this short story. Soon to be non-fiction😜"}, {"3200": "Dark Chocolate IcecreamOn a hot summer eveningSweating in 90% humidityWe walk on the beachStopping sometimes to coolOverheated bodies with a dipOf our feet…medium.com"}, {"de1a": "SPRING IS WET!!!!!!Inspiration is Abundant !!!!!medium.com"}, {"c9f1": "Attention Attention! The Official Announcement!An Ode to the Pussy.bullshit.ist"}], "child": "381_1\t381_2\t381_3381_1\t381_2\t381_3"}