{"name": "382", "parent": "", "content": "Unitarian Universalism is Hella White So much on my heart today. I have not been a Unitarian Universalist for long, though I have been aware of it and even influenced by it since my early teens when I was in the midst of a very evangelical fundamentalist upbringing. I have a long and convoluted story that is me and religion (story that I wrote quite a few years ago now is here — but doesn’t include the early years of “my uncle the cult leader” — that deserves its own book). I cut ties with Christianity some time ago and while I did sporadically attend church in hopes of building community I ultimately walked away, disheartened and discouraged, and as I continue to unravel and deconstruct, I am aware that spiritual abuse was a part of it as well. Throughout most of my 20s, I dedicated my life to motherhood, and built community largely as a lone agent, both online and in real life that was centered around the experience of parenting, but also focused on volunteerism and social justice. As many of you know, a little over a year ago I applied for and got a job at a UU church. I researched both the congregation and UUism before going in for my interview, both to have more knowledge and to ascertain whether it was going to be a good fit for me with my, well, radical tendencies. I read the 7 principles and thought, “Yeah! This is my place and these are my people.” I mean, inherent worth and dignity of all, justice and equity, acceptance, respect — who wouldn’t be down with all that?? Let me be clear: I still believe that I have found my people. Let me also be clear: I wasn’t fully aware of what I was getting into. As a mestiza (mixed) woman I am in the minority both on staff (cough, cough — the only one) and in the congregation (not the only one — but one of few). Some of the dynamics that have led to my current spiritual and emotional drain simply have to do with being on staff. It is difficult sometimes to work FOR the people and feel that one is also WITH the people. I know it is a common issue for staff members to feel that their spiritual needs are not always met within their congregations. However, some of the dynamics that have drained me are centered around race, white privilege, the ability of so many to be blissfully unaware of said privilege, and feeling that I am invited to show up as my whole intellectual self, but not necessarily as my whole Chingona self. I have spent my entire life feeling that I don’t belong. I am perceived as too brown and too poor in white spaces and too white and too rich in brown ones. People are confused by what my older brother has termed our “ethnic ambiguity” and it has led to feelings of otherness and ostracization, not to mention constant microaggressions as people attempt to find the right category for me and my siblings. (Tangent — for the love of all that is holy STOP asking people “What are you?” A human. That’s the answer.) I want to acknowledge that part of my current drain is also in “doing the work.” Our staff and some members of our congregation are currently engaged in the Beloved Conversations program, which overall is going to be very beneficial in our quest for racial justice, but which is fraught for all involved and especially for participants of color. I have been questioning some aspects of the program as they have led to me feeling deep pain and like that pain is on display. Yet I say that with the full knowledge that witnessing my pain is an experience for others to have empathy and increased understanding for a reality that is very different from their own. Perhaps there needs to be a process to give people more of an idea to what they are saying yes to, but I digress. As noted in the title above, when I started in this position I quickly realized that I was once again, as I have been throughout my life, in the position of navigating really white space. Please know — I am white. I have white privilege. I have a white mom and a light-skinned Chicano dad. I have the ability to “pass” if I so desire, but there is deep pain that my ability to do so stems not just from my genetic makeup but also mis abuelos’ assimilation to white culture, which was born out of the will to survive within white supremacy. There are very real and very deep emotional and spiritual repercussions to assimilation, in trading one’s identity and true reality in order to gain a false sense of belonging. All this to say… Things are happening in our faith, and many are hurting. If you are a Unitarian Universalist, regardless of what identities you hold, but especially if you are white, I need something from you: I need you to speak up, and I need you to listen. Whether it’s letting the people of color in your congregations know that you support them and you want to know more about their current reality within this faith and your particular congregation, or even things as simple as hitting “like” or commenting on social media posts regarding this issue instead of scrolling past. Silence is deafening. Also, and I realize this is a tough one, it’s letting your friends and congregants of color know that you love and support them even if they choose to leave the faith. Many already have and many still will. It is really difficult to navigate this very white space and constantly hold out hope that it will be transformed to the point where we truly feel that we belong here. I wouldn’t have even entertained the idea of applying for this job if I didn’t know that Unitarian Universalists tend to be good people and tend to be on the right side of history. What radical things do we need to do in order to be fully living our stated values and to be on the right side of NOW? We are leading the way right now. Let’s show the world what racial justice looks like. En la comunidad amada, Beth Leyba Congregational Connection Coordinator, Jefferson Unitarian Church ", "title": "Unitarian Universalism is Hella White", "sentences": [{"926e": "Unitarian Universalism is Hella White"}, {"f74e": "So much on my heart today. I have not been a Unitarian Universalist for long, though I have been aware of it and even influenced by it since my early teens when I was in the midst of a very evangelical fundamentalist upbringing."}, {"af9b": "I have a long and convoluted story that is me and religion (story that I wrote quite a few years ago now is here — but doesn’t include the early years of “my uncle the cult leader” — that deserves its own book). I cut ties with Christianity some time ago and while I did sporadically attend church in hopes of building community I ultimately walked away, disheartened and discouraged, and as I continue to unravel and deconstruct, I am aware that spiritual abuse was a part of it as well."}, {"2c45": "Throughout most of my 20s, I dedicated my life to motherhood, and built community largely as a lone agent, both online and in real life that was centered around the experience of parenting, but also focused on volunteerism and social justice."}, {"8142": "As many of you know, a little over a year ago I applied for and got a job at a UU church. I researched both the congregation and UUism before going in for my interview, both to have more knowledge and to ascertain whether it was going to be a good fit for me with my, well, radical tendencies. I read the 7 principles and thought, “Yeah! This is my place and these are my people.”"}, {"f2ac": "I mean, inherent worth and dignity of all, justice and equity, acceptance, respect — who wouldn’t be down with all that??"}, {"2090": "Let me be clear: I still believe that I have found my people. Let me also be clear: I wasn’t fully aware of what I was getting into. As a mestiza (mixed) woman I am in the minority both on staff (cough, cough — the only one) and in the congregation (not the only one — but one of few)."}, {"20db": "Some of the dynamics that have led to my current spiritual and emotional drain simply have to do with being on staff. It is difficult sometimes to work FOR the people and feel that one is also WITH the people. I know it is a common issue for staff members to feel that their spiritual needs are not always met within their congregations. However, some of the dynamics that have drained me are centered around race, white privilege, the ability of so many to be blissfully unaware of said privilege, and feeling that I am invited to show up as my whole intellectual self, but not necessarily as my whole Chingona self."}, {"1d1c": "I have spent my entire life feeling that I don’t belong. I am perceived as too brown and too poor in white spaces and too white and too rich in brown ones. People are confused by what my older brother has termed our “ethnic ambiguity” and it has led to feelings of otherness and ostracization, not to mention constant microaggressions as people attempt to find the right category for me and my siblings."}, {"f145": "(Tangent — for the love of all that is holy STOP asking people “What are you?” A human. That’s the answer.)"}, {"80fa": "I want to acknowledge that part of my current drain is also in “doing the work.” Our staff and some members of our congregation are currently engaged in the Beloved Conversations program, which overall is going to be very beneficial in our quest for racial justice, but which is fraught for all involved and especially for participants of color. I have been questioning some aspects of the program as they have led to me feeling deep pain and like that pain is on display. Yet I say that with the full knowledge that witnessing my pain is an experience for others to have empathy and increased understanding for a reality that is very different from their own. Perhaps there needs to be a process to give people more of an idea to what they are saying yes to, but I digress."}, {"503b": "As noted in the title above, when I started in this position I quickly realized that I was once again, as I have been throughout my life, in the position of navigating really white space. Please know — I am white. I have white privilege. I have a white mom and a light-skinned Chicano dad. I have the ability to “pass” if I so desire, but there is deep pain that my ability to do so stems not just from my genetic makeup but also mis abuelos’ assimilation to white culture, which was born out of the will to survive within white supremacy. There are very real and very deep emotional and spiritual repercussions to assimilation, in trading one’s identity and true reality in order to gain a false sense of belonging."}, {"8b1d": "All this to say…"}, {"4a66": "Things are happening in our faith, and many are hurting. If you are a Unitarian Universalist, regardless of what identities you hold, but especially if you are white, I need something from you: I need you to speak up, and I need you to listen. Whether it’s letting the people of color in your congregations know that you support them and you want to know more about their current reality within this faith and your particular congregation, or even things as simple as hitting “like” or commenting on social media posts regarding this issue instead of scrolling past. Silence is deafening."}, {"db47": "Also, and I realize this is a tough one, it’s letting your friends and congregants of color know that you love and support them even if they choose to leave the faith. Many already have and many still will. It is really difficult to navigate this very white space and constantly hold out hope that it will be transformed to the point where we truly feel that we belong here."}, {"e2cc": "I wouldn’t have even entertained the idea of applying for this job if I didn’t know that Unitarian Universalists tend to be good people and tend to be on the right side of history. What radical things do we need to do in order to be fully living our stated values and to be on the right side of NOW?"}, {"88fd": "We are leading the way right now. Let’s show the world what racial justice looks like."}, {"dd6c": "En la comunidad amada,"}, {"4002": "Beth Leyba"}, {"ae68": "Congregational Connection Coordinator, Jefferson Unitarian Church"}], "child": "382_1\t382_2\t382_3"}