{"name": "383", "parent": "", "content": "El despertar Un espacio dedicado al movimiento startup, la tecnología y la innovación en español. Internet es global. Son pocos los rincones del mundo en donde no se sabe de la existencia de esta tecnología que cambia todas y cada una de las industrias conocidas. Estas evoluciones, en muchos casos auténticas revoluciones, tienen un motor de cambio, las startups. Google, Facebook, Apple, Twitter, Amazon o Microsoft, por citar las más populares, nacieron como tales. No eran más que un sueño en la mente de jóvenes entusiastas. Hoy son gigantes que suman miles de millones de usuarios y tienen impacto mundial. El mundo hispano comienza a asomarse a esa revolución, con descaro, ingenio, con ambición pero también con escaso eco tanto en los medios como en una sociedad interconectada, fascinada por los avances, que no repara en algunos de los héroes que tienen a su alrededor. Muchos emprenden en sus países de origen, otros en Silicon Valley, en la Costa Este, o en los diferentes centros tanto en España como en toda América Latina. América Latina tiene a su favor muchos factores, tanto demográficos como económicos. Según el último estudio presentado durante Latino Mobile Summit, el número de conexiones móviles en América Latina se duplicará de aquí a 2020. Se augura un mercado potencial de más de 400 millones de consumidores ávidos de contenido y servicios en español. Pero hay un factor, por encima de todo, que hace posible el avance, la convicción de que, al contrario de lo que sucede en gran parte del mundo desarrollado, los hijos van a vivir mejor que la generación de sus padres. El optimismo, el ánimo a cooperar y buscar el bien común definen la región. Silicon Valley sigue siendo el sueño, la aspiración, pero ya no es necesario pasar por la Meca de la tecnología para hacer crecer y prosperar una startup, una empresa de reciente creación, gran crecimiento y que soluciona un problema. Una startup no es una pyme, pero tampoco es autoempleo, es una nueva categoría de emprendimiento nacida al calor de la última ola de Internet. Chile tiene uno de los programas más establecidos y sólidos, con varias historias de éxito y el orgullo de haber inoculado el virus emprendedor. Paraguay quiere replicar este modelo con Paralell18. Uruguay se ha convertido en un vivero de software en el que no se tiene miedo a vender en el exterior. Argentina, con su Palermo Valley, es cuna de varias olas de nuevos gigantes latinos. Desde Mercado Libre, Globant, OLX a Patagon. El fenómeno Preguntados es un síntoma más de su buena salud. México, con Guadalajara como su Silicon Valley, y un vivero incipiente en la capital azteca, atesora un interesante futuro. No solo por lo diferente de sus propuestas o por la férrea relación de la Bahía de San Francisco con Jalisco desde hace más de 30 años, sino también por el interés que despiertan entre los inversores de capital privado. En Colombia el panorama es prometedor. El país asume un momento histórico, el proceso de paz, con retos de cohesión, formación y nueva infraestructura. Un cambio en la columna vertebral del país que ha dado gran relevancia a ła tecnología. El ministro de Tecnologías de la Información y Telecomunicación, en una reciente entrevista, destacaba tres joyas de la corona: Platzi, Rappi y 1Doc3 al frente, pero no son las únicas. En Estados Unidos, Google empuja a los emprendedores con el mismo ahínco con que impulsa sus propios productos. A través de Launchpad, su incubadora, mima y forma a los potenciales revolucionarios del futuro. En la última hornada hubo una clara apuesta por América Latina. Tras el cambio en la Casa Blanca el mundo latino ha comenzado a tomar conciencia de sí mismo, a mostrar su valía y decidirse a conquistar espacios. España tiene también un largo historial de éxitos: Panoramio, Idealista, Fever, Tuenti… por solo citar algunos casos. Estos ejemplos han servido para que Valencia tenga su propio hub, Barcelona con el distrito @22, con Numa, con innumerables firmas internacionales que deciden poner ahí su centro de desarrollo y crean un ambiente proclive a emprender a su alrededor. Sin dejar de lado el gran impacto del Mobile World Congress. En Madrid, la apertura del Google Campus ha corroborado y puesto cierto orden en lo que ya se palpaba en el ambiente, que cada vez es más atractivo perseguir los sueños y es posible conseguirlos. En Silicio queremos contar estos cambios, destacar las oportunidades, ir de la mano de la tecnología y el progreso, pero sin olvidar quiénes son los que están detrás de ideas, su lucha y sus historias de superación. Soy Silicio Hecho con cariño y esmero en San Francisco ", "title": "El despertar", "sentences": [{"2d48": "El despertar"}, {"3fef": "Un espacio dedicado al movimiento startup, la tecnología y la innovación en español. Internet es global. Son pocos los rincones del mundo en donde no se sabe de la existencia de esta tecnología que cambia todas y cada una de las industrias conocidas. Estas evoluciones, en muchos casos auténticas revoluciones, tienen un motor de cambio, las startups. Google, Facebook, Apple, Twitter, Amazon o Microsoft, por citar las más populares, nacieron como tales. No eran más que un sueño en la mente de jóvenes entusiastas. Hoy son gigantes que suman miles de millones de usuarios y tienen impacto mundial."}, {"8dca": "El mundo hispano comienza a asomarse a esa revolución, con descaro, ingenio, con ambición pero también con escaso eco tanto en los medios como en una sociedad interconectada, fascinada por los avances, que no repara en algunos de los héroes que tienen a su alrededor. Muchos emprenden en sus países de origen, otros en Silicon Valley, en la Costa Este, o en los diferentes centros tanto en España como en toda América Latina."}, {"8476": "América Latina tiene a su favor muchos factores, tanto demográficos como económicos. Según el último estudio presentado durante Latino Mobile Summit, el número de conexiones móviles en América Latina se duplicará de aquí a 2020. Se augura un mercado potencial de más de 400 millones de consumidores ávidos de contenido y servicios en español."}, {"8acd": "Pero hay un factor, por encima de todo, que hace posible el avance, la convicción de que, al contrario de lo que sucede en gran parte del mundo desarrollado, los hijos van a vivir mejor que la generación de sus padres. El optimismo, el ánimo a cooperar y buscar el bien común definen la región."}, {"fed3": "Silicon Valley sigue siendo el sueño, la aspiración, pero ya no es necesario pasar por la Meca de la tecnología para hacer crecer y prosperar una startup, una empresa de reciente creación, gran crecimiento y que soluciona un problema. Una startup no es una pyme, pero tampoco es autoempleo, es una nueva categoría de emprendimiento nacida al calor de la última ola de Internet."}, {"23c2": "Chile tiene uno de los programas más establecidos y sólidos, con varias historias de éxito y el orgullo de haber inoculado el virus emprendedor. Paraguay quiere replicar este modelo con Paralell18. Uruguay se ha convertido en un vivero de software en el que no se tiene miedo a vender en el exterior."}, {"a7a0": "Argentina, con su Palermo Valley, es cuna de varias olas de nuevos gigantes latinos. Desde Mercado Libre, Globant, OLX a Patagon. El fenómeno Preguntados es un síntoma más de su buena salud."}, {"ff15": "México, con Guadalajara como su Silicon Valley, y un vivero incipiente en la capital azteca, atesora un interesante futuro. No solo por lo diferente de sus propuestas o por la férrea relación de la Bahía de San Francisco con Jalisco desde hace más de 30 años, sino también por el interés que despiertan entre los inversores de capital privado."}, {"3bc1": "En Colombia el panorama es prometedor. El país asume un momento histórico, el proceso de paz, con retos de cohesión, formación y nueva infraestructura. Un cambio en la columna vertebral del país que ha dado gran relevancia a ła tecnología. El ministro de Tecnologías de la Información y Telecomunicación, en una reciente entrevista, destacaba tres joyas de la corona: Platzi, Rappi y 1Doc3 al frente, pero no son las únicas."}, {"b93a": "En Estados Unidos, Google empuja a los emprendedores con el mismo ahínco con que impulsa sus propios productos. A través de Launchpad, su incubadora, mima y forma a los potenciales revolucionarios del futuro. En la última hornada hubo una clara apuesta por América Latina. Tras el cambio en la Casa Blanca el mundo latino ha comenzado a tomar conciencia de sí mismo, a mostrar su valía y decidirse a conquistar espacios."}, {"eb02": "España tiene también un largo historial de éxitos: Panoramio, Idealista, Fever, Tuenti… por solo citar algunos casos. Estos ejemplos han servido para que Valencia tenga su propio hub, Barcelona con el distrito @22, con Numa, con innumerables firmas internacionales que deciden poner ahí su centro de desarrollo y crean un ambiente proclive a emprender a su alrededor. Sin dejar de lado el gran impacto del Mobile World Congress. En Madrid, la apertura del Google Campus ha corroborado y puesto cierto orden en lo que ya se palpaba en el ambiente, que cada vez es más atractivo perseguir los sueños y es posible conseguirlos."}, {"bf86": "En Silicio queremos contar estos cambios, destacar las oportunidades, ir de la mano de la tecnología y el progreso, pero sin olvidar quiénes son los que están detrás de ideas, su lucha y sus historias de superación."}, {"2e72": "Soy Silicio"}, {"fd82": "Hecho con cariño y esmero en San Francisco"}], "child": "383_1\t383_2"}