{"name": "390", "parent": "", "content": "In a country with more than 38 million Spanish speakers, the main liberal newspaper (NYT) publishes badly translated news I am not a native English speaker, but I’ve published my fair share of articles and books. I’ve also lived in the U.S. for roughly 13 years, so I am familiar with the local reputation of the New York Times. In the U.S. East Coast, the New York Times is considered a beacon of the English language. Articles in the English edition of the New York Times are well structured, and beautifully written. Writers dream about publishing in the New York Times. But for their Spanish edition, they think a probably lightly edited algorithmic translation of some of their English content is good enough. If you speak Spanish, please try to read the screenshots below. If you are a writer, you probably felt a desperate need to rearrange words. The reason is because these articles were not written in Spanish. They were written in English, and most likely, translated by an algorithm and then lightly edited. Clearly, the New York Times does not care about Spanish speakers too much, even though they are located in the fifth largest Spanish speaking country in the world (after Mexico, Colombia, Spain, and Argentina). Of course, it is disappointing to see that a newspaper that is so proud of its use of English, and also, a newspaper that portrays itself as a bastion of liberalism, shows such disregard for the Spanish speakers of the United States and the world. Do they really think that what Spanish speakers need is bad translations of their English content? Do they think that Spanish speakers are so desperate for content, or so bad at their own language, or so bad at articulating ideas, that their bad translations can compete with newspapers that hire humans who speak Spanish? Do they think that these bad translations are the best way to create a bridge with the largest alienated community of the United States? I would not dare submit to the New York times an article I wrote in Spanish and translated into English using an algorithm, and then edited lightly. Why would the New York Times accept that these articles reach their readers? Do they care about the proper use of language? Or just the proper use of the English language? The New York Times should apologize for this practice. If they need help with the Spanish, I or the more than 30 million Spanish speakers in this country, can help copy-edit. ", "title": "In a country with more than 38 million Spanish speakers, the main liberal newspaper (NYT) publishes badly translated news", "sentences": [{"06a4": "In a country with more than 38 million Spanish speakers, the main liberal newspaper (NYT) publishes badly translated news"}, {"27d3": "I am not a native English speaker, but I’ve published my fair share of articles and books. I’ve also lived in the U.S. for roughly 13 years, so I am familiar with the local reputation of the New York Times. In the U.S. East Coast, the New York Times is considered a beacon of the English language. Articles in the English edition of the New York Times are well structured, and beautifully written. Writers dream about publishing in the New York Times. But for their Spanish edition, they think a probably lightly edited algorithmic translation of some of their English content is good enough."}, {"2ee9": "If you speak Spanish, please try to read the screenshots below. If you are a writer, you probably felt a desperate need to rearrange words."}, {"1c39": "The reason is because these articles were not written in Spanish. They were written in English, and most likely, translated by an algorithm and then lightly edited. Clearly, the New York Times does not care about Spanish speakers too much, even though they are located in the fifth largest Spanish speaking country in the world (after Mexico, Colombia, Spain, and Argentina)."}, {"35ba": "Of course, it is disappointing to see that a newspaper that is so proud of its use of English, and also, a newspaper that portrays itself as a bastion of liberalism, shows such disregard for the Spanish speakers of the United States and the world. Do they really think that what Spanish speakers need is bad translations of their English content? Do they think that Spanish speakers are so desperate for content, or so bad at their own language, or so bad at articulating ideas, that their bad translations can compete with newspapers that hire humans who speak Spanish? Do they think that these bad translations are the best way to create a bridge with the largest alienated community of the United States?"}, {"987e": "I would not dare submit to the New York times an article I wrote in Spanish and translated into English using an algorithm, and then edited lightly. Why would the New York Times accept that these articles reach their readers? Do they care about the proper use of language? Or just the proper use of the English language?"}, {"c806": "The New York Times should apologize for this practice. If they need help with the Spanish, I or the more than 30 million Spanish speakers in this country, can help copy-edit."}], "child": "390_1\t390_2\t390_3\t390_4"}