{"name": "392", "parent": "", "content": "Teachers Going Gradeless Toward a Future of Growth Not Grades After years of teaching using the principles of standards-based learning and grading, I encountered two findings that radically changed my perspective on assessment, grading, and reporting. The first finding comes from Ruth Butler (1988, as cited in Wiliam 2011) regarding feedback. Butler examined 3 types of feedback: scores alone, comments alone, and scores with comments. Her study showed that scores alone made students either complacent or unmotivated depending on how well they did. Scores with comments were just as ineffective in that students focused entirely on the score and ignored the comments. Surprisingly, it was the students who received comments alone that demonstrated the most improvement. The second finding comes from John Hattie (2012) whose synthesis of 800 meta-studies showed that student self-assessment/self-grading topped the list of educational interventions with the highest effect size. By teaching students how to accurately self-assess based on clear criteria, teachers empower them to become “self-regulated learners” able to monitor, regulate, and guide their own learning. The reason students never develop these traits is that our monopoly on assessment, feedback, and grading has trained students to adopt an attitude of total passivity in the learning process. In encountering these ideas, I realized that my assessment practices were bogged down by an overemphasis on scores and my total domination of assessment and grading. This year, I changed my approach, using feedback and revisions only, without entering a letter grade until the end of each term. At that point, I allow students an opportunity to evaluate their overall performance using statements from my Descriptive Grading Criteria (adapted from Ken O’Connor’s 15 Fixes for Broken Grades). Upon completing this process, they sign up to conference with me personally, or complete a linked letter or video explaining the grade they believe they deserve. It’s been quite a journey. Along the way, I’ve encountered many wise guides and intrepid travelers, people like Joy Kirr, Starr Sackstein, Aric Foster, Sarah J. Donovan, Peter Anderson, Professor Jennifer Hurley, Jen Doucette, and Aaron Blackwelder. Each of these educators has developed their own unique approach, fostering communities built around growth, trust, and mutuality. As a way of supporting others on this same journey, Aaron Blackwelder and I recently set up the Teachers Going Gradeless Facebook group and intend to start hosting a regular Twitter chat. With this name, we hope to express the idea of a spectrum, a continuum, a process, a journey. For some of us, the word gradeless means to grade less, that is, limiting the impact of grades within the context of current constraints. Some are just trying to get away from toxic assessment and grading practices, like assessments with no opportunity to redo or retake or zeroes on the mathematically disproportionate 100-point scale. For others, gradeless means without grades, that is, avoiding the damaging and demotivating effects of grades entirely. These teachers are trying to put the focus squarely on learning, eliminating grades in favor of feedback and growth. Some may even work in schools that have replaced traditional report cards altogether, using portfolios or descriptive evaluations instead. I experienced the latter at University of Michigan’s Residential College back in the 90’s. (If you’ve got an hour or two, I can show you my report card!) Update: @UmichRC replied to my tweet. They’ve started giving grades now. Drawing on the research of Ruth Butler, Dylan Wiliam, John Hattie, Daniel Pink, Carol Dweck, Alfie Kohn, Linda McNeil, Linda Mabry, Maja Wilson and countless others, we are teachers who are convinced that teaching and learning can be better when we grade less. Care to join us? Find us on Facebook and leave a comment below about your own experiences — with or without grades! And please click the ❤ so more people get to see this. ←Previous Post: When I Heard the Learn’d Astronomer ", "title": "Teachers Going Gradeless", "sentences": [{"f731": "Teachers Going Gradeless"}, {"c36a": "Toward a Future of Growth Not Grades"}, {"723a": "After years of teaching using the principles of standards-based learning and grading, I encountered two findings that radically changed my perspective on assessment, grading, and reporting."}, {"c86d": "The first finding comes from Ruth Butler (1988, as cited in Wiliam 2011) regarding feedback. Butler examined 3 types of feedback: scores alone, comments alone, and scores with comments. Her study showed that scores alone made students either complacent or unmotivated depending on how well they did. Scores with comments were just as ineffective in that students focused entirely on the score and ignored the comments. Surprisingly, it was the students who received comments alone that demonstrated the most improvement."}, {"69ac": "The second finding comes from John Hattie (2012) whose synthesis of 800 meta-studies showed that student self-assessment/self-grading topped the list of educational interventions with the highest effect size. By teaching students how to accurately self-assess based on clear criteria, teachers empower them to become “self-regulated learners” able to monitor, regulate, and guide their own learning. The reason students never develop these traits is that our monopoly on assessment, feedback, and grading has trained students to adopt an attitude of total passivity in the learning process."}, {"ef03": "In encountering these ideas, I realized that my assessment practices were bogged down by an overemphasis on scores and my total domination of assessment and grading. This year, I changed my approach, using feedback and revisions only, without entering a letter grade until the end of each term. At that point, I allow students an opportunity to evaluate their overall performance using statements from my Descriptive Grading Criteria (adapted from Ken O’Connor’s 15 Fixes for Broken Grades). Upon completing this process, they sign up to conference with me personally, or complete a linked letter or video explaining the grade they believe they deserve."}, {"d6ad": "It’s been quite a journey. Along the way, I’ve encountered many wise guides and intrepid travelers, people like Joy Kirr, Starr Sackstein, Aric Foster, Sarah J. Donovan, Peter Anderson, Professor Jennifer Hurley, Jen Doucette, and Aaron Blackwelder. Each of these educators has developed their own unique approach, fostering communities built around growth, trust, and mutuality."}, {"5150": "As a way of supporting others on this same journey, Aaron Blackwelder and I recently set up the Teachers Going Gradeless Facebook group and intend to start hosting a regular Twitter chat. With this name, we hope to express the idea of a spectrum, a continuum, a process, a journey."}, {"7e73": "For some of us, the word gradeless means to grade less, that is, limiting the impact of grades within the context of current constraints. Some are just trying to get away from toxic assessment and grading practices, like assessments with no opportunity to redo or retake or zeroes on the mathematically disproportionate 100-point scale."}, {"022b": "For others, gradeless means without grades, that is, avoiding the damaging and demotivating effects of grades entirely. These teachers are trying to put the focus squarely on learning, eliminating grades in favor of feedback and growth. Some may even work in schools that have replaced traditional report cards altogether, using portfolios or descriptive evaluations instead. I experienced the latter at University of Michigan’s Residential College back in the 90’s. (If you’ve got an hour or two, I can show you my report card!)"}, {"3c76": "Update: @UmichRC replied to my tweet. They’ve started giving grades now."}, {"e246": "Drawing on the research of Ruth Butler, Dylan Wiliam, John Hattie, Daniel Pink, Carol Dweck, Alfie Kohn, Linda McNeil, Linda Mabry, Maja Wilson and countless others, we are teachers who are convinced that teaching and learning can be better when we grade less."}, {"10b0": "Care to join us? Find us on Facebook and leave a comment below about your own experiences — with or without grades!"}, {"57b1": "And please click the ❤ so more people get to see this."}, {"260b": "←Previous Post: When I Heard the Learn’d Astronomer"}], "child": "392_1\t392_2\t392_3\t392_4\t392_5\t392_6\t392_7\t392_8\t392_9\t392_10\t392_11\t392_12\t392_13\t392_14\t392_15\t392_16\t392_17\t392_18\t392_19\t392_20\t392_21\t392_22"}