{"name": "397", "parent": "", "content": "10 Tips for Effectively Learning a Language A few tips and tricks to mastering a language When it comes to picking up a bit of lingo, a lot of people love to learn. Your passion to learn combined with effective resources can be your gateway to mastering the language. As far as language learning goes, keeping the ball rolling is one tough cookie to crack. Persistence is one of the hardest things to deal with as a language learner. Being motivated enough to keep everything going is one of the biggest downfalls for language learners around the globe. This piece will share a few tips to improving the efficiency of your language learning and covering the flaws you may face as you begin learning. 1. Get creative with your notes! Source: Unsplash A traditional language learning technique, flashcards has been widely adopted by many language learners as they start out. For those looking to keep things up, it’s a great way to work on your learning anywhere, anytime. Try enhancing that learning by converting them to Post-it Notes, this will give you some creative freedom to stick them across your home, office or bedroom. Immersion techniques have become increasingly popular amongst those who are time poor, saving you some time reviewing your notes within your day. Grab a few Post-its and start covering corresponding items with lingo. Even more time poor than you expected, get these created for you, try FlashSticks as an option to avoid making all these vocabulary notes. 2. Set a goal, stick to it! Source: Unsplash A lot of language learners fall at the first hurdle by not setting a goal. Setting a specific goal or target can massively help when it comes to knowing when you’ve been successful with your learning, as well as pushing towards a sense of achievement. Avoid setting simple goals like: “Learn French in 2017” This is way too vague. You want to be specific, so try and breakdown what deliverable you’d like to have by the end of your target. A good target would look like this: “Have a basic 15-minute conversation with a French native by March 2017” Actionable and specific allowing you to acquire the vocabulary, skills and fluency needed to have that 15-minute chat with a native speaker. Or something like this maybe: Source: Unsplash Be able to order a full coffee and meal in a French restaurant during my Summer break in Paris, with no English assistance. The achievement you’ll feel when something specific has been completed will give you a massive booster and provide a nice motivator to keep things rolling and move onto your next actionable goal. 3. Learning on your smartphone Source: Unsplash Speaking a language doesn’t just mean flashcards. You’ll need to try many different approaches when kicking things off. Whether it’s a Skype call, flashcards, textbooks or apps, all of these resources will help you to build a strong arsenal when learning. Apps have become even more popular as a learning resource for languages in the last few years. This is due to the advances with their functionality, allowing you to do even more. Resources like FlashAcademy, Duolingo and Babbel have become some of the best ways to pick-up a language from multiple different methods. It’s worth grabbing your smartphone and downloading a few offline lessons for when you are commuting back and forth, day to day. 4. Chatting with a native Source: Unsplash Native speakers are the bread and butter of the language. Being able to grab some time with a native speaker can skyrocket your learning, thanks to the interaction of speaking directly with them about fluency, accent, language and culture too. As technological progresses, we don’t need to be in the same country to grab a native speaker. Thanks to the likes of Skype, iTalki, Verbling and Rype we’ve managed to speak with a native, wherever we are. Source: Rype These resources can connect you with a native speaker willing to help improve your learning, at a very low-cost. This exposure can be very progressive to your language learning by giving it a new angle and approach to excel easily. 5. Practice with your partner Source: Unsplash This is another successful way to learn a language. Speaking with many people who’ve been successful at picking up the language, many of them credit their partners, or even dating apps like Tinder for meeting men or ladies that speak the target language. Whether you have a partner or not, you’ll be able to find a willing friend to persuade, for sure. Grab 5-minutes with them to share you passion for learning “X” language and I’m sure you’ll have got them onboard to start learning with you. Pick your target, and organise a language learning schedule to start progressing with day to day language learning. It’ll help massively after the first few weeks, as you both support each other’s efforts to help pick up the language. 6. Immerse yourself with the language Source: Unsplash An age-old technique used by many learners, even outside of language learners. For those not familiar, immersion is a way to start throwing yourself in the deep end with learning something. Being able to listen to Spanish radio, changing your iPhone’s native language setting to French, listening to only Italian language podcasts or even visiting German speaking restaurants in your city are all examples of ways you can be jumping in with the language. This idea of refining your skills through pressure and total immersion is becoming more and more popular being endorsed by linguists like Benny Lewis and Olly Richards as one of the best ways to get started. 7. Get onto YouTube, now! Source: Lucrezia Oddone Looking to save a bit of money as you get started?! YouTube might be your savour. As a language learning resource, it is not only awesome, but perfect for meeting new people in the comments . YouTubers like Tom Txxytu and Lucrezia Oddone are great examples of Italian language YouTubers helping you to pick up important lessons on grammar, fluency and vocabulary. Culture is also something that YouTube opens up, thanks to the host of creators in the language and culture space on YouTube, getting to know the culture of a language is easy to do. Source: Marcoinabox Take Marcoinabox as an example, creating videos on Italian culture, allowing you to pick up tricks when it comes to travelling. 8. Meeting up with local learners Source: Unsplash Being someone who is learning a language can be lonely. Making language learning friends locally could be a great way to get the ball rolling. Hidden across your town or city might be lots of learners, in similar situations, looking for language buddies. Try apps like Meetup and Eventbrite to bump into local learners around your city, groups will have already been made in your local area, we are sure, to rally all of those passionate learners out there. If you don’t see any, why not open one up. Start with a small group of 2–3 and grow out, we’re sure you’ll have 20–30 in no time! 9. Travel outside of your guidebook Source: Unsplash Many travellers stick to the path. When you are exploring a new country, try avoid visiting the same restaurant every night, or sticking to the touristy areas. Obviously do everything with caution and check things out before you start venturing. But making sure to explore the city, country or area might be the key to improving your language skills. Bumping into locals, eating local cuisine and seeing new sites can be your key to improving your motivation to learn as well as giving you more reason So when you are abroad next, and looking to explore a city, try and pick up a guide that shares some of the “hidden gems” of a city, or even work out what locals are doing to help discover the true nature of how the people of the country live day by day. This is also a fantastic technique if your goal is to live in the target country. 10. Music Artists Source: Unsplash To round-up this list. Music, an excellent way to pick-up cultural vibes and a few bits of vocabulary. This is another immersion technique used by many. Try and avoid the cliches singers from each of the languages, eg. Enrique Iglesias, despite my respect for Enrique, I’d recommend trying something a little out there to help you improve your Spanish. Someone like Marc Anthony might be another alternative. Spotify is a nifty resource to finding all of these with a simple search for Spanish-speaking singers. Worth checking out what’s out there! Feel free to comment with some of your recommendations! We’d love to hear some of your suggestions! Author bio: Francesco D’Alessio. If you’d like to follow my work I’m on Twitter and on YouTube making videos about how to get stuff done. ", "title": "10 Tips for Effectively Learning a Language", "sentences": [{"2614": "10 Tips for Effectively Learning a Language"}, {"86d5": "A few tips and tricks to mastering a language"}, {"3e74": "When it comes to picking up a bit of lingo, a lot of people love to learn."}, {"fab9": "Your passion to learn combined with effective resources can be your gateway to mastering the language. As far as language learning goes, keeping the ball rolling is one tough cookie to crack."}, {"7acc": "Persistence is one of the hardest things to deal with as a language learner. Being motivated enough to keep everything going is one of the biggest downfalls for language learners around the globe."}, {"56ed": "This piece will share a few tips to improving the efficiency of your language learning and covering the flaws you may face as you begin learning."}, {"317c": "1. Get creative with your notes!"}, {"e4cc": "Source: Unsplash"}, {"4427": "A traditional language learning technique, flashcards has been widely adopted by many language learners as they start out. For those looking to keep things up, it’s a great way to work on your learning anywhere, anytime. Try enhancing that learning by converting them to Post-it Notes, this will give you some creative freedom to stick them across your home, office or bedroom."}, {"a719": "Immersion techniques have become increasingly popular amongst those who are time poor, saving you some time reviewing your notes within your day. Grab a few Post-its and start covering corresponding items with lingo."}, {"2296": "Even more time poor than you expected, get these created for you, try FlashSticks as an option to avoid making all these vocabulary notes."}, {"c14d": "2. Set a goal, stick to it!"}, {"38f9": "Source: Unsplash"}, {"8188": "A lot of language learners fall at the first hurdle by not setting a goal."}, {"8b0a": "Setting a specific goal or target can massively help when it comes to knowing when you’ve been successful with your learning, as well as pushing towards a sense of achievement."}, {"87be": "Avoid setting simple goals like:"}, {"947a": "“Learn French in 2017”"}, {"044c": "This is way too vague. You want to be specific, so try and breakdown what deliverable you’d like to have by the end of your target. A good target would look like this:"}, {"1718": "“Have a basic 15-minute conversation with a French native by March 2017”"}, {"3487": "Actionable and specific allowing you to acquire the vocabulary, skills and fluency needed to have that 15-minute chat with a native speaker. Or something like this maybe:"}, {"08c7": "Source: Unsplash"}, {"5504": "Be able to order a full coffee and meal in a French restaurant during my Summer break in Paris, with no English assistance."}, {"c8a0": "The achievement you’ll feel when something specific has been completed will give you a massive booster and provide a nice motivator to keep things rolling and move onto your next actionable goal."}, {"39f7": "3. Learning on your smartphone"}, {"92ab": "Source: Unsplash"}, {"ec07": "Speaking a language doesn’t just mean flashcards."}, {"4047": "You’ll need to try many different approaches when kicking things off. Whether it’s a Skype call, flashcards, textbooks or apps, all of these resources will help you to build a strong arsenal when learning."}, {"75ac": "Apps have become even more popular as a learning resource for languages in the last few years. This is due to the advances with their functionality, allowing you to do even more."}, {"7bd5": "Resources like FlashAcademy, Duolingo and Babbel have become some of the best ways to pick-up a language from multiple different methods."}, {"5c2c": "It’s worth grabbing your smartphone and downloading a few offline lessons for when you are commuting back and forth, day to day."}, {"a5b7": "4. Chatting with a native"}, {"7e4b": "Source: Unsplash"}, {"b6e3": "Native speakers are the bread and butter of the language."}, {"16b8": "Being able to grab some time with a native speaker can skyrocket your learning, thanks to the interaction of speaking directly with them about fluency, accent, language and culture too."}, {"f26d": "As technological progresses, we don’t need to be in the same country to grab a native speaker. Thanks to the likes of Skype, iTalki, Verbling and Rype we’ve managed to speak with a native, wherever we are."}, {"14a4": "Source: Rype"}, {"1aa8": "These resources can connect you with a native speaker willing to help improve your learning, at a very low-cost. This exposure can be very progressive to your language learning by giving it a new angle and approach to excel easily."}, {"57a7": "5. Practice with your partner"}, {"7115": "Source: Unsplash"}, {"f35a": "This is another successful way to learn a language. Speaking with many people who’ve been successful at picking up the language, many of them credit their partners, or even dating apps like Tinder for meeting men or ladies that speak the target language."}, {"23e8": "Whether you have a partner or not, you’ll be able to find a willing friend to persuade, for sure. Grab 5-minutes with them to share you passion for learning “X” language and I’m sure you’ll have got them onboard to start learning with you."}, {"ab04": "Pick your target, and organise a language learning schedule to start progressing with day to day language learning."}, {"407a": "It’ll help massively after the first few weeks, as you both support each other’s efforts to help pick up the language."}, {"0cb8": "6. Immerse yourself with the language"}, {"de2a": "Source: Unsplash"}, {"6dc3": "An age-old technique used by many learners, even outside of language learners. For those not familiar, immersion is a way to start throwing yourself in the deep end with learning something."}, {"196b": "Being able to listen to Spanish radio, changing your iPhone’s native language setting to French, listening to only Italian language podcasts or even visiting German speaking restaurants in your city are all examples of ways you can be jumping in with the language."}, {"1fe6": "This idea of refining your skills through pressure and total immersion is becoming more and more popular being endorsed by linguists like Benny Lewis and Olly Richards as one of the best ways to get started."}, {"089d": "7. Get onto YouTube, now!"}, {"2484": "Source: Lucrezia Oddone"}, {"95f8": "Looking to save a bit of money as you get started?!"}, {"f349": "YouTube might be your savour. As a language learning resource, it is not only awesome, but perfect for meeting new people in the comments ."}, {"b7e5": "YouTubers like Tom Txxytu and Lucrezia Oddone are great examples of Italian language YouTubers helping you to pick up important lessons on grammar, fluency and vocabulary."}, {"2a45": "Culture is also something that YouTube opens up, thanks to the host of creators in the language and culture space on YouTube, getting to know the culture of a language is easy to do."}, {"6007": "Source: Marcoinabox"}, {"dcd6": "Take Marcoinabox as an example, creating videos on Italian culture, allowing you to pick up tricks when it comes to travelling."}, {"7eb1": "8. Meeting up with local learners"}, {"842c": "Source: Unsplash"}, {"6743": "Being someone who is learning a language can be lonely."}, {"43b1": "Making language learning friends locally could be a great way to get the ball rolling. Hidden across your town or city might be lots of learners, in similar situations, looking for language buddies."}, {"db49": "Try apps like Meetup and Eventbrite to bump into local learners around your city, groups will have already been made in your local area, we are sure, to rally all of those passionate learners out there."}, {"175c": "If you don’t see any, why not open one up. Start with a small group of 2–3 and grow out, we’re sure you’ll have 20–30 in no time!"}, {"15e5": "9. Travel outside of your guidebook"}, {"4ede": "Source: Unsplash"}, {"d0b9": "Many travellers stick to the path."}, {"5f0f": "When you are exploring a new country, try avoid visiting the same restaurant every night, or sticking to the touristy areas. Obviously do everything with caution and check things out before you start venturing."}, {"bde1": "But making sure to explore the city, country or area might be the key to improving your language skills. Bumping into locals, eating local cuisine and seeing new sites can be your key to improving your motivation to learn as well as giving you more reason"}, {"c0da": "So when you are abroad next, and looking to explore a city, try and pick up a guide that shares some of the “hidden gems” of a city, or even work out what locals are doing to help discover the true nature of how the people of the country live day by day."}, {"42fa": "This is also a fantastic technique if your goal is to live in the target country."}, {"dc38": "10. Music Artists"}, {"0569": "Source: Unsplash"}, {"5e78": "To round-up this list."}, {"85fc": "Music, an excellent way to pick-up cultural vibes and a few bits of vocabulary. This is another immersion technique used by many."}, {"14d3": "Try and avoid the cliches singers from each of the languages, eg. Enrique Iglesias, despite my respect for Enrique, I’d recommend trying something a little out there to help you improve your Spanish. Someone like Marc Anthony might be another alternative."}, {"8996": "Spotify is a nifty resource to finding all of these with a simple search for Spanish-speaking singers. Worth checking out what’s out there!"}, {"e96e": "Feel free to comment with some of your recommendations!"}, {"b058": "We’d love to hear some of your suggestions!"}, {"d1b5": "Author bio: Francesco D’Alessio. If you’d like to follow my work I’m on Twitter and on YouTube making videos about how to get stuff done."}], "child": "397_1\t397_2\t397_3\t397_4\t397_5397_1\t397_2\t397_3\t397_4\t397_5397_1\t397_2\t397_3\t397_4\t397_5"}