{"content": "Give Yourself Something to Pursue. Even if You Fail, The World is Better off With You Having Tried “Pursue” is a strong and meaningful word. To pursue is to go after something that means everything to you. If you pursue an activity, interest, or plan, you carry it out or follow it. Brené Brown says follow your curiosity. It’s easy and comforable to run through the maze of life without pausing to think of its meaning. Does what I’m doing matter? More importantly, does it matter to me? When you pursue something, you are not sitting around idly waiting for something to happen or to come along. You run hard and sometimes even fight to pursue. You fight for your calling. Life is too short and too precious to NOT pursue something that brings out the best in you. Tim O’Reilly made a profound statement about pursuing something meaningful. He once said: “Pursue something so important that even if you fail, the world is better off with you having tried.” Today, right now, is the best time ever to choose to do something that truly matters. Something you alone can share with the rest of us. Something you are capable of doing but continue to put off because you think you are not ready. You have everything you need to, at least try. If you stop questioning yourself and stop listening to everyone else, you will do something that may surprise you. Something magical. It doesn’t have to cure cancer or solve a global problem. But it’s important that you at least try. Don’t hesitate to contribute. The world needs more creators, not consumers. It has never been easier to decide to be responsible for your own work, for the change you expect. Everybody is supposed to fit in, to be like the others, to belong and to share the same values. But sometimes when things are predictable and safe, things get boring and innovation suffers. We have come this far because of a few people who were bold enough to try something new and different. Don’t fail to exercise your right to try something. Get into the habit of questioning the rules, of becoming curious about where you could try something different and where you could throw the windows open. You will be surprised at you are capable of. And give yourself permission to suck in the beginning. Don’t beat yourself and stress over your imperfections. Nobody is perfect. But guess what, the real world rewards those who get stuff done. Those who choose to show up. Those who launch. Those who have the courage to start. And those who choose to create. Not those who wait until things are perfect. Start with something you can do today or this week, even if you can commit a few minites to it. And tomorrow, do it again. Maybe for a few more minutes. And so on. And when you pick a project, your goal should be meaningfulness. Focus on those things that make your life more significant and worthwhile. The by product of pursuing a meaningful project is happiness. Start a journey that matters to you right now! Your pursuit should be meaningful to you. Why you pursue something is equally as important as what you pursue. Start something greater than yourself. Something you truly believe in. Purpose eases the pain of the long hours and gives you the fortitude to fail. It makes menial tasks meaningful adn even filfilling. A meaningful path is one that will change with your increased awareness of yourself and the world around you. So don’t be too bothered about deviations, look at them as improvements or opportunity to learn. Mark Twain says “The two most important days in your life are the day you are born and the day you find out why.” Many historic innovators of our time started something with the undying belief that they can create something of great and lasting significance, what others are not willing or able to. It acknowledges room for possibility. It challenges you — and it invites others to help you pursue something of greater significance to you and the rest of the world. You can’t change the world if you want to fit in. The system will reward you for your efforts. It always does. But when you are in a comfort zone, you have no desire to be who you are. Choose to be your authentic self, let go of who you think you should be to be who you are. In “Man’s Search for Meaning”, Viktor E. Frankl says: “Everyone has his own specific vocation or mission in life; everyone must carry out a concrete assignment that demands fulfillment. Therein he cannot be replaced, nor can his life be repeated. Thus, everyone’s task is unique as is his specific opportunity to implement it.” But what if it get’s ugly and I fail? It will get ugly. You will fail. You will stumble. Nobody can promise you a safe path. There are no safe routes if you want to be different and do something you care about. Mary Tyler Moore encourages use to take chances. She says “Take chances, make mistakes. That’s how you grow. Pain nourishes your courage. You have to fail in order to practice being brave.” If you’ve chosen well, after you fail you will be one step closer to succeeding, you will be wiser and stronger and you almost certainly will be more respected by all of those that are afraid to try. There’s no such thing as failure, only feedback. Take a chance if you can. You will learn what doesn’t work in the process if you fail. You are not your failure. Pursuit is a process. If you have something amazing to offer the rest of us, make time to pursue it today. It doesn’t have to be a big leap but the first step matters. Pursue something that bring out the best in you. That way you will enjoy the journey and the process. If you’re trying to do something new and impossible, expect it to be a long wait before anyone notices. In his short book, “Ignore Everybody”, Hugh Macleod says that good ideas have lonely childhoods. Expect a resistance. But don’t give up. Be so prolific and they won’t ignore you! Before you go… If you enjoyed this post, you will love Postanly Weekly. It’s my FREE weekly digest of the best research-based productivity, and life improvement posts from around the web. And my best post of the week. Postanly is for anyone who aspires to be awesome! Join 15,800+ readers who get my weekly newsletter! Here is what you missed last week! Subscribe to the FREE Postanly Weekly digest here! ", "child": "4_1\t4_2\t4_3\t4_4\t4_5\t4_6\t4_7\t4_8\t4_9", "title": "Give Yourself Something to Pursue. Even if You Fail, The World is Better off With You Having Tried", "parent": "", "sentences": [{"fab2": "Give Yourself Something to Pursue. Even if You Fail, The World is Better off With You Having Tried"}, {"3cdb": "“Pursue” is a strong and meaningful word. To pursue is to go after something that means everything to you. If you pursue an activity, interest, or plan, you carry it out or follow it. Brené Brown says follow your curiosity."}, {"0e80": "It’s easy and comforable to run through the maze of life without pausing to think of its meaning."}, {"b226": "Does what I’m doing matter?"}, {"b941": "More importantly, does it matter to me?"}, {"4a45": "When you pursue something, you are not sitting around idly waiting for something to happen or to come along. You run hard and sometimes even fight to pursue. You fight for your calling. Life is too short and too precious to NOT pursue something that brings out the best in you."}, {"347a": "Tim O’Reilly made a profound statement about pursuing something meaningful. He once said: “Pursue something so important that even if you fail, the world is better off with you having tried.”"}, {"9178": "Today, right now, is the best time ever to choose to do something that truly matters."}, {"ae7c": "Something you alone can share with the rest of us."}, {"2a7a": "Something you are capable of doing but continue to put off because you think you are not ready."}, {"8b60": "You have everything you need to, at least try."}, {"4316": "If you stop questioning yourself and stop listening to everyone else, you will do something that may surprise you. Something magical. It doesn’t have to cure cancer or solve a global problem. But it’s important that you at least try."}, {"cb1e": "Don’t hesitate to contribute. The world needs more creators, not consumers."}, {"f10f": "It has never been easier to decide to be responsible for your own work, for the change you expect."}, {"3ebb": "Everybody is supposed to fit in, to be like the others, to belong and to share the same values. But sometimes when things are predictable and safe, things get boring and innovation suffers."}, {"4222": "We have come this far because of a few people who were bold enough to try something new and different."}, {"8300": "Don’t fail to exercise your right to try something."}, {"e241": "Get into the habit of questioning the rules, of becoming curious about where you could try something different and where you could throw the windows open. You will be surprised at you are capable of."}, {"8096": "And give yourself permission to suck in the beginning. Don’t beat yourself and stress over your imperfections. Nobody is perfect. But guess what, the real world rewards those who get stuff done. Those who choose to show up. Those who launch. Those who have the courage to start. And those who choose to create."}, {"d567": "Not those who wait until things are perfect."}, {"62d9": "Start with something you can do today or this week, even if you can commit a few minites to it. And tomorrow, do it again. Maybe for a few more minutes. And so on."}, {"608c": "And when you pick a project, your goal should be meaningfulness. Focus on those things that make your life more significant and worthwhile. The by product of pursuing a meaningful project is happiness."}, {"f04d": "Start a journey that matters to you right now!"}, {"2b4f": "Your pursuit should be meaningful to you. Why you pursue something is equally as important as what you pursue. Start something greater than yourself. Something you truly believe in. Purpose eases the pain of the long hours and gives you the fortitude to fail. It makes menial tasks meaningful adn even filfilling."}, {"f4de": "A meaningful path is one that will change with your increased awareness of yourself and the world around you. So don’t be too bothered about deviations, look at them as improvements or opportunity to learn."}, {"e304": "Mark Twain says “The two most important days in your life are the day you are born and the day you find out why.”"}, {"d6f4": "Many historic innovators of our time started something with the undying belief that they can create something of great and lasting significance, what others are not willing or able to. It acknowledges room for possibility. It challenges you — and it invites others to help you pursue something of greater significance to you and the rest of the world."}, {"8219": "You can’t change the world if you want to fit in. The system will reward you for your efforts. It always does. But when you are in a comfort zone, you have no desire to be who you are. Choose to be your authentic self, let go of who you think you should be to be who you are."}, {"a713": "In “Man’s Search for Meaning”, Viktor E. Frankl says:"}, {"2054": "“Everyone has his own specific vocation or mission in life; everyone must carry out a concrete assignment that demands fulfillment. Therein he cannot be replaced, nor can his life be repeated. Thus, everyone’s task is unique as is his specific opportunity to implement it.”"}, {"50dd": "But what if it get’s ugly and I fail?"}, {"e962": "It will get ugly. You will fail. You will stumble. Nobody can promise you a safe path. There are no safe routes if you want to be different and do something you care about."}, {"d9c8": "Mary Tyler Moore encourages use to take chances. She says “Take chances, make mistakes. That’s how you grow. Pain nourishes your courage. You have to fail in order to practice being brave.”"}, {"f544": "If you’ve chosen well, after you fail you will be one step closer to succeeding, you will be wiser and stronger and you almost certainly will be more respected by all of those that are afraid to try."}, {"44c2": "There’s no such thing as failure, only feedback."}, {"bf6e": "Take a chance if you can. You will learn what doesn’t work in the process if you fail. You are not your failure."}, {"7877": "Pursuit is a process."}, {"ddaa": "If you have something amazing to offer the rest of us, make time to pursue it today. It doesn’t have to be a big leap but the first step matters. Pursue something that bring out the best in you. That way you will enjoy the journey and the process."}, {"a3f8": "If you’re trying to do something new and impossible, expect it to be a long wait before anyone notices. In his short book, “Ignore Everybody”, Hugh Macleod says that good ideas have lonely childhoods. Expect a resistance. But don’t give up."}, {"a1bf": "Be so prolific and they won’t ignore you!"}, {"5a00": "Before you go…"}, {"7c48": "If you enjoyed this post, you will love Postanly Weekly."}, {"ff58": "It’s my FREE weekly digest of the best research-based productivity, and life improvement posts from around the web. And my best post of the week. Postanly is for anyone who aspires to be awesome!"}, {"f3a9": "Join 15,800+ readers who get my weekly newsletter! Here is what you missed last week! Subscribe to the FREE Postanly Weekly digest here!"}], "name": "4"}