{"sentences": [{"cf6d": "The Secret to Happiness Is 10 Specific Behaviors"}, {"50e6": "Listen to this song while you read? It’s a beaut."}, {"8a0b": "***"}, {"73e1": "Despite happiness being a primary human motivation, only one in three Americans say they’re very happy."}, {"b5ca": "Several years ago in an interview with Conan O’Brien, Louis C. K. tells of flying on a newly equipped Wi-Fi airplane. He was amazed by the new technology. Until, during the flight, the Wi-Fi went down. Immediately, the man next to him became extremely upset. “As though the world owes this man something he only knew existed 10 seconds ago.”"}, {"b187": "Louis C. K. continues by describing people’s absurd frustrations with flying in general. People complain about it all the time “It was the worst day of my life! It took 20 minutes to board! We had to sit on the runway for 40 minutes!”"}, {"97f6": "We hear complaints like these all the time. As if we’ve forgotten how incredible it is that humans can fly at all."}, {"c08b": "How are we so quick to take for granted the remarkable things going on in life?"}, {"e788": "Why is it so easy to complain?"}, {"e168": "Why do we focus on the negative?"}, {"8a62": "Everything is amazing and nobody is happy."}, {"801f": "However, happiness can easily be achieved even without the brilliant advances in the world."}, {"ad64": "Rather than being reactive to what’s going on around us, happy people take control of their lives and emotions. If you are unhappy with your life, who or what else can you blame than yourself? And if you can blame someone or something else, how is blame going to make your life any better?"}, {"fc37": "Bad stuff happens to everyone. But life isn’t about what happens to you. It’s about how you proactively respond."}, {"9955": "The following 10 behaviors, if applied, will change your life. Let me be clear, if you do these things, you will be an incredibly happy person."}, {"aa4d": "1. Let Go Of The Need For Specific Outcomes"}, {"571f": "Not everything in life goes exactly how we plan. There are setbacks. Stuff happens. We mess up. Over-obsessing and basing happiness on specific outcomes leads to misery. My wife and I have been trying to get pregnant for almost three years. It’s been tough. We’ve had to learn to be happy, rain or shine."}, {"182c": "Jeremy Piven, the famous actor, was recently interviewed by Success Magazine. During the interview, he mentioned that, as an actor, the only way to work is to go out and audition for specific roles."}, {"82e0": "The challenge most actors/actresses face is that they get in their own way. It doesn’t matter how much homework they’ve done. If they’re too tied to a specific result, they can’t be present in the moment. They can’t truly perform their art. They come off as desperate. They get in their own way. Their performance isn’t what it could have been."}, {"82e6": "Jeremy said that when he quit worrying about a specific result, he was able to be present during his auditions. He was able to be completely who he wanted to be. He wasn’t trying to be what he thought others wanted him to be. He performed his art."}, {"46d5": "If he didn’t get the gig, either they didn’t get it or it just wasn’t the right fit. So he moves on to the next. In this way, he’s able to get the jobs he’s supposed to have. He’s not just trying to get anything he can get."}, {"d188": "2. Define Your Own Success And Happiness"}, {"88f7": "“Be everything to everybody and you’ll be nothing for yourself.” — John Rushton"}, {"8111": "No two human beings are the same. So why should we have one standard of success? Seeking society’s standard of success is an endless rat-race. There will always be someone better than you. You’ll never have the time to do everything."}, {"4e03": "Instead, you recognize that every decision has opportunity cost. When you choose one thing, you simultaneously don’t choose several others. And that’s okay. Actually, it’s beautiful because we get to choose our ultimate ideal. We must define success, wealth, and happiness in our own terms because if we don’t, society will for us — and we will always fall short."}, {"ad41": "We’ll always be left wanting. We’ll always be stuck comparing ourselves and competing with other people. Our lives will be an endless race for the next best thing. We’ll never experience contentment."}, {"7acc": "3. Commit 100 Percent To The Things That Make You Happy"}, {"a11e": "“Many of us have convinced ourselves that we are able to break our own personal rules “just this once.” In our minds, we can justify these small choices. None of those things, when they first happen, feels like a life-changing decision. The marginal costs are almost always low. But each of those decisions can roll up into a much bigger picture, turning you into the kind of person you never wanted to be.” — Clayton Christensen"}, {"5e3b": "People are really good at self-sabotage. We consistently behave in ways that contradict our goals and ideals. This is incongruence. As Mahatma Gandhi has said, “Happiness is when what you think, what you say, and what you do are in harmony.” The smaller the gap between what you should do, and what you actually do — the happier you will be."}, {"c727": "Hence, Clayton Christensen says 100 percent commitment is easier than 98 percent commitment. When you fully commit to something, the decision has been made. Consequently, regarding that thing, all future decisions have been made."}, {"56ae": "Unless you’re committed 100 percent, you will always be a victim to external circumstances. By relying on willpower, you’ll crumble more often than you think. Research has found that people over-inflate their own performance. Chances are, you probably think you’re doing better at your resolves than you really are."}, {"098e": "But once you’re 100 percent committed, you no longer need to rely on willpower. Your decision has already been made regardless of the circumstances. Saying “No” to anything outside our highest ideals becomes extremely easy. This is living proactively rather than reactively."}, {"06dd": "4. Be Grateful For What You Already Have"}, {"6397": "“Both abundance and lack [of abundance] exist simultaneously in our lives, as parallel realities. It is always our conscious choice which secret garden we will tend … when we choose not to focus on what is missing from our lives but are grateful for the abundance that’s present — love, health, family, friends, work, the joys of nature, and personal pursuits that bring us [happiness] — the wasteland of illusion falls away and we experience heaven on earth.” — Sarah Ban Breathnach"}, {"c20c": "Happiness is as simple as gratitude. Psychological research has found that people who practice gratitude consistently report a host of benefits:"}, {"af6a": "Physical"}, {"61df": "Psychological"}, {"efbd": "Social"}, {"6f32": "Despite these benefits, most people ungratefully focus on what they don’t have. As a culture, we have become wasteful and undisciplined consumers. The grass is always greener on the other side. A constant pursuit of having more of the newest and best."}, {"7bf2": "How could you possibly find happiness when you relentlessly want more and never find properly appreciate what you have?"}, {"8c93": "It’s time for you to learn how to be more grateful. Your happiness depends on it. Dr. Emmons, one of the world’s leading experts on gratitude recommends 10 ways to become more grateful:"}, {"bb43": "Keep a gratitude journal"}, {"5c38": "Set aside time on a daily basis to recollection moments of gratitude connected with commonplace events, your personal characteristics, or important people in your life. This allows you to weave gratitude into your normal, everyday life. This will help you move from trying to be grateful occasionally to becoming a grateful person. The goal is to move from doing to being."}, {"31f1": "Remember the hard and challenging things you’ve gone through"}, {"1993": "When you ponder and reflect on the challenges you’ve passed through, you’ll more fully embrace where you currently are."}, {"4f55": "Ask yourself these three questions"}, {"8745": "You can reflect on any aspect of your life and deeply consider these three questions:"}, {"50b2": "These questions will allow you to look at the people or things in your life from a different perspective. They will allow you to not take them for granted and to realize how grateful you are."}, {"4db0": "Learn prayers of gratitude"}, {"0409": "In many spiritual traditions, prayers of gratitude are considered to be the most powerful form of prayer. These prayers turn the individual to their highest source of power. It allows them to realize the divine grace that has so generously been bestowed. It also allows the person to seek for higher and better ways of living."}, {"5ba3": "Come to your senses"}, {"f788": "Literally, connecting more deeply with our body allows us to see it for what it is: a brilliant and miraculous gift. Being more fully present as we touch, see, smell, taste, and hear facilitates appreciation for being human and alive. In this way, gratitude intensifies our lived experience."}, {"15c3": "Use visual reminders"}, {"1ab0": "The two main impediments to gratitude are forgetfulness and a lack of mindful awareness. Consequently, putting visual reminders in common places triggers thoughts of gratitude. Dr. Emmons has found that the best visual reminders are people."}, {"c63f": "Make a personal vow to practice gratitude"}, {"39a8": "Research shows that making an oath to perform a behavior increases the likelihood that the action will be executed. Consequently, you should make a personal and public declaration that you are going to be more grateful. Write it down. Share it on social media. Tell your friends and closest people."}, {"d51d": "Watch your language"}, {"a9dd": "Grateful people use words that ungrateful people don’t use. They often use words like gifts, givers, blessings, blessed, fortune, fortunate, and abundance. Use these words in your vocabulary more and you’ll recognize more things to be grateful for. Additionally, in your language, don’t focus on how inherently good you are. Rather, speak of how good things and other people have been for you. This will allow you to realize the abundance around you. The universe and everyone in it is your advocate."}, {"92aa": "Go through the motions"}, {"19dc": "Grateful motions include smiling, saying thank you, and writing letters of gratitude. When you do these things, you trigger the emotion of gratitude in your life. Say thank you more often. Say you love people more often. Smile at random strangers as you pass them by. Not only will it make you feel better, it is contagious. People are mirrors. They’ll feel good and smile back. This will create a change reaction of positivity throughout the world. The ripple effects are endless."}, {"b528": "Think inside the box"}, {"7a97": "Dr. Emmons recommends creatively looking for new situations and things to be grateful for. What in your life have you not spent time being grateful for? What could you include in your life that will generate an inflow of gratitude?Mix it up. Don’t think gratitude can only come from a narrow set of sources."}, {"c28f": "5. Say “I Love You” More"}, {"d52b": "This may be strange, but if you tell your friends and family you love them, they’ll be blown away. I once knew a Polynesian missionary who told everyone he loved them. It was clear he was sincere."}, {"9000": "I asked him why he did it. What he told me changed my life. “When I tell people I love them, it not only changes them, but it changes me. Simply by saying the words, I feel more love for that person. I’ve been telling people all around me I love them. They feel treasured by me. Those who know me have come to expect it. When I forget to say it, they miss it.”"}, {"1aa6": "Said author Harriet Beecher Stowe, “The bitterest tears shed over graves are for words left unsaid and deeds left undone.”"}, {"b883": "As my wife, Lauren, tells our children daily, “The secret to happiness is to make everyone around you happy.” By default, you will get the satisfaction of bringing joy to others and their positive energy will come back to you."}, {"680c": "6. Have Hobbies Directed Toward Your Dreams"}, {"2fec": "Most people’s hobbies are just hobbies. And that’s okay. It’s good to have an escape from reality. However, research has found that a person can experience leisure in anything. Your work can become your leisure — where it literally rejuvenates you."}, {"f599": "When I decided where I wanted my life to go, my life vision, I consciously chose hobbies that would best get me there. Some of these hobbies include exercise, reading, writing, journaling, having deep and meaningful conversations, and being in nature. These hobbies refresh and rejuvenate me while simultaneously pushing me toward my dreams."}, {"b15a": "7. Don’t Wait Til Tomorrow For What You Can Do Today"}, {"143d": "“When I was around thirteen and my brother ten, Father had promised to take us to the circus. But at lunch time there was a phone call; some urgent business required his attention downtown. We braced ourselves for disappointment. Then we heard him say [into the phone], ‘No, I won’t be down. It’ll have to wait.’"}, {"9101": "“When he came back to the table, Mother smiled. ‘The circus keeps coming back, you know,’ [she said.]"}, {"99fe": "“‘I know,’ said Father. ‘But childhood doesn’t.’” — Arthur Gordon"}, {"3712": "Happiness comes from embracing the now. Not letting those moments pass you by. Greg McKeown, author of Essentialism, tells of the story of missing his child being born to be at an “important meeting.”"}, {"9be1": "He thought the potential client would be impressed with his commitment to work. Instead, they saw his decision to miss such a monumental moment as a flaw in character. That moment was a turning point for Greg. In fact, it spurred him to change everything about his life. He now removes everything from his life that is not vital and essential."}, {"9970": "Nothing in life is permanent. Kids grow up. Friends move away. Our loved ones pass on from this life. Let’s live in the present and appreciate the most important things in our lives before it’s too late."}, {"5cdc": "The future value of time is far less than the present value. Yet, people “defer” happiness to someday in the future. In so doing, they forfeit experiencing the moment and being happiness now. You must find joy in the journey, because there really isn’t a destination. Goals are means, not ends. Progress is eternal. The process is everything."}, {"9d46": "8. Do Something Every Day That Terrifies You"}, {"e249": "Happy people step out of their comfort zone. You can’t grow if you don’t challenge yourself. And growth is a requirement of happiness. If you’re not growing, you’re slowly decaying and dying."}, {"a310": "Elevated risk makes you feel more alive and puts you in a state of flow — which is an optimal conscious state where you feel and perform at your highest level. You become completely absorbed in what you’re doing — pure presence."}, {"af21": "When you do things way outside your comfort zone, you naturally raise your conscious level. When you do things that involve high risk, and high probability of failure, you are forced to think differently than you normally do. You are forced to be creative and innovative."}, {"730a": "Sadly, most people play life small, safe, and easy. The goals they pursue are logical. There is little element of risk and little requirement for faith."}, {"5a7b": "Consequently, you should take bigger risks in your life. Do things that make you feel alive and activate flow. Of course, with this will come more failures. But if you’re not failing, you’re not growing. Rather than experiencing apathy in life, you’ll experience more of a roller-coaster of emotions. We can never appreciate joy if we’ve never felt sorrow. The more pain and fear we feel, the more we can comprehend and appreciate joy and happiness."}, {"5c12": "9. Put “The Important” Before “The Urgent”"}, {"94a0": "Stephen Covey says that most people spend their time on urgent but unimportant things. We wake up and immediately check our email. Thus, we put our lives on reactive, rather than proactive mode. After all, email is simply a database of other people’s agendas."}, {"b614": "Instead, happy people always put the important stuff first. Not only important, but important and non-urgent. The important stuff includes exercise, reading good books, setting goals, writing in your journal, and spending time with those you love. None of these things are urgent. We could easily put these things off until tomorrow — which is ultimately never. The most happy and successful people in the world spend most of their time on the important."}, {"dd7b": "One of my favorite non-urgent yet important things is my morning routine. I wake up several hours before I start my work day. I meditate and pray to put myself in a space of gratitude and abundance. Then I get my body moving with exercise or yard work. I eat healthy food, read my long-term goals, listen to uplifting content, and do at least one thing to move me toward my goals."}, {"fef0": "10. Forgo The Good To Pursue The Best"}, {"ae7c": "A lot of things in life are good, even great. That doesn’t mean we should do them. In Good to Great, Jim Collins says that once-in-a-lifetime opportunities come up every day. Most people take any great opportunity that comes their way, even if it’s not in alignment with their life vision. Consequently, most people’s lives are moving in a thousand different directions. They aren’t able to consciously move forward in a singular direction."}, {"276b": "On the other hand, happy people say no to even amazing opportunities. They will not sacrifice freedom for security. They will not get derailed by distractions — even sexy and attractive distractions."}, {"61fb": "Very few things in life are best. You can only determine what’s best for you once you know where you want your life to go. Be careful not to continuously engage in good activities and miss the best ones."}, {"c6b2": "Conclusion"}, {"2770": "Happy people live in the present. They don’t miss the moments that matter most. They are incredibly grateful for all they have. They focus their lives on the important and essential. They forgo the many good opportunities in order to focus on the few best ones."}, {"a7fb": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"6b92": "Click here to get the checklist right now!"}], "content": "The Secret to Happiness Is 10 Specific Behaviors Listen to this song while you read? It’s a beaut. *** Despite happiness being a primary human motivation, only one in three Americans say they’re very happy. Several years ago in an interview with Conan O’Brien, Louis C. K. tells of flying on a newly equipped Wi-Fi airplane. He was amazed by the new technology. Until, during the flight, the Wi-Fi went down. Immediately, the man next to him became extremely upset. “As though the world owes this man something he only knew existed 10 seconds ago.” Louis C. K. continues by describing people’s absurd frustrations with flying in general. People complain about it all the time “It was the worst day of my life! It took 20 minutes to board! We had to sit on the runway for 40 minutes!” We hear complaints like these all the time. As if we’ve forgotten how incredible it is that humans can fly at all. How are we so quick to take for granted the remarkable things going on in life? Why is it so easy to complain? Why do we focus on the negative? Everything is amazing and nobody is happy. However, happiness can easily be achieved even without the brilliant advances in the world. Rather than being reactive to what’s going on around us, happy people take control of their lives and emotions. If you are unhappy with your life, who or what else can you blame than yourself? And if you can blame someone or something else, how is blame going to make your life any better? Bad stuff happens to everyone. But life isn’t about what happens to you. It’s about how you proactively respond. The following 10 behaviors, if applied, will change your life. Let me be clear, if you do these things, you will be an incredibly happy person. 1. Let Go Of The Need For Specific Outcomes Not everything in life goes exactly how we plan. There are setbacks. Stuff happens. We mess up. Over-obsessing and basing happiness on specific outcomes leads to misery. My wife and I have been trying to get pregnant for almost three years. It’s been tough. We’ve had to learn to be happy, rain or shine. Jeremy Piven, the famous actor, was recently interviewed by Success Magazine. During the interview, he mentioned that, as an actor, the only way to work is to go out and audition for specific roles. The challenge most actors/actresses face is that they get in their own way. It doesn’t matter how much homework they’ve done. If they’re too tied to a specific result, they can’t be present in the moment. They can’t truly perform their art. They come off as desperate. They get in their own way. Their performance isn’t what it could have been. Jeremy said that when he quit worrying about a specific result, he was able to be present during his auditions. He was able to be completely who he wanted to be. He wasn’t trying to be what he thought others wanted him to be. He performed his art. If he didn’t get the gig, either they didn’t get it or it just wasn’t the right fit. So he moves on to the next. In this way, he’s able to get the jobs he’s supposed to have. He’s not just trying to get anything he can get. 2. Define Your Own Success And Happiness “Be everything to everybody and you’ll be nothing for yourself.” — John Rushton No two human beings are the same. So why should we have one standard of success? Seeking society’s standard of success is an endless rat-race. There will always be someone better than you. You’ll never have the time to do everything. Instead, you recognize that every decision has opportunity cost. When you choose one thing, you simultaneously don’t choose several others. And that’s okay. Actually, it’s beautiful because we get to choose our ultimate ideal. We must define success, wealth, and happiness in our own terms because if we don’t, society will for us — and we will always fall short. We’ll always be left wanting. We’ll always be stuck comparing ourselves and competing with other people. Our lives will be an endless race for the next best thing. We’ll never experience contentment. 3. Commit 100 Percent To The Things That Make You Happy “Many of us have convinced ourselves that we are able to break our own personal rules “just this once.” In our minds, we can justify these small choices. None of those things, when they first happen, feels like a life-changing decision. The marginal costs are almost always low. But each of those decisions can roll up into a much bigger picture, turning you into the kind of person you never wanted to be.” — Clayton Christensen People are really good at self-sabotage. We consistently behave in ways that contradict our goals and ideals. This is incongruence. As Mahatma Gandhi has said, “Happiness is when what you think, what you say, and what you do are in harmony.” The smaller the gap between what you should do, and what you actually do — the happier you will be. Hence, Clayton Christensen says 100 percent commitment is easier than 98 percent commitment. When you fully commit to something, the decision has been made. Consequently, regarding that thing, all future decisions have been made. Unless you’re committed 100 percent, you will always be a victim to external circumstances. By relying on willpower, you’ll crumble more often than you think. Research has found that people over-inflate their own performance. Chances are, you probably think you’re doing better at your resolves than you really are. But once you’re 100 percent committed, you no longer need to rely on willpower. Your decision has already been made regardless of the circumstances. Saying “No” to anything outside our highest ideals becomes extremely easy. This is living proactively rather than reactively. 4. Be Grateful For What You Already Have “Both abundance and lack [of abundance] exist simultaneously in our lives, as parallel realities. It is always our conscious choice which secret garden we will tend … when we choose not to focus on what is missing from our lives but are grateful for the abundance that’s present — love, health, family, friends, work, the joys of nature, and personal pursuits that bring us [happiness] — the wasteland of illusion falls away and we experience heaven on earth.” — Sarah Ban Breathnach Happiness is as simple as gratitude. Psychological research has found that people who practice gratitude consistently report a host of benefits: Physical Psychological Social Despite these benefits, most people ungratefully focus on what they don’t have. As a culture, we have become wasteful and undisciplined consumers. The grass is always greener on the other side. A constant pursuit of having more of the newest and best. How could you possibly find happiness when you relentlessly want more and never find properly appreciate what you have? It’s time for you to learn how to be more grateful. Your happiness depends on it. Dr. Emmons, one of the world’s leading experts on gratitude recommends 10 ways to become more grateful: Keep a gratitude journal Set aside time on a daily basis to recollection moments of gratitude connected with commonplace events, your personal characteristics, or important people in your life. This allows you to weave gratitude into your normal, everyday life. This will help you move from trying to be grateful occasionally to becoming a grateful person. The goal is to move from doing to being. Remember the hard and challenging things you’ve gone through When you ponder and reflect on the challenges you’ve passed through, you’ll more fully embrace where you currently are. Ask yourself these three questions You can reflect on any aspect of your life and deeply consider these three questions: These questions will allow you to look at the people or things in your life from a different perspective. They will allow you to not take them for granted and to realize how grateful you are. Learn prayers of gratitude In many spiritual traditions, prayers of gratitude are considered to be the most powerful form of prayer. These prayers turn the individual to their highest source of power. It allows them to realize the divine grace that has so generously been bestowed. It also allows the person to seek for higher and better ways of living. Come to your senses Literally, connecting more deeply with our body allows us to see it for what it is: a brilliant and miraculous gift. Being more fully present as we touch, see, smell, taste, and hear facilitates appreciation for being human and alive. In this way, gratitude intensifies our lived experience. Use visual reminders The two main impediments to gratitude are forgetfulness and a lack of mindful awareness. Consequently, putting visual reminders in common places triggers thoughts of gratitude. Dr. Emmons has found that the best visual reminders are people. Make a personal vow to practice gratitude Research shows that making an oath to perform a behavior increases the likelihood that the action will be executed. Consequently, you should make a personal and public declaration that you are going to be more grateful. Write it down. Share it on social media. Tell your friends and closest people. Watch your language Grateful people use words that ungrateful people don’t use. They often use words like gifts, givers, blessings, blessed, fortune, fortunate, and abundance. Use these words in your vocabulary more and you’ll recognize more things to be grateful for. Additionally, in your language, don’t focus on how inherently good you are. Rather, speak of how good things and other people have been for you. This will allow you to realize the abundance around you. The universe and everyone in it is your advocate. Go through the motions Grateful motions include smiling, saying thank you, and writing letters of gratitude. When you do these things, you trigger the emotion of gratitude in your life. Say thank you more often. Say you love people more often. Smile at random strangers as you pass them by. Not only will it make you feel better, it is contagious. People are mirrors. They’ll feel good and smile back. This will create a change reaction of positivity throughout the world. The ripple effects are endless. Think inside the box Dr. Emmons recommends creatively looking for new situations and things to be grateful for. What in your life have you not spent time being grateful for? What could you include in your life that will generate an inflow of gratitude?Mix it up. Don’t think gratitude can only come from a narrow set of sources. 5. Say “I Love You” More This may be strange, but if you tell your friends and family you love them, they’ll be blown away. I once knew a Polynesian missionary who told everyone he loved them. It was clear he was sincere. I asked him why he did it. What he told me changed my life. “When I tell people I love them, it not only changes them, but it changes me. Simply by saying the words, I feel more love for that person. I’ve been telling people all around me I love them. They feel treasured by me. Those who know me have come to expect it. When I forget to say it, they miss it.” Said author Harriet Beecher Stowe, “The bitterest tears shed over graves are for words left unsaid and deeds left undone.” As my wife, Lauren, tells our children daily, “The secret to happiness is to make everyone around you happy.” By default, you will get the satisfaction of bringing joy to others and their positive energy will come back to you. 6. Have Hobbies Directed Toward Your Dreams Most people’s hobbies are just hobbies. And that’s okay. It’s good to have an escape from reality. However, research has found that a person can experience leisure in anything. Your work can become your leisure — where it literally rejuvenates you. When I decided where I wanted my life to go, my life vision, I consciously chose hobbies that would best get me there. Some of these hobbies include exercise, reading, writing, journaling, having deep and meaningful conversations, and being in nature. These hobbies refresh and rejuvenate me while simultaneously pushing me toward my dreams. 7. Don’t Wait Til Tomorrow For What You Can Do Today “When I was around thirteen and my brother ten, Father had promised to take us to the circus. But at lunch time there was a phone call; some urgent business required his attention downtown. We braced ourselves for disappointment. Then we heard him say [into the phone], ‘No, I won’t be down. It’ll have to wait.’ “When he came back to the table, Mother smiled. ‘The circus keeps coming back, you know,’ [she said.] “‘I know,’ said Father. ‘But childhood doesn’t.’” — Arthur Gordon Happiness comes from embracing the now. Not letting those moments pass you by. Greg McKeown, author of Essentialism, tells of the story of missing his child being born to be at an “important meeting.” He thought the potential client would be impressed with his commitment to work. Instead, they saw his decision to miss such a monumental moment as a flaw in character. That moment was a turning point for Greg. In fact, it spurred him to change everything about his life. He now removes everything from his life that is not vital and essential. Nothing in life is permanent. Kids grow up. Friends move away. Our loved ones pass on from this life. Let’s live in the present and appreciate the most important things in our lives before it’s too late. The future value of time is far less than the present value. Yet, people “defer” happiness to someday in the future. In so doing, they forfeit experiencing the moment and being happiness now. You must find joy in the journey, because there really isn’t a destination. Goals are means, not ends. Progress is eternal. The process is everything. 8. Do Something Every Day That Terrifies You Happy people step out of their comfort zone. You can’t grow if you don’t challenge yourself. And growth is a requirement of happiness. If you’re not growing, you’re slowly decaying and dying. Elevated risk makes you feel more alive and puts you in a state of flow — which is an optimal conscious state where you feel and perform at your highest level. You become completely absorbed in what you’re doing — pure presence. When you do things way outside your comfort zone, you naturally raise your conscious level. When you do things that involve high risk, and high probability of failure, you are forced to think differently than you normally do. You are forced to be creative and innovative. Sadly, most people play life small, safe, and easy. The goals they pursue are logical. There is little element of risk and little requirement for faith. Consequently, you should take bigger risks in your life. Do things that make you feel alive and activate flow. Of course, with this will come more failures. But if you’re not failing, you’re not growing. Rather than experiencing apathy in life, you’ll experience more of a roller-coaster of emotions. We can never appreciate joy if we’ve never felt sorrow. The more pain and fear we feel, the more we can comprehend and appreciate joy and happiness. 9. Put “The Important” Before “The Urgent” Stephen Covey says that most people spend their time on urgent but unimportant things. We wake up and immediately check our email. Thus, we put our lives on reactive, rather than proactive mode. After all, email is simply a database of other people’s agendas. Instead, happy people always put the important stuff first. Not only important, but important and non-urgent. The important stuff includes exercise, reading good books, setting goals, writing in your journal, and spending time with those you love. None of these things are urgent. We could easily put these things off until tomorrow — which is ultimately never. The most happy and successful people in the world spend most of their time on the important. One of my favorite non-urgent yet important things is my morning routine. I wake up several hours before I start my work day. I meditate and pray to put myself in a space of gratitude and abundance. Then I get my body moving with exercise or yard work. I eat healthy food, read my long-term goals, listen to uplifting content, and do at least one thing to move me toward my goals. 10. Forgo The Good To Pursue The Best A lot of things in life are good, even great. That doesn’t mean we should do them. In Good to Great, Jim Collins says that once-in-a-lifetime opportunities come up every day. Most people take any great opportunity that comes their way, even if it’s not in alignment with their life vision. Consequently, most people’s lives are moving in a thousand different directions. They aren’t able to consciously move forward in a singular direction. On the other hand, happy people say no to even amazing opportunities. They will not sacrifice freedom for security. They will not get derailed by distractions — even sexy and attractive distractions. Very few things in life are best. You can only determine what’s best for you once you know where you want your life to go. Be careful not to continuously engage in good activities and miss the best ones. Conclusion Happy people live in the present. They don’t miss the moments that matter most. They are incredibly grateful for all they have. They focus their lives on the important and essential. They forgo the many good opportunities in order to focus on the few best ones. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "parent": "", "title": "The Secret to Happiness Is 10 Specific Behaviors", "child": "4_1\t4_2\t4_3\t4_4\t4_5\t4_6\t4_7\t4_8\t4_9\t4_10\t4_11\t4_12\t4_13\t4_14\t4_15\t4_16\t4_17\t4_18\t4_19\t4_20\t4_21\t4_22\t4_23\t4_24\t4_25", "name": "4"}