{"name": "40", "parent": "", "content": "The Thunder Finally Add Another Scorer Doug McDermott may be able to give Russell Westbrook a little bit of rest The Deal The Thunder send Cameron Payne, Joffrey Lauvergne, and Anthony Morrow to the Bulls for Doug McDermott, Taj Gibson, and a 2018 second-round pick. The Winner Russell Westbrook’s wrists and their impending arthritis are the clear winner here as he will finally be joined by another shooter in McDermott. Before the season and after KD’s departure, what OKC needed most — other than some Mediterranean Mint Talenti and Adele’s 25, perhaps — was scoring support. Acquiring Victor Oladipo last offseason was exciting (and he’s shooting the best percentages of his career) but not enough. The Thunder’s offense collapses the second Westbrook steps off the court. With Russ playing, Oklahoma City scores 106.6 points per 100 possessions; when he sits, that plummets to 97.2. In 24.5 minutes per game with the Bulls this season, Dougie McBuckets is averaging 10.2 points with an effective field goal percentage of 52. McDermott alone would’ve sold this trade as a positive, but the addition of Gibson gives them a defensive presence underneath the rim. The idea of Gibson and Steven Adams being backed up by Domantas Sabonis and Enes Kanter (when healthy) is encouraging for the postseason. Here’s hoping Gibson and McDermott can grow mustaches. WYD, Chicago Two seasons ago, Anthony Morrow was a solid bench contributor. His eFG was nearly 58 percent, and on average, he’d produce 10.7 points in around 24 minutes per game (if those numbers sound familiar, it’s because they are almost exactly McDermott’s from this season). He’s been in and out of a funk (mostly in) since, with depleted minutes. OKC has gotten double-digit scoring from Morrow only eight times this season. Payne can count on more playing time behind Rajon Rondo (or Michael Carter-Williams) than he ever could’ve backing up Westbrook. Chicago’s offense won’t change much when they sub the second-year player (33 percent from the field) for the vet (37 percent from the field) and revitalize Morrow’s former self — but maybe that’s not their plan after all, as the 2016–17 Bulls have acquired a taste for nonshooters. As for Lauvergne, that might just be a contract the Bulls have agreed to bite. Here’s Danny Chau on the Frenchman: “He’s not really a guy who moves the needle much. He plays really hard, and is a team-oriented player who can move the ball around, but he’s not a rim protector or a good rebounder for his size because of his lack of length. He has range out to the 3-point line, but he hasn’t shown much consistency with it. Joffrey’s probably just a contract being thrown in here. They’re much better off giving their other young bigs like Cristiano Felicio as many minutes as they can handle.” The Report Early rumors had Andre Roberson as part of this trade, but apparently the Thunder want to keep him when he enters restricted free agency this offseason. He’s a defensive gem, though the other end of the court is a work in painful progress — of the 57 games this season, he’s had 13 with 10 or more points; he’s averaging 30 minutes a game, and just 6.6 points. Maybe there are other reasons the Thunder want to keep him. Only Sam Presti knows. The Slight Bummer According to Royce Young, Russ and Cameron stopped dancing around the new year, but it’s still where OKC will feel his absence most. Can Dougie actually Dougie? ", "title": "The Thunder Finally Add Another Scorer", "sentences": [{"1091": "The Thunder Finally Add Another Scorer"}, {"ae67": "Doug McDermott may be able to give Russell Westbrook a little bit of rest"}, {"4cb2": "The Deal"}, {"2288": "The Thunder send Cameron Payne, Joffrey Lauvergne, and Anthony Morrow to the Bulls for Doug McDermott, Taj Gibson, and a 2018 second-round pick."}, {"f489": "The Winner"}, {"0bde": "Russell Westbrook’s wrists and their impending arthritis are the clear winner here as he will finally be joined by another shooter in McDermott. Before the season and after KD’s departure, what OKC needed most — other than some Mediterranean Mint Talenti and Adele’s 25, perhaps — was scoring support. Acquiring Victor Oladipo last offseason was exciting (and he’s shooting the best percentages of his career) but not enough."}, {"b511": "The Thunder’s offense collapses the second Westbrook steps off the court. With Russ playing, Oklahoma City scores 106.6 points per 100 possessions; when he sits, that plummets to 97.2. In 24.5 minutes per game with the Bulls this season, Dougie McBuckets is averaging 10.2 points with an effective field goal percentage of 52."}, {"3a8a": "McDermott alone would’ve sold this trade as a positive, but the addition of Gibson gives them a defensive presence underneath the rim. The idea of Gibson and Steven Adams being backed up by Domantas Sabonis and Enes Kanter (when healthy) is encouraging for the postseason. Here’s hoping Gibson and McDermott can grow mustaches."}, {"8f82": "WYD, Chicago"}, {"5ae5": "Two seasons ago, Anthony Morrow was a solid bench contributor. His eFG was nearly 58 percent, and on average, he’d produce 10.7 points in around 24 minutes per game (if those numbers sound familiar, it’s because they are almost exactly McDermott’s from this season). He’s been in and out of a funk (mostly in) since, with depleted minutes. OKC has gotten double-digit scoring from Morrow only eight times this season."}, {"cd63": "Payne can count on more playing time behind Rajon Rondo (or Michael Carter-Williams) than he ever could’ve backing up Westbrook. Chicago’s offense won’t change much when they sub the second-year player (33 percent from the field) for the vet (37 percent from the field) and revitalize Morrow’s former self — but maybe that’s not their plan after all, as the 2016–17 Bulls have acquired a taste for nonshooters."}, {"adba": "As for Lauvergne, that might just be a contract the Bulls have agreed to bite. Here’s Danny Chau on the Frenchman:"}, {"d9ae": "“He’s not really a guy who moves the needle much. He plays really hard, and is a team-oriented player who can move the ball around, but he’s not a rim protector or a good rebounder for his size because of his lack of length. He has range out to the 3-point line, but he hasn’t shown much consistency with it. Joffrey’s probably just a contract being thrown in here. They’re much better off giving their other young bigs like Cristiano Felicio as many minutes as they can handle.”"}, {"e83e": "The Report"}, {"c96b": "Early rumors had Andre Roberson as part of this trade, but apparently the Thunder want to keep him when he enters restricted free agency this offseason. He’s a defensive gem, though the other end of the court is a work in painful progress — of the 57 games this season, he’s had 13 with 10 or more points; he’s averaging 30 minutes a game, and just 6.6 points. Maybe there are other reasons the Thunder want to keep him."}, {"2f93": "Only Sam Presti knows."}, {"3b5a": "The Slight Bummer"}, {"7fab": "According to Royce Young, Russ and Cameron stopped dancing around the new year, but it’s still where OKC will feel his absence most. Can Dougie actually Dougie?"}], "child": "40_1\t40_2\t40_3\t40_4\t40_5"}