{"name": "401", "parent": "", "content": "Rules of Engagement: Teaching in a Virtual World I am a high school English teacher with a virtual school. Despite what you may think, I am a real teacher. I hold a Pennsylvania Level II certificate in both Elementary K-6 and English 7–12. I am also certified in both areas in Delaware. I have an M.Ed. in Elementary Education. I have taught for this school for more than five years and taught four different courses: British Literature, American Literature, Creative Writing and Journalism. I have a caseload of about 120 students, some with IEPs, others with 504 Plans. I plan lessons that meet state and Common Core standards and use modeling, scaffolding, differentiation, summative and formative assessments, and remediate based on assessment data. Despite my education and experience, many people, indeed many brick and mortar administrators, educators and board members, believe that I am not a real teacher, the school I work for is not a real public school, and our staff and students are, as a certain School Board President labeled us, monkeys at a computer. That gentleman stepped down not long after that comment. Imagine trying to reach 25–30 students in an online classroom. They are names in a participant list, comments in chat, answers on whiteboard and clicks with a polling tools. Imagine trying to assess understanding when you can’t see your students or physically watch them as they work on an assignment or in groups. Imagine trying to ascertain if they are paying attention when they don’t respond or participate. They could be there, or maybe not. Some are distracted by their phone, their video games. Others are called away by their parents, yes their parents, to unload groceries, let the dog out or watch a sibling. During class. Some of my students are quiet. They are there, and they are listening, but they don’t participate much. I worry about them until I see an A on a test and receive a writing assignment or project that clearly shows understanding and mastery of concepts and skills. Imagine emailing and calling students who never come to class, do not complete any assignments or communicate in any way, to tell that them they are failing the course, and that I am willing to help and receiving no response. No response from the student or the parent. These students don’t live in my neighborhood or town. They might live six or eight hours away from me, across the state, where I can never meet them in person. Imagine teaching students who live in a fire house because they were kicked out of their house, who are pregnant or taking care of an infant, who are working full-time either to support themselves or help support their families. NOW, do your job. Charter schools are not all private schools. My school is a public charter school. About 70% of our population qualifies for free and reduced lunch, and more than 20% are special needs. My school does not shop for students in the priciest districts. Many of our students come to my school out of desperation: a student with an IEP that is not being honored; a student from an inner city school district where guns and violence take precedence over learning; a student who was bullied mercilessly because he or she is obese, or shy, or is LGBTQ+. I have students with medical conditions who require frequent doctor’s appointments and sometimes hospitalization. They come to my school from all parts of the state, from countless school districts, dragging with them years of academic issues, expectations that weren’t met, problems that weren’t dealt with. Sometimes they come because they have outside interests or career-oriented activities that their brick-and-mortar school is not flexible enough to accommodate. Or they are well ahead of where they should be for their age and grade level, and their school district can provide nothing to enrich their education or to push them to where they are once again challenged. They come throughout the year, and we have to meet them where they are and bring them to where they need to be. They take the state standardized tests and many of them do poorly because of years of neglect, but their score is attributed to their short time at my school. For my students, cyber school is a chance to receive an education in the way that best suits their needs. My students live all over the state of Pennsylvania in cities, the suburbs, and in rural areas. Some work, others are involved in sports or junior military training programs. Others volunteer in hospitals and museums. I once had a student, also a dancer, who traveled to New York with her mother’s dance company regularly. She kept up with assignments and lessons she missed by watching the recordings of live classes and letting me know if she needed clarification. I have students who have gone on to the University of Colorado, New York University, Dartmouth College and Lehigh University. A current student asked me to write a letter of recommendation because she wants to attend the summer program offered by Harvard. She plans to go to an Ivy League school and pursue a career in law. I once had a student whose 9-month old crawled under the couch while we were in a one-on-on session working on an assignment. She was pretty distracted by that until I suggested that as long as she knew her daughter was, then why worry? She wasn’t getting into trouble. We laughed, I waited for her to retrieve her daughter, and we got back to work. Another student missed a lot of classes because she had to accompany her grandmother to doctor’s appointments and act as a translator because her grandmother did not speak English. I worked with her one-on-one to keep her caught up in class and ensure she understood the material we’d covered. I have students who struggle to focus because of upcoming court dates where they have to testify against a parent for neglect, or against a family friend for rape. I have students who are in and out of mental health treatment hospitals, who undergo major surgery or who miss class for their therapy appointments. These are the students who tell me they love our school because all of the fear, harassment, and tension they experienced in their brick and mortar schools is gone and now they can concentrate on their education. My school is a safe place where every student is welcomed and every student is keenly aware that we treat each other respectfully and gently. The only person who gets teased in my classes is me: I have been dubbed “The Suburban Legend” by my students in my 12:30 class. Memes of my face on the web cam are created regularly and shared in class. I have a thick skin. Cyber school is not a cold, isolated experience. My school offers countless activities for all grade levels from college visits, museum tours and roller skating parties, and even proms. My students come to class ready to talk and joke and do their best to be enthusiastic about the literature we read, which is not always easy. We read poetry and plays and watch The Great Gatbsy and heckle Tom Buchanan. I make them write and write often: creative assignments, essays and research projects. We discuss, analyze, share and work together to understand how to read and write about the literature piece, the themes, social commentary and author purpose. We make connections between the ideas of the past and the issues of our present. I use videos to enliven their virtual experience and the web cam to create a feeling of truly being in my classroom. I’ve been on the webcam every single day of every school year since 2012 and have long gotten over worrying about my hair or makeup or what shirt I am wearing. My students don’t care what I look like, although they notice every tiny change: did you get your hair cut? You’re wearing earrings today! And my favorite: you look tired. In many ways the relationship I have with my students is more intimate than the relationships I might have with students in a brick and mortar school. My students are in their bedrooms, at the table in their kitchen or dining room or on the couch. They show me pictures of themselves, their baby brothers and sisters, their dogs and cats. They tell me when they are taking their driver’s license tests, and we celebrate when they get their license. They tell me about the book they are writing or the performance their marching band took part in, or when they earn a new belt in Karate. They tell me about their part-time jobs and their birthday celebrations, often sharing pictures of themselves on the classroom whiteboard, which the other students love. Cyber schools exist because there are students who will not thrive in a traditional classroom. I have a student whose father was diagnosed with stage IV cancer right before Christmas and she is able to be home with him until the end. My students have been bullied by students and by their teachers at their brick and mortar schools. Some of my students are dealing with medical conditions that often cause them to miss school for doctor’s appointments, blood work or hospitalization. I have students who are caring for an infant, feeding a baby while in my live class session because their parents work and there is no one at home to help. Imagine going to high school while caring for an infant. Can you? I have students who do it. Cyber school is a flexible, safe place for these types of students. It provides these students with ability to continue their high school education and graduate with a diploma instead of being badgered by truancy officers, fined by the courts for multiple absences and then dropping out at 18. My students no longer have to deal with bullies commenting on their physical appearance, their clothes, their sexuality or their gender. AND they have teachers who are certified, mostly dual certified with masters degrees and some with doctoral degrees. These teachers wear hats, do the ice bucket challenge, sing songs and generally make fools of themselves on the web cam to engage and make connections with their students. We create tests and writing assignments and projects, and we could probably recite the Common Core standards for our subject area if you had the time and inclination to listen. School choice is not about taking away money from brick and mortar schools. Cyber charter schools are not out to defund the brick and mortar schools. We exist for a reason and perhaps the administrators at the brick and mortar schools should ask themselves why that is, instead of bashing what they clearly don’t fully understand. The current funding model, where school tax money goes to the district and is then paid to the charter school clearly doesn’t work. Many brick-and-mortar schools withhold these funds for as long as possible, putting a burden on the charter school. Charter schools have employees to pay, programs to pay for and students to educate. The money for each student’s education should follow the student directly and not be diverted through a district whose administrators are politically aligned against school choice. Withholding funds and limiting choice hurts the students and families who need a better educational option. Not every student is a good candidate for cyber school. Cyber school students have the increased responsibility of managing themselves — logging into their online classes, reaching out to a teacher for help, staying focused when the TV, the video game, their phone is tantalizingly close. I have had students who did not log into their online classes, did not complete any work, and could not be reached through email or by phone. They skipped in-person appointments with their family coach and their parents were either unaware, didn’t care or were unable to support their student. Perhaps if we worked together, placing students in the best environment to suit their personal and academic needs, our test scores and graduation rates would be higher. Maybe brick-and-mortar schools should see students leaving for cyber schools as a message that their needs are not being met. Public cyber schools must offer the same state tests as brick and mortar schools, but with the added expense of renting testing sites in churches, at colleges and in libraries. Each year, I and hundreds of my colleagues travel all over the state of Pennsylvania to administer PSSA tests and Keystone exams for 3–5 days. Not only must I plan days of lessons my students can do on their own, but I spend four to five hours on my feet, walking around a classroom, monitoring students taking standardized tests. When I get home, I have to check in on my students to ensure they are progressing through the self-paced lessons I assigned for the day, answer their emails and grade their assignments. So, before you grab a stick and run out to bash cyber schools, remember, if you’ve never been involved in a cyber school, taught in one or chosen one for your child, then you may not have all of the facts. Teachers often complain that non-teachers think they know teaching and pass judgement without ever having experienced teaching. The same holds true for cyber schools. If you haven’t worked for one, you can’t know the challenges, the triumphs or the frustrations that every day brings. Educate yourself and make public education, all types of public education, a welcoming place for all. If you related to this piece, please click on the heart icon ❤️ and consider following Teaching in Trump’s America on Facebook and Twitter. ", "title": "Rules of Engagement: Teaching in a Virtual World", "sentences": [{"8747": "Rules of Engagement: Teaching in a Virtual World"}, {"ef64": "I am a high school English teacher with a virtual school. Despite what you may think, I am a real teacher. I hold a Pennsylvania Level II certificate in both Elementary K-6 and English 7–12. I am also certified in both areas in Delaware. I have an M.Ed. in Elementary Education."}, {"1d92": "I have taught for this school for more than five years and taught four different courses: British Literature, American Literature, Creative Writing and Journalism. I have a caseload of about 120 students, some with IEPs, others with 504 Plans. I plan lessons that meet state and Common Core standards and use modeling, scaffolding, differentiation, summative and formative assessments, and remediate based on assessment data. Despite my education and experience, many people, indeed many brick and mortar administrators, educators and board members, believe that I am not a real teacher, the school I work for is not a real public school, and our staff and students are, as a certain School Board President labeled us, monkeys at a computer. That gentleman stepped down not long after that comment."}, {"d8cf": "Imagine trying to reach 25–30 students in an online classroom. They are names in a participant list, comments in chat, answers on whiteboard and clicks with a polling tools. Imagine trying to assess understanding when you can’t see your students or physically watch them as they work on an assignment or in groups. Imagine trying to ascertain if they are paying attention when they don’t respond or participate. They could be there, or maybe not. Some are distracted by their phone, their video games. Others are called away by their parents, yes their parents, to unload groceries, let the dog out or watch a sibling. During class."}, {"eb6f": "Some of my students are quiet. They are there, and they are listening, but they don’t participate much. I worry about them until I see an A on a test and receive a writing assignment or project that clearly shows understanding and mastery of concepts and skills. Imagine emailing and calling students who never come to class, do not complete any assignments or communicate in any way, to tell that them they are failing the course, and that I am willing to help and receiving no response. No response from the student or the parent. These students don’t live in my neighborhood or town. They might live six or eight hours away from me, across the state, where I can never meet them in person."}, {"fe22": "Imagine teaching students who live in a fire house because they were kicked out of their house, who are pregnant or taking care of an infant, who are working full-time either to support themselves or help support their families. NOW, do your job."}, {"4a13": "Charter schools are not all private schools. My school is a public charter school. About 70% of our population qualifies for free and reduced lunch, and more than 20% are special needs. My school does not shop for students in the priciest districts. Many of our students come to my school out of desperation: a student with an IEP that is not being honored; a student from an inner city school district where guns and violence take precedence over learning; a student who was bullied mercilessly because he or she is obese, or shy, or is LGBTQ+. I have students with medical conditions who require frequent doctor’s appointments and sometimes hospitalization. They come to my school from all parts of the state, from countless school districts, dragging with them years of academic issues, expectations that weren’t met, problems that weren’t dealt with."}, {"3d39": "Sometimes they come because they have outside interests or career-oriented activities that their brick-and-mortar school is not flexible enough to accommodate. Or they are well ahead of where they should be for their age and grade level, and their school district can provide nothing to enrich their education or to push them to where they are once again challenged."}, {"fec2": "They come throughout the year, and we have to meet them where they are and bring them to where they need to be. They take the state standardized tests and many of them do poorly because of years of neglect, but their score is attributed to their short time at my school."}, {"0f39": "For my students, cyber school is a chance to receive an education in the way that best suits their needs. My students live all over the state of Pennsylvania in cities, the suburbs, and in rural areas. Some work, others are involved in sports or junior military training programs. Others volunteer in hospitals and museums. I once had a student, also a dancer, who traveled to New York with her mother’s dance company regularly. She kept up with assignments and lessons she missed by watching the recordings of live classes and letting me know if she needed clarification. I have students who have gone on to the University of Colorado, New York University, Dartmouth College and Lehigh University. A current student asked me to write a letter of recommendation because she wants to attend the summer program offered by Harvard. She plans to go to an Ivy League school and pursue a career in law."}, {"b411": "I once had a student whose 9-month old crawled under the couch while we were in a one-on-on session working on an assignment. She was pretty distracted by that until I suggested that as long as she knew her daughter was, then why worry? She wasn’t getting into trouble. We laughed, I waited for her to retrieve her daughter, and we got back to work. Another student missed a lot of classes because she had to accompany her grandmother to doctor’s appointments and act as a translator because her grandmother did not speak English. I worked with her one-on-one to keep her caught up in class and ensure she understood the material we’d covered. I have students who struggle to focus because of upcoming court dates where they have to testify against a parent for neglect, or against a family friend for rape. I have students who are in and out of mental health treatment hospitals, who undergo major surgery or who miss class for their therapy appointments. These are the students who tell me they love our school because all of the fear, harassment, and tension they experienced in their brick and mortar schools is gone and now they can concentrate on their education. My school is a safe place where every student is welcomed and every student is keenly aware that we treat each other respectfully and gently. The only person who gets teased in my classes is me: I have been dubbed “The Suburban Legend” by my students in my 12:30 class. Memes of my face on the web cam are created regularly and shared in class. I have a thick skin."}, {"1406": "Cyber school is not a cold, isolated experience. My school offers countless activities for all grade levels from college visits, museum tours and roller skating parties, and even proms. My students come to class ready to talk and joke and do their best to be enthusiastic about the literature we read, which is not always easy. We read poetry and plays and watch The Great Gatbsy and heckle Tom Buchanan. I make them write and write often: creative assignments, essays and research projects. We discuss, analyze, share and work together to understand how to read and write about the literature piece, the themes, social commentary and author purpose. We make connections between the ideas of the past and the issues of our present. I use videos to enliven their virtual experience and the web cam to create a feeling of truly being in my classroom. I’ve been on the webcam every single day of every school year since 2012 and have long gotten over worrying about my hair or makeup or what shirt I am wearing. My students don’t care what I look like, although they notice every tiny change: did you get your hair cut? You’re wearing earrings today! And my favorite: you look tired."}, {"33e5": "In many ways the relationship I have with my students is more intimate than the relationships I might have with students in a brick and mortar school. My students are in their bedrooms, at the table in their kitchen or dining room or on the couch. They show me pictures of themselves, their baby brothers and sisters, their dogs and cats. They tell me when they are taking their driver’s license tests, and we celebrate when they get their license. They tell me about the book they are writing or the performance their marching band took part in, or when they earn a new belt in Karate. They tell me about their part-time jobs and their birthday celebrations, often sharing pictures of themselves on the classroom whiteboard, which the other students love."}, {"e29a": "Cyber schools exist because there are students who will not thrive in a traditional classroom. I have a student whose father was diagnosed with stage IV cancer right before Christmas and she is able to be home with him until the end. My students have been bullied by students and by their teachers at their brick and mortar schools. Some of my students are dealing with medical conditions that often cause them to miss school for doctor’s appointments, blood work or hospitalization. I have students who are caring for an infant, feeding a baby while in my live class session because their parents work and there is no one at home to help. Imagine going to high school while caring for an infant. Can you? I have students who do it."}, {"56bd": "Cyber school is a flexible, safe place for these types of students. It provides these students with ability to continue their high school education and graduate with a diploma instead of being badgered by truancy officers, fined by the courts for multiple absences and then dropping out at 18. My students no longer have to deal with bullies commenting on their physical appearance, their clothes, their sexuality or their gender. AND they have teachers who are certified, mostly dual certified with masters degrees and some with doctoral degrees. These teachers wear hats, do the ice bucket challenge, sing songs and generally make fools of themselves on the web cam to engage and make connections with their students. We create tests and writing assignments and projects, and we could probably recite the Common Core standards for our subject area if you had the time and inclination to listen."}, {"c077": "School choice is not about taking away money from brick and mortar schools. Cyber charter schools are not out to defund the brick and mortar schools. We exist for a reason and perhaps the administrators at the brick and mortar schools should ask themselves why that is, instead of bashing what they clearly don’t fully understand. The current funding model, where school tax money goes to the district and is then paid to the charter school clearly doesn’t work. Many brick-and-mortar schools withhold these funds for as long as possible, putting a burden on the charter school. Charter schools have employees to pay, programs to pay for and students to educate. The money for each student’s education should follow the student directly and not be diverted through a district whose administrators are politically aligned against school choice. Withholding funds and limiting choice hurts the students and families who need a better educational option."}, {"d56a": "Not every student is a good candidate for cyber school. Cyber school students have the increased responsibility of managing themselves — logging into their online classes, reaching out to a teacher for help, staying focused when the TV, the video game, their phone is tantalizingly close. I have had students who did not log into their online classes, did not complete any work, and could not be reached through email or by phone. They skipped in-person appointments with their family coach and their parents were either unaware, didn’t care or were unable to support their student. Perhaps if we worked together, placing students in the best environment to suit their personal and academic needs, our test scores and graduation rates would be higher. Maybe brick-and-mortar schools should see students leaving for cyber schools as a message that their needs are not being met."}, {"1d5d": "Public cyber schools must offer the same state tests as brick and mortar schools, but with the added expense of renting testing sites in churches, at colleges and in libraries. Each year, I and hundreds of my colleagues travel all over the state of Pennsylvania to administer PSSA tests and Keystone exams for 3–5 days. Not only must I plan days of lessons my students can do on their own, but I spend four to five hours on my feet, walking around a classroom, monitoring students taking standardized tests. When I get home, I have to check in on my students to ensure they are progressing through the self-paced lessons I assigned for the day, answer their emails and grade their assignments."}, {"1223": "So, before you grab a stick and run out to bash cyber schools, remember, if you’ve never been involved in a cyber school, taught in one or chosen one for your child, then you may not have all of the facts. Teachers often complain that non-teachers think they know teaching and pass judgement without ever having experienced teaching. The same holds true for cyber schools. If you haven’t worked for one, you can’t know the challenges, the triumphs or the frustrations that every day brings. Educate yourself and make public education, all types of public education, a welcoming place for all."}, {"75b0": "If you related to this piece, please click on the heart icon ❤️ and consider following Teaching in Trump’s America on Facebook and Twitter."}], "child": "401_1\t401_2\t401_3\t401_4"}