{"name": "403", "parent": "", "content": "What do we mean by cheating? If I allow a machine like this at the library to automatically scan and check out all of my books for me, I’m saving time and effort, not cheating. | Photo Credit: “Automatic Checkout at the Union City Library” by lantzilla https://flickr.com/photos/lantzilla/172301643 is licensed under CC BY-NC-ND I think it’s time for us to reconsider how we define cheating. I just received a survey soliciting tips for 1:1 schools (1 device per student) on how to prevent students from cheating by using the computers. On the surface, I get it. Our background of teaching and learning in most cases involves students being tasked with consuming knowledge and then being asked to answer questions that assess the efficacy of that consumption. There is clearly going to be disruption to this long-standing paradigm when every student has a high-powered answer box (in the form of a Chromebook, laptop, iPad, etc) sitting in front of them. On the surface, it begs the question: How do we prevent students from cheating when the answer box is sitting right there? While this “How do we prevent cheating?” question is predictable, I’m increasingly convinced that it is not the appropriate question to be asking. In the Real World, if the right answer is just a google search away, our boss wants us doing a google search. It’s a waste of her money to pay us to build from scratch when we can find the exact same thing more quickly for literally pennies on the dollar of her resources. Further, in the Real World of the not-too-distant future, it’s a reasonable assumption that most questions with objectively right answers won’t be handled by humans at all but rather by the artificial intelligence that replaces us in these tasks. If our students are successfully cheating in how they go about finding correct answers, perhaps the real problem is that we are asking them the wrong questions. I’m not trying to defend unethical behavior. I am, however, a firm believer that we are tasked with preparing students for successful futures and if we are assessing them in ways that won’t meaningfully impact their progress toward successful futures then it’s difficult to assign much weight to the cheating. If a kid cheats at a classroom game of Heads Up, 7Up we don’t really care because the game is without consequence. Likewise, if the assessment is not meaningful, why should we care that it’s being gamed? I think any resources dedicated to combatting cheating on an assessment that has as much impact on students’ futures as a game of Heads Up, 7Up are being misallocated. That said, cheating is wrong and even small acts of cheating can one day have severe consequences. I’m sure that the mathematicians at Enron, for example, didn’t get their start with dishonesty by dealing with sums in the millions and billions, much less with financial fraud. So, if you’ll allow me to walk back from viewing cheating solely through the lens of the task’s impact on students’ futures, what if we tweaked the question to be about whether or not it would be considered cheating in the Real World? If, in a non-academic Real World setting, the expectation would be to utilize technology in order to answer the question, should we consider it cheating to utilize technology in order to answer the question in school? If our students are successfully “cheating” in how they go about finding correct answers, I wonder if the shift needs to be on the side of the educators, not the students. Maybe, the students are choosing the right path and we’re wrong in condemning it. Perhaps we need to redefine academic cheating by aligning it with what would be considered cheating outside of school. And perhaps we need to do something about our own complicity in the problem of cheating with tech by presenting our students with challenges that don’t invite students to take shortcuts in order to cheat because there are aren’t shortcuts to take. How might eliminating the shortcuts look? This is a familiar concept to teachers utilizing Project Based Learning, in which learners are given (or themselves generating) novel questions for inquiry. Because there is no designated correct answer to look up, so students must wrestle with the problem and find their own path to viable solutions. Another familiar example is to borrow from our colleagues teaching Geometry. When I was a high school student, I was taught how to do a mathematical proof that included both my solutions and a sort of running narrative about how I got there. In the Humanities, rather than take the narrow view of assessing only what students know, we could pivot our approach to actually encourage them to utilize outside sources and, as in Geometry, explain how these sources were applied in informing students’ solutions. Shifts such as these help us move from assessing knowledge to assessing higher level skills such as Critical Thinking, Synthesis and Analysis. In addition to it being much more difficult to stealthily game such assessments, it puts us in the position of measuring student growth in skills that are actually impactful in preparing them for successful futures in a world in which they are competing with outsourcing and automation. Please leave responses. Please push back. Please further the conversation. And if you like this post, please click the heart to recommend it. Your recommendation will help make the post more discoverable to others who might appreciate it and you will bring the kind of joy into my life that normally only comes with receiving an additional 20 free minutes on a 50 minute massage. My back hurts, I need those extra 20 minutes! Also, be sure to subscribe to The Synapse for more great stories from authentic voices in Education. Lastly, if you dig that Creative Commons citation of the photo at the top, I created it with Alan Levine’s handy dandy flickr creative commons attribution plug in. It’s free, easy to use, can be added as a widget to your browser to automate the attribution process. It is available here. ", "title": "What do we mean by cheating", "sentences": [{"4eb6": "What do we mean by cheating?"}, {"5c4e": "If I allow a machine like this at the library to automatically scan and check out all of my books for me, I’m saving time and effort, not cheating. | Photo Credit: “Automatic Checkout at the Union City Library” by lantzilla https://flickr.com/photos/lantzilla/172301643 is licensed under CC BY-NC-ND"}, {"4191": "I think it’s time for us to reconsider how we define cheating."}, {"0855": "I just received a survey soliciting tips for 1:1 schools (1 device per student) on how to prevent students from cheating by using the computers. On the surface, I get it. Our background of teaching and learning in most cases involves students being tasked with consuming knowledge and then being asked to answer questions that assess the efficacy of that consumption. There is clearly going to be disruption to this long-standing paradigm when every student has a high-powered answer box (in the form of a Chromebook, laptop, iPad, etc) sitting in front of them. On the surface, it begs the question: How do we prevent students from cheating when the answer box is sitting right there?"}, {"fcb6": "While this “How do we prevent cheating?” question is predictable, I’m increasingly convinced that it is not the appropriate question to be asking."}, {"714c": "In the Real World, if the right answer is just a google search away, our boss wants us doing a google search. It’s a waste of her money to pay us to build from scratch when we can find the exact same thing more quickly for literally pennies on the dollar of her resources. Further, in the Real World of the not-too-distant future, it’s a reasonable assumption that most questions with objectively right answers won’t be handled by humans at all but rather by the artificial intelligence that replaces us in these tasks."}, {"c383": "If our students are successfully cheating in how they go about finding correct answers, perhaps the real problem is that we are asking them the wrong questions."}, {"8f78": "I’m not trying to defend unethical behavior. I am, however, a firm believer that we are tasked with preparing students for successful futures and if we are assessing them in ways that won’t meaningfully impact their progress toward successful futures then it’s difficult to assign much weight to the cheating."}, {"99ad": "If a kid cheats at a classroom game of Heads Up, 7Up we don’t really care because the game is without consequence. Likewise, if the assessment is not meaningful, why should we care that it’s being gamed? I think any resources dedicated to combatting cheating on an assessment that has as much impact on students’ futures as a game of Heads Up, 7Up are being misallocated."}, {"7260": "That said, cheating is wrong and even small acts of cheating can one day have severe consequences. I’m sure that the mathematicians at Enron, for example, didn’t get their start with dishonesty by dealing with sums in the millions and billions, much less with financial fraud. So, if you’ll allow me to walk back from viewing cheating solely through the lens of the task’s impact on students’ futures, what if we tweaked the question to be about whether or not it would be considered cheating in the Real World?"}, {"4e1d": "If, in a non-academic Real World setting, the expectation would be to utilize technology in order to answer the question, should we consider it cheating to utilize technology in order to answer the question in school? If our students are successfully “cheating” in how they go about finding correct answers, I wonder if the shift needs to be on the side of the educators, not the students. Maybe, the students are choosing the right path and we’re wrong in condemning it."}, {"d666": "Perhaps we need to redefine academic cheating by aligning it with what would be considered cheating outside of school. And perhaps we need to do something about our own complicity in the problem of cheating with tech by presenting our students with challenges that don’t invite students to take shortcuts in order to cheat because there are aren’t shortcuts to take."}, {"0621": "How might eliminating the shortcuts look?"}, {"195e": "This is a familiar concept to teachers utilizing Project Based Learning, in which learners are given (or themselves generating) novel questions for inquiry. Because there is no designated correct answer to look up, so students must wrestle with the problem and find their own path to viable solutions."}, {"c61b": "Another familiar example is to borrow from our colleagues teaching Geometry. When I was a high school student, I was taught how to do a mathematical proof that included both my solutions and a sort of running narrative about how I got there. In the Humanities, rather than take the narrow view of assessing only what students know, we could pivot our approach to actually encourage them to utilize outside sources and, as in Geometry, explain how these sources were applied in informing students’ solutions."}, {"de94": "Shifts such as these help us move from assessing knowledge to assessing higher level skills such as Critical Thinking, Synthesis and Analysis. In addition to it being much more difficult to stealthily game such assessments, it puts us in the position of measuring student growth in skills that are actually impactful in preparing them for successful futures in a world in which they are competing with outsourcing and automation."}, {"1625": "Please leave responses. Please push back. Please further the conversation. And if you like this post, please click the heart to recommend it. Your recommendation will help make the post more discoverable to others who might appreciate it and you will bring the kind of joy into my life that normally only comes with receiving an additional 20 free minutes on a 50 minute massage. My back hurts, I need those extra 20 minutes!"}, {"eb56": "Also, be sure to subscribe to The Synapse for more great stories from authentic voices in Education."}, {"703e": "Lastly, if you dig that Creative Commons citation of the photo at the top, I created it with Alan Levine’s handy dandy flickr creative commons attribution plug in. It’s free, easy to use, can be added as a widget to your browser to automate the attribution process. It is available here."}], "child": "403_1403_1"}