{"name": "407", "parent": "", "content": "How India saved its internet from greedy corporations In early 2015, the Telecom Authority of India (TRAI) was hijacked by the telecom companies that it was supposed to be regulating. It released a consultation paper on Net Neutrality for public feedback. The question was whether services like Whatsapp and Viber should be brought under an expensive licensing regime. TRAI put a tiny, hardly noticeable link to the paper on their official government website. They also put in place a tight deadline for public discussion. They hoped the public wouldn’t notice this proposal to fundamentally change in how the internet worked. Whatsapp had made messaging free of cost. Before Whatsapp, we had to buy costly messaging packs to send short messages. Every international message used to cost around Rs 5 (US $0.08) — a huge source of revenue for telecoms. Next, several of these messaging apps started offering free calls. This cut into telecom operator revenues even more. Since these messaging apps made a lot of money through advertising, these telcoms hope to take a cut of it themselves. Indian activists set up a website, savetheinternet.in, where people could answer all the questions that TRAI’s consultation paper was asking. People could then send these answers to TRAI with just a few clicks. This was a smart move. But still, most people where unaware of the importance of Net Neutrality — the basic rule that all internet traffic should be treated equally, regardless of where it comes from, and that the internet access should be treated like any other utility. Net Neutrality is a complicated concept, and the typical Indian had no understanding of it, or its importance. So we needed to an effective way to communicate all this. Thankfully, the comedy group All Indian Bakchod stepped in to help communicate this. Here’s their first video: Indians sent a million emails to TRAI. (TRAI retaliated by “accidentally” leaking those million email addresses to public.) Facebook and the telecom operators responded by changing their campaign to try and fool the Indian public into thinking that these corporations were actually in favor of Net Neutrality. These corporations tried to define Net Neutrality as everyone being able to access some things on the internet. In fact, Net Neutrality is about everyone being able to access everything on the internet. Facebook launched Internet.org with a major telecom operator, Reliance. They claimed they were providing free internet. In reality, they were providing a very limited slice of the internet with only the websites of companies who were registered with Internet.org. And Facebook had full control of which websites could register. Of course, none of this was clearly mentioned in their innocuous-seeming promotional videos. Facebook tried to trick the Indian public into thinking they were making these websites available as out of charity. In reality, they were very clearly violating the principle of Net Neutrality. Next, TRAI made it more difficult to protest Facebook’s actions by moving the discussion to mygov.in. Now a citizen had to go through a long account registration process in order to make a public comment, and they only had a few days to do so. All Indian Bakchod again moved in to cast light on these corrupt actions with a second video: As a result, Facebook’s Internet.org effort was bashed all over the internet for violating Net Neutrality. Facebook rebranded it “Free Basics” and began an expensive marketing campaign to publicize it in every corner of the country. Look at the normal people just going about their lives, using Facebook for free. They were designed to make people think, “How can Free Basics be a bad thing?” This even made lay-people question the activists. What is your problem if they are giving us free internet? Free basics was just another name for Internet.org. Though they changed their branding outside, the source code said otherwise. Designers responded with parody ads drawing attention to the folly of Free Basics. And All India Bakchod came back with a third video: The corporations quietly convinced TRAI to set up yet another short deadline for public discussion. In that time, a lot of emails were sent to TRAI through savetheinternet.in. There were protests in the street. The Indian media hosted discussion panels where they brought experts from different fields to talk about Net Neutrality. Here’s a photo of News 9's discussion panel. The Grammy Award winner Ricky Kej stepped in to speak up for the importance of Net Neutrality. I was also part of the same panel. Finally, all of these efforts paid off. The public outcry forced TRAI to side with citizens, and against the corporations. They ruled in favor of preserving Net Neutrality. We had won. In the big scheme of things, I had hardly contributed anything. The real heroes are the people behind savetheinternet.in like Kiran Jonnalagadda, Nikhil Pahwa and Tanmay Bhat’s team from All India Bakchod, among many other activists. You can read more about them here. Some of the corporations and their investors weren’t very happy about this. Venture Capitalist Marc Andreessen tweeted this: After getting utterly trashed in the Indian and American media, he was forced to publicly apologize for this. India’s story had a happy ending. But America’s may not. America’s president is currently working to destroy Net Neutrality. The telecom companies have lobbied congress and taken over the Federal Communications Commission. All that stands between these corporations and their bigger profits is us — the public. I hope India’s Net Neutrality heroes inspire you. Don’t remain silent. Raise your voice. Educate yourself on the importance of Net Neutrality. Explain its importance to your friends, family, and followers about its importance. Together we can make sure that America continues to enjoy the same open internet that India does. Let’s do this! ", "title": "How India saved its internet from greedy corporations", "sentences": [{"c472": "How India saved its internet from greedy corporations"}, {"27bd": "In early 2015, the Telecom Authority of India (TRAI) was hijacked by the telecom companies that it was supposed to be regulating. It released a consultation paper on Net Neutrality for public feedback."}, {"5072": "The question was whether services like Whatsapp and Viber should be brought under an expensive licensing regime."}, {"51a3": "TRAI put a tiny, hardly noticeable link to the paper on their official government website. They also put in place a tight deadline for public discussion. They hoped the public wouldn’t notice this proposal to fundamentally change in how the internet worked."}, {"4a54": "Whatsapp had made messaging free of cost. Before Whatsapp, we had to buy costly messaging packs to send short messages. Every international message used to cost around Rs 5 (US $0.08) — a huge source of revenue for telecoms."}, {"f958": "Next, several of these messaging apps started offering free calls. This cut into telecom operator revenues even more. Since these messaging apps made a lot of money through advertising, these telcoms hope to take a cut of it themselves."}, {"e00c": "Indian activists set up a website, savetheinternet.in, where people could answer all the questions that TRAI’s consultation paper was asking. People could then send these answers to TRAI with just a few clicks."}, {"2c2f": "This was a smart move. But still, most people where unaware of the importance of Net Neutrality — the basic rule that all internet traffic should be treated equally, regardless of where it comes from, and that the internet access should be treated like any other utility."}, {"21dc": "Net Neutrality is a complicated concept, and the typical Indian had no understanding of it, or its importance. So we needed to an effective way to communicate all this."}, {"bda4": "Thankfully, the comedy group All Indian Bakchod stepped in to help communicate this. Here’s their first video:"}, {"4cdb": "Indians sent a million emails to TRAI. (TRAI retaliated by “accidentally” leaking those million email addresses to public.)"}, {"e314": "Facebook and the telecom operators responded by changing their campaign to try and fool the Indian public into thinking that these corporations were actually in favor of Net Neutrality."}, {"cadb": "These corporations tried to define Net Neutrality as everyone being able to access some things on the internet. In fact, Net Neutrality is about everyone being able to access everything on the internet."}, {"fa3f": "Facebook launched Internet.org with a major telecom operator, Reliance. They claimed they were providing free internet. In reality, they were providing a very limited slice of the internet with only the websites of companies who were registered with Internet.org. And Facebook had full control of which websites could register."}, {"7491": "Of course, none of this was clearly mentioned in their innocuous-seeming promotional videos."}, {"a075": "Facebook tried to trick the Indian public into thinking they were making these websites available as out of charity. In reality, they were very clearly violating the principle of Net Neutrality."}, {"26a6": "Next, TRAI made it more difficult to protest Facebook’s actions by moving the discussion to mygov.in. Now a citizen had to go through a long account registration process in order to make a public comment, and they only had a few days to do so."}, {"3a23": "All Indian Bakchod again moved in to cast light on these corrupt actions with a second video:"}, {"dcdc": "As a result, Facebook’s Internet.org effort was bashed all over the internet for violating Net Neutrality. Facebook rebranded it “Free Basics” and began an expensive marketing campaign to publicize it in every corner of the country."}, {"11e8": "Look at the normal people just going about their lives, using Facebook for free. They were designed to make people think, “How can Free Basics be a bad thing?” This even made lay-people question the activists."}, {"ee1e": "What is your problem if they are giving us free internet?"}, {"faad": "Free basics was just another name for Internet.org. Though they changed their branding outside, the source code said otherwise."}, {"10dc": "Designers responded with parody ads drawing attention to the folly of Free Basics."}, {"bca4": "And All India Bakchod came back with a third video:"}, {"06cb": "The corporations quietly convinced TRAI to set up yet another short deadline for public discussion. In that time, a lot of emails were sent to TRAI through savetheinternet.in."}, {"e18f": "There were protests in the street. The Indian media hosted discussion panels where they brought experts from different fields to talk about Net Neutrality."}, {"b092": "Here’s a photo of News 9's discussion panel. The Grammy Award winner Ricky Kej stepped in to speak up for the importance of Net Neutrality."}, {"1d5b": "I was also part of the same panel."}, {"88bb": "Finally, all of these efforts paid off. The public outcry forced TRAI to side with citizens, and against the corporations. They ruled in favor of preserving Net Neutrality."}, {"5099": "We had won."}, {"ff7b": "In the big scheme of things, I had hardly contributed anything. The real heroes are the people behind savetheinternet.in like Kiran Jonnalagadda, Nikhil Pahwa and Tanmay Bhat’s team from All India Bakchod, among many other activists. You can read more about them here."}, {"c037": "Some of the corporations and their investors weren’t very happy about this. Venture Capitalist Marc Andreessen tweeted this:"}, {"ce56": "After getting utterly trashed in the Indian and American media, he was forced to publicly apologize for this."}, {"9779": "India’s story had a happy ending. But America’s may not."}, {"1cd7": "America’s president is currently working to destroy Net Neutrality. The telecom companies have lobbied congress and taken over the Federal Communications Commission. All that stands between these corporations and their bigger profits is us — the public."}, {"0468": "I hope India’s Net Neutrality heroes inspire you."}, {"f805": "Don’t remain silent. Raise your voice. Educate yourself on the importance of Net Neutrality. Explain its importance to your friends, family, and followers about its importance."}, {"b684": "Together we can make sure that America continues to enjoy the same open internet that India does. Let’s do this!"}], "child": "407_1\t407_2\t407_3\t407_4\t407_5\t407_6\t407_7\t407_8\t407_9\t407_10\t407_11\t407_12\t407_13\t407_14\t407_15\t407_16\t407_17\t407_18\t407_19\t407_20\t407_21\t407_22\t407_23\t407_24\t407_25"}