{"name": "409", "parent": "", "content": "Meet One of the Most Brilliant Investors in Silicon Valley Who is the man behind some of the most innovative companies in the world, including Tesla, SpaceX, Planet, D-Wave, and Synthetic Genomics? His name is Steve Jurvetson, and if you’re a tech enthusiast, then you’re intimately familiar with his daring venture capital work. Steve Jurvetson is the “J” at DFJ, a Silicon Valley venture capital firm focused on early and growth-stage investments in consumer, enterprise, and disruptive technologies. He’s a board member at all of the companies listed above. And, in his words, he’s “especially interested in machine intelligence, software-defined hardware, and technology futures across ever-widening frontiers.” What excites him from an investment standpoint are the “fringe ideas”—companies that sit on the border between crazy and revolutionary. Jurvetson actively seeks out companies that focus on deep learning, sustainable transportation, synthetic biology, genomics, and robotics. In short, he’s drawn to the head-spinning industries of the future. 🔮 While a conversation with Jurvetson would likely make the average person’s brain hurt a little, there is a certain humility about him. Case in point: during the LIVE Chat, he texted his son for his opinion on a Product Hunt community member’s question. He’s always open to learning—even from his own kid. 📚💡It comes as no surprise, then, that Jurvetson was named by Forbes as one of “Tech’s Best Venture Investors” and appointed a Presidential Ambassador for Global Entrepreneurship by President Barack Obama in 2016. No big deal. 🙌 After you read through the highlights of his recent Product Hunt LIVE Chat, it will be abundantly clear to you that this is a man who is not only brilliant, but infectiously curious and thoughtful. We hope you enjoy this stimulating conversation with the ultimate student and teacher, Steve Jurvetson. If you had to swap lives with a tech CEO for a week, who would it be and why? — Ben Tossell The key part of the question for me is the timeframe of a week. Rather than imagine that I could get anything done in a week that would stick after I’m gone, I approach the question from a learning perspective: Where could I learn the most in a week from being on the inside, and presumably, being able to ask any question of the team. So I’d say Google. I’d want to learn about how they are using deep learning in every single product. I’d have so many questions for the Android team and Google brain. And I’d want to see what they are doing with custom chips (TPU) and their 8x8 quantum computer in development. When it comes to robots and autonomous vehicles, many have a fearful, dystopian view of the future. What do you say to the “Debbie Downers”? — Stacey Randecker Some of this comes from my exposure to the future, and experiencing it directly (with a Rethink humanoid robot at the office, and much of my commute done by autonomous machine). We trust ourselves to the robots on a plane, because they are already so much better than a pilot. When being driven by a machine, I get a peek into that inevitable future as well. In general, when it comes to AI, many of us subconsciously cling to the selfish notion that humanity is the endpoint of evolution. In the debates about machine intelligence and genetic enhancements, there is a common and deeply rooted fear about being surpassed — in our lifetime. But, when framed as a question of parenthood (would you want your great grandchild to be smarter and healthier than you?), the emotion often shifts from a selfish sense of supremacy to a universal human search for symbolic immortality. What does the future of technology look like? — Chad Whitaker First reaction: deep learning and iterative algorithms in general (directed evolution, generative design, and all of the machine intelligence approaches) => many consumer product effects, such as a renaissance in voice interfaces (imagine an Amazon Alexa interface for under $1 on any consumer product, including non-internet connected & battery powered). Second: be prepared for ubiquitous broadband rolling out by satellite. 2->6B people online faster than forecasters predict. Would you (hypothetically) fly around the Moon on, let’s say, a SpaceX Dragon 2 capsule? — Danny For sure! But, unlike the Apollo era, in the commercial space era, it should become cheaper and safer over time. I have two specific missions in mind (and I don’t have much interest in suborbital flight or anything shy of these): •Spending a few days in a commercial space hotel in low Earth orbit •Lunar orbital mission, going much closer to the surface than Apollo X, but not landing. For both trips, I am excited about the photography. For the lunar trip, there would not be as many creature comforts or space for weightless play, but the views are pretty breathtaking. Earthrise, the dark side of the Moon, Earth and Moon at various distances. Since the Moon has no atmosphere, it presents a unique orbital opportunity — we could fly incredibly close to the surface while staying in lunar orbit. Apollo X dropped to an orbit 47K feet off the surface — like a private jet altitude over Earth. If the goal is tourism, you could go much lower, and with no landing; it could have a downward facing window optimized for the views. I would want to figure out the trade-off of orbital altitude and surface speed — skimming a thousand feet over the highest crater (Zeppelin altitudes) would be amazing, but might be dizzying. But, since the moon has 1/6 the mass of Earth, the orbital speeds at any given altitude are about 1/6 as fast… so it could be slow and low, that is the tempo… =) Why not land? The cost and complexity just explodes, as the Russians discovered in the space race. For a new tourist activity, so does the risk. And to what benefit? With the full Apollo stack with EV on the moon, yes, you could cover some distance, but not as much as you can see in orbit. Bouncing around on foot just does not grab me as an essential first person experience. And, Moon gravity and Mars gravity is easily simulated on the parabolic planes if that’s the key attraction. And all that weight and design constraint would likely tradeoff with the window-optimized design. I would rather spend more time in orbit, at various heights, than attempt a landing. I do wonder about a spacewalk. These EVA activities are a much easier engineering challenge, and might not trade-off with the earlier goals. Michael Collins marveled at his EVA in Earth orbit: “This is the best view of the universe that a human has ever had. We are gliding across the world in total silence, with absolute smoothness; a motion of stately grace which makes me feel God-like as I stand erect in my sideways chariot, cruising the night sky. I am in the cosmic arena, the place to gain a celestial perspective; it remains only to slow down long enough to capture it, even a teacup will do, will last a lifetime below.” When do you think self-driving cars will be the norm ? — Joaquín Gulloso Adoption rates are hard to predict, but I predict that by 2020 we will no longer debate the inevitability of autonomous electric vehicles…when we first experience the convenience and efficiency of urban autonomous driving services. I don’t want to be a driving machine on my daily commute; I want to be driven by a machine. What impact do you see nanotechnology having in the next 10 years outside of computing and medicine? — Steven McCloskey I still think those are the major impact areas because there are nano-scale structures we care about, and each addresses the “interface problem” I highlighted in the early days. As a thought experiment, imagine that I could hand you today any nanotech marvel of your design — a molecular machine as advanced as you would like. What would it be? A supercomputer? A bloodstream submarine? A matter compiler capable of producing diamond rods or arbitrary physical objects? Pick something. Now, imagine some of the complexities: Did it blow off my hand as I offer it to you? Can it autonomously move to its intended destination? What is its energy source? How do you communicate with it? These questions draw the “interface problem” into sharp focus: Does your design require an entire nanotech industry to support, power, and “interface” to your molecular machine? As an analogy, imagine that you have one of the latest processors out of Intel’s wafer fab. How would you make use of the chip? You then need to wire-bond the chip to a larger lead frame in a package that connects to a larger printed circuit board, fed by a bulky power supply that connects to the electrical power grid. Each of these successive layers relies on the larger-scale precursors from above (which were developed in reverse chronological order), and the entire hierarchy is needed to access the potential of the microchip. For molecular nanotech, where is the scaling hierarchy? The business-driven paths to nanotech diverge into two strategies to cross the “interface” chasm — the biologically inspired bottom-up path, and the top-down approach of the semiconductor industry. The non-biological developers are addressing current markets in the micro-world while pursuing an ever-shrinking spiral of miniaturization that builds the relevant infrastructure tiers along the way. Not surprisingly, this is very similar to the path that has been followed in the semiconductor industry, and many of its adherents see nanotech as inevitable, but in the distant future. On the other hand, biological manipulation presents myriad opportunities to effect great change in the near-term. Drug development, tissue engineering, and genetic engineering are all powerfully impacted by the molecular manipulation capabilities available to us today. And genetically modified microbes, whether by artificial evolution or directed gene splicing, give researchers the ability to build structures from the bottom up. More from 2004 here. Being involved in all these incredible future-forward companies, what are you MOST interested in/excited by? — Ben Tossell Machine Intelligence. I first chose that as the “top tech trend” in 2013 (where we were asked to look forward 5 years to 2018). It was not a common theme for VCs back then. And it is just beginning. In a recent post, I tried to summarize my enthusiasm. I think the application of iterative algorithms (e.g., machine learning, directed evolution, generative design) to build complex systems is the most powerful advance in engineering since the scientific method. Machine learning allows us to build software solutions that exceed human understanding, and shows us how AI can innervate every industry. What does success look like for you? — Seth Williams Lifelong learning, love, and an ever-expanding circle of empathy. As humanity moves from family to tribe to nation to globe, I think we will expand further still and develop deeper empathy for all sentient beings. (Including the AIs to come. We should think about a legal framework that enfranchises them rather than think we can enslave them.) How do you approach building software-defined hardware products/services today? — Kunal Bhatia I generally ask why the idea could not have been possible 5 years ago (10 at the most). I think about Moore’s Law and the tipping point for an experimental science becoming a simulation science. The peace dividend of the cell phone wars makes the components of a satellite or robot dirt cheap, and the value migrates to the software and services layer (as it did with phones and is underway with rockets and cars and almost everything physical over time). Cheap inference engines, cheap powerful sensors, and better batteries => The internet of things is becoming the sensory cortex of the planet. Example: Mythic Biomimicry If you could start a new government / country from scratch, what would be most important to leverage from what you’ve learned helping these complex companies thrive? — Rob Phillips Focus on a constitution that protects the unrepresented and the new entrant. Don’t let the lottery winner write the rules for the lottery. Foster competitive governance, like China did in establishing Shenzhen. Imagine an FDA-free zone. I heard Paul Romer say something interesting about charter cities: “Shenzhen did not exist in 1980. Today it has 10 million people, and the highest income per capita in China. China set up Shenzhen as a place where foreign firms can come in and exploit Chinese labor. They told the people of China, ‘If you don’t like that, don’t go there.’ It was an opt-in city driven by market choice. Now imagine a new city forming with the charter that it will burn no solid or liquid fuel. Or a new city in India founded with the charter that women will be free and they will be safe. If you disagree with these principles, don’t move there.” What do you see as the biggest barrier to democratizing the future that you have been fortunate to experience? — Adam Little We are working on #2, but need mimetic countermeasures for #1. What’s your take on moon habitats and moon travel, as opposed to Mars? — Jüri Kaljundi The moon is great for tourism since a lot of fun fits in a one-week trip. Mars is a two+ year commitment (if you plan to stay for a bit once you arrive, versus a slingshot return). You’ve got to wait for the planets to align for the return leg. So it makes more sense for colonization than tourism. We hosted a brainstorming session that concluded that we can pursue an economically self-sufficient lunar base for a one-time $5B investment. What is one thing about the future you believe in but very few others agree with you on? — Ben Tossell That we are in the middle of a sea change in how much of engineering will be done. It will be more like parenting than programming. The locus of learning shifts from end products to the process of their creation. An ever-growing percentage of software will be grown and an ever-growing percentage of compute will run on infrastructure that resembles the brain (massively parallel, fine grained architectures with in-memory compute and a growing focus on the memory and interconnect elements). And on a derivative note, I also believe that the conversion of every business into an information business will have profound aggregate effect, such as an accelerating rich-poor gap that is not self-rectifying. What if technology raises the bottom of the pyramid for all and democratizes upward mobility, yet at the same time, transforms it from a pyramid to a conical spike — where an ever-shrinking percentage of the population controls an even-growing percentage of an information-economy embedded with winner-take-all network effects and power laws? In short, I ask if the ironic byproduct of erasing the digital divide is a further acceleration of the rich-poor gap. What happens to peoples who opt out of the vector of progress, as the sea change of destiny becomes the drumbeat of decades, instead of centuries? What is the nature of work in the future? And how can our culture and the very fabric of society co-evolve with our technologies during the transition? It motivates me to address some basic human needs, like free healthcare forever. Free healthcare is something that is very possible. The main question needs to be, what perspective is that information being created from? Is it the conventional pharmaceutical approach? Or an integrative approach that encompasses the best of modern medicine?— David Joseph The learning comes from the people, just like for Google today. So it can incorporate non-traditional medicine as well. Everything that works. Imagine it starts with a simple mobile text interface, and as the next three billion people come online in this decade, it could become enriched with imagery and diagnostic sensors in the smartphones. The proposition for the consumer is free, unbiased advice as long as they respond to the daily prompts for input on the remedies tried and the progression of symptoms through resolution. The recommendations would come from a special purpose AI (using machine learning and then deep learning) that benefits from what would become the largest data set of over-the-counter, prescription and non-traditional remedies. What actually works? What is the actual rate of adverse events over time? (This data set alone could provide enough revenue to cover the marginal cost of operation.) The vast majority of health care does not require surgery, especially in the developing world (think infectious diseases and nutrition), but when it is required, the system could help point people to the specialist they need. The service would be offered in all languages with voice/text conversion for the illiterate. Regional epidemiologic patterns and proactive warnings would naturally follow as it becomes a trusted, life-saving advisor. As it scales, it could become a powerful distribution channel for generic drugs, priced at a small fixed margin over manufacturing cost. Since the system is the trusted advisor, the brand of the drug would be anonymous and there is no sales or marketing expense to reach this large customer base. What is your goal in the next 50 years, and what legacy do you wish to leave behind? — Edis Murtic There is so much to do, and if I can keep helping entrepreneurs forge the future, I know the biggest impact will be in sectors I could not name today. The most important company 20 years from now has not even been formed yet. So I focus on the process, not the product. How can I keep learning? Should I keep to my simple rule of investing in companies that are unlike anything I have seen before? (That is an example of focusing on process, not sector.) And I plan to continue giving any gain I make to charitable causes, which themselves can have ever growing impact. I have never sold a share of any DFJ investment, but I do donate the public shares over time. It is incredibly rewarding. Check out the full Product Hunt LIVE Chat with Steve Jurvetson HERE: ", "title": "Meet One of the Most Brilliant Investors in Silicon Valley", "sentences": [{"bff1": "Meet One of the Most Brilliant Investors in Silicon Valley"}, {"5f7d": "Who is the man behind some of the most innovative companies in the world, including Tesla, SpaceX, Planet, D-Wave, and Synthetic Genomics? His name is Steve Jurvetson, and if you’re a tech enthusiast, then you’re intimately familiar with his daring venture capital work."}, {"9a05": "Steve Jurvetson is the “J” at DFJ, a Silicon Valley venture capital firm focused on early and growth-stage investments in consumer, enterprise, and disruptive technologies. He’s a board member at all of the companies listed above. And, in his words, he’s “especially interested in machine intelligence, software-defined hardware, and technology futures across ever-widening frontiers.” What excites him from an investment standpoint are the “fringe ideas”—companies that sit on the border between crazy and revolutionary. Jurvetson actively seeks out companies that focus on deep learning, sustainable transportation, synthetic biology, genomics, and robotics. In short, he’s drawn to the head-spinning industries of the future. 🔮"}, {"2b22": "While a conversation with Jurvetson would likely make the average person’s brain hurt a little, there is a certain humility about him. Case in point: during the LIVE Chat, he texted his son for his opinion on a Product Hunt community member’s question. He’s always open to learning—even from his own kid. 📚💡It comes as no surprise, then, that Jurvetson was named by Forbes as one of “Tech’s Best Venture Investors” and appointed a Presidential Ambassador for Global Entrepreneurship by President Barack Obama in 2016. No big deal. 🙌"}, {"6693": "After you read through the highlights of his recent Product Hunt LIVE Chat, it will be abundantly clear to you that this is a man who is not only brilliant, but infectiously curious and thoughtful. We hope you enjoy this stimulating conversation with the ultimate student and teacher, Steve Jurvetson."}, {"644f": "If you had to swap lives with a tech CEO for a week, who would it be and why? — Ben Tossell"}, {"9911": "The key part of the question for me is the timeframe of a week. Rather than imagine that I could get anything done in a week that would stick after I’m gone, I approach the question from a learning perspective: Where could I learn the most in a week from being on the inside, and presumably, being able to ask any question of the team."}, {"a5b3": "So I’d say Google. I’d want to learn about how they are using deep learning in every single product. I’d have so many questions for the Android team and Google brain. And I’d want to see what they are doing with custom chips (TPU) and their 8x8 quantum computer in development."}, {"d931": "When it comes to robots and autonomous vehicles, many have a fearful, dystopian view of the future. What do you say to the “Debbie Downers”? — Stacey Randecker"}, {"538f": "Some of this comes from my exposure to the future, and experiencing it directly (with a Rethink humanoid robot at the office, and much of my commute done by autonomous machine). We trust ourselves to the robots on a plane, because they are already so much better than a pilot. When being driven by a machine, I get a peek into that inevitable future as well. In general, when it comes to AI, many of us subconsciously cling to the selfish notion that humanity is the endpoint of evolution. In the debates about machine intelligence and genetic enhancements, there is a common and deeply rooted fear about being surpassed — in our lifetime. But, when framed as a question of parenthood (would you want your great grandchild to be smarter and healthier than you?), the emotion often shifts from a selfish sense of supremacy to a universal human search for symbolic immortality."}, {"168f": "What does the future of technology look like? — Chad Whitaker"}, {"d375": "First reaction: deep learning and iterative algorithms in general (directed evolution, generative design, and all of the machine intelligence approaches) => many consumer product effects, such as a renaissance in voice interfaces (imagine an Amazon Alexa interface for under $1 on any consumer product, including non-internet connected & battery powered). Second: be prepared for ubiquitous broadband rolling out by satellite. 2->6B people online faster than forecasters predict."}, {"72e8": "Would you (hypothetically) fly around the Moon on, let’s say, a SpaceX Dragon 2 capsule? — Danny"}, {"c881": "For sure! But, unlike the Apollo era, in the commercial space era, it should become cheaper and safer over time. I have two specific missions in mind (and I don’t have much interest in suborbital flight or anything shy of these): •Spending a few days in a commercial space hotel in low Earth orbit"}, {"b98f": "•Lunar orbital mission, going much closer to the surface than Apollo X, but not landing."}, {"668b": "For both trips, I am excited about the photography. For the lunar trip, there would not be as many creature comforts or space for weightless play, but the views are pretty breathtaking. Earthrise, the dark side of the Moon, Earth and Moon at various distances. Since the Moon has no atmosphere, it presents a unique orbital opportunity — we could fly incredibly close to the surface while staying in lunar orbit. Apollo X dropped to an orbit 47K feet off the surface — like a private jet altitude over Earth. If the goal is tourism, you could go much lower, and with no landing; it could have a downward facing window optimized for the views. I would want to figure out the trade-off of orbital altitude and surface speed — skimming a thousand feet over the highest crater (Zeppelin altitudes) would be amazing, but might be dizzying. But, since the moon has 1/6 the mass of Earth, the orbital speeds at any given altitude are about 1/6 as fast… so it could be slow and low, that is the tempo… =)"}, {"7729": "Why not land? The cost and complexity just explodes, as the Russians discovered in the space race. For a new tourist activity, so does the risk. And to what benefit? With the full Apollo stack with EV on the moon, yes, you could cover some distance, but not as much as you can see in orbit. Bouncing around on foot just does not grab me as an essential first person experience. And, Moon gravity and Mars gravity is easily simulated on the parabolic planes if that’s the key attraction. And all that weight and design constraint would likely tradeoff with the window-optimized design. I would rather spend more time in orbit, at various heights, than attempt a landing."}, {"e3fb": "I do wonder about a spacewalk. These EVA activities are a much easier engineering challenge, and might not trade-off with the earlier goals. Michael Collins marveled at his EVA in Earth orbit: “This is the best view of the universe that a human has ever had. We are gliding across the world in total silence, with absolute smoothness; a motion of stately grace which makes me feel God-like as I stand erect in my sideways chariot, cruising the night sky. I am in the cosmic arena, the place to gain a celestial perspective; it remains only to slow down long enough to capture it, even a teacup will do, will last a lifetime below.”"}, {"36ee": "When do you think self-driving cars will be the norm ? — Joaquín Gulloso"}, {"4909": "Adoption rates are hard to predict, but I predict that by 2020 we will no longer debate the inevitability of autonomous electric vehicles…when we first experience the convenience and efficiency of urban autonomous driving services. I don’t want to be a driving machine on my daily commute; I want to be driven by a machine."}, {"4f54": "What impact do you see nanotechnology having in the next 10 years outside of computing and medicine? — Steven McCloskey"}, {"7ff0": "I still think those are the major impact areas because there are nano-scale structures we care about, and each addresses the “interface problem” I highlighted in the early days. As a thought experiment, imagine that I could hand you today any nanotech marvel of your design — a molecular machine as advanced as you would like. What would it be? A supercomputer? A bloodstream submarine? A matter compiler capable of producing diamond rods or arbitrary physical objects? Pick something."}, {"3be5": "Now, imagine some of the complexities: Did it blow off my hand as I offer it to you? Can it autonomously move to its intended destination? What is its energy source? How do you communicate with it? These questions draw the “interface problem” into sharp focus: Does your design require an entire nanotech industry to support, power, and “interface” to your molecular machine?"}, {"d918": "As an analogy, imagine that you have one of the latest processors out of Intel’s wafer fab. How would you make use of the chip? You then need to wire-bond the chip to a larger lead frame in a package that connects to a larger printed circuit board, fed by a bulky power supply that connects to the electrical power grid. Each of these successive layers relies on the larger-scale precursors from above (which were developed in reverse chronological order), and the entire hierarchy is needed to access the potential of the microchip. For molecular nanotech, where is the scaling hierarchy?"}, {"eb34": "The business-driven paths to nanotech diverge into two strategies to cross the “interface” chasm — the biologically inspired bottom-up path, and the top-down approach of the semiconductor industry. The non-biological developers are addressing current markets in the micro-world while pursuing an ever-shrinking spiral of miniaturization that builds the relevant infrastructure tiers along the way. Not surprisingly, this is very similar to the path that has been followed in the semiconductor industry, and many of its adherents see nanotech as inevitable, but in the distant future."}, {"ea4e": "On the other hand, biological manipulation presents myriad opportunities to effect great change in the near-term. Drug development, tissue engineering, and genetic engineering are all powerfully impacted by the molecular manipulation capabilities available to us today. And genetically modified microbes, whether by artificial evolution or directed gene splicing, give researchers the ability to build structures from the bottom up. More from 2004 here."}, {"6788": "Being involved in all these incredible future-forward companies, what are you MOST interested in/excited by? — Ben Tossell"}, {"c263": "Machine Intelligence. I first chose that as the “top tech trend” in 2013 (where we were asked to look forward 5 years to 2018). It was not a common theme for VCs back then. And it is just beginning. In a recent post, I tried to summarize my enthusiasm. I think the application of iterative algorithms (e.g., machine learning, directed evolution, generative design) to build complex systems is the most powerful advance in engineering since the scientific method. Machine learning allows us to build software solutions that exceed human understanding, and shows us how AI can innervate every industry."}, {"84c8": "What does success look like for you? — Seth Williams"}, {"f52c": "Lifelong learning, love, and an ever-expanding circle of empathy. As humanity moves from family to tribe to nation to globe, I think we will expand further still and develop deeper empathy for all sentient beings. (Including the AIs to come. We should think about a legal framework that enfranchises them rather than think we can enslave them.)"}, {"933a": "How do you approach building software-defined hardware products/services today? — Kunal Bhatia"}, {"62e3": "I generally ask why the idea could not have been possible 5 years ago (10 at the most). I think about Moore’s Law and the tipping point for an experimental science becoming a simulation science. The peace dividend of the cell phone wars makes the components of a satellite or robot dirt cheap, and the value migrates to the software and services layer (as it did with phones and is underway with rockets and cars and almost everything physical over time). Cheap inference engines, cheap powerful sensors, and better batteries => The internet of things is becoming the sensory cortex of the planet. Example: Mythic Biomimicry"}, {"7f5e": "If you could start a new government / country from scratch, what would be most important to leverage from what you’ve learned helping these complex companies thrive? — Rob Phillips"}, {"c9db": "Focus on a constitution that protects the unrepresented and the new entrant. Don’t let the lottery winner write the rules for the lottery. Foster competitive governance, like China did in establishing Shenzhen. Imagine an FDA-free zone. I heard Paul Romer say something interesting about charter cities: “Shenzhen did not exist in 1980. Today it has 10 million people, and the highest income per capita in China. China set up Shenzhen as a place where foreign firms can come in and exploit Chinese labor. They told the people of China, ‘If you don’t like that, don’t go there.’ It was an opt-in city driven by market choice. Now imagine a new city forming with the charter that it will burn no solid or liquid fuel. Or a new city in India founded with the charter that women will be free and they will be safe. If you disagree with these principles, don’t move there.”"}, {"567a": "What do you see as the biggest barrier to democratizing the future that you have been fortunate to experience? — Adam Little"}, {"beb6": "We are working on #2, but need mimetic countermeasures for #1."}, {"bb59": "What’s your take on moon habitats and moon travel, as opposed to Mars? — Jüri Kaljundi"}, {"207b": "The moon is great for tourism since a lot of fun fits in a one-week trip. Mars is a two+ year commitment (if you plan to stay for a bit once you arrive, versus a slingshot return). You’ve got to wait for the planets to align for the return leg. So it makes more sense for colonization than tourism. We hosted a brainstorming session that concluded that we can pursue an economically self-sufficient lunar base for a one-time $5B investment."}, {"1d84": "What is one thing about the future you believe in but very few others agree with you on? — Ben Tossell"}, {"8701": "That we are in the middle of a sea change in how much of engineering will be done. It will be more like parenting than programming. The locus of learning shifts from end products to the process of their creation. An ever-growing percentage of software will be grown and an ever-growing percentage of compute will run on infrastructure that resembles the brain (massively parallel, fine grained architectures with in-memory compute and a growing focus on the memory and interconnect elements)."}, {"df30": "And on a derivative note, I also believe that the conversion of every business into an information business will have profound aggregate effect, such as an accelerating rich-poor gap that is not self-rectifying. What if technology raises the bottom of the pyramid for all and democratizes upward mobility, yet at the same time, transforms it from a pyramid to a conical spike — where an ever-shrinking percentage of the population controls an even-growing percentage of an information-economy embedded with winner-take-all network effects and power laws?"}, {"596b": "In short, I ask if the ironic byproduct of erasing the digital divide is a further acceleration of the rich-poor gap. What happens to peoples who opt out of the vector of progress, as the sea change of destiny becomes the drumbeat of decades, instead of centuries? What is the nature of work in the future? And how can our culture and the very fabric of society co-evolve with our technologies during the transition? It motivates me to address some basic human needs, like free healthcare forever."}, {"f88a": "Free healthcare is something that is very possible. The main question needs to be, what perspective is that information being created from? Is it the conventional pharmaceutical approach? Or an integrative approach that encompasses the best of modern medicine?— David Joseph"}, {"dfee": "The learning comes from the people, just like for Google today. So it can incorporate non-traditional medicine as well. Everything that works. Imagine it starts with a simple mobile text interface, and as the next three billion people come online in this decade, it could become enriched with imagery and diagnostic sensors in the smartphones. The proposition for the consumer is free, unbiased advice as long as they respond to the daily prompts for input on the remedies tried and the progression of symptoms through resolution. The recommendations would come from a special purpose AI (using machine learning and then deep learning) that benefits from what would become the largest data set of over-the-counter, prescription and non-traditional remedies."}, {"a2a1": "What actually works? What is the actual rate of adverse events over time? (This data set alone could provide enough revenue to cover the marginal cost of operation.) The vast majority of health care does not require surgery, especially in the developing world (think infectious diseases and nutrition), but when it is required, the system could help point people to the specialist they need. The service would be offered in all languages with voice/text conversion for the illiterate. Regional epidemiologic patterns and proactive warnings would naturally follow as it becomes a trusted, life-saving advisor. As it scales, it could become a powerful distribution channel for generic drugs, priced at a small fixed margin over manufacturing cost. Since the system is the trusted advisor, the brand of the drug would be anonymous and there is no sales or marketing expense to reach this large customer base."}, {"d605": "What is your goal in the next 50 years, and what legacy do you wish to leave behind? — Edis Murtic"}, {"0d81": "There is so much to do, and if I can keep helping entrepreneurs forge the future, I know the biggest impact will be in sectors I could not name today. The most important company 20 years from now has not even been formed yet. So I focus on the process, not the product. How can I keep learning? Should I keep to my simple rule of investing in companies that are unlike anything I have seen before? (That is an example of focusing on process, not sector.) And I plan to continue giving any gain I make to charitable causes, which themselves can have ever growing impact. I have never sold a share of any DFJ investment, but I do donate the public shares over time. It is incredibly rewarding."}, {"39ec": "Check out the full Product Hunt LIVE Chat with Steve Jurvetson HERE:"}], "child": "409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16409_1\t409_2\t409_3\t409_4\t409_5\t409_6\t409_7\t409_8\t409_9\t409_10\t409_11\t409_12\t409_13\t409_14\t409_15\t409_16"}