{"sentences": [{"e147": "Who Is the NBA’s MVP?"}, {"870e": "Our NBA writers take a close look at Westbrook, Harden, LeBron, and Kawhi"}, {"96ce": "The NBA regular season is over, but one last debate isn’t: Who is the MVP? These are our picks:"}, {"f7d7": "Russell Westbrook"}, {"80f4": "Jason Concepcion: If Russell Westbrook doesn’t win the MVP award, future generations will look back and wonder how we took leave of our senses. The context — James Harden’s win shares, the Rockets’ record, Westbrook’s high usage rate, Kawhi’s two-way punch — will fall away with the intervening years. What will remain is this: RUSSELL WESTBROOK AVERAGED A TRIPLE-DOUBLE FOR AN ENTIRE SEASON AND DIDN’T WIN THE MVP. That’s the headline that will travel across the ages. Russ, as you know, broke Oscar’s 55-year-old single-season triple-double record, something once considered impossible. He’s a basketball Paul Bunyan, a giant, walking the earthly plane, cutting down entire forests by himself. At one time, up to only a few weeks ago, I was pretty sure the MVP was James Harden. Some part of me still leans that way. But Russ convinced me. Basically by grabbing me around the neck and refusing to let go until I say “You are the MVP,” whether I really believe it or not. So that’s it. Westbrook is the MVP. You can let go now."}, {"a812": "Danny Chau: Two weeks ago, my vote was Harden. Two months ago, my vote was LeBron. Chris Ryan asked me who my MVP was two days ago, and I stammered. This shouldn’t be that difficult to answer. This isn’t life or death. But voter paralysis is real, even for those without a vote. There are four extremely deserving candidates in this race, and I’ve been able to find some inner peace knowing that there are alternate universes in which all four players are rightfully crowned the most valuable player in the league. But that doesn’t help me in this one. After much deliberation, my MVP is Westbrook."}, {"4c51": "If all things are equal (and in my opinion they are), then what separates these four won’t be statistics — they all have unique and frankly astonishing numbers to support their case. Kawhi is the most efficient superstar on both ends of the floor that we’ve seen in a while. LeBron’s on/off numbers shouldn’t be possible for a Finals-contending team. James Harden’s New Year’s Eve game against the Knicks, going for a 53–16–17 triple-double, was the single most dominant performance I’ve ever seen in my life. No matter who wins the championship this season — no matter if we end up with yet another Warriors-Cavs Finals— this will be one of my favorite seasons ever. I want this season to be etched in public memory for decades to come."}, {"6c0a": "The way you accomplish that is by making things simple. This is the season Russell Westbrook tallied a triple-double in more than a half-season’s worth of games, and had the first season-long triple-double average in more than 50 years. As arbitrary as it is, I’m fine will letting the triple-double be the enduring symbol of the season, and shorthand for the ridiculous performances we got night in and night out from superstars like Westbrook and unheralded guys like Tim Frazier. One day, we’ll outgrow the triple-double as a standard of success; some would argue we already have. This is about Westbrook and what he’s done, but it also isn’t. I just want history to look back on this season as fondly as I will."}, {"abbe": "LeBron James"}, {"760d": "Kevin O’Connor: “Who is the 2016–17 NBA Most Valuable Player? Russell Westbrook. James Harden. LeBron James. Kawhi Leonard,” Regis Philbin asks, as the Who Wants to Be a Millionaire? music begins to play — that thick, intense loop that sounds like it’s straight out of a horror movie."}, {"a4ec": "“Regis, I don’t know the answer,” I say, thinking to myself that this is a trick question. There can’t be a right answer. All four responses are correct. “I’ve done hours of research on this. I’ve looked at the numbers. Depending on the metric used, you’ll come up with different answers.” I explain that Harden beats Westbrook in effective field goal percentage, true shooting percentage, and scores more points per possession. But if you factor in workload/volume (for my own custom metric I’m working on), then Westbrook grades higher. But Leonard is by far the best defender of the bunch, while LeBron is the most well-rounded of them all."}, {"7e29": "“You’ve already used your 50–50 lifeline on a previous question,” Regis says. “But you still have your phone-a-friend and ask-the-audience lifelines available.” I ask the audience using a very scientific poll of my teammates in The Ringer’s Slack channel: 12 of 20 respondents chose Westbrook. None chose Kawhi."}, {"971e": "“Well, it seems the audience likes Westbrook,” Regis says. I do too. Westbrook has fueled the Thunder this year. I don’t care about the triple-doubles. I don’t care his team has less wins than all the others. Westbrook has made an unbelievable impact. But it still doesn’t feel right to me when the same can be said of the others. I tell Regis that earlier in the week I had talked to my real-life friends about the MVP vote because I’m searching everywhere for answers. My friend Jordan thinks it’s LeBron or Harden because they’ve impacted winning more than Westbrook. My friend Bill says it’s LeBron or Kawhi, but adds they’re all deserving."}, {"caa6": "“Would you like to phone a friend?” I do — a front office executive I trust greatly. He tells me that it’s clearly LeBron James and makes a long-winded point that intangibles are often overlooked and in that category James far exceeds Westbrook and Harden. “There seems to be no consensus,” Regis says with a smirk on his face, as if he knows the answer to this question is as valuable as knowing the meaning of life. “Your lifelines are gone. What are you thinking, Kevin?”"}, {"2cd4": "I tell Regis that right now I’m leaning toward LeBron James for all the reasons I wrote about on Monday and discussed on The Ringer NBA Show on Tuesday. I believe LeBron’s presence on the floor enhances each one of his teammates more than the other choices. The numbers show that to be true. Even when Kyrie Irving and Kevin Love are on the floor without LeBron, the Cavs’ offensive rating plummets by 13 points per 100 possessions, per NBA.com/Stats. Nearly every player experiences a drop in individual production too, because LeBron’s presence alone makes everyone around him better, even if he doesn’t accumulate the same counting stats as Harden or Westbrook."}, {"f6f6": "“Is that your final answer?” Regis interjects."}, {"eda6": "“No. It’s not,” I sigh, as I put my face into both my hands wishing this were the real Who Wants to Be a Millionaire? If it were, this would be the million-dollar question, and I’d have unlimited time to respond. That isn’t the case with NBA award voting. The deadline to submit votes is Friday at 11:59 p.m. ET. Of those four players, I don’t think there’s a right answer. But I hope I can find one before Friday night."}, {"16ec": "Jonathan Tjarks: LeBron is the best basketball player in the world. No one will argue against that after what happened in last year’s NBA Finals, and he has done nothing since to loosen his grip on the crown. If you go by on-court/off-court numbers, he has been more valuable this season than James Harden, Russell Westbrook, and Kawhi Leonard. The Cavs have a net rating of plus-7.7 with LeBron on and minus-8.5 with him off. He’s the difference between them playing better than the Spurs and worse than the Lakers."}, {"59d3": "LeBron is in his 14th season, and yet he’s still getting better. He is playing more as a small-ball 5 than ever before, and the Cavs have a net rating of plus-20.9 with him in that role. LeBron isn’t just the most valuable player, he’s the most valuable type of player: a point center who can do everything on the court at an extremely high level and give his team whatever it needs on a given possession. And for all the talk of him coasting in the regular season, he’s leading the league in minutes at 37.7 per game. There’s no player in the league who is better than LeBron, and there’s no one who plays as much as LeBron."}, {"0e91": "James Harden"}, {"68ca": "Riley McAtee: Let’s get the triple-double thing out of the way first. Triple-doubles are arbitrary. Putting two digits on the number “10” is only due to the base-10 number system we, as a species, adopted. And it doesn’t even make sense! Base 12 would divide more evenly into quarters and thirds, but humans have 10 fingers, so we use base 10. And a triple-double is defined through that system, and the arbitrary threshold of 10 points, rebounds, and assists it takes to get one. So it goes."}, {"df37": "My MVP pick is about what I value on the basketball court. So before I even throw out of a name, let me lay out what I believe: Great offense is more valuable than great defense. Rebounds aren’t very valuable, and uncontested rebounds are virtually worthless. Scoring is very valuable, and efficient scoring is even more valuable. Creating assists is very valuable. Triple-doubles are not, on their own, valuable. … You can probably see where I’m going with this."}, {"1318": "James Harden is my MVP, April slump and all. Let’s look at some stats I find valuable to help explain:"}, {"be03": "This is unbelievably close. Kawhi is the best perimeter defender in the league by a mile, but he doesn’t quite measure up in these offensive categories, and that eliminates him for me."}, {"98ba": "LeBron is a great choice — no one in the NBA improves his teammates the way he does. But his team punted on the 1-seed and he doesn’t score or assist as much as Westbrook and Harden. LeBron leads all these guys in minutes played, and yet I feel like he should have the ball in his hands more often. Especially with that true-shooting number."}, {"6120": "So then it’s Harden and Westbrook. For me, the true-shooting number is the difference, and the higher assist total only helps. If Westbrook were a more efficient scorer, he’d be my MVP. But he shoots an extra five field goals a game to earn just 2.5 extra points compared with Harden. Harden is efficient, he gets assists, and his team is a contender. I think he’s the Most Valuable Player."}, {"57ae": "There’s one caveat to this: Westbrook unquestionably had the more memorable season. How valuable is that? For me, not very. Harden’s season would be just as memorable if he hadn’t had the best individual performance of the year in a game on New Year’s Eve that no one watched, if he didn’t have a lingering wrist injury affecting the last few weeks of the season, and if humans counted in base 12 instead of base 10."}], "content": "Who Is the NBA’s MVP? Our NBA writers take a close look at Westbrook, Harden, LeBron, and Kawhi The NBA regular season is over, but one last debate isn’t: Who is the MVP? These are our picks: Russell Westbrook Jason Concepcion: If Russell Westbrook doesn’t win the MVP award, future generations will look back and wonder how we took leave of our senses. The context — James Harden’s win shares, the Rockets’ record, Westbrook’s high usage rate, Kawhi’s two-way punch — will fall away with the intervening years. What will remain is this: RUSSELL WESTBROOK AVERAGED A TRIPLE-DOUBLE FOR AN ENTIRE SEASON AND DIDN’T WIN THE MVP. That’s the headline that will travel across the ages. Russ, as you know, broke Oscar’s 55-year-old single-season triple-double record, something once considered impossible. He’s a basketball Paul Bunyan, a giant, walking the earthly plane, cutting down entire forests by himself. At one time, up to only a few weeks ago, I was pretty sure the MVP was James Harden. Some part of me still leans that way. But Russ convinced me. Basically by grabbing me around the neck and refusing to let go until I say “You are the MVP,” whether I really believe it or not. So that’s it. Westbrook is the MVP. You can let go now. Danny Chau: Two weeks ago, my vote was Harden. Two months ago, my vote was LeBron. Chris Ryan asked me who my MVP was two days ago, and I stammered. This shouldn’t be that difficult to answer. This isn’t life or death. But voter paralysis is real, even for those without a vote. There are four extremely deserving candidates in this race, and I’ve been able to find some inner peace knowing that there are alternate universes in which all four players are rightfully crowned the most valuable player in the league. But that doesn’t help me in this one. After much deliberation, my MVP is Westbrook. If all things are equal (and in my opinion they are), then what separates these four won’t be statistics — they all have unique and frankly astonishing numbers to support their case. Kawhi is the most efficient superstar on both ends of the floor that we’ve seen in a while. LeBron’s on/off numbers shouldn’t be possible for a Finals-contending team. James Harden’s New Year’s Eve game against the Knicks, going for a 53–16–17 triple-double, was the single most dominant performance I’ve ever seen in my life. No matter who wins the championship this season — no matter if we end up with yet another Warriors-Cavs Finals— this will be one of my favorite seasons ever. I want this season to be etched in public memory for decades to come. The way you accomplish that is by making things simple. This is the season Russell Westbrook tallied a triple-double in more than a half-season’s worth of games, and had the first season-long triple-double average in more than 50 years. As arbitrary as it is, I’m fine will letting the triple-double be the enduring symbol of the season, and shorthand for the ridiculous performances we got night in and night out from superstars like Westbrook and unheralded guys like Tim Frazier. One day, we’ll outgrow the triple-double as a standard of success; some would argue we already have. This is about Westbrook and what he’s done, but it also isn’t. I just want history to look back on this season as fondly as I will. LeBron James Kevin O’Connor: “Who is the 2016–17 NBA Most Valuable Player? Russell Westbrook. James Harden. LeBron James. Kawhi Leonard,” Regis Philbin asks, as the Who Wants to Be a Millionaire? music begins to play — that thick, intense loop that sounds like it’s straight out of a horror movie. “Regis, I don’t know the answer,” I say, thinking to myself that this is a trick question. There can’t be a right answer. All four responses are correct. “I’ve done hours of research on this. I’ve looked at the numbers. Depending on the metric used, you’ll come up with different answers.” I explain that Harden beats Westbrook in effective field goal percentage, true shooting percentage, and scores more points per possession. But if you factor in workload/volume (for my own custom metric I’m working on), then Westbrook grades higher. But Leonard is by far the best defender of the bunch, while LeBron is the most well-rounded of them all. “You’ve already used your 50–50 lifeline on a previous question,” Regis says. “But you still have your phone-a-friend and ask-the-audience lifelines available.” I ask the audience using a very scientific poll of my teammates in The Ringer’s Slack channel: 12 of 20 respondents chose Westbrook. None chose Kawhi. “Well, it seems the audience likes Westbrook,” Regis says. I do too. Westbrook has fueled the Thunder this year. I don’t care about the triple-doubles. I don’t care his team has less wins than all the others. Westbrook has made an unbelievable impact. But it still doesn’t feel right to me when the same can be said of the others. I tell Regis that earlier in the week I had talked to my real-life friends about the MVP vote because I’m searching everywhere for answers. My friend Jordan thinks it’s LeBron or Harden because they’ve impacted winning more than Westbrook. My friend Bill says it’s LeBron or Kawhi, but adds they’re all deserving. “Would you like to phone a friend?” I do — a front office executive I trust greatly. He tells me that it’s clearly LeBron James and makes a long-winded point that intangibles are often overlooked and in that category James far exceeds Westbrook and Harden. “There seems to be no consensus,” Regis says with a smirk on his face, as if he knows the answer to this question is as valuable as knowing the meaning of life. “Your lifelines are gone. What are you thinking, Kevin?” I tell Regis that right now I’m leaning toward LeBron James for all the reasons I wrote about on Monday and discussed on The Ringer NBA Show on Tuesday. I believe LeBron’s presence on the floor enhances each one of his teammates more than the other choices. The numbers show that to be true. Even when Kyrie Irving and Kevin Love are on the floor without LeBron, the Cavs’ offensive rating plummets by 13 points per 100 possessions, per NBA.com/Stats. Nearly every player experiences a drop in individual production too, because LeBron’s presence alone makes everyone around him better, even if he doesn’t accumulate the same counting stats as Harden or Westbrook. “Is that your final answer?” Regis interjects. “No. It’s not,” I sigh, as I put my face into both my hands wishing this were the real Who Wants to Be a Millionaire? If it were, this would be the million-dollar question, and I’d have unlimited time to respond. That isn’t the case with NBA award voting. The deadline to submit votes is Friday at 11:59 p.m. ET. Of those four players, I don’t think there’s a right answer. But I hope I can find one before Friday night. Jonathan Tjarks: LeBron is the best basketball player in the world. No one will argue against that after what happened in last year’s NBA Finals, and he has done nothing since to loosen his grip on the crown. If you go by on-court/off-court numbers, he has been more valuable this season than James Harden, Russell Westbrook, and Kawhi Leonard. The Cavs have a net rating of plus-7.7 with LeBron on and minus-8.5 with him off. He’s the difference between them playing better than the Spurs and worse than the Lakers. LeBron is in his 14th season, and yet he’s still getting better. He is playing more as a small-ball 5 than ever before, and the Cavs have a net rating of plus-20.9 with him in that role. LeBron isn’t just the most valuable player, he’s the most valuable type of player: a point center who can do everything on the court at an extremely high level and give his team whatever it needs on a given possession. And for all the talk of him coasting in the regular season, he’s leading the league in minutes at 37.7 per game. There’s no player in the league who is better than LeBron, and there’s no one who plays as much as LeBron. James Harden Riley McAtee: Let’s get the triple-double thing out of the way first. Triple-doubles are arbitrary. Putting two digits on the number “10” is only due to the base-10 number system we, as a species, adopted. And it doesn’t even make sense! Base 12 would divide more evenly into quarters and thirds, but humans have 10 fingers, so we use base 10. And a triple-double is defined through that system, and the arbitrary threshold of 10 points, rebounds, and assists it takes to get one. So it goes. My MVP pick is about what I value on the basketball court. So before I even throw out of a name, let me lay out what I believe: Great offense is more valuable than great defense. Rebounds aren’t very valuable, and uncontested rebounds are virtually worthless. Scoring is very valuable, and efficient scoring is even more valuable. Creating assists is very valuable. Triple-doubles are not, on their own, valuable. … You can probably see where I’m going with this. James Harden is my MVP, April slump and all. Let’s look at some stats I find valuable to help explain: This is unbelievably close. Kawhi is the best perimeter defender in the league by a mile, but he doesn’t quite measure up in these offensive categories, and that eliminates him for me. LeBron is a great choice — no one in the NBA improves his teammates the way he does. But his team punted on the 1-seed and he doesn’t score or assist as much as Westbrook and Harden. LeBron leads all these guys in minutes played, and yet I feel like he should have the ball in his hands more often. Especially with that true-shooting number. So then it’s Harden and Westbrook. For me, the true-shooting number is the difference, and the higher assist total only helps. If Westbrook were a more efficient scorer, he’d be my MVP. But he shoots an extra five field goals a game to earn just 2.5 extra points compared with Harden. Harden is efficient, he gets assists, and his team is a contender. I think he’s the Most Valuable Player. There’s one caveat to this: Westbrook unquestionably had the more memorable season. How valuable is that? For me, not very. Harden’s season would be just as memorable if he hadn’t had the best individual performance of the year in a game on New Year’s Eve that no one watched, if he didn’t have a lingering wrist injury affecting the last few weeks of the season, and if humans counted in base 12 instead of base 10. ", "parent": "", "title": "Who Is the NBA’s MVP?", "child": "41_1\t41_2\t41_3\t41_4\t41_5\t41_6\t41_7\t41_8\t41_9\t41_10\t41_11\t41_12\t41_13\t41_14\t41_15\t41_16\t41_17\t41_18\t41_19", "name": "41"}