{"name": "415", "parent": "", "content": "Amazon Is Dead Serious About Delivering Your Goodies by Drone When Bezos unveiled the octocopters to Charlie Rose four years ago, it seemed like a publicity stunt. It wasn’t. Almost four years ago, in a puffy 60 Minutes piece about Amazon, CEO Jeff Bezos gave us a peek at a secret project: autonomous “octocopters,” also known as giant drones. The flying devices, Bezos assured us, would cut out UPS and FedEx to deliver packages to Amazon’s customers. At the time, skeptics dismissed it as a publicity stunt and doubted that the company would ever pursue the seemingly nutty scheme. Whoops. Amazon Prime Air, as it’s called, is real. On March 20th in Palm Springs, CA, I saw the first public test flight in the US at a private Amazon emerging tech conference called MARS. Follow Backchannel: Facebook | Twitter Amazon is definitely serious about delivering its goods by an autonomous air force. But are those drones really going to be a significant part of the company’s ever-growing delivery system? Spending some time with a couple of the key Amazon Prime Air team members last week, I got some indications that the company is indeed gearing up for a massive effort to fill the skies with its vehicles. It’s still very much in the test stage, but the progress Amazon has made jibes with the realization that drones are very much in our future. “Oh, man…oh my god!” Charlie Rose was stunned. Though CBS had been working on a big Amazon story for months, it wasn’t until taping had begun that Bezos revealed he had something exclusive and very special to show off. Even so, Rose’s mind was blown at the sight of a drone the size of a pit bull. The producer of the 60 Minutes piece thought the octocopters looked like giant tarantulas, or at least like something out of a Philip K. Dick novel. Clearly those dudes were not spending their weekends flying DJIs in their backyards. Indeed, the drones didn’t look drastically different than some of the high-end models in the marketplace. What was different was the role they were designed to play. Bezos explained that they were custom built to deliver packages, ideally within 30 minutes of Amazon customers hitting the buy button. Cautioning that the project was in a very early stage, Bezos speculated it that might take four or five years to get things right and win the proper government approvals. He professed optimism. “It will work, and it will happen, and it’s gonna be a lot of fun,” he said. But much of the tech press charged that it was a publicity stunt. Cynics noted that the 60 Minutes piece might have been a way to deflect negative coverage directed at Amazon and at Bezos in particular—most notably, a critical book by Brad Stone, whose tales of a quasi-Dickensian workplace so displeased the company that Bezos’ wife posted a negative review. The show also aired on the eve of Cyber Monday, the buying orgy that is one of Amazon’s biggest sales days. Critics claimed that by introducing a service Bezos himself admitted would not be launched for years, CBS had been pawned. It was all a giant free Amazon ad! It was unprecedented for Amazon to pre-announce a product or service. But the company actually was revealing very little to its competitors. Because, after all, those drones were unlikely to ever show up. At lunchtime on the first day of this year’s MARS conference, Amazon was ready to show conference attendees the first public delivery by an Air Prime vehicle. It would land on a well-manicured lawn, in a field where various other science demos were displayed — such as a giant robot that humans could crawl into, and the Blue Origin booster rocket that had been recovered and reused for multiple flights. For days the team had been monitoring weather conditions, because at this point, the drones are cleared only for “Daytime VFR” (visual flight rule) — no heavy winds or precipitation. And special considerations had to be made because the hotel that hosted Amazon’s conference was close to the Palm Springs Airport. So we couldn’t see it race across the sky at highway speeds. Instead, we heard the whine of the propellers first, and then, appearing over a hedge, an eight-bladed drone came into view. It zoomed to a position over a circular patch, and slowly lowered itself to the ground. Then, after disgorging the contents of the container in its belly, it rose up again, disappearing from whence it came. Left behind on the marker — a pad made of similar material to a yoga mat — was a small cardboard box, with the Amazon smile clearly visible. Mission accomplished. March 20, 2017. Prime Air’s first public US appearance. Obviously, four years later, the idea of drone delivery seems a lot less far-fetched than when Bezos sprung it on Charlie Rose in 2013. Amazon even has some competition: A project of Alphabet’s X division (formerly known as Google X) called Wing focuses on drone delivery, and has publicly done test-runs, ferrying hot Chipotle burritos into the hands of customers. Amazon, too, has been running tests—not in America but in the UK (near Cambridge), which seems to be a friendlier place to try out flying delivery vehicles. It began testing how the drones fly in 2015, and last December it attempted its first delivery. A hand-picked customer placed an order (an Amazon Fire Stick and some popcorn), and 13 minutes later a drone dropped off a package in the customer’s garden. Amazon also does a lot of testing in the US, though not to customers—yet. The company has a site at an undisclosed semi-rural location where it attempts to simulate the possible obstacles that drones will face in real-world deliveries. The facility features a faux backyard and other simulated locations where drones might have to drop off their cargo. “For a while, we were missing clotheslines,” says Paul Viola, an AI expert who is charge of Prime Air’s autonomy efforts. Now, Amazon’s vehicles have a “Don’t Hit Clotheslines!” rule in their code. There’s even a simulated dog (though not a robot) that Amazon uses to see how the vehicles will respond to canine threats. Amazon’s drones are built to go fast — the speeds are 60 miles an hour and beyond. They fly at altitudes between 200 and 400 feet, well under the 500 feet where general aviation vehicles fly. A sortie can go as far as 20 miles roundtrip, from warehouse to customer and back. (That’s known as an “ABA mission.”) When it reaches the GPS coordinates of its destination, it looks for a unique “marker” — an electronically identifiable welcome-mat that the customer sets out in a good landing place — and drops off the package. (The package can be up to five pounds or so, which covers around 85 to 90 percent of Amazon deliveries.) When the drone returns to base, the battery is swapped out and the flying courier is ready for another run. Talking to Prime Air’s leaders, I was surprised to learn how broadly they felt drones could be implemented. With their long range, the drones could reach a lot of people in suburbs and even some rural areas. And Amazon is also planning for urban deliveries, with the idea of landing drones on rooftops. At first it will concentrate on those ABA missions, but eventually it might expand to multiple deliveries per expedition, or even take returns back to the warehouse. Amazon says it has eight or nine different designs for its drones, each appropriate for a given scenario. All of this is done without human intervention. Drones know where to go and how to get there without a human sitting at a ground station actually flying the plane. Communication takes place by signals — an Air Prime technician can order a drone to land — but ultimately the drones are autonomous. Amazon envisions that eventually it will have sort of an air traffic controller monitoring the flight patterns of multiple drones. But what if things go wrong? When the drone senses something dangerous — to itself or others — the first rule of Amazon drones is to abort the flight, returning to base or even carefully finding a landing spot from which to send a rescue signal. “If it doesn’t seem safe, it will land as soon as safely possible,” says Gur Kimchi, who has headed the Prime Air team for four years. (He previously worked at Microsoft.) And what was the payload for this brief but historic aerial delivery in the high desert? A tube of sunscreen. One small squib for man, and another big squirt of publicity for Amazon. But this time, no one should be laughing it off. Instead of a ploy to distract, Amazon has been plugging away at a vision that portends a bigger role for drones in our life than we once thought. Oh my god! It’s 2016. Where’s My Flying Pizza?Delivery drones are getting better at putting pies in the sky. Meet the entrepreneurs fighting to get hot food flown to…backchannel.com ", "title": "Amazon Is Dead Serious About Delivering Your Goodies by Drone", "sentences": [{"fecc": "Amazon Is Dead Serious About Delivering Your Goodies by Drone"}, {"25fd": "When Bezos unveiled the octocopters to Charlie Rose four years ago, it seemed like a publicity stunt. It wasn’t."}, {"cdfc": "Almost four years ago, in a puffy 60 Minutes piece about Amazon, CEO Jeff Bezos gave us a peek at a secret project: autonomous “octocopters,” also known as giant drones. The flying devices, Bezos assured us, would cut out UPS and FedEx to deliver packages to Amazon’s customers. At the time, skeptics dismissed it as a publicity stunt and doubted that the company would ever pursue the seemingly nutty scheme."}, {"d6e5": "Whoops. Amazon Prime Air, as it’s called, is real. On March 20th in Palm Springs, CA, I saw the first public test flight in the US at a private Amazon emerging tech conference called MARS."}, {"a6f5": "Follow Backchannel: Facebook | Twitter"}, {"e365": "Amazon is definitely serious about delivering its goods by an autonomous air force. But are those drones really going to be a significant part of the company’s ever-growing delivery system? Spending some time with a couple of the key Amazon Prime Air team members last week, I got some indications that the company is indeed gearing up for a massive effort to fill the skies with its vehicles. It’s still very much in the test stage, but the progress Amazon has made jibes with the realization that drones are very much in our future."}, {"7914": "“Oh, man…oh my god!” Charlie Rose was stunned. Though CBS had been working on a big Amazon story for months, it wasn’t until taping had begun that Bezos revealed he had something exclusive and very special to show off. Even so, Rose’s mind was blown at the sight of a drone the size of a pit bull. The producer of the 60 Minutes piece thought the octocopters looked like giant tarantulas, or at least like something out of a Philip K. Dick novel. Clearly those dudes were not spending their weekends flying DJIs in their backyards."}, {"6adb": "Indeed, the drones didn’t look drastically different than some of the high-end models in the marketplace. What was different was the role they were designed to play. Bezos explained that they were custom built to deliver packages, ideally within 30 minutes of Amazon customers hitting the buy button. Cautioning that the project was in a very early stage, Bezos speculated it that might take four or five years to get things right and win the proper government approvals. He professed optimism. “It will work, and it will happen, and it’s gonna be a lot of fun,” he said."}, {"1972": "But much of the tech press charged that it was a publicity stunt. Cynics noted that the 60 Minutes piece might have been a way to deflect negative coverage directed at Amazon and at Bezos in particular—most notably, a critical book by Brad Stone, whose tales of a quasi-Dickensian workplace so displeased the company that Bezos’ wife posted a negative review. The show also aired on the eve of Cyber Monday, the buying orgy that is one of Amazon’s biggest sales days."}, {"4f16": "Critics claimed that by introducing a service Bezos himself admitted would not be launched for years, CBS had been pawned. It was all a giant free Amazon ad! It was unprecedented for Amazon to pre-announce a product or service. But the company actually was revealing very little to its competitors."}, {"bdfd": "Because, after all, those drones were unlikely to ever show up."}, {"db94": "At lunchtime on the first day of this year’s MARS conference, Amazon was ready to show conference attendees the first public delivery by an Air Prime vehicle. It would land on a well-manicured lawn, in a field where various other science demos were displayed — such as a giant robot that humans could crawl into, and the Blue Origin booster rocket that had been recovered and reused for multiple flights. For days the team had been monitoring weather conditions, because at this point, the drones are cleared only for “Daytime VFR” (visual flight rule) — no heavy winds or precipitation. And special considerations had to be made because the hotel that hosted Amazon’s conference was close to the Palm Springs Airport. So we couldn’t see it race across the sky at highway speeds."}, {"7430": "Instead, we heard the whine of the propellers first, and then, appearing over a hedge, an eight-bladed drone came into view. It zoomed to a position over a circular patch, and slowly lowered itself to the ground. Then, after disgorging the contents of the container in its belly, it rose up again, disappearing from whence it came. Left behind on the marker — a pad made of similar material to a yoga mat — was a small cardboard box, with the Amazon smile clearly visible. Mission accomplished."}, {"d4e7": "March 20, 2017. Prime Air’s first public US appearance."}, {"a494": "Obviously, four years later, the idea of drone delivery seems a lot less far-fetched than when Bezos sprung it on Charlie Rose in 2013. Amazon even has some competition: A project of Alphabet’s X division (formerly known as Google X) called Wing focuses on drone delivery, and has publicly done test-runs, ferrying hot Chipotle burritos into the hands of customers."}, {"1965": "Amazon, too, has been running tests—not in America but in the UK (near Cambridge), which seems to be a friendlier place to try out flying delivery vehicles. It began testing how the drones fly in 2015, and last December it attempted its first delivery. A hand-picked customer placed an order (an Amazon Fire Stick and some popcorn), and 13 minutes later a drone dropped off a package in the customer’s garden."}, {"cdb6": "Amazon also does a lot of testing in the US, though not to customers—yet. The company has a site at an undisclosed semi-rural location where it attempts to simulate the possible obstacles that drones will face in real-world deliveries. The facility features a faux backyard and other simulated locations where drones might have to drop off their cargo. “For a while, we were missing clotheslines,” says Paul Viola, an AI expert who is charge of Prime Air’s autonomy efforts. Now, Amazon’s vehicles have a “Don’t Hit Clotheslines!” rule in their code. There’s even a simulated dog (though not a robot) that Amazon uses to see how the vehicles will respond to canine threats."}, {"b4cc": "Amazon’s drones are built to go fast — the speeds are 60 miles an hour and beyond. They fly at altitudes between 200 and 400 feet, well under the 500 feet where general aviation vehicles fly. A sortie can go as far as 20 miles roundtrip, from warehouse to customer and back. (That’s known as an “ABA mission.”) When it reaches the GPS coordinates of its destination, it looks for a unique “marker” — an electronically identifiable welcome-mat that the customer sets out in a good landing place — and drops off the package. (The package can be up to five pounds or so, which covers around 85 to 90 percent of Amazon deliveries.) When the drone returns to base, the battery is swapped out and the flying courier is ready for another run."}, {"6074": "Talking to Prime Air’s leaders, I was surprised to learn how broadly they felt drones could be implemented. With their long range, the drones could reach a lot of people in suburbs and even some rural areas. And Amazon is also planning for urban deliveries, with the idea of landing drones on rooftops. At first it will concentrate on those ABA missions, but eventually it might expand to multiple deliveries per expedition, or even take returns back to the warehouse. Amazon says it has eight or nine different designs for its drones, each appropriate for a given scenario."}, {"66bd": "All of this is done without human intervention. Drones know where to go and how to get there without a human sitting at a ground station actually flying the plane. Communication takes place by signals — an Air Prime technician can order a drone to land — but ultimately the drones are autonomous. Amazon envisions that eventually it will have sort of an air traffic controller monitoring the flight patterns of multiple drones."}, {"d407": "But what if things go wrong? When the drone senses something dangerous — to itself or others — the first rule of Amazon drones is to abort the flight, returning to base or even carefully finding a landing spot from which to send a rescue signal. “If it doesn’t seem safe, it will land as soon as safely possible,” says Gur Kimchi, who has headed the Prime Air team for four years. (He previously worked at Microsoft.)"}, {"589d": "And what was the payload for this brief but historic aerial delivery in the high desert? A tube of sunscreen. One small squib for man, and another big squirt of publicity for Amazon."}, {"09d5": "But this time, no one should be laughing it off. Instead of a ploy to distract, Amazon has been plugging away at a vision that portends a bigger role for drones in our life than we once thought. Oh my god!"}, {"9c9d": "It’s 2016. Where’s My Flying Pizza?Delivery drones are getting better at putting pies in the sky. Meet the entrepreneurs fighting to get hot food flown to…backchannel.com"}], "child": "415_1\t415_2\t415_3\t415_4\t415_5\t415_6\t415_7\t415_8\t415_9\t415_10\t415_11\t415_12\t415_13\t415_14\t415_15\t415_16\t415_17"}