{"name": "416", "parent": "", "content": "Obama’s Secretary of Defense Won’t Stop Trying Fix the World In DC, Ash Carter built bridges between the Valley and the Pentagon. With his new gig in Boston, he hopes to strengthen them. Ash Carter has long nursed the quixotic belief that tech’s best and brightest will, if nudged and properly inspired, tap into their sense of public service—the same calling that first compelled him to join the government more than three decades ago. That sense of optimism will be integral to his next act, which he announces today: Carter will join the Harvard Kennedy School as the Belfer Professor of Technology and Global Affairs and Director of the Belfer Center for Science and International Affairs, perhaps the most influential think tank in existence. He has also signed on as an innovation fellow at MIT, a joint appointment between the engineering school and the Sloan School of Management. As President Obama’s final pick for Secretary of Defense, Carter spent the past two years wooing Silicon Valley’s technologists to work more closely with the Pentagon. He tried to make it easier for tech companies to sell things to the government. He set up a new office in the Valley, less than five miles from Google. And he built a new program, Defense Digital Service, which hires techies for short projects. In the process, Carter forged deeper relationships than your usual public servant with Silicon Valley’s kingmakers, from Marc Andreessen to Sheryl Sandberg. (In 2015, I tagged along with him to Sun Valley and wrote this WIRED feature about his efforts.) Selling techies on patriotism post-Snowden will undoubtedly be a significant part of his legacy as SecDef. Follow Backchannel: Facebook | Twitter His multiple new titles boil down to this: Technology is shaping our future faster than any of us can keep up. Carter will train his efforts on working closely with tech industry leaders to figure out what this future will look like — and how to make sure everybody benefits. This week, I caught up with Carter to discuss his new role, and what it means for Silicon Valley. Congratulations on your new role. You could do so many things. Why are you returning to Boston? There are a number of great technology hubs in the United States, but the Boston hub is certainly one of them. It does a good job of combining engineering and tech and biotech, with a long tradition of working for the public good. I want to continue to build bridges between the innovative community, the tech community, and public purposes. National security is one example, and I’ll still continue to work on that, but there are others as well. For example, making sure that we have technical input on both the opportunities and the challenges created by the breathtaking changes that technology is reaping, or creating. And making sure they are implemented in a way that allows the whole nation to succeed. That’s very important. One of the things that I found in trying to build bridges between the tech community and the Defense Department was the tremendous willingness of the tech community, and the feeling of responsibility. These are people who like to do things of consequence, and so the idea of being part of things that are significant for the country and the world as a whole is very important to them. That’s what motivates them. Giving them an opportunity to do public good is very important. That’s what I’ll be able to do both as a teacher here in Boston, and also as leader of a major research institution. In our earlier conversations, you expressed the belief that among Valley techies, there was an inherent patriotism that you could tap into. If offered the opportunity to contribute to the country, many people would step up. Now that you’ve finished your tour as Secretary of Defense, do you still believe this? I certainly found it to be true. When I created the Defense Digital Service, we found many people who were willing and motivated and inspired by the possibility of working on a defense problem of consequence, even if just for a short time. I found at the Defense Innovation Advisory Board that the great innovators of our country like Eric Schmidt and Jeff Bezos and Reid Hoffman were willing to spend their time and their talents — for free — advising the Secretary of Defense and the Pentagon. And I think we found that in DIUx [Defense Innovation Unit Experimental], which started in Silicon Valley and has its headquarters there and a very strong outpost at the Pentagon. It has had no problem attracting the huge number of great innovators that are in the Valley. You say you’re going to be thinking beyond security. What do you see as the most important issues to tackle? Well, one I mentioned is what you might call the future opportunities for the American dream — for good careers and for training, so that people whose employment landscape is being changed by technology find new, good opportunities. I think [the tech industry] can help with that. Obviously, as you see in parts of the United States but very much elsewhere in the world, people feel like they’re being left out. The tech community feels the opportunity and the responsibility that it has as the creator of technology to help society make those changes, too. And are you really talking about thinking through the impact of machine learning and artificial intelligence? Absolutely. That’s a great example. There are other examples like self-driving cars, which will have consequences for people. Who’s better positioned than those in tech to think that through? Who’s better than technologists to think through what’s going to be probably the most consequential technology for humankind in coming decades? Or new biotech, for example, fueled by CRISPR and other innovations? This winter, many people have been talking about how we prepare for the impact of AI on the job market. The two answers that everybody regularly give are, “we’ve got to do a better job at education,” and “we need to make people into entrepreneurs.” Both answers feel like they fail us so profoundly. They don’t even begin to speak to the real challenges of this change. Instead, they’re easy answers that let people off the hook. I think that’s why serious technical and research work at major universities is going to be so important. I think you’re right, the conversation needs to be deepened. The people in the tech community are the right people to deepen it, because they understand all of it. As SecDef, you were able to help disparate cultures find a peace with each other and work together. Is there any correlation for that in academia? Well, I think Boston, like Silicon Valley, has a long tradition of public service and working for the public good as well as innovation. In my generation we were all raised by the World War II generation of technologists, and it was in their DNA to work on public problems and to work with the government, but also to advise the government candidly when it was making mistakes. They passed that on to my generation. The new generation doesn’t have as many avenues immediately available to them to make those kind of contributions, but they really want to. That’s why something like the Defense Digital Service is important. Bridges have to be built and rebuilt, because it’s been a long time since those early post-World War II bridges were built. But the ingredients are there — a very vibrant tech community, and one that is dedicated to using its talents for the greater good. When I profiled you for WIRED, you spoke about the responsibility you felt as a technologist to help steer the country to using the technology for good—because you had seen firsthand the horrendous impact of, particularly, nuclear technology. Is this a similar cultural moment? As we look ahead, we’re starting to feel first-hand the impact of the technology revolution in some of the forces that have led to the increased nationalism. Is this also a moment of great tension where the people creating these tools are feeling a heightened sense of responsibility? I think it is a moment of heightened sense of responsibility, for many reasons. It’s the accumulated pace of change, and the fact that it’s clear that society and many of our fellow citizens have difficulty keeping up. That does get expressed. In Europe, for example, you see it in these nationalist parties. But it’s also just expressed in people’s frustration, and in really tremendous missed opportunities. And I think it’s expressed in the tech community by a real thirst to find ways to turn their innovative minds and their desire to do things that matter to the greater good. Technologists are challenging themselves, though they’ve also done this all along, to think through all of the consequences of their innovations, and I think that’s a healthy thing. Their voice and input is essential. Many tech leaders are very uneasy right now. They feel the values that the current administration embraces don’t reflect their own. How can they take an active role in shoring up the future of our country? I think by being involved in public life. One can’t assume that our lives as researchers and innovators can be hived off from the larger society and our larger responsibilities. And I think if society’s going to deal with all of the consequences of innovation, who is better to make those inputs than the tech community itself? Obviously, we had a change in administration. That may be influencing some people. But I think it’s been going on for longer than that. And I say that on the basis of my experience as secretary of defense over the last few years, where I found a tremendous appetite to contribute. But if that’s any indication, that sense of responsibility was out there. And as I said, it’s long been a part of the culture of the tech community. ", "title": "Obama’s Secretary of Defense Won’t Stop Trying Fix the World", "sentences": [{"9a44": "Obama’s Secretary of Defense Won’t Stop Trying Fix the World"}, {"196e": "In DC, Ash Carter built bridges between the Valley and the Pentagon. With his new gig in Boston, he hopes to strengthen them."}, {"a072": "Ash Carter has long nursed the quixotic belief that tech’s best and brightest will, if nudged and properly inspired, tap into their sense of public service—the same calling that first compelled him to join the government more than three decades ago. That sense of optimism will be integral to his next act, which he announces today: Carter will join the Harvard Kennedy School as the Belfer Professor of Technology and Global Affairs and Director of the Belfer Center for Science and International Affairs, perhaps the most influential think tank in existence. He has also signed on as an innovation fellow at MIT, a joint appointment between the engineering school and the Sloan School of Management."}, {"a15c": "As President Obama’s final pick for Secretary of Defense, Carter spent the past two years wooing Silicon Valley’s technologists to work more closely with the Pentagon. He tried to make it easier for tech companies to sell things to the government. He set up a new office in the Valley, less than five miles from Google. And he built a new program, Defense Digital Service, which hires techies for short projects."}, {"2f3b": "In the process, Carter forged deeper relationships than your usual public servant with Silicon Valley’s kingmakers, from Marc Andreessen to Sheryl Sandberg. (In 2015, I tagged along with him to Sun Valley and wrote this WIRED feature about his efforts.) Selling techies on patriotism post-Snowden will undoubtedly be a significant part of his legacy as SecDef."}, {"b528": "Follow Backchannel: Facebook | Twitter"}, {"73a0": "His multiple new titles boil down to this: Technology is shaping our future faster than any of us can keep up. Carter will train his efforts on working closely with tech industry leaders to figure out what this future will look like — and how to make sure everybody benefits. This week, I caught up with Carter to discuss his new role, and what it means for Silicon Valley."}, {"d82b": "Congratulations on your new role. You could do so many things. Why are you returning to Boston?"}, {"ddf5": "There are a number of great technology hubs in the United States, but the Boston hub is certainly one of them. It does a good job of combining engineering and tech and biotech, with a long tradition of working for the public good. I want to continue to build bridges between the innovative community, the tech community, and public purposes. National security is one example, and I’ll still continue to work on that, but there are others as well. For example, making sure that we have technical input on both the opportunities and the challenges created by the breathtaking changes that technology is reaping, or creating. And making sure they are implemented in a way that allows the whole nation to succeed. That’s very important."}, {"f78c": "One of the things that I found in trying to build bridges between the tech community and the Defense Department was the tremendous willingness of the tech community, and the feeling of responsibility. These are people who like to do things of consequence, and so the idea of being part of things that are significant for the country and the world as a whole is very important to them. That’s what motivates them. Giving them an opportunity to do public good is very important. That’s what I’ll be able to do both as a teacher here in Boston, and also as leader of a major research institution."}, {"f18f": "In our earlier conversations, you expressed the belief that among Valley techies, there was an inherent patriotism that you could tap into. If offered the opportunity to contribute to the country, many people would step up. Now that you’ve finished your tour as Secretary of Defense, do you still believe this?"}, {"6563": "I certainly found it to be true. When I created the Defense Digital Service, we found many people who were willing and motivated and inspired by the possibility of working on a defense problem of consequence, even if just for a short time. I found at the Defense Innovation Advisory Board that the great innovators of our country like Eric Schmidt and Jeff Bezos and Reid Hoffman were willing to spend their time and their talents — for free — advising the Secretary of Defense and the Pentagon. And I think we found that in DIUx [Defense Innovation Unit Experimental], which started in Silicon Valley and has its headquarters there and a very strong outpost at the Pentagon. It has had no problem attracting the huge number of great innovators that are in the Valley."}, {"f323": "You say you’re going to be thinking beyond security. What do you see as the most important issues to tackle?"}, {"24c2": "Well, one I mentioned is what you might call the future opportunities for the American dream — for good careers and for training, so that people whose employment landscape is being changed by technology find new, good opportunities. I think [the tech industry] can help with that. Obviously, as you see in parts of the United States but very much elsewhere in the world, people feel like they’re being left out. The tech community feels the opportunity and the responsibility that it has as the creator of technology to help society make those changes, too."}, {"71af": "And are you really talking about thinking through the impact of machine learning and artificial intelligence?"}, {"c577": "Absolutely. That’s a great example. There are other examples like self-driving cars, which will have consequences for people. Who’s better positioned than those in tech to think that through? Who’s better than technologists to think through what’s going to be probably the most consequential technology for humankind in coming decades? Or new biotech, for example, fueled by CRISPR and other innovations?"}, {"cf3e": "This winter, many people have been talking about how we prepare for the impact of AI on the job market. The two answers that everybody regularly give are, “we’ve got to do a better job at education,” and “we need to make people into entrepreneurs.” Both answers feel like they fail us so profoundly. They don’t even begin to speak to the real challenges of this change. Instead, they’re easy answers that let people off the hook."}, {"a527": "I think that’s why serious technical and research work at major universities is going to be so important. I think you’re right, the conversation needs to be deepened. The people in the tech community are the right people to deepen it, because they understand all of it."}, {"5724": "As SecDef, you were able to help disparate cultures find a peace with each other and work together. Is there any correlation for that in academia?"}, {"974d": "Well, I think Boston, like Silicon Valley, has a long tradition of public service and working for the public good as well as innovation. In my generation we were all raised by the World War II generation of technologists, and it was in their DNA to work on public problems and to work with the government, but also to advise the government candidly when it was making mistakes. They passed that on to my generation."}, {"36c4": "The new generation doesn’t have as many avenues immediately available to them to make those kind of contributions, but they really want to. That’s why something like the Defense Digital Service is important. Bridges have to be built and rebuilt, because it’s been a long time since those early post-World War II bridges were built. But the ingredients are there — a very vibrant tech community, and one that is dedicated to using its talents for the greater good."}, {"a574": "When I profiled you for WIRED, you spoke about the responsibility you felt as a technologist to help steer the country to using the technology for good—because you had seen firsthand the horrendous impact of, particularly, nuclear technology. Is this a similar cultural moment? As we look ahead, we’re starting to feel first-hand the impact of the technology revolution in some of the forces that have led to the increased nationalism. Is this also a moment of great tension where the people creating these tools are feeling a heightened sense of responsibility?"}, {"2398": "I think it is a moment of heightened sense of responsibility, for many reasons. It’s the accumulated pace of change, and the fact that it’s clear that society and many of our fellow citizens have difficulty keeping up. That does get expressed. In Europe, for example, you see it in these nationalist parties. But it’s also just expressed in people’s frustration, and in really tremendous missed opportunities. And I think it’s expressed in the tech community by a real thirst to find ways to turn their innovative minds and their desire to do things that matter to the greater good."}, {"7fc5": "Technologists are challenging themselves, though they’ve also done this all along, to think through all of the consequences of their innovations, and I think that’s a healthy thing. Their voice and input is essential."}, {"b35f": "Many tech leaders are very uneasy right now. They feel the values that the current administration embraces don’t reflect their own. How can they take an active role in shoring up the future of our country?"}, {"ccf5": "I think by being involved in public life. One can’t assume that our lives as researchers and innovators can be hived off from the larger society and our larger responsibilities. And I think if society’s going to deal with all of the consequences of innovation, who is better to make those inputs than the tech community itself?"}, {"8009": "Obviously, we had a change in administration. That may be influencing some people. But I think it’s been going on for longer than that. And I say that on the basis of my experience as secretary of defense over the last few years, where I found a tremendous appetite to contribute. But if that’s any indication, that sense of responsibility was out there. And as I said, it’s long been a part of the culture of the tech community."}], "child": "416_1\t416_2\t416_3\t416_4"}