{"name": "418", "parent": "", "content": "Google Fiber Was Doomed From the Start The internet access answer won’t come from private markets, but rather from policies that make for competitive networks. (LBJ Library / Creative Commons) Just a handful of newsflashes have come home to me in such a way that I never forgot where I was when I heard them. Most were disasters, like the Challenger explosion or the attacks of September 11. In February 2010, I was sitting in my office in Ann Arbor when another event made the list — but this one surprised and delighted me. I cheered. Google had announced its fiber experiment, a plan to wire at least 50,000 homes with fast, bountiful connections. Finally, someone was going to try to unstick the monopolistic, stagnant, second-rate market for high-capacity internet access in the US. Last month, there was a shakeup at Alphabet’s Access division (the new name for what was originally called Google Fiber). It named a new CEO, Greg McCray, and news outlets reported that hundreds of Access employees were being shifted to other parts of the Google empire. The former CEO, Craig Barratt, had already announced last year that Access would “pause” plans to launch fiber networks in several cities. Taken together, these news reports all seem to signal that Google is dumping the idea of fiber and moving decisively into wireless access solutions. Follow Backchannel: Facebook | Twitter The bumpersticker from defenders of the status quo is that this means the Google Fiber experiment was a disaster. That’s simply not the case. What this set of events does usefully and colorfully signal is that we need an entirely different approach to the country’s desperate need for world-class data transmission. We do need fiber, everywhere. But we’re talking about basic infrastructure when we talk about fiber. And it is not in any private company’s short-term interest to make that basic fiber infrastructure — which amounts to a substantial upgrade to the last-century copper and cable lines with which Americans are now stuck — available to everyone at a reasonable price. Google’s retreat is all about the bottom line. It wanted an unrealistic rate of return on basic infrastructure. It wanted to see rapid cost declines per subscriber, like the Moore’s Law changes in productivity that have taken place when digital technologists squeeze costs from other legacy businesses. But although the cost of fiber — the glass itself — has fallen through the floor, and the gear needed to deliver signals over fiber has gotten cheaper over time, 80 percent or more of the cost of installing fiber is labor. The high upfront cost of getting all that labor to rip up the streets and hang wires on poles can’t be paid back in just a few years. The cost of that labor isn’t going down right now. Basic physical infrastructure is like that. It requires long-term vision and patient capital — think horizons of 10 years or more, rather than two or three. In return, investments in basic infrastructure will pay steady, reliable returns until the sun explodes. And the spillovers from those investments in terms of economic growth and social justice for everyone in a community are routinely extraordinary. Think subway systems, railways, and telephone networks: Fiber optic internet access for everyone, and for every other form of infrastructure, is the most important recent addition to that list of physical networks. As Google’s comfort with longterm returns waxed and waned, it labeled its fiber project an “experiment” (2010), then a “business” (2012), and finally a “bet” or “moonshot” (2015). Now it’s hoping to avoid many of those labor costs by experimenting with what can be done using its Webpass wireless access unit, rather than solely installing cables itself. Don’t be distracted by talk about wireless. Saying Americans can rely on wireless alone is like saying, “Who needs airports? We have airplanes!” All those wireless connections will require fiber deep into neighborhoods, homes, and businesses; only fiber will be capable of carrying the tsunami of data we’d like to be producing over our devices. So far, no one has cracked the nut of getting extremely high-capacity wireless signals reliably through walls and doors, much less around hills and through trees. And the only thing that will make those wireless connections competitive is firm public control over conduits and poles so as to ensure no monopolist bosses us around. Look, Google was never going to fix the nation’s high-capacity internet access problem. It’s a problem with several dimensions: In most major urban areas, local cable monopolies dominate completely, selling high-priced, second-rate data services that are inextricably bundled with pay TV packages and unthreatened by competition. In rural areas, former telco monopolies are doing their best to transform themselves into wireless media distribution platforms, cutting off millions of Americans from the modern world by relegating them to third- or fourth-rate unreliable data services. (I keep encountering rural stories of telcos cutting off even crappy DSL service any time anyone stops a subscription; realtors are tearing their hair out trying to ensure that some narrow drip of data will be available to a new buyer of a home. That’s a cataclysm.) We’re systematically leaving behind minorities, less-educated people, poorer people, people living in urban areas, and anyone who simply doesn’t want to pay the inexplicably high rates these unregulated giant companies command for what feels like a utility. The costs to our future are incalculable; we’re failing to provide opportunities to scrappy Americans. But Google Fiber did several things that, in hindsight, were helpful: The fundamental lesson of Google Fiber is that, in the end, its business model was just like that of another cable actor. It was playing within the existing sandbox, using the right technology but the wrong business model. That sandbox has been left to the vagaries of the marketplace, in which existing monopolies have built moats around their businesses in the form of rights to programming, rights of way, bundled products, relationships with credulous legislators, and a million other barriers to entry that make competing — even for Google — just too expensive for shareholders looking for immediate, media company-like returns, quarter after quarter. In Google’s Wall Street-driven context, making the long-term investments necessary for an infrastructure play and taking on the entrenched monopolies was even harder than a moonshot. The only business model for fiber that will work to produce the competition, low prices, and world-class data transport we need — certainly in urban areas — is to get local governments involved in overseeing basic, street grid-like “dark” (passive, unlit with electronics) fiber available at a set, wholesale price to a zillion retail providers of access and services. There’s plenty of patient capital sloshing around the US that would be attracted to the steady, reliable returns this kind of investment will return. That investment could be made in the form of private lending or government bonds; the important element is that the resulting basic network be a wholesale facility that any retail actor can use at a reasonable, fair cost. The result: Instead of different wires competing side by side with one another, there would be one great basic facility available neutrally to every form of business. Your ISP could use that fiber in competition with 10 others; your traffic lights could use it to govern congestion; your energy grid could use it to measure and regulate consumption and use of renewables. (Here comes the much-touted Internet of Things, which, without fiber everywhere, is being built on sand.) At the same time, the government would stay out of providing and inventing retail services itself. That’s the way communications networks work. Given the high upfront costs involved in building physical networks, we don’t need multiple lines into homes and businesses—but we do need the most modern line available for sharing. That line is fiber. It’s good for the next four or five decades. What we have — cable and copper — is not good enough for America. It’s a win-win: The giant companies that sell us internet access can start selling it in actual competition with one another over wholesale fiber connections. And I don’t think we’ve got a branding problem. People love the Google brand, yes, but they also tend to be quite fond of their local governments. Voters are anxious for competition, choice, and change. So the next obvious step is to support local government involvement, bravery, leadership, smarts, and organization. (Warning: plenty of terrible things are happening at the state level to block local government.) Yes, it will be hard, but the reason I think it can happen is that people desperately want it, and voters will reward those who give it to them. No one has ever said No to much more bandwidth at lower cost. This is a bipartisan issue focused on improving the economic growth of entire areas and ranges of opportunities available to everyone in those areas. Officials can stand up and say, “There is no good reason to dumb down Americans.” They’ll get re-elected. Eventually, after communities have shown the way, the federal government will wise up and ensure any remaining stragglers have great, inexpensive access too. We’ve been through this story before: It’s a recap of what the country did in the early years of electrification. I’ll remember Google Fiber, and the communities that already have it are glad that it arrived. But it was never going to be the answer. And its retreat has made the answer far clearer. You Didn’t Notice It, But Google Fiber Just Began the Golden Age of High Speed Internet AccessIts “dark fiber” project in Huntsville creates a model that might finally thrust US Internet access into the 21st…backchannel.com There’s An Obvious Way to Create More Jobs.Fast, ubiquitous fiber can’t solve all society’s ills, but it can help with the problems that led us to Brexit. Just…backchannel.com ", "title": "Google Fiber Was Doomed From the Start", "sentences": [{"8672": "Google Fiber Was Doomed From the Start"}, {"1909": "The internet access answer won’t come from private markets, but rather from policies that make for competitive networks."}, {"4aa5": "(LBJ Library / Creative Commons)"}, {"5765": "Just a handful of newsflashes have come home to me in such a way that I never forgot where I was when I heard them. Most were disasters, like the Challenger explosion or the attacks of September 11. In February 2010, I was sitting in my office in Ann Arbor when another event made the list — but this one surprised and delighted me. I cheered. Google had announced its fiber experiment, a plan to wire at least 50,000 homes with fast, bountiful connections. Finally, someone was going to try to unstick the monopolistic, stagnant, second-rate market for high-capacity internet access in the US."}, {"f2dd": "Last month, there was a shakeup at Alphabet’s Access division (the new name for what was originally called Google Fiber). It named a new CEO, Greg McCray, and news outlets reported that hundreds of Access employees were being shifted to other parts of the Google empire. The former CEO, Craig Barratt, had already announced last year that Access would “pause” plans to launch fiber networks in several cities. Taken together, these news reports all seem to signal that Google is dumping the idea of fiber and moving decisively into wireless access solutions."}, {"07a4": "Follow Backchannel: Facebook | Twitter"}, {"7222": "The bumpersticker from defenders of the status quo is that this means the Google Fiber experiment was a disaster. That’s simply not the case."}, {"1d12": "What this set of events does usefully and colorfully signal is that we need an entirely different approach to the country’s desperate need for world-class data transmission."}, {"01e1": "We do need fiber, everywhere. But we’re talking about basic infrastructure when we talk about fiber. And it is not in any private company’s short-term interest to make that basic fiber infrastructure — which amounts to a substantial upgrade to the last-century copper and cable lines with which Americans are now stuck — available to everyone at a reasonable price."}, {"97a9": "Google’s retreat is all about the bottom line. It wanted an unrealistic rate of return on basic infrastructure. It wanted to see rapid cost declines per subscriber, like the Moore’s Law changes in productivity that have taken place when digital technologists squeeze costs from other legacy businesses."}, {"9c29": "But although the cost of fiber — the glass itself — has fallen through the floor, and the gear needed to deliver signals over fiber has gotten cheaper over time, 80 percent or more of the cost of installing fiber is labor. The high upfront cost of getting all that labor to rip up the streets and hang wires on poles can’t be paid back in just a few years. The cost of that labor isn’t going down right now."}, {"0f4c": "Basic physical infrastructure is like that. It requires long-term vision and patient capital — think horizons of 10 years or more, rather than two or three. In return, investments in basic infrastructure will pay steady, reliable returns until the sun explodes. And the spillovers from those investments in terms of economic growth and social justice for everyone in a community are routinely extraordinary. Think subway systems, railways, and telephone networks: Fiber optic internet access for everyone, and for every other form of infrastructure, is the most important recent addition to that list of physical networks."}, {"2f09": "As Google’s comfort with longterm returns waxed and waned, it labeled its fiber project an “experiment” (2010), then a “business” (2012), and finally a “bet” or “moonshot” (2015). Now it’s hoping to avoid many of those labor costs by experimenting with what can be done using its Webpass wireless access unit, rather than solely installing cables itself."}, {"a9e0": "Don’t be distracted by talk about wireless. Saying Americans can rely on wireless alone is like saying, “Who needs airports? We have airplanes!” All those wireless connections will require fiber deep into neighborhoods, homes, and businesses; only fiber will be capable of carrying the tsunami of data we’d like to be producing over our devices. So far, no one has cracked the nut of getting extremely high-capacity wireless signals reliably through walls and doors, much less around hills and through trees. And the only thing that will make those wireless connections competitive is firm public control over conduits and poles so as to ensure no monopolist bosses us around."}, {"30d8": "Look, Google was never going to fix the nation’s high-capacity internet access problem. It’s a problem with several dimensions: In most major urban areas, local cable monopolies dominate completely, selling high-priced, second-rate data services that are inextricably bundled with pay TV packages and unthreatened by competition. In rural areas, former telco monopolies are doing their best to transform themselves into wireless media distribution platforms, cutting off millions of Americans from the modern world by relegating them to third- or fourth-rate unreliable data services. (I keep encountering rural stories of telcos cutting off even crappy DSL service any time anyone stops a subscription; realtors are tearing their hair out trying to ensure that some narrow drip of data will be available to a new buyer of a home. That’s a cataclysm.)"}, {"f46d": "We’re systematically leaving behind minorities, less-educated people, poorer people, people living in urban areas, and anyone who simply doesn’t want to pay the inexplicably high rates these unregulated giant companies command for what feels like a utility. The costs to our future are incalculable; we’re failing to provide opportunities to scrappy Americans."}, {"0988": "But Google Fiber did several things that, in hindsight, were helpful:"}, {"ab46": "The fundamental lesson of Google Fiber is that, in the end, its business model was just like that of another cable actor. It was playing within the existing sandbox, using the right technology but the wrong business model."}, {"ff33": "That sandbox has been left to the vagaries of the marketplace, in which existing monopolies have built moats around their businesses in the form of rights to programming, rights of way, bundled products, relationships with credulous legislators, and a million other barriers to entry that make competing — even for Google — just too expensive for shareholders looking for immediate, media company-like returns, quarter after quarter."}, {"9a0f": "In Google’s Wall Street-driven context, making the long-term investments necessary for an infrastructure play and taking on the entrenched monopolies was even harder than a moonshot."}, {"26ac": "The only business model for fiber that will work to produce the competition, low prices, and world-class data transport we need — certainly in urban areas — is to get local governments involved in overseeing basic, street grid-like “dark” (passive, unlit with electronics) fiber available at a set, wholesale price to a zillion retail providers of access and services. There’s plenty of patient capital sloshing around the US that would be attracted to the steady, reliable returns this kind of investment will return. That investment could be made in the form of private lending or government bonds; the important element is that the resulting basic network be a wholesale facility that any retail actor can use at a reasonable, fair cost."}, {"6f2c": "The result: Instead of different wires competing side by side with one another, there would be one great basic facility available neutrally to every form of business. Your ISP could use that fiber in competition with 10 others; your traffic lights could use it to govern congestion; your energy grid could use it to measure and regulate consumption and use of renewables. (Here comes the much-touted Internet of Things, which, without fiber everywhere, is being built on sand.) At the same time, the government would stay out of providing and inventing retail services itself."}, {"228b": "That’s the way communications networks work. Given the high upfront costs involved in building physical networks, we don’t need multiple lines into homes and businesses—but we do need the most modern line available for sharing. That line is fiber. It’s good for the next four or five decades. What we have — cable and copper — is not good enough for America. It’s a win-win: The giant companies that sell us internet access can start selling it in actual competition with one another over wholesale fiber connections."}, {"9202": "And I don’t think we’ve got a branding problem. People love the Google brand, yes, but they also tend to be quite fond of their local governments. Voters are anxious for competition, choice, and change. So the next obvious step is to support local government involvement, bravery, leadership, smarts, and organization. (Warning: plenty of terrible things are happening at the state level to block local government.) Yes, it will be hard, but the reason I think it can happen is that people desperately want it, and voters will reward those who give it to them. No one has ever said No to much more bandwidth at lower cost. This is a bipartisan issue focused on improving the economic growth of entire areas and ranges of opportunities available to everyone in those areas. Officials can stand up and say, “There is no good reason to dumb down Americans.” They’ll get re-elected."}, {"e4aa": "Eventually, after communities have shown the way, the federal government will wise up and ensure any remaining stragglers have great, inexpensive access too. We’ve been through this story before: It’s a recap of what the country did in the early years of electrification."}, {"2854": "I’ll remember Google Fiber, and the communities that already have it are glad that it arrived. But it was never going to be the answer. And its retreat has made the answer far clearer."}, {"f242": "You Didn’t Notice It, But Google Fiber Just Began the Golden Age of High Speed Internet AccessIts “dark fiber” project in Huntsville creates a model that might finally thrust US Internet access into the 21st…backchannel.com"}, {"f9c9": "There’s An Obvious Way to Create More Jobs.Fast, ubiquitous fiber can’t solve all society’s ills, but it can help with the problems that led us to Brexit. Just…backchannel.com"}], "child": "418_1\t418_2\t418_3\t418_4\t418_5\t418_6\t418_7\t418_8\t418_9\t418_10\t418_11\t418_12\t418_13\t418_14\t418_15\t418_16\t418_17\t418_18\t418_19\t418_20\t418_21\t418_22\t418_23\t418_24\t418_25"}