{"name": "419", "parent": "", "content": "Prepare to Obsess Over the Future of Home Wifi Eero, Plume, and others want you to become connoisseurs of your own data. One day last summer I was creeping in my rental car along the Alameda de las Pulgas — the Avenue of Fleas — in Menlo Park, trying to spot a house number without getting rear-ended. This wasn’t going to be the usual product demo. I was going to be exposed to the future of wifi in a three-bedroom tract home. Actually, the future of wifi had been creeping up on me for years, like a distant “save this date” event that elicits a groan when it finally pops up on the calendar. In fact, earlier last year I had begun experimenting with an early example of The New Wifi gadgets — they come in packs, like wolves or mean girls — called Eero. It’s named after a designer, which is the official international signal that you’re going to overpay for something. (Eero Saarinen was the dude who designed those chairs that are the furniture equivalent of Modigliani models; he was also behind the recently bulldozed TWA Terminal at JFK. By the way, if a product is named after a designer with two double vowels in his name, it’s going to cost even more.) Eero turned out to be one of a number of new wifi companies, with names like Luma and Orbi — not all dubbed after designers, but dreamy enough to command a premium. These are “mesh” networks, based on the idea that a swarm of routers that talk to each other and pass on data, bucket-brigade style, can eliminate the dead spots in your home. Unlike Good Old-Fashioned Wifi (GOFWF), where you plug your router into the cable or DSL modem where internet is piped into the home and then have no idea what happens thereafter, these are set up and monitored by apps. Follow Backchannel: Facebook | Twitter The New Wifi is part of a larger digital trend. Home used to be a place where our communication needs were modest — one line for the phone, one for the cable box, and one for the lone routers serving our computers. Now, increasingly, broadband alone powers a dizzying profusion of devices — digital personal assistants, streaming videos, tablets, phones, speakers, thermostats, smoke alarms , lightbulbs, and sex toys. Just as we have what used to be supercomputers in our pockets, our homes now require the telecommunications infrastructure of a small city. Case in point is the “test house” of the wifi company called Plume, the place I was looking for on the Avenue of Fleas. I was greeted by its CEO Fahri Diner and a group of technicians. Diner, born in Cyprus but a Silicon Valley resident since 2002, has a long background in wireless tech. “I am one of the guys who brought broadband to your home,” he says. “I feel like I needed to finish the job.” Diner gave me the lowdown on his product, which differs from Eero and many of the other meshers in that much of the actual digital work of a usual router is off-loaded to the cloud. As companies like Eero move us from a one-router world to a three-router world, Diner says Plume’s solution is a “zero-router world.” That doesn’t mean it’s free: You still need compact base units that sell for $69 each (a three-pack is $179, a six-pack $329), and Plume estimates that a large home might use as many as twelve units. In any case, having the router in the cloud enables more computation, so that Plume’s distant servers can constantly calculate the best configuration of devices and even switch frequency channels when they detect a conflict with nearby networks. Diner calls it “adaptive wifi.” For Nextdoor, Eliminating Racism Is No Quick FixSocial media has a racism problem because humans have a racism problem. Can one company solve it?backchannel.com I spent over an hour with Diner and his team plugging and unplugging devices in the house; after each exercise we would trudge down to the living room, where a diagram of the home network — more convoluted than the org chart of the Trump White House — listed every device along with the bit rate it was receiving. Yes, The New Wifi means data—not only on internet speed, but also on which devices are active, which channels are preferred, and which arrangement of gadgets is optimal. That was when I realized that our relationship with wireless has changed for good. From this point on our data flow will be better, but we will have to become network administrators in the process. The amateur stage of home wifi is over, and, like it or not, we’re doomed to become pros. Wifi was never supposed to be a big thing, and certainly not a thing that would become as vital to a home as indoor plumbing. It was a mongrel standard that took advantage of “unlicensed spectrum,” meaning that any backyard tinkerer or rogue startup could use it. (As opposed to licensed spectrum, which the government auctioned off to big telecom companies for billions.) According to Wikipedia, the wifi spectrum was released for experimentation in the early 1985, when some scientists working for the Australian government made some tweaks that got them a patent—and a windfall for their government. In 1997, the technology got approved as an IEEE standard — 802.11, pronounced eight-oh-two-dot-eleven. But by the end of the 1990s it was still pretty much unknown, until a benefactor changed its life, and ours. His name was Steve Jobs. I was an eyewitness to this history. It was late July of 1999, and Jobs was introducing his first portable—a clamshell-shaped, rubber-clad gadget called the iBook. It came in two colors: tangerine and blueberry. (At the time, this was a radical design statement.) I got my first glimpse of them in Jobs’s boardroom a week before the launch, with Apple’s CEO literally whisking away a black sheet that had covered them. After he flipped their lids to reveal that they ran Mac OS, he surprised me. “Let’s go for a walk!” he said, grabbing the tangerine box. I took the blueberry. Each of them weighed over six pounds, but that was actually pretty good for the time. The browser address was set to Quicktime movie trailers: James Bond for Jobs, Austin Powers for me. And here’s the amazing part: As we circled the table, the movie clips kept playing without any wires. It was a miracle! Jobs was literally dancing with glee, in some dad-like version of a touchdown celebration. “We’ve got internet streaming media as we walk around!” he crowed. “Isn’t this why we got into this business in the first place?” Syrian History Is Unfolding on WhatsAppSocial media is offering a lifeline for fractured families — and a window into the refugee crisis.backchannel.com Wifi had been building momentum (though that catchy name, a marketer’s play on Hi-Fi, or “high fidelity,” wasn’t even officially adopted until later that summer). Even so, building a wifi modem directly into a mainstream product was a leap too big for even Apple at the time. In order to activate it you needed to install a $99 hardware card underneath the battery. (For a few years, having one of those cards was pretty much the only way to get wifi in your computer.) And then of course you had to buy a hotspot, a router that took an internet signal and pumped it into the air. Apple came out with its own version, called the Airport: a white, vaguely UFO-shaped mini-dome. Over the next decade and a half, wifi found its niche. It was built into not only computers but also devices of every sort. Hotspots were everywhere, from Starbucks to actual airports. The prices of routers went down, so you could get something for $50 or $60. But in terms of solving consumer problems, routers saw very little improvement. The problems of wifi — notably, a limited range and interference with other networks — were a persistent annoyance. A couple of years ago, it seemed to dawn on a new wave of startups that the problem was an opportunity. One of those founders was Nick Weaver, now CEO of Eero. I met Weaver about a year ago. He told me that he was his neighborhood’s Mr. Fixit, setting up wifi networks. At Stanford, he was his dorm’s network administrator. From his experiences, he realized that even in a home, you needed a bunch of routers — boosting the range of a single one wouldn’t do it. “You’re not going to defeat the laws of physics,” he says. He started Eero in 2014. One of his advisors was Jon Rubinstein, who had been Apple’s hardware czar during its iPod days. Eero costs $199 for the first unit you buy, and you get a three-pack for $499. The white plastic is reminiscent of the original Airport, but the Eeros are flatter and more compact. Setup is done through the app and is pretty easy, though you do have to painstakingly reprogram the wifi on every device. I’ve previously tried to address my apartment’s deadest spot — the worst being the living room couch, which was at the farthest point in the living area from the cable modem, which, for reasons that escape me now, lives in the master bedroom — by installing an “extender” that picks up the signal from the router and essentially starts a new network to cover areas close to this second gadget. This second network only passes through about sixty percent of the signal you’d get in the bedroom, which made for slow internet on the couch and jumpy video streamed from the Apple TV. Worse, the extender requires a different network name and password, and of the two networks now in my apartment, my computer always seems to get on the wrong one. Eero fixes that latter problem: Its mesh networks use a single network name and password. The other advantage of the new wifi is the devices are all are controlled by a dedicated app. At any point, from any location, you can see whether the network is up, and what the speed is for any device. Checking the app becomes addictive; I’ve gained a habit that I never had to indulge in the old days of wifi. Apps also allow you to do all sorts of things impossible with GOFWF. With Eero, for instance, parents can use it to turn off the router in a kid’s bedroom when they want to cut down on screen time. Eero also knows where your devices are — when you can’t find your iPhone, just ask your Echo (using the Eero Alexa skill), “Tell Eero to find Steven’s phone.” It might tell you it’s connected to the bedroom Eero or, if it can’t find it, it can tell you when and where it was last connected to the network. Both Eero and Plume, which I got to sample some months after my visit to the test home, have provided a vast improvement over my old single router. Eero was straightforward to set up in a three-unit gang, and — hallelujah! — my couch is no longer a dead spot! I also liked my experience with Plume. I used five units that plug directly into the wall, saving counter space. That’s plenty for my 1,500 square feet of living space. Each one is maybe a little bigger than one of those electrical adapters that let you connect a three-prong to a two-prong socket. What I did not experience was the boost that Diner promised I’d get by dodging the interference from nearby routers. Living in a New York City apartment building, I usually have between 20 and 30 different networks that pop up under the drop-down wifi icon—most still maintain router names; others have descriptive titles such as “Emily’s home network” and one very annoying network dubbed “Bill Clinton’s Penis Extravaganza.” My speeds vary greatly — sometimes the browser loads nimbly; other times I’m surfing on molasses. Could Plume resolve that? It didn’t seem to. I did like the idea that Plume constantly monitors the configuration of your network and makes adjustments accordingly—the mesh version of feng shui. But if the off-loaded Plume computation was madly switching channels to maintain the highest flow, it could have done better. One day the living room couch got a download rate of 17 mbps. (This came from the signal passing through three Plume devices.) The next day it only got seven. In the guest bedroom, only one degree of Plume away from the master device plugged directly into the cable modem, I was getting 37 mbps. Look, this is a lot better than having dead spots. As Weaver says, you can’t fool physics. But since we’ve now figured out that wifi physics require more routers, I think we’re going to see a lot more of them. They might even disappear. Eventually, I think Eero, Plume, and the like might sink their technology into home assistants, Sonos speakers, or Nest thermostats. Everything could be part of a wifi mesh — routers could be built into Internet of Things devices and vice versa. Ultimately, I think everything will. When I caught up with Weaver recently, he also shared some data he’d gathered from analyzing users. The most remarkable one — and one that speaks to the need for improved home wifi — was the rapid increase in the number of gadgets in the home that consume wifi. “It used to be seven, eight, nine — now it’s like 15 devices,” he says. With all that proliferation, it seems inevitable that wifi itself will become just one more function in our giant Lego box of internet-connecting stuff. The competition might not be who has the best hardware, but the best app. But that’s a vision for years to come — right now we’re still beginning The New Wifi revolution. Just as I was finishing this piece I tried out another newcomer, from Google. Google Wifi devices are a lot like Eero’s — white, the size of those mothball cans you hang in your closet, and easy to set up — but they’re cheaper, probably because they aren’t named after a designer. A pack of three goes for $299. It’s fast, too. I got the highest speeds from Google Wifi — 115 mbps. And that was from the couch formerly known as the dead spot! (I should specify that my internet speeds are determined largely at the mercy of my ISP, Spectrum/Time Warner. But still.) Google Wifi also does all the neat tricks that the other newcomers do, like allowing remote network management, setting up guest networks, and pausing devices to keep the kiddies from staying up all night with Minecraft. Google Wifi This would seem like considerable competition for the likes of Eero, but Nick Weaver says he isn’t worried, because people will conclude that routers associated with one ecosystem of devices won’t work as well as devices made by unaffiliated companies. “Google products are going to work really well with Google products, but not as well with Apple, Sonos, or Amazon,” he says. Really? Do wifi signals discriminate? That’s now a $200 question, the difference between a set of Eero or Plume devices and Google’s. It’s a question I’ll have to deal with soon. Now that I am done testing these devices, it’s clear that I’m never going to plug in my old router. Rather, I’ll be choosing which mesh set to buy—a decision that I’m guessing many of you will also be making in the next year or two. To make the right choice, we may require a sommelier of wifi, someone who can divine our preferences, assess our living spaces, calculate our budget, and come up with a personalized solution. Inevitably, we will spend a multiple of the amount we used to drop on a new router once the old one petered out. The New Wifi is the $5 latte to the standard cup of coffee. And it’s just as tasty and essential. More from Home Week: For Nextdoor, Eliminating Racism Is No Quick FixSocial media has a racism problem because humans have a racism problem. Can one company solve it?backchannel.com Syrian History Is Unfolding on WhatsAppSocial media is offering a lifeline for fractured families — and a window into the refugee crisis.backchannel.com First They Got Sick, Then They Moved Into a Virtual UtopiaReal-life Fran was a hiker and a dancer. But when Parkinson’s stole her mobility, she discovered a new home inside…backchannel.com Craigslist Is Ugly, Janky, Old School…and UnbeatableInside Silicon Valley’s mad race to sell your crap better.backchannel.com ", "title": "Prepare to Obsess Over the Future of Home Wifi", "sentences": [{"6637": "Prepare to Obsess Over the Future of Home Wifi"}, {"316b": "Eero, Plume, and others want you to become connoisseurs of your own data."}, {"253f": "One day last summer I was creeping in my rental car along the Alameda de las Pulgas — the Avenue of Fleas — in Menlo Park, trying to spot a house number without getting rear-ended. This wasn’t going to be the usual product demo. I was going to be exposed to the future of wifi in a three-bedroom tract home."}, {"f209": "Actually, the future of wifi had been creeping up on me for years, like a distant “save this date” event that elicits a groan when it finally pops up on the calendar. In fact, earlier last year I had begun experimenting with an early example of The New Wifi gadgets — they come in packs, like wolves or mean girls — called Eero. It’s named after a designer, which is the official international signal that you’re going to overpay for something. (Eero Saarinen was the dude who designed those chairs that are the furniture equivalent of Modigliani models; he was also behind the recently bulldozed TWA Terminal at JFK. By the way, if a product is named after a designer with two double vowels in his name, it’s going to cost even more.)"}, {"9f42": "Eero turned out to be one of a number of new wifi companies, with names like Luma and Orbi — not all dubbed after designers, but dreamy enough to command a premium. These are “mesh” networks, based on the idea that a swarm of routers that talk to each other and pass on data, bucket-brigade style, can eliminate the dead spots in your home. Unlike Good Old-Fashioned Wifi (GOFWF), where you plug your router into the cable or DSL modem where internet is piped into the home and then have no idea what happens thereafter, these are set up and monitored by apps."}, {"2c2b": "Follow Backchannel: Facebook | Twitter"}, {"a77a": "The New Wifi is part of a larger digital trend. Home used to be a place where our communication needs were modest — one line for the phone, one for the cable box, and one for the lone routers serving our computers. Now, increasingly, broadband alone powers a dizzying profusion of devices — digital personal assistants, streaming videos, tablets, phones, speakers, thermostats, smoke alarms , lightbulbs, and sex toys. Just as we have what used to be supercomputers in our pockets, our homes now require the telecommunications infrastructure of a small city."}, {"d9de": "Case in point is the “test house” of the wifi company called Plume, the place I was looking for on the Avenue of Fleas. I was greeted by its CEO Fahri Diner and a group of technicians. Diner, born in Cyprus but a Silicon Valley resident since 2002, has a long background in wireless tech. “I am one of the guys who brought broadband to your home,” he says. “I feel like I needed to finish the job.” Diner gave me the lowdown on his product, which differs from Eero and many of the other meshers in that much of the actual digital work of a usual router is off-loaded to the cloud. As companies like Eero move us from a one-router world to a three-router world, Diner says Plume’s solution is a “zero-router world.” That doesn’t mean it’s free: You still need compact base units that sell for $69 each (a three-pack is $179, a six-pack $329), and Plume estimates that a large home might use as many as twelve units. In any case, having the router in the cloud enables more computation, so that Plume’s distant servers can constantly calculate the best configuration of devices and even switch frequency channels when they detect a conflict with nearby networks. Diner calls it “adaptive wifi.”"}, {"c930": "For Nextdoor, Eliminating Racism Is No Quick FixSocial media has a racism problem because humans have a racism problem. Can one company solve it?backchannel.com"}, {"eda0": "I spent over an hour with Diner and his team plugging and unplugging devices in the house; after each exercise we would trudge down to the living room, where a diagram of the home network — more convoluted than the org chart of the Trump White House — listed every device along with the bit rate it was receiving. Yes, The New Wifi means data—not only on internet speed, but also on which devices are active, which channels are preferred, and which arrangement of gadgets is optimal."}, {"3c31": "That was when I realized that our relationship with wireless has changed for good. From this point on our data flow will be better, but we will have to become network administrators in the process. The amateur stage of home wifi is over, and, like it or not, we’re doomed to become pros."}, {"a434": "Wifi was never supposed to be a big thing, and certainly not a thing that would become as vital to a home as indoor plumbing. It was a mongrel standard that took advantage of “unlicensed spectrum,” meaning that any backyard tinkerer or rogue startup could use it. (As opposed to licensed spectrum, which the government auctioned off to big telecom companies for billions.) According to Wikipedia, the wifi spectrum was released for experimentation in the early 1985, when some scientists working for the Australian government made some tweaks that got them a patent—and a windfall for their government. In 1997, the technology got approved as an IEEE standard — 802.11, pronounced eight-oh-two-dot-eleven. But by the end of the 1990s it was still pretty much unknown, until a benefactor changed its life, and ours. His name was Steve Jobs."}, {"e2a2": "I was an eyewitness to this history. It was late July of 1999, and Jobs was introducing his first portable—a clamshell-shaped, rubber-clad gadget called the iBook. It came in two colors: tangerine and blueberry. (At the time, this was a radical design statement.) I got my first glimpse of them in Jobs’s boardroom a week before the launch, with Apple’s CEO literally whisking away a black sheet that had covered them."}, {"ae28": "After he flipped their lids to reveal that they ran Mac OS, he surprised me. “Let’s go for a walk!” he said, grabbing the tangerine box. I took the blueberry. Each of them weighed over six pounds, but that was actually pretty good for the time. The browser address was set to Quicktime movie trailers: James Bond for Jobs, Austin Powers for me. And here’s the amazing part: As we circled the table, the movie clips kept playing without any wires. It was a miracle! Jobs was literally dancing with glee, in some dad-like version of a touchdown celebration. “We’ve got internet streaming media as we walk around!” he crowed. “Isn’t this why we got into this business in the first place?”"}, {"e695": "Syrian History Is Unfolding on WhatsAppSocial media is offering a lifeline for fractured families — and a window into the refugee crisis.backchannel.com"}, {"34aa": "Wifi had been building momentum (though that catchy name, a marketer’s play on Hi-Fi, or “high fidelity,” wasn’t even officially adopted until later that summer). Even so, building a wifi modem directly into a mainstream product was a leap too big for even Apple at the time. In order to activate it you needed to install a $99 hardware card underneath the battery. (For a few years, having one of those cards was pretty much the only way to get wifi in your computer.) And then of course you had to buy a hotspot, a router that took an internet signal and pumped it into the air. Apple came out with its own version, called the Airport: a white, vaguely UFO-shaped mini-dome."}, {"beff": "Over the next decade and a half, wifi found its niche. It was built into not only computers but also devices of every sort. Hotspots were everywhere, from Starbucks to actual airports. The prices of routers went down, so you could get something for $50 or $60. But in terms of solving consumer problems, routers saw very little improvement. The problems of wifi — notably, a limited range and interference with other networks — were a persistent annoyance."}, {"e5f5": "A couple of years ago, it seemed to dawn on a new wave of startups that the problem was an opportunity. One of those founders was Nick Weaver, now CEO of Eero. I met Weaver about a year ago. He told me that he was his neighborhood’s Mr. Fixit, setting up wifi networks. At Stanford, he was his dorm’s network administrator. From his experiences, he realized that even in a home, you needed a bunch of routers — boosting the range of a single one wouldn’t do it. “You’re not going to defeat the laws of physics,” he says. He started Eero in 2014. One of his advisors was Jon Rubinstein, who had been Apple’s hardware czar during its iPod days."}, {"629d": "Eero costs $199 for the first unit you buy, and you get a three-pack for $499. The white plastic is reminiscent of the original Airport, but the Eeros are flatter and more compact. Setup is done through the app and is pretty easy, though you do have to painstakingly reprogram the wifi on every device. I’ve previously tried to address my apartment’s deadest spot — the worst being the living room couch, which was at the farthest point in the living area from the cable modem, which, for reasons that escape me now, lives in the master bedroom — by installing an “extender” that picks up the signal from the router and essentially starts a new network to cover areas close to this second gadget. This second network only passes through about sixty percent of the signal you’d get in the bedroom, which made for slow internet on the couch and jumpy video streamed from the Apple TV. Worse, the extender requires a different network name and password, and of the two networks now in my apartment, my computer always seems to get on the wrong one."}, {"0f90": "Eero fixes that latter problem: Its mesh networks use a single network name and password."}, {"bebd": "The other advantage of the new wifi is the devices are all are controlled by a dedicated app. At any point, from any location, you can see whether the network is up, and what the speed is for any device. Checking the app becomes addictive; I’ve gained a habit that I never had to indulge in the old days of wifi."}, {"2de8": "Apps also allow you to do all sorts of things impossible with GOFWF. With Eero, for instance, parents can use it to turn off the router in a kid’s bedroom when they want to cut down on screen time. Eero also knows where your devices are — when you can’t find your iPhone, just ask your Echo (using the Eero Alexa skill), “Tell Eero to find Steven’s phone.” It might tell you it’s connected to the bedroom Eero or, if it can’t find it, it can tell you when and where it was last connected to the network."}, {"8eb7": "Both Eero and Plume, which I got to sample some months after my visit to the test home, have provided a vast improvement over my old single router. Eero was straightforward to set up in a three-unit gang, and — hallelujah! — my couch is no longer a dead spot!"}, {"d146": "I also liked my experience with Plume. I used five units that plug directly into the wall, saving counter space. That’s plenty for my 1,500 square feet of living space. Each one is maybe a little bigger than one of those electrical adapters that let you connect a three-prong to a two-prong socket."}, {"4822": "What I did not experience was the boost that Diner promised I’d get by dodging the interference from nearby routers. Living in a New York City apartment building, I usually have between 20 and 30 different networks that pop up under the drop-down wifi icon—most still maintain router names; others have descriptive titles such as “Emily’s home network” and one very annoying network dubbed “Bill Clinton’s Penis Extravaganza.” My speeds vary greatly — sometimes the browser loads nimbly; other times I’m surfing on molasses. Could Plume resolve that?"}, {"1d1b": "It didn’t seem to. I did like the idea that Plume constantly monitors the configuration of your network and makes adjustments accordingly—the mesh version of feng shui. But if the off-loaded Plume computation was madly switching channels to maintain the highest flow, it could have done better. One day the living room couch got a download rate of 17 mbps. (This came from the signal passing through three Plume devices.) The next day it only got seven. In the guest bedroom, only one degree of Plume away from the master device plugged directly into the cable modem, I was getting 37 mbps."}, {"afff": "Look, this is a lot better than having dead spots. As Weaver says, you can’t fool physics. But since we’ve now figured out that wifi physics require more routers, I think we’re going to see a lot more of them. They might even disappear. Eventually, I think Eero, Plume, and the like might sink their technology into home assistants, Sonos speakers, or Nest thermostats. Everything could be part of a wifi mesh — routers could be built into Internet of Things devices and vice versa."}, {"f668": "Ultimately, I think everything will. When I caught up with Weaver recently, he also shared some data he’d gathered from analyzing users. The most remarkable one — and one that speaks to the need for improved home wifi — was the rapid increase in the number of gadgets in the home that consume wifi. “It used to be seven, eight, nine — now it’s like 15 devices,” he says. With all that proliferation, it seems inevitable that wifi itself will become just one more function in our giant Lego box of internet-connecting stuff. The competition might not be who has the best hardware, but the best app."}, {"087e": "But that’s a vision for years to come — right now we’re still beginning The New Wifi revolution. Just as I was finishing this piece I tried out another newcomer, from Google. Google Wifi devices are a lot like Eero’s — white, the size of those mothball cans you hang in your closet, and easy to set up — but they’re cheaper, probably because they aren’t named after a designer. A pack of three goes for $299."}, {"5f25": "It’s fast, too. I got the highest speeds from Google Wifi — 115 mbps. And that was from the couch formerly known as the dead spot! (I should specify that my internet speeds are determined largely at the mercy of my ISP, Spectrum/Time Warner. But still.) Google Wifi also does all the neat tricks that the other newcomers do, like allowing remote network management, setting up guest networks, and pausing devices to keep the kiddies from staying up all night with Minecraft."}, {"3f6d": "Google Wifi"}, {"9fea": "This would seem like considerable competition for the likes of Eero, but Nick Weaver says he isn’t worried, because people will conclude that routers associated with one ecosystem of devices won’t work as well as devices made by unaffiliated companies. “Google products are going to work really well with Google products, but not as well with Apple, Sonos, or Amazon,” he says."}, {"64d9": "Really? Do wifi signals discriminate? That’s now a $200 question, the difference between a set of Eero or Plume devices and Google’s."}, {"f716": "It’s a question I’ll have to deal with soon. Now that I am done testing these devices, it’s clear that I’m never going to plug in my old router. Rather, I’ll be choosing which mesh set to buy—a decision that I’m guessing many of you will also be making in the next year or two. To make the right choice, we may require a sommelier of wifi, someone who can divine our preferences, assess our living spaces, calculate our budget, and come up with a personalized solution."}, {"1fb0": "Inevitably, we will spend a multiple of the amount we used to drop on a new router once the old one petered out. The New Wifi is the $5 latte to the standard cup of coffee. And it’s just as tasty and essential."}, {"e3f4": "More from Home Week:"}, {"a8be": "For Nextdoor, Eliminating Racism Is No Quick FixSocial media has a racism problem because humans have a racism problem. Can one company solve it?backchannel.com"}, {"ecd9": "Syrian History Is Unfolding on WhatsAppSocial media is offering a lifeline for fractured families — and a window into the refugee crisis.backchannel.com"}, {"0d60": "First They Got Sick, Then They Moved Into a Virtual UtopiaReal-life Fran was a hiker and a dancer. But when Parkinson’s stole her mobility, she discovered a new home inside…backchannel.com"}, {"891a": "Craigslist Is Ugly, Janky, Old School…and UnbeatableInside Silicon Valley’s mad race to sell your crap better.backchannel.com"}], "child": "419_1\t419_2\t419_3\t419_4\t419_5\t419_6\t419_7\t419_8\t419_9\t419_10\t419_11\t419_12\t419_13\t419_14\t419_15\t419_16\t419_17\t419_18\t419_19\t419_20\t419_21\t419_22\t419_23\t419_24\t419_25"}