{"name": "425", "parent": "", "content": "Why Bargain Travel Sites May No Longer Be Bargains Aggregators like Expedia have made us lazy — and we may be missing out on the best deals. Last August, Andrea Giacobbe logged on to Skyscanner, a European metasearch engine like Expedia and Travelocity that scans multiple travel websites and surfaces the cheapest fare. Giacobbe, a 52-year-old management consultant, was looking to book a flight from New York City to Genoa, Italy—a trip he’s made numerous times for family visits. He’d always relied on Skyscanner for a discount. This time, the cheapest fare wasn’t that cheap: It was for an Alitalia flight that made two stops, through Milan and Rome, for $2,050. Surprised at the high quote, he decided to call Alitalia. Immediately, the airline offered a $1,550 flight with only one stop in Rome. It was cheaper. It would get there faster. They even offered him a discounted car rental. Follow Backchannel: Facebook | Twitter “It blew my mind,” recalled Giacobbe. He hadn’t called Alitalia directly in years. He was accustomed to almost always relying on Skyscanner for the best deal. Giacobbe’s experience is becoming more typical. Over the past several years, the conventional wisdom has been that cruising the net would yield the best prices in the travel, hotel, and car rental spaces. There’s been a tidal shift in the travel industry, to a point where most of us use aggregators to book our trips. Who bothers talking to a human being—a travel agent? You’re just going to be stuck in a long option queue. Most of us rely on metasearch engines, like Priceline, Expedia, or Travelocity, which typically use dozens (sometimes as many as 200) of online travel agents, called OTAs, and aggregators to find the best deals. (A metasearch engine and an aggregator are interchangeable terms — they both scour other sites and compile data under one roof. An OTA is an actual travel agency that actually does the booking and is the lone site responsible for everything you buy through them.) We rely on these sites because we assume they have the secret sauce — the most powerful search engines, tweaked by superstar programmers armed with the most sophisticated algorithms—to guide us to the cheapest options. With a single search, you can feel assured that you are paying a rock bottom price. Over time, however, the convention has flipped. As competition among the sites heated up, the hard-to-believe cheap fares required some filtering. A too-good-to-be-true fare ($99 to Europe from California) usually came with a catch (the $400, indirect, ticket home). And as the business models that on which these aggregators rely are getting tighter, the deals are getting worse. How can you be certain you’re getting the lowest quote? The short answer is, you can’t. While reporting this piece I spoke to several software engineers, executives of hotel chains, as well as academics and researchers who have spent a considerable amount of time and effort digging into the issue. Their conclusion is that the industry is in flux, and that really good bargains—for hotels, flights, and car rentals—are often largely illusory. “Hotels are not giving the aggregators as many good deals as they did in the past,” a former software engineer who used to work for Priceline told me. (He didn’t want his name used because he still is seeking work in the industry.) “You might as well call Sheraton’s front desk.” And good luck finding the delinquent parties: The number of players behind each transaction has ratcheted up. For every potential deal, there are likely to be multiple aggregators in the food chain, with each site taking a cut and ultimately driving up the final cost. My ex-Priceline source told me that aggregators explain away price fluctuations by citing the ebb and flow of supply and demand, which varies greatly in seasonal resort areas. But really, it’s a breakdown in the system. Just as airlines and hotels began trimming travel agent commissions more than 20 years ago, now history is repeating itself. “The airlines don’t want to pay the aggregators anymore,” he told me. Which means the people who are paying them are us. As early as the 1990s, before the ubiquity of the internet, you called your travel agent and he or she took care of everything — your flights, the hotel, the rental car. America Airlines, the Hyatt, Hertz and the like paid the travel agents to offer their services. But slowly, the landscape changed. The airlines and hotel chains stopped paying. Travel agents stopped offering their services for “free.” The consumer shouldered their fees, and travel agents became irrelevant players to all but the boutique wealthy travelers who didn’t need to worry about cost. Technology aided in this inevitable disruption, and ultimately helped create some of the pricing chaos we see today. As the internet became the first stop for travel shopping, we started searching for bargains via keystroke commands. We stopped talking to hotel clerks, rental car agents, and airline reservation agents, and we boasted to our friends about our low-cost vacations to Lake Como. All of this was made possible by the web aggregators. Web aggregators work like this: When you type in where you want to go, when you want to go, or where you want to stay, the aggregators give you a list of options. The vendors set the prices of the options, not the aggregators, and adjust them at their will. The aggregators are paid by the click, but if you book a plane or hotel room through them, they get a larger commission from the company. Most of the contracts with online travel sites do not allow them to undercut the hotels’ or airlines’ rates. In the early days of online booking, sites like Kayak and Orbitz were able to cut deals with hotel chains and airlines by asking for blocks of empty hotel rooms or airline seats that normally went unsold. A Delta or Starwood could justify paying high commissions for a booking because any sale was better than an empty seat or a vacancy. But as more aggregators popped up the business model was shaken; there were suddenly layers of players, all looking for a piece of your booking. As search technology became more powerful and accessible, more and more hotel rooms were being sold at third-party sites. Commercial vendors have also taken advantage of the technology to delve into your shopping behavior. Browser cookies give information to aggregators that can trigger price disparities. Your zip code and even your device can make a difference. For example, if you’re looking for a hotel room at 5 p.m. for that evening and you’re using your phone to search, the aggregator’s algorithm will assume you’re more desperate than if you were using your desktop computer. “Every time you look at a deal, your search is recorded somewhere,” the ex-Priceline programmer told me. The hospitality industry has responded to all of this by trying to sell rooms without paying commissions. I talked to a CEO in California that runs a corporation consisting of a handful of resort hotels (he also didn’t want to be identified). He told me that in the past few years, the large chains have ramped up advertising and promotion, often by gussying up their own websites and offering easy entry rewards programs by booking directly through their sites. I wondered about the deals offered by TripAdvisor, which advertises itself as the best metasearch engine to get the cheapest prices. Brian Hoyt, the head of corporate communications, insisted that its new “instant book technology” scours all of the current available rates from all the major OTAs and aggregators. He said the company has struck major deals with Hilton, Starwood, and Marriott, among other large hotel chains. TripAdvisor, which bills itself as the “world’s largest travel site,” may be desperate for other deals. (It’s latest financial statement shows negative cash flow in the hotel sector, so business is not exactly thriving.) When I pressed Hoyt about equaling or beating the offers on Hilton’s site, he evaded the question. If you check TripAdvisor’s results against any of Hilton’s hundreds of thousands of rooms, you will see that the cheapest Hilton rooms are found on their own site. Consolidation, mergers, and acquisitions of the aggregators have driven up prices even higher. Expedia owns Hotels.com and a dozen-plus sites, including Travelocity, Orbitz, and Trivago. Behind the scenes, Expedia licenses out access to its databases and technology, so it’s very easy for someone to set up a “new” aggregator business that is really just another version of Expedia under a different name. Pretty much anyone can get in the game by paying for access to the Central Reservation System, or CRS, for hotel rooms, or the Sabre or Amadeus data bases that list the prices of almost every airline and flight, with up-to-date fluctuations in fares. “Every middle man wants to get a piece, and so there are small fees that go everywhere,” said Christo Wilson, the head of the Algorithm Auditing Research Group at Northeastern University’s College of Computing and Information Science. Two years ago he spent months researching aggregator behavior, using a team of 300 volunteers. His team discovered that dynamic pricing (shifts due to supply and demand, and dictated by mouse-click traffic) also led to price discrimination and “steering,” where consumers were led to sites that weren’t necessarily the best deals. Wilson’s group noted that Orbitz was steering Apple OSX users, for example, to more expensive hotels, since the algorithm assumed that an Apple user was more affluent than a PC user. The company denied the accusation but ended the practice. In a response to Wilson’s research, the company said using the Mac OS was just an “experiment” and “short-lived.” As OTAs became more prominent, it also become more difficult to complain to the front desk. Today’s complaint department has many hidden layers guarding it. And it may be harder than ever to find it when something goes wrong when you book through an aggregator. As the number of aggregators have grown, it’s become more difficult to pinpoint the responsible party when a guest has a problem with a booking. Yelp and other review sites boast thousands of reviews from unhappy customers wondering how their reservations mysteriously disappeared on arrival. Wilson says the problem is the sheer volume of players. Search any app store and you’ll find dozens of companies that allow you to book hotel rooms—but most of the sites have never corresponded directly with the company. “They’re just a layer that resells from someone else’s database,” Wilson told me. So when a customer has a problem, it’s difficult to know who to go to—as Wilson said, because “once the stack is sufficiently deep, it’s impossible to say who actually made the sales.” There are already signs that computer and smartphone users are wizening up. Sarah Hughes, a cofounder of travel industry consulting firm Fiz, has reported that research shows that “the majority of users now prefer to book directly via airlines and hotels rather than rely on online travel agencies….What does this tell us? That consumers are more interested in travel brands than they are in having information pre-filtered according to a narrow set of perceived needs.” But it also tells us something far more important. It reveals that consumers are no longer taking for granted that aggregators offer the best deals. “The price compare sites are mostly a waste of time,” Tom Lewis, a self-proclaimed travel industry insider, wrote on Quora. “The only deals are on last minute unsold inventory in off-season periods. You can get those discounts by calling yourself or better yet booking with a good agent.” He’s right: The price control pendulum is swinging back toward the hoteliers. “It was really easy for the aggregators to gobble up all this business in the past because the hotels weren’t really paying any attention,” that West Coast CEO told me. But eventually, the aggregators cornered so much of the market that they jacked up their commissions high enough that everyone had to take notice. The CEO revealed that his hotels typically paid aggregators 20 percent commission—and in many cases even 30 percent. In past two or three years the hotel industry has been fighting the aggregators by offering deals that wiggle around the contracts they originally set with them. Let’s say, for example, your hotel chain has a set rate for a room. You enter in an agreement with an aggregator that says you won’t further discount the rate that is the “lowest price” a customer can find on the internet. But you can get around it by offering a potential guest an instant membership in your “loyalty” program. You can throw in additional “amenities” (parking, spa, and so on) that would normally cost extra and you would not be violating your agreements by undercutting the base price of the room. Tricky? You bet. In February 2016, the Hilton Hotels Corporation decided to challenge aggregators with a bold plan: guaranteeing the lowest possible rate if you went right to the source, its own website. The push came with a marketing slogan, “Stop Clicking Around,” and a series of TV ads featuring the Rolling Stones’ “Satisfaction.” Chris Silcock, the chain’s chief commercial officer, told me that it was the largest, most expensive marketing push in the chain’s 97-year history. Hilton is a perfect test case: If Expedia is the elephant in the aggregator space, Hilton is the elephant in the hospitality industry. Its subsidiaries have 775,000 rooms in 4,700 hotels in 550 locations on six continents. Silcock said the campaign was a huge success. The subtle sales gimmick behind the plan was to get first-time guests to sign up for the Hilton’s honors rewards program. Membership over the last year has doubled, from three million to six million with a total of 60 million now in their database. And much of the growth was via the hotel chain’s smartphone app. “You don’t have to join our club,” Silcock said, “but it will give you a better price.” The Intercontinental Hotels Group, which owns several brands from Holiday Inns to Candlewood Suites, also announced a slightly less aggressive campaign. Beginning this year, it will not offer rewards points if guests book through aggregators. Last October, I checked the online price of a Hilton Embassy Suites room in Fort Lauderdale for a weekend in January. A listing of $349 a night was quoted by TripAdvisor, PriceFinder, Hotels.com, and Expedia. The Hilton website quoted me a price of $331. You can pat yourself on the back clicking around, looking for a cheap hotel room or a great airfare. But it might be better to resort to an old technology: Just pick up the phone and call the front desk. ", "title": "Why Bargain Travel Sites May No Longer Be Bargains", "sentences": [{"550b": "Why Bargain Travel Sites May No Longer Be Bargains"}, {"b7d9": "Aggregators like Expedia have made us lazy — and we may be missing out on the best deals."}, {"c730": "Last August, Andrea Giacobbe logged on to Skyscanner, a European metasearch engine like Expedia and Travelocity that scans multiple travel websites and surfaces the cheapest fare. Giacobbe, a 52-year-old management consultant, was looking to book a flight from New York City to Genoa, Italy—a trip he’s made numerous times for family visits. He’d always relied on Skyscanner for a discount."}, {"c33e": "This time, the cheapest fare wasn’t that cheap: It was for an Alitalia flight that made two stops, through Milan and Rome, for $2,050. Surprised at the high quote, he decided to call Alitalia. Immediately, the airline offered a $1,550 flight with only one stop in Rome. It was cheaper. It would get there faster. They even offered him a discounted car rental."}, {"a564": "Follow Backchannel: Facebook | Twitter"}, {"35aa": "“It blew my mind,” recalled Giacobbe. He hadn’t called Alitalia directly in years. He was accustomed to almost always relying on Skyscanner for the best deal."}, {"b938": "Giacobbe’s experience is becoming more typical. Over the past several years, the conventional wisdom has been that cruising the net would yield the best prices in the travel, hotel, and car rental spaces. There’s been a tidal shift in the travel industry, to a point where most of us use aggregators to book our trips. Who bothers talking to a human being—a travel agent? You’re just going to be stuck in a long option queue."}, {"aad9": "Most of us rely on metasearch engines, like Priceline, Expedia, or Travelocity, which typically use dozens (sometimes as many as 200) of online travel agents, called OTAs, and aggregators to find the best deals. (A metasearch engine and an aggregator are interchangeable terms — they both scour other sites and compile data under one roof. An OTA is an actual travel agency that actually does the booking and is the lone site responsible for everything you buy through them.) We rely on these sites because we assume they have the secret sauce — the most powerful search engines, tweaked by superstar programmers armed with the most sophisticated algorithms—to guide us to the cheapest options. With a single search, you can feel assured that you are paying a rock bottom price."}, {"42bc": "Over time, however, the convention has flipped. As competition among the sites heated up, the hard-to-believe cheap fares required some filtering. A too-good-to-be-true fare ($99 to Europe from California) usually came with a catch (the $400, indirect, ticket home). And as the business models that on which these aggregators rely are getting tighter, the deals are getting worse. How can you be certain you’re getting the lowest quote? The short answer is, you can’t."}, {"2a8a": "While reporting this piece I spoke to several software engineers, executives of hotel chains, as well as academics and researchers who have spent a considerable amount of time and effort digging into the issue. Their conclusion is that the industry is in flux, and that really good bargains—for hotels, flights, and car rentals—are often largely illusory. “Hotels are not giving the aggregators as many good deals as they did in the past,” a former software engineer who used to work for Priceline told me. (He didn’t want his name used because he still is seeking work in the industry.) “You might as well call Sheraton’s front desk.”"}, {"1bf0": "And good luck finding the delinquent parties: The number of players behind each transaction has ratcheted up. For every potential deal, there are likely to be multiple aggregators in the food chain, with each site taking a cut and ultimately driving up the final cost. My ex-Priceline source told me that aggregators explain away price fluctuations by citing the ebb and flow of supply and demand, which varies greatly in seasonal resort areas. But really, it’s a breakdown in the system. Just as airlines and hotels began trimming travel agent commissions more than 20 years ago, now history is repeating itself. “The airlines don’t want to pay the aggregators anymore,” he told me."}, {"a88d": "Which means the people who are paying them are us."}, {"a7d4": "As early as the 1990s, before the ubiquity of the internet, you called your travel agent and he or she took care of everything — your flights, the hotel, the rental car. America Airlines, the Hyatt, Hertz and the like paid the travel agents to offer their services. But slowly, the landscape changed. The airlines and hotel chains stopped paying. Travel agents stopped offering their services for “free.” The consumer shouldered their fees, and travel agents became irrelevant players to all but the boutique wealthy travelers who didn’t need to worry about cost."}, {"fd6f": "Technology aided in this inevitable disruption, and ultimately helped create some of the pricing chaos we see today. As the internet became the first stop for travel shopping, we started searching for bargains via keystroke commands. We stopped talking to hotel clerks, rental car agents, and airline reservation agents, and we boasted to our friends about our low-cost vacations to Lake Como."}, {"ea12": "All of this was made possible by the web aggregators."}, {"0ad5": "Web aggregators work like this: When you type in where you want to go, when you want to go, or where you want to stay, the aggregators give you a list of options. The vendors set the prices of the options, not the aggregators, and adjust them at their will. The aggregators are paid by the click, but if you book a plane or hotel room through them, they get a larger commission from the company. Most of the contracts with online travel sites do not allow them to undercut the hotels’ or airlines’ rates."}, {"5215": "In the early days of online booking, sites like Kayak and Orbitz were able to cut deals with hotel chains and airlines by asking for blocks of empty hotel rooms or airline seats that normally went unsold. A Delta or Starwood could justify paying high commissions for a booking because any sale was better than an empty seat or a vacancy. But as more aggregators popped up the business model was shaken; there were suddenly layers of players, all looking for a piece of your booking. As search technology became more powerful and accessible, more and more hotel rooms were being sold at third-party sites."}, {"6f63": "Commercial vendors have also taken advantage of the technology to delve into your shopping behavior. Browser cookies give information to aggregators that can trigger price disparities. Your zip code and even your device can make a difference. For example, if you’re looking for a hotel room at 5 p.m. for that evening and you’re using your phone to search, the aggregator’s algorithm will assume you’re more desperate than if you were using your desktop computer. “Every time you look at a deal, your search is recorded somewhere,” the ex-Priceline programmer told me."}, {"ecd7": "The hospitality industry has responded to all of this by trying to sell rooms without paying commissions. I talked to a CEO in California that runs a corporation consisting of a handful of resort hotels (he also didn’t want to be identified). He told me that in the past few years, the large chains have ramped up advertising and promotion, often by gussying up their own websites and offering easy entry rewards programs by booking directly through their sites."}, {"6886": "I wondered about the deals offered by TripAdvisor, which advertises itself as the best metasearch engine to get the cheapest prices. Brian Hoyt, the head of corporate communications, insisted that its new “instant book technology” scours all of the current available rates from all the major OTAs and aggregators. He said the company has struck major deals with Hilton, Starwood, and Marriott, among other large hotel chains."}, {"55d9": "TripAdvisor, which bills itself as the “world’s largest travel site,” may be desperate for other deals. (It’s latest financial statement shows negative cash flow in the hotel sector, so business is not exactly thriving.) When I pressed Hoyt about equaling or beating the offers on Hilton’s site, he evaded the question. If you check TripAdvisor’s results against any of Hilton’s hundreds of thousands of rooms, you will see that the cheapest Hilton rooms are found on their own site."}, {"ad6e": "Consolidation, mergers, and acquisitions of the aggregators have driven up prices even higher. Expedia owns Hotels.com and a dozen-plus sites, including Travelocity, Orbitz, and Trivago. Behind the scenes, Expedia licenses out access to its databases and technology, so it’s very easy for someone to set up a “new” aggregator business that is really just another version of Expedia under a different name. Pretty much anyone can get in the game by paying for access to the Central Reservation System, or CRS, for hotel rooms, or the Sabre or Amadeus data bases that list the prices of almost every airline and flight, with up-to-date fluctuations in fares."}, {"3e8e": "“Every middle man wants to get a piece, and so there are small fees that go everywhere,” said Christo Wilson, the head of the Algorithm Auditing Research Group at Northeastern University’s College of Computing and Information Science. Two years ago he spent months researching aggregator behavior, using a team of 300 volunteers. His team discovered that dynamic pricing (shifts due to supply and demand, and dictated by mouse-click traffic) also led to price discrimination and “steering,” where consumers were led to sites that weren’t necessarily the best deals."}, {"8b07": "Wilson’s group noted that Orbitz was steering Apple OSX users, for example, to more expensive hotels, since the algorithm assumed that an Apple user was more affluent than a PC user. The company denied the accusation but ended the practice. In a response to Wilson’s research, the company said using the Mac OS was just an “experiment” and “short-lived.”"}, {"2b75": "As OTAs became more prominent, it also become more difficult to complain to the front desk. Today’s complaint department has many hidden layers guarding it. And it may be harder than ever to find it when something goes wrong when you book through an aggregator. As the number of aggregators have grown, it’s become more difficult to pinpoint the responsible party when a guest has a problem with a booking. Yelp and other review sites boast thousands of reviews from unhappy customers wondering how their reservations mysteriously disappeared on arrival."}, {"e66c": "Wilson says the problem is the sheer volume of players. Search any app store and you’ll find dozens of companies that allow you to book hotel rooms—but most of the sites have never corresponded directly with the company. “They’re just a layer that resells from someone else’s database,” Wilson told me. So when a customer has a problem, it’s difficult to know who to go to—as Wilson said, because “once the stack is sufficiently deep, it’s impossible to say who actually made the sales.”"}, {"965b": "There are already signs that computer and smartphone users are wizening up. Sarah Hughes, a cofounder of travel industry consulting firm Fiz, has reported that research shows that “the majority of users now prefer to book directly via airlines and hotels rather than rely on online travel agencies….What does this tell us? That consumers are more interested in travel brands than they are in having information pre-filtered according to a narrow set of perceived needs.”"}, {"0b81": "But it also tells us something far more important. It reveals that consumers are no longer taking for granted that aggregators offer the best deals. “The price compare sites are mostly a waste of time,” Tom Lewis, a self-proclaimed travel industry insider, wrote on Quora. “The only deals are on last minute unsold inventory in off-season periods. You can get those discounts by calling yourself or better yet booking with a good agent.”"}, {"be40": "He’s right: The price control pendulum is swinging back toward the hoteliers. “It was really easy for the aggregators to gobble up all this business in the past because the hotels weren’t really paying any attention,” that West Coast CEO told me. But eventually, the aggregators cornered so much of the market that they jacked up their commissions high enough that everyone had to take notice. The CEO revealed that his hotels typically paid aggregators 20 percent commission—and in many cases even 30 percent."}, {"4941": "In past two or three years the hotel industry has been fighting the aggregators by offering deals that wiggle around the contracts they originally set with them. Let’s say, for example, your hotel chain has a set rate for a room. You enter in an agreement with an aggregator that says you won’t further discount the rate that is the “lowest price” a customer can find on the internet. But you can get around it by offering a potential guest an instant membership in your “loyalty” program. You can throw in additional “amenities” (parking, spa, and so on) that would normally cost extra and you would not be violating your agreements by undercutting the base price of the room. Tricky? You bet."}, {"5280": "In February 2016, the Hilton Hotels Corporation decided to challenge aggregators with a bold plan: guaranteeing the lowest possible rate if you went right to the source, its own website. The push came with a marketing slogan, “Stop Clicking Around,” and a series of TV ads featuring the Rolling Stones’ “Satisfaction.” Chris Silcock, the chain’s chief commercial officer, told me that it was the largest, most expensive marketing push in the chain’s 97-year history. Hilton is a perfect test case: If Expedia is the elephant in the aggregator space, Hilton is the elephant in the hospitality industry. Its subsidiaries have 775,000 rooms in 4,700 hotels in 550 locations on six continents."}, {"55f2": "Silcock said the campaign was a huge success. The subtle sales gimmick behind the plan was to get first-time guests to sign up for the Hilton’s honors rewards program. Membership over the last year has doubled, from three million to six million with a total of 60 million now in their database. And much of the growth was via the hotel chain’s smartphone app. “You don’t have to join our club,” Silcock said, “but it will give you a better price.”"}, {"e0cd": "The Intercontinental Hotels Group, which owns several brands from Holiday Inns to Candlewood Suites, also announced a slightly less aggressive campaign. Beginning this year, it will not offer rewards points if guests book through aggregators."}, {"9b2a": "Last October, I checked the online price of a Hilton Embassy Suites room in Fort Lauderdale for a weekend in January. A listing of $349 a night was quoted by TripAdvisor, PriceFinder, Hotels.com, and Expedia. The Hilton website quoted me a price of $331."}, {"5a41": "You can pat yourself on the back clicking around, looking for a cheap hotel room or a great airfare. But it might be better to resort to an old technology: Just pick up the phone and call the front desk."}], "child": "425_1\t425_2\t425_3\t425_4\t425_5\t425_6\t425_7\t425_8\t425_9\t425_10\t425_11\t425_12\t425_13\t425_14\t425_15\t425_16\t425_17\t425_18\t425_19\t425_20\t425_21\t425_22\t425_23\t425_24\t425_25"}