{"name": "426", "parent": "", "content": "The Real Stars of Y Combinator’s Demo Day The startups in YC’s Winter 2017 class marked a dramatic departure from the Silicon Valley of the past. YC’s Sam Altman and Michael Seibel Hi readers, this is Sandra. There are two views of Y Combinator’s twice-annual demo days, the most recent of which took place this week. You can look out, at the audience of investors, who rolled up in their sharpest South Bay uniforms: Tesla parked in the lot, blue-and-white checked shirt tucked in, salt-and-pepper hair on the head. (Though hey, who’s that exception over there… oh that’s Chamillionaire.) From that perspective, the future of startups looks just about the same as ever. It’s easy to assume that as long as the money people are cut from the same cloth, the ideas people will tend to look (and think) a lot like them. But if you shift your gaze towards the stage, at the founders pitching their startups, that outlook changes. This week, the entrepreneurs looked nothing like the past. The welcome surprise of YC’s Winter 2017 batch was that its startups were deeply, unabashedly, beautifully international. There was BuyPower, or “Paypal for Africa.” WaystoCap pitched itself as “the Alibaba of Africa.” Kudi.AI is building chatbots for payments in, wait for it, Africa. Slide the globe eastward one tick, and the Indian startup crop is equally abundant. DocTalk proposed a WhatsApp for Indian doctors and patients. Credy pedaled a peer-to-peer lending platform. Then there was Supr, pitching daily milk delivery in India. (Coming on the heels of two “X is the Trojan horse for Y” startups, Supr’s CEO noted that “milk is our Trojan cow.”) By my unofficial count, more than 40 percent of the startups in this class had international roots, including a coterie of companies from Latin America and Europe. With the premier incubator in the world banking its reputation on a global batch of companies, we’re seeing a clear break from tradition. And it might signify something more dramatic still, that the top tech institutions are becoming more inclusive. Silicon Valley is still home to the kingmakers, but the tycoons-to-be are starting to look a whole lot more cosmopolitan. Such changes don’t happen overnight. For YC, it’s been a slow build, beginning with the few emerging market startups accepted into earlier batches. Those companies proselytized to their friends back home, spreading the word to other ambitious entrepreneurs and strengthening YC’s brand abroad. And last fall, two YC partners, Qasar Younis and Michael Seibel, embarked on a global tour to drum up applications, including a several-day stop in Nigeria. The result was a strong uptick in interest from Nigerian startups, among others, and a total class of 261 founders that drew from 22 countries. I wasn’t the only one to notice the shift — YC partners took to the stage on two occasions to reassure investors that the bulk of these international startups were now based in the US. Over coffee breaks, the conversation frequently turned to geography. But there was another notable change that I didn’t see remarked upon. More than a third of the CEOs presenting on stage were women. Gone are the days when women only seemed to gain traction with women-themed companies, like dating or shopping. This week’s female hotshots were more likely to be pitching hardware, AI, and financial startups. Just like that, female founders have started to become boring. So I’d like to take a moment to thank Y Combinator for demonstrating superb leadership. The only way to make technology reflect society is to start early, with companies still in the sapling stage. YC is uniquely poised to nudge Silicon Valley in the right direction, and with this latest class of graduates, it’s safe to say it’s more than pulling its weight. — Sandra At Backchannel, We’re All About Outsiders: YC isn’t the only one going big on developing countries. Last fall Steven Levy wrote about Mark Zuckerberg’s adventures in Nigeria. This week I dug into how Google is pegging its global ambitions to emerging market startups. It’s a very smart plan framed around the idea of seeding the next dozen Silicon Valleys. My article highlights a Vietnamese founder whose AI app is helping English learners improve their accents. There’s another side to that: helping voice platforms like Siri and Alexa get smarter about non-standard accents. In this piece, Sonia Paul dives into the frontiers of speech recognition research to figure out why, exactly, Alexa can’t understand her mom. Reporting from the Philippines, Meredith Talusan recounts a surprising tale of how local women used a fleet of social media tools to flip the dating script with Western men. Read “How the Internet Gave Mail-Order Brides the Power” to learn how Filipinas ended up in charge. Gender politics are never simple, though. Look no further than Stella and Dot, a startup valued by Sequoia at $370 million that lures accomplished women into selling jewelry to their friends. You can call it a female-centric side of the gig economy… or a social media spin on the door-to-door vacuum salesman. Alexis Sobel Fitts asks: Which one is it? These stories and more are part of this week’s special report on Outsiders. We hope you enjoy it, and then let us know what awesome Outsiders stories we’re missing. Email us at editors@backchannel.com. ", "title": "The Real Stars of Y Combinator’s Demo Day", "sentences": [{"464e": "The Real Stars of Y Combinator’s Demo Day"}, {"e151": "The startups in YC’s Winter 2017 class marked a dramatic departure from the Silicon Valley of the past."}, {"9224": "YC’s Sam Altman and Michael Seibel"}, {"0a9b": "Hi readers, this is Sandra."}, {"1aaf": "There are two views of Y Combinator’s twice-annual demo days, the most recent of which took place this week. You can look out, at the audience of investors, who rolled up in their sharpest South Bay uniforms: Tesla parked in the lot, blue-and-white checked shirt tucked in, salt-and-pepper hair on the head. (Though hey, who’s that exception over there… oh that’s Chamillionaire.)"}, {"4fc3": "From that perspective, the future of startups looks just about the same as ever. It’s easy to assume that as long as the money people are cut from the same cloth, the ideas people will tend to look (and think) a lot like them."}, {"6e4a": "But if you shift your gaze towards the stage, at the founders pitching their startups, that outlook changes. This week, the entrepreneurs looked nothing like the past. The welcome surprise of YC’s Winter 2017 batch was that its startups were deeply, unabashedly, beautifully international."}, {"43c1": "There was BuyPower, or “Paypal for Africa.” WaystoCap pitched itself as “the Alibaba of Africa.” Kudi.AI is building chatbots for payments in, wait for it, Africa."}, {"30e4": "Slide the globe eastward one tick, and the Indian startup crop is equally abundant. DocTalk proposed a WhatsApp for Indian doctors and patients. Credy pedaled a peer-to-peer lending platform. Then there was Supr, pitching daily milk delivery in India. (Coming on the heels of two “X is the Trojan horse for Y” startups, Supr’s CEO noted that “milk is our Trojan cow.”)"}, {"762c": "By my unofficial count, more than 40 percent of the startups in this class had international roots, including a coterie of companies from Latin America and Europe. With the premier incubator in the world banking its reputation on a global batch of companies, we’re seeing a clear break from tradition. And it might signify something more dramatic still, that the top tech institutions are becoming more inclusive. Silicon Valley is still home to the kingmakers, but the tycoons-to-be are starting to look a whole lot more cosmopolitan."}, {"0060": "Such changes don’t happen overnight. For YC, it’s been a slow build, beginning with the few emerging market startups accepted into earlier batches. Those companies proselytized to their friends back home, spreading the word to other ambitious entrepreneurs and strengthening YC’s brand abroad. And last fall, two YC partners, Qasar Younis and Michael Seibel, embarked on a global tour to drum up applications, including a several-day stop in Nigeria. The result was a strong uptick in interest from Nigerian startups, among others, and a total class of 261 founders that drew from 22 countries."}, {"8684": "I wasn’t the only one to notice the shift — YC partners took to the stage on two occasions to reassure investors that the bulk of these international startups were now based in the US. Over coffee breaks, the conversation frequently turned to geography. But there was another notable change that I didn’t see remarked upon."}, {"f92b": "More than a third of the CEOs presenting on stage were women. Gone are the days when women only seemed to gain traction with women-themed companies, like dating or shopping. This week’s female hotshots were more likely to be pitching hardware, AI, and financial startups. Just like that, female founders have started to become boring."}, {"b413": "So I’d like to take a moment to thank Y Combinator for demonstrating superb leadership. The only way to make technology reflect society is to start early, with companies still in the sapling stage. YC is uniquely poised to nudge Silicon Valley in the right direction, and with this latest class of graduates, it’s safe to say it’s more than pulling its weight."}, {"813f": "— Sandra"}, {"9c2a": "At Backchannel, We’re All About Outsiders:"}, {"4e1b": "YC isn’t the only one going big on developing countries. Last fall Steven Levy wrote about Mark Zuckerberg’s adventures in Nigeria. This week I dug into how Google is pegging its global ambitions to emerging market startups. It’s a very smart plan framed around the idea of seeding the next dozen Silicon Valleys."}, {"68dd": "My article highlights a Vietnamese founder whose AI app is helping English learners improve their accents. There’s another side to that: helping voice platforms like Siri and Alexa get smarter about non-standard accents. In this piece, Sonia Paul dives into the frontiers of speech recognition research to figure out why, exactly, Alexa can’t understand her mom."}, {"4ec5": "Reporting from the Philippines, Meredith Talusan recounts a surprising tale of how local women used a fleet of social media tools to flip the dating script with Western men. Read “How the Internet Gave Mail-Order Brides the Power” to learn how Filipinas ended up in charge."}, {"0fb7": "Gender politics are never simple, though. Look no further than Stella and Dot, a startup valued by Sequoia at $370 million that lures accomplished women into selling jewelry to their friends. You can call it a female-centric side of the gig economy… or a social media spin on the door-to-door vacuum salesman. Alexis Sobel Fitts asks: Which one is it?"}, {"0abd": "These stories and more are part of this week’s special report on Outsiders. We hope you enjoy it, and then let us know what awesome Outsiders stories we’re missing. Email us at editors@backchannel.com."}], "child": "426_1\t426_2\t426_3\t426_4\t426_5"}