{"name": "428", "parent": "", "content": "Google’s Plan to Engineer the Next Silicon Valleys The tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online. Vu Van is a CEO in San Francisco. Born in Vietnam, she is a member of the auspicious class of Silicon Valley founders who are immigrants — among US startups valued above $1 billion, 51 percent have a foreign-born founder. Van earned her MBA at Stanford, locking herself into a network of hatchling executives. She had a pain point, realized that others shared her problem, and built a company to solve it. She debuted her app, Elsa Speak, at SXSW last year and promptly won an award. On paper, everything was Silicon Valley perfect. Except that in every other way, Van doesn’t fit the American startup mold. She’s the only member of her company based in the US. She geared up to build her app, an AI assistant for English learners to improve their accents, by returning to Vietnam and immersing herself in the needs of her initial target users. Almost two years later, her seven employees are split between Vietnam and Portugal. Follow Backchannel: Facebook | Twitter Van doesn’t hesitate to call San Francisco home, but she also stays for a business reason, which is that the networking is second to none. “Vietnam is all about first-generation startups,” Van explains. “Everyone is still figuring out what they’re doing, and no one’s in a good place to mentor.” So she’s planted herself in the one place on Earth where you can’t do your dry cleaning without running into a potential advisor, expert, investor, or future hire. For her company, that edge makes the time zone patchwork worth the sacrifice of sleep and sanity. So when Van first heard about Google’s new Launchpad Accelerator, she was skeptical. The company was in effect promising mature startups from emerging markets the most epic networking service on the planet: For every hiccup Elsa was facing, Google would match her and two colleagues with a top expert — sometimes the top expert — in that area. For free, with no catch, no quid pro quo. Van decided to give it a shot. Despite her Bay Area bonafides, launching a product in Vietnam had still been a slog. Elsa is one of the rising stars of The Rest of the World—and Google has a plan to get in the door of companies like Van’s and shape them in its image. It wants to educate them on the best practices of product development and speed up their learning curves. Think of it as strategic philanthropy: In exchange for helping these companies grow, Google gets to scrutinize their books, observe how its own products are being used (or not) in less familiar markets, and spread its gospel to the far reaches of the globe. Eventually, these companies will play an enormous role in getting millions more people to conduct their lives online, and Google will be there as well, ready to scoop up new users. “The one thing emerging markets are missing is success stories,” says Roy Glasberg, Launchpad’s global manager. “You need an ecosystem.” A wiry Israeli sporting close-cropped hair and performance-wear chic, Glasberg is articulating an ideology percolating inside Google about why so few big companies emerge from outside Silicon Valley. He and his colleagues say the word “ecosystem” a lot. It’s a subtle, unstated way of contrasting the rich environment of the Bay Area, where investors, board members, competitors, and talented workers swirl in a self-pollinating bubble, with the relative deserts of countries such as Indonesia, Mexico, or even bigger players like Brazil. In the ecosystem view, the Bay Area is the goldilocks planet, and the rest of the world has the inhospitable climate of Mars or Mercury. Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com Google’s theory is that until some company — any company! — has produced a massive IPO or engineered itself an eye-popping acquisition, a developing region won’t amass the resources it needs to support entrepreneurship. Venture capitalists are uneasy, or simply absent. The talent pool is shallow, with few local technologists who have first-hand experience transforming small companies into large ones. When you wonder where to find a good data scientist, or how to negotiate better terms in your series A, or what to fix in your app to get a better conversion rate, no one around you has the answers. So a delta force within Google, led by Glasberg, set out to see if it could do what countless governments, regional technology parks, and grant programs have failed to do before it: fire up startup kilns around the world that then take on a life of their own. They would do so by picking the sharpest, most proven startups, and showering them with unconditional support for six months (and $50,000, but who’s counting)— essentially treating them as integrated wings of Google for the duration. To earn that kind of access, these startups have to be much more than a Gucci knockoff. They’re not just the Postmates of the Philippines, or the Tesla of Thailand. They are fiercely unique, tackling unsolved problems and producing code that rivals anything emerging from San Francisco or the South Bay. These are the brightest minds of elsewhere. And Google’s now giving them a jolt of adrenaline straight from the planet’s entrepreneurial mothership: itself. Transporting the magic of Silicon Valley to other cities is a trope so old, and so beloved by government bureaucrats, that these days it hardly quickens the pulse. Silicon Alley. Silicon Glen. Silicon Wadi. Silicon Fen. Seated at a small table in the brand new San Francisco offices of the Launchpad Accelerator, Glasberg explains why Google’s approach is fundamentally different. “No one else is looking at emerging markets as a whole,” he says. Around him, a hundred-some entrepreneurs huddle in small group meetings with an elder statesman (or sometimes woman) of technology, or stare intently at their screens while seated elbow-to-elbow. We had to hunt to find two empty chairs, and eventually settled in between clusters of men leaning against low-slung cabinets, messenger bags strewn at their feet. The office hums with the low, persistent drone of voices. Glasberg, who first joined Google in Tel Aviv after a career in business development, has been formulating his own global theory of startup victory. “When you have a few successful startups, they come back and start investing in their community, starting funds,” Glasberg says. “You get a whole community boosting other startups.” He starts ticking off countries. “You don’t have that in Latin America. Brazil has never had a big exit. Argentina has had one.” From an investor’s point of view, he adds, startups “are already a risky business. So why should I go into a country that’s never had an exit?” The local venture capitalists who do take a stake in emerging market companies tend to push for a faster path to monetization than do the firms on Sand Hill Road, which in turn affects how a startup develops its products. (With more generous funding, entrepreneurs often feel free to chase after a riskier, higher-payoff goal.) Some investors may demand a bigger cut of the company. The startup’s workers, meanwhile, are similarly circumspect about their employers, often requiring high salaries rather than agreeing to work for equity. Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com The problems don’t end with investment. Without having played host to past startups that either IPO’d or got acquired, a country will be home to few—if any—entrepreneurs with first-hand experience of building a company from ten employees to hundreds or thousands, navigating that country’s particular regulatory landscape, or overcoming the challenges that define many emerging markets, such as poor connectivity. In a word, they’re missing expertise. So in 2015, Glasberg started scheming how Google might throw its weight behind solving what seemed to be the core problem—the lack of success stories. They settled on a strategy: They’d identify the best companies and try to solve as many of their business challenges as they could in a two-week Bay Area immersion program, followed by six months of remote mentorship. To have the most impact, Glasberg says, he and his collaborators decided they wanted more mature startups, whose products already have a healthy base of users. Often these companies are two or three years old, sometimes with 100 or more employees, and most of them have already raised a round or two of funding. Many of them are profitable. So rather than risk alienating the most promising companies, which might not want to give up any more slices of their equity, the Launchpad team decided that it would simply advise — and reap rewards for Google through other channels. “The equity-free model lets us play the accelerator game further down the startup’s evolution,” explains Josh Yellin, a program manager on Glasberg’s team. A former river ecologist, he joined Google in September 2015 to manage programming for the company’s startup communities, before moving over to help build the nascent accelerator. While he was preparing for Launchpad’s inaugural Winter 2016 class, the founders he talked to were at first confused by the word “accelerator,” which usually applies to earlier-stage startups, when really he was targeting companies on the verge of rapid expansion. “We tossed around the word ‘scale-a-rator,’ but that sounds like some kind of animal no one would want to meet,” Yellin recalls. Last month, the third group of Launchpad inductees — three or so employees each from 31 companies out of nine countries — went through their two-week blitz at Google’s Bay Area offices. Around 150 mentors also joined, many flying in from around the world to conduct deep, screen-by-screen code reviews, assess every app’s design in minute detail, and pore over each company’s hiring practices. “We now have three classes of data of every mentorship session that happens. We have a note from every mentor of what came out of it—what was the challenge, and what was the solution recommended,” Yellin says. Using all those reports, “we’re basically creating a map of what makes startups successful around the world.” When they joined, the founders, many of them in their thirties, many of them armed with battle-tested self-assurance, were told they could name anyone among Google’s almost 50,000 employees, and the company would broker an introduction. It wasn’t hyperbole. One founder and CEO, Reynazran Royono of Indonesia’s Snapcart, came to Launchpad nagged by an AI problem his team hadn’t solved. Snapcart users scan their receipts to earn cash-back rewards, but as the company grew to include 5,000 different grocery store chains and receipt formats, its engineers had stumbled into image recognition purgatory. So he requested a session with an expert on Tensorflow, Google’s widely used AI platform, and discovered that what he’d thought of as a mere annoyance was actually an open research question. “We talked to the Tensorflow guy, he said what we’re trying to crack is very difficult and he wanted to help,” Royono says. “But we’d get not just support from his team, but from the Google Brain guys, or the Ph.D. guys, to get help in cracking this problem.” Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com A Brazilian startup called Portal Telemedicina, meanwhile, went straight for the crown jewels. It has built up a network of online doctors who can diagnose the scans and data generated by numerous clinics’ medical devices, and it also relies heavily on AI. “We said, OK, I want to talk to the head of artificial intelligence at Google,” says Rafael Figueroa, the company’s founder and CEO. “They connected us with the guy in England, who, like, invented this stuff. He knows stuff that wasn’t available online anywhere!” The companies don’t just get resolution to bugs, though, as if they’re attending office hours back in college. The program is also built to spread startup best practices through hundreds of one-on-one sessions. For Van, the Vietnamese founder of Elsa, a prime goal was to steep two of her colleagues from Portugal in the Silicon Valley product development ethos: Iterate quickly, and don’t be afraid to launch imperfect products. In one meeting with a mentor, the team discussed how to solve some issues with its app’s onboarding flow. They were noticing that new users were dropping out partway through the app’s sign-up process, but they couldn’t figure out how to plug the leak. Her mentor, a renowned user experience expert named Jacob Greenshpan, suggested she try implementing a specific change over the weekend and see what happens. She said she’d think about it, falling back into a pattern of methodical deliberation that often characterized her team’s work. “And he said, ‘No, this is your homework for Saturday.’ So I said, ‘OK. Fine.’ And it worked! We got a 25 percent improvement,” she marvels. Van is the kind of entrepreneur who actually does her homework—who’ll read the 100-page manual and pore over every online resource she can find. But on normal days, she’s still effectively working alone. And her team can only absorb so many tech mantras from afar. Those limitations turn into the months-long headaches of, say, an imperfect onboarding experience. How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com What these entrepreneurs’ stories suggest is there’s an implicit exceptionalism to how we view successful startups. The usual story goes something like this: The right group of founders got together, built an outstanding piece of software, and, through their collective brilliance, managed to accrue thousands and then millions of users. That framework is not wrong, exactly — but it underestimates the enormous boost these companies get by virtue of geography and timing. Silicon Valley startups are like plants in a nursery, kept out of the cold, bathed in sunlight, and lightly spritzed on a daily basis. Out in the wild they’d end up more scraggly, if they survive at all—so it’s a good thing someone came around beforehand to build their cozy greenhouse. But even as these companies from outside the Valley get help from Google, some of them are beginning to compete with it. Van, for example, recently hired an engineer with expertise in AI out from under Google’s nose. Both Google and Amazon had made that engineer offers with significantly more money than Elsa could muster, Van says. But Elsa’s mission, with its potential to have a strong social impact, resonated with the engineer, so she turned down the Americans’ princely sums and moved from her home in Ukraine to join the team in Portugal. Google, meanwhile, gains plenty from bringing these startups into its fold. To get accepted, the companies undergo a grueling review, opening their books fully to Google employees. What emerges are not only the financial and technical details of individual companies, but also a growing portrait of startup health in a dozen different trying environments. Then there’s the product evangelism that occurs throughout the program. It’s no secret that Google has developed many platforms useful to startups —Firebase, Tensorflow, Google Cloud—and through Launchpad it’s assembled a captive audience of stellar engineers to listen as its employees rhapsodize about their favorite tools. “If they get the best startups to use their products in an early stage, it’s really hard to switch in the future, because the cost of switching is so high,” Van says. Glasberg takes a broader view. “Google gets two things out of this. One is really understanding what it takes to be a successful entrepreneur in emerging markets.” The other is that they can observe, under a microscope, developers from all corners of the world using Google products — the ultimate feedback. “We see firsthand what is working and what is not,” Glasberg says. “This is super critical, because these markets are the next billion. That’s where the future is.” The present, however, remains stubbornly in the Bay Area. Van has just returned from another of her lightning trips to visit her team in Vietnam. But after each lap of the globe she always settles back into San Francisco, to drink from the firehose once more. More from Outsiders Week: Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com ", "title": "Google’s Plan to Engineer the Next Silicon Valleys", "sentences": [{"5004": "Google’s Plan to Engineer the Next Silicon Valleys"}, {"8527": "The tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online."}, {"2e17": "Vu Van is a CEO in San Francisco. Born in Vietnam, she is a member of the auspicious class of Silicon Valley founders who are immigrants — among US startups valued above $1 billion, 51 percent have a foreign-born founder. Van earned her MBA at Stanford, locking herself into a network of hatchling executives. She had a pain point, realized that others shared her problem, and built a company to solve it. She debuted her app, Elsa Speak, at SXSW last year and promptly won an award. On paper, everything was Silicon Valley perfect."}, {"39f9": "Except that in every other way, Van doesn’t fit the American startup mold. She’s the only member of her company based in the US. She geared up to build her app, an AI assistant for English learners to improve their accents, by returning to Vietnam and immersing herself in the needs of her initial target users. Almost two years later, her seven employees are split between Vietnam and Portugal."}, {"06f8": "Follow Backchannel: Facebook | Twitter"}, {"c07c": "Van doesn’t hesitate to call San Francisco home, but she also stays for a business reason, which is that the networking is second to none. “Vietnam is all about first-generation startups,” Van explains. “Everyone is still figuring out what they’re doing, and no one’s in a good place to mentor.” So she’s planted herself in the one place on Earth where you can’t do your dry cleaning without running into a potential advisor, expert, investor, or future hire. For her company, that edge makes the time zone patchwork worth the sacrifice of sleep and sanity."}, {"c18d": "So when Van first heard about Google’s new Launchpad Accelerator, she was skeptical. The company was in effect promising mature startups from emerging markets the most epic networking service on the planet: For every hiccup Elsa was facing, Google would match her and two colleagues with a top expert — sometimes the top expert — in that area. For free, with no catch, no quid pro quo. Van decided to give it a shot. Despite her Bay Area bonafides, launching a product in Vietnam had still been a slog."}, {"ac8e": "Elsa is one of the rising stars of The Rest of the World—and Google has a plan to get in the door of companies like Van’s and shape them in its image. It wants to educate them on the best practices of product development and speed up their learning curves. Think of it as strategic philanthropy: In exchange for helping these companies grow, Google gets to scrutinize their books, observe how its own products are being used (or not) in less familiar markets, and spread its gospel to the far reaches of the globe. Eventually, these companies will play an enormous role in getting millions more people to conduct their lives online, and Google will be there as well, ready to scoop up new users."}, {"95ef": "“The one thing emerging markets are missing is success stories,” says Roy Glasberg, Launchpad’s global manager. “You need an ecosystem.” A wiry Israeli sporting close-cropped hair and performance-wear chic, Glasberg is articulating an ideology percolating inside Google about why so few big companies emerge from outside Silicon Valley. He and his colleagues say the word “ecosystem” a lot. It’s a subtle, unstated way of contrasting the rich environment of the Bay Area, where investors, board members, competitors, and talented workers swirl in a self-pollinating bubble, with the relative deserts of countries such as Indonesia, Mexico, or even bigger players like Brazil. In the ecosystem view, the Bay Area is the goldilocks planet, and the rest of the world has the inhospitable climate of Mars or Mercury."}, {"5c62": "Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com"}, {"f1d6": "Google’s theory is that until some company — any company! — has produced a massive IPO or engineered itself an eye-popping acquisition, a developing region won’t amass the resources it needs to support entrepreneurship. Venture capitalists are uneasy, or simply absent. The talent pool is shallow, with few local technologists who have first-hand experience transforming small companies into large ones. When you wonder where to find a good data scientist, or how to negotiate better terms in your series A, or what to fix in your app to get a better conversion rate, no one around you has the answers."}, {"9d54": "So a delta force within Google, led by Glasberg, set out to see if it could do what countless governments, regional technology parks, and grant programs have failed to do before it: fire up startup kilns around the world that then take on a life of their own. They would do so by picking the sharpest, most proven startups, and showering them with unconditional support for six months (and $50,000, but who’s counting)— essentially treating them as integrated wings of Google for the duration."}, {"1cd3": "To earn that kind of access, these startups have to be much more than a Gucci knockoff. They’re not just the Postmates of the Philippines, or the Tesla of Thailand. They are fiercely unique, tackling unsolved problems and producing code that rivals anything emerging from San Francisco or the South Bay. These are the brightest minds of elsewhere. And Google’s now giving them a jolt of adrenaline straight from the planet’s entrepreneurial mothership: itself."}, {"0e48": "Transporting the magic of Silicon Valley to other cities is a trope so old, and so beloved by government bureaucrats, that these days it hardly quickens the pulse. Silicon Alley. Silicon Glen. Silicon Wadi. Silicon Fen."}, {"d235": "Seated at a small table in the brand new San Francisco offices of the Launchpad Accelerator, Glasberg explains why Google’s approach is fundamentally different. “No one else is looking at emerging markets as a whole,” he says."}, {"1ca5": "Around him, a hundred-some entrepreneurs huddle in small group meetings with an elder statesman (or sometimes woman) of technology, or stare intently at their screens while seated elbow-to-elbow. We had to hunt to find two empty chairs, and eventually settled in between clusters of men leaning against low-slung cabinets, messenger bags strewn at their feet. The office hums with the low, persistent drone of voices."}, {"383c": "Glasberg, who first joined Google in Tel Aviv after a career in business development, has been formulating his own global theory of startup victory. “When you have a few successful startups, they come back and start investing in their community, starting funds,” Glasberg says. “You get a whole community boosting other startups.” He starts ticking off countries. “You don’t have that in Latin America. Brazil has never had a big exit. Argentina has had one.” From an investor’s point of view, he adds, startups “are already a risky business. So why should I go into a country that’s never had an exit?”"}, {"4bee": "The local venture capitalists who do take a stake in emerging market companies tend to push for a faster path to monetization than do the firms on Sand Hill Road, which in turn affects how a startup develops its products. (With more generous funding, entrepreneurs often feel free to chase after a riskier, higher-payoff goal.) Some investors may demand a bigger cut of the company. The startup’s workers, meanwhile, are similarly circumspect about their employers, often requiring high salaries rather than agreeing to work for equity."}, {"e4ea": "Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com"}, {"a2a2": "The problems don’t end with investment. Without having played host to past startups that either IPO’d or got acquired, a country will be home to few—if any—entrepreneurs with first-hand experience of building a company from ten employees to hundreds or thousands, navigating that country’s particular regulatory landscape, or overcoming the challenges that define many emerging markets, such as poor connectivity. In a word, they’re missing expertise."}, {"aa55": "So in 2015, Glasberg started scheming how Google might throw its weight behind solving what seemed to be the core problem—the lack of success stories. They settled on a strategy: They’d identify the best companies and try to solve as many of their business challenges as they could in a two-week Bay Area immersion program, followed by six months of remote mentorship."}, {"07a8": "To have the most impact, Glasberg says, he and his collaborators decided they wanted more mature startups, whose products already have a healthy base of users. Often these companies are two or three years old, sometimes with 100 or more employees, and most of them have already raised a round or two of funding. Many of them are profitable. So rather than risk alienating the most promising companies, which might not want to give up any more slices of their equity, the Launchpad team decided that it would simply advise — and reap rewards for Google through other channels."}, {"1741": "“The equity-free model lets us play the accelerator game further down the startup’s evolution,” explains Josh Yellin, a program manager on Glasberg’s team. A former river ecologist, he joined Google in September 2015 to manage programming for the company’s startup communities, before moving over to help build the nascent accelerator. While he was preparing for Launchpad’s inaugural Winter 2016 class, the founders he talked to were at first confused by the word “accelerator,” which usually applies to earlier-stage startups, when really he was targeting companies on the verge of rapid expansion. “We tossed around the word ‘scale-a-rator,’ but that sounds like some kind of animal no one would want to meet,” Yellin recalls."}, {"f308": "Last month, the third group of Launchpad inductees — three or so employees each from 31 companies out of nine countries — went through their two-week blitz at Google’s Bay Area offices. Around 150 mentors also joined, many flying in from around the world to conduct deep, screen-by-screen code reviews, assess every app’s design in minute detail, and pore over each company’s hiring practices."}, {"1c58": "“We now have three classes of data of every mentorship session that happens. We have a note from every mentor of what came out of it—what was the challenge, and what was the solution recommended,” Yellin says. Using all those reports, “we’re basically creating a map of what makes startups successful around the world.”"}, {"dac7": "When they joined, the founders, many of them in their thirties, many of them armed with battle-tested self-assurance, were told they could name anyone among Google’s almost 50,000 employees, and the company would broker an introduction. It wasn’t hyperbole."}, {"c891": "One founder and CEO, Reynazran Royono of Indonesia’s Snapcart, came to Launchpad nagged by an AI problem his team hadn’t solved. Snapcart users scan their receipts to earn cash-back rewards, but as the company grew to include 5,000 different grocery store chains and receipt formats, its engineers had stumbled into image recognition purgatory. So he requested a session with an expert on Tensorflow, Google’s widely used AI platform, and discovered that what he’d thought of as a mere annoyance was actually an open research question. “We talked to the Tensorflow guy, he said what we’re trying to crack is very difficult and he wanted to help,” Royono says. “But we’d get not just support from his team, but from the Google Brain guys, or the Ph.D. guys, to get help in cracking this problem.”"}, {"2b63": "Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com"}, {"2fe9": "A Brazilian startup called Portal Telemedicina, meanwhile, went straight for the crown jewels. It has built up a network of online doctors who can diagnose the scans and data generated by numerous clinics’ medical devices, and it also relies heavily on AI. “We said, OK, I want to talk to the head of artificial intelligence at Google,” says Rafael Figueroa, the company’s founder and CEO. “They connected us with the guy in England, who, like, invented this stuff. He knows stuff that wasn’t available online anywhere!”"}, {"2b9d": "The companies don’t just get resolution to bugs, though, as if they’re attending office hours back in college. The program is also built to spread startup best practices through hundreds of one-on-one sessions. For Van, the Vietnamese founder of Elsa, a prime goal was to steep two of her colleagues from Portugal in the Silicon Valley product development ethos: Iterate quickly, and don’t be afraid to launch imperfect products. In one meeting with a mentor, the team discussed how to solve some issues with its app’s onboarding flow. They were noticing that new users were dropping out partway through the app’s sign-up process, but they couldn’t figure out how to plug the leak. Her mentor, a renowned user experience expert named Jacob Greenshpan, suggested she try implementing a specific change over the weekend and see what happens. She said she’d think about it, falling back into a pattern of methodical deliberation that often characterized her team’s work. “And he said, ‘No, this is your homework for Saturday.’ So I said, ‘OK. Fine.’ And it worked! We got a 25 percent improvement,” she marvels."}, {"e784": "Van is the kind of entrepreneur who actually does her homework—who’ll read the 100-page manual and pore over every online resource she can find. But on normal days, she’s still effectively working alone. And her team can only absorb so many tech mantras from afar. Those limitations turn into the months-long headaches of, say, an imperfect onboarding experience."}, {"7439": "How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com"}, {"fd25": "What these entrepreneurs’ stories suggest is there’s an implicit exceptionalism to how we view successful startups. The usual story goes something like this: The right group of founders got together, built an outstanding piece of software, and, through their collective brilliance, managed to accrue thousands and then millions of users. That framework is not wrong, exactly — but it underestimates the enormous boost these companies get by virtue of geography and timing. Silicon Valley startups are like plants in a nursery, kept out of the cold, bathed in sunlight, and lightly spritzed on a daily basis. Out in the wild they’d end up more scraggly, if they survive at all—so it’s a good thing someone came around beforehand to build their cozy greenhouse."}, {"19ab": "But even as these companies from outside the Valley get help from Google, some of them are beginning to compete with it. Van, for example, recently hired an engineer with expertise in AI out from under Google’s nose. Both Google and Amazon had made that engineer offers with significantly more money than Elsa could muster, Van says. But Elsa’s mission, with its potential to have a strong social impact, resonated with the engineer, so she turned down the Americans’ princely sums and moved from her home in Ukraine to join the team in Portugal."}, {"7e74": "Google, meanwhile, gains plenty from bringing these startups into its fold. To get accepted, the companies undergo a grueling review, opening their books fully to Google employees. What emerges are not only the financial and technical details of individual companies, but also a growing portrait of startup health in a dozen different trying environments."}, {"5dec": "Then there’s the product evangelism that occurs throughout the program. It’s no secret that Google has developed many platforms useful to startups —Firebase, Tensorflow, Google Cloud—and through Launchpad it’s assembled a captive audience of stellar engineers to listen as its employees rhapsodize about their favorite tools. “If they get the best startups to use their products in an early stage, it’s really hard to switch in the future, because the cost of switching is so high,” Van says."}, {"8fa6": "Glasberg takes a broader view. “Google gets two things out of this. One is really understanding what it takes to be a successful entrepreneur in emerging markets.” The other is that they can observe, under a microscope, developers from all corners of the world using Google products — the ultimate feedback. “We see firsthand what is working and what is not,” Glasberg says. “This is super critical, because these markets are the next billion. That’s where the future is.”"}, {"fc01": "The present, however, remains stubbornly in the Bay Area. Van has just returned from another of her lightning trips to visit her team in Vietnam. But after each lap of the globe she always settles back into San Francisco, to drink from the firehose once more."}, {"badf": "More from Outsiders Week:"}, {"5c5a": "Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com"}, {"be30": "Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com"}, {"9d14": "How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com"}, {"0b26": "Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com"}], "child": "428_1\t428_2\t428_3\t428_4\t428_5\t428_6\t428_7\t428_8"}