{"name": "429", "parent": "", "content": "Inside the Startup Luring Thousands of Women into the Gig Economy Stella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.” The staff at the hotel began setting up the party early, lining up the tables along the beach. Strands of lights twinkled overhead, though the women arrived for the fete before sundown, toting husbands, boyfriends, and partners—witnesses to their entrepreneurial success. It was early March and warm in Costa Rica, the perfect weather for the final dinner of Stella & Dot’s “Glam Getaway trip”—a reward for some 400 of the jewelry and accessories company’s top sellers, called “stylists” in company lingo. These stylists sell the company’s ear cuffs and statement necklaces independently, either through their personal networks on Instagram and Facebook or at trunk shows, hosted at the homes of friends and acquaintances. These women (and they’re almost all women) are powering a digital age reinvention of direct sales companies like Avon and Mary Kay, minus the slog of selling door to door. Follow Backchannel: Facebook | Twitter In the 14 years since Jessica Herrin began making jewelry on her living room floor, Stella & Dot has grown into a global operation with 400 full-time employees, routinely grossing $300 million in annual sales. The main brand, focused on accessories, has over 30,000 stylists; its offshoot brands—KEEP Collective, which sells charms, and EVER, which sells organic skincare—add another 20,000 independent sellers. The company is enough of an innovator that Sequoia Capital courted Herrin to invest $37 million in 2011, valuing the company at $370 million. “Jessica never needed to raise money,” says Alfred Lin, the Sequoia partner who led the investment. “The investors have always knocked on her door, like, ‘How do we invest in this company.’” Herrin is in many ways an investor’s dream: a dot com veteran with tech bonafides, including stints at Dell and Trilogy and a prior successful startup. She is the rare female founder among a high-powered cohort that all graduated from Stanford in early ‘90s,* including men like Peter Thiel (who received his JD in 1992) and early PayPal COO David Sacks, as the New York Times noted in a profile. Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com Asked about her success, Herrin told the Times, “I’ve never tried to sit at the boys’ table.” That may, in fact, be her secret. In a world of Airbnbs and Snapchats and Dollar Shave Clubs, Stella & Dot is the kind of successful tech startup that tends to get overlooked. It’s women-led and women-focused, and therefore half invisible to the techies of Silicon Valley. Yet Herrin has managed to tap into a brutally underserved market: the tens of thousands of women around the country who are fueled by an unfulfilled entrepreneurial zeal and are in need of part-time work. They don’t have the time or energy to start their own companies, nor do they want to rough it in the dregs of the gig economy, shuttling food for Instacart or driving for Lyft. They want to be a part of something bigger—something with purpose. This idea of empowerment by entrepreneurism is baked into Stella & Dot’s mission statement, coined by Herrin and printed on everything from the website to the office wall: “To give every woman the means to style her own life.” To many of Stella & Dot’s stylists, Herrin has taken on the role of a cult figure — the endlessly stylish, unflappably inspiring CEO who understands the desire to lean kinda-sorta in. So for those top sellers who earned trips to Costa Rica, it was access to Herrin, not the tropical paradise, that was the real prize. She zip-lined with the “Style Council Elite,” the troop of power sellers who earn as much as $20,000 per month in commissions, and she led a toast to the sales reps by the pool. When the dinner finished with a dance party, there was Herrin on the dance floor. She has reason to celebrate. Herrin has managed to take the old, tarnished model of direct sales, long known for luring participants with empty promises of wealth, and recasting it as “social selling,” a lucrative, almost glamorous byproduct of the social media age. Stella & Dot’s headquarters sit in a vast, drab office park in San Francisco’s South Bay, right off of a Brisbane highway. Inside, however, it’s highly ’grammable, from the white fuzzy benches that line the conference room and the gold-rimmed marble coasters, to a large brass light fixture jutting out in abstract lines over the table. “Hello Gorgeous”—a company slogan that’s also printed inside many of their jewelry boxes—greets visitors from scripted neon lights that hang across from the elevator. We like you as you are, it seems to say. When I visited in late February, it was still an open construction site: Men with drills were installing what will soon be a showcase wall for products. The leadership team, however, was sequestered in the conference room, ignoring the racket, at a strategy meeting designing marketing for Stella & Dot’s spring line. Including Herrin, 11 women sat on brass-and-black-leather chairs around the table, each one wearing slim jeans, silky tops, and decorous statement jewelry. (A single man, also wearing jeans, spent the meeting quietly typing — projecting sales into a spreadsheet while the women spoke.) Herrin, who paired her denim with a washed out tee and long cardigan, was quick to crack jokes about her appearance. Most days she rises at 5 am to complete the daily runs that keep her lean and energized. But today, with one child home sick with strep throat, she hadn’t had time to shower. Tired looks different on Herrin, who for the most part stood during the three-hour-plus meeting, pacing the room to write on a whiteboard or crouching close to an employee to make a point. Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com Frequently, she addressed the room Socratic-style, using open-ended questions to guide the group towards an obvious answer. At stake: how to roll out a promo of hostess points, the rewards used to offer free jewelry to the party planners, who provide the space and audience for trunk shows — essentially, expanding the stylists’ sales network. She paused. “The other thing we need to remember,” Herrin asked the room, “is what’s the number one reason people host?” “Deals?” someone tentatively suggested. Herrin wrinkled her nose. “Style, fun, social,” another offered. “Bingo. It’s about style and connection rather than deals,” she explained. “They don’t wanna feel like they’re making rewards off of their friends.” Except, of course, that’s what Stella & Dot’s stylists do: They sell to the branches of friends and acquaintances and neighbors in their network. These networks have grown exponentially larger thanks to the internet, which allows them to target people outside of their home towns. That’s part of why a modern wave of direct sales companies is thriving, from LuLaRoe (trademark leggings and clothes), to Scentsy (candles), to Rodin and Fields (skin care). According to the Direct Selling Association, the number of participants in direct sales businesses jumped by just under 30 percent between 2012 and 2015 — with almost 20 million people participating in a direct sales company. Jessica Herrin. (Courtesy of Stella & Dot) Still, this modern cohort has to work to shed the poor reputation of its predecessors. Herbalife, an infamous direct sales supplement company, is currently settling a lawsuit with over 300,000 people who lost money attempting to run a business. To hear the lasting damages of Mary Kay, you can just saunter over to the Pink Truth message board, where ex-reps share their warnings about working with the company. Survivors of wayward direct sales businesses have similar complaints: It takes a large buy-in to gather supplies to start selling. Because anyone is allowed to start a branch, often the market is oversaturated. The only way to make money, critics say, is to sign on new participants and take a cut of their sales. And unlike traditional retail jobs, if sales go south, you don’t make money. Several times during my visit, Herrin shrugged off my label of direct sales. “I have never thought of us as direct sales. I think of us as innovative social selling,” she said. “We’re driving acquisition through social media. We just use the networks of our sellers.” To shake off those unwanted associations, the company pours effort into setting the right tone with its stylists — like you’re just attending a party of a fun, girly friend, not absorbing a hard-line sales pitch. The answer, for the most part, is making selling jewelry feel like it’s about more than just jewelry. It’s also why Herrin, with absolutely no irony, said to me at one point: “We are a movement, we are a movement of people who believe that there should be this community that lifts women up.” At the end of the meeting, Herrin asked the staff to evaluate their message. Most everyone thought there was something missing. It needed more “empowerment sharing” and “mission messages.” The line copy needed to “feel emotional.” “I’m still missing some sparkle,” someone suggested. How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com After the meeting, Herrin decamped to her office to put on makeup and change her clothes before filming “The Buzz,” a weekly Facebook video going over new products and techniques that airs to their sales field. She dragged a hairbrush through her hair, which immediately began to resemble a fresh blowout. She changed from the sweater into a sleek suede jacket. Stella & Dot products, she told me, should be versatile. “Our motto is that every woman, she puts it on, it fits, it flatters.” So, you can wear the Starburst Ear Jacket ($49) four ways: with a pearl stud, with a clear crystal stud, or either of the studs alone. The strands of most statement necklaces unclasp to create individual delicate strands. The Getaway bag expands to fit extra luggage and contracts to squeeze into the stowaway compartment of a plane. In that way, Herrin explained, Stella & Dot’s accessories are an easier lift than fashion or makeup — they come in to elevate a look, not make or break it. To promo the Facebook video, she shot an Instagram post, highlighting a delicate bracelet embroidered in India. A colleague posed Herrin’s hand draped just-so over her knee. She snapped 15 photos with her iPhone and handed it over, but Herrin thought they looked weird. Herrin fanned her hand to a more natural position. They took another few dozen pictures until they got a winning shot. The first thing you should know about Herrin is she takes after her father. Early on in Find Your Extraordinary, a biography-slash-motivational book that Herrin published in 2016, she mentions her dad, a perennial optimist with an entrepreneur’s spirit, who raised her with minimal coddling but a whole lot of support. The next thing she wants to tell you is about her mother, who was bipolar and unhappy. She left Herrin when she was young. “She didn’t feel like she had options,” Herrin told me, sitting in her office. Early on Herrin decided: her life would be different. “I was always going to be able to make my own choices. Work when I wanted to work. Support myself.” The other thing Herrin wants you to know is life doesn’t come as easy as it looks on her resume. She didn’t just saunter into Stanford for her undergrad: She waitressed while attending a community college and transferred. Her first business, the Wedding Channel, which she launched by dropping out of Stanford business school, only came together after hard work and chutzpah-infused strategy. Though she’d never been particularly interested in retail, while working at the Wedding Channel she’d put herself through a study of department stores. “Traditional distribution models have a lot of overhead,” she told me. “On that food chain, not everyone is happy.” Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com Herrin’s ah-ha moment happened during a business trip to Dallas, where she was negotiating a deal with Neiman Marcus. The hotel she was staying in was hosting a conference for Mary Kay, the direct sales cosmetics company founded in the ’60s. On the way to her room, she happened to share an elevator with a cluster of top sellers, dressed in the signature Pepto Bismol pink, bursting with pride from the awards ceremony. “In that moment, in that elevator,” she writes in her book, “I could feel that the company was about so much more than makeup; it had been an on-ramp into the workforce for these women.” Before the elevator run-in, Herrin told me in her office, her connection to women’s work had been accidental. She’d launched the Wedding Channel not because of the connection to the bridal industry, but because she saw an opening for a price aggregator. But the Mary Kay model made sense to Herrin. “It spoke so much to what, in my own childhood, had gone wrong for the women that were or were not in my life,” she told me. “If I could be part of the next chapter of flexible work for women, then it would really be about being in the people business and the happiness business.” Shortly after, she left her job at the Wedding Channel to move with her husband to Texas. She wanted to have kids, so they prioritized his career for a stretch. She took a middle management job at Dell. But the reprieve didn’t last very long. Soon she was attending beading conventions and making jewelry at night with an eye toward rebranding the Mary Kay model. Herrin, right, and her cofounder Blythe Harris, left. (Courtesy of Stella & Dot) As she researched the direct sales industry, she found the dominant sales techniques alienating. “[It was] very male, very persistent,” she told me, “and not in a way that I thought you were going to get a lot of women confident in selling.” Women, Herrin believes, are natural sellers, but they sell using subtler techniques, through recommendations. I just used a new eyeliner that didn’t crease. The restaurant we ate at had the best sushi. I just saw this new movie and boy, was it a tear jerker. Herrin launched her idea as if starring in a parody video of a thinly resourced Silicon Valley startup. She made the jewelry. She built the website. She went door to door selling it. “I wanted to believe in the experience enough to be my own venture capitalist and back it with my blood, sweat, tears, and savings,” she told me. “I just asked people who they knew and asked those people who they knew, and one turned into two turned into three turned into 50,000.” The business solidified in 2007, when she met her cofounder Blythe Harris, a jewelry designer for Banana Republic, at a Stanford alumni event. Together, the pair rebranded the company under the Stella & Dot name — each name drawn from their grandmothers. Soon celebrities were wearing the line, and it was gracing editorials in magazines like O and Cosmopolitan. Yet the real buzz was generated by the labyrinth of women bringing the jewelry into their friends’ homes to sell it. That is how, on a recent Sunday afternoon, I found myself in Jessica Sigler’s bright midtown Manhattan apartment, with views stretching south and west. A group of women, mostly in their 30s, mingled over a spread of bite-sized banana bread, teensy mini-blueberry muffins, and three-bite frittatas, which Sigler’s husband had prepared the night before. Sigler joined Stella & Dot after working as a tax accountant in D.C. Unhappy with her job and looking for a change, she quit and followed her then-boyfriend to Charlottesville, Virginia, where he was attending business school. There, she was unemployed and looking for something to occupy her time. An acquaintance suggested Stella & Dot. “It wasn’t a bunch of uneducated, ‘I have nothing else to do, I’m a stay at home mom,’” she told me. “I mean that in the nicest way, but these were very well-educated, professional women that chose to do this.” Five years later, Sigler is still working for Stella & Dot, where 25 hours a week nets her five to seven thousand a month. That’s in addition to the time spent babysitting and tutoring for an Upper East Side parent—“to get into the mommy demographic,” she says. Wearing a grey sweater, artfully distressed denim, and a shocking pair of glittery ear cuffs, Sigler looks like a Pinterest photo of off-duty chic—exactly the sort of person you would trust to create your look. And her friends do. One of the women shows her a photo of a recent purchase, a Rag and Bone jumpsuit, looking for styling tips. Sigler suggests a pair of deep navy tassel earrings. Or, perhaps a set of gold ear cuffs. “They’re $49, but you can wear them two ways,” she chortles, “so it’s worth it.” Sigler has found that the best marketer of the lines is her own body — which just happens to be petite and blond. She doesn’t sell to drunk people, but when she goes to bars, she brings along pamphlets with her stylist page for when people ask after her earrings. She’s sold one particularly cute cut-out tote bag to the passenger sitting next to her on a plane. “I mean, the sale is meant to happen, but it’s going to happen organically,” she says. “It’s not going to happen because I force a piece on you.” It’s true: At her trunk show, everyone ends up buying something, with most purchasing in excess of $200. Sigler does give good advice. At one point, I ask what she would suggest for…say, a 31-year-old writer who works in a mostly male industry looking to feel more powerful in her wardrobe. Just in theory. The usual answer—the answer I’ve come to expect from copious fashion magazines—is a statement necklace. Siegler swerves: She suggests an earring. “If everyone’s championing a necklace then you do a chunky earring,” she tells me. “I think that would make you feel a little bit less uniformly and a little bit different.” True. At one point, she confides in me that styling makes her feel good about herself. “It makes you feel special, and like you’re actually doing something and you’re…I don’t want to think like changing lives, but, you know. You’re helping women feel better.” Herrin believes she’s the architect of a company that works according to her values: The harder you work, the larger your paycheck. It’s the opposite of how work life manifests for most women, who find that the higher they climb up the totem pole, the larger the gap in pay. Work hard at Stella & Dot, however, and you get a free trip to Costa Rica, Herrin says. “You get recognition. You get to walk across a stage.” She articulated her philosophy at length in Find Your Extraordinary. It debuted at number two on the Wall Street Journal bestsellers list, and has garnered close to perfect reader reviews on Amazon and Goodreads, largely from women who are inspired by Herrin’s message of agency. While other lady tech icons advise strategic maneuvering around the boys club, Herrin advises a more can-do approach. Her advice on sexism: “You don’t have to let the world zap you of your confidence or positivity. I like to assume the world is awaiting my success — and you should too.” Herrin knows exactly how to turn that sensibility into corporate strategy. A few days after Stephanie Swobody, a newly recruited stylist, achieved the Star ranking just one month into her stint with Stella & Dot, she found a Facebook message from Herrin in her inbox: Welcome to Stella & Dot and WOW just WOW on your rocket ship to Star. Way to go, You are a total badass and I can’t wait to see what you do next! It’s YOUR company- wouldn’t be without you, and I hope it serves you in a way that goes beyond your expectations. 37 days to star- that is AH MAH ZING! I can’t wait to meet you in person! Swobody was awestruck. Not only was she being recognized, but she was being called out directly by the CEO. “I’ve never held a job where if you work hard you truly get paid more for it,” she told me. Other stylists told me that the work philosophy is what makes selling so pleasant. Nichole Di Modica, a stylist who used to run global operations for Mary Kate and Ashley Olson, says that even at her corporate job, “never have I felt so much joy in my work.” Another stylist, Tina Gibbons, told me she kept coming back to direct sales, even as several of the companies she sold for folded. She missed the female companionship when she wasn’t selling. To get to a conference, for example, “we packed seven people in an SUV and drove to Minnesota together, and by the end of a six- or seven-hour drive, we knew everyone’s life stories.” Her group shared a hotel room, packing air mattresses across the floor. “Here you’re a 30- or 40-year-old woman, and you’re doing things you did when you were in your 20s,” she said. A part of me is filled with longing at the idea of Gibbons’ girl gang at their middle-aged sleepover. It seems like a vision of a utopian workplace, one that is built for women, that bends to fit their personalities and needs. The reality is, most of these women will never start their own business, but climbing the ranks of a pre-made company allows them to breathe in some of the sparkle-dust fumes of Herrin’s enterprise. It may not be everything I’d wish for them—I want them to climb to the top of a company through their intellect rather than their ability to recruit; I want them to find flexible work that pays for sick days and slow sales months. It’s not perfect. But to the women who believe in Herrin, it’s everything. Or, at the very least, it will do. About 10 minutes after we got off the phone, Gibbons followed up with an email. “I would love to set you up as an online S&D hostess! Better yet, if you are looking for a killer opportunity, I’m your gal! It’s the best side job you will ever have and I’m pretty fun to work with, if do say so myself!! 😉” An earlier version of this story stated that Peter Thiel graduated from Stanford in 1994. He received a JD from Stanford in 1992. More from Outsiders Week: Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com ", "title": "Inside the Startup Luring Thousands of Women into the Gig Economy", "sentences": [{"7fb8": "Inside the Startup Luring Thousands of Women into the Gig Economy"}, {"dc44": "Stella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”"}, {"b69b": "The staff at the hotel began setting up the party early, lining up the tables along the beach. Strands of lights twinkled overhead, though the women arrived for the fete before sundown, toting husbands, boyfriends, and partners—witnesses to their entrepreneurial success."}, {"bbf8": "It was early March and warm in Costa Rica, the perfect weather for the final dinner of Stella & Dot’s “Glam Getaway trip”—a reward for some 400 of the jewelry and accessories company’s top sellers, called “stylists” in company lingo. These stylists sell the company’s ear cuffs and statement necklaces independently, either through their personal networks on Instagram and Facebook or at trunk shows, hosted at the homes of friends and acquaintances. These women (and they’re almost all women) are powering a digital age reinvention of direct sales companies like Avon and Mary Kay, minus the slog of selling door to door."}, {"6f77": "Follow Backchannel: Facebook | Twitter"}, {"cae6": "In the 14 years since Jessica Herrin began making jewelry on her living room floor, Stella & Dot has grown into a global operation with 400 full-time employees, routinely grossing $300 million in annual sales. The main brand, focused on accessories, has over 30,000 stylists; its offshoot brands—KEEP Collective, which sells charms, and EVER, which sells organic skincare—add another 20,000 independent sellers."}, {"ffaa": "The company is enough of an innovator that Sequoia Capital courted Herrin to invest $37 million in 2011, valuing the company at $370 million. “Jessica never needed to raise money,” says Alfred Lin, the Sequoia partner who led the investment. “The investors have always knocked on her door, like, ‘How do we invest in this company.’”"}, {"5676": "Herrin is in many ways an investor’s dream: a dot com veteran with tech bonafides, including stints at Dell and Trilogy and a prior successful startup. She is the rare female founder among a high-powered cohort that all graduated from Stanford in early ‘90s,* including men like Peter Thiel (who received his JD in 1992) and early PayPal COO David Sacks, as the New York Times noted in a profile."}, {"1985": "Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com"}, {"4b2d": "Asked about her success, Herrin told the Times, “I’ve never tried to sit at the boys’ table.” That may, in fact, be her secret. In a world of Airbnbs and Snapchats and Dollar Shave Clubs, Stella & Dot is the kind of successful tech startup that tends to get overlooked. It’s women-led and women-focused, and therefore half invisible to the techies of Silicon Valley."}, {"c821": "Yet Herrin has managed to tap into a brutally underserved market: the tens of thousands of women around the country who are fueled by an unfulfilled entrepreneurial zeal and are in need of part-time work. They don’t have the time or energy to start their own companies, nor do they want to rough it in the dregs of the gig economy, shuttling food for Instacart or driving for Lyft. They want to be a part of something bigger—something with purpose. This idea of empowerment by entrepreneurism is baked into Stella & Dot’s mission statement, coined by Herrin and printed on everything from the website to the office wall: “To give every woman the means to style her own life.”"}, {"70b4": "To many of Stella & Dot’s stylists, Herrin has taken on the role of a cult figure — the endlessly stylish, unflappably inspiring CEO who understands the desire to lean kinda-sorta in. So for those top sellers who earned trips to Costa Rica, it was access to Herrin, not the tropical paradise, that was the real prize. She zip-lined with the “Style Council Elite,” the troop of power sellers who earn as much as $20,000 per month in commissions, and she led a toast to the sales reps by the pool. When the dinner finished with a dance party, there was Herrin on the dance floor."}, {"40d1": "She has reason to celebrate. Herrin has managed to take the old, tarnished model of direct sales, long known for luring participants with empty promises of wealth, and recasting it as “social selling,” a lucrative, almost glamorous byproduct of the social media age."}, {"cff9": "Stella & Dot’s headquarters sit in a vast, drab office park in San Francisco’s South Bay, right off of a Brisbane highway. Inside, however, it’s highly ’grammable, from the white fuzzy benches that line the conference room and the gold-rimmed marble coasters, to a large brass light fixture jutting out in abstract lines over the table. “Hello Gorgeous”—a company slogan that’s also printed inside many of their jewelry boxes—greets visitors from scripted neon lights that hang across from the elevator. We like you as you are, it seems to say."}, {"07e9": "When I visited in late February, it was still an open construction site: Men with drills were installing what will soon be a showcase wall for products. The leadership team, however, was sequestered in the conference room, ignoring the racket, at a strategy meeting designing marketing for Stella & Dot’s spring line. Including Herrin, 11 women sat on brass-and-black-leather chairs around the table, each one wearing slim jeans, silky tops, and decorous statement jewelry. (A single man, also wearing jeans, spent the meeting quietly typing — projecting sales into a spreadsheet while the women spoke.)"}, {"15d9": "Herrin, who paired her denim with a washed out tee and long cardigan, was quick to crack jokes about her appearance. Most days she rises at 5 am to complete the daily runs that keep her lean and energized. But today, with one child home sick with strep throat, she hadn’t had time to shower. Tired looks different on Herrin, who for the most part stood during the three-hour-plus meeting, pacing the room to write on a whiteboard or crouching close to an employee to make a point."}, {"2bb7": "Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com"}, {"7e2f": "Frequently, she addressed the room Socratic-style, using open-ended questions to guide the group towards an obvious answer. At stake: how to roll out a promo of hostess points, the rewards used to offer free jewelry to the party planners, who provide the space and audience for trunk shows — essentially, expanding the stylists’ sales network. She paused."}, {"f6ea": "“The other thing we need to remember,” Herrin asked the room, “is what’s the number one reason people host?”"}, {"8835": "“Deals?” someone tentatively suggested. Herrin wrinkled her nose."}, {"6459": "“Style, fun, social,” another offered."}, {"396b": "“Bingo. It’s about style and connection rather than deals,” she explained. “They don’t wanna feel like they’re making rewards off of their friends.”"}, {"1f8a": "Except, of course, that’s what Stella & Dot’s stylists do: They sell to the branches of friends and acquaintances and neighbors in their network. These networks have grown exponentially larger thanks to the internet, which allows them to target people outside of their home towns. That’s part of why a modern wave of direct sales companies is thriving, from LuLaRoe (trademark leggings and clothes), to Scentsy (candles), to Rodin and Fields (skin care). According to the Direct Selling Association, the number of participants in direct sales businesses jumped by just under 30 percent between 2012 and 2015 — with almost 20 million people participating in a direct sales company."}, {"2acc": "Jessica Herrin. (Courtesy of Stella & Dot)"}, {"57e4": "Still, this modern cohort has to work to shed the poor reputation of its predecessors. Herbalife, an infamous direct sales supplement company, is currently settling a lawsuit with over 300,000 people who lost money attempting to run a business. To hear the lasting damages of Mary Kay, you can just saunter over to the Pink Truth message board, where ex-reps share their warnings about working with the company."}, {"3259": "Survivors of wayward direct sales businesses have similar complaints: It takes a large buy-in to gather supplies to start selling. Because anyone is allowed to start a branch, often the market is oversaturated. The only way to make money, critics say, is to sign on new participants and take a cut of their sales. And unlike traditional retail jobs, if sales go south, you don’t make money."}, {"c99c": "Several times during my visit, Herrin shrugged off my label of direct sales. “I have never thought of us as direct sales. I think of us as innovative social selling,” she said. “We’re driving acquisition through social media. We just use the networks of our sellers.” To shake off those unwanted associations, the company pours effort into setting the right tone with its stylists — like you’re just attending a party of a fun, girly friend, not absorbing a hard-line sales pitch. The answer, for the most part, is making selling jewelry feel like it’s about more than just jewelry. It’s also why Herrin, with absolutely no irony, said to me at one point: “We are a movement, we are a movement of people who believe that there should be this community that lifts women up.”"}, {"1a3e": "At the end of the meeting, Herrin asked the staff to evaluate their message. Most everyone thought there was something missing. It needed more “empowerment sharing” and “mission messages.” The line copy needed to “feel emotional.” “I’m still missing some sparkle,” someone suggested."}, {"bb5f": "How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com"}, {"cf54": "After the meeting, Herrin decamped to her office to put on makeup and change her clothes before filming “The Buzz,” a weekly Facebook video going over new products and techniques that airs to their sales field. She dragged a hairbrush through her hair, which immediately began to resemble a fresh blowout. She changed from the sweater into a sleek suede jacket."}, {"2475": "Stella & Dot products, she told me, should be versatile. “Our motto is that every woman, she puts it on, it fits, it flatters.” So, you can wear the Starburst Ear Jacket ($49) four ways: with a pearl stud, with a clear crystal stud, or either of the studs alone. The strands of most statement necklaces unclasp to create individual delicate strands. The Getaway bag expands to fit extra luggage and contracts to squeeze into the stowaway compartment of a plane."}, {"0636": "In that way, Herrin explained, Stella & Dot’s accessories are an easier lift than fashion or makeup — they come in to elevate a look, not make or break it. To promo the Facebook video, she shot an Instagram post, highlighting a delicate bracelet embroidered in India. A colleague posed Herrin’s hand draped just-so over her knee. She snapped 15 photos with her iPhone and handed it over, but Herrin thought they looked weird."}, {"c223": "Herrin fanned her hand to a more natural position. They took another few dozen pictures until they got a winning shot."}, {"52fd": "The first thing you should know about Herrin is she takes after her father. Early on in Find Your Extraordinary, a biography-slash-motivational book that Herrin published in 2016, she mentions her dad, a perennial optimist with an entrepreneur’s spirit, who raised her with minimal coddling but a whole lot of support. The next thing she wants to tell you is about her mother, who was bipolar and unhappy. She left Herrin when she was young. “She didn’t feel like she had options,” Herrin told me, sitting in her office. Early on Herrin decided: her life would be different. “I was always going to be able to make my own choices. Work when I wanted to work. Support myself.”"}, {"0b64": "The other thing Herrin wants you to know is life doesn’t come as easy as it looks on her resume. She didn’t just saunter into Stanford for her undergrad: She waitressed while attending a community college and transferred. Her first business, the Wedding Channel, which she launched by dropping out of Stanford business school, only came together after hard work and chutzpah-infused strategy."}, {"4662": "Though she’d never been particularly interested in retail, while working at the Wedding Channel she’d put herself through a study of department stores. “Traditional distribution models have a lot of overhead,” she told me. “On that food chain, not everyone is happy.”"}, {"4c21": "Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com"}, {"5164": "Herrin’s ah-ha moment happened during a business trip to Dallas, where she was negotiating a deal with Neiman Marcus. The hotel she was staying in was hosting a conference for Mary Kay, the direct sales cosmetics company founded in the ’60s. On the way to her room, she happened to share an elevator with a cluster of top sellers, dressed in the signature Pepto Bismol pink, bursting with pride from the awards ceremony."}, {"a35a": "“In that moment, in that elevator,” she writes in her book, “I could feel that the company was about so much more than makeup; it had been an on-ramp into the workforce for these women.”"}, {"23b9": "Before the elevator run-in, Herrin told me in her office, her connection to women’s work had been accidental. She’d launched the Wedding Channel not because of the connection to the bridal industry, but because she saw an opening for a price aggregator. But the Mary Kay model made sense to Herrin. “It spoke so much to what, in my own childhood, had gone wrong for the women that were or were not in my life,” she told me. “If I could be part of the next chapter of flexible work for women, then it would really be about being in the people business and the happiness business.”"}, {"2fa0": "Shortly after, she left her job at the Wedding Channel to move with her husband to Texas. She wanted to have kids, so they prioritized his career for a stretch. She took a middle management job at Dell. But the reprieve didn’t last very long. Soon she was attending beading conventions and making jewelry at night with an eye toward rebranding the Mary Kay model."}, {"6338": "Herrin, right, and her cofounder Blythe Harris, left. (Courtesy of Stella & Dot)"}, {"0aa0": "As she researched the direct sales industry, she found the dominant sales techniques alienating. “[It was] very male, very persistent,” she told me, “and not in a way that I thought you were going to get a lot of women confident in selling.” Women, Herrin believes, are natural sellers, but they sell using subtler techniques, through recommendations. I just used a new eyeliner that didn’t crease. The restaurant we ate at had the best sushi. I just saw this new movie and boy, was it a tear jerker."}, {"15a0": "Herrin launched her idea as if starring in a parody video of a thinly resourced Silicon Valley startup. She made the jewelry. She built the website. She went door to door selling it. “I wanted to believe in the experience enough to be my own venture capitalist and back it with my blood, sweat, tears, and savings,” she told me. “I just asked people who they knew and asked those people who they knew, and one turned into two turned into three turned into 50,000.”"}, {"2669": "The business solidified in 2007, when she met her cofounder Blythe Harris, a jewelry designer for Banana Republic, at a Stanford alumni event. Together, the pair rebranded the company under the Stella & Dot name — each name drawn from their grandmothers. Soon celebrities were wearing the line, and it was gracing editorials in magazines like O and Cosmopolitan. Yet the real buzz was generated by the labyrinth of women bringing the jewelry into their friends’ homes to sell it."}, {"24f4": "That is how, on a recent Sunday afternoon, I found myself in Jessica Sigler’s bright midtown Manhattan apartment, with views stretching south and west. A group of women, mostly in their 30s, mingled over a spread of bite-sized banana bread, teensy mini-blueberry muffins, and three-bite frittatas, which Sigler’s husband had prepared the night before."}, {"6216": "Sigler joined Stella & Dot after working as a tax accountant in D.C. Unhappy with her job and looking for a change, she quit and followed her then-boyfriend to Charlottesville, Virginia, where he was attending business school. There, she was unemployed and looking for something to occupy her time. An acquaintance suggested Stella & Dot. “It wasn’t a bunch of uneducated, ‘I have nothing else to do, I’m a stay at home mom,’” she told me. “I mean that in the nicest way, but these were very well-educated, professional women that chose to do this.”"}, {"fb50": "Five years later, Sigler is still working for Stella & Dot, where 25 hours a week nets her five to seven thousand a month. That’s in addition to the time spent babysitting and tutoring for an Upper East Side parent—“to get into the mommy demographic,” she says."}, {"a220": "Wearing a grey sweater, artfully distressed denim, and a shocking pair of glittery ear cuffs, Sigler looks like a Pinterest photo of off-duty chic—exactly the sort of person you would trust to create your look. And her friends do. One of the women shows her a photo of a recent purchase, a Rag and Bone jumpsuit, looking for styling tips. Sigler suggests a pair of deep navy tassel earrings. Or, perhaps a set of gold ear cuffs."}, {"d307": "“They’re $49, but you can wear them two ways,” she chortles, “so it’s worth it.”"}, {"ea8f": "Sigler has found that the best marketer of the lines is her own body — which just happens to be petite and blond. She doesn’t sell to drunk people, but when she goes to bars, she brings along pamphlets with her stylist page for when people ask after her earrings. She’s sold one particularly cute cut-out tote bag to the passenger sitting next to her on a plane. “I mean, the sale is meant to happen, but it’s going to happen organically,” she says. “It’s not going to happen because I force a piece on you.” It’s true: At her trunk show, everyone ends up buying something, with most purchasing in excess of $200."}, {"b448": "Sigler does give good advice. At one point, I ask what she would suggest for…say, a 31-year-old writer who works in a mostly male industry looking to feel more powerful in her wardrobe. Just in theory."}, {"fe7c": "The usual answer—the answer I’ve come to expect from copious fashion magazines—is a statement necklace. Siegler swerves: She suggests an earring. “If everyone’s championing a necklace then you do a chunky earring,” she tells me. “I think that would make you feel a little bit less uniformly and a little bit different.” True."}, {"0cb8": "At one point, she confides in me that styling makes her feel good about herself. “It makes you feel special, and like you’re actually doing something and you’re…I don’t want to think like changing lives, but, you know. You’re helping women feel better.”"}, {"104d": "Herrin believes she’s the architect of a company that works according to her values: The harder you work, the larger your paycheck. It’s the opposite of how work life manifests for most women, who find that the higher they climb up the totem pole, the larger the gap in pay. Work hard at Stella & Dot, however, and you get a free trip to Costa Rica, Herrin says. “You get recognition. You get to walk across a stage.”"}, {"17c1": "She articulated her philosophy at length in Find Your Extraordinary. It debuted at number two on the Wall Street Journal bestsellers list, and has garnered close to perfect reader reviews on Amazon and Goodreads, largely from women who are inspired by Herrin’s message of agency. While other lady tech icons advise strategic maneuvering around the boys club, Herrin advises a more can-do approach. Her advice on sexism: “You don’t have to let the world zap you of your confidence or positivity. I like to assume the world is awaiting my success — and you should too.”"}, {"262b": "Herrin knows exactly how to turn that sensibility into corporate strategy. A few days after Stephanie Swobody, a newly recruited stylist, achieved the Star ranking just one month into her stint with Stella & Dot, she found a Facebook message from Herrin in her inbox:"}, {"c7ee": "Welcome to Stella & Dot and WOW just WOW on your rocket ship to Star. Way to go, You are a total badass and I can’t wait to see what you do next!"}, {"ade2": "It’s YOUR company- wouldn’t be without you, and I hope it serves you in a way that goes beyond your expectations. 37 days to star- that is AH MAH ZING! I can’t wait to meet you in person!"}, {"10cf": "Swobody was awestruck. Not only was she being recognized, but she was being called out directly by the CEO. “I’ve never held a job where if you work hard you truly get paid more for it,” she told me. Other stylists told me that the work philosophy is what makes selling so pleasant. Nichole Di Modica, a stylist who used to run global operations for Mary Kate and Ashley Olson, says that even at her corporate job, “never have I felt so much joy in my work.”"}, {"e724": "Another stylist, Tina Gibbons, told me she kept coming back to direct sales, even as several of the companies she sold for folded. She missed the female companionship when she wasn’t selling. To get to a conference, for example, “we packed seven people in an SUV and drove to Minnesota together, and by the end of a six- or seven-hour drive, we knew everyone’s life stories.” Her group shared a hotel room, packing air mattresses across the floor."}, {"3c56": "“Here you’re a 30- or 40-year-old woman, and you’re doing things you did when you were in your 20s,” she said."}, {"68d4": "A part of me is filled with longing at the idea of Gibbons’ girl gang at their middle-aged sleepover. It seems like a vision of a utopian workplace, one that is built for women, that bends to fit their personalities and needs. The reality is, most of these women will never start their own business, but climbing the ranks of a pre-made company allows them to breathe in some of the sparkle-dust fumes of Herrin’s enterprise. It may not be everything I’d wish for them—I want them to climb to the top of a company through their intellect rather than their ability to recruit; I want them to find flexible work that pays for sick days and slow sales months. It’s not perfect. But to the women who believe in Herrin, it’s everything. Or, at the very least, it will do."}, {"f77f": "About 10 minutes after we got off the phone, Gibbons followed up with an email."}, {"d33d": "“I would love to set you up as an online S&D hostess! Better yet, if you are looking for a killer opportunity, I’m your gal! It’s the best side job you will ever have and I’m pretty fun to work with, if do say so myself!! 😉”"}, {"c371": "An earlier version of this story stated that Peter Thiel graduated from Stanford in 1994. He received a JD from Stanford in 1992."}, {"6ecf": "More from Outsiders Week:"}, {"9471": "Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com"}, {"78ff": "Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com"}, {"3f5c": "How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com"}, {"6c0c": "Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com"}], "child": "429_1\t429_2\t429_3\t429_4"}