{"name": "430", "parent": "", "content": "Special Issue: Outsiders The products and services that Silicon Valley technologists create often work really well for people exactly like them. These are the stories about everyone else. Illustration by Laurent Hrybyk Five years ago this month, Pinterest sprung out of nowhere — a massively popular digital pinboarding service that saw its users grow 50 percent in one month. As I wrote for Fortune back then, it was the fastest growing web site of all time! But Silicon Valley nearly missed it. Most venture capitalists had passed on the opportunity to invest. I called up Marc Andreessen, whose firm had recently led a $27 million round in the company, and he told me he had been ready to pass on the deal when a female researcher urged him to reconsider. “It’s such a hit among women,” Andreessen said at the time, “and our industry, historically, we don’t exactly have the most women.” You’d think Silicon Valley’s investors and engineers would have learned. But here we are, five years later, continuing to create and fund technology that mostly serves a narrow cohort of people who mostly look the same. As loyal Backchannel readers know, this concern drives much of our coverage. We believe the best way to make technology more inclusive is to expand the group of people who are tasked with creating it. With this week’s special issue, we aim to offer a fresh perspective on how technology brings people together, and how it highlights our differences. To kick us off, journalist Sonia Paul brings us the story of her mother’s attempt to fall in love with the Amazon Echo. A Filipina immigrant for whom English was a third language, her mom had little faith in Alexa’s ability to understand her. She’d tried Siri to no good end. If, as ComScore predicts, half of our searches will be conducted through voice technology within three years, Sonia’s mom is about to lose out. Because when she asked Alexa to play “Que sera sera,” the technology said it was unable to find “Kiss your ass era.” Sonia explains how we got here…and how things will get better. Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com Leonor Cabigon met her first husband in a predictable manner: She was a young and beautiful Filipina; he was an older, wealthy Westerner. When the marriage ended 15 years later, she decided to flip the script. Thanks to an array of technologies, Cabigon thought she could level the playing field while looking for love online. Journalist Meredith Talusan details the great promise and extreme complications of new technologies for some of the world’s most marginalized women. How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com Next up, Backchannel editor Alexis Sobel Fitts profiles Jessica Herrin, the wickedly smart entrepreneur who has grown Stella & Dot into an online direct sales business massively popular among young professional women across the country. She dives into the question of why, in this era of expanded opportunities, a wide swath of women sign on to become a contemporary version of the Avon lady — with an Instagram account. Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com Why isn’t there an Apple of Indonesia, or a Facebook of Mexico? Google believes it’s a chicken-and-egg problem, according to Backchannel’s executive editor, Sandra Upson. Every country needs a few big success stories to seed the ecosystems that allow fledgling companies to thrive. Without them, startups face an almost impossible uphill slog. Google has an ambitious plan to fix that. What does the search giant get in exchange? Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com And for our weekly Follow-Up Friday, Alexis Sobel Fitts checks in on Adria Richards. A female developer, Richards was fired after she tweeted about men she said were making sexual comments at a computer programming conference. It was the first big, public incident that demonstrated the failure of our systems for addressing harassment. Four years later, Backchannel looks back. Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com Taken together, these pieces offer a window into how people for whom the web was not initially designed find ways to use it to their advantage — or grapple with ways in which it doesn’t serve them. Some people will read this collection of tales and see only the stories of outsiders. Others, however, will see what we see: opportunity. ", "title": "Special Issue: Outsiders", "sentences": [{"c1b6": "Special Issue: Outsiders"}, {"e42e": "The products and services that Silicon Valley technologists create often work really well for people exactly like them. These are the stories about everyone else."}, {"35ea": "Illustration by Laurent Hrybyk"}, {"45a6": "Five years ago this month, Pinterest sprung out of nowhere — a massively popular digital pinboarding service that saw its users grow 50 percent in one month. As I wrote for Fortune back then, it was the fastest growing web site of all time! But Silicon Valley nearly missed it. Most venture capitalists had passed on the opportunity to invest. I called up Marc Andreessen, whose firm had recently led a $27 million round in the company, and he told me he had been ready to pass on the deal when a female researcher urged him to reconsider. “It’s such a hit among women,” Andreessen said at the time, “and our industry, historically, we don’t exactly have the most women.”"}, {"062f": "You’d think Silicon Valley’s investors and engineers would have learned. But here we are, five years later, continuing to create and fund technology that mostly serves a narrow cohort of people who mostly look the same."}, {"2ecc": "As loyal Backchannel readers know, this concern drives much of our coverage. We believe the best way to make technology more inclusive is to expand the group of people who are tasked with creating it. With this week’s special issue, we aim to offer a fresh perspective on how technology brings people together, and how it highlights our differences."}, {"661f": "To kick us off, journalist Sonia Paul brings us the story of her mother’s attempt to fall in love with the Amazon Echo. A Filipina immigrant for whom English was a third language, her mom had little faith in Alexa’s ability to understand her. She’d tried Siri to no good end. If, as ComScore predicts, half of our searches will be conducted through voice technology within three years, Sonia’s mom is about to lose out. Because when she asked Alexa to play “Que sera sera,” the technology said it was unable to find “Kiss your ass era.” Sonia explains how we got here…and how things will get better."}, {"9e83": "Voice Is the Next Big Platform, Unless You Have an AccentIt’s super funny that Alexa can’t understand my mom — until we need Alexa to use the web, drive a car, and do pretty…backchannel.com"}, {"fd24": "Leonor Cabigon met her first husband in a predictable manner: She was a young and beautiful Filipina; he was an older, wealthy Westerner. When the marriage ended 15 years later, she decided to flip the script. Thanks to an array of technologies, Cabigon thought she could level the playing field while looking for love online. Journalist Meredith Talusan details the great promise and extreme complications of new technologies for some of the world’s most marginalized women."}, {"d06f": "How the Internet Gave Mail-Order Brides the PowerRural Filipinas have flipped the dating script: Now they’re the ones shopping for Western men.backchannel.com"}, {"a646": "Next up, Backchannel editor Alexis Sobel Fitts profiles Jessica Herrin, the wickedly smart entrepreneur who has grown Stella & Dot into an online direct sales business massively popular among young professional women across the country. She dives into the question of why, in this era of expanded opportunities, a wide swath of women sign on to become a contemporary version of the Avon lady — with an Instagram account."}, {"2b3a": "Inside the Jewelry Startup that Wants to Reinvent Women’s WorkStella & Dot says it empowers women by helping them sell jewelry to their friends — but don’t call it “direct sales.”backchannel.com"}, {"3873": "Why isn’t there an Apple of Indonesia, or a Facebook of Mexico? Google believes it’s a chicken-and-egg problem, according to Backchannel’s executive editor, Sandra Upson. Every country needs a few big success stories to seed the ecosystems that allow fledgling companies to thrive. Without them, startups face an almost impossible uphill slog. Google has an ambitious plan to fix that. What does the search giant get in exchange?"}, {"c983": "Google’s Plan to Engineer the Next Silicon ValleysThe tech giant is quietly grooming companies overseas in a strategic move to bring the next billion online.backchannel.com"}, {"5d87": "And for our weekly Follow-Up Friday, Alexis Sobel Fitts checks in on Adria Richards. A female developer, Richards was fired after she tweeted about men she said were making sexual comments at a computer programming conference. It was the first big, public incident that demonstrated the failure of our systems for addressing harassment. Four years later, Backchannel looks back."}, {"b135": "Tech’s Harassment Crisis Now Has an Arsenal of Smoking GunsFour years after #Donglegate, we’re finally ready to believe women.backchannel.com"}, {"23d5": "Taken together, these pieces offer a window into how people for whom the web was not initially designed find ways to use it to their advantage — or grapple with ways in which it doesn’t serve them. Some people will read this collection of tales and see only the stories of outsiders. Others, however, will see what we see: opportunity."}], "child": "430_1\t430_2\t430_3\t430_4\t430_5"}