{"name": "432", "parent": "", "content": "For the CIA, Every Day Is Zero Day Spy agencies are no better protected than the public. It’s no coincidence. (Wikimedia Commons) Hi Backchannel folks. Steven here. I’ve been following the swirl of fear, confusion, and finger-pointing after this week’s wanton Wikileaks dump of internal CIA documents that describe the agency’s prodigious hacking tools. Because the entire tranche arrived unfiltered, it took a while to figure out how scary it was that our spies had found lots of ways to compromise iPhones, Androids, and some of the very apps that take special pains to heighten protection. Some people shriek that it’s a security Armageddon; others say that because some of the tricks are already out-of-date, it isn’t scary at all. One thing we can be sure of is that releasing these documents, with all sorts of good suggestions for snoops and data thieves, hasn’t made us any safer. Ultimately, though, I’m going stuff this caper into a bulging file documenting our ongoing conflict between privacy and security. I found it kind of cute that many observers professed outrage that the CIA was devoting efforts to schemes to extract information from encrypted devices and software systems. Folks, can you spell spy agency? Sans freakouts, people watch TV shows and movies all the time where the resident geek in the Langley bullpen is asked to get ahold of some piece of protected information and, after a feverish assault on a keyboard and maybe a couple of thwarted tries that yield only an ACCESS DENIED on the screen, poof! There it is. Crypto cracked! Apparently these documents, purloined from the CIA vault by a whistleblower or traitor (pick one), are user’s manuals for the tools that enable such cryptanalytic pyrotechnics in real life. Though that stuff plays well in Hollywood (unless you’re Oliver Stone), there is a flip side to this: Every government attack on a potential terrorist’s cell means that someone else could be attacking all our devices the same way. We are long past the days where only governments and big institutions use encryption to protect their secrets and transactions. All of us now use it routinely, and well we should, given that our devices hold our financial, medical and most deeply personal information. Even the big corporations and agencies with the wherewithal to protect data are vulnerable to attacks. The line between someone’s iPhone and a well-fortified network is only a phish away. The flash point for this controversy is the question of what spooks should do when they encounter “zero day” defects. The term refers to vulnerabilities in systems not yet known to manufacturers. Odds are if an intelligence agency finds one of these, a hostile agency from another land—or even a long dark-side hacker—might have found it, too. (Or it might wind up in a Wikileaks special edition.) The inevitable question when a spy geek finds one of these is, exploit or report? When I visited the NSA a few years ago, its top officials boasted of a single incident where they unearthed a defect so egregious that, after considerable discussion on the matter, they notified the software makers. I found it telling that they had to argue the matter for so long. It made me wonder: What about all those zero-day defects where they didn’t alert Microsoft? I can accept that this conundrum is, to some degree, a balancing act between the need to crack codes in a national emergency and the more persistent requirement of helping support genuinely secure networks, hardware, and apps. But I’ve long thought that the US government has gotten the balance wrong. Intoxicated by the relatively easy pickings exposed by a porous infrastructure, our agencies have never done the hard work necessary to help foment a system where strong security is baked in—a system where private means private. As a result, everything is up for grabs, from the electrical grid to the emails of political party chieftains. The best evidence of this gap is the epic haplessness of those agencies themselves when it comes to protecting their own information. The current leak is only the latest in a series of massive security breaches (Snowden, Manning, etc.). If these secret-hoarding spy agencies can be so easily looted, how in the world can we citizens protect our own miserable little secrets? This week on Backchannel: The Face of Terrorism Wants His Life Back: Anas Modamani had just arrived at a refugee center in Berlin when he happened to snap a selfie with Angela Merkel. Flash forward six months, and that selfie had been coopted by fake news and turned into a meme accusing Modamani of being behind various terror attacks. Jessica Camille Aguirre offers a probe into the real-life story behind the fake news: how Modamani teamed up with a lawyer who’d been looking for a way to hold Facebook accountable for the spread of fake news — and took the social media giant to court. The Invisible Force That Warps What You Read in the News: Are we in a bubble? Why has Uber’s story spun out of control? The answers hinge less on facts and more on the hidden physics of what Aaron Zamost calls Narrative Gravity. This Insurance Startup Wants to Cover Tomorrow’s Self-Driving Cars: Tesla’s self-driving features may be controversial — see Mark Harris’s report on Autopilot from last week — but one car insurance company is betting on the fact that cars in autonomous mode are actually safer than cars driven by humans. Starting this week, Tesla owners who use Autopilot will be able to get a discount on their premiums, as Root looks to get ahead of the Uber-level disruption that’s about to hit the car insurance industry. ", "title": "For the CIA, Every Day Is Zero Day", "sentences": [{"1c05": "For the CIA, Every Day Is Zero Day"}, {"14f4": "Spy agencies are no better protected than the public. It’s no coincidence."}, {"0420": "(Wikimedia Commons)"}, {"e125": "Hi Backchannel folks. Steven here. I’ve been following the swirl of fear, confusion, and finger-pointing after this week’s wanton Wikileaks dump of internal CIA documents that describe the agency’s prodigious hacking tools. Because the entire tranche arrived unfiltered, it took a while to figure out how scary it was that our spies had found lots of ways to compromise iPhones, Androids, and some of the very apps that take special pains to heighten protection. Some people shriek that it’s a security Armageddon; others say that because some of the tricks are already out-of-date, it isn’t scary at all. One thing we can be sure of is that releasing these documents, with all sorts of good suggestions for snoops and data thieves, hasn’t made us any safer."}, {"e8ef": "Ultimately, though, I’m going stuff this caper into a bulging file documenting our ongoing conflict between privacy and security. I found it kind of cute that many observers professed outrage that the CIA was devoting efforts to schemes to extract information from encrypted devices and software systems. Folks, can you spell spy agency? Sans freakouts, people watch TV shows and movies all the time where the resident geek in the Langley bullpen is asked to get ahold of some piece of protected information and, after a feverish assault on a keyboard and maybe a couple of thwarted tries that yield only an ACCESS DENIED on the screen, poof! There it is. Crypto cracked! Apparently these documents, purloined from the CIA vault by a whistleblower or traitor (pick one), are user’s manuals for the tools that enable such cryptanalytic pyrotechnics in real life."}, {"27da": "Though that stuff plays well in Hollywood (unless you’re Oliver Stone), there is a flip side to this: Every government attack on a potential terrorist’s cell means that someone else could be attacking all our devices the same way. We are long past the days where only governments and big institutions use encryption to protect their secrets and transactions. All of us now use it routinely, and well we should, given that our devices hold our financial, medical and most deeply personal information. Even the big corporations and agencies with the wherewithal to protect data are vulnerable to attacks. The line between someone’s iPhone and a well-fortified network is only a phish away."}, {"735d": "The flash point for this controversy is the question of what spooks should do when they encounter “zero day” defects. The term refers to vulnerabilities in systems not yet known to manufacturers. Odds are if an intelligence agency finds one of these, a hostile agency from another land—or even a long dark-side hacker—might have found it, too. (Or it might wind up in a Wikileaks special edition.) The inevitable question when a spy geek finds one of these is, exploit or report? When I visited the NSA a few years ago, its top officials boasted of a single incident where they unearthed a defect so egregious that, after considerable discussion on the matter, they notified the software makers. I found it telling that they had to argue the matter for so long. It made me wonder: What about all those zero-day defects where they didn’t alert Microsoft?"}, {"f1fa": "I can accept that this conundrum is, to some degree, a balancing act between the need to crack codes in a national emergency and the more persistent requirement of helping support genuinely secure networks, hardware, and apps. But I’ve long thought that the US government has gotten the balance wrong. Intoxicated by the relatively easy pickings exposed by a porous infrastructure, our agencies have never done the hard work necessary to help foment a system where strong security is baked in—a system where private means private. As a result, everything is up for grabs, from the electrical grid to the emails of political party chieftains."}, {"1707": "The best evidence of this gap is the epic haplessness of those agencies themselves when it comes to protecting their own information. The current leak is only the latest in a series of massive security breaches (Snowden, Manning, etc.). If these secret-hoarding spy agencies can be so easily looted, how in the world can we citizens protect our own miserable little secrets?"}, {"87ef": "This week on Backchannel:"}, {"616a": "The Face of Terrorism Wants His Life Back: Anas Modamani had just arrived at a refugee center in Berlin when he happened to snap a selfie with Angela Merkel. Flash forward six months, and that selfie had been coopted by fake news and turned into a meme accusing Modamani of being behind various terror attacks. Jessica Camille Aguirre offers a probe into the real-life story behind the fake news: how Modamani teamed up with a lawyer who’d been looking for a way to hold Facebook accountable for the spread of fake news — and took the social media giant to court."}, {"6b85": "The Invisible Force That Warps What You Read in the News: Are we in a bubble? Why has Uber’s story spun out of control? The answers hinge less on facts and more on the hidden physics of what Aaron Zamost calls Narrative Gravity."}, {"43fd": "This Insurance Startup Wants to Cover Tomorrow’s Self-Driving Cars: Tesla’s self-driving features may be controversial — see Mark Harris’s report on Autopilot from last week — but one car insurance company is betting on the fact that cars in autonomous mode are actually safer than cars driven by humans. Starting this week, Tesla owners who use Autopilot will be able to get a discount on their premiums, as Root looks to get ahead of the Uber-level disruption that’s about to hit the car insurance industry."}], "child": "432_1\t432_2\t432_3\t432_4\t432_5"}