{"name": "433", "parent": "", "content": "Uber’s Leather Boys Susan Fowler’s horror story is destined to become a textbook case in workplace discrimination. Hey, Backchannelers, Steven here. In the week since former Uber engineer Susan Fowler blew up the internet with her blog post chronicling her mistreatment as a female engineer at the company, countless pixels have been enlisted to analyze, contextualize, and cheer on the author, who fortunately is now ensconced in a presumably women-friendlier startup, Stripe. Those pixels have served proudly, raising bias awareness, excoriating awful behavior, and forcing Uber itself to enlist a former attorney general to investigate. But there is one aspect of this ride-share to hell that I feel is still underappreciated. And that is the leather jacket. Though the actual harassment part of the story is of course more serious and nauseating, it’s a story we’ve unfortunately heard all too many times. The tale Fowler told about leather jackets, on the other hand, is destined to become a textbook case in discrimination—it is so blatant and looney that “unconscious bias” cannot possibly apply. Only someone comatose could have missed this one. Follow Backchannel: Facebook | Twitter Here it is in a nutshell. Fowler worked on the Site Reliability Engineering team (SRE), with about 120 men and 6 women. Uber decided to buy the SREs leather jackets, and gave fittings to all. But after the company learned that it had enough men’s sizes to qualify for a discount but would have to pay retail for the women’s jackets, it decided to give jackets only to male SREs. Fowler sent an email to the director to note the unfairness, and he replied essentially that she was being unfair, because if Uber paid more for women’s jackets, then the women would be getting special treatment. A little context. This is not a wardrobe issue. In deciding to get these jackets for SREs, Uber was following a precedent. Historically, Google was the creator of the modern SRE organization, gathering some of its most badass engineers for the critical task of keeping its products running. These were the aces of the keyboard, people who at any moment could be roused from slumber by a call to address some bug or buffer overload. SREs take massive pride in their job. Some years ago, Google rewarded its team with bomber jackets with special patches. The SREs wore them with the élan of fighter pilots. The jackets represented belonging. Wearing one meant you were a valued part of a trusted team. Thus Uber’s moronic decision was a blood insult to the women in the group. You would think that when Fowler pointed out the error to the manager, he would have instantly recognized the scope of the blunder. Instead he replied that if Uber paid a little more for the women’s jackets, they would have been beneficiaries of special privilege. This is standard bigot’s code for denying people protection from discrimination because of their gender, race, religion, or sexual preference. Can you imagine what would have happened if Uber decided, because men gobble more food than women, that only women should get free catering in the company’s cafe, and men would have to reach into their wallets? No, you cannot, because that would never happen. More context. Uber, like many top Silicon Valley firms, attempts to hire only the smartest and most productive people. Getting a management job at one of these companies is tougher than getting into Harvard. So it is not a stupid person answering Fowler’s email, putting in writing a policy that embodies discrimination. It is a person who almost certainly has no indication that he will suffer any negative consequences from essentially telling the very few women in his group — something that in and of itself should have been a prime concern to him — that they are not welcome in his organization. That thinking can only happen if it comes from the top. This week on Backchannel: Inside Facebook’s AI Machine. How did Facebook, which only a few years ago had very little machine learning in its products, suddenly bake so much AI into its service that an executive now claims the company “could not exist without AI?” Here’s my deep dive into that question. The Alternative Facts of Cable Companies. Our ace tech policy columnist Susan Crawford delves into into the New York Attorney General’s lawsuit against Charter/Time Warner/Spectrum (all the same, with shell-game naming!) so you can gawk at the perfidy. (Such as $10 a month for obsolete cable modems that literally can’t deliver the advertised speed!) Read on to find Crawford’s silver lining. Trump’s FCC Pick Is Threatening the Jobs His Boss Promised America. In 2015, Backchannel reported on a great program that helped ex-coal miners to learn code and find jobs in the new economy. Those new jobs depend on internet access, the fuel that will put people to work—presumably a goal of the new administration. Kira Goldenberg details the shocking news that Donald Trump’s pick to lead the FCC wants to cut off that fuel. By the way, Backchannel is doing more Facebook Live these days. In fact, I gave a little preview of my leather jacket rant (aired out above) when Jessi Hempel and I discussed Uber on Tuesday. There was a wearable prop. Check it out! ", "title": "Uber’s Leather Boys", "sentences": [{"a6f2": "Uber’s Leather Boys"}, {"a55e": "Susan Fowler’s horror story is destined to become a textbook case in workplace discrimination."}, {"2a65": "Hey, Backchannelers, Steven here. In the week since former Uber engineer Susan Fowler blew up the internet with her blog post chronicling her mistreatment as a female engineer at the company, countless pixels have been enlisted to analyze, contextualize, and cheer on the author, who fortunately is now ensconced in a presumably women-friendlier startup, Stripe. Those pixels have served proudly, raising bias awareness, excoriating awful behavior, and forcing Uber itself to enlist a former attorney general to investigate."}, {"534d": "But there is one aspect of this ride-share to hell that I feel is still underappreciated. And that is the leather jacket. Though the actual harassment part of the story is of course more serious and nauseating, it’s a story we’ve unfortunately heard all too many times. The tale Fowler told about leather jackets, on the other hand, is destined to become a textbook case in discrimination—it is so blatant and looney that “unconscious bias” cannot possibly apply. Only someone comatose could have missed this one."}, {"0f73": "Follow Backchannel: Facebook | Twitter"}, {"e492": "Here it is in a nutshell. Fowler worked on the Site Reliability Engineering team (SRE), with about 120 men and 6 women. Uber decided to buy the SREs leather jackets, and gave fittings to all. But after the company learned that it had enough men’s sizes to qualify for a discount but would have to pay retail for the women’s jackets, it decided to give jackets only to male SREs. Fowler sent an email to the director to note the unfairness, and he replied essentially that she was being unfair, because if Uber paid more for women’s jackets, then the women would be getting special treatment."}, {"8d2d": "A little context. This is not a wardrobe issue. In deciding to get these jackets for SREs, Uber was following a precedent. Historically, Google was the creator of the modern SRE organization, gathering some of its most badass engineers for the critical task of keeping its products running. These were the aces of the keyboard, people who at any moment could be roused from slumber by a call to address some bug or buffer overload. SREs take massive pride in their job. Some years ago, Google rewarded its team with bomber jackets with special patches. The SREs wore them with the élan of fighter pilots."}, {"4754": "The jackets represented belonging. Wearing one meant you were a valued part of a trusted team."}, {"f477": "Thus Uber’s moronic decision was a blood insult to the women in the group. You would think that when Fowler pointed out the error to the manager, he would have instantly recognized the scope of the blunder. Instead he replied that if Uber paid a little more for the women’s jackets, they would have been beneficiaries of special privilege. This is standard bigot’s code for denying people protection from discrimination because of their gender, race, religion, or sexual preference."}, {"3ebe": "Can you imagine what would have happened if Uber decided, because men gobble more food than women, that only women should get free catering in the company’s cafe, and men would have to reach into their wallets? No, you cannot, because that would never happen."}, {"14ad": "More context. Uber, like many top Silicon Valley firms, attempts to hire only the smartest and most productive people. Getting a management job at one of these companies is tougher than getting into Harvard. So it is not a stupid person answering Fowler’s email, putting in writing a policy that embodies discrimination. It is a person who almost certainly has no indication that he will suffer any negative consequences from essentially telling the very few women in his group — something that in and of itself should have been a prime concern to him — that they are not welcome in his organization."}, {"62d4": "That thinking can only happen if it comes from the top."}, {"0c6b": "This week on Backchannel:"}, {"86a1": "Inside Facebook’s AI Machine. How did Facebook, which only a few years ago had very little machine learning in its products, suddenly bake so much AI into its service that an executive now claims the company “could not exist without AI?” Here’s my deep dive into that question."}, {"6dab": "The Alternative Facts of Cable Companies. Our ace tech policy columnist Susan Crawford delves into into the New York Attorney General’s lawsuit against Charter/Time Warner/Spectrum (all the same, with shell-game naming!) so you can gawk at the perfidy. (Such as $10 a month for obsolete cable modems that literally can’t deliver the advertised speed!) Read on to find Crawford’s silver lining."}, {"630f": "Trump’s FCC Pick Is Threatening the Jobs His Boss Promised America. In 2015, Backchannel reported on a great program that helped ex-coal miners to learn code and find jobs in the new economy. Those new jobs depend on internet access, the fuel that will put people to work—presumably a goal of the new administration. Kira Goldenberg details the shocking news that Donald Trump’s pick to lead the FCC wants to cut off that fuel."}, {"1930": "By the way, Backchannel is doing more Facebook Live these days. In fact, I gave a little preview of my leather jacket rant (aired out above) when Jessi Hempel and I discussed Uber on Tuesday. There was a wearable prop. Check it out!"}], "child": "433_1\t433_2\t433_3\t433_4\t433_5\t433_6\t433_7\t433_8\t433_9\t433_10\t433_11\t433_12\t433_13\t433_14\t433_15\t433_16\t433_17\t433_18\t433_19\t433_20\t433_21\t433_22\t433_23\t433_24\t433_25"}