{"name": "434", "parent": "", "content": "This Is the Single Best Reason to Talk to Your Neighbors Illustration by Li-Anne Dias About a month ago, deep into the night, I woke up — fully alert. I glanced at my phone. It was 2 a.m. I lay still, my ears scanning for sounds. I heard a scuffling noise. First, I thought, that’s just the dog, nudging his bowl around with his nose. He must be hungry. Then I remembered: I don’t have a dog, and I haven’t had a dog since I was a teenager. Again, scuffling. I sat up straight and stared at the open bedroom door. Now I heard heavy thuds. Those must be feet. Human feet. Ohmygodohmygod. A light flicked on. There’s someone in the house! I sat frozen in place, mesmerized by the light shining across my bedroom doorway. Someone was so close. I sat and stared, wide-eyed. “OAKLAND POLICE!!” The words clanged through my skull. I still didn’t move. Then, without giving it much thought, I yelled back: “Yeah?” Silence. “OAKLAND POLICE!!” At that, I hopped out of bed and scampered downstairs. Maybe it really was the police, or maybe it was dread villains preparing to slice me to pieces. Time to find out! A police officer was standing in the doorway to the kitchen, pointing his flashlight straight at me. I flinched. Behind him, a whole platoon of cops appeared to be backing him up. “Is everything all right?” he asks. All right? I guess things are all right. Everything’s great! Perfect night to exchange pleasantries. “Your neighbor called us, your garage door was open. There’s been some criminal activity lately, so we have to search the place.” He paused and looked at me. As it turns out, my garage door opener is hyper-sensitive, and sometimes just setting it down is enough to cause the door to start trundling open. At some point the night before, the button must have gotten nudged, and the door must have dutifully heaved itself to the sky. That alone wouldn’t be so bad, except it’s the only line of defense — if the garage door is up, you literally can just waltz into my kitchen, cook yourself a meal, and make yourself at home. “Is anything missing?” the police officer asked. I glanced around and shrugged, too startled to think clearly. “Seems fine,” I said. The cops took down my info, and then they filed back out, down through the open garage, and out into the night. I hit the button and waited until the garage door clicked against the floor. With the Oakland PD safely on its way, my jittery thoughts turned to my neighbor. She is a fiend for safety — and I’m grateful for that. We’ve promised to keep an eye out for one another on more than one occasion. In fact, it’s pretty much the only way we interact. It would have been so much better if she’d called or texted before summoning armed men into my home — but of course, she doesn’t have my number. And that’s my fault, because it had never dawned on me that our relationship actually mattered. Unfortunately, I’m not the only one to forget to invest in my neighbors. It’s the whole premise behind the company Nextdoor, which set out to connect people living in the same community. But as the company soon discovered, users had a different idea of how to employ the network. They preferred it as a type of neighborhood watch, posting sightings of strangers on the block. The problem was that all too often, those strangers were only notable because of a darker skin color. Instead of encouraging community, the platform was encouraging people to express their racism. My colleague Jessi Hempel weaves a great tale this week about how the company tried to tamp down racist posts, and why that turned out to be surprisingly tricky. But that’s just one of the strange, unexpected ways communities behave in real life. Lauren Bohn has another unusual story. She’s a reporter who’s been covering the Syrian refugee crisis, watching on WhatsApp as her sources embarked on harrowing journeys that ripped their families apart. Their loneliness, love, and anguish play out in emoji-filled dramas only chronicled in WhatsApp messages. I highly recommend her piece — it’s a gripping portrait of how fractured families use social media as a lifeline. These stories and more are part of this week’s in-depth exploration of the concept of home in an age of constant connectivity. As online social networks create alternate spaces where people can live out their truest lives, it’s the physical sense of home — not just the building but the block and the community — that we find ourselves having to discover anew. — Sandra More from Backchannel this Week: A dozen startups want to help you buy and sell your household stuff better — they’ll even hook you up with delivery! So why can’t they succeed? It’s simple: Craigslist. The site is ugly, janky, and old-school — but ultimately, it’s unbeatable. Here’s why. For decades, the humble router was the hands-down most boring piece of hardware. Now a new crop of WiFi companies has reconceived it as a svelte fleet of gadgets distributed between rooms, beaming out nothing but the finest internet with an app as their choreographer. So which of these new systems is best for your home? Steven Levy has the uber-review (with a bonus Steve Jobs anecdote). Oh, almost forgot to mention: Steven also had a sit-down interview with Mark Zuckerberg in which he plotted nothing less than a roadmap for a new global social infrastructure. Zuckerberg thinks our society is in serious trouble. But don’t worry, he has a plan. ", "title": "This Is the Single Best Reason to Talk to Your Neighbors", "sentences": [{"ddb4": "This Is the Single Best Reason to Talk to Your Neighbors"}, {"5596": "Illustration by Li-Anne Dias"}, {"d7ea": "About a month ago, deep into the night, I woke up — fully alert. I glanced at my phone. It was 2 a.m. I lay still, my ears scanning for sounds."}, {"2e44": "I heard a scuffling noise. First, I thought, that’s just the dog, nudging his bowl around with his nose. He must be hungry. Then I remembered: I don’t have a dog, and I haven’t had a dog since I was a teenager."}, {"ccbd": "Again, scuffling. I sat up straight and stared at the open bedroom door. Now I heard heavy thuds. Those must be feet. Human feet. Ohmygodohmygod. A light flicked on. There’s someone in the house!"}, {"78ab": "I sat frozen in place, mesmerized by the light shining across my bedroom doorway. Someone was so close. I sat and stared, wide-eyed."}, {"32de": "“OAKLAND POLICE!!”"}, {"0aff": "The words clanged through my skull. I still didn’t move. Then, without giving it much thought, I yelled back: “Yeah?”"}, {"a84e": "Silence."}, {"b9f4": "“OAKLAND POLICE!!”"}, {"8189": "At that, I hopped out of bed and scampered downstairs. Maybe it really was the police, or maybe it was dread villains preparing to slice me to pieces. Time to find out!"}, {"34e6": "A police officer was standing in the doorway to the kitchen, pointing his flashlight straight at me. I flinched. Behind him, a whole platoon of cops appeared to be backing him up."}, {"b329": "“Is everything all right?” he asks."}, {"57a6": "All right? I guess things are all right. Everything’s great! Perfect night to exchange pleasantries."}, {"0a21": "“Your neighbor called us, your garage door was open. There’s been some criminal activity lately, so we have to search the place.” He paused and looked at me."}, {"04fb": "As it turns out, my garage door opener is hyper-sensitive, and sometimes just setting it down is enough to cause the door to start trundling open. At some point the night before, the button must have gotten nudged, and the door must have dutifully heaved itself to the sky. That alone wouldn’t be so bad, except it’s the only line of defense — if the garage door is up, you literally can just waltz into my kitchen, cook yourself a meal, and make yourself at home."}, {"5e58": "“Is anything missing?” the police officer asked."}, {"5ad4": "I glanced around and shrugged, too startled to think clearly. “Seems fine,” I said. The cops took down my info, and then they filed back out, down through the open garage, and out into the night. I hit the button and waited until the garage door clicked against the floor."}, {"6ace": "With the Oakland PD safely on its way, my jittery thoughts turned to my neighbor. She is a fiend for safety — and I’m grateful for that. We’ve promised to keep an eye out for one another on more than one occasion. In fact, it’s pretty much the only way we interact. It would have been so much better if she’d called or texted before summoning armed men into my home — but of course, she doesn’t have my number. And that’s my fault, because it had never dawned on me that our relationship actually mattered."}, {"226f": "Unfortunately, I’m not the only one to forget to invest in my neighbors. It’s the whole premise behind the company Nextdoor, which set out to connect people living in the same community. But as the company soon discovered, users had a different idea of how to employ the network. They preferred it as a type of neighborhood watch, posting sightings of strangers on the block. The problem was that all too often, those strangers were only notable because of a darker skin color. Instead of encouraging community, the platform was encouraging people to express their racism. My colleague Jessi Hempel weaves a great tale this week about how the company tried to tamp down racist posts, and why that turned out to be surprisingly tricky. But that’s just one of the strange, unexpected ways communities behave in real life."}, {"389f": "Lauren Bohn has another unusual story. She’s a reporter who’s been covering the Syrian refugee crisis, watching on WhatsApp as her sources embarked on harrowing journeys that ripped their families apart. Their loneliness, love, and anguish play out in emoji-filled dramas only chronicled in WhatsApp messages. I highly recommend her piece — it’s a gripping portrait of how fractured families use social media as a lifeline."}, {"e4eb": "These stories and more are part of this week’s in-depth exploration of the concept of home in an age of constant connectivity. As online social networks create alternate spaces where people can live out their truest lives, it’s the physical sense of home — not just the building but the block and the community — that we find ourselves having to discover anew."}, {"2779": "— Sandra"}, {"07f0": "More from Backchannel this Week:"}, {"5d61": "A dozen startups want to help you buy and sell your household stuff better — they’ll even hook you up with delivery! So why can’t they succeed? It’s simple: Craigslist. The site is ugly, janky, and old-school — but ultimately, it’s unbeatable. Here’s why."}, {"1750": "For decades, the humble router was the hands-down most boring piece of hardware. Now a new crop of WiFi companies has reconceived it as a svelte fleet of gadgets distributed between rooms, beaming out nothing but the finest internet with an app as their choreographer. So which of these new systems is best for your home? Steven Levy has the uber-review (with a bonus Steve Jobs anecdote)."}, {"4118": "Oh, almost forgot to mention: Steven also had a sit-down interview with Mark Zuckerberg in which he plotted nothing less than a roadmap for a new global social infrastructure. Zuckerberg thinks our society is in serious trouble. But don’t worry, he has a plan."}], "child": "434_1\t434_2\t434_3\t434_4\t434_5\t434_6"}