{"name": "438", "parent": "", "content": "The Future Called: We’re Disgusting And Barbaric Pregnancy, meat eating, and fossil fuels will all one day be unthinkable. I often wonder what people in the future will find barbaric about my life. We tend to look back on our ancestors with a mix of amusement and disgust: amusement that those poor fools managed to survive without things like toilets, electricity, and selfies; disgust that their lives were filled with things we find vile. But are we any better? Humans have always done things that were considered normal at the time, that now seem horrific. People kept human beings as property. Doctors bled clients to release evil humors and treat medical conditions. Lobotomies were thought to cure mental illness. Urban dwellers flushed sewage and industrial pollution into their drinking water, then swam and fished in their own poop. Eventually it got so bad that our rivers were catching on fire. Violent and deadly wars were far more common. Follow Backchannel: Facebook | Twitter The list is long and frightening. History was a nasty place to live. The present is much, much nicer. Yet the future will be even better, and our descendants will scorn us for our backwardness. I’ve rounded up some candidates for the things that are most likely to cause future folk to shudder. Slaughtering animals for their meat In the future, we will breed or genetically engineer animals for the tastiest cuts of flesh. But we won’t kill and eat them. Our offspring would find that brutal and disgusting. Instead, we will take tiny samples of their delicious bodies and use them to grow large amounts of tasty artificial meat in industrial labs. Aside from the humanitarian aspects of not killing and eating animals, cultured meat will be good for the environment. Animals like cattle and pigs don’t efficiently morph into food. Growing feed, transporting it, and managing animal waste comes with significant environmental costs—not to mention that cow farts contribute to global warming. (Spencer Weiner / Getty Images) This technology is nearer than you think. Only a few years ago, meat cultured in a lab cost hundreds of thousands of dollars per pound. Now? The price is down to about $30 a pound. Perhaps that will open the door to human meat, as well. Once you remove the ethical lapse of needing to murder someone in order to eat homo sapiens, it’s not hard to imagine mass market cannibalism taking off. We could grow meat from harmless tissue samples taken from live humans. Celebrities might even sell their most famous cuts. Imagine this dinner party conversation: Host: Here, have a bite of Beyoncé tenderloin or enjoy the BBQ LeBron chops. Guest: No thanks, I filled up on Brad Pitt’s rump roast at the other table. And the cycle of disgust will continue as their descendants are similarly repulsed. Growing babies in our bodies Most future folk will find pregnancy—and especially the delivery of an infant through a birth canal—messy and risky. In the future, most infants will be gestated in artificial wombs from which they won’t be born so much as removed. Creating a baby inside another human being is hazardous. The child’s health is dependent on the mother’s physical security as she navigates the world, and the fetus is susceptible to infections, poor nutrition and other threats. Artificial wombs will provide safe, sterile environments for ectogenesis that will deliver optimum nourishment for ideal growth. It may even enable parents to lengthen gestation beyond 40 weeks, perhaps until icky poopy (barbaric!) diapers are unnecessary. Abortion will probably be regarded as a moot debate. Advances in genetic engineering will allow men and women to turn their fertility on and off: a more advanced birth control that will make unexpected pregnancies extremely rare. Burning fossil fuels for energy Air pollution still kills over 200,000 people in the United States annually. That’s over 60 times the deaths from the 9/11 attacks every year. (Where’s the war on radical particulate extremism?) But even US pollution is nothing compared to countries like China. This is what Beijing looks like after two days of rain and on a normal day: What happens to the gunk the rain washes away? (Bobak / CC BY-SA 2.5) Globally, air pollution kills five million people per annum. The smoke from burning coal from India, China, and other coal-heavy countries falls into the oceans and is contaminating the ecosystem with mercury, including the fish we eat. Future folk will be appalled that we spend hundreds of billions of dollars to prevent small-impact yet high-visibility risks like terrorism, but tolerate hundreds of thousands of deaths per year to produce energy—especially when renewable energy provides clean power and free fuel. (Let’s say that again, fellow fiscal conservatives: free fuel. Green energy may be for hippie liberals, but renewable energy is for capitalists and conservatives.) Tolerating homes and bodies infested with critters Right now, there are hundreds of millions of insects living on your body and in your home. Tiny dust mites inhabit your mattress, your pillow, your carpeting, and your body, regardless of how clean everything is. Microscopic demodex mites live in the follicles of your eyelashes and prowl your face at night. And this doesn’t even consider the trillions of bacteria and parasites that live inside us. Our bodies are like planets, full of life that is not us. Millions of these infest everyone’s bed, sofa, home and body. Future folk will be thoroughly disgusted. They will have nanotechnology antibodies — tiny machines that patrol our homes and skin, hoovering up dust mite food (our skin flakes) and exterminating the little suckers. They can’t completely eliminate all the insects and bacteria — human beings have developed a symbiosis with them; we need bacteria to do things like digest food—but the nanobots will police this flora, keeping it within healthy bounds and eliminating any micro-infestations or infections that grow out of control. And forget about infestations by critters like cockroaches. Nanobots will exterminate larger household pests en masse. The real terminators of the future wont wreck havoc on humanity: They’ll massacre our unwanted insect houseguests. Radiation, chemotherapy, craniotomies, and much of “modern” medicine In the future, cancers will be treated with precision-guided drug delivery or gene therapy. The idea of exposing patients to massive doses of radiation or chemicals to kill off the cancer — hopefully before the treatment kills the patient — will horrify future folk. Similarly, craniotomies and other invasive surgery will be replaced with non-invasive medical nanobots. These microscopic robots will enter the body through the mouth or via injection, travel to the problem area, and perform microsurgery without a single incision or suture. Later, we may just use force fields to manipulate tissues inside the body totally non-invasively. Still, we shouldn’t feel bad about this one. Every society finds the medical practices of their ancestors abhorrent. Medical science continually progresses from barbarity to civility, until the civility becomes the new barbarity. Lack of brain-computer interfaces Just as I marvel that my parents grew up without television, and millennials wonder how we ever survived without the internet, our great-grandchildren will be amazed that we could function without direct brain-computer interfaces. This technology is already here, albeit in its infancy. Brain-computer interfaces allow people with locked-in syndrome — a state where someone is conscious but paralyzed — to communicate. But in the future, we’ll all have computers in our heads. Hard to believe? Just look at the evolution of the smartphone and how many devices it has replaced: the camera, camcorder, photo album, fax machine, scanner, music player, and so on. Twenty years ago, it would take a large table to display all the tools that are now in an iPhone. The Apple watch is the next step. Soon you won’t wear your mobile, you’ll have it integrated into your body and attached to your brain. We may even have technology-enabled telepathy. Some other candidates for condemnation by our evolved offspring: Rather than continue this list, I’d like to hear from you. What do you think our descendants will find disgusting or barbaric about the modern world? Leave your thoughts in the comments below. ", "title": "The Future Called: We’re Disgusting And Barbaric", "sentences": [{"f346": "The Future Called: We’re Disgusting And Barbaric"}, {"5165": "Pregnancy, meat eating, and fossil fuels will all one day be unthinkable."}, {"640f": "I often wonder what people in the future will find barbaric about my life. We tend to look back on our ancestors with a mix of amusement and disgust: amusement that those poor fools managed to survive without things like toilets, electricity, and selfies; disgust that their lives were filled with things we find vile."}, {"34c4": "But are we any better?"}, {"533c": "Humans have always done things that were considered normal at the time, that now seem horrific. People kept human beings as property. Doctors bled clients to release evil humors and treat medical conditions. Lobotomies were thought to cure mental illness. Urban dwellers flushed sewage and industrial pollution into their drinking water, then swam and fished in their own poop. Eventually it got so bad that our rivers were catching on fire. Violent and deadly wars were far more common."}, {"657b": "Follow Backchannel: Facebook | Twitter"}, {"e4a4": "The list is long and frightening. History was a nasty place to live. The present is much, much nicer."}, {"daab": "Yet the future will be even better, and our descendants will scorn us for our backwardness. I’ve rounded up some candidates for the things that are most likely to cause future folk to shudder."}, {"af34": "Slaughtering animals for their meat"}, {"31f5": "In the future, we will breed or genetically engineer animals for the tastiest cuts of flesh. But we won’t kill and eat them. Our offspring would find that brutal and disgusting. Instead, we will take tiny samples of their delicious bodies and use them to grow large amounts of tasty artificial meat in industrial labs."}, {"75c4": "Aside from the humanitarian aspects of not killing and eating animals, cultured meat will be good for the environment. Animals like cattle and pigs don’t efficiently morph into food. Growing feed, transporting it, and managing animal waste comes with significant environmental costs—not to mention that cow farts contribute to global warming."}, {"def8": "(Spencer Weiner / Getty Images)"}, {"94b8": "This technology is nearer than you think. Only a few years ago, meat cultured in a lab cost hundreds of thousands of dollars per pound. Now? The price is down to about $30 a pound."}, {"d765": "Perhaps that will open the door to human meat, as well. Once you remove the ethical lapse of needing to murder someone in order to eat homo sapiens, it’s not hard to imagine mass market cannibalism taking off. We could grow meat from harmless tissue samples taken from live humans. Celebrities might even sell their most famous cuts. Imagine this dinner party conversation:"}, {"d1c6": "Host: Here, have a bite of Beyoncé tenderloin or enjoy the BBQ LeBron chops."}, {"da8d": "Guest: No thanks, I filled up on Brad Pitt’s rump roast at the other table."}, {"9d39": "And the cycle of disgust will continue as their descendants are similarly repulsed."}, {"0e05": "Growing babies in our bodies"}, {"821a": "Most future folk will find pregnancy—and especially the delivery of an infant through a birth canal—messy and risky. In the future, most infants will be gestated in artificial wombs from which they won’t be born so much as removed."}, {"39a1": "Creating a baby inside another human being is hazardous. The child’s health is dependent on the mother’s physical security as she navigates the world, and the fetus is susceptible to infections, poor nutrition and other threats. Artificial wombs will provide safe, sterile environments for ectogenesis that will deliver optimum nourishment for ideal growth. It may even enable parents to lengthen gestation beyond 40 weeks, perhaps until icky poopy (barbaric!) diapers are unnecessary."}, {"01fb": "Abortion will probably be regarded as a moot debate. Advances in genetic engineering will allow men and women to turn their fertility on and off: a more advanced birth control that will make unexpected pregnancies extremely rare."}, {"69a1": "Burning fossil fuels for energy"}, {"e506": "Air pollution still kills over 200,000 people in the United States annually. That’s over 60 times the deaths from the 9/11 attacks every year. (Where’s the war on radical particulate extremism?) But even US pollution is nothing compared to countries like China. This is what Beijing looks like after two days of rain and on a normal day:"}, {"68c0": "What happens to the gunk the rain washes away? (Bobak / CC BY-SA 2.5)"}, {"aa45": "Globally, air pollution kills five million people per annum. The smoke from burning coal from India, China, and other coal-heavy countries falls into the oceans and is contaminating the ecosystem with mercury, including the fish we eat."}, {"f748": "Future folk will be appalled that we spend hundreds of billions of dollars to prevent small-impact yet high-visibility risks like terrorism, but tolerate hundreds of thousands of deaths per year to produce energy—especially when renewable energy provides clean power and free fuel. (Let’s say that again, fellow fiscal conservatives: free fuel. Green energy may be for hippie liberals, but renewable energy is for capitalists and conservatives.)"}, {"785b": "Tolerating homes and bodies infested with critters"}, {"1074": "Right now, there are hundreds of millions of insects living on your body and in your home. Tiny dust mites inhabit your mattress, your pillow, your carpeting, and your body, regardless of how clean everything is. Microscopic demodex mites live in the follicles of your eyelashes and prowl your face at night. And this doesn’t even consider the trillions of bacteria and parasites that live inside us. Our bodies are like planets, full of life that is not us."}, {"7198": "Millions of these infest everyone’s bed, sofa, home and body."}, {"f8c5": "Future folk will be thoroughly disgusted. They will have nanotechnology antibodies — tiny machines that patrol our homes and skin, hoovering up dust mite food (our skin flakes) and exterminating the little suckers. They can’t completely eliminate all the insects and bacteria — human beings have developed a symbiosis with them; we need bacteria to do things like digest food—but the nanobots will police this flora, keeping it within healthy bounds and eliminating any micro-infestations or infections that grow out of control."}, {"60d7": "And forget about infestations by critters like cockroaches. Nanobots will exterminate larger household pests en masse. The real terminators of the future wont wreck havoc on humanity: They’ll massacre our unwanted insect houseguests."}, {"3886": "Radiation, chemotherapy, craniotomies, and much of “modern” medicine"}, {"d763": "In the future, cancers will be treated with precision-guided drug delivery or gene therapy. The idea of exposing patients to massive doses of radiation or chemicals to kill off the cancer — hopefully before the treatment kills the patient — will horrify future folk. Similarly, craniotomies and other invasive surgery will be replaced with non-invasive medical nanobots. These microscopic robots will enter the body through the mouth or via injection, travel to the problem area, and perform microsurgery without a single incision or suture. Later, we may just use force fields to manipulate tissues inside the body totally non-invasively."}, {"84d5": "Still, we shouldn’t feel bad about this one. Every society finds the medical practices of their ancestors abhorrent. Medical science continually progresses from barbarity to civility, until the civility becomes the new barbarity."}, {"8042": "Lack of brain-computer interfaces"}, {"a1c4": "Just as I marvel that my parents grew up without television, and millennials wonder how we ever survived without the internet, our great-grandchildren will be amazed that we could function without direct brain-computer interfaces. This technology is already here, albeit in its infancy. Brain-computer interfaces allow people with locked-in syndrome — a state where someone is conscious but paralyzed — to communicate."}, {"66f2": "But in the future, we’ll all have computers in our heads. Hard to believe? Just look at the evolution of the smartphone and how many devices it has replaced: the camera, camcorder, photo album, fax machine, scanner, music player, and so on. Twenty years ago, it would take a large table to display all the tools that are now in an iPhone. The Apple watch is the next step. Soon you won’t wear your mobile, you’ll have it integrated into your body and attached to your brain. We may even have technology-enabled telepathy."}, {"63b9": "Some other candidates for condemnation by our evolved offspring:"}, {"b323": "Rather than continue this list, I’d like to hear from you. What do you think our descendants will find disgusting or barbaric about the modern world? Leave your thoughts in the comments below."}], "child": "438_1\t438_2\t438_3\t438_4\t438_5\t438_6\t438_7\t438_8\t438_9\t438_10\t438_11\t438_12\t438_13\t438_14\t438_15\t438_16\t438_17\t438_18\t438_19\t438_20\t438_21\t438_22\t438_23\t438_24\t438_25"}