{"name": "440", "parent": "", "content": "The Top Tech Books of 2016 (Part I) Here are the books Backchannel loved, plus an excerpt from each. When I first began writing about technology, a modest shelf could actually hold pretty much all the volumes that we now recognized as “tech books” — business-oriented tomes about tech companies, geeky explorations of hardware or software milestones, celebratory 0r scary projections of what our current products will morph to, and one more biography of Steve Jobs. Now they tumble out like doughnuts on a conveyor belt, as zillions of writers covering the field realize that to make a statement they have to go really longform. And it’s great. No, you don’t have to read them all. But be happy they are there. In every one of the hundreds of tech books published each year, there are almost certainly points of view, factoids, and observations worth bringing into the world. Though Kevin Kelly (cited below) loves the idea that everything we do will be measured in numbers, I believe that the ultimate measurement is the painstakingly considered rendering of a single human being, arrived at over months or years of thought, and presented at length in a coherent narrative. And every year a certain number of books of real distinction appear—ones that will last. These are our targets in Backchannel’s annual year-end reading fest. Here’s how it works: our staffers recommend favorites — just in time for you to use the gift certificates you got for the holidays — and tell you why the book is worth reading. And then we provide proof: a juicy excerpt from every one we recommend. It’s just the thing to help divert you from the fact that 2017 may be even worse than this year. Please buy at least one of these (or one of the books we will talk about tomorrow, in Part II of our best-of list). As welcome as our touts might be, the ultimate validation of an author is the decision to buy his or her book. — Steven Levy The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com Time Travel A history By James Gleick It takes Jim Gleick 250 pages to ask the question outright: What is time? The query comes after several chapters of virtuoso literary criticism, Windex-clear explanations of theories usually left to physicists, and vivid historical vignettes involving time capsules and tombs. The cast of characters has included H.G. Wells, Richard Nixon, Bertrand Russell, Albert Einstein, William Gibson, Mr. Peabody. T.S. Eliot, Kurt Gödel, Tom Stoppard, Stephen Hawking, Woody Allen, Robert Heinlein, and Lucifer. But especially H.G. Wells. We have learned about why it is impossible to go back in time to kill your grandfather and why, in some multiverse, it might have already happened. And now he asks us what time is? That’s right, because by now we readers are ready for it. It’s a massive question, and by his deft discussion of it, Gleick proves once again that he is our best creator of prose rabbit holes that ultimately lead us to understanding. I am not giving anything away when I say that while discouraging our hopes of visiting ancient Rome or checking out how the 10,000-year clock fares, Gleick proves that we are already time travelers, through our timepieces and our reading and our memories. The best books stop time for us. This one expands it. — Steven Levy Read an excerpt from Time Travel here: How Time Travel BeganA fiction writer discovered the fourth dimension before Einstein did. Excerpted from Time Travel by James Gleick.backchannel.com Pinpoint How GPS is changing technology, culture, and our minds By Greg Milner It’s a tall order to make something like the history of GPS remotely readable, but in Pinpoint, Greg Milner manages to create the suspense of a thriller novel, successfully conveying the message that GPS is one of the defining technologies of our time, built on a faint and relatively fragile signal. Initially developed as a military technology, GPS is now an integral and easily overlooked part of our daily lives — from helping us navigate from point A to point B on our smartphones to assisting with air traffic control — and, as Milner expertly shows, its existence is fundamentally changing the ways we live and think. Nowhere is that more clear than when Milner offers up a series of harrowing tales of people who’ve literally driven themselves to or near death by over-reliance on GPS, trusting that, as a navigational system directed them to proceed along ever-narrower roads or through lakes, it must be right. And not surprisingly so: as Pinpoint details, our ability to form what psychologists call “cognitive maps” is more or less wasting away, as our dependence on GPS to create those maps for us increases. —Miranda Katz Read an excerpt from Pinpoint here: How GPS Became a Human Tracking MechanismExcerpted from Pinpoint by Greg Milner.backchannel.com Sprint How to solve big problems and test new ideas in just five days By Jake Knapp with John Zeratsky and Braden Kowitz If there exists a formula for coming up with the out-of-the-box ideas that find their way into the products and services that grow up to become Silicon Valley startups, surely Sprint encapsulates it. Principal author Jake Knapp, a genial and remarkably tall designer, developed his method at Google, where he led design “sprints” for Chrome, Gmail, and Google Search, among others. Now he’s a partner at Google Ventures, where he’s joined designers — and coauthors — John Zeratsky and Braden Kowitz. They’ve conducted sprints for more than 100 portfolio companies. Their book is a DYI guide to problem solving. It’s refreshingly devoid of platitudes and leadership catchphrases. Instead, the trio offers a step-by-step guide to every last element of the five-day process, from identifying a problem on day one to testing a prototype with customers on day five. They leave no question unanswered, from the correct number of participants (best is seven) to the types of supplies you need to bring or leave behind (no devices allowed). They use real-life examples from popular startups such as Blue Bottle Coffee and Flatiron Health to illustrate their points. It’s a quick read, intended as a reference to which you can return when you run into one of those inevitable roadblocks that seems insolvable. But as always, it’s not the formula that helps the well-intentioned solve problems and dream up new ideas. It’s what we do with it. — Jessi Hempel Read an excerpt from Sprint here: Inside Blue Bottle Coffee’s Sprint to Get Off the GroundExcerpted from Sprint by Jake Knapp with John Zeratsky and Braden Kowitz, of Google Ventures.backchannel.com Death’s End By Cixin Liu, translated by Ken Liu Should Cixin Liu be considered a Chinese writer, emblematic of his cultural moment, or simply a writer who happens to be Chinese? Suffice it to say: Liu is magnificent, and Death’s End, released in translation this fall, brings to an appropriately spectacular crescendo his much-celebrated Remembrance of Earth’s Past trilogy, which began with The Three-Body Problem’s invasion of aliens who shake civilization with several subatomic particles and continued with The Dark Forest’s extinction-level game theory writ cosmic. (If you haven’t read those two already, do that first. Really.) The Three-Body Problem won a Hugo Award, science fiction’s highest honor, and Liu — whom The New Yorker called “China’s Arthur C. Clarke” — has been credited for putting the science back into a genre recently and lamentably preoccupied, at least to some critics, by sociological rather than material operatics. The science of Death’s End, which begins with humanity’s ongoing intergalactic struggle and ends on a far vaster stage, is indeed — to use Liu’s phrase — ultra-grand: quantum physics and planetary engineering, deep-time cryogenics and a quest to slow light speed itself. (The science is not all bloodless, either; among the trilogy’s most poignant moments are appreciations of nature and disgust at its despoilage.) Liu has an obvious love for science—its process as well as its insights, and also its beauties: four-dimensional space, he writes in one memorable passage, “impressed itself upon the soul, and gave the observers the experience of seeing the mountain contained in a mustard seed described in Buddhist parables.” Indeed. Focusing exclusively on Liu’s maximalist science, though, disservices his narrative craftsmanship — Death’s End could have easily been several novels, each thrilling — and his human side. Liu’s confidence in material engineering is equaled by his faith, reassuring in our own troubled moment, in democracy and enlightened global governance. Riding these currents are modern everymen, ennobled by love and duty and doubt — and when Death’s End concludes with, to reference another Chinese invention, the escalating beauty of a fireworks show, it’s the pathos rather than the science that brings tears to one’s eyes. — Brandon Keim Read an excerpt from Death’s End here: The Death of the MagicianExcerpted from Death’s End by Cixin Liu, translated by Ken Liubackchannel.com Weapons of Math Destruction How big data increases inequality and threatens democracy By Cathy O’Neil If you thought the world was unfair before, crack open Weapons of Math Destruction and prepare for your blood to simmer. In this tour of biased algorithms, data scientist Cathy O’Neil explains how the software that runs our banks, police departments, schools, and online ads, among other things, seizes on existing social inequality and amplifies it. Algorithms determining the rankings of such disparate things as employee performance, an inmate’s risk of recidivism, and the quality of colleges are often flawed because they don’t have access to the ground truth. They rely instead on proxies: substitute data from which they build statistical castles. As O’Neil writes, the builders of these flawed models draw “correlations between a person’s zip code or language patterns and her potential to pay back a loan or handle a job. These correlations are discriminatory, and some of them are illegal.” And they serve to widen the divide between the haves and have-nots. O’Neil contends we should take an active role in policing and taming these flawed algorithms. She leaves it vague how exactly we might do so, but as with many emerging challenges, the first step is to bring these secretive algorithms into the harsh light of day. — Sandra Upson Read an excerpt from Weapons of Math Destruction here: Be Healthy or Else: How Corporations Became Obsessed with Fitness TrackingExcerpted from Weapons of Math Destruction by Cathy O’Neil.backchannel.com The Inevitable Understanding the 12 technological forces that will shape our future By Kevin Kelly In The Inevitable, Kevin Kelly uses one particular construction quite a lot: Twenty (or some similar number) years ago nobody would have believed that… And then he fills in the blank with something that’s part of our everyday lives, like asking a question to a robot in the cloud and getting a very specific answer, or invoking an address halfway around the globe and getting an image of what’s standing in that very spot on earth. Once you understand his point about how quickly things can shift from the realm of unbelievable to everyday stuff, then you can more easily swallow the marvels he describes in The Inevitable. You may even agree with him that they are, indeed, inevitable. Ever the techno-optimist, Kelly embraces a future where robots do a lot of the work, people augment reality with an illuminating digital layer, ubiquitous software tracking churns out metrics on everything we do, and earthlings collaborate routinely to maximize our resources and intelligence. While acknowledging that tech has a downside, he concentrates on how the future will improve our collective log. This makes for provocative reading in 2016. But if Kelly is right, 20 years from now, people will come across The Inevitable and wonder why anyone thought it would be otherwise. — Steven Levy Read an excerpt from The Inevitable here: The Seven Steps Toward Making Humans ObsoleteOr, how we stopped fighting and learned to love our robot replacements. Excerpted from The Inevitable by Kevin Kelly.backchannel.com The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com ", "title": "The Top Tech Books of 2016 (Part I)", "sentences": [{"4d82": "The Top Tech Books of 2016 (Part I)"}, {"0016": "Here are the books Backchannel loved, plus an excerpt from each."}, {"489f": "When I first began writing about technology, a modest shelf could actually hold pretty much all the volumes that we now recognized as “tech books” — business-oriented tomes about tech companies, geeky explorations of hardware or software milestones, celebratory 0r scary projections of what our current products will morph to, and one more biography of Steve Jobs. Now they tumble out like doughnuts on a conveyor belt, as zillions of writers covering the field realize that to make a statement they have to go really longform."}, {"ae4b": "And it’s great."}, {"edd3": "No, you don’t have to read them all. But be happy they are there. In every one of the hundreds of tech books published each year, there are almost certainly points of view, factoids, and observations worth bringing into the world. Though Kevin Kelly (cited below) loves the idea that everything we do will be measured in numbers, I believe that the ultimate measurement is the painstakingly considered rendering of a single human being, arrived at over months or years of thought, and presented at length in a coherent narrative."}, {"bad0": "And every year a certain number of books of real distinction appear—ones that will last. These are our targets in Backchannel’s annual year-end reading fest."}, {"a3a9": "Here’s how it works: our staffers recommend favorites — just in time for you to use the gift certificates you got for the holidays — and tell you why the book is worth reading. And then we provide proof: a juicy excerpt from every one we recommend. It’s just the thing to help divert you from the fact that 2017 may be even worse than this year."}, {"b475": "Please buy at least one of these (or one of the books we will talk about tomorrow, in Part II of our best-of list). As welcome as our touts might be, the ultimate validation of an author is the decision to buy his or her book. — Steven Levy"}, {"8f16": "The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com"}, {"4d1b": "Time Travel"}, {"3cb1": "A history"}, {"6a8f": "By James Gleick"}, {"655f": "It takes Jim Gleick 250 pages to ask the question outright: What is time? The query comes after several chapters of virtuoso literary criticism, Windex-clear explanations of theories usually left to physicists, and vivid historical vignettes involving time capsules and tombs. The cast of characters has included H.G. Wells, Richard Nixon, Bertrand Russell, Albert Einstein, William Gibson, Mr. Peabody. T.S. Eliot, Kurt Gödel, Tom Stoppard, Stephen Hawking, Woody Allen, Robert Heinlein, and Lucifer. But especially H.G. Wells. We have learned about why it is impossible to go back in time to kill your grandfather and why, in some multiverse, it might have already happened."}, {"0726": "And now he asks us what time is? That’s right, because by now we readers are ready for it. It’s a massive question, and by his deft discussion of it, Gleick proves once again that he is our best creator of prose rabbit holes that ultimately lead us to understanding. I am not giving anything away when I say that while discouraging our hopes of visiting ancient Rome or checking out how the 10,000-year clock fares, Gleick proves that we are already time travelers, through our timepieces and our reading and our memories. The best books stop time for us. This one expands it. — Steven Levy"}, {"0b4b": "Read an excerpt from Time Travel here:"}, {"6df2": "How Time Travel BeganA fiction writer discovered the fourth dimension before Einstein did. Excerpted from Time Travel by James Gleick.backchannel.com"}, {"c9a1": "Pinpoint"}, {"9b4d": "How GPS is changing technology, culture, and our minds"}, {"452a": "By Greg Milner"}, {"0396": "It’s a tall order to make something like the history of GPS remotely readable, but in Pinpoint, Greg Milner manages to create the suspense of a thriller novel, successfully conveying the message that GPS is one of the defining technologies of our time, built on a faint and relatively fragile signal."}, {"ffb1": "Initially developed as a military technology, GPS is now an integral and easily overlooked part of our daily lives — from helping us navigate from point A to point B on our smartphones to assisting with air traffic control — and, as Milner expertly shows, its existence is fundamentally changing the ways we live and think."}, {"ce11": "Nowhere is that more clear than when Milner offers up a series of harrowing tales of people who’ve literally driven themselves to or near death by over-reliance on GPS, trusting that, as a navigational system directed them to proceed along ever-narrower roads or through lakes, it must be right. And not surprisingly so: as Pinpoint details, our ability to form what psychologists call “cognitive maps” is more or less wasting away, as our dependence on GPS to create those maps for us increases. —Miranda Katz"}, {"d8fd": "Read an excerpt from Pinpoint here:"}, {"164b": "How GPS Became a Human Tracking MechanismExcerpted from Pinpoint by Greg Milner.backchannel.com"}, {"da07": "Sprint"}, {"5ec7": "How to solve big problems and test new ideas in just five days"}, {"2fd0": "By Jake Knapp with John Zeratsky and Braden Kowitz"}, {"383f": "If there exists a formula for coming up with the out-of-the-box ideas that find their way into the products and services that grow up to become Silicon Valley startups, surely Sprint encapsulates it. Principal author Jake Knapp, a genial and remarkably tall designer, developed his method at Google, where he led design “sprints” for Chrome, Gmail, and Google Search, among others. Now he’s a partner at Google Ventures, where he’s joined designers — and coauthors — John Zeratsky and Braden Kowitz. They’ve conducted sprints for more than 100 portfolio companies."}, {"fca5": "Their book is a DYI guide to problem solving. It’s refreshingly devoid of platitudes and leadership catchphrases. Instead, the trio offers a step-by-step guide to every last element of the five-day process, from identifying a problem on day one to testing a prototype with customers on day five. They leave no question unanswered, from the correct number of participants (best is seven) to the types of supplies you need to bring or leave behind (no devices allowed). They use real-life examples from popular startups such as Blue Bottle Coffee and Flatiron Health to illustrate their points. It’s a quick read, intended as a reference to which you can return when you run into one of those inevitable roadblocks that seems insolvable. But as always, it’s not the formula that helps the well-intentioned solve problems and dream up new ideas. It’s what we do with it. — Jessi Hempel"}, {"8e20": "Read an excerpt from Sprint here:"}, {"5484": "Inside Blue Bottle Coffee’s Sprint to Get Off the GroundExcerpted from Sprint by Jake Knapp with John Zeratsky and Braden Kowitz, of Google Ventures.backchannel.com"}, {"1209": "Death’s End"}, {"d952": "By Cixin Liu, translated by Ken Liu"}, {"39ea": "Should Cixin Liu be considered a Chinese writer, emblematic of his cultural moment, or simply a writer who happens to be Chinese? Suffice it to say: Liu is magnificent, and Death’s End, released in translation this fall, brings to an appropriately spectacular crescendo his much-celebrated Remembrance of Earth’s Past trilogy, which began with The Three-Body Problem’s invasion of aliens who shake civilization with several subatomic particles and continued with The Dark Forest’s extinction-level game theory writ cosmic. (If you haven’t read those two already, do that first. Really.)"}, {"a9f9": "The Three-Body Problem won a Hugo Award, science fiction’s highest honor, and Liu — whom The New Yorker called “China’s Arthur C. Clarke” — has been credited for putting the science back into a genre recently and lamentably preoccupied, at least to some critics, by sociological rather than material operatics. The science of Death’s End, which begins with humanity’s ongoing intergalactic struggle and ends on a far vaster stage, is indeed — to use Liu’s phrase — ultra-grand: quantum physics and planetary engineering, deep-time cryogenics and a quest to slow light speed itself. (The science is not all bloodless, either; among the trilogy’s most poignant moments are appreciations of nature and disgust at its despoilage.) Liu has an obvious love for science—its process as well as its insights, and also its beauties: four-dimensional space, he writes in one memorable passage, “impressed itself upon the soul, and gave the observers the experience of seeing the mountain contained in a mustard seed described in Buddhist parables.” Indeed."}, {"20ea": "Focusing exclusively on Liu’s maximalist science, though, disservices his narrative craftsmanship — Death’s End could have easily been several novels, each thrilling — and his human side. Liu’s confidence in material engineering is equaled by his faith, reassuring in our own troubled moment, in democracy and enlightened global governance. Riding these currents are modern everymen, ennobled by love and duty and doubt — and when Death’s End concludes with, to reference another Chinese invention, the escalating beauty of a fireworks show, it’s the pathos rather than the science that brings tears to one’s eyes. — Brandon Keim"}, {"5628": "Read an excerpt from Death’s End here:"}, {"51f8": "The Death of the MagicianExcerpted from Death’s End by Cixin Liu, translated by Ken Liubackchannel.com"}, {"0a3c": "Weapons of Math Destruction"}, {"99b4": "How big data increases inequality and threatens democracy"}, {"f20f": "By Cathy O’Neil"}, {"082f": "If you thought the world was unfair before, crack open Weapons of Math Destruction and prepare for your blood to simmer. In this tour of biased algorithms, data scientist Cathy O’Neil explains how the software that runs our banks, police departments, schools, and online ads, among other things, seizes on existing social inequality and amplifies it."}, {"f6fc": "Algorithms determining the rankings of such disparate things as employee performance, an inmate’s risk of recidivism, and the quality of colleges are often flawed because they don’t have access to the ground truth. They rely instead on proxies: substitute data from which they build statistical castles. As O’Neil writes, the builders of these flawed models draw “correlations between a person’s zip code or language patterns and her potential to pay back a loan or handle a job. These correlations are discriminatory, and some of them are illegal.” And they serve to widen the divide between the haves and have-nots."}, {"41f9": "O’Neil contends we should take an active role in policing and taming these flawed algorithms. She leaves it vague how exactly we might do so, but as with many emerging challenges, the first step is to bring these secretive algorithms into the harsh light of day. — Sandra Upson"}, {"dd06": "Read an excerpt from Weapons of Math Destruction here:"}, {"351e": "Be Healthy or Else: How Corporations Became Obsessed with Fitness TrackingExcerpted from Weapons of Math Destruction by Cathy O’Neil.backchannel.com"}, {"5edd": "The Inevitable"}, {"f76e": "Understanding the 12 technological forces that will shape our future"}, {"769a": "By Kevin Kelly"}, {"91de": "In The Inevitable, Kevin Kelly uses one particular construction quite a lot: Twenty (or some similar number) years ago nobody would have believed that… And then he fills in the blank with something that’s part of our everyday lives, like asking a question to a robot in the cloud and getting a very specific answer, or invoking an address halfway around the globe and getting an image of what’s standing in that very spot on earth. Once you understand his point about how quickly things can shift from the realm of unbelievable to everyday stuff, then you can more easily swallow the marvels he describes in The Inevitable. You may even agree with him that they are, indeed, inevitable."}, {"2113": "Ever the techno-optimist, Kelly embraces a future where robots do a lot of the work, people augment reality with an illuminating digital layer, ubiquitous software tracking churns out metrics on everything we do, and earthlings collaborate routinely to maximize our resources and intelligence. While acknowledging that tech has a downside, he concentrates on how the future will improve our collective log. This makes for provocative reading in 2016. But if Kelly is right, 20 years from now, people will come across The Inevitable and wonder why anyone thought it would be otherwise. — Steven Levy"}, {"8d4e": "Read an excerpt from The Inevitable here:"}, {"f8b6": "The Seven Steps Toward Making Humans ObsoleteOr, how we stopped fighting and learned to love our robot replacements. Excerpted from The Inevitable by Kevin Kelly.backchannel.com"}, {"8f3b": "The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com"}], "child": "440_1\t440_2\t440_3\t440_4\t440_5\t440_6\t440_7\t440_8\t440_9\t440_10"}