{"name": "441", "parent": "", "content": "How Time Travel Began By James Gleick A man stands at the end of a drafty corridor, a.k.a. the nineteenth century, and in the flickering light of an oil lamp examines a machine made of nickel and ivory, with brass rails and quartz rods — a squat, ugly contraption, somehow out of focus, not easy for the poor reader to visualize, despite the listing of parts and materials. Our hero fiddles with some screws, adds a drop of oil, and plants himself on the saddle. He grasps a lever with both hands. He is going on a journey. And by the way so are we. When he throws that lever, time breaks from its moorings. The man is nondescript, almost devoid of features — “grey eyes” and a “pale face” and not much else. He lacks even a name. He is just the Time Traveller: “for so it will be convenient to speak of him.” Time and travel: no one had thought to join those words before now. And that machine? With its saddle and bars, it’s a fantasticated bicy­cle. The whole thing is the invention of a young enthusiast named Wells, who goes by his initials, H. G., because he thinks that sounds more serious than Herbert. His family calls him Bertie. He is trying to be a writer. He is a thoroughly modern man, a believer in social­ism, free love, and bicycles. A proud member of the Cyclists’ Touring Club, he rides up and down the Thames valley on a forty-pounder with tubular frame and pneumatic tires, savoring the thrill of riding his machine: “A memory of motion lingers in the muscles of your legs, and round and round they seem to go.” At some point he sees a printed advertisement for a contraption called Hacker’s Home Bicy­cle: a stationary stand with rubber wheels to let a person pedal for exercise without going anywhere. Anywhere through space, that is. The wheels go round and time goes by. The turn of the twentieth century loomed — a calendar date with apocalyptic resonance. Albert Einstein was a boy at gymnasium in Munich. Not till 1908 would the Polish-German mathematician Hermann Minkowski announce his radical idea: “Henceforth space by itself, and time by itself, are doomed to fade away into mere shadows, and only a kind of union of the two will preserve an inde­pendent reality.” H. G. Wells was there first, but unlike Minkowski, Wells was not trying to explain the universe. He was just trying to gin up a plausible-sounding plot device for a piece of fantastic story­telling. Nowadays we voyage through time so easily and so well, in our dreams and in our art. Time travel feels like an ancient tradition, rooted in old mythologies, old as gods and dragons. It isn’t. Though the ancients imagined immortality and rebirth and lands of the dead time machines were beyond their ken. Time travel is a fantasy of the modern era. When Wells in his lamp-lit room imagined a time machine, he also invented a new mode of thought. Why not before? And why now? The time traveller begins with a science lesson. Or is it just flummery? He gathers his friends around the drawing-room fire to explain that everything they know about time is wrong. They are stock characters from central casting: the Medical Man, the Psycholo­gist, the Editor, the Journalist, the Silent Man, the Very Young Man, and the Provincial Mayor, plus everyone’s favorite straight man, “an argumentative person with red hair” named Filby. “You must follow me carefully,” the Time Traveller instructs these stick figures. “I shall have to controvert one or two ideas that are almost universally accepted. The geometry, for instance, that they taught you at school is founded on a misconception.” School geometry — Euclid’s geometry — had three dimensions, the ones we can see: length, width, and height. Naturally they are dubious. The Time Traveller proceeds Socrati­cally. He batters them with logic. They put up feeble resistance. “You know of course that a mathematical line, a line of thickness nil, has no real existence. They taught you that? Neither has a mathematical plane. These things are mere abstractions.” “That is all right,” said the Psychologist. “Nor, having only length, breadth, and thickness, can a cube have a real existence.” “There I object,” said Filby. “Of course a solid body may exist. All real things — ” “So most people think. But wait a moment. Can an instanta­neous cube exist?” “Don’t follow you,” said Filby [the poor sap]. “Can a cube that does not last for any time at all, have a real existence?” Filby became pensive. “Clearly,” the Time Traveller proceeded, “any real body must have extension in four directions: it must have Length, Breadth, Thickness, and — Duration.” Aha! The fourth dimension. A few clever Continental mathemati­cians were already talking as though Euclid’s three dimensions were not the be-all and end-all. There was August Möbius, whose famous “strip” was a two-dimensional surface making a twist through the third dimension, and Felix Klein, whose loopy “bottle” implied a fourth; there were Gauss and Riemann and Lobachevsky, all think­ing, as it were, outside the box. For geometers the fourth dimension was an unknown direction at right angles to all our known directions. Can anyone visualize that? What direction is it? Even in the seven­teenth century, the English mathematician John Wallis, recognizing the algebraic possibility of higher dimensions, called them “a Mon­ster in Nature, less possible than a Chimaera or Centaure.” More and more, though, mathematics found use for concepts that lacked physi­cal meaning. They could play their parts in an abstract world without necessarily describing features of reality. Under the influence of these geometers, a schoolmaster named Edwin Abbott Abbott published his whimsical little novel Flatland: A Romance of Many Dimensions in 1884, in which two-dimensional creatures try to wrap their minds around the possibility of a third; and in 1888 Charles Howard Hinton, a son-in-law of the logician George Boole, invented the word tesseract for the four-dimensional analogue of the cube. The four-dimensional space this object encloses he called hypervolume. He populated it with hypercones, hyper pyramids, and hyperspheres. Hinton titled his book, not very modestly, A New Era of Thought. He suggested that this mysterious, not-quite-visible fourth dimension might provide an answer to the mystery of consciousness. “We must be really four-dimensional creatures, or we could not think about four dimensions,” he reasoned. To make mental models of the world and of ourselves, we must have special brain molecules: “It may be that these brain molecules have the power of four-dimensional movement, and that they can go through four-dimensional movements and form four-dimensional structures.” For a while in Victorian England the fourth dimension served as a catchall, a hideaway for the mysterious, the unseen, the spiritual — anything that seemed to be lurking just out of sight. Heaven might be in the fourth dimension; after all, astronomers with their telescopes were not finding it overhead. The fourth dimension was a secret compartment for fantasists and occultists. “We are on the eve of the Fourth Dimension; that is what it is!” declared William T. Stead, a muckraking journalist who had been editor of the Pall Mall Gazette, in 1893. He explained that this could be expressed by mathematical formulas and could be imagined (“if you have a vivid imagination”) but could not actually be seen — anyway not “by mortal man.” It was a place “of which we catch glimpses now and then in those phenomena which are entirely unaccountable for by any law of three-dimensional space.” For example, clairvoyance. Also telepathy. He submitted his report to the Psychical Research Society for their further investiga­tion. Nineteen years later he embarked on the Titanic and drowned at sea. By comparison Wells is so sober, so simple. No mysticism for him — the fourth dimension is not a ghost world. It is not heaven, nor is it hell. It is time. What is time? Time is nothing but one more direction, orthogonal to the rest. As simple as that. It’s just that no one has been able to see it till now — till the Time Traveller. “Through a natural infirmity of the flesh . . . we incline to overlook this fact,” he coolly explains. “There is no difference between Time and any of the three dimensions of Space except that our consciousness moves along it.” In surprisingly short order this notion would become part of the orthodoxy of theoretical physics. Excerpted from Time Travel by James Gleick. Copyright © 2016 by James Gleick. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher. Published by arrangement with Pantheon Books, an imprint of The Knopf Doubleday Group, a division of Penguin Random House, LLC. Available for purchase here. The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com ", "title": "How Time Travel Began", "sentences": [{"c52b": "How Time Travel Began"}, {"3ddd": "By James Gleick"}, {"6af9": "A man stands at the end of a drafty corridor, a.k.a. the nineteenth century, and in the flickering light of an oil lamp examines a machine made of nickel and ivory, with brass rails and quartz rods — a squat, ugly contraption, somehow out of focus, not easy for the poor reader to visualize, despite the listing of parts and materials. Our hero fiddles with some screws, adds a drop of oil, and plants himself on the saddle. He grasps a lever with both hands. He is going on a journey. And by the way so are we. When he throws that lever, time breaks from its moorings. The man is nondescript, almost devoid of features — “grey eyes” and a “pale face” and not much else. He lacks even a name. He is just the Time Traveller: “for so it will be convenient to speak of him.” Time and travel: no one had thought to join those words before now. And that machine? With its saddle and bars, it’s a fantasticated bicy­cle. The whole thing is the invention of a young enthusiast named Wells, who goes by his initials, H. G., because he thinks that sounds more serious than Herbert. His family calls him Bertie. He is trying to be a writer. He is a thoroughly modern man, a believer in social­ism, free love, and bicycles. A proud member of the Cyclists’ Touring Club, he rides up and down the Thames valley on a forty-pounder with tubular frame and pneumatic tires, savoring the thrill of riding his machine: “A memory of motion lingers in the muscles of your legs, and round and round they seem to go.” At some point he sees a printed advertisement for a contraption called Hacker’s Home Bicy­cle: a stationary stand with rubber wheels to let a person pedal for exercise without going anywhere. Anywhere through space, that is. The wheels go round and time goes by. The turn of the twentieth century loomed — a calendar date with apocalyptic resonance. Albert Einstein was a boy at gymnasium in Munich. Not till 1908 would the Polish-German mathematician Hermann Minkowski announce his radical idea: “Henceforth space by itself, and time by itself, are doomed to fade away into mere shadows, and only a kind of union of the two will preserve an inde­pendent reality.” H. G. Wells was there first, but unlike Minkowski, Wells was not trying to explain the universe. He was just trying to gin up a plausible-sounding plot device for a piece of fantastic story­telling. Nowadays we voyage through time so easily and so well, in our dreams and in our art. Time travel feels like an ancient tradition, rooted in old mythologies, old as gods and dragons. It isn’t. Though the ancients imagined immortality and rebirth and lands of the dead time machines were beyond their ken. Time travel is a fantasy of the modern era. When Wells in his lamp-lit room imagined a time machine, he also invented a new mode of thought."}, {"a576": "Why not before? And why now?"}, {"da60": "The time traveller begins with a science lesson. Or is it just flummery? He gathers his friends around the drawing-room fire to explain that everything they know about time is wrong. They are stock characters from central casting: the Medical Man, the Psycholo­gist, the Editor, the Journalist, the Silent Man, the Very Young Man, and the Provincial Mayor, plus everyone’s favorite straight man, “an argumentative person with red hair” named Filby. “You must follow me carefully,” the Time Traveller instructs these stick figures. “I shall have to controvert one or two ideas that are almost universally accepted. The geometry, for instance, that they taught you at school is founded on a misconception.” School geometry — Euclid’s geometry — had three dimensions, the ones we can see: length, width, and height. Naturally they are dubious. The Time Traveller proceeds Socrati­cally. He batters them with logic. They put up feeble resistance."}, {"ae83": "“You know of course that a mathematical line, a line of thickness nil, has no real existence. They taught you that? Neither has a mathematical plane. These things are mere abstractions.”"}, {"11e6": "“That is all right,” said the Psychologist."}, {"9e08": "“Nor, having only length, breadth, and thickness, can a cube have a real existence.”"}, {"78fe": "“There I object,” said Filby. “Of course a solid body may exist. All real things — ”"}, {"918f": "“So most people think. But wait a moment. Can an instanta­neous cube exist?”"}, {"0fdf": "“Don’t follow you,” said Filby [the poor sap]."}, {"d1e6": "“Can a cube that does not last for any time at all, have a real existence?”"}, {"31a7": "Filby became pensive. “Clearly,” the Time Traveller proceeded, “any real body must have extension in four directions: it must have Length, Breadth, Thickness, and — Duration.”"}, {"f1cf": "Aha! The fourth dimension. A few clever Continental mathemati­cians were already talking as though Euclid’s three dimensions were not the be-all and end-all. There was August Möbius, whose famous “strip” was a two-dimensional surface making a twist through the third dimension, and Felix Klein, whose loopy “bottle” implied a fourth; there were Gauss and Riemann and Lobachevsky, all think­ing, as it were, outside the box. For geometers the fourth dimension was an unknown direction at right angles to all our known directions. Can anyone visualize that? What direction is it? Even in the seven­teenth century, the English mathematician John Wallis, recognizing the algebraic possibility of higher dimensions, called them “a Mon­ster in Nature, less possible than a Chimaera or Centaure.” More and more, though, mathematics found use for concepts that lacked physi­cal meaning. They could play their parts in an abstract world without necessarily describing features of reality. Under the influence of these geometers, a schoolmaster named Edwin Abbott Abbott published his whimsical little novel Flatland: A Romance of Many Dimensions in 1884, in which two-dimensional creatures try to wrap their minds around the possibility of a third; and in 1888 Charles Howard Hinton, a son-in-law of the logician George Boole, invented the word tesseract for the four-dimensional analogue of the cube. The four-dimensional space this object encloses he called hypervolume. He populated it with hypercones, hyper pyramids, and hyperspheres. Hinton titled his book, not very modestly, A New Era of Thought. He suggested that this mysterious, not-quite-visible fourth dimension might provide an answer to the mystery of consciousness."}, {"f685": "“We must be really four-dimensional creatures, or we could not think about four dimensions,” he reasoned. To make mental models of the world and of ourselves, we must have special brain molecules: “It may be that these brain molecules have the power of four-dimensional movement, and that they can go through four-dimensional movements and form four-dimensional structures.” For a while in Victorian England the fourth dimension served as a catchall, a hideaway for the mysterious, the unseen, the spiritual — anything that seemed to be lurking just out of sight. Heaven might be in the fourth dimension; after all, astronomers with their telescopes were not finding it overhead. The fourth dimension was a secret compartment for fantasists and occultists. “We are on the eve of the Fourth Dimension; that is what it is!” declared William T. Stead, a muckraking journalist who had been editor of the Pall Mall Gazette, in 1893. He explained that this could be expressed by mathematical formulas and could be imagined (“if you have a vivid imagination”) but could not actually be seen — anyway not “by mortal man.” It was a place “of which we catch glimpses now and then in those phenomena which are entirely unaccountable for by any law of three-dimensional space.” For example, clairvoyance. Also telepathy. He submitted his report to the Psychical Research Society for their further investiga­tion. Nineteen years later he embarked on the Titanic and drowned at sea. By comparison Wells is so sober, so simple. No mysticism for him — the fourth dimension is not a ghost world. It is not heaven, nor is it hell. It is time. What is time? Time is nothing but one more direction, orthogonal to the rest. As simple as that. It’s just that no one has been able to see it till now — till the Time Traveller. “Through a natural infirmity of the flesh . . . we incline to overlook this fact,” he coolly explains. “There is no difference between Time and any of the three dimensions of Space except that our consciousness moves along it.” In surprisingly short order this notion would become part of the orthodoxy of theoretical physics."}, {"89ac": "Excerpted from Time Travel by James Gleick. Copyright © 2016 by James Gleick. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher. Published by arrangement with Pantheon Books, an imprint of The Knopf Doubleday Group, a division of Penguin Random House, LLC."}, {"3f34": "Available for purchase here."}, {"b7cf": "The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com"}, {"d590": "The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com"}], "child": "441_1"}