{"name": "444", "parent": "", "content": "Technology Gone Wild How cheap sensors, ubiquitous computing, and networks of enthusiastic amateurs are building a new planetary nervous system Migratory patterns of Western Meadowlarks (via eBird) Birding — the amateur pursuit of watching and monitoring bird populations — is a big deal. The numbers back it up. The U.S. Fish and Wildlife Service puts the number of “wildlife watchers” in the country over 20 million. They estimate the industry is larger than $50 billion. But there is more to the story than legions of spotting scope-equipped, L.L. Bean-wearing retirees moving through national parks and recreation areas. Like everyone else, the birders are now wired up. In addition to notebooks and life lists, birders are now using apps and centralized databases like eBird and iNaturalist to quantify their work. This data is becoming the backbone for important ornithology work (even though it often doesn’t receive any credit). By turning digital, researchers have been able to turn to statisticians and computer scientists to add quality control filters to the data, as well as tweak the interfaces to encourage more participation from ever growing number and diversity of people. They’ve also been able create beautiful visualizations, like this real-time map of submissions. The birders are just the tip of the iceberg — a small sliver of a much bigger trend emerging around amateur science. Networks of makers are creating tools to explore, monitor, and understand our planet in an entirely new way. The pace of innovation is staggering. There have been very public success stories, like the use of drones for conservation or the development of small satellites for continuous Earth imaging. These are more than just clever hacks. Each one adds a new tool to the toolbox of the growing army of citizen scientists around the world. These people — passionate networks of amateur and professional scientists — are busy wiring up the natural world with every sensor they can get their hands on. To paraphrase the ideas of Planet Labs CEO Will Marshall, these are the neurons of a new planetary nervous system. Planet Labs doves in space. Credit: NASA I’ve had a front row seat to this emerging phenomenon. In 2012, my friend Eric Stackpole and I started the OpenROV project in his garage in Cupertino. We wanted a low-cost underwater drone to explore a submerged cave, and the commercial alternatives were far beyond our price range. In the years since, our idea has grown from just a few people working in a garage to a global community of thousands of professional and amateur ocean explorers, and evolved from a small project into a company that’s building cutting-edge tools. Our latest project, the OpenROV Trident, raised over $800,000 on Kickstarter last October. The community of users have used the devices for everything from finding shipwrecks in Southern California to discovering a previously unknown fluorescent quality of a clam in the Cook Islands. The OpenROV Trident A New Era of Citizen Science The idea of amateur science isn’t new. In fact, a few disciplines have been pioneering this approach for decades. Astronomy and ornithology both have a long track record of including the work of non-professionals in their research. In both cases, the formula is simple: Low-Cost Tools + Open Standards + Connected Enthusiasm In the case of astronomy, one of the main drivers of the recent boom was the development of the Dobsonian telescope. In the 1960s, John Dobson — a monk in San Francisco — contributed an entirely novel way to mount larger lenses using whatever materials happened to be lying around. He never patented his design, but instead set about teaching anyone and everyone the methods and joy of constructing their own telescope. He spent the rest of his life standing on street corners, traveling around the world, and inviting everyone he met to look at the stars. As Timothy Ferris wrote in Seeing in the Dark, it was these low-cost tools combined with the networking enabled by the internet that has fueled the renewed momentum for amateur astronomy. Photo of John Dobson by Julie Michelle Today we’re seeing this powerful trend emerge in dozens of other disciplines. Every component of that formula — tools, standards, and connectivity — are each, by themselves, going through a renaissance. The most important change is in tools. The rise of the Maker Movement — a collection of new digital fabrication tools (like desktop 3D printers), a thriving archipelago of makerspaces, and the popularity of online design-sharing communities — has sped up the pace of prototyping and lowered the barriers to small-batch manufacturing. What used to take an entire company’s R&D budget can now be achieved by two friends in a garage. We didn’t have any money when we started OpenROV, but we did have access to TechShop in San Francisco, where we used a laser cutter to prototype the initial underwater robot design. This would have been impossible just a few years earlier. Another effect of the Maker Movement has been Lego-ization of the smart phone — a side effect of their mass production, and the economies of scale that enables. There has been a proliferation of low-cost, modular computing devices like Arduino and Raspberry Pi as well as cheap, affordable sensors (accelerometers, gyroscopes, magnetometers, GPS, temperature, etc). Chris Anderson calls this the peace dividend of the smartphone wars. These have become the building blocks for a new generation of connected devices. It’s the same forces putting computers and sensors on our wrists and in our thermostats. It’s happening in the natural world, too, but we haven’t stopped to give it a catchy name like “Wearables” or the “Internet of Things.” Personally, I like Wildtech. The Dissemination Lab in Madagacar The tools for scientific research and exploration are especially ripe for this maker-style disruption. For the past half century, the key drivers of the market have been low volumes — limited to labs and research institutions — and high margins. Because the labs pay for the equipment out of grants and endowments, they have little regard for the large markups, especially when their research institution receives a direct percentage of that grant as indirect overhead. All the players in this game — the manufacturers, researchers, and institutions — have little reason to complain. It’s the Scientific Industrial Complex. But here come the makers, building tools for themselves and for each other. It’s a textbook case of what Clayton Christensen, in his book The Innovator’s Dilemma, calls a disruptive innovation, the process of technological evolution where a new design or business model breaks up the existing state of affairs by opening up the market to new and different customers. Global, Open & Resilient The maker-style science and exploration tools don’t pander to the nuanced needs of researchers. The goals are broad participation. These projects become economically feasible and profitable at higher volumes, as opposed to the higher margins associated with the traditional research tools. But it’s also ideological. There’s a sense of purpose among these projects that permeates the business plans and organizational structures: the process of discovery and the pursuit of curiosity should be available to everyone. This radical inclusion has a number of important spillover effects. The first is that these projects are born global. With OpenROV, our forums and discussions have always been an international collaboration. Some of our most important contributors lived halfway around the world, and we never met them face-to-face until many years into working together. We’ve shipped ROVs to almost every country, and have seen homebuilt versions of our design in even more surprising corners of the globe. All of these projects are built on a foundation of openness. Influenced and built by open source software and open hardware scaffolding, the same methodology is being applied to the science itself. It’s meta-level bricklaying. The best example is the Cubesat standard. Throughout the 1990s, there had been discussions at NASA and elsewhere about finding ways to reduce the cost of space science, but it took the enterprising of two professors to bring the idea to life. Bob Twiggs, a professor at Stanford, and Jordi Puig-Suari, a professor at California Polytechnic State University-San Luis Obispo dreamed up the Cubesat idea as a way to get smaller, cheaper satellites into space. The backbone of the idea was the the philosophy of standardization. In 2000, they published a 10 page document that outlined the basics: the size (a 10cm x 10cm x 10cm cube), the weight (less than a kilogram) and some ideas for framing, electronics and power. As explained, the Cubesats could be rigged with whatever experiment their makers could imagine, as long as they fit into those defined boundaries. Given the exorbitant costs of rocket launches, they knew that the only way to get these experiments into space would be on the coattails of larger operations, so he created a specially designed orbital deployer as a way to piggyback on those launches. That was in 2003. Since that time, the CubeSat phenomenon has exploded. It’s given rise to an entire industry as well as an entirely new genre of space science, from the Lightsail, which is prototyping a novel method of solar sailing, to the Firefly, which measures gamma-ray flashes coming from Earth’s atmosphere. Radical collaboration is pushing maker-style citizen science ahead at an increasing rate. It’s becoming cheaper and faster to build on top of these open standards, which broadens the scope of what can be attempted, because so much more can be done with less. More importantly, this model of science is broadening the scope of who can take part — mainly a function of falling costs. The tools for prototyping and question-asking are becoming more reasonable, and the open standards mean there are foundations to build on. But the real story of expanded participation has to do with connected enthusiasm. Over the past few years, a new digital layer of connection has allowed enthusiasts to forge new bonds. The importance of community building was also pioneered by amateur astronomers and birders. The astronomers have long held star parties to get together and share tips and techniques. Birders come together for annual events like the Christmas Bird Count. The culture that emerges around these groups has always been an important glue for turning interest into networked science and discovery. Collectively, the group knows more than any one individual, and the internet enables this to happen at scale. Citizen scientists are using all the tools available — social media, apps, mapping software, and Kickstarter — to find each other and share ideas. By digitizing the community effort, they’ve been able to do more, faster. People are now logging on to websites like Zooniverse and helping to identify galaxies and gravitational lenses. Non-astronomy disciplines are also getting in on the action. Zooniverse now runs projects based on everything from from identifying plankton to studying the collective intelligence of Wildebeest. Tools like OpenStreetMap and MapBox are allowing groups to quickly create knowledge maps of sightings and environmental data. But perhaps the most exciting congregation of amateur science enthusiasm is on crowdfunding sites, like Kickstarter and Experiment. Projects like Rainforest Connection and Open qPCR all found support and just enough funding to get off the ground. NSF grants require that you have a PhD and an affiliate institution. Kickstarter projects just need a community. Mass Participation > Mass Communication The impacts of these trends are just starting to be recognized: perhaps the tipping point was last year’s White House ceremony on citizen science and crowdsourcing. Wherever this goes, we already know the importance goes far beyond just data collection. The true potential is the reimagining of science communication and engagement, and turning citizen science into civic action. This is the largest and most hopeful part of the citizen science story: the sense of agency. For too long, science has been isolated in the ivory towers of academic institutions, only accessible to a few. This is a new way forward that invites everyone to explore, get involved and take responsibility: each of us a critical node in the new planetary nervous system. David Lang is co-founder of OpenROV and a 2013 Ted Fellow. ", "title": "Technology Gone Wild", "sentences": [{"6395": "Technology Gone Wild"}, {"dbbe": "How cheap sensors, ubiquitous computing, and networks of enthusiastic amateurs are building a new planetary nervous system"}, {"c4d1": "Migratory patterns of Western Meadowlarks (via eBird)"}, {"f5a7": "Birding — the amateur pursuit of watching and monitoring bird populations — is a big deal. The numbers back it up. The U.S. Fish and Wildlife Service puts the number of “wildlife watchers” in the country over 20 million. They estimate the industry is larger than $50 billion. But there is more to the story than legions of spotting scope-equipped, L.L. Bean-wearing retirees moving through national parks and recreation areas. Like everyone else, the birders are now wired up."}, {"fd47": "In addition to notebooks and life lists, birders are now using apps and centralized databases like eBird and iNaturalist to quantify their work. This data is becoming the backbone for important ornithology work (even though it often doesn’t receive any credit). By turning digital, researchers have been able to turn to statisticians and computer scientists to add quality control filters to the data, as well as tweak the interfaces to encourage more participation from ever growing number and diversity of people. They’ve also been able create beautiful visualizations, like this real-time map of submissions."}, {"1445": "The birders are just the tip of the iceberg — a small sliver of a much bigger trend emerging around amateur science. Networks of makers are creating tools to explore, monitor, and understand our planet in an entirely new way."}, {"2587": "The pace of innovation is staggering. There have been very public success stories, like the use of drones for conservation or the development of small satellites for continuous Earth imaging. These are more than just clever hacks. Each one adds a new tool to the toolbox of the growing army of citizen scientists around the world. These people — passionate networks of amateur and professional scientists — are busy wiring up the natural world with every sensor they can get their hands on. To paraphrase the ideas of Planet Labs CEO Will Marshall, these are the neurons of a new planetary nervous system."}, {"4d86": "Planet Labs doves in space. Credit: NASA"}, {"0351": "I’ve had a front row seat to this emerging phenomenon. In 2012, my friend Eric Stackpole and I started the OpenROV project in his garage in Cupertino. We wanted a low-cost underwater drone to explore a submerged cave, and the commercial alternatives were far beyond our price range. In the years since, our idea has grown from just a few people working in a garage to a global community of thousands of professional and amateur ocean explorers, and evolved from a small project into a company that’s building cutting-edge tools. Our latest project, the OpenROV Trident, raised over $800,000 on Kickstarter last October. The community of users have used the devices for everything from finding shipwrecks in Southern California to discovering a previously unknown fluorescent quality of a clam in the Cook Islands."}, {"5140": "The OpenROV Trident"}, {"150c": "A New Era of Citizen Science"}, {"4a7f": "The idea of amateur science isn’t new. In fact, a few disciplines have been pioneering this approach for decades. Astronomy and ornithology both have a long track record of including the work of non-professionals in their research. In both cases, the formula is simple:"}, {"da05": "Low-Cost Tools + Open Standards + Connected Enthusiasm"}, {"20a4": "In the case of astronomy, one of the main drivers of the recent boom was the development of the Dobsonian telescope. In the 1960s, John Dobson — a monk in San Francisco — contributed an entirely novel way to mount larger lenses using whatever materials happened to be lying around. He never patented his design, but instead set about teaching anyone and everyone the methods and joy of constructing their own telescope. He spent the rest of his life standing on street corners, traveling around the world, and inviting everyone he met to look at the stars. As Timothy Ferris wrote in Seeing in the Dark, it was these low-cost tools combined with the networking enabled by the internet that has fueled the renewed momentum for amateur astronomy."}, {"fac2": "Photo of John Dobson by Julie Michelle"}, {"1a74": "Today we’re seeing this powerful trend emerge in dozens of other disciplines. Every component of that formula — tools, standards, and connectivity — are each, by themselves, going through a renaissance."}, {"d865": "The most important change is in tools. The rise of the Maker Movement — a collection of new digital fabrication tools (like desktop 3D printers), a thriving archipelago of makerspaces, and the popularity of online design-sharing communities — has sped up the pace of prototyping and lowered the barriers to small-batch manufacturing. What used to take an entire company’s R&D budget can now be achieved by two friends in a garage. We didn’t have any money when we started OpenROV, but we did have access to TechShop in San Francisco, where we used a laser cutter to prototype the initial underwater robot design. This would have been impossible just a few years earlier."}, {"a0ac": "Another effect of the Maker Movement has been Lego-ization of the smart phone — a side effect of their mass production, and the economies of scale that enables. There has been a proliferation of low-cost, modular computing devices like Arduino and Raspberry Pi as well as cheap, affordable sensors (accelerometers, gyroscopes, magnetometers, GPS, temperature, etc). Chris Anderson calls this the peace dividend of the smartphone wars. These have become the building blocks for a new generation of connected devices. It’s the same forces putting computers and sensors on our wrists and in our thermostats. It’s happening in the natural world, too, but we haven’t stopped to give it a catchy name like “Wearables” or the “Internet of Things.” Personally, I like Wildtech."}, {"c827": "The Dissemination Lab in Madagacar"}, {"4d71": "The tools for scientific research and exploration are especially ripe for this maker-style disruption. For the past half century, the key drivers of the market have been low volumes — limited to labs and research institutions — and high margins. Because the labs pay for the equipment out of grants and endowments, they have little regard for the large markups, especially when their research institution receives a direct percentage of that grant as indirect overhead. All the players in this game — the manufacturers, researchers, and institutions — have little reason to complain. It’s the Scientific Industrial Complex."}, {"1254": "But here come the makers, building tools for themselves and for each other. It’s a textbook case of what Clayton Christensen, in his book The Innovator’s Dilemma, calls a disruptive innovation, the process of technological evolution where a new design or business model breaks up the existing state of affairs by opening up the market to new and different customers."}, {"eade": "Global, Open & Resilient"}, {"e0b3": "The maker-style science and exploration tools don’t pander to the nuanced needs of researchers. The goals are broad participation. These projects become economically feasible and profitable at higher volumes, as opposed to the higher margins associated with the traditional research tools. But it’s also ideological. There’s a sense of purpose among these projects that permeates the business plans and organizational structures: the process of discovery and the pursuit of curiosity should be available to everyone."}, {"bf87": "This radical inclusion has a number of important spillover effects. The first is that these projects are born global. With OpenROV, our forums and discussions have always been an international collaboration. Some of our most important contributors lived halfway around the world, and we never met them face-to-face until many years into working together. We’ve shipped ROVs to almost every country, and have seen homebuilt versions of our design in even more surprising corners of the globe."}, {"73d3": "All of these projects are built on a foundation of openness. Influenced and built by open source software and open hardware scaffolding, the same methodology is being applied to the science itself. It’s meta-level bricklaying. The best example is the Cubesat standard. Throughout the 1990s, there had been discussions at NASA and elsewhere about finding ways to reduce the cost of space science, but it took the enterprising of two professors to bring the idea to life. Bob Twiggs, a professor at Stanford, and Jordi Puig-Suari, a professor at California Polytechnic State University-San Luis Obispo dreamed up the Cubesat idea as a way to get smaller, cheaper satellites into space. The backbone of the idea was the the philosophy of standardization. In 2000, they published a 10 page document that outlined the basics: the size (a 10cm x 10cm x 10cm cube), the weight (less than a kilogram) and some ideas for framing, electronics and power. As explained, the Cubesats could be rigged with whatever experiment their makers could imagine, as long as they fit into those defined boundaries."}, {"1591": "Given the exorbitant costs of rocket launches, they knew that the only way to get these experiments into space would be on the coattails of larger operations, so he created a specially designed orbital deployer as a way to piggyback on those launches. That was in 2003. Since that time, the CubeSat phenomenon has exploded. It’s given rise to an entire industry as well as an entirely new genre of space science, from the Lightsail, which is prototyping a novel method of solar sailing, to the Firefly, which measures gamma-ray flashes coming from Earth’s atmosphere."}, {"ab5b": "Radical collaboration is pushing maker-style citizen science ahead at an increasing rate. It’s becoming cheaper and faster to build on top of these open standards, which broadens the scope of what can be attempted, because so much more can be done with less."}, {"7852": "More importantly, this model of science is broadening the scope of who can take part — mainly a function of falling costs. The tools for prototyping and question-asking are becoming more reasonable, and the open standards mean there are foundations to build on. But the real story of expanded participation has to do with connected enthusiasm."}, {"bf45": "Over the past few years, a new digital layer of connection has allowed enthusiasts to forge new bonds. The importance of community building was also pioneered by amateur astronomers and birders. The astronomers have long held star parties to get together and share tips and techniques. Birders come together for annual events like the Christmas Bird Count. The culture that emerges around these groups has always been an important glue for turning interest into networked science and discovery. Collectively, the group knows more than any one individual, and the internet enables this to happen at scale."}, {"80e9": "Citizen scientists are using all the tools available — social media, apps, mapping software, and Kickstarter — to find each other and share ideas. By digitizing the community effort, they’ve been able to do more, faster. People are now logging on to websites like Zooniverse and helping to identify galaxies and gravitational lenses. Non-astronomy disciplines are also getting in on the action. Zooniverse now runs projects based on everything from from identifying plankton to studying the collective intelligence of Wildebeest. Tools like OpenStreetMap and MapBox are allowing groups to quickly create knowledge maps of sightings and environmental data. But perhaps the most exciting congregation of amateur science enthusiasm is on crowdfunding sites, like Kickstarter and Experiment. Projects like Rainforest Connection and Open qPCR all found support and just enough funding to get off the ground. NSF grants require that you have a PhD and an affiliate institution. Kickstarter projects just need a community."}, {"a6ad": "Mass Participation > Mass Communication"}, {"0200": "The impacts of these trends are just starting to be recognized: perhaps the tipping point was last year’s White House ceremony on citizen science and crowdsourcing. Wherever this goes, we already know the importance goes far beyond just data collection. The true potential is the reimagining of science communication and engagement, and turning citizen science into civic action."}, {"e940": "This is the largest and most hopeful part of the citizen science story: the sense of agency. For too long, science has been isolated in the ivory towers of academic institutions, only accessible to a few. This is a new way forward that invites everyone to explore, get involved and take responsibility: each of us a critical node in the new planetary nervous system."}, {"cb22": "David Lang is co-founder of OpenROV and a 2013 Ted Fellow."}], "child": "444_1\t444_2\t444_3"}