{"name": "445", "parent": "", "content": "Rendering of what Chicago’s sensory array system might look like. Courtesy UChicago’s Urban Center for Computation and Data. How Chicago Got Smart About Sensors The Array of Things will be the central nervous system of cities. Without invading your privacy. I’ve been excited about the Array of Things — a network of beautifully-designed sensors poised to capture and make public real-time, non-personal data about the livability of a city — ever since it (they?) started following me on Twitter in June 2014. A sensor network with a personality and a public service mission — what more could a responsive city want? I was happy to let it follow me, and followed it back so I could read its tweets. This month, the Array of Things moved several giant steps closer to becoming a crucial general-purpose, worldwide sensor data infrastructure for researchers and policymakers. New money from the National Science Foundation is coming in, new collaborators from around the world are learning about it, and 50 devices will be installed on the streets of Chicago in early 2016, with hundreds more to be added in the years to come. Most importantly, the leaders of the initiative (the City of Chicago and the University of Chicago’s Urban Center for Computation and Data) are committed to openness and public consultation — which means the Array of Things initiative will continue to thrive. Meet the Array of Things: Courtesy UChicago’s Urban Center for Computation and Data. Courtesy U Chicago’s Urban Center for Computation and Data. It’s a board on which sensors have been mounted that can measure things that affect life in a city: climate, air quality, light, vibration, numbers of pedestrians or cars passing the node, climate, and ambient noise. The board also provides room for a computer, a communication device, and a power control device. Every one of these things — sensors and other elements of the overall system — can be swapped in or out as needed. Nothing hard-wired or glued together to prevent maintenance (compare this to your smartphone). The shield protecting the devices, the overall skin for each board, has been designed by the School of the Art Institute of Chicago. So these sensor clusters will be eye-catching, attractive structures suited for urban landscapes. Each node will be mounted on a pole (or building) and connected to a power source and a connection to the Internet. Think of it as a city fitness tracker, continuously measuring the block-by-block physical environment of a city. The recent award of $3 million in NSF funding — announced at a White House summit last week — will cover the engineering and software development needed to deploy 500 of these devices throughout Chicago by the end of 2017. Next month, three prototypes will be created from which the project leaders and City partners will choose the version that best balances aesthetics and functionality with ease of installation. The electronics involved need to be protected from harsh weather while simultaneously being exposed enough to measure what they’re supposed to. And here’s a cheer for the Smart Chicago Collaborative, a civic organization focused on improving lives in Chicago through technology, that will be working with this initiative to, as Executive Director Daniel O’Neil puts it, “consider the general public’s use cases for the network and creating applications relevant to everyday life in Chicago.” Smart Chicago, O’Neil says, will ensure that the “voice of residents [is heard] in the development of the AoT platform through convenings and other modes of communication [and] collaboration.” That’s extraordinarily important; responsive cities listen to what communities want. What happens first in Chicago may well affect many of us. Earlier this month, ninety people from fifteen cities, mostly employed by research entities that already have strong relationships with their own city halls, came to Chicago to learn about the Array of Things and dream about the projects they’d like to do using deployed sensors. (The localities included American cities Seattle, Portland, San Francisco, Dallas, Atlanta, Pittsburgh, New York City, and Winter Park, FL; UK cities Bristol, Glasgow, and Newcastle; as well as Amsterdam. Mexico City, and Eindhoven in Norway.) Representatives from about a dozen cities said they’d like to deploy a few, and the University of Chicago initiative leaders got support from the UChicago Innovation Fund to build devices for purposes of loaning them out, license-free, to nonprofits or universities elsewhere. The other cities can then help with evaluation and troubleshooting of these new systems, lending their engineering expertise to the Chicago team. As Charlie Catlett, the director of UChicago’s Urban Center for Computation and Data, and a senior computer scientist at Argonne National Lab, puts it, “What we were trying to do with this workshop was create a sustainable community. Among the shared values of that community is the idea that the real benefit of this data is best achieved by making it public and free.” This is the breathtaking, crucial, central element of the Array of Things mindset: the whole thing is aimed at creating a repository of public, free, real-time data in a single place. All the devices are set to communicate only with the Chicago researchers. No outsider can initiate a connection to one of these nodes. When the device connects to the central location in Chicago — at Argonne National Lab — it drops its data there, receives an acknowledgement that the data was received, and then deletes the data from its own local storage place. The City of Chicago, in turn, will take a feed of data from Argonne and pull it into its own open data portal. Presto: data is available to the city it came from, any other city can compare its data to the Chicago-stored data, and everyone’s learning — without having to pay a company for an elaborate proprietary system. (Carnegie-Mellon and Georgia Tech are already testing sensor devices, and the Chicago workshop also focused on ensuring that data from those sensors is available in Chicago in standardized form — accompanied by latitude and longitude information, for example, and using a consistent form of time-stamping.) Here’s another amazing, all-important element of this Chicago story: personal privacy is front and center for the city and its collaborators at the University of Chicago and around the world, as both a matter of substance and process. Courtesy UChicago’s Urban Center for Computation and Data. First, substance. The Array of Things is not counting MAC addresses on smartphones. Too personal. One of the sensors is a camera, but there’s a processor inside each Array of Things device that will use the camera’s images to count the numbers of pedestrians, bicycles, and cars that have passed by. Once that’s done, the system will discard the image. As Catlett explains, “The image from the camera never gets stored or transmitted.” Only the counts leave the device. Similarly, identifiable sound data will be processed within the node and discarded — all that gets transmitted out is the numerical level of ambient noise the sensor is picking up. This initiative is about monitoring the city’s environment and activity, not individuals. Second, process. The City of Chicago, through its Chief Information Officer, Brenna Berman, has the deciding vote on a committee (co-chaired by Catlett) that is tasked with deciding whether particular new sensors are appropriate for the Array. That governance board, in turn, is advised by a technically-adept, independent cybersecurity and privacy advisory board chaired by Von Welch, director of Indiana University’s Center for Applied Cybersecurity Research and Kevin Moran, chief technology officer for the City of Chicago. So, for example, if someone wants to add a 3D hologram art installation to the capabilities of the Array of Things, a description of the data privacy implications of that idea will be reviewed by the external committee — who will then help the governance board decide whether the risk of the new sensor is appropriate. Before deploying the first devices on its streets, the City will put proposed privacy policy principles out for public comment. Just imagine the possibilities. Sensors monitoring air quality, sound and vibration (to detect heavy vehicle traffic), and temperature can be used to suggest the healthiest and unhealthiest walking times and routes through the city, to take a hard look for standing water or flooding, or to study the relationship between diseases and the urban environment. For example, some parts of the west side of Chicago have a much higher incidence of asthma than other parts of the city. If the city had more facts about air quality on the west side, block-by-block, it could work on deploying green spaces where they are most needed. And with data from other cities available for comparison, Chicago (“The Great American City” — or so it tells New York City) can measure itself against the rest. Improving walkability and transport; facilitating nuanced urban design aimed at mitigating heat islands; block-by-block correlation of air quality and noise with disease; unanticipated, innovative uses of fine-grained data built by outside parties using open Array of Things data — we expect great things from the Array of Things, all based on the values of openness and public consultation that have animated the project from the beginning. Including more Tweeting. Follow Backchannel: Twitter | Facebook ", "title": "How Chicago Got Smart About Sensors", "sentences": [{"fb98": "Rendering of what Chicago’s sensory array system might look like. Courtesy UChicago’s Urban Center for Computation and Data."}, {"ebe5": "How Chicago Got Smart About Sensors"}, {"d041": "The Array of Things will be the central nervous system of cities. Without invading your privacy."}, {"6fa7": "I’ve been excited about the Array of Things — a network of beautifully-designed sensors poised to capture and make public real-time, non-personal data about the livability of a city — ever since it (they?) started following me on Twitter in June 2014. A sensor network with a personality and a public service mission — what more could a responsive city want? I was happy to let it follow me, and followed it back so I could read its tweets."}, {"e44b": "This month, the Array of Things moved several giant steps closer to becoming a crucial general-purpose, worldwide sensor data infrastructure for researchers and policymakers. New money from the National Science Foundation is coming in, new collaborators from around the world are learning about it, and 50 devices will be installed on the streets of Chicago in early 2016, with hundreds more to be added in the years to come. Most importantly, the leaders of the initiative (the City of Chicago and the University of Chicago’s Urban Center for Computation and Data) are committed to openness and public consultation — which means the Array of Things initiative will continue to thrive."}, {"af44": "Meet the Array of Things:"}, {"16b1": "Courtesy UChicago’s Urban Center for Computation and Data."}, {"2606": "Courtesy U Chicago’s Urban Center for Computation and Data. It’s a board on which sensors have been mounted that can measure things that affect life in a city: climate, air quality, light, vibration, numbers of pedestrians or cars passing the node, climate, and ambient noise. The board also provides room for a computer, a communication device, and a power control device. Every one of these things — sensors and other elements of the overall system — can be swapped in or out as needed. Nothing hard-wired or glued together to prevent maintenance (compare this to your smartphone). The shield protecting the devices, the overall skin for each board, has been designed by the School of the Art Institute of Chicago. So these sensor clusters will be eye-catching, attractive structures suited for urban landscapes."}, {"2acc": "Each node will be mounted on a pole (or building) and connected to a power source and a connection to the Internet. Think of it as a city fitness tracker, continuously measuring the block-by-block physical environment of a city."}, {"361e": "The recent award of $3 million in NSF funding — announced at a White House summit last week — will cover the engineering and software development needed to deploy 500 of these devices throughout Chicago by the end of 2017. Next month, three prototypes will be created from which the project leaders and City partners will choose the version that best balances aesthetics and functionality with ease of installation. The electronics involved need to be protected from harsh weather while simultaneously being exposed enough to measure what they’re supposed to."}, {"80aa": "And here’s a cheer for the Smart Chicago Collaborative, a civic organization focused on improving lives in Chicago through technology, that will be working with this initiative to, as Executive Director Daniel O’Neil puts it, “consider the general public’s use cases for the network and creating applications relevant to everyday life in Chicago.” Smart Chicago, O’Neil says, will ensure that the “voice of residents [is heard] in the development of the AoT platform through convenings and other modes of communication [and] collaboration.” That’s extraordinarily important; responsive cities listen to what communities want."}, {"d3ee": "What happens first in Chicago may well affect many of us. Earlier this month, ninety people from fifteen cities, mostly employed by research entities that already have strong relationships with their own city halls, came to Chicago to learn about the Array of Things and dream about the projects they’d like to do using deployed sensors. (The localities included American cities Seattle, Portland, San Francisco, Dallas, Atlanta, Pittsburgh, New York City, and Winter Park, FL; UK cities Bristol, Glasgow, and Newcastle; as well as Amsterdam. Mexico City, and Eindhoven in Norway.) Representatives from about a dozen cities said they’d like to deploy a few, and the University of Chicago initiative leaders got support from the UChicago Innovation Fund to build devices for purposes of loaning them out, license-free, to nonprofits or universities elsewhere. The other cities can then help with evaluation and troubleshooting of these new systems, lending their engineering expertise to the Chicago team."}, {"8e17": "As Charlie Catlett, the director of UChicago’s Urban Center for Computation and Data, and a senior computer scientist at Argonne National Lab, puts it, “What we were trying to do with this workshop was create a sustainable community. Among the shared values of that community is the idea that the real benefit of this data is best achieved by making it public and free.”"}, {"a5c0": "This is the breathtaking, crucial, central element of the Array of Things mindset: the whole thing is aimed at creating a repository of public, free, real-time data in a single place. All the devices are set to communicate only with the Chicago researchers. No outsider can initiate a connection to one of these nodes. When the device connects to the central location in Chicago — at Argonne National Lab — it drops its data there, receives an acknowledgement that the data was received, and then deletes the data from its own local storage place. The City of Chicago, in turn, will take a feed of data from Argonne and pull it into its own open data portal."}, {"9230": "Presto: data is available to the city it came from, any other city can compare its data to the Chicago-stored data, and everyone’s learning — without having to pay a company for an elaborate proprietary system. (Carnegie-Mellon and Georgia Tech are already testing sensor devices, and the Chicago workshop also focused on ensuring that data from those sensors is available in Chicago in standardized form — accompanied by latitude and longitude information, for example, and using a consistent form of time-stamping.)"}, {"17b7": "Here’s another amazing, all-important element of this Chicago story: personal privacy is front and center for the city and its collaborators at the University of Chicago and around the world, as both a matter of substance and process."}, {"fe2e": "Courtesy UChicago’s Urban Center for Computation and Data."}, {"62da": "First, substance. The Array of Things is not counting MAC addresses on smartphones. Too personal. One of the sensors is a camera, but there’s a processor inside each Array of Things device that will use the camera’s images to count the numbers of pedestrians, bicycles, and cars that have passed by. Once that’s done, the system will discard the image. As Catlett explains, “The image from the camera never gets stored or transmitted.” Only the counts leave the device. Similarly, identifiable sound data will be processed within the node and discarded — all that gets transmitted out is the numerical level of ambient noise the sensor is picking up. This initiative is about monitoring the city’s environment and activity, not individuals."}, {"1c32": "Second, process. The City of Chicago, through its Chief Information Officer, Brenna Berman, has the deciding vote on a committee (co-chaired by Catlett) that is tasked with deciding whether particular new sensors are appropriate for the Array. That governance board, in turn, is advised by a technically-adept, independent cybersecurity and privacy advisory board chaired by Von Welch, director of Indiana University’s Center for Applied Cybersecurity Research and Kevin Moran, chief technology officer for the City of Chicago."}, {"04b9": "So, for example, if someone wants to add a 3D hologram art installation to the capabilities of the Array of Things, a description of the data privacy implications of that idea will be reviewed by the external committee — who will then help the governance board decide whether the risk of the new sensor is appropriate. Before deploying the first devices on its streets, the City will put proposed privacy policy principles out for public comment."}, {"e4ae": "Just imagine the possibilities. Sensors monitoring air quality, sound and vibration (to detect heavy vehicle traffic), and temperature can be used to suggest the healthiest and unhealthiest walking times and routes through the city, to take a hard look for standing water or flooding, or to study the relationship between diseases and the urban environment."}, {"40ac": "For example, some parts of the west side of Chicago have a much higher incidence of asthma than other parts of the city. If the city had more facts about air quality on the west side, block-by-block, it could work on deploying green spaces where they are most needed. And with data from other cities available for comparison, Chicago (“The Great American City” — or so it tells New York City) can measure itself against the rest."}, {"de85": "Improving walkability and transport; facilitating nuanced urban design aimed at mitigating heat islands; block-by-block correlation of air quality and noise with disease; unanticipated, innovative uses of fine-grained data built by outside parties using open Array of Things data — we expect great things from the Array of Things, all based on the values of openness and public consultation that have animated the project from the beginning."}, {"3a0f": "Including more Tweeting."}, {"833b": "Follow Backchannel: Twitter | Facebook"}], "child": "445_1\t445_2\t445_3"}