{"name": "447", "parent": "", "content": "Make sense of Kalman Filter This material is made available from the the knowledge I gained under Udacity’s Self Driving Car Program. Special thanks to Sebastian Thrun and Mercedes Benz Engineers for lectures. Source: https://www.codeproject.com/Articles/865935/Object-Tracking-Kalman-Filter-with-Ease What is Kalman Filter? Long answer: check out this Wikipedia link. Want to study about it? This link. My (short & more normal user friendly) answer: - To predict position and velocity with some uncertainty. - Then measure the experimental position and velocity with some uncertainty.- Finally, increase the certainty of our prediction by combining our prediction with the measurement information. Curious part 1: Why must we predict then measure and update? Indeed. In the first look, it seems like the process is kinda abundant. What is the point of making all the prediction then coming around to measure the thing we just predicted? Can’t life be more simple by just jumping straight into measurement? Life would be so much simple that way. However, I must ask you something before I reveal the secret of why. Imaging you are driving on the road, mind your own business and try to stay steady with 30 mph. Then, someone on your right lane gives signal to move over your lane. Since you are nice person (with a beautiful soul), you are okay with it. Without talking about anything technical here, what do you do in such situation so the person can get in front of you safely? If that was me, I could use 2 seconds to do a whole observation of where the car is & what kind of speed it is going relative to my speed. My instinct can give a prediction what it’s about to do next. That way, I can either slow down to give way or increase the speed to get out of the way. Depends on where my car and the other car are, I would act according to my best judgement to let the other car moves over without causing any accident. Assume the car makes the lane change successfully to get in front of me, I still continuously observe the car and adjust my speed so my car can always stay in the safe zone. If the car goes slow, I predict the car will still be slow in the next seconds and I’ll stay at a slow speed behind it. However, if it suddenly goes fast, I can speed up a little bit (as long as under speed limit) and update my belief. What I did there is a continuous process of prediction and update. So, if you follow my example, I think I already gave you the logic behind Kalman Filter. But Kalman Filter is not found to apply on human (or is it?>:), it has been used for various engineering applications on machines because machine doesn’t have the ability to make logical thinking to act according to the environmental changes like human or animals. Curious part 2: Why do we combine prediction and measurement? Isn’t measurement itself accurate enough for update? Again. It makes sense to think using sensors information alone for the update is a right way to go. However, measurements can also have uncertainty (Wait…what???). For example, Lidar is used to detect locations and it is located outside of the car, there can be environmental effects (rain, fog, dirt,etc) which make the measurements less certain. It is a good practice to not trust one side blindly, there is always room for uncertainty somewhere. By combining information, we have more information to lower the uncertainty/covariance and to give a more reliable final output. Conclusion Sensors are like our eyes, nose, ears. They sense things and send back information to the brain to process. For self driving car, we have camera, lidar and radar. Camera obtains images so that Deep Learning can recognize objects and even predict information. Lidar and radar sense speed and location so that the machine can make the decision to move accordingly per Kalman Filter application. *Hope you enjoy this short read. If you like what you read, please hit ❤ to share. I appreciate any feedback. Until next time!* ", "title": "Make sense of Kalman Filter", "sentences": [{"1e27": "Make sense of Kalman Filter"}, {"5d77": "This material is made available from the the knowledge I gained under Udacity’s Self Driving Car Program. Special thanks to Sebastian Thrun and Mercedes Benz Engineers for lectures."}, {"8ab8": "Source: https://www.codeproject.com/Articles/865935/Object-Tracking-Kalman-Filter-with-Ease"}, {"a9d4": "What is Kalman Filter?"}, {"4242": "Long answer: check out this Wikipedia link. Want to study about it? This link."}, {"3126": "My (short & more normal user friendly) answer: - To predict position and velocity with some uncertainty. - Then measure the experimental position and velocity with some uncertainty.- Finally, increase the certainty of our prediction by combining our prediction with the measurement information."}, {"b4a6": "Curious part 1: Why must we predict then measure and update?"}, {"7d3b": "Indeed. In the first look, it seems like the process is kinda abundant. What is the point of making all the prediction then coming around to measure the thing we just predicted? Can’t life be more simple by just jumping straight into measurement?"}, {"fc79": "Life would be so much simple that way. However, I must ask you something before I reveal the secret of why."}, {"4e10": "Imaging you are driving on the road, mind your own business and try to stay steady with 30 mph. Then, someone on your right lane gives signal to move over your lane. Since you are nice person (with a beautiful soul), you are okay with it. Without talking about anything technical here, what do you do in such situation so the person can get in front of you safely?"}, {"8927": "If that was me, I could use 2 seconds to do a whole observation of where the car is & what kind of speed it is going relative to my speed. My instinct can give a prediction what it’s about to do next. That way, I can either slow down to give way or increase the speed to get out of the way. Depends on where my car and the other car are, I would act according to my best judgement to let the other car moves over without causing any accident."}, {"b34f": "Assume the car makes the lane change successfully to get in front of me, I still continuously observe the car and adjust my speed so my car can always stay in the safe zone. If the car goes slow, I predict the car will still be slow in the next seconds and I’ll stay at a slow speed behind it. However, if it suddenly goes fast, I can speed up a little bit (as long as under speed limit) and update my belief. What I did there is a continuous process of prediction and update."}, {"c95b": "So, if you follow my example, I think I already gave you the logic behind Kalman Filter. But Kalman Filter is not found to apply on human (or is it?>:), it has been used for various engineering applications on machines because machine doesn’t have the ability to make logical thinking to act according to the environmental changes like human or animals."}, {"acb5": "Curious part 2: Why do we combine prediction and measurement? Isn’t measurement itself accurate enough for update?"}, {"a200": "Again. It makes sense to think using sensors information alone for the update is a right way to go. However, measurements can also have uncertainty (Wait…what???). For example, Lidar is used to detect locations and it is located outside of the car, there can be environmental effects (rain, fog, dirt,etc) which make the measurements less certain."}, {"006e": "It is a good practice to not trust one side blindly, there is always room for uncertainty somewhere. By combining information, we have more information to lower the uncertainty/covariance and to give a more reliable final output."}, {"bfd7": "Conclusion"}, {"ed0b": "Sensors are like our eyes, nose, ears. They sense things and send back information to the brain to process. For self driving car, we have camera, lidar and radar. Camera obtains images so that Deep Learning can recognize objects and even predict information. Lidar and radar sense speed and location so that the machine can make the decision to move accordingly per Kalman Filter application."}, {"b5b0": "*Hope you enjoy this short read. If you like what you read, please hit ❤ to share. I appreciate any feedback. Until next time!*"}], "child": "447_1\t447_2\t447_3\t447_4"}