{"name": "453", "parent": "", "content": "Image: Aerial view of Fukushima-Daiichi nuclear facility (NASA) Reactions: Risk, Radiation, and Remediation Lessons learned from a Safecast exploration This month marks the five-year anniversary of the Great East Japan Earthquake. On March 11, 2011, a magnitude 9.0 earthquake about 43 miles off the coast of the Oshika Peninsula generated a massive tsunami with waves at heights of 133 feet, which traveled at least 6 miles into Japan. More than 15,000 people lost their lives; thousands more suffered casualties. The tsunami waves also caused extensive damage to the reactors of the Fukushima Daiichi nuclear power facility, triggering one of the most significant nuclear disasters in recent history. Five years after the incident, radioactive release in water, air, and soil continue to be key environmental and public health concerns in the region. Because of my interest in mapping and sensors, I learned about what happened in Fukushima through the Safecast project, an organization and global community dedicated to collecting environmental radiation data with open source tools, and making that information publicly available. The project formed in direct reaction to the nuclear disaster, with the mission of providing information — making it free to access — where it was lacking. This service quickly made Safecast a go-to resource for information about radiation in Japan after the earthquake-tsunami, accessible through maps, an open API, reports, etc. on the website. Image: Map of radiation levels, Fukushima, June 2011. (Safecast.org) Image: Map of radiation levels, Fukushima, June 2015. (Safecast.org) The tool used to collect this data is an open source digital Geiger counter called the bGeigie Nano, which is capable of detecting different types of radiation (alpha, beta, gamma) and displaying levels on a screen. On top of radioactivity, the sensor also records GPS coordinates and timestamp. Individuals using the sensor to collect radiation data can also submit the data to Safecast’s online platform and contribute to a global database of radiation readings. This information then appears on various maps on the site, and becomes available through the Safecast API. Image: The Safecast bGeigie sensor. (Safecast.org) The sensor has a screen that displays radiation level readings in real time in different units. You can take readings in CPM (counts per minute) or microSieverts per hour. After the incident, the sensor was used by volunteers around the country as a risk assessment mechanism — for instance, mapping out radiation levels in areas near the nuclear reactors in order to help decide where zones of major concern were. The project Last winter, I came across one of the Safecast sensors by way of Ethan Zuckerman at MIT’s Center for Civic Media. I had just begun my masters research then and hadn’t quite narrowed down a topic yet from a broad interest in sensors, participatory science, and media. He and I chatted about different ways to use the Safecast bGeigie to collect data about radiation around MIT and different ways to visualize and represent the data. That said, neither of us was sure there was anything to find, but the exercise itself would be an experiment in how the Safecast could be used outside of the Fukushima context. The sticking point for me from our conversation, and the main reason I am writing this today, was a question Ethan had asked: “How you do talk about radiation in a way that doesn’t make people worry?” In other words, the language of nuclear energy and power (“nukespeak”) is often designed to be cryptic and decode-able by a group of few. When a disaster like Fukushima-Daiichi happens, it can be easy to associate nuclear energy and radiation with negative outcomes, eliding the fact that radiation is very much a part of other, everyday aspects of our lives, which I will discuss more in a bit. Nuclear power and radiation have complicated and violent histories, spanning uses in warfare, industrial and occupational hazards, and longstanding ideological debates about the sustainability and moral ambiguity surrounding nuclear energy. At the end of our meeting, Ethan handed me a Safecast sensor and sent me off into the world to find data, and to find a story. To be completely frank, I struggled a lot with the prompt. I read a lot of science publications about radiation, talked to various people working within this space, and tried several different approaches, which I talk about shortly. When I landed somewhere, I realized that for me, writing this piece has to be about answering this particular set of questions: (1) How might a tool like the Safecast bGeigie be used in non-emergency contexts to provide public education and transparency about the way radiation is measured? (2) How do you break down the bureaucratic and scientific jargon surrounding nuclear science in the process? The banana stance The answer might be bananas. There is something called the Banana Equivalent Dose (BED), an index used to describe radiation levels in terms of how much radiation you are exposed to by eating approximately one banana. The potassium in bananas naturally decays and consequently contributes to slight radioactivity in bananas, but this dosage is nowhere near the lethal dose of radiation. One BED is approximately 0.1 microSieverts (µSv) of radiation. Sievert is the unit used to measure ionizing radiation, the kind that is cause for concern in very high doses. One Sievert of radiation is about the equivalent of the radiation dosage from consuming 10,000,000 bananas. A lethal dose of radiation is approximately 3.5 Sieverts, or 35,000,000 bananas. Image: Lily Bui On March 28, 2011, the highest reading of radiation in Fukushima occurred at 78 microSieverts per hour. At that rate, a person would have to stand outdoors, unshielded, for 27 consecutive days in order to reach the maximum annual limit allowed for workers at a U.S. nuclear power plant — about 0.5 Sieverts or 5,000,000 bananas. But the point of this exercise isn’t so much to return to the context of disaster. Rather, it’s to illustrate where radiation occurs outside of that context, where radiation interfaces with us in our everyday lives. (Bananas just happen to be a convenient analogy.) Radiation and air travel I decided to press my luck with the TSA and brought the bGeigie with me on a flight from Massachusetts to Texas. After reading an NPR article about radiation doses during airline travel, I wanted to see for myself what those levels actually looked like. Most of the time, the types of radiation you are exposed to while flying are ultraviolent (UV) radiation and cosmic radiation, which get filtered by clouds and the atmosphere most of the time, so they don’t affect you as much at ground level. I had the bGeigie set to measure CPM (counts per minute), which measures how many radioactive electrons pass through the sensor every few seconds. One CPM is approximately 3 uSv/hr (or 0.000003 Sv/hr). I chose to use this unit on the bGeigie because it was easier to wrap my head around whole numbers instead of fractions or decimals. For me, CPM was more legible than having to constantly think about conversions from uSv to Sv. (However, I hope that your focus, dear reader, is not so much the exact numbers themselves but rather the comparative differences between them in different contexts.) While I was boarding, the bGeigie was measuring between 25 to 35 CPM in the airport terminal. When the plane took off, I watched the number increase as we ascended to higher and higher altitudes. Eventually, the readings leveled out at around 1,013 CPM at 32,000 ft. Image: Lily Bui Image: Ground-level radiation measurements between 25–35 CPM (Lily Bui) Image: Higher-altitude measurements of radiation levels around 1,013 CPM (Lily Bui) The impulsive question to ask would be, “Is this a bad thing?” In general for travelers, no. The doses are far below levels that would officially be of concern. Still, there have been recent studies and ongoing work that look at how frequent exposure might increase health risks those working in the the air travel industry. Radiation on campus Image: Nuclear reactor lab proximity to MIT’s main campus (Google Maps) On a separate occasion, I went to visit the nuclear reactor on MIT’s campus. After seeing what the radiation readings looked like on my flight, I wondered what radiation levels might look like in other everyday settings. Granted, I am fully aware that not everyone lives or works within close proximity of a nuclear reactor, but this is a relatively common experience for myself and thousands of other MIT students on campus. Not to mention, there are many different reactors within the United States near populated areas. MIT’s nuclear reactor is located about a block away from the main campus and is embedded within the fabric of other campus facilities such as the main gym and graduate student housing. Offset from the street by a few hundred feet, the facility is not something that invites a lot of attention from passersby, albeit still visible from a pedestrian standpoint. Still, hundreds — if not thousands — of people pass by it on an everyday basis, likely without a second thought to radiation levels in or around it. I requested a tour of the nuclear reactor facility. I also asked if I could take the Safecast bGeigie with me. (Fortunately, the staff said yes.) At the facility, people who go on tours, including employees, have to carry something called a dosimeter with them. These are pen-like sensors that measure your exposure to radiation, much like the bGeigie would, only in a more analog way. Someone at the front desk takes the reading on your dosimeter before you enter the facility and another once you exit. Image: Dosimeter (Wikipedia) I started taking readings with the bGeigie in the lobby and continued to take note of readings during the rest of the tour, which took us through a foyer leading deeper into the facility, to the basement, through several airlocks, and to the main fission converter where the reactor is actually located. On this particular day, the reactor was off, so I expected readings to be relatively low. The highest reading, around 1300–1400 CPM, was near the fission converter while the lowest reading was in the basement, around 30 CPM. Image: Radiation levels within MIT Nuclear Facility rooms. (Lily Bui) For me, the most fascinating moment of the tour was coming across a cupboard full of — for lack of a better term — very radioactive things. Among them were naturally radioactive materials, like copper uranyl phosphate and radium oxide, as well as consumer goods that were also radioactive, like Fiesta dinnerware, radium-coated watches, and Coleman lantern mantles used for camping. Image: Radiation levels of items in cupboard of radioactive things. (Lily Bui) Observing the relative levels of radiation in naturally occurring and everyday objects in this cupboard provided some perspective. This experience as well as that of bringing the bGeigie on an airplane gave me measurements to compare against the levels of radiation reported in news coverage about Fukushima and also enunciated the point that radiation occurs in contexts other than catastrophes and nuclear fallouts. Nevertheless, radiation remains a tricky — and very risky — subject to frame. Underemphasize its impact and you can put human lives at risk; overemphasize it and the information can lose meaning through multiple channels of delivery. Remediation In my own research about radiation, particularly within the context of the Fukushima-Daiichi incident, and from the perspective of a non-scientist, I have sifted through a whole lot of information (science publications, newspaper articles, policy reports, personal anecdotes, etc.) that has been challenging to decode and synthesize. This has had two conflicting effects: on one hand, I have grown to appreciate the fact that this information exists in the world. On the other hand, I have realized just how difficult it is to find and interpret. Safecast is one project in a universe of other citizen science (or public science, participatory science, crowdsourced science etc.) projects that seeks to remediate complex information — by representing one form of media or content in a different form — for different audiences. In light of disaster, making complex information transparent to policymakers, lay publics, and international relief initiatives is an important public service. Outside of that, though, it is worth exploring how else Safecast and platforms like it can remediate and repurpose the information it has aggregated for public education about scientific issues that are otherwise insulated within such specific contexts. Reflections As a researcher, I spent the better part of last year studying how participatory sensing and mapping projects like this one communicate the information they have collected with the aid of volunteers. While I came into this realm of study seduced by the idea of “openness” and “accessibility” in science, I also learned the hard way that the big picture is much more nuanced, much more complicated, and not as idyllic as I initially pictured. I found that in order to participate in (and in some cases, build and manage) projects like this, I had to acquire a lot of new skills. For instance, I learned how to code; how to tinker with open hardware platforms like Arduino; how to map and visualize data on platforms like ArcGIS and web-mapping platforms like CartoDB/Leaflet/MapBox/QGIS; how to use design/wireframing tools; even how to develop simple apps. But here’s the thing and the irony to it all — I have access to an education at MIT, one of the leading research institutions in the world. I also have access to enough income to invest in software and hardware tools to teach myself these skills on the side. Open source projects and tools do aspire to be open and accessible — but I still find it difficult to believe that they can be as open and accessible to people who have little or no access to the same kinds of resources that are needed to acquire the skills necessary to participate in these projects. That said, none of this subtracts from the value of the information created by citizen science initiatives. Instead, I am suggesting that in order to get closer to the dream of democratized, distributed, and open science, there are a lot of things that still need to happen. For instance, developers and project managers might think about providing more educational materials for how project tools (hardware and software) work. Documentation (of code, APIs, etc.) is one thing, but actual educational materials catered toward specific audiences and user groups would also help people with different skills sets engage with projects. Storytellers, artists, and journalists who work to deconstruct and reconstruct complex knowledge for different audiences might also interface with project managers to help think through different ways information can be communicated. Educators can also create opportunities in the classroom to test out open source tools and, with students, generate different ideas on what their affordances and limitations are. Policymakers, scholars, and citizens can and should continue to constructively challenge citizen science initiatives by asking questions of them. How might they be more inclusive? How might the data collected be put to use by different actors? This very experimental, very individual experience with the bGeigie opened up an opportunity to discuss some of the same questions that I have been asking throughout the course of my research about participatory science, sensors, and media. Many of these questions remain unresolved, but by reflecting on them, I hope those who share this community of practice find ways to get a little closer to their goals. The name Fukushima (福島) means “good-fortune island.” While the city’s name elicits the memory of misfortune due to a trauma that occurred five years ago, for some, it simultaneously recalls the global outpouring of kindness and collaborative problem-solving toward resilience that immediately followed the disaster. It is this same spirit that drives much of citizen science work, which I hope will continue to sustain the good intentions and creative thinking of those who actively practice it. References Anderson, J. L., Mertens, C. J., Grajewski, B., Luo, L., Tseng, C. Y., & Cassinelli, R. T. (2014). Flight attendant radiation dose from solar particle events. Aviation, space, and environmental medicine, 85(8), 828–832. Bichelle, Rae Ellen. (2014). Cosmic Rays Sound Scary, But Radiation Risk On A Flight Is Small. NPR. Weblog. Retrieved March 20, 2016, from http://www.npr.org/sections/health-shots/2013/11/14/245183244/cosmic-rays-sound-scary-but-radiation-risk-on-a-flight-is-small Bradsher, Keith. (2011). “Last Defense at Troubled Reactors: 50 Japanese Workers”. The New York Times (Asia ed.) (NY, USA). Archived from the original on 22 March 2011 Bolter, J. D., Grusin, R., & Grusin, R. A. (2000). Remediation: Understanding new media. MIT Press. Christodouleas, J. P., Forrest, R. D., Ainsley, C. G., Tochner, Z., Hahn, S. M., & Glatstein, E. (2011). Short-term and long-term health risks of nuclear-power-plant accidents. New England journal of medicine, 364(24), 2334–2341. EPA. (n.d.). Radon. Website. Retrieved March 20, 2016, from http://www.epa.gov/radon/pubs/citguide.html Harrell, E. (2011). Fukushima’s Radiation Round-Up: How Bad Is It? | TIME.com. Retrieved March 20, 2016, from http://science.time.com/2011/03/29/fukushimas-radiation-round-up-how-bad-is-it/ Lee, B. (2011). How much radiation is too much? A handy guide. Retrieved March 20, 2016, from http://www.pbs.org/wnet/need-to-know/the-daily-need/how-much-radiation-is-too-much-a-handy-guide/8124/ Lilley, Steve. (2015). The Great Wave of Reform: The Prophetic Fallacy of the Fukushima-Daiichi Meltdown. NASA System Failure Case Study, 8(7). 1–4. MIT Nuclear Reactor Laboratory: Home. (n.d.). Retrieved March 20, 2016, from http://web.mit.edu/nrl/www/ Plantin, J. C. (2011). ‘The Map is the Debate’: Radiation Webmapping and Public Involvement During the Fukushima Issue. Available at SSRN 1926276. Safecast. (2016). Retrieved March 20, 2016, from http://safecast.org/ Schiappa, E. (1989). The rhetoric of nukespeak. Communications Monographs, 56(3), 253–272. Sweeney, D. (2016). Fukushima five years on, and the lessons we failed to learn. The Guardian. Web. Retrieved March 20, 2016, from http://www.theguardian.com/commentisfree/2016/mar/11/fukushima-five-years-on-and-the-lessons-we-failed-to-learn Zuckerman, E. (2013). “Citizen science versus NIMBY?” My Heart’s in Accra. Weblog. Retrieved March 20, 2016, from http://www.ethanzuckerman.com/blog/2013/08/29/citizen-science-versus-nimby/ ", "title": "Reactions: Risk, Radiation, and Remediation", "sentences": [{"feeb": "Image: Aerial view of Fukushima-Daiichi nuclear facility (NASA)"}, {"1de1": "Reactions: Risk, Radiation, and Remediation"}, {"8402": "Lessons learned from a Safecast exploration"}, {"53de": "This month marks the five-year anniversary of the Great East Japan Earthquake. On March 11, 2011, a magnitude 9.0 earthquake about 43 miles off the coast of the Oshika Peninsula generated a massive tsunami with waves at heights of 133 feet, which traveled at least 6 miles into Japan. More than 15,000 people lost their lives; thousands more suffered casualties. The tsunami waves also caused extensive damage to the reactors of the Fukushima Daiichi nuclear power facility, triggering one of the most significant nuclear disasters in recent history. Five years after the incident, radioactive release in water, air, and soil continue to be key environmental and public health concerns in the region."}, {"203e": "Because of my interest in mapping and sensors, I learned about what happened in Fukushima through the Safecast project, an organization and global community dedicated to collecting environmental radiation data with open source tools, and making that information publicly available. The project formed in direct reaction to the nuclear disaster, with the mission of providing information — making it free to access — where it was lacking. This service quickly made Safecast a go-to resource for information about radiation in Japan after the earthquake-tsunami, accessible through maps, an open API, reports, etc. on the website."}, {"3b6e": "Image: Map of radiation levels, Fukushima, June 2011. (Safecast.org)"}, {"73b7": "Image: Map of radiation levels, Fukushima, June 2015. (Safecast.org)"}, {"ef62": "The tool used to collect this data is an open source digital Geiger counter called the bGeigie Nano, which is capable of detecting different types of radiation (alpha, beta, gamma) and displaying levels on a screen. On top of radioactivity, the sensor also records GPS coordinates and timestamp. Individuals using the sensor to collect radiation data can also submit the data to Safecast’s online platform and contribute to a global database of radiation readings. This information then appears on various maps on the site, and becomes available through the Safecast API."}, {"c971": "Image: The Safecast bGeigie sensor. (Safecast.org)"}, {"5248": "The sensor has a screen that displays radiation level readings in real time in different units. You can take readings in CPM (counts per minute) or microSieverts per hour. After the incident, the sensor was used by volunteers around the country as a risk assessment mechanism — for instance, mapping out radiation levels in areas near the nuclear reactors in order to help decide where zones of major concern were."}, {"0766": "The project"}, {"1c3a": "Last winter, I came across one of the Safecast sensors by way of Ethan Zuckerman at MIT’s Center for Civic Media. I had just begun my masters research then and hadn’t quite narrowed down a topic yet from a broad interest in sensors, participatory science, and media. He and I chatted about different ways to use the Safecast bGeigie to collect data about radiation around MIT and different ways to visualize and represent the data. That said, neither of us was sure there was anything to find, but the exercise itself would be an experiment in how the Safecast could be used outside of the Fukushima context."}, {"5177": "The sticking point for me from our conversation, and the main reason I am writing this today, was a question Ethan had asked: “How you do talk about radiation in a way that doesn’t make people worry?”"}, {"5584": "In other words, the language of nuclear energy and power (“nukespeak”) is often designed to be cryptic and decode-able by a group of few. When a disaster like Fukushima-Daiichi happens, it can be easy to associate nuclear energy and radiation with negative outcomes, eliding the fact that radiation is very much a part of other, everyday aspects of our lives, which I will discuss more in a bit. Nuclear power and radiation have complicated and violent histories, spanning uses in warfare, industrial and occupational hazards, and longstanding ideological debates about the sustainability and moral ambiguity surrounding nuclear energy."}, {"c45c": "At the end of our meeting, Ethan handed me a Safecast sensor and sent me off into the world to find data, and to find a story."}, {"242a": "To be completely frank, I struggled a lot with the prompt. I read a lot of science publications about radiation, talked to various people working within this space, and tried several different approaches, which I talk about shortly. When I landed somewhere, I realized that for me, writing this piece has to be about answering this particular set of questions:"}, {"cc53": "(1) How might a tool like the Safecast bGeigie be used in non-emergency contexts to provide public education and transparency about the way radiation is measured?"}, {"51da": "(2) How do you break down the bureaucratic and scientific jargon surrounding nuclear science in the process?"}, {"6dbf": "The banana stance"}, {"33f1": "The answer might be bananas."}, {"62d5": "There is something called the Banana Equivalent Dose (BED), an index used to describe radiation levels in terms of how much radiation you are exposed to by eating approximately one banana. The potassium in bananas naturally decays and consequently contributes to slight radioactivity in bananas, but this dosage is nowhere near the lethal dose of radiation."}, {"09a9": "One BED is approximately 0.1 microSieverts (µSv) of radiation. Sievert is the unit used to measure ionizing radiation, the kind that is cause for concern in very high doses. One Sievert of radiation is about the equivalent of the radiation dosage from consuming 10,000,000 bananas. A lethal dose of radiation is approximately 3.5 Sieverts, or 35,000,000 bananas."}, {"5a5b": "Image: Lily Bui"}, {"9aa6": "On March 28, 2011, the highest reading of radiation in Fukushima occurred at 78 microSieverts per hour. At that rate, a person would have to stand outdoors, unshielded, for 27 consecutive days in order to reach the maximum annual limit allowed for workers at a U.S. nuclear power plant — about 0.5 Sieverts or 5,000,000 bananas."}, {"ff3c": "But the point of this exercise isn’t so much to return to the context of disaster. Rather, it’s to illustrate where radiation occurs outside of that context, where radiation interfaces with us in our everyday lives. (Bananas just happen to be a convenient analogy.)"}, {"c9fe": "Radiation and air travel"}, {"f0b5": "I decided to press my luck with the TSA and brought the bGeigie with me on a flight from Massachusetts to Texas. After reading an NPR article about radiation doses during airline travel, I wanted to see for myself what those levels actually looked like. Most of the time, the types of radiation you are exposed to while flying are ultraviolent (UV) radiation and cosmic radiation, which get filtered by clouds and the atmosphere most of the time, so they don’t affect you as much at ground level."}, {"95ba": "I had the bGeigie set to measure CPM (counts per minute), which measures how many radioactive electrons pass through the sensor every few seconds. One CPM is approximately 3 uSv/hr (or 0.000003 Sv/hr). I chose to use this unit on the bGeigie because it was easier to wrap my head around whole numbers instead of fractions or decimals. For me, CPM was more legible than having to constantly think about conversions from uSv to Sv. (However, I hope that your focus, dear reader, is not so much the exact numbers themselves but rather the comparative differences between them in different contexts.)"}, {"c687": "While I was boarding, the bGeigie was measuring between 25 to 35 CPM in the airport terminal. When the plane took off, I watched the number increase as we ascended to higher and higher altitudes. Eventually, the readings leveled out at around 1,013 CPM at 32,000 ft."}, {"f0c3": "Image: Lily Bui"}, {"423d": "Image: Ground-level radiation measurements between 25–35 CPM (Lily Bui)"}, {"4e64": "Image: Higher-altitude measurements of radiation levels around 1,013 CPM (Lily Bui)"}, {"2213": "The impulsive question to ask would be, “Is this a bad thing?” In general for travelers, no. The doses are far below levels that would officially be of concern. Still, there have been recent studies and ongoing work that look at how frequent exposure might increase health risks those working in the the air travel industry."}, {"b1d6": "Radiation on campus"}, {"0903": "Image: Nuclear reactor lab proximity to MIT’s main campus (Google Maps)"}, {"68bf": "On a separate occasion, I went to visit the nuclear reactor on MIT’s campus. After seeing what the radiation readings looked like on my flight, I wondered what radiation levels might look like in other everyday settings. Granted, I am fully aware that not everyone lives or works within close proximity of a nuclear reactor, but this is a relatively common experience for myself and thousands of other MIT students on campus. Not to mention, there are many different reactors within the United States near populated areas. MIT’s nuclear reactor is located about a block away from the main campus and is embedded within the fabric of other campus facilities such as the main gym and graduate student housing. Offset from the street by a few hundred feet, the facility is not something that invites a lot of attention from passersby, albeit still visible from a pedestrian standpoint. Still, hundreds — if not thousands — of people pass by it on an everyday basis, likely without a second thought to radiation levels in or around it."}, {"ef20": "I requested a tour of the nuclear reactor facility. I also asked if I could take the Safecast bGeigie with me. (Fortunately, the staff said yes.) At the facility, people who go on tours, including employees, have to carry something called a dosimeter with them. These are pen-like sensors that measure your exposure to radiation, much like the bGeigie would, only in a more analog way. Someone at the front desk takes the reading on your dosimeter before you enter the facility and another once you exit."}, {"3f99": "Image: Dosimeter (Wikipedia)"}, {"1092": "I started taking readings with the bGeigie in the lobby and continued to take note of readings during the rest of the tour, which took us through a foyer leading deeper into the facility, to the basement, through several airlocks, and to the main fission converter where the reactor is actually located. On this particular day, the reactor was off, so I expected readings to be relatively low. The highest reading, around 1300–1400 CPM, was near the fission converter while the lowest reading was in the basement, around 30 CPM."}, {"f9bc": "Image: Radiation levels within MIT Nuclear Facility rooms. (Lily Bui)"}, {"85dc": "For me, the most fascinating moment of the tour was coming across a cupboard full of — for lack of a better term — very radioactive things. Among them were naturally radioactive materials, like copper uranyl phosphate and radium oxide, as well as consumer goods that were also radioactive, like Fiesta dinnerware, radium-coated watches, and Coleman lantern mantles used for camping."}, {"5bc9": "Image: Radiation levels of items in cupboard of radioactive things. (Lily Bui)"}, {"a319": "Observing the relative levels of radiation in naturally occurring and everyday objects in this cupboard provided some perspective. This experience as well as that of bringing the bGeigie on an airplane gave me measurements to compare against the levels of radiation reported in news coverage about Fukushima and also enunciated the point that radiation occurs in contexts other than catastrophes and nuclear fallouts."}, {"a6e1": "Nevertheless, radiation remains a tricky — and very risky — subject to frame. Underemphasize its impact and you can put human lives at risk; overemphasize it and the information can lose meaning through multiple channels of delivery."}, {"1f9b": "Remediation"}, {"307a": "In my own research about radiation, particularly within the context of the Fukushima-Daiichi incident, and from the perspective of a non-scientist, I have sifted through a whole lot of information (science publications, newspaper articles, policy reports, personal anecdotes, etc.) that has been challenging to decode and synthesize. This has had two conflicting effects: on one hand, I have grown to appreciate the fact that this information exists in the world. On the other hand, I have realized just how difficult it is to find and interpret."}, {"c557": "Safecast is one project in a universe of other citizen science (or public science, participatory science, crowdsourced science etc.) projects that seeks to remediate complex information — by representing one form of media or content in a different form — for different audiences. In light of disaster, making complex information transparent to policymakers, lay publics, and international relief initiatives is an important public service. Outside of that, though, it is worth exploring how else Safecast and platforms like it can remediate and repurpose the information it has aggregated for public education about scientific issues that are otherwise insulated within such specific contexts."}, {"f536": "Reflections"}, {"43ad": "As a researcher, I spent the better part of last year studying how participatory sensing and mapping projects like this one communicate the information they have collected with the aid of volunteers. While I came into this realm of study seduced by the idea of “openness” and “accessibility” in science, I also learned the hard way that the big picture is much more nuanced, much more complicated, and not as idyllic as I initially pictured."}, {"0bf1": "I found that in order to participate in (and in some cases, build and manage) projects like this, I had to acquire a lot of new skills. For instance, I learned how to code; how to tinker with open hardware platforms like Arduino; how to map and visualize data on platforms like ArcGIS and web-mapping platforms like CartoDB/Leaflet/MapBox/QGIS; how to use design/wireframing tools; even how to develop simple apps. But here’s the thing and the irony to it all — I have access to an education at MIT, one of the leading research institutions in the world. I also have access to enough income to invest in software and hardware tools to teach myself these skills on the side."}, {"8d8b": "Open source projects and tools do aspire to be open and accessible — but I still find it difficult to believe that they can be as open and accessible to people who have little or no access to the same kinds of resources that are needed to acquire the skills necessary to participate in these projects."}, {"de89": "That said, none of this subtracts from the value of the information created by citizen science initiatives. Instead, I am suggesting that in order to get closer to the dream of democratized, distributed, and open science, there are a lot of things that still need to happen."}, {"8f1f": "For instance, developers and project managers might think about providing more educational materials for how project tools (hardware and software) work. Documentation (of code, APIs, etc.) is one thing, but actual educational materials catered toward specific audiences and user groups would also help people with different skills sets engage with projects. Storytellers, artists, and journalists who work to deconstruct and reconstruct complex knowledge for different audiences might also interface with project managers to help think through different ways information can be communicated. Educators can also create opportunities in the classroom to test out open source tools and, with students, generate different ideas on what their affordances and limitations are. Policymakers, scholars, and citizens can and should continue to constructively challenge citizen science initiatives by asking questions of them. How might they be more inclusive? How might the data collected be put to use by different actors?"}, {"902c": "This very experimental, very individual experience with the bGeigie opened up an opportunity to discuss some of the same questions that I have been asking throughout the course of my research about participatory science, sensors, and media. Many of these questions remain unresolved, but by reflecting on them, I hope those who share this community of practice find ways to get a little closer to their goals."}, {"f2ae": "The name Fukushima (福島) means “good-fortune island.” While the city’s name elicits the memory of misfortune due to a trauma that occurred five years ago, for some, it simultaneously recalls the global outpouring of kindness and collaborative problem-solving toward resilience that immediately followed the disaster. It is this same spirit that drives much of citizen science work, which I hope will continue to sustain the good intentions and creative thinking of those who actively practice it."}, {"4b54": "References"}, {"d5bc": "Anderson, J. L., Mertens, C. J., Grajewski, B., Luo, L., Tseng, C. Y., & Cassinelli, R. T. (2014). Flight attendant radiation dose from solar particle events. Aviation, space, and environmental medicine, 85(8), 828–832."}, {"33eb": "Bichelle, Rae Ellen. (2014). Cosmic Rays Sound Scary, But Radiation Risk On A Flight Is Small. NPR. Weblog. Retrieved March 20, 2016, from http://www.npr.org/sections/health-shots/2013/11/14/245183244/cosmic-rays-sound-scary-but-radiation-risk-on-a-flight-is-small"}, {"123e": "Bradsher, Keith. (2011). “Last Defense at Troubled Reactors: 50 Japanese Workers”. The New York Times (Asia ed.) (NY, USA). Archived from the original on 22 March 2011"}, {"2133": "Bolter, J. D., Grusin, R., & Grusin, R. A. (2000). Remediation: Understanding new media. MIT Press."}, {"3e39": "Christodouleas, J. P., Forrest, R. D., Ainsley, C. G., Tochner, Z., Hahn, S. M., & Glatstein, E. (2011). Short-term and long-term health risks of nuclear-power-plant accidents. New England journal of medicine, 364(24), 2334–2341."}, {"aecb": "EPA. (n.d.). Radon. Website. Retrieved March 20, 2016, from http://www.epa.gov/radon/pubs/citguide.html"}, {"cefe": "Harrell, E. (2011). Fukushima’s Radiation Round-Up: How Bad Is It? | TIME.com. Retrieved March 20, 2016, from http://science.time.com/2011/03/29/fukushimas-radiation-round-up-how-bad-is-it/"}, {"54fe": "Lee, B. (2011). How much radiation is too much? A handy guide. Retrieved March 20, 2016, from http://www.pbs.org/wnet/need-to-know/the-daily-need/how-much-radiation-is-too-much-a-handy-guide/8124/"}, {"42ab": "Lilley, Steve. (2015). The Great Wave of Reform: The Prophetic Fallacy of the Fukushima-Daiichi Meltdown. NASA System Failure Case Study, 8(7). 1–4."}, {"903f": "MIT Nuclear Reactor Laboratory: Home. (n.d.). Retrieved March 20, 2016, from http://web.mit.edu/nrl/www/"}, {"d162": "Plantin, J. C. (2011). ‘The Map is the Debate’: Radiation Webmapping and Public Involvement During the Fukushima Issue. Available at SSRN 1926276."}, {"2d64": "Safecast. (2016). Retrieved March 20, 2016, from http://safecast.org/"}, {"0596": "Schiappa, E. (1989). The rhetoric of nukespeak. Communications Monographs, 56(3), 253–272."}, {"9c69": "Sweeney, D. (2016). Fukushima five years on, and the lessons we failed to learn. The Guardian. Web. Retrieved March 20, 2016, from http://www.theguardian.com/commentisfree/2016/mar/11/fukushima-five-years-on-and-the-lessons-we-failed-to-learn"}, {"5df6": "Zuckerman, E. (2013). “Citizen science versus NIMBY?” My Heart’s in Accra. Weblog. Retrieved March 20, 2016, from http://www.ethanzuckerman.com/blog/2013/08/29/citizen-science-versus-nimby/"}], "child": "453_1453_1"}