{"name": "466", "parent": "", "content": "My bank has an API so I built online banking I recently attended Mondo’s second Hackathon, and it was incredibly insightful. My first hackathon, and moreover, my first time working with a RESTful API. For the last 10 days I’ve been Alpha testing Mondo with their bright pink prepaid MasterCard, and it’s been an incredible experience. Speedy purchase notifications, geotagged transactions and automatic categorisation have really shown up the standard UK banking industry. Last night I thought I’d have another play around with the Mondo API. I had already used the API at the hackathon 10 days ago, however the novelty of seeing banking transactions pop up in Postman had been renewed by the fact that this was my data, my real transactions. I wanted to create my own web client on Mondo’s API, so I could check my balance, today’s spend, and a list of transactions from my computer. I went for raw Bootstrap for speedy front-end design, and did the backend work in PHP, with standard PHP sessions. I envisioned the following flow: Authentication Currently, Access Tokens expire after 6 hours, so I hacked together the following function: function tokenExpired($accesstoken) {   // GET accounts   $crl = curl_init();    $headr = array(     ‘Content-type: application/json’,     ‘Authorization: Bearer ‘.$accesstoken   );    curl_setopt($crl, CURLOPT_URL, “https://production-api.gmon.io/accounts\");   curl_setopt($crl, CURLOPT_HTTPHEADER, $headr);   curl_setopt($crl, CURLOPT_RETURNTRANSFER, TRUE);   $rest = curl_exec($crl);    curl_close($crl);    $json = json_decode($rest, true);    if(empty($json[‘accounts’][0][‘account_number’])) {     return true;   }   else {     return false;   }} Mondo’s infrastructure will support multi accounts under the same login credentials in the future, but for now I could just check the response returned an account_number for the first account, which isn’t returned if the access token has expired. A pretty gross but quick way of whipping this up. Main View Transactions I had display in a boring, regular table. I also mimicked the way Mondo show their Balance and Spend Today counter in their iOS app. I’m in the process of adding some cool looking charts at the moment, so the user can visualise their expenditure sorted by category, sort of like this maybe. All I have left to say is I’m looking forward to Mondo’s full release, where we’ll all be able to see the full potential of API banking. James Title courtesy of @jonas :) ", "title": "My bank has an API so I built online banking", "sentences": [{"29c9": "My bank has an API so I built online banking"}, {"cebf": "I recently attended Mondo’s second Hackathon, and it was incredibly insightful. My first hackathon, and moreover, my first time working with a RESTful API."}, {"613e": "For the last 10 days I’ve been Alpha testing Mondo with their bright pink prepaid MasterCard, and it’s been an incredible experience. Speedy purchase notifications, geotagged transactions and automatic categorisation have really shown up the standard UK banking industry."}, {"4032": "Last night I thought I’d have another play around with the Mondo API. I had already used the API at the hackathon 10 days ago, however the novelty of seeing banking transactions pop up in Postman had been renewed by the fact that this was my data, my real transactions."}, {"df7e": "I wanted to create my own web client on Mondo’s API, so I could check my balance, today’s spend, and a list of transactions from my computer. I went for raw Bootstrap for speedy front-end design, and did the backend work in PHP, with standard PHP sessions. I envisioned the following flow:"}, {"41e7": "Authentication"}, {"dc67": "Currently, Access Tokens expire after 6 hours, so I hacked together the following function:"}, {"3e1c": "function tokenExpired($accesstoken) {   // GET accounts   $crl = curl_init();    $headr = array(     ‘Content-type: application/json’,     ‘Authorization: Bearer ‘.$accesstoken   );    curl_setopt($crl, CURLOPT_URL, “https://production-api.gmon.io/accounts\");   curl_setopt($crl, CURLOPT_HTTPHEADER, $headr);   curl_setopt($crl, CURLOPT_RETURNTRANSFER, TRUE);   $rest = curl_exec($crl);    curl_close($crl);    $json = json_decode($rest, true);    if(empty($json[‘accounts’][0][‘account_number’])) {     return true;   }   else {     return false;   }}"}, {"14e7": "Mondo’s infrastructure will support multi accounts under the same login credentials in the future, but for now I could just check the response returned an account_number for the first account, which isn’t returned if the access token has expired. A pretty gross but quick way of whipping this up."}, {"6471": "Main View"}, {"6809": "Transactions I had display in a boring, regular table. I also mimicked the way Mondo show their Balance and Spend Today counter in their iOS app."}, {"a4a1": "I’m in the process of adding some cool looking charts at the moment, so the user can visualise their expenditure sorted by category, sort of like this maybe."}, {"889f": "All I have left to say is I’m looking forward to Mondo’s full release, where we’ll all be able to see the full potential of API banking."}, {"a152": "James"}, {"afb3": "Title courtesy of @jonas :)"}], "child": "466_1\t466_2\t466_3\t466_4\t466_5\t466_6\t466_7\t466_8\t466_9\t466_10\t466_11\t466_12\t466_13\t466_14\t466_15"}