{"content": "Rumormonger Should the Timberwolves Really Trade for Jimmy Butler? Getty Images Less than two months after taking over as Minnesota’s Basketball Czar, Tom Thibodeau is ready to remake the Timberwolves in his image. On Wednesday morning, ESPN’s Marc Stein and Chad Ford reported that the Wolves are prepared to send the fifth-overall pick in next Thursday’s draft to the Bulls in exchange for Jimmy Butler, who played for Thibodeau in Chicago from 2011 to 2015. Although the Bulls reportedly want Andrew Wiggins in the deal, it’s hard to imagine the Timberwolves parting with a 21-year-old franchise cornerstone. Instead, let’s say the deal is something more likely: the no. 5 pick, Zach LaVine, and Gorgui Dieng for Butler. Should Thibs jump at the opportunity to reunite with his former swingman? Should the Bulls dive headfirst into rebuilding mode? Are the Wolves sacrificing too much of their long-term potential here? We break it all down. This Is Smart Because: Minnesota would immediately have the makings of a Big Three in Butler, Karl-Anthony Towns, and Wiggins. Butler’s familiarity with Thibodeau’s complex defensive system would accelerate the Wolves’ development plan, and his legendary work ethic would set a sterling example for Minny’s young roster. Plus, when you can acquire an All-Star without giving one up, you have to pull the trigger. Most importantly, Mark Wahlberg would become a die-hard Wolves fan. Chicago, meanwhile, could sell high on Jimmy Butler in exchange for youth and picks, both of which are crucial to any rebuild. Although a full-fledged rebuild may be tough for the Bulls to accept, the franchise probably needs to move on from the turbulent Rose-Butler administration, lest it remain mired in mediocrity. The no. 5 pick represents a tantalizing opportunity to add a blue-chip college prospect like Cal’s Jaylen Brown or Oklahoma’s Buddy Hield. This Is Stupid Because: The Wolves are still at least a few years away from competing for a championship, and who knows what the future holds for Butler. After leading the NBA in minutes per game in 2013–14 and 2014–15, he suffered a left knee sprain in February and subsequently missed 15 games. This doesn’t mean he’s already past his prime, of course, but it’s an inauspicious sign, considering Thibs’s history with this sort of thing. And besides, doesn’t it make more sense to draft Hield or Dragan Bender, either of whom could be available and would develop on the same timeline as Towns and Wiggins? Butler would certainly improve the Wolves in the short term, but they might be better off with a high-potential rookie. As for the Bulls, why would Fred Hoiberg want anything to do with a rebuild? Hoiberg likely didn’t jump to the NBA just to watch his front office disregard its team’s win-loss record like the Sixers have done with Brett Brown. While Butler is a proven commodity, the only thing LaVine guarantees you is an epic Slam Dunk Contest performance each year. That’s not enough to justify parting with a two-time All-Star. Final Verdict: Thibs probably would’ve made this trade yesterday, but the Bulls need to hold out for Wiggins, which should be a dealbreaker for the Wolves. This is for the best, though: Buddy would make the Wolves even more of a League Pass darling than they already are, and I don’t want to live in a world without Rose-Butler drama. ", "child": "47_1\t47_2\t47_3\t47_4\t47_5\t47_6\t47_7\t47_8\t47_9\t47_10\t47_11\t47_12\t47_13\t47_14\t47_15", "title": "Should the Timberwolves Really Trade for Jimmy Butler?", "parent": "", "sentences": [{"621d": "Rumormonger"}, {"ff4c": "Should the Timberwolves Really Trade for Jimmy Butler?"}, {"f992": "Getty Images"}, {"e4b8": "Less than two months after taking over as Minnesota’s Basketball Czar, Tom Thibodeau is ready to remake the Timberwolves in his image. On Wednesday morning, ESPN’s Marc Stein and Chad Ford reported that the Wolves are prepared to send the fifth-overall pick in next Thursday’s draft to the Bulls in exchange for Jimmy Butler, who played for Thibodeau in Chicago from 2011 to 2015. Although the Bulls reportedly want Andrew Wiggins in the deal, it’s hard to imagine the Timberwolves parting with a 21-year-old franchise cornerstone."}, {"09c7": "Instead, let’s say the deal is something more likely: the no. 5 pick, Zach LaVine, and Gorgui Dieng for Butler. Should Thibs jump at the opportunity to reunite with his former swingman? Should the Bulls dive headfirst into rebuilding mode? Are the Wolves sacrificing too much of their long-term potential here? We break it all down."}, {"b889": "This Is Smart Because: Minnesota would immediately have the makings of a Big Three in Butler, Karl-Anthony Towns, and Wiggins. Butler’s familiarity with Thibodeau’s complex defensive system would accelerate the Wolves’ development plan, and his legendary work ethic would set a sterling example for Minny’s young roster. Plus, when you can acquire an All-Star without giving one up, you have to pull the trigger. Most importantly, Mark Wahlberg would become a die-hard Wolves fan."}, {"40d8": "Chicago, meanwhile, could sell high on Jimmy Butler in exchange for youth and picks, both of which are crucial to any rebuild. Although a full-fledged rebuild may be tough for the Bulls to accept, the franchise probably needs to move on from the turbulent Rose-Butler administration, lest it remain mired in mediocrity. The no. 5 pick represents a tantalizing opportunity to add a blue-chip college prospect like Cal’s Jaylen Brown or Oklahoma’s Buddy Hield."}, {"2276": "This Is Stupid Because: The Wolves are still at least a few years away from competing for a championship, and who knows what the future holds for Butler. After leading the NBA in minutes per game in 2013–14 and 2014–15, he suffered a left knee sprain in February and subsequently missed 15 games. This doesn’t mean he’s already past his prime, of course, but it’s an inauspicious sign, considering Thibs’s history with this sort of thing. And besides, doesn’t it make more sense to draft Hield or Dragan Bender, either of whom could be available and would develop on the same timeline as Towns and Wiggins? Butler would certainly improve the Wolves in the short term, but they might be better off with a high-potential rookie."}, {"b6d7": "As for the Bulls, why would Fred Hoiberg want anything to do with a rebuild? Hoiberg likely didn’t jump to the NBA just to watch his front office disregard its team’s win-loss record like the Sixers have done with Brett Brown. While Butler is a proven commodity, the only thing LaVine guarantees you is an epic Slam Dunk Contest performance each year. That’s not enough to justify parting with a two-time All-Star."}, {"246c": "Final Verdict: Thibs probably would’ve made this trade yesterday, but the Bulls need to hold out for Wiggins, which should be a dealbreaker for the Wolves. This is for the best, though: Buddy would make the Wolves even more of a League Pass darling than they already are, and I don’t want to live in a world without Rose-Butler drama."}], "name": "47"}