{"name": "475", "parent": "", "content": "Have I Lost My Voice? I’ve been trying to write on a few topics lately that have sparked my interest and failed. Relationships (a common theme for me), Addiction, Traveling. I’ve written things, deleted things, pushed and prodded here and there. I normally write with a bit of humor, and a lot of honestly. Usually I tip the scales into self-deprecating. But nothing feels right. It doesn’t read back in a way that I’d want to read. Things aren’t flowing as they should. It feels false. Try hard-y. Awful. I’m sure that happens to all of us, sometimes. So what do you do? Write anyway? Even though it feels forced?Publish things anyway? Even if they make you cringe?Take a break from it all? Push even harder? I don’t know. But I thought maybe you guys would. You’re pretty smart, both collectively and individually, so help a lady out. How do I find my voice again? ", "title": "Have I Lost My Voice?", "sentences": [{"80ff": "Have I Lost My Voice?"}, {"4194": "I’ve been trying to write on a few topics lately that have sparked my interest and failed. Relationships (a common theme for me), Addiction, Traveling. I’ve written things, deleted things, pushed and prodded here and there. I normally write with a bit of humor, and a lot of honestly. Usually I tip the scales into self-deprecating."}, {"3647": "But nothing feels right. It doesn’t read back in a way that I’d want to read. Things aren’t flowing as they should. It feels false. Try hard-y. Awful. I’m sure that happens to all of us, sometimes."}, {"d158": "So what do you do?"}, {"c100": "Write anyway? Even though it feels forced?Publish things anyway? Even if they make you cringe?Take a break from it all? Push even harder?"}, {"0e74": "I don’t know. But I thought maybe you guys would. You’re pretty smart, both collectively and individually, so help a lady out. How do I find my voice again?"}], "child": "475_1\t475_2\t475_3\t475_4\t475_5\t475_6\t475_7"}