{"name": "478", "parent": "", "content": "Living and Parenting in Uncertain Times Uncertainty. Worry. Fear. These are still the top themes in most of my counseling sessions as a psychologist — with adults, with teens, and even with children. Mainly, the discussions were about the presidential election, then it was about the winner of the election, and now it is about the very uncertain future. What will happen to immigrants? What will happen to trade policies? Will the right to choose disappear? Will gay marriage be overturned? What is going to happen with Russia? In my profession there is a saying that uncertainty breeds anxiety. I think most of us would agree with this statement. As I ponder and deal with these questions and concerns on a personal level, I’m transported back to the fifth grade. I remember learning about nuclear bombs and nuclear war. I have vivid images etched into my brain of mushroom clouds and nuclear fall-out. I remember watching the movie The Day After full of fear. I remember nights awake in my childhood bed being scared of Russia bombing us and of dying. Perhaps worst of all my parents didn’t know how scared I was because I didn’t tell them — in fact I didn’t tell anyone. Fast forward to 2016. My wife and I are raising 3 teenagers. I can’t help but ask myself: How much are they worrying about the future? Are they quiet because they don’t want to tell me their real fears? Are they quiet because they think Mom and Dad can’t possibly understand their feelings? These are the signs of raising children in uncertain times. As the year ends we are all having important and honest conversations with spouses and partners, family, and friends. How can we approach the new year and this uncertain world with positivity and peace? Here are 5 ways to curate daily well-being: The future is always uncertain — Humans trick ourselves into feeling secure. We want to believe that we have control, that nothing bad will happen. These thoughts make us feel happy. But uncertain times challenge this strategy. So what can we do to conquer fear and feel peace and happiness? I suggest we accept and embrace the uncertainty — forget the concepts of good or bad outcomes and instead focus on life is always changing and if we allow our minds to be at peace with the unknown then we can adapt to any challenge. History proves that humans adapt and survive — Our human species has been evolving, adapting, and surviving for a very long time. It is in our DNA. Like our ancestors we can and will deal with our social, environmental, and political circumstances. Go back to your American and World History lessons: American’s have been dealing with similar challenges with policies, leadership, economy, and war and with the exception of Twitter, not much has changed. The present is the only thing that exists — All we have is the present. The now. I know this sounds cliché these days as more and more people are trying to become mindful (which is a very good thing), but it is true. All anxiety and worry exists in a future that has yet to occur. I want you to decide how much time you are willing to devote to worrying about the future or the past when you can be focused on today. present moment and day is all we can count on, until the next one comes — I tell this to my patients all the time. People are inherently good — We never stop believing in the goodness of humanity and the human spirit. There are many, many people who share your values and are committed to a world filled with loving and compassionate people. People will continue to fight for what is right, for equal rights, for human respect and decency. There are a lot of good people in our country and in the world. Be the best person you can be every single day — We all can contribute to our collective well-being: we can wake up every day and make the best of it. We can and must have relationships. Engage with your children, spouse, family and friends. Engage in your job. Treat people with kindness, solve problems small and big, and stand up for what you believe. Remember that you are fallible, not perfect, and not expected to do anything but your best on this single day. We can all do this today, tomorrow, and then every next day. What I have learned over the decades is this: being aware of ourselves — what we feel, think, and how we act — is the most important part of parenting (and living) — in uncertain times. Be the person you want to be and you want your kids to be as well. Model for them what it is like to live fully and care about humanity. Show them, and tell them, about how humans adapt and survive and are inherently good. Show them and teach them how to live in the present. Most importantly, show them how to be the best human they possibly can be — one that makes mistakes, cares about people, and does the best they can every single day. These are the keys to their future and ours — and that is a certainty. ", "title": "Living and Parenting in Uncertain Times", "sentences": [{"1173": "Living and Parenting in Uncertain Times"}, {"7553": "Uncertainty."}, {"2e06": "Worry."}, {"2c1d": "Fear."}, {"6414": "These are still the top themes in most of my counseling sessions as a psychologist — with adults, with teens, and even with children. Mainly, the discussions were about the presidential election, then it was about the winner of the election, and now it is about the very uncertain future. What will happen to immigrants? What will happen to trade policies? Will the right to choose disappear? Will gay marriage be overturned? What is going to happen with Russia?"}, {"4ac3": "In my profession there is a saying that uncertainty breeds anxiety. I think most of us would agree with this statement. As I ponder and deal with these questions and concerns on a personal level, I’m transported back to the fifth grade. I remember learning about nuclear bombs and nuclear war. I have vivid images etched into my brain of mushroom clouds and nuclear fall-out. I remember watching the movie The Day After full of fear. I remember nights awake in my childhood bed being scared of Russia bombing us and of dying. Perhaps worst of all my parents didn’t know how scared I was because I didn’t tell them — in fact I didn’t tell anyone."}, {"c5eb": "Fast forward to 2016. My wife and I are raising 3 teenagers. I can’t help but ask myself: How much are they worrying about the future? Are they quiet because they don’t want to tell me their real fears? Are they quiet because they think Mom and Dad can’t possibly understand their feelings? These are the signs of raising children in uncertain times."}, {"b22b": "As the year ends we are all having important and honest conversations with spouses and partners, family, and friends. How can we approach the new year and this uncertain world with positivity and peace? Here are 5 ways to curate daily well-being:"}, {"ba9c": "The future is always uncertain — Humans trick ourselves into feeling secure. We want to believe that we have control, that nothing bad will happen. These thoughts make us feel happy. But uncertain times challenge this strategy. So what can we do to conquer fear and feel peace and happiness? I suggest we accept and embrace the uncertainty — forget the concepts of good or bad outcomes and instead focus on life is always changing and if we allow our minds to be at peace with the unknown then we can adapt to any challenge."}, {"6ba1": "History proves that humans adapt and survive — Our human species has been evolving, adapting, and surviving for a very long time. It is in our DNA. Like our ancestors we can and will deal with our social, environmental, and political circumstances. Go back to your American and World History lessons: American’s have been dealing with similar challenges with policies, leadership, economy, and war and with the exception of Twitter, not much has changed."}, {"f6fa": "The present is the only thing that exists — All we have is the present. The now. I know this sounds cliché these days as more and more people are trying to become mindful (which is a very good thing), but it is true. All anxiety and worry exists in a future that has yet to occur. I want you to decide how much time you are willing to devote to worrying about the future or the past when you can be focused on today. present moment and day is all we can count on, until the next one comes — I tell this to my patients all the time."}, {"8cb8": "People are inherently good — We never stop believing in the goodness of humanity and the human spirit. There are many, many people who share your values and are committed to a world filled with loving and compassionate people. People will continue to fight for what is right, for equal rights, for human respect and decency. There are a lot of good people in our country and in the world."}, {"b746": "Be the best person you can be every single day — We all can contribute to our collective well-being: we can wake up every day and make the best of it. We can and must have relationships. Engage with your children, spouse, family and friends. Engage in your job. Treat people with kindness, solve problems small and big, and stand up for what you believe. Remember that you are fallible, not perfect, and not expected to do anything but your best on this single day. We can all do this today, tomorrow, and then every next day."}, {"5c9e": "What I have learned over the decades is this: being aware of ourselves — what we feel, think, and how we act — is the most important part of parenting (and living) — in uncertain times. Be the person you want to be and you want your kids to be as well. Model for them what it is like to live fully and care about humanity. Show them, and tell them, about how humans adapt and survive and are inherently good. Show them and teach them how to live in the present. Most importantly, show them how to be the best human they possibly can be — one that makes mistakes, cares about people, and does the best they can every single day. These are the keys to their future and ours — and that is a certainty."}], "child": "478_1"}