{"name": "487", "parent": "", "content": "Ask A Swole Woman: Do My Workouts Have To Be Hardcore? Treasuring rest days and making your goals more specific. I have a hard time maintaining moderation in the way I think about fitness. Even when I’m looking up workouts and programs online, it seems like the only path is HARDCORE SCULPT YOUR BODY TO PERFECTION. How can I shape a fitness routine that shows results, makes me feel healthy, but doesn’t take over my life? Love that you guys are doing this!! Thanks! — Alex Woof, I hate the hardcore mindset. The rise of #nodaysoff troubles me greatly. We give some issues and addictions more of a pass than others, but it seems not good to be afraid to take even a single day off from working out or eating “clean” or whatever it is one is supposed to do every single day in perpetuity. Or perhaps you mean all of the workout programs that persist by being so ridiculously hard, no one can complete them and then feel like they have no one to blame but themselves (*ahem* P90x, Insanity, et al.). In my personal experience there is a sweet spot with intensity. The times I regret the most are the ones I spent doing some confusingly complicated, but not sufficiently intense, workout that somehow simultaneously hurt, was boring, and yielded no results. But it is also possible to work out too much, sabotage your results, and waste time. Bodies are a little mysterious and not very well-studied when it comes to exercise, but just to pick an example out of the pile, Stronger By Science cites a couple studies here where people were able to make the same gains whether they lifted heavy for many weeks straight vs lifting a few weeks on, a few weeks off. This doesn’t apply to every type of exercise, but still, there is ample evidence that when it comes to muscles and your body, rest and recovery matters a lot. All this said, it is possible to get results from lifting without committing either a lot of hours or, in my opinion, even a lot of effort. Here is my favorite reddit post to that effect. I did a very similar program when I started lifting, and I felt the effects really quickly! Turns out food gives you energy, and being even slightly stronger makes it easier to do basic things like carry bags from the grocery store. You know when people say “lift with your legs, not your back”? This never made any sense to me, but it turns out that was because my legs were noodles, even though I was running half-marathons on the reg. Having done deadlifts allowed me, finally, to actually pick up a box correctly. I no longer live in fear of the giant boxes of litter my cat and budget demand, and it’s really something. But before I get ahead of myself, there is a problem: “shows results” and “makes me feel healthy” are pretty vague goals, which is maybe part of your issue. What results? Gain muscle? Lose fat? Gain strength? Gain size? How much? What does “feeling healthy” feel like? Like you can bend down and pick something up without it hurting? Lean over and grab something without falling over? Carry 50lbs 100 feet without your arms hurting? Run up 3 flights of stairs without getting winded? If the last couple decades of productivity literature and lifehacking have taught us anything, it’s that we are vastly more likely to accomplish a goal the more concrete it is. How realistic the goal is plays a role, too, but that has to do a little more with self-knowledge than how tangible a goal is. “Feel healthy” is about as vague as it gets; it’s even vaguer than “be healthy,” which at least a doctor could affirm by like, taking a blood panel and your blood pressure and asking if anything hurts. So you need to firm this up somehow. It almost doesn’t matter what the goal is, except that you must be able to muster some care about it and it should be achievable in the near term; let’s say less than a year. Here is another goal: — Look like Gisele Bundchen Ok, this is a bad goal: specific body type gotten by not only probably years of effort but through the combined effort of a full-time staff. I won’t say this is impossible (even though it is), but even if it weren’t, it should be broken down into a lot of sub-goals that are more concrete so you don’t get discouraged. Some examples of concrete and achievable goals: —Learn to do one pullup— Squat the equivalent of my bodyweight— Run a 5k in under 30 minutes— Learn to do 10 strict pushups— Learn to bench the barbell A concrete goal also doesn’t have to be an event; it can be a new habit, as long as that habit has concrete parameters. 10 years ago, right around this time of year, in fact, I decided I was going to start running 3 times a week for 15 minutes. I couldn’t even make it the whole 15 minutes, when I started, but at first I committed to at least being outside and moving for 15 minutes. And then I committed to going at least a mile and a half of distance, whether I ran or walked. Then it was 20 minutes. Then it was 30. I STILL wish I’d skipped all this nonsense and just done something similar with lifting but the point is, start slowly, but start. You don’t even have to do it indefinitely! Say you’ll do it for a month or six weeks or three months and then reassess. More examples: — Go to the gym 30 minutes 3 times a week for 12 weeks— Complete a 12-week 10k training program— Complete Couch-to-5k— Do Stronglifts for 12 weeks— Do Starting Strength for 12 weeks— Park at the back of the parking lot and walk into the mall, every time— Take stairs two at a time, every time— Get a pullup bar and do a negative every time you cross the doorway for 12 weeks—Stretch for 20 minutes right after you wake up and before you go to work While goals should be meaningful, I almost like them better when they are almost… entirely detached from yourself, in a way. For instance, when I cut fat or bulk, I have a general sense of how many pounds I want to lose or gain. But if that alone were the goal, I could do it any number of insane ways — stop eating, or eat only Oreos. My real goals are day by day — hit my calorie and macro goals within reason — and week by week — do my four-day-a-week lifting program. The number on the scale (and progress photos) provide a rough stopping point in either direction, but they’re not my focus. In the same way, you may have a goal of, I don’t know, “have arms like Michelle Obama,” lord knows we all do. But you can make a sub-goal of “learn to do a pullup” knowing it will put you on that general path, and a sub-sub-goal of “do my pullup negative sets three times a week” knowing it will put you on that slightly more specific path. Since you’re already here I’ll use the words I have left to try and incept the idea that getting into lifting will be fun and good into your brain. Here is how to actually go to the gym, here is how to learn, here is how to eat. Don’t be afraid of good foods or bad men or getting bulky and above all, be patient and trust the process. Gains may come slowly, but they will come. Got a question for A Swole Woman? Email swole@thehairpin.com. You can also follow her on Instagram or Facebook. ", "title": "Ask A Swole Woman: Do My Workouts Have To Be Hardcore?", "sentences": [{"9cf5": "Ask A Swole Woman: Do My Workouts Have To Be Hardcore?"}, {"4cb0": "Treasuring rest days and making your goals more specific."}, {"93fc": "I have a hard time maintaining moderation in the way I think about fitness. Even when I’m looking up workouts and programs online, it seems like the only path is HARDCORE SCULPT YOUR BODY TO PERFECTION. How can I shape a fitness routine that shows results, makes me feel healthy, but doesn’t take over my life?"}, {"75ea": "Love that you guys are doing this!! Thanks!"}, {"0ef2": "— Alex"}, {"9792": "Woof, I hate the hardcore mindset. The rise of #nodaysoff troubles me greatly. We give some issues and addictions more of a pass than others, but it seems not good to be afraid to take even a single day off from working out or eating “clean” or whatever it is one is supposed to do every single day in perpetuity. Or perhaps you mean all of the workout programs that persist by being so ridiculously hard, no one can complete them and then feel like they have no one to blame but themselves (*ahem* P90x, Insanity, et al.)."}, {"ed28": "In my personal experience there is a sweet spot with intensity. The times I regret the most are the ones I spent doing some confusingly complicated, but not sufficiently intense, workout that somehow simultaneously hurt, was boring, and yielded no results. But it is also possible to work out too much, sabotage your results, and waste time. Bodies are a little mysterious and not very well-studied when it comes to exercise, but just to pick an example out of the pile, Stronger By Science cites a couple studies here where people were able to make the same gains whether they lifted heavy for many weeks straight vs lifting a few weeks on, a few weeks off. This doesn’t apply to every type of exercise, but still, there is ample evidence that when it comes to muscles and your body, rest and recovery matters a lot."}, {"9b91": "All this said, it is possible to get results from lifting without committing either a lot of hours or, in my opinion, even a lot of effort. Here is my favorite reddit post to that effect. I did a very similar program when I started lifting, and I felt the effects really quickly! Turns out food gives you energy, and being even slightly stronger makes it easier to do basic things like carry bags from the grocery store. You know when people say “lift with your legs, not your back”? This never made any sense to me, but it turns out that was because my legs were noodles, even though I was running half-marathons on the reg. Having done deadlifts allowed me, finally, to actually pick up a box correctly. I no longer live in fear of the giant boxes of litter my cat and budget demand, and it’s really something."}, {"b503": "But before I get ahead of myself, there is a problem: “shows results” and “makes me feel healthy” are pretty vague goals, which is maybe part of your issue. What results? Gain muscle? Lose fat? Gain strength? Gain size? How much? What does “feeling healthy” feel like? Like you can bend down and pick something up without it hurting? Lean over and grab something without falling over? Carry 50lbs 100 feet without your arms hurting? Run up 3 flights of stairs without getting winded?"}, {"f34c": "If the last couple decades of productivity literature and lifehacking have taught us anything, it’s that we are vastly more likely to accomplish a goal the more concrete it is. How realistic the goal is plays a role, too, but that has to do a little more with self-knowledge than how tangible a goal is. “Feel healthy” is about as vague as it gets; it’s even vaguer than “be healthy,” which at least a doctor could affirm by like, taking a blood panel and your blood pressure and asking if anything hurts."}, {"026c": "So you need to firm this up somehow. It almost doesn’t matter what the goal is, except that you must be able to muster some care about it and it should be achievable in the near term; let’s say less than a year. Here is another goal:"}, {"4a97": "— Look like Gisele Bundchen"}, {"a753": "Ok, this is a bad goal: specific body type gotten by not only probably years of effort but through the combined effort of a full-time staff. I won’t say this is impossible (even though it is), but even if it weren’t, it should be broken down into a lot of sub-goals that are more concrete so you don’t get discouraged."}, {"d7a0": "Some examples of concrete and achievable goals:"}, {"57dd": "—Learn to do one pullup— Squat the equivalent of my bodyweight— Run a 5k in under 30 minutes— Learn to do 10 strict pushups— Learn to bench the barbell"}, {"8ea7": "A concrete goal also doesn’t have to be an event; it can be a new habit, as long as that habit has concrete parameters. 10 years ago, right around this time of year, in fact, I decided I was going to start running 3 times a week for 15 minutes. I couldn’t even make it the whole 15 minutes, when I started, but at first I committed to at least being outside and moving for 15 minutes. And then I committed to going at least a mile and a half of distance, whether I ran or walked. Then it was 20 minutes. Then it was 30. I STILL wish I’d skipped all this nonsense and just done something similar with lifting but the point is, start slowly, but start. You don’t even have to do it indefinitely! Say you’ll do it for a month or six weeks or three months and then reassess."}, {"43e9": "More examples:"}, {"ba98": "— Go to the gym 30 minutes 3 times a week for 12 weeks— Complete a 12-week 10k training program— Complete Couch-to-5k— Do Stronglifts for 12 weeks— Do Starting Strength for 12 weeks— Park at the back of the parking lot and walk into the mall, every time— Take stairs two at a time, every time— Get a pullup bar and do a negative every time you cross the doorway for 12 weeks—Stretch for 20 minutes right after you wake up and before you go to work"}, {"3b15": "While goals should be meaningful, I almost like them better when they are almost… entirely detached from yourself, in a way. For instance, when I cut fat or bulk, I have a general sense of how many pounds I want to lose or gain. But if that alone were the goal, I could do it any number of insane ways — stop eating, or eat only Oreos. My real goals are day by day — hit my calorie and macro goals within reason — and week by week — do my four-day-a-week lifting program. The number on the scale (and progress photos) provide a rough stopping point in either direction, but they’re not my focus."}, {"da9a": "In the same way, you may have a goal of, I don’t know, “have arms like Michelle Obama,” lord knows we all do. But you can make a sub-goal of “learn to do a pullup” knowing it will put you on that general path, and a sub-sub-goal of “do my pullup negative sets three times a week” knowing it will put you on that slightly more specific path."}, {"1334": "Since you’re already here I’ll use the words I have left to try and incept the idea that getting into lifting will be fun and good into your brain. Here is how to actually go to the gym, here is how to learn, here is how to eat. Don’t be afraid of good foods or bad men or getting bulky and above all, be patient and trust the process. Gains may come slowly, but they will come."}, {"7182": "Got a question for A Swole Woman? Email swole@thehairpin.com. You can also follow her on Instagram or Facebook."}], "child": "487_1\t487_2\t487_3\t487_4487_1\t487_2\t487_3\t487_4"}