{"name": "488", "parent": "", "content": "16 Signs You’re Doing Much Better Than You Think You Are You have time to do things you enjoy. Whether you enjoy vigorous sports, binge watching Netflix, reading, cooking or getting coffee with friends, you have choice and thats powerful. You’re alive in the Computer Age. There has been so many profound advancements made in tech during the last decade. And those improvements compound over time leading to a far more exciting future. It’s an invigorating time to be alive! You know how to take care of yourself. Some people like massages. Others like going to see a match. Cooking your favourite food or sitting down to read a book. You know what you like, and you like that you can and should take care of yourself. You have at least one or two best friends. You know those people that you can talk to about anything. Who won’t judge or ridicule you. Who make you laugh and cry (with laughter). Yes, those people you thought of while reading this paragraph! You’ve achieved something worthwhile. It could be that you have a job that pays enough for you to live comfortably. Maybe you were in the Olympics. You have wonderful kids. A great family. You’re the best quiz master you know, or one of the best. You have a six pack. Started a successful business. The possibilities are endless, and the more you think, the more big/small things you realise that you’ve achieved. You can afford expensive coffee, new shoes, cinema tickets and so on. You are privileged in one way or another and you don’t live in poverty. You can treat yourself every now and then, at least. The fact is, treating yourself does not have to involve money. You have a space of your own. It could be your office at work, your bedroom, sitting room/kitchen, your car, the gym or the local park. In that space you are completely in charge and it feels good. You sense when somethings wrong. When your teammate is off-form. When your spouse needs a hand. When your friend/family member is worried. You’re not oblivious to the people around you and you have some sense of body language and you know what you should do in a lot of situations within a few seconds of analysis. You’ve loved and lost. Most people have loved or at least fancied someone and some point in their past where it didn’t work out. Thats normal and necessary. You appreciate that love is a fragile thing. That you shouldn’t play with it. You’ve gained experience and you will bring that wisdom into your next relationship. You’re a different person than you were last year. You learned so much, noticed so much, done so much that has definitely been of benefit in one way or another. Only focus on whats useful in your past, otherwise acknowledge and move on. You are free. Even if you have kids, are married, have a large mortgage, a time-consuming job/business or all of the above. You’re free to make your own decisions. While you make many decisions to ensure not only you will benefit, you are still the one making them. The fact that you take other peoples best interests into consideration just means you’re a great person! You have learned so much throughout your life, so far. You’ve done good and bad things. You know whats right and whats wrong. You know what you can do and what you should do. You make constructive decisions based on wisdom & experience every day and you don’t even realise it. You like to laugh a lot and sometime you still feel a little silly inside. For example, you laugh when someones spills their popcorn or when your friend is having a bad hair day and it bothers them (it’s not really a problem at all). You know that you don’t have to be 100% focused all the time. You know that you have the time to make or receive jokes. You’re not the terminator. You have more clothes than you need! You have clothes that you feel comfortable in. You have clothes that you love wearing on special occasions. Your shoes don’t have holes in them. Understand that in this moment, you are far more fortunate than tens of millions of other people across the world. Let that sink in for a minute. Do something about it. You’re working towards a goal. A raise. A new car. Braces for the kids, a ring, a holiday, knowledge, power whatever it may be. You may not want to work that hard to achieve your goal sometimes, but you still have at least one, and you are inevitably moving in the direction of reaching it. You have the strength to be happy. You have a mind that bends to your will. You can be positive. and you can turn around difficult situations. You don’t have to let others tell you what you’re worth or ask for permission to be happy from anyone. You are in charge of your happiness. ", "title": "16 Signs You’re Doing Much Better Than You Think You Are", "sentences": [{"0b5e": "16 Signs You’re Doing Much Better Than You Think You Are"}, {"8352": "You have time to do things you enjoy. Whether you enjoy vigorous sports, binge watching Netflix, reading, cooking or getting coffee with friends, you have choice and thats powerful."}, {"daa2": "You’re alive in the Computer Age. There has been so many profound advancements made in tech during the last decade. And those improvements compound over time leading to a far more exciting future. It’s an invigorating time to be alive!"}, {"127c": "You know how to take care of yourself. Some people like massages. Others like going to see a match. Cooking your favourite food or sitting down to read a book. You know what you like, and you like that you can and should take care of yourself."}, {"4010": "You have at least one or two best friends. You know those people that you can talk to about anything. Who won’t judge or ridicule you. Who make you laugh and cry (with laughter). Yes, those people you thought of while reading this paragraph!"}, {"1d12": "You’ve achieved something worthwhile. It could be that you have a job that pays enough for you to live comfortably. Maybe you were in the Olympics. You have wonderful kids. A great family. You’re the best quiz master you know, or one of the best. You have a six pack. Started a successful business. The possibilities are endless, and the more you think, the more big/small things you realise that you’ve achieved."}, {"00a7": "You can afford expensive coffee, new shoes, cinema tickets and so on. You are privileged in one way or another and you don’t live in poverty. You can treat yourself every now and then, at least. The fact is, treating yourself does not have to involve money."}, {"071f": "You have a space of your own. It could be your office at work, your bedroom, sitting room/kitchen, your car, the gym or the local park. In that space you are completely in charge and it feels good."}, {"14b7": "You sense when somethings wrong. When your teammate is off-form. When your spouse needs a hand. When your friend/family member is worried. You’re not oblivious to the people around you and you have some sense of body language and you know what you should do in a lot of situations within a few seconds of analysis."}, {"69f9": "You’ve loved and lost. Most people have loved or at least fancied someone and some point in their past where it didn’t work out. Thats normal and necessary. You appreciate that love is a fragile thing. That you shouldn’t play with it. You’ve gained experience and you will bring that wisdom into your next relationship."}, {"2d62": "You’re a different person than you were last year. You learned so much, noticed so much, done so much that has definitely been of benefit in one way or another. Only focus on whats useful in your past, otherwise acknowledge and move on."}, {"c5f0": "You are free. Even if you have kids, are married, have a large mortgage, a time-consuming job/business or all of the above. You’re free to make your own decisions. While you make many decisions to ensure not only you will benefit, you are still the one making them. The fact that you take other peoples best interests into consideration just means you’re a great person!"}, {"9c0b": "You have learned so much throughout your life, so far. You’ve done good and bad things. You know whats right and whats wrong. You know what you can do and what you should do. You make constructive decisions based on wisdom & experience every day and you don’t even realise it."}, {"1e17": "You like to laugh a lot and sometime you still feel a little silly inside. For example, you laugh when someones spills their popcorn or when your friend is having a bad hair day and it bothers them (it’s not really a problem at all). You know that you don’t have to be 100% focused all the time. You know that you have the time to make or receive jokes. You’re not the terminator."}, {"646c": "You have more clothes than you need! You have clothes that you feel comfortable in. You have clothes that you love wearing on special occasions. Your shoes don’t have holes in them. Understand that in this moment, you are far more fortunate than tens of millions of other people across the world. Let that sink in for a minute. Do something about it."}, {"8894": "You’re working towards a goal. A raise. A new car. Braces for the kids, a ring, a holiday, knowledge, power whatever it may be. You may not want to work that hard to achieve your goal sometimes, but you still have at least one, and you are inevitably moving in the direction of reaching it."}, {"c9a8": "You have the strength to be happy. You have a mind that bends to your will. You can be positive. and you can turn around difficult situations. You don’t have to let others tell you what you’re worth or ask for permission to be happy from anyone. You are in charge of your happiness."}], "child": "488_1\t488_2\t488_3\t488_4\t488_5\t488_6\t488_7\t488_8\t488_9\t488_10\t488_11\t488_12\t488_13\t488_14\t488_15\t488_16\t488_17"}