{"name": "499", "parent": "", "content": "What it Means to Have a Product-First Company Looking at the likes of Stripe, Slack, Evernote or MailChimp, you can begin to understand the meaning of a product-first organization. It’s not a website tagline or value statement, but a culture they’ve embraced that places innovation and user experience above all else. I’ve spoken, read and heard from dozens of product founders and was blown away after learning of the creativity and team alignment that can spawn from an inspiring product vision. But, how do you know if you’re a product-first company? Is it inherently in your DNA? Is there a secret recipe that one could follow to get there? I’ve found that common denominators tie these companies together. They have similar challenges and team backgrounds. They have moments of triumph and setbacks revealing weakness. Whether you’re developing a disruptive new product or driving a well-established corporation, the product-first mindset is equally applicable. My hope is that by continuing to absorb advice from other incredible product companies, while building one of my own, we can all learn from these examples together. So, without further ado, here’s what I’ve learned it means to have a product-first company, both from my trials and observations, and that of others. The Makeup of a Product-First Company Product-Minded Leadership Team Product companies are generally dominated by product teams (e.g. engineering, user experience and product experts) and leadership has a background in product rather than business or sales. This is important to distinguish because product founders will have different priorities than a sales founder. A sales founder loves the thrill of new customer acquisition, while figuring out how to scale and penetrate markets. He/she will focus on hiring experienced sales and marketing teams first to communicate and sell the value. This works in many cases and fails in others. Take Microsoft’s Steve Ballmer as an example of a major fail, resulting in one of the biggest missed opportunities of the decade! In contrast, a product founder loves the thrill of perpetual innovation; look to good ol’ Steve Jobs for an example worth emulating. He built an organization entirely dedicated to delivering the best products! These founders have a strong, clearly communicated vision and focus on hiring people who value the product-first approach, nurturing this as the company scales. Ben Horowitz wrote a great piece on why they prefer funding companies with founding CEOs at Andreessen Horowitz. In it, he describes: Founding CEOs are excellent at finding, but not maximizing, product cycles. Our experience shows — and the data supports — that teaching a founding CEO how to maximize the product cycle is easier than teaching the professional CEO how to find the new product cycle. The reason being that innovation is the core competency of any business, and founding CEOs, like Steve, built their company by overcoming doubt and having the courage to push innovative ideas to the forefront. They had to believe in their product, understand the technology required, what code base was needed to make it happen and how to overcome market challenges to bring their idea to life. A product-driven leadership team will do the same — leveraging the knowledge at their disposal to identify and maximize new product cycles while keeping innovation alive. Product Engagement Drives Conversions Product-first companies have confidence in what they’ve built and, as a result, in offering a low barrier to entry. Often running a freemium model, they trust that the right people using and experiencing the product will purchase. The focus is long-term over short-term gain and with this, you’ll see things like flexible pricing terms, month-to-month contracts and free trials. Look at Dropbox, SendGrid or Asana, for example. These companies optimize for PQLs (product-qualified leads) over MQLs (marketing-qualified leads) or SQLs (sales-qualified leads). In the PQL model, the traditional lead funnel is flipped, starting instead with product adoption. Rather than combing through a massive database of contacts or identifying a select group of prospects, users qualify themselves by product usage and engagement. Another great example is Github’s recent price reduction for repositories. They adjusted their pricing model to allow individuals to create an unlimited number of non-open source projects with the ability to invite collaborators. Strategies like these promote stickiness and encourage the sharing and collaboration that drive success. As Phil Libin, Evernote CEO, said: The easiest way to get one million people paying is to get one billion people using!” But, getting the traction to reach that one billion users begins with a deep understanding of the product value and bringing users to that “aha!” moment as quickly as possible. The outcome is that product-first companies are beloved companies! They have to be. There’s no immediate pressure for users to become customers which automatically builds trust and loyalty. Once users see value, growth is generated by cultivating an experience that turns users into customers and customers into promoters. Leveraging these promoters, product-first companies can scale organically, by offering a taste of the product and “wow-ing” users with the experience. Cross-Company Alignment on Mission Having a product-first company requires a clearly defined, laser-focused mission at the forefront of all decision making. Creative thinking, collaboration and an intense thirst for disruption is welcomed and permeates throughout all levels of the organization. While every feature in the roadmap is designed to delight users and create better experiences, leadership teams must make difficult decisions to stay on track. There are times when a customer must be “fired” in exchange for putting the product vision first. This doesn’t mean customer feedback is ignored, but instead, accepted and incorporated into the roadmap when it aligns with the mission. This is unique, so I’ll say it again. Instead of shaping the product to appeal to the request of a high-paying or demanding customer, product-first companies may have to say “no” if the request doesn’t match their core value proposition or fit into the scope of your existing priorities. A friend of mine refers to this scenario as “feature blackmail” and it’s actually a common startup pitfall. There will be cases when a big customer or prospect comes and threatens to not renew, or become a customer, if you don’t develop a specific feature they’re requesting. This is “feature blackmail” and you shouldn’t fall for it. It’s never easy to turn down a potential paycheck but ultimately, it all goes back to long-term over short-term gain. Good leadership will focus on building features that map to and complement the vision. They know when to compromise and how to avoid derailing the roadmap if it doesn’t make the product stronger for their primary audience. The Challenges with Product-first In business, product-first isn’t always the winner. It’s prone to mistakes, with plenty of room for error and it’s easy to stumble in the wrong direction. If you have a product-minded leadership team, product engagement driving conversions and cross-company alignment on your mission — you’re well on your way to being a product-first company. But, getting it all right requires incredible execution and nothing less. As Slack’s CEO Stewart Butterfield described in a memo back in 2013: Even the best slogans, ads, landing pages, PR campaigns, etc., will fall down if they are not supported by the experience people have when they hit our site, when they sign up for an account, when they first begin using the product and when they start using it day in, day out. The advantage being that when it’s done right, there’s an opportunity to scale significantly faster than sales-driven companies, with higher margins and returns — the product will sell itself! You’ll have created a brand worth talking about, with a compelling vision that differentiates your company from the rest. All of this from having the passion and courage to build a product-first company. ", "title": "What it Means to Have a Product-First Company", "sentences": [{"6abe": "What it Means to Have a Product-First Company"}, {"ec3d": "Looking at the likes of Stripe, Slack, Evernote or MailChimp, you can begin to understand the meaning of a product-first organization. It’s not a website tagline or value statement, but a culture they’ve embraced that places innovation and user experience above all else."}, {"9d6b": "I’ve spoken, read and heard from dozens of product founders and was blown away after learning of the creativity and team alignment that can spawn from an inspiring product vision. But, how do you know if you’re a product-first company? Is it inherently in your DNA? Is there a secret recipe that one could follow to get there?"}, {"c8c8": "I’ve found that common denominators tie these companies together. They have similar challenges and team backgrounds. They have moments of triumph and setbacks revealing weakness. Whether you’re developing a disruptive new product or driving a well-established corporation, the product-first mindset is equally applicable."}, {"7311": "My hope is that by continuing to absorb advice from other incredible product companies, while building one of my own, we can all learn from these examples together. So, without further ado, here’s what I’ve learned it means to have a product-first company, both from my trials and observations, and that of others."}, {"ee6e": "The Makeup of a Product-First Company"}, {"6496": "Product-Minded Leadership Team"}, {"8ad0": "Product companies are generally dominated by product teams (e.g. engineering, user experience and product experts) and leadership has a background in product rather than business or sales. This is important to distinguish because product founders will have different priorities than a sales founder."}, {"70cb": "A sales founder loves the thrill of new customer acquisition, while figuring out how to scale and penetrate markets. He/she will focus on hiring experienced sales and marketing teams first to communicate and sell the value. This works in many cases and fails in others. Take Microsoft’s Steve Ballmer as an example of a major fail, resulting in one of the biggest missed opportunities of the decade!"}, {"2707": "In contrast, a product founder loves the thrill of perpetual innovation; look to good ol’ Steve Jobs for an example worth emulating. He built an organization entirely dedicated to delivering the best products! These founders have a strong, clearly communicated vision and focus on hiring people who value the product-first approach, nurturing this as the company scales."}, {"95df": "Ben Horowitz wrote a great piece on why they prefer funding companies with founding CEOs at Andreessen Horowitz. In it, he describes:"}, {"a9fe": "Founding CEOs are excellent at finding, but not maximizing, product cycles. Our experience shows — and the data supports — that teaching a founding CEO how to maximize the product cycle is easier than teaching the professional CEO how to find the new product cycle."}, {"3f35": "The reason being that innovation is the core competency of any business, and founding CEOs, like Steve, built their company by overcoming doubt and having the courage to push innovative ideas to the forefront. They had to believe in their product, understand the technology required, what code base was needed to make it happen and how to overcome market challenges to bring their idea to life."}, {"fdc4": "A product-driven leadership team will do the same — leveraging the knowledge at their disposal to identify and maximize new product cycles while keeping innovation alive."}, {"19fc": "Product Engagement Drives Conversions"}, {"ec51": "Product-first companies have confidence in what they’ve built and, as a result, in offering a low barrier to entry. Often running a freemium model, they trust that the right people using and experiencing the product will purchase. The focus is long-term over short-term gain and with this, you’ll see things like flexible pricing terms, month-to-month contracts and free trials."}, {"ba3d": "Look at Dropbox, SendGrid or Asana, for example. These companies optimize for PQLs (product-qualified leads) over MQLs (marketing-qualified leads) or SQLs (sales-qualified leads)."}, {"67fa": "In the PQL model, the traditional lead funnel is flipped, starting instead with product adoption. Rather than combing through a massive database of contacts or identifying a select group of prospects, users qualify themselves by product usage and engagement."}, {"6200": "Another great example is Github’s recent price reduction for repositories. They adjusted their pricing model to allow individuals to create an unlimited number of non-open source projects with the ability to invite collaborators. Strategies like these promote stickiness and encourage the sharing and collaboration that drive success."}, {"7a4e": "As Phil Libin, Evernote CEO, said:"}, {"5bfc": "The easiest way to get one million people paying is to get one billion people using!”"}, {"913c": "But, getting the traction to reach that one billion users begins with a deep understanding of the product value and bringing users to that “aha!” moment as quickly as possible."}, {"00bc": "The outcome is that product-first companies are beloved companies! They have to be. There’s no immediate pressure for users to become customers which automatically builds trust and loyalty. Once users see value, growth is generated by cultivating an experience that turns users into customers and customers into promoters. Leveraging these promoters, product-first companies can scale organically, by offering a taste of the product and “wow-ing” users with the experience."}, {"d4f1": "Cross-Company Alignment on Mission"}, {"1cdd": "Having a product-first company requires a clearly defined, laser-focused mission at the forefront of all decision making. Creative thinking, collaboration and an intense thirst for disruption is welcomed and permeates throughout all levels of the organization."}, {"ae25": "While every feature in the roadmap is designed to delight users and create better experiences, leadership teams must make difficult decisions to stay on track. There are times when a customer must be “fired” in exchange for putting the product vision first. This doesn’t mean customer feedback is ignored, but instead, accepted and incorporated into the roadmap when it aligns with the mission."}, {"9963": "This is unique, so I’ll say it again. Instead of shaping the product to appeal to the request of a high-paying or demanding customer, product-first companies may have to say “no” if the request doesn’t match their core value proposition or fit into the scope of your existing priorities."}, {"095e": "A friend of mine refers to this scenario as “feature blackmail” and it’s actually a common startup pitfall. There will be cases when a big customer or prospect comes and threatens to not renew, or become a customer, if you don’t develop a specific feature they’re requesting. This is “feature blackmail” and you shouldn’t fall for it."}, {"f83a": "It’s never easy to turn down a potential paycheck but ultimately, it all goes back to long-term over short-term gain. Good leadership will focus on building features that map to and complement the vision. They know when to compromise and how to avoid derailing the roadmap if it doesn’t make the product stronger for their primary audience."}, {"fe90": "The Challenges with Product-first"}, {"0a7e": "In business, product-first isn’t always the winner. It’s prone to mistakes, with plenty of room for error and it’s easy to stumble in the wrong direction. If you have a product-minded leadership team, product engagement driving conversions and cross-company alignment on your mission — you’re well on your way to being a product-first company. But, getting it all right requires incredible execution and nothing less."}, {"5de4": "As Slack’s CEO Stewart Butterfield described in a memo back in 2013:"}, {"d1a5": "Even the best slogans, ads, landing pages, PR campaigns, etc., will fall down if they are not supported by the experience people have when they hit our site, when they sign up for an account, when they first begin using the product and when they start using it day in, day out."}, {"851c": "The advantage being that when it’s done right, there’s an opportunity to scale significantly faster than sales-driven companies, with higher margins and returns — the product will sell itself! You’ll have created a brand worth talking about, with a compelling vision that differentiates your company from the rest. All of this from having the passion and courage to build a product-first company."}], "child": "499_1\t499_2"}