{"name": "501", "parent": "", "content": "The Founder’s Guide to Startup Growth As a Growth Marketer, I’m fortunate to have had the opportunity to work with a number of startup founders and growth experts that have defied the odds and developed their product market fit. This post is about how to monitor and measure your user growth as a part of your operating process and develop the right positioning of your product. Through my journey of interviewing and analyzing what differentiates each person from one another, I would like to share some of my top takeaways. What you measure is what you end up optimizing for. Which is why defining and accounting metrics that represents growth is important. Measure Your Growth Many early stage startups are put in a situation where they are not able to diligently look at their retention. As a result they trick themselves into thinking they have product-market fit when they really don’t. For example, say you’ve run a variety of strategies to acquire more users and your top line monthly active user is showing 12% MoM growth which is impressive. But the important question is “How is it growing?” In order to answer these questions, always try to go one step deeper to understand the nature of the growth. Sample MAU Growth Accounting : Diligence at Social Capital By dividing your overall growth into the following elements, you’ll get a better understanding of your MAU. A user who has registered and is not active in your product is probably not getting much value and is probably not a good indication of product-market fit. In this example, you are losing as much as users as you are gaining. It’s easier to increase customer base from the top of the funnel however, but to create a sustainable business model, you need to fix underlying churn problem. User accounting can be measured with a simple formula: Understand Where You Are at Today When you’re in the early stages of startup growth, it’s intimidating to think about the endless list of to-dos. What should you focus on? Activation or retention? How do you know which one to choose assuming you can’t work on both given limited resources? In a lot of companies, you end up with people working on different things with a different focus. It’s critical to narrow your focus and define a metric that is uniquely tied to the business value of the company. To make that decision easier, use data to understand where you are at today with all areas of the growth funnel. Growth Hacking Guide by Kent Kajitani Know that this is only an example and every product has different metrics and stages to break it down. Then you can really track your key metrics on a day-to-day, week-over-week and month-over-month basis. From there, ask questions and make an educated prediction of where you think you can improve. For example, what are the drivers to improve the defined KPI on a short term and long term? How likely is it that more people will convert to using your product on a frequent basis? How likely they are to stay on your product versus churn out? Etc. Credit : https://www.apptentive.com Mindset Growth is about doing business fundamentals well, not finding one sneaky “hack” for exponential growth. It’s driven by a dedicated team of process-oriented and creative people in product, design, engineering and data analysis. They experiment — brainstorm, prioritize, test, implement, and systemize over and over. Moving repeatedly through this cycle very quickly, brings the incremental lifts that drive compound growth over time. It requires steady efforts to discover what drives your most engaged users to fall so in love with your product. Having a durable mechanism for getting more active users matters more than the actual number of users you have. The goal is to eventually create deep, long-lasting network effects. For more details I highly recommend you to go through the series of Diligence at Social Capital by Jonathan Hsu, the Partner, Head of Data Science at Social Capital. With that being said, I leave you with a meta reminder : What you measure is what you end up optimizing for. Which is why defining and accounting metrics that represents growth is important. (Click to Tweet) Author Kazsa Tamai - I’m a CPA and Growth Marketer at Tradecraft specializing in helping startups defining growth strategies and execute on tactics. I love exploring and creating channels for passionate communities to engage with a product. Feel free to contact me @kazsatamai or email me at kazsa@tradecrafted.com. ", "title": "The Founder’s Guide to Startup Growth", "sentences": [{"fa4b": "The Founder’s Guide to Startup Growth"}, {"0556": "As a Growth Marketer, I’m fortunate to have had the opportunity to work with a number of startup founders and growth experts that have defied the odds and developed their product market fit."}, {"cb2f": "This post is about how to monitor and measure your user growth as a part of your operating process and develop the right positioning of your product."}, {"ec2f": "Through my journey of interviewing and analyzing what differentiates each person from one another, I would like to share some of my top takeaways."}, {"53fa": "What you measure is what you end up optimizing for. Which is why defining and accounting metrics that represents growth is important."}, {"c126": "Measure Your Growth"}, {"476b": "Many early stage startups are put in a situation where they are not able to diligently look at their retention. As a result they trick themselves into thinking they have product-market fit when they really don’t."}, {"834d": "For example, say you’ve run a variety of strategies to acquire more users and your top line monthly active user is showing 12% MoM growth which is impressive."}, {"b0ef": "But the important question is “How is it growing?”"}, {"166f": "In order to answer these questions, always try to go one step deeper to understand the nature of the growth."}, {"f884": "Sample MAU Growth Accounting : Diligence at Social Capital"}, {"ae2e": "By dividing your overall growth into the following elements, you’ll get a better understanding of your MAU."}, {"2bb4": "A user who has registered and is not active in your product is probably not getting much value and is probably not a good indication of product-market fit."}, {"cd8b": "In this example, you are losing as much as users as you are gaining. It’s easier to increase customer base from the top of the funnel however, but to create a sustainable business model, you need to fix underlying churn problem."}, {"37dd": "User accounting can be measured with a simple formula:"}, {"2815": "Understand Where You Are at Today"}, {"842a": "When you’re in the early stages of startup growth, it’s intimidating to think about the endless list of to-dos. What should you focus on? Activation or retention? How do you know which one to choose assuming you can’t work on both given limited resources?"}, {"b75a": "In a lot of companies, you end up with people working on different things with a different focus."}, {"ce35": "It’s critical to narrow your focus and define a metric that is uniquely tied to the business value of the company. To make that decision easier, use data to understand where you are at today with all areas of the growth funnel."}, {"150a": "Growth Hacking Guide by Kent Kajitani"}, {"b163": "Know that this is only an example and every product has different metrics and stages to break it down."}, {"3492": "Then you can really track your key metrics on a day-to-day, week-over-week and month-over-month basis. From there, ask questions and make an educated prediction of where you think you can improve. For example, what are the drivers to improve the defined KPI on a short term and long term? How likely is it that more people will convert to using your product on a frequent basis? How likely they are to stay on your product versus churn out? Etc."}, {"13a7": "Credit : https://www.apptentive.com"}, {"8212": "Mindset"}, {"2f2a": "Growth is about doing business fundamentals well, not finding one sneaky “hack” for exponential growth. It’s driven by a dedicated team of process-oriented and creative people in product, design, engineering and data analysis."}, {"3011": "They experiment — brainstorm, prioritize, test, implement, and systemize over and over. Moving repeatedly through this cycle very quickly, brings the incremental lifts that drive compound growth over time. It requires steady efforts to discover what drives your most engaged users to fall so in love with your product."}, {"e8a4": "Having a durable mechanism for getting more active users matters more than the actual number of users you have. The goal is to eventually create deep, long-lasting network effects."}, {"153c": "For more details I highly recommend you to go through the series of Diligence at Social Capital by Jonathan Hsu, the Partner, Head of Data Science at Social Capital."}, {"6130": "With that being said, I leave you with a meta reminder :"}, {"e4b2": "What you measure is what you end up optimizing for. Which is why defining and accounting metrics that represents growth is important. (Click to Tweet)"}, {"bde9": "Author"}, {"404b": "Kazsa Tamai - I’m a CPA and Growth Marketer at Tradecraft specializing in helping startups defining growth strategies and execute on tactics. I love exploring and creating channels for passionate communities to engage with a product. Feel free to contact me @kazsatamai or email me at kazsa@tradecrafted.com."}], "child": "501_1\t501_2\t501_3\t501_4\t501_5\t501_6\t501_7\t501_8501_1\t501_2\t501_3\t501_4\t501_5\t501_6\t501_7\t501_8501_1\t501_2\t501_3\t501_4\t501_5\t501_6\t501_7\t501_8"}