{"name": "505", "parent": "", "content": "WTF is Strategy? A Primer to Strategy in Layman’s Terms “Strategy” — one of those words folks like to throw around to sound important. “We need a strategy…” or “what’s the strategy?” an executive may say. Everyone in the room nods in agreement. “Yeah, we need a better strategy.” Except half the room can’t describe what strategy is or how to get one. Jokes aside, strategy is in fact very important. For those who don’t constantly think about it or haven’t been exposed to a lot of it, strategy can often be confusing at best and intimidating at worst. Due to its abstract nature, strategy is also difficult to teach and impart on others. (Negative) Impact of (the Lack of) Strategic Thinking on Teams and Individuals Strategic thinking is often what sets senior members of a team apart from the junior folks. Within one’s career trajectory, I have observed that acquiring “strategic thinking” skills is among the greatest leaps (i.e. mental shifts) one undergoes. For a Product Manager, you can get really good at the tactical stuff: requirements gathering, prioritization, sprint management. However if you can’t think strategically, you will be hampered when developing a long-term product vision, avoiding the feature factory, and getting executive buy-in on new product ideas. This can prevent you from becoming a Senior Product Manager or Product Leader. On the flip side, if you are managing a team of relatively junior employees who lack strategic thinking skills, you will be left filling the gaps. This becomes a repetitive cycle of a) bearing the burden of developing 100% of the strategy for the group, b) validating (and even worse, second-guessing) everyone’s decisions, and/or c) reminding the team to get out of the weeds and see the forest for the trees. I have experienced both the former and latter situations in my own work. In an effort to train and transform teams to be more strategic, I have developed a simple framework as well as the accompanying analogy and example to help bring more clarity and concreteness to this abstract concept. The Framework Before we talk about strategy, it needs to be contextualized within a few other concepts primarily because strategy never exists (or shouldn’t exist) in isolation. Here are the high-level definitions of the different components from a product-centric view: As the gradient and size of the diagram above suggests, the mission, by design, is both vague and broad. The further down you go in the stack, the more concrete and narrow these concepts become. Strategy within this framework bridges the gap between what you aspire to be and what you are doing. In other words, strategy represents the set of guiding principles for your roadmapping and execution tasks to ensure they align with your mission and vision. Still too vague? Let’s apply the framework to an analogy. The Analogy Let’s say you are planning a road trip. Here’s how each of the concepts above break down: At this stage, you have a very high-level “problem” that needs a “solution,” but there are a lot of different ways to solve the problem. Now you have a clearer idea of what the road trip will be like. And with a bit of key descriptors like “Subaru Forester,” “Portland, Maine,” and “San Diego,” you can begin to paint a mental picture of the trip, making it relatable (e.g. in order to convince someone to join you on the trip). However, we’re still not quite ready to start driving. As you can see, strategies are decisions you make at the onset of your journey to structure your route, but you are also injecting constraints and preferences into the equation. As constraints go, you have limited resources (time, money for gas, etc.). As preferences go, you want to see the great outdoors (you’re in a Subaru Forester after all). With the analogy above, you have effectively prioritized your preferences over your constraints. Agreeing on the strategy up-front also allows you and your trip partners to discuss any future adjustments using a common baseline. With the strategy defined, you can now plan your route with pretty concrete expectations of where you will be at any given point in time. This is also the point you get to choose what degree of detail you want to plan for — from the rough number of miles you want to cover each day (Agile velocity anyone?) to exactly where and when you want to have each of your meals. Note the more specific you are, the more likely you will have to adjust your plan. At this point, you’re using your roadmap as your guide and checking regularly to make sure you’re still on track. If something comes up during the drive (e.g. road closure due to snow), you can revisit and adjust your roadmap (take a detour), and perhaps add to or adjust your strategy as well (avoid smaller roads through higher-elevation areas, even if it takes us into a city). Here’s an interesting point: you can absolutely start driving without a strategy. However, just like building a product without a strategy, you will spend way more time trying to find your way around, perhaps back-tracking, making a major decisions under time constraints, and getting into disagreements with your trip partners. Sure, some spontaneity could indeed be very fun and exciting. However, if you’re going on a trip without a strategy, you’re almost certainly going to end up incurring some costs down the road (pun intended). The Example Moving this framework back to the product world, I want to provide a relevant and concrete example using Tesla. I choose Tesla because a) Elon Musk is rad, b) Musk and Tesla have been unusually public and transparent about their strategy, and c) Tesla is a rare example of a company that has followed-through on their strategy with execution that is down to the “T” (pun also intended). This puts them into a godly territory that is almost difficult to believe. You can see the strategy Tesla and Musk developed has some constraints built into it: a) costs/risk of product development and b) product cost vs. adoption. Musk knew he needed to proof viability (MVP) with a small, costly, and niche electrified Roadster. However, the Roaster would only need to generate enough revenue to carry-on with the mission and vision, plowing all the revenue back into the company to make progressively more affordable and mass-market vehicles. While we unfortunately don’t have insights on their exact roadmap, it’s clear their execution has been going fairly well as evident by their vehicle production volumes and pre-order demand. The Rubber Meeting the Road You may ask: who does all of this work? Depending on the level you’re at, you may have done many or most of these activities already. Here are some typical examples of folks who work on these components: If you are a PM and you lack either visibility or alignment into the mission of the company or the vision for the product, it is an imperative you either develop one yourself and get buy-in, or ask for leaders within your organization to articulate them. That said, unless you’re very early in your career, you should always be striving to think strategically. I hope this has been a useful primer for those who are new to strategy! For those who are well-versed in strategy, I also hope this gives you a structure that ties your experiences together and allows you share this with your teams and colleagues as a means of achieving shared vocabulary. For more Product Management or general business writing, please follow me on Medium or browse my other writing: @vincelawco. I can also be found at my website http://vincelaw.co, on Quora answering product-related questions, or at the PMHQ Slack community if you want to chat informally! ", "title": "WTF is Strategy?", "sentences": [{"4a63": "WTF is Strategy?"}, {"6f35": "A Primer to Strategy in Layman’s Terms"}, {"2d71": "“Strategy” — one of those words folks like to throw around to sound important. “We need a strategy…” or “what’s the strategy?” an executive may say. Everyone in the room nods in agreement. “Yeah, we need a better strategy.” Except half the room can’t describe what strategy is or how to get one."}, {"7d61": "Jokes aside, strategy is in fact very important."}, {"ed05": "For those who don’t constantly think about it or haven’t been exposed to a lot of it, strategy can often be confusing at best and intimidating at worst. Due to its abstract nature, strategy is also difficult to teach and impart on others."}, {"9683": "(Negative) Impact of (the Lack of) Strategic Thinking on Teams and Individuals"}, {"a995": "Strategic thinking is often what sets senior members of a team apart from the junior folks. Within one’s career trajectory, I have observed that acquiring “strategic thinking” skills is among the greatest leaps (i.e. mental shifts) one undergoes."}, {"814b": "For a Product Manager, you can get really good at the tactical stuff: requirements gathering, prioritization, sprint management. However if you can’t think strategically, you will be hampered when developing a long-term product vision, avoiding the feature factory, and getting executive buy-in on new product ideas. This can prevent you from becoming a Senior Product Manager or Product Leader."}, {"e02e": "On the flip side, if you are managing a team of relatively junior employees who lack strategic thinking skills, you will be left filling the gaps. This becomes a repetitive cycle of a) bearing the burden of developing 100% of the strategy for the group, b) validating (and even worse, second-guessing) everyone’s decisions, and/or c) reminding the team to get out of the weeds and see the forest for the trees."}, {"83f5": "I have experienced both the former and latter situations in my own work. In an effort to train and transform teams to be more strategic, I have developed a simple framework as well as the accompanying analogy and example to help bring more clarity and concreteness to this abstract concept."}, {"ad06": "The Framework"}, {"725d": "Before we talk about strategy, it needs to be contextualized within a few other concepts primarily because strategy never exists (or shouldn’t exist) in isolation. Here are the high-level definitions of the different components from a product-centric view:"}, {"65d0": "As the gradient and size of the diagram above suggests, the mission, by design, is both vague and broad. The further down you go in the stack, the more concrete and narrow these concepts become."}, {"fe3b": "Strategy within this framework bridges the gap between what you aspire to be and what you are doing."}, {"8e17": "In other words, strategy represents the set of guiding principles for your roadmapping and execution tasks to ensure they align with your mission and vision."}, {"2f59": "Still too vague? Let’s apply the framework to an analogy."}, {"073e": "The Analogy"}, {"1cfe": "Let’s say you are planning a road trip. Here’s how each of the concepts above break down:"}, {"254f": "At this stage, you have a very high-level “problem” that needs a “solution,” but there are a lot of different ways to solve the problem."}, {"11b6": "Now you have a clearer idea of what the road trip will be like. And with a bit of key descriptors like “Subaru Forester,” “Portland, Maine,” and “San Diego,” you can begin to paint a mental picture of the trip, making it relatable (e.g. in order to convince someone to join you on the trip). However, we’re still not quite ready to start driving."}, {"bc3a": "As you can see, strategies are decisions you make at the onset of your journey to structure your route, but you are also injecting constraints and preferences into the equation. As constraints go, you have limited resources (time, money for gas, etc.). As preferences go, you want to see the great outdoors (you’re in a Subaru Forester after all). With the analogy above, you have effectively prioritized your preferences over your constraints. Agreeing on the strategy up-front also allows you and your trip partners to discuss any future adjustments using a common baseline."}, {"4cbf": "With the strategy defined, you can now plan your route with pretty concrete expectations of where you will be at any given point in time. This is also the point you get to choose what degree of detail you want to plan for — from the rough number of miles you want to cover each day (Agile velocity anyone?) to exactly where and when you want to have each of your meals. Note the more specific you are, the more likely you will have to adjust your plan."}, {"7279": "At this point, you’re using your roadmap as your guide and checking regularly to make sure you’re still on track. If something comes up during the drive (e.g. road closure due to snow), you can revisit and adjust your roadmap (take a detour), and perhaps add to or adjust your strategy as well (avoid smaller roads through higher-elevation areas, even if it takes us into a city)."}, {"9758": "Here’s an interesting point: you can absolutely start driving without a strategy. However, just like building a product without a strategy, you will spend way more time trying to find your way around, perhaps back-tracking, making a major decisions under time constraints, and getting into disagreements with your trip partners. Sure, some spontaneity could indeed be very fun and exciting. However, if you’re going on a trip without a strategy, you’re almost certainly going to end up incurring some costs down the road (pun intended)."}, {"a52e": "The Example"}, {"3450": "Moving this framework back to the product world, I want to provide a relevant and concrete example using Tesla. I choose Tesla because a) Elon Musk is rad, b) Musk and Tesla have been unusually public and transparent about their strategy, and c) Tesla is a rare example of a company that has followed-through on their strategy with execution that is down to the “T” (pun also intended). This puts them into a godly territory that is almost difficult to believe."}, {"6684": "You can see the strategy Tesla and Musk developed has some constraints built into it: a) costs/risk of product development and b) product cost vs. adoption. Musk knew he needed to proof viability (MVP) with a small, costly, and niche electrified Roadster. However, the Roaster would only need to generate enough revenue to carry-on with the mission and vision, plowing all the revenue back into the company to make progressively more affordable and mass-market vehicles."}, {"2c9e": "While we unfortunately don’t have insights on their exact roadmap, it’s clear their execution has been going fairly well as evident by their vehicle production volumes and pre-order demand."}, {"365e": "The Rubber Meeting the Road"}, {"450e": "You may ask: who does all of this work? Depending on the level you’re at, you may have done many or most of these activities already. Here are some typical examples of folks who work on these components:"}, {"5b18": "If you are a PM and you lack either visibility or alignment into the mission of the company or the vision for the product, it is an imperative you either develop one yourself and get buy-in, or ask for leaders within your organization to articulate them."}, {"f877": "That said, unless you’re very early in your career, you should always be striving to think strategically."}, {"455b": "I hope this has been a useful primer for those who are new to strategy!"}, {"37ca": "For those who are well-versed in strategy, I also hope this gives you a structure that ties your experiences together and allows you share this with your teams and colleagues as a means of achieving shared vocabulary."}, {"c8d6": "For more Product Management or general business writing, please follow me on Medium or browse my other writing: @vincelawco. I can also be found at my website http://vincelaw.co, on Quora answering product-related questions, or at the PMHQ Slack community if you want to chat informally!"}], "child": "505_1\t505_2\t505_3\t505_4\t505_5\t505_6\t505_7\t505_8\t505_9\t505_10\t505_11\t505_12\t505_13\t505_14\t505_15\t505_16505_1\t505_2\t505_3\t505_4\t505_5\t505_6\t505_7\t505_8\t505_9\t505_10\t505_11\t505_12\t505_13\t505_14\t505_15\t505_16505_1\t505_2\t505_3\t505_4\t505_5\t505_6\t505_7\t505_8\t505_9\t505_10\t505_11\t505_12\t505_13\t505_14\t505_15\t505_16505_1\t505_2\t505_3\t505_4\t505_5\t505_6\t505_7\t505_8\t505_9\t505_10\t505_11\t505_12\t505_13\t505_14\t505_15\t505_16"}