{"name": "510", "parent": "", "content": "No Really! I Need To Know Your No. Shonda Rhimes had a year of Yes. I, on the other hand, made 2015 my year of NO. Not no, or No but NO. I had a goal (writing my first book) and to achieve that goal, I needed to clear out the clutter, time-sucks, distractions (pleasant and otherwise), optional, nice-to-do-but-not-essential in order to stay focused. Sliding towards Q2 of 2016, I’ve noticed I’ve relaxed my NO to a no or a No, I’m none to happy about it. I’m not listening to my gut, as a result intruders and time wasters have invaded my calendar. OPP (other people’s projects) are increasingly demanding my time. I’m thinking about upgrading to NO again. But before I do, I want to know about your No, so take my survey yes, no or maybe? Yes, it’s short. No, it won’t take much time — and you know you want to know what others are thinking about No. Yes, here’s the survey link again (no, I didn’t think you missed it, I just wanted an excuse to include it again). ", "title": "No Really! I Need To Know Your No.", "sentences": [{"9494": "No Really! I Need To Know Your No."}, {"b262": "Shonda Rhimes had a year of Yes. I, on the other hand, made 2015 my year of NO. Not no, or No but NO. I had a goal (writing my first book) and to achieve that goal, I needed to clear out the clutter, time-sucks, distractions (pleasant and otherwise), optional, nice-to-do-but-not-essential in order to stay focused."}, {"882e": "Sliding towards Q2 of 2016, I’ve noticed I’ve relaxed my NO to a no or a No, I’m none to happy about it. I’m not listening to my gut, as a result intruders and time wasters have invaded my calendar. OPP (other people’s projects) are increasingly demanding my time."}, {"917f": "I’m thinking about upgrading to NO again."}, {"c219": "But before I do, I want to know about your No, so take my survey yes, no or maybe? Yes, it’s short. No, it won’t take much time — and you know you want to know what others are thinking about No."}, {"2cd0": "Yes, here’s the survey link again (no, I didn’t think you missed it, I just wanted an excuse to include it again)."}], "child": "510_1"}