{"name": "513", "parent": "", "content": "Writing When You Feel Overwhelmed Already I have a busy day today. Well, long, anyway. 5 hours of driving, 3 appointments. A ton of tasks to complete. While that might not seem like much, taking out 5 hours of the day compresses the rest, and makes everything 100x more stressful. Whenever I’m stressed, I often feel overwhelmed. As if the tasks will never get done. My work usually suffers (ironically). And yet, I’m sitting here at 4am writing my Medium post. It’s very easy to tell people you’re too busy to write. I’d love to write a novel, I just wish I had the time I told people for ages that I wanted to write a novel. I still have an empty manuscript staring at me from my desktop. It’s never getting done. But that’s not because I don’t have the time. It’s because it’s not important to me. Writing my daily Medium post is very important to me. Maybe not to anyone else, but to me it’s a huge part of my life now. So I make the time for it. Maybe I’ll do one less task today because I’m writing this now, but to me that’s worth it. So really, when you’re telling people you’re too busy to write, you’re actually telling them you don’t care. You have time. Everyone has the same amount of hours. You just don’t want to write more than you want to do everything else. As soon as you really want to—to the exclusion of other tasks—you’ll find the time. I’m just a guy from the UK that’s okay at writing, better at startups, awesome at making coffee. This is day 35 in a 365 day writing experiment. You can check out why I’m writing every day here. If you enjoyed this post, let me know by hitting the heart. Or send me a tweet or an email. ", "title": "Writing When You Feel Overwhelmed Already", "sentences": [{"2554": "Writing When You Feel Overwhelmed Already"}, {"3155": "I have a busy day today. Well, long, anyway. 5 hours of driving, 3 appointments. A ton of tasks to complete."}, {"ab9c": "While that might not seem like much, taking out 5 hours of the day compresses the rest, and makes everything 100x more stressful."}, {"256a": "Whenever I’m stressed, I often feel overwhelmed. As if the tasks will never get done. My work usually suffers (ironically)."}, {"ba9d": "And yet, I’m sitting here at 4am writing my Medium post."}, {"1685": "It’s very easy to tell people you’re too busy to write."}, {"d86f": "I’d love to write a novel, I just wish I had the time"}, {"c841": "I told people for ages that I wanted to write a novel. I still have an empty manuscript staring at me from my desktop. It’s never getting done. But that’s not because I don’t have the time. It’s because it’s not important to me."}, {"9252": "Writing my daily Medium post is very important to me. Maybe not to anyone else, but to me it’s a huge part of my life now. So I make the time for it."}, {"bcb4": "Maybe I’ll do one less task today because I’m writing this now, but to me that’s worth it."}, {"387e": "So really, when you’re telling people you’re too busy to write, you’re actually telling them you don’t care."}, {"3dee": "You have time. Everyone has the same amount of hours. You just don’t want to write more than you want to do everything else."}, {"2ea5": "As soon as you really want to—to the exclusion of other tasks—you’ll find the time."}, {"3a91": "I’m just a guy from the UK that’s okay at writing, better at startups, awesome at making coffee."}, {"eaac": "This is day 35 in a 365 day writing experiment. You can check out why I’m writing every day here."}, {"00c5": "If you enjoyed this post, let me know by hitting the heart. Or send me a tweet or an email."}], "child": "513_1\t513_2\t513_3\t513_4\t513_5513_1\t513_2\t513_3\t513_4\t513_5"}