{"name": "515", "parent": "", "content": "The Jobs I Didn’t See: My Misconceptions of the Academic Job Market I am an Assistant Professor of Computer Science at Bucknell University, a liberal arts university in central Pennsylvania. This is the first in a series of posts reflecting on my experience of teaching at a liberal arts school. You can learn more about me on my website or on Twitter. I’m a better professor than I was a graduate student. In fact, when I hit the job market at the end of grad school, I was prepared to leave academia behind for good. So even though I submitted applications for tenure-track positions, I was increasingly cynical about the jobs themselves. I needed a quality-of-life upgrade, and frankly, I didn’t see a university lifestyle that matched my professional or personal goals. I privately told those around me that I was off to industry. A year later, I started as an Assistant Professor of Computer Science at Bucknell University, where I still work. But I’ve been reflecting a lot lately on the circumstances that led me here. Why? For three reasons: I am writing this because it is the reflection I wish I had read back then. What I Thought I Knew About Academia. My perception of academia was wrong, but it was molded by a mental model that I had developed over years of watching professors. I neatly categorized academic jobs into two bins - teaching schools and research schools. How I thought professors spent their time in academia TEACHING SCHOOLS were those that demanded excellence in the classroom, but also where researchers went to die. It was for people whose mission and vision were focused on education. It meant I would be severed from my scholarly community, and it meant my research career was probably over. RESEARCH SCHOOLS were those that demanded excellence in scholarship, but where teaching went ignored or unvalued. Investing too much into teaching would be a bad strategic decision — a distraction from research. Teaching positions at these schools were synonymous with non-tenure track positions. Working there also meant that I’d have to play the grant game and pray to higher powers that I could recruit students strong enough to help get me tenure. My perception was right in one respect — there are many schools that focus almost exclusively on teaching or research. They enable their faculty to succeed in those areas. But it also leaves many without a home. Do you love teaching but want to stay involved with research? There is no home for you. Do you have aspirations of running a research lab with Ph.D. students, but also want to innovate on how your discipline is taught? There is no home for you, either. Or so I thought. The Schools I Didn’t Know About. My first two campus visits reinforced my beliefs. At one university, I was instructed to teach well enough for the students not to hate me, but not to expend energy beyond that. When asking about scholarship at a teaching-oriented school, a faculty member stared at me as if I had missed the point of this visit all together. But through a stroke of dumb luck (more on that later), my next interviews were with universities that occupied a middle space I never knew existed. I was fortunate to visit a few of the top 40 liberal arts schools, and their message resonated deeply with me (my interpretation): Excellence in the classroom is expected and rewarded, but the teaching load is reduced to secure time and space for research. Funds are available for professional travel. There are internal mechanisms to support summer research for students. The students are excellent. The barriers between departments are low, the class sizes are small, and the community engagement is high. Knowing and mentoring undergraduate students is widely encouraged. What was this? That didn’t fit cleanly into my academic model. Schools like this exist? A revised model. While interviewing, I found that the priorities of universities were much more diverse than I expected. What I didn’t realize then (but seems painfully obvious now) was that universities have a diverse tapestry of priorities that can’t be easily defined by teaching vs. research labels. There are universities in the muddy middle, and those schools may be a wonderful fit for thousands of graduate students who don’t know they are there. For me, liberal arts schools offer a special environment, but the important bit here is one of self reflection — there are many kinds of universities I simply never brushed up against as a graduate student. The stories we listen to about life in academia are largely formed by the experiences of professors who’ve spent decades working in research universities and collaborating with colleagues at other research universities. It’s not malicious or misleading, just biased. How could I make a job decision if I didn’t know what jobs were out there?Seeing a fuzzier and more continuous academic landscape was immensely encouraging to me. The Priority Thumbprint. The one thing I’d encourage every graduate student to do is take some time and reflect on what would make them happy in the next stage of their life. It sounds cheesy, but in the swirling vortex of a Ph.D., it’s easy to forget that these decisions are a delicate balance of personal and professional goals. Academia isn’t for everyone graduating with a Ph.D., but it’s also not as simple as deciding between research schools and teaching schools, or equating prestige with happiness. In reality, it’s choosing between a school in a city where you can’t afford a house vs. a school in a rural setting where you can live 2 miles away. It’s deciding between a prestigious school in which everyone works long hours vs. a lesser known school in which the quality of life is higher. It’s picking between a research-oriented school in a toxic department at a great location vs. a teaching-oriented school with a wonderful department in a location lacking job options for your partner. And a thousand other factors. In the end, I didn’t pick the school with the largest paycheck or the most research resources. Instead, I picked the one that matched how I wanted to invest my time. I spend hours designing classroom experiences that speak to the ways computer science is woven into everyday life… and I know that it is rewarded. I attend major conferences in my field. I publish research papers with undergraduates and continue to collaborate with colleagues at other universities. I live ~1.5 miles from my office in an affordable region with a wonderful school district. I tell people I love my job and it turns out I’m not lying. It Worked Out, But I Got Lucky. I got lucky. I was lucky that my advisor encouraged me to apply broadly even though I had reservations about doing so (“You can always say no later”). I was lucky that I attended a teaching college for my undergraduate degree. Even though I had a skewed perspective, it encouraged me to apply to small schools. I was lucky that my application ended up appealing to hiring committees at liberal arts schools. In reality, I had no idea how to cater my statements to them. I was lucky that I had a degree in a rapidly expanding field that afforded me options on the job market. That is a very rare luxury in academia. Did I mention it’s beautiful here? I often reflect on how easily any of those factors could have changed where I am now. Becoming a tenure-track professor is hard enough by itself, but my misconceptions of academia meant that I almost ignored a major section of the job market. It seems obvious in retrospect, but finding a good match not only makes me happier, but frankly, makes this whole tenure process easier to navigate. I’m trying my best here not to sound too dramatic here, but it’s true— you don’t have to be miserable pre-tenure. That’s a message I don’t think graduate students hear nearly often enough. Does this resonate with your experience? I would love to hear the stories of other people. Feel free to contact me at evan.peck@bucknell.edu or send me message on Twitter: @EvanMPeck ", "title": "The Jobs I Didn’t See: My Misconceptions of the Academic Job Market", "sentences": [{"bb5f": "The Jobs I Didn’t See: My Misconceptions of the Academic Job Market"}, {"ee7b": "I am an Assistant Professor of Computer Science at Bucknell University, a liberal arts university in central Pennsylvania. This is the first in a series of posts reflecting on my experience of teaching at a liberal arts school. You can learn more about me on my website or on Twitter."}, {"6a2b": "I’m a better professor than I was a graduate student. In fact, when I hit the job market at the end of grad school, I was prepared to leave academia behind for good. So even though I submitted applications for tenure-track positions, I was increasingly cynical about the jobs themselves. I needed a quality-of-life upgrade, and frankly, I didn’t see a university lifestyle that matched my professional or personal goals. I privately told those around me that I was off to industry."}, {"ce61": "A year later, I started as an Assistant Professor of Computer Science at Bucknell University, where I still work. But I’ve been reflecting a lot lately on the circumstances that led me here. Why? For three reasons:"}, {"860b": "I am writing this because it is the reflection I wish I had read back then."}, {"c5c6": "What I Thought I Knew About Academia."}, {"8581": "My perception of academia was wrong, but it was molded by a mental model that I had developed over years of watching professors. I neatly categorized academic jobs into two bins - teaching schools and research schools."}, {"3492": "How I thought professors spent their time in academia"}, {"f65f": "TEACHING SCHOOLS were those that demanded excellence in the classroom, but also where researchers went to die. It was for people whose mission and vision were focused on education. It meant I would be severed from my scholarly community, and it meant my research career was probably over."}, {"3ecb": "RESEARCH SCHOOLS were those that demanded excellence in scholarship, but where teaching went ignored or unvalued. Investing too much into teaching would be a bad strategic decision — a distraction from research. Teaching positions at these schools were synonymous with non-tenure track positions. Working there also meant that I’d have to play the grant game and pray to higher powers that I could recruit students strong enough to help get me tenure."}, {"021b": "My perception was right in one respect — there are many schools that focus almost exclusively on teaching or research. They enable their faculty to succeed in those areas. But it also leaves many without a home."}, {"cf0e": "Do you love teaching but want to stay involved with research? There is no home for you. Do you have aspirations of running a research lab with Ph.D. students, but also want to innovate on how your discipline is taught? There is no home for you, either."}, {"6423": "Or so I thought."}, {"0ebf": "The Schools I Didn’t Know About."}, {"200a": "My first two campus visits reinforced my beliefs. At one university, I was instructed to teach well enough for the students not to hate me, but not to expend energy beyond that. When asking about scholarship at a teaching-oriented school, a faculty member stared at me as if I had missed the point of this visit all together."}, {"0b4c": "But through a stroke of dumb luck (more on that later), my next interviews were with universities that occupied a middle space I never knew existed. I was fortunate to visit a few of the top 40 liberal arts schools, and their message resonated deeply with me (my interpretation):"}, {"2e72": "Excellence in the classroom is expected and rewarded, but the teaching load is reduced to secure time and space for research. Funds are available for professional travel. There are internal mechanisms to support summer research for students. The students are excellent. The barriers between departments are low, the class sizes are small, and the community engagement is high. Knowing and mentoring undergraduate students is widely encouraged."}, {"f07b": "What was this? That didn’t fit cleanly into my academic model. Schools like this exist?"}, {"d9e3": "A revised model. While interviewing, I found that the priorities of universities were much more diverse than I expected."}, {"c3ba": "What I didn’t realize then (but seems painfully obvious now) was that universities have a diverse tapestry of priorities that can’t be easily defined by teaching vs. research labels. There are universities in the muddy middle, and those schools may be a wonderful fit for thousands of graduate students who don’t know they are there."}, {"4196": "For me, liberal arts schools offer a special environment, but the important bit here is one of self reflection — there are many kinds of universities I simply never brushed up against as a graduate student. The stories we listen to about life in academia are largely formed by the experiences of professors who’ve spent decades working in research universities and collaborating with colleagues at other research universities. It’s not malicious or misleading, just biased."}, {"a8b0": "How could I make a job decision if I didn’t know what jobs were out there?Seeing a fuzzier and more continuous academic landscape was immensely encouraging to me."}, {"d311": "The Priority Thumbprint."}, {"0e59": "The one thing I’d encourage every graduate student to do is take some time and reflect on what would make them happy in the next stage of their life. It sounds cheesy, but in the swirling vortex of a Ph.D., it’s easy to forget that these decisions are a delicate balance of personal and professional goals. Academia isn’t for everyone graduating with a Ph.D., but it’s also not as simple as deciding between research schools and teaching schools, or equating prestige with happiness."}, {"c226": "In reality, it’s choosing between a school in a city where you can’t afford a house vs. a school in a rural setting where you can live 2 miles away. It’s deciding between a prestigious school in which everyone works long hours vs. a lesser known school in which the quality of life is higher. It’s picking between a research-oriented school in a toxic department at a great location vs. a teaching-oriented school with a wonderful department in a location lacking job options for your partner. And a thousand other factors."}, {"c032": "In the end, I didn’t pick the school with the largest paycheck or the most research resources. Instead, I picked the one that matched how I wanted to invest my time. I spend hours designing classroom experiences that speak to the ways computer science is woven into everyday life… and I know that it is rewarded. I attend major conferences in my field. I publish research papers with undergraduates and continue to collaborate with colleagues at other universities. I live ~1.5 miles from my office in an affordable region with a wonderful school district."}, {"c20e": "I tell people I love my job and it turns out I’m not lying."}, {"ee13": "It Worked Out, But I Got Lucky."}, {"d1bf": "I got lucky."}, {"08a0": "I was lucky that my advisor encouraged me to apply broadly even though I had reservations about doing so (“You can always say no later”)."}, {"26b3": "I was lucky that I attended a teaching college for my undergraduate degree. Even though I had a skewed perspective, it encouraged me to apply to small schools."}, {"2cbe": "I was lucky that my application ended up appealing to hiring committees at liberal arts schools. In reality, I had no idea how to cater my statements to them."}, {"3279": "I was lucky that I had a degree in a rapidly expanding field that afforded me options on the job market. That is a very rare luxury in academia."}, {"95d1": "Did I mention it’s beautiful here?"}, {"d5a5": "I often reflect on how easily any of those factors could have changed where I am now. Becoming a tenure-track professor is hard enough by itself, but my misconceptions of academia meant that I almost ignored a major section of the job market."}, {"fe8d": "It seems obvious in retrospect, but finding a good match not only makes me happier, but frankly, makes this whole tenure process easier to navigate. I’m trying my best here not to sound too dramatic here, but it’s true— you don’t have to be miserable pre-tenure. That’s a message I don’t think graduate students hear nearly often enough."}, {"6ede": "Does this resonate with your experience? I would love to hear the stories of other people. Feel free to contact me at evan.peck@bucknell.edu or send me message on Twitter: @EvanMPeck"}], "child": "515_1\t515_2515_1\t515_2"}