{"name": "517", "parent": "", "content": "Defining Essentialism during #BufferChat on Twitter I decided to participate in this week’s #BufferChat on Twitter, and I’m glad I did! Having never participated in a Twitter chat before, I had no idea what to expect or even how to participate, but I was ready to dive in. Fun fact: Even before the chat started, there was so much interaction in my “mentions”! People saw the hashtag and were quick to say hello! This week’s chat was about essentialism and how it can be applied one’s daily life. This is a concept that I am familiar with due to the insane amounts of stress that I experienced back when I first started college. I found out about essentialism because I was trying to find ways to cope with the stress. Here are the 7 questions asked during the chat: 1. How would you define “essentialism”? 2. How can being an essentialist impact our lives? 3. What are some strategies for essentialism that have worked for you? 4. How do you know which commitments to focus on and which to put aside? 5. What’s an example of when less is more? 6. If you had more time to do what you enjoyed, what would you do? 7. What’s one action step you can take this week to move towards being an essentialist?  Out of all of these questions, I really enjoyed reading the answers to questions two and three because they were the most applicable to my daily life. On how being an essentialist can impact our lives: “Talk about essential! Without priorities you end up like a dog chasing his or her tail.” -@ZacharyFenell I actually ended up quote retweeting this from Zachary Fenell because it was so #relatable. We all have those moments where we just feel like we’ve been going and going but not getting anything done. This is why essentialism is so important. From question three, I have comprised a list of things I can do to practice essentialism effectively. · Make to-do lists. · Prioritize tasks. · Breathe. · Declutter. This includes your mental and physical space. Image by Chelsea Floyd Overall, I really enjoyed #bufferchat. I will definitely be attending more in the future because I got some good insights and suggestions for living a more meaningful life. If I cut out some of the unnecessary tasks in my life, I believe I will truly become an essentialist. As @milestech stated in the chat, “Do less. Accomplish more.” ", "title": "Defining Essentialism during #BufferChat on Twitter", "sentences": [{"19e3": "Defining Essentialism during #BufferChat on Twitter"}, {"93f9": "I decided to participate in this week’s #BufferChat on Twitter, and I’m glad I did! Having never participated in a Twitter chat before, I had no idea what to expect or even how to participate, but I was ready to dive in."}, {"9f16": "Fun fact: Even before the chat started, there was so much interaction in my “mentions”! People saw the hashtag and were quick to say hello!"}, {"536f": "This week’s chat was about essentialism and how it can be applied one’s daily life. This is a concept that I am familiar with due to the insane amounts of stress that I experienced back when I first started college. I found out about essentialism because I was trying to find ways to cope with the stress. Here are the 7 questions asked during the chat:"}, {"5b69": "1. How would you define “essentialism”?"}, {"e921": "2. How can being an essentialist impact our lives?"}, {"d882": "3. What are some strategies for essentialism that have worked for you?"}, {"1fbc": "4. How do you know which commitments to focus on and which to put aside?"}, {"163b": "5. What’s an example of when less is more?"}, {"176d": "6. If you had more time to do what you enjoyed, what would you do?"}, {"69c7": "7. What’s one action step you can take this week to move towards being an essentialist? "}, {"b45e": "Out of all of these questions, I really enjoyed reading the answers to questions two and three because they were the most applicable to my daily life."}, {"7d3b": "On how being an essentialist can impact our lives:"}, {"23b7": "“Talk about essential! Without priorities you end up like a dog chasing his or her tail.” -@ZacharyFenell"}, {"2323": "I actually ended up quote retweeting this from Zachary Fenell because it was so #relatable. We all have those moments where we just feel like we’ve been going and going but not getting anything done. This is why essentialism is so important."}, {"48e3": "From question three, I have comprised a list of things I can do to practice essentialism effectively."}, {"9f35": "· Make to-do lists."}, {"64c7": "· Prioritize tasks."}, {"a43e": "· Breathe."}, {"f87c": "· Declutter. This includes your mental and physical space."}, {"65b1": "Image by Chelsea Floyd"}, {"e73d": "Overall, I really enjoyed #bufferchat. I will definitely be attending more in the future because I got some good insights and suggestions for living a more meaningful life. If I cut out some of the unnecessary tasks in my life, I believe I will truly become an essentialist."}, {"fdd6": "As @milestech stated in the chat, “Do less. Accomplish more.”"}], "child": "517_1\t517_2"}