{"name": "518", "parent": "", "content": "The Real Reason You Don’t Feel Fulfilled The one thing you pride yourself on may be why you can’t seem to get anything done If you’re like many women, you pride yourself on setting other people at ease. On making clients, colleagues, partners, friends, children feel comfortable, making them feel heard, smoothing over any awkward bits or hiccups of tension. But when you prioritize everyone’s comfort a lot of other work doesn’t get done. Namely, yours. If there’s one reason why your life is perhaps not as fulfilling as you would like it to be, it may because of this very belief: That your job is to make other people more comfortable. In her very famous book, If You Want To Write, Brenda Ueland says, “In fact, this is why the lives most women are so vaguely unsatisfactory. They are always doing secondary and menial things (that do not require all their gifts and ability) for others and never anything for themselves.” We are led to believe that this, and this alone, is what makes us great—that we are self-sacrificing, above all.” Yet, this, she says, is at odds with what we feel inside, not to mention our greater purpose: “But inwardly women know that something is wrong. They sense that if you are always doing something for others, like a servant or a nurse, and never anything for yourself, you cannot do others any good. You make them physically more comfortable. But you cannot affect them spiritually in any way at all. For to teach, encourage, cheer up, console, amuse, stimulate or advise…you have to be something yourself. And how to be something yourself? Only by working hard and with gumption at something you love and care for and think is important.” Know when she wrote that? 1938. You might think, oh well, that was long before women were fully independent and had their own mortgages and careers and Instagram accounts. Really? You sure about that? How comfortable are you with not making other people comfortable? And I don’t mean by being thoughtless or difficult or downright rude. I’m talking about your willingness to put your own stuff first, and worry less about how comfy someone else is with it, or what they think. And the second part of that question: How much time are you devoting to menial work, rather than the work that really matters? Granted, in 1938, you might have been doing a hell of a lot more housework. Your life would look very different indeed. Today, menial work might not mean ironing your husband’s shirts day in, day out—but it may mean accepting invitations for coffee or to events even when you don’t really want to go. It may look like spending oodles of time responding to FB posts and writing out long email responses and unruffling feathers. The most valuable, expensive, fleeting thing you have is your attention. You have a finite amount of it each day, and it’s continually being eroded and nibbled at by a thousand things that don’t actually matter. Every time you do something for the sole purpose of making someone else feel better, you have a little less for yourself. I say this as someone who values her relationships tremendously, and sees great value in tending to them daily. But. I also know that the work I really want to do, no one can do for me, and I can only do it with the precious little attention I have, so I guard it. Sometimes not even strictly enough. There’s a reason we “spend” time; it’s just like money. Except it’s irreplaceable; you never get it back. You have a budget of attention each day. Say it’s $100 bucks. Sure, I can give it away willy nilly and make lots of people happy—$10 here, $20 there. But I’m soon left with little to invest in the things that matter, the projects I really care about. If you don’t spend it, someone else will. To regain control of your time and attention is not just a matter of being productive, but of being willing to back off the urge to comfort, to tend to. This requires a major mindset shift, because you need to see yourself not as someone who does a lot of things for a lot of people, but as someone who excels. It’s not easy. A good chunk of my work is client-based, and so there are lots of people who expect and need to hear from me. But I have learned that by acting as a bell-hop in my business is inefficient and unproductive. Far better to control my time and expectations by giving clients my undivided attention when they need it most, and not spoonfuls of attentions scattered here and there. In his book Essentialism: The Disciplined Pursuit of Less, Greg McKeown says that to gain clarity in your life, your work, your purpose, you need to go from “non-essentialist” approach (“I can do it all”) to the “essentialist.” He writes, “Essentialism is not a way to do one more thing; it is a different way of doing everything.” So what does that mean? It means saying no—a lot more than you currently do. It means deferring on coffee when there’s no clear goal or mutual interest. It means passing on events rather than accepting simply because you’re grateful someone invited you. It means recognizing that the world does not deserve access to every last room in your house of attention. Keeping some of those doors locked and off limits is the only way to create the kind of work that matters. I’m not talking about being “selfish,” by the way. This is about giving in a bigger way, instead of parsing out your precious time like free handfuls of candy to anyone who comes knocking. Does that mean some people will be put off? Left a bit uncomfortable or miffed? Maybe. Chances are, though, they’ll respect you. And they’ll value you the time they give you more, as well. The creation of your very best work can be done by no one but you. It cannot be delegated or automated. It can’t be done while you’re also doing ten other things. The things you really want to do, make, or achieve require what Seth Godin calls ‘emotional labor’; it isn’t easy, and you will be a little uncomfortable doing it. The less consumed you are by tending to the yips and whines of the world, the more capable you’ll be to do the kind of work that changes it. ", "title": "The Real Reason You Don’t Feel Fulfilled", "sentences": [{"d345": "The Real Reason You Don’t Feel Fulfilled"}, {"cdad": "The one thing you pride yourself on may be why you can’t seem to get anything done"}, {"3c3d": "If you’re like many women, you pride yourself on setting other people at ease. On making clients, colleagues, partners, friends, children feel comfortable, making them feel heard, smoothing over any awkward bits or hiccups of tension."}, {"763f": "But when you prioritize everyone’s comfort a lot of other work doesn’t get done. Namely, yours."}, {"9316": "If there’s one reason why your life is perhaps not as fulfilling as you would like it to be, it may because of this very belief: That your job is to make other people more comfortable."}, {"5f7a": "In her very famous book, If You Want To Write, Brenda Ueland says,"}, {"a74d": "“In fact, this is why the lives most women are so vaguely unsatisfactory. They are always doing secondary and menial things (that do not require all their gifts and ability) for others and never anything for themselves.” We are led to believe that this, and this alone, is what makes us great—that we are self-sacrificing, above all.”"}, {"b64a": "Yet, this, she says, is at odds with what we feel inside, not to mention our greater purpose:"}, {"4389": "“But inwardly women know that something is wrong. They sense that if you are always doing something for others, like a servant or a nurse, and never anything for yourself, you cannot do others any good. You make them physically more comfortable. But you cannot affect them spiritually in any way at all."}, {"4244": "For to teach, encourage, cheer up, console, amuse, stimulate or advise…you have to be something yourself. And how to be something yourself? Only by working hard and with gumption at something you love and care for and think is important.”"}, {"a791": "Know when she wrote that? 1938."}, {"b979": "You might think, oh well, that was long before women were fully independent and had their own mortgages and careers and Instagram accounts."}, {"c667": "Really? You sure about that?"}, {"fc44": "How comfortable are you with not making other people comfortable? And I don’t mean by being thoughtless or difficult or downright rude. I’m talking about your willingness to put your own stuff first, and worry less about how comfy someone else is with it, or what they think."}, {"4b2a": "And the second part of that question: How much time are you devoting to menial work, rather than the work that really matters?"}, {"06d9": "Granted, in 1938, you might have been doing a hell of a lot more housework. Your life would look very different indeed. Today, menial work might not mean ironing your husband’s shirts day in, day out—but it may mean accepting invitations for coffee or to events even when you don’t really want to go. It may look like spending oodles of time responding to FB posts and writing out long email responses and unruffling feathers."}, {"8db7": "The most valuable, expensive, fleeting thing you have is your attention. You have a finite amount of it each day, and it’s continually being eroded and nibbled at by a thousand things that don’t actually matter. Every time you do something for the sole purpose of making someone else feel better, you have a little less for yourself."}, {"2a91": "I say this as someone who values her relationships tremendously, and sees great value in tending to them daily. But. I also know that the work I really want to do, no one can do for me, and I can only do it with the precious little attention I have, so I guard it. Sometimes not even strictly enough."}, {"bf90": "There’s a reason we “spend” time; it’s just like money. Except it’s irreplaceable; you never get it back. You have a budget of attention each day. Say it’s $100 bucks. Sure, I can give it away willy nilly and make lots of people happy—$10 here, $20 there. But I’m soon left with little to invest in the things that matter, the projects I really care about."}, {"e9d3": "If you don’t spend it, someone else will."}, {"d423": "To regain control of your time and attention is not just a matter of being productive, but of being willing to back off the urge to comfort, to tend to. This requires a major mindset shift, because you need to see yourself not as someone who does a lot of things for a lot of people, but as someone who excels."}, {"662a": "It’s not easy. A good chunk of my work is client-based, and so there are lots of people who expect and need to hear from me. But I have learned that by acting as a bell-hop in my business is inefficient and unproductive. Far better to control my time and expectations by giving clients my undivided attention when they need it most, and not spoonfuls of attentions scattered here and there."}, {"2734": "In his book Essentialism: The Disciplined Pursuit of Less, Greg McKeown says that to gain clarity in your life, your work, your purpose, you need to go from “non-essentialist” approach (“I can do it all”) to the “essentialist.” He writes, “Essentialism is not a way to do one more thing; it is a different way of doing everything.”"}, {"666f": "So what does that mean? It means saying no—a lot more than you currently do. It means deferring on coffee when there’s no clear goal or mutual interest. It means passing on events rather than accepting simply because you’re grateful someone invited you. It means recognizing that the world does not deserve access to every last room in your house of attention."}, {"e677": "Keeping some of those doors locked and off limits is the only way to create the kind of work that matters."}, {"b044": "I’m not talking about being “selfish,” by the way. This is about giving in a bigger way, instead of parsing out your precious time like free handfuls of candy to anyone who comes knocking."}, {"e7e1": "Does that mean some people will be put off? Left a bit uncomfortable or miffed? Maybe. Chances are, though, they’ll respect you. And they’ll value you the time they give you more, as well."}, {"7ec2": "The creation of your very best work can be done by no one but you. It cannot be delegated or automated. It can’t be done while you’re also doing ten other things."}, {"e2e5": "The things you really want to do, make, or achieve require what Seth Godin calls ‘emotional labor’; it isn’t easy, and you will be a little uncomfortable doing it. The less consumed you are by tending to the yips and whines of the world, the more capable you’ll be to do the kind of work that changes it."}], "child": "518_1"}