{"name": "521", "parent": "", "content": "Essentialism 101 #Bufferchat #UFSMM I participated in my very first Twitter chat on Wednesday at 12 p.m. It was a Buffer chat and I was very eager to participate as I am using Buffer now for my social media class. I quickly learned how it worked and threw myself into the conversation. The topic of that chat lead by Buffer was about essentialism. The guest for the chat was Greg McKeown who is the author of the book “Essentialism: The Disciplined Pursuit of Less.” Once I found out what the specific topic was about I was even more excited to start the chat. Buffer posted tips about how they’d like us to respond to each question they asked. Infographic by Nancy Casanova http://www.nancycasanova.com/infographic-embracing-essentialism/ First off, we discussed how we would define “essentialism.” For the most part everyone was agreeing that it is the essential and necessary thing that should be done. I wasn’t quite sure what it was at first but I was looking at what everyone was responding with and I got a much better understanding. The next question was asking how being an essentialist can impact our lives. People were discussing that being an essentialist can put people in charge their lives and forces them to focus on the necessary things. We then discussed successful strategies for essentialism that have worked well. I really liked what @fatherfoodfun suggested. He said “Making lists & prioritizing in order of importance — deadlines are helpful. I color coat. Red= very imp. Green = less imp. ‪#bufferchat” I personally loved the color coating idea and want to start using that helpful tip. We also chatted about how to know which commitments to focus on and which to put aside. I suggested to ask yourself “Is it urgent? Does it need to be done now or can it wait?” I loved the post suggesting to make an Eisenhower box to help determine what is urgent and what isn’t and what important and what isn’t posted from @contentcarnival. Buffer then asked for people to throw out examples of how less is more. It was very interesting to see all the different types of responses for this question. The answers had such variety and I appreciated each type of answer. Then they asked more of a personal question which was, “if you had more time to do what you enjoyed, what would you do?” I loved seeing everyone’s personal answers. A lot of people said they would spend more time with their families and travel which I thought was interesting. I also agreed with the majority of the people and said I would love to travel as well as dance. Lastly they asked, “what is one action step you can take this week to move toward being an Essentialist?” Again I appreciated everyone’s response to this question. An action step that came to my mind was making a list and prioritizing it and focusing on what is the most essential. Overall, I really enjoyed this chat and learned some key elements about essentialism and how it affects us along with tips for being an essentialist. ", "title": "Essentialism 101 #Bufferchat #UFSMM", "sentences": [{"3b5d": "Essentialism 101 #Bufferchat #UFSMM"}, {"3143": "I participated in my very first Twitter chat on Wednesday at 12 p.m. It was a Buffer chat and I was very eager to participate as I am using Buffer now for my social media class. I quickly learned how it worked and threw myself into the conversation. The topic of that chat lead by Buffer was about essentialism. The guest for the chat was Greg McKeown who is the author of the book “Essentialism: The Disciplined Pursuit of Less.” Once I found out what the specific topic was about I was even more excited to start the chat. Buffer posted tips about how they’d like us to respond to each question they asked."}, {"3df5": "Infographic by Nancy Casanova http://www.nancycasanova.com/infographic-embracing-essentialism/"}, {"36d8": "First off, we discussed how we would define “essentialism.” For the most part everyone was agreeing that it is the essential and necessary thing that should be done. I wasn’t quite sure what it was at first but I was looking at what everyone was responding with and I got a much better understanding. The next question was asking how being an essentialist can impact our lives. People were discussing that being an essentialist can put people in charge their lives and forces them to focus on the necessary things. We then discussed successful strategies for essentialism that have worked well. I really liked what @fatherfoodfun suggested. He said “Making lists & prioritizing in order of importance — deadlines are helpful. I color coat. Red= very imp. Green = less imp. ‪#bufferchat” I personally loved the color coating idea and want to start using that helpful tip."}, {"d53e": "We also chatted about how to know which commitments to focus on and which to put aside. I suggested to ask yourself “Is it urgent? Does it need to be done now or can it wait?” I loved the post suggesting to make an Eisenhower box to help determine what is urgent and what isn’t and what important and what isn’t posted from @contentcarnival. Buffer then asked for people to throw out examples of how less is more. It was very interesting to see all the different types of responses for this question. The answers had such variety and I appreciated each type of answer. Then they asked more of a personal question which was, “if you had more time to do what you enjoyed, what would you do?” I loved seeing everyone’s personal answers. A lot of people said they would spend more time with their families and travel which I thought was interesting. I also agreed with the majority of the people and said I would love to travel as well as dance."}, {"0363": "Lastly they asked, “what is one action step you can take this week to move toward being an Essentialist?” Again I appreciated everyone’s response to this question. An action step that came to my mind was making a list and prioritizing it and focusing on what is the most essential. Overall, I really enjoyed this chat and learned some key elements about essentialism and how it affects us along with tips for being an essentialist."}], "child": "521_1"}