{"name": "524", "parent": "", "content": "How to write a content marketing strategy step-by-step [with template] The good news: your boss or client is totally on board with your running content marketing. (SCORE!) The challenge: she wants to see a content marketing plan . . . and you have NO IDEA what that’s supposed to look like. I’ve been there. It’s a tough situation, because you’ve been doing content marketing with your gut this whole time, and now you’re being asked to put all that into a document. (And the gut-to-document process can be pretty painful.) Plus, you know that awesome content marketing involves a lot of flexibility — how do you build that into a strategic document? Good news: we’ve scoured the Internet for content marketing strategy templates, tried a few, and put together an approach to building your own content marketing plan step-by-step. (This is built with both the in-house content marketer and the agent in mind, BTW!) Let’s go! Preface Before we get too far in, I’d love to start things off with a few quick notes: 1. This is a long article. Feel free to bookmark or send to Pocket to set aside some time to hash through this. Also, you can download the full article (plus the content marketing strategy template) and read it later, if you like. Or if you’re keen, we’ve bundled the most essential sections of this post into a 5-part, on-demand email series that you can get for free right here. 2. Content marketing strategies aren’t easy to write. We’re going to dig into big strategies like website crawls and persona profiles and thematic taxonomies and competitive analyses. (I had to learn a good deal of stuff I was unfamiliar with in order to start writing these, too!) At each step, I’ve included some recommended material for further reading. 3. This isn’t gospel. Like the pirate code, these are more guidelines than actual rules. =) You’ll find that some projects need more in-depth planning than others. 4. Stay flexible. A strong content marketing strategy should give you focus, not lock you into less-than-awesome ideas! The key to a great content marketing strategy is being able to tweak, break, and chuck parts of it as you learn more about what works and what doesn’t. All right, now that we’ve covered the caveats, let’s look at how to write this content marketing strategy! How to write a content marketing strategy step-by-step Let’s walk though how you can write a content marketing strategy — one that pulls together all the pieces and gives you a clear plan for moving forward. Step 1: Start with an outline Writing a strategy can sound like a daunting task. How detailed should it be? How high-level should it be? Starting with an outline can help you conceptualize all the ground you need to cover — and it may save you from expending your energy covering unnecessary ground! And what is the right ground to cover anyway? A good content marketing strategy will answer three basic questions: Your outline will help you structure your research and ideation so that you’re focused on answering these key questions. For example, one way this could look is by splitting the remaining steps below (all 20 of ’em) into each of these buckets. The outline, then, could look a little something like this: For the rest of these steps, I’m going to work through a basic outline template that has helped me in both in-house and agency roles. (And I’d be more than happy to email you a copy of this outline to copy or tweak!) Once you’ve got an outline, it’s time to start with what you know: yourself. Step 2: Write down what you’re trying to accomplish This is where you’ll write out your content marketing goals. What are you trying to accomplish? It helps if this is specific, because later on in this process, you will be comparing your content to your goals to see what’s truly in alignment. This may express itself as a big objective with smaller SMART goals folded underneath (SMART stands for “Specific, Measurable, Achievable, Realistic, and Timely”). An example may be: Goal: To become perceived as a thought leader on the phenomenon of Roomba rodeos. Note: A great question to ask for added context might be: What are the overall marketing goals, and how can content marketing support them? I’ve found that some organizations group content marketing into a separate team (or outsource the efforts), which means it may be wise to get some advice from other non–content marketing folks in your organization. (Protip: sometimes asking other teams and departments for content input is a great way to build a culture of content in your organization!) Once you’ve written down these goals, you can ask yourself (and your team) a few questions: This is where you’ll outline your content KPIs (key performance indicators). For more thoughts on setting marketing goals, check out this best-of list of methods from experts like Noah Kagan, Ryan Holiday, Rand Fishkin, our own Courtney Seiter. You might also want to swipe some goal-setting templates from HubSpot’s Mike Lemire. Step 3 (optional): Write down what you’re selling I’ve found it helpful to write out what the product or service I’m trying to sell is. It helps me think through the features, the different product tiers, the sales cycle, etc. When you know what you’re selling, you can more easily frame the kind of content you will need to sell it. Of course, you may be the product creator, the marketer, the one-human show, and this might not be something you need to write down. If not, feel free to skip this part. Step 4: Now, who’s going to consume your content? It’s time to outline who the audience for your content marketing efforts is going to be. If you’ve done some of your persona research already, huzzah! You can plug those little blocks of fictional, alliterative goodness here. Don’t have your buyer personas fleshed out yet? Now’s a terrific time to get started on this! Here are a few resources to help you start developing your own personas: Step 5: Map your personas’ needs to your product or service Jay Acunzo wrote my very favorite definition of content marketing: Solving the same problem or conveying the same emotion as your product, using media you create and distribute. Once you’ve looked at who your audience is, you need to ask one crucial question: How can you help them? This question is the heart and soul of content marketing. Your whole content marketing plan will benefit from writing this out. The key to this step is to map your persona’s pain points, goals, and desires to the solutions you want to sell. This might look like making a table with brief descriptions of each. Or it might be something you’d like to write out in story form — something Moz’s Isla McKetta has some super helpful thoughts on! Again, this step is key, because the rest of this strategy is going to be about creating and upgrading and curating and promoting content that solves the same problems your product solves! Step 6 (optional): Heroes and watering holes You’re laying a terrific foundation for your content strategy. You’ve dug through your personas’ deepest wants and needs and mapped those to your product. You’re getting an idea of what kinds of problems your content needs to solve. Things are starting to take shape. There’s another (optional) thing I like to look at before leaving the audience section of the content marketing plan, though. I like to know: Where is my audience already going for this kind of information? This is a fun exercise I’ve nicknamed “heroes and watering holes.” (You can probably come up with a better name for it!) I call them that because at this stage in the content marketing plan, it’s good to start thinking of the sources of information the audience already trusts. Those sources generally fall into two groups: If you examine where your audience is already going for information, you can get a more comprehensive view of the content marketplace. It can help protect you from trying to reinvent any content wheels, and it can give you some awesome ideas for guest posting — the lifeblood of the early content marketing strategy at Buffer! Unless you have a really wide reach, you can probably use your own intuition to map out your audience’s influencers. But if you’d like a more data-driven approach, you may want to use tools like FollowerWonk and BuzzSumo. Step 7: Look to the competition’s content marketing efforts for inspiration It’s good to know what kind of content your audience wants. It’s fantastic to know what kind of content your competitors are already giving them. You don’t need to do a deep-dive competitive analysis for every single content marketing plan you write, but you will probably find it helpful to take a moment to reflect on just what other people and brands are offering your personas. By the way, when you think about competition in terms of content marketing, it can work a little differently than you might imagine. Your competitors aren’t necessarily the organizations that are competing for customer dollars. When it comes to content marketing, your competitors are the people and organizations that are competing for your audience’s attention. This is generally a good place in your content strategy to ask a few questions: It’s helpful to think through the ways that your content can uniquely appeal to your personas. Will you offer more long-form, deep tactical content? Will your content be more visually oriented? Will your content be crafted with a distinctively delightful tone? This graphic from Garrett Moon of CoSchedule does a great job explaining this concept (the blue ocean blogs are what you’d aim for): This piece of the strategy will help you orient yourself in the content marketplace, so that you, your team, and/or your client can create content marketing pieces that stand out rather than blend in. Not sure who your competitors are? There are a few ways to find out. One of my favorites: SEMRush. They show you which websites are ranking for the same keywords in search engines as you — which is super helpful! At a glance, you can see who else is getting organic and paid search engine attention for the keywords you might be targeting. Step 8: Take inventory of your content OK, this step could be its own blog post. Or blog series. Or book. Or director’s edition extended cut DVD set. You get the idea: taking inventory of your marketing content is no small task. Let’s get a high-level view of what this could look like, and then I’ll be happy to share some links for further reading. When you take inventory of your content, you get a list of all your content marketing assets (both onsite and offsite). This could be as general as a list of channels. For example, if Buffer were to do a high-level content inventory without digging into the details, it might look like this: Onsite Offsite Even something as simple as this is helpful — but only to the extent of figuring out where all your content might be. The deeper dive into these individual content marketing assets (a fantastic exercise if you’re up for it) would include: everything. It’s a great deal of work. But you emerge from it being incredibly well-attuned to the state of content marketing for your brand. In short, what we’re looking at here is a content audit. And how do you do a content audit? There are many, many tools and blog posts that can help you do this, but here are a few that I’ve personally found invaluable. Step 9: Evaluate your existing content Now that you’ve put together a list of your content marketing assets, it’s time to line them up against those objectives we covered at the beginning of this plan. The central question we’re trying to answer: Which pieces of content are aligned with our objectives? (With a follow-up: Which pieces of content can we reorient to align with our objectives?) One approach I find super helpful here is to map out the most important pieces of content from the inventory on a matrix like the one below. The X axis plots performance: that’s metrics like pageviews, likes, shares, comments, and rankings. The Y axis plots alignment, which is a little fuzzier. The higher up a piece of content is, the more in alignment with our brand’s goals and ethos it is. When looking at the content you’ve inventoried, which content falls into which quadrants? (You could assign a quadrant value to each type of content if you like, but unless you’re dealing with a hefty budget, your intuition will work just fine.) Some resources that help with evaluating content performance: When you’ve finished this, it’s time to ask four important questions: What sticks? (Step 10) This speaks to that sweet, sweet top-right corner of the matrix, where your content is aligned with your brand and acing performance. One thing I find helpful in a content strategy is to list out the content assets that are already performing well at this point. What should we fix? (Step 11) There will probably be bits of content in quadrants 1 and 4 that could get bumped into quadrant 4 with a little love and care. Make a list of the pieces that really have potential to turn into high-value content marketing assets, along with the ways in which they could be improved. For example, you may notice that your “how-to” infographics are generating some super positive comments, but they’re not getting very many shares or backlinks. You might want to take note of this, as this will be worked into the content strategy later. What should we nix? (Step 12) Where’s the dead weight? There may be some content in quadrant 3 that’s just not doing you any favors. No backlinks, no likes, no rankings — it’s just clutter. (This may also include totally outdated content.) If it’s no good, don’t be afraid to put it on the list to be nixed. It’ll clear up space and help you focus on the content that’s most important. What do we add to the mix? (Step 13) And here’s where your content marketing strategy begins to take on that epic creative element! After meticulously combing over your content, what ideas do you get for new content? What assets could be driving business objectives? What has your brand overlooked? What have you always wanted to try? (This is probably my favorite part of writing content marketing strategies!) Step 14 (optional): Sort your effective and prospective content marketing assets by theme You’ve audited all your content. Huzzah! We’re about to move into the part of the strategy that deals with making this content, but first, let’s pull some of this audit together by identifying some major content themes. This will play a big part in mapping out a content production and promotion schedule soon. Look at the content that sticks. By asking these questions, we can start building out content themes: these are the broad umbrella topics that your best content tends to group under. This is the time in the content marketing strategizing stage where I find it helpful to write these down. Doing so helps hone the plan for producing new content around these themes — which makes things a lot simpler for the folks writing, designing, and coding the content! Step 15: Refill your coffee I hope you will have done so long before reaching this step, but I just wanted to give you a friendly reminder. 😉 Step 15 (for serious): List the types of content you’ll be dealing with You’ve completed a huge component of this strategy piece: you’ve combed through all your content and channels to find what’s working, what’s not, and what you’d like to create. Well done. Very well done! Now we need to start making a plan for producing content. Just for reference, “producing content” covers two general areas of content crafting: We’ll start by listing out the kind of work this will involve, namely, the types of content that need to be crafted. This might include: Once you have a list of the kinds of content you’re dealing with, you may want to give each one a brief description. For example, you could write: This is key, because in the next steps, you’ll outline how these kinds of content will be made. Step 16: Snapshot the content team and workflow One trap that I often fall into is underestimating how long it will take to create a piece of content. (Confession: I’m finishing this post two days later than I originally planned on it being done!) That’s why, when laying out a content strategy, it’s good to get an idea of who’s working on the content, and how that content is going to be created. The goal: get an idea of how much content you have capacity for. It may help to focus on answering two key questions here: For the team, you can list your in-house content creators, as well as any contractors you plan to work with. For the workflow, this is a simple step-by-step breakdown of the content creation/fixing process. It could look like, “Ideate > Write > Design > Edit > Schedule > Promote,” or it could be more involved than this. This is a tricky one, especially if you’re proposing the first content marketing strategy for an organization. You face a host of unknowns. How long will it take to hire content specialists? How much will it cost to get a designer to make your infographics? How successful will content promotion efforts be? The good news: You don’t need to have all the answers here. In fact, sometimes this exercise is most helpful at identifying the elements of content creation that we haven’t figured out yet! What’s important is that you have some idea of where this content marketing effort is coming from. Refining this piece is an ongoing process. =) Step 17: Estimate your content capacity Once you’ve outlined everything you can in the previous step, it’s time to estimate just how much content can be created in the next span of time. If you’re outsourcing this part to a team of experienced content marketers, content production might follow a reliable timetable. But if your team is just getting into content marketing, this can be a tough one. This is where it helps to ask for advice from people with experience. And if you can’t know for sure, guess. The key here is to find a level of content production your team is confident they can take on, and then go for it. If you end up with lots of unfinished tasks at the end of the month, you can adjust expectations. If you finish way ahead of time, you can either ramp up production or invest in even higher-quality content. Either way, you want to have an idea of how much content you can make. Pro-tip: a spreadsheet may come in handy here! You can create columns for content type, estimated hours, quantity of pieces, and finally a total. This can help you build a few possible breakdowns of your content capacity. Step 18: Map out your editorial calendar You know what content you’re going to make. You know how you’re going to make it, and you have an idea of how long it’s going to take. Now, when will you publish it? It’s time to map out your editorial calendar for your content marketing assets. This is where you plot your blog posts, emails, ebooks, podcasts, etc. across a given patch of time, be it months, quarters, or semesters. (You could go longer, but I’ve found it helpful to keep the scope of time small enough for you to stay flexible and pivot based on what kind of content is performing.) One thing to keep in mind: you don’t necessarily need to plan out every single piece of individual content on this calendar from the get-go. But it will help to map out how those content themes from Step 14 and the content types you listed in Step 16 will be spread across the next time period. Protip: It’s easy to forget social media posting schedules here (since blogging and email take up a decent amount of brainspace). You may want to map out some of your social content schedule on the editorial calendar. Your social media conversations will understandably be more fluid than blog posts or emails, so this doesn’t need to be the end-all social media schedule. It’s just something to consider, as you may find it helpful just so you can see it in context of the rest of your content production. =) One more protip: This is a great place to include your guest blogging and syndication efforts, too! A few tools to consider for your editorial calendar: Step 19: Make a content promotion workflow If you publish a blog post in a forest, but nobody is around to read it, does it make a sound? 😛 Probably not. Creating amazing content is incredibly important, but there’s SO MUCH content being made every day! You’re going to need to find a way to get your awesome blog posts and infographics and podcasts in front of the right eyeballs. You don’t just want a plan for making content. You want a plan for driving attention to it. This is a great time in the content marketing plan building process to map that out. How will you drive traffic to your content? You can start with a very simple process for doing so. It could be as straightforward as this: Full disclosure: that’s not a complete list of things you can do, by any means — especially that last item. You’ll want to promote your content through those heroes and watering holes you described at the beginning of this strategy, and you’ll want to do it in a way that makes them look forward to getting more content from you. There’s a lot that can be said when it comes to figuring out a content promotion workflow. For now, it’s important that you have some means of driving traffic to your content once it’s published. For more on content promotion plans and tactics, go read anything (or everything!) by Brian Dean. I’ve found this video and this guide to be especially insightful. And here’s a peek at the content distribution checklist used at Buffer: Step 20: Write the epilogue Sum up your content strategy by painting an awesome picture of what it will be like if you execute on it. You can put lots of interesting things here, including experiments you hope to learn from and awesome blogs your content might be featured on. But, of course, the most important thing to do is briefly wrap up your strategy by relating it to those business objectives you listed at the very beginning. =) Step 21: Write the executive summary You’ve done it. You have put together the epic content marketing strategy. You might be sitting on top of a 20-page document. Heck, if you’re working with a really big organization, it could be pushing 50 pages. You have just made yourself the ultimate expert on your content. Your boss or client is going to be totally floored by the amount of time and research and thought you just put into this. And they won’t have time to read it. =) That’s why you’ll want to circle back around and add an executive summary to the beginning of your content strategy. Think of it as a TL;DR that answers four basic questions: Ka-BAM! You’re done. =D Download this content marketing strategy template for yourself! Image sources: 72pxDesigns, Pablo, Canva Originally published at blog.bufferapp.com on November 16, 2015. ", "title": "How to write a content marketing strategy step-by-step [with template]", "sentences": [{"6de8": "How to write a content marketing strategy step-by-step [with template]"}, {"e64b": "The good news: your boss or client is totally on board with your running content marketing. (SCORE!)"}, {"7203": "The challenge: she wants to see a content marketing plan . . . and you have NO IDEA what that’s supposed to look like."}, {"f369": "I’ve been there."}, {"6c7b": "It’s a tough situation, because you’ve been doing content marketing with your gut this whole time, and now you’re being asked to put all that into a document. (And the gut-to-document process can be pretty painful.) Plus, you know that awesome content marketing involves a lot of flexibility — how do you build that into a strategic document?"}, {"81d1": "Good news: we’ve scoured the Internet for content marketing strategy templates, tried a few, and put together an approach to building your own content marketing plan step-by-step."}, {"0ba6": "(This is built with both the in-house content marketer and the agent in mind, BTW!)"}, {"890b": "Let’s go!"}, {"e1f6": "Preface"}, {"aeaf": "Before we get too far in, I’d love to start things off with a few quick notes:"}, {"3da0": "1. This is a long article."}, {"6ad0": "Feel free to bookmark or send to Pocket to set aside some time to hash through this. Also, you can download the full article (plus the content marketing strategy template) and read it later, if you like."}, {"8fe6": "Or if you’re keen, we’ve bundled the most essential sections of this post into a 5-part, on-demand email series that you can get for free right here."}, {"d636": "2. Content marketing strategies aren’t easy to write."}, {"f6ca": "We’re going to dig into big strategies like website crawls and persona profiles and thematic taxonomies and competitive analyses. (I had to learn a good deal of stuff I was unfamiliar with in order to start writing these, too!) At each step, I’ve included some recommended material for further reading."}, {"81ba": "3. This isn’t gospel."}, {"ddd1": "Like the pirate code, these are more guidelines than actual rules. =) You’ll find that some projects need more in-depth planning than others."}, {"997e": "4. Stay flexible."}, {"a52a": "A strong content marketing strategy should give you focus, not lock you into less-than-awesome ideas! The key to a great content marketing strategy is being able to tweak, break, and chuck parts of it as you learn more about what works and what doesn’t."}, {"9e46": "All right, now that we’ve covered the caveats, let’s look at how to write this content marketing strategy!"}, {"2644": "How to write a content marketing strategy step-by-step"}, {"34be": "Let’s walk though how you can write a content marketing strategy — one that pulls together all the pieces and gives you a clear plan for moving forward."}, {"d98d": "Step 1: Start with an outline"}, {"b82a": "Writing a strategy can sound like a daunting task. How detailed should it be? How high-level should it be? Starting with an outline can help you conceptualize all the ground you need to cover — and it may save you from expending your energy covering unnecessary ground!"}, {"a466": "And what is the right ground to cover anyway?"}, {"ba7e": "A good content marketing strategy will answer three basic questions:"}, {"df3d": "Your outline will help you structure your research and ideation so that you’re focused on answering these key questions."}, {"fe69": "For example, one way this could look is by splitting the remaining steps below (all 20 of ’em) into each of these buckets. The outline, then, could look a little something like this:"}, {"0a28": "For the rest of these steps, I’m going to work through a basic outline template that has helped me in both in-house and agency roles. (And I’d be more than happy to email you a copy of this outline to copy or tweak!)"}, {"5a97": "Once you’ve got an outline, it’s time to start with what you know: yourself."}, {"39ae": "Step 2: Write down what you’re trying to accomplish"}, {"6a3a": "This is where you’ll write out your content marketing goals. What are you trying to accomplish? It helps if this is specific, because later on in this process, you will be comparing your content to your goals to see what’s truly in alignment."}, {"8dec": "This may express itself as a big objective with smaller SMART goals folded underneath (SMART stands for “Specific, Measurable, Achievable, Realistic, and Timely”)."}, {"a0a1": "An example may be:"}, {"56af": "Goal: To become perceived as a thought leader on the phenomenon of Roomba rodeos."}, {"d048": "Note: A great question to ask for added context might be: What are the overall marketing goals, and how can content marketing support them? I’ve found that some organizations group content marketing into a separate team (or outsource the efforts), which means it may be wise to get some advice from other non–content marketing folks in your organization."}, {"2f6c": "(Protip: sometimes asking other teams and departments for content input is a great way to build a culture of content in your organization!)"}, {"21b5": "Once you’ve written down these goals, you can ask yourself (and your team) a few questions:"}, {"4fbc": "This is where you’ll outline your content KPIs (key performance indicators)."}, {"c628": "For more thoughts on setting marketing goals, check out this best-of list of methods from experts like Noah Kagan, Ryan Holiday, Rand Fishkin, our own Courtney Seiter. You might also want to swipe some goal-setting templates from HubSpot’s Mike Lemire."}, {"2b20": "Step 3 (optional): Write down what you’re selling"}, {"8dd1": "I’ve found it helpful to write out what the product or service I’m trying to sell is. It helps me think through the features, the different product tiers, the sales cycle, etc. When you know what you’re selling, you can more easily frame the kind of content you will need to sell it."}, {"252a": "Of course, you may be the product creator, the marketer, the one-human show, and this might not be something you need to write down. If not, feel free to skip this part."}, {"9b10": "Step 4: Now, who’s going to consume your content?"}, {"c567": "It’s time to outline who the audience for your content marketing efforts is going to be. If you’ve done some of your persona research already, huzzah! You can plug those little blocks of fictional, alliterative goodness here."}, {"ff4e": "Don’t have your buyer personas fleshed out yet? Now’s a terrific time to get started on this! Here are a few resources to help you start developing your own personas:"}, {"8440": "Step 5: Map your personas’ needs to your product or service"}, {"e198": "Jay Acunzo wrote my very favorite definition of content marketing:"}, {"a99b": "Solving the same problem or conveying the same emotion as your product, using media you create and distribute."}, {"592b": "Once you’ve looked at who your audience is, you need to ask one crucial question: How can you help them?"}, {"5586": "This question is the heart and soul of content marketing. Your whole content marketing plan will benefit from writing this out."}, {"7c1c": "The key to this step is to map your persona’s pain points, goals, and desires to the solutions you want to sell. This might look like making a table with brief descriptions of each. Or it might be something you’d like to write out in story form — something Moz’s Isla McKetta has some super helpful thoughts on!"}, {"1390": "Again, this step is key, because the rest of this strategy is going to be about creating and upgrading and curating and promoting content that solves the same problems your product solves!"}, {"a396": "Step 6 (optional): Heroes and watering holes"}, {"c7cb": "You’re laying a terrific foundation for your content strategy. You’ve dug through your personas’ deepest wants and needs and mapped those to your product. You’re getting an idea of what kinds of problems your content needs to solve. Things are starting to take shape."}, {"85aa": "There’s another (optional) thing I like to look at before leaving the audience section of the content marketing plan, though. I like to know:"}, {"2203": "Where is my audience already going for this kind of information?"}, {"9410": "This is a fun exercise I’ve nicknamed “heroes and watering holes.” (You can probably come up with a better name for it!) I call them that because at this stage in the content marketing plan, it’s good to start thinking of the sources of information the audience already trusts. Those sources generally fall into two groups:"}, {"27b7": "If you examine where your audience is already going for information, you can get a more comprehensive view of the content marketplace. It can help protect you from trying to reinvent any content wheels, and it can give you some awesome ideas for guest posting — the lifeblood of the early content marketing strategy at Buffer!"}, {"54fb": "Unless you have a really wide reach, you can probably use your own intuition to map out your audience’s influencers. But if you’d like a more data-driven approach, you may want to use tools like FollowerWonk and BuzzSumo."}, {"30c7": "Step 7: Look to the competition’s content marketing efforts for inspiration"}, {"34f5": "It’s good to know what kind of content your audience wants."}, {"dffa": "It’s fantastic to know what kind of content your competitors are already giving them."}, {"ee6a": "You don’t need to do a deep-dive competitive analysis for every single content marketing plan you write, but you will probably find it helpful to take a moment to reflect on just what other people and brands are offering your personas."}, {"f197": "By the way, when you think about competition in terms of content marketing, it can work a little differently than you might imagine. Your competitors aren’t necessarily the organizations that are competing for customer dollars. When it comes to content marketing, your competitors are the people and organizations that are competing for your audience’s attention."}, {"a0e7": "This is generally a good place in your content strategy to ask a few questions:"}, {"cb13": "It’s helpful to think through the ways that your content can uniquely appeal to your personas. Will you offer more long-form, deep tactical content? Will your content be more visually oriented? Will your content be crafted with a distinctively delightful tone?"}, {"ada2": "This graphic from Garrett Moon of CoSchedule does a great job explaining this concept (the blue ocean blogs are what you’d aim for):"}, {"1231": "This piece of the strategy will help you orient yourself in the content marketplace, so that you, your team, and/or your client can create content marketing pieces that stand out rather than blend in."}, {"3fb7": "Not sure who your competitors are?"}, {"6fa3": "There are a few ways to find out."}, {"9b91": "One of my favorites: SEMRush. They show you which websites are ranking for the same keywords in search engines as you — which is super helpful! At a glance, you can see who else is getting organic and paid search engine attention for the keywords you might be targeting."}, {"9d03": "Step 8: Take inventory of your content"}, {"67ea": "OK, this step could be its own blog post. Or blog series. Or book. Or director’s edition extended cut DVD set."}, {"d5db": "You get the idea: taking inventory of your marketing content is no small task."}, {"291e": "Let’s get a high-level view of what this could look like, and then I’ll be happy to share some links for further reading."}, {"19bb": "When you take inventory of your content, you get a list of all your content marketing assets (both onsite and offsite)."}, {"f53b": "This could be as general as a list of channels. For example, if Buffer were to do a high-level content inventory without digging into the details, it might look like this:"}, {"cedb": "Onsite"}, {"56fd": "Offsite"}, {"8f51": "Even something as simple as this is helpful — but only to the extent of figuring out where all your content might be."}, {"d81c": "The deeper dive into these individual content marketing assets (a fantastic exercise if you’re up for it) would include:"}, {"dd68": "everything."}, {"f651": "It’s a great deal of work. But you emerge from it being incredibly well-attuned to the state of content marketing for your brand."}, {"39b8": "In short, what we’re looking at here is a content audit."}, {"1a67": "And how do you do a content audit? There are many, many tools and blog posts that can help you do this, but here are a few that I’ve personally found invaluable."}, {"f906": "Step 9: Evaluate your existing content"}, {"6cc5": "Now that you’ve put together a list of your content marketing assets, it’s time to line them up against those objectives we covered at the beginning of this plan."}, {"91ae": "The central question we’re trying to answer: Which pieces of content are aligned with our objectives?"}, {"4ab0": "(With a follow-up: Which pieces of content can we reorient to align with our objectives?)"}, {"5fb4": "One approach I find super helpful here is to map out the most important pieces of content from the inventory on a matrix like the one below."}, {"ce4c": "The X axis plots performance: that’s metrics like pageviews, likes, shares, comments, and rankings. The Y axis plots alignment, which is a little fuzzier. The higher up a piece of content is, the more in alignment with our brand’s goals and ethos it is."}, {"8a56": "When looking at the content you’ve inventoried, which content falls into which quadrants? (You could assign a quadrant value to each type of content if you like, but unless you’re dealing with a hefty budget, your intuition will work just fine.)"}, {"2db5": "Some resources that help with evaluating content performance:"}, {"0ce8": "When you’ve finished this, it’s time to ask four important questions:"}, {"1c53": "What sticks? (Step 10)"}, {"2e3f": "This speaks to that sweet, sweet top-right corner of the matrix, where your content is aligned with your brand and acing performance. One thing I find helpful in a content strategy is to list out the content assets that are already performing well at this point."}, {"5e9a": "What should we fix? (Step 11)"}, {"a8ba": "There will probably be bits of content in quadrants 1 and 4 that could get bumped into quadrant 4 with a little love and care. Make a list of the pieces that really have potential to turn into high-value content marketing assets, along with the ways in which they could be improved."}, {"b5ed": "For example, you may notice that your “how-to” infographics are generating some super positive comments, but they’re not getting very many shares or backlinks. You might want to take note of this, as this will be worked into the content strategy later."}, {"2842": "What should we nix? (Step 12)"}, {"628a": "Where’s the dead weight? There may be some content in quadrant 3 that’s just not doing you any favors. No backlinks, no likes, no rankings — it’s just clutter. (This may also include totally outdated content.)"}, {"0b4d": "If it’s no good, don’t be afraid to put it on the list to be nixed. It’ll clear up space and help you focus on the content that’s most important."}, {"bdc3": "What do we add to the mix? (Step 13)"}, {"efdf": "And here’s where your content marketing strategy begins to take on that epic creative element! After meticulously combing over your content, what ideas do you get for new content? What assets could be driving business objectives? What has your brand overlooked? What have you always wanted to try?"}, {"1616": "(This is probably my favorite part of writing content marketing strategies!)"}, {"c371": "Step 14 (optional): Sort your effective and prospective content marketing assets by theme"}, {"ac37": "You’ve audited all your content."}, {"1607": "Huzzah!"}, {"9063": "We’re about to move into the part of the strategy that deals with making this content, but first, let’s pull some of this audit together by identifying some major content themes. This will play a big part in mapping out a content production and promotion schedule soon."}, {"229a": "Look at the content that sticks."}, {"27b4": "By asking these questions, we can start building out content themes: these are the broad umbrella topics that your best content tends to group under. This is the time in the content marketing strategizing stage where I find it helpful to write these down. Doing so helps hone the plan for producing new content around these themes — which makes things a lot simpler for the folks writing, designing, and coding the content!"}, {"8526": "Step 15: Refill your coffee"}, {"a621": "I hope you will have done so long before reaching this step, but I just wanted to give you a friendly reminder. 😉"}, {"95a3": "Step 15 (for serious): List the types of content you’ll be dealing with"}, {"8013": "You’ve completed a huge component of this strategy piece: you’ve combed through all your content and channels to find what’s working, what’s not, and what you’d like to create."}, {"50c5": "Well done. Very well done!"}, {"b5e2": "Now we need to start making a plan for producing content. Just for reference, “producing content” covers two general areas of content crafting:"}, {"452d": "We’ll start by listing out the kind of work this will involve, namely, the types of content that need to be crafted. This might include:"}, {"1909": "Once you have a list of the kinds of content you’re dealing with, you may want to give each one a brief description. For example, you could write:"}, {"15dc": "This is key, because in the next steps, you’ll outline how these kinds of content will be made."}, {"a547": "Step 16: Snapshot the content team and workflow"}, {"9c9e": "One trap that I often fall into is underestimating how long it will take to create a piece of content. (Confession: I’m finishing this post two days later than I originally planned on it being done!) That’s why, when laying out a content strategy, it’s good to get an idea of who’s working on the content, and how that content is going to be created. The goal: get an idea of how much content you have capacity for."}, {"9ff2": "It may help to focus on answering two key questions here:"}, {"d9e8": "For the team, you can list your in-house content creators, as well as any contractors you plan to work with."}, {"2fe0": "For the workflow, this is a simple step-by-step breakdown of the content creation/fixing process. It could look like, “Ideate > Write > Design > Edit > Schedule > Promote,” or it could be more involved than this."}, {"0e33": "This is a tricky one, especially if you’re proposing the first content marketing strategy for an organization. You face a host of unknowns. How long will it take to hire content specialists? How much will it cost to get a designer to make your infographics? How successful will content promotion efforts be?"}, {"1916": "The good news: You don’t need to have all the answers here. In fact, sometimes this exercise is most helpful at identifying the elements of content creation that we haven’t figured out yet! What’s important is that you have some idea of where this content marketing effort is coming from. Refining this piece is an ongoing process. =)"}, {"cf5c": "Step 17: Estimate your content capacity"}, {"6c50": "Once you’ve outlined everything you can in the previous step, it’s time to estimate just how much content can be created in the next span of time."}, {"7e4d": "If you’re outsourcing this part to a team of experienced content marketers, content production might follow a reliable timetable. But if your team is just getting into content marketing, this can be a tough one. This is where it helps to ask for advice from people with experience."}, {"70e2": "And if you can’t know for sure, guess."}, {"6fdb": "The key here is to find a level of content production your team is confident they can take on, and then go for it. If you end up with lots of unfinished tasks at the end of the month, you can adjust expectations. If you finish way ahead of time, you can either ramp up production or invest in even higher-quality content."}, {"1128": "Either way, you want to have an idea of how much content you can make."}, {"6df6": "Pro-tip: a spreadsheet may come in handy here! You can create columns for content type, estimated hours, quantity of pieces, and finally a total. This can help you build a few possible breakdowns of your content capacity."}, {"44a9": "Step 18: Map out your editorial calendar"}, {"b7f3": "You know what content you’re going to make."}, {"a59a": "You know how you’re going to make it, and you have an idea of how long it’s going to take."}, {"76c7": "Now, when will you publish it?"}, {"a110": "It’s time to map out your editorial calendar for your content marketing assets. This is where you plot your blog posts, emails, ebooks, podcasts, etc. across a given patch of time, be it months, quarters, or semesters."}, {"fbfa": "(You could go longer, but I’ve found it helpful to keep the scope of time small enough for you to stay flexible and pivot based on what kind of content is performing.)"}, {"142a": "One thing to keep in mind: you don’t necessarily need to plan out every single piece of individual content on this calendar from the get-go. But it will help to map out how those content themes from Step 14 and the content types you listed in Step 16 will be spread across the next time period."}, {"24f2": "Protip: It’s easy to forget social media posting schedules here (since blogging and email take up a decent amount of brainspace). You may want to map out some of your social content schedule on the editorial calendar. Your social media conversations will understandably be more fluid than blog posts or emails, so this doesn’t need to be the end-all social media schedule. It’s just something to consider, as you may find it helpful just so you can see it in context of the rest of your content production. =)"}, {"cb19": "One more protip: This is a great place to include your guest blogging and syndication efforts, too!"}, {"6b55": "A few tools to consider for your editorial calendar:"}, {"c55b": "Step 19: Make a content promotion workflow"}, {"cc20": "If you publish a blog post in a forest, but nobody is around to read it, does it make a sound? 😛"}, {"f794": "Probably not."}, {"582e": "Creating amazing content is incredibly important, but there’s SO MUCH content being made every day! You’re going to need to find a way to get your awesome blog posts and infographics and podcasts in front of the right eyeballs."}, {"bbe1": "You don’t just want a plan for making content. You want a plan for driving attention to it."}, {"58f0": "This is a great time in the content marketing plan building process to map that out. How will you drive traffic to your content?"}, {"0ad1": "You can start with a very simple process for doing so. It could be as straightforward as this:"}, {"25cf": "Full disclosure: that’s not a complete list of things you can do, by any means — especially that last item. You’ll want to promote your content through those heroes and watering holes you described at the beginning of this strategy, and you’ll want to do it in a way that makes them look forward to getting more content from you."}, {"086a": "There’s a lot that can be said when it comes to figuring out a content promotion workflow. For now, it’s important that you have some means of driving traffic to your content once it’s published."}, {"a3f3": "For more on content promotion plans and tactics, go read anything (or everything!) by Brian Dean. I’ve found this video and this guide to be especially insightful."}, {"e6ba": "And here’s a peek at the content distribution checklist used at Buffer:"}, {"3c0f": "Step 20: Write the epilogue"}, {"2ac8": "Sum up your content strategy by painting an awesome picture of what it will be like if you execute on it. You can put lots of interesting things here, including experiments you hope to learn from and awesome blogs your content might be featured on."}, {"fb7d": "But, of course, the most important thing to do is briefly wrap up your strategy by relating it to those business objectives you listed at the very beginning. =)"}, {"497a": "Step 21: Write the executive summary"}, {"e93e": "You’ve done it."}, {"8144": "You have put together the epic content marketing strategy. You might be sitting on top of a 20-page document. Heck, if you’re working with a really big organization, it could be pushing 50 pages. You have just made yourself the ultimate expert on your content."}, {"6363": "Your boss or client is going to be totally floored by the amount of time and research and thought you just put into this."}, {"ea1a": "And they won’t have time to read it. =)"}, {"ce82": "That’s why you’ll want to circle back around and add an executive summary to the beginning of your content strategy. Think of it as a TL;DR that answers four basic questions:"}, {"aaf3": "Ka-BAM!"}, {"2428": "You’re done. =D"}, {"a838": "Download this content marketing strategy template for yourself!"}, {"2f9c": "Image sources: 72pxDesigns, Pablo, Canva"}, {"b1e7": "Originally published at blog.bufferapp.com on November 16, 2015."}], "child": "524_1\t524_2\t524_3\t524_4\t524_5\t524_6\t524_7\t524_8\t524_9\t524_10524_1\t524_2\t524_3\t524_4\t524_5\t524_6\t524_7\t524_8\t524_9\t524_10"}