{"name": "528", "parent": "", "content": "How to Read (a Lot) More Books This Year, According to Harvard Research Reading is a huge key to success and wealth, but how can you actually benefit from this habit as a busy adult? I’ve said it many times: reading books is a major key to success. The mega-rich and successful like Bill Gates and Elon Musk devote extraordinary amounts of their time to reading. Musk even attributes his knowledge of how to build rockets to his reading repertoire, and studies have proven that reading can reduce stress, increase focus, and improve long- and short-term memory. The benefits of flexing your reading muscles are clear. But reading is time-consuming — and as a busy professional, it’s almost impossible to both find the time to read and actually stay focused enough to reap the benefits when deadlines start piling up. Thankfully, experts at Harvard Business Review (along with a few others) have discovered some tips and tricks to ensure that you not only make reading a daily habit, but that you‘re able to radically increase the amount you read and the benefits you reap. Read on for seven practical ways to continue to improve your reading habits as time goes on: 1. Accept that it’s okay to quit. Sometimes I’ll start a book, only to find that I’m not really enjoying it or finding much meaning in it — but I’ll “power through” anyway, because I don’t want to be a quitter. Gretchen Rubin, author of bestselling book The Happiness Project and habit expert at Harvard Business Review, found that this “winners don’t quit” mentality probably won’t work for your reading habit. As Rubin put it, quitting early gives you “More time for reading good books! Less time reading books out of a sense of obligation.” Think of it this way — about 50,000 books are published every year. Why spend time with books you don’t really enjoy? If you ultimately don’t enjoy a novel, free yourself from guilt and put it down. 2. There are hidden minutes everywhere. Stephen King, who attributes reading to much of his incredible success as an author, reportedly told people to read about 5 hours a day if they want to follow in his footsteps. As a time-strapped entrepreneur, I first laughed at that notion. That is until HBR pointed out how often King actually reads on the go, or outside of his house. Take all the times he’s been spotted reading at Red Sox games, for instance. To the average passerby, it might seem insane to whip out a book at Fenway Park. But if they knew that very same habit helped King sell over 350 million books, they might be inclined to bring a paperback next time. As Parisha put it, “There are minutes hidden in all the corners of the day, and they add up to a lot of minutes.” I’m not saying you should whip out a novel at your sister’s wedding ceremony, but there are small opportunities to read nearly everywhere. 3. Keep it quiet. Science shows that sharing your intentions with others when you’re working toward a task or goal can backfire, and make you less likely to succeed. A 2009 study found that when students who wanted to become psychologists wrote down activities that would help them achieve that goal and shared them with the experimenter, they were less likely to actually perform those activities. The control group who did not share their list of intended activities with the experimenter spent much more time pursuing those activities. When people share their goal, they feel less motivation to work hard. So if you’re committing to reading more books, express your goal and your steps to get there — even write it down — but keep it to yourself. 4. Limit distractions. Neil Pasricha made this happen in his home by banishing the TV to the basement, and placing the bookshelf front and center. According to HBR, Pasricha drew inspiration from the famous “chocolate chip cookie and radish” experiment by psychologist Roy Baumeister. Hungry test subjects were asked to complete a lengthy puzzle, and some were given no food, while others were given cookies (and told not to eat them). Unsurprisingly, the cookie group caved the soonest — they were the group that had spent all their willpower staying away from the cookies. 5. Read physical books. The same advice about limiting distractions can be applied in a big way to favoring physical books over e-readers. Having a tangible piece of reading material in your hand — instead of an internet-connected device where you can also check your email or look up recipes on Pinterest — can limit distraction and necessary willpower. But limiting distractions is just one of the reasons to favor physical books over e-novels. In an era where all our entertainment and professional channels are moving to the screen, it’s a good brain refresh to hold a physical book in your hand. 6. Change your mindset. Media strategist and author Ryan Holiday stresses that changing how you think about reading is the key to reading more. “You need to stop thinking of it as ‘some activity that you do… [it] must become as natural as eating and breathing to you. It’s not something you do because you feel like it, but because it’s a reflex, a default,” he says. To the successful, a dream isn’t achieved by deliberating how to reach it, but rather it’s a specific, well-conceived desire that always happens. You can do this today by turning your reading habits into specific, time-sensitive goals, and placing them on the top of your priority list every day. 7. Find curated lists. Decision fatigue is a very real thing, and it can eat away at your willpower when trying to adopt new habits like reading. The overwhelming effort to sift through thousands of new books each year can eat away at your mental power before you actually read a page - and that’s why HBR recommends you find curated book lists. Luckily mega-moguls like Bill Gates and Mark Zuckerberg aren’t shy about sharing their reading lists. With a few minutes of Google sleuthing, you can follow in the reading habits of the greats. Maybe we can’t all read 500 pages a day like Warren Buffet, or finish 50 books a year like Bill Gates. But you can commit to using these tips to read more books this year, improve your ability to absorb information, and benefit from scientific advantages that reading can bring. Call to action If you found these tips useful, connect with me at ElleKaplan.com for more advice. If you have any more tips on reading habits, share them with me on Twitter or leave a comment! ", "title": "How to Read (a Lot) More Books This Year, According to Harvard Research", "sentences": [{"2326": "How to Read (a Lot) More Books This Year, According to Harvard Research"}, {"f3ae": "Reading is a huge key to success and wealth, but how can you actually benefit from this habit as a busy adult?"}, {"49a0": "I’ve said it many times: reading books is a major key to success. The mega-rich and successful like Bill Gates and Elon Musk devote extraordinary amounts of their time to reading. Musk even attributes his knowledge of how to build rockets to his reading repertoire, and studies have proven that reading can reduce stress, increase focus, and improve long- and short-term memory."}, {"975c": "The benefits of flexing your reading muscles are clear. But reading is time-consuming — and as a busy professional, it’s almost impossible to both find the time to read and actually stay focused enough to reap the benefits when deadlines start piling up."}, {"9495": "Thankfully, experts at Harvard Business Review (along with a few others) have discovered some tips and tricks to ensure that you not only make reading a daily habit, but that you‘re able to radically increase the amount you read and the benefits you reap."}, {"55f3": "Read on for seven practical ways to continue to improve your reading habits as time goes on:"}, {"5d94": "1. Accept that it’s okay to quit."}, {"07ef": "Sometimes I’ll start a book, only to find that I’m not really enjoying it or finding much meaning in it — but I’ll “power through” anyway, because I don’t want to be a quitter."}, {"6c11": "Gretchen Rubin, author of bestselling book The Happiness Project and habit expert at Harvard Business Review, found that this “winners don’t quit” mentality probably won’t work for your reading habit."}, {"6c03": "As Rubin put it, quitting early gives you “More time for reading good books! Less time reading books out of a sense of obligation.” Think of it this way — about 50,000 books are published every year. Why spend time with books you don’t really enjoy?"}, {"c3cf": "If you ultimately don’t enjoy a novel, free yourself from guilt and put it down."}, {"6f9d": "2. There are hidden minutes everywhere."}, {"342d": "Stephen King, who attributes reading to much of his incredible success as an author, reportedly told people to read about 5 hours a day if they want to follow in his footsteps."}, {"2527": "As a time-strapped entrepreneur, I first laughed at that notion. That is until HBR pointed out how often King actually reads on the go, or outside of his house. Take all the times he’s been spotted reading at Red Sox games, for instance."}, {"bfc7": "To the average passerby, it might seem insane to whip out a book at Fenway Park. But if they knew that very same habit helped King sell over 350 million books, they might be inclined to bring a paperback next time."}, {"a9b3": "As Parisha put it, “There are minutes hidden in all the corners of the day, and they add up to a lot of minutes.” I’m not saying you should whip out a novel at your sister’s wedding ceremony, but there are small opportunities to read nearly everywhere."}, {"6dd6": "3. Keep it quiet."}, {"37f9": "Science shows that sharing your intentions with others when you’re working toward a task or goal can backfire, and make you less likely to succeed."}, {"af72": "A 2009 study found that when students who wanted to become psychologists wrote down activities that would help them achieve that goal and shared them with the experimenter, they were less likely to actually perform those activities. The control group who did not share their list of intended activities with the experimenter spent much more time pursuing those activities."}, {"1728": "When people share their goal, they feel less motivation to work hard. So if you’re committing to reading more books, express your goal and your steps to get there — even write it down — but keep it to yourself."}, {"e7e9": "4. Limit distractions."}, {"e2e0": "Neil Pasricha made this happen in his home by banishing the TV to the basement, and placing the bookshelf front and center. According to HBR, Pasricha drew inspiration from the famous “chocolate chip cookie and radish” experiment by psychologist Roy Baumeister."}, {"f3bf": "Hungry test subjects were asked to complete a lengthy puzzle, and some were given no food, while others were given cookies (and told not to eat them). Unsurprisingly, the cookie group caved the soonest — they were the group that had spent all their willpower staying away from the cookies."}, {"8f56": "5. Read physical books."}, {"cf65": "The same advice about limiting distractions can be applied in a big way to favoring physical books over e-readers. Having a tangible piece of reading material in your hand — instead of an internet-connected device where you can also check your email or look up recipes on Pinterest — can limit distraction and necessary willpower."}, {"2110": "But limiting distractions is just one of the reasons to favor physical books over e-novels. In an era where all our entertainment and professional channels are moving to the screen, it’s a good brain refresh to hold a physical book in your hand."}, {"1c7d": "6. Change your mindset."}, {"d741": "Media strategist and author Ryan Holiday stresses that changing how you think about reading is the key to reading more. “You need to stop thinking of it as ‘some activity that you do… [it] must become as natural as eating and breathing to you. It’s not something you do because you feel like it, but because it’s a reflex, a default,” he says."}, {"a95c": "To the successful, a dream isn’t achieved by deliberating how to reach it, but rather it’s a specific, well-conceived desire that always happens. You can do this today by turning your reading habits into specific, time-sensitive goals, and placing them on the top of your priority list every day."}, {"9d9c": "7. Find curated lists."}, {"9585": "Decision fatigue is a very real thing, and it can eat away at your willpower when trying to adopt new habits like reading."}, {"0db4": "The overwhelming effort to sift through thousands of new books each year can eat away at your mental power before you actually read a page - and that’s why HBR recommends you find curated book lists."}, {"40eb": "Luckily mega-moguls like Bill Gates and Mark Zuckerberg aren’t shy about sharing their reading lists. With a few minutes of Google sleuthing, you can follow in the reading habits of the greats."}, {"41f5": "Maybe we can’t all read 500 pages a day like Warren Buffet, or finish 50 books a year like Bill Gates. But you can commit to using these tips to read more books this year, improve your ability to absorb information, and benefit from scientific advantages that reading can bring."}, {"c69e": "Call to action"}, {"024a": "If you found these tips useful, connect with me at ElleKaplan.com for more advice."}, {"6b6f": "If you have any more tips on reading habits, share them with me on Twitter or leave a comment!"}], "child": "528_1\t528_2\t528_3\t528_4\t528_5\t528_6\t528_7\t528_8\t528_9\t528_10\t528_11\t528_12\t528_13\t528_14\t528_15\t528_16\t528_17\t528_18\t528_19\t528_20\t528_21\t528_22\t528_23\t528_24"}