{"name": "529", "parent": "", "content": "How to Build a Habit of Pleasure Reading (and why it’s important) I read a lot. No, seriously. A LOT. I’m about halfway through an MFA program that requires me to read ten books a month. I read a poem, a short story, and an essay everyday for The 1000 Day MFA, which is my own baby. I read at least one writing craft book and one business book a month. So, that’s roughly three books a week, plus 30 poems, 30 short stories, and 30 essays a month — all required reading. I have latitude. I get to pick which books, poems, short stories, and essays I read. I love all of that reading. Really. Sometimes I can’t believe that I’ve managed to build a life that involves so much reading. But there’s no space there for just pure pleasure reading. I was feeling the loss. I wanted to read something that was just for me. I wanted to read what I wanted to read, goddammit. Pure pleasure reading is important. Don’t take my word for it, though. Here’s what some authors who have written purely pleasurable books have to say about it. “Sometimes, you read a book and it fills you with this weird evangelical zeal, and you become convinced that the shattered world will never be put back together unless and until all living humans read the book.” ― John Green “A book, too, can be a star, ‘explosive material, capable of stirring up fresh life endlessly,’ a living ﬁre to lighten the darkness, leading out into the expanding universe.” — Madeleine L’Engle A mind needs books as a sword needs a whetstone, if it is to keep its edge. — George R.R. Martin Translation: Pleasure reading connects you to humanity, expands your universe, AND keeps your brain sharp. So, here’s what I did to incorporate pure pleasure reading back into my life: The 10 minutes of a fiction reading a day in the WRITER Framework (you know, the 10 minutes I was already blowing away like a hard sneeze)? I decided that instead of just marking that off as done X 10, I’d dedicate those minutes to reading whatever the hell I wanted to read. That equals about one one novel a month. Last month I read Blackbirds by Chuck Wendig. Ten minutes at a time. TMI time: mostly in the bathroom. http://amzn.to/2nKXsqb It was glorious. (Glorious is my 12-year-old daughter’s favorite word. It makes me a little sad that I didn’t have a favorite word when I was twelve.) Ten whole minutes of reading that didn’t have to go into an annotated bibliography and wasn’t designed to teach me anything. In addition to reading a lot, I spend a good bit of time talking to other people about reading and writing. What I hear a bunch is this: I don’t have time to read. You have to have time to read. Find time. If you want to be a writer, there just isn’t any way around it. Prioritize reading, even if that means keeping a novel in your bathroom and reading it for ten minutes a day. It’s been really important to me to remember that reading is my purest pleasure. My next pure pleasure book is Demelza by Winston Graham. What are you reading? If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Also, it would be awesome if you followed this publication. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "title": "How to Build a Habit of Pleasure Reading", "sentences": [{"3ddb": "How to Build a Habit of Pleasure Reading"}, {"ef7a": "(and why it’s important)"}, {"2248": "I read a lot."}, {"ee4b": "No, seriously. A LOT."}, {"d8f0": "I’m about halfway through an MFA program that requires me to read ten books a month."}, {"fa2c": "I read a poem, a short story, and an essay everyday for The 1000 Day MFA, which is my own baby."}, {"f14e": "I read at least one writing craft book and one business book a month."}, {"6102": "So, that’s roughly three books a week, plus 30 poems, 30 short stories, and 30 essays a month — all required reading. I have latitude. I get to pick which books, poems, short stories, and essays I read."}, {"bbf9": "I love all of that reading. Really. Sometimes I can’t believe that I’ve managed to build a life that involves so much reading. But there’s no space there for just pure pleasure reading."}, {"379b": "I was feeling the loss. I wanted to read something that was just for me. I wanted to read what I wanted to read, goddammit."}, {"5d28": "Pure pleasure reading is important. Don’t take my word for it, though. Here’s what some authors who have written purely pleasurable books have to say about it."}, {"c47f": "“Sometimes, you read a book and it fills you with this weird evangelical zeal, and you become convinced that the shattered world will never be put back together unless and until all living humans read the book.” ― John Green"}, {"291e": "“A book, too, can be a star, ‘explosive material, capable of stirring up fresh life endlessly,’ a living ﬁre to lighten the darkness, leading out into the expanding universe.” — Madeleine L’Engle"}, {"3ea0": "A mind needs books as a sword needs a whetstone, if it is to keep its edge. — George R.R. Martin"}, {"be11": "Translation: Pleasure reading connects you to humanity, expands your universe, AND keeps your brain sharp."}, {"5679": "So, here’s what I did to incorporate pure pleasure reading back into my life:"}, {"3132": "The 10 minutes of a fiction reading a day in the WRITER Framework (you know, the 10 minutes I was already blowing away like a hard sneeze)? I decided that instead of just marking that off as done X 10, I’d dedicate those minutes to reading whatever the hell I wanted to read."}, {"e5f5": "That equals about one one novel a month. Last month I read Blackbirds by Chuck Wendig. Ten minutes at a time. TMI time: mostly in the bathroom."}, {"4717": "http://amzn.to/2nKXsqb"}, {"e993": "It was glorious. (Glorious is my 12-year-old daughter’s favorite word. It makes me a little sad that I didn’t have a favorite word when I was twelve.) Ten whole minutes of reading that didn’t have to go into an annotated bibliography and wasn’t designed to teach me anything."}, {"ab46": "In addition to reading a lot, I spend a good bit of time talking to other people about reading and writing. What I hear a bunch is this: I don’t have time to read."}, {"ffcc": "You have to have time to read. Find time. If you want to be a writer, there just isn’t any way around it. Prioritize reading, even if that means keeping a novel in your bathroom and reading it for ten minutes a day."}, {"b2c3": "It’s been really important to me to remember that reading is my purest pleasure."}, {"0dc9": "My next pure pleasure book is Demelza by Winston Graham. What are you reading?"}, {"993b": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ Also, it would be awesome if you followed this publication."}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "child": "529_1\t529_2\t529_3\t529_4\t529_5\t529_6\t529_7\t529_8\t529_9\t529_10\t529_11\t529_12\t529_13\t529_14\t529_15\t529_16\t529_17529_1\t529_2\t529_3\t529_4\t529_5\t529_6\t529_7\t529_8\t529_9\t529_10\t529_11\t529_12\t529_13\t529_14\t529_15\t529_16\t529_17"}