{"name": "53", "parent": "", "content": "Breaking News Rumor Mill: Knicks, Clippers Searching For Third-Party Team To Complete Deal Centering Around Carmelo Anthony Looks like the trading ‘Melo train is picking up steam… Photo: Jim McIsaac A few days ago, rumors spread that the New York Knicks contacted the Cleveland Cavaliers about a potential Carmelo Anthony-Kevin Love swap. Now, a new rumor emerges about the Knicks attempting to complete a deal with the Los Angeles Clippers. And, crucially, the teams are scrambling to find a third team to keep the trade talks afloat. Via Ramona Shelburne and Marc Stein: The New York Knicks and LA Clippers are searching for third-team facilitators to keep alive the prospect of completing a Carmelo Anthony trade, according to league sources. …The most substantive talks between the teams took place last week, according to sources with knowledge of the discussions, but have continued into this week as the Clippers have maintained a consistent interest in Anthony, who has two years and roughly $53 million remaining on his contract. (via ESPN.com) Okay so maybe that leak about the Knicks being content without a super stud like Blake Griffin or Chris Paul and take guys like Austin Rivers and Jamal Crawford (#OAKAAK) are not valid. I mean, come on, that would be foolish to not get a bona fide star or a first round pick for Carmelo and…oh man that is exactly something the Knickerbockers would do isn’t it? So we’ll keep an eye on the situation for you. It’s really a strange time, I honestly thought ‘Melo would remain a Knick until the end of his contract. Now it seems as though he could be moved before the trade deadline on February 23rd. We’ll keep you updated if anymore trade rumors present themselves or anything more drastic. — Reid Goldsmith, managing editor Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud. ", "title": "Rumor Mill: Knicks, Clippers Searching For Third-Party Team To Complete Deal Centering Around Carmelo Anthony", "sentences": [{"b5ca": "Breaking News"}, {"a45c": "Rumor Mill: Knicks, Clippers Searching For Third-Party Team To Complete Deal Centering Around Carmelo Anthony"}, {"5fac": "Looks like the trading ‘Melo train is picking up steam…"}, {"1624": "Photo: Jim McIsaac"}, {"68ce": "A few days ago, rumors spread that the New York Knicks contacted the Cleveland Cavaliers about a potential Carmelo Anthony-Kevin Love swap."}, {"89eb": "Now, a new rumor emerges about the Knicks attempting to complete a deal with the Los Angeles Clippers. And, crucially, the teams are scrambling to find a third team to keep the trade talks afloat."}, {"7163": "Via Ramona Shelburne and Marc Stein:"}, {"77d4": "The New York Knicks and LA Clippers are searching for third-team facilitators to keep alive the prospect of completing a Carmelo Anthony trade, according to league sources. …The most substantive talks between the teams took place last week, according to sources with knowledge of the discussions, but have continued into this week as the Clippers have maintained a consistent interest in Anthony, who has two years and roughly $53 million remaining on his contract. (via ESPN.com)"}, {"addc": "Okay so maybe that leak about the Knicks being content without a super stud like Blake Griffin or Chris Paul and take guys like Austin Rivers and Jamal Crawford (#OAKAAK) are not valid. I mean, come on, that would be foolish to not get a bona fide star or a first round pick for Carmelo and…oh man that is exactly something the Knickerbockers would do isn’t it?"}, {"a54b": "So we’ll keep an eye on the situation for you. It’s really a strange time, I honestly thought ‘Melo would remain a Knick until the end of his contract. Now it seems as though he could be moved before the trade deadline on February 23rd."}, {"2171": "We’ll keep you updated if anymore trade rumors present themselves or anything more drastic."}, {"22ce": "— Reid Goldsmith, managing editor"}, {"dfbb": "Follow The Knicks Wall on Facebook and Twitter and listen to the TKW Podcast on SoundCloud."}], "child": "53_1"}