{"name": "538", "parent": "", "content": "unwreckless abandon for Anne “Take what’s yours and leave the rest.” She said as I had just given a frustrated groan about the inaccessibility of The Kind Diet, a vegan lifestyle book whose recipes touted Japanese sea vegetables and umeboshi plum paste. I mean, I lived in the most accessible city in the world — New York, and I had no idea where I was supposed to buy a sunchoke in December. Something about the line she uttered stunned me enough to shut me up. I have since used it as a sort of mantra to decide what goes on my plate through the buffet, what to feel when I listen to a TedTalk that makes grandiose claims, at a girlfriend’s “shop ’n’ swap,” a social gathering where we bring items we no longer want in our closets and pick out something ‘new,’ if only to us. I have found comfort in this statement. Understanding what feels right about claiming ownership over a “thing” or “things” makes it easier to dissociate from the entire entity. You are leaving, but not without a piece of it — your piece. In this way, it is much easier to understand what to leave. It is much more difficult to know when to leave. The truth is, we leave all the time. Everything is abandoned. And that is OK. Or maybe it just is. Side note, I just finished the Power of Now by Eckhard Tolle, so my thinking has been esoteric as of recently. We abandon the remainder of a rich dessert after a fully satisfying meal, the winter for a trip to more tropical climates, and we abandon our carts, to the dismay of e-tailers everywhere. We abandon our work everyday. True, there is a difference between hitting send on the last e-mail and packing up for the day so as to beat rush hour traffic and stepping away for the last time from a project you have been toiling at for months or years. Abandon can be extremely painful. It can mean failure, and often does. If you leave before you get what you came for, then yeah, it can really suck — the opposite of success. I used to think success was hitting a milestone, a benchmark — getting an accolade of some sort. I have recently asked others about their definition of success, and that was not an uncommon answer. However, to people to aspire to embark on creative pursuits, we must understand that abandon is inevitable. Eventually, the writer relaxes her knuckles from their poise on the keyboard, the painter pulls her brush away from the canvas. It often feels undone. But it may be helpful to ask yourself when in the midst of a project or a piece — do I have I all I need here without continuing or is there more I can offer? Can I learn anything else here? If we are not continuing to learn, it is likely we should leave. Originally published at www.alisonptugwell.com on December 20, 2016. ", "title": "unwreckless abandon", "sentences": [{"c7eb": "unwreckless abandon"}, {"137a": "for Anne"}, {"4ecb": "“Take what’s yours and leave the rest.”"}, {"3625": "She said as I had just given a frustrated groan about the inaccessibility of The Kind Diet, a vegan lifestyle book whose recipes touted Japanese sea vegetables and umeboshi plum paste. I mean, I lived in the most accessible city in the world — New York, and I had no idea where I was supposed to buy a sunchoke in December."}, {"d3ad": "Something about the line she uttered stunned me enough to shut me up. I have since used it as a sort of mantra to decide what goes on my plate through the buffet, what to feel when I listen to a TedTalk that makes grandiose claims, at a girlfriend’s “shop ’n’ swap,” a social gathering where we bring items we no longer want in our closets and pick out something ‘new,’ if only to us. I have found comfort in this statement. Understanding what feels right about claiming ownership over a “thing” or “things” makes it easier to dissociate from the entire entity. You are leaving, but not without a piece of it — your piece. In this way, it is much easier to understand what to leave. It is much more difficult to know when to leave."}, {"58df": "The truth is, we leave all the time. Everything is abandoned. And that is OK. Or maybe it just is. Side note, I just finished the Power of Now by Eckhard Tolle, so my thinking has been esoteric as of recently. We abandon the remainder of a rich dessert after a fully satisfying meal, the winter for a trip to more tropical climates, and we abandon our carts, to the dismay of e-tailers everywhere. We abandon our work everyday. True, there is a difference between hitting send on the last e-mail and packing up for the day so as to beat rush hour traffic and stepping away for the last time from a project you have been toiling at for months or years. Abandon can be extremely painful. It can mean failure, and often does. If you leave before you get what you came for, then yeah, it can really suck — the opposite of success. I used to think success was hitting a milestone, a benchmark — getting an accolade of some sort. I have recently asked others about their definition of success, and that was not an uncommon answer. However, to people to aspire to embark on creative pursuits, we must understand that abandon is inevitable. Eventually, the writer relaxes her knuckles from their poise on the keyboard, the painter pulls her brush away from the canvas. It often feels undone. But it may be helpful to ask yourself when in the midst of a project or a piece — do I have I all I need here without continuing or is there more I can offer? Can I learn anything else here? If we are not continuing to learn, it is likely we should leave."}, {"09d0": "Originally published at www.alisonptugwell.com on December 20, 2016."}], "child": "538_1\t538_2538_1\t538_2"}