{"name": "539", "parent": "", "content": "To stay or to be left behind? So my boyfriend is the reason I moved back to my hometown. I hate it here. There’s no where to go, nothing to do. My family lives here but I rarely see them. When my SO and I got together he didn’t have a job. He had be laid off and we’ve been struggling ever since. I left my job in the city to get away and when we got together he told me I didn’t have to work that he’d take care of me and my daughter. He used to be on unemployment. I am a widow. I was taken care of before and then when my husband passed away, I had to work. Then I met my boyfriend. It was nice to be taken care of again, although not to the degree that I was used to. I’m talking about bare minimum if even that. Money has never been the issue, it’s that I followed him here to live with HIM -at his family’s home not with his family. With him. Not to be left behind when he finally got his job back. Not to have to go to my parents when he leaves for better opportunities. I feel hurt because he said he’d take care of us. When we are upset he pushes me away. I can’t imagine what it will be like when he leaves. Will I have to stay at his family’s when it already beyond uncomfortable? Will he even care that I see it as wrong because he’s the only reason I moved back here? To be with him… If he’s gone and we have a disagreement I don’t know if we will make it. I’m already very upset. I have invested so much into this relationship, lost so much. It’s like I’m doing it all in vain because he seems to be so nonchalant about my feelings. ", "title": "To stay or to be left behind?", "sentences": [{"c29c": "To stay or to be left behind?"}, {"f1ce": "So my boyfriend is the reason I moved back to my hometown."}, {"a76c": "I hate it here."}, {"fbfe": "There’s no where to go, nothing to do."}, {"991d": "My family lives here but I rarely see them."}, {"1884": "When my SO and I got together he didn’t have a job. He had be laid off and we’ve been struggling ever since."}, {"8330": "I left my job in the city to get away and when we got together he told me I didn’t have to work that he’d take care of me and my daughter."}, {"3004": "He used to be on unemployment."}, {"adca": "I am a widow."}, {"e0a0": "I was taken care of before and then when my husband passed away, I had to work."}, {"ec23": "Then I met my boyfriend."}, {"bc96": "It was nice to be taken care of again, although not to the degree that I was used to."}, {"cdbb": "I’m talking about bare minimum if even that."}, {"6b69": "Money has never been the issue, it’s that I followed him here to live with HIM -at his family’s home not with his family."}, {"2511": "With him."}, {"83c0": "Not to be left behind when he finally got his job back."}, {"e4b2": "Not to have to go to my parents when he leaves for better opportunities."}, {"567d": "I feel hurt because he said he’d take care of us."}, {"331f": "When we are upset he pushes me away."}, {"ad87": "I can’t imagine what it will be like when he leaves."}, {"3a11": "Will I have to stay at his family’s when it already beyond uncomfortable?"}, {"bc1d": "Will he even care that I see it as wrong because he’s the only reason I moved back here? To be with him…"}, {"4205": "If he’s gone and we have a disagreement I don’t know if we will make it."}, {"44a2": "I’m already very upset."}, {"d329": "I have invested so much into this relationship, lost so much."}, {"79bf": "It’s like I’m doing it all in vain because he seems to be so nonchalant about my feelings."}], "child": "539_1539_1"}