{"name": "545", "parent": "", "content": "Excuse me? No. I am not mixing your words. I want you to understand WHO you are talking to… And yes, I am using BOLD PRINT because apparently you cannot comprehend what YOU have written. You said this… “Activist are fighting things that don’t exist. People are seeing racism and sexism and everything in between everywhere. They are protecting criminals and encouraging war on the police. Meanwhile, War is at our doorstep.” Are these not your words?? And I replied to what you wrote, the words YOU wrote above… Well, then I guess there is really not much else to say. All the things you listed about all the activism do not exist. If they don’t exist, then there’s nothing to talk about. I have tried to show you things, yet I guess these things are imaginary. Thank you for the discussion. I have not twisted things around. You have run around the issues I have presented to you. Let me dissect your little diatribe. I have tried in earnest to listen to your reasoning, as MALIGNED as it is, because you are young and DO NOT know your history. My example with gay people was used to show how Gays are now pushing for more. Your words, correct? They are not pushing for more. They are pushing to be treated with the same respect that straight people have had for the past 260 years. These rights are not MORE . Your words? But let me tell you what these friends don’t do and hate when others do. They hate to push for acceptance. Someone doesn’t like them, They respect that. As long as they don’t physically harm them, they shrug it off because what’s the point? What is one person’s words going to do? They don’t look to homophobia as a reason for everything wrong that is happening to them. But that is just what some people are doing. They are pushing for things that are just plain stupid. There’s a saying “ thou doth protest too much”. I suspect it is YOU who is gay. YOU don’t want the attention. I suspect you’re not even a girl, but you use that persona. You’re also a gamer kid. I had a lot more typed up in my reply. But it crashed. I suspect you wouldn’t have read it anyways. You are arguing a losing battle. You can keep speaking out, nonsensical ideologies. Its quite sad, actually. You know nothing. And that will be your path. This is how uninformed you are… You don’t even know the context of this picture, do you? You don’t know your history. You don’t know Trump’s history with his fathers rental histories with the black community. He discriminated against them. And white supremacists LOVE Trump. Find someone else to banter with. I can’t have an intelligent conversation with someone who continues to believe in STUPID ideology. ", "title": "Excuse me? No. I am not mixing your words. I want you to understand WHO you are talking to…", "sentences": [{"7b5f": "Excuse me? No. I am not mixing your words. I want you to understand WHO you are talking to…"}, {"d28b": "And yes, I am using BOLD PRINT because apparently you cannot comprehend what YOU have written."}, {"dff0": "You said this…"}, {"9efb": "“Activist are fighting things that don’t exist. People are seeing racism and sexism and everything in between everywhere. They are protecting criminals and encouraging war on the police. Meanwhile, War is at our doorstep.”"}, {"8968": "Are these not your words??"}, {"1d7f": "And I replied to what you wrote, the words YOU wrote above…"}, {"bef5": "Well, then I guess there is really not much else to say."}, {"7c7a": "All the things you listed about all the activism do not exist. If they don’t exist, then there’s nothing to talk about."}, {"c62f": "I have tried to show you things, yet I guess these things are imaginary."}, {"b098": "Thank you for the discussion."}, {"8e92": "I have not twisted things around."}, {"5056": "You have run around the issues I have presented to you."}, {"606f": "Let me dissect your little diatribe. I have tried in earnest to listen to your reasoning, as MALIGNED as it is, because you are young and DO NOT know your history."}, {"3590": "My example with gay people was used to show how Gays are now pushing for more."}, {"52d5": "Your words, correct?"}, {"3e21": "They are not pushing for more. They are pushing to be treated with the same respect that straight people have had for the past 260 years. These rights are not MORE ."}, {"4a1f": "Your words?"}, {"bf4b": "But let me tell you what these friends don’t do and hate when others do. They hate to push for acceptance. Someone doesn’t like them, They respect that. As long as they don’t physically harm them, they shrug it off because what’s the point? What is one person’s words going to do? They don’t look to homophobia as a reason for everything wrong that is happening to them. But that is just what some people are doing. They are pushing for things that are just plain stupid."}, {"c998": "There’s a saying “ thou doth protest too much”. I suspect it is YOU who is gay. YOU don’t want the attention. I suspect you’re not even a girl, but you use that persona. You’re also a gamer kid."}, {"a990": "I had a lot more typed up in my reply. But it crashed. I suspect you wouldn’t have read it anyways. You are arguing a losing battle. You can keep speaking out, nonsensical ideologies. Its quite sad, actually."}, {"d5b2": "You know nothing. And that will be your path. This is how uninformed you are…"}, {"9e5d": "You don’t even know the context of this picture, do you?"}, {"9ebb": "You don’t know your history. You don’t know Trump’s history with his fathers rental histories with the black community. He discriminated against them. And white supremacists LOVE Trump."}, {"5f1c": "Find someone else to banter with. I can’t have an intelligent conversation with someone who continues to believe in STUPID ideology."}], "child": "545_1\t545_2\t545_3\t545_4\t545_5\t545_6\t545_7\t545_8\t545_9"}