{"name": "547", "parent": "", "content": "Thanks, Carrie Fisher A heroic broad who saved a few lives just by telling the truth If, like me, you’re among the millions of Americans living with mental illness and you feel safe saying it, you can in part thank Carrie Fisher. Yes, she was a gifted actress; yes, she was a mother to a gifted actress; yes, she was a bestselling author; yes, she was an acclaimed screenwriter and script doctor; yes, she was a reliably hilarious, sassy mouth on the red carpet and on talk shows where the hosts often cackled helplessly as she broke the fourth wall and some fifth one she always seemed to invent just for fun. She was also a lifesaver. Carrie Fisher did more to combat mental health stigma by being open about her struggles with bipolar and addiction than did most humans. She was the patron saint of anyone whose mother or father ever drove her up a fucking wall and back down again, with love and madness to spare. What a writer she was. What a mind she had. What a spirit and a soul that refused to be crushed by the weight of her pain and her demons. As a novelist and a screenwriter and a broad with an unruly brain, I felt there was no better role model than she. I still feel that way. When I was a kid and the school referred my folks to a social worker (something I thought was common practice until I grew up and learned it wasn’t), I remember that deeply empathetic, underpaid woman telling me that plenty of very accomplished people got depressed or anxious. She explained to me the difference between what I had (depression) and manic depression (bipolar disorder). She told me that Mike Wallace of “60 Minutes” had depression and that Carrie Fisher had manic depression, and that they both spoke openly about it to help people. I wasn’t that into “Star Wars” yet, but I knew Carrie Fisher was famous and talented and pretty and I had thought she was very funny when somebody accidentally let me watch “When Harry Met Sally.” I remember as a kid I liked her voice. It was a very soothing voice, I thought. So elegant. Years later, I saw her marvelous autobiographical tour de force “Wishful Drinking” on Broadway in 2009 at Studio 54. That same year, and not by coincidence, I stopped trying to be a normal stand-up comic, whatever the hell that meant, and developed a one-woman show about mental illness, “Agorafabulous!” The exclamation point was there because I wasn’t dead by my own hand and I was a little surprised by that. I still am. I did the show around the country in tiny to small to slightly less than small theaters — nothing like Studio 54 or anything Broadway-adjacent, but sometimes the bathroom was actually in the lobby and didn’t open right onto the stage, and that was a plus for audiences in those fair venues. “Agorafabulous!” became my first book, a memoir about mental illness that became a pilot script about mental illness that never became anything other than a good read for some television execs and a couple of fat paychecks for me. I felt so lucky the whole damn time. I still do, when I think about it. It did get me into the Writers Guild of America West. And that’s significant, because it meant comprehensive health insurance. Which, as you’ll soon see, mattered rather significantly for reasons to which Carrie Fisher, who was also in the WGA, likely would’ve related. After I finished doing the stage show but before the book came out, I found myself freelancing as a writer with no health insurance. This was before Obamacare, and it was still legal for insurance companies to refuse to cover you because you’d dared get sick ever in your life. This was called a “pre-existing condition.” I had been depressed more than once, so nobody wanted to let me pay them exorbitant fees in order to obtain care to ensure that I didn’t get depressed again. I was prescribed medication that cost $800 per month. I liked this particular medication because it made me not want to kill myself anymore. It didn’t make me happy, mind you. It just made me not want to die. So I figured I should take it. But I couldn’t afford it on my own, and I didn’t want to ask my family or the credit card company for all that cash just because my brain wouldn’t act right. A fan heard about it through the grapevine (probably me talking about the damn bill on Twitter) and kindly and very illegally mailed me a year’s worth of medication hidden in one of those inventive packages known to drug users and dealers. I was very impressed, in the midst of my enormous sense of relief and gratitude for his generosity with that medication. He’d been prescribed it, hadn’t liked it, and had settled on a better option for him with his doctor. He was doing very well and feeling generous and I was doing reasonably well and feeling grateful. I imagine Carrie Fisher would’ve appreciated that. She was a wild trickster goddess who broke a few laws in her day and lived to tell the tale. It was always a pleasure to read her laugh about her troubles. She knew how to make it funny without making anybody feel guilty or stupid or unworthy. She made people feel better because she made herself the butt of the joke and the figure of fun. She knew she helped people. And she kept on helping people, because she kept on dealing with it. Mental illness never really goes away, you see. There’s no cure. You find your own recipe as best you can and you manage it as best you can. It gets exhausting, because sometimes the recipe changes and you have to change with it. People get tired. Carrie Fisher got tired. She kept going. By her own admission, she found great help later in life in the form of ECT, or electroconvulsive therapy — what they used to call electroshock treatment. It wasn’t a “One Flew Over the Cuckoo’s Nest” nightmare for her, and indeed it isn’t for any patient when it is applied well by a trained expert with appropriate legal consent on all sides. She helped break down the stigma associated with that treatment. When I heard she was gone, I was in a car with my mother driving through the Holland Tunnel. If you have to weep openly at the loss of a great American hero, you may as well do it under a great American river. 2016 has taught me that one measure of a life well-lived is that when you die, you emotionally destroy tons of people who never met you. Congratulations, Carrie, you magnificent bitch. In the end of the year, you motherfucked us all. Yesterday, when we were all just worried about her heart attack, when we figured she still had a shot, I found this framed poster from the show I loved so much. I took this photograph when Carrie Fisher was still with us, as indeed she always shall be. I am so glad we had her for as long as we did, and if I could tell her one thing, it’s that I hope I depress the hell out of half as many people when I die. Good work, Ms. F. You tossed a match behind you and lit the world on fire. Ed. note: Become a member of The Stories. ", "title": "Thanks, Carrie Fisher", "sentences": [{"63fb": "Thanks, Carrie Fisher"}, {"d996": "A heroic broad who saved a few lives just by telling the truth"}, {"8e00": "If, like me, you’re among the millions of Americans living with mental illness and you feel safe saying it, you can in part thank Carrie Fisher."}, {"8b62": "Yes, she was a gifted actress; yes, she was a mother to a gifted actress; yes, she was a bestselling author; yes, she was an acclaimed screenwriter and script doctor; yes, she was a reliably hilarious, sassy mouth on the red carpet and on talk shows where the hosts often cackled helplessly as she broke the fourth wall and some fifth one she always seemed to invent just for fun."}, {"3b37": "She was also a lifesaver."}, {"c1d1": "Carrie Fisher did more to combat mental health stigma by being open about her struggles with bipolar and addiction than did most humans."}, {"ce7c": "She was the patron saint of anyone whose mother or father ever drove her up a fucking wall and back down again, with love and madness to spare."}, {"6715": "What a writer she was. What a mind she had. What a spirit and a soul that refused to be crushed by the weight of her pain and her demons."}, {"a2e1": "As a novelist and a screenwriter and a broad with an unruly brain, I felt there was no better role model than she. I still feel that way."}, {"e57b": "When I was a kid and the school referred my folks to a social worker (something I thought was common practice until I grew up and learned it wasn’t), I remember that deeply empathetic, underpaid woman telling me that plenty of very accomplished people got depressed or anxious. She explained to me the difference between what I had (depression) and manic depression (bipolar disorder). She told me that Mike Wallace of “60 Minutes” had depression and that Carrie Fisher had manic depression, and that they both spoke openly about it to help people. I wasn’t that into “Star Wars” yet, but I knew Carrie Fisher was famous and talented and pretty and I had thought she was very funny when somebody accidentally let me watch “When Harry Met Sally.” I remember as a kid I liked her voice. It was a very soothing voice, I thought. So elegant."}, {"10ec": "Years later, I saw her marvelous autobiographical tour de force “Wishful Drinking” on Broadway in 2009 at Studio 54. That same year, and not by coincidence, I stopped trying to be a normal stand-up comic, whatever the hell that meant, and developed a one-woman show about mental illness, “Agorafabulous!” The exclamation point was there because I wasn’t dead by my own hand and I was a little surprised by that. I still am."}, {"c1a4": "I did the show around the country in tiny to small to slightly less than small theaters — nothing like Studio 54 or anything Broadway-adjacent, but sometimes the bathroom was actually in the lobby and didn’t open right onto the stage, and that was a plus for audiences in those fair venues. “Agorafabulous!” became my first book, a memoir about mental illness that became a pilot script about mental illness that never became anything other than a good read for some television execs and a couple of fat paychecks for me. I felt so lucky the whole damn time. I still do, when I think about it."}, {"2519": "It did get me into the Writers Guild of America West. And that’s significant, because it meant comprehensive health insurance. Which, as you’ll soon see, mattered rather significantly for reasons to which Carrie Fisher, who was also in the WGA, likely would’ve related."}, {"78d6": "After I finished doing the stage show but before the book came out, I found myself freelancing as a writer with no health insurance. This was before Obamacare, and it was still legal for insurance companies to refuse to cover you because you’d dared get sick ever in your life. This was called a “pre-existing condition.” I had been depressed more than once, so nobody wanted to let me pay them exorbitant fees in order to obtain care to ensure that I didn’t get depressed again."}, {"3222": "I was prescribed medication that cost $800 per month. I liked this particular medication because it made me not want to kill myself anymore. It didn’t make me happy, mind you. It just made me not want to die. So I figured I should take it. But I couldn’t afford it on my own, and I didn’t want to ask my family or the credit card company for all that cash just because my brain wouldn’t act right. A fan heard about it through the grapevine (probably me talking about the damn bill on Twitter) and kindly and very illegally mailed me a year’s worth of medication hidden in one of those inventive packages known to drug users and dealers. I was very impressed, in the midst of my enormous sense of relief and gratitude for his generosity with that medication. He’d been prescribed it, hadn’t liked it, and had settled on a better option for him with his doctor. He was doing very well and feeling generous and I was doing reasonably well and feeling grateful."}, {"313b": "I imagine Carrie Fisher would’ve appreciated that. She was a wild trickster goddess who broke a few laws in her day and lived to tell the tale. It was always a pleasure to read her laugh about her troubles. She knew how to make it funny without making anybody feel guilty or stupid or unworthy. She made people feel better because she made herself the butt of the joke and the figure of fun. She knew she helped people. And she kept on helping people, because she kept on dealing with it."}, {"34b9": "Mental illness never really goes away, you see. There’s no cure. You find your own recipe as best you can and you manage it as best you can. It gets exhausting, because sometimes the recipe changes and you have to change with it. People get tired. Carrie Fisher got tired. She kept going."}, {"b36c": "By her own admission, she found great help later in life in the form of ECT, or electroconvulsive therapy — what they used to call electroshock treatment. It wasn’t a “One Flew Over the Cuckoo’s Nest” nightmare for her, and indeed it isn’t for any patient when it is applied well by a trained expert with appropriate legal consent on all sides. She helped break down the stigma associated with that treatment."}, {"cecf": "When I heard she was gone, I was in a car with my mother driving through the Holland Tunnel. If you have to weep openly at the loss of a great American hero, you may as well do it under a great American river."}, {"7610": "2016 has taught me that one measure of a life well-lived is that when you die, you emotionally destroy tons of people who never met you. Congratulations, Carrie, you magnificent bitch. In the end of the year, you motherfucked us all."}, {"af38": "Yesterday, when we were all just worried about her heart attack, when we figured she still had a shot, I found this framed poster from the show I loved so much. I took this photograph when Carrie Fisher was still with us, as indeed she always shall be. I am so glad we had her for as long as we did, and if I could tell her one thing, it’s that I hope I depress the hell out of half as many people when I die. Good work, Ms. F. You tossed a match behind you and lit the world on fire."}, {"a148": "Ed. note: Become a member of The Stories."}], "child": "547_1\t547_2\t547_3\t547_4\t547_5\t547_6\t547_7\t547_8\t547_9\t547_10\t547_11\t547_12\t547_13\t547_14\t547_15\t547_16\t547_17\t547_18\t547_19\t547_20"}