{"name": "551", "parent": "", "content": "Golden There was much more I wanted to include in last night’s thought-ramble, but it was near 2 am and I needed to try to get some sleep. However here’s something really important I’d like to add before moving on to other rambles: my gratitude to the Mediumers from 2016 whom I’ve personally found to be inspirers or encouragers (often both), and whose stuff is, in my mind, golden. These folks include but (in case of mental lapse) are not limited to: Aaron Charles, Anna Groves, Ardith McCann, Aura Wilming, Betta Tryptophan, BHD, Bobbie Johnson, Cami Gram, Charlotte Franklin, C J Maybery, David Fox, David Moser, D Mitchell, Ezinne Ukoha, Gail Boenning, Garnet, gdoc, Jacob Jeffries, Jason Stelzner, Jeffrey Field, Jewels, John Horan, Jonas Ellison, Josh Spilker, j.s.lamb, Kaj Schougaard, Katie Tillwick, Krystal Ocean-Patch, Lisa Beth Miller, Lizella Prescott, Mark H, mark-john clifford, Martin Rezny, Michael Ramsburg, Mike Sturm, Mrinal Bose, Orisirisi, Pat Aitcheson, Randomly Me, Renee Cheung, Richard Menn, Ryan Scott, Sam Radford, Sarah Charles, Sean Howard, SF Ali, Stephanie, Steve Sampson, Teraisa, ThunderPuff, tigger porn, Todd Hannula, Todd Herskovitz, Tom Farr, Tre L. Loadholt, Victoria Van Vlear, Wildcat2030, Wild Flower, and Zac Chapepa. I hope you’ll forgive me (again) for the listing as I simply want to say thank you. Your writing and moments of sharing have enriched my journey here. Also I am sorry if it seems I’m not reading or keeping up as much these days. I have so many excuses for that I won’t bore you with them. But whatever you’re writing, whatever good stuff I’m sure you’re doing.. I raise a bottomless coffee mug to you! May you be blessed this beautiful new year. :)~ ", "title": "Golden", "sentences": [{"7587": "Golden"}, {"470f": "There was much more I wanted to include in last night’s thought-ramble, but it was near 2 am and I needed to try to get some sleep. However here’s something really important I’d like to add before moving on to other rambles: my gratitude to the Mediumers from 2016 whom I’ve personally found to be inspirers or encouragers (often both), and whose stuff is, in my mind, golden."}, {"abbf": "These folks include but (in case of mental lapse) are not limited to: Aaron Charles, Anna Groves, Ardith McCann, Aura Wilming, Betta Tryptophan, BHD, Bobbie Johnson, Cami Gram, Charlotte Franklin, C J Maybery, David Fox, David Moser, D Mitchell, Ezinne Ukoha, Gail Boenning, Garnet, gdoc, Jacob Jeffries, Jason Stelzner, Jeffrey Field, Jewels, John Horan, Jonas Ellison, Josh Spilker, j.s.lamb, Kaj Schougaard, Katie Tillwick, Krystal Ocean-Patch, Lisa Beth Miller, Lizella Prescott, Mark H, mark-john clifford, Martin Rezny, Michael Ramsburg, Mike Sturm, Mrinal Bose, Orisirisi, Pat Aitcheson, Randomly Me, Renee Cheung, Richard Menn, Ryan Scott, Sam Radford, Sarah Charles, Sean Howard, SF Ali, Stephanie, Steve Sampson, Teraisa, ThunderPuff, tigger porn, Todd Hannula, Todd Herskovitz, Tom Farr, Tre L. Loadholt, Victoria Van Vlear, Wildcat2030, Wild Flower, and Zac Chapepa."}, {"2909": "I hope you’ll forgive me (again) for the listing as I simply want to say thank you. Your writing and moments of sharing have enriched my journey here. Also I am sorry if it seems I’m not reading or keeping up as much these days. I have so many excuses for that I won’t bore you with them. But whatever you’re writing, whatever good stuff I’m sure you’re doing.. I raise a bottomless coffee mug to you! May you be blessed this beautiful new year. :)~"}], "child": "551_1\t551_2\t551_3\t551_4\t551_5\t551_6\t551_7\t551_8\t551_9\t551_10\t551_11\t551_12\t551_13\t551_14\t551_15\t551_16\t551_17\t551_18\t551_19\t551_20\t551_21\t551_22\t551_23\t551_24\t551_25"}