{"name": "556", "parent": "", "content": "Sheryl Sandberg Is Starting a New Movement Sandberg has learned a lot about resilience in the past two years. OptionB.Org is her training program for the rest of us. Shortly after Sheryl Sandberg lost her husband suddenly to a heart condition, she was talking to a friend about an upcoming father-child activity. Together, they came up with a plan to fill in for her child’s dad, Dave Goldberg. Thinking about it felt awful, and she wept. “I want Dave,” she told her friend. “I want option A.” The friend, as she later wrote on Facebook, put his arms around her and said, “Option A is not available. So let’s just kick the shit out of option B.” Follow Backchannel: Facebook | Twitter On April 24, just before the second anniversary of Goldberg’s untimely death, Sandberg will publish a book by that name. Cowritten with Wharton professor and Sandberg’s good friend Adam Grant, Option B: Facing Adversity, Building Resilience, and Finding Joy isn’t simply a memoir of her specific loss. It’s a guide to a more resilient future for anyone who has dealt with any form of adversity. And, just as Sandberg started a foundation to help people come together around the themes of her first book, she plans to introduce a nonprofit initiative around this one: OptionB.Org launches today. Sandberg believes resilience — the capacity to recover quickly from difficulty — is a muscle that can be strengthened over time. And certainly, if there were a weight-lifting competition for resilience, she’d likely place near the top, because she’s spent the past two years building that muscle. Consider OptionB.Org her guide for everyone else — methods for lessening the isolation, silence, and despair that accompany everything from death and loss to sexual assault. The website will be a media hub and connection point for people to access resources and community support. Which people, exactly? Well, anyone who is struggling with hard things. To start, the group will focus on seven topics, which will include grief and loss, hate and violence, and raising resilient kids. “The topic areas are based on input from our advisory board,” explains Rachel Thomas, president of the Sheryl Sandberg & Dave Goldberg Family Foundation, which will run OptionB.org along with Lean In. Thomas ticks off a list of more than a dozen individuals, including the Equal Justice Initiative’s Bryan Stevenson and the Global Fund for Women’s Musimbi Kanyoro. “We will learn a lot and grow and evolve,” says Thomas. The site features stories of survivors, including people like NFL star Vernon Turner, who overcame drug abuse and trauma, and Kathy Andersen, a sexual abuse survivor who now helps other young women who’ve survived abuse and exploitation. And you’ll be encouraged to add your own story: Readers can choose — Facebook-style — from an array of reactions such as “Stay strong” and “I feel the same way” to react to the posts, videos, and images. Option B will also run Facebook groups around shared challenges. And, it will connect visitors to other (non-Facebook) groups run over email, or in online forums. The group has partnered with several organizations such as Meetup and The Dinner Party, an organization that runs peer-hosted dinners for those coping with loss, to help folks meet up in person as well. And it will offer material from a broad range of experts. The organization, like the book, is a fitting tribute to a man who was beloved by his family, friends, and the many people whose lives he impacted in Silicon Valley and beyond. Like many tech writers, I have my own Dave Goldberg story. I interacted with him often in the last few years of his life, but it was a small favor on a Friday afternoon that stays with me. It was the spring of 2014 when I still wrote for Fortune, and I had been tasked with writing a cover story about Yahoo’s prospects under Marissa Mayer on a very tight turnaround. I didn’t understand how to evaluate the aging brand, so I called Goldberg for help. He invited me to come by SurveyMonkey, where he was then CEO. A six-year Yahoo veteran with strong financial chops, Goldberg possessed two critical characteristics: He could (A) explain financial concepts I didn’t understand while (B) not making me feel stupid for my questions. He sat with me for over an hour, patiently drawing out concepts in my notebook for me when I was slow to grasp them. There was nothing directly in it for him; I just needed help. This desire to help people, even if there wasn’t a lot in it for him, was central to Goldberg’s legacy. So it’s fitting that Sandberg would honor him by attempting to help others — to share what she has so far learned about how to not only choose but also kick the shit out of Option B. ", "title": "Sheryl Sandberg Is Starting a New Movement", "sentences": [{"7c33": "Sheryl Sandberg Is Starting a New Movement"}, {"0ab1": "Sandberg has learned a lot about resilience in the past two years. OptionB.Org is her training program for the rest of us."}, {"3735": "Shortly after Sheryl Sandberg lost her husband suddenly to a heart condition, she was talking to a friend about an upcoming father-child activity. Together, they came up with a plan to fill in for her child’s dad, Dave Goldberg. Thinking about it felt awful, and she wept. “I want Dave,” she told her friend. “I want option A.”"}, {"ebb9": "The friend, as she later wrote on Facebook, put his arms around her and said, “Option A is not available. So let’s just kick the shit out of option B.”"}, {"4ee3": "Follow Backchannel: Facebook | Twitter"}, {"889d": "On April 24, just before the second anniversary of Goldberg’s untimely death, Sandberg will publish a book by that name. Cowritten with Wharton professor and Sandberg’s good friend Adam Grant, Option B: Facing Adversity, Building Resilience, and Finding Joy isn’t simply a memoir of her specific loss. It’s a guide to a more resilient future for anyone who has dealt with any form of adversity. And, just as Sandberg started a foundation to help people come together around the themes of her first book, she plans to introduce a nonprofit initiative around this one: OptionB.Org launches today."}, {"ce0d": "Sandberg believes resilience — the capacity to recover quickly from difficulty — is a muscle that can be strengthened over time. And certainly, if there were a weight-lifting competition for resilience, she’d likely place near the top, because she’s spent the past two years building that muscle. Consider OptionB.Org her guide for everyone else — methods for lessening the isolation, silence, and despair that accompany everything from death and loss to sexual assault."}, {"f7ed": "The website will be a media hub and connection point for people to access resources and community support. Which people, exactly? Well, anyone who is struggling with hard things. To start, the group will focus on seven topics, which will include grief and loss, hate and violence, and raising resilient kids. “The topic areas are based on input from our advisory board,” explains Rachel Thomas, president of the Sheryl Sandberg & Dave Goldberg Family Foundation, which will run OptionB.org along with Lean In. Thomas ticks off a list of more than a dozen individuals, including the Equal Justice Initiative’s Bryan Stevenson and the Global Fund for Women’s Musimbi Kanyoro. “We will learn a lot and grow and evolve,” says Thomas."}, {"8267": "The site features stories of survivors, including people like NFL star Vernon Turner, who overcame drug abuse and trauma, and Kathy Andersen, a sexual abuse survivor who now helps other young women who’ve survived abuse and exploitation. And you’ll be encouraged to add your own story: Readers can choose — Facebook-style — from an array of reactions such as “Stay strong” and “I feel the same way” to react to the posts, videos, and images."}, {"f6af": "Option B will also run Facebook groups around shared challenges. And, it will connect visitors to other (non-Facebook) groups run over email, or in online forums. The group has partnered with several organizations such as Meetup and The Dinner Party, an organization that runs peer-hosted dinners for those coping with loss, to help folks meet up in person as well. And it will offer material from a broad range of experts."}, {"66ca": "The organization, like the book, is a fitting tribute to a man who was beloved by his family, friends, and the many people whose lives he impacted in Silicon Valley and beyond. Like many tech writers, I have my own Dave Goldberg story. I interacted with him often in the last few years of his life, but it was a small favor on a Friday afternoon that stays with me. It was the spring of 2014 when I still wrote for Fortune, and I had been tasked with writing a cover story about Yahoo’s prospects under Marissa Mayer on a very tight turnaround. I didn’t understand how to evaluate the aging brand, so I called Goldberg for help. He invited me to come by SurveyMonkey, where he was then CEO. A six-year Yahoo veteran with strong financial chops, Goldberg possessed two critical characteristics: He could (A) explain financial concepts I didn’t understand while (B) not making me feel stupid for my questions. He sat with me for over an hour, patiently drawing out concepts in my notebook for me when I was slow to grasp them. There was nothing directly in it for him; I just needed help."}, {"ed49": "This desire to help people, even if there wasn’t a lot in it for him, was central to Goldberg’s legacy. So it’s fitting that Sandberg would honor him by attempting to help others — to share what she has so far learned about how to not only choose but also kick the shit out of Option B."}], "child": "556_1\t556_2"}