{"name": "557", "parent": "", "content": "Nothing Teaches Us More About Life Than Death Embracing Option B. There are few things that test our resilience more than the death of a loved one. Grief can be isolating and grueling and feel insurmountable. But it’s also true that there is nothing that can teach us more about life than death. And when we allow ourselves to receive the lessons that death can teach us, we’ll be more resilient to deal with whatever challenges life brings us. As Sheryl Sandberg puts it in Option B, “I now know that it is possible to experience post-traumatic growth,” she writes. “In the wake of the most crushing blows, people can find greater strength and deeper meaning. I also believe that it is possible to experience pre-traumatic growth — that you don’t have to experience tragedy to build your resilience for whatever lies ahead.” And yet, especially in the West, for as long as we can, we ignore death and put up walls to separate death from the land of the living. We bring in machinery and tubes and technology that make the dying seem less human. And yet death is something we all share. It’s the sine qua non of life. But even though we bond over shared preferences for movies and TV shows and sports teams, we deny ourselves the connection and bond of our shared mortality. My mother taught me many things, but her death was the ultimate lesson about life. She and I were very different. She lived her life with the child-like rhythm of a timeless world. I lived mine with the rhythm of the modern world, as though I was constantly running out of time. When I was always rushing and late and behind, she lived at her own pace, which was dictated by deeply personal and intimate connections. I thought she was ignoring time, but in fact she had mastered it. She believed that rushing meant missing the gifts that come only when you surrender 100 percent of yourself to a task, a conversation, a meal, a relationship, a moment. And that was true up until the moment she died, which was one of the most powerful and transcendent moments of my life. That morning, she’d told my sister Agapi and me that she wanted to go to her favorite food market in Santa Monica, which was like Disneyland to her. We’d only just taken her out of the hospital for congestive heart failure, but there we were at the market anyway, looking through cheese and olives and nuts and chocolate and pretending this was just like any other trip. Back at home, my mother spread out her typical amazing lunch, insisting everybody — Agapi and me, my daughters Christina and Isabella, our housekeeper, Debora Perez, and everyone who worked in my home office at the time — gather round. “Sit now and let us enjoy our food!” It was a feast. Agapi looked at me with optimism: “Look at her appetite for food and love and sharing! This is not a woman who is going to die!” That evening, she was sitting at a little table in her bedroom, shelling shrimp and eating them. “Sit and eat some shrimp!” she said. She had her hair in pigtails and was playing her favorite Greek music. She was like a happy child. Christina and Isabella — then eleven and nine — kept buzzing in and out on their scooters. My mother was standing, just looking at them, pouring all her love into them. And then she fell. I tried to help her back in her bed, but she refused. She was weak — but she was still the same woman who, during the German occupation of Greece, fled to the mountains as part of the Greek Red Cross, taking care of wounded soldiers and hiding Jewish girls. A woman who, when German soldiers arrived at their cabin and threatened to kill everyone if they didn’t surrender the Jews they were hiding, told them categorically to put down their guns, that there were no Jews in their midst. Which they did. From the floor, she looked me in the eye and, in a strong, authoritative voice, she said: “Do not call the paramedics. I’m fine.” Agapi and I were torn. So instead of calling an ambulance, we called the nurse who had taken care of her at home. And we all sat on the floor with her — granddaughters still scooting around, laughing and oblivious, and exactly how my mother wanted it to be. She asked me to open a bottle of red wine and pour a glass for everyone. So there we were, having an impromptu indoor picnic on the floor, telling stories for an hour, waiting for her to feel ready to get up. And there she was, in a beautiful turquoise sarong, making sure all were having a good time. And then suddenly her head fell forward, and she was gone. Later, I found out she’d confided to Debora that she knew her time had come, but asked Debora not to say anything to us, since she knew we’d insist on taking her to the hospital — and she was clear that she wanted to die at home with her daughters, her granddaughters, in the glow of those she loved and who loved her. She didn’t want to miss the moment. Later we put a bench in our garden inscribed with that phrase: “Don’t Miss the Moment.” Saying goodbye to my mother wasn’t easy. And that grief is still something that’s with me everyday. But her death was her final lesson — she had both mastered death and surrendered to it. Which was how she lived her life. Her death taught me that grief isn’t about “closure.” Nor is it something to overcome or get past. It’s something to lean into, to embrace. And to allow oneself the love and connection with others that the heightened vulnerability of death and grief can bring us. Grief and death are inevitable. But the clarity they bring is available to us right now while we are in the land in the living. And if we let their lessons enter our daily lives, we’ll be much more resilient when they do come. We’ll be less likely to see death, and our life after the death of a loved-one, as something unendurable. We’ll realize that’s when Option B really is the only option, and that’s okay. As Sheryl writes, “we all live some form of Option B,” but we also need to remember that “Option B still gives us options.” Letting ourselves grow and become stronger isn’t to dishonor the dead. It’s just the opposite. “Tragedy does not have to be personal, pervasive, or permanent, but resilience can be,” Sheryl writes. “We can build it and carry it with us throughout our lives.” This story originally appeared on OptionB.Org, a nonprofit community dedicated to helping people build resilience and find meaning in the face of adversity. ", "title": "Nothing Teaches Us More About Life Than Death", "sentences": [{"99bb": "Nothing Teaches Us More About Life Than Death"}, {"8a4f": "Embracing Option B."}, {"40ac": "There are few things that test our resilience more than the death of a loved one. Grief can be isolating and grueling and feel insurmountable. But it’s also true that there is nothing that can teach us more about life than death. And when we allow ourselves to receive the lessons that death can teach us, we’ll be more resilient to deal with whatever challenges life brings us. As Sheryl Sandberg puts it in Option B, “I now know that it is possible to experience post-traumatic growth,” she writes. “In the wake of the most crushing blows, people can find greater strength and deeper meaning. I also believe that it is possible to experience pre-traumatic growth — that you don’t have to experience tragedy to build your resilience for whatever lies ahead.”"}, {"3ad9": "And yet, especially in the West, for as long as we can, we ignore death and put up walls to separate death from the land of the living. We bring in machinery and tubes and technology that make the dying seem less human. And yet death is something we all share. It’s the sine qua non of life. But even though we bond over shared preferences for movies and TV shows and sports teams, we deny ourselves the connection and bond of our shared mortality."}, {"9143": "My mother taught me many things, but her death was the ultimate lesson about life. She and I were very different. She lived her life with the child-like rhythm of a timeless world. I lived mine with the rhythm of the modern world, as though I was constantly running out of time. When I was always rushing and late and behind, she lived at her own pace, which was dictated by deeply personal and intimate connections. I thought she was ignoring time, but in fact she had mastered it."}, {"9d39": "She believed that rushing meant missing the gifts that come only when you surrender 100 percent of yourself to a task, a conversation, a meal, a relationship, a moment. And that was true up until the moment she died, which was one of the most powerful and transcendent moments of my life."}, {"980c": "That morning, she’d told my sister Agapi and me that she wanted to go to her favorite food market in Santa Monica, which was like Disneyland to her. We’d only just taken her out of the hospital for congestive heart failure, but there we were at the market anyway, looking through cheese and olives and nuts and chocolate and pretending this was just like any other trip."}, {"4228": "Back at home, my mother spread out her typical amazing lunch, insisting everybody — Agapi and me, my daughters Christina and Isabella, our housekeeper, Debora Perez, and everyone who worked in my home office at the time — gather round. “Sit now and let us enjoy our food!” It was a feast. Agapi looked at me with optimism: “Look at her appetite for food and love and sharing! This is not a woman who is going to die!”"}, {"7f66": "That evening, she was sitting at a little table in her bedroom, shelling shrimp and eating them. “Sit and eat some shrimp!” she said. She had her hair in pigtails and was playing her favorite Greek music. She was like a happy child. Christina and Isabella — then eleven and nine — kept buzzing in and out on their scooters. My mother was standing, just looking at them, pouring all her love into them."}, {"5bac": "And then she fell."}, {"200b": "I tried to help her back in her bed, but she refused. She was weak — but she was still the same woman who, during the German occupation of Greece, fled to the mountains as part of the Greek Red Cross, taking care of wounded soldiers and hiding Jewish girls. A woman who, when German soldiers arrived at their cabin and threatened to kill everyone if they didn’t surrender the Jews they were hiding, told them categorically to put down their guns, that there were no Jews in their midst. Which they did."}, {"bbce": "From the floor, she looked me in the eye and, in a strong, authoritative voice, she said: “Do not call the paramedics. I’m fine.” Agapi and I were torn. So instead of calling an ambulance, we called the nurse who had taken care of her at home. And we all sat on the floor with her — granddaughters still scooting around, laughing and oblivious, and exactly how my mother wanted it to be. She asked me to open a bottle of red wine and pour a glass for everyone."}, {"8a62": "So there we were, having an impromptu indoor picnic on the floor, telling stories for an hour, waiting for her to feel ready to get up. And there she was, in a beautiful turquoise sarong, making sure all were having a good time. And then suddenly her head fell forward, and she was gone."}, {"6d08": "Later, I found out she’d confided to Debora that she knew her time had come, but asked Debora not to say anything to us, since she knew we’d insist on taking her to the hospital — and she was clear that she wanted to die at home with her daughters, her granddaughters, in the glow of those she loved and who loved her. She didn’t want to miss the moment. Later we put a bench in our garden inscribed with that phrase: “Don’t Miss the Moment.”"}, {"098a": "Saying goodbye to my mother wasn’t easy. And that grief is still something that’s with me everyday. But her death was her final lesson — she had both mastered death and surrendered to it. Which was how she lived her life. Her death taught me that grief isn’t about “closure.” Nor is it something to overcome or get past. It’s something to lean into, to embrace. And to allow oneself the love and connection with others that the heightened vulnerability of death and grief can bring us."}, {"3fa8": "Grief and death are inevitable. But the clarity they bring is available to us right now while we are in the land in the living. And if we let their lessons enter our daily lives, we’ll be much more resilient when they do come. We’ll be less likely to see death, and our life after the death of a loved-one, as something unendurable. We’ll realize that’s when Option B really is the only option, and that’s okay. As Sheryl writes, “we all live some form of Option B,” but we also need to remember that “Option B still gives us options.” Letting ourselves grow and become stronger isn’t to dishonor the dead. It’s just the opposite. “Tragedy does not have to be personal, pervasive, or permanent, but resilience can be,” Sheryl writes. “We can build it and carry it with us throughout our lives.”"}, {"7893": "This story originally appeared on OptionB.Org, a nonprofit community dedicated to helping people build resilience and find meaning in the face of adversity."}], "child": "557_1\t557_2557_1\t557_2"}