{"name": "559", "parent": "", "content": "Country Church Author’s Photo: St. John’s Evangelical Lutheran Church, Two Creeks, Wisconsin The organist plays Cannon in D by Pachelbel as she walks down the short aisle. Her arm is linked with her father’s. She concentrates on the music engulfing the tiny space. One foot steps in front of the other. “With this ring, I thee wed — until death do us part,” they each promise. Less than a mile down the road lay a rocky beach, along Lake Michigan’s shore. The guests throw rice, as man and wife exit through doors adorned with stained glass windows. The sun shines to honor the occasion. On Sunday mornings, the organist plays familiar refrains and songs, while the waves tumble the rocks on the beach. It’s rare with the aging congregation, but occasionally a baby receives eternal life through the rite of baptism. Some cry at the wet intrusion upon their heads, while others sleep through it all. In the church basement, volunteers prepare coffee and set out desserts, while the organ booms from the balcony two floors above. Mourners watch, as the casket is slid into the hearse. The country church witnesses the circle of life. And, as lives continue to circle, the waves continue to roll. ", "title": "Country Church", "sentences": [{"12a7": "Country Church"}, {"ec2e": "Author’s Photo: St. John’s Evangelical Lutheran Church, Two Creeks, Wisconsin"}, {"aa0d": "The organist plays Cannon in D by Pachelbel as she walks down the short aisle. Her arm is linked with her father’s. She concentrates on the music engulfing the tiny space. One foot steps in front of the other."}, {"7680": "“With this ring, I thee wed — until death do us part,” they each promise."}, {"2d2d": "Less than a mile down the road lay a rocky beach, along Lake Michigan’s shore."}, {"12c0": "The guests throw rice, as man and wife exit through doors adorned with stained glass windows. The sun shines to honor the occasion."}, {"f6f7": "On Sunday mornings, the organist plays familiar refrains and songs, while the waves tumble the rocks on the beach."}, {"7806": "It’s rare with the aging congregation, but occasionally a baby receives eternal life through the rite of baptism. Some cry at the wet intrusion upon their heads, while others sleep through it all."}, {"d193": "In the church basement, volunteers prepare coffee and set out desserts, while the organ booms from the balcony two floors above. Mourners watch, as the casket is slid into the hearse."}, {"db86": "The country church witnesses the circle of life."}, {"bc79": "And, as lives continue to circle, the waves continue to roll."}], "child": "559_1\t559_2\t559_3\t559_4\t559_5\t559_6\t559_7\t559_8559_1\t559_2\t559_3\t559_4\t559_5\t559_6\t559_7\t559_8559_1\t559_2\t559_3\t559_4\t559_5\t559_6\t559_7\t559_8559_1\t559_2\t559_3\t559_4\t559_5\t559_6\t559_7\t559_8"}