{"name": "560", "parent": "", "content": "(161): Why I Hate Funerals Medieval burial service. Image by Hans Splinter via Flickr. License. I think the most authentic funeral I ever attended was that of my neighbor Rodrigo, the fellow who built my dog fence and kept trying to find the portal to Hell in his house. Because that funeral was real; no one was trying to impress the living people there, and there was no artificial sucking up as a thank you for being included in the will. Rodrigo was not rich, and his relatives were not particularly well-off either; their emotions at his funeral were real and sometimes raw. There was no adjournment to a catered feast or even a moderately priced restaurant. Everyone had the business of survival to get back to. As a rule I hate funerals. They seem to me to expose the worst in humanity. The funeral that really made me lose my faith in human nature (or rather, shift my idea of what human nature really boiled down to) was the death of my great aunt in the early 1990’s. She was a minor-league heiress, and her worth was in the low millions. Everyone seemed to want a piece of that fortune. I was witness to brother fighting brother over the leavings, many little verbal catfights between grown men, and worst of all, the preacher of the church where the services were held used hyper-complimentary language to describe my great aunt, so much so that I realized that something was fishy. I later learned that my aunt had left a large sum of money to that church; the gratitude is expressed in the eulogy. Never have I seen a preacher whose nose was browner than that one’s. Ironically, my brother and I did receive a small cash sum from her will; it was enough for me to pay off my credit card at the time. Although I was thankful for that, I was much more thankful to her for revealing the truth about people I had previously thought to be virtuous and well-meaning, simply because they were my relatives and had done nothing to harm me or my family. Another reason I hate funerals is that, as we all know, they’re more for the living than for the dead, and as such, they’re social events in very uncomfortable circumstances. It is a social command performance, and if people are honest with themselves and others, they’ll admit they don’t want to be there. So a funeral is basically a party that no one wants to go to. My husband has a term for this sort of party: “mando-fun,” as in mandatory fun. Not that anyone believes a funeral is “fun.” I very much prefer a wake, which is a LOT of fun, because everyone is drinking. (Or perhaps I just thought it was fun because *I* was drinking.) At least I know there will be fights over my “estate” at MY funeral, because all I’ll likely have is a whole lot of junk! It makes me wonder who will show up. I’m not going to give a whole lot of brain space to it, though. After all, I won’t be there, not really. The best I can hope to do is not to leave too big a mess for others to clean up. But that’s enough talk about human recycling. ;=) ‘Night y’all! ", "title": "(161): Why I Hate Funerals", "sentences": [{"1fa5": "(161): Why I Hate Funerals"}, {"6992": "Medieval burial service. Image by Hans Splinter via Flickr. License."}, {"0e39": "I think the most authentic funeral I ever attended was that of my neighbor Rodrigo, the fellow who built my dog fence and kept trying to find the portal to Hell in his house. Because that funeral was real; no one was trying to impress the living people there, and there was no artificial sucking up as a thank you for being included in the will. Rodrigo was not rich, and his relatives were not particularly well-off either; their emotions at his funeral were real and sometimes raw. There was no adjournment to a catered feast or even a moderately priced restaurant. Everyone had the business of survival to get back to."}, {"8281": "As a rule I hate funerals. They seem to me to expose the worst in humanity. The funeral that really made me lose my faith in human nature (or rather, shift my idea of what human nature really boiled down to) was the death of my great aunt in the early 1990’s. She was a minor-league heiress, and her worth was in the low millions. Everyone seemed to want a piece of that fortune. I was witness to brother fighting brother over the leavings, many little verbal catfights between grown men, and worst of all, the preacher of the church where the services were held used hyper-complimentary language to describe my great aunt, so much so that I realized that something was fishy."}, {"6fa9": "I later learned that my aunt had left a large sum of money to that church; the gratitude is expressed in the eulogy. Never have I seen a preacher whose nose was browner than that one’s. Ironically, my brother and I did receive a small cash sum from her will; it was enough for me to pay off my credit card at the time. Although I was thankful for that, I was much more thankful to her for revealing the truth about people I had previously thought to be virtuous and well-meaning, simply because they were my relatives and had done nothing to harm me or my family."}, {"390a": "Another reason I hate funerals is that, as we all know, they’re more for the living than for the dead, and as such, they’re social events in very uncomfortable circumstances. It is a social command performance, and if people are honest with themselves and others, they’ll admit they don’t want to be there. So a funeral is basically a party that no one wants to go to. My husband has a term for this sort of party: “mando-fun,” as in mandatory fun. Not that anyone believes a funeral is “fun.” I very much prefer a wake, which is a LOT of fun, because everyone is drinking. (Or perhaps I just thought it was fun because *I* was drinking.)"}, {"bd64": "At least I know there will be fights over my “estate” at MY funeral, because all I’ll likely have is a whole lot of junk! It makes me wonder who will show up. I’m not going to give a whole lot of brain space to it, though. After all, I won’t be there, not really. The best I can hope to do is not to leave too big a mess for others to clean up. But that’s enough talk about human recycling. ;=) ‘Night y’all!"}], "child": "560_1\t560_2\t560_3"}