{"name": "562", "parent": "", "content": "Death is not the only word we say here The first thing I did today was change the calendar in your room from March to April. Now it shows a photo of a cherry tree in full bloom — pink and wide and sagging under all that new life — with yet another alliteration written in the sky: bask in blooming beauty. I am reminded of an afternoon during a trip my wife and I took to Japan in 2004, the two of us sitting on a blanket in Tokyo’s Uneo Park during peak sakura and sipping saki through straws out of tiny cartons. An older couple played guitar nearby, and when they sang “Country Roads,” we smiled and whispered kanpai every time they hit the high note in the chorus: Take me home to the place I beloooong. I remember feeling like I was living one the best moments I would ever live — that in the movie montage of my life, this would be a central scene. And then I remember how, upon returning home to the States, I realized I hadn’t sent you a postcard. I tried to assuage my guilt at the time by telling myself your eyes were too far gone to read it anyway. But now I can’t remember if I ever even told you that I went to Japan. That was exactly 13 years ago. There are 2 buttons on the wall plate beside your bed. The red button is labeled ASSIST. The other button, blacker than a shark’s eye, is CANCEL. The nurses no longer say, She’s good, or She’s not feeling well, or She’s running a temperature when asked how you’re doing. There is only one answer now. They look me right in the eye, soften their voice, and say, She’s comfortable. The woman in the other room cries out one word, over and over: Daddy! In this room, however, there is another word. Our word sinks down our throats like a lead whisper, an immutable anchor whose promise of compassion is stained with guilt: Morphine. Something black wrapped its fingers around my chest last night. I curled up under the sheets of the hotel bed and stared out the window but there was nothing out there to see. I was too panicked to read and couldn’t bring myself to turn on the television. I lay there squirming, trying to name the thing squeezing my ribs together. I am acquainted with sorrow but this was something wilder, something hostile — an inky snake coiled around my body, hissing in my ear, urging me to act. And then it hit me: it was sadness, but it was emboldened by something new and unforgiving: impatience. Hey, Eric. William, the head nurse, touches my arm just as I start to walk away after our conversation ends. He waits until I’m turned back around and facing him — he wants to be sure I understand what he’s about to tell me. You should know, because of the lack of nutrition? He tightens his lips and folds his hands together. Her skin will start to break down. Ok, I say. Thank you. What am I supposed to say? A piece of paper titled TURN CLOCK is taped to the light above you. The illustration of the clock face is divided into 6 equal parts. Each 2 hour block of time is labeled with the position your body is supposed to facing: Back, Window, Door, Back, Window, Door. I whisper what a week would sound like. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. When speaking with us, the staff don’t refer to you as Your mother or Bjørg or Mrs. Olsen. They call you either Mom or Mother. I want to tell them it’s too intimate, that they don’t know you well enough to speak of you in such a way. But then the math of years slaps me back in place: you have lived with them here in their house far longer than I lived with you in yours. Maybe they should be the ones sitting in here, holding your hand, counting your breaths, wondering if they’re doing it right, wondering if they’ve done enough. We come across a piano in the community room of another wing. I sit down and gently play a few notes. It’s horribly out of tune. 2 women in wheelchairs inch closer and insist I keep playing. I tell them I don’t really know how to, that I’m just a guitar player. The woman whose foot is wrapped up to the size of a basketball says, You should play a song anyway. I look down at the keys, find a few chords, and start singing the only song that comes to mind. When I find myself in times of troubleMother Mary comes to meSpeaking words of wisdom, Let it be And in my hour of darknessShe is standing right in front of meSpeaking words of wisdom, Let it be Let it be, let it be, let it be, let it beWhisper words of wisdom, let it be At 10:33pm, my wife texts me photos of you that she’s been pouring over while I’ve been here in Ohio with you. The last picture is of me and you asleep on a train in Norway. I am 11 months old and cradled in your strong arms. As I am looking at this, marveling at all that has happened between then and now, baffled by all that we have become, another text pops up. Now it’s your turn to hold her. And then the tears finally come. Bjørg Åse Olsen exhaled for the last time at 11:22pm on April 2, 2017. She passed away in the arms of her two sons and her future daughter-in-law. Thank you for reading this, for bearing witness with us. The story of our mother and how we helped her leave starts here, continues here, and then finally, here. Afterwards, the business of passing commences. ", "title": "Death is not the only word we say here", "sentences": [{"3c3f": "Death is not the only word we say here"}, {"05b3": "The first thing I did today was change the calendar in your room from March to April. Now it shows a photo of a cherry tree in full bloom — pink and wide and sagging under all that new life — with yet another alliteration written in the sky: bask in blooming beauty. I am reminded of an afternoon during a trip my wife and I took to Japan in 2004, the two of us sitting on a blanket in Tokyo’s Uneo Park during peak sakura and sipping saki through straws out of tiny cartons. An older couple played guitar nearby, and when they sang “Country Roads,” we smiled and whispered kanpai every time they hit the high note in the chorus: Take me home to the place I beloooong. I remember feeling like I was living one the best moments I would ever live — that in the movie montage of my life, this would be a central scene. And then I remember how, upon returning home to the States, I realized I hadn’t sent you a postcard. I tried to assuage my guilt at the time by telling myself your eyes were too far gone to read it anyway. But now I can’t remember if I ever even told you that I went to Japan. That was exactly 13 years ago."}, {"fc85": "There are 2 buttons on the wall plate beside your bed. The red button is labeled ASSIST. The other button, blacker than a shark’s eye, is CANCEL."}, {"28b6": "The nurses no longer say, She’s good, or She’s not feeling well, or She’s running a temperature when asked how you’re doing. There is only one answer now. They look me right in the eye, soften their voice, and say, She’s comfortable."}, {"5b47": "The woman in the other room cries out one word, over and over: Daddy! In this room, however, there is another word. Our word sinks down our throats like a lead whisper, an immutable anchor whose promise of compassion is stained with guilt: Morphine."}, {"3b4e": "Something black wrapped its fingers around my chest last night. I curled up under the sheets of the hotel bed and stared out the window but there was nothing out there to see. I was too panicked to read and couldn’t bring myself to turn on the television. I lay there squirming, trying to name the thing squeezing my ribs together. I am acquainted with sorrow but this was something wilder, something hostile — an inky snake coiled around my body, hissing in my ear, urging me to act. And then it hit me: it was sadness, but it was emboldened by something new and unforgiving: impatience."}, {"07a3": "Hey, Eric. William, the head nurse, touches my arm just as I start to walk away after our conversation ends. He waits until I’m turned back around and facing him — he wants to be sure I understand what he’s about to tell me. You should know, because of the lack of nutrition? He tightens his lips and folds his hands together. Her skin will start to break down."}, {"5117": "Ok, I say. Thank you. What am I supposed to say?"}, {"cce2": "A piece of paper titled TURN CLOCK is taped to the light above you. The illustration of the clock face is divided into 6 equal parts. Each 2 hour block of time is labeled with the position your body is supposed to facing: Back, Window, Door, Back, Window, Door. I whisper what a week would sound like."}, {"5cbb": "Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door. Back, Window, Door, Back, Window, Door, Back, Window, Door, Back, Window, Door."}, {"65f6": "When speaking with us, the staff don’t refer to you as Your mother or Bjørg or Mrs. Olsen. They call you either Mom or Mother. I want to tell them it’s too intimate, that they don’t know you well enough to speak of you in such a way. But then the math of years slaps me back in place: you have lived with them here in their house far longer than I lived with you in yours. Maybe they should be the ones sitting in here, holding your hand, counting your breaths, wondering if they’re doing it right, wondering if they’ve done enough."}, {"11b2": "We come across a piano in the community room of another wing. I sit down and gently play a few notes. It’s horribly out of tune. 2 women in wheelchairs inch closer and insist I keep playing. I tell them I don’t really know how to, that I’m just a guitar player. The woman whose foot is wrapped up to the size of a basketball says, You should play a song anyway. I look down at the keys, find a few chords, and start singing the only song that comes to mind."}, {"b4c2": "When I find myself in times of troubleMother Mary comes to meSpeaking words of wisdom, Let it be"}, {"b226": "And in my hour of darknessShe is standing right in front of meSpeaking words of wisdom, Let it be"}, {"9f57": "Let it be, let it be, let it be, let it beWhisper words of wisdom, let it be"}, {"eb5a": "At 10:33pm, my wife texts me photos of you that she’s been pouring over while I’ve been here in Ohio with you. The last picture is of me and you asleep on a train in Norway. I am 11 months old and cradled in your strong arms. As I am looking at this, marveling at all that has happened between then and now, baffled by all that we have become, another text pops up."}, {"06f6": "Now it’s your turn to hold her."}, {"0d0f": "And then the tears finally come."}, {"df1a": "Bjørg Åse Olsen exhaled for the last time at 11:22pm on April 2, 2017. She passed away in the arms of her two sons and her future daughter-in-law."}, {"8e90": "Thank you for reading this, for bearing witness with us. The story of our mother and how we helped her leave starts here, continues here, and then finally, here. Afterwards, the business of passing commences."}], "child": "562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24562_1\t562_2\t562_3\t562_4\t562_5\t562_6\t562_7\t562_8\t562_9\t562_10\t562_11\t562_12\t562_13\t562_14\t562_15\t562_16\t562_17\t562_18\t562_19\t562_20\t562_21\t562_22\t562_23\t562_24"}