{"name": "565", "parent": "", "content": "Alternate Living It’s about Cheetos and a Happy Meal, a banquet of the Gods. It’s fluffy like a puppy and fresh falling snow as seen through a convenience store window. It’s not about the suicide but the legacy. It’s a ton of prescription drugs and their efficacy. It’s the need to pump dirty sands through sacred lands. It’s screw the people we have a business to run. It’s overseas, we’re outta here. It’s less than you can live on but we get a raise every year. It’s about what you have been led to believe and how easily you are deceived. It’s the glint of hope encouraged by a lie that ignores your suffering cry. It’s the spirit that is parched should life be an agonizing death march? Where is the underdog to save the day? Did he head for the coast? Is that what I heard someone say? In each of us it does reside we need to find it and not hide. It’s a storm that raged forever, let’s weather it together. ", "title": "Alternate Living", "sentences": [{"bdd2": "Alternate Living"}, {"fb4f": "It’s about Cheetos and a Happy Meal, a banquet of the Gods."}, {"c772": "It’s fluffy like a puppy and fresh falling snow"}, {"827c": "as seen through a convenience store window."}, {"e43e": "It’s not about the suicide but the legacy."}, {"1311": "It’s a ton of prescription drugs and their efficacy."}, {"63ca": "It’s the need to pump dirty sands through sacred lands."}, {"cfb3": "It’s screw the people we have a business to run."}, {"4649": "It’s overseas, we’re outta here."}, {"8542": "It’s less than you can live on but we get a raise every year."}, {"a3bb": "It’s about what you have been led to believe"}, {"ef2f": "and how easily you are deceived."}, {"2fb0": "It’s the glint of hope encouraged by a lie"}, {"06cb": "that ignores your suffering cry."}, {"1e19": "It’s the spirit that is parched"}, {"fbd7": "should life be an agonizing death march?"}, {"d9a8": "Where is the underdog to save the day?"}, {"5dd9": "Did he head for the coast?"}, {"2299": "Is that what I heard someone say?"}, {"7386": "In each of us it does reside"}, {"c762": "we need to find it and not hide."}, {"322a": "It’s a storm that raged forever,"}, {"8ecf": "let’s weather it together."}], "child": "565_1\t565_2\t565_3"}