{"name": "567", "parent": "", "content": "Do you listen to yourself? Listening to our inner voice has been discouraged in our society for a long time. But why is that? Have we become accustomed to living only externally and on the rare occasion maybe listening to our intuition when we decide it is important? If we don’t learn to cultivate the habit through meditation or focused exercises on a daily basis we can be missing out on a great inner wisdom that is available to each and everyone of us all the time. This inner knowing helps guide us through life with any and all interactions and decisions. I was fortunate enough to be raised between the Eastern and Western cultures and even so I have had to consciously choose daily to incorporate daily practices which now are just a way of being. The importance of listening and connecting to our inner voice was passed down to me from family and friends however along the way I started to see in my own life as well as close family members that when we were out of the daily practice of connecting with our inner selves how life seemed to be overwhelming, stressed and sometimes a feeling of being totally lost and disconnected. Fortunately more and more people are beginning to learn to connect inwardly on a daily basis as a normal activity, just like we get up and take a shower, get dressed and eat breakfast. It becomes the way of your being. Our state of being has so much to do with the experiences we have in our life in all realms. We must find a way to be centered, grounded and connected in order to be awake on our journey rather than simply reacting to everything and anything that gets thrown our way. As we enter the last week of 2015, reflect upon your own life and how you respond to things in your life. Do you have a daily ritual that leaves you feeling energized, connected and at peace? If not,make an intention to learn how to do this. If meditation or any other focused activities are new to you, be gentle and patient with yourself when learning something new. Set the intention to have the best 2016 you can have. ‪#‎intention‬‪#‎best2016‬‪#‎meditation‬ ", "title": "Do you listen to yourself?", "sentences": [{"b03b": "Do you listen to yourself?"}, {"de89": "Listening to our inner voice has been discouraged in our society for a long time. But why is that? Have we become accustomed to living only externally and on the rare occasion maybe listening to our intuition when we decide it is important?"}, {"08e8": "If we don’t learn to cultivate the habit through meditation or focused exercises on a daily basis we can be missing out on a great inner wisdom that is available to each and everyone of us all the time. This inner knowing helps guide us through life with any and all interactions and decisions."}, {"0c3b": "I was fortunate enough to be raised between the Eastern and Western cultures and even so I have had to consciously choose daily to incorporate daily practices which now are just a way of being. The importance of listening and connecting to our inner voice was passed down to me from family and friends however along the way I started to see in my own life as well as close family members that when we were out of the daily practice of connecting with our inner selves how life seemed to be overwhelming, stressed and sometimes a feeling of being totally lost and disconnected."}, {"1f5f": "Fortunately more and more people are beginning to learn to connect inwardly on a daily basis as a normal activity, just like we get up and take a shower, get dressed and eat breakfast. It becomes the way of your being. Our state of being has so much to do with the experiences we have in our life in all realms. We must find a way to be centered, grounded and connected in order to be awake on our journey rather than simply reacting to everything and anything that gets thrown our way."}, {"782f": "As we enter the last week of 2015, reflect upon your own life and how you respond to things in your life. Do you have a daily ritual that leaves you feeling energized, connected and at peace? If not,make an intention to learn how to do this. If meditation or any other focused activities are new to you, be gentle and patient with yourself when learning something new. Set the intention to have the best 2016 you can have."}, {"86d3": "‪#‎intention‬‪#‎best2016‬‪#‎meditation‬"}], "child": "567_1"}