{"name": "574", "parent": "", "content": "Constantly & Consistently… There are incessant dialogues going on within me from the time when I was growing up, when I attended school, when I went to hostel, college, office when I was among my relatives and friends, when I was instructed what to do, what not to do and how to do and… when I was with me. Others call it inner voice but I call it restless and relentless dialogues. One is a noun and the other is the meaning of the noun. But the meaning gives me a complete understanding and I prefer to call it as “restless and relentless dialogues”. They begin out of nowhere. They intrude into me, with and without my permission. They bring up a life event. They remind me of it. They paint the pictures of it in my mind. They initiate the conversation. They see to it that I respond to them. They gradually start to command me, instruct me, perplex me, confuse me, enervate me, guide me, help me, teach me, enforce me, sometimes even make me happy and light. They react within me. They expect a response from me. They make me act. They stare at me and I stare at them. They are confused and I stay a lot more confused. But I try to restrict them. They try to overcome and overwhelm me. They pin me down. I fight back in defence. I try to make my point clear. I try to understand them. I try to bring in a meaningful and an amicable settlement. They also try to understand me yet add a lot more to the argument. Both of us wanted to be one but helplessly we exist in duality, duality of all that can possibly exist, constantly and consistently confounding each other. I don’t know what happens in such feuds, when I try to get some meaning and understanding from it despite the heated conversation, the inner voices suddenly disappear leaving no trace of the argument. I stand there with a forlorn expression unable to understand the conversation and the purpose of having it. A lot of questions would line up within me in that moment — “Why am I forced into this conversation? Why this conversation? Of many things going on in me, why THIS topic was dissected and discussed? Why did it go away without an amicable settlement? When will it come again? Or will it come again? What are the points that I should stay strong about? What was it trying to tell me? Why is the conversation rude at times? Why does it speak against me? Is it trying to make me strong? Is it trying to defeat me? Is it cautioning me? ” Despite these endless thoughts, never had I doubted about its usefulness. Just that I’m not able to bridge the gap. Sometimes they bring out the best in me. Sometimes they bring out the beast in me. Why they prop up and why they fade away instantly is an unsolvable mystery until now to me. They come with no notice but they leave with marks; sometimes, marks of stress and pain in my facial muscles; sometimes marks of happiness and satisfaction. When the dialogues happen, my eyes cannot rest. I lose control over my eyes. Though I see my environment I exist, notice, see and register clearly what happens in those inner conversational moments. My hands and legs play involuntary actions on its own. The incongruent conversation becomes the master of my body and I lose my mind. I feel static but I feel the whole world is revolving and happening around me. Like usual habitual moments, when I was about to sink in within me, a sudden spark, again from nowhere, enlightens me, brightening up my eyes and face with a glowing smile! Am I alone the scapegoat of such conversations?! Every human being is!! For a moment, I felt like having a means to watch others dialogues as well. Another spark stuck me whispering, do you want others headaches too?? Let them have theirs. You suffer yours or you tackle yours. As I stand there in a what-happened-now-to-me moment, from nowhere one other restless and relentless dialogue started within my head. This reminded me of some other life event. Effortlessly, I’ll synced up with the new dialogues until it went away; that’s when it stuck me that the whole cycle has repeated again! ", "title": "Constantly & Consistently…", "sentences": [{"5b6e": "Constantly & Consistently…"}, {"8c3a": "There are incessant dialogues going on within me from the time when I was growing up, when I attended school, when I went to hostel, college, office when I was among my relatives and friends, when I was instructed what to do, what not to do and how to do and… when I was with me."}, {"7be3": "Others call it inner voice but I call it restless and relentless dialogues. One is a noun and the other is the meaning of the noun. But the meaning gives me a complete understanding and I prefer to call it as “restless and relentless dialogues”."}, {"8ebc": "They begin out of nowhere. They intrude into me, with and without my permission. They bring up a life event. They remind me of it. They paint the pictures of it in my mind. They initiate the conversation. They see to it that I respond to them. They gradually start to command me, instruct me, perplex me, confuse me, enervate me, guide me, help me, teach me, enforce me, sometimes even make me happy and light. They react within me. They expect a response from me. They make me act. They stare at me and I stare at them. They are confused and I stay a lot more confused. But I try to restrict them. They try to overcome and overwhelm me. They pin me down. I fight back in defence. I try to make my point clear. I try to understand them. I try to bring in a meaningful and an amicable settlement. They also try to understand me yet add a lot more to the argument. Both of us wanted to be one but helplessly we exist in duality, duality of all that can possibly exist, constantly and consistently confounding each other."}, {"9cd4": "I don’t know what happens in such feuds, when I try to get some meaning and understanding from it despite the heated conversation, the inner voices suddenly disappear leaving no trace of the argument. I stand there with a forlorn expression unable to understand the conversation and the purpose of having it. A lot of questions would line up within me in that moment — “Why am I forced into this conversation? Why this conversation? Of many things going on in me, why THIS topic was dissected and discussed? Why did it go away without an amicable settlement? When will it come again? Or will it come again? What are the points that I should stay strong about? What was it trying to tell me? Why is the conversation rude at times? Why does it speak against me? Is it trying to make me strong? Is it trying to defeat me? Is it cautioning me? ” Despite these endless thoughts, never had I doubted about its usefulness. Just that I’m not able to bridge the gap. Sometimes they bring out the best in me. Sometimes they bring out the beast in me. Why they prop up and why they fade away instantly is an unsolvable mystery until now to me."}, {"4175": "They come with no notice but they leave with marks; sometimes, marks of stress and pain in my facial muscles; sometimes marks of happiness and satisfaction. When the dialogues happen, my eyes cannot rest. I lose control over my eyes. Though I see my environment I exist, notice, see and register clearly what happens in those inner conversational moments. My hands and legs play involuntary actions on its own. The incongruent conversation becomes the master of my body and I lose my mind."}, {"7bcc": "I feel static but I feel the whole world is revolving and happening around me. Like usual habitual moments, when I was about to sink in within me, a sudden spark, again from nowhere, enlightens me, brightening up my eyes and face with a glowing smile!"}, {"afca": "Am I alone the scapegoat of such conversations?! Every human being is!! For a moment, I felt like having a means to watch others dialogues as well. Another spark stuck me whispering, do you want others headaches too?? Let them have theirs. You suffer yours or you tackle yours."}, {"ec89": "As I stand there in a what-happened-now-to-me moment, from nowhere one other restless and relentless dialogue started within my head. This reminded me of some other life event. Effortlessly, I’ll synced up with the new dialogues until it went away; that’s when it stuck me that the whole cycle has repeated again!"}], "child": "574_1"}