{"content": "“Lynching” is not a buzz-word Me, I’m fish-belly white. Let’s establish that right now. But I’ve also been interested in African American history for about 30 years, and I’ve been empathetic to their fight for rights in America since my father brought home a copy of The Underground Railway for me as a gift when I was 12. (I was 12!) So, when I see white folks using the word “lynching” as if it’s an applicable description of duress they’ve experienced, it makes me lose my mind a little. White folks, we don’t get lynched. We don’t have a clue what lynching is like, or what the spectre of its possibility would feel like in our lives, ever. We don’t have that history. (I’ve been reminded of history on this; yes, white folk have been, but it’s been awhile, and far less frequently than blacks.) Just today a column has emerged in Canada’s esteemed Globe & Mail, written by Konrad Yakabuski entitled “Joseph Boyden’s lynching should set off alarm bells”. You said what, now? Whoa, whoa, whoa. Basically, the gist of this is the First Nations community here in Canada are saying to Boyden, “Back that truck up, white boy, you’re not so native as you think you are.” But Konrad, in his infinite wisdom, likens this to President Obama, saying Obama isn’t black, he was mostly white, but became black. Like Obama woke up one day, had a cup of coffee, only to discover he was drinking a big batch of pigment instead. I’m sure most people just thought Obama was tanned and gave him a pass in America. Come on, man. Just because you’re raised with a white parent doesn’t mean you get to duck under the radar on skin colour. It doesn’t mean you don’t have to be scared when pulled over in a car for no reason in modern-day America. Being First Nations is More than Just DNA Enter Joseph Boyden here in Canada. The First Nations experience here in Canada is filled with struggle. It didn’t end in the 1870s; it barely ended in the 1980s. There are still reservations in Canada which don’t receive clean drinking water. There are still Natives alive today who experienced the horrors of the Residential School Scandal. Eugenics, aka forced sterilization, were committed on First Nations in Alberta until the ’70s. There are people alive who remember these experiences first-hand. Being native isn’t just a matter of knowing how to make bannock and having great cheekbones, okay? For Boyden to just casually insert himself into that cultural heritage and reap societal acclaim and reward for it, that’s something that First Nations people have a right to have a beef with. But here’s the deal. No First Nations people have grabbed a rope. Boyden isn’t swinging from a tree. He hasn’t been beaten with tire irons, tarred, cut, or tortured in any way. Let’s refresh your memory. This is what “lynching” looks like: And this is what a lynching reads like: Ell Persons was a black man accused of, but never tried for, raping and murdering a white girl. In May, 1917, it was announced Persons would be lynched. Wikipedia explains how that spectacle/horror unfolded: The scene at Macon Road near the bridge on the day of the lynching was like a “holiday” according to one newspaper, many people having stayed overnight. In the morning hundreds of men, women, and children gathered, and by 9.00 a.m. the road was packed with automobiles. A total of about 5,000 people attended the event, which had a carnival-like atmosphere according to Goings and Smith. Spectators bought soft drinks, sandwiches, and chewing gum, women wore their best clothes, and parents excused their children from school. One teacher at a school had 50 boys absent. Because of examinations, some county schools closed early, allowing the children to attend. Two trucks of drinks sold out swiftly, and sales of sandwiches and chewing gum were high.[4] Having arrived separately to Persons at about 9.00 am, Rappel’s mother gave a speech: “I want to thank all my friends who have worked so hard on my behalf … Let the Negro suffer as my little girl suffered, only 10 times worse” — sentiments which were echoed by the crowd. Persons was chained down, had a large quantity of gasoline poured over him, and set alight. The leader of the group had asked Rappel’s mother if she wanted to light it; she declined, but said she “wished Persons to suffer the tortures he dealt to his victim”. Persons was reportedly calm and casual, and made no sound except for a “faint pig squeal” when set alight. Mays said he stood close to his head “in spite of the African odor” and watched the whole performance. Members of the mob tried to help women who could not see get a better view, but they failed because of the sheer numbers. While Persons was burning, spectators snatched pieces of his clothes and the rope used to bind him. A newspaper described the moment of the lighting: “A crowd of some 5,000 men, women and children cheered gloatingly as the match was applied and a moment later the flames and smoke rose high in the air and snuffed out the life of the black fiend.”[5] Persons’ body was decapitated and dismembered, and his remains were scattered and displayed across Beale Street — the centre of the African American community in Memphis — where his head was thrown from a car at a group of African Americans. According to Charles W. Cansler, a spokesman for the local black community, his head was thrown into a room which contained black doctors. His remains were taken as souvenirs, and photographs of his head were sold on postcards for months after the event. The Commercial Appeal’s headline the day after the lynching read: “Thousands cheered when negro burned: Ell Persons pays death penalty for killing girl”, and their editorial on 25 May described the lynching as “orderly. There was no drunkenness, no shooting and no yelling.” [6] So, no. Joseph Boyden isn’t being “lynched” by the media. Boyden is being questioned, challenged, disputed, confronted. He may feel he is being antagonized, bullied, chastised, castigated, hounded, belittled, harassed. But he is wrong, incorrect, mistaken, inaccurate, imprecise, erroneous. Words Matter, Writers Remember the “thesaurus”? They’re useful! I like them! In fact, in 2016, one doesn’t even need to stand up, walk to a shelf, and thumb through a paperback thesaurus. All one needs to do is highlight a word in their writing program, right click, select “synonyms,” and you’ll get a suitable list of alternatives. Computers are swell! There’s no reason for lazy, entitled writers like Yakabuski to reach for the dramatic word to add oomph to their story. “Lynching” is a word that must be struck from our vocabulary. Unless speaking about someone beaten and tortured to death then left on display like some sordid Halloween decoration, there is no way “lynching” is the word you are looking for. ", "child": "58_1\t58_2\t58_3\t58_4\t58_5\t58_6\t58_7\t58_8\t58_9\t58_10\t58_11\t58_12\t58_13\t58_14\t58_15\t58_16\t58_17\t58_18\t58_19\t58_20\t58_21\t58_22", "title": "“Lynching” is not a buzz-word", "parent": "", "sentences": [{"a70c": "“Lynching” is not a buzz-word"}, {"c109": "Me, I’m fish-belly white. Let’s establish that right now."}, {"72cc": "But I’ve also been interested in African American history for about 30 years, and I’ve been empathetic to their fight for rights in America since my father brought home a copy of The Underground Railway for me as a gift when I was 12. (I was 12!)"}, {"81bd": "So, when I see white folks using the word “lynching” as if it’s an applicable description of duress they’ve experienced, it makes me lose my mind a little."}, {"cf16": "White folks, we don’t get lynched. We don’t have a clue what lynching is like, or what the spectre of its possibility would feel like in our lives, ever. We don’t have that history. (I’ve been reminded of history on this; yes, white folk have been, but it’s been awhile, and far less frequently than blacks.)"}, {"af24": "Just today a column has emerged in Canada’s esteemed Globe & Mail, written by Konrad Yakabuski entitled “Joseph Boyden’s lynching should set off alarm bells”."}, {"65f4": "You said what, now?"}, {"3d5d": "Whoa, whoa, whoa."}, {"4f62": "Basically, the gist of this is the First Nations community here in Canada are saying to Boyden, “Back that truck up, white boy, you’re not so native as you think you are.”"}, {"05dd": "But Konrad, in his infinite wisdom, likens this to President Obama, saying Obama isn’t black, he was mostly white, but became black. Like Obama woke up one day, had a cup of coffee, only to discover he was drinking a big batch of pigment instead."}, {"f0a8": "I’m sure most people just thought Obama was tanned and gave him a pass in America. Come on, man. Just because you’re raised with a white parent doesn’t mean you get to duck under the radar on skin colour. It doesn’t mean you don’t have to be scared when pulled over in a car for no reason in modern-day America."}, {"4a41": "Being First Nations is More than Just DNA"}, {"871c": "Enter Joseph Boyden here in Canada. The First Nations experience here in Canada is filled with struggle. It didn’t end in the 1870s; it barely ended in the 1980s. There are still reservations in Canada which don’t receive clean drinking water. There are still Natives alive today who experienced the horrors of the Residential School Scandal. Eugenics, aka forced sterilization, were committed on First Nations in Alberta until the ’70s. There are people alive who remember these experiences first-hand."}, {"5c35": "Being native isn’t just a matter of knowing how to make bannock and having great cheekbones, okay?"}, {"850e": "For Boyden to just casually insert himself into that cultural heritage and reap societal acclaim and reward for it, that’s something that First Nations people have a right to have a beef with."}, {"a1f8": "But here’s the deal."}, {"2815": "No First Nations people have grabbed a rope. Boyden isn’t swinging from a tree. He hasn’t been beaten with tire irons, tarred, cut, or tortured in any way."}, {"2d8d": "Let’s refresh your memory."}, {"8848": "This is what “lynching” looks like:"}, {"019b": "And this is what a lynching reads like:"}, {"eb5a": "Ell Persons was a black man accused of, but never tried for, raping and murdering a white girl. In May, 1917, it was announced Persons would be lynched."}, {"52eb": "Wikipedia explains how that spectacle/horror unfolded:"}, {"20c3": "The scene at Macon Road near the bridge on the day of the lynching was like a “holiday” according to one newspaper, many people having stayed overnight. In the morning hundreds of men, women, and children gathered, and by 9.00 a.m. the road was packed with automobiles. A total of about 5,000 people attended the event, which had a carnival-like atmosphere according to Goings and Smith. Spectators bought soft drinks, sandwiches, and chewing gum, women wore their best clothes, and parents excused their children from school. One teacher at a school had 50 boys absent. Because of examinations, some county schools closed early, allowing the children to attend. Two trucks of drinks sold out swiftly, and sales of sandwiches and chewing gum were high.[4]"}, {"e909": "Having arrived separately to Persons at about 9.00 am, Rappel’s mother gave a speech: “I want to thank all my friends who have worked so hard on my behalf … Let the Negro suffer as my little girl suffered, only 10 times worse” — sentiments which were echoed by the crowd. Persons was chained down, had a large quantity of gasoline poured over him, and set alight. The leader of the group had asked Rappel’s mother if she wanted to light it; she declined, but said she “wished Persons to suffer the tortures he dealt to his victim”. Persons was reportedly calm and casual, and made no sound except for a “faint pig squeal” when set alight. Mays said he stood close to his head “in spite of the African odor” and watched the whole performance. Members of the mob tried to help women who could not see get a better view, but they failed because of the sheer numbers. While Persons was burning, spectators snatched pieces of his clothes and the rope used to bind him. A newspaper described the moment of the lighting: “A crowd of some 5,000 men, women and children cheered gloatingly as the match was applied and a moment later the flames and smoke rose high in the air and snuffed out the life of the black fiend.”[5]"}, {"3e6a": "Persons’ body was decapitated and dismembered, and his remains were scattered and displayed across Beale Street — the centre of the African American community in Memphis — where his head was thrown from a car at a group of African Americans. According to Charles W. Cansler, a spokesman for the local black community, his head was thrown into a room which contained black doctors. His remains were taken as souvenirs, and photographs of his head were sold on postcards for months after the event. The Commercial Appeal’s headline the day after the lynching read: “Thousands cheered when negro burned: Ell Persons pays death penalty for killing girl”, and their editorial on 25 May described the lynching as “orderly. There was no drunkenness, no shooting and no yelling.” [6]"}, {"a486": "So, no. Joseph Boyden isn’t being “lynched” by the media."}, {"b034": "Boyden is being questioned, challenged, disputed, confronted."}, {"dfbc": "He may feel he is being antagonized, bullied, chastised, castigated, hounded, belittled, harassed."}, {"7c0f": "But he is wrong, incorrect, mistaken, inaccurate, imprecise, erroneous."}, {"3d63": "Words Matter, Writers"}, {"4e3a": "Remember the “thesaurus”? They’re useful! I like them! In fact, in 2016, one doesn’t even need to stand up, walk to a shelf, and thumb through a paperback thesaurus. All one needs to do is highlight a word in their writing program, right click, select “synonyms,” and you’ll get a suitable list of alternatives. Computers are swell!"}, {"d03e": "There’s no reason for lazy, entitled writers like Yakabuski to reach for the dramatic word to add oomph to their story."}, {"aeed": "“Lynching” is a word that must be struck from our vocabulary."}, {"2486": "Unless speaking about someone beaten and tortured to death then left on display like some sordid Halloween decoration, there is no way “lynching” is the word you are looking for."}], "name": "58"}