{"name": "585", "parent": "", "content": "Watch Series 2 — Satisfaction & Usage Also covering new watchOS 3.0 Wristly Apple Watch Insider’s Report #52 More than a thousand members of the Wristly Apple Watch panel completed this survey last November 2016. It is our first attempt at measuring the impact of the new Series 2 hardware and watchOS 3.0 on both overall satisfaction and usage of Apple Watch. Please enjoy this recap of the main findings and if you have questions and/or are interested in a sub-cohort analysis of the data please do get in touch with me. 95% of Satisfied Users The aggregate number of Apple Watch satisfied users inched up to 95% Satisfaction from 94% measured in the summer of 2016. Significantly More are “Very Satisfied” More significantly, the number in the “Very Satisfied” cohort grew noticeably to 58% from 50% in the prior reading. This positive shift can be attributed to a combination of the new capabilities and performance of watchOS 3.0 as well as the new Series 2 hardware that some members of the panel have already upgraded to. Let’s find out more! New Hardware Powers Much Higher Satisfaction As of last October, 27% of our panelists reported using one of the new hardware models introduced by Apple in September. We can now look at the satisfaction data of this specific cohort to assess the relative impact of Series 2 hardware. It is very high! 76% of the users of that cohort say they are “Very Satisfied” (vs 58% for the entire panel) and another 21% Satisfied for a total of 97%. Conversely, if we look at the Satisfaction data for the cohort of users who own the original Apple Watch, the number of “Very Satisfied” drops back to 52%, which is in line with prior reported readings. Build Quality and Overall Design Tops Satisfaction Overall, Apple Watch users are most satisfied with the Build Quality, Design Aesthetics and overall Reliability of the watch. Meanwhile, Speed Performance and the Battery still rank as the highest sources of Dissatisfaction. It is also notable that many in our panel rate Apple’s “After-Sale Support & Services” for Apple Watch relatively low with only 71% of satisfied users (I’d argue this is likely because you have so many neutral respondents, who probably have never needed any after sales support or service). Next, let’s filter-out again the panelists who are using the original Apple Watch hardware to only look at the responses from those with Series 2 hardware and assess potential changes. New Hardware Improves Battery and Speed Issues Noticeably At first glance we notice across all criteria including Speed and Battery life a significant decrease in the number of users stating dissatisfaction (the orange colored areas in the chart above). The table below contrasts in detail the user satisfaction on the two criteria of Speed/Performance and Battery life between original hardware owners and new series 2 owners. The improvements on both criteria are very significant and seem to correlate to the improved overall satisfaction rating for those users. Now that we have established the positive impact of the new hardware, let’s try to assess how much if at all the new watchOS 3.0 software contributed to the increased satisfaction ratings. New watchOS 3.0 Powers Higher Satisfaction When we asked our panelists to rate if the new watchOS 3 contributed to their overall satisfaction, a very large majority (89%) stated yes, with 46% going further and saying “Yes, a lot”. We can now say that the combination of Apple Watch Series 2 hardware with the new watchOS 3 has positively impacted users’ overall satisfaction with Apple Watch. So next, let’s begin to assess if the new hardware/software combo has also driven changes in overall usage of the product. Still Wearing It All The Time Unlike basic wrist fitness trackers, the amount of time users wear Apple Watch continues to be very high and is very consistent will all prior metrics collected. Our findings are also consistent with one of the rare public comments from Tim Cook on the Apple Watch, when he stated in the summer of 2015 that more than 94% customers were wearing it daily. With our data it is also insightful to note that 15% of our panelists wear the product through the night — no doubt for measuring their sleep quality as well as taking advantage of the silent taptic alarm. Finding Some New Uses In the aggregate (see below chart) a quarter of our users report using/wearing Apple Watch more than before. If we only look at the subset who owns an Apple Watch Series 2, the number of those reporting using it more/longer than before climbs to almost 40%. Moderate Uptick in Apps & Games We have previously reported on the relatively low number of apps an average Apple Watch owner uses and how infrequently they typically seek and discover new ones. This time, about 60% of our panelists report some level of increased app usage since the introduction of watchOS 3.0 but less than a third of them report trying new apps regularly. This also reinforces the notion that when it comes to apps, the smartwatch, as a platform, is significantly different from smartphones and tablets and that consequently the opportunity for developers is much more constrained and focused. When we look at the responses to this question from the users who own the new Series 2 hardware, we cannot measure any difference with original Apple Watch owners, inferring that most of the usage increase has been driven by the improvements in the operating system. Let’s try to flesh that out and uncover which of the main changes Apple introduced helped most. 66% Use More Than One Face Regularly Part of the redesign of watchOS 3.0 included the ability to simply swipe to change the active Watch face. We wanted to assess in this survey if many users were taking advantage of this capability and to assess this, we asked them how many different faces they are using regularly. The panel here can be divided into three equal groups. A third only have one face, another third use two, and the remaining third use three or more. Altogether and correlated to prior findings on Watch face personalization, two thirds of the users have configured their watch for different environments leveraging multiple / different complications along the way. Needless to say, we will repeat this question in future surveys to trend the underlying data. 91% Customized the New Dock With watchOS 3.0, Apple also introduced the new Dock which also fundamentally redesigned the way to set and interact with frequently used applications. To assess its appeal to we asked our users how many specific apps one had proactively set to personalize their Dock. Only 9% of the users didn’t make use of the feature at all. For the balance, we were quite surprised to see that more than half had already set five or more apps in the Dock. Since the Dock can only hold up to 10 apps this is quite a high number. By the way, if you are not familiar with how to personalize your Dock, I would suggest to read this detailed tutorial by Cult of Mac. In future surveys we’ll also try to identify which Apps have been set in this premium location. The Scribble is a delightful new feature While the speed improvement of the new OS ranks #1, closely followed by the new Dock, the one new feature that ranks high in our panel’s preferences is the Scribble. The Scribble brings a delightful new option to respond to messages with Apple Watch and works surprisingly well (in my opinion). It is also worth noting that the new Breathe app gathers quite a few votes, especially ahead of the ability to share Activity data with others which many had assumed would prove popular based on pundits’ assessment of Fitbit’s strength in that area of “social and community” building. Steady Market Progress While we do not have the capability to track actual sales results of Apple Watch, we have over the last 18 months been able to track and trend a soft correlated market penetration metric. It is based on recording the casual observation of the number of people sighted wearing an Apple Watch in the prior week period. This combined with a little bit of data analysis is giving us a picture of how well the Apple Watch is doing and where. For instance, we can measure faster growth where we see first a “density” of “sightings”. In other words, living in a place where one sees more Apple Watch on a daily basis, is conducive of more new people buying one. So first let’s look at this reports “sightings” volume. Last November, almost half of our panelists reported seeing at least five other people over the prior week with an Apple Watch and only 18% reported none. This compares to only 9% reporting 5+ back only a year prior (November 2015) and 44% reporting none then. If we look at the cohorts of users who live in NY, San Francisco or LA, the numbers are even more telling. We also look forward to gather the next reading on this metric, taking “advantage” of all the new users who received it as a gift during the holidays. This concludes our report on Apple Watch Satisfaction and Usage focused on the impact Series 2 and watchOS 3.0 have had on the platform. We hope that you enjoyed it and that you would be interested to join our panel. So, if you own an Apple Watch, please participate. It only takes a few minutes of your time to cast your vote and in return you get to be among the first to receive the resulting insights. Sign up here. We also welcome friends and colleagues who are interested. Finally, if you are part of the tech industry and are developing or considering developing a wearable solution, please do get in touch. We can offer you custom research programs such as dedicated surveys, focus groups or advanced market analysis, as well as product innovation & development services including strategy, concept, design and prototyping. www.wristly.co ", "title": "Watch Series 2 — Satisfaction & Usage", "sentences": [{"29c4": "Watch Series 2 — Satisfaction & Usage"}, {"a847": "Also covering new watchOS 3.0"}, {"a2c3": "Wristly Apple Watch Insider’s Report #52"}, {"2aa8": "More than a thousand members of the Wristly Apple Watch panel completed this survey last November 2016. It is our first attempt at measuring the impact of the new Series 2 hardware and watchOS 3.0 on both overall satisfaction and usage of Apple Watch. Please enjoy this recap of the main findings and if you have questions and/or are interested in a sub-cohort analysis of the data please do get in touch with me."}, {"4724": "95% of Satisfied Users"}, {"f16b": "The aggregate number of Apple Watch satisfied users inched up to 95% Satisfaction from 94% measured in the summer of 2016."}, {"a4b6": "Significantly More are “Very Satisfied”"}, {"d04f": "More significantly, the number in the “Very Satisfied” cohort grew noticeably to 58% from 50% in the prior reading. This positive shift can be attributed to a combination of the new capabilities and performance of watchOS 3.0 as well as the new Series 2 hardware that some members of the panel have already upgraded to. Let’s find out more!"}, {"c09b": "New Hardware Powers Much Higher Satisfaction"}, {"405a": "As of last October, 27% of our panelists reported using one of the new hardware models introduced by Apple in September. We can now look at the satisfaction data of this specific cohort to assess the relative impact of Series 2 hardware. It is very high! 76% of the users of that cohort say they are “Very Satisfied” (vs 58% for the entire panel) and another 21% Satisfied for a total of 97%."}, {"395c": "Conversely, if we look at the Satisfaction data for the cohort of users who own the original Apple Watch, the number of “Very Satisfied” drops back to 52%, which is in line with prior reported readings."}, {"701b": "Build Quality and Overall Design Tops Satisfaction"}, {"7e79": "Overall, Apple Watch users are most satisfied with the Build Quality, Design Aesthetics and overall Reliability of the watch. Meanwhile, Speed Performance and the Battery still rank as the highest sources of Dissatisfaction. It is also notable that many in our panel rate Apple’s “After-Sale Support & Services” for Apple Watch relatively low with only 71% of satisfied users (I’d argue this is likely because you have so many neutral respondents, who probably have never needed any after sales support or service)."}, {"03c5": "Next, let’s filter-out again the panelists who are using the original Apple Watch hardware to only look at the responses from those with Series 2 hardware and assess potential changes."}, {"8d60": "New Hardware Improves Battery and Speed Issues Noticeably"}, {"3491": "At first glance we notice across all criteria including Speed and Battery life a significant decrease in the number of users stating dissatisfaction (the orange colored areas in the chart above)."}, {"c605": "The table below contrasts in detail the user satisfaction on the two criteria of Speed/Performance and Battery life between original hardware owners and new series 2 owners. The improvements on both criteria are very significant and seem to correlate to the improved overall satisfaction rating for those users."}, {"367e": "Now that we have established the positive impact of the new hardware, let’s try to assess how much if at all the new watchOS 3.0 software contributed to the increased satisfaction ratings."}, {"9abf": "New watchOS 3.0 Powers Higher Satisfaction"}, {"a951": "When we asked our panelists to rate if the new watchOS 3 contributed to their overall satisfaction, a very large majority (89%) stated yes, with 46% going further and saying “Yes, a lot”."}, {"d62b": "We can now say that the combination of Apple Watch Series 2 hardware with the new watchOS 3 has positively impacted users’ overall satisfaction with Apple Watch."}, {"8f1b": "So next, let’s begin to assess if the new hardware/software combo has also driven changes in overall usage of the product."}, {"3a67": "Still Wearing It All The Time"}, {"058d": "Unlike basic wrist fitness trackers, the amount of time users wear Apple Watch continues to be very high and is very consistent will all prior metrics collected."}, {"2c04": "Our findings are also consistent with one of the rare public comments from Tim Cook on the Apple Watch, when he stated in the summer of 2015 that more than 94% customers were wearing it daily."}, {"e1d8": "With our data it is also insightful to note that 15% of our panelists wear the product through the night — no doubt for measuring their sleep quality as well as taking advantage of the silent taptic alarm."}, {"96f8": "Finding Some New Uses"}, {"d818": "In the aggregate (see below chart) a quarter of our users report using/wearing Apple Watch more than before. If we only look at the subset who owns an Apple Watch Series 2, the number of those reporting using it more/longer than before climbs to almost 40%."}, {"3e00": "Moderate Uptick in Apps & Games"}, {"995e": "We have previously reported on the relatively low number of apps an average Apple Watch owner uses and how infrequently they typically seek and discover new ones. This time, about 60% of our panelists report some level of increased app usage since the introduction of watchOS 3.0 but less than a third of them report trying new apps regularly."}, {"1920": "This also reinforces the notion that when it comes to apps, the smartwatch, as a platform, is significantly different from smartphones and tablets and that consequently the opportunity for developers is much more constrained and focused."}, {"f634": "When we look at the responses to this question from the users who own the new Series 2 hardware, we cannot measure any difference with original Apple Watch owners, inferring that most of the usage increase has been driven by the improvements in the operating system. Let’s try to flesh that out and uncover which of the main changes Apple introduced helped most."}, {"c26a": "66% Use More Than One Face Regularly"}, {"8365": "Part of the redesign of watchOS 3.0 included the ability to simply swipe to change the active Watch face. We wanted to assess in this survey if many users were taking advantage of this capability and to assess this, we asked them how many different faces they are using regularly."}, {"7c80": "The panel here can be divided into three equal groups. A third only have one face, another third use two, and the remaining third use three or more. Altogether and correlated to prior findings on Watch face personalization, two thirds of the users have configured their watch for different environments leveraging multiple / different complications along the way."}, {"edfa": "Needless to say, we will repeat this question in future surveys to trend the underlying data."}, {"a0b5": "91% Customized the New Dock"}, {"2cbf": "With watchOS 3.0, Apple also introduced the new Dock which also fundamentally redesigned the way to set and interact with frequently used applications. To assess its appeal to we asked our users how many specific apps one had proactively set to personalize their Dock."}, {"afd4": "Only 9% of the users didn’t make use of the feature at all. For the balance, we were quite surprised to see that more than half had already set five or more apps in the Dock. Since the Dock can only hold up to 10 apps this is quite a high number. By the way, if you are not familiar with how to personalize your Dock, I would suggest to read this detailed tutorial by Cult of Mac."}, {"e39b": "In future surveys we’ll also try to identify which Apps have been set in this premium location."}, {"e566": "The Scribble is a delightful new feature"}, {"1c20": "While the speed improvement of the new OS ranks #1, closely followed by the new Dock, the one new feature that ranks high in our panel’s preferences is the Scribble. The Scribble brings a delightful new option to respond to messages with Apple Watch and works surprisingly well (in my opinion)."}, {"81a0": "It is also worth noting that the new Breathe app gathers quite a few votes, especially ahead of the ability to share Activity data with others which many had assumed would prove popular based on pundits’ assessment of Fitbit’s strength in that area of “social and community” building."}, {"1e98": "Steady Market Progress"}, {"3268": "While we do not have the capability to track actual sales results of Apple Watch, we have over the last 18 months been able to track and trend a soft correlated market penetration metric. It is based on recording the casual observation of the number of people sighted wearing an Apple Watch in the prior week period."}, {"cc93": "This combined with a little bit of data analysis is giving us a picture of how well the Apple Watch is doing and where. For instance, we can measure faster growth where we see first a “density” of “sightings”. In other words, living in a place where one sees more Apple Watch on a daily basis, is conducive of more new people buying one."}, {"4921": "So first let’s look at this reports “sightings” volume."}, {"6b9d": "Last November, almost half of our panelists reported seeing at least five other people over the prior week with an Apple Watch and only 18% reported none. This compares to only 9% reporting 5+ back only a year prior (November 2015) and 44% reporting none then."}, {"e237": "If we look at the cohorts of users who live in NY, San Francisco or LA, the numbers are even more telling. We also look forward to gather the next reading on this metric, taking “advantage” of all the new users who received it as a gift during the holidays."}, {"9fce": "This concludes our report on Apple Watch Satisfaction and Usage focused on the impact Series 2 and watchOS 3.0 have had on the platform. We hope that you enjoyed it and that you would be interested to join our panel. So, if you own an Apple Watch, please participate. It only takes a few minutes of your time to cast your vote and in return you get to be among the first to receive the resulting insights. Sign up here. We also welcome friends and colleagues who are interested."}, {"fe25": "Finally, if you are part of the tech industry and are developing or considering developing a wearable solution, please do get in touch. We can offer you custom research programs such as dedicated surveys, focus groups or advanced market analysis, as well as product innovation & development services including strategy, concept, design and prototyping."}, {"1055": "www.wristly.co"}], "child": "585_1"}