{"name": "586", "parent": "", "content": "Android Wear’s Killer App It’s not fitness tracking. The latest iteration of Android Wear is out, along with a couple of new watches from LG. Instead of reviewing the new hardware I don’t have, or software I can’t install, I’m going to talk about a few things I’ve figured out over the last couple of years wearing an Asus ZenWatch. These are the four primary features of a smartwatch. Interface Smart watches are best at delivering small amounts of visual information. “Glanceable” is the buzzword, and this is the perfect description of the smartwatch interface. The tiny screen is great for showing notifications, which is what most people think is the must-have feature of a smartwatch. I agree with this, and if my phone isn’t already unlocked in front of me, my first action is to check my watch whenever my devices alert me to a notification. Unfortunately, if I’m not wearing my glasses, notifications are easier to read on the phone because of the larger print. Also, I LOVE being able to screen and reject calls without pulling out my phone. Unfortunately, the glanceable interface is too limited for data entry. The best way to interact is by voice, but I’m reluctant to announce my queries to a crowded room. Note that this limitation is social, not technological; this will stop being a hurdle when we want it to stop. You can also use the touch interface if you have two or three menu items to choose from. For keyboard entry, you’re better off pulling out your phone. Maybe you could tap on a table in Morse code? Sensors Another important feature of smartwatches is as a personal sensor package. Arm motion tracking and GPS enable exercise logging, although dedicated fitness bands seem better at this. Likewise, heart rate monitoring in smart watches is so finicky that some models are leaving this feature out. I was hoping the accelerometer/gyroscope sensors would make the smart watch a good game controller, but this hasn’t happened yet. Apps The third important feature is as an app platform. Unfortunately, most apps don’t work well with an interface the size of a postage stamp. Messaging works pretty well, although any reply other than Yes or No requires dictating your answer. Using your watch as a remote control for your media player is also cool. And asking Google questions by voice is great — although it works the same way on the phone, which has a better output interface. But the function I find myself using most often, besides checking the time, is Google Authenticator. I use two factor wherever I can, and can get a one time password in a tap and two or three swipes. I do this several times a day. Identity Which brings me to the most underutilized feature of a smartwatch. This is to establish and prove your identity and act as a security token. The Apple Watch does this pretty well, allowing you to automatically unlock your Mac whenever you’re near. And contactless payments with Apple Pay should work great with a smartwatch. Somebody send me an Apple Watch and iPhone, and I’ll be happy to report back ;-) Android Pay should also work great on a smartwatch. Unfortunately, many watches leave out the required NFC interface. Even the new LG Watch Style, built for Android Wear 2.0, can’t do contactless payments. This calls into question Google’s dedication to Android Pay. Maybe the other radios in the watch can make up for the lack of NFC. Certainly Bluetooth can prove that you’re in the same room, but I wouldn’t want my credit card data going out over a radio that has a range measured in meters. Maybe this can be worked out in future hardware. Because proof of identity is the smartwatch’s killer app. After telling time, of course. ", "title": "Android Wear’s Killer App", "sentences": [{"b4a4": "Android Wear’s Killer App"}, {"89d0": "It’s not fitness tracking."}, {"9cfb": "The latest iteration of Android Wear is out, along with a couple of new watches from LG. Instead of reviewing the new hardware I don’t have, or software I can’t install, I’m going to talk about a few things I’ve figured out over the last couple of years wearing an Asus ZenWatch. These are the four primary features of a smartwatch."}, {"f997": "Interface"}, {"90ad": "Smart watches are best at delivering small amounts of visual information. “Glanceable” is the buzzword, and this is the perfect description of the smartwatch interface. The tiny screen is great for showing notifications, which is what most people think is the must-have feature of a smartwatch."}, {"ce26": "I agree with this, and if my phone isn’t already unlocked in front of me, my first action is to check my watch whenever my devices alert me to a notification. Unfortunately, if I’m not wearing my glasses, notifications are easier to read on the phone because of the larger print."}, {"6cb4": "Also, I LOVE being able to screen and reject calls without pulling out my phone."}, {"788d": "Unfortunately, the glanceable interface is too limited for data entry. The best way to interact is by voice, but I’m reluctant to announce my queries to a crowded room. Note that this limitation is social, not technological; this will stop being a hurdle when we want it to stop."}, {"143c": "You can also use the touch interface if you have two or three menu items to choose from. For keyboard entry, you’re better off pulling out your phone. Maybe you could tap on a table in Morse code?"}, {"cd91": "Sensors"}, {"88eb": "Another important feature of smartwatches is as a personal sensor package. Arm motion tracking and GPS enable exercise logging, although dedicated fitness bands seem better at this. Likewise, heart rate monitoring in smart watches is so finicky that some models are leaving this feature out. I was hoping the accelerometer/gyroscope sensors would make the smart watch a good game controller, but this hasn’t happened yet."}, {"7dd2": "Apps"}, {"a7ca": "The third important feature is as an app platform. Unfortunately, most apps don’t work well with an interface the size of a postage stamp. Messaging works pretty well, although any reply other than Yes or No requires dictating your answer. Using your watch as a remote control for your media player is also cool. And asking Google questions by voice is great — although it works the same way on the phone, which has a better output interface."}, {"f893": "But the function I find myself using most often, besides checking the time, is Google Authenticator. I use two factor wherever I can, and can get a one time password in a tap and two or three swipes. I do this several times a day."}, {"4861": "Identity"}, {"9f9a": "Which brings me to the most underutilized feature of a smartwatch. This is to establish and prove your identity and act as a security token. The Apple Watch does this pretty well, allowing you to automatically unlock your Mac whenever you’re near. And contactless payments with Apple Pay should work great with a smartwatch. Somebody send me an Apple Watch and iPhone, and I’ll be happy to report back ;-)"}, {"25cb": "Android Pay should also work great on a smartwatch. Unfortunately, many watches leave out the required NFC interface. Even the new LG Watch Style, built for Android Wear 2.0, can’t do contactless payments. This calls into question Google’s dedication to Android Pay."}, {"920d": "Maybe the other radios in the watch can make up for the lack of NFC. Certainly Bluetooth can prove that you’re in the same room, but I wouldn’t want my credit card data going out over a radio that has a range measured in meters. Maybe this can be worked out in future hardware. Because proof of identity is the smartwatch’s killer app. After telling time, of course."}], "child": "586_1"}