{"content": "‘Tokyo Drift’ Saunters Out Of Old Mexico Into Neon Glory Justin Lin’s debut embodies the best of the Fast and Furious franchise. “You know those old Westerns where the cowboys make a run for the border? This is my Mexico. … Look at all those people down there. They follow the rules for what? They’re letting fear lead them. … Life’s simple. You make choices and you don’t look back.” — Han Seoul-Oh The Fast and the Furious: Tokyo Drift is the best Fast and Furious movie. I hold this truth to be self-evident. And that’s my piece for this week. Thanks for coming out. I kid! Just give me about twelve miles of runway to make my case. Justin Lin crosses into a world of intoxicating coolness. Without that atmosphere, it’s impossible to understand why anyone would get involved with the Yakuza. The neon revelry in Tokyo is painfully lush. I want to be out of control. I want to go fast. I want to be untouchable. Give it all to me. I want to live deliciously. That hard sell made easy is why Lin’s entry makes for the best of the franchise. The racing scenes and action sequences are the best shot and most grounded. The relationships and character motivations are the most consistent and easy to understand. And the story is the most tightly, sensibly constructed. It is elegantly simple. I know there’s an uphill battle. It doesn’t have the worst Rotten Tomatoes fan score (that belongs to 2 Fast 2 Furious) or the worst RT Critics score (which belongs to Fast & Furious). But, it’s closer to the bottom than the top on both counts. It’s got the lowest box office performance. And, aside from myself and a few other die hards, it seems to be mostly thought of as an addendum to the franchise. A chopper with NOS: the embodiment of cool to excess. The FF is a thematically varied franchise and, honestly, totally ridiculous when taken as a whole. Settle down, I love it to pieces. But, let’s also be a bit real here. The Fast and the Furious is Romeo and Juliet in cars. 2 Fast 2 Furious is Bad Boys in cars. Fast & Furious is Traffic in cars. Fast Five is Ocean’s 11 in cars. Fast & Furious 6 is The Avengers in cars. Furious 7 is Mission: Impossible in cars. Tokyo Drift is the only one actually about racing. Without Tokyo Drift, there would not be a franchise. 2 Fast 2 Furious is a mess. Delightful, but still a mess. It had two returning characters and offered no continuation or development of the bromance between Dom and Brian. Essentially, it orphaned the original wunderkind with a soft reboot. And while there may have been style, there wasn’t a lot of substance. Lin’s first entry whet the appetite for stylistic car mayhem and enduring friendships. It’s the Justin Timberlake of the FF franchise. It brought sexy back. From there, your original stars get hungry. And once the fourth film is made, they can forge ahead with the moment of brilliance, the Ocean’s 11 of cars, Fast Five. That’s when it becomes a franchise. Tokyo Drift makes that possible. And for the next three films, every brilliant moment, shot, and quip is mined for reference to the newer, larger audience. All the while, Lin is wrestling the storylines of these characters into something that, in retrospect, looks like a well-executed plan. In terms of individual contributions to the enduring, profitable nature of franchises, Lin’s stamp on the Fast and Furious is amongst the most impressive. Everything is fine. From the opening, Tokyo Drift has the racing turned to 11. Sean’s (Lucas Black) devil-may-care engagement in his ’71 Chevy Monte Carlo with the local jock in his Dodge Viper makes for a thrilling race through a neighborhood under construction. When Sean realizes he has to drive through houses to win his race, he laconically declares ‘Oh well’ and smashes that potential future to pieces. Y’all, they wreck a neighborhood and a future at the same time. And they do it with the most American of muscle cars. I don’t want to get too philosophical today, but, like, you guys, I kind of do. The setting of the opening race is not without meaning. A rebel without a cause racing Ken and Barbie through a literalized version of the building of the American Dream? Both parties in character defining, quintessential American cars? Uh, yes please. Lin is the perfect director to grapple with the malaise surrounding the saccharine pursuit of the Dream. Check his first solo directorial effort with Better Luck Tomorrow. He takes the themes he worked with there and wraps them up here in racing scenes for your viewing pleasure. DK schooling Sean in the art of the drift. When Sean challenges DK (Brian Tee), out of sheer cockiness, he barrels forward into a competition he literally does not understand. Han (Sung Kang) loans him a car to see what he’s got. And what he’s got is brashness to infinity and beyond. But, I’ve never enjoyed watching somebody fail so much. The hard turns of the drifting circuit require finesse. Sean is hard charging, but he has no way to moderate his aggression towards the world. He slams into every single turn, ultimately finishing in a car whose surface beauty has been destroyed. Every single race progresses or realizes some character development for Sean. To include the moment he learns to talk to Neela (Nathalie Kelley) and they drift beautifully down a mountain side. If you’re a fan of the franchise, you have to watch this movie with an eye towards what Lin is accomplishing with each of the races. There are no racing moments just to have a wild or gorgeous drift sequence. This movie is a lean story-telling machine. And it is here for both your thinking and viewing pleasure. What is Tokyo Drift about? It’s a movie entirely about learning to live by pushing against the boundaries of what’s possible and what’s understood. Push so hard, you start to lose control. That’s the moment you live in. You can’t win in drift racing by hurling yourself full speed at a problem. You have to go fast, but you have to yield some control. The art is in knowing where to yield. If you aren’t flirting with that boundary, you aren’t really in it. And, I mean, god damn, it doesn’t get more Dylan Thomas than that. Do not go gentle into that good night. You’ve got to rage against the dying of the light. “And you, my father, there on the sad height, Curse, bless, me now with your fierce tears, I pray.” This movie breathes Thomas and shoots burning rubber into the dying of the light, and I can’t hardly take it. The franchise is The Fast and The Furious, and Justin Lin makes his entry via a racing metaphor for Dylan Thomas and how to live without regret. I mean, I’ve got a primal scream trying to make it’s way out here. Do you feel me? Do you? Rage, you bastards. Live! Live your lives! Han’s still alive, right? Right? He is. Through this framework, he gives us Han, the best character of the franchise. Han is a man struggling with the outcome of his life. He refers to Tokyo as his Mexico. This movie, about Dylan Thomas and regret, is also a stealth Western about a retired gunfighter who played big, won big, and lost the only thing that mattered. It’s pushing all my buttons. Han is the soul of cool. He’s such a complex character to talk about in release order of the films. If you haven’t, I recommend a timeline watch of the movies. Tokyo Drift plays so strong in between 6 and 7. But, even what you get in this movie is impressive. The way he describes himself as the gunfighter, retired to old Mexico goes to work on me. There’s so much regret in those retirements. If Han wasn’t better about keeping the right people around him, you could easily see him in a Peckinpah film, talking to a decapitated head riding shotgun in his car on the way to his own ignominious end. But, that isn’t him. Regardless, his palpable sense of something lost in Tokyo Drift clearly has him struggling for control. Everything is fine. Han is totally happy. Sean’s zest for life is appealing to Han. It would be to you, too. Imagine creating this escape route from a life consumed by violence and chaos, but designed for you and a partner. Only, your partner doesn’t make it. Heaven without the company you planned for sounds an awful lot like hell to me. Han sees a kindred spirit and wants to bring him into his life. He sees somebody he can mentor and someone to relate to. Han sells the heart of this movie. Without him, Sean is a teenage hothead who unbelievably winds up murdered by a wanna-be gangster. With him, Sean finds direction and purpose. It’s beautiful storytelling. Tokyo Drift ain’t the Citizen Kane of Teenaged Wasteland movies. But, it’s aiming for something like it. I know it’s been publically lambasted as a lackluster story, but that’s just plain wrong. It’s a simple story. But, not one without purpose or meaning. It’s a rock-and-roll riff on some heavy themes, with roaring cars and the perspective of a young man yearning to live but with no idea how to do it. It doesn’t take 140 minutes of pumped action to get there either. And yet, this movie spends practically half it’s time in a car. It’s action scenes hold the proof of what Lin would get up to later in the franchise. Story to story, action sequence to action sequence, shot to shot, soundtrack to mother flipping soundtrack, Tokyo Drift comes out ahead. Not by much. But, winning is winning. Any real racer will tell you, it’s not how much you win by that matters. Bama_boy ", "child": "59_1\t59_2", "title": "‘Tokyo Drift’ Saunters Out Of Old Mexico Into Neon Glory", "parent": "", "sentences": [{"5735": "‘Tokyo Drift’ Saunters Out Of Old Mexico Into Neon Glory"}, {"553b": "Justin Lin’s debut embodies the best of the Fast and Furious franchise."}, {"8657": "“You know those old Westerns where the cowboys make a run for the border? This is my Mexico. … Look at all those people down there. They follow the rules for what? They’re letting fear lead them. … Life’s simple. You make choices and you don’t look back.” — Han Seoul-Oh"}, {"e276": "The Fast and the Furious: Tokyo Drift is the best Fast and Furious movie. I hold this truth to be self-evident. And that’s my piece for this week. Thanks for coming out. I kid! Just give me about twelve miles of runway to make my case."}, {"7093": "Justin Lin crosses into a world of intoxicating coolness. Without that atmosphere, it’s impossible to understand why anyone would get involved with the Yakuza. The neon revelry in Tokyo is painfully lush. I want to be out of control. I want to go fast. I want to be untouchable. Give it all to me. I want to live deliciously. That hard sell made easy is why Lin’s entry makes for the best of the franchise. The racing scenes and action sequences are the best shot and most grounded. The relationships and character motivations are the most consistent and easy to understand. And the story is the most tightly, sensibly constructed. It is elegantly simple."}, {"c05e": "I know there’s an uphill battle. It doesn’t have the worst Rotten Tomatoes fan score (that belongs to 2 Fast 2 Furious) or the worst RT Critics score (which belongs to Fast & Furious). But, it’s closer to the bottom than the top on both counts. It’s got the lowest box office performance. And, aside from myself and a few other die hards, it seems to be mostly thought of as an addendum to the franchise."}, {"bb85": "A chopper with NOS: the embodiment of cool to excess."}, {"84ae": "The FF is a thematically varied franchise and, honestly, totally ridiculous when taken as a whole. Settle down, I love it to pieces. But, let’s also be a bit real here. The Fast and the Furious is Romeo and Juliet in cars. 2 Fast 2 Furious is Bad Boys in cars. Fast & Furious is Traffic in cars. Fast Five is Ocean’s 11 in cars. Fast & Furious 6 is The Avengers in cars. Furious 7 is Mission: Impossible in cars. Tokyo Drift is the only one actually about racing."}, {"3ad9": "Without Tokyo Drift, there would not be a franchise. 2 Fast 2 Furious is a mess. Delightful, but still a mess. It had two returning characters and offered no continuation or development of the bromance between Dom and Brian. Essentially, it orphaned the original wunderkind with a soft reboot. And while there may have been style, there wasn’t a lot of substance. Lin’s first entry whet the appetite for stylistic car mayhem and enduring friendships. It’s the Justin Timberlake of the FF franchise. It brought sexy back. From there, your original stars get hungry. And once the fourth film is made, they can forge ahead with the moment of brilliance, the Ocean’s 11 of cars, Fast Five. That’s when it becomes a franchise."}, {"82c4": "Tokyo Drift makes that possible. And for the next three films, every brilliant moment, shot, and quip is mined for reference to the newer, larger audience. All the while, Lin is wrestling the storylines of these characters into something that, in retrospect, looks like a well-executed plan. In terms of individual contributions to the enduring, profitable nature of franchises, Lin’s stamp on the Fast and Furious is amongst the most impressive."}, {"f87a": "Everything is fine."}, {"a245": "From the opening, Tokyo Drift has the racing turned to 11. Sean’s (Lucas Black) devil-may-care engagement in his ’71 Chevy Monte Carlo with the local jock in his Dodge Viper makes for a thrilling race through a neighborhood under construction. When Sean realizes he has to drive through houses to win his race, he laconically declares ‘Oh well’ and smashes that potential future to pieces. Y’all, they wreck a neighborhood and a future at the same time. And they do it with the most American of muscle cars."}, {"5f37": "I don’t want to get too philosophical today, but, like, you guys, I kind of do. The setting of the opening race is not without meaning. A rebel without a cause racing Ken and Barbie through a literalized version of the building of the American Dream? Both parties in character defining, quintessential American cars? Uh, yes please. Lin is the perfect director to grapple with the malaise surrounding the saccharine pursuit of the Dream. Check his first solo directorial effort with Better Luck Tomorrow. He takes the themes he worked with there and wraps them up here in racing scenes for your viewing pleasure."}, {"c4af": "DK schooling Sean in the art of the drift."}, {"0f94": "When Sean challenges DK (Brian Tee), out of sheer cockiness, he barrels forward into a competition he literally does not understand. Han (Sung Kang) loans him a car to see what he’s got. And what he’s got is brashness to infinity and beyond. But, I’ve never enjoyed watching somebody fail so much. The hard turns of the drifting circuit require finesse. Sean is hard charging, but he has no way to moderate his aggression towards the world. He slams into every single turn, ultimately finishing in a car whose surface beauty has been destroyed."}, {"4ae7": "Every single race progresses or realizes some character development for Sean. To include the moment he learns to talk to Neela (Nathalie Kelley) and they drift beautifully down a mountain side. If you’re a fan of the franchise, you have to watch this movie with an eye towards what Lin is accomplishing with each of the races. There are no racing moments just to have a wild or gorgeous drift sequence. This movie is a lean story-telling machine. And it is here for both your thinking and viewing pleasure."}, {"6a43": "What is Tokyo Drift about? It’s a movie entirely about learning to live by pushing against the boundaries of what’s possible and what’s understood. Push so hard, you start to lose control. That’s the moment you live in. You can’t win in drift racing by hurling yourself full speed at a problem. You have to go fast, but you have to yield some control. The art is in knowing where to yield. If you aren’t flirting with that boundary, you aren’t really in it. And, I mean, god damn, it doesn’t get more Dylan Thomas than that. Do not go gentle into that good night. You’ve got to rage against the dying of the light. “And you, my father, there on the sad height, Curse, bless, me now with your fierce tears, I pray.”"}, {"4e6c": "This movie breathes Thomas and shoots burning rubber into the dying of the light, and I can’t hardly take it. The franchise is The Fast and The Furious, and Justin Lin makes his entry via a racing metaphor for Dylan Thomas and how to live without regret. I mean, I’ve got a primal scream trying to make it’s way out here. Do you feel me? Do you? Rage, you bastards. Live! Live your lives!"}, {"10f7": "Han’s still alive, right? Right? He is."}, {"c7ec": "Through this framework, he gives us Han, the best character of the franchise. Han is a man struggling with the outcome of his life. He refers to Tokyo as his Mexico. This movie, about Dylan Thomas and regret, is also a stealth Western about a retired gunfighter who played big, won big, and lost the only thing that mattered. It’s pushing all my buttons."}, {"8a38": "Han is the soul of cool. He’s such a complex character to talk about in release order of the films. If you haven’t, I recommend a timeline watch of the movies. Tokyo Drift plays so strong in between 6 and 7. But, even what you get in this movie is impressive. The way he describes himself as the gunfighter, retired to old Mexico goes to work on me. There’s so much regret in those retirements. If Han wasn’t better about keeping the right people around him, you could easily see him in a Peckinpah film, talking to a decapitated head riding shotgun in his car on the way to his own ignominious end. But, that isn’t him. Regardless, his palpable sense of something lost in Tokyo Drift clearly has him struggling for control."}, {"241e": "Everything is fine. Han is totally happy."}, {"58bb": "Sean’s zest for life is appealing to Han. It would be to you, too. Imagine creating this escape route from a life consumed by violence and chaos, but designed for you and a partner. Only, your partner doesn’t make it. Heaven without the company you planned for sounds an awful lot like hell to me. Han sees a kindred spirit and wants to bring him into his life. He sees somebody he can mentor and someone to relate to. Han sells the heart of this movie. Without him, Sean is a teenage hothead who unbelievably winds up murdered by a wanna-be gangster. With him, Sean finds direction and purpose. It’s beautiful storytelling."}, {"ab66": "Tokyo Drift ain’t the Citizen Kane of Teenaged Wasteland movies. But, it’s aiming for something like it. I know it’s been publically lambasted as a lackluster story, but that’s just plain wrong. It’s a simple story. But, not one without purpose or meaning. It’s a rock-and-roll riff on some heavy themes, with roaring cars and the perspective of a young man yearning to live but with no idea how to do it. It doesn’t take 140 minutes of pumped action to get there either. And yet, this movie spends practically half it’s time in a car. It’s action scenes hold the proof of what Lin would get up to later in the franchise. Story to story, action sequence to action sequence, shot to shot, soundtrack to mother flipping soundtrack, Tokyo Drift comes out ahead. Not by much. But, winning is winning. Any real racer will tell you, it’s not how much you win by that matters."}, {"4bf4": "Bama_boy"}], "name": "59"}