{"name": "593", "parent": "", "content": "Apple Inc: A Pre-Mortem Last year marked the fifth year of Tim Cook’s reign, and year 3 of “Tim Cook’s Apple”. With recent technological shifts, Apple is at a crossroads of sorts; therefore, I believe a pre-mortem is expedient: A pre-mortem is a managerial strategy in which a manager imagines that a project or organization has failed, and then works backward to determine what potentially could lead to the failure of the project or organization. The technique breaks possible groupthinking by facilitating a positive discussion on threats, increasing the likelihood the main threats are identified. It is not easy to evaluate a company I love as if they have failed. I have spent tens of thousands of dollars on Apple products, and devoted countless hours studying, admiring and defending the company. However, I started noticing too many uncharacteristic cracks, and I realised turning a blind eye would not help Apple. This brought to mind some sage advice from an old friend: The Apple community is making a mistake; they take what Apple does and then try to prove it’s good. Instead, they should judge it on its own merit — Apple’s customers have no problem doing that. I will analyse each product separately: 1. Apple Watch When the Apple Watch was unveiled, Tim Cook showed a set of slides similar to Steve Jobs’ famous one from 2007: This was used to illustrate how each major product had a unique input method tailored to it. However, Jobs didn’t stop there: Meanwhile, with the Apple Watch, we got this: Fishing for apps in a shrunken Springboard on a 1.5 inch screen, does not a tailored UX paradigm make. Apple’s “apps everywhere” approach is reminiscent of Microsoft’s Windows Everywhere™ strategy under Steve Ballmer. When a company doesn’t holistically approach each new platform with a new perspective, you get products like this: Even Apple partially acknowledges this, as evidenced by their messaging pivot from focusing on apps, to positioning it primarily as a health wearable. However, watchOS 3 indicates that the product team didn’t receive the memo from Marketing; it encompassed a doubling down on the old paradigm — app switcher & all: Instead, they killed Glances — one of the few UX elements that actually suited the snap interaction style such a device requires. The overall result? A platform with neglected apps and waning developer interest, and a product that has yet to produce a compelling value proposition. Based on the use cases provided, Apple originally positioned third party watchOS apps as a way to essentially “augment reality”: The most crucial ingredient for augmented reality is contextual awareness. In my Apple Watch review, I recognised the need for this: Given the various watch faces display different information, it would be handy for the Apple Watch to be able to switch faces based on your location — e.g. at work, show Modular; at home, change to Mickey Mouse. This could be coupled with different alert settings, forming a geo-profile feature. After using the Apple Watch for over a year, I believe Apple needs to take this even further: context — not Springboard — needs to become the underlying paradigm for the entire operating system. Instead of WatchKit, Apple should have designed ProactiveKit. It could offer developers a set of “triggers” that watchOS watches for and intelligently acts upon, similar to Trigger on Android. It would be a richer extension of iOS’ Siri App Suggestions, which is not even present on watchOS. Context would extend to all aspects of the OS: At this point, you are likely to interject and say, “But, Dan, just wait for watchOS 4! I’m sure it will improve!!” However, performing a pre-mortem revolves around imagining a product has already failed. Furthermore, Steve Jobs didn’t wait until iPhone OS 3 to release Springboard. User experience is a core part of a product’s value proposition, and if people form the opinion that a product isn’t really useful, it can become hard to change that. Therefore, I believe Apple should not have released the product yet if they were planning to essentially experiment publicly. 2. iOS Last year, there was a realisation that people were experiencing app fatigue. The iMessage and Siri and MapsKit App Stores may help alleviate that for a little longer; however, Apple hasn’t planned for a post-app world, and tacking App Stores everywhere is unsustainable. iOS is still very much Springboard-centric. Indeed, the old criticism that iOS is a “static grid of icons” is still largely true years later. Apple has tried to incorporate a sense of intelligence through Siri App Recommendations/Proactive; however, they are tacked-on and shoved to the side — literally. Notifications are still an unprioritised, endless text list. Widgets are presented in an even longer, unintelligent list. Meanwhile, Siri — the supposed underlying intelligence agent — still doesn’t know me or my devices any better than a stranger. To solve this, Apple must not cling to old paradigms that made them successful, lest they fall victim to the Innovator’s Dilemma: The problem is [incumbents] fail to value new innovations properly because [they] attempt to apply them to their existing customers and product architectures — or value networks. Contextual computing is the next frontier; therefore, not only should watchOS be redesigned around it, but also individual apps and iOS: Apple’s current strategy of simply tacking these features on rather than rethinking their fundamental interaction model results in products like iTunes (and iTunes Store)—layered legacy code and all. Indeed, this would help explain why iOS has felt less polished and buggy of late. 3. Apple TV The Apple TV has suffered the same fate as the Apple Watch: Apple dumped an App Store and Springboard onto it and called it a new product. They essentially brought iOS to the living room, which isn’t such a bad thing at first glance — except it is the least integrated device in the entire Apple ecosystem. It doesn’t have Continuity, even though it needs it more than any other product; instead we have annoying “Keyboard Input” notifications. And instead of a login/identity solution so that we wouldn’t need Keyboard Input notifications, Apple is relying on their competitors to fill the gap (yet again). AirPlay is harder to use today than in iOS 7. Proactive is missing, so users are reduced to furiously swiping up and down a giant grid of icons. Tim Cook famously said he “loves operating his Apple TV from his Apple Watch”, yet it didn’t even ship with support for Apple’s existing remote app, and now there are two remote apps but only the old one works on the Apple Watch. After a simple one-tap setup, AirPods are “ready to use with all your devices” — except Apple TV. Most importantly, Siri suffers from the dreaded f-word: Regardless, the Springboard approach was the wrong one from the start. The UX should have revolved around discovering and finding content. Sound familiar? However, instead of doubling down on this method, Apple stuck it behind yet another app icon, so users are reduced to jumping in and out of a myriad different apps. So what did Apple do? They created another app, of course! An app that was clearly meant to ship with the product from day one. This “TV” app was supposed to solve the discovery side. There are only two problems: the biggest streaming service is noticeably absent, and it is a remarkably un-Apple-like “solution” where users can only discover content from apps… they already have (that’s not to mention the other noticeably absent streaming service, Amazon Video). And then there’s Single Sign-On, which is a whole different mess. Confused yet? Meanwhile, Amazon has done a better job at making content — not apps — the focal point: By this point, you might be wondering why Apple is trying all these bandaid solutions rather than delivering their own TV service. For starters, they are in the worst negotiating position, thanks to their poor infrastructure capabilities and privacy stance. Secondly, their sloppy execution has resulted in Apple TV remaining at “hobby product” adoption levels, meaning they haven’t gained any negotiation leverage. Furthermore, Apple’s unrefined approach of simply sticking an entire App Store on it has resulted in a product no different from Android TV — blown-up smartphone games and all. Not every app category needs to be present on the Apple TV: The result is a similar lack of focus on games, which Apple has demonstrated on iOS: games are just another app category; they killed Game Centre rather than ever iterating it; they instituted and then re-reversed their gaming-unfriendly controller policy; and they have crippled games by forcing them to be under 200MB, yet upsell a 64GB model just because they can (just last week, they decided to finally reverse this illogical policy — 16 months later). The strongest evidence that Apple has no cohesive understanding of games: they redesigned the entire box to incorporate a huge heatsink, which is totally under-utilised. This suggests that the product team’s original plan was for the Apple TV to be a serious console, but the marketing team hijacked it. Ultimately, we have a comparatively expensive device with a weak value proposition and poor execution. 4. Apple Services I have written extensively about Apple’s problems with services originating from their hardline privacy stance. However, there is another major issue: Apple views services as a value-adding feature, rather than a discrete platform. This stems from their hardware-centric business model, which is accordingly reflected in their device-centred services approach. The problem is that services are eating software, and now often indistinguishable from each other. Therefore, Apple should be treating their services with equal importance as iOS, macOS and tvOS: iCloud should be best-in-class; Siri should be more than just souped-up Voice Control; Apple Music shouldn’t delete people’s music libraries; these services should work seamlessly across all their devices and platforms — even on the web. Apple has somewhat recognised this recently, using Siri branding on their Proactive features (e.g. Siri App Suggestions). The problem is it’s merely a half-step; Siri is still treated as an OS-dependent feature where Apple cherry-picks which features will appear where. This results in fragmented experiences such as outlined above. As for iCloud, it performs horribly on the web, often has cross-device syncing problems and even experiences data loss issues. This is a far cry from Steve’s original vision of seamless cloud computing. Further, iCloud should be treated as more than a hard drive in the cloud. Apple should eliminate the need for endless login screens on multiple devices by expanding iCloud Keychain into an identity solution. iCloud should provide automatic app data sync by allowing users to restore previously backed-up app data when re-downloading an app, rather than requiring an entire device restore through iCloud Backup. Siri data should be synced to iCloud to personalise each of the user’s devices. Apple needs to realise that services are just as much the soul of their products, as the hardware is the brain and sinew. 5. Apple, the Company When Walter Isaacson asked Steve Jobs what his greatest product was, he answered, “The product I’m most proud of is Apple and the team I built at Apple.” Steve also repeatedly emphasised the importance of hiring A+ players, who aren’t afraid to challenge each other: It’s through the team, through that group of incredibly talented people bumping up against each other, having arguments, having fights sometimes, making some noise, and working together they polish each other and they polish the ideas, and what comes out are these really beautiful stones. Apple’s greatest threat is losing this culture; looking at the company today, I am concerned that this is indeed occurring: Once in charge, one of the first things these operations/execution CEOs do is to get rid of the chaos and turbulence in the organization. Execution CEOs value stability, process and repeatable execution. On one hand that’s great for predictability, but it often starts a creative death spiral — creative people start to leave, and other executors (without the innovation talent of the old leader) are put into more senior roles — hiring more process people, which in turn forces out the remaining creative talent. This culture shift ripples down from the top and what once felt like a company on a mission to change the world now feels like another job. And it has become evident that firing Forstall was only the beginning: 5. Steve Jobs was Apple’s chief customer advocate. Since his departure, it is not apparent that anybody else has taken up this role: I have considered this question for months, and there is nobody in Apple’s executive team that stands out — they’re all excellent at heading their own respective divisions, but that’s all. However, I do believe Forstall was the closest replacement. Conclusion I want Apple to continue succeeding for another fifty years — that’s why I wrote this. Indeed, Apple expects it: We don’t need to be told how great we are, and how big we are. It’s not about that, and we don’t want it to become about that. It’s not about P/Es, and it’s not about market value. I mean, sure, the finance team has to worry about that. But for the rest of us, it’s about: Are we making the best product? Do people love what we do? Is it changing lives? And if it isn’t, then beat us up until it is. And that’s a good place. Special thanks to my friend, Luke, for the story image. You can follow me on Twitter: Dan (@OhMDee) | TwitterThe latest Tweets from Dan (@OhMDee). Follow me to stay on the tech pulse, hear the latest Apple news, and read my…twitter.com ", "title": "Apple Inc: A Pre-Mortem", "sentences": [{"23e7": "Apple Inc: A Pre-Mortem"}, {"373c": "Last year marked the fifth year of Tim Cook’s reign, and year 3 of “Tim Cook’s Apple”. With recent technological shifts, Apple is at a crossroads of sorts; therefore, I believe a pre-mortem is expedient:"}, {"ae60": "A pre-mortem is a managerial strategy in which a manager imagines that a project or organization has failed, and then works backward to determine what potentially could lead to the failure of the project or organization. The technique breaks possible groupthinking by facilitating a positive discussion on threats, increasing the likelihood the main threats are identified."}, {"fb66": "It is not easy to evaluate a company I love as if they have failed. I have spent tens of thousands of dollars on Apple products, and devoted countless hours studying, admiring and defending the company. However, I started noticing too many uncharacteristic cracks, and I realised turning a blind eye would not help Apple. This brought to mind some sage advice from an old friend:"}, {"9e9b": "The Apple community is making a mistake; they take what Apple does and then try to prove it’s good. Instead, they should judge it on its own merit — Apple’s customers have no problem doing that."}, {"4a09": "I will analyse each product separately:"}, {"2972": "1. Apple Watch"}, {"ffbe": "When the Apple Watch was unveiled, Tim Cook showed a set of slides similar to Steve Jobs’ famous one from 2007:"}, {"ff77": "This was used to illustrate how each major product had a unique input method tailored to it. However, Jobs didn’t stop there:"}, {"0378": "Meanwhile, with the Apple Watch, we got this:"}, {"6e80": "Fishing for apps in a shrunken Springboard on a 1.5 inch screen, does not a tailored UX paradigm make. Apple’s “apps everywhere” approach is reminiscent of Microsoft’s Windows Everywhere™ strategy under Steve Ballmer. When a company doesn’t holistically approach each new platform with a new perspective, you get products like this:"}, {"f0a0": "Even Apple partially acknowledges this, as evidenced by their messaging pivot from focusing on apps, to positioning it primarily as a health wearable. However, watchOS 3 indicates that the product team didn’t receive the memo from Marketing; it encompassed a doubling down on the old paradigm — app switcher & all:"}, {"2ae5": "Instead, they killed Glances — one of the few UX elements that actually suited the snap interaction style such a device requires."}, {"92d3": "The overall result? A platform with neglected apps and waning developer interest, and a product that has yet to produce a compelling value proposition."}, {"112a": "Based on the use cases provided, Apple originally positioned third party watchOS apps as a way to essentially “augment reality”:"}, {"4e51": "The most crucial ingredient for augmented reality is contextual awareness. In my Apple Watch review, I recognised the need for this:"}, {"6d38": "Given the various watch faces display different information, it would be handy for the Apple Watch to be able to switch faces based on your location — e.g. at work, show Modular; at home, change to Mickey Mouse. This could be coupled with different alert settings, forming a geo-profile feature."}, {"6532": "After using the Apple Watch for over a year, I believe Apple needs to take this even further: context — not Springboard — needs to become the underlying paradigm for the entire operating system. Instead of WatchKit, Apple should have designed ProactiveKit. It could offer developers a set of “triggers” that watchOS watches for and intelligently acts upon, similar to Trigger on Android. It would be a richer extension of iOS’ Siri App Suggestions, which is not even present on watchOS. Context would extend to all aspects of the OS:"}, {"28af": "At this point, you are likely to interject and say, “But, Dan, just wait for watchOS 4! I’m sure it will improve!!” However, performing a pre-mortem revolves around imagining a product has already failed. Furthermore, Steve Jobs didn’t wait until iPhone OS 3 to release Springboard. User experience is a core part of a product’s value proposition, and if people form the opinion that a product isn’t really useful, it can become hard to change that. Therefore, I believe Apple should not have released the product yet if they were planning to essentially experiment publicly."}, {"e75d": "2. iOS"}, {"25c3": "Last year, there was a realisation that people were experiencing app fatigue. The iMessage and Siri and MapsKit App Stores may help alleviate that for a little longer; however, Apple hasn’t planned for a post-app world, and tacking App Stores everywhere is unsustainable. iOS is still very much Springboard-centric. Indeed, the old criticism that iOS is a “static grid of icons” is still largely true years later."}, {"7488": "Apple has tried to incorporate a sense of intelligence through Siri App Recommendations/Proactive; however, they are tacked-on and shoved to the side — literally. Notifications are still an unprioritised, endless text list. Widgets are presented in an even longer, unintelligent list. Meanwhile, Siri — the supposed underlying intelligence agent — still doesn’t know me or my devices any better than a stranger."}, {"714a": "To solve this, Apple must not cling to old paradigms that made them successful, lest they fall victim to the Innovator’s Dilemma:"}, {"a77e": "The problem is [incumbents] fail to value new innovations properly because [they] attempt to apply them to their existing customers and product architectures — or value networks."}, {"89cd": "Contextual computing is the next frontier; therefore, not only should watchOS be redesigned around it, but also individual apps and iOS:"}, {"9388": "Apple’s current strategy of simply tacking these features on rather than rethinking their fundamental interaction model results in products like iTunes (and iTunes Store)—layered legacy code and all. Indeed, this would help explain why iOS has felt less polished and buggy of late."}, {"56c5": "3. Apple TV"}, {"6120": "The Apple TV has suffered the same fate as the Apple Watch: Apple dumped an App Store and Springboard onto it and called it a new product. They essentially brought iOS to the living room, which isn’t such a bad thing at first glance — except it is the least integrated device in the entire Apple ecosystem. It doesn’t have Continuity, even though it needs it more than any other product; instead we have annoying “Keyboard Input” notifications. And instead of a login/identity solution so that we wouldn’t need Keyboard Input notifications, Apple is relying on their competitors to fill the gap (yet again). AirPlay is harder to use today than in iOS 7. Proactive is missing, so users are reduced to furiously swiping up and down a giant grid of icons. Tim Cook famously said he “loves operating his Apple TV from his Apple Watch”, yet it didn’t even ship with support for Apple’s existing remote app, and now there are two remote apps but only the old one works on the Apple Watch. After a simple one-tap setup, AirPods are “ready to use with all your devices” — except Apple TV. Most importantly, Siri suffers from the dreaded f-word:"}, {"42fc": "Regardless, the Springboard approach was the wrong one from the start. The UX should have revolved around discovering and finding content. Sound familiar? However, instead of doubling down on this method, Apple stuck it behind yet another app icon, so users are reduced to jumping in and out of a myriad different apps. So what did Apple do? They created another app, of course! An app that was clearly meant to ship with the product from day one. This “TV” app was supposed to solve the discovery side. There are only two problems: the biggest streaming service is noticeably absent, and it is a remarkably un-Apple-like “solution” where users can only discover content from apps… they already have (that’s not to mention the other noticeably absent streaming service, Amazon Video). And then there’s Single Sign-On, which is a whole different mess. Confused yet?"}, {"922b": "Meanwhile, Amazon has done a better job at making content — not apps — the focal point:"}, {"8ce3": "By this point, you might be wondering why Apple is trying all these bandaid solutions rather than delivering their own TV service. For starters, they are in the worst negotiating position, thanks to their poor infrastructure capabilities and privacy stance. Secondly, their sloppy execution has resulted in Apple TV remaining at “hobby product” adoption levels, meaning they haven’t gained any negotiation leverage."}, {"ad36": "Furthermore, Apple’s unrefined approach of simply sticking an entire App Store on it has resulted in a product no different from Android TV — blown-up smartphone games and all. Not every app category needs to be present on the Apple TV:"}, {"a29a": "The result is a similar lack of focus on games, which Apple has demonstrated on iOS: games are just another app category; they killed Game Centre rather than ever iterating it; they instituted and then re-reversed their gaming-unfriendly controller policy; and they have crippled games by forcing them to be under 200MB, yet upsell a 64GB model just because they can (just last week, they decided to finally reverse this illogical policy — 16 months later). The strongest evidence that Apple has no cohesive understanding of games: they redesigned the entire box to incorporate a huge heatsink, which is totally under-utilised. This suggests that the product team’s original plan was for the Apple TV to be a serious console, but the marketing team hijacked it."}, {"9eef": "Ultimately, we have a comparatively expensive device with a weak value proposition and poor execution."}, {"063f": "4. Apple Services"}, {"3cff": "I have written extensively about Apple’s problems with services originating from their hardline privacy stance. However, there is another major issue: Apple views services as a value-adding feature, rather than a discrete platform. This stems from their hardware-centric business model, which is accordingly reflected in their device-centred services approach. The problem is that services are eating software, and now often indistinguishable from each other. Therefore, Apple should be treating their services with equal importance as iOS, macOS and tvOS: iCloud should be best-in-class; Siri should be more than just souped-up Voice Control; Apple Music shouldn’t delete people’s music libraries; these services should work seamlessly across all their devices and platforms — even on the web."}, {"4d67": "Apple has somewhat recognised this recently, using Siri branding on their Proactive features (e.g. Siri App Suggestions). The problem is it’s merely a half-step; Siri is still treated as an OS-dependent feature where Apple cherry-picks which features will appear where. This results in fragmented experiences such as outlined above. As for iCloud, it performs horribly on the web, often has cross-device syncing problems and even experiences data loss issues. This is a far cry from Steve’s original vision of seamless cloud computing."}, {"9df1": "Further, iCloud should be treated as more than a hard drive in the cloud. Apple should eliminate the need for endless login screens on multiple devices by expanding iCloud Keychain into an identity solution. iCloud should provide automatic app data sync by allowing users to restore previously backed-up app data when re-downloading an app, rather than requiring an entire device restore through iCloud Backup. Siri data should be synced to iCloud to personalise each of the user’s devices."}, {"6c0d": "Apple needs to realise that services are just as much the soul of their products, as the hardware is the brain and sinew."}, {"ec58": "5. Apple, the Company"}, {"6df8": "When Walter Isaacson asked Steve Jobs what his greatest product was, he answered, “The product I’m most proud of is Apple and the team I built at Apple.” Steve also repeatedly emphasised the importance of hiring A+ players, who aren’t afraid to challenge each other:"}, {"1858": "It’s through the team, through that group of incredibly talented people bumping up against each other, having arguments, having fights sometimes, making some noise, and working together they polish each other and they polish the ideas, and what comes out are these really beautiful stones."}, {"326f": "Apple’s greatest threat is losing this culture; looking at the company today, I am concerned that this is indeed occurring:"}, {"1300": "Once in charge, one of the first things these operations/execution CEOs do is to get rid of the chaos and turbulence in the organization. Execution CEOs value stability, process and repeatable execution. On one hand that’s great for predictability, but it often starts a creative death spiral — creative people start to leave, and other executors (without the innovation talent of the old leader) are put into more senior roles — hiring more process people, which in turn forces out the remaining creative talent. This culture shift ripples down from the top and what once felt like a company on a mission to change the world now feels like another job."}, {"f4c1": "And it has become evident that firing Forstall was only the beginning:"}, {"ed2d": "5. Steve Jobs was Apple’s chief customer advocate. Since his departure, it is not apparent that anybody else has taken up this role:"}, {"0f0e": "I have considered this question for months, and there is nobody in Apple’s executive team that stands out — they’re all excellent at heading their own respective divisions, but that’s all. However, I do believe Forstall was the closest replacement."}, {"43ea": "Conclusion"}, {"a81f": "I want Apple to continue succeeding for another fifty years — that’s why I wrote this."}, {"ec9d": "Indeed, Apple expects it:"}, {"561f": "We don’t need to be told how great we are, and how big we are. It’s not about that, and we don’t want it to become about that. It’s not about P/Es, and it’s not about market value. I mean, sure, the finance team has to worry about that. But for the rest of us, it’s about: Are we making the best product? Do people love what we do? Is it changing lives? And if it isn’t, then beat us up until it is."}, {"828e": "And that’s a good place."}, {"0b48": "Special thanks to my friend, Luke, for the story image."}, {"687d": "You can follow me on Twitter:"}, {"2c2d": "Dan (@OhMDee) | TwitterThe latest Tweets from Dan (@OhMDee). Follow me to stay on the tech pulse, hear the latest Apple news, and read my…twitter.com"}], "child": "593_1\t593_2\t593_3\t593_4\t593_5\t593_6\t593_7\t593_8\t593_9\t593_10\t593_11\t593_12\t593_13\t593_14\t593_15\t593_16\t593_17\t593_18\t593_19\t593_20\t593_21\t593_22\t593_23\t593_24\t593_25593_1\t593_2\t593_3\t593_4\t593_5\t593_6\t593_7\t593_8\t593_9\t593_10\t593_11\t593_12\t593_13\t593_14\t593_15\t593_16\t593_17\t593_18\t593_19\t593_20\t593_21\t593_22\t593_23\t593_24\t593_25593_1\t593_2\t593_3\t593_4\t593_5\t593_6\t593_7\t593_8\t593_9\t593_10\t593_11\t593_12\t593_13\t593_14\t593_15\t593_16\t593_17\t593_18\t593_19\t593_20\t593_21\t593_22\t593_23\t593_24\t593_25"}