{"name": "594", "parent": "", "content": "Phil Schiller on iPhone’s Launch, How It Changed Apple, and Why It Will Keep Going for 50 Years A reporter there for the creation gets Apple’s exclusive take on the “Jesus Phone”’s 10th birthday. . Why do a phone? I asked Steve Jobs ten years ago today. On the stage at the Moscone West hall in San Francisco, Apple’s CEO had just unveiled what would become the most transformative product since the PC. Jobs clearly felt good about it. But the iPhone was such a drastic departure from anything else—with its MultiTouch screen, its soft keyboard, and its imposing price tag—there was no assurance it would be a hit. There was certainly no indication that we’d reach the mind-set of today, where walking out of the house without one of those things is like venturing into the streets naked. Jobs looked at me with a straight face. “We looked at the market, analyzed it, talked to buying-research people, and figured out we could make a lot of money,” he said. Follow Backchannel: Facebook | Twitter Steve had made a joke! “That’s not us,” he quickly clarified. Jobs went through what is now a familiar litany. Apple had wanted to do a phone for a while. The company had lots of ideas, particularly around creating a touch-based interface. But it had to wait for the right moment, when a telecom carrier was willing to cede unprecedented control to Apple, allowing it to design a hardware and software package that would redefine the category, on its own terms. One thing had struck me during Jobs’ presentation: Apple had created a small set of native applications, and it did not seem to be opening the device to third-party developers. It wasn’t clear in his keynote, but Jobs confirmed my perception, and attempted to defend the choice. According to Jobs, it was an issue of security. “You don’t want your phone to be an open platform,” he told me. “You don’t want it to not work because one of three apps you loaded that morning screwed it up. Cingular doesn’t want to see their West Coast network go down because of some app. This thing is more like an iPod than it is a computer in that sense.” We know now, of course, that Apple changed course. iPhone users have downloaded over 140 billion apps. And that the stunning profusion has been transformative—the key element that makes the iPhone (and now its competitors) the way we perform a dizzying range of activities. On January 2007, Jobs’s expectations were high. But they came nowhere close to capturing the impact the iPhone would have in the world — and for Apple. In its most recent quarter, Apple sold about 75 million iPhones for revenue of $51 billion dollars. During those three months, iPhones made up about two thirds of Apple’s income. In total, Apple has sold over a billion phones. “2007 is going to be a very big year for smart phone,” Steve Jobs told me ten years ago. “I see a lot of soccer moms with smart phones.” Jobs’s optimism was about to be a whopping understatement. Apple is notorious for not looking back. When an anniversary of a big product approaches, the company routinely bounces requests to reminisce. (“I don’t think about that,” was Jobs’s response to me, on the 25th anniversary of Macintosh in 2008). In this case, Apple made an exception: last week I sat down with its senior vp of world wide marketing, Phil Schiller, who joined the company’s leadership team in April 1997, coincident with Steve Jobs’s return. Schiller had been deeply involved in the iPhone’s development and launch. We met at the Cupertino campus that will soon be supplanted as Apple’s executive quarters by an exotic new circular headquarters building a few miles away. As is very common when people sit together these days, on the table were our iPhones, sitting face down like the ubiquitous pistols that gunslingers rest on the bar in old Westerns. Their presence was a reminder that at business meetings, restaurants, living room couches, and dinner tables, you see smart phones on table surfaces or under them, all too often with someone’s eyes cast downwards on a message, an email, a Facebook story, or even a game. I asked him if Apple had an inkling of how big the iPhone would be. “Yes, but not nearly on the scale it’s become,” he says. “We knew we were working on something important that was big to Apple, and that the world was changing around these things in the future. But we didn’t know how big it would be, and we didn’t know how many things would come from it. Schiller also cast light on why the iPhone shipped as a closed system. During the gestation period of the iPhone, Apple hosted a spirited internal debate. Some advocated that the device be an open system, like the Macintosh, and others advised a more closed system, like the iPod. The argument was put on hold when the engineers realized that even if the open-system adherents won the debate, it would be impossible to implement in time for the launch. Steve Jobs shut down the discussion, Schiller recalls. “He said ‘We don’t have to keep debating this because we can’t have [an open system] right now. Maybe we’ll change our mind afterwards, or maybe we won’t, but for now there isn’t one so let’s envision this world where we solve the problem with great built-in apps and a way for developers to make web apps.” Yet Schiller pushed back when I suggested that the iPhone’s great moment came when Apple threw open the gates to developers and we learned that for every imaginable activity, as well as some previously unimaginable ones, there was “an app for that.” “That undervalues how earth-shattering the iPhone was when it first came to market, and we all first got them and fell in love with them,” he says. “iPhone made the idea of a smartphone real. It really was a computer in your pocket. The idea of real internet, real web browser, MultiTouch. There were so many things that are core to what is the smartphone today, that created a product that customers fell in love with, that then also demanded more stuff on them, more apps.” Indeed, says Schiller, the success of the iPhone—propelled by the few apps included on the first model, like Mail and Safari and YouTube—led to the open-or-closed issue becoming a non-debate. Inside Apple the answer was suddenly clear: of course it would be open. (And the security fears that Jobs cited to me on day one mysteriously vanished.) All those critics, including me, who kept urging Apple to make the iPhone open were irrelevant. Not long after launch, Apple began implementing a system that opened the iPhone to a wide range of creators who would make countless apps. Apps that would amplify the iPhone’s impact. I wondered how the success of the iPhone changed Apple itself. Schiller preferred to view the iPhone’s as part of a continuum of change that had already begun with Jobs’s return, and the creation of the iPod. “If it weren’t for iPod, I don’t know that there would ever be iPhone.” he says. “It introduced Apple to customers that were not typical Apple customers, so iPod went from being an accessory to Mac to becoming its own cultural momentum. During that time, Apple changed. Our marketing changed. We had silhouette ads with dancers and an iconic product with white headphones. We asked, “Well, if Apple can do this one thing different than all of its previous products, what else can Apple do?’” Of late, however, Apple is buffeted with questions about how much the iPhone’s current models are extending that impact. The criticism is tied to a general strain of complaints that Apple is playing it safe of late. Back in November, I asked Schiller whether Apple had gone light in innovation. (Spoiler alert: he says it hasn’t!). Now he takes similar issue with the charge that the more recent iterations of the Phones are not taking leaps as bold as the ones attempted in the big upgrades of the iPhone’s first few years—when, incidentally, Steve Jobs was still alive. “I actually think the leaps in the later versions are as big and sometimes even bigger now,” he says. “I think our expectations are changing more, not the leaps in the products. If you look through every version—from the original iPhone to the iPhone 3G to the 4 to the 4S, you see great changes all throughout. You see screen size change from three and a half inch to four inch to four point seven and five point five. You see cameras going through incredible change, from the first camera that couldn’t shoot video, to then having both a front and a backside camera, to now three cameras with the stuff we’re doing, and with live photos and 4K video.” Maybe some of those changes, I suggest, may have come as responses to competition: like the bigger screens, which first appeared in Samsung and other competitors. When did Apple realize that other companies had ramped up their efforts to provide credible rivals to the iPhone? “When we started iPhone, I recall Steve saying we have a five year lead on everybody. (True! “If we didn’t do one more thing,” Jobs said to me in that January 2007 chat, “we’d be set for five years!”) That has turned out to be a very accurate statement. The size of the cell phone market and the importance of smartphones has attracted everybody in the world who can get into the business to try to get into the business. Some have succeeded, some have failed. Competition is great. It pushes us.” Schiller takes pains, however, to specify that Apple maintains, and will continue to maintain, a lead over its rivals, despite the fact that Android outsells iPhone in units — though not in profits — and iPhone sales themselves seem to be slowing. “The quality is unmatched. The ease of use is still unmatched. The integration of hardware software is unmatched. We’re not about the cheapest, we’re not about the most, we’re about the best.” Can Apple ever top the iPhone — create a product that creates a category that changes the way we live the way this one has in the last ten years? Schiller hopes that 50 years people will look back at this point and say, “Wow, they didn’t realize how much was to come — in fact, others missed it because they were busy running around looking for other things. Everyone has their opinions at this point, but it could be that we’re only in the first minutes of the first quarter of the game,” he says. “I believe this product is so great that it has many years of innovation ahead.” Yet I wonder whether a pocket-sized device like the iPhone will still be as relevant decades hence. In recent weeks a lot of observers have been saying we are at the start of the era of the conversational interface. While Amazon is pushing those observations, Apple has certainly been in the thick of this movement with its chatty Siri product, built into every iPhone. “That’s really important,” Schiller says, “and I’m so glad the team years ago set out to create Siri — I think we do more with that conversational interface that anyone else. Personally, I still think the best intelligent assistant is the one that’s with you all the time. Having my iPhone with me as the thing I speak to is better than something stuck in my kitchen or on a wall somewhere.” Well, I reply, Amazon sees its Alexa voice interface not as something pinned to one device, but a ubiquitous and persistent cloud-based product that can listen to you anywhere. “People are forgetting the value and importance of the display,” he says “Some of the greatest innovations on iPhone over the last ten years have been in display. Displays are not going to go away. We still like to take pictures and we need to look at them, and a disembodied voice is not going to show me what the picture is.” In any case, the first iPhone decade has built a mind-boggling legacy. These are our digital protheses. We are cyborgs, appended to smart phones that give us power, and make us weaker when we for some reason don’t have one. No one knew this would happen, including Apple. “When we started on iPhone, we could envision that phones would change forever and get better,” says Schiller. “We could envision that we could surf the web on them. We could envision that we could get our email. We could envision that it would replace our iPod one day. All those things we could see. But the magical thing that happened along the journey of iPhone is that it also became our most important device in our life. That transition in how we interact with the world is something that I don’t think anyone could completely understand, until we were living with these and using them.” ", "title": "Phil Schiller on iPhone’s Launch, How It Changed Apple, and Why It Will Keep Going for 50 Years", "sentences": [{"8cbf": "Phil Schiller on iPhone’s Launch, How It Changed Apple, and Why It Will Keep Going for 50 Years"}, {"0496": "A reporter there for the creation gets Apple’s exclusive take on the “Jesus Phone”’s 10th birthday."}, {"1534": "."}, {"42a6": "Why do a phone? I asked Steve Jobs ten years ago today. On the stage at the Moscone West hall in San Francisco, Apple’s CEO had just unveiled what would become the most transformative product since the PC. Jobs clearly felt good about it. But the iPhone was such a drastic departure from anything else—with its MultiTouch screen, its soft keyboard, and its imposing price tag—there was no assurance it would be a hit. There was certainly no indication that we’d reach the mind-set of today, where walking out of the house without one of those things is like venturing into the streets naked."}, {"2a54": "Jobs looked at me with a straight face. “We looked at the market, analyzed it, talked to buying-research people, and figured out we could make a lot of money,” he said."}, {"47de": "Follow Backchannel: Facebook | Twitter"}, {"4668": "Steve had made a joke! “That’s not us,” he quickly clarified. Jobs went through what is now a familiar litany. Apple had wanted to do a phone for a while. The company had lots of ideas, particularly around creating a touch-based interface. But it had to wait for the right moment, when a telecom carrier was willing to cede unprecedented control to Apple, allowing it to design a hardware and software package that would redefine the category, on its own terms."}, {"67ec": "One thing had struck me during Jobs’ presentation: Apple had created a small set of native applications, and it did not seem to be opening the device to third-party developers. It wasn’t clear in his keynote, but Jobs confirmed my perception, and attempted to defend the choice."}, {"c291": "According to Jobs, it was an issue of security. “You don’t want your phone to be an open platform,” he told me. “You don’t want it to not work because one of three apps you loaded that morning screwed it up. Cingular doesn’t want to see their West Coast network go down because of some app. This thing is more like an iPod than it is a computer in that sense.”"}, {"c1de": "We know now, of course, that Apple changed course. iPhone users have downloaded over 140 billion apps. And that the stunning profusion has been transformative—the key element that makes the iPhone (and now its competitors) the way we perform a dizzying range of activities."}, {"fec7": "On January 2007, Jobs’s expectations were high. But they came nowhere close to capturing the impact the iPhone would have in the world — and for Apple. In its most recent quarter, Apple sold about 75 million iPhones for revenue of $51 billion dollars. During those three months, iPhones made up about two thirds of Apple’s income. In total, Apple has sold over a billion phones."}, {"7382": "“2007 is going to be a very big year for smart phone,” Steve Jobs told me ten years ago. “I see a lot of soccer moms with smart phones.”"}, {"01ce": "Jobs’s optimism was about to be a whopping understatement."}, {"38bb": "Apple is notorious for not looking back. When an anniversary of a big product approaches, the company routinely bounces requests to reminisce. (“I don’t think about that,” was Jobs’s response to me, on the 25th anniversary of Macintosh in 2008). In this case, Apple made an exception: last week I sat down with its senior vp of world wide marketing, Phil Schiller, who joined the company’s leadership team in April 1997, coincident with Steve Jobs’s return. Schiller had been deeply involved in the iPhone’s development and launch."}, {"a12d": "We met at the Cupertino campus that will soon be supplanted as Apple’s executive quarters by an exotic new circular headquarters building a few miles away. As is very common when people sit together these days, on the table were our iPhones, sitting face down like the ubiquitous pistols that gunslingers rest on the bar in old Westerns. Their presence was a reminder that at business meetings, restaurants, living room couches, and dinner tables, you see smart phones on table surfaces or under them, all too often with someone’s eyes cast downwards on a message, an email, a Facebook story, or even a game."}, {"83c2": "I asked him if Apple had an inkling of how big the iPhone would be."}, {"ea34": "“Yes, but not nearly on the scale it’s become,” he says. “We knew we were working on something important that was big to Apple, and that the world was changing around these things in the future. But we didn’t know how big it would be, and we didn’t know how many things would come from it."}, {"8791": "Schiller also cast light on why the iPhone shipped as a closed system. During the gestation period of the iPhone, Apple hosted a spirited internal debate. Some advocated that the device be an open system, like the Macintosh, and others advised a more closed system, like the iPod. The argument was put on hold when the engineers realized that even if the open-system adherents won the debate, it would be impossible to implement in time for the launch. Steve Jobs shut down the discussion, Schiller recalls. “He said ‘We don’t have to keep debating this because we can’t have [an open system] right now. Maybe we’ll change our mind afterwards, or maybe we won’t, but for now there isn’t one so let’s envision this world where we solve the problem with great built-in apps and a way for developers to make web apps.”"}, {"0245": "Yet Schiller pushed back when I suggested that the iPhone’s great moment came when Apple threw open the gates to developers and we learned that for every imaginable activity, as well as some previously unimaginable ones, there was “an app for that.”"}, {"cedb": "“That undervalues how earth-shattering the iPhone was when it first came to market, and we all first got them and fell in love with them,” he says. “iPhone made the idea of a smartphone real. It really was a computer in your pocket. The idea of real internet, real web browser, MultiTouch. There were so many things that are core to what is the smartphone today, that created a product that customers fell in love with, that then also demanded more stuff on them, more apps.”"}, {"9302": "Indeed, says Schiller, the success of the iPhone—propelled by the few apps included on the first model, like Mail and Safari and YouTube—led to the open-or-closed issue becoming a non-debate. Inside Apple the answer was suddenly clear: of course it would be open. (And the security fears that Jobs cited to me on day one mysteriously vanished.) All those critics, including me, who kept urging Apple to make the iPhone open were irrelevant. Not long after launch, Apple began implementing a system that opened the iPhone to a wide range of creators who would make countless apps. Apps that would amplify the iPhone’s impact."}, {"13d9": "I wondered how the success of the iPhone changed Apple itself. Schiller preferred to view the iPhone’s as part of a continuum of change that had already begun with Jobs’s return, and the creation of the iPod."}, {"22bf": "“If it weren’t for iPod, I don’t know that there would ever be iPhone.” he says. “It introduced Apple to customers that were not typical Apple customers, so iPod went from being an accessory to Mac to becoming its own cultural momentum. During that time, Apple changed. Our marketing changed. We had silhouette ads with dancers and an iconic product with white headphones. We asked, “Well, if Apple can do this one thing different than all of its previous products, what else can Apple do?’”"}, {"19b2": "Of late, however, Apple is buffeted with questions about how much the iPhone’s current models are extending that impact. The criticism is tied to a general strain of complaints that Apple is playing it safe of late. Back in November, I asked Schiller whether Apple had gone light in innovation. (Spoiler alert: he says it hasn’t!). Now he takes similar issue with the charge that the more recent iterations of the Phones are not taking leaps as bold as the ones attempted in the big upgrades of the iPhone’s first few years—when, incidentally, Steve Jobs was still alive."}, {"a931": "“I actually think the leaps in the later versions are as big and sometimes even bigger now,” he says. “I think our expectations are changing more, not the leaps in the products. If you look through every version—from the original iPhone to the iPhone 3G to the 4 to the 4S, you see great changes all throughout. You see screen size change from three and a half inch to four inch to four point seven and five point five. You see cameras going through incredible change, from the first camera that couldn’t shoot video, to then having both a front and a backside camera, to now three cameras with the stuff we’re doing, and with live photos and 4K video.”"}, {"70ab": "Maybe some of those changes, I suggest, may have come as responses to competition: like the bigger screens, which first appeared in Samsung and other competitors. When did Apple realize that other companies had ramped up their efforts to provide credible rivals to the iPhone?"}, {"d3bf": "“When we started iPhone, I recall Steve saying we have a five year lead on everybody. (True! “If we didn’t do one more thing,” Jobs said to me in that January 2007 chat, “we’d be set for five years!”) That has turned out to be a very accurate statement. The size of the cell phone market and the importance of smartphones has attracted everybody in the world who can get into the business to try to get into the business. Some have succeeded, some have failed. Competition is great. It pushes us.”"}, {"29a8": "Schiller takes pains, however, to specify that Apple maintains, and will continue to maintain, a lead over its rivals, despite the fact that Android outsells iPhone in units — though not in profits — and iPhone sales themselves seem to be slowing. “The quality is unmatched. The ease of use is still unmatched. The integration of hardware software is unmatched. We’re not about the cheapest, we’re not about the most, we’re about the best.”"}, {"f6ff": "Can Apple ever top the iPhone — create a product that creates a category that changes the way we live the way this one has in the last ten years?"}, {"6228": "Schiller hopes that 50 years people will look back at this point and say, “Wow, they didn’t realize how much was to come — in fact, others missed it because they were busy running around looking for other things. Everyone has their opinions at this point, but it could be that we’re only in the first minutes of the first quarter of the game,” he says. “I believe this product is so great that it has many years of innovation ahead.”"}, {"f2e1": "Yet I wonder whether a pocket-sized device like the iPhone will still be as relevant decades hence. In recent weeks a lot of observers have been saying we are at the start of the era of the conversational interface. While Amazon is pushing those observations, Apple has certainly been in the thick of this movement with its chatty Siri product, built into every iPhone."}, {"bd96": "“That’s really important,” Schiller says, “and I’m so glad the team years ago set out to create Siri — I think we do more with that conversational interface that anyone else. Personally, I still think the best intelligent assistant is the one that’s with you all the time. Having my iPhone with me as the thing I speak to is better than something stuck in my kitchen or on a wall somewhere.”"}, {"ac5f": "Well, I reply, Amazon sees its Alexa voice interface not as something pinned to one device, but a ubiquitous and persistent cloud-based product that can listen to you anywhere."}, {"e470": "“People are forgetting the value and importance of the display,” he says “Some of the greatest innovations on iPhone over the last ten years have been in display. Displays are not going to go away. We still like to take pictures and we need to look at them, and a disembodied voice is not going to show me what the picture is.”"}, {"07ba": "In any case, the first iPhone decade has built a mind-boggling legacy. These are our digital protheses. We are cyborgs, appended to smart phones that give us power, and make us weaker when we for some reason don’t have one. No one knew this would happen, including Apple. “When we started on iPhone, we could envision that phones would change forever and get better,” says Schiller. “We could envision that we could surf the web on them. We could envision that we could get our email. We could envision that it would replace our iPod one day. All those things we could see. But the magical thing that happened along the journey of iPhone is that it also became our most important device in our life. That transition in how we interact with the world is something that I don’t think anyone could completely understand, until we were living with these and using them.”"}], "child": "594_1\t594_2\t594_3\t594_4\t594_5\t594_6\t594_7\t594_8\t594_9\t594_10\t594_11\t594_12\t594_13\t594_14\t594_15\t594_16\t594_17\t594_18\t594_19\t594_20\t594_21\t594_22\t594_23\t594_24"}