{"name": "595", "parent": "", "content": "Little Boxes: How Apps Gentrified the Wild and Wooly Web World By Virginia Heffernan Right now, looking at my laptop screen, I see a row of tight, fussy little icons below the Google doc I have open. This is the “deck” on a Mac. I used to know these like my own five fingers, but that’s when I only had five icons. Now there are — twenty? These represent the tips of the icebergs for the major tech players, and like ticker symbols, they all jostle uncomfortably for my attention. I used to think of Microsoft Word as the blue one, but now I see that Apple has seized various shades of what the humorist Delia Ephron disparages as “bank blue,” and the iMessage app (with cartoon talk bubbles) stands out in that shade, along with the Mail stamp-shaped icon, compass-shaped Safari, and protractor App Store. None of these has a word on them. They look maddeningly alike. The Microsoft Office icons at least look like letters, each made of a single shaded satin ribbon: W, P, X, O. That’s Word, PowerPoint, Excel, Outlook. The spindly shape and contemporary colors — bank blue, yes, but also burnt orange, grass green, and yellow — are a legacy of the ferocious determination of Microsoft to set itself apart from Apple and to seem less isolated and self-contained (like circles) and more compatible and connected (like cursive letters). These Microsoft apps, which I paid dearly for since, because of the Shakespearean Jobs-Gates antagonism, they don’t come standard with Macs anymore, would set Office apart from my machine’s native apps were it not for the fact that Google introduced a virtually identical palette some years ago in its multihued Chrome and Drive icons. So there’s the motley lineup. And I haven’t said a word about FitBit, Skype, Slack, Spotify, and whatever else is down there. This is hardly a team of miracle workers. It’s more like a bagful of foreign coins. And though no doubt the great icon designers of our time created them, they’re now no more emotionally striking or immediately legible than any other timeworn pictographic alphabet. Blade Runner Click on Chrome, though, and you’re zapped onto the Web. Only then is it clear that the Mac interface, even with its confounding icons, is, in contrast with the Web, a model of sleek organization. The Web is haphazardly planned. Its public spaces are mobbed, and urban decay abounds in broken links, ghost town sites, and abandoned projects. Malware and spam have turned living conditions in many quarters unsafe and unsanitary. Bullies, hucksters, and trolls roam the streets. An entrenched population of rowdy, polyglot rabble dominates major sites. People who have always found the Web ugly have nonetheless been forced to live there. It is still the place to go for jobs, resources, services, social life, the future. In the past eight or ten years, however, mobile devices have offered a way out, an orderly suburb that lets inhabitants sample the Web’s opportunities without having to mix with the riffraff. This suburb is defined by those apps: neat, cute homes far from the Web city center, many in pristine Applecrest Estates — the App Store. In the migration of dissenters from those ad-driven Web sites, still humming along at www URLs, to pricey and secluded apps we witnessed urban decentralization, suburbanization, and the online equivalent of white flight: smartphone flight. The parallels between what happened to Chicago, Detroit, and New York in the twentieth century and what happened to the Inter- net since the introduction of the App Store are striking. Like the great modern American cities, the Web was founded on equal parts opportunism and idealism. Over the years nerds, students, creeps, outlaws, rebels, moms, fans, church mice, good-time Charlies, middle managers, senior citizens, starlets, presidents, and corporate predators flocked to the Web and made their home on it. In spite of a growing consensus about the dangers of Web vertigo and the importance of curation, there were surprisingly few “walled gardens” online like the one Facebook once purported to represent. But a kind of virtual redlining took over. The Webtropolis became stratified. Even if, like most people, you still surf the Web on a desktop or laptop, you will have noticed paywalls, invitation-only clubs, subscription programs, privacy settings, and other ways of creating tiers of access. All these things make spaces feel “safe” not only from viruses, instability, unwanted light and sound, unrequested porn, sponsored links, and pop-up ads but also from crude design, wayward and unregistered commenters, and the eccentric voices and images that make the Web constantly surprising, challenging, and enlightening. When a wall goes up, the space you have to pay to visit must, to justify the price, be nicer than the free ones. The catchphrase for software developers is “a better experience.” Behind paywalls like the ones that surround the New York Times and the Wall Street Journal production values surge. Cool software greets the paying lady and gentleman; they get concierge service, perks. Best of all, the advertisers and carnival barkers leave you alone. There’s no frantically racing to click the corner of a hideous Philips video advertisement that stands in the way of what you want to read. Those prerolls and goofy in-your-face ads that make you feel like a sitting duck vanish. Instead you get a maitre d’ who calls you by name. Web stations with entrance fees are more like boutiques than bazaars. Mobile devices represent a desire to skip out on the bazaar. By choosing machines that come to life only when tricked out with apps, users of all the radical smartphones created since the iPhone increasingly commit themselves to a more remote and inevitably antagonistic relationship with the Web. “The App Store must rank among the most carefully policed software platforms in history,” the technology writer Steven Johnson observed — and he might have been speaking conservatively. Policed why? To maintain the App Store’s separateness from the open Web, of course, and to drive up the perceived value of the store’s offerings. Perception, after all, is everything; many apps are to the Web what bottled water is to tap: an inventive and proprietary new way of decanting, packaging, and pricing something that could be had for free. Jobs often spoke of the corporate logos created by his hero Paul Rand (creator of logos for IBM, UPS, and Jobs’s NeXT) as “jewels,” something not merely symbolic but of pure value in themselves. Apps indeed sparkle like sapphires and emeralds for people enervated by the ugliness of monster sites like Craigslist, eBay, and Yahoo!. That sparkle is worth money. Even to the most committed populist or Web native there’s something rejuvenating about being away from an address bar and ads and links and prompts, those constant reminders that the Web is an overcrowded and often maddening metropolis and that you’re not special there. Confidence that you’re not going to get hustled, mobbed, or mugged — that’s precious too. From Magic and Loss: The Internet As Art by Virginia Heffernan. Copyright © 2016 by Virginia Heffernan. Reprinted by permission of Simon & Schuster, Inc. Available for purchase here. The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com ", "title": "Little Boxes: How Apps Gentrified the Wild and Wooly Web World", "sentences": [{"ffdd": "Little Boxes: How Apps Gentrified the Wild and Wooly Web World"}, {"f792": "By Virginia Heffernan"}, {"5522": "Right now, looking at my laptop screen, I see a row of tight, fussy little icons below the Google doc I have open. This is the “deck” on a Mac. I used to know these like my own five fingers, but that’s when I only had five icons. Now there are — twenty? These represent the tips of the icebergs for the major tech players, and like ticker symbols, they all jostle uncomfortably for my attention. I used to think of Microsoft Word as the blue one, but now I see that Apple has seized various shades of what the humorist Delia Ephron disparages as “bank blue,” and the iMessage app (with cartoon talk bubbles) stands out in that shade, along with the Mail stamp-shaped icon, compass-shaped Safari, and protractor App Store. None of these has a word on them. They look maddeningly alike."}, {"ef2f": "The Microsoft Office icons at least look like letters, each made of a single shaded satin ribbon: W, P, X, O. That’s Word, PowerPoint, Excel, Outlook. The spindly shape and contemporary colors — bank blue, yes, but also burnt orange, grass green, and yellow — are a legacy of the ferocious determination of Microsoft to set itself apart from Apple and to seem less isolated and self-contained (like circles) and more compatible and connected (like cursive letters). These Microsoft apps, which I paid dearly for since, because of the Shakespearean Jobs-Gates antagonism, they don’t come standard with Macs anymore, would set Office apart from my machine’s native apps were it not for the fact that Google introduced a virtually identical palette some years ago in its multihued Chrome and Drive icons."}, {"0cde": "So there’s the motley lineup. And I haven’t said a word about FitBit, Skype, Slack, Spotify, and whatever else is down there. This is hardly a team of miracle workers. It’s more like a bagful of foreign coins. And though no doubt the great icon designers of our time created them, they’re now no more emotionally striking or immediately legible than any other timeworn pictographic alphabet."}, {"2da6": "Blade Runner"}, {"9e9f": "Click on Chrome, though, and you’re zapped onto the Web. Only then is it clear that the Mac interface, even with its confounding icons, is, in contrast with the Web, a model of sleek organization."}, {"d146": "The Web is haphazardly planned. Its public spaces are mobbed, and urban decay abounds in broken links, ghost town sites, and abandoned projects. Malware and spam have turned living conditions in many quarters unsafe and unsanitary. Bullies, hucksters, and trolls roam the streets. An entrenched population of rowdy, polyglot rabble dominates major sites."}, {"2608": "People who have always found the Web ugly have nonetheless been forced to live there. It is still the place to go for jobs, resources, services, social life, the future. In the past eight or ten years, however, mobile devices have offered a way out, an orderly suburb that lets inhabitants sample the Web’s opportunities without having to mix with the riffraff. This suburb is defined by those apps: neat, cute homes far from the Web city center, many in pristine Applecrest Estates — the App Store."}, {"8cb8": "In the migration of dissenters from those ad-driven Web sites, still humming along at www URLs, to pricey and secluded apps we witnessed urban decentralization, suburbanization, and the online equivalent of white flight: smartphone flight. The parallels between what happened to Chicago, Detroit, and New York in the twentieth century and what happened to the Inter- net since the introduction of the App Store are striking. Like the great modern American cities, the Web was founded on equal parts opportunism and idealism."}, {"ab7f": "Over the years nerds, students, creeps, outlaws, rebels, moms, fans, church mice, good-time Charlies, middle managers, senior citizens, starlets, presidents, and corporate predators flocked to the Web and made their home on it. In spite of a growing consensus about the dangers of Web vertigo and the importance of curation, there were surprisingly few “walled gardens” online like the one Facebook once purported to represent. But a kind of virtual redlining took over. The Webtropolis became stratified. Even if, like most people, you still surf the Web on a desktop or laptop, you will have noticed paywalls, invitation-only clubs, subscription programs, privacy settings, and other ways of creating tiers of access. All these things make spaces feel “safe” not only from viruses, instability, unwanted light and sound, unrequested porn, sponsored links, and pop-up ads but also from crude design, wayward and unregistered commenters, and the eccentric voices and images that make the Web constantly surprising, challenging, and enlightening."}, {"9f44": "When a wall goes up, the space you have to pay to visit must, to justify the price, be nicer than the free ones. The catchphrase for software developers is “a better experience.” Behind paywalls like the ones that surround the New York Times and the Wall Street Journal production values surge. Cool software greets the paying lady and gentleman; they get concierge service, perks. Best of all, the advertisers and carnival barkers leave you alone. There’s no frantically racing to click the corner of a hideous Philips video advertisement that stands in the way of what you want to read. Those prerolls and goofy in-your-face ads that make you feel like a sitting duck vanish. Instead you get a maitre d’ who calls you by name. Web stations with entrance fees are more like boutiques than bazaars."}, {"fc77": "Mobile devices represent a desire to skip out on the bazaar. By choosing machines that come to life only when tricked out with apps, users of all the radical smartphones created since the iPhone increasingly commit themselves to a more remote and inevitably antagonistic relationship with the Web. “The App Store must rank among the most carefully policed software platforms in history,” the technology writer Steven Johnson observed — and he might have been speaking conservatively. Policed why? To maintain the App Store’s separateness from the open Web, of course, and to drive up the perceived value of the store’s offerings. Perception, after all, is everything; many apps are to the Web what bottled water is to tap: an inventive and proprietary new way of decanting, packaging, and pricing something that could be had for free."}, {"1ab2": "Jobs often spoke of the corporate logos created by his hero Paul Rand (creator of logos for IBM, UPS, and Jobs’s NeXT) as “jewels,” something not merely symbolic but of pure value in themselves. Apps indeed sparkle like sapphires and emeralds for people enervated by the ugliness of monster sites like Craigslist, eBay, and Yahoo!. That sparkle is worth money. Even to the most committed populist or Web native there’s something rejuvenating about being away from an address bar and ads and links and prompts, those constant reminders that the Web is an overcrowded and often maddening metropolis and that you’re not special there. Confidence that you’re not going to get hustled, mobbed, or mugged — that’s precious too."}, {"f68c": "From Magic and Loss: The Internet As Art by Virginia Heffernan. Copyright © 2016 by Virginia Heffernan. Reprinted by permission of Simon & Schuster, Inc."}, {"62ac": "Available for purchase here."}, {"628e": "The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com"}, {"926f": "The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com"}], "child": "595_1\t595_2\t595_3\t595_4\t595_5\t595_6\t595_7"}