{"name": "596", "parent": "", "content": "How Kik Predicted The Rise of Chat Bots The messaging app started working on bots years before its competitors. But can it beat the heavyweights of Silicon Valley? Waterloo, Ontario, is a boom town. An hour west of Toronto, the city rumbles with construction work. Even the Older Mennonites of St. Jacobs, one town over, are digging up their main street, forcing their horse-and-buggies to detour. The region’s growth stems largely from the University of Waterloo, whose intensive internship programs have made it a magnet for tech recruiting. In the ’90s the city birthed Research in Motion and its Blackberry platform, which briefly dominated the mobile industry. Today, Waterloo is also a bot town. It’s where Kik Interactive, a seven-year-old startup with a mobile messaging app that’s popular among teenagers, began working on a conversational platform for bots two years ago — long before the idea became the hot tech trend of 2016 and the latest leg of Facebook’s march to world domination. There’s a crowd of bot-platform contenders right now, including giants like Apple, Amazon, Microsoft, and Google and upstarts like Slack, Telegram, and Twilio. But Facebook opened its Messenger to third-party bots in April, and given its reach (close to a billion users) and its resources, it’s the odds-on favorite. The bots will go where the users are, right? But Kik has plenty of users, as well as a billion-dollar valuation, and it sees this story playing out differently. I’ve come to Waterloo to find out why a little Canadian company with 130 employees thinks it can compete in this game and win — and why it thinks so many of the bigger players have the whole bot thing wrong. - Hi bot. Tell me what’s special about Kik in the Great Bot Wars of 2016- hold on, I'm checking- OK here's what I got for u- Kik's been working on bots longer than most companies- Kik is all-mobile, it has no older platforms to support- 70 percent of Kik's 300 million users are between 13 and 24 years old, and Kik claims 40 percent market penetration among US teens- Kik has China's TenCent as an investor and partner - Tencent operates China's giant messaging service WeChat This kind of all-purpose, intelligent-assistant role is how most of us envision bots ultimately working: it’s what movies like Her and products like Apple’s Siri have trained us to expect. Kik, however, has something quite different in mind. For Kik, a bot isn’t your automated friend, digital concierge, or omniscient genie. It’s more like the new URL, the universal means of accessing somebody else’s information or service without needing to download or register or sign in. Kik’s bots aren’t AI-powered wonders. They’re more populist than futuristic — everybots for everyman. Populism can be off-putting, of course, and if you just scan the catalogue of available bots on Kik, with their movie tie-ins and product placements, you may recoil from the promotional vibe. Yet I find myself rooting for Kik and its populist vision to succeed against the odds, and you might, too. A world with a monopoly on bot-powered chat is one in which we’re a lot more likely to get messages we don’t want. I drive past Pluto Day Care and hang a right at the Esso station, squinting to spy Kik’s sign. The lime-green logo is on an office-park directory, sandwiched incongruously between listings for a driving school and a personal injury lawyer. This low-slung warren of nondescript office buildings is the kind of place you’d rent if you were plotting to take over the world and really didn’t want to be noticed. A quick walk round the back, past the hair removal clinic and the massage therapist, and I’m at the door, I think. There are a few; it’s confusing. As it has grown, Kik has oozed through this complex, adding space and tearing down walls as other tenants moved out. Now its offices are labyrinthine, a maze of twisty passages. The hallways are plastered with round Kik codes — scannable, QR-code-like chat invites, they remind me of old vinyl 45s (one Kik exec says they remind him of poker chips), but they are actually wormholes into chatspace. Scan here to join the staff Dungeons and Dragons game! A chat code pasted on the wall at Kik HQ. Credit: Aaron Vincent Elkaim The Kik codes are only one piece of Kik’s larger bot vision. Like its bot-platform competitors, Kik is cobbling together bits and pieces from the half-century history of chatbots, the annals of artificial intelligence, and the “internet of things” as it tries to solve a big problem: Users want to do more and more with their phones, but they’re downloading new apps less and less often. Chatbots, according to the narrative of the day, are a new “conversational interface” replacing apps (which replaced the browser, which replaced the desktop). Since so many of us are already spending much of our time messaging with human friends, the argument goes, we should not have to leave that environment to do things like summon an Uber ride, move money between banks, or order food. We should tell a bot to do these things, and the bot should make it so. But when I recite that spiel to Ted Livingston, Kik’s affable founder, he pushes back — not because he thinks the idea is hype, but because he thinks it’s too narrow. “We look at chat, very simply, as a better way to deliver software,” he says. “So to us, customer service and selling items on the web are interesting applications of chat — but they’re only a small subset of the type of experiences we’ll be able to deliver.” In the bot gospel according to Kik, chat is the new distribution mechanism for all things digital — the portal through which we will access businesses, news, entertainment, games, and personal services, as well as one another. “I think the future is that every interaction will be powered by chat, in the same way that every piece of information is now on the web. It will become the operating system for society.” Livingston’s iconic example is ordering hot dogs and beer from your stadium seat. Forget waiting on line and missing a big play. Forget downloading the ballpark’s app that you’ll almost never use again. Just scan the code next to your seat and message your order to the stadium bot, right from the Kik chat window where you’re already messaging with your friends. When you’re done, it will disappear, until your next visit. “Bots are to apps as dating is to marriage,” says Josh Jacobs, president of Kik Services, who works out of Kik’s new Los Angeles office. Thanks to WeChat, this interaction model is already ubiquitous in China, where the bots that represent businesses are known as “official accounts.” But it took Kik a few years and false starts to arrive here, including a push to weave partners’ web content directly into chats. “We’re sitting in the next room, right over there, and we’re thinking, people don’t want to build web apps, we’ve tried to make it simple for years, it’s not working,” says Livingston. Then, he recalls, his cofounder and CTO Chris Best had an idea: What if apps were chats themselves? “It was this lightbulb moment that connected a million things.” Two years ago, Kik started inviting other companies to test their bot presences on its network through what it then called “promoted chats.” In April, Kik launched its new Bot Shop — an in-app storefront where users can connect with new bot services (like a personal shopper from H&M) and games (like Arterra, a post-apocalyptic space adventure). A week later, Facebook announced its own new bot platform and bot store at its annual F8 developers’ conference. Kik execs insist they didn’t plan a David-bops-Goliath moment. But they smile as they say it. Screenshot of Kik’s bot shop Kik’s bots live inside a chat app, but they don’t really want to chat much with you. It turns out that, for delivering routine information, at least, conversation isn’t very efficient. If you need a daily weather report, for instance, you may not want to wade through a hit-or-miss joke with each forecast. That is exactly what Poncho, a chatbot unveiled at Facebook’s bot launch, provides, and it opened to scathing reviews. (“Frustrating and useless” — Gizmodo; “the slowest way to use the internet” — The Verge.). For Kik, the important word in “conversational interface” isn’t “conversation,” it’s “interface.” “If you go to our bot shop, almost none of them use the 26-char alphanumeric keyboard,” Livingston says. “They ask you a question, but then they give you four-five-six buttons as suggestions, and you choose one. What adventure do you want to go on? A B or C?” Almost like … a phone tree? “Right — no big deal. But the friction to trying that experience is almost zero.” Interviewing Livingston is similarly modular, like navigating a choose-your-own-adventure story: He keeps helpfully presenting you with options to select. “There’s the past — I can tell you, going back, how we got here. There’s the present — why do I think bots are interesting? Then there’s the future — like, open or closed, what do I think will be exciting about bots, what could be worrisome, all that stuff. So where do you wanna go?” I click on “past,” and Livingston rewinds to the primal tale of Kik’s formative era. In 2010 Kik released a messenger app that worked across iOS, Android, and the then-popular Blackberry, allowing users to communicate regardless of whose device they owned. The company, founded a year before, had set out to create a music app and built the messenger as a tool for sharing songs. But doing deals for music rights took forever, and meanwhile, the messenger went viral, because it let Blackberry users and the burgeoning crowd of iPhone and Android users chat cross-platform for free. It logged a million new users in two weeks — “fastest adoption in human history,” Livingston says, machine-gunning the phrase as if he’s tired of it. “We were the first ones through the wall.” Two weeks later, Blackberry booted Kik out of its app store, banned the app from its platform, and sued Kik for patent infringement. The company, it seems, preferred a world where, if you wanted to message a Blackberry user, you needed to buy a Blackberry. “We were on top of the world, and then one day, with one flick of a switch, it disappeared. All our users who were on Blackberry, or talking to somebody on Blackberry, could no longer use Kik. And that was everybody.” For Kik, it was a rude expulsion from the garden of startup growth. Livingston and his collaborators wandered the wilderness. They’d just raised $8 million from investors. “We had money, but no users,” Livingston says. Other companies like WhatsApp began moving into the space Kik had opened, and Blackberry gave up trying to stop them, but the damage to Kik was done. That’s when Kik got serious about turning chat into a software platform. Kik’s experience of near-death-by-Blackberry also taught Livingston and company a gritty lesson in the power politics of digital media platforms. It explains why they frame themselves as champions of a bot world that’s open and messy — and more than a little like the Web was in its early days. Everyone at Kik, admitting the crudity of today’s bot landscape, talks about the present moment as bots’ “Netscape 1.0, blink-tag phase.” The other parallel with the ’90s is that Livingston sees a conflict brewing between open and closed visions of botland. “When you’re a restaurant, and you launch a bot, will you put that bot on an open platform, where everybody’s on a level playing field, or will you put that bot on the dominant bot platform, where they have complete control and can tax you?” he asks. “Right now it could go either way.” Livingston and Kik are betting on a relatively more open system — not because they’re altruists but because they think it will work better, and because they remember what Blackberry did to them. But an early-Web ethos also has its downsides, as Kik has learned all too well. After its fall from Blackberry’s grace, Kik found its way to renewed growth by catering to youth. One reason it appeals to teens is that you can use it anonymously, signing up with any old username rather than a phone number or other traceable ID. Over the years Kik’s name has shared headlines with words like “predators” and “pornography.” The Daily Dot dubbed Kik “the king of sketchy messaging apps.” Kik says its problems resemble those of other chat platforms and that it tries to balance protecting users’ privacy and cooperating with law enforcement. Similar issues did not stunt the rise of AOL or Facebook, so it’s safe to assume that they won’t hold Kik back — as long as the company addresses incidents in good faith. Credit: Aaron Vincent Elkaim The annals of artificial intelligence are shaped by two competing visions. In “weak” or narrow AI, the system simply masters a task — it can play chess but not banter with you. With “Strong AI” (aka “artificial general intelligence”), a la Hal 9000 or Samantha from Her, the system is adept enough with language and situational awareness to learn and improvise and even impersonate a sentient being. The way Livingston sees it, big companies that have poured money into AI for decades are hoping they can finally see a return on that investment. Thus we have Siri and Cortana and Alexa and Facebook’s M — a whole cast of characters vying to serve as our digital majordomos and intelligently cater to our needs and wishes. They will put a friendly voice in front of the yottabytes of cloud data and logic that sit behind today’s search window, and we won’t ever have to type again. “It’s a nice story,” says Kik’s Josh Jacobs. “It says, the future is this new kind of technology that requires an army of PhDs to work at your company to compete. Is that true?” To the Google- or Apple-style “one bot to rule them all” scenario, Kik counters with a “let a thousand bots bloom” approach. Mentioning a Kik bot will summon it into a chat, but it won’t pretend to be your friend. “The bot just pops in and pops out,” says Mike Roberts, Kik’s head of mobile development, who oversaw the launch of the Kik Bot Shop. “It doesn’t sit there and listen. You don’t have to worry about what the bot hears, or what it thinks about what else you’re saying.” Jacobs argues that chatbots will be able to solve a problem for us that’s entirely different from the one search engines have mastered — call it the housesitter-music dilemma. You’re visiting my home; how do you know how to play a song? Am I an Apple Music user plugged into Sonos, a Spotify subscriber piping tracks through Alexa, or what? “As we walk around in our daily lives,” Jacobs says, “we’re coming in and out of networks of available services. And there’s no great interface for detecting, dynamically configuring, and interacting with them, then walking out of their orbit.” For such scenarios, AI might be overkill. It might not even do a great job. Right now the 50-odd offerings in Kik’s Bot Shop are pretty unassuming. They’re not going to end hunger or usher in world peace; they’ll summon a video clip to make you laugh, start a zombie survival game with your friends, or let you chat with a Teenage Mutant Ninja Turtle. It’s all admittedly underwhelming for the dawn of a new era. “People ask me all the time,” Livingston says, “show me a bot that points to this future, and I can’t, not yet.” The web looked pretty underwhelming in the mid-’90s, too. But a look at the Kik Bot Shop does make you wonder: What happens when your chat list gets as crowded as your email inbox? Do we really want to invite brands and marketers into the space we use to talk to our friends and family? Isn’t there a possibility, as Buzzfeed’s Nitasha Tiku asked after Facebook’s bot launch, that “users may not want to chat with airlines and online retailers ‘like they’re your friend’”? Paul Gray, Kik’s director of platform services, says things only get dicey when marketers treat a bot as if it were a broadcast channel. “This is not the best tool for marketers to just blast things out. ‘Oh, great, you can reach users one on one? Let’s send them a message every single day!’” A good bot, Gray says, is one that understands when you’re losing interest. If the bot-driven commercial landscape of the future is going to serve our needs and not just become choked with the bot equivalent of spam, we will want to have some choice among platforms. Businesses will want many different options for designing and building bots. And users will want to preserve the ability to say “no.” Kik may be just another platform company, but today it’s the one that’s most vocal about such principles, and the one that looks most inclined to uphold them. I’d hoped that visiting Kik in Waterloo might give me a concrete glimpse of the bot future, but there isn’t that much to see yet. Kik does run frequent tests with local merchants, and before I left I scanned a code that connected me with the bot for Mel’s Diner. Mind you, this is Mel’s Diner of Waterloo, Ontario — which is not the same as any of the many Mel’s Diners in many other locations, all of whom will no doubt fight in the future over bot-naming rights. When I left Kik’s offices, I was all set to order a hot dog for delivery to my hotel room. The bot worked nicely. But Mel’s offers foot-long hot dogs only, and honestly? I just wasn’t that hungry. Still, I’m happy to report that Mel’s didn’t pester me with a hard sell and hasn’t bothered me since. A well-behaved bot! There just might be hope. ", "title": "How Kik Predicted The Rise of Chat Bots", "sentences": [{"b628": "How Kik Predicted The Rise of Chat Bots"}, {"1d45": "The messaging app started working on bots years before its competitors. But can it beat the heavyweights of Silicon Valley?"}, {"c79e": "Waterloo, Ontario, is a boom town. An hour west of Toronto, the city rumbles with construction work. Even the Older Mennonites of St. Jacobs, one town over, are digging up their main street, forcing their horse-and-buggies to detour. The region’s growth stems largely from the University of Waterloo, whose intensive internship programs have made it a magnet for tech recruiting. In the ’90s the city birthed Research in Motion and its Blackberry platform, which briefly dominated the mobile industry."}, {"8403": "Today, Waterloo is also a bot town. It’s where Kik Interactive, a seven-year-old startup with a mobile messaging app that’s popular among teenagers, began working on a conversational platform for bots two years ago — long before the idea became the hot tech trend of 2016 and the latest leg of Facebook’s march to world domination."}, {"3a69": "There’s a crowd of bot-platform contenders right now, including giants like Apple, Amazon, Microsoft, and Google and upstarts like Slack, Telegram, and Twilio. But Facebook opened its Messenger to third-party bots in April, and given its reach (close to a billion users) and its resources, it’s the odds-on favorite. The bots will go where the users are, right?"}, {"f814": "But Kik has plenty of users, as well as a billion-dollar valuation, and it sees this story playing out differently. I’ve come to Waterloo to find out why a little Canadian company with 130 employees thinks it can compete in this game and win — and why it thinks so many of the bigger players have the whole bot thing wrong."}, {"653e": "- Hi bot. Tell me what’s special about Kik in the Great Bot Wars of 2016- hold on, I'm checking- OK here's what I got for u- Kik's been working on bots longer than most companies- Kik is all-mobile, it has no older platforms to support- 70 percent of Kik's 300 million users are between 13 and 24 years old, and Kik claims 40 percent market penetration among US teens- Kik has China's TenCent as an investor and partner - Tencent operates China's giant messaging service WeChat"}, {"52c5": "This kind of all-purpose, intelligent-assistant role is how most of us envision bots ultimately working: it’s what movies like Her and products like Apple’s Siri have trained us to expect. Kik, however, has something quite different in mind. For Kik, a bot isn’t your automated friend, digital concierge, or omniscient genie. It’s more like the new URL, the universal means of accessing somebody else’s information or service without needing to download or register or sign in. Kik’s bots aren’t AI-powered wonders. They’re more populist than futuristic — everybots for everyman."}, {"02a0": "Populism can be off-putting, of course, and if you just scan the catalogue of available bots on Kik, with their movie tie-ins and product placements, you may recoil from the promotional vibe. Yet I find myself rooting for Kik and its populist vision to succeed against the odds, and you might, too. A world with a monopoly on bot-powered chat is one in which we’re a lot more likely to get messages we don’t want."}, {"2521": "I drive past Pluto Day Care and hang a right at the Esso station, squinting to spy Kik’s sign. The lime-green logo is on an office-park directory, sandwiched incongruously between listings for a driving school and a personal injury lawyer."}, {"9c86": "This low-slung warren of nondescript office buildings is the kind of place you’d rent if you were plotting to take over the world and really didn’t want to be noticed. A quick walk round the back, past the hair removal clinic and the massage therapist, and I’m at the door, I think. There are a few; it’s confusing. As it has grown, Kik has oozed through this complex, adding space and tearing down walls as other tenants moved out. Now its offices are labyrinthine, a maze of twisty passages. The hallways are plastered with round Kik codes — scannable, QR-code-like chat invites, they remind me of old vinyl 45s (one Kik exec says they remind him of poker chips), but they are actually wormholes into chatspace. Scan here to join the staff Dungeons and Dragons game!"}, {"7cf5": "A chat code pasted on the wall at Kik HQ. Credit: Aaron Vincent Elkaim"}, {"23f2": "The Kik codes are only one piece of Kik’s larger bot vision. Like its bot-platform competitors, Kik is cobbling together bits and pieces from the half-century history of chatbots, the annals of artificial intelligence, and the “internet of things” as it tries to solve a big problem: Users want to do more and more with their phones, but they’re downloading new apps less and less often."}, {"8012": "Chatbots, according to the narrative of the day, are a new “conversational interface” replacing apps (which replaced the browser, which replaced the desktop). Since so many of us are already spending much of our time messaging with human friends, the argument goes, we should not have to leave that environment to do things like summon an Uber ride, move money between banks, or order food. We should tell a bot to do these things, and the bot should make it so."}, {"9fbc": "But when I recite that spiel to Ted Livingston, Kik’s affable founder, he pushes back — not because he thinks the idea is hype, but because he thinks it’s too narrow. “We look at chat, very simply, as a better way to deliver software,” he says. “So to us, customer service and selling items on the web are interesting applications of chat — but they’re only a small subset of the type of experiences we’ll be able to deliver.”"}, {"c5e5": "In the bot gospel according to Kik, chat is the new distribution mechanism for all things digital — the portal through which we will access businesses, news, entertainment, games, and personal services, as well as one another. “I think the future is that every interaction will be powered by chat, in the same way that every piece of information is now on the web. It will become the operating system for society.”"}, {"d962": "Livingston’s iconic example is ordering hot dogs and beer from your stadium seat. Forget waiting on line and missing a big play. Forget downloading the ballpark’s app that you’ll almost never use again. Just scan the code next to your seat and message your order to the stadium bot, right from the Kik chat window where you’re already messaging with your friends. When you’re done, it will disappear, until your next visit. “Bots are to apps as dating is to marriage,” says Josh Jacobs, president of Kik Services, who works out of Kik’s new Los Angeles office."}, {"0ff4": "Thanks to WeChat, this interaction model is already ubiquitous in China, where the bots that represent businesses are known as “official accounts.” But it took Kik a few years and false starts to arrive here, including a push to weave partners’ web content directly into chats. “We’re sitting in the next room, right over there, and we’re thinking, people don’t want to build web apps, we’ve tried to make it simple for years, it’s not working,” says Livingston. Then, he recalls, his cofounder and CTO Chris Best had an idea: What if apps were chats themselves? “It was this lightbulb moment that connected a million things.”"}, {"fb51": "Two years ago, Kik started inviting other companies to test their bot presences on its network through what it then called “promoted chats.” In April, Kik launched its new Bot Shop — an in-app storefront where users can connect with new bot services (like a personal shopper from H&M) and games (like Arterra, a post-apocalyptic space adventure). A week later, Facebook announced its own new bot platform and bot store at its annual F8 developers’ conference. Kik execs insist they didn’t plan a David-bops-Goliath moment. But they smile as they say it."}, {"c5df": "Screenshot of Kik’s bot shop"}, {"c43b": "Kik’s bots live inside a chat app, but they don’t really want to chat much with you. It turns out that, for delivering routine information, at least, conversation isn’t very efficient. If you need a daily weather report, for instance, you may not want to wade through a hit-or-miss joke with each forecast. That is exactly what Poncho, a chatbot unveiled at Facebook’s bot launch, provides, and it opened to scathing reviews. (“Frustrating and useless” — Gizmodo; “the slowest way to use the internet” — The Verge.)."}, {"6839": "For Kik, the important word in “conversational interface” isn’t “conversation,” it’s “interface.”"}, {"46f5": "“If you go to our bot shop, almost none of them use the 26-char alphanumeric keyboard,” Livingston says. “They ask you a question, but then they give you four-five-six buttons as suggestions, and you choose one. What adventure do you want to go on? A B or C?” Almost like … a phone tree? “Right — no big deal. But the friction to trying that experience is almost zero.”"}, {"5cf9": "Interviewing Livingston is similarly modular, like navigating a choose-your-own-adventure story: He keeps helpfully presenting you with options to select. “There’s the past — I can tell you, going back, how we got here. There’s the present — why do I think bots are interesting? Then there’s the future — like, open or closed, what do I think will be exciting about bots, what could be worrisome, all that stuff. So where do you wanna go?”"}, {"77e5": "I click on “past,” and Livingston rewinds to the primal tale of Kik’s formative era."}, {"4dfe": "In 2010 Kik released a messenger app that worked across iOS, Android, and the then-popular Blackberry, allowing users to communicate regardless of whose device they owned. The company, founded a year before, had set out to create a music app and built the messenger as a tool for sharing songs. But doing deals for music rights took forever, and meanwhile, the messenger went viral, because it let Blackberry users and the burgeoning crowd of iPhone and Android users chat cross-platform for free. It logged a million new users in two weeks — “fastest adoption in human history,” Livingston says, machine-gunning the phrase as if he’s tired of it. “We were the first ones through the wall.”"}, {"e130": "Two weeks later, Blackberry booted Kik out of its app store, banned the app from its platform, and sued Kik for patent infringement. The company, it seems, preferred a world where, if you wanted to message a Blackberry user, you needed to buy a Blackberry. “We were on top of the world, and then one day, with one flick of a switch, it disappeared. All our users who were on Blackberry, or talking to somebody on Blackberry, could no longer use Kik. And that was everybody.”"}, {"7814": "For Kik, it was a rude expulsion from the garden of startup growth. Livingston and his collaborators wandered the wilderness. They’d just raised $8 million from investors. “We had money, but no users,” Livingston says. Other companies like WhatsApp began moving into the space Kik had opened, and Blackberry gave up trying to stop them, but the damage to Kik was done. That’s when Kik got serious about turning chat into a software platform."}, {"eaa8": "Kik’s experience of near-death-by-Blackberry also taught Livingston and company a gritty lesson in the power politics of digital media platforms. It explains why they frame themselves as champions of a bot world that’s open and messy — and more than a little like the Web was in its early days. Everyone at Kik, admitting the crudity of today’s bot landscape, talks about the present moment as bots’ “Netscape 1.0, blink-tag phase.”"}, {"8f7b": "The other parallel with the ’90s is that Livingston sees a conflict brewing between open and closed visions of botland. “When you’re a restaurant, and you launch a bot, will you put that bot on an open platform, where everybody’s on a level playing field, or will you put that bot on the dominant bot platform, where they have complete control and can tax you?” he asks. “Right now it could go either way.”"}, {"1d43": "Livingston and Kik are betting on a relatively more open system — not because they’re altruists but because they think it will work better, and because they remember what Blackberry did to them."}, {"95dc": "But an early-Web ethos also has its downsides, as Kik has learned all too well. After its fall from Blackberry’s grace, Kik found its way to renewed growth by catering to youth. One reason it appeals to teens is that you can use it anonymously, signing up with any old username rather than a phone number or other traceable ID. Over the years Kik’s name has shared headlines with words like “predators” and “pornography.” The Daily Dot dubbed Kik “the king of sketchy messaging apps.” Kik says its problems resemble those of other chat platforms and that it tries to balance protecting users’ privacy and cooperating with law enforcement. Similar issues did not stunt the rise of AOL or Facebook, so it’s safe to assume that they won’t hold Kik back — as long as the company addresses incidents in good faith."}, {"2121": "Credit: Aaron Vincent Elkaim"}, {"0677": "The annals of artificial intelligence are shaped by two competing visions. In “weak” or narrow AI, the system simply masters a task — it can play chess but not banter with you. With “Strong AI” (aka “artificial general intelligence”), a la Hal 9000 or Samantha from Her, the system is adept enough with language and situational awareness to learn and improvise and even impersonate a sentient being."}, {"5332": "The way Livingston sees it, big companies that have poured money into AI for decades are hoping they can finally see a return on that investment. Thus we have Siri and Cortana and Alexa and Facebook’s M — a whole cast of characters vying to serve as our digital majordomos and intelligently cater to our needs and wishes. They will put a friendly voice in front of the yottabytes of cloud data and logic that sit behind today’s search window, and we won’t ever have to type again."}, {"09f8": "“It’s a nice story,” says Kik’s Josh Jacobs. “It says, the future is this new kind of technology that requires an army of PhDs to work at your company to compete. Is that true?” To the Google- or Apple-style “one bot to rule them all” scenario, Kik counters with a “let a thousand bots bloom” approach. Mentioning a Kik bot will summon it into a chat, but it won’t pretend to be your friend. “The bot just pops in and pops out,” says Mike Roberts, Kik’s head of mobile development, who oversaw the launch of the Kik Bot Shop. “It doesn’t sit there and listen. You don’t have to worry about what the bot hears, or what it thinks about what else you’re saying.”"}, {"beea": "Jacobs argues that chatbots will be able to solve a problem for us that’s entirely different from the one search engines have mastered — call it the housesitter-music dilemma. You’re visiting my home; how do you know how to play a song? Am I an Apple Music user plugged into Sonos, a Spotify subscriber piping tracks through Alexa, or what? “As we walk around in our daily lives,” Jacobs says, “we’re coming in and out of networks of available services. And there’s no great interface for detecting, dynamically configuring, and interacting with them, then walking out of their orbit.” For such scenarios, AI might be overkill. It might not even do a great job."}, {"35af": "Right now the 50-odd offerings in Kik’s Bot Shop are pretty unassuming. They’re not going to end hunger or usher in world peace; they’ll summon a video clip to make you laugh, start a zombie survival game with your friends, or let you chat with a Teenage Mutant Ninja Turtle."}, {"262f": "It’s all admittedly underwhelming for the dawn of a new era. “People ask me all the time,” Livingston says, “show me a bot that points to this future, and I can’t, not yet.” The web looked pretty underwhelming in the mid-’90s, too. But a look at the Kik Bot Shop does make you wonder: What happens when your chat list gets as crowded as your email inbox? Do we really want to invite brands and marketers into the space we use to talk to our friends and family? Isn’t there a possibility, as Buzzfeed’s Nitasha Tiku asked after Facebook’s bot launch, that “users may not want to chat with airlines and online retailers ‘like they’re your friend’”?"}, {"05c4": "Paul Gray, Kik’s director of platform services, says things only get dicey when marketers treat a bot as if it were a broadcast channel. “This is not the best tool for marketers to just blast things out. ‘Oh, great, you can reach users one on one? Let’s send them a message every single day!’” A good bot, Gray says, is one that understands when you’re losing interest."}, {"eb47": "If the bot-driven commercial landscape of the future is going to serve our needs and not just become choked with the bot equivalent of spam, we will want to have some choice among platforms. Businesses will want many different options for designing and building bots. And users will want to preserve the ability to say “no.” Kik may be just another platform company, but today it’s the one that’s most vocal about such principles, and the one that looks most inclined to uphold them."}, {"2f10": "I’d hoped that visiting Kik in Waterloo might give me a concrete glimpse of the bot future, but there isn’t that much to see yet. Kik does run frequent tests with local merchants, and before I left I scanned a code that connected me with the bot for Mel’s Diner. Mind you, this is Mel’s Diner of Waterloo, Ontario — which is not the same as any of the many Mel’s Diners in many other locations, all of whom will no doubt fight in the future over bot-naming rights. When I left Kik’s offices, I was all set to order a hot dog for delivery to my hotel room."}, {"6ff6": "The bot worked nicely. But Mel’s offers foot-long hot dogs only, and honestly? I just wasn’t that hungry. Still, I’m happy to report that Mel’s didn’t pester me with a hard sell and hasn’t bothered me since. A well-behaved bot! There just might be hope."}], "child": "596_1\t596_2\t596_3\t596_4\t596_5\t596_6\t596_7\t596_8\t596_9\t596_10\t596_11\t596_12"}