{"name": "597", "parent": "", "content": "Can Women Build A Better Tinder? Why the best dating apps are founded by people who aren’t dicks When a 34-year-old biologist is asked what she is looking for in a man, she doesn’t respond with a height requirement or a hair color. She pauses for a moment, reflecting on a divorce and the French man who came after. He needs to be there for her; she has to be sure of him. But the most important thing, she says, as she points to her head: “It’s all up here.” We are in a cold, glass conference room at the WeWork offices in downtown Manhattan. It’s not the most comfortable place to bare your soul to a matchmaker, but she is slowly opening up over the course of a 30-minute conversation. The biologist comes to Dating Ring, a two-year-old startup, because what she desires doesn’t easily translate into the average online dating profile. It is not the stuff of attraction or sexual compatibility, although that’s part of it; it is the stuff of love. The hardest thing to find. Being single in 2015 often means cynically scaling the walls of the internet and praying for a foothold. “Winning Tinder is about mastering the app’s affordances, its game mechanics, the dissociative buffers that make it possible to play,” wrote Alicia Eler and Eve Peyser in The New Inquiry earlier this year. “You must regard other people on Tinder — and yourself — as avatars.” But we aren’t just Tindering. Oh no. We are also Hinge-ing, and Happn-ing and Plenty-of-Fishing. We are fave-ing selfies and sliding into DMs and liking statuses. We are texting and sexting and pinging via Gchat. We are purposefully choosing the seat next to the attractive person at the bar. We are asking our friends if their cute co-worker is seeing anyone. And we are doing all of these things at once. It is fucking exhausting. Especially for heterosexual women. A 2013 Pew Research report on online dating found 42 percent of female online daters had been contacted “in a way that made them feel harassed or uncomfortable,” while only 17 percent of men said the same. Those bad experiences surely help explain why women use dating technology far less than men do, as data from GlobalWebIndex shows. It’s easy to conclude that the problem is technology, that it has negatively altered the way we connect and communicate. But there’s a bigger issue we are overlooking. In the tech industry at large, men outnumber women 4 to 1. The mainstream online dating technologies — OkCupid, Match.com, eHarmony — were all founded by men. So it’s no surprise that most popular dating products cater to male user problems. But a new crop of entrepreneurs is working on more effective ways to hook people up, whether for one night or for life. These founders are mining personal experience for inspiration, and in doing so, pushing the whole category past its vapid and sleazy associations. Their advantage, when it comes to the tech they’re designing, is simple: They’re women. The first time I open up Bumble, dubbed the “feminist dating app” by the press, I am surprised by the offerings. It’s one of many apps I’m checking out as a single straight woman, as part of a larger exploration of female-designed dating technology. Bumble’s landmark feature is that women must take the initiative on all conversations. After getting mutually matched with someone, a woman needs to say “hi” within 24 hours or the connection expires. Instead of pairing off and then both going radio silent, as was often my experience on Tinder, the women-take-charge philosophy seemed to inspire actual conversation. I found myself having semi-intelligent exchanges with adult men. On a dating site. This was new! A Bumble profile. I ask Whitney Wolfe, Bumble’s founder, why that is. She thinks her app takes all the pressure off the man and creates a more relaxed, healthy dynamic. “He is most likely tired of reaching out blindly to women all the time,” she tells me. “Maybe he feels rejected. He feels ignored.” So having a woman contact him restores some balance. I doubted that a feature that simple could really make a difference. But these interactions — all of which were respectful — led me to actual dates: by the end of week one, I had gone on two with nice guys. Considering the year I spent on Tinder without ever meeting anyone in the flesh, this was progress. I quickly noticed there are fewer men on Bumble — it has around 1 million users compared to Tinder’s estimated 50 million— but they came across as less superficial, more human, and complex. Profiles ask you to include things like your job title and college. At a bar one night, a man tells me, “Everyone on Tinder is a robot, but on Bumble they feel like real people.” Wolfe founded Bumble a year after leaving Tinder, where she was a co-founder. She filed a discrimination and sexual harassment lawsuit against the company, in which she claimed she was unfairly demoted and finally pushed out by two male co-founders, one of whom she dated (not the one who doesn’t know what sodomy is). Though she is extremely limited legally in talking about her experience at Tinder — they have since settled out of court — I wonder if her negative experiences there inform her dating theories now. Perhaps as a hint of Bumble’s influence, last week Tinder announced that users could now include details on education and work. Bumble’s Instagram is obviously aimed at women. If you are a male entrepreneur, approaching the problem of online dating from your point of view, the goal would be to provide male users with more women. Numbers show that a man’s chances of getting laid or even falling in love are hindered by the fact that there’s a supply and demand problem; there just aren’t enough women on dating sites to go around. I was recently horrified to watch a male friend just swiping right on everyone without even looking. But that’s what he needs to do to up his chances of getting a match. (According to the New York Times, men swipe right 46 percent of the time, compared to 14 percent for women.) Long before online dating existed, traditions like “Ladies Nights” at bars operated on the exact same premise. This isn’t to say that all men approach online dating haphazardly, without goals or specific desires. But when it comes to technologists defining their use case, Shannon Ong, founder of The Catch, a still-in-beta app where “ladies can meet awesome gentlemen,” doesn’t mince words. “Men have problems getting dates,” she says. “So they create an app based on their own user problem.” Ong, like Wolfe, decided to design an app that prioritizes the experience of women. Women on The Catch invite men to answer questions they come up with, such as: If you could take a vacation anywhere, where would you go and why? If a guy gets 3 in a row selected as a woman’s favorite, he is deemed the winner and can proceed to messaging. When three sisters launched the Coffee Meets Bagel app in 2012, which sends each member one match everyday at noon, the goal was to value quality over quantity. “We are curating you the right person,” says co-founder Dawoon Kang. “And because of that a lot of women find our brand and product appealing.” According to Kang, they were also the first in the space to pull profile information from Facebook, in part because safety is one of the primary concerns of women who online date. The Facebook API made signing up and finding second-degree connections easier, improving the quality of matches for all users. Perhaps more important, linking to an established social media profile strongly discourages catfishing and harassment. What happens when The League is loading. Now every dating app does something similar. Amanda Bradford’s The League, aimed at highly educated, career-oriented folks, requires a double verification through both Facebook and LinkedIn, to foster an exclusivity she hopes will create a community of like-minded people. Bradford says the League employs an application process that leans heavily on referrals in part to help weed out men who are intimidated by alpha females. “It wasn’t that I dreamt of being a dating app founder,” she says of launching the League. “I was frustrated with the current offerings and I had ideas of how I could make this work personally.” Bradford wanted to make sure she didn’t date a guy who wanted a housewife. Clearly, she’s not alone: The League is still in beta but has over 100,000 people on the waitlist. Siren was initially built to allow female users the option of blurring their photos. They would know the men contacting them were showing interest based on their answers to questions of the day, like “what is your favorite Netflix binge?,” and those alone. The woman — who may be wary of revealing herself online because of past experiences — ultimately picks who gets to see her picture and interact with her. (After hearing from some male users, Siren decided to extend all men the same option, though Lee notes that only 20% of women opt to be seen by every user, compared to 80% of men). Uniquely, Siren captures some of the authenticity of a social network.“The person that you are on social media, it is definitely you,” says Susie Lee, who co-founded the company with Katrina Hess. “It’s hard to create a fake persona day after day.” Emma Tessler knows personally that “dating sucks in a unique way” for women. She is now engaged, but it took her 116 online dates to get there. Users of Dating Ring, a paid service which she co-founded with Lauren Kay and Katie Bambino, receive matches and invitations to members-only parties. Most notably, they also must answer a series of prompts via the website, things like “do you want to have kids with a future partner?,” which helps their algorithm work in tandem with a real matchmaker to hook you up. By having real human women as the interlocutors, Dating Ring cultivates a a safe space for their users. The goal of the interview with a matchmaker is to figure out not just what someone is looking for, but the barriers — psychological or otherwise — preventing them from getting there. In my personal session, Tessler asks me to address head on why I’m single. She wants to know about my work hours, my family, and why I seem to be attracted to unavailable men. She is the opposite of a cold, impartial algorithm, and it can be unnerving. Tessler also wants feedback on every match: if her client isn’t into it, she needs to know why, so she can do better next time. “Screw the guy,” she says to one female client. “Our relationship is what really matters.” I thought about the conversation I had with Tessler all week. I didn’t meet a life partner via Dating Ring, but the positive experience started to change the way I approached my love life. And when I tell my friends about the babe I met on the flight out to San Francisco that Friday, I credit her. It is a weird sensation, trying out these apps and thinking “this was designed for someone like me.” There aren’t many tech products — or innovations more broadly — that cater to the user experience of women. Apple’s Health app, which tracks your health and fitness, for example, curiously didn’t include menstruation when it launched. And a groundbreaking artificial heart fits 86 percent of men but only 20 percent of women, because it is typically too big for women’s bodies. Mandating that a woman talk first, or giving her control over revealing her image, may seem like small, inconsequential design choices. But they affect things as important as sex, love, marriage, procreation. While almost all new tech companies claim they are going to “change the world” in some way or another, dating apps actually might. It’s ridiculous to think that Tinder, or any dating site, is to blame for what Vanity Fair calls the “dating apocalypse” — a hookup culture that turns humanity into one large all-you-can eat buffet. But they do amplify existing human tendencies, and technology creators have a kind of ethical responsibility to interrogate what that means. Wolfe runs Bumble by a motto: “We can’t be good to our users, if we aren’t good to ourselves.” It’s a company, Wolfe says, where a predominately female staff “builds each other up.” Bumble would not let me visit their offices to check this out myself, but Wolfe maintains that Bumble’s office culture shines through in the product; it’s caused a “contagious complimentary ripple.” She thinks it’s why users of the app are nicer to each other. Of course, it’s not that simple. These apps won’t provide a silver bullet solution to the problem of dating and all the not-so-lovely things that come with it. These apps are still in early stages, only seeding in tech-rich pockets of the country. And as my own experiments with them show, they don’t always foster real connections. But as users, we need to consistently think about how the ethos of founders shapes the products that define our society. In a talk delivered earlier this year, entrepreneur Anil Dash spoke about how apps define our culture. “Our values as people who create sites, create web apps, create mobile apps,” Dash continues, “our values define the defaults in those services.” In some way Uber is a reflection of Travis Kalanick, Tesla of Elon Musk, Facebook of Mark Zuckerberg, Medium of my boss Ev Williams. I could go on and on, but it would be a struggle for me to think of even one female name to add to that list; after all, less than 5 percent of venture capital funding goes to women. But with these online dating innovations, the tech industry just might realize what they’ve long been ignoring: women’s experiences matter, too. Collage illustrations by Eugenia Loli. ", "title": "Can Women Build A Better Tinder?", "sentences": [{"aaa9": "Can Women Build A Better Tinder?"}, {"d062": "Why the best dating apps are founded by people who aren’t dicks"}, {"9c86": "When a 34-year-old biologist is asked what she is looking for in a man, she doesn’t respond with a height requirement or a hair color. She pauses for a moment, reflecting on a divorce and the French man who came after. He needs to be there for her; she has to be sure of him. But the most important thing, she says, as she points to her head: “It’s all up here.”"}, {"8667": "We are in a cold, glass conference room at the WeWork offices in downtown Manhattan. It’s not the most comfortable place to bare your soul to a matchmaker, but she is slowly opening up over the course of a 30-minute conversation. The biologist comes to Dating Ring, a two-year-old startup, because what she desires doesn’t easily translate into the average online dating profile. It is not the stuff of attraction or sexual compatibility, although that’s part of it; it is the stuff of love. The hardest thing to find."}, {"1b82": "Being single in 2015 often means cynically scaling the walls of the internet and praying for a foothold. “Winning Tinder is about mastering the app’s affordances, its game mechanics, the dissociative buffers that make it possible to play,” wrote Alicia Eler and Eve Peyser in The New Inquiry earlier this year. “You must regard other people on Tinder — and yourself — as avatars.”"}, {"79e9": "But we aren’t just Tindering. Oh no. We are also Hinge-ing, and Happn-ing and Plenty-of-Fishing. We are fave-ing selfies and sliding into DMs and liking statuses. We are texting and sexting and pinging via Gchat. We are purposefully choosing the seat next to the attractive person at the bar. We are asking our friends if their cute co-worker is seeing anyone. And we are doing all of these things at once."}, {"118c": "It is fucking exhausting. Especially for heterosexual women."}, {"57ae": "A 2013 Pew Research report on online dating found 42 percent of female online daters had been contacted “in a way that made them feel harassed or uncomfortable,” while only 17 percent of men said the same. Those bad experiences surely help explain why women use dating technology far less than men do, as data from GlobalWebIndex shows."}, {"e1cb": "It’s easy to conclude that the problem is technology, that it has negatively altered the way we connect and communicate. But there’s a bigger issue we are overlooking. In the tech industry at large, men outnumber women 4 to 1. The mainstream online dating technologies — OkCupid, Match.com, eHarmony — were all founded by men. So it’s no surprise that most popular dating products cater to male user problems."}, {"06f3": "But a new crop of entrepreneurs is working on more effective ways to hook people up, whether for one night or for life. These founders are mining personal experience for inspiration, and in doing so, pushing the whole category past its vapid and sleazy associations."}, {"73c3": "Their advantage, when it comes to the tech they’re designing, is simple:"}, {"ce17": "They’re women."}, {"bd39": "The first time I open up Bumble, dubbed the “feminist dating app” by the press, I am surprised by the offerings. It’s one of many apps I’m checking out as a single straight woman, as part of a larger exploration of female-designed dating technology. Bumble’s landmark feature is that women must take the initiative on all conversations. After getting mutually matched with someone, a woman needs to say “hi” within 24 hours or the connection expires. Instead of pairing off and then both going radio silent, as was often my experience on Tinder, the women-take-charge philosophy seemed to inspire actual conversation. I found myself having semi-intelligent exchanges with adult men. On a dating site. This was new!"}, {"745c": "A Bumble profile."}, {"780a": "I ask Whitney Wolfe, Bumble’s founder, why that is. She thinks her app takes all the pressure off the man and creates a more relaxed, healthy dynamic. “He is most likely tired of reaching out blindly to women all the time,” she tells me. “Maybe he feels rejected. He feels ignored.” So having a woman contact him restores some balance. I doubted that a feature that simple could really make a difference. But these interactions — all of which were respectful — led me to actual dates: by the end of week one, I had gone on two with nice guys. Considering the year I spent on Tinder without ever meeting anyone in the flesh, this was progress."}, {"f722": "I quickly noticed there are fewer men on Bumble — it has around 1 million users compared to Tinder’s estimated 50 million— but they came across as less superficial, more human, and complex. Profiles ask you to include things like your job title and college. At a bar one night, a man tells me, “Everyone on Tinder is a robot, but on Bumble they feel like real people.”"}, {"6b12": "Wolfe founded Bumble a year after leaving Tinder, where she was a co-founder. She filed a discrimination and sexual harassment lawsuit against the company, in which she claimed she was unfairly demoted and finally pushed out by two male co-founders, one of whom she dated (not the one who doesn’t know what sodomy is). Though she is extremely limited legally in talking about her experience at Tinder — they have since settled out of court — I wonder if her negative experiences there inform her dating theories now. Perhaps as a hint of Bumble’s influence, last week Tinder announced that users could now include details on education and work."}, {"f144": "Bumble’s Instagram is obviously aimed at women."}, {"aecb": "If you are a male entrepreneur, approaching the problem of online dating from your point of view, the goal would be to provide male users with more women. Numbers show that a man’s chances of getting laid or even falling in love are hindered by the fact that there’s a supply and demand problem; there just aren’t enough women on dating sites to go around. I was recently horrified to watch a male friend just swiping right on everyone without even looking. But that’s what he needs to do to up his chances of getting a match. (According to the New York Times, men swipe right 46 percent of the time, compared to 14 percent for women.) Long before online dating existed, traditions like “Ladies Nights” at bars operated on the exact same premise."}, {"0c90": "This isn’t to say that all men approach online dating haphazardly, without goals or specific desires. But when it comes to technologists defining their use case, Shannon Ong, founder of The Catch, a still-in-beta app where “ladies can meet awesome gentlemen,” doesn’t mince words. “Men have problems getting dates,” she says. “So they create an app based on their own user problem.” Ong, like Wolfe, decided to design an app that prioritizes the experience of women. Women on The Catch invite men to answer questions they come up with, such as: If you could take a vacation anywhere, where would you go and why? If a guy gets 3 in a row selected as a woman’s favorite, he is deemed the winner and can proceed to messaging."}, {"ce74": "When three sisters launched the Coffee Meets Bagel app in 2012, which sends each member one match everyday at noon, the goal was to value quality over quantity. “We are curating you the right person,” says co-founder Dawoon Kang. “And because of that a lot of women find our brand and product appealing.” According to Kang, they were also the first in the space to pull profile information from Facebook, in part because safety is one of the primary concerns of women who online date. The Facebook API made signing up and finding second-degree connections easier, improving the quality of matches for all users. Perhaps more important, linking to an established social media profile strongly discourages catfishing and harassment."}, {"b6fd": "What happens when The League is loading."}, {"619d": "Now every dating app does something similar. Amanda Bradford’s The League, aimed at highly educated, career-oriented folks, requires a double verification through both Facebook and LinkedIn, to foster an exclusivity she hopes will create a community of like-minded people. Bradford says the League employs an application process that leans heavily on referrals in part to help weed out men who are intimidated by alpha females. “It wasn’t that I dreamt of being a dating app founder,” she says of launching the League. “I was frustrated with the current offerings and I had ideas of how I could make this work personally.” Bradford wanted to make sure she didn’t date a guy who wanted a housewife. Clearly, she’s not alone: The League is still in beta but has over 100,000 people on the waitlist."}, {"81f1": "Siren was initially built to allow female users the option of blurring their photos. They would know the men contacting them were showing interest based on their answers to questions of the day, like “what is your favorite Netflix binge?,” and those alone. The woman — who may be wary of revealing herself online because of past experiences — ultimately picks who gets to see her picture and interact with her. (After hearing from some male users, Siren decided to extend all men the same option, though Lee notes that only 20% of women opt to be seen by every user, compared to 80% of men). Uniquely, Siren captures some of the authenticity of a social network.“The person that you are on social media, it is definitely you,” says Susie Lee, who co-founded the company with Katrina Hess. “It’s hard to create a fake persona day after day.”"}, {"668b": "Emma Tessler knows personally that “dating sucks in a unique way” for women. She is now engaged, but it took her 116 online dates to get there. Users of Dating Ring, a paid service which she co-founded with Lauren Kay and Katie Bambino, receive matches and invitations to members-only parties. Most notably, they also must answer a series of prompts via the website, things like “do you want to have kids with a future partner?,” which helps their algorithm work in tandem with a real matchmaker to hook you up. By having real human women as the interlocutors, Dating Ring cultivates a a safe space for their users."}, {"d512": "The goal of the interview with a matchmaker is to figure out not just what someone is looking for, but the barriers — psychological or otherwise — preventing them from getting there. In my personal session, Tessler asks me to address head on why I’m single. She wants to know about my work hours, my family, and why I seem to be attracted to unavailable men. She is the opposite of a cold, impartial algorithm, and it can be unnerving. Tessler also wants feedback on every match: if her client isn’t into it, she needs to know why, so she can do better next time. “Screw the guy,” she says to one female client. “Our relationship is what really matters.” I thought about the conversation I had with Tessler all week. I didn’t meet a life partner via Dating Ring, but the positive experience started to change the way I approached my love life. And when I tell my friends about the babe I met on the flight out to San Francisco that Friday, I credit her."}, {"e8a4": "It is a weird sensation, trying out these apps and thinking “this was designed for someone like me.” There aren’t many tech products — or innovations more broadly — that cater to the user experience of women. Apple’s Health app, which tracks your health and fitness, for example, curiously didn’t include menstruation when it launched. And a groundbreaking artificial heart fits 86 percent of men but only 20 percent of women, because it is typically too big for women’s bodies."}, {"6af3": "Mandating that a woman talk first, or giving her control over revealing her image, may seem like small, inconsequential design choices. But they affect things as important as sex, love, marriage, procreation. While almost all new tech companies claim they are going to “change the world” in some way or another, dating apps actually might."}, {"513c": "It’s ridiculous to think that Tinder, or any dating site, is to blame for what Vanity Fair calls the “dating apocalypse” — a hookup culture that turns humanity into one large all-you-can eat buffet. But they do amplify existing human tendencies, and technology creators have a kind of ethical responsibility to interrogate what that means."}, {"1a9f": "Wolfe runs Bumble by a motto: “We can’t be good to our users, if we aren’t good to ourselves.” It’s a company, Wolfe says, where a predominately female staff “builds each other up.” Bumble would not let me visit their offices to check this out myself, but Wolfe maintains that Bumble’s office culture shines through in the product; it’s caused a “contagious complimentary ripple.” She thinks it’s why users of the app are nicer to each other."}, {"704d": "Of course, it’s not that simple. These apps won’t provide a silver bullet solution to the problem of dating and all the not-so-lovely things that come with it. These apps are still in early stages, only seeding in tech-rich pockets of the country. And as my own experiments with them show, they don’t always foster real connections."}, {"1e49": "But as users, we need to consistently think about how the ethos of founders shapes the products that define our society. In a talk delivered earlier this year, entrepreneur Anil Dash spoke about how apps define our culture. “Our values as people who create sites, create web apps, create mobile apps,” Dash continues, “our values define the defaults in those services.” In some way Uber is a reflection of Travis Kalanick, Tesla of Elon Musk, Facebook of Mark Zuckerberg, Medium of my boss Ev Williams."}, {"68e0": "I could go on and on, but it would be a struggle for me to think of even one female name to add to that list; after all, less than 5 percent of venture capital funding goes to women. But with these online dating innovations, the tech industry just might realize what they’ve long been ignoring: women’s experiences matter, too."}, {"d36c": "Collage illustrations by Eugenia Loli."}], "child": "597_1\t597_2\t597_3\t597_4\t597_5\t597_6\t597_7\t597_8\t597_9\t597_10\t597_11\t597_12\t597_13\t597_14\t597_15\t597_16\t597_17\t597_18\t597_19\t597_20\t597_21\t597_22\t597_23\t597_24"}