{"name": "598", "parent": "", "content": "Wand Wants to Turn Messages Into Action What if your apps could all talk to each other? What if you could let your loved ones borrow your services like you lend them your credit card? We’re about to find out. Wand was not supposed to be a messaging app. As Vishal Sharma, the founder and CEO of Wand Labs explains, the app tries to address a key problem in the mobile realm: the dizzying profusion of mobile apps, and the paralysis this engenders. Back when the desktop ruled, there was a single comprehensible hub that provided access to unlimited content and activities — the browser. People typically used it with several tabs open and painlessly shifted from one task to the next. “But the minute we went to mobile, the browser failed,” he says. Living in a browser world was like residing in a contiguous continent. But now we live in a land of a thousand islands — those apps we keep installing — and keep hopping from one to another. And good luck if you try to share what’s inside one of those apps — in many cases even if your recipient is using the same app, he or she can’t do what you can, because your stuff is (understandably) protected with a password. Sharma hopes to fix all that with Wand. It’s kind of an uber-app, a hub designed to let you can access the powers and data in your personal mobile universe — kind of a browser of the phone. The name Wand implies that you’ll use the product like a sorcerer’s baton. The biggest magic will come when you use Wand to share the powers of your apps with friends and contacts; you can grant them access to the apps and even the services you subscribe to, even if they don’t have those apps or services on their own devices. If you send a Spotify playlist to a friend, say, she could hear the songs through Rdio or YouTube. (No copyright issues, since the recipients are playing it back on the services they’re authorized to use.) You could even grant people temporary access to your Wi-Fi network, DropCam, or Twitter account — without sharing the password! Wand is still in private beta, but Sharma’s nine-person team will open it up to a broader audience later this year. What users will notice is that this new product — though originally conceived as a Siri-like personal assistant — looks, feels and operates like one of the messaging systems that they use all the time. Think Facebook Messenger, WhatsApp, Line, Snapchat, Slack or WeChat. Wand is entering this crowded field because messaging has suddenly become the dominant paradigm of the mobile world — the go-to place, just as the browser was in the desktop world. As one of the slides on the company’s pitch deck reads, “Messaging WILL eat the world.” Messaging is where the action is. And Wand hopes to transform messaging by making it actionable. Sharma’s resume is classic Silicon Valley. A bachelors degree from the Indian Institute of Technology, grad school in the US, a stint at McKinsey, jobs at big companies (Tandem, Sun) and startups (Ketera Systems), before the inevitable posting at Google, where IIT alumni include luminaries like search head Amit Singhal and CEO Sundar Pichai. Sharma joined in 2006. Early in Sharma’s tenure there, his uncle in India suffered a terrible accident that took his sight. Though Sharma was working in Google’s Ads organization, he was able to use his “20 percent” time (a benefit that, in theory at least, allows Googlers to work on projects of their choosing for one day a week) to devise “Jacob,” a voice-based digital assistant that would empower visually-impaired people. At the time, not all that much had been done with natural-language assistants on mobile phones. In one triumphant demo at Google’s Building 42, engineers were blown away when a tester asked Jacob about the weather, and the robot app asked him to specify the location before providing the accurate weather report. Still, Jacob was just one of countless obscure projects at Google whose coolness was not galvanizing the attention of higher-ups. That all changed in October 2011 when Apple introduced Siri. Google hastily set about developing its own conversational assistant, and Sharma was tapped as one of the leaders. Jacob’s technology helped in giving voice to the eventual product, Google Now. But Google Now diverged from Sharma’s vision — it focused on predicting what information people would want, as opposed to performing actions in the real world. “The vision was to do things, but we never built that,” says Sharma. In 2013, Sharma left his job and by the end of year was huddling with a small team (mostly brains drained from Google) to hash out a product that would fill what he saw as an increasing dysfunction in the mobile world. “We’ve taken a step back,” he says. “The wall on your iPhone and Android looks like MS Windows from years ago.” Every time you do something, he gripes, you have to install and then open one of those apps. Even worse, the information on those apps is not easily shared. You can’t cut and paste songs or contacts, or food dishes, from one app or service to another and expect it to behave in the same way. Wand addresses this problem by getting inside those apps, one by one, and decoding the information into a single format it can recognize. It does this by translating the information from all those weird formats into a single semantic language, a mobile-tech Rosetta Stone that tried to make everything interoperable with everything else. Once it completes the process, a virtual version of the app or service lives as a plug-in inside of Wand. Once you capture a song in Wand, you can use plug-ins to play it, look at lyrics, watch the video, or share it This accomplishment enables Wand to conduct some clever tricks, some of which I have been trying as the first journalist to get extended access to the app. (Wand itself came out of stealth with a demo at last May’s Code Conference.) Perhaps the clearest example comes from music apps. Using Wand, I was able to capture a song — “Kentucky Woman” — playing from a friend’s stereo via Wand’s Gracenote plug-in, even though I didn’t have the Gracenote app on my phone. From there, using other plug-ins already in the Wand universe, I could read the lyrics (Musixmatch), listen on Spotify, watch a music video of the song on YouTube, or buy it from Amazon. (There were other things in my testing that didn’t go so smoothly, but it is an early beta.) In the parlance of Wand, an individual item of meaning — a song, a contact, a recipe item, a movie — is called an atom. Wand understands what it is regardless of what app it sprang from and enables you to take actions with it. In the case of a movie, you can peruse the cast in IMBD, watch a trailer on YouTube, check out the review on Rotten Tomatoes, or arrange a ticket on Fandango. Most importantly, you can share. By separating the meaning of these atoms from the app itself, Wand allows you to send those atoms to others. (For instance, I sent “Kentucky Woman” to a friend with Wand — and she could then perform all those actions I mentioned.) It also allows you to share your use of an app or service with others, granting the authority for a time period of your choosing. For instance, you can let a guest use your Wi-Fi account without letting them know the password. You simply choose the service and send it to someone, like a parent lending a credit card to a teenager. Only it’s easier to get it back. For instance, I bestowed access to my Twitter account to my colleague, allowing her to post as if it was me. Fortunately she did not post a politically incorrect tweet that ended my career, but a more benign link to a Medium post she’d edited. (Just to be sure, I quickly revoked her access afterward.) Currently there are about thirty plug-ins that work with Wand, with the expectation of many more to come. (A glaring omission so far are financial apps like Square, Stripe or PayPal, but Sharma assures me that’s on the road map.) One I did not test was the Phillips Hue light bulb, as my lamps have yet to join the Internet. But it is obvious that the Wand app seems custom-made to tame what is already a complicated pile-up of digital gadgets on the so-called Internet of Things. It is universally recognized that so far the profusion of digitally connected applicances — a veritable Burgess Shale of objects — generally don’t talk to each other. Wand promises to get inside all of them and make them speak the same language. Wand wants to give you the authority to share anything that you have access to — when you want and with whom you want, without revealing your password or compromising your security. “We are looking at the Facebook of Things,” says Sharma. “When I’m sharing something with you, I’m friending your lights!” Something weird happened as Sharma and his team set about to implement their semantic breakdown of the app world’s Tower of Babel. Originally, Sharma’s concept was to order its actions in a stream, or feed, format. This was not a surprising choice since for several years the stream has been the dominant interface for top apps. (Examples include Twitter, the Facebook News Feed, and even the Yahoo Home Page, which got a bump in viewer response after switching to a feed in 2013.) But once the Wand team realized that users needed some feedback when they shared their apps and services with someone (if only to acknowledge receipt), the door was opened for interaction. It started with simple thank you’s and grew to denser sharing and, eventually, bursts of personal chatter. Much in the way that complex systems are drawn to strange attractors, Wand’s engineers, dogfooding the test app, began to adopt what has lately become the most popular means of accessing one’s digital world — messaging. “It’s like writing a novel,” says Sharma. “After you create a character, he or she wants to be something different. Originally we resisted it. But the product refused to be comprehensible until it became messaging.” A Wand message stream where one party gives someone access to his wi-fi and thermostat — and sends a song. While messaging makes Wand instantly compelling, Wand’s adoption of that paradigm also creates a massive obstacle. A messaging system works only if the people you want to message with are also on the service. While it’s the most friction-less thing in the world to give someone wi-fi access or an Uber ride if you are both Wand-erers (I officially make that a term), the friction is unbearable if one of you has to sign up at the moment the exchange must happen. Just look at Facebook to get a sense of how tough it can be to overcome that hurdle. In order to get critical mass for its messenger app, even the mighty Facebook had to clobber its users with a UX mace, denying them a key function of its flagship app until they got on their knees and downloaded the communications app. Obviously, Wand does not wield such coersive powers. But Sharma says that may not matter. Though he emphasizes that he wants Wand itself to be people’s go-to app, he also is speaking to other messaging companies about licensing the Wand technology. (He’s also turned down a few offers to sell his company.) Maybe, he muses, the Wand app will be the equivalent of what Google’s Nexus phones are to the Android system: a role-model made by the creator of a wider system. In this premise, Wand can show off its newest innovations and implement best practices on its own app. Meanwhile you might find its tech in products like Facebook Messenger, or Google Now, or even the as-yet unreleased personal assistant Viv, created by the co-founders of Siri. Like it or not, says Sharma, if those services want to perform Wand-like baton-waving — like giving password-free temporary access to Twitter or a Nest thermostat — they will have to come to Wand. Just last month Sharma and one of his ex-Google co-founders Elhum Amjadi were granted a patent on a “virtual assistant to remotely control external devices and selectively share control.” Another patent covers its semantic integration, the technology that enables it to allow all those apps to interact inside Wand. Sharma claims that its patents are broad enough to reserve all Wand’s tricks for itself. That’s a lot of ambition for a small company currently funded by $3.5 million in venture money from Lightspeed, InterWest and Khosla Ventures. “When we use other messaging applications now, they feel watery and weak to us,” says Sharma. “We want to bring all of life’s actions inside of messaging.” At least until the next paradigm comes around. Photos by Tim Hussin Follow Backchannel: Twitter | Facebook ", "title": "Wand Wants to Turn Messages Into Action", "sentences": [{"0bf7": "Wand Wants to Turn Messages Into Action"}, {"2997": "What if your apps could all talk to each other? What if you could let your loved ones borrow your services like you lend them your credit card? We’re about to find out."}, {"89b4": "Wand was not supposed to be a messaging app."}, {"ad6e": "As Vishal Sharma, the founder and CEO of Wand Labs explains, the app tries to address a key problem in the mobile realm: the dizzying profusion of mobile apps, and the paralysis this engenders. Back when the desktop ruled, there was a single comprehensible hub that provided access to unlimited content and activities — the browser. People typically used it with several tabs open and painlessly shifted from one task to the next. “But the minute we went to mobile, the browser failed,” he says. Living in a browser world was like residing in a contiguous continent. But now we live in a land of a thousand islands — those apps we keep installing — and keep hopping from one to another. And good luck if you try to share what’s inside one of those apps — in many cases even if your recipient is using the same app, he or she can’t do what you can, because your stuff is (understandably) protected with a password."}, {"4865": "Sharma hopes to fix all that with Wand. It’s kind of an uber-app, a hub designed to let you can access the powers and data in your personal mobile universe — kind of a browser of the phone. The name Wand implies that you’ll use the product like a sorcerer’s baton. The biggest magic will come when you use Wand to share the powers of your apps with friends and contacts; you can grant them access to the apps and even the services you subscribe to, even if they don’t have those apps or services on their own devices. If you send a Spotify playlist to a friend, say, she could hear the songs through Rdio or YouTube. (No copyright issues, since the recipients are playing it back on the services they’re authorized to use.) You could even grant people temporary access to your Wi-Fi network, DropCam, or Twitter account — without sharing the password!"}, {"30bc": "Wand is still in private beta, but Sharma’s nine-person team will open it up to a broader audience later this year. What users will notice is that this new product — though originally conceived as a Siri-like personal assistant — looks, feels and operates like one of the messaging systems that they use all the time. Think Facebook Messenger, WhatsApp, Line, Snapchat, Slack or WeChat."}, {"7c46": "Wand is entering this crowded field because messaging has suddenly become the dominant paradigm of the mobile world — the go-to place, just as the browser was in the desktop world. As one of the slides on the company’s pitch deck reads, “Messaging WILL eat the world.” Messaging is where the action is. And Wand hopes to transform messaging by making it actionable."}, {"6ebf": "Sharma’s resume is classic Silicon Valley. A bachelors degree from the Indian Institute of Technology, grad school in the US, a stint at McKinsey, jobs at big companies (Tandem, Sun) and startups (Ketera Systems), before the inevitable posting at Google, where IIT alumni include luminaries like search head Amit Singhal and CEO Sundar Pichai. Sharma joined in 2006."}, {"9d1a": "Early in Sharma’s tenure there, his uncle in India suffered a terrible accident that took his sight. Though Sharma was working in Google’s Ads organization, he was able to use his “20 percent” time (a benefit that, in theory at least, allows Googlers to work on projects of their choosing for one day a week) to devise “Jacob,” a voice-based digital assistant that would empower visually-impaired people. At the time, not all that much had been done with natural-language assistants on mobile phones. In one triumphant demo at Google’s Building 42, engineers were blown away when a tester asked Jacob about the weather, and the robot app asked him to specify the location before providing the accurate weather report. Still, Jacob was just one of countless obscure projects at Google whose coolness was not galvanizing the attention of higher-ups."}, {"9ebe": "That all changed in October 2011 when Apple introduced Siri. Google hastily set about developing its own conversational assistant, and Sharma was tapped as one of the leaders. Jacob’s technology helped in giving voice to the eventual product, Google Now. But Google Now diverged from Sharma’s vision — it focused on predicting what information people would want, as opposed to performing actions in the real world. “The vision was to do things, but we never built that,” says Sharma."}, {"ca33": "In 2013, Sharma left his job and by the end of year was huddling with a small team (mostly brains drained from Google) to hash out a product that would fill what he saw as an increasing dysfunction in the mobile world."}, {"b141": "“We’ve taken a step back,” he says. “The wall on your iPhone and Android looks like MS Windows from years ago.” Every time you do something, he gripes, you have to install and then open one of those apps. Even worse, the information on those apps is not easily shared. You can’t cut and paste songs or contacts, or food dishes, from one app or service to another and expect it to behave in the same way."}, {"fe80": "Wand addresses this problem by getting inside those apps, one by one, and decoding the information into a single format it can recognize. It does this by translating the information from all those weird formats into a single semantic language, a mobile-tech Rosetta Stone that tried to make everything interoperable with everything else. Once it completes the process, a virtual version of the app or service lives as a plug-in inside of Wand."}, {"5951": "Once you capture a song in Wand, you can use plug-ins to play it, look at lyrics, watch the video, or share it"}, {"4980": "This accomplishment enables Wand to conduct some clever tricks, some of which I have been trying as the first journalist to get extended access to the app. (Wand itself came out of stealth with a demo at last May’s Code Conference.) Perhaps the clearest example comes from music apps. Using Wand, I was able to capture a song — “Kentucky Woman” — playing from a friend’s stereo via Wand’s Gracenote plug-in, even though I didn’t have the Gracenote app on my phone. From there, using other plug-ins already in the Wand universe, I could read the lyrics (Musixmatch), listen on Spotify, watch a music video of the song on YouTube, or buy it from Amazon. (There were other things in my testing that didn’t go so smoothly, but it is an early beta.)"}, {"b79e": "In the parlance of Wand, an individual item of meaning — a song, a contact, a recipe item, a movie — is called an atom. Wand understands what it is regardless of what app it sprang from and enables you to take actions with it. In the case of a movie, you can peruse the cast in IMBD, watch a trailer on YouTube, check out the review on Rotten Tomatoes, or arrange a ticket on Fandango."}, {"d0d2": "Most importantly, you can share. By separating the meaning of these atoms from the app itself, Wand allows you to send those atoms to others. (For instance, I sent “Kentucky Woman” to a friend with Wand — and she could then perform all those actions I mentioned.) It also allows you to share your use of an app or service with others, granting the authority for a time period of your choosing. For instance, you can let a guest use your Wi-Fi account without letting them know the password. You simply choose the service and send it to someone, like a parent lending a credit card to a teenager. Only it’s easier to get it back."}, {"2fa1": "For instance, I bestowed access to my Twitter account to my colleague, allowing her to post as if it was me. Fortunately she did not post a politically incorrect tweet that ended my career, but a more benign link to a Medium post she’d edited. (Just to be sure, I quickly revoked her access afterward.)"}, {"d9f9": "Currently there are about thirty plug-ins that work with Wand, with the expectation of many more to come. (A glaring omission so far are financial apps like Square, Stripe or PayPal, but Sharma assures me that’s on the road map.) One I did not test was the Phillips Hue light bulb, as my lamps have yet to join the Internet. But it is obvious that the Wand app seems custom-made to tame what is already a complicated pile-up of digital gadgets on the so-called Internet of Things. It is universally recognized that so far the profusion of digitally connected applicances — a veritable Burgess Shale of objects — generally don’t talk to each other. Wand promises to get inside all of them and make them speak the same language. Wand wants to give you the authority to share anything that you have access to — when you want and with whom you want, without revealing your password or compromising your security."}, {"57c6": "“We are looking at the Facebook of Things,” says Sharma. “When I’m sharing something with you, I’m friending your lights!”"}, {"5ef1": "Something weird happened as Sharma and his team set about to implement their semantic breakdown of the app world’s Tower of Babel. Originally, Sharma’s concept was to order its actions in a stream, or feed, format. This was not a surprising choice since for several years the stream has been the dominant interface for top apps. (Examples include Twitter, the Facebook News Feed, and even the Yahoo Home Page, which got a bump in viewer response after switching to a feed in 2013.) But once the Wand team realized that users needed some feedback when they shared their apps and services with someone (if only to acknowledge receipt), the door was opened for interaction. It started with simple thank you’s and grew to denser sharing and, eventually, bursts of personal chatter. Much in the way that complex systems are drawn to strange attractors, Wand’s engineers, dogfooding the test app, began to adopt what has lately become the most popular means of accessing one’s digital world — messaging."}, {"52cf": "“It’s like writing a novel,” says Sharma. “After you create a character, he or she wants to be something different. Originally we resisted it. But the product refused to be comprehensible until it became messaging.”"}, {"ed1e": "A Wand message stream where one party gives someone access to his wi-fi and thermostat — and sends a song."}, {"3020": "While messaging makes Wand instantly compelling, Wand’s adoption of that paradigm also creates a massive obstacle. A messaging system works only if the people you want to message with are also on the service. While it’s the most friction-less thing in the world to give someone wi-fi access or an Uber ride if you are both Wand-erers (I officially make that a term), the friction is unbearable if one of you has to sign up at the moment the exchange must happen. Just look at Facebook to get a sense of how tough it can be to overcome that hurdle. In order to get critical mass for its messenger app, even the mighty Facebook had to clobber its users with a UX mace, denying them a key function of its flagship app until they got on their knees and downloaded the communications app. Obviously, Wand does not wield such coersive powers."}, {"16e1": "But Sharma says that may not matter. Though he emphasizes that he wants Wand itself to be people’s go-to app, he also is speaking to other messaging companies about licensing the Wand technology. (He’s also turned down a few offers to sell his company.) Maybe, he muses, the Wand app will be the equivalent of what Google’s Nexus phones are to the Android system: a role-model made by the creator of a wider system. In this premise, Wand can show off its newest innovations and implement best practices on its own app. Meanwhile you might find its tech in products like Facebook Messenger, or Google Now, or even the as-yet unreleased personal assistant Viv, created by the co-founders of Siri."}, {"ce1d": "Like it or not, says Sharma, if those services want to perform Wand-like baton-waving — like giving password-free temporary access to Twitter or a Nest thermostat — they will have to come to Wand. Just last month Sharma and one of his ex-Google co-founders Elhum Amjadi were granted a patent on a “virtual assistant to remotely control external devices and selectively share control.” Another patent covers its semantic integration, the technology that enables it to allow all those apps to interact inside Wand. Sharma claims that its patents are broad enough to reserve all Wand’s tricks for itself."}, {"b391": "That’s a lot of ambition for a small company currently funded by $3.5 million in venture money from Lightspeed, InterWest and Khosla Ventures. “When we use other messaging applications now, they feel watery and weak to us,” says Sharma. “We want to bring all of life’s actions inside of messaging.”"}, {"5a1b": "At least until the next paradigm comes around."}, {"3b7b": "Photos by Tim Hussin"}, {"833b": "Follow Backchannel: Twitter | Facebook"}], "child": "598_1\t598_2"}