{"sentences": [{"e65b": "To body positive friends who don’t wear plus sizes."}, {"7a6c": "Image via tumblr"}, {"b96b": "I’ll never forget the way I first heard of your mother. A mutual friend told me about your wedding day: how happy you looked, the way the ceremony shook and shone with joy for you and your partner. At the reception, he overheard your mother, talking to you."}, {"58d7": "“Well, we can’t all reach goal weight for the big day, can we?”"}, {"0fc2": "He watched your face fall, drained of its color. You forced a smile and figured out how to slip away. You didn’t return to her after that."}, {"ffc5": "I know how much it hurts to feel that constant pressure, especially from the ones you love most. The friends, the aunts, the exes. The pressure to lose weight before the wedding, before the summer, after the baby, after the holidays. The impossibility of those last 5, 10, 20 pounds. The ways in which your body is always slightly wrong, its ideal self perpetually just out of reach."}, {"e4c7": "The inescapability of friends talking about how much they hate their arms, bellies, thighs; friends looking for diet buddies; friends frowning at their reflections in dressing room mirrors; friends looking for diet buddies, even when those diets masquerade as cleanses or detoxes. The insidious closeness that comes with bonding over hating your bodies. It must be so much for you to bear."}, {"ef5e": "And you don’t just bear it — none of us do. We become it. It takes you over, a virus that infects the way you see yourself, then the way you see those around you. Even the ones you love most. The ease with which it slips into your bloodstream, latches onto you, seeps into the ways you see your friends, your family, strangers on the street."}, {"1b7a": "The moments when you catch yourself thinking she shouldn’t be wearing that about an older woman in a sleeveless top, or who wants to see that? about a fat man at the beach. How easily you forget how much it hurts to be on the receiving end of looks like the one you must be giving right now. How hard it is to stop those thoughts, even when you want to. Even when you try."}, {"2a43": "It means so much to be able to talk about all of this with you. You and I are breaking a silence together, speaking for the first time about the ways in which both of us are shamed, hurt, pressured, all because of the shape of our skin. All because of the space we occupy. We’re describing our experiences aloud and seeing them anew."}, {"4792": "We’re throwing off what we’ve been told our bodies mean and must be. And that means taking on the sisyphean task of training ourselves to think differently about our bodies, what they’re capable of, and the lives we can lead now, whether we lose weight or not. We’re no longer just envisioning a bright world of beach vacations, good sex, happiness or success that will come fifteen pounds down the line — we’re pursuing all of it. Because our lives are happening now, and what are we waiting for?"}, {"4881": "Doing all of that means building a different relationship between you and I. We can no longer relate over the desolation and loneliness we believe our bodies prophesy. We can no longer return to the comfortable small-talk of hating where our skin falls, whether it is convex and concave in the right places."}, {"d905": "Our relationship now must be borne of the intimacy that only comes from building our strength together; from the vulnerability that only comes from finding our weaknesses in the process. It must be borne of a candid, precise assessment of what our bodies invite, and what treatment we’re subjected to."}, {"df7b": "As a person who wears straight sizes, you know the obsessive focus on specific parts of your body, the way your friends’ eyes may linger on your hips after you’ve put on five pounds, the uninvited comments from your mother or aunt. You know what it’s like to be perched so precariously near a more ideal body, always just out of reach. Always afraid of toppling down further."}, {"fb99": "But when you and I talk about our bodies, there will be a point where you no longer see yourself reflected in my experiences. Maybe it is the point at which fat stops being a weaponized insult, an omen of a sad and frightening future — the point at which plus size people use it as a liberating statement of fact. Maybe it is the point at which another plus sized friend tells you how frankly her work friends tell her you’ll never find a man looking like that. Or maybe it’s hearing a fat friend tell you about how a stranger approached him in the produce section, lecturing him about the sugar content in mangos. Maybe an acquaintance will sigh about how hard it is to find clothing, and will try to explain to you that some garments simply aren’t made in her size 18 silhouette. These experiences may seem implausible to you, hovering on the edge of reason."}, {"f762": "Then you will start to hear about experiences that are fully unthinkable. A very fat friend may tell you about a flight attendant who refused to seat him on her flight, then refused a refund for an unused ticket. He will tell you how other passengers watched in silence, and let it happen. Another extended plus friend might tell you how she was denied a service job, because she couldn’t pass the weekly weigh-ins. You will ask if she’s thought of taking legal action. She will answer what’s the point? and she’ll be right. There is no legal precedent to protect her."}, {"cc96": "A very fat friend may tell you about the day strangers mooed at her from a passing car, throwing trash at her feet. She felt relieved they didn’t hit her face or work uniform. You may be the only person she’s told, for fear she wouldn’t be believed."}, {"333c": "She may tell you about the parade of acquaintances who abandon backhanded compliments and polite slights, instead comfortably telling her she’s going to die. You’re going to get diabetes, and it’ll be your own damn fault. Are you really okay with that? What will that do to your family? She has become accustomed to passersby foretelling her death."}, {"151a": "You may hear a fat colleague talk about a doctor telling him to stop shoving food in your face long enough to pay attention. This may seem impossibly harsh, especially coming from a professional whose first commitment is to do no harm. It may not make sense to you. It doesn’t make sense to him, either. But that doesn’t mean it didn’t happen."}, {"4a53": "It may not make sense to you. It doesn’t make sense to him, either. But that doesn’t mean it didn’t happen."}, {"2ac5": "Do not buckle under the weight of your own discomfort. Stay in the conversation, even when my experiences seem impossible to you. Sit with it. You may not be able to imagine a doctor saying something so callous and cruel to a patient he’s entrusted to treat, or a business owner going through a hiring process. You may think that can’t be true. He must have heard it wrong. She’s just being oversensitive."}, {"48f3": "You’re right: these remarks are so deeply unkind that it’s hard to imagine why someone would think it’s okay to say. But fat people are seeing things you can’t yet — things that only happen in the presence of bodies like ours. And when you insist our experiences can’t be true, even in your goodhearted disbelief, it reminds us that our experiences aren’t to be spoken, because they can’t be heard. They won’t be met with support or solidarity, won’t be acted upon. They will be brushed aside, as we often are. They will be ignored, dead-eyed, like so many bystanders watching our wide bodies as we are escorted from the plane."}, {"2d79": "Do not reject your fat friend’s experiences out of hand because of a lack of context. Instead, find the context. Look harder. Sharpen your vision. Listen closely. Learn to see fat shaming everywhere, because it is. Stand up to fat shaming wherever you see it, not just if it’s aimed at thin people, or people who are fat for a reason you know and have learned to find acceptable."}, {"01d2": "Do not succumb to the virus that tells you what to do with bodies like mine — to correct us, to steer the conversation back to what you know, what you experience, what you’ve heard before. Listening is that virus’s only antidote."}, {"9956": "Redouble your commitment to stop talking about how much you hate your body. We’re all conditioned to hate our bodies. I know it hurts. Learn to be kinder to yourself. Learn to get out from underneath the ways you’ve been taught to hate fat people by hating yourself."}, {"7b35": "Remember that your perception of your own body is shaped by a culture that hates fat wherever it appears. There is no telling a fatter friend that I hate the way I look, but it’s fine for you. There is no safe haven of hating your body that doesn’t also rely on logic that marginalizes mine. If you hate the fat on your body, that will color your perception of mine. Like any virus, you do not get to decide that you are resistant. You do not get to decide whether it is communicable. Do not transmit the virus back to your fat friend."}, {"3e8d": "I know that it is hard to live in your body. It is also hard to live in mine. Our bodies exist in the same system, but they are received differently. Where you are sold gym memberships to get a “beach body,” I am rejected from the gym and beach alike — too fat to exercise, too fat to be seen. Where your self confidence is undercut by snide remarks and airbrushed beauty standards, my daily experiences are shaped by overt comments on my body, health, attractiveness, character, and mortality. Those comments may come from nearly anyone I meet."}, {"d88e": "The pressures you face intensify, distill and warp when faced with unwieldy bodies like mine. My problem isn’t one of body image, a lack of self confidence, or a lack of self esteem. My problems aren’t a result of how I see myself — they’re a result of how others see me, and can’t hear me."}, {"bd11": "I need you to hear me."}, {"2362": "Like this piece? There are more like it, including “Sweetie, No!: the Heartbreak of ‘You’re Not Fat’” and “On your concern for your fat friend’s health.” You can also support Your Fat Friend on Patreon."}], "content": "To body positive friends who don’t wear plus sizes. Image via tumblr I’ll never forget the way I first heard of your mother. A mutual friend told me about your wedding day: how happy you looked, the way the ceremony shook and shone with joy for you and your partner. At the reception, he overheard your mother, talking to you. “Well, we can’t all reach goal weight for the big day, can we?” He watched your face fall, drained of its color. You forced a smile and figured out how to slip away. You didn’t return to her after that. I know how much it hurts to feel that constant pressure, especially from the ones you love most. The friends, the aunts, the exes. The pressure to lose weight before the wedding, before the summer, after the baby, after the holidays. The impossibility of those last 5, 10, 20 pounds. The ways in which your body is always slightly wrong, its ideal self perpetually just out of reach. The inescapability of friends talking about how much they hate their arms, bellies, thighs; friends looking for diet buddies; friends frowning at their reflections in dressing room mirrors; friends looking for diet buddies, even when those diets masquerade as cleanses or detoxes. The insidious closeness that comes with bonding over hating your bodies. It must be so much for you to bear. And you don’t just bear it — none of us do. We become it. It takes you over, a virus that infects the way you see yourself, then the way you see those around you. Even the ones you love most. The ease with which it slips into your bloodstream, latches onto you, seeps into the ways you see your friends, your family, strangers on the street. The moments when you catch yourself thinking she shouldn’t be wearing that about an older woman in a sleeveless top, or who wants to see that? about a fat man at the beach. How easily you forget how much it hurts to be on the receiving end of looks like the one you must be giving right now. How hard it is to stop those thoughts, even when you want to. Even when you try. It means so much to be able to talk about all of this with you. You and I are breaking a silence together, speaking for the first time about the ways in which both of us are shamed, hurt, pressured, all because of the shape of our skin. All because of the space we occupy. We’re describing our experiences aloud and seeing them anew. We’re throwing off what we’ve been told our bodies mean and must be. And that means taking on the sisyphean task of training ourselves to think differently about our bodies, what they’re capable of, and the lives we can lead now, whether we lose weight or not. We’re no longer just envisioning a bright world of beach vacations, good sex, happiness or success that will come fifteen pounds down the line — we’re pursuing all of it. Because our lives are happening now, and what are we waiting for? Doing all of that means building a different relationship between you and I. We can no longer relate over the desolation and loneliness we believe our bodies prophesy. We can no longer return to the comfortable small-talk of hating where our skin falls, whether it is convex and concave in the right places. Our relationship now must be borne of the intimacy that only comes from building our strength together; from the vulnerability that only comes from finding our weaknesses in the process. It must be borne of a candid, precise assessment of what our bodies invite, and what treatment we’re subjected to. As a person who wears straight sizes, you know the obsessive focus on specific parts of your body, the way your friends’ eyes may linger on your hips after you’ve put on five pounds, the uninvited comments from your mother or aunt. You know what it’s like to be perched so precariously near a more ideal body, always just out of reach. Always afraid of toppling down further. But when you and I talk about our bodies, there will be a point where you no longer see yourself reflected in my experiences. Maybe it is the point at which fat stops being a weaponized insult, an omen of a sad and frightening future — the point at which plus size people use it as a liberating statement of fact. Maybe it is the point at which another plus sized friend tells you how frankly her work friends tell her you’ll never find a man looking like that. Or maybe it’s hearing a fat friend tell you about how a stranger approached him in the produce section, lecturing him about the sugar content in mangos. Maybe an acquaintance will sigh about how hard it is to find clothing, and will try to explain to you that some garments simply aren’t made in her size 18 silhouette. These experiences may seem implausible to you, hovering on the edge of reason. Then you will start to hear about experiences that are fully unthinkable. A very fat friend may tell you about a flight attendant who refused to seat him on her flight, then refused a refund for an unused ticket. He will tell you how other passengers watched in silence, and let it happen. Another extended plus friend might tell you how she was denied a service job, because she couldn’t pass the weekly weigh-ins. You will ask if she’s thought of taking legal action. She will answer what’s the point? and she’ll be right. There is no legal precedent to protect her. A very fat friend may tell you about the day strangers mooed at her from a passing car, throwing trash at her feet. She felt relieved they didn’t hit her face or work uniform. You may be the only person she’s told, for fear she wouldn’t be believed. She may tell you about the parade of acquaintances who abandon backhanded compliments and polite slights, instead comfortably telling her she’s going to die. You’re going to get diabetes, and it’ll be your own damn fault. Are you really okay with that? What will that do to your family? She has become accustomed to passersby foretelling her death. You may hear a fat colleague talk about a doctor telling him to stop shoving food in your face long enough to pay attention. This may seem impossibly harsh, especially coming from a professional whose first commitment is to do no harm. It may not make sense to you. It doesn’t make sense to him, either. But that doesn’t mean it didn’t happen. It may not make sense to you. It doesn’t make sense to him, either. But that doesn’t mean it didn’t happen. Do not buckle under the weight of your own discomfort. Stay in the conversation, even when my experiences seem impossible to you. Sit with it. You may not be able to imagine a doctor saying something so callous and cruel to a patient he’s entrusted to treat, or a business owner going through a hiring process. You may think that can’t be true. He must have heard it wrong. She’s just being oversensitive. You’re right: these remarks are so deeply unkind that it’s hard to imagine why someone would think it’s okay to say. But fat people are seeing things you can’t yet — things that only happen in the presence of bodies like ours. And when you insist our experiences can’t be true, even in your goodhearted disbelief, it reminds us that our experiences aren’t to be spoken, because they can’t be heard. They won’t be met with support or solidarity, won’t be acted upon. They will be brushed aside, as we often are. They will be ignored, dead-eyed, like so many bystanders watching our wide bodies as we are escorted from the plane. Do not reject your fat friend’s experiences out of hand because of a lack of context. Instead, find the context. Look harder. Sharpen your vision. Listen closely. Learn to see fat shaming everywhere, because it is. Stand up to fat shaming wherever you see it, not just if it’s aimed at thin people, or people who are fat for a reason you know and have learned to find acceptable. Do not succumb to the virus that tells you what to do with bodies like mine — to correct us, to steer the conversation back to what you know, what you experience, what you’ve heard before. Listening is that virus’s only antidote. Redouble your commitment to stop talking about how much you hate your body. We’re all conditioned to hate our bodies. I know it hurts. Learn to be kinder to yourself. Learn to get out from underneath the ways you’ve been taught to hate fat people by hating yourself. Remember that your perception of your own body is shaped by a culture that hates fat wherever it appears. There is no telling a fatter friend that I hate the way I look, but it’s fine for you. There is no safe haven of hating your body that doesn’t also rely on logic that marginalizes mine. If you hate the fat on your body, that will color your perception of mine. Like any virus, you do not get to decide that you are resistant. You do not get to decide whether it is communicable. Do not transmit the virus back to your fat friend. I know that it is hard to live in your body. It is also hard to live in mine. Our bodies exist in the same system, but they are received differently. Where you are sold gym memberships to get a “beach body,” I am rejected from the gym and beach alike — too fat to exercise, too fat to be seen. Where your self confidence is undercut by snide remarks and airbrushed beauty standards, my daily experiences are shaped by overt comments on my body, health, attractiveness, character, and mortality. Those comments may come from nearly anyone I meet. The pressures you face intensify, distill and warp when faced with unwieldy bodies like mine. My problem isn’t one of body image, a lack of self confidence, or a lack of self esteem. My problems aren’t a result of how I see myself — they’re a result of how others see me, and can’t hear me. I need you to hear me. Like this piece? There are more like it, including “Sweetie, No!: the Heartbreak of ‘You’re Not Fat’” and “On your concern for your fat friend’s health.” You can also support Your Fat Friend on Patreon. ", "parent": "", "title": "To body positive friends who don’t wear plus sizes.", "child": "6_1\t6_2\t6_3\t6_4\t6_5\t6_6\t6_7\t6_8\t6_9\t6_10\t6_11\t6_12\t6_13\t6_14\t6_15\t6_16\t6_17\t6_18\t6_19\t6_20\t6_21\t6_22\t6_23\t6_24\t6_25", "name": "6"}