{"name": "601", "parent": "", "content": "My Co-Founder Kicked Me Out, and I Couldn’t Be Happier I needed our partnership to fail before I could discover my new company. It never gets easier. You get an idea. You get excited. You do market research and validate your instinct. You suss out co-founders. You build a prototype, get traction, and raise money to scale by hiring the best people. Then shit happens. Your hypothesis is wrong. You’re burning money. You lay off your staff. You get emotional. Your investors get cold with you. And fear creeps in. I came to Silicon Valley in 2011, after graduating from the University of Southern California in Los Angeles. After a brief stint at MySpace, I got a job as a product engineer at a hot startup, BranchOut—an app for recruiting employees through Facebook. Quickly, I was hooked: I saw how companies could move quickly, and iterate fast. I saw the depth of impact that a founder can have. At BranchOut, I was the youngest hire and the only new grad. I knew many smarter recent grads who went to work for bigger companies with recognizable names. I noticed a discovery problem and wanted to fix it. So, as a side project, I built a simple tool to help recent college grads apply for jobs at startups. In 2013, I used my connections at USC and launched it to computer science students there. Over launch weekend, 300 people signed up. By the end of that year, five startups had used the service to recruit dozens of grads. Because I’m an immigrant from India, my hurdles to entrepreneurship were magnified. My work visa required that I remain a full time employee at BranchOut, so I couldn’t quit and start my own company. My only choice was to work in the off-hours, hoping to gain more traction, raise funding, and transfer the visa. Then an acquaintance at USC showed interest in the project. He’d helped me with strategy and wanted to join as a co-founder. Because we had a good relationship, I gave him a 40 percent stake in the company before we pushed ourselves to raise funds. By February of 2015, we’d secured a seed investment and formally named the company Meed. I was thrilled and immediately started shifting my visa so I could quit my job at BranchOut. Then came a coup. In the final stages of closing the round, my co-founder said he couldn’t join Meed full time for at least six months, until stock from his job at Google had vested. I saw it as a red flag, and it put me in a tricky situation: I wanted to fire him but was worried about losing the investment. (In retrospect, if it were not for my visa, I would have fired him.) Instead, I focused on building out a great team. Around this time, I decided to tweak Meed, building a professional network around different majors that was separate from the jobs we were offering. That way, we could capture more than just the college students actively seeking full-time jobs: We also invited ‘influencers’ to interact with students via AMAs, tips, suggestions, and stories. We grew from 1,500 to 80,000 users in just five months. This produced good engagement, so we expanded the model to allow the influencers to create paid learning groups with premium content, advice, and networking. (Justin Kan’s Whale app, released last month, has a similar model.) I took the help of remote freelancers, interns, and the rest of the team to release the paid feature by July 4th. At the time, LinkedIn had just been acquired, so investors were skeptical about the professional networking space. But we hustled and had interest from VCs. Then came the final jolt. Right before the release, my co-founder leveraged his shares and sided with the stakeholders to take over the company and push me out of leadership. I pleaded with him to wait until we released the new product, but it didn’t work. By the end of July, I had quit the company I started two years earlier. My regret? I didn’t fire my co-founder before he could fire me. It sounds mean, but it’s true. A month later the new CEO laid everyone off. Three months later the company shut down. One wrong decision—picking a bad partner—destroyed my business. My visa situation turbo-loaded my drive. I had to find a different company to work for or leave the country. People advised me to get a job offer, to be safe. But I couldn’t accept a new job; I wanted to be a full-time entrepreneur. By August I was ready to start from scratch—this time, addressing some of the critical problems involved in starting a company. At Meed, I had to hire contractors to get our social networking product off the ground. It would cost about $50,000 to hire locals for design, engineering, and testing, and to release a simple minimum viable product. It was a big cost and I wanted to figure out how to bring it down for the subsequent iterations, as startups iterate a lot on the base product. I used marketplaces like Upwork and 99Designs to outsource, but it took a lot of time to find the right people. Because these platforms are open, quality wasn’t vetted and varied. I got lucky in finding good, talented people to work with. They worked for $20,000 per year. When I started out I assumed that you had to build the best product with as much money as you could raise. It was like building a house by going to Home Depot, contracting Frank Lloyd Wright and Bob Vila, and buying all the best power tools and five hundred tons of marble, wood, and bricks. Then you and your dream team could start on the biggest mansion possible, as quickly as possible. But that’s not how it really works. On day one, Frank quits out of frustration and Bob gets a better offer from HGTV. You’re left with a half-finished mansion and dumpsters full of unused materials. The new hires had increased our productivity rate. I thought that founders with some cash and an idea should be able to find these kinds of freelancers easily, to help build their companies in their early stages. But most startups don’t trust the quality low-cost freelancers, especially when they’re looking for engineers, designers, or creative writers. The reason is that there’s no easy way to find the right kind of freelance talent. That was the moment for my new idea. I partnered with my ex-colleague Gregory Wisenberg, who had run growth and partnerships at Meed. He loved the idea of distributing work to the qualified, on-demand talent. Because I’d been burned in my last project, I waited before making him a co-founder. I had learned that the co-founder relationship is critical. Even if you’ve had a good relationship in the past, a new situation can trigger a change in behavior. Every idea is different, and people’s passions fluctuate. We started with our friends and family, connecting them to the vetted group of freelancers that we’d amassed. We charged a 25 percent margin on each task or project. At first, we did a lot of things manually, to receive consistent feedback from our customers. Then we developed a simple AI interface, to dispatch the work to the right talent. We named the new company Kriya AI, an on-demand workforce for engineering, sales, marketing, and PR editorial work. We launched it at the end of September and went from couch to 8K revenue in three weeks. Now, Kriya has helped six startups connect with workers to build an idea into a product. Startups are hard and uncertain. No one can guarantee success, but there are frameworks that can make the process more efficient. Building a company with respectful and complimentary personalities is integral to success. The idea is just the beginning—it’s really about who you build it with. ", "title": "My Co-Founder Kicked Me Out, and I Couldn’t Be Happier", "sentences": [{"d7c4": "My Co-Founder Kicked Me Out, and I Couldn’t Be Happier"}, {"bfc0": "I needed our partnership to fail before I could discover my new company."}, {"0c9d": "It never gets easier."}, {"974e": "You get an idea. You get excited. You do market research and validate your instinct. You suss out co-founders. You build a prototype, get traction, and raise money to scale by hiring the best people. Then shit happens."}, {"b4f1": "Your hypothesis is wrong. You’re burning money. You lay off your staff. You get emotional. Your investors get cold with you. And fear creeps in."}, {"51b4": "I came to Silicon Valley in 2011, after graduating from the University of Southern California in Los Angeles. After a brief stint at MySpace, I got a job as a product engineer at a hot startup, BranchOut—an app for recruiting employees through Facebook. Quickly, I was hooked: I saw how companies could move quickly, and iterate fast. I saw the depth of impact that a founder can have."}, {"d4b3": "At BranchOut, I was the youngest hire and the only new grad. I knew many smarter recent grads who went to work for bigger companies with recognizable names. I noticed a discovery problem and wanted to fix it. So, as a side project, I built a simple tool to help recent college grads apply for jobs at startups. In 2013, I used my connections at USC and launched it to computer science students there. Over launch weekend, 300 people signed up. By the end of that year, five startups had used the service to recruit dozens of grads."}, {"cb16": "Because I’m an immigrant from India, my hurdles to entrepreneurship were magnified. My work visa required that I remain a full time employee at BranchOut, so I couldn’t quit and start my own company. My only choice was to work in the off-hours, hoping to gain more traction, raise funding, and transfer the visa."}, {"abf4": "Then an acquaintance at USC showed interest in the project. He’d helped me with strategy and wanted to join as a co-founder. Because we had a good relationship, I gave him a 40 percent stake in the company before we pushed ourselves to raise funds. By February of 2015, we’d secured a seed investment and formally named the company Meed. I was thrilled and immediately started shifting my visa so I could quit my job at BranchOut."}, {"0343": "Then came a coup. In the final stages of closing the round, my co-founder said he couldn’t join Meed full time for at least six months, until stock from his job at Google had vested. I saw it as a red flag, and it put me in a tricky situation: I wanted to fire him but was worried about losing the investment. (In retrospect, if it were not for my visa, I would have fired him.) Instead, I focused on building out a great team."}, {"95f5": "Around this time, I decided to tweak Meed, building a professional network around different majors that was separate from the jobs we were offering. That way, we could capture more than just the college students actively seeking full-time jobs: We also invited ‘influencers’ to interact with students via AMAs, tips, suggestions, and stories. We grew from 1,500 to 80,000 users in just five months."}, {"07d8": "This produced good engagement, so we expanded the model to allow the influencers to create paid learning groups with premium content, advice, and networking. (Justin Kan’s Whale app, released last month, has a similar model.) I took the help of remote freelancers, interns, and the rest of the team to release the paid feature by July 4th."}, {"3bd7": "At the time, LinkedIn had just been acquired, so investors were skeptical about the professional networking space. But we hustled and had interest from VCs. Then came the final jolt."}, {"2384": "Right before the release, my co-founder leveraged his shares and sided with the stakeholders to take over the company and push me out of leadership. I pleaded with him to wait until we released the new product, but it didn’t work. By the end of July, I had quit the company I started two years earlier."}, {"ed32": "My regret? I didn’t fire my co-founder before he could fire me. It sounds mean, but it’s true. A month later the new CEO laid everyone off. Three months later the company shut down. One wrong decision—picking a bad partner—destroyed my business."}, {"7fa0": "My visa situation turbo-loaded my drive. I had to find a different company to work for or leave the country. People advised me to get a job offer, to be safe. But I couldn’t accept a new job; I wanted to be a full-time entrepreneur. By August I was ready to start from scratch—this time, addressing some of the critical problems involved in starting a company."}, {"f05c": "At Meed, I had to hire contractors to get our social networking product off the ground. It would cost about $50,000 to hire locals for design, engineering, and testing, and to release a simple minimum viable product. It was a big cost and I wanted to figure out how to bring it down for the subsequent iterations, as startups iterate a lot on the base product. I used marketplaces like Upwork and 99Designs to outsource, but it took a lot of time to find the right people. Because these platforms are open, quality wasn’t vetted and varied. I got lucky in finding good, talented people to work with. They worked for $20,000 per year."}, {"67d9": "When I started out I assumed that you had to build the best product with as much money as you could raise. It was like building a house by going to Home Depot, contracting Frank Lloyd Wright and Bob Vila, and buying all the best power tools and five hundred tons of marble, wood, and bricks. Then you and your dream team could start on the biggest mansion possible, as quickly as possible. But that’s not how it really works. On day one, Frank quits out of frustration and Bob gets a better offer from HGTV. You’re left with a half-finished mansion and dumpsters full of unused materials."}, {"0e96": "The new hires had increased our productivity rate. I thought that founders with some cash and an idea should be able to find these kinds of freelancers easily, to help build their companies in their early stages. But most startups don’t trust the quality low-cost freelancers, especially when they’re looking for engineers, designers, or creative writers. The reason is that there’s no easy way to find the right kind of freelance talent."}, {"c274": "That was the moment for my new idea. I partnered with my ex-colleague Gregory Wisenberg, who had run growth and partnerships at Meed. He loved the idea of distributing work to the qualified, on-demand talent. Because I’d been burned in my last project, I waited before making him a co-founder. I had learned that the co-founder relationship is critical. Even if you’ve had a good relationship in the past, a new situation can trigger a change in behavior. Every idea is different, and people’s passions fluctuate."}, {"f5b5": "We started with our friends and family, connecting them to the vetted group of freelancers that we’d amassed. We charged a 25 percent margin on each task or project. At first, we did a lot of things manually, to receive consistent feedback from our customers. Then we developed a simple AI interface, to dispatch the work to the right talent. We named the new company Kriya AI, an on-demand workforce for engineering, sales, marketing, and PR editorial work. We launched it at the end of September and went from couch to 8K revenue in three weeks. Now, Kriya has helped six startups connect with workers to build an idea into a product."}, {"0d90": "Startups are hard and uncertain. No one can guarantee success, but there are frameworks that can make the process more efficient. Building a company with respectful and complimentary personalities is integral to success. The idea is just the beginning—it’s really about who you build it with."}], "child": "601_1\t601_2\t601_3\t601_4\t601_5\t601_6\t601_7\t601_8\t601_9\t601_10\t601_11\t601_12\t601_13\t601_14\t601_15\t601_16\t601_17\t601_18\t601_19\t601_20\t601_21\t601_22"}