{"name": "603", "parent": "", "content": "How Valleywag Changed my Life Like Peter Thiel, I was victimized by the Gawker crowd. It was one of the best things that ever happened to me. I watched in horror these past few months as Hulk Hogan’s legal case against Gawker, (backed by Peter Thiel) pushed the publication into bankruptcy. I think that this case sets a chilling precedent for the future of a free press in the United States. This court case and the aftermath reminded me of something that I hadn’t thought of in years: Through a truly bizarre chain of events, the Silicon Valley online gossip rag called Valleywag (owned by Gawker) changed my career, and my life. In 2005, I started Google’s Chicago Engineering Office with Ben Collins-Sussman because we stubbornly refused to move to Silicon Valley. We were working on a (now dead) product for hosting Open Source software called Google Code, just the two of us in a small office in Chicago that had about 25 salespeople. Once we launched Google Code in 2006, I started looking for an additional product to work on in Chicago — something not open source, but preferably something philosophically similar. Right about this time, we met a local engineer named James Koh (who, coincidentally, now works at Google) who asked if he could introduce us to a friend who covers the tech beat at a local blog called Chicagoist. I figured it would be great to tell more people in Chicago that we were here and looking to grow the office, so I jumped at the opportunity. In late September of 2006, all three Google Chicago engineers (Ben, Jon Trowbridge, and I) met with Chris Karr (and his friend James) to talk about Google, Open Source, software version control, and lastly, just why in the hell we didn’t move to the San Francisco Bay Area like everyone else. We had a laugh about this last bit, made a few snarky comments, and thought nothing of it. Next month, the post came out (and it’s still up!): Interview: Google Chicago Engineers http://chicagoist.com/2006/10/23/interview_google_chicago_engineers.php This was the first real “press” that our tiny engineering team in Chicago had ever gotten, and we were pretty pleased with it, hoping that, at the very least, a few more people in Chicago would know that Google had engineers in Chicago. We got way more than we bargained for. A day later, I walked away from my desk for a minute only to come back to a half a dozen instant messages and as many emails. They all said basicthe same thing: Holy shit, you’re on the front page of Valleywag! At the time I wasn’t a regular reader, but I sure as hell knew what Valleywag was — a mean pit bull unleashed on tech executives and even helpless geeks who worked for big companies like … Google. It has trashed the personal lives of my bosses. I read the occasional post that made the rounds on mailing lists (life before Twitter and Facebook was barbaric), and I knew it was definitely something that you didn’t want to be on the front page of. As a chill went up my spine, I took a deep breath and clicked the link (Note: Original post is still up here): http://gawker.com/209827/windy-city-google-engineers-say-sf-sucks The first thing I thought is “Oh shit, PR is going to kill me.” Even though we hadn’t actually said that, this completely freaked me out. I had no idea what would happen, but I was worried — would I get fired? Here’s what didn’t happen: PR didn’t freak out. My PR contact laughed as I called her up in a cold sweat. It was OK, it wasn’t my fault, and I should just forget about it. I did my best to forget about it. But Google didn’t: Less than an hour later, the Valleywag post hit Google’s internal “misc” mailing list. I froze up again hoping that the Mountain View Googlers wouldn’t read it and hate us for our snarky comments about Bay Area life. They didn’t. Most responses didn’t seem to mind the comments about San Francisco, but instead focused on things like “frozen tundra” and “Hoth ice planet,” etc, and everyone was quite happy with the “weather-lite” in the Bay Area thankyouverymuch. I thought that would be the end of it. But it wasn’t. The next day I got an email from Jess Ewing, a product manager in Mountain View. Previous to the Valleywag post, she had no idea that Google had a Chicago Engineering office and she was from the Midwest and wanted to chat about what kind of stuff we were doing in Chicago. A few weeks later, Jess and I had lunch in Mountain View. We talked about a lot of different products that might be worth starting in Chicago. We threw out a lot of ideas, some good, some bad, but then Jess said: “You know, I think Google needs to do something about Data Portability. Eric [Schmidt] is always talking about how Google doesn’t lock-in user data, but it should be easier.” That was right up my alley: Open data, good for the Internet, good for Google, and slightly crazy. I couldn’t stop thinking about it. Two months later, in Chicago, Google’s Data Liberation Front was born. The team started by helping individual teams within Google provide users with an ability to easily download all their data in each Google product. This culminated in the creation of a product called Google Takeout that integrates with almost every Google product and allows you download all of your data in Google with just a couple of clicks. Today it really is easy to get your data out of Google. And it all started because of a post on a internet gossip rag. That’s why I have no desire to sue Nick Denton. Hell, if I see him, I’ll buy him a drink. Special thanks to Marcin Wichary for proofreading, suggestions, and help with the graphics. ", "title": "How Valleywag Changed my Life", "sentences": [{"36ec": "How Valleywag Changed my Life"}, {"10ff": "Like Peter Thiel, I was victimized by the Gawker crowd. It was one of the best things that ever happened to me."}, {"a4fe": "I watched in horror these past few months as Hulk Hogan’s legal case against Gawker, (backed by Peter Thiel) pushed the publication into bankruptcy. I think that this case sets a chilling precedent for the future of a free press in the United States."}, {"dbec": "This court case and the aftermath reminded me of something that I hadn’t thought of in years: Through a truly bizarre chain of events, the Silicon Valley online gossip rag called Valleywag (owned by Gawker) changed my career, and my life."}, {"041d": "In 2005, I started Google’s Chicago Engineering Office with Ben Collins-Sussman because we stubbornly refused to move to Silicon Valley. We were working on a (now dead) product for hosting Open Source software called Google Code, just the two of us in a small office in Chicago that had about 25 salespeople. Once we launched Google Code in 2006, I started looking for an additional product to work on in Chicago — something not open source, but preferably something philosophically similar. Right about this time, we met a local engineer named James Koh (who, coincidentally, now works at Google) who asked if he could introduce us to a friend who covers the tech beat at a local blog called Chicagoist."}, {"3770": "I figured it would be great to tell more people in Chicago that we were here and looking to grow the office, so I jumped at the opportunity. In late September of 2006, all three Google Chicago engineers (Ben, Jon Trowbridge, and I) met with Chris Karr (and his friend James) to talk about Google, Open Source, software version control, and lastly, just why in the hell we didn’t move to the San Francisco Bay Area like everyone else. We had a laugh about this last bit, made a few snarky comments, and thought nothing of it."}, {"5161": "Next month, the post came out (and it’s still up!): Interview: Google Chicago Engineers"}, {"5feb": "http://chicagoist.com/2006/10/23/interview_google_chicago_engineers.php"}, {"1ee0": "This was the first real “press” that our tiny engineering team in Chicago had ever gotten, and we were pretty pleased with it, hoping that, at the very least, a few more people in Chicago would know that Google had engineers in Chicago."}, {"6853": "We got way more than we bargained for."}, {"5b37": "A day later, I walked away from my desk for a minute only to come back to a half a dozen instant messages and as many emails. They all said basicthe same thing:"}, {"25a5": "Holy shit, you’re on the front page of Valleywag!"}, {"5138": "At the time I wasn’t a regular reader, but I sure as hell knew what Valleywag was — a mean pit bull unleashed on tech executives and even helpless geeks who worked for big companies like … Google. It has trashed the personal lives of my bosses. I read the occasional post that made the rounds on mailing lists (life before Twitter and Facebook was barbaric), and I knew it was definitely something that you didn’t want to be on the front page of. As a chill went up my spine, I took a deep breath and clicked the link (Note: Original post is still up here):"}, {"0d32": "http://gawker.com/209827/windy-city-google-engineers-say-sf-sucks"}, {"086e": "The first thing I thought is “Oh shit, PR is going to kill me.” Even though we hadn’t actually said that, this completely freaked me out. I had no idea what would happen, but I was worried — would I get fired?"}, {"736b": "Here’s what didn’t happen: PR didn’t freak out. My PR contact laughed as I called her up in a cold sweat. It was OK, it wasn’t my fault, and I should just forget about it."}, {"2066": "I did my best to forget about it."}, {"1e58": "But Google didn’t: Less than an hour later, the Valleywag post hit Google’s internal “misc” mailing list. I froze up again hoping that the Mountain View Googlers wouldn’t read it and hate us for our snarky comments about Bay Area life."}, {"2bdf": "They didn’t. Most responses didn’t seem to mind the comments about San Francisco, but instead focused on things like “frozen tundra” and “Hoth ice planet,” etc, and everyone was quite happy with the “weather-lite” in the Bay Area thankyouverymuch."}, {"c7ef": "I thought that would be the end of it. But it wasn’t. The next day I got an email from Jess Ewing, a product manager in Mountain View. Previous to the Valleywag post, she had no idea that Google had a Chicago Engineering office and she was from the Midwest and wanted to chat about what kind of stuff we were doing in Chicago."}, {"b3b4": "A few weeks later, Jess and I had lunch in Mountain View. We talked about a lot of different products that might be worth starting in Chicago. We threw out a lot of ideas, some good, some bad, but then Jess said:"}, {"8d94": "“You know, I think Google needs to do something about Data Portability. Eric [Schmidt] is always talking about how Google doesn’t lock-in user data, but it should be easier.”"}, {"db40": "That was right up my alley: Open data, good for the Internet, good for Google, and slightly crazy. I couldn’t stop thinking about it."}, {"de5e": "Two months later, in Chicago, Google’s Data Liberation Front was born. The team started by helping individual teams within Google provide users with an ability to easily download all their data in each Google product. This culminated in the creation of a product called Google Takeout that integrates with almost every Google product and allows you download all of your data in Google with just a couple of clicks."}, {"7fdc": "Today it really is easy to get your data out of Google."}, {"f9e0": "And it all started because of a post on a internet gossip rag. That’s why I have no desire to sue Nick Denton. Hell, if I see him, I’ll buy him a drink."}, {"8a5a": "Special thanks to Marcin Wichary for proofreading, suggestions, and help with the graphics."}], "child": "603_1\t603_2\t603_3\t603_4\t603_5\t603_6\t603_7\t603_8\t603_9"}