{"name": "604", "parent": "", "content": "How I Sold My Company to Twitter, Went to Facebook, and Screwed My Co-Founders The fate of AdGrok, as told by the CEO who pulled off one of Silicon Valley’s most amazing outcomes Antonio García Martínez is just kidding here. We think. In this excerpt adapted from his new, take-no-prisoners Silicon Valley memoir Chaos Monkeys, Antonio García Martínez explains the harrowing exit of his one-year-old Y Combinator startup company. As we begin our narrative, García Martínez is CEO and unofficial strategist of AdGrok, which is in the midst of the “trough of despair” following launch and preceding significant revenues. His two co-founders, Matthew McEachen (MRM) and Argyris Zymnis, aka“the boys,” provide the engineering. (They are the book’s Rosencrantz and Guildenstern.) The action here takes place in early April, less than two weeks after Twitter showed interest in buying AdGrok. García Martínez quickly sought to find another bidder, to boost Twitter’s offer and possibly produce a better alternative. That was Facebook: after interest from its head of corporate development Amin Zoufonoun, the AdGrok trio went to its headquarters for a day of interviewing. Our narrative, with themes of gamesmanship, betrayal, and the Silicon Valley dream, picks up from there. García Martínez’s book is an exercise in bridge-burning (I suggested he call it “You’ll Never Eat (Free) Lunch in This Town Again”), but his candor in recounting this incident shows that he is just as merciless when examining his own behavior. — Steven Levy TUESDAY, APRIL 5, 2011 Ten million dollars. Twitter was officially back in the game. They had finally come back with a real offer. While we hadn’t seen a formal term sheet — and the devil was absolutely in those details — it was clear Twitter was now in the realm of 2011 tech-bubble (in)sanity. Our stonewalling had paid off. Even investor Chris Sacca and I couldn’t claim this wasn’t a tempting offer. I was riding that particular high when the phone rang. “Hello, Antonio!” It was six thirty p.m., and this was the much-awaited phone call from Amin, reporting on our proctological day of interviews at Facebook. “So, I talked to our engineers and we have the final feedback.” In the Aaron Sorkin cinematic adaptation of this story, this is where the violins will start scraping their tension-building wail. “I’m sorry to say that we won’t be moving forward with a deal for AdGrok. The feedback on Argyris and Matt was mixed, and I don’t think it’s a go right now.” Fuck! Take another kick in your scarred mug, startup guy. “In the interests of AdGrok, can you tell me what some of the feedback was?” I sputtered. Amin changed to that slightly hushed and tense conspiratorial tone that people use, as if hiding in the bushes, when in fact I assumed he was in a closed-door conference room. He proceeded to do some pro bono dragoman-ing. Argyris would have been a possible hire, but Matt was a definite no. Clearly MRM was a gifted engineer, but Facebook had very specific conceptions of engineering greatness. Also, there was a bit of that nebulous “cultural fit” blocking as well. After my day of interviews, I had imagined that MRM and Facebook would get along about as well as a Berkeley hippie and a Marine scout sniper, and I was right. “Sorry to hear that, Amin. Thanks for your time and that of everyone at Facebook.” “Hold on. While that was the feedback for the engineers, the feedback for you was different. We want you to come and join the Facebook Ads team. Your feedback was excellent, and everyone really felt you were an extremely strong candidate.” My mind stuttered a bit on that one. When in doubt, act coy. “Well. . . . Amin, as you can understand, I’m somewhat committed to both AdGrok and this other deal we have. I’ll have to think about this.” “Think about it. But again, we really want you to come to Facebook.” I looked up suddenly toward our windowed office. I had isolated myself on our balcony in an obvious bid for privacy. Argyris was inside, looking at me with a worried frown. He wanted an answer as badly as I did. I raised two fingers and mouthed “two minutes” to indicate I’d need a bit more time. He nodded, and went back to his screen. What the fuck should I do? I couldn’t tell the boys this, at least not yet. Stealthily, making it look like I was readjusting my phone, I hung up and dialed [my former girlfriend who I call] British Trader. While I had moved out a few months ago and we were officially apart, we were still regularly in touch. You don’t just cut contact with the mother of your children, and besides, she still wanted to hear about the AdGrok saga. “Hey, what’s up?” “So, get this. Facebook doesn’t want the boys, but they want me. Argyris is right here. I don’t know what to do.” As an oil woman, British Trader was completely outside the tech scene, and knew little about the intricacies. But she had a savvy read on human nature in a professional setting. Also, given that I was wholly devoid of most human boundaries or morality, she provided a mainstream sanity check on my actions. “Don’t tell the boys. It will just destroy their confidence. You’ve got to figure out some way to manage it.” We went back and forth, with me sketching out more details, and her sharing her take. I looked at my watch. Almost seven p.m. In a few minutes, Argyris would be off like a shot to spend quality time with Simla, the girlfriend turned wife. If I held out for a few more minutes, he’d be out of the office, and I could ignore the boys on email and have a night to think about it. Here’s a data point for you: As part of our push to woo Facebook, I had been getting Google Alerts on the company for months. One in particular had caught my attention. In October 2010, a mother in Florida had shaken her baby to death, as the baby would interrupt her FarmVille games with crying. A mother destroyed with her own hands what she’d been programmed over aeons to love, just to keep on responding to Facebook notifications triggered by some idiot game. Products that cause mothers to murder their infants in order to use them more, assuming they’re legal, simply cannot fail in the world. Facebook was legalized crack, and at Internet scale. Such a company could certainly figure out a way to sell shoes. Twitter was cute and all, but it didn’t have a casualty rate yet, no matter how much this Lady Gaga person was tweeting. Facebook it was. But Twitter had come up with the solid offer for AdGrok, while Facebook hadn’t come up with a solid offer for anything yet. The shambolic hipsters with the expensively decorated offices, thousand-dollar fixies in their bike stand, and the Fail Whale?* Or the hoodie-wearing frat boys with an imperial mandate who coded while they shat? Which was it going to be? Could it possibly be both? Managing a combined deal between Facebook and Twitter was like trying to engineer simultaneous orgasm between a premature ejaculator and a frigid woman: nigh impossible, fraught with danger, and requiring a very steady hand. But here’s a truth about tech life: anyone who claims the Valley is meritocratic is someone who has profited vastly from it via nonmeritocratic means like happenstance, membership in a privileged cohort, or some concealed act of absolute skulduggery. Since fortune had never been on my side, and I had no privileged cohort to fall back on, skulduggery it would have to be. As I would come to learn, my situation wasn’t unusual, though not generally talked about. Companies with acquisition wherewithal and the nerve to use it bid for what they wanted in deals. You came in with your team and your product; they gave it the once-over, and said, “We want person A and B, but not C, and we don’t care about the tech.” They then offered you a lump sum for what they wanted, and you were left to double-deal, buy out, or otherwise fuck over whoever in order to get the deal done. The company — and places like Facebook and Google did this commonly — cared only about net price per engineer (or product person), not the absolute cost. And they certainly didn’t care what investors got. Many an early-stage acquisition unfolded in this vulturelike way. WEDNESDAY, APRIL 6, 2011 I had decided to deceive my cofounders for the first time in our harried time together. As with many such lies, the rationalization was that it served the greater good. The boys were already stressed to the point of hyperventilation with all the shit we’d been through, and now we were betting it all on this very flaky acquisition process that could collapse in an instant. If they realized that this Twitter process was truly do-or-die for them, they’d choke. So what you do as a CEO is internalize that stress for the company and let it consume you instead of the rest. How’s that for a masterful rationalization? What’s more, it wasn’t even clear the Facebook offer was for real. In God we trust, everyone else show me an offer letter. I had called them that morning and mentioned I found Facebook’s interest flattering, but I needed to see an offer before I could even begin to manipulate the other side of the deal to spring me. Today, though, was a day for Twitter. Part of any acquisition process is what’s loosely called “due diligence.” Taking both technical and legal forms, it’s the snooping around an acquiring company does to make sure it’s actually getting what it thinks it is. On the technical side, it means understanding the company’s “stack”; that is, the pile of interrelated user interface and back-end server technologies that power the product. It might even be as detailed as line-by-line code reviews with the startup’s engineers. You can fake a lot in a startup these days, what with Amazon Web Services and all sorts of off-the- shelf back-end components that let any even minimally competent duffer set up a Web app that does something. Intelligent planning for growth is rare among early startups, but it’s the name of the game at a large, rapidly scaling tech company. Waiting for a team to grow from technical adolescence to mature talent was too long even for a larger company. As a first step, Twitter had invited us in as a group to talk technical turkey with a pack of engineers that reported to Kevin Weil. We spent a tense and wonky hour locked in a room with the senior engineers on the Twitter Ads team, walking them through our back-end stack that made AdGrok possible. I’m using the corporate “we” here, as it was completely the boys’ show. It had been so long since I’d even touched AdGrok code, there was little I could have said about it. While the meeting seemed to have gone well, the fact that we were going deeper in with Twitter underscored the fact that we were approaching a point of no return in terms of AdGrok investment. “Look, we’ve got to figure out if we’re selling or what,” I said once we were out of earshot of the Twitter offices. We were sitting at the picnic tables in South Park, the boys across from me. This was where Twitter itself was conceived in 2006, during a brainstorming session held on one of the park’s slides. The irony was striking. After some awkward dithering, and lots of downcast study of the green tabletop, we finally got to talking. For probably the first time, I confronted the boys with the fact that we hadn’t shipped anything since launch almost a month before, and that the commitment from the technical side of the team seemed to be waning. Given the occasional wall between the technical side of AdGrok and everything else (i.e., between them and me), I wanted to confirm that they also had the same vibe. They didn’t disagree with me. MRM himself seemed checked out and hadn’t delivered anything on the new code front in weeks. Argyris and I had chatted about it, but so far all we’d done was to call him the mornings he was late to tell him to get his ass to AdGrok. Argyris was holding up his end, but the two had lost that wonderful mind-meld synchrony that had powered AdGrok’s development from the first days in our ratty Mountain View apartment. The dev team is the engine of a tech company. If they were done, then we were dead in the water. If that engine couldn’t be fixed back into productivity, then it was time to sell the company while we even could. I looked from one to the other: they seemed tired and worried and done with the startup game. They agreed we should pursue the acquisition process to its conclusion. We had to sell AdGrok to Twitter, or else. THURSDAY, APRIL 14, 2011 Twitter’s Jessica Verrilli sent an email, subject line: “Call,” to set up some time with her and Twitter VP Kevin Weil. Bingo! Remember: if you’re having phone calls, the deal is still on. Phone calls are yesses, emails are nos. I went outside to Townsend Street to take the call. Jess’s persuasive tone told me what I needed to know in the first two seconds. Twitter wanted to buy AdGrok, for real this time. She promised a term sheet within twenty-four hours. We’d heard this from Twitter before, but I believed them this time. One giveaway: Jess called back to ask specifics about the cap table. The “cap table” is the capitalization table, a list detailing each owner of equity (investor, founder, or employee) and how much of the company he or she owns. It’s about the most important document at any company. Every member of that table will know his or her number down to the decimal. This meant they were already thinking about the investor versus founder split in their proposed deal, one of the more important high-level parameters. It was time to come clean with the boys. I couldn’t morally justify the deception any longer. There’s a unique style of Spanish genre painting called the desengaño. “Desengaño” means literally “un-tricking,” and it is best translated as the disillusion, or the unveiling of a harsh truth, to be wordy about it. Typically depicted in the desengaño are the everyday reveals of sordid human deception: a young man stumbling on his beloved cooing with his best friend, a businessman catching his partner pinching from the till, and so on. They are meant to be an instructive moral lesson in everyday life, elevated to an art form. The engañado (“tricked one”) typically wears an exaggerated expression of betrayal bordering on incipient rage. The implication is that the next frame in this drama will feature some corrective moral action, such as a duel to the death by navaja, or an ignominious march through the streets by the manacled thief. I was hoping the scene about to unfold in the AdGrok office that afternoon was not worthy of a Velázquez’s attention. “Hey, so we need to have a chat,” I said to their backs. They turned with quizzical looks. Given the ups and downs we’d been through, they could expect anything from another lawsuit to my coming out as an aspiring transsexual. “So, remember when I said that Facebook rejected us? Well, that wasn’t completely true.” I proceeded to sketch out the situation, where I was with Facebook, and why I had concealed this from them for the past two weeks. Following a tomblike silence, their reaction was more understanding than I expected. “You know, I had kind of thought that maybe the Facebook thing was more complicated than you let on,” said Argyris, surprisingly calmly. Bomb defused, or at least not yet detonated, I explained to them that I thought my future lay with Facebook, and that I had every reason to believe — here I was skating on pretty thin ice — that we could pull off a combined deal if we tried. This did not go over so well. The boys panicked; surely I’d torpedo their deal if Twitter realized it wasn’t getting me as well. They tried to convince me to stick with the Twitter deal, but that was like trying to convince a mule to dance reggaetón. Rather than dig in and fan the mutiny with reciprocal defiance, I simply presented Facebook as a fait accompli, and not a group decision requiring consensus. They dropped their case, and, with crestfallen looks, turned back to their code-splattered monitors. We wouldn’t discuss the matter again until right before the first real deal negotiation with Twitter, and the suspense around it kind of hung in the air until then. As always, I’d find some way to make the simple complicated, and the relatively safe, risky. The final pricetag for AdGrok, without its CEO? $5 million. Adapted from Chaos Monkeys: Obscene Fortune and Random Failure in Silicon Valley, by Antonio García Martínez (Harper Collins). Photos courtesy author. The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com ", "title": "How I Sold My Company to Twitter, Went to Facebook, and Screwed My Co-Founders", "sentences": [{"8a4a": "How I Sold My Company to Twitter, Went to Facebook, and Screwed My Co-Founders"}, {"9756": "The fate of AdGrok, as told by the CEO who pulled off one of Silicon Valley’s most amazing outcomes"}, {"2e48": "Antonio García Martínez is just kidding here. We think."}, {"9def": "In this excerpt adapted from his new, take-no-prisoners Silicon Valley memoir Chaos Monkeys, Antonio García Martínez explains the harrowing exit of his one-year-old Y Combinator startup company. As we begin our narrative, García Martínez is CEO and unofficial strategist of AdGrok, which is in the midst of the “trough of despair” following launch and preceding significant revenues. His two co-founders, Matthew McEachen (MRM) and Argyris Zymnis, aka“the boys,” provide the engineering. (They are the book’s Rosencrantz and Guildenstern.)"}, {"974a": "The action here takes place in early April, less than two weeks after Twitter showed interest in buying AdGrok. García Martínez quickly sought to find another bidder, to boost Twitter’s offer and possibly produce a better alternative. That was Facebook: after interest from its head of corporate development Amin Zoufonoun, the AdGrok trio went to its headquarters for a day of interviewing. Our narrative, with themes of gamesmanship, betrayal, and the Silicon Valley dream, picks up from there."}, {"d801": "García Martínez’s book is an exercise in bridge-burning (I suggested he call it “You’ll Never Eat (Free) Lunch in This Town Again”), but his candor in recounting this incident shows that he is just as merciless when examining his own behavior. — Steven Levy"}, {"fc3e": "TUESDAY, APRIL 5, 2011"}, {"ee5c": "Ten million dollars. Twitter was officially back in the game. They had finally come back with a real offer. While we hadn’t seen a formal term sheet — and the devil was absolutely in those details — it was clear Twitter was now in the realm of 2011 tech-bubble (in)sanity. Our stonewalling had paid off. Even investor Chris Sacca and I couldn’t claim this wasn’t a tempting offer."}, {"0664": "I was riding that particular high when the phone rang. “Hello, Antonio!” It was six thirty p.m., and this was the much-awaited phone call from Amin, reporting on our proctological day of interviews at Facebook."}, {"aaf8": "“So, I talked to our engineers and we have the final feedback.”"}, {"56b6": "In the Aaron Sorkin cinematic adaptation of this story, this is where the violins will start scraping their tension-building wail."}, {"1bd1": "“I’m sorry to say that we won’t be moving forward with a deal for AdGrok. The feedback on Argyris and Matt was mixed, and I don’t think it’s a go right now.”"}, {"d3eb": "Fuck!"}, {"2cad": "Take another kick in your scarred mug, startup guy."}, {"fc02": "“In the interests of AdGrok, can you tell me what some of the feedback was?” I sputtered."}, {"bd6b": "Amin changed to that slightly hushed and tense conspiratorial tone that people use, as if hiding in the bushes, when in fact I assumed he was in a closed-door conference room. He proceeded to do some pro bono dragoman-ing. Argyris would have been a possible hire, but Matt was a definite no. Clearly MRM was a gifted engineer, but Facebook had very specific conceptions of engineering greatness. Also, there was a bit of that nebulous “cultural fit” blocking as well."}, {"620b": "After my day of interviews, I had imagined that MRM and Facebook would get along about as well as a Berkeley hippie and a Marine scout sniper, and I was right."}, {"46f0": "“Sorry to hear that, Amin. Thanks for your time and that of everyone at Facebook.”"}, {"16af": "“Hold on. While that was the feedback for the engineers, the feedback for you was different. We want you to come and join the Facebook Ads team. Your feedback was excellent, and everyone really felt you were an extremely strong candidate.”"}, {"5c51": "My mind stuttered a bit on that one. When in doubt, act coy. “Well. . . . Amin, as you can understand, I’m somewhat committed to both AdGrok and this other deal we have. I’ll have to think about this.”"}, {"7315": "“Think about it. But again, we really want you to come to Facebook.”"}, {"cae7": "I looked up suddenly toward our windowed office. I had isolated myself on our balcony in an obvious bid for privacy. Argyris was inside, looking at me with a worried frown. He wanted an answer as badly as I did. I raised two fingers and mouthed “two minutes” to indicate I’d need a bit more time. He nodded, and went back to his screen."}, {"26b6": "What the fuck should I do? I couldn’t tell the boys this, at least not yet."}, {"dc0f": "Stealthily, making it look like I was readjusting my phone, I hung up and dialed [my former girlfriend who I call] British Trader. While I had moved out a few months ago and we were officially apart, we were still regularly in touch. You don’t just cut contact with the mother of your children, and besides, she still wanted to hear about the AdGrok saga."}, {"d770": "“Hey, what’s up?”"}, {"3cf9": "“So, get this. Facebook doesn’t want the boys, but they want me. Argyris is right here. I don’t know what to do.”"}, {"f249": "As an oil woman, British Trader was completely outside the tech scene, and knew little about the intricacies. But she had a savvy read on human nature in a professional setting. Also, given that I was wholly devoid of most human boundaries or morality, she provided a mainstream sanity check on my actions."}, {"1c18": "“Don’t tell the boys. It will just destroy their confidence. You’ve got to figure out some way to manage it.”"}, {"9f53": "We went back and forth, with me sketching out more details, and her sharing her take."}, {"2491": "I looked at my watch. Almost seven p.m. In a few minutes, Argyris would be off like a shot to spend quality time with Simla, the girlfriend turned wife. If I held out for a few more minutes, he’d be out of the office, and I could ignore the boys on email and have a night to think about it."}, {"f058": "Here’s a data point for you: As part of our push to woo Facebook, I had been getting Google Alerts on the company for months. One in particular had caught my attention. In October 2010, a mother in Florida had shaken her baby to death, as the baby would interrupt her FarmVille games with crying. A mother destroyed with her own hands what she’d been programmed over aeons to love, just to keep on responding to Facebook notifications triggered by some idiot game. Products that cause mothers to murder their infants in order to use them more, assuming they’re legal, simply cannot fail in the world. Facebook was legalized crack, and at Internet scale. Such a company could certainly figure out a way to sell shoes. Twitter was cute and all, but it didn’t have a casualty rate yet, no matter how much this Lady Gaga person was tweeting."}, {"0483": "Facebook it was."}, {"4d2a": "But Twitter had come up with the solid offer for AdGrok, while Facebook hadn’t come up with a solid offer for anything yet."}, {"9f7f": "The shambolic hipsters with the expensively decorated offices, thousand-dollar fixies in their bike stand, and the Fail Whale?* Or the hoodie-wearing frat boys with an imperial mandate who coded while they shat? Which was it going to be? Could it possibly be both?"}, {"aac7": "Managing a combined deal between Facebook and Twitter was like trying to engineer simultaneous orgasm between a premature ejaculator and a frigid woman: nigh impossible, fraught with danger, and requiring a very steady hand."}, {"e565": "But here’s a truth about tech life: anyone who claims the Valley is meritocratic is someone who has profited vastly from it via nonmeritocratic means like happenstance, membership in a privileged cohort, or some concealed act of absolute skulduggery. Since fortune had never been on my side, and I had no privileged cohort to fall back on, skulduggery it would have to be."}, {"374b": "As I would come to learn, my situation wasn’t unusual, though not generally talked about. Companies with acquisition wherewithal and the nerve to use it bid for what they wanted in deals. You came in with your team and your product; they gave it the once-over, and said, “We want person A and B, but not C, and we don’t care about the tech.” They then offered you a lump sum for what they wanted, and you were left to double-deal, buy out, or otherwise fuck over whoever in order to get the deal done. The company — and places like Facebook and Google did this commonly — cared only about net price per engineer (or product person), not the absolute cost. And they certainly didn’t care what investors got. Many an early-stage acquisition unfolded in this vulturelike way."}, {"5570": "WEDNESDAY, APRIL 6, 2011"}, {"58cf": "I had decided to deceive my cofounders for the first time in our harried time together."}, {"53c5": "As with many such lies, the rationalization was that it served the greater good. The boys were already stressed to the point of hyperventilation with all the shit we’d been through, and now we were betting it all on this very flaky acquisition process that could collapse in an instant. If they realized that this Twitter process was truly do-or-die for them, they’d choke. So what you do as a CEO is internalize that stress for the company and let it consume you instead of the rest."}, {"a029": "How’s that for a masterful rationalization?"}, {"64f7": "What’s more, it wasn’t even clear the Facebook offer was for real. In God we trust, everyone else show me an offer letter. I had called them that morning and mentioned I found Facebook’s interest flattering, but I needed to see an offer before I could even begin to manipulate the other side of the deal to spring me."}, {"df8f": "Today, though, was a day for Twitter."}, {"8669": "Part of any acquisition process is what’s loosely called “due diligence.” Taking both technical and legal forms, it’s the snooping around an acquiring company does to make sure it’s actually getting what it thinks it is. On the technical side, it means understanding the company’s “stack”; that is, the pile of interrelated user interface and back-end server technologies that power the product. It might even be as detailed as line-by-line code reviews with the startup’s engineers. You can fake a lot in a startup these days, what with Amazon Web Services and all sorts of off-the- shelf back-end components that let any even minimally competent duffer set up a Web app that does something. Intelligent planning for growth is rare among early startups, but it’s the name of the game at a large, rapidly scaling tech company. Waiting for a team to grow from technical adolescence to mature talent was too long even for a larger company."}, {"d93c": "As a first step, Twitter had invited us in as a group to talk technical turkey with a pack of engineers that reported to Kevin Weil. We spent a tense and wonky hour locked in a room with the senior engineers on the Twitter Ads team, walking them through our back-end stack that made AdGrok possible. I’m using the corporate “we” here, as it was completely the boys’ show. It had been so long since I’d even touched AdGrok code, there was little I could have said about it. While the meeting seemed to have gone well, the fact that we were going deeper in with Twitter underscored the fact that we were approaching a point of no return in terms of AdGrok investment."}, {"b3a3": "“Look, we’ve got to figure out if we’re selling or what,” I said once we were out of earshot of the Twitter offices."}, {"e05a": "We were sitting at the picnic tables in South Park, the boys across from me. This was where Twitter itself was conceived in 2006, during a brainstorming session held on one of the park’s slides. The irony was striking."}, {"2011": "After some awkward dithering, and lots of downcast study of the green tabletop, we finally got to talking. For probably the first time, I confronted the boys with the fact that we hadn’t shipped anything since launch almost a month before, and that the commitment from the technical side of the team seemed to be waning. Given the occasional wall between the technical side of AdGrok and everything else (i.e., between them and me), I wanted to confirm that they also had the same vibe."}, {"fdf0": "They didn’t disagree with me."}, {"8114": "MRM himself seemed checked out and hadn’t delivered anything on the new code front in weeks. Argyris and I had chatted about it, but so far all we’d done was to call him the mornings he was late to tell him to get his ass to AdGrok. Argyris was holding up his end, but the two had lost that wonderful mind-meld synchrony that had powered AdGrok’s development from the first days in our ratty Mountain View apartment. The dev team is the engine of a tech company. If they were done, then we were dead in the water. If that engine couldn’t be fixed back into productivity, then it was time to sell the company while we even could."}, {"df9c": "I looked from one to the other: they seemed tired and worried and done with the startup game. They agreed we should pursue the acquisition process to its conclusion. We had to sell AdGrok to Twitter, or else."}, {"61ec": "THURSDAY, APRIL 14, 2011"}, {"7df3": "Twitter’s Jessica Verrilli sent an email, subject line: “Call,” to set up some time with her and Twitter VP Kevin Weil."}, {"b1b5": "Bingo!"}, {"db4b": "Remember: if you’re having phone calls, the deal is still on. Phone calls are yesses, emails are nos."}, {"f536": "I went outside to Townsend Street to take the call."}, {"b207": "Jess’s persuasive tone told me what I needed to know in the first two seconds. Twitter wanted to buy AdGrok, for real this time. She promised a term sheet within twenty-four hours. We’d heard this from Twitter before, but I believed them this time. One giveaway: Jess called back to ask specifics about the cap table."}, {"5a79": "The “cap table” is the capitalization table, a list detailing each owner of equity (investor, founder, or employee) and how much of the company he or she owns. It’s about the most important document at any company. Every member of that table will know his or her number down to the decimal. This meant they were already thinking about the investor versus founder split in their proposed deal, one of the more important high-level parameters."}, {"2333": "It was time to come clean with the boys. I couldn’t morally justify the deception any longer."}, {"ab68": "There’s a unique style of Spanish genre painting called the desengaño. “Desengaño” means literally “un-tricking,” and it is best translated as the disillusion, or the unveiling of a harsh truth, to be wordy about it. Typically depicted in the desengaño are the everyday reveals of sordid human deception: a young man stumbling on his beloved cooing with his best friend, a businessman catching his partner pinching from the till, and so on. They are meant to be an instructive moral lesson in everyday life, elevated to an art form. The engañado (“tricked one”) typically wears an exaggerated expression of betrayal bordering on incipient rage. The implication is that the next frame in this drama will feature some corrective moral action, such as a duel to the death by navaja, or an ignominious march through the streets by the manacled thief."}, {"8f56": "I was hoping the scene about to unfold in the AdGrok office that afternoon was not worthy of a Velázquez’s attention."}, {"282e": "“Hey, so we need to have a chat,” I said to their backs. They turned with quizzical looks. Given the ups and downs we’d been through, they could expect anything from another lawsuit to my coming out as an aspiring transsexual."}, {"55f7": "“So, remember when I said that Facebook rejected us? Well, that wasn’t completely true.”"}, {"1875": "I proceeded to sketch out the situation, where I was with Facebook, and why I had concealed this from them for the past two weeks."}, {"6cf7": "Following a tomblike silence, their reaction was more understanding than I expected."}, {"5835": "“You know, I had kind of thought that maybe the Facebook thing was more complicated than you let on,” said Argyris, surprisingly calmly."}, {"fe61": "Bomb defused, or at least not yet detonated, I explained to them that I thought my future lay with Facebook, and that I had every reason to believe — here I was skating on pretty thin ice — that we could pull off a combined deal if we tried."}, {"c987": "This did not go over so well. The boys panicked; surely I’d torpedo their deal if Twitter realized it wasn’t getting me as well."}, {"c6e8": "They tried to convince me to stick with the Twitter deal, but that was like trying to convince a mule to dance reggaetón. Rather than dig in and fan the mutiny with reciprocal defiance, I simply presented Facebook as a fait accompli, and not a group decision requiring consensus. They dropped their case, and, with crestfallen looks, turned back to their code-splattered monitors."}, {"2040": "We wouldn’t discuss the matter again until right before the first real deal negotiation with Twitter, and the suspense around it kind of hung in the air until then. As always, I’d find some way to make the simple complicated, and the relatively safe, risky."}, {"45a7": "The final pricetag for AdGrok, without its CEO? $5 million."}, {"2faf": "Adapted from Chaos Monkeys: Obscene Fortune and Random Failure in Silicon Valley, by Antonio García Martínez (Harper Collins). Photos courtesy author."}, {"75be": "The Top Tech Books of 2016 (Part II)Here are five more books that Backchannel loved, plus an excerpt from each.backchannel.com"}, {"d0c9": "The Top Tech Books of 2016 (Part I)Here are the books Backchannel loved, plus an excerpt from each.backchannel.com"}], "child": "604_1\t604_2\t604_3\t604_4\t604_5\t604_6\t604_7\t604_8\t604_9\t604_10\t604_11\t604_12\t604_13\t604_14\t604_15\t604_16\t604_17\t604_18\t604_19\t604_20\t604_21\t604_22\t604_23"}