{"name": "606", "parent": "", "content": "War Stories: What It’s Really Like Working on AAA Games at Ubisoft Or why I quit my dream job to go indie Back in 2005, my boss asked me where I saw myself in 10 years. I answered without hesitation: I want to be a software architect on a big-ass AAA project. The dream came to life a few years later when I began working on Assassin’s Creed Syndicate as — wait for it — software architect. I was fulfilling my dream of becoming a well-respected game developer, working on a prestigious AAA franchise. Then, I suddenly quit and started a small indie games business with my girlfriend. Some of my friends and family found that move—let’s just say bold. They wondered why I left a safe, well-paying job with tons of advantages, including the excitement and fame of working on the next game everyone will talk about. On my last day at Ubisoft, as I said goodbye to my colleagues, nobody asked why I was leaving to work on my own games. Even people who barely knew me had a pretty good idea. Many were actually envious, although they worked on Syndicate, too, realizing one of their own dreams. I’m sure many professional game developers might have a clue about why I made this move. So I decided to write about the reality of AAA games development, or: How I learned to stop worrying and go indie. Modest Beginnings In 2005, Ubisoft announced it would open a new studio in Quebec City, about 250 kilometers from the famous Ubisoft Montreal studio that created all kinds of obscure games like Prince of Persia: The Sands of Time, Splinter Cell, and Assassin’s Creed. I was recruited on day one, together with about 30 other employees. You can imagine that I was really excited. I celebrated by spending my future paycheck on a brand-new $2,000 guitar. (Five years later, I totally stopped playing guitar. Yeah, not my best move.) Most people who start a career in game development, whether in design, art or programming, are very passionate. They love playing video games, and they love creating them. During my first weeks at Ubisoft, I couldn’t believe I was actually getting paid to do this. It was better than holidays. For the first two years, I worked on small PSP titles: Open Season and Surf’s Up on the Playstation Portable. Those are average games, not especially good or bad, but I had a lot of fun working on them. I learned a lot and made good friends. The teams were pretty small—between 15 and 25 people, if I remember correctly—so everyone knew everyone else. It felt like a little family, and the team spirit was good. In retrospect, we were a bunch of noobs who had a lot homework to do. The thing is, we all wished we could work on bigger projects, AAA projects. It’s not super-glamorous to tell your friends you’re working on some kid’s movie game. Nobody begins a career in video games to work on that kind of title. The PoP Years After Surf’s Up, our studio director met us in a conference room. (Yeah, the entire team fit in a single room. Ahhh, the good old days). He announced that our next project would be the Wii version of the upcoming Prince of Persia (PoP) game. I distinctly remember an awkward silence afterward. Nobody knew if it was good or bad news. Then someone shouted, “YES!” Of course, YES. This was way better than our previous projects. It wasn’t Assassin’s Creed, but who cares? I remember being a bit disappointed by the console (at the time, I was super-excited by the PS3 and not so much about the Wii), but overall, it was very good news. The project lasted about three years and became known as Prince of Persia: The Forgotten Sands. It wasn’t a port from the 360/PS3 version. We made a specific version just for the Wii. It’s a really good game. If you didn’t play it back then, go dust off your Wii and give it a try. During my time at Ubisoft, that’s the project I’m proudest of. I had a lot of fun, and I had ownership, meaning I strongly believed that my work had a major impact on the game. My contribution was significant, and I could see it everywhere when I was playing the game. So, obviously, I was super-motivated. I wanted that game to be the most awesome game ever. Most developers know that feeling well. At the team’s peak, we had about 75 developers. A big family, but still a family. Over the course of the project, I interacted with most of them. I’m pretty sure I talked at least once to everyone on the project. You might wonder why I focus so much on team sizes, but more on that later. AC3 WiiU After PoP, I contributed to several games here and there and eventually landed on a technically challenging project: porting Assassin’s Creed 3 (AC3) on the WiiU. This was much different from my previous work. The team was small: two programmers at the beginning, and about 15 or so at the peak. I was excited by the challenge. Most people at Ubisoft didn’t think we’d be able to pull it off. All Assassin’s Creed titles are intense games in terms of CPU and GPU performance. Believe me, your console is pretty much at its maximum capacity when running around in a big city like Boston or London. The WiiU was less powerful than the PS3 and XBox 360, at least on paper, so the odds weren’t on our side. Even worse: We had to make a straight port—that is, no data changes, just code optimizations. It’s much cheaper to do a straight port than to downgrade all game assets. After about a year, we reached a point where it became obvious that we had successfully ported the game with similar performance as the 360/PS3. It was a huge success. Even Nintendo engineers were surprised we made it. Life was great. The downside was that the second half of the project was relatively boring. The challenge was gone. Port code, fix bugs, and optimize. Rinse and repeat until the game is shipped. I have good memories of this project, but by the end I was ready to do something completely different. Tasting the Forbidden Fruit After AC3, I worked on two internal pitches. For legal reasons, I can’t say much about those projects, but they were so important to me that I need to take some time to talk about them. On the first project, we were a team of about six developers, all very senior. It was a multiplayer game, and our goal was to create a functional prototype in about a month. Our days went somewhat like this: The team spirit was so good! Our motto was “on est crinqués!,” which more or less translates to “we’re so hyped!” During our play sessions, we were so excited that we were screaming and shouting all over the place. I think it bothered colleagues working next to us, but hell, we had so much fun. I didn’t feel too guilty. Since we were such a small team that we had to break down the traditional job barriers. Everyone had their say in the game design. A UI artist made the level design because we didn’t have a level designer with us. I did gameplay programming, which isn’t my speciality at all. (I’m more of a low-level, engine and graphics guy.) But we all really enjoyed it. Unfortunately, for various reasons, the project was canceled. Then I started on another internal pitch with an even smaller team: two developers and one producer. This project definitely had that “indie” feeling. It was another multiplayer game, and again we made a pretty awesome prototype in a few weeks. Every day during lunch, we invited everyone in the studio to play. We even organized an internal tournament that attracted around 60 participants. But again, the project was canceled. I was never as happy at Ubisoft as during those two projects. I worked with very talented and motivated individuals. Because of the smaller team sizes, I had my say on the creative side of things. This was a nice change — being more of a technical guy, I could never do that before. And I absolutely loved it. When you work on a small project, your contribution is huge. So is your ownership. And your motivation. One of my former colleagues nailed it when he said that I tasted the forbidden fruit. Once you’ve have that feeling, you can never go back. AC Syndicate The studio received the mandate to lead the next Assassin’s Creed title: Syndicate. We knew the AC franchise well because we collaborated on every title since Brotherhood. However, this was not a collaboration like before. For the first time ever, the Quebec studio, not Montreal, would lead an Assassin’s Creed game. This was a big achievement, but I wasn’t happy at all. The memory of my two beloved projects was still fresh. I knew I’d have to work on AC. There wasn’t any way around it. As predicted, I started working on Syndicate early in the development cycle. I wanted to give it a try even though I feared I wouldn’t like it. At first, since there wasn’t much to do on the technical side, I collaborated a lot on Assassin’s Creed Unity (ACU) with the Montreal studio. I worked on cool new tech developed for ACU, and it was fun and challenging. I got along well with most of my Montreal co-workers (even though it’s harder to develop a good relationship when you communicate mostly by email). I continued collaborating on ACU every now and then until it shipped. After a few months, Syndicate started for real. The team was getting bigger and bigger as we entered production. For me, this is the root of all issues on AAA games: big teams. Too many people. Syndicate was created through collaboration with about 10 studios around the world. This is 24-hour nonstop development. When people go to sleep in one studio, it’s morning in another. With so many people involved, specialization naturally occurs. There’s a lot of work to do, and no one can master all the game’s systems. So people specialize, there’s no way around it. It’s like an assembly line in a car factory: When people realize they’re just one replaceable person on a massive production chain, you can imagine it affects their motivation. With specialization often comes tunnel vision. When your expertise is limited to, say, art, level design, performances, or whatever, you’ll eventually convince yourself that it’s the most important thing in the game. People become biased toward their own expertise. It makes decision making a lot more complicated. More often than not, the loudest voice wins, even if it doesn’t make much sense. On large-scale projects, good communication is, simply put, impossible. How do you get the right message to the right people? You can’t communicate everything to everyone; there’s just too much information. Hundreds of decisions are made every week. Inevitably, at some point, someone who should have been consulted before making a decision will be forgotten. This creates frustration over time. On top of that, often too many people are involved in making a decision. You don’t usually want to make a decision in a meeting with 20 people. That’s inefficient. So the person in charge of the meeting chooses who will be present—and too bad for the others. What’s it going to be? A huge, inefficient meeting where no decision is made, or a small meeting that goes well but creates frustration in the long run? Being an architect, I had a high-level view of all technical developments on the project. While that sounds cool, it has its disadvantages. The higher you go up the ladder, the less of a concrete impact you have on the game. You’re either a grunt who works on a tiny part of the game (“See that lamppost? I put it there!”), or you’re a high-level director who writes emails and goes to meetings (“See that road full of lampposts? I approved that.”). Both positions suck for different reasons. No matter what your job, you don’t make a significant contribution to the game. You’re a drop in a glass of water, and as soon as you realize that, your ownership evaporates in the sun. And without ownership, there’s no motivation. I could go on and on. There are tons of other reasons why AAA projects are unsatisfying. Don’t get me wrong: It’s nothing specific to Ubisoft or Assassin’s Creed games. This is an inevitable side effect of creating huge games with an enormous team. I have to add that, obviously, some people are motivated. They are usually juniors and people who never got the chance to work on a AAA project before. But the excitement disappears after you’ve done it a couple of times, and you’re left with the sad day-to-day reality. That’s a huge problem for studios working on one AAA project after another. Senior staff members get tired and leave. Taking the Leap of Faith Since my very beginning at Ubisoft, I knew I wouldn’t spend the rest of my days there. I was already dreaming of starting my own indie company. Making my own games. Back then, I didn’t know much about making games. I still don’t know a lot, just a tiny bit more. Indie games don’t suffer from big-project issues. I think the ideal team size is five or six people. That’s when team spirit is highest, as well as ownership and drive. You’re not wasting time with endless email threads and bad communication. There’s a lot less specialization, because a handful of people are doing everything. The job isn’t tedious, and it rewards you every day. For me, going indie also means I can work on nontechnical stuff. I like tech, but I also love the creative aspect of games: gameplay, visuals, sounds, ambiance, the whole experience. Only indie games will let me cover all aspects of the creation process. So that’s it. That’s the number one reason I quit Ubi to make indie games. I’m sure if you ask other developers, they’ll tell you another story. Some of them really like it, I’m sure. Others might be unhappy for a completely different reason. For me, this leap of faith was the right and only thing to do. A version of this story first appeared on gingearstudio.com. ", "title": "War Stories: What It’s Really Like Working on AAA Games at Ubisoft", "sentences": [{"90d4": "War Stories: What It’s Really Like Working on AAA Games at Ubisoft"}, {"08a1": "Or why I quit my dream job to go indie"}, {"3eea": "Back in 2005, my boss asked me where I saw myself in 10 years. I answered without hesitation: I want to be a software architect on a big-ass AAA project. The dream came to life a few years later when I began working on Assassin’s Creed Syndicate as — wait for it — software architect. I was fulfilling my dream of becoming a well-respected game developer, working on a prestigious AAA franchise."}, {"824b": "Then, I suddenly quit and started a small indie games business with my girlfriend. Some of my friends and family found that move—let’s just say bold. They wondered why I left a safe, well-paying job with tons of advantages, including the excitement and fame of working on the next game everyone will talk about."}, {"afb1": "On my last day at Ubisoft, as I said goodbye to my colleagues, nobody asked why I was leaving to work on my own games. Even people who barely knew me had a pretty good idea. Many were actually envious, although they worked on Syndicate, too, realizing one of their own dreams. I’m sure many professional game developers might have a clue about why I made this move."}, {"07e6": "So I decided to write about the reality of AAA games development, or: How I learned to stop worrying and go indie."}, {"792a": "Modest Beginnings"}, {"8d65": "In 2005, Ubisoft announced it would open a new studio in Quebec City, about 250 kilometers from the famous Ubisoft Montreal studio that created all kinds of obscure games like Prince of Persia: The Sands of Time, Splinter Cell, and Assassin’s Creed. I was recruited on day one, together with about 30 other employees. You can imagine that I was really excited. I celebrated by spending my future paycheck on a brand-new $2,000 guitar. (Five years later, I totally stopped playing guitar. Yeah, not my best move.)"}, {"8686": "Most people who start a career in game development, whether in design, art or programming, are very passionate. They love playing video games, and they love creating them. During my first weeks at Ubisoft, I couldn’t believe I was actually getting paid to do this. It was better than holidays."}, {"987a": "For the first two years, I worked on small PSP titles: Open Season and Surf’s Up on the Playstation Portable. Those are average games, not especially good or bad, but I had a lot of fun working on them. I learned a lot and made good friends. The teams were pretty small—between 15 and 25 people, if I remember correctly—so everyone knew everyone else. It felt like a little family, and the team spirit was good. In retrospect, we were a bunch of noobs who had a lot homework to do."}, {"056e": "The thing is, we all wished we could work on bigger projects, AAA projects. It’s not super-glamorous to tell your friends you’re working on some kid’s movie game. Nobody begins a career in video games to work on that kind of title."}, {"6792": "The PoP Years"}, {"0c40": "After Surf’s Up, our studio director met us in a conference room. (Yeah, the entire team fit in a single room. Ahhh, the good old days). He announced that our next project would be the Wii version of the upcoming Prince of Persia (PoP) game. I distinctly remember an awkward silence afterward. Nobody knew if it was good or bad news."}, {"d8b7": "Then someone shouted, “YES!”"}, {"726e": "Of course, YES. This was way better than our previous projects. It wasn’t Assassin’s Creed, but who cares? I remember being a bit disappointed by the console (at the time, I was super-excited by the PS3 and not so much about the Wii), but overall, it was very good news."}, {"7ae3": "The project lasted about three years and became known as Prince of Persia: The Forgotten Sands. It wasn’t a port from the 360/PS3 version. We made a specific version just for the Wii. It’s a really good game. If you didn’t play it back then, go dust off your Wii and give it a try."}, {"ff04": "During my time at Ubisoft, that’s the project I’m proudest of. I had a lot of fun, and I had ownership, meaning I strongly believed that my work had a major impact on the game. My contribution was significant, and I could see it everywhere when I was playing the game. So, obviously, I was super-motivated. I wanted that game to be the most awesome game ever. Most developers know that feeling well."}, {"13f4": "At the team’s peak, we had about 75 developers. A big family, but still a family. Over the course of the project, I interacted with most of them. I’m pretty sure I talked at least once to everyone on the project. You might wonder why I focus so much on team sizes, but more on that later."}, {"9101": "AC3 WiiU"}, {"8cdd": "After PoP, I contributed to several games here and there and eventually landed on a technically challenging project: porting Assassin’s Creed 3 (AC3) on the WiiU. This was much different from my previous work. The team was small: two programmers at the beginning, and about 15 or so at the peak."}, {"65bc": "I was excited by the challenge. Most people at Ubisoft didn’t think we’d be able to pull it off. All Assassin’s Creed titles are intense games in terms of CPU and GPU performance. Believe me, your console is pretty much at its maximum capacity when running around in a big city like Boston or London. The WiiU was less powerful than the PS3 and XBox 360, at least on paper, so the odds weren’t on our side. Even worse: We had to make a straight port—that is, no data changes, just code optimizations. It’s much cheaper to do a straight port than to downgrade all game assets."}, {"4589": "After about a year, we reached a point where it became obvious that we had successfully ported the game with similar performance as the 360/PS3. It was a huge success. Even Nintendo engineers were surprised we made it. Life was great."}, {"72db": "The downside was that the second half of the project was relatively boring. The challenge was gone. Port code, fix bugs, and optimize. Rinse and repeat until the game is shipped. I have good memories of this project, but by the end I was ready to do something completely different."}, {"4f3b": "Tasting the Forbidden Fruit"}, {"9836": "After AC3, I worked on two internal pitches. For legal reasons, I can’t say much about those projects, but they were so important to me that I need to take some time to talk about them."}, {"4060": "On the first project, we were a team of about six developers, all very senior. It was a multiplayer game, and our goal was to create a functional prototype in about a month. Our days went somewhat like this:"}, {"4894": "The team spirit was so good! Our motto was “on est crinqués!,” which more or less translates to “we’re so hyped!” During our play sessions, we were so excited that we were screaming and shouting all over the place. I think it bothered colleagues working next to us, but hell, we had so much fun. I didn’t feel too guilty."}, {"b90a": "Since we were such a small team that we had to break down the traditional job barriers. Everyone had their say in the game design. A UI artist made the level design because we didn’t have a level designer with us. I did gameplay programming, which isn’t my speciality at all. (I’m more of a low-level, engine and graphics guy.) But we all really enjoyed it."}, {"5243": "Unfortunately, for various reasons, the project was canceled."}, {"ddb2": "Then I started on another internal pitch with an even smaller team: two developers and one producer. This project definitely had that “indie” feeling. It was another multiplayer game, and again we made a pretty awesome prototype in a few weeks. Every day during lunch, we invited everyone in the studio to play. We even organized an internal tournament that attracted around 60 participants."}, {"051d": "But again, the project was canceled."}, {"5d74": "I was never as happy at Ubisoft as during those two projects. I worked with very talented and motivated individuals. Because of the smaller team sizes, I had my say on the creative side of things. This was a nice change — being more of a technical guy, I could never do that before. And I absolutely loved it. When you work on a small project, your contribution is huge. So is your ownership. And your motivation."}, {"e140": "One of my former colleagues nailed it when he said that I tasted the forbidden fruit. Once you’ve have that feeling, you can never go back."}, {"6335": "AC Syndicate"}, {"e8ef": "The studio received the mandate to lead the next Assassin’s Creed title: Syndicate. We knew the AC franchise well because we collaborated on every title since Brotherhood. However, this was not a collaboration like before. For the first time ever, the Quebec studio, not Montreal, would lead an Assassin’s Creed game. This was a big achievement, but I wasn’t happy at all. The memory of my two beloved projects was still fresh. I knew I’d have to work on AC. There wasn’t any way around it."}, {"8a35": "As predicted, I started working on Syndicate early in the development cycle. I wanted to give it a try even though I feared I wouldn’t like it. At first, since there wasn’t much to do on the technical side, I collaborated a lot on Assassin’s Creed Unity (ACU) with the Montreal studio. I worked on cool new tech developed for ACU, and it was fun and challenging. I got along well with most of my Montreal co-workers (even though it’s harder to develop a good relationship when you communicate mostly by email). I continued collaborating on ACU every now and then until it shipped."}, {"20dc": "After a few months, Syndicate started for real. The team was getting bigger and bigger as we entered production. For me, this is the root of all issues on AAA games: big teams. Too many people. Syndicate was created through collaboration with about 10 studios around the world. This is 24-hour nonstop development. When people go to sleep in one studio, it’s morning in another."}, {"2620": "With so many people involved, specialization naturally occurs. There’s a lot of work to do, and no one can master all the game’s systems. So people specialize, there’s no way around it. It’s like an assembly line in a car factory: When people realize they’re just one replaceable person on a massive production chain, you can imagine it affects their motivation."}, {"2aca": "With specialization often comes tunnel vision. When your expertise is limited to, say, art, level design, performances, or whatever, you’ll eventually convince yourself that it’s the most important thing in the game. People become biased toward their own expertise. It makes decision making a lot more complicated. More often than not, the loudest voice wins, even if it doesn’t make much sense."}, {"a949": "On large-scale projects, good communication is, simply put, impossible. How do you get the right message to the right people? You can’t communicate everything to everyone; there’s just too much information. Hundreds of decisions are made every week. Inevitably, at some point, someone who should have been consulted before making a decision will be forgotten. This creates frustration over time."}, {"bf23": "On top of that, often too many people are involved in making a decision. You don’t usually want to make a decision in a meeting with 20 people. That’s inefficient. So the person in charge of the meeting chooses who will be present—and too bad for the others. What’s it going to be? A huge, inefficient meeting where no decision is made, or a small meeting that goes well but creates frustration in the long run?"}, {"e19c": "Being an architect, I had a high-level view of all technical developments on the project. While that sounds cool, it has its disadvantages. The higher you go up the ladder, the less of a concrete impact you have on the game. You’re either a grunt who works on a tiny part of the game (“See that lamppost? I put it there!”), or you’re a high-level director who writes emails and goes to meetings (“See that road full of lampposts? I approved that.”). Both positions suck for different reasons. No matter what your job, you don’t make a significant contribution to the game. You’re a drop in a glass of water, and as soon as you realize that, your ownership evaporates in the sun. And without ownership, there’s no motivation."}, {"cd9d": "I could go on and on. There are tons of other reasons why AAA projects are unsatisfying. Don’t get me wrong: It’s nothing specific to Ubisoft or Assassin’s Creed games. This is an inevitable side effect of creating huge games with an enormous team."}, {"8587": "I have to add that, obviously, some people are motivated. They are usually juniors and people who never got the chance to work on a AAA project before. But the excitement disappears after you’ve done it a couple of times, and you’re left with the sad day-to-day reality. That’s a huge problem for studios working on one AAA project after another. Senior staff members get tired and leave."}, {"8293": "Taking the Leap of Faith"}, {"f8bf": "Since my very beginning at Ubisoft, I knew I wouldn’t spend the rest of my days there. I was already dreaming of starting my own indie company. Making my own games. Back then, I didn’t know much about making games. I still don’t know a lot, just a tiny bit more."}, {"81d5": "Indie games don’t suffer from big-project issues. I think the ideal team size is five or six people. That’s when team spirit is highest, as well as ownership and drive. You’re not wasting time with endless email threads and bad communication. There’s a lot less specialization, because a handful of people are doing everything. The job isn’t tedious, and it rewards you every day."}, {"4bf5": "For me, going indie also means I can work on nontechnical stuff. I like tech, but I also love the creative aspect of games: gameplay, visuals, sounds, ambiance, the whole experience. Only indie games will let me cover all aspects of the creation process."}, {"c4fe": "So that’s it. That’s the number one reason I quit Ubi to make indie games. I’m sure if you ask other developers, they’ll tell you another story. Some of them really like it, I’m sure. Others might be unhappy for a completely different reason."}, {"2e09": "For me, this leap of faith was the right and only thing to do."}, {"2820": "A version of this story first appeared on gingearstudio.com."}], "child": "606_1\t606_2\t606_3\t606_4\t606_5\t606_6\t606_7\t606_8\t606_9\t606_10\t606_11\t606_12\t606_13\t606_14\t606_15\t606_16\t606_17\t606_18\t606_19\t606_20\t606_21\t606_22\t606_23\t606_24\t606_25"}