{"name": "607", "parent": "", "content": "War Stories: A Year and a Half of Instapainting Chinese fine art factories, commoditization, Instagram threats, an Eastern European shakedown, and a plan to revolutionize the modern artist’s studio When Pope Julius II commissioned Michelangelo to paint the ceiling of the Sistine Chapel, Michelangelo toiled for four years on his master work. Renoir spent six months painting Luncheon of the Boating Party — the painting featured in the film Amélie. Even Guernica, which Pablo Picasso painted quickly to publicize the bombing of the city of Guernica during the Spanish civil war, took over a month to complete. When we founded Instapainting in 2014, offering inexpensive oil painting reproductions from photographs over the internet, we knew we had to work much faster. We estimated we’d need to produce thousands of paintings a month to support a company of any significant size, and this raised a big question for us: How do you scale art? The question seemed challenging not only to us, but to our backers at YCombinator. It piqued the interest of the Reddit community, where we first announced our plans. Seasoned tech reporters soon joined in, and we won a favorable report in Techcrunch, giving us the momentum and visibility we needed to get started in earnest. Within two weeks we had more than 20 orders, forcing us to ramp up production immediately. As it turns out, there already is an answer to our question: it’s called China. More specifically, the answer lies in Dafen, a Chinese village where 8,000 artists working on the art world’s version of assembly lines produce three to five million paintings a year. It’s a unique place with a fascinating history, and neither our business nor much of the modern art world could exist without it. Launching Instapainting We’d barely launched when the solution fell in our laps. Chinese business people contacted us, offering to produce our paintings. They owned art studios, which were nearly all located in Dafen, and their painters already created artwork for competing websites that offered custom oil paintings. On the one hand, this was mostly great news — we could easily and cheaply source the orders coming through our website much quicker than we’d originally anticipated. On the other, it was a little like a kick in the stomach: others had gotten here first, even if they weren’t widely known in the U.S. We had barely even started, yet we were already a commodity service. Our biggest advantage, it seemed, was our positive reception in the press. We quickly realized we’d need to come up with a new plan to set us apart and deliver value over and above a simple web-ordering mechanism. We caught Instagram’s attention too, and it landed us our first problem. Their legal department demanded we stop using the “Insta” prefix in our name, or remove all references to Instagram on our site (for the record, the prefix references our fast ordering process and turnaround time, much like Instacart). We acquiesced, and after doing so they changed their demands to include we remove all references to Facebook — the Like button, our Facebook page, and Facebook image uploading. We weighed the cost and benefits and decided to keep the name, and more importantly, our established brand and domain. Encouraged by the initial burst of demand, and still eager to pursue and improve on our initial idea, we headed to China. The Fine Art Factories of Dafen China is big. Really big. So unfathomably big that individual Chinese cities provide individual products for the entire world. The residents of Yiwu, China’s “Christmas Village,” manufactures 60 percent of the world’s Santa hats, tinsel, and mistletoe. Dafen produces 60 percent of the world’s oil paintings. China has economies of scale on a scale that the economists who coined the term “economies of scale” never imagined. Dafen took its first step from sleepy village to key piece of the art world in 1989. A businessman named Huang Jiang had received a large number of orders when he displayed the work of local artists at a Hong Kong art fair. So he hired assistants and started a studio in Dafen to pump out paintings. Jiang had chosen an excellent location. Land and labor was cheap, yet the village is in Shenzhen, China’s most successful Special Economic Zone, and very close to Hong Kong — the gateway to China for foreign businesspeople. The success of Jiang’s studio drew art students and novice painters to Dafen, who were employed by bosses opening new studios. By 2002, Dafen was home to 150 galleries. Today, the roughly 8,000 painters of Dafen power a global industry worth well over $100 million. According to accounts from Chinese officials and Western press, Huang Jiang became the Henry Ford of China’s art world. He built up his studio into a factory with 3 floors: a ground floor for packaging and shipping works of art, a second story of painting areas, and a third floor of dormitories for the painters. Other studios followed suit. Art historian Winnie Won Yin Wong writes that from 1989 to 2009, studios in Dafen progressed from “rural workshops” to the “assembly of larger groups of painters into a single space for higher-volume production.” Dafen’s well known paintbrush sculpture. One of Jiang’s first, large orders — which he received via businesspeople in Hong Kong — was to produce kitschy art for K-Mart. Jiang met these massive orders thanks to his workforce of several hundred painters and as many as 2,000 subcontracted artists. One colleague of Jiang told Wong that Jiang’s largest contract was for 250,000 identical paintings. The existence of art factories like Jiang’s essentially allowed Western businesses to make art like they did phones: mass produce them by outsourcing the work to China. Today, the majority of budget-priced art (think of the identical paintings you see for sale in Walmart or gracing the hallways of airports and hotels) comes from Dafen. Even episodes of The Simpsons are animated in Asia. If you’ve ever been to a budget art sale hosted in a hotel or convention center with stacks of pre-framed paintings of uncertain origin, they were mass produced in China. These massive orders led studios like Jiang’s to specialize. Some painters in Dafen spend all day painting portraits of popular American celebrities. Others exclusively paint reproductions of the Mona Lisa or Van Gogh’s Sunflowers. (Town officials defend the prevalence of copies of famous paintings in Dafen by noting that Chinese copyright law allows reproductions if the artist has been dead for more than 50 years.) Painters in the largest studios spend hours painting individual brushstrokes or features on hundreds of canvases — similar to how a worker in a Ford plant once spent all day tightening one screw on hundreds of Model T cars. By the mid-1990s, Wu Ruiqiu, the manager of an art studio in Dafen, was boasting that his painters formed an “assembly line” that produced thousands of identical paintings for the likes of Walmart. We saw a similar assembly line firsthand during a trip to China. We actually first went to a painting studio in Yiwu, the town known for mass-producing Christmas decorations. The studio was a bare, concrete building. A painter with rows and rows of the same half-finished canvasses scooped up paint and went down the row. He painted an identical brushstroke on each painting, and then repeated the process. One brushstroke at a time, the paintings made their way toward completion. Yiwu, Zhejiang is located in a rural part of China, far from first-tier cities. Even on a 350-kilometer-per-hour bullet train, the trip took more than an hour and 30 minutes from Shanghai. The outside of the painting factory. Painters apply the same set of strokes down an aisle of identical paintings in Yiwu, Zhejiang. Photographer Susetta Bozzi has documented similar studios in Dafen, where artists often paint this way in teams. They paint with spectacular productivity: single painters can produce thousands of paintings in a year, or even 10,000. While painting commercial replicas is often derided by American artists as unskilled, soul-sucking labor, not all Chinese artists found it to be a bad arrangement. Many found ways to create their own challenges or increase their personal development while still making a living. Zeng Shao Min and Chen Lan Fang both work in oil painting production lines in Xiamen, China. “Usually when we do practices, we would also draw the same thing again and again and look for something more interesting out of that,” Zeng Shoa Min told me. “I would make sure that I can reproduce the shape and color of every spot without looking at the model copy,” said Chen Lan Fang. Others were just pragmatic. “If the price is right. One has to eat. No helping it. Draw away,“ said Yao Jia Quan, an artist in Dafen. This canvas print by American artist Jean Liang is offered in her online store, but she doesn’t offer custom commissions because it would be too pricey and time-consuming. Like most American artists, she works in the game, film, and tv industry. It was both impressive and baffling to see one artist paint hundreds of identical paintings at a time. But the sight also presented ideas for us to differentiate our service, something we already knew was urgent — all the more so after we received a threatening email from a competitor using an IP address originating from Serbia. The sender demanded we join them in a price-fixing scheme to block direct competition from China. “There are many more things we know or could do, but to avoid any problems with us, I would suggest that you keep advertisement [sic] on a low profile and increase pricing or keep it on a reasonable high level,” the message read in part. We mostly ignored the threat. Shortly after our initial ad run, our Adwords referral traffic dropped from about 30 seconds to less than four seconds spent on our site. After we received the email threat, we contacted Google because it was clear something suspicious was going on. They investigated and concluded there was no fraud, so we had no choice but to comply with the email and cease advertising since each click was costing us $2 to $5. Consuming our $60-a-day ad budget with fraudulent clicks didn’t require a BOTNET. In the end, we preferred to compete on features and service. San Francisco artist Happy Dee offers custom paintings on Instapainting.com beyond just photorealistic renditions, something the Chinese artists won’t do. One of our first innovations was Creative Art, a new product line that aimed to take full advantage of artists able to go beyond simple photorealistic copying and add a level of imagination to their work. The feature lets any painter on Instapainting list creative styles that deviate from or build on the original photographs being painted. This now allows us to refer requests for anything beyond photo-to-painting to someone who can offer their unique creativity, opening to the doors to U.S. and other artists who might not otherwise be able to compete with the Chinese mass production system. At the same time, many of the creative artists do come from China. Dafen, it seems, is home to many more talented artists than you’d expect from its mass production and assembly line reputation. The Mythology of Dafen When Winnie Won Yin Wong, the author of Van Gogh on Demand, started studying Dafen, she expected to find “a den of copycats” and assembly lines churning out hotel room art. So did we. To her surprise, and ours, the artistry at Dafen was much less industrialized than we expected. Dafen is home to some large studios, but most studios house a few dozen or just a few artists. During our visit, the artists making reproductions also displayed their own, original art, which they sold at prices nearly as expensive as American art. (At least at the prices they told us.) Many art stalls in Dafen village were wary of us taking close-up photos, afraid that other Chinese artists would copy and reproduce their original works. In Van Gogh on Demand, Wong recounts how Hong Kong businesspeople had turned to rural, Chinese art studios to meet large orders from Western businesses since before Dafen’s first art studio opened. Huang Jiang’s workshop in Dafen, which has been mythologized as inventing the art factory model, was so typical of the industry that when a government official visited in 1999, he did not understand the fuss. The assembly line rhetoric, however, was a media coup. American journalists and readers loved the idea of a factory that spewed out Monet paintings. And it likely played well with Western executives, who preferred to hear that their product was being mass-produced in factories rather than subcontracted to rural artists. Many art stalls in Dafen village were wary of us taking closeup photos, afraid that other Chinese artists would copy and reproduce their original works. Not all Chinese artists churn out low-cost art. This original ink wash painting, by artist Yuang Wang (she works at Twitter), is available as a fine art print. The State of Instapainting A year and a half after our launch, we’ve delivered thousands of handmade oil paintings to Instapainting customers. We face a number of challenges and lingering questions as we grow: the challenge of detaching from the low-quality brand of Chinese-made products, being accused of running sweatshops and taking away jobs from American artists, the question of how to increase awareness. Yet we never worry about finding enough artists to paint for us. In light of the abundant supply of artists, we’ve been able to shift our focus back into our strength: technology. We started out as a technology company and were funded by Silicon Valley technology investors. And while it may not appear so, there is a slew of custom-engineered software behind the scenes powering the business, ensuring easy scaling, timely order fulfillment, and straightforward communication between Chinese-speaking artists and mostly English-speaking customers. China is known for cheap labor, not cutting-edge technology. Its art studios and factories, while capable of outputting thousands of paintings per month, still do so in a relatively manual way. Each artist wields a brush and looks at a small printout of a photograph as reference, transferring the details stroke-by-error-prone-stroke. Customers want arbitrary details to be perfect and the best we can do to satisfy everyone is to offer them as close to a 100 percent accurate photorealistic rendition as possible. Moving forward, we look to integrate more technology and hardware (like our painting robot, or advanced machine learning) directly into the actual painting process. We envision a future where the artist is aided by robots and algorithms to produce perfect paintings, and cameras are installed so the customer can see real-time progress. Our final goal isn’t to simply make it easy to order artwork: we want to completely revolutionize the modern art studio. Thanks to Dafen, our question of how to produce 10,000 paintings a month was effectively solved. We’re still working on the rest. Thanks to Tim Wu, Jean Liang, and Ryan Bednar for reading drafts of this blog post. Learn More A version of this story was originally published at Instapainting.com on October 28, 2015. ", "title": "War Stories: A Year and a Half of Instapainting", "sentences": [{"f7b7": "War Stories: A Year and a Half of Instapainting"}, {"6509": "Chinese fine art factories, commoditization, Instagram threats, an Eastern European shakedown, and a plan to revolutionize the modern artist’s studio"}, {"a4c0": "When Pope Julius II commissioned Michelangelo to paint the ceiling of the Sistine Chapel, Michelangelo toiled for four years on his master work. Renoir spent six months painting Luncheon of the Boating Party — the painting featured in the film Amélie. Even Guernica, which Pablo Picasso painted quickly to publicize the bombing of the city of Guernica during the Spanish civil war, took over a month to complete."}, {"954c": "When we founded Instapainting in 2014, offering inexpensive oil painting reproductions from photographs over the internet, we knew we had to work much faster. We estimated we’d need to produce thousands of paintings a month to support a company of any significant size, and this raised a big question for us:"}, {"0a1c": "How do you scale art?"}, {"2ab9": "The question seemed challenging not only to us, but to our backers at YCombinator. It piqued the interest of the Reddit community, where we first announced our plans. Seasoned tech reporters soon joined in, and we won a favorable report in Techcrunch, giving us the momentum and visibility we needed to get started in earnest. Within two weeks we had more than 20 orders, forcing us to ramp up production immediately."}, {"48db": "As it turns out, there already is an answer to our question: it’s called China. More specifically, the answer lies in Dafen, a Chinese village where 8,000 artists working on the art world’s version of assembly lines produce three to five million paintings a year. It’s a unique place with a fascinating history, and neither our business nor much of the modern art world could exist without it."}, {"fea5": "Launching Instapainting"}, {"31cc": "We’d barely launched when the solution fell in our laps. Chinese business people contacted us, offering to produce our paintings. They owned art studios, which were nearly all located in Dafen, and their painters already created artwork for competing websites that offered custom oil paintings."}, {"5e56": "On the one hand, this was mostly great news — we could easily and cheaply source the orders coming through our website much quicker than we’d originally anticipated. On the other, it was a little like a kick in the stomach: others had gotten here first, even if they weren’t widely known in the U.S. We had barely even started, yet we were already a commodity service. Our biggest advantage, it seemed, was our positive reception in the press. We quickly realized we’d need to come up with a new plan to set us apart and deliver value over and above a simple web-ordering mechanism."}, {"4c92": "We caught Instagram’s attention too, and it landed us our first problem. Their legal department demanded we stop using the “Insta” prefix in our name, or remove all references to Instagram on our site (for the record, the prefix references our fast ordering process and turnaround time, much like Instacart). We acquiesced, and after doing so they changed their demands to include we remove all references to Facebook — the Like button, our Facebook page, and Facebook image uploading. We weighed the cost and benefits and decided to keep the name, and more importantly, our established brand and domain."}, {"73d9": "Encouraged by the initial burst of demand, and still eager to pursue and improve on our initial idea, we headed to China."}, {"4721": "The Fine Art Factories of Dafen"}, {"7dfb": "China is big. Really big. So unfathomably big that individual Chinese cities provide individual products for the entire world. The residents of Yiwu, China’s “Christmas Village,” manufactures 60 percent of the world’s Santa hats, tinsel, and mistletoe. Dafen produces 60 percent of the world’s oil paintings. China has economies of scale on a scale that the economists who coined the term “economies of scale” never imagined."}, {"66be": "Dafen took its first step from sleepy village to key piece of the art world in 1989. A businessman named Huang Jiang had received a large number of orders when he displayed the work of local artists at a Hong Kong art fair. So he hired assistants and started a studio in Dafen to pump out paintings."}, {"f3ec": "Jiang had chosen an excellent location. Land and labor was cheap, yet the village is in Shenzhen, China’s most successful Special Economic Zone, and very close to Hong Kong — the gateway to China for foreign businesspeople. The success of Jiang’s studio drew art students and novice painters to Dafen, who were employed by bosses opening new studios. By 2002, Dafen was home to 150 galleries. Today, the roughly 8,000 painters of Dafen power a global industry worth well over $100 million."}, {"0b51": "According to accounts from Chinese officials and Western press, Huang Jiang became the Henry Ford of China’s art world. He built up his studio into a factory with 3 floors: a ground floor for packaging and shipping works of art, a second story of painting areas, and a third floor of dormitories for the painters. Other studios followed suit. Art historian Winnie Won Yin Wong writes that from 1989 to 2009, studios in Dafen progressed from “rural workshops” to the “assembly of larger groups of painters into a single space for higher-volume production.”"}, {"262a": "Dafen’s well known paintbrush sculpture."}, {"b470": "One of Jiang’s first, large orders — which he received via businesspeople in Hong Kong — was to produce kitschy art for K-Mart. Jiang met these massive orders thanks to his workforce of several hundred painters and as many as 2,000 subcontracted artists. One colleague of Jiang told Wong that Jiang’s largest contract was for 250,000 identical paintings."}, {"c54d": "The existence of art factories like Jiang’s essentially allowed Western businesses to make art like they did phones: mass produce them by outsourcing the work to China. Today, the majority of budget-priced art (think of the identical paintings you see for sale in Walmart or gracing the hallways of airports and hotels) comes from Dafen. Even episodes of The Simpsons are animated in Asia."}, {"7b80": "If you’ve ever been to a budget art sale hosted in a hotel or convention center with stacks of pre-framed paintings of uncertain origin, they were mass produced in China."}, {"58da": "These massive orders led studios like Jiang’s to specialize. Some painters in Dafen spend all day painting portraits of popular American celebrities. Others exclusively paint reproductions of the Mona Lisa or Van Gogh’s Sunflowers. (Town officials defend the prevalence of copies of famous paintings in Dafen by noting that Chinese copyright law allows reproductions if the artist has been dead for more than 50 years.)"}, {"a692": "Painters in the largest studios spend hours painting individual brushstrokes or features on hundreds of canvases — similar to how a worker in a Ford plant once spent all day tightening one screw on hundreds of Model T cars. By the mid-1990s, Wu Ruiqiu, the manager of an art studio in Dafen, was boasting that his painters formed an “assembly line” that produced thousands of identical paintings for the likes of Walmart."}, {"08cf": "We saw a similar assembly line firsthand during a trip to China. We actually first went to a painting studio in Yiwu, the town known for mass-producing Christmas decorations. The studio was a bare, concrete building. A painter with rows and rows of the same half-finished canvasses scooped up paint and went down the row. He painted an identical brushstroke on each painting, and then repeated the process. One brushstroke at a time, the paintings made their way toward completion."}, {"4765": "Yiwu, Zhejiang is located in a rural part of China, far from first-tier cities. Even on a 350-kilometer-per-hour bullet train, the trip took more than an hour and 30 minutes from Shanghai."}, {"5ea3": "The outside of the painting factory."}, {"b136": "Painters apply the same set of strokes down an aisle of identical paintings in Yiwu, Zhejiang."}, {"c152": "Photographer Susetta Bozzi has documented similar studios in Dafen, where artists often paint this way in teams. They paint with spectacular productivity: single painters can produce thousands of paintings in a year, or even 10,000."}, {"1d22": "While painting commercial replicas is often derided by American artists as unskilled, soul-sucking labor, not all Chinese artists found it to be a bad arrangement. Many found ways to create their own challenges or increase their personal development while still making a living."}, {"2c2a": "Zeng Shao Min and Chen Lan Fang both work in oil painting production lines in Xiamen, China. “Usually when we do practices, we would also draw the same thing again and again and look for something more interesting out of that,” Zeng Shoa Min told me."}, {"884a": "“I would make sure that I can reproduce the shape and color of every spot without looking at the model copy,” said Chen Lan Fang."}, {"a6cc": "Others were just pragmatic."}, {"844d": "“If the price is right. One has to eat. No helping it. Draw away,“ said Yao Jia Quan, an artist in Dafen."}, {"a182": "This canvas print by American artist Jean Liang is offered in her online store, but she doesn’t offer custom commissions because it would be too pricey and time-consuming. Like most American artists, she works in the game, film, and tv industry."}, {"e9a5": "It was both impressive and baffling to see one artist paint hundreds of identical paintings at a time. But the sight also presented ideas for us to differentiate our service, something we already knew was urgent — all the more so after we received a threatening email from a competitor using an IP address originating from Serbia. The sender demanded we join them in a price-fixing scheme to block direct competition from China. “There are many more things we know or could do, but to avoid any problems with us, I would suggest that you keep advertisement [sic] on a low profile and increase pricing or keep it on a reasonable high level,” the message read in part."}, {"217e": "We mostly ignored the threat. Shortly after our initial ad run, our Adwords referral traffic dropped from about 30 seconds to less than four seconds spent on our site. After we received the email threat, we contacted Google because it was clear something suspicious was going on. They investigated and concluded there was no fraud, so we had no choice but to comply with the email and cease advertising since each click was costing us $2 to $5. Consuming our $60-a-day ad budget with fraudulent clicks didn’t require a BOTNET."}, {"58eb": "In the end, we preferred to compete on features and service."}, {"d85c": "San Francisco artist Happy Dee offers custom paintings on Instapainting.com beyond just photorealistic renditions, something the Chinese artists won’t do."}, {"8a07": "One of our first innovations was Creative Art, a new product line that aimed to take full advantage of artists able to go beyond simple photorealistic copying and add a level of imagination to their work. The feature lets any painter on Instapainting list creative styles that deviate from or build on the original photographs being painted. This now allows us to refer requests for anything beyond photo-to-painting to someone who can offer their unique creativity, opening to the doors to U.S. and other artists who might not otherwise be able to compete with the Chinese mass production system."}, {"3f40": "At the same time, many of the creative artists do come from China. Dafen, it seems, is home to many more talented artists than you’d expect from its mass production and assembly line reputation."}, {"44b1": "The Mythology of Dafen"}, {"83ca": "When Winnie Won Yin Wong, the author of Van Gogh on Demand, started studying Dafen, she expected to find “a den of copycats” and assembly lines churning out hotel room art. So did we. To her surprise, and ours, the artistry at Dafen was much less industrialized than we expected."}, {"4530": "Dafen is home to some large studios, but most studios house a few dozen or just a few artists. During our visit, the artists making reproductions also displayed their own, original art, which they sold at prices nearly as expensive as American art. (At least at the prices they told us.)"}, {"dfe6": "Many art stalls in Dafen village were wary of us taking close-up photos, afraid that other Chinese artists would copy and reproduce their original works."}, {"13ed": "In Van Gogh on Demand, Wong recounts how Hong Kong businesspeople had turned to rural, Chinese art studios to meet large orders from Western businesses since before Dafen’s first art studio opened. Huang Jiang’s workshop in Dafen, which has been mythologized as inventing the art factory model, was so typical of the industry that when a government official visited in 1999, he did not understand the fuss."}, {"3dcb": "The assembly line rhetoric, however, was a media coup. American journalists and readers loved the idea of a factory that spewed out Monet paintings. And it likely played well with Western executives, who preferred to hear that their product was being mass-produced in factories rather than subcontracted to rural artists."}, {"4b3b": "Many art stalls in Dafen village were wary of us taking closeup photos, afraid that other Chinese artists would copy and reproduce their original works."}, {"73dc": "Not all Chinese artists churn out low-cost art. This original ink wash painting, by artist Yuang Wang (she works at Twitter), is available as a fine art print."}, {"aaac": "The State of Instapainting"}, {"bea5": "A year and a half after our launch, we’ve delivered thousands of handmade oil paintings to Instapainting customers. We face a number of challenges and lingering questions as we grow: the challenge of detaching from the low-quality brand of Chinese-made products, being accused of running sweatshops and taking away jobs from American artists, the question of how to increase awareness. Yet we never worry about finding enough artists to paint for us."}, {"a815": "In light of the abundant supply of artists, we’ve been able to shift our focus back into our strength: technology. We started out as a technology company and were funded by Silicon Valley technology investors. And while it may not appear so, there is a slew of custom-engineered software behind the scenes powering the business, ensuring easy scaling, timely order fulfillment, and straightforward communication between Chinese-speaking artists and mostly English-speaking customers."}, {"ab45": "China is known for cheap labor, not cutting-edge technology. Its art studios and factories, while capable of outputting thousands of paintings per month, still do so in a relatively manual way. Each artist wields a brush and looks at a small printout of a photograph as reference, transferring the details stroke-by-error-prone-stroke. Customers want arbitrary details to be perfect and the best we can do to satisfy everyone is to offer them as close to a 100 percent accurate photorealistic rendition as possible."}, {"fbfd": "Moving forward, we look to integrate more technology and hardware (like our painting robot, or advanced machine learning) directly into the actual painting process. We envision a future where the artist is aided by robots and algorithms to produce perfect paintings, and cameras are installed so the customer can see real-time progress. Our final goal isn’t to simply make it easy to order artwork: we want to completely revolutionize the modern art studio."}, {"65fe": "Thanks to Dafen, our question of how to produce 10,000 paintings a month was effectively solved. We’re still working on the rest."}, {"7da4": "Thanks to Tim Wu, Jean Liang, and Ryan Bednar for reading drafts of this blog post."}, {"e51b": "Learn More"}, {"fd1c": "A version of this story was originally published at Instapainting.com on October 28, 2015."}], "child": "607_1\t607_2\t607_3\t607_4\t607_5\t607_6\t607_7\t607_8\t607_9\t607_10\t607_11\t607_12\t607_13\t607_14\t607_15\t607_16\t607_17607_1\t607_2\t607_3\t607_4\t607_5\t607_6\t607_7\t607_8\t607_9\t607_10\t607_11\t607_12\t607_13\t607_14\t607_15\t607_16\t607_17"}