{"name": "609", "parent": "", "content": "When I Learned that Computers Have Soul A chance encounter with a haunting piece of code got me hooked on a life with computers. When I was 14 or so, in 1989, I worked at the Advanced Communications Lab of Kiev’s Communications College, a 2-year “technical professional” training school, at the time known by its Russian-language acronym KPTS. “Worked” in the sense that I talked the guy who ran the lab into giving me after-hours access to the various Soviet Bloc-made computing equipment (built mostly on East German and Russian clones of Intel and Zilog chips) in exchange for on-demand utility coding. Despite having some fairly advanced hardware (especially for late-‘80s Soviet Ukraine), the lab had no actual software developers on staff, and having an extremely enthusiastic, if underaged, hacker around, ready to whip out an inventory tracker or unit converter, was apparently quite handy. Of course, to me there was little difference between “work” and “after-hours” — I got to write code, and that was all that mattered. I also got to play with fiber optic splicing, but that’s a different story. That spring, a coder friend of mine stopped by our little “PC room” to show me a “demo.” The room consisted of 6 shiny new ES-1842s — Soviet clones of the 80286 XT (with stunning EGA color!). “Demos” used to be small pieces of carefully optimized code built specifically to showcase some unusual or unexpected functionality of the hardware at hand, and, by extension, the programming skill of its creator. I had no idea where my friend got it, but it sure wasn’t his work. As he hit Enter to launch the executable from the command line, I was stunned to hear a crackling but definitely digitally sampled human voice, wheezing out of the tiny PC speaker for the first time in my life. Though I was a fairly versatile coder, I wasn’t at all aware of pulse-width modulation, and didn’t think a desktop PC could make more interesting sounds than simple square wave tones. The clip crackling out of the speaker was just a couple seconds, looping words “forever… and ever… you stay in my heart…” while two colorful ASCII-art spirals swirled on the screen, the cursor flickering wildly in the top left corner, and rainbow strings of text fading in and out, sending “greets” from the author, to some faraway coders. The thought “computers are magical” rippled through my mind like a glorious 6-bit digital-to-analog shockwave, and my life was changed forever. I knew I wanted to make computers do magical things for the rest of my life. More importantly, I wanted to know who was the woman singing this magical song, of which I now knew but one line. Levchin’s boyhood apartment building, 66 Lenin Street. (As with much in Kiev, the street name later changed.) The rightmost window on the first floor was his bedroom. Photo via Google Street View. A couple years later, as my family departed the Soviet Union for the first and last time, I was politely “asked” to leave my wooden box with the treasure trove of 3” floppy disks in the hands of the customs agent in Moscow. The demo executable, which I kept around as a sentimental memento of my irrevocable commitment to all things nerdy, on its own special disk, was confiscated. I still had no information as to the identity of the magical singing woman, and who was it that she was keeping in her heart, forever and ever. With time, the acute curiosity faded, but the single-line sample looped in my memory often, a reminder of how it all became so clear to me. Even after the public web became the repository of all knowledge, I simply hadn’t thought to Google her, or perhaps the worry of blowing up the magical memory bubble somehow kept me from looking her up. Nearly 30 years later, I walked into what one might consider a serviceable coffee shop in San Francisco’s Financial District, and heard her. No announcement, no fair warning, I walked in for a cup of drip, and there she was, just forever- and ever-ing away, like three decades were nothing. Without much time to waste on remembrances of things past, I got to Shazam in six taps and that very same magic was back, but the mystery was over: Aretha Franklin, I Say A Little Prayer. Spotify had dozens of renditions, including the Dionne Warwick 1967 original, and for the next 24 hours my reminiscence was in its highest gear. Undoubtedly, the two people following my playback stream on Spotify were somewhat surprised to see exactly one soul track on repeat, but magic and I had a lot of catching up to do. Except, I knew it was not the right song. Or rather, the song was right, but the rendition wasn’t — though the track I heard was certainly muddled by the hardware never meant to do more than simple bleeps, I could tell this wasn’t it. The magical woman was singing the right words, but I knew she never peddled psychic friendships, nor was she The Queen of Soul herself. So, a day after, while driving (I know, I know), between three stop lights, I once again used my phone to resolve the last bit of the mystery. After two searches, Google uncovered the name which sent warm waves of memory through my head: atom.exe, some then-kid hacker’s summer project — a demo he coded on his own. I certainly coded plenty of those in the decade after atom.exe and I first met, though not so much lately. It was like looking back at my barely teenaged self, except this time I was literally looking at it: playing happily on my phone, streaming via an LTE network, near-perfectly reproducing both the text-mode video, cursor flicker and all, as well as the cranky audio, was a YouTube video of the original, captured right off someone’s undoubtedly collector’s-item PC. And right there, in the comments, there she was, the singer credited: Maureen Walsh, covering Dionne’s ditty (and/or Aretha’s anthem) in the first Bomb The Bass disc from 1988. Computers are still magical. Tomorrow, I am going to research what happened to Maureen. Reprinted from here with permission from the author.Follow Backchannel: Twitter | Facebook ", "title": "When I Learned that Computers Have Soul", "sentences": [{"c27b": "When I Learned that Computers Have Soul"}, {"a843": "A chance encounter with a haunting piece of code got me hooked on a life with computers."}, {"e566": "When I was 14 or so, in 1989, I worked at the Advanced Communications Lab of Kiev’s Communications College, a 2-year “technical professional” training school, at the time known by its Russian-language acronym KPTS. “Worked” in the sense that I talked the guy who ran the lab into giving me after-hours access to the various Soviet Bloc-made computing equipment (built mostly on East German and Russian clones of Intel and Zilog chips) in exchange for on-demand utility coding."}, {"edb5": "Despite having some fairly advanced hardware (especially for late-‘80s Soviet Ukraine), the lab had no actual software developers on staff, and having an extremely enthusiastic, if underaged, hacker around, ready to whip out an inventory tracker or unit converter, was apparently quite handy. Of course, to me there was little difference between “work” and “after-hours” — I got to write code, and that was all that mattered. I also got to play with fiber optic splicing, but that’s a different story."}, {"2691": "That spring, a coder friend of mine stopped by our little “PC room” to show me a “demo.” The room consisted of 6 shiny new ES-1842s — Soviet clones of the 80286 XT (with stunning EGA color!). “Demos” used to be small pieces of carefully optimized code built specifically to showcase some unusual or unexpected functionality of the hardware at hand, and, by extension, the programming skill of its creator. I had no idea where my friend got it, but it sure wasn’t his work."}, {"7d63": "As he hit Enter to launch the executable from the command line, I was stunned to hear a crackling but definitely digitally sampled human voice, wheezing out of the tiny PC speaker for the first time in my life. Though I was a fairly versatile coder, I wasn’t at all aware of pulse-width modulation, and didn’t think a desktop PC could make more interesting sounds than simple square wave tones."}, {"fd25": "The clip crackling out of the speaker was just a couple seconds, looping words “forever… and ever… you stay in my heart…” while two colorful ASCII-art spirals swirled on the screen, the cursor flickering wildly in the top left corner, and rainbow strings of text fading in and out, sending “greets” from the author, to some faraway coders."}, {"4cd2": "The thought “computers are magical” rippled through my mind like a glorious 6-bit digital-to-analog shockwave, and my life was changed forever. I knew I wanted to make computers do magical things for the rest of my life. More importantly, I wanted to know who was the woman singing this magical song, of which I now knew but one line."}, {"ac1b": "Levchin’s boyhood apartment building, 66 Lenin Street. (As with much in Kiev, the street name later changed.) The rightmost window on the first floor was his bedroom. Photo via Google Street View."}, {"b3e1": "A couple years later, as my family departed the Soviet Union for the first and last time, I was politely “asked” to leave my wooden box with the treasure trove of 3” floppy disks in the hands of the customs agent in Moscow. The demo executable, which I kept around as a sentimental memento of my irrevocable commitment to all things nerdy, on its own special disk, was confiscated."}, {"e5d0": "I still had no information as to the identity of the magical singing woman, and who was it that she was keeping in her heart, forever and ever. With time, the acute curiosity faded, but the single-line sample looped in my memory often, a reminder of how it all became so clear to me. Even after the public web became the repository of all knowledge, I simply hadn’t thought to Google her, or perhaps the worry of blowing up the magical memory bubble somehow kept me from looking her up."}, {"25c2": "Nearly 30 years later, I walked into what one might consider a serviceable coffee shop in San Francisco’s Financial District, and heard her. No announcement, no fair warning, I walked in for a cup of drip, and there she was, just forever- and ever-ing away, like three decades were nothing. Without much time to waste on remembrances of things past, I got to Shazam in six taps and that very same magic was back, but the mystery was over: Aretha Franklin, I Say A Little Prayer."}, {"3864": "Spotify had dozens of renditions, including the Dionne Warwick 1967 original, and for the next 24 hours my reminiscence was in its highest gear. Undoubtedly, the two people following my playback stream on Spotify were somewhat surprised to see exactly one soul track on repeat, but magic and I had a lot of catching up to do."}, {"9d5b": "Except, I knew it was not the right song. Or rather, the song was right, but the rendition wasn’t — though the track I heard was certainly muddled by the hardware never meant to do more than simple bleeps, I could tell this wasn’t it. The magical woman was singing the right words, but I knew she never peddled psychic friendships, nor was she The Queen of Soul herself."}, {"8e9c": "So, a day after, while driving (I know, I know), between three stop lights, I once again used my phone to resolve the last bit of the mystery. After two searches, Google uncovered the name which sent warm waves of memory through my head: atom.exe, some then-kid hacker’s summer project — a demo he coded on his own. I certainly coded plenty of those in the decade after atom.exe and I first met, though not so much lately."}, {"60c0": "It was like looking back at my barely teenaged self, except this time I was literally looking at it: playing happily on my phone, streaming via an LTE network, near-perfectly reproducing both the text-mode video, cursor flicker and all, as well as the cranky audio, was a YouTube video of the original, captured right off someone’s undoubtedly collector’s-item PC. And right there, in the comments, there she was, the singer credited: Maureen Walsh, covering Dionne’s ditty (and/or Aretha’s anthem) in the first Bomb The Bass disc from 1988."}, {"39bc": "Computers are still magical. Tomorrow, I am going to research what happened to Maureen."}, {"06b4": "Reprinted from here with permission from the author.Follow Backchannel: Twitter | Facebook"}], "child": "609_1\t609_2\t609_3\t609_4"}