{"name": "61", "parent": "", "content": "Examining Carmelo’s Clutch Factor We take a look at how Clutch Carmelo has really been during his tenure with the Knicks Photo: Jim McIsaac Beautiful, yet frightening isn’t it? “Clutch” plays as the clock winds down are some of the most intense moments in basketball. Carmelo Anthony coming in clutch never goes unappreciated. In fact, Clutch ‘Melo has been with us for quite a while. From late quarter buckets that keep the Knicks in the game with momentum to last minute buzzer beaters, Anthony has given the Knicks a lot of big moments. The definition of “clutch” can be muddled very easily since the criteria can be easily manipulated to push a fan narrative of who is a more clutch shooter. So, the definition used here will be under a set of extreme, specific circumstances: Since his first season in New York, Anthony has made eight buckets that take place in the last 24 seconds of the shot clock to tie the game or send the Knicks into overtime in regular season games that end with a Knicks win (via BBall_Reference). Three of those times happened in the 2011–12 season. The fruits of the labor are always the sweetest part, but how many last possession buckets has he taken with the game on the line in total? He’s currently sitting at 22 misses. So, at 8-for-30, he makes a little over a quarter of these clutch shots. via The Knicks Wall/SoundCloud Just to compare another team leader under these constraints LeBron James was found to be 9-for-29 in these situations that date back to his first year as a Miami HEAT. Granted, LeBron’s misses take into account a game-winning block by Amar’e Stoudemire, but a missed shot is a missed shot even when Amar’e personally got that weak stuff out of there. This may seem like another loss for ‘Melo in the rivalry, but teammates actually make all the difference. Photo: Jim McIsaac In the 2010–11 season he was the only Knickerbocker to hit a game-winning shot during those specific “winning time” circumstances. The others, Amar’e, Felton, Wilson Chandler and Shawne Williams (just, why?) all fell short. Looks like the Knicks trade for some clutch shooting as well. That year LeBron only assisted on a game winner to Eddie House. Keep in mind that these statistics only counted the shots that amounted to wins for the player’s team and misses that ended as losses. Which means that if there is enough time left on the clock after the shot falls, defense is huge. If the team’s defense couldn’t come up with a big stop or couldn’t resist an unnecessary foul then the clutch shot is negated. That sounds like a bummer, but does a clutch shot really matter if the team can’t pull it together for one more possession or give it up in OT? Also, if the opposing team has a clutch shooter as trigger happy as ‘Melo, then that could lead down a rabbit hole of a shootout. This isn’t likely, but clutch shot after clutch shot is possible under these restrictive elements. It is important to note that the same team can have other clutch shooters as well. The next year, Wade had three, two more than LeBron who went 1-for-2 that year. Chris Bosh went 1-for-1. That 2011–12 season ‘Melo went 3-of-8 on those shots. His only teammate to make one was the red hot Jeremy Lin during the Linsanity campaign. With a chronically-injured STAT in his best suit and Jared Jeffries on the roster there aren’t a lot of realistic options to defer to. However, during the Knicks 54-win season, JR Smith went 3-for-5 on these clutch field goals, two coming in the same game against Phoenix. ‘Melo was 1-of-7. So, it turns out Mr. Swish was the clutch player that year, and that understandably had a hand in his popularity in New York. via Ximo Pierto/YouTube This season, Anthony has a bit of help again and his clutch shots are falling. He’s shooting 2-for-3 under the clutch situations and just by increasing the allotted time to one minute we can add a 2-of-2 Kristaps Porzingis itching to make a statement for himself as a clutch shooter. Derrick Rose’s last minute dagger against the Portland Trail Blazers is reminiscent of his game-winner against the Cavalier’s in the 2014–15 post-season. With the Knicks stuck in the middle of the conference standings fighting for a playoff spot, this kind of clutch shooting is exactly what the Knicks need when their cutting it close. Players who can hit big shots are hard to come by, so with ‘Melo, Rose, and Porzingis all showing they’ve got what it takes to finish the job, fans have a trio they can count on. — Ty Jordan, site writer Follow The Knicks Wall on Facebook and Twitter for more coverage! Listen to this week’s Podcast on SoundCloud, too! ", "title": "Examining Carmelo’s Clutch Factor", "sentences": [{"d00b": "Examining Carmelo’s Clutch Factor"}, {"e52f": "We take a look at how Clutch Carmelo has really been during his tenure with the Knicks"}, {"ff88": "Photo: Jim McIsaac"}, {"e872": "Beautiful, yet frightening isn’t it? “Clutch” plays as the clock winds down are some of the most intense moments in basketball."}, {"154a": "Carmelo Anthony coming in clutch never goes unappreciated. In fact, Clutch ‘Melo has been with us for quite a while. From late quarter buckets that keep the Knicks in the game with momentum to last minute buzzer beaters, Anthony has given the Knicks a lot of big moments. The definition of “clutch” can be muddled very easily since the criteria can be easily manipulated to push a fan narrative of who is a more clutch shooter. So, the definition used here will be under a set of extreme, specific circumstances:"}, {"eb3e": "Since his first season in New York, Anthony has made eight buckets that take place in the last 24 seconds of the shot clock to tie the game or send the Knicks into overtime in regular season games that end with a Knicks win (via BBall_Reference)."}, {"76f5": "Three of those times happened in the 2011–12 season. The fruits of the labor are always the sweetest part, but how many last possession buckets has he taken with the game on the line in total? He’s currently sitting at 22 misses. So, at 8-for-30, he makes a little over a quarter of these clutch shots."}, {"3240": "via The Knicks Wall/SoundCloud"}, {"6c6b": "Just to compare another team leader under these constraints LeBron James was found to be 9-for-29 in these situations that date back to his first year as a Miami HEAT. Granted, LeBron’s misses take into account a game-winning block by Amar’e Stoudemire, but a missed shot is a missed shot even when Amar’e personally got that weak stuff out of there."}, {"5195": "This may seem like another loss for ‘Melo in the rivalry, but teammates actually make all the difference."}, {"0427": "Photo: Jim McIsaac"}, {"29d8": "In the 2010–11 season he was the only Knickerbocker to hit a game-winning shot during those specific “winning time” circumstances. The others, Amar’e, Felton, Wilson Chandler and Shawne Williams (just, why?) all fell short. Looks like the Knicks trade for some clutch shooting as well. That year LeBron only assisted on a game winner to Eddie House."}, {"6c43": "Keep in mind that these statistics only counted the shots that amounted to wins for the player’s team and misses that ended as losses. Which means that if there is enough time left on the clock after the shot falls, defense is huge. If the team’s defense couldn’t come up with a big stop or couldn’t resist an unnecessary foul then the clutch shot is negated. That sounds like a bummer, but does a clutch shot really matter if the team can’t pull it together for one more possession or give it up in OT?"}, {"3ee4": "Also, if the opposing team has a clutch shooter as trigger happy as ‘Melo, then that could lead down a rabbit hole of a shootout. This isn’t likely, but clutch shot after clutch shot is possible under these restrictive elements."}, {"1f28": "It is important to note that the same team can have other clutch shooters as well."}, {"0443": "The next year, Wade had three, two more than LeBron who went 1-for-2 that year. Chris Bosh went 1-for-1. That 2011–12 season ‘Melo went 3-of-8 on those shots. His only teammate to make one was the red hot Jeremy Lin during the Linsanity campaign. With a chronically-injured STAT in his best suit and Jared Jeffries on the roster there aren’t a lot of realistic options to defer to."}, {"7e59": "However, during the Knicks 54-win season, JR Smith went 3-for-5 on these clutch field goals, two coming in the same game against Phoenix. ‘Melo was 1-of-7. So, it turns out Mr. Swish was the clutch player that year, and that understandably had a hand in his popularity in New York."}, {"3a07": "via Ximo Pierto/YouTube"}, {"d072": "This season, Anthony has a bit of help again and his clutch shots are falling. He’s shooting 2-for-3 under the clutch situations and just by increasing the allotted time to one minute we can add a 2-of-2 Kristaps Porzingis itching to make a statement for himself as a clutch shooter."}, {"cfca": "Derrick Rose’s last minute dagger against the Portland Trail Blazers is reminiscent of his game-winner against the Cavalier’s in the 2014–15 post-season."}, {"3353": "With the Knicks stuck in the middle of the conference standings fighting for a playoff spot, this kind of clutch shooting is exactly what the Knicks need when their cutting it close. Players who can hit big shots are hard to come by, so with ‘Melo, Rose, and Porzingis all showing they’ve got what it takes to finish the job, fans have a trio they can count on."}, {"09f8": "— Ty Jordan, site writer"}, {"877e": "Follow The Knicks Wall on Facebook and Twitter for more coverage! Listen to this week’s Podcast on SoundCloud, too!"}], "child": "61_161_1"}