{"content": "But Russia! How Democrats & the Accomplice Media Will Collude to Bury the Obama Unmasking Scandal Get ready for the inevitable defense of Susan Rice. This comes from Circa News: Computer logs that former President Obama’s team left behind in the White House indicate his national security adviser Susan Rice accessed numerous intelligence reports during Obama’s last seven months in office that contained National Security Agency intercepts involving Donald Trump and his associates, Circa has learned. Bloomberg View’s Eli Lake reported yesterday that Susan Rice, Obama’s former National Security Advisor, was the high ranking Obama official behind the unmasking of Trump associates who were “incidentally” monitored by the intelligence community over the past year or so. Devin Nunes, the Republican House Intelligence Committee Chairman, has said that it’s not so much the “incidental” monitoring of the Trump people that’s the problem (given that there’s no way to prove the Trump people weren’t the targets), but rather the widespread unmasking, i.e. revealing the identities of the Trump people despite them not being the stated targets of the surveillance. That’s what he was most concerned about. Lake said in his article that so long as the reports unmasked by Rice plausibly had “foreign intelligence value,” it’s legal to unmask the names of American citizens incidentally surveilled. And he said Rice is likely on safe ground because virtually anything can be argued to have “foreign intelligence value.” So did those reports about the Trump people have foreign intelligence value? Nunes said no. Fox News’ Adam Housley’s sources from last Friday said no. And, now, this article on Circa News says no: The intelligence reports included some intercepts of Americans talking to foreigners and many more involving foreign leaders talking about the future president, his campaign associates or his transition, the sources said. Most if not all had nothing to do with the Russian election interference scandal, the sources said, speaking only on condition of anonymity given the sensitive nature of the materials. Ordinarily, such references to Americans would be redacted or minimized by the NSA before being shared with outside intelligence sources, but in these cases, names were sometimes unmasked at the request of Rice or the intelligence reports were specific enough that the American’s identity was easily ascertained, the sources said. Anybody with a functioning brain can easily see: It sure seems like Republicans have Rice dead to rights here. It’s entirely believable that the Obama administration abused and weaponized the intelligence community against its political opponents. They did it with the IRS back in 2012, so this isn’t really a surprise — at least to Republicans. And, keep in mind that we’re only finding all this out because of Trump’s infamous March 4 “Wiretap” tweet, where he accused Obama of “wiretapping” Trump Tower. That’s why all this information about the Obama admin. spying on the Trump people has come out. But the problem is, it’s likely Rice (and any other high-ranking Obama officials who have not yet been implicated, including even Barack Obama himself) will get away scot-free here. And it’s all because of one word: Russia! That’ll be Rice’s defense for everything. Why did you unmask the names? Russia! Was there any foreign policy value to those reports? Russia! Why was the Trump team consistently monitored “incidentally”? Russia! Russia! will be Democrats’ justification for everything they do. They’re currently in the Denial Phase, arguing that there’s no scandal here, there’s no wrongdoing at all, etc. But eventually they’ll move on to “Everything was justified Because Russia!” What’s notable is that they’ve backpedaled from the “Nunes’ revelations are entirely baseless” stance to the defiant posture of “Susan Rice is a National Hero and was doing God’s Work!” The “But Russia!” defensive posture is next. Even though the Russia “scandal” (and by scandal I mean Democrat innuendo campaign) is collapsing, and it’s becoming clearer by the day that there is no there there, Democrats will keep hammering away at it, and the Accomplice Media will dutifully continue to freak out 24/7 over RUSSIA!, and steer every conversation back to RUSSSSSSSIAAAAA!!!!!!! because the Media is nakedly the propaganda/PR arm of the Democratic Party. Do you really think the “mainstream” media will cover this story honestly? We know it will not getting a fair shake from ABC. And CBS News’ president is the brother of former Obama deputy National Security Advisor Ben Rhodes, who was probably in on the Unmasking Scandal as well — think about it, Rhodes was Rice’s deputy on the National Security Council. It gets even better: CNN’s National Security Correspondent, Jim Sciutto, was also an Obama administration political appointee. And he can triumphantly report that the Susan Rice story “appears to be a story largely ginned-up, partly as a distraction” from the not-ginned-up-at-all RUSSIA! investigation. So can another ultra-partisan Democrat posing as a newsman, CNN anchor Chris Cuomo (son of Democratic NY Governor Andrew Cuomo): Got that? An associate of Susan Rice says it’s false, so it’s 100% false. What an absolute joke of a network CNN has become. I’m sure all it would take to clear Donald Trump’s name in the RUSSIA! “scandal” is a close associate of his proclaiming his innocence. Perhaps Steve Bannon, or Ivanka, or Jared, or Donald Jr. could release a statement? I’m sure that would placate CNN. And check out the New York Times’ homepage from this morning, a full 24 hours or so after Eli Lake’s piece ran on Bloomberg View. No mention of Susan Rice: “All the news that’s fit to print”? ¯\\_(ツ)_/¯ Actually, NYT did run a story about “unmasking”! So maybe the Times isn’t Memory Holing the entire scandal? Nevermind :( The left-wing journalists, reporters, producers and executives that control the “mainstream” media outlets have no interest in digging into this story and finding out the truth. They’d rather no one know how high up the chain this unmasking scandal goes, so they’re going to combat it. Funny how they mouth high-minded platitudes about the heroic nature of journalism as a profession, and how they are the Last Line of Defense in our Democracy, yet here we have now a major scandal unfolding implicating high-ranking members of the Obama Administration, and the media’s chief concern is defending the Obama people from the accusations. So you can bet that as soon as Susan Rice comes out with a carefully worded statement citing Russia! as her reason for unmasking the names of US citizens, the New York Times and other Democratic media outlets will make that story front page news. We might even get a Sexism! defense of Rice if we’re lucky. Because using the kid gloves with women is patronizing and sexist, but so is treating them just how you’d treat a man. The only way you can be Not Sexist is to never criticize any (Democratic) woman ever. To the Democrats, anything is permissible in search of that ever-elusive Russia Smoking Gun. All Susan Rice must do is say the magic R-word and she’ll be just fine. If you enjoyed this story, please hit the little red heart ❤️ below to share it with others, and follow Today in Politics for more stories like this! I also encourage you to follow TIP on Twitter. ", "child": "61_1\t61_2\t61_3\t61_4\t61_5\t61_6\t61_7\t61_8\t61_9\t61_10\t61_11\t61_1261_1\t61_2\t61_3\t61_4\t61_5\t61_6\t61_7\t61_8\t61_9\t61_10\t61_11\t61_12", "title": "But Russia!", "parent": "", "sentences": [{"457d": "But Russia!"}, {"9d50": "How Democrats & the Accomplice Media Will Collude to Bury the Obama Unmasking Scandal"}, {"cfb1": "Get ready for the inevitable defense of Susan Rice. This comes from Circa News:"}, {"7ca8": "Computer logs that former President Obama’s team left behind in the White House indicate his national security adviser Susan Rice accessed numerous intelligence reports during Obama’s last seven months in office that contained National Security Agency intercepts involving Donald Trump and his associates, Circa has learned."}, {"48c0": "Bloomberg View’s Eli Lake reported yesterday that Susan Rice, Obama’s former National Security Advisor, was the high ranking Obama official behind the unmasking of Trump associates who were “incidentally” monitored by the intelligence community over the past year or so."}, {"a251": "Devin Nunes, the Republican House Intelligence Committee Chairman, has said that it’s not so much the “incidental” monitoring of the Trump people that’s the problem (given that there’s no way to prove the Trump people weren’t the targets), but rather the widespread unmasking, i.e. revealing the identities of the Trump people despite them not being the stated targets of the surveillance. That’s what he was most concerned about."}, {"7b7d": "Lake said in his article that so long as the reports unmasked by Rice plausibly had “foreign intelligence value,” it’s legal to unmask the names of American citizens incidentally surveilled. And he said Rice is likely on safe ground because virtually anything can be argued to have “foreign intelligence value.”"}, {"4955": "So did those reports about the Trump people have foreign intelligence value? Nunes said no. Fox News’ Adam Housley’s sources from last Friday said no. And, now, this article on Circa News says no:"}, {"f074": "The intelligence reports included some intercepts of Americans talking to foreigners and many more involving foreign leaders talking about the future president, his campaign associates or his transition, the sources said. Most if not all had nothing to do with the Russian election interference scandal, the sources said, speaking only on condition of anonymity given the sensitive nature of the materials."}, {"2290": "Ordinarily, such references to Americans would be redacted or minimized by the NSA before being shared with outside intelligence sources, but in these cases, names were sometimes unmasked at the request of Rice or the intelligence reports were specific enough that the American’s identity was easily ascertained, the sources said."}, {"b72e": "Anybody with a functioning brain can easily see:"}, {"fb4c": "It sure seems like Republicans have Rice dead to rights here. It’s entirely believable that the Obama administration abused and weaponized the intelligence community against its political opponents. They did it with the IRS back in 2012, so this isn’t really a surprise — at least to Republicans."}, {"1e3b": "And, keep in mind that we’re only finding all this out because of Trump’s infamous March 4 “Wiretap” tweet, where he accused Obama of “wiretapping” Trump Tower. That’s why all this information about the Obama admin. spying on the Trump people has come out."}, {"d0c7": "But the problem is, it’s likely Rice (and any other high-ranking Obama officials who have not yet been implicated, including even Barack Obama himself) will get away scot-free here. And it’s all because of one word:"}, {"7b47": "Russia!"}, {"178e": "That’ll be Rice’s defense for everything."}, {"c5c6": "Why did you unmask the names? Russia!"}, {"0ff1": "Was there any foreign policy value to those reports? Russia!"}, {"6096": "Why was the Trump team consistently monitored “incidentally”? Russia!"}, {"5491": "Russia! will be Democrats’ justification for everything they do. They’re currently in the Denial Phase, arguing that there’s no scandal here, there’s no wrongdoing at all, etc. But eventually they’ll move on to “Everything was justified Because Russia!” What’s notable is that they’ve backpedaled from the “Nunes’ revelations are entirely baseless” stance to the defiant posture of “Susan Rice is a National Hero and was doing God’s Work!” The “But Russia!” defensive posture is next."}, {"1f2a": "Even though the Russia “scandal” (and by scandal I mean Democrat innuendo campaign) is collapsing, and it’s becoming clearer by the day that there is no there there, Democrats will keep hammering away at it, and the Accomplice Media will dutifully continue to freak out 24/7 over RUSSIA!, and steer every conversation back to RUSSSSSSSIAAAAA!!!!!!! because the Media is nakedly the propaganda/PR arm of the Democratic Party."}, {"c351": "Do you really think the “mainstream” media will cover this story honestly? We know it will not getting a fair shake from ABC. And CBS News’ president is the brother of former Obama deputy National Security Advisor Ben Rhodes, who was probably in on the Unmasking Scandal as well — think about it, Rhodes was Rice’s deputy on the National Security Council."}, {"f67a": "It gets even better: CNN’s National Security Correspondent, Jim Sciutto, was also an Obama administration political appointee. And he can triumphantly report that the Susan Rice story “appears to be a story largely ginned-up, partly as a distraction” from the not-ginned-up-at-all RUSSIA! investigation. So can another ultra-partisan Democrat posing as a newsman, CNN anchor Chris Cuomo (son of Democratic NY Governor Andrew Cuomo):"}, {"f663": "Got that? An associate of Susan Rice says it’s false, so it’s 100% false. What an absolute joke of a network CNN has become. I’m sure all it would take to clear Donald Trump’s name in the RUSSIA! “scandal” is a close associate of his proclaiming his innocence. Perhaps Steve Bannon, or Ivanka, or Jared, or Donald Jr. could release a statement? I’m sure that would placate CNN."}, {"5544": "And check out the New York Times’ homepage from this morning, a full 24 hours or so after Eli Lake’s piece ran on Bloomberg View. No mention of Susan Rice:"}, {"e796": "“All the news that’s fit to print”?"}, {"0a30": "¯\\_(ツ)_/¯"}, {"b990": "Actually, NYT did run a story about “unmasking”! So maybe the Times isn’t Memory Holing the entire scandal?"}, {"c82e": "Nevermind :("}, {"5185": "The left-wing journalists, reporters, producers and executives that control the “mainstream” media outlets have no interest in digging into this story and finding out the truth. They’d rather no one know how high up the chain this unmasking scandal goes, so they’re going to combat it. Funny how they mouth high-minded platitudes about the heroic nature of journalism as a profession, and how they are the Last Line of Defense in our Democracy, yet here we have now a major scandal unfolding implicating high-ranking members of the Obama Administration, and the media’s chief concern is defending the Obama people from the accusations."}, {"7ff8": "So you can bet that as soon as Susan Rice comes out with a carefully worded statement citing Russia! as her reason for unmasking the names of US citizens, the New York Times and other Democratic media outlets will make that story front page news. We might even get a Sexism! defense of Rice if we’re lucky. Because using the kid gloves with women is patronizing and sexist, but so is treating them just how you’d treat a man. The only way you can be Not Sexist is to never criticize any (Democratic) woman ever."}, {"ab79": "To the Democrats, anything is permissible in search of that ever-elusive Russia Smoking Gun."}, {"7feb": "All Susan Rice must do is say the magic R-word and she’ll be just fine."}, {"11eb": "If you enjoyed this story, please hit the little red heart ❤️ below to share it with others, and follow Today in Politics for more stories like this!"}, {"3cbf": "I also encourage you to follow TIP on Twitter."}], "name": "61"}