{"name": "616", "parent": "", "content": "Words After War Book Club: The Theater of War November’s selection is THE THEATER OF WAR by Bryan Doerries Words After War invites you to join us in reading our official book club selection for November, The Theater of War: What Ancient Greek Tragedies Can Teach Us Today by Bryan Doerries. For years, theater director Bryan Doerries has led an innovative public health project that produces ancient tragedies for current and returned soldiers, addicts, tornado and hurricane survivors, and a wide range of other at-risk people in society. The Theater of War is the personal and deeply passionate story of his work. The book links the personal to the artistic to the social, showing us how suffering and healing are part of a timeless process in which dialogue and empathy are inextricably linked. Read along with us! We’ll be back at the end of the month with an interview with the Mr. Doerries. The Words After War Book Club features a book each month that we believe is important for our community to read and discuss. As we go, we invite you to read along with us, and we conclude each month with an interview with the author, shared on The Huffington Post. Previous selected works: ", "title": "Words After War Book Club: The Theater of War", "sentences": [{"8f0c": "Words After War Book Club: The Theater of War"}, {"d9c1": "November’s selection is THE THEATER OF WAR by Bryan Doerries"}, {"1efa": "Words After War invites you to join us in reading our official book club selection for November, The Theater of War: What Ancient Greek Tragedies Can Teach Us Today by Bryan Doerries."}, {"c43c": "For years, theater director Bryan Doerries has led an innovative public health project that produces ancient tragedies for current and returned soldiers, addicts, tornado and hurricane survivors, and a wide range of other at-risk people in society."}, {"87bd": "The Theater of War is the personal and deeply passionate story of his work. The book links the personal to the artistic to the social, showing us how suffering and healing are part of a timeless process in which dialogue and empathy are inextricably linked."}, {"75f2": "Read along with us! We’ll be back at the end of the month with an interview with the Mr. Doerries."}, {"fb14": "The Words After War Book Club features a book each month that we believe is important for our community to read and discuss. As we go, we invite you to read along with us, and we conclude each month with an interview with the author, shared on The Huffington Post."}, {"15a0": "Previous selected works:"}], "child": "616_1616_1"}