{"name": "621", "parent": "", "content": "Hero Day 95 of A Year of War and Peace The hero of a story, usually a character of action, combats foes and overcomes adversity with the goal of bringing about some form of social benefit or greater good. Think Odysseus of Homer’s Odyssey. In that story Odysseus must return home — braving the Sirens, a Cyclops and many other challenges — to slay the suitors and restore peace to Ithaca. In addition, the hero is often offered a weapon with which to do battle against the villain of the story. Here we have Luke Skywalker’s lightsaber, Harry Potter’s magic wand, or Ali’s Zulfiqar. Pierre Bezukhov, the hero of today’s chapter, takes very little action and is armed only with his innate kindness. And, in the end, I’m not sure that Pierre even understands, absent minded fellow that he is, that his mission in visiting Prince Andrei is to restore peace and good cheer to the Bolkonsky home. What’s important, however, is that Pierre’s quest ends in success. While reading the chapter it’s important to keep in mind how profoundly dysfunctional the Bolkonsky home really is at this point. Let’s start at the top. The Old Prince is a maniac. He is almost always ill-tempered, cranky, and quick to insult. His son, Prince Andrei, is one of the most morose characters we’ve encountered. The death of his wife, Lise, trails behind it a sad pallor of gloom and despair. Mayra is a good person, one readers can sympathize with, but even her story is forlorn because she must silently endure both her father and her brother’s bad behavior. These are the reasons why nearly every chapter treating the Bolkonskys so far has felt like such a horrible mess. So how does our hero Pierre fight against this problem armed only with his kindness? First, he listens. he listens to the pilgrim woman share her account of the story of Father Amphilochus. Simply listening is something Prince Andrei could not commit to. He leaves the room during the pilgrim woman’s story. But Pierre listens, even though he expressed some skepticism about her story in the previous chapter. Marya is the first to compliment Pierre’s kindness. She thanks him for listening to the pilgrim woman’s story and then also for visiting Bald Hills. Always the perspicacious one, she recognizes that Andrei’s (relative) cheerfulness is due to Pierre’s visit. Lastly, Pierre achieves the impossible: he puts the Old Prince into a good mood. This even when the two dispute Pierre’s contention that there will be a time in the near future when humanity will be without war. Though I agree with the old Prince on this one — mankind would have to cease being mankind for there to be no violence and conflict — it’s nice to see him disagreeing with someone so nicely instead of exploding in a spiteful rage. With that Pierre departs from Bald Hills. In so doing leaves the Bolkonskys in a state in which we’ve never seen them: happy. Mission accomplished. DAILY MEDITATION The Bolkonskys are everywhere. They always have been. We’re not required to help them but if we want to swords, lightsabers, and magic wands aren’t required. Most of the time, anyway. Sometimes all it takes is to try a little kindness. If you are able, correct by teaching those who do wrong; but if you cannot, remember that kindness is given to you for this purpose. And the gods, too, are kind to such persons; and for some purposes they even help them to health, wealth, reputation; so kind are they. And it is in your power also; or say, who hinders you? Marcus Aurelius, Meditations This is the ninety-fifth installment in a daily, yearlong, chapter-by-chapter reading devotional and meditation on Leo Tolstoy’s War and Peace. For more information on this project please read the introduction to the series here. If you’re enjoying A Year of War and Peace please share on your favorite social media and recommend here on Medium. Thank you. Follow me on twitter at @brianedenton. ", "title": "Hero", "sentences": [{"3dc9": "Hero"}, {"aed3": "Day 95 of A Year of War and Peace"}, {"bc44": "The hero of a story, usually a character of action, combats foes and overcomes adversity with the goal of bringing about some form of social benefit or greater good. Think Odysseus of Homer’s Odyssey. In that story Odysseus must return home — braving the Sirens, a Cyclops and many other challenges — to slay the suitors and restore peace to Ithaca. In addition, the hero is often offered a weapon with which to do battle against the villain of the story. Here we have Luke Skywalker’s lightsaber, Harry Potter’s magic wand, or Ali’s Zulfiqar. Pierre Bezukhov, the hero of today’s chapter, takes very little action and is armed only with his innate kindness. And, in the end, I’m not sure that Pierre even understands, absent minded fellow that he is, that his mission in visiting Prince Andrei is to restore peace and good cheer to the Bolkonsky home. What’s important, however, is that Pierre’s quest ends in success."}, {"4267": "While reading the chapter it’s important to keep in mind how profoundly dysfunctional the Bolkonsky home really is at this point. Let’s start at the top. The Old Prince is a maniac. He is almost always ill-tempered, cranky, and quick to insult. His son, Prince Andrei, is one of the most morose characters we’ve encountered. The death of his wife, Lise, trails behind it a sad pallor of gloom and despair. Mayra is a good person, one readers can sympathize with, but even her story is forlorn because she must silently endure both her father and her brother’s bad behavior. These are the reasons why nearly every chapter treating the Bolkonskys so far has felt like such a horrible mess."}, {"f3b8": "So how does our hero Pierre fight against this problem armed only with his kindness?"}, {"b70c": "First, he listens. he listens to the pilgrim woman share her account of the story of Father Amphilochus. Simply listening is something Prince Andrei could not commit to. He leaves the room during the pilgrim woman’s story. But Pierre listens, even though he expressed some skepticism about her story in the previous chapter."}, {"bf8e": "Marya is the first to compliment Pierre’s kindness. She thanks him for listening to the pilgrim woman’s story and then also for visiting Bald Hills. Always the perspicacious one, she recognizes that Andrei’s (relative) cheerfulness is due to Pierre’s visit."}, {"8651": "Lastly, Pierre achieves the impossible: he puts the Old Prince into a good mood. This even when the two dispute Pierre’s contention that there will be a time in the near future when humanity will be without war. Though I agree with the old Prince on this one — mankind would have to cease being mankind for there to be no violence and conflict — it’s nice to see him disagreeing with someone so nicely instead of exploding in a spiteful rage."}, {"2340": "With that Pierre departs from Bald Hills. In so doing leaves the Bolkonskys in a state in which we’ve never seen them: happy."}, {"9b14": "Mission accomplished."}, {"9f90": "DAILY MEDITATION"}, {"6197": "The Bolkonskys are everywhere. They always have been. We’re not required to help them but if we want to swords, lightsabers, and magic wands aren’t required. Most of the time, anyway."}, {"a129": "Sometimes all it takes is to try a little kindness."}, {"81d4": "If you are able, correct by teaching those who do wrong; but if you cannot, remember that kindness is given to you for this purpose. And the gods, too, are kind to such persons; and for some purposes they even help them to health, wealth, reputation; so kind are they. And it is in your power also; or say, who hinders you?"}, {"884a": "Marcus Aurelius, Meditations"}, {"ae1f": "This is the ninety-fifth installment in a daily, yearlong, chapter-by-chapter reading devotional and meditation on Leo Tolstoy’s War and Peace. For more information on this project please read the introduction to the series here."}, {"91d3": "If you’re enjoying A Year of War and Peace please share on your favorite social media and recommend here on Medium. Thank you."}, {"6b81": "Follow me on twitter at @brianedenton."}], "child": "621_1621_1"}