{"name": "622", "parent": "", "content": "your coffee + (free?) As of February, I work remotely full-time. It’s a great scenario and as an introvert I look forward to it. You get to do stuff and see things that you wouldn’t normally get to when you go to the office everyday. Like when I saw some girl randomly dancing to anime videos in the library. Or like last week I worked in Florida (yes, I was totally working) and I noticed how everyone is wearing boardshorts, like they’re ready to jump in the ocean at anytime. But as any remote worker will tell you, it also means this: you spend a lot of time in coffee shops. Good thing for me, I like coffee. And it’s generally affordable (as long as you avoid the expensive $4 lattes). Well, this week my (food-related, but not coffee-related) book called Taco Jehovah was released. Affordability was a key goal for me. Because I get it: That’s why I’m purposefully starting Taco Jehovah at a price that you can afford and at a price that you can take a chance on: $1.99 on Amazon. To sweeten the deal (or add sugar to your coffee or…nevermind), you can also get my first novel(la) Ambient Florida Position for free. Yes, that’s right — 2 books for $1.99. To find all those details, head to this book page. It has links to Taco Jehovah and Ambient Florida Position. A lot of people on this list helped me get the word out and got their own copy of Taco Jehovah (awesome, we hit the goal!). You can also get a free copy of Ambient Florida Position here, too. Now, is your chance to get Taco Jehovah for only $1.99 on Amazon. That’s cheaper than drip coffee. Way cheaper than your latte. And it’s only for a limited time. Remember, this is the lowest price for Taco Jehovah. It will definitely go up soon (like next week). Head to the book page right now and get Taco Jehovah for $1.99 plus another novel for free. Thanks! Josh at Create Make Write PS: For some of you, even a $1.99 deal takes some convincing. I get it (kind of). That’s why I put together this Taco Jehovah FAQ so you could learn more about the book. Cheers! PS PS Here are 11 random Taco Jehovah slogans…! This will definitely sell you! ", "title": "your coffee + (free?)", "sentences": [{"8610": "your coffee + (free?)"}, {"f25c": "As of February, I work remotely full-time. It’s a great scenario and as an introvert I look forward to it. You get to do stuff and see things that you wouldn’t normally get to when you go to the office everyday."}, {"8874": "Like when I saw some girl randomly dancing to anime videos in the library."}, {"fd77": "Or like last week I worked in Florida (yes, I was totally working) and I noticed how everyone is wearing boardshorts, like they’re ready to jump in the ocean at anytime."}, {"10fa": "But as any remote worker will tell you, it also means this: you spend a lot of time in coffee shops."}, {"d6e5": "Good thing for me, I like coffee."}, {"2507": "And it’s generally affordable (as long as you avoid the expensive $4 lattes)."}, {"13f9": "Well, this week my (food-related, but not coffee-related) book called Taco Jehovah was released. Affordability was a key goal for me. Because I get it:"}, {"cec9": "That’s why I’m purposefully starting Taco Jehovah at a price that you can afford and at a price that you can take a chance on:"}, {"cc95": "$1.99 on Amazon."}, {"73fd": "To sweeten the deal (or add sugar to your coffee or…nevermind), you can also get my first novel(la) Ambient Florida Position for free."}, {"b782": "Yes, that’s right — 2 books for $1.99."}, {"432c": "To find all those details, head to this book page. It has links to Taco Jehovah and Ambient Florida Position."}, {"2dbb": "A lot of people on this list helped me get the word out and got their own copy of Taco Jehovah (awesome, we hit the goal!). You can also get a free copy of Ambient Florida Position here, too."}, {"35d3": "Now, is your chance to get Taco Jehovah for only $1.99 on Amazon."}, {"5304": "That’s cheaper than drip coffee. Way cheaper than your latte. And it’s only for a limited time."}, {"78f3": "Remember, this is the lowest price for Taco Jehovah. It will definitely go up soon (like next week)."}, {"c03e": "Head to the book page right now and get Taco Jehovah for $1.99 plus another novel for free."}, {"a9ac": "Thanks!"}, {"d4c8": "Josh at Create Make Write"}, {"46f4": "PS:"}, {"ba23": "For some of you, even a $1.99 deal takes some convincing. I get it (kind of). That’s why I put together this Taco Jehovah FAQ so you could learn more about the book. Cheers!"}, {"f70f": "PS PS"}, {"55bf": "Here are 11 random Taco Jehovah slogans…! This will definitely sell you!"}], "child": "622_1\t622_2"}