{"name": "623", "parent": "", "content": "Passing Periods: Thoughts on Fahrenheit 451 I teach high school English and I don’t have a lot of time to write. Neither do my students, and last week they called me out: “Alright, Preston, we work in the fields and do six hours of homework a night and play sports and have our data mined and Trump wants to deport my abuela. You want us to write an essay? Why don’t YOU write an essay?” Fair’s fair. If you’re a writing geek, you may know that Michel de Montaigne coined the term essay (later used by Francis Bacon) to describe his writing, because in French it means “to try, attempt, examine” — it’s not easy to capture and organize our thoughts in a way others can understand. It’s even harder when you’re constantly being interrupted. I wrote this piece last week during the passing periods between classes and— “Dr. Preston, can you please sign this for me? — and — “Dr. Preston, can I please go to the bathroom?” — and during those precious few moments at the beginning of class when I ask students to let their brains off-leash and write in their journals. My thoughts tend to jump around, so there are more than a couple links, and notes. Some of the notes also have notes. As you scroll down, you will get to what I hope are insights on Fahrenheit 451. First you will suffer through my thinking about this topic in general. On a serious note, no one should ever think of writing or reading as suffering. It’s fucking magical, this ability we have to share our ideas and feelings through time and space. In the words that follow, I hope you find a rabbit hole or two worth exploring. Click. Scroll. Open a new tab. I hope your exploration leads you to something meaningful that I didn’t even intend. If that happens, please tell us about it in a comment that will make this a living document, an intellectual bouillabaisse that becomes tastier with the seasoning of every reader’s thinking. On the other hand, if you get partway through and realize you could be doing something better with your time, go. It’s your life. If we’re honest, no one should ever have to ask permission to go to the bathroom. ___________________________________________________________________ We should read the same books more than once, over time. As we change, the way we understand what we read changes. This is important. The first time I read Hamlet I was in Jerry DeBono’s[1] AP English Literature class at Cleveland High School in Los Angeles. We read the play in class. Actually that’s a lie. I didn’t read the play in class. I was thinking about other things while my unlucky friends who got chosen for the speaking parts tried unsuccessfully to salvage a shred of cool while mumbling and stumbling through their lines. The night before the test I read just enough of the play to write an essay. I understood what my teacher was asking, and I delivered an adequate-enough answer, but I didn’t really understand the play — not just because Shakespeare’s iambic pentameter wasn’t my native language, or because “To be or not to be” is such a hackneyed cliché, but because I didn’t have enough life experience to really understand Hamlet’s pain, or the ideas of manipulation, emotional torture, evil, or madness, or even the dark humor expressed in the play. I didn’t care about any of that. I just wanted the grade. [2] In college I read less and less for fun, and more and more for cramming. I routinely plowed through textbooks the size of a carburetor. When I finished studying at two in the morning I didn’t feel like reaching for something else to read. I have a pretty good memory, and what I retained about the stories I’d read was enough to shame Jeopardy! contestants from my couch. When I graduated and started my career I knew enough to sound smart at parties or quote the classics in meetings. I didn’t really need any more than that. My clients never asked me to explain the finer points of synecdoche or the difference between a Petrarchan and a Spenserian sonnet. It wasn’t until I started teaching high school English courses that I started reading — really reading — some of the texts that I skimmed as a student. Up to that point I had no idea what I was missing. But then. Holy crap. Reading Hamlet in my mid-thirties officially blew my mind. To be or not to be really IS the question.[3] Philosopher David Hume famously observed that we never step in the same river twice. (Think about it: Same spot, different water…) In reading Hamlet, and The Great Gatsby, and other “classics” as an adult, I have come to realize that I have never read the same book twice, no matter how many times I’ve turned its pages. Each time, the book appears different to me because I’m different. My experiences, memories, thoughts, and feelings are different. So, different elements of the book hit me differently. I notice different passages, characters, moments of foreshadowing or connections to the real world. I’ve read The Great Gatsby maybe ten, twelve times. Daisy never really bothered me before. When I read The Great Gatsby with students last month I wanted to slap her.[4] The first time I read Fahrenheit 451 was in 1981. Bob Marley was still alive. Muhammad Ali was still in the ring. Sandra Day O’Connor became the first woman to be a justice of the Supreme Court. The Iranian hostage crisis. I was eleven years old. I picked up Fahrenheit 451 because I had read and loved Ray Bradbury’s other books and stories: The Martian Chronicles, Dandelion Wine, The Illustrated Man, “A Sound of Thunder.” (The list goes on.) The first one I ever read was Something Wicked This Way Comes. I found it in a dusty lower corner in the back of the school library. I opened the cover, read the first page, sat down on the floor, and devoured the whole thing. Actually it devoured me. That book scared the shit out of me and I loved every minute. It didn’t matter that I didn’t understand every nuance.[5] I loved it so much that when I finished it, I immediately turned back to the first page and started reading it again. I may have stolen it. It gave me the sort of thrill I wish for everyone. Decades later, just typing the title at the beginning of this paragraph still gave me the chills. When I was a kid, the first thing I noticed about Ray Bradbury’s writing was his strong, visceral sense of time and place. The first paragraphs of Something Wicked This Way Comes describe October in a way I will never forget. Even today, when I read Fahrenheit 451 the images are so powerful that I feel them physically. I smell the kerosene. I feel the sizzle and the bile rise when Montag torches Beatty with the flamethrower. I hear Montag’s boots on the sidewalk in the quiet night as we walk home through his neighborhood. I listen in while he talks with Clarisse and I see that yes, just over there beyond the lawn, her house is the only one with the lights on, and I feel in my heart that yes, she is the only one with mental and emotional lights on. Somehow Bradbury manages to bring me into a world where I can see, hear, touch, smell, and taste everything in his imagination. Every so often I step back from the easel to consider how Bradbury invented and shared his world as a writer in ours. I admire his process. He wrote this book in days on a rented typewriter in the basement of Powell Library at UCLA. I studied in that basement for years and I never wrote anything half this good. Of course, Bradbury didn’t start writing the book from scratch. The seeds of Fahrenheit 451 were planted years earlier when he wrote the stories “Bright Phoenix” and “The Pedestrian.” He combined these ideas to create the novella “The Fireman”, and then expanded that into Fahrenheit 451. Bradbury’s writing wasn’t business; it was personal. He loved books and he worried about the impact of mass media. He didn’t like being stopped by police for walking at night in his own neighborhood. You can see traces of the conversation he probably had with the officer in Leonard Mead’s words in “The Pedestrian,”[6] just as you can see traces of “The Pedestrian” in Clarisse’s words: My uncle was arrested another time — did I tell you? — for being a pedestrian. So often I watch students blow right past allusions because they don’t understand the references and they don’t feel the need to drill deeper into the story.[7] Last semester we read “The Pedestrian” together — and a couple weeks ago I intentionally read that line from Clarisse out loud so we could share the insider moment. When I read Fahrenheit 451 in junior high school, I was told that the book was about censorship. This made sense. Montag’s job as firefighter is compelling; that first line… It was a pleasure to burn. The visual imagery of the dying books with their pages fluttering to the ground. Captain Beatty’s rant about happiness. Montag hiding the books and being discovered. This theme goes with Bradbury’s own love for books and his fear that people would abandon their quests for love, or wisdom, or beauty, or the adventurous experiences that bind us together with the idea that Life is Worth Living. Even those of us who love, recommend, and assign books sometimes make things too simple. In a place like school it’s easy to reduce Fahrenheit 451 to a warning against censorship. In that sense, it’s a warning about what happens if you break the rules. Rules are what school is all about, so how could the book be about anything else? To this day, many teachers and shortcut websites focus on censorship as the main theme of Fahrenheit 451.[8] It’s ironic. Fahrenheit 451 tells us that too many people fall for the spectacle and miss the deeper meaning. The spectacle is the flame licking the page of the book. The spectacle is the violence, the chase, the action. And sure enough, we fall for it, just as easily as we fall for the spectacle that is our everyday dose of reality TV and conflict and the White House press briefing and the Tweet and the Snap and the InstaWhatever. The deeper meaning of the book points to the deeper meaning in ourselves. Montag says to Faber, “We have everything we need to be happy, but we aren’t happy. Something’s missing. I looked around. The only thing I positively knew was gone was the books I’d burned in ten or twelve years. So I thought books might help.” What is the solution to our discontent? This is what Montag really wants to know. Faber replies: “It’s not books you need, it’s some of the things that once were in books.” So it is with us. Too many inspirational posters on too many walls in too many classrooms quote Helen Keller: Life is either a daring adventure or nothing. The students who see these posters every day know that following directions is not a daring adventure. They sit quietly, acting as if, texting in their pockets and waiting for the bell, living nothing. Clarisse disappears. Mildred watches shows and medicates herself. Faber hides. Beatty threatens. Montag has every reason to take it easy and stop rocking the boat. Surrender would be the easiest thing for him to do. Then again, the choice you make when someone offers you the chance to do the wrong thing is the choice that defines you. The pressure can be intense. A famous politician once said: You’ve got to go along to get along. In Scent of a Woman Al Pacino’s character confessed, “Now I have come to the crossroads in my life. I always knew what the right path was. Without exception, I knew. But I never took it. You know why? It was too damn hard.” Whatever else Fahrenheit 451 is about, it’s about consciousness, connection, integrity, and self-determination. Risky, radical, even violent self-determination in the face of others — your wife, your neighbors, your boss, society as a whole — telling you to be something you know is less than who you really are. But where, you ask, can I find this in the book? It’s in Montag’s hands. He literally takes his life into his own hands.[9] In the first paragraph of the book Montag’s hands are instruments of grand destruction: “His hands were the hands of some amazing conductor playing all the symphonies of blazing and burning to bring down the tatters and charcoal ruins of history.” After Clarisse asks if he’s happy, after his wife Mildred doses herself nearly to death and acts like it’s all his fault, Montag still isn’t ready to change his life. So his hands go rogue: “Montag’s hand closed like a mouth, crushed the book with wild devotion, with an insanity of mindlessness to his chest… Montag had done nothing. His hand had done it all, his hand, with a brain of its own, with a conscience and a curiosity in each trembling finger…” Montag recognizes that he is changing. He describes the experience this way: “So it was the hand that started it all. He felt one hand and then the other work his coat free and let it slump to the floor. He held his pants out into an abyss and let them fall into darkness. His hands had been infected, and soon it would be his arms. He could feel the poison working up his wrists and into his elbows and his shoulders, and then the jump-over from shoulder-blade to shoulder-blade like a spark leaping a gap. His hands were ravenous. And his eyes were beginning to feel hunger, as if they must look at something, anything, everything.” When Beatty lectures Montag about why people stopped reading, he mentions Hamlet in the same way so many high school students (including me) first mention Hamlet — as an answer to a trivia question that proves we’ve read the “classics.” The thing is, Montag has a lot in common with Hamlet — and so do you and I. From the beginning of the play, Hamlet knows that his uncle killed his father and bedded his mother, and he knows what he must do about it. Still, killing is hard. Not just killing his uncle, but grieving his own innocence and killing the person he himself used to be, the person he was before he became aware of the evil in his family, before he discovered his destiny, and before he acted to fulfill it. “To be or not to be” isn’t just the lament of a moody teenager with a death wish and a decision-making disorder. It’s the contemplation of a person who is about to take drastic action. One way or the other, whether Hamlet commits murder or not, he will be different once he takes action. Or doesn’t. He will look back on this moment with a perspective he can’t yet fully imagine, because he’s not that person yet. So rather than settling for the obvious/traditional interpretation of “the undiscover’d country from whose bourn no traveller returns” as the afterlife, maybe it makes more sense to consider it as the threshold of the Hero’s Journey: “The point where the person actually crosses into the field of adventure, leaving the known limits of his or her world and venturing into an unknown and dangerous realm where the rules and limits are not known.” Like Hamlet, Montag contemplates action that will change his life. He even takes some half-measures to test the water. He steals, hides, and reads books. He recites poetry to Mildred’s friends. But Montag isn’t as thoughtful as Hamlet. (To be fair, the Melancholy Dane read more books.) When Hamlet calls Polonius a fishmonger, he’s insulting the king’s advisor and acting just crazy enough to discredit himself. When Montag gets cranky on the subway, he actually seems like he really is going a bit crazy because he can’t get a moment to collect his thoughts. Hamlet thinks first and acts second; Montag acts, perceives, and then tries to understand. Even when Montag torches Beatty with the flamethrower his hands are still foreigners: “Montag…himself glanced to his hands to see what new thing they had done. Thinking back later he could never decide whether the hands or Beatty’s reaction to the hands gave him the final push toward murder.” In the words of Sir Arthur C. Clarke, “Any sufficiently advanced technology is indistinguishable from magic.” It’s fair to say that the technology of the written word, whether we encounter it on the printed page or the digitized screen, is magic. It gives us the gift of time travel, introspection, love, death, sensory perceptions, and perhaps most importantly, a shared sense of purposeful imagination. Ray Bradbury’s prescience also seems magical. He accurately predicts so many things that now exist in our society: self-driving cars; the ubiquitous earbuds and flat screens that entertain, divide and isolate so many people; advertising on public transportation; the increased busyness and mindlessness of high school; people moving away from reading, the search for truth, and the ability to constructively disagree; sports teams that move from city to city; medical practitioners who act more like mechanics than doctors; reality TV, especially the chase; and perhaps most depressingly, the idea that we could be at war and have it not matter, or that entire countries would come to mistrust or even dislike us because of our foolishness and selfishness and greed. For all the sorcery with which he conjures images of America past and present in every generation that reads this book, Ray Bradbury also puts his finger directly on the timeless pulse of everything that makes us human. Yes, we burn. We burn with desires, we burn with needs: for love, for family, for friendship, for wisdom, for the ability to work for a decent living & provide, for peace, for trust, for fairness and justice, for creativity, for joy, for community, for hope, for the integrity that demands we act in accordance with well-informed, deeply-held beliefs. Faber tells Montag that we need high-quality information, time to consider it, and the right to carry out actions based on what we learn from “the interaction of the first two.” This may be enough for individuals, but the thing is, no individual ever really acts alone. Hamlet needed Horatio, and even Rosencrantz & Guildenstern; Steve Jobs needed Woz; Montag needed Clarisse and Faber. So much of Fahrenheit 451 comments on our need for connection — consider Mildred’s faux-family versus Clarisse’s real one. Granger puts it this way: “When we were separate individuals, all we had was rage.” So it is. We need each other. In the end, our self-determination is determined by our interdependence.[10] We even depend on our antagonists. A good guy without a bad guy is just a guy. It’s so important to find the others. When Montag finds Granger and the others by the river, “The other men helped, and Montag helped, and there, in the wilderness, the men all moved their hands, putting out the fire together.” Remember that the dystopian future that Bradbury describes in Fahrenheit 451 — or the one that Huxley describes in Brave New World, or the one that Orwell describes in 1984 — is just an idea. It’s a cautionary tale created by an imaginative person, full of observations and fears and hopes, who sat down at a typewriter to explore the possibility that we can change things and make them better. As we reach the end of Montag’s journey and consider the Phoenix, the lily, the season for everything, the milk, the apple, and the pear, and as the world around us bombards us with infotainment from corporations and politicians who appear not to care about the climate, or our right to privacy, or equality, or our health, it is easy to imagine comfort in going the way of Mildred, to jam our seashells in tight and close our eyes.[11] Bradbury invites us to follow Montag. To the extent that we do, the future is in our hands. ______________ NOTES [1] We didn’t have IMDb back then.[a] If we had, I would have looked Mr. DeBono up, realized that he wasn’t just cool in a smoker’s voice, Vans-wearing kind of way, but that he was a 43-year member of the Writer’s Guild who wrote TV episodes and lots of other cool stuff. I would also have listened to his advice on writing way more closely. [2] I got a B. [3] This is true in every moment we decide to act. Will you audition for the part or try out for the team? Will you call that girl? Will you have just one more beer and get behind the wheel? Will you turn left or right? You are the result of every single one of those decisions. And every time you decide, you can’t go back and undo it. That is who you are now. As for those teachers and shortcut websites who say that Hamlet was nuts, or immature, or that he couldn’t make a decision — they’re all wrong. Hamlet knows from the very beginning that he is destined to kill his uncle. But it’s one thing to make up your mind to do something, and it is a very different thing to follow through and act. Maybe that’s why so many people walk around wearing t-shirts with the Nike slogan to make themselves feel better. [b] [4] In this day and age, I should probably make clear that I would never slap anyone, no matter how much I wanted to. I haven’t hit a person in anger since I was in the third grade.[c] [5] When I read the word calliope I silently pronounced it (CAL-ee-oap) instead of (cuhl-LIE-oh-pee).d I still don’t know much about the calliope is or how it sounds, but today if I get really curious I can read about it Wikipedia or watch/listen to one on YouTube, which I couldn’t do when I was a kid. [6] Also in “The Pedestrian” you can see what I think is the first self-driving car. It predates Knight Rider by 30 years and today’s real-life self-driving cars by more than half a century. [7] The same is true for footnotes. (If you’re reading this, yay you! Some people are going to skip it, which makes me wish I knew the meaning of life so I could share it in a footnote and thereby separate the people who are willing to seek it out from those who think that Taco Bell products are good things to eat and get diabetes and raise my health care insurance premium.[f]) This has a lot to do with how reading is first presented. Most of my students have shared that their earliest memories of reading don’t include encountering a book as an enchanted path to discovery or a loving connection at bedtime. So it’s understandable that they haven’t become more curious, passionate, voracious readers over the years as they’ve grown. The thing is, they know this about themselves. When I asked her a question about the book Lesley told me she needed time to buffer. Katie said that if school followed Captain Beatty’s advice and stopped distributing books, students would celebrate. Seeing my surprise, Katie said that she and most of the people she knows don’t read for pleasure. They’ve been forced to read books, and the books they’ve been forced to read aren’t very interesting or fun. As result, they read the minimum while wishing they were doing just about anything else and not engaging at all with the text. [8] Here is where the Internet can be learning’s best friend or its worst enemy, depending on how you use it. You can find insightful people all over the world to share your interests, critique your work, and help you. You can also find an echo chamber of shallow, misguided reinforcement for the same mistakes we used to make in private. One way or the other, if you’re not ethical and diligent you will pay for this. [9] Hands are everywhere in this book. In some places hands represent an effective use of synecdoche (i.e., using a part of something to symbolize the whole thing — in this case, using hands to stand for the person to whom they belong). In other places hands are an effective use of imagery (i.e., focusing the reader on something specific that forms a mental picture and appeals to the senses instead of describing a series of abstract ideas). One of my favorites is the moment in the beginning when Montag comes home and discovers that his wife Mildred has overdosed: “As he stood there the sky over the house screamed. There was a tremendous ripping sound as if two giant hands had torn ten thousand miles of black linen down the seam.” [10] For more on this, read Malcolm Gladwell’s Outliers. [11] It seems much more comfortable to anesthetize ourselves and watch TV and play video games and act in general like life isn’t actually happening. Then again, Mildred gets vaporized along with the rest of the idiot zombies, so… there’s that. ________________ [a] Or anything else on the Internet. Or the Internet. [b] They might not feel as much of an endorphin rush if they knew that the words “Just Do It” were adapted by ad man Dan Wieden from convicted murderer Gary Gilmore, who said “Let’s do it” — just before being executed by a firing squad. [c] To Greg Wolfus, wherever you are: I’m sorry. No one else in the world can honestly say I punched them in the face. However, there are a few people on a list that I keep in my mind. Daisy made the list. [d] Around that age I also mispronounced misled (as MY-zld). If I weren’t such a great reader now that sort of thing would be embarrassing. [e] Huh! When I looked it up to create that link I learned something I didn’t know. In Greek mythology, Calliope is the muse of eloquence and epic poetry. I had no idea that’s where the instrument’s name came from. Rad. [f] I strive to be a compassionate teacher and a good human, and I believe that most everyone does the best they can with the tools and information they have, so I try to love everyone, including Burrito Supreme-eating diabetics whose ignorance costs me money, but there are some moments when I understand how thinkers from Plato to Galton to dictators come to question the idea that, “It takes all kinds.” ", "title": "Passing Periods: Thoughts on Fahrenheit 451", "sentences": [{"7f77": "Passing Periods: Thoughts on Fahrenheit 451"}, {"5bf3": "I teach high school English and I don’t have a lot of time to write. Neither do my students, and last week they called me out: “Alright, Preston, we work in the fields and do six hours of homework a night and play sports and have our data mined and Trump wants to deport my abuela. You want us to write an essay? Why don’t YOU write an essay?”"}, {"f46e": "Fair’s fair."}, {"afce": "If you’re a writing geek, you may know that Michel de Montaigne coined the term essay (later used by Francis Bacon) to describe his writing, because in French it means “to try, attempt, examine” — it’s not easy to capture and organize our thoughts in a way others can understand. It’s even harder when you’re constantly being interrupted. I wrote this piece last week during the passing periods between classes and— “Dr. Preston, can you please sign this for me? — and — “Dr. Preston, can I please go to the bathroom?” — and during those precious few moments at the beginning of class when I ask students to let their brains off-leash and write in their journals. My thoughts tend to jump around, so there are more than a couple links, and notes. Some of the notes also have notes."}, {"8834": "As you scroll down, you will get to what I hope are insights on Fahrenheit 451. First you will suffer through my thinking about this topic in general. On a serious note, no one should ever think of writing or reading as suffering. It’s fucking magical, this ability we have to share our ideas and feelings through time and space. In the words that follow, I hope you find a rabbit hole or two worth exploring. Click. Scroll. Open a new tab. I hope your exploration leads you to something meaningful that I didn’t even intend. If that happens, please tell us about it in a comment that will make this a living document, an intellectual bouillabaisse that becomes tastier with the seasoning of every reader’s thinking. On the other hand, if you get partway through and realize you could be doing something better with your time, go. It’s your life. If we’re honest, no one should ever have to ask permission to go to the bathroom."}, {"9d12": "___________________________________________________________________"}, {"3046": "We should read the same books more than once, over time. As we change, the way we understand what we read changes. This is important."}, {"97d0": "The first time I read Hamlet I was in Jerry DeBono’s[1] AP English Literature class at Cleveland High School in Los Angeles. We read the play in class. Actually that’s a lie. I didn’t read the play in class. I was thinking about other things while my unlucky friends who got chosen for the speaking parts tried unsuccessfully to salvage a shred of cool while mumbling and stumbling through their lines. The night before the test I read just enough of the play to write an essay. I understood what my teacher was asking, and I delivered an adequate-enough answer, but I didn’t really understand the play — not just because Shakespeare’s iambic pentameter wasn’t my native language, or because “To be or not to be” is such a hackneyed cliché, but because I didn’t have enough life experience to really understand Hamlet’s pain, or the ideas of manipulation, emotional torture, evil, or madness, or even the dark humor expressed in the play."}, {"95e1": "I didn’t care about any of that. I just wanted the grade. [2]"}, {"797e": "In college I read less and less for fun, and more and more for cramming. I routinely plowed through textbooks the size of a carburetor. When I finished studying at two in the morning I didn’t feel like reaching for something else to read. I have a pretty good memory, and what I retained about the stories I’d read was enough to shame Jeopardy! contestants from my couch. When I graduated and started my career I knew enough to sound smart at parties or quote the classics in meetings. I didn’t really need any more than that. My clients never asked me to explain the finer points of synecdoche or the difference between a Petrarchan and a Spenserian sonnet."}, {"a07c": "It wasn’t until I started teaching high school English courses that I started reading — really reading — some of the texts that I skimmed as a student. Up to that point I had no idea what I was missing. But then. Holy crap. Reading Hamlet in my mid-thirties officially blew my mind. To be or not to be really IS the question.[3]"}, {"a520": "Philosopher David Hume famously observed that we never step in the same river twice. (Think about it: Same spot, different water…) In reading Hamlet, and The Great Gatsby, and other “classics” as an adult, I have come to realize that I have never read the same book twice, no matter how many times I’ve turned its pages. Each time, the book appears different to me because I’m different. My experiences, memories, thoughts, and feelings are different. So, different elements of the book hit me differently. I notice different passages, characters, moments of foreshadowing or connections to the real world. I’ve read The Great Gatsby maybe ten, twelve times. Daisy never really bothered me before. When I read The Great Gatsby with students last month I wanted to slap her.[4]"}, {"7629": "The first time I read Fahrenheit 451 was in 1981. Bob Marley was still alive. Muhammad Ali was still in the ring. Sandra Day O’Connor became the first woman to be a justice of the Supreme Court. The Iranian hostage crisis. I was eleven years old."}, {"0c86": "I picked up Fahrenheit 451 because I had read and loved Ray Bradbury’s other books and stories: The Martian Chronicles, Dandelion Wine, The Illustrated Man, “A Sound of Thunder.” (The list goes on.) The first one I ever read was Something Wicked This Way Comes. I found it in a dusty lower corner in the back of the school library. I opened the cover, read the first page, sat down on the floor, and devoured the whole thing. Actually it devoured me. That book scared the shit out of me and I loved every minute. It didn’t matter that I didn’t understand every nuance.[5] I loved it so much that when I finished it, I immediately turned back to the first page and started reading it again. I may have stolen it. It gave me the sort of thrill I wish for everyone. Decades later, just typing the title at the beginning of this paragraph still gave me the chills."}, {"c69c": "When I was a kid, the first thing I noticed about Ray Bradbury’s writing was his strong, visceral sense of time and place. The first paragraphs of Something Wicked This Way Comes describe October in a way I will never forget. Even today, when I read Fahrenheit 451 the images are so powerful that I feel them physically. I smell the kerosene. I feel the sizzle and the bile rise when Montag torches Beatty with the flamethrower. I hear Montag’s boots on the sidewalk in the quiet night as we walk home through his neighborhood. I listen in while he talks with Clarisse and I see that yes, just over there beyond the lawn, her house is the only one with the lights on, and I feel in my heart that yes, she is the only one with mental and emotional lights on. Somehow Bradbury manages to bring me into a world where I can see, hear, touch, smell, and taste everything in his imagination."}, {"2ed1": "Every so often I step back from the easel to consider how Bradbury invented and shared his world as a writer in ours. I admire his process. He wrote this book in days on a rented typewriter in the basement of Powell Library at UCLA. I studied in that basement for years and I never wrote anything half this good. Of course, Bradbury didn’t start writing the book from scratch. The seeds of Fahrenheit 451 were planted years earlier when he wrote the stories “Bright Phoenix” and “The Pedestrian.” He combined these ideas to create the novella “The Fireman”, and then expanded that into Fahrenheit 451."}, {"502d": "Bradbury’s writing wasn’t business; it was personal. He loved books and he worried about the impact of mass media. He didn’t like being stopped by police for walking at night in his own neighborhood. You can see traces of the conversation he probably had with the officer in Leonard Mead’s words in “The Pedestrian,”[6] just as you can see traces of “The Pedestrian” in Clarisse’s words:"}, {"5d5b": "My uncle was arrested another time — did I tell you? — for being a pedestrian."}, {"8bf7": "So often I watch students blow right past allusions because they don’t understand the references and they don’t feel the need to drill deeper into the story.[7] Last semester we read “The Pedestrian” together — and a couple weeks ago I intentionally read that line from Clarisse out loud so we could share the insider moment."}, {"76b5": "When I read Fahrenheit 451 in junior high school, I was told that the book was about censorship. This made sense. Montag’s job as firefighter is compelling; that first line… It was a pleasure to burn. The visual imagery of the dying books with their pages fluttering to the ground. Captain Beatty’s rant about happiness. Montag hiding the books and being discovered. This theme goes with Bradbury’s own love for books and his fear that people would abandon their quests for love, or wisdom, or beauty, or the adventurous experiences that bind us together with the idea that Life is Worth Living."}, {"121a": "Even those of us who love, recommend, and assign books sometimes make things too simple. In a place like school it’s easy to reduce Fahrenheit 451 to a warning against censorship. In that sense, it’s a warning about what happens if you break the rules. Rules are what school is all about, so how could the book be about anything else? To this day, many teachers and shortcut websites focus on censorship as the main theme of Fahrenheit 451.[8]"}, {"266c": "It’s ironic. Fahrenheit 451 tells us that too many people fall for the spectacle and miss the deeper meaning. The spectacle is the flame licking the page of the book. The spectacle is the violence, the chase, the action. And sure enough, we fall for it, just as easily as we fall for the spectacle that is our everyday dose of reality TV and conflict and the White House press briefing and the Tweet and the Snap and the InstaWhatever."}, {"946e": "The deeper meaning of the book points to the deeper meaning in ourselves. Montag says to Faber, “We have everything we need to be happy, but we aren’t happy. Something’s missing. I looked around. The only thing I positively knew was gone was the books I’d burned in ten or twelve years. So I thought books might help.” What is the solution to our discontent? This is what Montag really wants to know."}, {"2265": "Faber replies: “It’s not books you need, it’s some of the things that once were in books.”"}, {"19a0": "So it is with us."}, {"6827": "Too many inspirational posters on too many walls in too many classrooms quote Helen Keller: Life is either a daring adventure or nothing. The students who see these posters every day know that following directions is not a daring adventure. They sit quietly, acting as if, texting in their pockets and waiting for the bell, living nothing."}, {"3dd1": "Clarisse disappears. Mildred watches shows and medicates herself. Faber hides. Beatty threatens. Montag has every reason to take it easy and stop rocking the boat. Surrender would be the easiest thing for him to do. Then again, the choice you make when someone offers you the chance to do the wrong thing is the choice that defines you. The pressure can be intense. A famous politician once said: You’ve got to go along to get along. In Scent of a Woman Al Pacino’s character confessed, “Now I have come to the crossroads in my life. I always knew what the right path was. Without exception, I knew. But I never took it. You know why? It was too damn hard.”"}, {"5bab": "Whatever else Fahrenheit 451 is about, it’s about consciousness, connection, integrity, and self-determination. Risky, radical, even violent self-determination in the face of others — your wife, your neighbors, your boss, society as a whole — telling you to be something you know is less than who you really are."}, {"eeb7": "But where, you ask, can I find this in the book?"}, {"2004": "It’s in Montag’s hands. He literally takes his life into his own hands.[9]"}, {"a396": "In the first paragraph of the book Montag’s hands are instruments of grand destruction: “His hands were the hands of some amazing conductor playing all the symphonies of blazing and burning to bring down the tatters and charcoal ruins of history.”"}, {"2078": "After Clarisse asks if he’s happy, after his wife Mildred doses herself nearly to death and acts like it’s all his fault, Montag still isn’t ready to change his life. So his hands go rogue: “Montag’s hand closed like a mouth, crushed the book with wild devotion, with an insanity of mindlessness to his chest… Montag had done nothing. His hand had done it all, his hand, with a brain of its own, with a conscience and a curiosity in each trembling finger…”"}, {"77e7": "Montag recognizes that he is changing. He describes the experience this way: “So it was the hand that started it all. He felt one hand and then the other work his coat free and let it slump to the floor. He held his pants out into an abyss and let them fall into darkness. His hands had been infected, and soon it would be his arms. He could feel the poison working up his wrists and into his elbows and his shoulders, and then the jump-over from shoulder-blade to shoulder-blade like a spark leaping a gap. His hands were ravenous. And his eyes were beginning to feel hunger, as if they must look at something, anything, everything.”"}, {"c311": "When Beatty lectures Montag about why people stopped reading, he mentions Hamlet in the same way so many high school students (including me) first mention Hamlet — as an answer to a trivia question that proves we’ve read the “classics.”"}, {"d018": "The thing is, Montag has a lot in common with Hamlet — and so do you and I. From the beginning of the play, Hamlet knows that his uncle killed his father and bedded his mother, and he knows what he must do about it. Still, killing is hard. Not just killing his uncle, but grieving his own innocence and killing the person he himself used to be, the person he was before he became aware of the evil in his family, before he discovered his destiny, and before he acted to fulfill it. “To be or not to be” isn’t just the lament of a moody teenager with a death wish and a decision-making disorder. It’s the contemplation of a person who is about to take drastic action. One way or the other, whether Hamlet commits murder or not, he will be different once he takes action. Or doesn’t. He will look back on this moment with a perspective he can’t yet fully imagine, because he’s not that person yet. So rather than settling for the obvious/traditional interpretation of “the undiscover’d country from whose bourn no traveller returns” as the afterlife, maybe it makes more sense to consider it as the threshold of the Hero’s Journey: “The point where the person actually crosses into the field of adventure, leaving the known limits of his or her world and venturing into an unknown and dangerous realm where the rules and limits are not known.”"}, {"4a28": "Like Hamlet, Montag contemplates action that will change his life. He even takes some half-measures to test the water. He steals, hides, and reads books. He recites poetry to Mildred’s friends. But Montag isn’t as thoughtful as Hamlet. (To be fair, the Melancholy Dane read more books.) When Hamlet calls Polonius a fishmonger, he’s insulting the king’s advisor and acting just crazy enough to discredit himself. When Montag gets cranky on the subway, he actually seems like he really is going a bit crazy because he can’t get a moment to collect his thoughts. Hamlet thinks first and acts second; Montag acts, perceives, and then tries to understand. Even when Montag torches Beatty with the flamethrower his hands are still foreigners: “Montag…himself glanced to his hands to see what new thing they had done. Thinking back later he could never decide whether the hands or Beatty’s reaction to the hands gave him the final push toward murder.”"}, {"fadb": "In the words of Sir Arthur C. Clarke, “Any sufficiently advanced technology is indistinguishable from magic.” It’s fair to say that the technology of the written word, whether we encounter it on the printed page or the digitized screen, is magic. It gives us the gift of time travel, introspection, love, death, sensory perceptions, and perhaps most importantly, a shared sense of purposeful imagination."}, {"e9c3": "Ray Bradbury’s prescience also seems magical. He accurately predicts so many things that now exist in our society: self-driving cars; the ubiquitous earbuds and flat screens that entertain, divide and isolate so many people; advertising on public transportation; the increased busyness and mindlessness of high school; people moving away from reading, the search for truth, and the ability to constructively disagree; sports teams that move from city to city; medical practitioners who act more like mechanics than doctors; reality TV, especially the chase; and perhaps most depressingly, the idea that we could be at war and have it not matter, or that entire countries would come to mistrust or even dislike us because of our foolishness and selfishness and greed."}, {"6655": "For all the sorcery with which he conjures images of America past and present in every generation that reads this book, Ray Bradbury also puts his finger directly on the timeless pulse of everything that makes us human. Yes, we burn. We burn with desires, we burn with needs: for love, for family, for friendship, for wisdom, for the ability to work for a decent living & provide, for peace, for trust, for fairness and justice, for creativity, for joy, for community, for hope, for the integrity that demands we act in accordance with well-informed, deeply-held beliefs."}, {"f97f": "Faber tells Montag that we need high-quality information, time to consider it, and the right to carry out actions based on what we learn from “the interaction of the first two.” This may be enough for individuals, but the thing is, no individual ever really acts alone. Hamlet needed Horatio, and even Rosencrantz & Guildenstern; Steve Jobs needed Woz; Montag needed Clarisse and Faber. So much of Fahrenheit 451 comments on our need for connection — consider Mildred’s faux-family versus Clarisse’s real one. Granger puts it this way: “When we were separate individuals, all we had was rage.”"}, {"d8b7": "So it is. We need each other. In the end, our self-determination is determined by our interdependence.[10] We even depend on our antagonists. A good guy without a bad guy is just a guy. It’s so important to find the others. When Montag finds Granger and the others by the river, “The other men helped, and Montag helped, and there, in the wilderness, the men all moved their hands, putting out the fire together.”"}, {"c247": "Remember that the dystopian future that Bradbury describes in Fahrenheit 451 — or the one that Huxley describes in Brave New World, or the one that Orwell describes in 1984 — is just an idea. It’s a cautionary tale created by an imaginative person, full of observations and fears and hopes, who sat down at a typewriter to explore the possibility that we can change things and make them better. As we reach the end of Montag’s journey and consider the Phoenix, the lily, the season for everything, the milk, the apple, and the pear, and as the world around us bombards us with infotainment from corporations and politicians who appear not to care about the climate, or our right to privacy, or equality, or our health, it is easy to imagine comfort in going the way of Mildred, to jam our seashells in tight and close our eyes.[11]"}, {"d94d": "Bradbury invites us to follow Montag."}, {"96fc": "To the extent that we do, the future is in our hands."}, {"fbe1": "______________"}, {"1efc": "NOTES"}, {"66de": "[1] We didn’t have IMDb back then.[a] If we had, I would have looked Mr. DeBono up, realized that he wasn’t just cool in a smoker’s voice, Vans-wearing kind of way, but that he was a 43-year member of the Writer’s Guild who wrote TV episodes and lots of other cool stuff. I would also have listened to his advice on writing way more closely."}, {"4af2": "[2] I got a B."}, {"0fec": "[3] This is true in every moment we decide to act. Will you audition for the part or try out for the team? Will you call that girl? Will you have just one more beer and get behind the wheel? Will you turn left or right? You are the result of every single one of those decisions. And every time you decide, you can’t go back and undo it. That is who you are now. As for those teachers and shortcut websites who say that Hamlet was nuts, or immature, or that he couldn’t make a decision — they’re all wrong. Hamlet knows from the very beginning that he is destined to kill his uncle. But it’s one thing to make up your mind to do something, and it is a very different thing to follow through and act. Maybe that’s why so many people walk around wearing t-shirts with the Nike slogan to make themselves feel better. [b]"}, {"36c7": "[4] In this day and age, I should probably make clear that I would never slap anyone, no matter how much I wanted to. I haven’t hit a person in anger since I was in the third grade.[c]"}, {"15c9": "[5] When I read the word calliope I silently pronounced it (CAL-ee-oap) instead of (cuhl-LIE-oh-pee).d I still don’t know much about the calliope is or how it sounds, but today if I get really curious I can read about it Wikipedia or watch/listen to one on YouTube, which I couldn’t do when I was a kid."}, {"ccac": "[6] Also in “The Pedestrian” you can see what I think is the first self-driving car. It predates Knight Rider by 30 years and today’s real-life self-driving cars by more than half a century."}, {"38c1": "[7] The same is true for footnotes. (If you’re reading this, yay you! Some people are going to skip it, which makes me wish I knew the meaning of life so I could share it in a footnote and thereby separate the people who are willing to seek it out from those who think that Taco Bell products are good things to eat and get diabetes and raise my health care insurance premium.[f]) This has a lot to do with how reading is first presented. Most of my students have shared that their earliest memories of reading don’t include encountering a book as an enchanted path to discovery or a loving connection at bedtime. So it’s understandable that they haven’t become more curious, passionate, voracious readers over the years as they’ve grown. The thing is, they know this about themselves. When I asked her a question about the book Lesley told me she needed time to buffer. Katie said that if school followed Captain Beatty’s advice and stopped distributing books, students would celebrate. Seeing my surprise, Katie said that she and most of the people she knows don’t read for pleasure. They’ve been forced to read books, and the books they’ve been forced to read aren’t very interesting or fun. As result, they read the minimum while wishing they were doing just about anything else and not engaging at all with the text."}, {"c491": "[8] Here is where the Internet can be learning’s best friend or its worst enemy, depending on how you use it. You can find insightful people all over the world to share your interests, critique your work, and help you. You can also find an echo chamber of shallow, misguided reinforcement for the same mistakes we used to make in private. One way or the other, if you’re not ethical and diligent you will pay for this."}, {"5ce7": "[9] Hands are everywhere in this book. In some places hands represent an effective use of synecdoche (i.e., using a part of something to symbolize the whole thing — in this case, using hands to stand for the person to whom they belong). In other places hands are an effective use of imagery (i.e., focusing the reader on something specific that forms a mental picture and appeals to the senses instead of describing a series of abstract ideas). One of my favorites is the moment in the beginning when Montag comes home and discovers that his wife Mildred has overdosed: “As he stood there the sky over the house screamed. There was a tremendous ripping sound as if two giant hands had torn ten thousand miles of black linen down the seam.”"}, {"82bb": "[10] For more on this, read Malcolm Gladwell’s Outliers."}, {"5f02": "[11] It seems much more comfortable to anesthetize ourselves and watch TV and play video games and act in general like life isn’t actually happening. Then again, Mildred gets vaporized along with the rest of the idiot zombies, so… there’s that."}, {"925e": "________________"}, {"1447": "[a] Or anything else on the Internet. Or the Internet."}, {"39c1": "[b] They might not feel as much of an endorphin rush if they knew that the words “Just Do It” were adapted by ad man Dan Wieden from convicted murderer Gary Gilmore, who said “Let’s do it” — just before being executed by a firing squad."}, {"25f5": "[c] To Greg Wolfus, wherever you are: I’m sorry. No one else in the world can honestly say I punched them in the face. However, there are a few people on a list that I keep in my mind. Daisy made the list."}, {"8ef3": "[d] Around that age I also mispronounced misled (as MY-zld). If I weren’t such a great reader now that sort of thing would be embarrassing."}, {"8358": "[e] Huh! When I looked it up to create that link I learned something I didn’t know. In Greek mythology, Calliope is the muse of eloquence and epic poetry. I had no idea that’s where the instrument’s name came from. Rad."}, {"4f2b": "[f] I strive to be a compassionate teacher and a good human, and I believe that most everyone does the best they can with the tools and information they have, so I try to love everyone, including Burrito Supreme-eating diabetics whose ignorance costs me money, but there are some moments when I understand how thinkers from Plato to Galton to dictators come to question the idea that, “It takes all kinds.”"}], "child": "623_1\t623_2\t623_3\t623_4\t623_5"}