{"name": "625", "parent": "", "content": "winner winner (not always) I was in the library a few days ago, working for several hours. All around me were old books, new books, some beautiful, some not so much. Many were on topics I’d be interested in, others weren’t. Some of these were popular, but most were not. In fact, most of them were losers. I’ve written about this before and I encourage you to check it out: https://medium.com/create-make-write/the-best-writing-doesnt-always-win-70ffd7722a61 But one thing I’ve realized… …is that make some books successful over is word of mouth. Telling others. Sharing with others. What if we told everyone we knew at the exact time, altogether? Well, a Thunderclap campaign gives us that chance. And I’d like to try it with my new book, Taco Jehovah. If you sign up below, the message “taco jehovah seems pretty good” with a link to my book will show up on your Twitter or Facebook feed next Tuesday. But I need 100 ppl to sign up to make it happen…can you help? I don’t care if you end up buying the book or not. I just want to try it out. YOU IN? How Thunderclap Works Got it? Hit me back w/ any questions! (…thunderclap link one more time) — josh @ create make write ", "title": "winner winner (not always)", "sentences": [{"8e48": "winner winner (not always)"}, {"5d59": "I was in the library a few days ago, working for several hours."}, {"34c5": "All around me were old books, new books, some beautiful, some not so much."}, {"844f": "Many were on topics I’d be interested in, others weren’t."}, {"41e7": "Some of these were popular, but most were not."}, {"e42c": "In fact, most of them were losers."}, {"e93e": "I’ve written about this before and I encourage you to check it out: https://medium.com/create-make-write/the-best-writing-doesnt-always-win-70ffd7722a61"}, {"db72": "But one thing I’ve realized…"}, {"a7ce": "…is that make some books successful over is word of mouth. Telling others. Sharing with others."}, {"5f74": "What if we told everyone we knew at the exact time, altogether?"}, {"a769": "Well, a Thunderclap campaign gives us that chance. And I’d like to try it with my new book, Taco Jehovah."}, {"2da4": "If you sign up below, the message “taco jehovah seems pretty good” with a link to my book will show up on your Twitter or Facebook feed next Tuesday. But I need 100 ppl to sign up to make it happen…can you help?"}, {"0596": "I don’t care if you end up buying the book or not. I just want to try it out."}, {"97a9": "YOU IN? How Thunderclap Works"}, {"ac8d": "Got it? Hit me back w/ any questions!"}, {"16a7": "(…thunderclap link one more time)"}, {"4e07": "— josh @ create make write"}], "child": "625_1\t625_2"}