{"name": "626", "parent": "", "content": "25 Habits That Will Make You a Writer Hard learned lessons distilled from 25 years of writing 1. Write every day. A daily writing habit is thing number one because it is THAT important. Move your story forward by even a few words every single day and you’ll be surprised by what happens. Or maybe not, since what will happen is this: you’ll write a book. 2. Read like a writer. Stephen King says that if you don’t have time to read, you don’t have the time or tools to write. You know he’s right. Make it a habit to carry a book with you. Keep one in your bathroom. Learn to read in sips instead of gulps — so that not having hours to indulge won’t keep you from reading at all. And read like a writer. Pay attention to what works and what doesn’t. Read craft books. Read fiction (for sure, read fiction) that does what you want your stories to do. What works? What doesn’t? (Most important) WHY? 3. Watch TV like writer. I’ve written before about my absolute belief that if you want to be a writer, you need to be watching television. I still believe it. Some of the best writing and story telling is happening on television. Just like with reading, watch like a writer. Pay attention to why you like a show, why you’re willing to invest hours of your life in it. And why you’re not, if you turn it off at the first commercial break and never come back. If You Want to be A Writer, You Should be Watching TV. Here’s Why.My daughter Ruby and I have this ritual. Twice a week, as we drive home from soccer practice, we listen to Delilah on…medium.com 4. Watch movies like a writer. Ray Bradbury advised people who want to be writers to watch a lot of movies. He advises old movies. I watch a movie in a theater at least once a week ($5 Tuesdays! I’m seeing Ghost in the Shell tonight. Last week was The Power Rangers.) A movie is a way to get an entire story in two hours. And writers should be story junkies. Pay attention to the structure of a movie, how its paced, which parts work for you and which don’t. 5. Set up your space. You need a place where your brain instantly knows it’s writing time. For me, it’s a corner of my den, right off the kitchen. I wish I had a whole room, but I don’t. I’ve lived in apartments so small and full of people that my writing place was a lap desk that I used while sitting in my bed. That’s okay, too. So is your kitchen table or Starbucks or the library or a cooperative work space or a straight up office. Where ever it is, train your brain to shift into writer mode when you are there. 6. Find your tribe. Seek out other writers. They’re your people. Find them online (come be a Ninja Writer), at writer’s conferences, take classes, join an in-person writing group. Being around other writers will help you to internalize the idea that you’re one, too. 7. Write for one reader. The inverse of finding your tribe is this: don’t try to write for them. Writing for a whole group of people is crazy-making. Writing and reading are too subjective for that. So pick a person — just one — and write for them. If they like what you’ve written, then that’s good enough. You’ve done your job. You can get other opinions then, use other beta readers, but contradictory advice can be filtered out. 8. Set boundaries with your friends and family. Your writing is important. It’s your job, even if you’re months or years from any tangible proof that other people will understand. Set your writing schedule and then protect it like you’d protect any other work schedule. It’s okay to say NO to interruptions. 9. Write like it’s your job. Let’s dive deeper into this one. If writing is your job, then you’ll do a few things: You’ll invest time in it. You’ll put effort into learning to do it well. You’ll finish what you start. You’ll expect other people to respect your work. Do all of that. 10. Write with the door closed. I see this happen all the time. Writer’s often know what the beginning and the end of their stories are, but the middle (which is actually half of the whole book), gets murky. So they start asking opinions. They reach out to their tribes and say something like: I’m not sure where to go with this story, what do you think? Your tribe is important enough that it gets it’s own item on this list, but your story is YOURS until you’re ready for readers. And then it becomes theirs. Don’t let it be theirs until you’re done with it. You’ll thank me later. You know. When you actually finish writing a book. 11. Learn to self-edit. Self-editing is as important as writing. You have to learn to do it. If you have this thought in your mind, banish it right now: I don’t need to have good spelling/grammar/comma usage . . . that’s what editors are for. Just. No. If you’re going the traditional route, you’ll never get close to an editor without a very clean manuscript. If you’re going indie, then YOU are going to have to pay someone to be your editor. You’ll save money and time and embarrassment if you turn in a clean copy to your editor. That you’re paying. Self-Editing for Fiction Writers by Renni Browne and Dave King is an excellent place to start. It was like a master class is editing for me. 12. Save your pennies for a real edit and a professional cover, if you’re going indie. This is non-negotiable. If you wouldn’t be okay with Penguin releasing your novel with your best friend’s edit and your own homemade cover, then YOU can’t be okay with it either. If you’re planning to self-publish that means you’re a PUBLISHER. A professional publisher. And that means that you have to find and hire an editor and a cover designer for your book, and if you don’t know how to do it yourself, probably a book designer as well. Plan on spending about $1500 and start saving your pennies. The hope is that your first book will pay for your second. 13. Ship. A lot. It’s very rare for someone to write one book and have it be something that looks like a career. Don’t talk to me about Harper Lee or J.K. Rowling. They aren’t normal people. They’re unicorns. Maybe you’re a unicorn, too, but the chances are about 99.9999 percent that you’re a regular old donkey like the rest of us. And that means that you have to keep writing and keep shipping your book out to the world. 14. Give your career ten books. That brings us to how much you need to ship. Don’t ship one book and when it doesn’t hit the bestseller list, give up. Instead, write ten or twenty really good books. And keep writing. You’ll see the momentum pick up. This is one of my favorite writing advice posts. It’s from Hugh Howey. He says: Five years from now, these pros will have 10–20 works available. They only need to sell 250–500 books a month to earn a supplemental income. Ten books a day across twenty titles. That’s the longterm goal. 15. Read these books. On Writing by Stephen KingThe Writer’s Journey by Christopher VoglerSelf-Editing for Fiction Writers by Renni Browne and Dave KingZen in the Art of Writing by Ray BradburyThe Kick-Ass Writer by Chuck WendigBird by Bird by Anne LamottStory Genius by Lisa Cron 16. Set teeny, tiny goals. I write about this a lot. Teeny tiny goals are life changers. You can get anywhere if you take one little step at a time. So set a goal that is so small it’s harder to skip it than it is to just do it. My go to is ten minutes. Write ten minutes a day. Read ten minutes a day. You’ll see. Here’s a whole framework I use: How to be a good writer with a good lifeThe WRITER Frameworkmedium.com 17. Give yourself gold stars. This is one of the most simple and simply effective things ever. It works for everyone, from Kindergarten up. Get yourself a calendar. Set your teeny, tiny goal. Meet your goal. Give yourself a gold star on your calendar. (Or, if you’re way too cool for stars, just get a Sharpie and give yourself a nice big X.) A visual representation of a string of successes will push you toward maintaining the streak. You’ll see. Here’s what I use. I call it FRED. How to Use a Notebook to Reach Your Writing GoalsFRED will help you finish your novelwritingcooperative.com 18. Call yourself a writer. Just trust me. Say this out loud today: I am a writer. The next time someone asks you what you do, say: I am a writer. I don’t care what your day job is. Start identifying as a writer. It’ll be hard at first, if you’ve never done it before, but you’ll get used to it. If you’re writing every day, you’re a writer. You’re allowed to own that. 19. FINISH This one is all-caps important. There isn’t a whole lot you can do toward becoming a writer if you don’t finish a manuscript. Your writer brain will throw up shiny new ideas when the going gets rough on your current work-in-progress. Write them down, but stay focused on your story. Remember when it was your shiny new idea and keep writing. Get all the way to the end. 20. Make your day job serve your art. This is a shift in thinking that will change everything for you. Start thinking about your day job as something you do in service of writing. Your 9-to-5 pays the bills for your writing. It gives you the pennies to save for an editor and cover designer. 21. Build an email list. I wish, so much, that when my first books were picked up by a big publisher, they’d taken the time to tell me that I needed to build an audience and then teach me how to do it. The fact is that I’m not sure they know how. No one tells fiction writers how important an email list is. So I’m going to tell you: it’s very important. Start now. Even if you’ve never written a book. Start writing on Medium or on your own blog. Publish something once a week and put a form from upscri.be at the bottom. 22. Make a five year plan. Actually, break it down. Write goals for where you want your writing career to be in: 3 months6 months1 year3 years5 years These are stepping stones. It’ll be much easier to think about getting to “write three short stories and have 50 people on my email list in three months” than it is to think about some huge end goal. I’ve been a professional writer for 20 years. I have two books traditionally published and I’m at the bare beginnings of exploring being an indie (or maybe hybrid) author. Here’s what my five year plan looks like: 3 months: Get to 25,000 on my email list and launch WASTED (YA adventure.) 6 months: Get to 50,000 on my email list and launch 32-B (YA science fiction adventure.)1 year: Get to 100,000 on my email list and launch THUNDERSTRUCK (romance.) Make a decision about whether or not to indie publish WONDER ROO (middle grade magical realism.)3 years: Have 10 total titles indie published. 5 years: Earn enough money from fiction to support my family. ($5000 month.) 23. Keep an editorial calendar. An editorial calendar is a simple tool that will help you stay on track as you move through your five year plan. I was a newspaper reporter when I was younger and an editorial calendar was absolutely essential to my job. I just never lost the taste for having one. I keep an analog editorial calendar, because I’m just an analog girl. You can keep one online, too. Just make deadlines for yourself. Keep track of your writing goals. I actually use my FRED to manage my novel writing. I keep track of my word count and also keep a daily log of my work. FRED is the most effective accountability partner I’ve ever had. I use a monthly planner for non-fiction writing, which is mainly blog posts and Medium posts. It looks like this: I write the home for the post in a circle and cross it when I’m done. I don’t personally need to write in the titles of my posts or plan which post I’m going to write ahead of time, so I don’t. I do keep track on the weekly pages of things like which posts I cross-posted to my blog or to Medium, so I’m less likely to accidentally duplicate. I also keep a running list of story ideas in my editorial calendar. 24. Be Interesting. This is a mistake I see a lot of newbie fiction writers make, especially if they’ve just signed with an agent or sold a manuscript: they dive into social media with a hard focus on their fiction writing. If you’re not a unicorn, no one cares about your writing process. That goes for me, too. Instead of Tweeting #amwriting and blogging about your cover reveal, write about you. Let your readers know who you are outside of writing. Write about the most interesting parts of yourself. Are you a pilot? Do you love deep sea diving? Have you traveled all over Asia on foot? Whatever it is that you’ve done or that you’re interested in or an expert in, write about that. And if you don’t have something that makes you interesting? LEARN something interesting and bring other people along for the ride. 25. Practice. I started with telling you to write everyday. I’m going to end in the same place. None of the rest of the suggestions here can replace a daily writing habit. Write everyday and finish your manuscripts. All the rest is gravy. If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤ ", "title": "25 Habits That Will Make You a Writer", "sentences": [{"6f68": "25 Habits That Will Make You a Writer"}, {"53f7": "Hard learned lessons distilled from 25 years of writing"}, {"2d0a": "1. Write every day."}, {"add3": "A daily writing habit is thing number one because it is THAT important. Move your story forward by even a few words every single day and you’ll be surprised by what happens."}, {"865e": "Or maybe not, since what will happen is this: you’ll write a book."}, {"ffa8": "2. Read like a writer."}, {"2276": "Stephen King says that if you don’t have time to read, you don’t have the time or tools to write. You know he’s right. Make it a habit to carry a book with you. Keep one in your bathroom. Learn to read in sips instead of gulps — so that not having hours to indulge won’t keep you from reading at all."}, {"7e4e": "And read like a writer. Pay attention to what works and what doesn’t. Read craft books. Read fiction (for sure, read fiction) that does what you want your stories to do. What works? What doesn’t? (Most important) WHY?"}, {"e128": "3. Watch TV like writer."}, {"e21b": "I’ve written before about my absolute belief that if you want to be a writer, you need to be watching television. I still believe it. Some of the best writing and story telling is happening on television."}, {"b42a": "Just like with reading, watch like a writer. Pay attention to why you like a show, why you’re willing to invest hours of your life in it. And why you’re not, if you turn it off at the first commercial break and never come back."}, {"739a": "If You Want to be A Writer, You Should be Watching TV. Here’s Why.My daughter Ruby and I have this ritual. Twice a week, as we drive home from soccer practice, we listen to Delilah on…medium.com"}, {"5856": "4. Watch movies like a writer."}, {"6914": "Ray Bradbury advised people who want to be writers to watch a lot of movies. He advises old movies. I watch a movie in a theater at least once a week ($5 Tuesdays! I’m seeing Ghost in the Shell tonight. Last week was The Power Rangers.)"}, {"286a": "A movie is a way to get an entire story in two hours. And writers should be story junkies. Pay attention to the structure of a movie, how its paced, which parts work for you and which don’t."}, {"2188": "5. Set up your space."}, {"5b82": "You need a place where your brain instantly knows it’s writing time. For me, it’s a corner of my den, right off the kitchen. I wish I had a whole room, but I don’t."}, {"5c34": "I’ve lived in apartments so small and full of people that my writing place was a lap desk that I used while sitting in my bed. That’s okay, too. So is your kitchen table or Starbucks or the library or a cooperative work space or a straight up office."}, {"b752": "Where ever it is, train your brain to shift into writer mode when you are there."}, {"ed35": "6. Find your tribe."}, {"6c05": "Seek out other writers. They’re your people. Find them online (come be a Ninja Writer), at writer’s conferences, take classes, join an in-person writing group. Being around other writers will help you to internalize the idea that you’re one, too."}, {"4747": "7. Write for one reader."}, {"dac1": "The inverse of finding your tribe is this: don’t try to write for them. Writing for a whole group of people is crazy-making. Writing and reading are too subjective for that. So pick a person — just one — and write for them."}, {"0a25": "If they like what you’ve written, then that’s good enough. You’ve done your job. You can get other opinions then, use other beta readers, but contradictory advice can be filtered out."}, {"c678": "8. Set boundaries with your friends and family."}, {"6569": "Your writing is important. It’s your job, even if you’re months or years from any tangible proof that other people will understand. Set your writing schedule and then protect it like you’d protect any other work schedule. It’s okay to say NO to interruptions."}, {"b92c": "9. Write like it’s your job."}, {"f64b": "Let’s dive deeper into this one."}, {"5d28": "If writing is your job, then you’ll do a few things: You’ll invest time in it. You’ll put effort into learning to do it well. You’ll finish what you start. You’ll expect other people to respect your work."}, {"9ccf": "Do all of that."}, {"7ec7": "10. Write with the door closed."}, {"f5c0": "I see this happen all the time."}, {"3342": "Writer’s often know what the beginning and the end of their stories are, but the middle (which is actually half of the whole book), gets murky. So they start asking opinions. They reach out to their tribes and say something like: I’m not sure where to go with this story, what do you think?"}, {"4a29": "Your tribe is important enough that it gets it’s own item on this list, but your story is YOURS until you’re ready for readers. And then it becomes theirs. Don’t let it be theirs until you’re done with it. You’ll thank me later."}, {"472d": "You know. When you actually finish writing a book."}, {"3a1c": "11. Learn to self-edit."}, {"722f": "Self-editing is as important as writing. You have to learn to do it."}, {"da60": "If you have this thought in your mind, banish it right now: I don’t need to have good spelling/grammar/comma usage . . . that’s what editors are for."}, {"0b5e": "Just. No."}, {"9dd9": "If you’re going the traditional route, you’ll never get close to an editor without a very clean manuscript."}, {"e032": "If you’re going indie, then YOU are going to have to pay someone to be your editor. You’ll save money and time and embarrassment if you turn in a clean copy to your editor. That you’re paying."}, {"03e2": "Self-Editing for Fiction Writers by Renni Browne and Dave King is an excellent place to start. It was like a master class is editing for me."}, {"8cfc": "12. Save your pennies for a real edit and a professional cover, if you’re going indie."}, {"e023": "This is non-negotiable."}, {"cff6": "If you wouldn’t be okay with Penguin releasing your novel with your best friend’s edit and your own homemade cover, then YOU can’t be okay with it either."}, {"ba5b": "If you’re planning to self-publish that means you’re a PUBLISHER. A professional publisher. And that means that you have to find and hire an editor and a cover designer for your book, and if you don’t know how to do it yourself, probably a book designer as well."}, {"4303": "Plan on spending about $1500 and start saving your pennies. The hope is that your first book will pay for your second."}, {"78a6": "13. Ship. A lot."}, {"8d4e": "It’s very rare for someone to write one book and have it be something that looks like a career."}, {"3afc": "Don’t talk to me about Harper Lee or J.K. Rowling. They aren’t normal people. They’re unicorns. Maybe you’re a unicorn, too, but the chances are about 99.9999 percent that you’re a regular old donkey like the rest of us. And that means that you have to keep writing and keep shipping your book out to the world."}, {"e028": "14. Give your career ten books."}, {"f2a1": "That brings us to how much you need to ship."}, {"911d": "Don’t ship one book and when it doesn’t hit the bestseller list, give up. Instead, write ten or twenty really good books. And keep writing. You’ll see the momentum pick up."}, {"a423": "This is one of my favorite writing advice posts. It’s from Hugh Howey. He says:"}, {"55ce": "Five years from now, these pros will have 10–20 works available. They only need to sell 250–500 books a month to earn a supplemental income. Ten books a day across twenty titles. That’s the longterm goal."}, {"186c": "15. Read these books."}, {"1f07": "On Writing by Stephen KingThe Writer’s Journey by Christopher VoglerSelf-Editing for Fiction Writers by Renni Browne and Dave KingZen in the Art of Writing by Ray BradburyThe Kick-Ass Writer by Chuck WendigBird by Bird by Anne LamottStory Genius by Lisa Cron"}, {"0389": "16. Set teeny, tiny goals."}, {"d93d": "I write about this a lot."}, {"8a5a": "Teeny tiny goals are life changers. You can get anywhere if you take one little step at a time. So set a goal that is so small it’s harder to skip it than it is to just do it. My go to is ten minutes. Write ten minutes a day. Read ten minutes a day. You’ll see."}, {"c28c": "Here’s a whole framework I use:"}, {"3159": "How to be a good writer with a good lifeThe WRITER Frameworkmedium.com"}, {"0342": "17. Give yourself gold stars."}, {"420a": "This is one of the most simple and simply effective things ever. It works for everyone, from Kindergarten up."}, {"8922": "Get yourself a calendar. Set your teeny, tiny goal. Meet your goal. Give yourself a gold star on your calendar. (Or, if you’re way too cool for stars, just get a Sharpie and give yourself a nice big X.)"}, {"9e29": "A visual representation of a string of successes will push you toward maintaining the streak. You’ll see."}, {"fb72": "Here’s what I use. I call it FRED."}, {"dc73": "How to Use a Notebook to Reach Your Writing GoalsFRED will help you finish your novelwritingcooperative.com"}, {"0466": "18. Call yourself a writer."}, {"f9e5": "Just trust me. Say this out loud today: I am a writer."}, {"4425": "The next time someone asks you what you do, say: I am a writer."}, {"295a": "I don’t care what your day job is. Start identifying as a writer. It’ll be hard at first, if you’ve never done it before, but you’ll get used to it."}, {"f494": "If you’re writing every day, you’re a writer. You’re allowed to own that."}, {"8b0a": "19. FINISH"}, {"4ee5": "This one is all-caps important. There isn’t a whole lot you can do toward becoming a writer if you don’t finish a manuscript."}, {"09b8": "Your writer brain will throw up shiny new ideas when the going gets rough on your current work-in-progress. Write them down, but stay focused on your story. Remember when it was your shiny new idea and keep writing. Get all the way to the end."}, {"fb0a": "20. Make your day job serve your art."}, {"1ee0": "This is a shift in thinking that will change everything for you."}, {"c56c": "Start thinking about your day job as something you do in service of writing. Your 9-to-5 pays the bills for your writing. It gives you the pennies to save for an editor and cover designer."}, {"5f84": "21. Build an email list."}, {"91f6": "I wish, so much, that when my first books were picked up by a big publisher, they’d taken the time to tell me that I needed to build an audience and then teach me how to do it."}, {"ed76": "The fact is that I’m not sure they know how."}, {"c27b": "No one tells fiction writers how important an email list is. So I’m going to tell you: it’s very important. Start now. Even if you’ve never written a book. Start writing on Medium or on your own blog. Publish something once a week and put a form from upscri.be at the bottom."}, {"9417": "22. Make a five year plan."}, {"ab29": "Actually, break it down. Write goals for where you want your writing career to be in:"}, {"13b4": "3 months6 months1 year3 years5 years"}, {"0b3c": "These are stepping stones. It’ll be much easier to think about getting to “write three short stories and have 50 people on my email list in three months” than it is to think about some huge end goal."}, {"cce7": "I’ve been a professional writer for 20 years. I have two books traditionally published and I’m at the bare beginnings of exploring being an indie (or maybe hybrid) author. Here’s what my five year plan looks like:"}, {"699b": "3 months: Get to 25,000 on my email list and launch WASTED (YA adventure.) 6 months: Get to 50,000 on my email list and launch 32-B (YA science fiction adventure.)1 year: Get to 100,000 on my email list and launch THUNDERSTRUCK (romance.) Make a decision about whether or not to indie publish WONDER ROO (middle grade magical realism.)3 years: Have 10 total titles indie published. 5 years: Earn enough money from fiction to support my family. ($5000 month.)"}, {"723e": "23. Keep an editorial calendar."}, {"db10": "An editorial calendar is a simple tool that will help you stay on track as you move through your five year plan. I was a newspaper reporter when I was younger and an editorial calendar was absolutely essential to my job. I just never lost the taste for having one."}, {"55cc": "I keep an analog editorial calendar, because I’m just an analog girl. You can keep one online, too. Just make deadlines for yourself. Keep track of your writing goals."}, {"1b2c": "I actually use my FRED to manage my novel writing. I keep track of my word count and also keep a daily log of my work. FRED is the most effective accountability partner I’ve ever had."}, {"d238": "I use a monthly planner for non-fiction writing, which is mainly blog posts and Medium posts. It looks like this:"}, {"1a04": "I write the home for the post in a circle and cross it when I’m done. I don’t personally need to write in the titles of my posts or plan which post I’m going to write ahead of time, so I don’t. I do keep track on the weekly pages of things like which posts I cross-posted to my blog or to Medium, so I’m less likely to accidentally duplicate. I also keep a running list of story ideas in my editorial calendar."}, {"fe6a": "24. Be Interesting."}, {"8ad2": "This is a mistake I see a lot of newbie fiction writers make, especially if they’ve just signed with an agent or sold a manuscript: they dive into social media with a hard focus on their fiction writing."}, {"521a": "If you’re not a unicorn, no one cares about your writing process. That goes for me, too. Instead of Tweeting #amwriting and blogging about your cover reveal, write about you. Let your readers know who you are outside of writing."}, {"0f36": "Write about the most interesting parts of yourself. Are you a pilot? Do you love deep sea diving? Have you traveled all over Asia on foot? Whatever it is that you’ve done or that you’re interested in or an expert in, write about that."}, {"30e3": "And if you don’t have something that makes you interesting? LEARN something interesting and bring other people along for the ride."}, {"5712": "25. Practice."}, {"6c7e": "I started with telling you to write everyday."}, {"86a7": "I’m going to end in the same place. None of the rest of the suggestions here can replace a daily writing habit. Write everyday and finish your manuscripts."}, {"eb0a": "All the rest is gravy."}, {"c2eb": "If you enjoyed this post, please consider scrolling down and recommending it with a pretty green heart. ❤ ❤ ❤"}], "child": "626_1\t626_2\t626_3\t626_4\t626_5\t626_6\t626_7\t626_8\t626_9\t626_10\t626_11\t626_12\t626_13\t626_14\t626_15\t626_16\t626_17\t626_18\t626_19\t626_20\t626_21\t626_22\t626_23\t626_24\t626_25626_1\t626_2\t626_3\t626_4\t626_5\t626_6\t626_7\t626_8\t626_9\t626_10\t626_11\t626_12\t626_13\t626_14\t626_15\t626_16\t626_17\t626_18\t626_19\t626_20\t626_21\t626_22\t626_23\t626_24\t626_25"}