{"name": "627", "parent": "", "content": "2 Free Things You Should Sign Up For Right Now to be a Better Founder Free + high quality content is the next new thing, I think. I’ve thought lately that the whole ‘launch’ model of getting your work out into the world has jumped the shark. It’s still happening, it’s probably still working for some people, but it just seems on it’s way out. Over. Done. Kaput. There seems to be a pretty incredible trend right now of creators of all stripes offering super high-quality content for free. Like, crazy high quality, high value content. The kind of thing that not very long ago would have cost a good chunk of money. After you got roughly three dozen emails from three dozen different affiliate folks about the thing. As someone who creates things, I’m really excited about this trend toward generosity. It flies in the face of the idea that people won’t value something they don’t pay for or that you’re devaluing yourself if you don’t charge for every single thing you do. I thought I’d share two things that I signed up for recently, that I think are completely mind blowing. And free. ConvertKit’s Product Creation Masterclass In early 2016 I decided to start a new blog. I’m a fiction writer who had a less than perfect experience with traditional publishing. I was ready to write again and I knew that this time I needed to work toward building an audience for my next book. I also had this idea for a class to teach other people who to write novels. And I had a day job I hated, bone deep. I started with ConvertKit. They made it easy to manage my list as it grew (very quickly. I had 800 people by the end of month one.) And they gave me a way to release my class, even though I had no idea what I was doing. I earned $80,000 last year. And I quit that day job. ConvertKit’s class is four weeks long and starts April 24. Here’s how they describe it: What is the Product Creation Masterclass? I’m in. If you want to be, too, you can sign up here. Sean McCabe’s List Building Class Last fall I went to Jeff Goins’ Tribe Writer’s Conference in Nashville. While I was there, I met Sean McCabe. He is seriously one of the most talented, generous people I’ve ever come in contact with. He spent more than an hour talking to me at the Frothy Monkey in downtown Franklin, TN about membership sites and how they work and whether or not one would work for me. I was pretty excited when I saw that he’d put together a class all about audience building. Because Sean doesn’t do ANYTHING halfway, it’s full of great information. If you’re just getting started with email list building, you should definitely sign up right here. This one is ongoing, as far as I can tell. No deadlines. Okay, three things. I figure, if I’m going to talk about free stuff, I might as well give my own free thing away. If you’re a fiction writer, you can sign up for my class: How to Develop + Test a Story Idea. It’ll take you through the steps for building a road map through your story, then testing the idea to make sure it will hold up a whole novel. Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer. ", "title": "2 Free Things You Should Sign Up For Right Now to be a Better Founder", "sentences": [{"2f21": "2 Free Things You Should Sign Up For Right Now to be a Better Founder"}, {"4240": "Free + high quality content is the next new thing, I think."}, {"05c0": "I’ve thought lately that the whole ‘launch’ model of getting your work out into the world has jumped the shark. It’s still happening, it’s probably still working for some people, but it just seems on it’s way out. Over. Done. Kaput."}, {"b907": "There seems to be a pretty incredible trend right now of creators of all stripes offering super high-quality content for free. Like, crazy high quality, high value content."}, {"8f61": "The kind of thing that not very long ago would have cost a good chunk of money. After you got roughly three dozen emails from three dozen different affiliate folks about the thing."}, {"84c5": "As someone who creates things, I’m really excited about this trend toward generosity. It flies in the face of the idea that people won’t value something they don’t pay for or that you’re devaluing yourself if you don’t charge for every single thing you do."}, {"b68e": "I thought I’d share two things that I signed up for recently, that I think are completely mind blowing. And free."}, {"bd0d": "ConvertKit’s Product Creation Masterclass"}, {"694b": "In early 2016 I decided to start a new blog. I’m a fiction writer who had a less than perfect experience with traditional publishing. I was ready to write again and I knew that this time I needed to work toward building an audience for my next book."}, {"e162": "I also had this idea for a class to teach other people who to write novels."}, {"e5d6": "And I had a day job I hated, bone deep."}, {"69e1": "I started with ConvertKit. They made it easy to manage my list as it grew (very quickly. I had 800 people by the end of month one.) And they gave me a way to release my class, even though I had no idea what I was doing."}, {"eb59": "I earned $80,000 last year. And I quit that day job."}, {"092b": "ConvertKit’s class is four weeks long and starts April 24. Here’s how they describe it:"}, {"a0f0": "What is the Product Creation Masterclass?"}, {"87f9": "I’m in. If you want to be, too, you can sign up here."}, {"8601": "Sean McCabe’s List Building Class"}, {"af5a": "Last fall I went to Jeff Goins’ Tribe Writer’s Conference in Nashville. While I was there, I met Sean McCabe."}, {"afde": "He is seriously one of the most talented, generous people I’ve ever come in contact with. He spent more than an hour talking to me at the Frothy Monkey in downtown Franklin, TN about membership sites and how they work and whether or not one would work for me."}, {"0c79": "I was pretty excited when I saw that he’d put together a class all about audience building. Because Sean doesn’t do ANYTHING halfway, it’s full of great information. If you’re just getting started with email list building, you should definitely sign up right here."}, {"2a94": "This one is ongoing, as far as I can tell. No deadlines."}, {"6608": "Okay, three things."}, {"6f61": "I figure, if I’m going to talk about free stuff, I might as well give my own free thing away."}, {"5bbd": "If you’re a fiction writer, you can sign up for my class: How to Develop + Test a Story Idea. It’ll take you through the steps for building a road map through your story, then testing the idea to make sure it will hold up a whole novel."}, {"194b": "Shaunta Grimes is a writer and teacher. She lives in Reno with her husband, three superstar kids, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes, is the author of Viral Nation and Rebel Nation, and is the original Ninja Writer."}], "child": "627_1\t627_2\t627_3"}