{"content": "Questioning Feminism — The Myth of the Oppressive Patriarchy One theme of feminism that does not make sense to me — on a gut level — is that of the oppressive patriarchy. In trying to learn more about feminism I began re-reading the most prominent feminist writers that I had read in my youth. I wanted to understand how my perception of these works had changed now that my attitude toward feminism has changed. At one time, I believed feminism was a cause for improving the lives of women, fighting for equal rights between men and women. Today my impression of feminism is more along the lines of seeing it as an ideology that is dead set on ruining the lives of men while celebrating only the women who support this ideology. Women who disagree with the competitive nature between feminism and men, who believe men and women have different gifts and are complementary, and women who love and admire men for their own gifts while wanting to develop her own feminine gifts to complement are dismissed, alienated and even attacked for questioning the authority of feminism. One theme of feminism that does not make sense to me — on a gut level — is that of the oppressive patriarchy. I agree that men are powerful and are more often in positions of leadership making the decisions for the group. However, it has been my experience and I have been witness to far more examples of this leadership being one of protection and concern for the well-being of others than one that oppresses and seeks to harm women. So, I set out to read more on where this idea of the oppressive patriarchy came from, what evidence there was for it and if I might be missing something. To do that I started reading the feminist leaders who seemed to be the mothers to the most recent incarnation of feminism, the one that I can not identify with. The largest voice in this arena appeared to be Gloria Steinam. The patriarchy as Steinam uses it is synonymous with “men” and “male power” and this male power has been painted as “oppressive” and “harmful” and something that women are always a victim to. When it comes to power, I agree that women are the more vulnerable physically than men. But our physical weakness and vulnerability is not proof that men abuse it. It simply is a fact that by our stature and size we are smaller, have less muscle mass, are slower and do not react physically to violence the way men do. Additionally, the fact that men have more violent tendencies than women does not mean that their violence is expressed on women. Men’s violent tendencies are expressed, primarily, on other men. In most cases, a man uses his physical prowess, power and even violent aggression to protect women. Despite admitting that men do have certain powers over women should they choose to use them, I believe women have other powers, that of cunning and manipulation, emotional capacity and their sexuality that they can use to overpower, control, harm and abuse men. If one could say that when feeling threatened, man resorts to his most base and potentially damaging resource — violence to regain power over the threat, it could also be said that women, will resort to their most base and cruel powers, that of cunning, manipulation and even seduction as ways to overpower the threat. These powers are both double edged. A man’s violence and strength is often used to protect and support women. A woman’s emotional power can also be used to ennoble, inspire, comfort and bring peace to a man. While acts of violence occur against women they are not standard or even common. In general, women are protected by men, even by men who are strangers. We do not fear a constant threat of danger at the hands of men. If we do, there is no evidence to back it up. In fact, in the United States, we are free to do as we please most of the time. I feel safe in most areas except at night or in very depressed neighborhoods, but I think my fear of crime is because night time and depressed neighborhoods are more crime ridden, not because they are populated by men. The threat of physical violence and rape on women appears to be about equal to the threat of emotional violence, emasculation, sexual manipulation and mental abuse targeted at men. Examples of this are the threat of false rape claims, the power to alienate divorced men from their children, the femme fatale who seduces and robs a man of his resources or dignity. It’s an ugly world. I don’t think a man’s physicality is always bad, just as I don’t believe a woman’s sexuality is bad but I do believe both can be used with ill intentions and cause great harm. Acknowledging this danger is essential to avoid perpetuating it. I did not find a definitive text on the patriarchy but in Gloria Steinem‘s book “Outrageous Acts and Everyday Rebellions” I was struck by several passages that made me question the veracity of points on which Steinam bases her theory of the oppressive patriarchy. The following passage contains several fatal flaws that when dissected, disprove her theory on the oppressive patriarchy. In this passage she mistakes male thrill-seeking behaviors to rebellion, she incorrectly characterizes young women as conservative and not rebellious, and then she bases her conclusion that the patriarchy is oppresses women on these false assumptions. “Men are more rebellious in youth and grow more conservative with age. Women are more conservative in youth and grow more rebellious with age. This makes sense in a male-dominant society where young men rebel against their powerful fathers and then grow more conservative as they replace them, while young women outgrow the power allotted them as sex objects and child bearers and finally replace their less powerful mothers.” Gloria Steinam. I will deconstruct this passage sentence by sentence for clarity. “Men are more rebellious in youth and grow more conservative with age.” This statement sounds fine. It sounds accurate on first glance because we associate rebelliousness with wildness and men certainly seem wild in youth with their fast cars and reckless attitudes. But is this a rebellion? Rebellion implies opposition. What are men opposing with their behavior? Steinem addresses this later. We will get back to this. “Women are more conservative in youth and grow more rebellious with age.” I struggle in seeing this. First of all is the opposite of rebellion conservatism or is it conformity? I agree with the statement that women are more conforming in youth and less so with age. The group they conform to may be perceived to be wild or virtuous, conservative or liberal, but women tend to want to be a part of and accepted by a social group that expect them to conform to the rules and traditions of that group. Young women, especially women from ages 13 to 18 are very rebellious if we understand that word to be resisting authority, control or convention. This rebellion is often against her parents. Women rebel against their fathers who seek to protect them against the dangerous, deceitful world. Women naturally rebel against this and are notorious for sneaking away from home to test the waters of adulthood. Women rebel against their mothers as they create their own identity while they mature. Feminism itself is a rebellion against the patriarchy, or what could be called the protective wings of the father, and against convention, or what could be called the social conformity of the mother. The very rebellious nature of feminism seems to contradict the theory that women are not rebellious in their youth and become moreso as they get older. So, what about men? If men are the more rebellious, as Steinem says, then what are they rebelling against? Men don’t rebel against their fathers with the intensity and longevity that women do against their mothers. They also don’t seem to rebel against social conventions in youth in the same ways women do. Is it possible that rebellion is not the right word for what men go through in youth? I would suggest what men experience is thrill-seeking behavior. And I would suggest this is due to their rise in testosterone. Men seek the thrill of adrenaline, dopamine, and a challenge for it’s own sake. They are not seeking thrills in resistence to authority, they seek the thrill for the thrill itself. “This makes sense in a male-dominant society where young men rebel against their powerful fathers and then grow more conservative as they replace them, while young women outgrow the power allotted them as sex objects and child bearers and finally replace their less powerful mothers.” When I get to this sentence, I already have a conflict with Steinam because I do not see men rebelling against their powerful fathers. Men with powerful fathers often follow in their footsteps, emulate them. They may appear to have rebellious behaviors like driving too fast or cutting classes or getting into fights but these also can be characterized as thrill seeking, adrenaline fueled behaviors of young men flooded with testosterone. Because Steinam makes the false contrast between rebellion and conservatism which to me are not opposites. Rebellion and conformity are opposites. Liberalism and conservatism are opposites. Women are both rebellious and conforming in that even when they rebel against one group they are conforming to another. Feminism itself is both rebellious against authority while demanding conformity of its participants. Men are less rebellious against the father or the system and more thrill seeking. They are less conforming as they do not identify as closely with their father and thus don’t need to reject the father to break free as an individual the way a woman rejects her mother to create her own autonomous identity. This is one example where the myth of the oppressive patriarchy breaks down for me. If we can disassemble this myth by deconstructing where the premises on which feminism are founded we might be able to reverse some of the toxic animosity between men and women and strengthen our bonds to work for a complementary equality where we can all thrive and be fulfilled. Kitten Holiday is a writer, lover and free thinker based in North Carolina. She writes essays, humor, fiction and opinion on her blog Kitten Holiday. Kitten is famous in small circles, widely read by a couple of people and a total bad ass when time allows. Find out more about Kitten here and here and here and here. ", "child": "63_1\t63_2\t63_3\t63_4\t63_5\t63_6\t63_7\t63_8\t63_9\t63_10\t63_11\t63_12\t63_13\t63_14\t63_15\t63_16\t63_17\t63_18\t63_19\t63_20\t63_21\t63_22", "title": "Questioning Feminism — The Myth of the Oppressive Patriarchy", "parent": "", "sentences": [{"9572": "Questioning Feminism — The Myth of the Oppressive Patriarchy"}, {"4324": "One theme of feminism that does not make sense to me — on a gut level — is that of the oppressive patriarchy."}, {"5e91": "In trying to learn more about feminism I began re-reading the most prominent feminist writers that I had read in my youth. I wanted to understand how my perception of these works had changed now that my attitude toward feminism has changed. At one time, I believed feminism was a cause for improving the lives of women, fighting for equal rights between men and women. Today my impression of feminism is more along the lines of seeing it as an ideology that is dead set on ruining the lives of men while celebrating only the women who support this ideology. Women who disagree with the competitive nature between feminism and men, who believe men and women have different gifts and are complementary, and women who love and admire men for their own gifts while wanting to develop her own feminine gifts to complement are dismissed, alienated and even attacked for questioning the authority of feminism."}, {"b35b": "One theme of feminism that does not make sense to me — on a gut level — is that of the oppressive patriarchy. I agree that men are powerful and are more often in positions of leadership making the decisions for the group. However, it has been my experience and I have been witness to far more examples of this leadership being one of protection and concern for the well-being of others than one that oppresses and seeks to harm women."}, {"c5ad": "So, I set out to read more on where this idea of the oppressive patriarchy came from, what evidence there was for it and if I might be missing something. To do that I started reading the feminist leaders who seemed to be the mothers to the most recent incarnation of feminism, the one that I can not identify with. The largest voice in this arena appeared to be Gloria Steinam."}, {"2d79": "The patriarchy as Steinam uses it is synonymous with “men” and “male power” and this male power has been painted as “oppressive” and “harmful” and something that women are always a victim to."}, {"90bd": "When it comes to power, I agree that women are the more vulnerable physically than men. But our physical weakness and vulnerability is not proof that men abuse it. It simply is a fact that by our stature and size we are smaller, have less muscle mass, are slower and do not react physically to violence the way men do. Additionally, the fact that men have more violent tendencies than women does not mean that their violence is expressed on women. Men’s violent tendencies are expressed, primarily, on other men. In most cases, a man uses his physical prowess, power and even violent aggression to protect women."}, {"7601": "Despite admitting that men do have certain powers over women should they choose to use them, I believe women have other powers, that of cunning and manipulation, emotional capacity and their sexuality that they can use to overpower, control, harm and abuse men."}, {"5c01": "If one could say that when feeling threatened, man resorts to his most base and potentially damaging resource — violence to regain power over the threat, it could also be said that women, will resort to their most base and cruel powers, that of cunning, manipulation and even seduction as ways to overpower the threat."}, {"3715": "These powers are both double edged. A man’s violence and strength is often used to protect and support women. A woman’s emotional power can also be used to ennoble, inspire, comfort and bring peace to a man."}, {"8ba7": "While acts of violence occur against women they are not standard or even common. In general, women are protected by men, even by men who are strangers. We do not fear a constant threat of danger at the hands of men. If we do, there is no evidence to back it up. In fact, in the United States, we are free to do as we please most of the time. I feel safe in most areas except at night or in very depressed neighborhoods, but I think my fear of crime is because night time and depressed neighborhoods are more crime ridden, not because they are populated by men."}, {"d473": "The threat of physical violence and rape on women appears to be about equal to the threat of emotional violence, emasculation, sexual manipulation and mental abuse targeted at men. Examples of this are the threat of false rape claims, the power to alienate divorced men from their children, the femme fatale who seduces and robs a man of his resources or dignity."}, {"b057": "It’s an ugly world. I don’t think a man’s physicality is always bad, just as I don’t believe a woman’s sexuality is bad but I do believe both can be used with ill intentions and cause great harm. Acknowledging this danger is essential to avoid perpetuating it."}, {"ad52": "I did not find a definitive text on the patriarchy but in Gloria Steinem‘s book “Outrageous Acts and Everyday Rebellions” I was struck by several passages that made me question the veracity of points on which Steinam bases her theory of the oppressive patriarchy."}, {"c2e2": "The following passage contains several fatal flaws that when dissected, disprove her theory on the oppressive patriarchy. In this passage she mistakes male thrill-seeking behaviors to rebellion, she incorrectly characterizes young women as conservative and not rebellious, and then she bases her conclusion that the patriarchy is oppresses women on these false assumptions."}, {"71d9": "“Men are more rebellious in youth and grow more conservative with age. Women are more conservative in youth and grow more rebellious with age. This makes sense in a male-dominant society where young men rebel against their powerful fathers and then grow more conservative as they replace them, while young women outgrow the power allotted them as sex objects and child bearers and finally replace their less powerful mothers.” Gloria Steinam."}, {"f9ab": "I will deconstruct this passage sentence by sentence for clarity."}, {"d78a": "“Men are more rebellious in youth and grow more conservative with age.”"}, {"84e0": "This statement sounds fine. It sounds accurate on first glance because we associate rebelliousness with wildness and men certainly seem wild in youth with their fast cars and reckless attitudes. But is this a rebellion? Rebellion implies opposition. What are men opposing with their behavior? Steinem addresses this later. We will get back to this."}, {"91ae": "“Women are more conservative in youth and grow more rebellious with age.”"}, {"e16b": "I struggle in seeing this. First of all is the opposite of rebellion conservatism or is it conformity? I agree with the statement that women are more conforming in youth and less so with age. The group they conform to may be perceived to be wild or virtuous, conservative or liberal, but women tend to want to be a part of and accepted by a social group that expect them to conform to the rules and traditions of that group. Young women, especially women from ages 13 to 18 are very rebellious if we understand that word to be resisting authority, control or convention. This rebellion is often against her parents."}, {"6f3d": "Women rebel against their fathers who seek to protect them against the dangerous, deceitful world. Women naturally rebel against this and are notorious for sneaking away from home to test the waters of adulthood. Women rebel against their mothers as they create their own identity while they mature. Feminism itself is a rebellion against the patriarchy, or what could be called the protective wings of the father, and against convention, or what could be called the social conformity of the mother."}, {"be3d": "The very rebellious nature of feminism seems to contradict the theory that women are not rebellious in their youth and become moreso as they get older. So, what about men? If men are the more rebellious, as Steinem says, then what are they rebelling against? Men don’t rebel against their fathers with the intensity and longevity that women do against their mothers. They also don’t seem to rebel against social conventions in youth in the same ways women do."}, {"b523": "Is it possible that rebellion is not the right word for what men go through in youth? I would suggest what men experience is thrill-seeking behavior. And I would suggest this is due to their rise in testosterone. Men seek the thrill of adrenaline, dopamine, and a challenge for it’s own sake. They are not seeking thrills in resistence to authority, they seek the thrill for the thrill itself."}, {"3d3d": "“This makes sense in a male-dominant society where young men rebel against their powerful fathers and then grow more conservative as they replace them, while young women outgrow the power allotted them as sex objects and child bearers and finally replace their less powerful mothers.”"}, {"c4e9": "When I get to this sentence, I already have a conflict with Steinam because I do not see men rebelling against their powerful fathers. Men with powerful fathers often follow in their footsteps, emulate them. They may appear to have rebellious behaviors like driving too fast or cutting classes or getting into fights but these also can be characterized as thrill seeking, adrenaline fueled behaviors of young men flooded with testosterone."}, {"e518": "Because Steinam makes the false contrast between rebellion and conservatism which to me are not opposites. Rebellion and conformity are opposites. Liberalism and conservatism are opposites."}, {"c5ec": "Women are both rebellious and conforming in that even when they rebel against one group they are conforming to another. Feminism itself is both rebellious against authority while demanding conformity of its participants."}, {"fc16": "Men are less rebellious against the father or the system and more thrill seeking. They are less conforming as they do not identify as closely with their father and thus don’t need to reject the father to break free as an individual the way a woman rejects her mother to create her own autonomous identity."}, {"1a9e": "This is one example where the myth of the oppressive patriarchy breaks down for me. If we can disassemble this myth by deconstructing where the premises on which feminism are founded we might be able to reverse some of the toxic animosity between men and women and strengthen our bonds to work for a complementary equality where we can all thrive and be fulfilled."}, {"8334": "Kitten Holiday is a writer, lover and free thinker based in North Carolina. She writes essays, humor, fiction and opinion on her blog Kitten Holiday. Kitten is famous in small circles, widely read by a couple of people and a total bad ass when time allows."}, {"e763": "Find out more about Kitten here and here and here and here."}], "name": "63"}