{"sentences": [{"4c20": "I helped host 40 coding events last year. Here’s what I learned."}, {"1b63": "Our local freeCodeCamp study group in Brasov, Romania just held its 40th event. We even made freeCodeCamp muffins and pens to celebrate!"}, {"982b": "Over the past year, we’ve hosted weekly meetings every Tuesday like clockwork. And now we’ve decided we want to take it to the next level. We went beyond our weekly coffee-and-codes, and started hosting presentations on coding best practices."}, {"b48a": "We also organized an interactive introduction to algorithms workshop. With this workshop, we’ve also participated in the Europe Code Week 2016. It was a fun implementation of the Jam Sandwich Robot Algorithm."}, {"0407": "Our Facebook group has around 200 members. But those numbers are just Facebook — they don’t mean much. Every week, some of those 200 members are present for our event. And these numbers vary wildly. An average of 6 to 8 people show up each week."}, {"efff": "The people"}, {"3f12": "As with all things, people fall in and fall out of freeCodeCamp. More people are present in the spring. They drop out for the summer, then come back in the autumn, but give up again when it starts to get colder."}, {"cd34": "Bring on the New Year and it starts all over again!"}, {"9898": "Many of the people who come to these events are experiencing their first contact with programming. Others already have some programming knowledge, but specifically want to learn JavaScript and web development."}, {"b61d": "That’s how I also came around to freeCodeCamp — because I’ve wanted to learn JavaScript on the server. I’ve been a web developer for the past 10 years, and for the last couple of years, I’ve been working as a front-end developer / front-end team leader."}, {"4b6a": "Needless to say, learning Node.js hasn’t happened yet for me yet. I’m still stuck on the portfolio project, because I’ve wanted to do it perfect. That’s not always the right way to go — sometimes good enough is perfect. I’m still learning this lesson, even with this article."}, {"21a3": "When I first created my Facebook account, I knew I had to join the existing Facebook study group. The group was small, with only 35 people and almost no activity."}, {"b309": "When I timidly asked about hosting an event, only one other person seemed interested. So I let it slide for another month. Then I tried again, and this time I actually set a date and hoped for the best."}, {"f3a4": "Amazingly, 10 people showed up. We found a downtown cafe that was willing to accommodate all of us, and that also had electrical outlets. For the past 10 months, we’ve been regular customers every Tuesday."}, {"6715": "Then I started spreading word about the events, both online and offline. People heard about it and started getting curious. We had a lot of newcomers join our Facebook group and attend our events."}, {"5f8b": "One of the people who joined us was one of my first mentors, the first senior developer I’d worked. This happened when I was still inching my way in the world of web programming. Together we decided to host as many of these events as possible. And we made sure that at least one of us was present at every event to help people new to coding."}, {"67d4": "We create the Facebook events. We make the cafe reservation once the people confirm. We try to reserve a couple of extra seats because not everybody confirms their attendance."}, {"d153": "When we meet, we try our best to make it clear that an event is in progress. (I’m sure the number of laptops is a clear indication that something is going on.) It also place a simple A4-sized page with the freeCodeCamp logo on the table."}, {"81b4": "The time and place."}, {"374a": "Why Tuesday? Tuesday is apparently the day when the world stands still. Nothing much happens on Tuesdays. Except coding events!"}, {"8b02": "Monday is too close to the weekend. And every day after Tuesday, people are already starting to think about the weekend."}, {"84ce": "The cafes are empty on Tuesdays, and they are more than happy to accommodate customers on this day."}, {"204a": "It also helps that our location is downtown, because it’s easy for people all around the city to get here."}, {"55c6": "Our events start at 7 PM and last until 9 PM — sometimes even 10 PM if we’re all really caught up in coding. This later time slot has also helped because most people have finished working by then, and are ready to become evening coders."}, {"484a": "The meeting."}, {"acc1": "In the beginning, we tried to host a formal program and schedule topics from the freeCodeCamp curriculum. This didn’t work very well because people have their own pace of doing things, and not everyone was able to attend every meeting."}, {"6218": "So instead, we just make sure to greet any new comers and to explain them what we try to do here. In case anybody needs a helping hand, we’re quick to offer our support."}, {"2600": "We also make it clear that this is a learning experience for all of us and there are no stupid questions — just questions that haven’t been answered yet."}, {"dadc": "Besides that, everybody working through challenges and on freeCodeCamp projects."}, {"f367": "We also have people with more JavaScript experience who attend the meetings not to work on their challenges, but rather to provide a helping hand for others, and also facilitate friendly discussion."}, {"2521": "What’s next?"}, {"efe1": "We’ve discovered that most people who attend our meeting are excited when they have their first contact with HTML and CSS, but start to lose steam when they reach JavaScript. So this year we’ll try to host a more intensive course on JavaScript."}, {"6524": "This will probably be separate from our Tuesday night events. We aren’t yet sure how we we’ll do this, but there are a lot of people in Brasov who want to get better at coding. I’m sure together we’ll figure this out."}, {"fc99": "Code on!"}], "content": "I helped host 40 coding events last year. Here’s what I learned. Our local freeCodeCamp study group in Brasov, Romania just held its 40th event. We even made freeCodeCamp muffins and pens to celebrate! Over the past year, we’ve hosted weekly meetings every Tuesday like clockwork. And now we’ve decided we want to take it to the next level. We went beyond our weekly coffee-and-codes, and started hosting presentations on coding best practices. We also organized an interactive introduction to algorithms workshop. With this workshop, we’ve also participated in the Europe Code Week 2016. It was a fun implementation of the Jam Sandwich Robot Algorithm. Our Facebook group has around 200 members. But those numbers are just Facebook — they don’t mean much. Every week, some of those 200 members are present for our event. And these numbers vary wildly. An average of 6 to 8 people show up each week. The people As with all things, people fall in and fall out of freeCodeCamp. More people are present in the spring. They drop out for the summer, then come back in the autumn, but give up again when it starts to get colder. Bring on the New Year and it starts all over again! Many of the people who come to these events are experiencing their first contact with programming. Others already have some programming knowledge, but specifically want to learn JavaScript and web development. That’s how I also came around to freeCodeCamp — because I’ve wanted to learn JavaScript on the server. I’ve been a web developer for the past 10 years, and for the last couple of years, I’ve been working as a front-end developer / front-end team leader. Needless to say, learning Node.js hasn’t happened yet for me yet. I’m still stuck on the portfolio project, because I’ve wanted to do it perfect. That’s not always the right way to go — sometimes good enough is perfect. I’m still learning this lesson, even with this article. When I first created my Facebook account, I knew I had to join the existing Facebook study group. The group was small, with only 35 people and almost no activity. When I timidly asked about hosting an event, only one other person seemed interested. So I let it slide for another month. Then I tried again, and this time I actually set a date and hoped for the best. Amazingly, 10 people showed up. We found a downtown cafe that was willing to accommodate all of us, and that also had electrical outlets. For the past 10 months, we’ve been regular customers every Tuesday. Then I started spreading word about the events, both online and offline. People heard about it and started getting curious. We had a lot of newcomers join our Facebook group and attend our events. One of the people who joined us was one of my first mentors, the first senior developer I’d worked. This happened when I was still inching my way in the world of web programming. Together we decided to host as many of these events as possible. And we made sure that at least one of us was present at every event to help people new to coding. We create the Facebook events. We make the cafe reservation once the people confirm. We try to reserve a couple of extra seats because not everybody confirms their attendance. When we meet, we try our best to make it clear that an event is in progress. (I’m sure the number of laptops is a clear indication that something is going on.) It also place a simple A4-sized page with the freeCodeCamp logo on the table. The time and place. Why Tuesday? Tuesday is apparently the day when the world stands still. Nothing much happens on Tuesdays. Except coding events! Monday is too close to the weekend. And every day after Tuesday, people are already starting to think about the weekend. The cafes are empty on Tuesdays, and they are more than happy to accommodate customers on this day. It also helps that our location is downtown, because it’s easy for people all around the city to get here. Our events start at 7 PM and last until 9 PM — sometimes even 10 PM if we’re all really caught up in coding. This later time slot has also helped because most people have finished working by then, and are ready to become evening coders. The meeting. In the beginning, we tried to host a formal program and schedule topics from the freeCodeCamp curriculum. This didn’t work very well because people have their own pace of doing things, and not everyone was able to attend every meeting. So instead, we just make sure to greet any new comers and to explain them what we try to do here. In case anybody needs a helping hand, we’re quick to offer our support. We also make it clear that this is a learning experience for all of us and there are no stupid questions — just questions that haven’t been answered yet. Besides that, everybody working through challenges and on freeCodeCamp projects. We also have people with more JavaScript experience who attend the meetings not to work on their challenges, but rather to provide a helping hand for others, and also facilitate friendly discussion. What’s next? We’ve discovered that most people who attend our meeting are excited when they have their first contact with HTML and CSS, but start to lose steam when they reach JavaScript. So this year we’ll try to host a more intensive course on JavaScript. This will probably be separate from our Tuesday night events. We aren’t yet sure how we we’ll do this, but there are a lot of people in Brasov who want to get better at coding. I’m sure together we’ll figure this out. Code on! ", "parent": "", "title": "I helped host 40 coding events last year. Here’s what I learned.", "child": "63_1\t63_2\t63_3\t63_4\t63_5\t63_6\t63_7\t63_8\t63_9\t63_10\t63_11\t63_12\t63_13\t63_14\t63_15\t63_16\t63_17\t63_18\t63_19\t63_20\t63_21\t63_22\t63_23\t63_24\t63_25", "name": "63"}