{"name": "634", "parent": "", "content": "The Best Way To Get 3000 Instagram Followers in 4 Months The part-time, non-rapid-growth, semi-natural way. You might think, “4 Months, that’s easy!”, and you would be right. But this advice isn’t for you. You’re a real person with a real life, a real family, and real responsibilities. You can’t afford to spend countless hours on Instagram growing your following. It’s not workable. Real people don’t want bots and they don’t want fake engagement. They want to build a real following that has real potential to make real money. This method is for us real people. People who want to spend an hour a day or less on Instagram, yet see consistent growth. Context My wife (Hannah 👋) has grown her hand-lettering Instagram account (@thegenuinelife) to 3000 followers in a non-spammy and community thriving way. She has very dedicated followers and a real opportunity to turn her following into an income. The Genuine Life (@thegenuinelife) * Instagram photos and videos2,975 Followers, 3,226 Following, 103 Posts - See Instagram photos and videos from The Genuine Life (@thegenuinelife)www.instagram.com She started her account in January 2017. It’s now April 2017 (100 posts later) and she has 3000 followers with about 40 comments and 200 likes on every post. Here’s the kick — She didn’t start hand-lettering until January 2017. That’s right. She started lettering when she started her account. She’s not an expert, she isn’t even as good as many of her friends that have way fewer followers. Her account is now seeing organic growth because she is showing up in the top posts of many hashtags. On top of that, it’s not hard for her to get 100 followers a day when she sits down and applies these methods for about an hour. You can learn in public. You can grow an audience and grow a skill at the same time. You can have a loyal following that you can turn into a real side-hustle or business in a few months. There are three main tactics to drive growth. I’ll be explaining them in detail. Find Your Target Audience This is huge because it’s the thing that builds a relevant audience. Get In Their Head Who are they? What do they do? Who do they Follow? What photos do they like? These are all questions you need to answer when finding your target audience. If you aren’t targeting a specific person, they won’t like what you have to offer. It’s okay to assume some things. Hannah wants to have an audience of people interested in hand-lettering as an art form. She also wants to attract potential buyers. Okay, so you’ve got an idea of the person you want to target, but where are they? Time to start digging. Digging Through Hashtags and Accounts You’ll need to find where the people you want to reach are hanging out. Figure it out by searching relevant hashtags and finding bigger accounts. They’ll have lots of followers and probably be doing something like your account. Often times, certain groups of people will adopt not so obvious hashtags. They have meaning within that tight-knit group of people. You’ll want to find those hashtags, and find the people who use them. When you find a big-ish account that does something similar to you or has a similar audience to the one you want to target, you have hit a goldmine. I say big-ish because large accounts (Say 200k+) tend to start having more of a spammy-fan base following. You’ll want to avoid them and try to get the real people that engage in what you do at a deeper level. 1. Follow Like. Follow Like. Repeat. You’re going to steal your audience. You heard me right. Once you find a big-ish account that is similar to yours, look at the follower list. The people at the top are recent followers. These people are important because they are: Following Rules Don’t go ham following every person on that account. There are rules and tactics that apply. Broaden your audience by using this tactic on several different accounts and hashtags. It helps create uniqueness in your audience. You can only follow about 50 accounts in five minutes safely. I recommend being even safer and doing about 300 in an hour. Remember, this is a 4-month haul. Don’t overdo it or you risk getting banned or getting an audience you don’t want. Other than that, use your judgment. You might be able to tell by a person’s profile picture and username that they are real and interested in what you do. A typical return using this method should approach a 25% follow back. Meaning, one out of every four people you follow will probably follow back. If your rate isn’t that high, maybe adjust to figure out who your target audience is. If your rate is that high, it’s not hard to get 100 new followers in a single day. 2. Instagram Pods (The Secret to Real Engagement) This growth tactic is very powerful. It allows your account to see pure engagement, all while being real. A pod is a group of people who assist each other in engagement on posts. For example, you can join a pod that has 15 people in it. Each day, people post content and you need to comment and like each post. This takes time, but it is worth it when you share your own post with your pod. They also need to engage. If each person in your pod likes and comments on the post, you’re going to get great numbers on your posts. Instagram won’t be able to tell where you got it from. Another advantage to pods is — there’s no limit to the number of pods you can be in or create yourself. It’s a matter of how much time you want to spend liking and commenting on other people’s content. How To Find A Pod Finding a pod isn’t too hard, and it comes in the form of Facebook Groups. My wife is a part of several hand-lettering Facebook Groups. In those groups, there are a lot of people that are willing to help you with whatever the topic of the group is. Find a Facebook Group that is similar to your niche and join it. If you’re lucky, there will already be an Instagram pod active in that group and you simply can join. Otherwise, you’ll have to make one yourself. Once you’re in, introduce yourself. Let people know who you are and what you are doing. Start building relationships. Engage on posts. Be a part of the community. When you have built a bit of a repertoire, huddle a select few members of the group into a private chat. Explain what a pod is and how it helps everyone. Most people are more than willing to join. Keep your pod small but not too small. If it’s too large you’ll spend all day liking and commenting on other people’s posts. If it’s too small, then why are we doing this? Rules of the Pod You’ll want to set rules for your pod. If you don’t, people will take advantage of it. Basic rules: You can make other rules, but those will cover most of your problems. Once your pod is up and running, you’ll be getting more engagement than ever! One way to hack this method further is to reply to every comment. The more real comments the better. 3. Post Consistent Content Often Content is king. No, but seriously. Your content is what the people came and stayed for. Make it well, make it consistent, and make it often. Show Up Every Day Well, as often as you can. This is for real people, remember? You’ll want to be posting at least one piece of content a day, but you can safely do up to three. Like most of these things, it depends on how much time you want to spend. Curate Your Content If your niche is Harley-Davidson motorcycles, don’t post a picture of your cat doing that weird thing it only does at exactly midnight. This might seem obvious, but some people like to over-share. Don’t let that be you. Post things that are relevant to your skill and audience. Sure, you can have fun, but keep it within the walls of your niche. If you veer too far from the original message of your content, your audience will soon begin to fade. They will move on to other people that fulfill their consumption needs. Using Hashtags Hashtag usage seems weird and random, but it’s useful for growth. Posts with hashtags have engagement well-above posts without. You’ll want to be using the hashtags that were researched when you were finding your target audience. But you have the freedom to use 30 hashtags in a post (in the comments) so why not take advantage of it? If you’re looking for popular hashtags, look no further than Tags For Likes. It’ll give you the most popular hashtags in many different categories. Hint: they include #tagsforlikes in the list. That’s obviously not what you want to use. The hashtag game is much like the keyword SEO game. Hannah is showing up at the top of different hashtags, but these are not the most popular hashtags in the world. You want to get the long-tail traffic. Hashtags that are semi-popular but not over-crowded. You want your post of 100 likes to be at the top, not competing with posts that have 14,000 likes. Publishing Tools If you want to create awesome posts without spending a dime on expensive graphics software, use Canva. It’s almost always more than enough to make something professional. If you’re really good, you can use that in collaboration with Buffer and automate your posting schedule. That leaves you with a more hands-off approach to posting your content. It allows you to engage with your audience and not worry about posting every day. Hannah did not use either of these programs. It depends on your niche and what they want from your content. BONUS: Cheater Posts If you’re looking for more engagement on posts — these two tricks work amazingly. Stolen from Secret Sauce. Growth Isn’t Hard But it takes time. It’s not hard to do this, but you have to be willing to put in the minimal time and effort. Consistency is key, and you want to provide something that people want to follow. It’s okay to have an off day and not post anything. If you do, recoup tomorrow and post two things. Get back on track and continue to show up every day. It helps to have natural talent. But in reality, anyone can learn in public. People like to be part of your story. Find your audience and start a journey. None of this information applies unless you get started. What are you waiting for? Click the heart if you liked it, follow if you loved it! Feel free to share, and comment below if you have any questions. ", "title": "The Best Way To Get 3000 Instagram Followers in 4 Months", "sentences": [{"3141": "The Best Way To Get 3000 Instagram Followers in 4 Months"}, {"6a15": "The part-time, non-rapid-growth, semi-natural way."}, {"a1ff": "You might think, “4 Months, that’s easy!”, and you would be right. But this advice isn’t for you."}, {"59ae": "You’re a real person with a real life, a real family, and real responsibilities. You can’t afford to spend countless hours on Instagram growing your following. It’s not workable."}, {"5592": "Real people don’t want bots and they don’t want fake engagement. They want to build a real following that has real potential to make real money."}, {"67d2": "This method is for us real people. People who want to spend an hour a day or less on Instagram, yet see consistent growth."}, {"5461": "Context"}, {"f76f": "My wife (Hannah 👋) has grown her hand-lettering Instagram account (@thegenuinelife) to 3000 followers in a non-spammy and community thriving way. She has very dedicated followers and a real opportunity to turn her following into an income."}, {"100f": "The Genuine Life (@thegenuinelife) * Instagram photos and videos2,975 Followers, 3,226 Following, 103 Posts - See Instagram photos and videos from The Genuine Life (@thegenuinelife)www.instagram.com"}, {"4683": "She started her account in January 2017. It’s now April 2017 (100 posts later) and she has 3000 followers with about 40 comments and 200 likes on every post."}, {"a0c6": "Here’s the kick — She didn’t start hand-lettering until January 2017. That’s right. She started lettering when she started her account. She’s not an expert, she isn’t even as good as many of her friends that have way fewer followers."}, {"f97d": "Her account is now seeing organic growth because she is showing up in the top posts of many hashtags. On top of that, it’s not hard for her to get 100 followers a day when she sits down and applies these methods for about an hour."}, {"7482": "You can learn in public. You can grow an audience and grow a skill at the same time. You can have a loyal following that you can turn into a real side-hustle or business in a few months."}, {"d2ac": "There are three main tactics to drive growth. I’ll be explaining them in detail."}, {"674e": "Find Your Target Audience"}, {"a76e": "This is huge because it’s the thing that builds a relevant audience."}, {"d856": "Get In Their Head"}, {"0889": "Who are they? What do they do? Who do they Follow? What photos do they like?"}, {"cc94": "These are all questions you need to answer when finding your target audience. If you aren’t targeting a specific person, they won’t like what you have to offer."}, {"ff90": "It’s okay to assume some things. Hannah wants to have an audience of people interested in hand-lettering as an art form. She also wants to attract potential buyers."}, {"c456": "Okay, so you’ve got an idea of the person you want to target, but where are they? Time to start digging."}, {"87cc": "Digging Through Hashtags and Accounts"}, {"7dbc": "You’ll need to find where the people you want to reach are hanging out. Figure it out by searching relevant hashtags and finding bigger accounts. They’ll have lots of followers and probably be doing something like your account."}, {"5580": "Often times, certain groups of people will adopt not so obvious hashtags. They have meaning within that tight-knit group of people. You’ll want to find those hashtags, and find the people who use them."}, {"ae71": "When you find a big-ish account that does something similar to you or has a similar audience to the one you want to target, you have hit a goldmine."}, {"3cf8": "I say big-ish because large accounts (Say 200k+) tend to start having more of a spammy-fan base following. You’ll want to avoid them and try to get the real people that engage in what you do at a deeper level."}, {"f45a": "1. Follow Like. Follow Like. Repeat."}, {"e37f": "You’re going to steal your audience."}, {"cfc1": "You heard me right."}, {"1d46": "Once you find a big-ish account that is similar to yours, look at the follower list. The people at the top are recent followers. These people are important because they are:"}, {"99b9": "Following Rules"}, {"60c5": "Don’t go ham following every person on that account. There are rules and tactics that apply."}, {"646f": "Broaden your audience by using this tactic on several different accounts and hashtags. It helps create uniqueness in your audience."}, {"8013": "You can only follow about 50 accounts in five minutes safely. I recommend being even safer and doing about 300 in an hour."}, {"89b7": "Remember, this is a 4-month haul. Don’t overdo it or you risk getting banned or getting an audience you don’t want."}, {"c3d0": "Other than that, use your judgment. You might be able to tell by a person’s profile picture and username that they are real and interested in what you do."}, {"eef7": "A typical return using this method should approach a 25% follow back. Meaning, one out of every four people you follow will probably follow back."}, {"d81c": "If your rate isn’t that high, maybe adjust to figure out who your target audience is. If your rate is that high, it’s not hard to get 100 new followers in a single day."}, {"fbe5": "2. Instagram Pods (The Secret to Real Engagement)"}, {"cbaa": "This growth tactic is very powerful. It allows your account to see pure engagement, all while being real."}, {"5cbf": "A pod is a group of people who assist each other in engagement on posts."}, {"f630": "For example, you can join a pod that has 15 people in it. Each day, people post content and you need to comment and like each post. This takes time, but it is worth it when you share your own post with your pod. They also need to engage."}, {"aaf2": "If each person in your pod likes and comments on the post, you’re going to get great numbers on your posts. Instagram won’t be able to tell where you got it from."}, {"9ac8": "Another advantage to pods is — there’s no limit to the number of pods you can be in or create yourself. It’s a matter of how much time you want to spend liking and commenting on other people’s content."}, {"6e43": "How To Find A Pod"}, {"71cb": "Finding a pod isn’t too hard, and it comes in the form of Facebook Groups."}, {"7103": "My wife is a part of several hand-lettering Facebook Groups. In those groups, there are a lot of people that are willing to help you with whatever the topic of the group is."}, {"ee98": "Find a Facebook Group that is similar to your niche and join it. If you’re lucky, there will already be an Instagram pod active in that group and you simply can join. Otherwise, you’ll have to make one yourself."}, {"1a03": "Once you’re in, introduce yourself. Let people know who you are and what you are doing. Start building relationships. Engage on posts. Be a part of the community."}, {"ca37": "When you have built a bit of a repertoire, huddle a select few members of the group into a private chat. Explain what a pod is and how it helps everyone. Most people are more than willing to join."}, {"0638": "Keep your pod small but not too small. If it’s too large you’ll spend all day liking and commenting on other people’s posts. If it’s too small, then why are we doing this?"}, {"0475": "Rules of the Pod"}, {"8d64": "You’ll want to set rules for your pod. If you don’t, people will take advantage of it."}, {"8b4d": "Basic rules:"}, {"d1f6": "You can make other rules, but those will cover most of your problems."}, {"f19f": "Once your pod is up and running, you’ll be getting more engagement than ever! One way to hack this method further is to reply to every comment. The more real comments the better."}, {"88bf": "3. Post Consistent Content Often"}, {"57ca": "Content is king."}, {"97dc": "No, but seriously. Your content is what the people came and stayed for. Make it well, make it consistent, and make it often."}, {"1404": "Show Up Every Day"}, {"0f75": "Well, as often as you can. This is for real people, remember?"}, {"0220": "You’ll want to be posting at least one piece of content a day, but you can safely do up to three. Like most of these things, it depends on how much time you want to spend."}, {"cc8e": "Curate Your Content"}, {"5e74": "If your niche is Harley-Davidson motorcycles, don’t post a picture of your cat doing that weird thing it only does at exactly midnight."}, {"d784": "This might seem obvious, but some people like to over-share. Don’t let that be you. Post things that are relevant to your skill and audience."}, {"2c06": "Sure, you can have fun, but keep it within the walls of your niche."}, {"ca78": "If you veer too far from the original message of your content, your audience will soon begin to fade. They will move on to other people that fulfill their consumption needs."}, {"78a3": "Using Hashtags"}, {"8752": "Hashtag usage seems weird and random, but it’s useful for growth. Posts with hashtags have engagement well-above posts without."}, {"58f6": "You’ll want to be using the hashtags that were researched when you were finding your target audience. But you have the freedom to use 30 hashtags in a post (in the comments) so why not take advantage of it?"}, {"f901": "If you’re looking for popular hashtags, look no further than Tags For Likes. It’ll give you the most popular hashtags in many different categories. Hint: they include #tagsforlikes in the list. That’s obviously not what you want to use."}, {"913b": "The hashtag game is much like the keyword SEO game. Hannah is showing up at the top of different hashtags, but these are not the most popular hashtags in the world."}, {"48e8": "You want to get the long-tail traffic. Hashtags that are semi-popular but not over-crowded. You want your post of 100 likes to be at the top, not competing with posts that have 14,000 likes."}, {"2cc6": "Publishing Tools"}, {"c1e9": "If you want to create awesome posts without spending a dime on expensive graphics software, use Canva. It’s almost always more than enough to make something professional."}, {"c145": "If you’re really good, you can use that in collaboration with Buffer and automate your posting schedule. That leaves you with a more hands-off approach to posting your content. It allows you to engage with your audience and not worry about posting every day."}, {"d0f8": "Hannah did not use either of these programs. It depends on your niche and what they want from your content."}, {"96a1": "BONUS: Cheater Posts"}, {"6306": "If you’re looking for more engagement on posts — these two tricks work amazingly. Stolen from Secret Sauce."}, {"b927": "Growth Isn’t Hard"}, {"cc91": "But it takes time."}, {"67fe": "It’s not hard to do this, but you have to be willing to put in the minimal time and effort. Consistency is key, and you want to provide something that people want to follow."}, {"6a84": "It’s okay to have an off day and not post anything. If you do, recoup tomorrow and post two things. Get back on track and continue to show up every day."}, {"8166": "It helps to have natural talent. But in reality, anyone can learn in public. People like to be part of your story. Find your audience and start a journey."}, {"a566": "None of this information applies unless you get started. What are you waiting for?"}, {"13b1": "Click the heart if you liked it, follow if you loved it! Feel free to share, and comment below if you have any questions."}], "child": "634_1\t634_2634_1\t634_2634_1\t634_2"}