{"name": "639", "parent": "", "content": "Avoid a massive guest blogging fail, learn from our mistakes So, you started your blog, created it, filled it with valuable content, followed these best practices… and now you’ve started reading on how to promote your blog and stumbled upon hundreds and hundreds of blogs telling you to guest post on other blogs. But have you come across an updated lists of blogs that are actually accepting guest posts? If you have, tell us what search term you used because we haven’t been able to find a list that isn’t at least 3 years old. If you’re having our same problem read on, because we did the research and we have the answers. The situation… Ok so, The Social Us is not really an old player. We’re newcomers and as such we’ve been doing what most newcomers do: We’ve created valuable content to educate our readers, spread our content through multiple platforms, and accompanied all of our efforts with woke designs, and copy as strong as Rihanna’s attitude. The thing is… we haven’t really seen that big of a difference in our community’s growth so we turned our collective eye to one of the most invaluable blogging best practices most newcomers forget: Promoting our content. Of course we’ve revamped our social media strategy, and headed over to Medium (Both of those are showing the results we were expecting, which we’ll of course be sharing in the future). But we also decided to give link building a try, which ended up in us following the typical advice from the more seasoned players. I.e: Skyscraping, guest blogging, making a sex tape, getting Donald Trump to fight us on Twitter, etc. We’ve only tried two of those so far, and we’re going to share our results with one. The Truth… Source: Jeff Sheldon | Unsplash Making your desk look suspiciously instagram ready will take less time, effort and tears than trying to guest blog. Guest blogging is a great idea… on paper. After all, you have the opportunity to create links to your blog, have your information shown, and it helps increase traffic to your blog, and even allows you to make money blogging (some blogs offer money in exchange of blog posts, ain’t that crazy AF?). But when it comes to actually doing it, things are a little more complicated than expected: Ok, so let’s get down to business this is what we’ve found, as of 2017 when it comes to websites that accept guest bloggers: Pros: With a lifetime visitor’s count of over 300K, you bet your message will be read, they have some good content on tips about growing as a professional and their rules and guides to write “for them” are not that pushy. Cons: “No freelancers or staff-writers, please.” so, money is not an option here, and agencies are not welcomed. Our experience: Haven’t heard back (We are staff-writers though, so…) Pros: The rules are pretty standard, and at a 500 word count per article, they aren’t too hard to follow. They’re also visited by people in India, with with an average time on the site of 2:12. Cons: No links in the articles, but you get to put two links in your bio, and you’ll need to stick to their subject matters which is mainly Digital Marketing. And well, their design is not very attractive, makes you want to shoot yourself after 5 minutes of scrolling, very visited by Our Experience: Radio Silence. Pros: They cover more topics than the standard blog, like: Blog design, content writing, video Posts and web tools. Cons: they have a single contact email, it’s their editor Daniel Scocco, which means his inbox might be a little crowded so… Our Experience: After a week of waiting, we haven’t got news from them. Pros: There’s no writing an email you need to create an account, ask for verification and wait at least two weeks for approval, but maybe they’ll eventually change it once they become more popular (we can only hope) Cons: They reserve the right to modify your piece as they see fit, but I don’t think that’s going to be an issue here, just follow the guidelines and everything will be fine. Our Experience: We’ve followed their guidelines and haven’t heard back. Maybe they just decided an email wasn’t personal enough and went with a more classic reply Pros: The design is quite colorful, and Trevor Curwin who is its Editor-in-Chief has an impressive cv, this is the kind of blogs you want to be a part of. Cons: Your topic has to match their editorial line, you’re better off if you just stick to these, so, read+write. Our Experience: Come on, guys, sing along with us: No response. We won’t hold it against these dudes since they do tell you right off the bat they’ll delete your email if your pitch doesn’t meet their standards. Maybe we’ll just try again in the future. Pros: There’s a lot of other contributors, so if you manage to get yourself in there, you’ll be in the perfect place for some serious networking. Cons: You have to register in order to star even reading or seeing the web as it is, thus it’s not that famous anymore, similarweb shows a decrease of over 40% of their reach! And once you’re in, chances are you’ll find yourself surrounded by other people trying to get the same results as you so in terms of organic reach or link building we don’t think you’ll amount to much. still want to give it a shot? Their join us page will guide you through the process and give you the guidelines you need to know. Our Experience: No response. Pros: Their Guidelines are pretty easy to follow, and since they are pretty strict with their duplicate content policy is safe to assume they have a solid reputation. And they promise permanent do-follow links so long as you keep your account active and reply to comments. Cons: You have to pay to be featured. Also it isn’t visually appealing, their thumbnails don’t show pics, but we guess that’s going to change soon (Maybe applying for a Designer position would be more profitable than trying to guest blog for them) . Our Experience: A response telling us their fee, and a permanent headache for the writer assigned to reaching out to these blogs. Pros: They’re guidelines aren’t too strict. although they were falling a little bit down, they started rising up again lately. So now it’s the perfect time to go and show them you have what it takes Cons: Doesn’t the world “Sentral” kinda makes you want to give up your faith in humanity? Our Experience: No response. And a heartbroken SEO writer…you can always unbreak his heart by inviting him to post on your blog. Pros: they’re keeping their place up-to-date with this year’s tendencies, it’s easy to navigate and has the “guest post” button on the top left of the page, their guidelines aren’t hard, but are hard to read, they have a picture saying “We love guest authors” photoshopped so badly that is actually kind of nice. Cons: the design is way too old fashioned, it doesn’t add up anything to today’s trends and kind of speaks of the same topic all the time, we get it, it says From Developers but, couldn’t we write about something like the human interaction with technology. Our experience: They’re liars, they say they love guest authors, but they never reply. In spite of most guides, don’t even try in… And the winner is La La… wait, no. There’s no “best” way to go about link building without wasting precious resources, and coming the other side empty handed. But, here’s what you can do: In conclusion… Originally published at blog.thesocialus.com. ", "title": "Avoid a massive guest blogging fail, learn from our mistakes", "sentences": [{"0435": "Avoid a massive guest blogging fail, learn from our mistakes"}, {"762d": "So, you started your blog, created it, filled it with valuable content, followed these best practices… and now you’ve started reading on how to promote your blog and stumbled upon hundreds and hundreds of blogs telling you to guest post on other blogs. But have you come across an updated lists of blogs that are actually accepting guest posts? If you have, tell us what search term you used because we haven’t been able to find a list that isn’t at least 3 years old. If you’re having our same problem read on, because we did the research and we have the answers."}, {"c64c": "The situation…"}, {"1f48": "Ok so, The Social Us is not really an old player. We’re newcomers and as such we’ve been doing what most newcomers do: We’ve created valuable content to educate our readers, spread our content through multiple platforms, and accompanied all of our efforts with woke designs, and copy as strong as Rihanna’s attitude."}, {"3ee2": "The thing is… we haven’t really seen that big of a difference in our community’s growth so we turned our collective eye to one of the most invaluable blogging best practices most newcomers forget: Promoting our content."}, {"00cc": "Of course we’ve revamped our social media strategy, and headed over to Medium (Both of those are showing the results we were expecting, which we’ll of course be sharing in the future). But we also decided to give link building a try, which ended up in us following the typical advice from the more seasoned players. I.e: Skyscraping, guest blogging, making a sex tape, getting Donald Trump to fight us on Twitter, etc. We’ve only tried two of those so far, and we’re going to share our results with one."}, {"3842": "The Truth…"}, {"d820": "Source: Jeff Sheldon | Unsplash"}, {"a836": "Making your desk look suspiciously instagram ready will take less time, effort and tears than trying to guest blog."}, {"695a": "Guest blogging is a great idea… on paper. After all, you have the opportunity to create links to your blog, have your information shown, and it helps increase traffic to your blog, and even allows you to make money blogging (some blogs offer money in exchange of blog posts, ain’t that crazy AF?)."}, {"938c": "But when it comes to actually doing it, things are a little more complicated than expected:"}, {"bf53": "Ok, so let’s get down to business this is what we’ve found, as of 2017 when it comes to websites that accept guest bloggers:"}, {"b409": "Pros: With a lifetime visitor’s count of over 300K, you bet your message will be read, they have some good content on tips about growing as a professional and their rules and guides to write “for them” are not that pushy."}, {"9d1b": "Cons: “No freelancers or staff-writers, please.” so, money is not an option here, and agencies are not welcomed."}, {"8456": "Our experience: Haven’t heard back (We are staff-writers though, so…)"}, {"9fce": "Pros: The rules are pretty standard, and at a 500 word count per article, they aren’t too hard to follow. They’re also visited by people in India, with with an average time on the site of 2:12."}, {"8d07": "Cons: No links in the articles, but you get to put two links in your bio, and you’ll need to stick to their subject matters which is mainly Digital Marketing. And well, their design is not very attractive, makes you want to shoot yourself after 5 minutes of scrolling, very visited by"}, {"fbdc": "Our Experience: Radio Silence."}, {"d7d1": "Pros: They cover more topics than the standard blog, like: Blog design, content writing, video Posts and web tools."}, {"849e": "Cons: they have a single contact email, it’s their editor Daniel Scocco, which means his inbox might be a little crowded so…"}, {"a3f0": "Our Experience: After a week of waiting, we haven’t got news from them."}, {"180f": "Pros: There’s no writing an email you need to create an account, ask for verification and wait at least two weeks for approval, but maybe they’ll eventually change it once they become more popular (we can only hope)"}, {"a868": "Cons: They reserve the right to modify your piece as they see fit, but I don’t think that’s going to be an issue here, just follow the guidelines and everything will be fine."}, {"7bb1": "Our Experience: We’ve followed their guidelines and haven’t heard back."}, {"9502": "Maybe they just decided an email wasn’t personal enough and went with a more classic reply"}, {"8db3": "Pros: The design is quite colorful, and Trevor Curwin who is its Editor-in-Chief has an impressive cv, this is the kind of blogs you want to be a part of."}, {"cea0": "Cons: Your topic has to match their editorial line, you’re better off if you just stick to these, so, read+write."}, {"22f7": "Our Experience: Come on, guys, sing along with us: No response. We won’t hold it against these dudes since they do tell you right off the bat they’ll delete your email if your pitch doesn’t meet their standards. Maybe we’ll just try again in the future."}, {"4d6e": "Pros: There’s a lot of other contributors, so if you manage to get yourself in there, you’ll be in the perfect place for some serious networking."}, {"9123": "Cons: You have to register in order to star even reading or seeing the web as it is, thus it’s not that famous anymore, similarweb shows a decrease of over 40% of their reach! And once you’re in, chances are you’ll find yourself surrounded by other people trying to get the same results as you so in terms of organic reach or link building we don’t think you’ll amount to much. still want to give it a shot? Their join us page will guide you through the process and give you the guidelines you need to know."}, {"ab58": "Our Experience: No response."}, {"e22e": "Pros: Their Guidelines are pretty easy to follow, and since they are pretty strict with their duplicate content policy is safe to assume they have a solid reputation. And they promise permanent do-follow links so long as you keep your account active and reply to comments."}, {"3bfb": "Cons: You have to pay to be featured. Also it isn’t visually appealing, their thumbnails don’t show pics, but we guess that’s going to change soon (Maybe applying for a Designer position would be more profitable than trying to guest blog for them) ."}, {"d079": "Our Experience: A response telling us their fee, and a permanent headache for the writer assigned to reaching out to these blogs."}, {"3efa": "Pros: They’re guidelines aren’t too strict. although they were falling a little bit down, they started rising up again lately. So now it’s the perfect time to go and show them you have what it takes"}, {"9d17": "Cons: Doesn’t the world “Sentral” kinda makes you want to give up your faith in humanity?"}, {"7a4d": "Our Experience: No response. And a heartbroken SEO writer…you can always unbreak his heart by inviting him to post on your blog."}, {"621a": "Pros: they’re keeping their place up-to-date with this year’s tendencies, it’s easy to navigate and has the “guest post” button on the top left of the page, their guidelines aren’t hard, but are hard to read, they have a picture saying “We love guest authors” photoshopped so badly that is actually kind of nice."}, {"ef6c": "Cons: the design is way too old fashioned, it doesn’t add up anything to today’s trends and kind of speaks of the same topic all the time, we get it, it says From Developers but, couldn’t we write about something like the human interaction with technology."}, {"f0d1": "Our experience: They’re liars, they say they love guest authors, but they never reply."}, {"86e0": "In spite of most guides, don’t even try in…"}, {"0f23": "And the winner is La La… wait, no."}, {"51ae": "There’s no “best” way to go about link building without wasting precious resources, and coming the other side empty handed. But, here’s what you can do:"}, {"5a6c": "In conclusion…"}, {"8f77": "Originally published at blog.thesocialus.com."}], "child": "639_1\t639_2\t639_3\t639_4639_1\t639_2\t639_3\t639_4"}