{"name": "641", "parent": "", "content": "A Letter to the Brass Dear CEO, In 2014, I sat on the jury of a murder trial. The first question the defence barrister asked us was, ‘What was the first thing you read on social media today?’ It was 11am, and I had no idea, despite having being glued to my phone during an hour commute to trial. I couldn’t remember one thing I had read, watched or scrolled past on my phone. Of the ten plus marketing videos that cluttered your feed this morning, tell me one thing that happened, tell me who created them, who shared it with you, tell me what the ‘message’ was. The chances are you can’t. So why are we chasing it? Most marketing managers know exactly what they want they want to do. They’ve done their research, checked the data, have a clear view on the story they want to tell and the audience they want to reach but it all comes unstuck when they have to convince you (the Brass) to take the plunge and enable them to build connections with their audience. “What irritates me are people who create complications because they think they are professionals by creating complications” Karl Lagerfeld Look at retail. Shoppers are switching between brands that offer the right discount. Take Topman, they insist on telling me every morning about a different sale, a new offer an incentive to engage. Sure, I need some new jeans so I’ll buy them — who doesn’t want cheaper jeans? But you can’t buy loyalty. Bureaucracy sh*ts on creativity. As with most investments, you’re the one who holds the hard cash and you need solid reassurances. I’m sure it’s without intention but bureaucracy sh*ts on creativity. So what happens? Marketing managers end up being forced to do low-risk activity, playing it safe. It’s why we see so many emojis in marketing, as if some how *insert emoji* is suddenly going to make people buy more *insert product*. And it makes sense. No one wants you to fire them, right? But by being low risk, bureaucracy forces marketers to chase the same metrics. Obsessed with vanity, pushing for high numbers because twenty million views on Facebook equals a promotion and bonus, right? Boring. If reach is what you want for your company and brand then put your video on TV, but don’t count on anyone remembering it tomorrow. They were probably at the fridge anyway. Vanity metrics do not equal longevity. It doesn’t strengthen your brand, engage your audience or make anyone fancy you. If you’re trying to reach a young, savvy audience who crave experience via video content then you’d better let your marketeers develop a damn unique proposition as no matter how much cash you pump in, you’re just another set of moving images on a relentlessly scrolling screen. Give us something we can believe in. Give us a story we can repeat. Give us a reason to champion your brand. Take Monzo. Not only is their product revolutionising banking but Monzo have translated their vision into a brand that puts honesty, transparency and community at the heart of everything they create. monzo.com/transparency Take Supreme. There aren’t any other clothing brands that evokes fandom like they do. Supreme Subway Tickets I just have one request. Stop putting marketeers in a position where they are chasing numbers just to please you. It’s your customers you should be thinking about. It’ll payoff. Love, Sam x ", "title": "A Letter to the Brass", "sentences": [{"0167": "A Letter to the Brass"}, {"8319": "Dear CEO,"}, {"4a9b": "In 2014, I sat on the jury of a murder trial. The first question the defence barrister asked us was, ‘What was the first thing you read on social media today?’"}, {"2007": "It was 11am, and I had no idea, despite having being glued to my phone during an hour commute to trial. I couldn’t remember one thing I had read, watched or scrolled past on my phone."}, {"f41a": "Of the ten plus marketing videos that cluttered your feed this morning, tell me one thing that happened, tell me who created them, who shared it with you, tell me what the ‘message’ was. The chances are you can’t. So why are we chasing it?"}, {"16f3": "Most marketing managers know exactly what they want they want to do. They’ve done their research, checked the data, have a clear view on the story they want to tell and the audience they want to reach but it all comes unstuck when they have to convince you (the Brass) to take the plunge and enable them to build connections with their audience."}, {"a6f6": "“What irritates me are people who create complications because they think they are professionals by creating complications” Karl Lagerfeld"}, {"a0af": "Look at retail."}, {"d24f": "Shoppers are switching between brands that offer the right discount. Take Topman, they insist on telling me every morning about a different sale, a new offer an incentive to engage. Sure, I need some new jeans so I’ll buy them — who doesn’t want cheaper jeans? But you can’t buy loyalty."}, {"180a": "Bureaucracy sh*ts on creativity."}, {"a075": "As with most investments, you’re the one who holds the hard cash and you need solid reassurances. I’m sure it’s without intention but bureaucracy sh*ts on creativity."}, {"84b2": "So what happens?"}, {"f1f7": "Marketing managers end up being forced to do low-risk activity, playing it safe. It’s why we see so many emojis in marketing, as if some how *insert emoji* is suddenly going to make people buy more *insert product*."}, {"f52c": "And it makes sense. No one wants you to fire them, right?"}, {"0cf0": "But by being low risk, bureaucracy forces marketers to chase the same metrics. Obsessed with vanity, pushing for high numbers because twenty million views on Facebook equals a promotion and bonus, right?"}, {"62d8": "Boring."}, {"d058": "If reach is what you want for your company and brand then put your video on TV, but don’t count on anyone remembering it tomorrow. They were probably at the fridge anyway."}, {"01b9": "Vanity metrics do not equal longevity. It doesn’t strengthen your brand, engage your audience or make anyone fancy you."}, {"c8af": "If you’re trying to reach a young, savvy audience who crave experience via video content then you’d better let your marketeers develop a damn unique proposition as no matter how much cash you pump in, you’re just another set of moving images on a relentlessly scrolling screen."}, {"5ac5": "Give us something we can believe in. Give us a story we can repeat. Give us a reason to champion your brand."}, {"de59": "Take Monzo."}, {"332c": "Not only is their product revolutionising banking but Monzo have translated their vision into a brand that puts honesty, transparency and community at the heart of everything they create."}, {"cf0a": "monzo.com/transparency"}, {"9b6d": "Take Supreme."}, {"33ac": "There aren’t any other clothing brands that evokes fandom like they do."}, {"0f5f": "Supreme Subway Tickets"}, {"714f": "I just have one request. Stop putting marketeers in a position where they are chasing numbers just to please you. It’s your customers you should be thinking about."}, {"b4b6": "It’ll payoff."}, {"8adc": "Love,"}, {"93ef": "Sam x"}], "child": "641_1\t641_2"}