{"name": "642", "parent": "", "content": "Stop Pretending to Be A Data Scientist: Pseudoscientific Split Testing is a Waste Every would-be digital marketer goes through an evolution of understanding about the idea of split testing. The best of them usually get to the point where they realize they need to focus their tests on one variable and that they need to reach a certain sample size before they choose a winner. Little guy doesn’t even know what a p-value is yet Then, they begin to take statistical significance into account. They learn about sample sizes and confirmation bias. Maybe they even resort to Bayesian analyses of their data. He was testing for statistical significance before it was cool. But even then, there are some blind spots. False positives, regression to the mean, sample pollution. Plenty of room for error. The Pitfalls of Split Testing “What if I told you most winning A/B test results are illusory?” As Quick Sprout data scientist Will Kurt wrote back when he was the lead data scientist at KISSmetrics: A/B tests are designed to imitate scientific experiments, but most marketers running A/B Tests do not live in a world that is anything like a lab at a university. Not only do we not live in a university lab, but in most cases, we don’t even have the tools to create an environment that comes anywhere close. Running a test in AdWords is like trying to run a clinical trial in a Chuck E. Cheese. You have no control over who comes in, where they sit, or whether or not they get in the ball pit. You’re Doing It Wrong Data Science Dr. Martin Goodson. Source: Twitter When he was research lead at Qubit, Dr. Martin Goodson (currently Chief Scientist at Evolution AI) wrote a white paper called “Most Winning A/B Test Results Are Illusory”. In the paper, Goodson explains how “badly performed A/B tests can produce winning results which are more likely to be false than true.” If you don’t read the white paper, you might think, “Oh, that doesn’t apply to me. I test until I reach statistical significance!” There’s more to it than that. Read the paper. (Also, the American Statistical Association released this “Statement on Statistical Significance and p-Values” in March of 2016. You ought to read that too.) “Statistical significance. You keep using that word. I don’t think it means what you think it means.” The Catch-22 of Split Testing Even ignoring problems with so-called statistical significance, there are two problems digital marketers of smaller accounts run into when trying to run a good split test. One is the sample size. It’s too small. “…” The second is the test duration. It’s too long. “That’s what she said!” For accounts that aren’t reaching a certain number of conversions each month, the need to run longer tests (to reach the desired sample size) leads to a greater likelihood of sample pollution as users delete their cookies and third-party split testing solutions can’t keep treatment groups separated. “If you don’t know about sample pollution, stop testing.” — Bart Schutz And when you’re testing ad copy or creative, the problem is even worse. For example, on AdWords, there is no way to ensure that a user only sees one variation of the ad. Sample pollution is almost guaranteed. One person could see both ads multiple times. He could see one on a Monday morning, one on a Tuesday afternoon. One on Christmas Eve while he’s at home opening a gift (it’s a sweater), one two days after January 1 at the mall (he’s taking the sweater back), and three while he’s looking at his phone during dinner as he assures his soon-to-be ex-girlfriend that he loved the sweater she got him. What’s the point of attempting a rigorous scientific experiment under those conditions? Does adding a p-value requirement significantly increase the ability to predict success? I doubt it. So…? Where does that leave us? Is this what existential angst feels like? Uli is a nihilist. He doesn’t care about ad optimization. What do you do? Just leave your ads running forever, damn optimization? Go with your gut and just make adjustments whenever the mood strikes you? How do we live in this scary new world without the false sense of security derived from bogus data science? Now, now. Calm down! You just need to make a realistic assessment of your current approach, and make adjustments to ensure that you’re not wasting your time or your (client’s) money. Here’s how: The Highly Unscientific Kick Ass Methodology Since becoming disillusioned with the attempt to run scientific studies in the uncontrolled environment that is AdWords (and Facebook, and Bing, and every other online advertising platform developed so far), I’ve begun implementing my highly unscientific Kick Ass methodology (using this AdWords script). I require an average of 1,000 impressions per ad, and a two percentage point difference in the metric I’m testing (conversion rate, click-through rate, etc.) to choose a winner. If neither ad pulls away enough to meet that threshold after reaching 3000 impressions, I say it’s too close to ever get a definitive answer. I go ahead and pick the “winner” and try to create an ad that’s substantially better. Cage fighting for ads My theory is this: if one ad isn’t really kicking the ass of the other one, any difference between them is insignificant. With all the variables we can’t control, who knows if a 0.5% improvement is just because some people saw the same ad multiple times, or on a certain day, or when the weather was just so, etc.? This might not be an acceptable way to run a medical study, but it works for optimizing ad copy. Your Thoughts? My goal is to reduce wasted effort and ad spend. If I can improve results with better testing I want to do it, but most digital advertising platforms simply don’t allow for the sort of controlled environment needed for a good test. That being the case, are we better off simplifying our testing methodologies to leave more time for other account management activities? What do you think? Is an attempt at rigorous split testing worth it or should we settle for a simpler approach? If you found this post interesting (or infuriating), click the heart below, because that will keep the conversation going. ", "title": "Stop Pretending to Be A Data Scientist: Pseudoscientific Split Testing is a Waste", "sentences": [{"c98d": "Stop Pretending to Be A Data Scientist: Pseudoscientific Split Testing is a Waste"}, {"6a52": "Every would-be digital marketer goes through an evolution of understanding about the idea of split testing. The best of them usually get to the point where they realize they need to focus their tests on one variable and that they need to reach a certain sample size before they choose a winner."}, {"dd44": "Little guy doesn’t even know what a p-value is yet"}, {"a93e": "Then, they begin to take statistical significance into account. They learn about sample sizes and confirmation bias. Maybe they even resort to Bayesian analyses of their data."}, {"08a7": "He was testing for statistical significance before it was cool."}, {"322b": "But even then, there are some blind spots. False positives, regression to the mean, sample pollution. Plenty of room for error."}, {"f569": "The Pitfalls of Split Testing"}, {"3ebf": "“What if I told you most winning A/B test results are illusory?”"}, {"913f": "As Quick Sprout data scientist Will Kurt wrote back when he was the lead data scientist at KISSmetrics:"}, {"f779": "A/B tests are designed to imitate scientific experiments, but most marketers running A/B Tests do not live in a world that is anything like a lab at a university."}, {"c4d4": "Not only do we not live in a university lab, but in most cases, we don’t even have the tools to create an environment that comes anywhere close."}, {"2571": "Running a test in AdWords is like trying to run a clinical trial in a Chuck E. Cheese. You have no control over who comes in, where they sit, or whether or not they get in the ball pit."}, {"2bc7": "You’re Doing It Wrong"}, {"a7d6": "Data Science Dr. Martin Goodson. Source: Twitter"}, {"1347": "When he was research lead at Qubit, Dr. Martin Goodson (currently Chief Scientist at Evolution AI) wrote a white paper called “Most Winning A/B Test Results Are Illusory”. In the paper, Goodson explains how “badly performed A/B tests can produce winning results which are more likely to be false than true.”"}, {"1d7b": "If you don’t read the white paper, you might think, “Oh, that doesn’t apply to me. I test until I reach statistical significance!” There’s more to it than that. Read the paper."}, {"9fd7": "(Also, the American Statistical Association released this “Statement on Statistical Significance and p-Values” in March of 2016. You ought to read that too.)"}, {"c7c5": "“Statistical significance. You keep using that word. I don’t think it means what you think it means.”"}, {"f34d": "The Catch-22 of Split Testing"}, {"3ec3": "Even ignoring problems with so-called statistical significance, there are two problems digital marketers of smaller accounts run into when trying to run a good split test."}, {"c533": "One is the sample size. It’s too small."}, {"d659": "“…”"}, {"0561": "The second is the test duration. It’s too long."}, {"9bd0": "“That’s what she said!”"}, {"5042": "For accounts that aren’t reaching a certain number of conversions each month, the need to run longer tests (to reach the desired sample size) leads to a greater likelihood of sample pollution as users delete their cookies and third-party split testing solutions can’t keep treatment groups separated."}, {"52aa": "“If you don’t know about sample pollution, stop testing.” — Bart Schutz"}, {"afa6": "And when you’re testing ad copy or creative, the problem is even worse. For example, on AdWords, there is no way to ensure that a user only sees one variation of the ad. Sample pollution is almost guaranteed."}, {"8172": "One person could see both ads multiple times. He could see one on a Monday morning, one on a Tuesday afternoon. One on Christmas Eve while he’s at home opening a gift (it’s a sweater), one two days after January 1 at the mall (he’s taking the sweater back), and three while he’s looking at his phone during dinner as he assures his soon-to-be ex-girlfriend that he loved the sweater she got him."}, {"2a68": "What’s the point of attempting a rigorous scientific experiment under those conditions? Does adding a p-value requirement significantly increase the ability to predict success?"}, {"5552": "I doubt it."}, {"e253": "So…?"}, {"0a1f": "Where does that leave us? Is this what existential angst feels like?"}, {"dbd3": "Uli is a nihilist. He doesn’t care about ad optimization."}, {"7629": "What do you do? Just leave your ads running forever, damn optimization? Go with your gut and just make adjustments whenever the mood strikes you? How do we live in this scary new world without the false sense of security derived from bogus data science?"}, {"1268": "Now, now. Calm down! You just need to make a realistic assessment of your current approach, and make adjustments to ensure that you’re not wasting your time or your (client’s) money."}, {"cc70": "Here’s how:"}, {"0c7c": "The Highly Unscientific Kick Ass Methodology"}, {"79a8": "Since becoming disillusioned with the attempt to run scientific studies in the uncontrolled environment that is AdWords (and Facebook, and Bing, and every other online advertising platform developed so far), I’ve begun implementing my highly unscientific Kick Ass methodology (using this AdWords script)."}, {"a341": "I require an average of 1,000 impressions per ad, and a two percentage point difference in the metric I’m testing (conversion rate, click-through rate, etc.) to choose a winner."}, {"4836": "If neither ad pulls away enough to meet that threshold after reaching 3000 impressions, I say it’s too close to ever get a definitive answer. I go ahead and pick the “winner” and try to create an ad that’s substantially better."}, {"0e43": "Cage fighting for ads"}, {"e393": "My theory is this: if one ad isn’t really kicking the ass of the other one, any difference between them is insignificant. With all the variables we can’t control, who knows if a 0.5% improvement is just because some people saw the same ad multiple times, or on a certain day, or when the weather was just so, etc.?"}, {"ea02": "This might not be an acceptable way to run a medical study, but it works for optimizing ad copy."}, {"2b9f": "Your Thoughts?"}, {"3c24": "My goal is to reduce wasted effort and ad spend. If I can improve results with better testing I want to do it, but most digital advertising platforms simply don’t allow for the sort of controlled environment needed for a good test."}, {"4a16": "That being the case, are we better off simplifying our testing methodologies to leave more time for other account management activities?"}, {"6fcc": "What do you think? Is an attempt at rigorous split testing worth it or should we settle for a simpler approach?"}, {"e8ad": "If you found this post interesting (or infuriating), click the heart below, because that will keep the conversation going."}], "child": "642_1\t642_2"}