{"name": "646", "parent": "", "content": "25 Free Marketing Tricks I Used To Generate a Quarter-Million Page Views For My Startup When starting up a business, it’s easy to blame a lack of funds to explain why things aren’t getting off the ground. If you go around saying, “If only I had the means to invest in Facebook Ads, to organize a contest, or to buy such and such a software, customers would be coming in droves.” If that’s what you think, you’re a loser, and you’re hiding behind some lame excuses. I know what I’m talking about. Since launching Hardbacon last June, almost all of our marketing has been done without a budget. Since then, we generated 254,764 page views, convinced 5 435 people to subscribe to our newsletter and raised $67,880 through a crowdfunding campaign. I know that you want to learn exactly how I did it. The short answer is that I created content and tools that created value (or that will create value). It’s the basis of any good marketing, but I don’t want to bore you with that here. I assume what you would really like to know about are the specific techniques I used to get Hardbacon’s website and crowdfunding campaign in front of so many people’s eyes. These techniques don’t matter in the long run, but they can speed up your growth. So here are 25 subversive tips I used to promote Hardbacon since founding it seven months ago. 1. Display Your Ads on Other People’s Website Unless you are a media company, you will end up sharing a lot of links pointing to other website on social media. It’s great way to keep your audience engaged. However, it was impossible to benefit from this traffic… until online services like Back.ly were introduced. I started using Back.ly after launching Hardbacon’s crowdfunding campaign, but I certainly won’t stop after the campaign is over. Here’s how it works. When I want to share an article, I copy-paste it into Back.ly’s dashboard, and create a custom message that usually suggests to people that they should learn how to invest in the stock market with the course we are currently crowdfunding. Then, all I need to do is share the newly generated Back.ly link and a Facebook Messenger styled ad magically appears on the article when shared using this link. I always try to write something that relates to the content of the article. In the example above, the ad reads “Learn how not to invest like an idiot with Not Another Boring Course About Investment”, referring to the definition of “day trader” in the article. I started doing this with a competing website called Sniply, but I moved over at Back.ly because I can go over its 1000 clicks monthly limit by inviting friends to use the service. 2. Post Highly Shareable Content On Social Media A good way to grow your following on Facebook and Twitter is to share content that provides value to your audience… while compelling it to share. To do that, I frequently screen Facebook pages in the personal finance and investing niche, looking for quality content that has generated a lot of shares. Another way to find those highly shareable pieces of content is to use BuzzSumo, which is a search engine for viral content. It’s not free, but you they have a free 14 day trial you can abuse by creating a new account with a different email address every time it expires. You can also use WordLink, a free alternative built by my friend Nadav Perez. Since you know those articles have already been shared a lot, it’s likely that they will be shared by your audience, who will expose their friends to your brand when doing so. 3. Use Snapchat Creatively Snapchat can be used for more than just posting nonsense and naughty photos. For companies that know how to use it properly, Snapchat can payoff big-time, as it has an incredible rate of engagement. The only problem is that it’s difficult to build an audience, so you have to be creative. In my case, I printed my personal Snapcode on the back of my business cards, so that people I meet can add me by taking a picture of my card. We also experimented by defining financial terms through Snapchat stories on Hardbacon’s Snapchat account. We then reposted these videos on our YouTube account. After launching our crowdfunding campaign, we went further and sent direct messages to everyone who added Hardbacon on Snapchat with a picture asking them to support our campaign. 4. Use Job Boards as Marketing Channels Job Listings are something most startups need to promote, yet it seems like it’s a marketing effort unrelated to the main marketing KPIs. But it shouldn’t be that way. First, it’s huge waste of marketing efforts, and second, job listings should be selling the mission and the product of the company instead of being a filled with corporate bullshit and a long list of skills. So, since I desperately needed a marketing intern to help me during our crowdfunding campaign, I wrote a job offer for a “crowdfunding intern” that deliberately talked about our crowdfunding campaign, link included. I’ve not yet filled the position, but I had about 20 applications so far and this allowed me to tap into the audience of many free (or almost free) jobs websites. 5. Use your Profile Picture as a Billboard Since launching my crowdfunding campaign on Ulule, my personal profile picture on all my social media channels changes quite often. It’s really strategic, because it’s displayed every time I post something or comment. Here is my current profile picture across all channels: And here’s Hardbacon current profile picture: I went even further in exploiting this prime piece of real estate. I offered a deal on social media: I would change my profile pictures for other people’s logos (for 24 hours) in return for a contribution to our campaign. It worked a few times, proving I’m not the only one who consider the profile picture a valuable place to advertise. 6. Get the Media to Talk About You Getting media coverage is a good way to make your business known. However, unless your startup is worth gazillions, journalists couldn’t care less about your story. So you’ll have to stand out from all the other start-ups trying to get covered. As a former business journalist, I have a few contacts and I have been asked to comment on tech news quite often, but any one can do that by subscribing to the HARO mailing list and replying to the various requests of journalists. Leaving comments on Medium and on news websites is another good way to get the attention of the media. A comment I left on Medium was actually quoted on CNBC. A furious anti-Silicon Valley rant goes viralOptimizing nonstop is exhausting, but that's startup life. The goal is to become more productive, more successful, more…www.cnbc.com While targeting journalists that cover startups or products similar to yours is a good strategy, it won’t necessarily be enough. Those guys receive hundreds of emails a day and, sorry to tell you this, but your story is not that exciting. So use other channels. For example, I recorded a YouTube video addressed to a Reuters journalist covering fintech, and tweeted her the link. I did not land an article from Reuters, but I got her attention. She emailed me afterwards, proposing an informal phone interview. 7. Recycle Your Snapchat Stories on Facebook and Instagram Snapchat is a cool place to be, but doing video content that self-destructs within 24 hours is kind of wasteful. One thing I do to squeeze more views out of my Snapchat stories is to save them on my phone, and repost them on Instagram and Facebook. I’m not doing it on Hardbacon’s Facebook Page, as the quality of my stories is kind of low, but it’s good enough for my personal channels. And since I natively add captions to my Snapchat stories, it can be understood by those numerous Facebook and Instagram users who don’t want to turn the sound on without further editing. 8. Do Live Interviews on YouTube My first YouTube interview was with personal finance blogger Barry Choi. Doing video interviews is not that easy, because you have to plan a meeting in person, film the interview, do the editing, and upload the final result to YouTube Facebook or elsewhere. Having said that, you should know that you can do interviews directly on YouTube, by creating a live event to which you can invite another person. In doing so, those who have used the Google Hangout teleconference service will find themselves on familiar ground, as YouTube’s feature uses it. All you have to do is ask your guest some questions, and YouTube will handle alternating between your camera and the interviewee’s. When the interview is over, it immediately appears on your YouTube channel. After completing an interview, I use Fiverr ($5!) to get a transcription, and embed the YouTube video in a blog post, along with the written transcription. I did not have time to do this yet, but I plan on recycling those videos by publishing them natively on Facebook. 9. Associate With Influencers Many entrepreneurs tell me that they are jealous of the network I built for myself while I was a business journalist. I will not deny that this has helped make Hardbacon better known. That said, in terms of influencers, it’s not difficult to find someone who has a broader reach than I, and to use their influence to promote your business. That is exactly what I did in order to spread the word about Hardbacon’s crowdfunding campaign. I contacted people who are influencers and asked them to be ambassadors for our Ulule campaign, whose goal is to fund our investing course. Although some influencers monetize their visibility by requesting payment, the vast majority of people we contacted agreed to give us a hand for the worthy cause of financial literacy. The only thing we asked them to do is to share our campaign page and to provide us with a quote related to financial literacy. We then published those quotes on all our social media channels tagging their authors, who were nice enough to share those quotes. 10. Leverage Your Email Signature I send tons of emails everyday, so I would be crazy not to use this channel to promote my business objectives. At Hardbacon, we measure our marketing success by the number of newsletter subscribers. So, I very naturally include this line in my email signature: “Subscribe to Hardbacon’s Newsletter: http://hardba.co/subscribe”, using the URL shortener Lickstats for tracking purposes. It goes without saying I used the same technique to promote Hardbacon’s crowdfunding campaign in my email signature. 11. Automate Twitter As Much as Possible Twitter is almost dead and I wouldn’t advise anyone to put too much effort into this social network. Despite that, there are still people using this shrinking social network which is, however, easier to automate than others. For this reason, Twitter can still be used to do online marketing provided you understand its limitations. Keep in mind that the value of a new Twitter follower is extremely close to nothing as the probability that this new follower will see your tweets in the future is very low. That’s why you need to use automation. To do this, I used three techniques. 1. I followed the followers of business that have commonality with Hardbacon and unfollow those who don’t follow back. To speed up the process, I use Crowdfire. 2. I then use Zapier to ask my new followers to sign up for Hardbacon’s newsletter. 3. When I have something to communicate with my audience, I use Holr, which allows me to automatically send up to 90 private messages per day. 12. Automate Instagram (Sparingly) Automating actions on Instagram is a dangerous game, since this social network is very good at detecting accounts in violation of its Conditions of Use. If you are caught, you could lose your Instagram account. If your Instagram account has less than 200 followers and you’ve posted less than 50 photos, you probably shouldn’t use Instagress. If you have exceeded this limit and, like me, and you aren’t afraid to take risks, Instagress is for you. We use the online service to automatically follow the followers of Canadian companies who are marketing to the same target audience as Hardbacon and automatically like pictures containing certain tags. Instagress can be used for many things, but it’s what works best for us, as other strategies, like adding automatic comments, are too risky for my tastes. 13. Answer Questions on Quora If you’ve decided to go into business, it’s because you believe you understand something that others do not. In my opinion, the Quora questions/answers site is the ideal platform to showcase your expertise, by responding to questions that people have asked instead of answering questions that nobody has asked on your blog. Since Hardbacon targets only the Canadian market for the time being, I try to find questions Canadians have asked about investment, as much as possible. I do this by searching keywords like “TFSA” or “RBC”, which are unlikely to be used by internet users outside of Canada. When I answer questions, I don’t plug Hardbacon unless I can really help the person who asked the question by adding a link to Hardbacon. I just answer the questions honestly, and make my sales pitch in the mini bio underneath my name. Last month alone, my answers were viewed 1300 times on Quora, and I haven’t even answered any questions this month due to lack of time. 14. Add a Lot of People on Facebook Previously, when I returned from a conference or a meeting with business cards in my pockets, I was eager to add these new contacts on LinkedIn. Now, I continue to add people on LinkedIn, but I also add all my new contacts on Facebook. It’s quite logical, since Facebook is by far the social network that directs most of my visitors to Hardbacon. In addition, every week I prompt all the new friends I’ve added to my personal account to like Hardbacon’s Facebook page using a Chrome plugin called Invite All. 15. Give Lectures In traditional marketing, you pay for visibility. When you are penniless like me, you try to be paid to get visibility. As an entrepreneur, you have a lot to say, and you would benefit from sharing your expertise by giving lectures, even if it means giving the first ones without being paid. Personally, I do both. When the organizers of Fintech Startup Weekend approached me to give an unpaid lecture about my industry, I agreed because I believe in the cause, and I knew that they were volunteers. Another benefit from giving lectures is that you can reuse your slides by presenting it on SlideShare, where you can gain an entirely new audience. For example, my presentation about financial technologies in Canada received 484 views. The content is mine, but it was designed by Wiktoria Swiecicka, Hardbacon’s artistic director. 16. Do A/B Tests A/B tests don’t really pay off in the short-term, buy they do help increase the conversion rate, which can have a major impact on a company’s medium and long-term growth. The easiest way to do these tests is to resort to using online landing page creators. Since I didn’t have much money, I decided to abuse Unbounce’s 30-day free trial to do my tests, and then I cancelled the service before they debited my credit card. 17. Post an AMA on Reddit For those who don’t know, AMA is the acronym for “Ask Me Anything”. On Reddit, it means that you start a thread in which Reddit users can ask you any question. Technically, you can find a forum of your choice on Reddit and post an AMA without asking anyone’s permission. That said, the goal of such an exercise is to maximize your visibility, but by doing so, it could have the opposite effect. If you post an AMA and nobody asks you a question, your image will suffer. Furthermore, when I posted an AMA on Reddit, I made sure to do it by working with the moderators of the PersonalFinanceCanada forum, which publishes the AMA schedule on a thread highlighted on the forum. I also made sure to request that my audience come ask me questions, to try to get as many positive exchanges as possible. It didn’t stop many Reddit users from attacking me, but that’s inevitable on the web. 18. Live-stream as often as you can When you start a Facebook Live video, it notifies all your friends and followers who are logged into Facebook. For this reason alone, it’s a good strategy to use to defeat Facebook’s algorithm, which shares your normal statuses to only a fraction of your friend’s list. And if that isn’t enough, once your Facebook Live video is finished, it will have a second life on Facebook. Since launching our crowdfunding campaign, I did countless session of Facebook Live, whether to answer questions about a particular topic or even to do interviews with other people I would meet anyway. Facebook Live is the best platform to live stream for me, but it does not mean that I ignore other live streaming platforms such as Periscope (which allow you to tap into your Twitter audience), Instagram Live and YouTube Live. I use them, but much less. If you’re not as cheap as I am, you can even stream to many of those channels at the same time using a software called Wirecast. 19. Provide Visibility Without Asking For Anything in Return Providing visibility without asking for anything in return is one the most lucrative tactics that we have used at Hardbacon. It’s the reason why we did it frequently. We published a list of the best money bloggers in Canada on our website. Needless to say, many of those bloggers, like Jessica Moorhouse, shared our article. We also tagged them on the social media, which caused our posts to be shared many times. We did this again through different initiatives. All you need to do is to provide visibility to businesses or people with whom you have things in common, by interviewing them, tagging them or by sharing an article that talks about them, and there’s a good chance they’ll reciprocate. And if they don’t, it’s no big deal. Those things end up having a positive impact, so don’t be too impatient. 20. Set Up a Referral System It’s all well and good to ask your audience to share your things. But it’s even better to promise a reward to those who share more than others! You don’t have to reinvent the wheel to do so. At Hardbacon, we used Kickofflabs to build our Ulule campaign pre-launch referencing system. In fact, it was Ceilidh Barlow Cash, Harbdacon’s Content Director, who did all of that. Basically, once a user left their email address on this page, we asked them to share it with their friends. If three of their friends then also subscribed, the user could attend our Ulule campaign launch party. It was as simple as that. For those who don’t want to pay $39 per month for the service (especially if your campaign is longer than KickoffLabs’ 30 day money back guarantee), there’s also MaitreApp, a plugin sold at a one-time price of $99, that can be added to any website. 21. Send Handwritten Notes to Your Audience In an era when we are inundated with emails, texts and Facebook messages, sending a handwritten note by mail attracts attention. That’s what Khadija Jouini, Hardbacon’s Director of Marketing at the time, did by offering to mail a Hardbacon sticker to our Instagram followers. Here’s what we wrote on to this Hardbacon fan. “Dear Marc-André, Thank you for your precious support. Take care of our stickers. PS : We love your pictures, especially the one with a raven on it. Congrats!” A dozen of them jumped at this and gave us their mailing addresses via private message. They were expecting to receive a sticker by mail, but Khadija, however, did much better. She sent each of them two stickers along with a handwritten note commenting on their Instagram photos. These followers loved it so much that many of them shared photos of the handwritten notes on Instagram and Facebook. 22. Recycle Your Content on LinkedIn and Medium Content is king on the web. It’s true, except many people don’t know what this sentence means. It’s quality over quantity when trying to build a brand, and it’s not as easy as it seems to continually produce high quality content. However, there’s no reason why you shouldn’t give your content a second, and third life, especially if it’s high quality. I used this strategy over and over again, using Medium and Linkedin to recycle my blog posts. On LinkedIn, the number of views fluctuated between 200 and 400 per article, while on Medium, it was much more variable. My most popular article on Medium generated 9400 views, while the least popular barely had 275. 23. Use Your Slogan and Job Position Strategically on LinkedIn On your LinkedIn profile, there’s a small, extremely strategic place that you’ve probably neglected until now. It’s the text area immediately under your name, just above your profile, where most people describe who they are professionally. This spot is strategic as it is read by all of those who see your LinkedIn posts or who see you in the list of people who have viewed their profile. Use this place to ask for what you want. I used this techniques in the past to do targeted business development, changing my Linkedin slogan and then visiting many targeted profiles so I would show up in their “Who’s viewed your profile” feed. Obviously, since launching my crowdfunding campaign, I’m using this spot to ask for contributions. Another thing I did after launching the campaign is listing on my profile a new job position: “Chief Crowdfunding Officer” for “Not Another Boring Course About Invesment”. Doing so automatically created a very potent update that reached most of my network on LinkedIn, since the social network increase the reach of important career moves. I also added Hardbacon’s crowdfunding video on YouTube to this “new job”. 24. Write on Other People’s Websites Other people’s websites can help you gain notoriety much more quickly, especially when you’re starting out. In my case, it’s obvious that writing in Les Affaires about my entrepreneurial journey has paid off. In fact, since this summer, almost 15% of Hardbacon’s unique visitors come from there. Not everybody can write in Les Affaires, but there are many companies (and media) that are constantly seeking new content and want to publish your articles. In my case, I had to decline most of these requests as I lacked time, but there’s clearly a benefit to working with as many media groups and blogs as possible. First of all, if you’re able to sneak links to your site onto many other sites, you can improve your Google ranking. Secondly, every blog and media format has an audience, so once you have published a number of texts on these platforms, there’s a good chance that the people reading your content are the same from one time to the next. 25. Launch a Chatbot This is something that I didn’t have time to do yet, but I would be surprised if Hardbacon didn’t launch a chatbot in 2017. In fact, you don’t need to know how to program or know what a Turing test is to build a chatbot. Services like Chatfuel can be used to build chatbots by writing answers associated with specific keywords, or by integrating other online tools. I would like to create a chatbot that answers people’s basic questions about investment. That said, it would be a lot of work to get a satisfactory result. On the other hand, due to lack of time, I would be happy if I could create a chatbot that asked users their level of investing knowledge (beginner, intermediate or advanced), and that enabled them to take an investment course without leaving Facebook Messenger, at the rate of one message per day. (It’s just an idea! If you preordered Not Another Boring Course About Investment on Ulule, don’t bank on this feature… yet.) I could also allow our chatbot users to subscribe to our content and, without requiring any work from me, the chatbot would send links to our new articles directly to those who have subscribed on Facebook Messenger. What makes this so attractive? A phenomenal email list like Hardbacon’s enjoys an open rate of nearly 60%, which is very high. The open rate on Facebook Messenger is even higher. If you liked this post, please click on the heart below and share this to all your friends! ", "title": "25 Free Marketing Tricks I Used To Generate a Quarter-Million Page Views For My Startup", "sentences": [{"a3c9": "25 Free Marketing Tricks I Used To Generate a Quarter-Million Page Views For My Startup"}, {"e546": "When starting up a business, it’s easy to blame a lack of funds to explain why things aren’t getting off the ground. If you go around saying, “If only I had the means to invest in Facebook Ads, to organize a contest, or to buy such and such a software, customers would be coming in droves.” If that’s what you think, you’re a loser, and you’re hiding behind some lame excuses."}, {"fb8b": "I know what I’m talking about. Since launching Hardbacon last June, almost all of our marketing has been done without a budget. Since then, we generated 254,764 page views, convinced 5 435 people to subscribe to our newsletter and raised $67,880 through a crowdfunding campaign."}, {"10c8": "I know that you want to learn exactly how I did it. The short answer is that I created content and tools that created value (or that will create value). It’s the basis of any good marketing, but I don’t want to bore you with that here."}, {"d3af": "I assume what you would really like to know about are the specific techniques I used to get Hardbacon’s website and crowdfunding campaign in front of so many people’s eyes. These techniques don’t matter in the long run, but they can speed up your growth. So here are 25 subversive tips I used to promote Hardbacon since founding it seven months ago."}, {"6a26": "1. Display Your Ads on Other People’s Website"}, {"eba4": "Unless you are a media company, you will end up sharing a lot of links pointing to other website on social media. It’s great way to keep your audience engaged. However, it was impossible to benefit from this traffic… until online services like Back.ly were introduced."}, {"14a0": "I started using Back.ly after launching Hardbacon’s crowdfunding campaign, but I certainly won’t stop after the campaign is over. Here’s how it works. When I want to share an article, I copy-paste it into Back.ly’s dashboard, and create a custom message that usually suggests to people that they should learn how to invest in the stock market with the course we are currently crowdfunding. Then, all I need to do is share the newly generated Back.ly link and a Facebook Messenger styled ad magically appears on the article when shared using this link."}, {"87eb": "I always try to write something that relates to the content of the article. In the example above, the ad reads “Learn how not to invest like an idiot with Not Another Boring Course About Investment”, referring to the definition of “day trader” in the article. I started doing this with a competing website called Sniply, but I moved over at Back.ly because I can go over its 1000 clicks monthly limit by inviting friends to use the service."}, {"d311": "2. Post Highly Shareable Content On Social Media"}, {"b9f7": "A good way to grow your following on Facebook and Twitter is to share content that provides value to your audience… while compelling it to share. To do that, I frequently screen Facebook pages in the personal finance and investing niche, looking for quality content that has generated a lot of shares."}, {"8315": "Another way to find those highly shareable pieces of content is to use BuzzSumo, which is a search engine for viral content. It’s not free, but you they have a free 14 day trial you can abuse by creating a new account with a different email address every time it expires. You can also use WordLink, a free alternative built by my friend Nadav Perez."}, {"9328": "Since you know those articles have already been shared a lot, it’s likely that they will be shared by your audience, who will expose their friends to your brand when doing so."}, {"d85f": "3. Use Snapchat Creatively"}, {"4056": "Snapchat can be used for more than just posting nonsense and naughty photos. For companies that know how to use it properly, Snapchat can payoff big-time, as it has an incredible rate of engagement. The only problem is that it’s difficult to build an audience, so you have to be creative. In my case, I printed my personal Snapcode on the back of my business cards, so that people I meet can add me by taking a picture of my card. We also experimented by defining financial terms through Snapchat stories on Hardbacon’s Snapchat account. We then reposted these videos on our YouTube account. After launching our crowdfunding campaign, we went further and sent direct messages to everyone who added Hardbacon on Snapchat with a picture asking them to support our campaign."}, {"f215": "4. Use Job Boards as Marketing Channels"}, {"113c": "Job Listings are something most startups need to promote, yet it seems like it’s a marketing effort unrelated to the main marketing KPIs. But it shouldn’t be that way. First, it’s huge waste of marketing efforts, and second, job listings should be selling the mission and the product of the company instead of being a filled with corporate bullshit and a long list of skills. So, since I desperately needed a marketing intern to help me during our crowdfunding campaign, I wrote a job offer for a “crowdfunding intern” that deliberately talked about our crowdfunding campaign, link included. I’ve not yet filled the position, but I had about 20 applications so far and this allowed me to tap into the audience of many free (or almost free) jobs websites."}, {"192d": "5. Use your Profile Picture as a Billboard"}, {"184e": "Since launching my crowdfunding campaign on Ulule, my personal profile picture on all my social media channels changes quite often. It’s really strategic, because it’s displayed every time I post something or comment. Here is my current profile picture across all channels:"}, {"91be": "And here’s Hardbacon current profile picture:"}, {"9747": "I went even further in exploiting this prime piece of real estate. I offered a deal on social media: I would change my profile pictures for other people’s logos (for 24 hours) in return for a contribution to our campaign. It worked a few times, proving I’m not the only one who consider the profile picture a valuable place to advertise."}, {"6c61": "6. Get the Media to Talk About You"}, {"a150": "Getting media coverage is a good way to make your business known. However, unless your startup is worth gazillions, journalists couldn’t care less about your story. So you’ll have to stand out from all the other start-ups trying to get covered."}, {"5efc": "As a former business journalist, I have a few contacts and I have been asked to comment on tech news quite often, but any one can do that by subscribing to the HARO mailing list and replying to the various requests of journalists."}, {"c62b": "Leaving comments on Medium and on news websites is another good way to get the attention of the media. A comment I left on Medium was actually quoted on CNBC."}, {"663d": "A furious anti-Silicon Valley rant goes viralOptimizing nonstop is exhausting, but that's startup life. The goal is to become more productive, more successful, more…www.cnbc.com"}, {"335f": "While targeting journalists that cover startups or products similar to yours is a good strategy, it won’t necessarily be enough. Those guys receive hundreds of emails a day and, sorry to tell you this, but your story is not that exciting. So use other channels. For example, I recorded a YouTube video addressed to a Reuters journalist covering fintech, and tweeted her the link."}, {"b9ec": "I did not land an article from Reuters, but I got her attention. She emailed me afterwards, proposing an informal phone interview."}, {"f1ed": "7. Recycle Your Snapchat Stories on Facebook and Instagram"}, {"dd2b": "Snapchat is a cool place to be, but doing video content that self-destructs within 24 hours is kind of wasteful. One thing I do to squeeze more views out of my Snapchat stories is to save them on my phone, and repost them on Instagram and Facebook. I’m not doing it on Hardbacon’s Facebook Page, as the quality of my stories is kind of low, but it’s good enough for my personal channels. And since I natively add captions to my Snapchat stories, it can be understood by those numerous Facebook and Instagram users who don’t want to turn the sound on without further editing."}, {"09cd": "8. Do Live Interviews on YouTube"}, {"2b37": "My first YouTube interview was with personal finance blogger Barry Choi."}, {"61a3": "Doing video interviews is not that easy, because you have to plan a meeting in person, film the interview, do the editing, and upload the final result to YouTube Facebook or elsewhere. Having said that, you should know that you can do interviews directly on YouTube, by creating a live event to which you can invite another person. In doing so, those who have used the Google Hangout teleconference service will find themselves on familiar ground, as YouTube’s feature uses it. All you have to do is ask your guest some questions, and YouTube will handle alternating between your camera and the interviewee’s. When the interview is over, it immediately appears on your YouTube channel. After completing an interview, I use Fiverr ($5!) to get a transcription, and embed the YouTube video in a blog post, along with the written transcription. I did not have time to do this yet, but I plan on recycling those videos by publishing them natively on Facebook."}, {"8f9a": "9. Associate With Influencers"}, {"8487": "Many entrepreneurs tell me that they are jealous of the network I built for myself while I was a business journalist. I will not deny that this has helped make Hardbacon better known. That said, in terms of influencers, it’s not difficult to find someone who has a broader reach than I, and to use their influence to promote your business. That is exactly what I did in order to spread the word about Hardbacon’s crowdfunding campaign. I contacted people who are influencers and asked them to be ambassadors for our Ulule campaign, whose goal is to fund our investing course. Although some influencers monetize their visibility by requesting payment, the vast majority of people we contacted agreed to give us a hand for the worthy cause of financial literacy. The only thing we asked them to do is to share our campaign page and to provide us with a quote related to financial literacy. We then published those quotes on all our social media channels tagging their authors, who were nice enough to share those quotes."}, {"daeb": "10. Leverage Your Email Signature"}, {"658d": "I send tons of emails everyday, so I would be crazy not to use this channel to promote my business objectives. At Hardbacon, we measure our marketing success by the number of newsletter subscribers. So, I very naturally include this line in my email signature: “Subscribe to Hardbacon’s Newsletter: http://hardba.co/subscribe”, using the URL shortener Lickstats for tracking purposes. It goes without saying I used the same technique to promote Hardbacon’s crowdfunding campaign in my email signature."}, {"aac1": "11. Automate Twitter As Much as Possible"}, {"8c93": "Twitter is almost dead and I wouldn’t advise anyone to put too much effort into this social network. Despite that, there are still people using this shrinking social network which is, however, easier to automate than others. For this reason, Twitter can still be used to do online marketing provided you understand its limitations. Keep in mind that the value of a new Twitter follower is extremely close to nothing as the probability that this new follower will see your tweets in the future is very low. That’s why you need to use automation."}, {"e82d": "To do this, I used three techniques. 1. I followed the followers of business that have commonality with Hardbacon and unfollow those who don’t follow back. To speed up the process, I use Crowdfire. 2. I then use Zapier to ask my new followers to sign up for Hardbacon’s newsletter. 3. When I have something to communicate with my audience, I use Holr, which allows me to automatically send up to 90 private messages per day."}, {"3b95": "12. Automate Instagram (Sparingly)"}, {"c7f6": "Automating actions on Instagram is a dangerous game, since this social network is very good at detecting accounts in violation of its Conditions of Use. If you are caught, you could lose your Instagram account. If your Instagram account has less than 200 followers and you’ve posted less than 50 photos, you probably shouldn’t use Instagress. If you have exceeded this limit and, like me, and you aren’t afraid to take risks, Instagress is for you. We use the online service to automatically follow the followers of Canadian companies who are marketing to the same target audience as Hardbacon and automatically like pictures containing certain tags. Instagress can be used for many things, but it’s what works best for us, as other strategies, like adding automatic comments, are too risky for my tastes."}, {"2e44": "13. Answer Questions on Quora"}, {"bdf8": "If you’ve decided to go into business, it’s because you believe you understand something that others do not. In my opinion, the Quora questions/answers site is the ideal platform to showcase your expertise, by responding to questions that people have asked instead of answering questions that nobody has asked on your blog. Since Hardbacon targets only the Canadian market for the time being, I try to find questions Canadians have asked about investment, as much as possible."}, {"0859": "I do this by searching keywords like “TFSA” or “RBC”, which are unlikely to be used by internet users outside of Canada. When I answer questions, I don’t plug Hardbacon unless I can really help the person who asked the question by adding a link to Hardbacon. I just answer the questions honestly, and make my sales pitch in the mini bio underneath my name. Last month alone, my answers were viewed 1300 times on Quora, and I haven’t even answered any questions this month due to lack of time."}, {"505b": "14. Add a Lot of People on Facebook"}, {"cb99": "Previously, when I returned from a conference or a meeting with business cards in my pockets, I was eager to add these new contacts on LinkedIn. Now, I continue to add people on LinkedIn, but I also add all my new contacts on Facebook. It’s quite logical, since Facebook is by far the social network that directs most of my visitors to Hardbacon. In addition, every week I prompt all the new friends I’ve added to my personal account to like Hardbacon’s Facebook page using a Chrome plugin called Invite All."}, {"534f": "15. Give Lectures"}, {"338d": "In traditional marketing, you pay for visibility. When you are penniless like me, you try to be paid to get visibility. As an entrepreneur, you have a lot to say, and you would benefit from sharing your expertise by giving lectures, even if it means giving the first ones without being paid. Personally, I do both. When the organizers of Fintech Startup Weekend approached me to give an unpaid lecture about my industry, I agreed because I believe in the cause, and I knew that they were volunteers. Another benefit from giving lectures is that you can reuse your slides by presenting it on SlideShare, where you can gain an entirely new audience. For example, my presentation about financial technologies in Canada received 484 views. The content is mine, but it was designed by Wiktoria Swiecicka, Hardbacon’s artistic director."}, {"e740": "16. Do A/B Tests"}, {"ca5a": "A/B tests don’t really pay off in the short-term, buy they do help increase the conversion rate, which can have a major impact on a company’s medium and long-term growth. The easiest way to do these tests is to resort to using online landing page creators. Since I didn’t have much money, I decided to abuse Unbounce’s 30-day free trial to do my tests, and then I cancelled the service before they debited my credit card."}, {"8e99": "17. Post an AMA on Reddit"}, {"1d45": "For those who don’t know, AMA is the acronym for “Ask Me Anything”. On Reddit, it means that you start a thread in which Reddit users can ask you any question. Technically, you can find a forum of your choice on Reddit and post an AMA without asking anyone’s permission. That said, the goal of such an exercise is to maximize your visibility, but by doing so, it could have the opposite effect. If you post an AMA and nobody asks you a question, your image will suffer. Furthermore, when I posted an AMA on Reddit, I made sure to do it by working with the moderators of the PersonalFinanceCanada forum, which publishes the AMA schedule on a thread highlighted on the forum. I also made sure to request that my audience come ask me questions, to try to get as many positive exchanges as possible. It didn’t stop many Reddit users from attacking me, but that’s inevitable on the web."}, {"4003": "18. Live-stream as often as you can"}, {"0211": "When you start a Facebook Live video, it notifies all your friends and followers who are logged into Facebook. For this reason alone, it’s a good strategy to use to defeat Facebook’s algorithm, which shares your normal statuses to only a fraction of your friend’s list. And if that isn’t enough, once your Facebook Live video is finished, it will have a second life on Facebook. Since launching our crowdfunding campaign, I did countless session of Facebook Live, whether to answer questions about a particular topic or even to do interviews with other people I would meet anyway."}, {"9236": "Facebook Live is the best platform to live stream for me, but it does not mean that I ignore other live streaming platforms such as Periscope (which allow you to tap into your Twitter audience), Instagram Live and YouTube Live. I use them, but much less. If you’re not as cheap as I am, you can even stream to many of those channels at the same time using a software called Wirecast."}, {"dc29": "19. Provide Visibility Without Asking For Anything in Return"}, {"750c": "Providing visibility without asking for anything in return is one the most lucrative tactics that we have used at Hardbacon. It’s the reason why we did it frequently. We published a list of the best money bloggers in Canada on our website. Needless to say, many of those bloggers, like Jessica Moorhouse, shared our article."}, {"ae6d": "We also tagged them on the social media, which caused our posts to be shared many times. We did this again through different initiatives. All you need to do is to provide visibility to businesses or people with whom you have things in common, by interviewing them, tagging them or by sharing an article that talks about them, and there’s a good chance they’ll reciprocate. And if they don’t, it’s no big deal. Those things end up having a positive impact, so don’t be too impatient."}, {"3447": "20. Set Up a Referral System"}, {"5ffb": "It’s all well and good to ask your audience to share your things. But it’s even better to promise a reward to those who share more than others! You don’t have to reinvent the wheel to do so. At Hardbacon, we used Kickofflabs to build our Ulule campaign pre-launch referencing system. In fact, it was Ceilidh Barlow Cash, Harbdacon’s Content Director, who did all of that. Basically, once a user left their email address on this page, we asked them to share it with their friends. If three of their friends then also subscribed, the user could attend our Ulule campaign launch party. It was as simple as that. For those who don’t want to pay $39 per month for the service (especially if your campaign is longer than KickoffLabs’ 30 day money back guarantee), there’s also MaitreApp, a plugin sold at a one-time price of $99, that can be added to any website."}, {"d1d7": "21. Send Handwritten Notes to Your Audience"}, {"b48c": "In an era when we are inundated with emails, texts and Facebook messages, sending a handwritten note by mail attracts attention. That’s what Khadija Jouini, Hardbacon’s Director of Marketing at the time, did by offering to mail a Hardbacon sticker to our Instagram followers."}, {"8310": "Here’s what we wrote on to this Hardbacon fan. “Dear Marc-André, Thank you for your precious support. Take care of our stickers. PS : We love your pictures, especially the one with a raven on it. Congrats!”"}, {"7670": "A dozen of them jumped at this and gave us their mailing addresses via private message. They were expecting to receive a sticker by mail, but Khadija, however, did much better. She sent each of them two stickers along with a handwritten note commenting on their Instagram photos. These followers loved it so much that many of them shared photos of the handwritten notes on Instagram and Facebook."}, {"b8a6": "22. Recycle Your Content on LinkedIn and Medium"}, {"f76b": "Content is king on the web. It’s true, except many people don’t know what this sentence means. It’s quality over quantity when trying to build a brand, and it’s not as easy as it seems to continually produce high quality content. However, there’s no reason why you shouldn’t give your content a second, and third life, especially if it’s high quality. I used this strategy over and over again, using Medium and Linkedin to recycle my blog posts. On LinkedIn, the number of views fluctuated between 200 and 400 per article, while on Medium, it was much more variable. My most popular article on Medium generated 9400 views, while the least popular barely had 275."}, {"0277": "23. Use Your Slogan and Job Position Strategically on LinkedIn"}, {"ad7f": "On your LinkedIn profile, there’s a small, extremely strategic place that you’ve probably neglected until now. It’s the text area immediately under your name, just above your profile, where most people describe who they are professionally."}, {"8190": "This spot is strategic as it is read by all of those who see your LinkedIn posts or who see you in the list of people who have viewed their profile. Use this place to ask for what you want. I used this techniques in the past to do targeted business development, changing my Linkedin slogan and then visiting many targeted profiles so I would show up in their “Who’s viewed your profile” feed. Obviously, since launching my crowdfunding campaign, I’m using this spot to ask for contributions."}, {"78b1": "Another thing I did after launching the campaign is listing on my profile a new job position: “Chief Crowdfunding Officer” for “Not Another Boring Course About Invesment”. Doing so automatically created a very potent update that reached most of my network on LinkedIn, since the social network increase the reach of important career moves. I also added Hardbacon’s crowdfunding video on YouTube to this “new job”."}, {"dc66": "24. Write on Other People’s Websites"}, {"d056": "Other people’s websites can help you gain notoriety much more quickly, especially when you’re starting out. In my case, it’s obvious that writing in Les Affaires about my entrepreneurial journey has paid off. In fact, since this summer, almost 15% of Hardbacon’s unique visitors come from there. Not everybody can write in Les Affaires, but there are many companies (and media) that are constantly seeking new content and want to publish your articles. In my case, I had to decline most of these requests as I lacked time, but there’s clearly a benefit to working with as many media groups and blogs as possible. First of all, if you’re able to sneak links to your site onto many other sites, you can improve your Google ranking. Secondly, every blog and media format has an audience, so once you have published a number of texts on these platforms, there’s a good chance that the people reading your content are the same from one time to the next."}, {"e75c": "25. Launch a Chatbot"}, {"668d": "This is something that I didn’t have time to do yet, but I would be surprised if Hardbacon didn’t launch a chatbot in 2017. In fact, you don’t need to know how to program or know what a Turing test is to build a chatbot. Services like Chatfuel can be used to build chatbots by writing answers associated with specific keywords, or by integrating other online tools."}, {"55c5": "I would like to create a chatbot that answers people’s basic questions about investment. That said, it would be a lot of work to get a satisfactory result. On the other hand, due to lack of time, I would be happy if I could create a chatbot that asked users their level of investing knowledge (beginner, intermediate or advanced), and that enabled them to take an investment course without leaving Facebook Messenger, at the rate of one message per day. (It’s just an idea! If you preordered Not Another Boring Course About Investment on Ulule, don’t bank on this feature… yet.) I could also allow our chatbot users to subscribe to our content and, without requiring any work from me, the chatbot would send links to our new articles directly to those who have subscribed on Facebook Messenger. What makes this so attractive? A phenomenal email list like Hardbacon’s enjoys an open rate of nearly 60%, which is very high. The open rate on Facebook Messenger is even higher."}, {"f2bf": "If you liked this post, please click on the heart below and share this to all your friends!"}], "child": "646_1\t646_2\t646_3\t646_4\t646_5\t646_6\t646_7\t646_8\t646_9\t646_10\t646_11\t646_12\t646_13\t646_14\t646_15\t646_16\t646_17"}