{"name": "649", "parent": "", "content": "7 Reasons Why Almost Being Murdered Is The Best Thing That Happened To Me During my teenage years, I dealt with an experience that completely shaped my life for the future. I want to share this experience with you because I think it will help you to be successful and really understand where you are at in your life. One night, I was walking home with a friend late in the evening. Being teenagers meant that we didn’t always have the money to go home in taxis when public transport stopped, so we made the decision to walk home. On our walk home, we stopped at a convenience store to get our junk food fix. I can’t quite remember what my friend got, but I got a packet of chips and a rainbow paddle pop. The reason I remember this so clearly was because it could have been my last meal. We continued our journey home, and I was about halfway through eating my rainbow paddle pop when I saw something on the other side of the traffic lights coming towards us. I wasn’t quite sure what it was until they got closer. To my immense shock I realized it was a group of about 10 teenagers or more running towards my friend and I. A bolt of terror went up the back of my spine when they started running across the road towards us. During the next few minutes, we were both attacked. I was hit with a baseball bat and a number of other items while my friend wasn’t so lucky, he was stabbed with a knife and was bleeding everywhere. Halfway through the attack I remember seeing my life flash before my eyes and wondering if this was the end. After being hit so many times the feeling is actually quite blissful, and you’re not in any pain. I think it was the adrenaline that kept me going. Then all of a sudden a hand reached out in front of me and picked me up off the ground. The stranger yelled at his friends and said “I know this guy, get off him!” At this stage, I could hear my friend in the distance, but could not see him visually. Before I knew it the stranger said to me “run that way and don’t look back otherwise you will end up like your friend.” I had a quick decision to make in my mind: take on a massive group of teenagers who were armed, or run and get help. Without thinking the answer just came to me, and I ran as fast as I could. Like a magic carpet ride, I arrived at a place where I was able to get help and get my friend attended to by two security guards. We both started to calm down and then before we knew it, the attackers returned, and we had to flee again along with the security guards. The Aftermath Again, like magic, I ran faster than I had ever gone before and managed to hide and not be seen.Eventually, I called my friend, and we met up again. He was covered in blood and had knife wounds everywhere, but miraculously he was still alive, only just. “I was badly injured as well, but oddly enough, I still had the Paddle Pop stick and chip packet in my hands. I must have clung on to them for dear life without even knowing -it’s so odd the things that you do in times of terror” I suppose I will never look at rainbow Paddle Pops the same again, although each time I do I will remember this situation and the positive things it did for me. Throughout the next few days, I wondered why I was saved and what almost happened to us. For a long time, I never knew what the universe was trying to tell me until years later. The part of the story that still blows people’s minds to this day is something I will share with you at the end of the seven lessons. Below are the 7 reasons why this experience was one of the best things to happen to me. 1. There might be a signal you are missing After this experience had occurred, I realized that the universe was trying to tell me that I was on the wrong path and needed to change things. While I still don’t know why we were attacked, I know that it was definitely a signal for me to re-evaluate things because clearly the previous signals were not getting through to me. 2. Seeing the worst thing possible can be refreshing You might think I am crazy for saying this but I am at peace with myself because I have now seen the worst possible experience that I will ever see in my life. I now know what it takes mentally, to overcome trauma and be able to take the lessons from it. The experience gave me certain strategies that I can now use and mechanisms that allow me to deal with bad situations. Most people might live 50 years before they ever have this life or death experience. By this time, half of their life is gone and they can’t get the sustained rewards that I got to change their life, and get all the benefits that an experience like this can do for you. 3. Don’t judge anyone until you get to know them While it would be easy to judge the characters involved in this story, you never really understand them until you spend time in their shoes. Maybe they had some bad things happen in their life, or maybe they had been beaten and felt that this was the solution to their problems. 4. Appreciate what you have I got so many lessons from this experience but one of the most powerful was to appreciate what I have and be grateful. When your life flashes before your eyes, only the experiences you helped create will actually be remembered, and everything else will be forgotten. It also makes you think about your legacy and what you want to be remembered for. Do you want to be someone that played life at the highest level and was remembered for decades, or do you want to be remembered for playing life in the minor league and worrying about things that really don’t matter? I know which one I want, and I won’t ever stop. 5. Everybody makes a mistake Remember that everybody in life makes a mistake and nobody is perfect. Some of the most amazing entrepreneurs I have ever met have had childhoods of crime and drugs, yet they learned the lessons and have gone on to make millions doing what they love. I met an amazing individual the other day that was an alcoholic and actually met his amazing wife in rehab. Together they host events to inspire entrepreneurs and give something to people that they can’t get anywhere else. Remembering some of the stories at these events gives me chills down my spine just thinking about it. Is that the level you want to play at? To be able to put chills down people’s spines? 6. Always give people a second chance Giving people, a second chance is a powerful habit that you should take up. We all know that giving is a very beneficial trait and is what the ultra-successful do. The thing is it’s not just the giving of time or money, it’s the giving of second chances that will really separate you from the rest. Everybody makes a mistake, and everybody can be confused at one point in their life. It’s your understanding of this and the ability to give them another go that makes you an amazing person, and will bring you all the things that you want. Just like the attackers made a mistake, there were plenty that I made myself. “Seeing their flaws helped me see my own, which helped me learn the lesson” Nobody goes out at night intending to do these types of things; it’s the references they have and what is going on in their life that create these actions. Just remember that any action can be temporary and that life is made of seasons. They might have been in winter at this stage in their life, and now they are in summer. 7. We are all connected in some way When the stranger reached out there hand and helped me off the ground, even though they didn’t know me very well, they still must have felt the pain and connection with me, for them to be able to help. No matter what happens to you, if you are genuinely being yourself and living your life in a good way, then your luck will change one way or another. So the part of the story that I left out was that thanks to a mutual friend I ended up becoming best friends with two of my attackers. One of them went on to become someone that I really respected and who now spends his time travelling the world and educating people on religion. What initially looked like pure evil to a teenager was completely transformed into something that people wouldn’t recognise. While not everyone on the journey lived to tell their story, I believe that I survived so that I could share these experiences with you and hopefully inspire you to do something great. Even if I die tomorrow, I am grateful for that and thanks for reading this article. Originally posted on Addicted2Success.com Call To Action If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online. Click here to subscribe right now! ", "title": "7 Reasons Why Almost Being Murdered Is The Best Thing That Happened To Me", "sentences": [{"9e6c": "7 Reasons Why Almost Being Murdered Is The Best Thing That Happened To Me"}, {"c9c3": "During my teenage years, I dealt with an experience that completely shaped my life for the future. I want to share this experience with you because I think it will help you to be successful and really understand where you are at in your life."}, {"1294": "One night, I was walking home with a friend late in the evening. Being teenagers meant that we didn’t always have the money to go home in taxis when public transport stopped, so we made the decision to walk home."}, {"c46c": "On our walk home, we stopped at a convenience store to get our junk food fix. I can’t quite remember what my friend got, but I got a packet of chips and a rainbow paddle pop. The reason I remember this so clearly was because it could have been my last meal."}, {"ac09": "We continued our journey home, and I was about halfway through eating my rainbow paddle pop when I saw something on the other side of the traffic lights coming towards us. I wasn’t quite sure what it was until they got closer."}, {"aa77": "To my immense shock I realized it was a group of about 10 teenagers or more running towards my friend and I. A bolt of terror went up the back of my spine when they started running across the road towards us."}, {"e330": "During the next few minutes, we were both attacked. I was hit with a baseball bat and a number of other items while my friend wasn’t so lucky, he was stabbed with a knife and was bleeding everywhere."}, {"0dd2": "Halfway through the attack I remember seeing my life flash before my eyes and wondering if this was the end. After being hit so many times the feeling is actually quite blissful, and you’re not in any pain."}, {"8656": "I think it was the adrenaline that kept me going. Then all of a sudden a hand reached out in front of me and picked me up off the ground. The stranger yelled at his friends and said “I know this guy, get off him!”"}, {"c301": "At this stage, I could hear my friend in the distance, but could not see him visually. Before I knew it the stranger said to me “run that way and don’t look back otherwise you will end up like your friend.”"}, {"8d1a": "I had a quick decision to make in my mind: take on a massive group of teenagers who were armed, or run and get help. Without thinking the answer just came to me, and I ran as fast as I could."}, {"9e96": "Like a magic carpet ride, I arrived at a place where I was able to get help and get my friend attended to by two security guards. We both started to calm down and then before we knew it, the attackers returned, and we had to flee again along with the security guards."}, {"24f4": "The Aftermath"}, {"45fb": "Again, like magic, I ran faster than I had ever gone before and managed to hide and not be seen.Eventually, I called my friend, and we met up again. He was covered in blood and had knife wounds everywhere, but miraculously he was still alive, only just."}, {"3ac9": "“I was badly injured as well, but oddly enough, I still had the Paddle Pop stick and chip packet in my hands. I must have clung on to them for dear life without even knowing -it’s so odd the things that you do in times of terror”"}, {"0a4b": "I suppose I will never look at rainbow Paddle Pops the same again, although each time I do I will remember this situation and the positive things it did for me. Throughout the next few days, I wondered why I was saved and what almost happened to us."}, {"a1a7": "For a long time, I never knew what the universe was trying to tell me until years later. The part of the story that still blows people’s minds to this day is something I will share with you at the end of the seven lessons."}, {"27b6": "Below are the 7 reasons why this experience was one of the best things to happen to me."}, {"dd27": "1. There might be a signal you are missing"}, {"f1ed": "After this experience had occurred, I realized that the universe was trying to tell me that I was on the wrong path and needed to change things. While I still don’t know why we were attacked, I know that it was definitely a signal for me to re-evaluate things because clearly the previous signals were not getting through to me."}, {"197e": "2. Seeing the worst thing possible can be refreshing"}, {"b618": "You might think I am crazy for saying this but I am at peace with myself because I have now seen the worst possible experience that I will ever see in my life. I now know what it takes mentally, to overcome trauma and be able to take the lessons from it."}, {"e5cc": "The experience gave me certain strategies that I can now use and mechanisms that allow me to deal with bad situations. Most people might live 50 years before they ever have this life or death experience. By this time, half of their life is gone and they can’t get the sustained rewards that I got to change their life, and get all the benefits that an experience like this can do for you."}, {"8eaa": "3. Don’t judge anyone until you get to know them"}, {"ac0c": "While it would be easy to judge the characters involved in this story, you never really understand them until you spend time in their shoes. Maybe they had some bad things happen in their life, or maybe they had been beaten and felt that this was the solution to their problems."}, {"f18a": "4. Appreciate what you have"}, {"c8c1": "I got so many lessons from this experience but one of the most powerful was to appreciate what I have and be grateful. When your life flashes before your eyes, only the experiences you helped create will actually be remembered, and everything else will be forgotten."}, {"de6e": "It also makes you think about your legacy and what you want to be remembered for. Do you want to be someone that played life at the highest level and was remembered for decades, or do you want to be remembered for playing life in the minor league and worrying about things that really don’t matter? I know which one I want, and I won’t ever stop."}, {"de05": "5. Everybody makes a mistake"}, {"18bc": "Remember that everybody in life makes a mistake and nobody is perfect. Some of the most amazing entrepreneurs I have ever met have had childhoods of crime and drugs, yet they learned the lessons and have gone on to make millions doing what they love."}, {"4f98": "I met an amazing individual the other day that was an alcoholic and actually met his amazing wife in rehab. Together they host events to inspire entrepreneurs and give something to people that they can’t get anywhere else."}, {"d4cf": "Remembering some of the stories at these events gives me chills down my spine just thinking about it. Is that the level you want to play at? To be able to put chills down people’s spines?"}, {"7c82": "6. Always give people a second chance"}, {"b8ce": "Giving people, a second chance is a powerful habit that you should take up. We all know that giving is a very beneficial trait and is what the ultra-successful do. The thing is it’s not just the giving of time or money, it’s the giving of second chances that will really separate you from the rest."}, {"c5af": "Everybody makes a mistake, and everybody can be confused at one point in their life."}, {"77c2": "It’s your understanding of this and the ability to give them another go that makes you an amazing person, and will bring you all the things that you want. Just like the attackers made a mistake, there were plenty that I made myself."}, {"f541": "“Seeing their flaws helped me see my own, which helped me learn the lesson”"}, {"cd19": "Nobody goes out at night intending to do these types of things; it’s the references they have and what is going on in their life that create these actions."}, {"b616": "Just remember that any action can be temporary and that life is made of seasons. They might have been in winter at this stage in their life, and now they are in summer."}, {"abc3": "7. We are all connected in some way"}, {"f429": "When the stranger reached out there hand and helped me off the ground, even though they didn’t know me very well, they still must have felt the pain and connection with me, for them to be able to help."}, {"e874": "No matter what happens to you, if you are genuinely being yourself and living your life in a good way, then your luck will change one way or another."}, {"3066": "So the part of the story that I left out was that thanks to a mutual friend I ended up becoming best friends with two of my attackers. One of them went on to become someone that I really respected and who now spends his time travelling the world and educating people on religion."}, {"016a": "What initially looked like pure evil to a teenager was completely transformed into something that people wouldn’t recognise. While not everyone on the journey lived to tell their story, I believe that I survived so that I could share these experiences with you and hopefully inspire you to do something great."}, {"9b67": "Even if I die tomorrow, I am grateful for that and thanks for reading this article."}, {"006c": "Originally posted on Addicted2Success.com"}, {"ce94": "Call To Action"}, {"104d": "If you want to increase your productivity and learn some valuable life hacks, then subscribe to my private mailing list. You’ll also get my free Ebook that will help you become a game-changing influencer online."}, {"60a1": "Click here to subscribe right now!"}], "child": "649_1\t649_2"}