{"name": "650", "parent": "", "content": "50 Ways Happier, Healthier, And More Successful People Live On Their Own Terms 1. Stop consuming caffeine Although people think they perform better on caffeine, the truth is, they really don’t. Actually, we’ve become so dependent on caffeine that we use it to simply get back to our status-quo. When we’re off it, we under perform and become incapable. Isn’t this absurd? In his book, The Untethered Soul, Michael Singer argues that your energy should come from within — from your why — not from external stimulants. The scientific backing is substantial and unsurprising: intrinsic motivation destroys extrinsic motivation every day of the week. Motivation aside — healthy eating, sleeping, and intensive exercise produce higher quantities and quality of energy than caffeine ever could. A holistic approach to life is essential. Garbage in, garbage out. Give up the caffeine and see what happens. To avoid withdrawal headaches — which are mostly placebo — replace your caffeine with something else (another placebo). After a few days without caffeine, you’ll develop confidence in your ability to function without it. 2. Pray or meditate morning, mid-day, and night In a recent interview at the Genius Network mastermind event, Joe Polish asked Tony Robbins what he does to get focused. “Do you meditate? What do you do?” Joe asked. “I don’t know that I meditate. I don’t know that I want to meditate and think about nothing,” Tony responded, “My goal is clarity.” Instead of full-on meditation, Tony has a morning routine that includes several breathing exercises and visualization techniques that get him to a state of clarity and focus. For me, I use prayer and pondering (my version of meditation) as the same vehicle. Whatever your approach, the goal should be clarity and focus. What do you want to be about today? What few things matter most during the next 24 hours? I’ve gotten the best results as: 3. Read 1 book per week Ordinary people seek entertainment. Extraordinary people seek educationand learning. It is common for the world’s most successful people to read at least one book per week. They are constantly learning. I can easily get through one audiobook per week by just listening during my commute to school and while walking on campus. Taking even 15–30 minutes every morning to read uplifting and instructive information changes you. It puts you in the zone to perform at your highest. Over a long enough period of time, you will have read hundreds of books. You’ll be knowledgeable on several topics. You’ll think and see the world differently. You’ll be able to make more connections between different topics. Reference #19 on this list if you feel you’re “too busy” to read one book per week. There are methods to make this task extremely easy. 4. Write in your journal 5 minutes per day This habit will change your life. Your journal will: Five minutes per day is more than enough. Greg McKeown, author of Essentialism, recommends writing far less than you want to — only a few sentences or paragraphs at most. This will help you avoid burnout. 5. Marry the person you love “For all the productivity and success advice I’ve read, shaped and marketed for dozens of authors in the last decade, I’ve never really seen someone come out and say: Find yourself a spouse who complements and supports you and makes you better.” — Ryan Holiday Research done by economists have found — even after controlling for age, education, and other demographics — that married people make 10 to 50 percent more than single people. Why would this be? Being married gives you a higher purpose for being productive. You are no longer a lone ranger, but have another person who relies on you. Marriage also smacks you in the face with what’s really important in life. Sure, hanging out and partying are fun. But too many people get stuck in this phase and miss the meaning that comes from building a life with someone. You will never find a better personal development seminar or book than marriage. It will highlight all of your flaws and weaknesses, challenging you to become a better person than you ever thought possible. Said Thomas Monson, “Choose your love; love your choice.” After you’ve chosen the person you love, love them. You don’t marry to make yourself happy, you marry to make someone else happy. Said Frankl in Man’s Search for Meaning, “For success, like happiness, cannot be pursued; it must ensue, and it only does so as the unintended side effect of one’s personal dedication to a cause greater than oneself or as the by-product of one’s surrender to a person other than oneself.” 6. Make a bucket list and actively knock items off Most people have it backwards — they design their ambitions around their life, rather than designing their life around their ambitions (see this free eBook on how to quickly create your ideal life). What are the things you absolutely must do before you die? Start there. Then design your life around those things. Or as Stephen Covey explained inThe 7 Habits of Highly Effective People, “Begin with the end clearly in mind.” A simple mental exercise that may be helpful is imagining you only have 30 days to live. What would you do in those 30 days? Now imagine you have 5 years to live. What would you do during those 5 years? Get to work. The death-bed mentality is the only way to live. Stop pretending you’ll live forever. As Professor Harold Hill has said — “You pile up enough tomorrows, and you’ll find you are left with nothing but a lot of empty yesterdays.” 7. Stop consuming refined sugar If you stop consuming sugar, your brain will radically change. Actually, study after study is showing that refined sugar is worse for our brains than it is for our waistlines. According to Dr. William Coda Martin, refined sugar is nothing more than poison because it has been depleted of its life forces, vitamins and minerals. Refined sugar has now been shown to make us cranky, make us make rash decisions, and make us stupid. Again, like caffeine, if you stop eating refined sugar, you will experience some negative withdrawals. But, like any good habit, the effects of this will be seen in the long-run. What would your health be like a year from now (or five) if you were completely refined sugar-free? Said Albus Dumbledore, Headmaster of Hogwarts School of Witchcraft and Wizardry, “It is not our abilities that show what we truly are. It is our choices.” 8. Fast from all food and caloric beverages 24 hours once per week One-day (24-hour) food fasts are a popular way to maintain health and vigor. Fasting leverages the self-healing properties of the human body. Radical health improvements occur when the digestive system is given rest and the organs get ample time to repair and heal themselves. A regular practice of fasting can: Like all the other habits, fasting gets easier with practice. I’ve been fasting for years and it’s one of the best things I have done for my health. Fasting is also one of the most recognized techniques in religious and spiritual practices. I also use fasting to get spiritual clarity and refinement. Honestly, I could go on for hours about this one. Give it a try. You’ll never be the same. 9. Fast from the internet 24 hours once per week Your body gets an intervention when you fast. Your mind and relationships could use one too. Unplug yourself from the matrix. If you haven’t caught on already, human beings are highly addictive creatures. We love our coffee, sugar, and internet. And these things are all great. But our lives can be far more enhanced by using these tools in wisdom. The purpose of the internet fast is to reconnect to yourself and your loved ones. So, you probably shouldn’t do it the same day you do your food fast. Because eating is one of the strongest ways to form bonds. You’ll be blown away by how much more connected you feel to your loved ones when you can give them your undivided attention. It may even feel awkward for a while having a real-life conversation without looking at your phone every three minutes. 10. Stop consuming the news or reading the newspaper Although the amount of warfare and deaths by human hands are reducing globally, you will not get that message watching televised news or reading the newspaper. On the contrary, these media outlets have an agenda. Their goal is to appeal to your fears by inflating extreme cases — making them seem normal and commonplace. If they didn’t do so, their viewership would plummet. Which is why Peter Diamandis, one of the world’s experts on entrepreneurship and the future of innovation has said, “I’ve stopped watching TV news. They couldn’t pay me enough money.” You can get high quality news curated from Google news. When you detox from the toxic filth that is public news, you’ll be startled as your worldview becomes radically more optimistic. There is no objective reality. Instead, we live in perceived realities and are thus responsible for the worldview we adopt. 11. Do something everyday that terrifies you “A person’s success in life can usually be measured by the number of uncomfortable conversations he or she is willing to have.” — Tim Ferriss But you don’t have to constantly be battling your fears. Actually, Darren Hardy has said that you can be a coward 99.9305556% of the time (to be exact). You only need to be courageous for 20 seconds at a time. Twenty seconds of fear is all you need. If you courageously confront fear for 20 seconds every single day, before you know it, you’ll be in a different socio-economic and social situation. Make that call. Ask that question. Pitch that idea. Post that video. Whatever it is you feel you want to do–do it. The anticipation of the event is far more painful than the event itself. So just do it and end the inner-conflict. In most cases, your fears are unfounded. As Seth Godin has explained, ourcomfort zone and our safety zone are not the same thing. It is completely safe to make an uncomfortable phone call. You are not going to die. Don’t equate the two. Recognize that most things outside your comfort zone are completely safe. 12. Do something kind for someone else daily “Have I done any good in the world today? Have I helped anyone in need?Have I cheered up the sad and made someone feel glad? If not, I have failed indeed. Has anyone’s burden been lighter today, because I was willing to share? Have the sick and the weary been helped on their way? When they needed my help was I there?” — Will L. Thompson (music and text) If we’re too busy to help other people, we’ve missed the mark. Taking the time to spontaneously — as well as planned — helping other people is one of the greatest joys in life. Helping others opens you up to new sides of yourself. It helps you connect deeper with those you help and humanity in general. It clarifies what really matters in life. As Thomas Monson has said, “Never let a problem to be solved become more important than a person to be loved.” That would truly be a failure. 13. Go to bed early and rise early According to countless research studies, people who go to bed and rise early are better students. Harvard biologist Christoph Randler found that early sleep/risers are more proactive and are more likely to anticipate problems and minimize them efficiently, which leads to being more successful in the business. Other benefits of going to bed and rising early — backed by research — include: Waking up early allows you to proactively and consciously design your day. You can start with a morning routine that sets the tone for your whole day. You show self-respect by putting yourself first. In your morning routine, you can pray/meditate, exercise, listen to or read inspiring content, and write in your journal. This routine will give you a much stronger buzz than a cup of coffee. 14. Get 7+ hours of sleep each night Let’s face it: sleep is just as important as eating and drinking water. Despite this, millions of people do not sleep enough and experience insane problems as a result. The National Sleep Foundation (NSF) conducted surveys revealing that at least 40 million Americans suffer from more than 70 different sleep disorders; furthermore, 60 percent of adults, and 69 percent of children, experience one or more sleep problems a few nights or more during a week. In addition, more than 40 percent of adults experience daytime sleepiness severe enough to interfere with their daily activities at least a few days each month — with 20 percent reporting problem sleepiness a few days a week or more. On the flip side, getting a healthy amount of sleep is linked to: And tons more… Google it. 15. Replace warm showers with cold ones Tony Robbins doesn’t consume caffeine at all. Instead, he starts every morning by jumping into a 57-degree Fahrenheit swimming pool. Why would he do such a thing? Cold water immersion radically facilitates physical and mental wellness. When practiced regularly, it provides long-lasting changes to your body’s immune, lymphatic, circulatory and digestive systems that improve the quality of your life. It can also increase weight-loss because it boosts your metabolism. A 2007 research study found that taking cold showers routinely can help treat depression symptoms often more effectively than prescription medications. That’s because cold water triggers a wave of mood-boosting neurochemicals which make you feel happy. To me, it increases my willpower and boosts my creativity and inspiration. While standing with the cold water hitting my back, I practice slowing my breathing and calming down. After I’ve chilled out, I feel super happy and inspired. Lots of ideas start flowing and I become way motivated to achieve my goals. Here’s a tip if you’re just starting out: start your shower warm, as usual. Let the warm water on your muscles allow you to stretch them out. After you’re stretched and washed, completely turn-off the warm and completely turn-on the cold. It really isn’t too bad at all. It feels incredible. Just do it for 60–90 seconds, then get out. You’ll be very pleased. 16. Say “No” to people, obligations, requests, and opportunities you’re not interested in from now on “No more yes. It’s either HELL YEAH! or no.” — Derek Sivers Your 20 seconds of daily courage will most consistently involve saying “no” to stuff that doesn’t really matter. But how could you possibly say “no” to certain opportunities if you don’t know what you want? You can’t. Like most people, you’ll be seduced by the best thing that comes around. Or, you’ll crumble under other people’s agendas. But if you know what you want, you’ll have the courage and foresight to pass up even brilliant opportunities — because ultimately they are distractors from your vision. As Jim Collins said in Good to Great, “A ‘once-in-a-lifetime opportunity’ is irrelevant if it is the wrong opportunity.” 17. Say “Thank you” every time you’re served by someone It’s amazing when you meet someone who is expressively and genuinely grateful. It’s amazing because, frankly, it’s rare. I remember one day while working as a busser of a restaurant as a teenager. Every time I went by a certain table, whether I was refilling waters, bringing food, anything… the kid at the table (no more than 20 years old) graciously said “thank you.” I even heard him from close proximity saying it to all the other employees when they stopped by his table. This experience had a dramatic impact on me. It was so simple what he was doing. Yet, so beautiful. I instantly loved this person and wanted to serve him even more. I could tell by how he looked in my eyes when saying “thank you” that he meant it. It came from a place of gratitude and humility. Interestingly, one study has found that saying “thank you,” facilitated a 66 percent increase in help offered by those serving. Although altruism is the goal, don’t be surprised as your habit of graciously saying “thank you” turns into even more to be thankful for. 18. Say “I love you” 3+ times a day to the most important people in your life According to neuroscience research, the more you express love (like gratitude), the more other people feel love for you. Sadly, people are taught absurd mindsets about being vulnerable and loving in relationships. Just this morning, my wife and I had to coax and prod our three foster kids to say one nice thing about each other, and to say they loved each other. It took several minutes for our 8 year old foster boy to muster the strength to say he loved his sister. Yet, all of our kids constantly berate and belittle each other. You know the feeling: when you want to say “I love you” but hold back. What a horrible feeling. Why do we hesitate to express our love? Why do we hesitate to connect deeply with others? This may be strange, but if you tell your friends and family you love them, they’ll be blown away. I once knew a Polynesian missionary who told everyone he loved them. It was clear he was sincere. I asked him why he did it. What he told me changed my life. “When I tell people I love them, it not only changes them, but it changes me. Simply by saying the words, I feel more love for that person. I’ve been telling people all around me I love them. They feel treasured by me. Those who know me have come to expect it. When I forget to say it, they miss it.” “The bitterest tears shed over graves are for words left unsaid and deeds left undone.” –Harriet Beecher Stowe 19. Consume 30 grams of protein within the first 30 minutes of waking up Donald Layman, professor emeritus of nutrition at the University of Illinois, recommends consuming at least 30 grams of protein for breakfast. Similarly, Tim Ferriss, in his book, The 4-Hour Body, also recommends 30 grams of protein 30 minutes after waking up. According to Tim, his father did this and lost 19 pounds in one month. Protein-rich foods keep you full longer than other foods because they take longer to leave the stomach. Also, protein keeps blood-sugar levels steady, which prevents spikes in hunger. Eating protein first decreases your white carbohydrate cravings. These are the types of carbs that get you fat. Think bagels, toast, and donuts. Tim makes four recommendations for getting adequate protein in the morning: For people who avoid dairy, meat, and eggs, there are several plant-based proteins. Legumes, greens, nuts, and seeds all are rich in protein. 20. Listen to audiobooks and podcasts on 1.5 or 2x speed, your brain will change faster Listening to audiobooks at normal speed is so three years ago. There is a going trend — particularly in Silicon Valley — to listen to audiobooks at 150 or 200 percent called “speed listening.” In 2010, the tech blog GigaOm suggested “speed-listening to podcasts” as an overall time-saving technique. Software called FasterAudio promises to “cut your audio learning time in half.” If you want to get hardcore, a particularly useful tool is Overcast — a podcast-playback app with a feature called Smart Speed. Smart Speed isn’t about simply playing audio content at 150 or 200 percent of the standard rate; but actually attempts algorithmically to remove fluff (e.g., dead air, pauses between sentences, intros and outros) that bulks up the play time of audio content. Use this technique and you’ll be consuming as much information as you once consumed caffeine. 21. Decide where you’ll be in five years and get there in two “How can you achieve your 10 year plan in the next 6 months?” — Peter Thiel There is always a faster way than you originally conceive. Actually, goal-setting can slow your progress and diminish your potential if you rely too heavily upon it. In an interview with Success Magazine, Tim Ferriss said that he doesn’t have five or ten year goals. Instead, he works on “experiments” or projects for a 6–12 week period of time. If they do extremely well, the possible doors that could open are endless. Tim would rather play to the best possibilities than get stuck on one track. He says this approach allows him to go drastically farther than he could ever plan for. 22. Remove all non-essentials from your life (start with your closet) “You cannot overestimate the unimportance of practically everything.” — Greg McKeown Most of the possessions you own, you don’t use. Most of the clothes in your closet, you don’t wear. Get rid of them. They are sucking energy from your life. Also, they are dormant value waiting to be exchanged for dollars. Getting rid of underutilized resources is like injecting motivation and clarity into your bloodstream. While all of that untapped energy gets removed, a new wave of positive energy comes into your life. You can use that energy in more useful and productive ways. 23. Consume a tablespoon of coconut oil once per day Coconut oil is one of the healthiest foods on the planet. Here are 7 reasons you should eat coconut oil every single day: Coconut oil is a healthy alternative to caffeine. Eating a small amount will give you a shot of energy without the side-effects. 24. Buy a juicer and juice a few times per week Juicing is an incredible way to get loads of vitamins and nutrients from fruits and vegetables. These nutrients can: There are several approaches you can take to juicing. You can reset your body by doing a 3–10 day juice “cleanse.” Or, you could simply incorporate juice into your regular diet. I do both from time to time. I always feel enormously better after juicing. Especially when I get lots of intense greens like kale into my system. 25. Choose to have faith in something bigger than yourself, skepticism is easy In the timeless book, Think and Grow Rich, Napoleon Hill explains that a fundamental principle of wealth creation is having faith — which he defines as visualization and belief in the attainment of desire. As Hill famously said, “Whatever the mind can conceive and believe, the mind can achieve.” If you don’t believe in your dreams, the chances of them happening are slim to none. But if you can come to fully know the things you seek will occur, the universe will conspire to make it happen. According to Hill (see page 49 of Think and Grow Rich), here’s how that works: Like expressing love, in our culture, many have become uncomfortable with ideas like faith. Yet, to all of the best business minds in recent history, faith was fundamental to their success. 26. Stop obsessing about the outcome Research has found that expectations in one’s own ability serves as a better predictor of high performance than expectations about a specific outcome. In his book, The Personal MBA, Josh Kaufman explains that when setting goals, your locus of control should target what you can control (i.e., your efforts) instead of results you can’t control (e.g., whether you get the part). Expect optimal performance from yourself and let the chips fall where they may. The organic output will be your highest quality work. Put most simply: Do what is right, let the consequence follow. 27. Give at least one guilt-free hour to relaxation per day In our quest for success, many of us have become workaholics. However, relaxation is crucial for success. It is akin to resting between sets at the gym. Without resting, your workout will be far less than it could have been. Foolishly, people approach their lives like a workout without rest breaks. Instead, they take stimulants to keep themselves going longer and longer. But this isn’t sustainable or healthy. It’s also bad for productivity and creativity in the short and long run. 28. Genuinely apologize to people you’ve mistreated People make mistakes several times every single day. Sadly — and hilariously — much of the time we act like kids and blame our mistakes on external factors. Research has found that people who don’t openly and often apologize experience higher levels of stress and anxiety. You don’t need that pent-up energy in your life. Make amends and let it go. It’s not your choice if people choose to forgive you. 29. Make friends with five people who inspire you “You are the average of the five people you spend the most time with.” — Jim Rohn Who you spend time with is incredibly important. Even more fundamental is: what types of people are you comfortable around? Your comfort level is one of the clearest indicators of your character. Are the people you enjoy being around inspiring or degrading, hard-working or lazy? What kinds of beliefs do you friends have? What kinds of goals are they pursuing? How much money do they make? What does their health look like? All of these things dramatically impact you. And it is one of the most painful experiences in the world to become uncomfortable around people who have long been your friends. When you grow and evolve and long for more, you’ll begin seeking a different crowd to surround yourself with. Misery loves company. Don’t let them hold you back. Move on but never detach from the love you have for those people. 30. Save 10 percent or more of your income “I would have saved 10 percent automatically from my paycheck by direct deposit into a savings account earning the best possible interest compounded daily. I would have also disciplined myself to deposit 10 percent of any additional money from gifts, refunds or other earned income. I would have bought a small house outright with the money I had saved (instead of renting an apartment for over 30 years). I would have found a job that I loved and devoted my life to it. At least you could be happy even if you were not where you wanted to be financially. Hope this helps someone out there.” — D. Lorinser Tithing yourself is a core principle of wealth creation. Most people pay other people first. Most people live above their means. In total, American consumers owe: The U.S. Census in 2010 reported that there were 234.56 million people over the age of 18 years old, suggesting the average adult owes $3,761 in revolving credit to lenders. Across the average household, American adults also owe $11,244 in student loans, $8,163 on their autos, and $70,322 on their mortgage. Simply switching to home-brewed coffee will save you an average of $64.48 per month (or $2 per day) or $773.80 per year. By putting the savings into a mutual fund with average earnings of 6.5% interest and reinvesting the dividends into more mutual funds over a decade, the $64.48 saved every month would grow into $10,981.93. My wife once took an accounting class from a world-renowned accountant. His words on the first day of class, “The most important thing you’ll learn in this class, which most people will never learn: spend less than you earn. If you do this, you’ll be financially free.” 31. Tithe or give 10 percent of your income away “One gives freely, yet grows all the richer.” — Proverbs 11:24 Many of the wealthiest people in the world attribute their healthy financial life and abundance to giving some of it away. Most people are trying to accumulate as much as they can. However, a natural principle of wealth creation is generosity. As Joe Polish has said, “The world gives to the givers and takes from the takers.” From a spiritual perspective, everything we have is God’s (or the Earth’s). We are merely stewards over our possessions. When we die, we don’t take our money with us. So why hoard it? As you give generously and wisely, you’ll be stunned by the increases in your earning potential. You’ll develop traits needed for radical wealth creation. 32. Drink 64–100 ounces of water per day Human beings are mostly water. As we drink healthy amounts of water, we have smaller waistlines, healthier skin, and better functioning brains. Actually, as we drink enough water, it’s safe to say we’re better in every way. It’s a no-brainer. If you’re not drinking the healthy amount of water each day, you should critically assess your priorities in life. 33. Buy a small place rather than rent Unless you live in a big city (which many of you do), I’m baffled how many people pay outlandish amounts on rent each month. When my wife and I moved to Clemson to begin graduate school, we did a lot of front end work to ensure we’d be able to buy a home. What’s shocking is that our mortgage payment is far less than most of our friend’s rent payments. By the end of our four years here in Clemson, we’ll have earned several thousand dollars in equity and even more in appreciation. Conversely, many of our friends are simply dumping hundreds of dollars into someone else’s pockets every month. Paying rent is like working hourly. You get money while you’re on the clock. When you’re not on the clock, you get no money. Earning equity is like having residual income. Every month you pay down your mortgage, you actually keep that money. So you’re not “spending to live” like most people do. You’re living for free while saving — often earning in appreciation. 34. Check your email and social media at least 60–90 minutes after you wake up Most people check their email and social media immediately upon waking up.This puts them in a reactive state for the remainder of the day. Instead of living life on their own terms, they’d rather respond to other people’s agendas. Hence, the importance of having a solid morning routine. When you wake up and put yourself, not other people first, you position yourself to win before you ever begin playing. As Stephen Covey has taught in his book, Spiritual Roots of Human Relations, “Private victory always precedes public victory.” Make the first few hours of your morning about you, so that you can be the best you can for other people. My morning routine consists of prayer, journal writing, listening to audiobooks and podcasts while I workout, and taking a cold shower. After I’ve had an epic morning, and I’m clear on the direction of my day, I can utilize email and social media for my benefit rather than detriment. 35. Make a few radical changes to your life each year Reinvent yourself every year. Novelty is an antidote to monotony. Jump into new pursuits and relationships. Try things you’ve never done before. Take risks. Have more fun. Pursue big things you’ve been procrastinating for years. In 2015, my wife and I went from having no kids to having three foster kids (ages 4, 6, and 8). I’ve started blogging. I quit my job and started writing full-time. I completely changed my diet. I’ve changed my entire daily routine. This year has been just as transformative as the last. It’s taught me that you can change your whole life in one year. I plan on changing my whole life for the better every year. Change freaks people out. It immediately pulls you from your comfort zone. Which is exactly what you need. You’ll often feel like a fraud. But impostor syndrome is exactly what you should be seeking. Do your best to always be the dumbest person in the room and you’ll improve rapidly. 36. Define what wealth and happiness mean to you “Be everything to everybody and you’ll be nothing for yourself.” — John Rushton No two human beings are the same. So why should we have one standard of success? Seeking society’s standard of success is an endless rat-race. There will always be someone better than you. You’ll never have the time to do everything. Instead, you recognize that every decision has opportunity cost. When you choose one thing, you simultaneously don’t choose several others. And that’s okay. Actually, it’s beautiful because we get to choose our ultimate ideal. We must define success, wealth, and happiness in our own terms because if we don’t, society will for us — and we will always fall short. We’ll always be left wanting. We’ll always be stuck comparing ourselves and competing with other people. Our lives will be an endless race for the next best thing. We’ll never experience contentment. 37. “Change the way you feel, think, and act about money” — Steve Down Most people have an unhealthy relationship with money. It’s not necessarily their fault; it’s what they were taught. In order to change your financial world, you need to alter your paradigm and feelings about money. Here are some key beliefs the most successful people in the world have: When you develop a healthy relationship, you will have more. You won’t spend money on the crap most people waste their money on. You’ll focus more on value than price. 38. Invest only in industries you are informed about Warren Buffett doesn’t invest in technology because he doesn’t understand it. Instead, he invests in banking and insurance. He’s not a tech guy. He invests in what he understands. Yet, so many people invest in things they don’t understand. I’ve made that mistake. I once invested several thousand dollars in an overseas rice distribution. Although the investment sounded incredible on paper, it’s turned out to be a disaster. I didn’t have the understanding to make an informed decision. I put my trust in someone else’s hands. And no one cares about your success more than you do. From now on, I’m going to responsibly invest in things I can make informed decisions on. 39. Create an automated income source that takes care of the fundamentals We live in unprecedented times. It has never been easier to create automated income streams. No matter your skill-set and interests, you can put a business in place that runs 24/7 even while you’re sleeping, sitting on the beach, or playing with your kids. An entrepreneur is someone who works for a few years like no one will so they can live the rest of their life like no one else can. If you want to free up your time and energy for the things that matter most, either invest in stuff you’re informed on (e.g., real estate, businesses, mutual funds), or, create a business that doesn’t require you (e.g., create an online educational course about something you’re passionate about). 40. Have multiple income streams (the more the better) Most people’s income comes from the same source. However, most wealthy people’s income comes from multiple sources. I know people with hundreds of income streams coming in each month. What would happen if you set things up so you were getting income from 5 or 10 different places each month? What if several of those were automated? Again, with a few short years of intentional and focused work, you can have several income streams. 41. Track at least one habit/behavior you’re trying to improve “When performance is measured, performance improves. When performance is measured and reported, the rate of improvement accelerates.” — Thomas Monson Tracking is difficult. If you’ve tried it before, chances are, you quit within a few days. Research has repeatedly found that when behavior is tracked and evaluated, it improves drastically. It’s best to track only a few things. Maybe just one at a time. If you want to track your diet, a fun approach is taking a picture of everything you eat. Everything. This allows you the time to determine if you really want to put that in your body. So, your tracking can be creative. Do what works for you. Use a method you will actually do. But start tracking. As a consultant and executive coach, tracking and reporting behavior, daily, has been the number one factor in my client’s success. When you track something, you become aware of it. When you report something, you become accountable to it. Most of my clients simply send me an email at the end of their workday with a few bullet points (e.g., I did 4 hours of work on my startup, I made 3 sales, I didn’t check social media before noon). Accountability to a spreadsheet or app is not the same as accounting to a person — particularly one you trust and respect. 42. Have no more than 3 items on your to-do list each day When you shift your life from day-to-day reactivity to one of creation and purpose, your goals become a lot bigger. Consequently, your priority list becomes smaller. Instead of doing a million things poorly, the goal becomes to do a few things incredibly — or better yet, to do one thing better than anyone else in the world. “If you have more than three priorities, then you don’t have any.” — Jim Collins So, instead of trying to do a million small things, what one or two things would make the biggest impact? Dan Sullivan, founder of Strategic Coach, explains that there are two economies: The Economy of Hard Work and The Economy of Results. Some people think hard work is the recipe. Although this is completely true, the effort is often misplaced. Most people focus on the process or work first, and the result second. Conversely, those who determine the outcomes their seeking first can better discern which strategy will be most effective. Sure, that strategy may be out of your comfort zone, but as Tim Grover has said inRelentless, “When you crave the end result, the hard work becomes irrelevant.” Tim Ferriss, in his book, The 4-Hour Body, explains what he calls Minimum Effective Dose (MED), which is simply the smallest dose that will yield a desired result and anything past the MED is wasteful. Water boils at 100°C at standard air pressure — it is not “more boiled” if you add more heat. What is the fastest way to get your desired outcome? 43. Make your bed first thing in the morning According to psychological research, people who make their bed in the morning are happier and more successful than those who don’t. If that’s not enough, here’s more: Crazy, right? Something so simple. Yet, when you make your bed first thing in the morning, you knock-off your first accomplishment of the day. This puts you in a mindset of “winning.” Do it! It only takes 30 seconds. 44. Make one audacious request per week (what do you have to lose?) “Rainmakers generate revenue by making asks. They ask for donations. They ask for contracts. They ask for deals. They ask for opportunities. They ask to meet with leaders or speak to them over the phone. They ask for publicity. They come up with ideas and ask for a few minutes of your time to pitch it. They ask for help. Don’t let rainmaking deter you from your dream. It’s one of the barriers to entry, and you can overcome it. Once you taste the sweet victory of a positive response, you’ll not only become comfortable with it, you might even enjoy it. But making asks is the only way to bring your dream to life.” — Ben Arment I got into graduate school way after applications were due because I asked. I’ve gotten free NBA tickets by asking a few players I saw at a hotel. I’ve gotten my work published on high tier outlets because I ask. Very few things in life are just randomly given to you as an adult. In most cases, you need to earn it and/or ask for it. Yet, there are many opportunities currently available to everyone if they would muster the courage and humility to ask. The entire crowdfunding industry is based on making asks. Start making bold and audacious asks. What’s the worst that could happen? They say “No”? What’s the best that could happen? When you don’t ask, you lose by default. And you’ll never know the opportunities you missed out on. Don’t sell yourself short. Ask that beautiful girl on a date. Ask for that raise or big opportunity at work. Ask people to invest in your idea. Put yourself out there. You’ll be blown away by what happens. 45. Be spontaneously generous with a stranger at least once per month Life isn’t all about what you can achieve or acquire. It’s more about who you become and what you contribute. Interestingly, research done at Yale has found that people are instinctively cooperative and generous. However, if you stall and think about being helpful or generous, you’re less likely to do it. And the longer you wait, the likelihood of you being helpful diminishes. This principle applies to other areas as well, like creativity. The longer you wait to do something, the less likely it is you’ll do it. So, be spontaneous. When you get the wild thought of buying the person’s food in the car behind you, just do it. Don’t think about it. If you’re driving down the road and see someone with car trouble off to the side, just do it. Don’t think about it. When you want to say “I love you,” to a loved one, just do it. Don’t think about it. Paralysis by analysis is dumb. And Malcolm Gladwell explains in Blink thatsnap-decisions are often far better than well-thought out ones. 46. Write and place a short, thoughtful note for someone once per day The messages of handwritten letters impact deeper and are remembered longer than electronic messages. There is no comparison to this traditional form of conversation. Handwritten messages are so powerful that people often keep these notes for a long time. Sometimes a lifetime. Jack Canfield has taught that writing 3–5 handwritten notes per day will change your relationships. In our email world, it can seem inefficient to hand-write and mail a letter. But relationships aren’t about efficiency. Not only will handwriting letters change your relationships, it will change you. Research has shown that writing by hand increases brain development and cognition more than typing can. Consequently, the things you write will be seared into your own memory as well, allowing both you and the recipient to reflect back on cherished moments. Writing handwritten notes spices up your relationships, adding an element of fun. It’s exciting placing kind and loving notes in random places for your loved ones to find. Put a note under the windshield wipers of your loved one’s car to find after a hard day’s’ work. Hidden, wait til they come out and watch them from across the street. You’ll see their eyes light up and smile spread. Other fun places include: Anywhere that makes the experience a surprise… 47. Become good friends with your parents Many people have horrible relationships with their parents. I once did myself. Growing up can be tough and sometimes our parents make horrible decisions that negatively impact us. However, my parents have become my best friends. They are my confidants. I turn to them for wisdom and advice. They understand me like no one else. Biology is a powerful thing. Although I don’t see things the same way my parents do, I love them and respect their viewpoints. I love working out with my dad and talking about big ideas with my mom. I couldn’t imagine not being close to them. If your parents are still around, rekindle those ties or increase the flame. You’ll find enormous joy in those relationships. 48. Floss your teeth About 50 percent of Americans claim to floss daily. My guess is that’s a large over-estimate. Either way, the benefits of flossing are incredible. Doing so daily prevents gum disease and tooth loss. Everyone gets plaque, and it can only be removed by flossing or a deep cleaning from your dentist. Plaque buildup can lead to cavities, tooth decay, and gum disease. If left untreated, gum disease can be a risk factor for heart disease, diabetes, and a high body mass index. Yes, not flossing can make you fat. Not only that, but it greatly reduces bad breath. 49. Eat at least one meal with your family per day If possible, eat a sit-down meal with your loved ones daily. It doesn’t matter if it’s breakfast, lunch, or dinner. We’ve become so high-paced in the world that everything we do is on the go. We’ve forgotten what it means to just be with our loved ones. Eating together creates a sense of community like nothing else. Teens who have fewer than three family dinners a week are 3.5 times more likely to have abused prescription drugs and to have used illegal drugs other than marijuana, three times more likely to have used marijuana, more than 2.5 times more likely to have smoked cigarettes, and 1.5 times more likely to have tried alcohol, according to the CASA report. 50. Spend time reflecting on your blessings at least once per day Gratitude is the cure-all for all the world’s problems. It has been called, “the mother of all virtues,” by the Roman philosopher Cicero. When you practice gratitude, your world changes. There is no objective reality. All people perceive reality as they selectively attend to things that are meaningful to them. Hence, some people notice the good while others notice the bad. Gratitude is having an abundance mindset. When you think abundantly, the world is your oyster. There is limitless opportunity and possibility for you. People are magnets. When you’re grateful for what you have, you will attract more of the positive and good. Gratitude is contagious. It changes not only your world, but everyone else’s you come in contact with. Call To Action If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist. Click here to get the checklist right now! ", "title": "50 Ways Happier, Healthier, And More Successful People Live On Their Own Terms", "sentences": [{"83a0": "50 Ways Happier, Healthier, And More Successful People Live On Their Own Terms"}, {"a93d": "1. Stop consuming caffeine"}, {"452d": "Although people think they perform better on caffeine, the truth is, they really don’t. Actually, we’ve become so dependent on caffeine that we use it to simply get back to our status-quo. When we’re off it, we under perform and become incapable."}, {"3a8d": "Isn’t this absurd?"}, {"2e24": "In his book, The Untethered Soul, Michael Singer argues that your energy should come from within — from your why — not from external stimulants. The scientific backing is substantial and unsurprising: intrinsic motivation destroys extrinsic motivation every day of the week."}, {"c99e": "Motivation aside — healthy eating, sleeping, and intensive exercise produce higher quantities and quality of energy than caffeine ever could. A holistic approach to life is essential. Garbage in, garbage out."}, {"8524": "Give up the caffeine and see what happens. To avoid withdrawal headaches — which are mostly placebo — replace your caffeine with something else (another placebo). After a few days without caffeine, you’ll develop confidence in your ability to function without it."}, {"e5ff": "2. Pray or meditate morning, mid-day, and night"}, {"c509": "In a recent interview at the Genius Network mastermind event, Joe Polish asked Tony Robbins what he does to get focused. “Do you meditate? What do you do?” Joe asked."}, {"5f24": "“I don’t know that I meditate. I don’t know that I want to meditate and think about nothing,” Tony responded, “My goal is clarity.”"}, {"efad": "Instead of full-on meditation, Tony has a morning routine that includes several breathing exercises and visualization techniques that get him to a state of clarity and focus. For me, I use prayer and pondering (my version of meditation) as the same vehicle."}, {"6482": "Whatever your approach, the goal should be clarity and focus. What do you want to be about today?"}, {"fdcc": "What few things matter most during the next 24 hours?"}, {"f14d": "I’ve gotten the best results as:"}, {"30ab": "3. Read 1 book per week"}, {"8ea2": "Ordinary people seek entertainment. Extraordinary people seek educationand learning. It is common for the world’s most successful people to read at least one book per week. They are constantly learning."}, {"a2ff": "I can easily get through one audiobook per week by just listening during my commute to school and while walking on campus. Taking even 15–30 minutes every morning to read uplifting and instructive information changes you. It puts you in the zone to perform at your highest."}, {"eace": "Over a long enough period of time, you will have read hundreds of books. You’ll be knowledgeable on several topics. You’ll think and see the world differently. You’ll be able to make more connections between different topics."}, {"abc9": "Reference #19 on this list if you feel you’re “too busy” to read one book per week. There are methods to make this task extremely easy."}, {"06f7": "4. Write in your journal 5 minutes per day"}, {"b765": "This habit will change your life. Your journal will:"}, {"6ac3": "Five minutes per day is more than enough. Greg McKeown, author of Essentialism, recommends writing far less than you want to — only a few sentences or paragraphs at most. This will help you avoid burnout."}, {"6824": "5. Marry the person you love"}, {"b4d7": "“For all the productivity and success advice I’ve read, shaped and marketed for dozens of authors in the last decade, I’ve never really seen someone come out and say: Find yourself a spouse who complements and supports you and makes you better.” — Ryan Holiday"}, {"9b08": "Research done by economists have found — even after controlling for age, education, and other demographics — that married people make 10 to 50 percent more than single people."}, {"ff2f": "Why would this be?"}, {"f146": "Being married gives you a higher purpose for being productive. You are no longer a lone ranger, but have another person who relies on you."}, {"1648": "Marriage also smacks you in the face with what’s really important in life. Sure, hanging out and partying are fun. But too many people get stuck in this phase and miss the meaning that comes from building a life with someone."}, {"8551": "You will never find a better personal development seminar or book than marriage. It will highlight all of your flaws and weaknesses, challenging you to become a better person than you ever thought possible."}, {"ff53": "Said Thomas Monson, “Choose your love; love your choice.” After you’ve chosen the person you love, love them. You don’t marry to make yourself happy, you marry to make someone else happy. Said Frankl in Man’s Search for Meaning, “For success, like happiness, cannot be pursued; it must ensue, and it only does so as the unintended side effect of one’s personal dedication to a cause greater than oneself or as the by-product of one’s surrender to a person other than oneself.”"}, {"74ef": "6. Make a bucket list and actively knock items off"}, {"bd5e": "Most people have it backwards — they design their ambitions around their life, rather than designing their life around their ambitions (see this free eBook on how to quickly create your ideal life)."}, {"78fd": "What are the things you absolutely must do before you die?"}, {"5ed0": "Start there."}, {"783b": "Then design your life around those things. Or as Stephen Covey explained inThe 7 Habits of Highly Effective People, “Begin with the end clearly in mind.”"}, {"34cd": "A simple mental exercise that may be helpful is imagining you only have 30 days to live. What would you do in those 30 days?"}, {"7703": "Now imagine you have 5 years to live. What would you do during those 5 years?"}, {"602d": "Get to work. The death-bed mentality is the only way to live. Stop pretending you’ll live forever. As Professor Harold Hill has said — “You pile up enough tomorrows, and you’ll find you are left with nothing but a lot of empty yesterdays.”"}, {"e56f": "7. Stop consuming refined sugar"}, {"10c6": "If you stop consuming sugar, your brain will radically change. Actually, study after study is showing that refined sugar is worse for our brains than it is for our waistlines. According to Dr. William Coda Martin, refined sugar is nothing more than poison because it has been depleted of its life forces, vitamins and minerals."}, {"51c5": "Refined sugar has now been shown to make us cranky, make us make rash decisions, and make us stupid."}, {"0544": "Again, like caffeine, if you stop eating refined sugar, you will experience some negative withdrawals. But, like any good habit, the effects of this will be seen in the long-run. What would your health be like a year from now (or five) if you were completely refined sugar-free?"}, {"7a41": "Said Albus Dumbledore, Headmaster of Hogwarts School of Witchcraft and Wizardry, “It is not our abilities that show what we truly are. It is our choices.”"}, {"ab49": "8. Fast from all food and caloric beverages 24 hours once per week"}, {"90cf": "One-day (24-hour) food fasts are a popular way to maintain health and vigor. Fasting leverages the self-healing properties of the human body. Radical health improvements occur when the digestive system is given rest and the organs get ample time to repair and heal themselves."}, {"487f": "A regular practice of fasting can:"}, {"84f5": "Like all the other habits, fasting gets easier with practice. I’ve been fasting for years and it’s one of the best things I have done for my health."}, {"5e27": "Fasting is also one of the most recognized techniques in religious and spiritual practices. I also use fasting to get spiritual clarity and refinement."}, {"4356": "Honestly, I could go on for hours about this one. Give it a try. You’ll never be the same."}, {"8cdb": "9. Fast from the internet 24 hours once per week"}, {"7aa0": "Your body gets an intervention when you fast. Your mind and relationships could use one too. Unplug yourself from the matrix."}, {"9780": "If you haven’t caught on already, human beings are highly addictive creatures. We love our coffee, sugar, and internet. And these things are all great. But our lives can be far more enhanced by using these tools in wisdom."}, {"3abc": "The purpose of the internet fast is to reconnect to yourself and your loved ones. So, you probably shouldn’t do it the same day you do your food fast. Because eating is one of the strongest ways to form bonds."}, {"ce76": "You’ll be blown away by how much more connected you feel to your loved ones when you can give them your undivided attention. It may even feel awkward for a while having a real-life conversation without looking at your phone every three minutes."}, {"0add": "10. Stop consuming the news or reading the newspaper"}, {"0b56": "Although the amount of warfare and deaths by human hands are reducing globally, you will not get that message watching televised news or reading the newspaper."}, {"1f83": "On the contrary, these media outlets have an agenda. Their goal is to appeal to your fears by inflating extreme cases — making them seem normal and commonplace. If they didn’t do so, their viewership would plummet. Which is why Peter Diamandis, one of the world’s experts on entrepreneurship and the future of innovation has said, “I’ve stopped watching TV news. They couldn’t pay me enough money.”"}, {"5f68": "You can get high quality news curated from Google news. When you detox from the toxic filth that is public news, you’ll be startled as your worldview becomes radically more optimistic. There is no objective reality. Instead, we live in perceived realities and are thus responsible for the worldview we adopt."}, {"775b": "11. Do something everyday that terrifies you"}, {"455a": "“A person’s success in life can usually be measured by the number of uncomfortable conversations he or she is willing to have.” — Tim Ferriss"}, {"4314": "But you don’t have to constantly be battling your fears. Actually, Darren Hardy has said that you can be a coward 99.9305556% of the time (to be exact). You only need to be courageous for 20 seconds at a time."}, {"5dac": "Twenty seconds of fear is all you need. If you courageously confront fear for 20 seconds every single day, before you know it, you’ll be in a different socio-economic and social situation."}, {"5a5c": "Make that call."}, {"154d": "Ask that question."}, {"4df2": "Pitch that idea."}, {"afd8": "Post that video."}, {"b441": "Whatever it is you feel you want to do–do it. The anticipation of the event is far more painful than the event itself. So just do it and end the inner-conflict."}, {"6a4e": "In most cases, your fears are unfounded. As Seth Godin has explained, ourcomfort zone and our safety zone are not the same thing. It is completely safe to make an uncomfortable phone call. You are not going to die. Don’t equate the two. Recognize that most things outside your comfort zone are completely safe."}, {"331b": "12. Do something kind for someone else daily"}, {"74d9": "“Have I done any good in the world today? Have I helped anyone in need?Have I cheered up the sad and made someone feel glad? If not, I have failed indeed. Has anyone’s burden been lighter today, because I was willing to share? Have the sick and the weary been helped on their way? When they needed my help was I there?” — Will L. Thompson (music and text)"}, {"0d3c": "If we’re too busy to help other people, we’ve missed the mark. Taking the time to spontaneously — as well as planned — helping other people is one of the greatest joys in life. Helping others opens you up to new sides of yourself. It helps you connect deeper with those you help and humanity in general. It clarifies what really matters in life."}, {"fb87": "As Thomas Monson has said, “Never let a problem to be solved become more important than a person to be loved.” That would truly be a failure."}, {"01a6": "13. Go to bed early and rise early"}, {"181a": "According to countless research studies, people who go to bed and rise early are better students. Harvard biologist Christoph Randler found that early sleep/risers are more proactive and are more likely to anticipate problems and minimize them efficiently, which leads to being more successful in the business."}, {"3132": "Other benefits of going to bed and rising early — backed by research — include:"}, {"d747": "Waking up early allows you to proactively and consciously design your day. You can start with a morning routine that sets the tone for your whole day. You show self-respect by putting yourself first. In your morning routine, you can pray/meditate, exercise, listen to or read inspiring content, and write in your journal. This routine will give you a much stronger buzz than a cup of coffee."}, {"ea85": "14. Get 7+ hours of sleep each night"}, {"5e5f": "Let’s face it: sleep is just as important as eating and drinking water. Despite this, millions of people do not sleep enough and experience insane problems as a result."}, {"c757": "The National Sleep Foundation (NSF) conducted surveys revealing that at least 40 million Americans suffer from more than 70 different sleep disorders; furthermore, 60 percent of adults, and 69 percent of children, experience one or more sleep problems a few nights or more during a week."}, {"8b58": "In addition, more than 40 percent of adults experience daytime sleepiness severe enough to interfere with their daily activities at least a few days each month — with 20 percent reporting problem sleepiness a few days a week or more."}, {"26a8": "On the flip side, getting a healthy amount of sleep is linked to:"}, {"4f61": "And tons more… Google it."}, {"792c": "15. Replace warm showers with cold ones"}, {"2ebe": "Tony Robbins doesn’t consume caffeine at all. Instead, he starts every morning by jumping into a 57-degree Fahrenheit swimming pool."}, {"2afa": "Why would he do such a thing?"}, {"e048": "Cold water immersion radically facilitates physical and mental wellness. When practiced regularly, it provides long-lasting changes to your body’s immune, lymphatic, circulatory and digestive systems that improve the quality of your life. It can also increase weight-loss because it boosts your metabolism."}, {"1ac2": "A 2007 research study found that taking cold showers routinely can help treat depression symptoms often more effectively than prescription medications. That’s because cold water triggers a wave of mood-boosting neurochemicals which make you feel happy."}, {"c90f": "To me, it increases my willpower and boosts my creativity and inspiration. While standing with the cold water hitting my back, I practice slowing my breathing and calming down. After I’ve chilled out, I feel super happy and inspired. Lots of ideas start flowing and I become way motivated to achieve my goals."}, {"4efd": "Here’s a tip if you’re just starting out: start your shower warm, as usual. Let the warm water on your muscles allow you to stretch them out. After you’re stretched and washed, completely turn-off the warm and completely turn-on the cold. It really isn’t too bad at all. It feels incredible. Just do it for 60–90 seconds, then get out. You’ll be very pleased."}, {"cc3c": "16. Say “No” to people, obligations, requests, and opportunities you’re not interested in from now on"}, {"6118": "“No more yes. It’s either HELL YEAH! or no.” — Derek Sivers"}, {"8080": "Your 20 seconds of daily courage will most consistently involve saying “no” to stuff that doesn’t really matter. But how could you possibly say “no” to certain opportunities if you don’t know what you want? You can’t. Like most people, you’ll be seduced by the best thing that comes around. Or, you’ll crumble under other people’s agendas."}, {"51b6": "But if you know what you want, you’ll have the courage and foresight to pass up even brilliant opportunities — because ultimately they are distractors from your vision. As Jim Collins said in Good to Great, “A ‘once-in-a-lifetime opportunity’ is irrelevant if it is the wrong opportunity.”"}, {"038e": "17. Say “Thank you” every time you’re served by someone"}, {"717f": "It’s amazing when you meet someone who is expressively and genuinely grateful. It’s amazing because, frankly, it’s rare."}, {"7f8c": "I remember one day while working as a busser of a restaurant as a teenager. Every time I went by a certain table, whether I was refilling waters, bringing food, anything… the kid at the table (no more than 20 years old) graciously said “thank you.” I even heard him from close proximity saying it to all the other employees when they stopped by his table."}, {"3562": "This experience had a dramatic impact on me. It was so simple what he was doing. Yet, so beautiful. I instantly loved this person and wanted to serve him even more."}, {"98c5": "I could tell by how he looked in my eyes when saying “thank you” that he meant it. It came from a place of gratitude and humility."}, {"9155": "Interestingly, one study has found that saying “thank you,” facilitated a 66 percent increase in help offered by those serving. Although altruism is the goal, don’t be surprised as your habit of graciously saying “thank you” turns into even more to be thankful for."}, {"da8d": "18. Say “I love you” 3+ times a day to the most important people in your life"}, {"9e91": "According to neuroscience research, the more you express love (like gratitude), the more other people feel love for you. Sadly, people are taught absurd mindsets about being vulnerable and loving in relationships. Just this morning, my wife and I had to coax and prod our three foster kids to say one nice thing about each other, and to say they loved each other."}, {"046f": "It took several minutes for our 8 year old foster boy to muster the strength to say he loved his sister. Yet, all of our kids constantly berate and belittle each other."}, {"26e4": "You know the feeling: when you want to say “I love you” but hold back. What a horrible feeling."}, {"0f30": "Why do we hesitate to express our love?"}, {"b153": "Why do we hesitate to connect deeply with others?"}, {"e7d6": "This may be strange, but if you tell your friends and family you love them, they’ll be blown away. I once knew a Polynesian missionary who told everyone he loved them. It was clear he was sincere."}, {"992a": "I asked him why he did it. What he told me changed my life. “When I tell people I love them, it not only changes them, but it changes me. Simply by saying the words, I feel more love for that person. I’ve been telling people all around me I love them. They feel treasured by me. Those who know me have come to expect it. When I forget to say it, they miss it.”"}, {"8bd4": "“The bitterest tears shed over graves are for words left unsaid and deeds left undone.” –Harriet Beecher Stowe"}, {"373c": "19. Consume 30 grams of protein within the first 30 minutes of waking up"}, {"03d3": "Donald Layman, professor emeritus of nutrition at the University of Illinois, recommends consuming at least 30 grams of protein for breakfast. Similarly, Tim Ferriss, in his book, The 4-Hour Body, also recommends 30 grams of protein 30 minutes after waking up."}, {"1f6e": "According to Tim, his father did this and lost 19 pounds in one month."}, {"9651": "Protein-rich foods keep you full longer than other foods because they take longer to leave the stomach. Also, protein keeps blood-sugar levels steady, which prevents spikes in hunger."}, {"c573": "Eating protein first decreases your white carbohydrate cravings. These are the types of carbs that get you fat. Think bagels, toast, and donuts."}, {"72c4": "Tim makes four recommendations for getting adequate protein in the morning:"}, {"c754": "For people who avoid dairy, meat, and eggs, there are several plant-based proteins. Legumes, greens, nuts, and seeds all are rich in protein."}, {"ab98": "20. Listen to audiobooks and podcasts on 1.5 or 2x speed, your brain will change faster"}, {"8226": "Listening to audiobooks at normal speed is so three years ago. There is a going trend — particularly in Silicon Valley — to listen to audiobooks at 150 or 200 percent called “speed listening.”"}, {"7f89": "In 2010, the tech blog GigaOm suggested “speed-listening to podcasts” as an overall time-saving technique. Software called FasterAudio promises to “cut your audio learning time in half.”"}, {"66ac": "If you want to get hardcore, a particularly useful tool is Overcast — a podcast-playback app with a feature called Smart Speed. Smart Speed isn’t about simply playing audio content at 150 or 200 percent of the standard rate; but actually attempts algorithmically to remove fluff (e.g., dead air, pauses between sentences, intros and outros) that bulks up the play time of audio content."}, {"48fe": "Use this technique and you’ll be consuming as much information as you once consumed caffeine."}, {"ed63": "21. Decide where you’ll be in five years and get there in two"}, {"269e": "“How can you achieve your 10 year plan in the next 6 months?” — Peter Thiel"}, {"0d33": "There is always a faster way than you originally conceive. Actually, goal-setting can slow your progress and diminish your potential if you rely too heavily upon it."}, {"a88a": "In an interview with Success Magazine, Tim Ferriss said that he doesn’t have five or ten year goals. Instead, he works on “experiments” or projects for a 6–12 week period of time. If they do extremely well, the possible doors that could open are endless. Tim would rather play to the best possibilities than get stuck on one track. He says this approach allows him to go drastically farther than he could ever plan for."}, {"2aee": "22. Remove all non-essentials from your life (start with your closet)"}, {"6e34": "“You cannot overestimate the unimportance of practically everything.” — Greg McKeown"}, {"9e27": "Most of the possessions you own, you don’t use. Most of the clothes in your closet, you don’t wear. Get rid of them. They are sucking energy from your life. Also, they are dormant value waiting to be exchanged for dollars."}, {"bd12": "Getting rid of underutilized resources is like injecting motivation and clarity into your bloodstream. While all of that untapped energy gets removed, a new wave of positive energy comes into your life. You can use that energy in more useful and productive ways."}, {"9bac": "23. Consume a tablespoon of coconut oil once per day"}, {"1fec": "Coconut oil is one of the healthiest foods on the planet."}, {"6a3c": "Here are 7 reasons you should eat coconut oil every single day:"}, {"661b": "Coconut oil is a healthy alternative to caffeine. Eating a small amount will give you a shot of energy without the side-effects."}, {"5a50": "24. Buy a juicer and juice a few times per week"}, {"ca77": "Juicing is an incredible way to get loads of vitamins and nutrients from fruits and vegetables. These nutrients can:"}, {"09e3": "There are several approaches you can take to juicing. You can reset your body by doing a 3–10 day juice “cleanse.” Or, you could simply incorporate juice into your regular diet. I do both from time to time."}, {"1787": "I always feel enormously better after juicing. Especially when I get lots of intense greens like kale into my system."}, {"c24c": "25. Choose to have faith in something bigger than yourself, skepticism is easy"}, {"4b20": "In the timeless book, Think and Grow Rich, Napoleon Hill explains that a fundamental principle of wealth creation is having faith — which he defines as visualization and belief in the attainment of desire."}, {"3d34": "As Hill famously said, “Whatever the mind can conceive and believe, the mind can achieve.”"}, {"9903": "If you don’t believe in your dreams, the chances of them happening are slim to none. But if you can come to fully know the things you seek will occur, the universe will conspire to make it happen."}, {"a220": "According to Hill (see page 49 of Think and Grow Rich), here’s how that works:"}, {"9673": "Like expressing love, in our culture, many have become uncomfortable with ideas like faith. Yet, to all of the best business minds in recent history, faith was fundamental to their success."}, {"a2bd": "26. Stop obsessing about the outcome"}, {"c49a": "Research has found that expectations in one’s own ability serves as a better predictor of high performance than expectations about a specific outcome. In his book, The Personal MBA, Josh Kaufman explains that when setting goals, your locus of control should target what you can control (i.e., your efforts) instead of results you can’t control (e.g., whether you get the part)."}, {"c2f1": "Expect optimal performance from yourself and let the chips fall where they may. The organic output will be your highest quality work. Put most simply: Do what is right, let the consequence follow."}, {"2619": "27. Give at least one guilt-free hour to relaxation per day"}, {"7246": "In our quest for success, many of us have become workaholics. However, relaxation is crucial for success. It is akin to resting between sets at the gym. Without resting, your workout will be far less than it could have been."}, {"0222": "Foolishly, people approach their lives like a workout without rest breaks. Instead, they take stimulants to keep themselves going longer and longer. But this isn’t sustainable or healthy. It’s also bad for productivity and creativity in the short and long run."}, {"0f9e": "28. Genuinely apologize to people you’ve mistreated"}, {"ea7a": "People make mistakes several times every single day. Sadly — and hilariously — much of the time we act like kids and blame our mistakes on external factors. Research has found that people who don’t openly and often apologize experience higher levels of stress and anxiety."}, {"20b7": "You don’t need that pent-up energy in your life. Make amends and let it go. It’s not your choice if people choose to forgive you."}, {"5924": "29. Make friends with five people who inspire you"}, {"2e78": "“You are the average of the five people you spend the most time with.” — Jim Rohn"}, {"e016": "Who you spend time with is incredibly important. Even more fundamental is: what types of people are you comfortable around?"}, {"5a3c": "Your comfort level is one of the clearest indicators of your character. Are the people you enjoy being around inspiring or degrading, hard-working or lazy?"}, {"6b6e": "What kinds of beliefs do you friends have?"}, {"5617": "What kinds of goals are they pursuing?"}, {"6570": "How much money do they make?"}, {"4dcf": "What does their health look like?"}, {"24db": "All of these things dramatically impact you. And it is one of the most painful experiences in the world to become uncomfortable around people who have long been your friends. When you grow and evolve and long for more, you’ll begin seeking a different crowd to surround yourself with."}, {"8714": "Misery loves company. Don’t let them hold you back. Move on but never detach from the love you have for those people."}, {"8cbb": "30. Save 10 percent or more of your income"}, {"bf83": "“I would have saved 10 percent automatically from my paycheck by direct deposit into a savings account earning the best possible interest compounded daily. I would have also disciplined myself to deposit 10 percent of any additional money from gifts, refunds or other earned income. I would have bought a small house outright with the money I had saved (instead of renting an apartment for over 30 years). I would have found a job that I loved and devoted my life to it. At least you could be happy even if you were not where you wanted to be financially. Hope this helps someone out there.” — D. Lorinser"}, {"451f": "Tithing yourself is a core principle of wealth creation. Most people pay other people first. Most people live above their means."}, {"f952": "In total, American consumers owe:"}, {"46dd": "The U.S. Census in 2010 reported that there were 234.56 million people over the age of 18 years old, suggesting the average adult owes $3,761 in revolving credit to lenders. Across the average household, American adults also owe $11,244 in student loans, $8,163 on their autos, and $70,322 on their mortgage."}, {"1425": "Simply switching to home-brewed coffee will save you an average of $64.48 per month (or $2 per day) or $773.80 per year. By putting the savings into a mutual fund with average earnings of 6.5% interest and reinvesting the dividends into more mutual funds over a decade, the $64.48 saved every month would grow into $10,981.93."}, {"6003": "My wife once took an accounting class from a world-renowned accountant. His words on the first day of class, “The most important thing you’ll learn in this class, which most people will never learn: spend less than you earn. If you do this, you’ll be financially free.”"}, {"d964": "31. Tithe or give 10 percent of your income away"}, {"0cf1": "“One gives freely, yet grows all the richer.” — Proverbs 11:24"}, {"6aef": "Many of the wealthiest people in the world attribute their healthy financial life and abundance to giving some of it away."}, {"5041": "Most people are trying to accumulate as much as they can. However, a natural principle of wealth creation is generosity. As Joe Polish has said, “The world gives to the givers and takes from the takers.”"}, {"5f59": "From a spiritual perspective, everything we have is God’s (or the Earth’s). We are merely stewards over our possessions. When we die, we don’t take our money with us. So why hoard it?"}, {"6453": "As you give generously and wisely, you’ll be stunned by the increases in your earning potential. You’ll develop traits needed for radical wealth creation."}, {"a177": "32. Drink 64–100 ounces of water per day"}, {"06bc": "Human beings are mostly water. As we drink healthy amounts of water, we have smaller waistlines, healthier skin, and better functioning brains. Actually, as we drink enough water, it’s safe to say we’re better in every way."}, {"32c6": "It’s a no-brainer. If you’re not drinking the healthy amount of water each day, you should critically assess your priorities in life."}, {"f6ee": "33. Buy a small place rather than rent"}, {"3c3b": "Unless you live in a big city (which many of you do), I’m baffled how many people pay outlandish amounts on rent each month."}, {"4749": "When my wife and I moved to Clemson to begin graduate school, we did a lot of front end work to ensure we’d be able to buy a home. What’s shocking is that our mortgage payment is far less than most of our friend’s rent payments. By the end of our four years here in Clemson, we’ll have earned several thousand dollars in equity and even more in appreciation. Conversely, many of our friends are simply dumping hundreds of dollars into someone else’s pockets every month."}, {"a7f0": "Paying rent is like working hourly. You get money while you’re on the clock. When you’re not on the clock, you get no money. Earning equity is like having residual income. Every month you pay down your mortgage, you actually keep that money. So you’re not “spending to live” like most people do. You’re living for free while saving — often earning in appreciation."}, {"dcbc": "34. Check your email and social media at least 60–90 minutes after you wake up"}, {"6efb": "Most people check their email and social media immediately upon waking up.This puts them in a reactive state for the remainder of the day. Instead of living life on their own terms, they’d rather respond to other people’s agendas."}, {"8e94": "Hence, the importance of having a solid morning routine. When you wake up and put yourself, not other people first, you position yourself to win before you ever begin playing. As Stephen Covey has taught in his book, Spiritual Roots of Human Relations, “Private victory always precedes public victory.”"}, {"a0f9": "Make the first few hours of your morning about you, so that you can be the best you can for other people. My morning routine consists of prayer, journal writing, listening to audiobooks and podcasts while I workout, and taking a cold shower."}, {"7d00": "After I’ve had an epic morning, and I’m clear on the direction of my day, I can utilize email and social media for my benefit rather than detriment."}, {"e249": "35. Make a few radical changes to your life each year"}, {"53c2": "Reinvent yourself every year. Novelty is an antidote to monotony. Jump into new pursuits and relationships."}, {"0130": "Try things you’ve never done before."}, {"733d": "Take risks."}, {"3289": "Have more fun."}, {"4c92": "Pursue big things you’ve been procrastinating for years."}, {"e0a2": "In 2015, my wife and I went from having no kids to having three foster kids (ages 4, 6, and 8). I’ve started blogging. I quit my job and started writing full-time. I completely changed my diet. I’ve changed my entire daily routine."}, {"2d1a": "This year has been just as transformative as the last. It’s taught me that you can change your whole life in one year. I plan on changing my whole life for the better every year."}, {"ced9": "Change freaks people out. It immediately pulls you from your comfort zone. Which is exactly what you need. You’ll often feel like a fraud. But impostor syndrome is exactly what you should be seeking. Do your best to always be the dumbest person in the room and you’ll improve rapidly."}, {"baf9": "36. Define what wealth and happiness mean to you"}, {"7966": "“Be everything to everybody and you’ll be nothing for yourself.” — John Rushton"}, {"4144": "No two human beings are the same. So why should we have one standard of success? Seeking society’s standard of success is an endless rat-race. There will always be someone better than you. You’ll never have the time to do everything."}, {"c49e": "Instead, you recognize that every decision has opportunity cost. When you choose one thing, you simultaneously don’t choose several others. And that’s okay. Actually, it’s beautiful because we get to choose our ultimate ideal."}, {"bc4d": "We must define success, wealth, and happiness in our own terms because if we don’t, society will for us — and we will always fall short. We’ll always be left wanting. We’ll always be stuck comparing ourselves and competing with other people. Our lives will be an endless race for the next best thing. We’ll never experience contentment."}, {"c1d7": "37. “Change the way you feel, think, and act about money” — Steve Down"}, {"90e7": "Most people have an unhealthy relationship with money. It’s not necessarily their fault; it’s what they were taught."}, {"a296": "In order to change your financial world, you need to alter your paradigm and feelings about money."}, {"0852": "Here are some key beliefs the most successful people in the world have:"}, {"13a4": "When you develop a healthy relationship, you will have more. You won’t spend money on the crap most people waste their money on. You’ll focus more on value than price."}, {"631f": "38. Invest only in industries you are informed about"}, {"16b9": "Warren Buffett doesn’t invest in technology because he doesn’t understand it. Instead, he invests in banking and insurance. He’s not a tech guy. He invests in what he understands."}, {"74c3": "Yet, so many people invest in things they don’t understand. I’ve made that mistake. I once invested several thousand dollars in an overseas rice distribution. Although the investment sounded incredible on paper, it’s turned out to be a disaster."}, {"840a": "I didn’t have the understanding to make an informed decision. I put my trust in someone else’s hands. And no one cares about your success more than you do."}, {"986b": "From now on, I’m going to responsibly invest in things I can make informed decisions on."}, {"e44c": "39. Create an automated income source that takes care of the fundamentals"}, {"5105": "We live in unprecedented times. It has never been easier to create automated income streams. No matter your skill-set and interests, you can put a business in place that runs 24/7 even while you’re sleeping, sitting on the beach, or playing with your kids."}, {"2687": "An entrepreneur is someone who works for a few years like no one will so they can live the rest of their life like no one else can."}, {"8e4c": "If you want to free up your time and energy for the things that matter most, either invest in stuff you’re informed on (e.g., real estate, businesses, mutual funds), or, create a business that doesn’t require you (e.g., create an online educational course about something you’re passionate about)."}, {"f740": "40. Have multiple income streams (the more the better)"}, {"2b13": "Most people’s income comes from the same source. However, most wealthy people’s income comes from multiple sources. I know people with hundreds of income streams coming in each month."}, {"f830": "What would happen if you set things up so you were getting income from 5 or 10 different places each month?"}, {"d079": "What if several of those were automated?"}, {"ee45": "Again, with a few short years of intentional and focused work, you can have several income streams."}, {"7900": "41. Track at least one habit/behavior you’re trying to improve"}, {"3f8d": "“When performance is measured, performance improves. When performance is measured and reported, the rate of improvement accelerates.” — Thomas Monson"}, {"fddf": "Tracking is difficult. If you’ve tried it before, chances are, you quit within a few days."}, {"67bb": "Research has repeatedly found that when behavior is tracked and evaluated, it improves drastically."}, {"fa31": "It’s best to track only a few things. Maybe just one at a time."}, {"4a05": "If you want to track your diet, a fun approach is taking a picture of everything you eat. Everything. This allows you the time to determine if you really want to put that in your body."}, {"70fb": "So, your tracking can be creative. Do what works for you. Use a method you will actually do. But start tracking."}, {"f206": "As a consultant and executive coach, tracking and reporting behavior, daily, has been the number one factor in my client’s success. When you track something, you become aware of it. When you report something, you become accountable to it."}, {"b4da": "Most of my clients simply send me an email at the end of their workday with a few bullet points (e.g., I did 4 hours of work on my startup, I made 3 sales, I didn’t check social media before noon). Accountability to a spreadsheet or app is not the same as accounting to a person — particularly one you trust and respect."}, {"4c5c": "42. Have no more than 3 items on your to-do list each day"}, {"72d9": "When you shift your life from day-to-day reactivity to one of creation and purpose, your goals become a lot bigger. Consequently, your priority list becomes smaller. Instead of doing a million things poorly, the goal becomes to do a few things incredibly — or better yet, to do one thing better than anyone else in the world."}, {"da5b": "“If you have more than three priorities, then you don’t have any.” — Jim Collins"}, {"d4b2": "So, instead of trying to do a million small things, what one or two things would make the biggest impact?"}, {"4c8f": "Dan Sullivan, founder of Strategic Coach, explains that there are two economies: The Economy of Hard Work and The Economy of Results."}, {"f388": "Some people think hard work is the recipe. Although this is completely true, the effort is often misplaced. Most people focus on the process or work first, and the result second. Conversely, those who determine the outcomes their seeking first can better discern which strategy will be most effective. Sure, that strategy may be out of your comfort zone, but as Tim Grover has said inRelentless, “When you crave the end result, the hard work becomes irrelevant.”"}, {"e97f": "Tim Ferriss, in his book, The 4-Hour Body, explains what he calls Minimum Effective Dose (MED), which is simply the smallest dose that will yield a desired result and anything past the MED is wasteful. Water boils at 100°C at standard air pressure — it is not “more boiled” if you add more heat."}, {"5191": "What is the fastest way to get your desired outcome?"}, {"f28b": "43. Make your bed first thing in the morning"}, {"502a": "According to psychological research, people who make their bed in the morning are happier and more successful than those who don’t. If that’s not enough, here’s more:"}, {"915e": "Crazy, right?"}, {"34d7": "Something so simple. Yet, when you make your bed first thing in the morning, you knock-off your first accomplishment of the day. This puts you in a mindset of “winning.”"}, {"5ff3": "Do it! It only takes 30 seconds."}, {"7485": "44. Make one audacious request per week (what do you have to lose?)"}, {"898b": "“Rainmakers generate revenue by making asks. They ask for donations. They ask for contracts. They ask for deals. They ask for opportunities. They ask to meet with leaders or speak to them over the phone. They ask for publicity. They come up with ideas and ask for a few minutes of your time to pitch it. They ask for help. Don’t let rainmaking deter you from your dream. It’s one of the barriers to entry, and you can overcome it. Once you taste the sweet victory of a positive response, you’ll not only become comfortable with it, you might even enjoy it. But making asks is the only way to bring your dream to life.” — Ben Arment"}, {"85c7": "I got into graduate school way after applications were due because I asked."}, {"f5f4": "I’ve gotten free NBA tickets by asking a few players I saw at a hotel."}, {"8ba5": "I’ve gotten my work published on high tier outlets because I ask."}, {"6290": "Very few things in life are just randomly given to you as an adult. In most cases, you need to earn it and/or ask for it."}, {"e04a": "Yet, there are many opportunities currently available to everyone if they would muster the courage and humility to ask."}, {"fd56": "The entire crowdfunding industry is based on making asks."}, {"e316": "Start making bold and audacious asks. What’s the worst that could happen? They say “No”?"}, {"dd26": "What’s the best that could happen?"}, {"a8cd": "When you don’t ask, you lose by default. And you’ll never know the opportunities you missed out on."}, {"d2ed": "Don’t sell yourself short. Ask that beautiful girl on a date. Ask for that raise or big opportunity at work. Ask people to invest in your idea."}, {"9e46": "Put yourself out there. You’ll be blown away by what happens."}, {"601b": "45. Be spontaneously generous with a stranger at least once per month"}, {"d924": "Life isn’t all about what you can achieve or acquire. It’s more about who you become and what you contribute."}, {"8656": "Interestingly, research done at Yale has found that people are instinctively cooperative and generous. However, if you stall and think about being helpful or generous, you’re less likely to do it. And the longer you wait, the likelihood of you being helpful diminishes. This principle applies to other areas as well, like creativity. The longer you wait to do something, the less likely it is you’ll do it."}, {"78b1": "So, be spontaneous. When you get the wild thought of buying the person’s food in the car behind you, just do it. Don’t think about it."}, {"6703": "If you’re driving down the road and see someone with car trouble off to the side, just do it. Don’t think about it."}, {"367e": "When you want to say “I love you,” to a loved one, just do it. Don’t think about it."}, {"fa7b": "Paralysis by analysis is dumb. And Malcolm Gladwell explains in Blink thatsnap-decisions are often far better than well-thought out ones."}, {"51d7": "46. Write and place a short, thoughtful note for someone once per day"}, {"394b": "The messages of handwritten letters impact deeper and are remembered longer than electronic messages. There is no comparison to this traditional form of conversation. Handwritten messages are so powerful that people often keep these notes for a long time. Sometimes a lifetime."}, {"36bf": "Jack Canfield has taught that writing 3–5 handwritten notes per day will change your relationships. In our email world, it can seem inefficient to hand-write and mail a letter. But relationships aren’t about efficiency."}, {"8967": "Not only will handwriting letters change your relationships, it will change you. Research has shown that writing by hand increases brain development and cognition more than typing can."}, {"4351": "Consequently, the things you write will be seared into your own memory as well, allowing both you and the recipient to reflect back on cherished moments."}, {"389b": "Writing handwritten notes spices up your relationships, adding an element of fun. It’s exciting placing kind and loving notes in random places for your loved ones to find. Put a note under the windshield wipers of your loved one’s car to find after a hard day’s’ work. Hidden, wait til they come out and watch them from across the street. You’ll see their eyes light up and smile spread."}, {"c71f": "Other fun places include:"}, {"93f2": "Anywhere that makes the experience a surprise…"}, {"ccb0": "47. Become good friends with your parents"}, {"3c53": "Many people have horrible relationships with their parents. I once did myself. Growing up can be tough and sometimes our parents make horrible decisions that negatively impact us."}, {"d5f9": "However, my parents have become my best friends. They are my confidants. I turn to them for wisdom and advice. They understand me like no one else. Biology is a powerful thing."}, {"5e04": "Although I don’t see things the same way my parents do, I love them and respect their viewpoints. I love working out with my dad and talking about big ideas with my mom."}, {"b895": "I couldn’t imagine not being close to them."}, {"6e51": "If your parents are still around, rekindle those ties or increase the flame. You’ll find enormous joy in those relationships."}, {"bf96": "48. Floss your teeth"}, {"74cd": "About 50 percent of Americans claim to floss daily. My guess is that’s a large over-estimate. Either way, the benefits of flossing are incredible."}, {"72cb": "Doing so daily prevents gum disease and tooth loss. Everyone gets plaque, and it can only be removed by flossing or a deep cleaning from your dentist. Plaque buildup can lead to cavities, tooth decay, and gum disease. If left untreated, gum disease can be a risk factor for heart disease, diabetes, and a high body mass index."}, {"f55c": "Yes, not flossing can make you fat."}, {"b51c": "Not only that, but it greatly reduces bad breath."}, {"bd87": "49. Eat at least one meal with your family per day"}, {"d243": "If possible, eat a sit-down meal with your loved ones daily. It doesn’t matter if it’s breakfast, lunch, or dinner."}, {"deee": "We’ve become so high-paced in the world that everything we do is on the go. We’ve forgotten what it means to just be with our loved ones."}, {"181d": "Eating together creates a sense of community like nothing else."}, {"415d": "Teens who have fewer than three family dinners a week are 3.5 times more likely to have abused prescription drugs and to have used illegal drugs other than marijuana, three times more likely to have used marijuana, more than 2.5 times more likely to have smoked cigarettes, and 1.5 times more likely to have tried alcohol, according to the CASA report."}, {"8a98": "50. Spend time reflecting on your blessings at least once per day"}, {"2f4b": "Gratitude is the cure-all for all the world’s problems. It has been called, “the mother of all virtues,” by the Roman philosopher Cicero."}, {"fa5a": "When you practice gratitude, your world changes. There is no objective reality. All people perceive reality as they selectively attend to things that are meaningful to them. Hence, some people notice the good while others notice the bad."}, {"821c": "Gratitude is having an abundance mindset. When you think abundantly, the world is your oyster. There is limitless opportunity and possibility for you."}, {"d4e8": "People are magnets. When you’re grateful for what you have, you will attract more of the positive and good. Gratitude is contagious. It changes not only your world, but everyone else’s you come in contact with."}, {"18f4": "Call To Action"}, {"6da6": "If you want to focus on the right activities and get results 10x faster than most people, check out my morning checklist."}, {"7675": "Click here to get the checklist right now!"}], "child": "650_1\t650_2\t650_3\t650_4\t650_5\t650_6\t650_7\t650_8\t650_9\t650_10\t650_11\t650_12\t650_13\t650_14\t650_15\t650_16\t650_17\t650_18\t650_19\t650_20\t650_21\t650_22\t650_23\t650_24\t650_25"}