{"name": "651", "parent": "", "content": "How to Manage Your Time and Learn New Things Every Day Here’s a hard truth: You have 24 hours. No matter how many books you’ve written (or haven’t), no matter how big your dreams are (or aren’t), no matter how much “potential” you have (or don’t) — you have 24 hours. Today’s 24 hours will move faster than yesterday’s. Tomorrow’s 24 hours will go faster still. I graduated college, went to sleep, and then woke up the next day to my 3 year anniversary with a company I swore I’d only be at for a few weeks. Now, I am afraid to blink. And in the meantime, the world keeps changing. Nonstop! We are supposed to keep up with all the geniuses, the trends, the news. Who let that happen? You are busy. I know that because you are alive on this planet in the fastest generation of humans ever. But still, you have to stay ahead of the curve. You have to learn. You have to grow. And in the meantime, you have to stay sane. How do you do it? Here’s my strategy A) STOP BINGING ON PODCASTS Many people I know are podcast-a-holics. Podcasts make us feel smart. Culture dictates whoever listens to the most podcasts is the smartest. “I listen on 2x speed,” someone once told me. “So I can get in more information.” The question I didn’t asked, but should have, was this: “Okay, so what do you remember from this morning?” I used to be that guy. I was Podcast Todd, Genius. Then, I realized I hadn’t applied a single thing I listened to. Podcast Todd still shows up sometimes. But he trades out his shift to Thoughtful Todd, the guy who talks to his steering wheel about what he learned from the podcast that morning. (A lot of times, the answer was “Uhmmm,” so I cut that podcast) B) SAY THESE MAGIC WORDS “I love you, but I can’t give you my focus right now.” This drawing by Larry Kim stopped me in my tracks the other day. I thought I was pretty good at monotasking. Then one morning, I wrote 200 words of a blog post, went to check Twitter, answered some email, and then returned to the blog post. This cycle lasted a long time. My problem was this — everything I deemed “productive” fell under the same task. Website changes, research, writing, and making graphics for posts logically fell under the same big objective. But biologically, my brain wasted energy fighting off all kinds of attention residue jumping from thing to thing. Now I say “I love you, but I can’t give you my focus right now” to Twitter, Quora, phone calls, and text messages when I’m trying to tackle a new subject. Learning is progress, even if it doesn’t feel like a priority. When I’m reading or researching, that’s ALL I do. C) ASK ONE PERSON ABOUT THEIR JOB EVERY DAY It’s good being the dumbest person in the room. When you are dumb, people tell you everything they know. Ask them to repeat it once. Write it down. Then talk to yourself about it on the way home. People often ignore massive sources of knowledge all around them in the form of co-workers. Most of the time, I would rather have a deep conversation with a colleague than read the latest bestselling book because: I dare you to learn as much from everyone around you as you possibly can first. Then feel free to read more books. D) BE WILLING TO “THROW AWAY” TIME For 6 MONTHS I slaved away at my first animation project. I went back and forth to YouTube, looking for tutorials. This was misery. At the end of that six months, I wiped the sweat off my brow, and pressed render on my first complete animated short — a brief video on meetings. Do you know what happened next? I threw that project directly in the recycling bin. Nobody ever laid eyes on it. Learning always comes at a cost, whether it’s time or money. This project didn’t cost me any money, but I sacrificed my time, one thing I will never get back. Please, understand one thing. If you wish to be more visible in the world, you will have to do a lot of INvisible work. As a result of that 6 months, I now am able to animate at a decent level. I am able to cut my own videos instead of paying way too much for outsourcing. Learning sucks. It hurts. It will make you tired. Do it anyway. Here’s why: Technology changes, with or without you. Business changes, with or without you. The world moves on, with or without you. The way I see it, you have two choices: For More on Learning Learning is a key staple to my workflow because it fuels my idea machine. Ideas have been the key to my work being seen by *millions* of people on the world’s biggest platforms. I’ve captured the process I go through to keep coming up with new work (now over 460 posts) in my book The Ultimate Guide to Infinite Ideas. You can get a free copy of the book by clicking here. ", "title": "How to Manage Your Time and Learn New Things Every Day", "sentences": [{"1f68": "How to Manage Your Time and Learn New Things Every Day"}, {"f8cc": "Here’s a hard truth:"}, {"96b9": "You have 24 hours."}, {"2b89": "No matter how many books you’ve written (or haven’t), no matter how big your dreams are (or aren’t), no matter how much “potential” you have (or don’t) — you have 24 hours."}, {"3c55": "Today’s 24 hours will move faster than yesterday’s. Tomorrow’s 24 hours will go faster still. I graduated college, went to sleep, and then woke up the next day to my 3 year anniversary with a company I swore I’d only be at for a few weeks."}, {"7fa8": "Now, I am afraid to blink."}, {"07a3": "And in the meantime, the world keeps changing. Nonstop! We are supposed to keep up with all the geniuses, the trends, the news. Who let that happen?"}, {"62db": "You are busy. I know that because you are alive on this planet in the fastest generation of humans ever."}, {"1f46": "But still, you have to stay ahead of the curve. You have to learn. You have to grow. And in the meantime, you have to stay sane."}, {"1d6c": "How do you do it?"}, {"cc57": "Here’s my strategy"}, {"46f1": "A) STOP BINGING ON PODCASTS"}, {"397a": "Many people I know are podcast-a-holics."}, {"fca3": "Podcasts make us feel smart. Culture dictates whoever listens to the most podcasts is the smartest."}, {"69cb": "“I listen on 2x speed,” someone once told me. “So I can get in more information.”"}, {"e847": "The question I didn’t asked, but should have, was this:"}, {"e732": "“Okay, so what do you remember from this morning?”"}, {"9690": "I used to be that guy. I was Podcast Todd, Genius. Then, I realized I hadn’t applied a single thing I listened to."}, {"2584": "Podcast Todd still shows up sometimes. But he trades out his shift to Thoughtful Todd, the guy who talks to his steering wheel about what he learned from the podcast that morning."}, {"834c": "(A lot of times, the answer was “Uhmmm,” so I cut that podcast)"}, {"459d": "B) SAY THESE MAGIC WORDS"}, {"4482": "“I love you, but I can’t give you my focus right now.”"}, {"826e": "This drawing by Larry Kim stopped me in my tracks the other day."}, {"94bc": "I thought I was pretty good at monotasking. Then one morning, I wrote 200 words of a blog post, went to check Twitter, answered some email, and then returned to the blog post. This cycle lasted a long time."}, {"ddc5": "My problem was this — everything I deemed “productive” fell under the same task. Website changes, research, writing, and making graphics for posts logically fell under the same big objective. But biologically, my brain wasted energy fighting off all kinds of attention residue jumping from thing to thing."}, {"981a": "Now I say “I love you, but I can’t give you my focus right now” to Twitter, Quora, phone calls, and text messages when I’m trying to tackle a new subject."}, {"ff22": "Learning is progress, even if it doesn’t feel like a priority. When I’m reading or researching, that’s ALL I do."}, {"d286": "C) ASK ONE PERSON ABOUT THEIR JOB EVERY DAY"}, {"e202": "It’s good being the dumbest person in the room."}, {"f69e": "When you are dumb, people tell you everything they know. Ask them to repeat it once. Write it down. Then talk to yourself about it on the way home."}, {"0d19": "People often ignore massive sources of knowledge all around them in the form of co-workers. Most of the time, I would rather have a deep conversation with a colleague than read the latest bestselling book because:"}, {"4bf5": "I dare you to learn as much from everyone around you as you possibly can first. Then feel free to read more books."}, {"60ff": "D) BE WILLING TO “THROW AWAY” TIME"}, {"b47b": "For 6 MONTHS I slaved away at my first animation project. I went back and forth to YouTube, looking for tutorials."}, {"908c": "This was misery."}, {"0a71": "At the end of that six months, I wiped the sweat off my brow, and pressed render on my first complete animated short — a brief video on meetings."}, {"13c8": "Do you know what happened next?"}, {"4476": "I threw that project directly in the recycling bin. Nobody ever laid eyes on it."}, {"5704": "Learning always comes at a cost, whether it’s time or money. This project didn’t cost me any money, but I sacrificed my time, one thing I will never get back."}, {"733b": "Please, understand one thing."}, {"9d0a": "If you wish to be more visible in the world, you will have to do a lot of INvisible work."}, {"77b1": "As a result of that 6 months, I now am able to animate at a decent level. I am able to cut my own videos instead of paying way too much for outsourcing."}, {"2336": "Learning sucks. It hurts. It will make you tired."}, {"8ed8": "Do it anyway. Here’s why:"}, {"5d8c": "Technology changes, with or without you. Business changes, with or without you. The world moves on, with or without you."}, {"1636": "The way I see it, you have two choices:"}, {"9263": "For More on Learning"}, {"609b": "Learning is a key staple to my workflow because it fuels my idea machine."}, {"be73": "Ideas have been the key to my work being seen by *millions* of people on the world’s biggest platforms. I’ve captured the process I go through to keep coming up with new work (now over 460 posts) in my book The Ultimate Guide to Infinite Ideas."}, {"d629": "You can get a free copy of the book by clicking here."}], "child": "651_1\t651_2\t651_3\t651_4\t651_5\t651_6\t651_7\t651_8\t651_9\t651_10\t651_11\t651_12\t651_13\t651_14\t651_15\t651_16\t651_17\t651_18\t651_19\t651_20\t651_21\t651_22\t651_23\t651_24\t651_25651_1\t651_2\t651_3\t651_4\t651_5\t651_6\t651_7\t651_8\t651_9\t651_10\t651_11\t651_12\t651_13\t651_14\t651_15\t651_16\t651_17\t651_18\t651_19\t651_20\t651_21\t651_22\t651_23\t651_24\t651_25651_1\t651_2\t651_3\t651_4\t651_5\t651_6\t651_7\t651_8\t651_9\t651_10\t651_11\t651_12\t651_13\t651_14\t651_15\t651_16\t651_17\t651_18\t651_19\t651_20\t651_21\t651_22\t651_23\t651_24\t651_25"}