{"name": "652", "parent": "", "content": "This Year I’m Aiming High I turn 27 today. Two days ago I wrote down on a slip of paper how much money I want to make a year. I placed it on my bedside table and read it when I wake up and when I go to sleep. It’s a big number, bigger than I’ve ever thought possible of making in my career. It’s a number big enough to payoff mine and my wife’s student loans. It’s a number big enough to help my parents retire early. It’s a number big enough to give me and my family the freedom to travel and experience the world around us. I’ve lived 27 years thinking a quarter of this number was out of reach. Not anymore. Not as my twenties are winding down. Not as my son continues to grow and inspire me every day. I’m done aiming for the bottom. I’m aiming high. Hi there, I’m Declan. In less than 2 months, I’m breaking free from my cubicle job and jumping into the world of self-employment. My goal is simple to say but hard to execute: Make $1,000 more than I did the previous month. Want to tag along for the ride? ", "title": "This Year I’m Aiming High", "sentences": [{"d0ff": "This Year I’m Aiming High"}, {"921f": "I turn 27 today."}, {"bfc3": "Two days ago I wrote down on a slip of paper how much money I want to make a year. I placed it on my bedside table and read it when I wake up and when I go to sleep."}, {"34df": "It’s a big number, bigger than I’ve ever thought possible of making in my career."}, {"cb50": "It’s a number big enough to payoff mine and my wife’s student loans."}, {"1480": "It’s a number big enough to help my parents retire early."}, {"2840": "It’s a number big enough to give me and my family the freedom to travel and experience the world around us."}, {"6185": "I’ve lived 27 years thinking a quarter of this number was out of reach."}, {"6753": "Not anymore. Not as my twenties are winding down. Not as my son continues to grow and inspire me every day."}, {"4f6b": "I’m done aiming for the bottom."}, {"a130": "I’m aiming high."}, {"f21a": "Hi there, I’m Declan. In less than 2 months, I’m breaking free from my cubicle job and jumping into the world of self-employment."}, {"e7f5": "My goal is simple to say but hard to execute: Make $1,000 more than I did the previous month."}, {"68bf": "Want to tag along for the ride?"}], "child": "652_1652_1"}