{"name": "653", "parent": "", "content": "The One Reason I’m OK Leaving My Job Without a Master Plan Here’s my current situation: I’m leaving my job and I don’t have everything figured out. I don’t hate my job, dislike my co-workers, or find my manager annoying. I enjoy what I do and work with pleasant folks. And my manager is my friend. So why am I doing it? Why would I disrupt a perfectly good situation for the stress and anxieties of being self-employed? Because I’m capable of adapting. When I get comfortable, I get bored My wife and I are totally different people than when we met 9 years ago. I read sad stories of relationships that came undone because the person they’re with now isn’t the person they fell in love with. They changed. In our relationship, change is the only constant. It’s actually encouraged. (It’s why we purposely had a kid at a young age.) We’ve learned we are quite good at adapting to new situations and challenges. In July, we are selling our stuff and downsizing into an even smaller apartment (again, we’re doing all this with a growing toddler). Why? We want something new. We want a challenge. We want to upset the status quo. And that’s what has brought me to this point, in June I leave a safe, secure, and relatively enjoyable job without any master plan. To me it’s the next logical move. My next experiment. I thrive when my situation changes and what greater way to push myself is there than diving head first into the world of self-employment? I can’t just show up to work and expect a paycheck every other week. I’ll have to adapt to the ever changing economy and fight for every dollar. I want an adventure, not a cubicle. Why are you afraid of change? I watched a movie recently with my wife called Midnight in Paris. It’s about this writer who wishes he could go back in time and live in the 1920’s when everything was better. One night he takes a stroll down the streets of Paris and as the clock strikes midnight an old car pulls up beside him. The passengers motion for him to climb inside, he does and is transported 90 years back in time where he meets to likes of Hemingway, Picasso, and Fitzgerald. He also meets a woman who wishes she lived in the 1890’s, back when everything was better. He couldn’t understand how someone from the 20’s would ever want to live in a different time period. When we fail to accept the present as an ongoing evolution, we deny our nature. When we live thinking the present will always be with us, we live a lie. When we long for the past, we stagnate. Why are you afraid of change in your life? Why are you you afraid of finding new challenges? Do you think you’re incapable of adapting? Do you think you won’t find happiness? Humans have been evolving for tens of thousands of years. We’re quite adept at it. Stop trying to encapsulate time. Stop trying to block out change. Welcome it, and enjoy the journey that follows. Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button: ", "title": "The One Reason I’m OK Leaving My Job Without a Master Plan", "sentences": [{"13ca": "The One Reason I’m OK Leaving My Job Without a Master Plan"}, {"2da1": "Here’s my current situation: I’m leaving my job and I don’t have everything figured out."}, {"e52f": "I don’t hate my job, dislike my co-workers, or find my manager annoying. I enjoy what I do and work with pleasant folks. And my manager is my friend."}, {"38e1": "So why am I doing it? Why would I disrupt a perfectly good situation for the stress and anxieties of being self-employed?"}, {"17a5": "Because I’m capable of adapting."}, {"f065": "When I get comfortable, I get bored"}, {"dba0": "My wife and I are totally different people than when we met 9 years ago."}, {"08ab": "I read sad stories of relationships that came undone because the person they’re with now isn’t the person they fell in love with. They changed."}, {"fa1e": "In our relationship, change is the only constant. It’s actually encouraged. (It’s why we purposely had a kid at a young age.)"}, {"16af": "We’ve learned we are quite good at adapting to new situations and challenges."}, {"b4f9": "In July, we are selling our stuff and downsizing into an even smaller apartment (again, we’re doing all this with a growing toddler). Why? We want something new. We want a challenge. We want to upset the status quo."}, {"a617": "And that’s what has brought me to this point, in June I leave a safe, secure, and relatively enjoyable job without any master plan."}, {"e510": "To me it’s the next logical move. My next experiment."}, {"3833": "I thrive when my situation changes and what greater way to push myself is there than diving head first into the world of self-employment?"}, {"36aa": "I can’t just show up to work and expect a paycheck every other week. I’ll have to adapt to the ever changing economy and fight for every dollar."}, {"b7d6": "I want an adventure, not a cubicle."}, {"d0d8": "Why are you afraid of change?"}, {"d338": "I watched a movie recently with my wife called Midnight in Paris. It’s about this writer who wishes he could go back in time and live in the 1920’s when everything was better."}, {"052b": "One night he takes a stroll down the streets of Paris and as the clock strikes midnight an old car pulls up beside him. The passengers motion for him to climb inside, he does and is transported 90 years back in time where he meets to likes of Hemingway, Picasso, and Fitzgerald."}, {"9279": "He also meets a woman who wishes she lived in the 1890’s, back when everything was better. He couldn’t understand how someone from the 20’s would ever want to live in a different time period."}, {"c32b": "When we fail to accept the present as an ongoing evolution, we deny our nature. When we live thinking the present will always be with us, we live a lie. When we long for the past, we stagnate."}, {"c8a0": "Why are you afraid of change in your life? Why are you you afraid of finding new challenges?"}, {"8317": "Do you think you’re incapable of adapting? Do you think you won’t find happiness?"}, {"9c8d": "Humans have been evolving for tens of thousands of years. We’re quite adept at it."}, {"977d": "Stop trying to encapsulate time. Stop trying to block out change."}, {"0ea9": "Welcome it, and enjoy the journey that follows."}, {"0a16": "Hey there I’m Declan! I’m going through a major life transition right now and would be stoked if you tagged along. And yes, there is free stuff waiting for you on the other side of this button:"}], "child": "653_1653_1"}