{"name": "654", "parent": "", "content": "Ikhtilaf — Of Conflict, Resistance, Opposition and Trolls A Sufi Celebration of Life, Inspired By Urdu Previous Article : Hairat — The Wonder of the Sense of Wonder Agarche Tujh Se Bahut Iḳhtilaf Bhi Na Hua Magar Ye Dil Teri Janib Se Saaf Bhi Na Hua — Parveen Shakir It is true there was never great opposition between us But my dislike for you never really waned Honestly, ‘I’ was a tough one for me, not because there are no Urdu words starting with ‘I’ but because there are way too many — all great, beautiful, wonderful words with infinite potential. Izzat (Respect/Honor), Ijazat (Permission), Ikhtiyaar(Faith), Ilm (Realization)….the list is endless. I, however, settled for Ikhtilaf, perhaps it is so volatile, so relevant to our times and just so essential. Ikhtilaf. Literally translated, it means opposition or resistance or disagreement. The word has Arabic roots and Wikipedia tells me that it also means Islamic scholarly religious disagreement. Wikipedia also tells me that according to Islam, when there is a scholarly disagreement or Ikhtilaf on a certain issue, it is impermissible to condemn a person who follows a position that is different from one’s own. But that is just some information off Wikipedia. I am pretty sure there are layers and layers to that idea as philosophical/religious discourse, something that I am neither aware of, nor am equipped to comment upon. What I know about Ikhtilaf is mostly from the way it has been used in Urdu poetry. This whole Islamic scholarly angle was something I discovered only when I was researching for this piece and it as new to me as it would be to some of our readers. I am, hence, not going to dwell on the religious aspect of the word. However, even shroud of the religious context, the thought behind this idea is beautiful and worth emulating. We should not condemn someone just because they disagree with our worldview on certain issues or have taken a stand contrary to us. It should be obvious. And it would be a pity if we need the crutch of religion and fear of a retributive, metaphorical stick wielding God to imbibe and apply something as basic as this. Unfortunately, we do need that crutch. And even then, Ikhtilaf continues to be something that most of us find hard to digest and deal with — where ‘us’ is not just the annoying Uncle in the neighborhood who believes his genetic code is God’s own creation while everyone else was created out of dog-poop and rotten cabbages; but also Nations and sects and caste-groups and races and skinheads who all seem to share the same slow moving, super dumb, know it all collective consciousness that makes no way for Ikhtilaf in any form, format or version. Daleel Thi Na Koi Hawala Tha Unke Paas Ajeeb Log The Bus Ikhtilaaf Rakhte The They neither had ground nor reasons Some weird people they were, who still opposed us In the age of all pervasive social-media, where trolling is a full time job and where a balanced, meaningful discourse is a long forgotten concept, Ikhtilaf in the sense of ‘agreeing to disagree’ has no place. People don’t hold Ikhtilaf against each other anymore, because Ikhtilaf was meant to be a disagreement, scholarly or otherwise, or even resistance in some cases; it was not meant to be a thoughtless strike against anything that was even remotely contrary to our stance on any issue. Ikhtilaf implies listening and thinking and considering. Things that most of us are slowly forgetting to do. Ikhtilaf, in essence, is the idea that seeks to make a difference; it is the changemaker — a breeding ground of healthy debate and discussion and free thoughts and opinions. It is an acceptance of the fact that no systems, political or social or cultural are perfect; neither are individuals irrespective of who or what they are. Everything and everyone is a reasonable mixture of good and bad; right and wrong; things that work and things that don’t. To believe that your ideology or political belief or leader can do no wrong is a thought process that is toxic to all growth. It is a wound that festers in systems and ideas, until they are incurable cancerous sores — rotting our societies from within. There is a reason why a good opposition is a must for a healthy democracy. And there is a reason why so many of the democracies all over the world are seemingly and obviously going to dogs. Not just political systems, intolerance of Ikhtilaf is the root of multiple evils even in more intimate social and familiar structures. After all, all patriarchy is founded on intolerance of Ikhtilaf against established authority structures and imposed behavioral codes. Whether it is about larger systemic oppression like keeping women confined to a secondary, dependent status; or something smaller, more intimate but equally damaging like expecting sons (and daughters) to defer to a patriarchal authority's decision about crucial life decisions, suppressing Ikhtilaf is at the core of all things that lead to an endless vicious cycles of literal and metaphorical violence generation after generation. In fact, suppressing Ikhtilaf is patriarchy’s life goal because Ikhtilaf promotes virtues like reasoning and questioning; and threatens meaningless entitlements and pointless authority, in effect channelizing the inherent violence in these structures towards a more productive course. Ultimately, Ikhtilaf is the outlet we need to contain our intolerance and violence and all the darkness that seems to reside within all of us. Ikhtilaf is the resistance which is a must to keep a free world together; a world where people with different thoughts and choices can co-exist in harmony. It is our gateway to Utopia, and of course a troll free world. If only we learn to respect each other’s Ikhtilaf. Sirf Hungama Khada Karna Mera Maksad Nahi Meri Koshish Hai Ki Ye Surat Badalni Chahiye — Dushyant Kumar Creating mayhem is not my purpose or intent It is my attempt that things should change for the better Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon! ", "title": "Ikhtilaf — Of Conflict, Resistance, Opposition and Trolls", "sentences": [{"2aa6": "Ikhtilaf — Of Conflict, Resistance, Opposition and Trolls"}, {"774f": "A Sufi Celebration of Life, Inspired By Urdu"}, {"79b8": "Previous Article : Hairat — The Wonder of the Sense of Wonder"}, {"6898": "Agarche Tujh Se Bahut Iḳhtilaf Bhi Na Hua"}, {"9e5a": "Magar Ye Dil Teri Janib Se Saaf Bhi Na Hua"}, {"c0b7": "— Parveen Shakir"}, {"98fd": "It is true there was never great opposition between us"}, {"e9b5": "But my dislike for you never really waned"}, {"977a": "Honestly, ‘I’ was a tough one for me, not because there are no Urdu words starting with ‘I’ but because there are way too many — all great, beautiful, wonderful words with infinite potential."}, {"afb7": "Izzat (Respect/Honor), Ijazat (Permission), Ikhtiyaar(Faith), Ilm (Realization)….the list is endless."}, {"96e2": "I, however, settled for Ikhtilaf, perhaps it is so volatile, so relevant to our times and just so essential."}, {"2a36": "Ikhtilaf."}, {"3cf8": "Literally translated, it means opposition or resistance or disagreement. The word has Arabic roots and Wikipedia tells me that it also means Islamic scholarly religious disagreement."}, {"f5d0": "Wikipedia also tells me that according to Islam, when there is a scholarly disagreement or Ikhtilaf on a certain issue, it is impermissible to condemn a person who follows a position that is different from one’s own."}, {"13c8": "But that is just some information off Wikipedia. I am pretty sure there are layers and layers to that idea as philosophical/religious discourse, something that I am neither aware of, nor am equipped to comment upon. What I know about Ikhtilaf is mostly from the way it has been used in Urdu poetry. This whole Islamic scholarly angle was something I discovered only when I was researching for this piece and it as new to me as it would be to some of our readers."}, {"155d": "I am, hence, not going to dwell on the religious aspect of the word. However, even shroud of the religious context, the thought behind this idea is beautiful and worth emulating."}, {"402a": "We should not condemn someone just because they disagree with our worldview on certain issues or have taken a stand contrary to us."}, {"152d": "It should be obvious. And it would be a pity if we need the crutch of religion and fear of a retributive, metaphorical stick wielding God to imbibe and apply something as basic as this."}, {"0a5f": "Unfortunately, we do need that crutch. And even then, Ikhtilaf continues to be something that most of us find hard to digest and deal with — where ‘us’ is not just the annoying Uncle in the neighborhood who believes his genetic code is God’s own creation while everyone else was created out of dog-poop and rotten cabbages; but also Nations and sects and caste-groups and races and skinheads who all seem to share the same slow moving, super dumb, know it all collective consciousness that makes no way for Ikhtilaf in any form, format or version."}, {"e995": "Daleel Thi Na Koi Hawala Tha Unke Paas"}, {"8d6d": "Ajeeb Log The Bus Ikhtilaaf Rakhte The"}, {"72e2": "They neither had ground nor reasons"}, {"9127": "Some weird people they were, who still opposed us"}, {"decd": "In the age of all pervasive social-media, where trolling is a full time job and where a balanced, meaningful discourse is a long forgotten concept, Ikhtilaf in the sense of ‘agreeing to disagree’ has no place. People don’t hold Ikhtilaf against each other anymore, because Ikhtilaf was meant to be a disagreement, scholarly or otherwise, or even resistance in some cases; it was not meant to be a thoughtless strike against anything that was even remotely contrary to our stance on any issue."}, {"c471": "Ikhtilaf implies listening and thinking and considering. Things that most of us are slowly forgetting to do."}, {"6002": "Ikhtilaf, in essence, is the idea that seeks to make a difference; it is the changemaker — a breeding ground of healthy debate and discussion and free thoughts and opinions. It is an acceptance of the fact that no systems, political or social or cultural are perfect; neither are individuals irrespective of who or what they are. Everything and everyone is a reasonable mixture of good and bad; right and wrong; things that work and things that don’t. To believe that your ideology or political belief or leader can do no wrong is a thought process that is toxic to all growth. It is a wound that festers in systems and ideas, until they are incurable cancerous sores — rotting our societies from within."}, {"4974": "There is a reason why a good opposition is a must for a healthy democracy. And there is a reason why so many of the democracies all over the world are seemingly and obviously going to dogs."}, {"e2c2": "Not just political systems, intolerance of Ikhtilaf is the root of multiple evils even in more intimate social and familiar structures. After all, all patriarchy is founded on intolerance of Ikhtilaf against established authority structures and imposed behavioral codes. Whether it is about larger systemic oppression like keeping women confined to a secondary, dependent status; or something smaller, more intimate but equally damaging like expecting sons (and daughters) to defer to a patriarchal authority's decision about crucial life decisions, suppressing Ikhtilaf is at the core of all things that lead to an endless vicious cycles of literal and metaphorical violence generation after generation. In fact, suppressing Ikhtilaf is patriarchy’s life goal because Ikhtilaf promotes virtues like reasoning and questioning; and threatens meaningless entitlements and pointless authority, in effect channelizing the inherent violence in these structures towards a more productive course."}, {"d0e7": "Ultimately, Ikhtilaf is the outlet we need to contain our intolerance and violence and all the darkness that seems to reside within all of us. Ikhtilaf is the resistance which is a must to keep a free world together; a world where people with different thoughts and choices can co-exist in harmony. It is our gateway to Utopia, and of course a troll free world."}, {"2899": "If only we learn to respect each other’s Ikhtilaf."}, {"79c4": "Sirf Hungama Khada Karna Mera Maksad Nahi"}, {"a3fe": "Meri Koshish Hai Ki Ye Surat Badalni Chahiye"}, {"76cb": "— Dushyant Kumar"}, {"1111": "Creating mayhem is not my purpose or intent"}, {"02d7": "It is my attempt that things should change for the better"}, {"c849": "Hey Guys! If you enjoyed reading this piece, please don’t forget to click on the little green ❤ below! Also, I am trying out this new newsletter thingie. You can sign up for my latest pieces and/or the ebook that may be coming very soon!"}], "child": "654_1\t654_2\t654_3\t654_4"}