{"name": "655", "parent": "", "content": "You Can Change Your Story Humans are meant to weather all seasons — some of abundance, and others of scarcity. We often learn who we are by trying on the shoes of someone we’re not. We tend to find out what we want by finding ourselves surrounded by everything we don’t want. As we know better, we do better — shedding old versions of ourselves like snakes shedding their skin. Mistakes are pathways to self-awareness — we, as humans, tend to make a lot of them. There will be times when you end up knee deep in a story that you’re not proud of, but you cannot be happy with the person you are today if you are ashamed of the lessons it took for to become so. You literally could not have learned and grown without the experiences that have shaped you. That said, it doesn’t mean that you have to hold onto your story for the rest of your life and play out the same character day in and day out. You have every right to change your story; in fact, you have the responsibility to do so if its ending is no longer serving you. Don’t get me wrong, it can be truly convenient staying stuck in your pain. There’s a comfort to your chaos. You know the ins and outs of this feeling because you’ve been festering in it for so long. You know that if you stay stuck in that story, you’ll never win, it will never feel okay — but at least you know. You will never get that ex-boyfriend back or fix that friendship, hence there’s nothing new or scary about it. So you hold onto the dead in order to avoid facing the living. Because what’s already gone can’t leave you again. What’s even scarier than loving ghosts? Choosing not to identify with your pain, and instead, marching towards the unknown. Isn’t the root of all human fears the fear of the unknown, anyway? Sure, if you try something new you might fail — but if you don’t try, you already have. Where’s the logic in staying stuck? So how do you do it? Well, you can’t pretend the suffering didn’t occur, but you can change your relationship to it. So you focus on the ending. When you change the ending of your story, your pain becomes your wisdom and your mistakes serve as your lessons. You have to surrender to the shame of whatever choices you made or personas you undertook. You have to forgive yourself for not knowing what you know now, and for not acting out of your own best interests. Instead of holding onto your pain, you can choose to take responsibility for your part in it and let it go. Instead of acting from your wounds, you can choose to heal them and move forward. Stop blaming your parents for what they did or didn’t do to you. That’s not saying they don’t deserve it, but blaming other people only keeps you victimized by them. When you release blame, you free yourself to make different choices from those who raised you. You use the awareness of your childhood to explain why there were missing pieces, but you also use it as a pathway to fill the whole puzzle. You also have to know that you deserve the story you want to tell. You have to feel worthy of no longer needing to carry around your wounds, and no longer letting them tarnish everything and everyone they touch. When you let yourself want more, you come to understand all the ways in which you settled for less. And that’s hard to face, but a crucial step if you want to overcome it. When you’re in a hurricane season of your life, you tend to cling onto people who spin just as destructively as you do. Because most healthy people don’t want to open their doors to an active hurricane – they have too much to lose to collateral damage. That said, when you decide to change your story and move on from self-destructive behaviour, you run the risk of losing loved ones whom you forged strong bonds of mutual suffering with. Despite the fact that you may feel you owe these people for the empathy and safe haven they’ve provided you, you can only carry them forward if they’ve also changed their stories. Everyone has the right to whatever chaos they breed in their life. Along the same vein, everyone also has the right not to be in the middle of a storm. You can’t stand next to a torrential downpour and complain that you’re getting wet. When you rid yourself of the role you’ve been playing, you risk losing a lot of key players that were deeply embedded into your old narrative. This is normal, and although it can be difficult, it’s a sacrifice that’s often necessary to make in order to move on. You can change your story or you can choose to be victimized by it and let it define you. It’s your choice. Taking responsibility for your life isn’t easy, but nothing good ever is. That doesn’t mean it won’t be worth it, and that it won’t offer you profound wisdom and joy once you’ve reached the other side. You have every right to move on. You have the right to heal and be happy. You have the right to choose healthier people and create better outcomes. You have the right to avoid toxic behaviour and redirect your anxieties. You have the right to be at peace with the past and still show up to your present. Don’t ever feel bad for moving on or letting go — life only gets complicated when you get too consumed with loving ghosts. Shannon Leigh is an insatiably curious cat who loves to draw words and write pictures. You can find more of her writing at The Goddess Rebellion or explore all of her hand lettering and other endeavours here. Shannon’s new articles are posted weekly for The Leading so check back soon! If you relate to the contents of this article, please share a little love for the post! ❤ ", "title": "You Can Change Your Story", "sentences": [{"f1a3": "You Can Change Your Story"}, {"e195": "Humans are meant to weather all seasons — some of abundance, and others of scarcity. We often learn who we are by trying on the shoes of someone we’re not. We tend to find out what we want by finding ourselves surrounded by everything we don’t want. As we know better, we do better — shedding old versions of ourselves like snakes shedding their skin. Mistakes are pathways to self-awareness — we, as humans, tend to make a lot of them."}, {"bd8d": "There will be times when you end up knee deep in a story that you’re not proud of, but you cannot be happy with the person you are today if you are ashamed of the lessons it took for to become so. You literally could not have learned and grown without the experiences that have shaped you."}, {"59a2": "That said, it doesn’t mean that you have to hold onto your story for the rest of your life and play out the same character day in and day out. You have every right to change your story; in fact, you have the responsibility to do so if its ending is no longer serving you."}, {"5c63": "Don’t get me wrong, it can be truly convenient staying stuck in your pain. There’s a comfort to your chaos. You know the ins and outs of this feeling because you’ve been festering in it for so long. You know that if you stay stuck in that story, you’ll never win, it will never feel okay — but at least you know."}, {"d7a6": "You will never get that ex-boyfriend back or fix that friendship, hence there’s nothing new or scary about it. So you hold onto the dead in order to avoid facing the living. Because what’s already gone can’t leave you again."}, {"2021": "What’s even scarier than loving ghosts? Choosing not to identify with your pain, and instead, marching towards the unknown. Isn’t the root of all human fears the fear of the unknown, anyway? Sure, if you try something new you might fail — but if you don’t try, you already have. Where’s the logic in staying stuck?"}, {"9209": "So how do you do it?"}, {"1a40": "Well, you can’t pretend the suffering didn’t occur, but you can change your relationship to it. So you focus on the ending. When you change the ending of your story, your pain becomes your wisdom and your mistakes serve as your lessons."}, {"5ede": "You have to surrender to the shame of whatever choices you made or personas you undertook. You have to forgive yourself for not knowing what you know now, and for not acting out of your own best interests."}, {"132e": "Instead of holding onto your pain, you can choose to take responsibility for your part in it and let it go. Instead of acting from your wounds, you can choose to heal them and move forward."}, {"6ec1": "Stop blaming your parents for what they did or didn’t do to you. That’s not saying they don’t deserve it, but blaming other people only keeps you victimized by them. When you release blame, you free yourself to make different choices from those who raised you. You use the awareness of your childhood to explain why there were missing pieces, but you also use it as a pathway to fill the whole puzzle."}, {"7436": "You also have to know that you deserve the story you want to tell. You have to feel worthy of no longer needing to carry around your wounds, and no longer letting them tarnish everything and everyone they touch. When you let yourself want more, you come to understand all the ways in which you settled for less. And that’s hard to face, but a crucial step if you want to overcome it."}, {"c4f5": "When you’re in a hurricane season of your life, you tend to cling onto people who spin just as destructively as you do. Because most healthy people don’t want to open their doors to an active hurricane – they have too much to lose to collateral damage."}, {"e051": "That said, when you decide to change your story and move on from self-destructive behaviour, you run the risk of losing loved ones whom you forged strong bonds of mutual suffering with. Despite the fact that you may feel you owe these people for the empathy and safe haven they’ve provided you, you can only carry them forward if they’ve also changed their stories."}, {"e8d4": "Everyone has the right to whatever chaos they breed in their life. Along the same vein, everyone also has the right not to be in the middle of a storm. You can’t stand next to a torrential downpour and complain that you’re getting wet."}, {"4c18": "When you rid yourself of the role you’ve been playing, you risk losing a lot of key players that were deeply embedded into your old narrative. This is normal, and although it can be difficult, it’s a sacrifice that’s often necessary to make in order to move on."}, {"aeaf": "You can change your story or you can choose to be victimized by it and let it define you. It’s your choice. Taking responsibility for your life isn’t easy, but nothing good ever is. That doesn’t mean it won’t be worth it, and that it won’t offer you profound wisdom and joy once you’ve reached the other side."}, {"5c7a": "You have every right to move on."}, {"313d": "You have the right to heal and be happy. You have the right to choose healthier people and create better outcomes. You have the right to avoid toxic behaviour and redirect your anxieties. You have the right to be at peace with the past and still show up to your present."}, {"071b": "Don’t ever feel bad for moving on or letting go — life only gets complicated when you get too consumed with loving ghosts."}, {"048c": "Shannon Leigh is an insatiably curious cat who loves to draw words and write pictures. You can find more of her writing at The Goddess Rebellion or explore all of her hand lettering and other endeavours here. Shannon’s new articles are posted weekly for The Leading so check back soon! If you relate to the contents of this article, please share a little love for the post! ❤"}], "child": "655_1655_1"}