{"name": "657", "parent": "", "content": "Growing Up In Portugal — Teen years Growing up in Portugal was a mixed bag. As a small child, I had no worries, lots of animal friends, lovely days at the Estoril beach with my Mother. On the Estoril beach. Photo by Louise Peacock As I grew older I began to notice other stuff. Such as, I was not allowed to attend a regular school because my Father had reservations about the local Catholic school and could not afford the ritzy English school. To ensure that I had some sort of basic education, first my poor Mother was enlisted as a teacher, followed later by numerous University students who acted as tutors. As I grew older and began to notice boys, I began to dislike my home life a lot. My Father was very controlling and had a lot of restrictive ideas about how much freedom a teen kid should have. Pretty much zip. He absolutely did not like me associating with the “peasant” kids in the area, since he said they were uneducated, unsophisticated louts and nothing good would come of friendships with them. Local kids. My dad said they were “no good” Photo by Emrina Cagill My father stayed up late at night and stayed in bed until noon or after. I took full advantage of this to “associate” with the local louts! There was one boy in particular that I was good friends with, and we would hang out over the wall and chat for hours. We would also hold hands. As soon as sounds of my Father approaching would occur we would split. He down the road to his home, and I off to some overgrown place in the garden. My Mother of course knew all about this, but didn’t see any harm in it, so kept it from my Father. We would also hold hands. Photo by Toa Heftiba I continued to be involved with our wealthy neighbours’ daughter, Anna Maria, at the request of her mother, so had fewer opportunities to hob nob with the “hoi poloi”, as my Father described the village kids. (Hoi Polloi comes from Greek and means variously: the masses, the common people, the poor people.) My parents had always dragged me to any “grown up” events they were attending, ever since I was able to walk. Now that I was an awkward teen, with arms and legs perpetually growing out of my clothes, they still made me go. At some of these events, I got to meet some devastatingly attractive young navel officers visiting on an aircraft carrier, and one killer older guy, a magician. Naturally I had crushes on all of them. I was an awkward teen. This was opening night for some fancy sculptress. Photo by Magda Russell A visit to U.S. warship. Photo by Louise Peacock. I was actually allowed to go on a date with one of the young Naval guys, dinner and dancing. Home by 10pm. That was fun. He was so old-world charming to the shy, awkward kid that was me. I also went on a parental arranged date with the sexy Magician. I have a sneaky feeling my Dad was hoping this guy would “teach” me the ropes, as it were. It was very embarrassing once I figured it out. The sexy Magician guy basically let the cat out of the bag, telling me I was very sweet and young and that he felt he was too old and hoped my Father would understand. I pined over him for ages after he left for the U.S. but we never heard from him again. I kept up a nice letter-friendship with the young naval officer until he got engaged to a pretty redhead. When I accompanied Anna Maria to the beach, the swimming pool or shopping, we would run into boys and girls in the same age group, school mates of hers. They laughed at me behind my back. Photo by Ben White. They all looked at me as if I was dead seaweed, but put up with me because of Anna Maria. I know they laughed at me behind my back because of the ratty clothes and shoes I wore, and because they knew I was really a chaperone for Anna Maria, rather than an equal. Anna Maria however was always sweet to me. I met a few young people that were okay to me and we remained friends until I left Portugal a few years later. One of these was a beautiful young man called Florindo. He was just 16 when I met him and his favourite pastime was knitting. At the time I didn’t think that at all odd, but wondered why other boys giggled behind his back. This could have been Florindo. Photo by Christopher Campbell. Florindo knitted beautiful, thick sweaters without using a pattern, and created lovely designs. He favoured bold primary colours. One of his sweaters that I remember was black, white, cobalt blue and red with interesting large geometric patters. His Mother was very proud of him. They lived in a pretty white house in Sao Joao D’Estoril, which was about a 20 minute walk from our house. An attempt to recreate Florindo’s sweater. He would probably kill me if he ever saw this. Artwork by Louise Peacock. I should have guessed why my parents had no problems with me hanging with Florindo. They felt I was quite safe with him and had no qualms with us going to Estoril and Cascais together. Once in a while we got on the train, and went to Lisbon. We would go to wool shops to find new, interesting wool colours for his next project. Florindo was a nice, gentle person, I always wondered what happened to him, and of course I can’t remember his last name. Around this time I was taking guitar and music theory lessons with an excellent musician, virtuoso pianist, composer and future orchestra leader called Natercia Couto. Natercia Couto (1924–1999) Such joy to hear her play the piano. I remember her stunning renditions of various pieces by Brazilian composter Heitor Villa-Lobos. Natercia had the lightest, most fluid touch on the piano I have hear heard. Such a talent. R.I.P. Natercia, it was an honour to have known you. I wish I could have learned music theory as you hoped I would. I wish I could have told you what an impression you made on me. Natercia was WAY over my abilities in the music department, but had offered to give me music lessons as partial repayment for my Father helping her to reach her goal of guest directing the Lisbon Philharmonic orchestra. She was patient, but I was hopeless, so that didn’t last too long. However as a result of my Father badgering Ivo Cruz (1901–1985) the then director of the Lisbon Philharmonic Orchestra to allow Natercia to direct as a guest so as to establish some credentials, we ended up socializing with Maestro Ivo Cruz and his family. He had two sons, both nice kids around my age, one was a musical genius — Manuel Ivo Soares Cardoso Cruz ( 1935 — 2010), the other was a sweet boy who had a cleft pallet and had a lot of trouble making himself understood. The three of us spent a lot of time together while the elders talked. I tried to figure out a way for the problem son to communicate and we actually made some progress. Unfortunately, he was flattered by having a girl paying attention to him and became infatuated with me and I had to back off. Another one that I wonder whatever became of him. My Father was constantly telling me that I needed to marry a rich man. He said that getting married was my only option since I was too homely to become movie star. (This appeared to be my only career option — movie star). He would joke that this would ensure his being able to live comfortably in his old age. I wasn’t too interested. In order to move things along, my Father decided to parade a bunch of elderly, titled rich guys past my Mother and I. He would invite them over for one of my Mother’s English teas and then at some point would contrive to leave me and grandpa alone! Scones with clotted cream, yummmmm! Photo by Louise Peacock Sadly for my Father, this ploy failed every time. I was completely repelled by all of them. She never said as much, but I don’t think my Mother was too pleased with these attempts to find me a rich husband. Truth be told, I am not sure these old guys were too attracted to me. I was a tomboy and showed few signs of being the nice young lady my Father had portrayed to them. I was almost 21 and as a result of the search for a rich husband, I began my own search to thwart my Father. Photo by Kava. — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — If you enjoyed this piece, please click on the green heart to the left and below the article. That will make me very happy, and I may dance and laugh. This is me, dancing and laughing. ", "title": "Growing Up In Portugal — Teen years", "sentences": [{"730f": "Growing Up In Portugal — Teen years"}, {"f148": "Growing up in Portugal was a mixed bag."}, {"61ca": "As a small child, I had no worries, lots of animal friends, lovely days at the Estoril beach with my Mother."}, {"cb33": "On the Estoril beach. Photo by Louise Peacock"}, {"7fef": "As I grew older I began to notice other stuff. Such as, I was not allowed to attend a regular school because my Father had reservations about the local Catholic school and could not afford the ritzy English school. To ensure that I had some sort of basic education, first my poor Mother was enlisted as a teacher, followed later by numerous University students who acted as tutors."}, {"c5c2": "As I grew older and began to notice boys, I began to dislike my home life a lot. My Father was very controlling and had a lot of restrictive ideas about how much freedom a teen kid should have. Pretty much zip."}, {"3714": "He absolutely did not like me associating with the “peasant” kids in the area, since he said they were uneducated, unsophisticated louts and nothing good would come of friendships with them."}, {"1434": "Local kids. My dad said they were “no good” Photo by Emrina Cagill"}, {"8647": "My father stayed up late at night and stayed in bed until noon or after. I took full advantage of this to “associate” with the local louts!"}, {"3660": "There was one boy in particular that I was good friends with, and we would hang out over the wall and chat for hours. We would also hold hands. As soon as sounds of my Father approaching would occur we would split. He down the road to his home, and I off to some overgrown place in the garden. My Mother of course knew all about this, but didn’t see any harm in it, so kept it from my Father."}, {"cf92": "We would also hold hands. Photo by Toa Heftiba"}, {"d218": "I continued to be involved with our wealthy neighbours’ daughter, Anna Maria, at the request of her mother, so had fewer opportunities to hob nob with the “hoi poloi”, as my Father described the village kids. (Hoi Polloi comes from Greek and means variously: the masses, the common people, the poor people.)"}, {"a0d3": "My parents had always dragged me to any “grown up” events they were attending, ever since I was able to walk. Now that I was an awkward teen, with arms and legs perpetually growing out of my clothes, they still made me go. At some of these events, I got to meet some devastatingly attractive young navel officers visiting on an aircraft carrier, and one killer older guy, a magician. Naturally I had crushes on all of them."}, {"0755": "I was an awkward teen. This was opening night for some fancy sculptress. Photo by Magda Russell"}, {"0adb": "A visit to U.S. warship. Photo by Louise Peacock."}, {"45e4": "I was actually allowed to go on a date with one of the young Naval guys, dinner and dancing. Home by 10pm. That was fun. He was so old-world charming to the shy, awkward kid that was me."}, {"9903": "I also went on a parental arranged date with the sexy Magician. I have a sneaky feeling my Dad was hoping this guy would “teach” me the ropes, as it were. It was very embarrassing once I figured it out. The sexy Magician guy basically let the cat out of the bag, telling me I was very sweet and young and that he felt he was too old and hoped my Father would understand."}, {"d7d1": "I pined over him for ages after he left for the U.S. but we never heard from him again. I kept up a nice letter-friendship with the young naval officer until he got engaged to a pretty redhead."}, {"eac4": "When I accompanied Anna Maria to the beach, the swimming pool or shopping, we would run into boys and girls in the same age group, school mates of hers."}, {"9554": "They laughed at me behind my back. Photo by Ben White."}, {"df84": "They all looked at me as if I was dead seaweed, but put up with me because of Anna Maria. I know they laughed at me behind my back because of the ratty clothes and shoes I wore, and because they knew I was really a chaperone for Anna Maria, rather than an equal. Anna Maria however was always sweet to me. I met a few young people that were okay to me and we remained friends until I left Portugal a few years later."}, {"59b9": "One of these was a beautiful young man called Florindo. He was just 16 when I met him and his favourite pastime was knitting. At the time I didn’t think that at all odd, but wondered why other boys giggled behind his back."}, {"8e7e": "This could have been Florindo. Photo by Christopher Campbell."}, {"4745": "Florindo knitted beautiful, thick sweaters without using a pattern, and created lovely designs. He favoured bold primary colours. One of his sweaters that I remember was black, white, cobalt blue and red with interesting large geometric patters. His Mother was very proud of him. They lived in a pretty white house in Sao Joao D’Estoril, which was about a 20 minute walk from our house."}, {"8623": "An attempt to recreate Florindo’s sweater. He would probably kill me if he ever saw this. Artwork by Louise Peacock."}, {"50c7": "I should have guessed why my parents had no problems with me hanging with Florindo. They felt I was quite safe with him and had no qualms with us going to Estoril and Cascais together. Once in a while we got on the train, and went to Lisbon. We would go to wool shops to find new, interesting wool colours for his next project. Florindo was a nice, gentle person, I always wondered what happened to him, and of course I can’t remember his last name."}, {"3411": "Around this time I was taking guitar and music theory lessons with an excellent musician, virtuoso pianist, composer and future orchestra leader called Natercia Couto."}, {"e412": "Natercia Couto (1924–1999)"}, {"7a73": "Such joy to hear her play the piano. I remember her stunning renditions of various pieces by Brazilian composter Heitor Villa-Lobos. Natercia had the lightest, most fluid touch on the piano I have hear heard. Such a talent. R.I.P. Natercia, it was an honour to have known you. I wish I could have learned music theory as you hoped I would. I wish I could have told you what an impression you made on me."}, {"9627": "Natercia was WAY over my abilities in the music department, but had offered to give me music lessons as partial repayment for my Father helping her to reach her goal of guest directing the Lisbon Philharmonic orchestra. She was patient, but I was hopeless, so that didn’t last too long. However as a result of my Father badgering Ivo Cruz (1901–1985) the then director of the Lisbon Philharmonic Orchestra to allow Natercia to direct as a guest so as to establish some credentials, we ended up socializing with Maestro Ivo Cruz and his family."}, {"89e8": "He had two sons, both nice kids around my age, one was a musical genius — Manuel Ivo Soares Cardoso Cruz ( 1935 — 2010), the other was a sweet boy who had a cleft pallet and had a lot of trouble making himself understood. The three of us spent a lot of time together while the elders talked. I tried to figure out a way for the problem son to communicate and we actually made some progress. Unfortunately, he was flattered by having a girl paying attention to him and became infatuated with me and I had to back off. Another one that I wonder whatever became of him."}, {"0a84": "My Father was constantly telling me that I needed to marry a rich man. He said that getting married was my only option since I was too homely to become movie star. (This appeared to be my only career option — movie star). He would joke that this would ensure his being able to live comfortably in his old age. I wasn’t too interested. In order to move things along, my Father decided to parade a bunch of elderly, titled rich guys past my Mother and I. He would invite them over for one of my Mother’s English teas and then at some point would contrive to leave me and grandpa alone!"}, {"aae5": "Scones with clotted cream, yummmmm! Photo by Louise Peacock"}, {"6b8c": "Sadly for my Father, this ploy failed every time. I was completely repelled by all of them. She never said as much, but I don’t think my Mother was too pleased with these attempts to find me a rich husband. Truth be told, I am not sure these old guys were too attracted to me. I was a tomboy and showed few signs of being the nice young lady my Father had portrayed to them."}, {"4c83": "I was almost 21 and as a result of the search for a rich husband, I began my own search to thwart my Father."}, {"8324": "Photo by Kava."}, {"9e94": "— — — — — — — — — — — — — — — — — — — — — — — — — — — — — —"}, {"975b": "If you enjoyed this piece, please click on the green heart to the left and below the article. That will make me very happy, and I may dance and laugh."}, {"940e": "This is me, dancing and laughing."}], "child": "657_1\t657_2\t657_3\t657_4\t657_5"}