{"sentences": [{"422e": "How my side project satisfied my curiosity — and made me $3,000"}, {"716f": "I was curious what books were most commonly recommended on Stack Overflow. So I analyzed a database dump, counted the mentions, then built a website for exploring the data. (You can read about this entire process step-by-step here.)"}, {"648f": "On February 1st I launched dev-books.com. Over the next few days, the website got more than 100,000 visits."}, {"23ec": "Many of these visitors got in touch with me with questions regarding my profit from this project. So — as promised — I’m publishing this full report from Google Analytics and Amazon, along with my story. :)"}, {"d836": "How this website makes money"}, {"96c8": "For this project, I chose the Amazon Affiliate Program, since Amazon is the biggest book store I know of. Account registration was pretty straight forward, so I received my affiliate tag to use in links on my website in less than an hour."}, {"7a8c": "Cold start"}, {"c1dc": "After everything was up and running, I’ve posted link to dev-books.com on Hacker News and Reddit, trying to attract some developers’ attention to my project."}, {"7c01": "Unfortunately, it didn’t bring in the wide audience I was hoping for. But I started to get some feedback, fixed some bugs, and got suggestions on how to promote my project."}, {"dc5f": "At the end of the day, I received message from freeCodeCamp teacher Quincy Larson suggesting I write a story about my project and how I built it, to make it more accessible to people."}, {"851f": "The Breakthrough"}, {"23b5": "Reading this article by Quincy Larson, I found a very useful tool for making the headline called Headline Analyzer. I tried the headline I used for my posts, and got quite low rating, so I started to make a better headline to repost my website."}, {"4297": "Pretty soon I scored 65 points and posted fresh headline to Hacker News and Reddit."}, {"7b32": "This time, according to Google Analytics, I had more than 750 concurrent visitors for several hours straight while my post on Hacker News was on top. Having said that, I probably lost some audience due to my web server failure (which I also wrote about here)."}, {"66aa": "The next day, I found out that dev-books.com had more than 5,000 shares on Facebook (which you can be seen here), was posted to lifehacker, as well as translated and posted to many other resources all over the world."}, {"d943": "Geolocation"}, {"26c1": "The next day, I created a geolocation report from Google Analytics and found out that I was getting quite a bit of traffic from Asia and Europe — particularly Russia."}, {"0f91": "Making my Asian and European visitors waiting for their orders from US was impolite, so I created affiliate accounts at amazon.co.uk, amazon.de and amazon.fr."}, {"5d36": "For sure, I’ve lost some orders because of this issue."}, {"18a9": "That same night my visitors started getting links to their closest store."}, {"6936": "The most interesting part"}, {"b8ff": "In the pictures below, you can see statistics from Amazon.com for the month of February 2017. From the European cluster of Amazon in total I got just a bit more than $250. Could it be more if I have done geolocation based links from the very beginning? For sure."}, {"47d1": "And here’s my final earnings for February: $2,534.40."}, {"851b": "Summary for February 2017"}, {"e584": "Am I happy with this result? Absolutely."}, {"2105": "Dev-books.com still operates, and keeps bringing in some orders, so it has already earned more than $3000 in the month and a half since I launched it."}, {"f68b": "How would you rate my result? Could it be much higher? I’d be happy to get your feedback/tips/stories in the comments below, on Twitter, or Facebook."}], "content": "How my side project satisfied my curiosity — and made me $3,000 I was curious what books were most commonly recommended on Stack Overflow. So I analyzed a database dump, counted the mentions, then built a website for exploring the data. (You can read about this entire process step-by-step here.) On February 1st I launched dev-books.com. Over the next few days, the website got more than 100,000 visits. Many of these visitors got in touch with me with questions regarding my profit from this project. So — as promised — I’m publishing this full report from Google Analytics and Amazon, along with my story. :) How this website makes money For this project, I chose the Amazon Affiliate Program, since Amazon is the biggest book store I know of. Account registration was pretty straight forward, so I received my affiliate tag to use in links on my website in less than an hour. Cold start After everything was up and running, I’ve posted link to dev-books.com on Hacker News and Reddit, trying to attract some developers’ attention to my project. Unfortunately, it didn’t bring in the wide audience I was hoping for. But I started to get some feedback, fixed some bugs, and got suggestions on how to promote my project. At the end of the day, I received message from freeCodeCamp teacher Quincy Larson suggesting I write a story about my project and how I built it, to make it more accessible to people. The Breakthrough Reading this article by Quincy Larson, I found a very useful tool for making the headline called Headline Analyzer. I tried the headline I used for my posts, and got quite low rating, so I started to make a better headline to repost my website. Pretty soon I scored 65 points and posted fresh headline to Hacker News and Reddit. This time, according to Google Analytics, I had more than 750 concurrent visitors for several hours straight while my post on Hacker News was on top. Having said that, I probably lost some audience due to my web server failure (which I also wrote about here). The next day, I found out that dev-books.com had more than 5,000 shares on Facebook (which you can be seen here), was posted to lifehacker, as well as translated and posted to many other resources all over the world. Geolocation The next day, I created a geolocation report from Google Analytics and found out that I was getting quite a bit of traffic from Asia and Europe — particularly Russia. Making my Asian and European visitors waiting for their orders from US was impolite, so I created affiliate accounts at amazon.co.uk, amazon.de and amazon.fr. For sure, I’ve lost some orders because of this issue. That same night my visitors started getting links to their closest store. The most interesting part In the pictures below, you can see statistics from Amazon.com for the month of February 2017. From the European cluster of Amazon in total I got just a bit more than $250. Could it be more if I have done geolocation based links from the very beginning? For sure. And here’s my final earnings for February: $2,534.40. Summary for February 2017 Am I happy with this result? Absolutely. Dev-books.com still operates, and keeps bringing in some orders, so it has already earned more than $3000 in the month and a half since I launched it. How would you rate my result? Could it be much higher? I’d be happy to get your feedback/tips/stories in the comments below, on Twitter, or Facebook. ", "parent": "", "title": "How my side project satisfied my curiosity — and made me $3,000", "child": "66_1\t66_2\t66_3\t66_4\t66_5\t66_6\t66_7\t66_8\t66_9\t66_10\t66_11\t66_12\t66_13\t66_14\t66_15\t66_16\t66_17\t66_18\t66_19\t66_20\t66_21\t66_22\t66_23\t66_24\t66_25", "name": "66"}