{"content": "The Devin Nunes Ethics Probe is Garbage Leftwing groups like MoveOn.org employ underhanded tactics to wage a PR battle against a man who knows too much You may have heard last week that House Intelligence Committee Chairman Devin Nunes (R-CA) has temporarily recused himself from the committee’s Russia investigation due to his being investigated by the House Ethics Committee. It sounds like a damning indictment of Nunes that further serves to undermine all he’s said and done over the past few weeks. But this so-called “Ethics violation” is nothing more than an abuse of a legitimate system by Nunes’ political enemies. It’s a political ploy to sully Nunes’ name and assail his credibility. He reported explosive, devastating truths about the Obama Administration, and so when you cannot refute what someone says, you refute the person himself. That’s the strategy his enemies have employed. From Bloomberg View’s Eli Lake: This brings us the charges brought to Office of Government Ethics that spurred the House Ethics Committee to launch its probe. The committee is investigating whether Nunes violated rules prohibiting the disclosure of classified information when he held press conferences to discuss the reports he had seen. What is the violation? It’s the fact that Nunes said publicly that he had seen summaries of raw intelligence reports that he said inappropriately contained details about the Trump transition and were not related to Russia. While the chairman never acknowledged that the sources of his information were NSA intercepts, any mention of any information collected under the Foreign Intelligence Surveillance Act is technically classified. This sounds worse than it is. This complaint, brought by a handful of lawyers who have been harsh critics of Trump and by progressive activists like MoveOn.org, is a ruse, meant to distract from the bigger question of how the Obama White House was receiving raw intelligence reports on the activities of Trump and his advisers after the election. Now, just because the allegations come from partisan leftwing organizations does not make them inherently bogus, because, at least in my view, every organization in the political arena is partisan, i.e. there are no unbiased sources. Biased, partisan sources can and often do uncover the truth. But in this case, the organizations accusing Nunes of ethics violations clearly have no case against him, and they know it, meaning they’ve only leveled these charges to make Nunes look bad. As Lake says, this Ethics probe is a ruse meant to distract from Nunes’ actual revelations, the stuff that makes the Obama administration look bad. Because Nunes’ behavior was routine and not out of the ordinary: The infraction, if it was one, was not serious. Nunes did not disclose the targets of the surveillance or any details about how the information was collected. There is rarely a day that goes by in Washington when someone in the media is not reporting on classified information. It’s a part of the ecosystem. In most cases these leaks are considered to be the cost of doing business and a way for the press and Congress to hold the national security state accountable. But the leftwing groups got what they wanted: they’ve managed to create the appearance of wrongdoing on Nunes’ part. “The Ethics Office wouldn’t be investigating Nunes if there was nothing to investigate!” “Nunes wouldn’t recuse himself if he wasn’t guilty!” Even if and when this bogus Ethics probe is dismissed, it will barely be a story. The damage to Nunes — his reputation and his credibility — are already done. This is a cheap tactic that I’ve discussed in the past: smear someone with a baseless accusation for the sole reason of getting it into the headlines and associating “ethics violation investigation” with Devin Nunes’ name. Because most people don’t actually read the articles, seeing the headline is all that matters. Most people see the headline and move on. This, like the garbage 9th Circuit Court rulings against Trump’s clearly constitutional immigration suspension Executive Order, is the continued politicization of supposedly non-partisan organizations to willfully mislead the public. The courts struck down Trump’s executive order? Wow, it must really be awful and illegal! The courts are honest and nonpartisan! Now that the Congressional Ethics Office is investigating Nunes, it appears yet another apolitical institution is pushing back against the Republicans and their constant scheming, even though in reality it’s dishonest partisan hacks abusing the Ethics Committee to smear their political enemies. Perception is reality. Politics, as with most any highly-visible, high-stakes business in this country, is a PR battle. Both business in a market economy and politics in a democracy are won and lost in the court of public opinion. Even if (and when) Nunes is cleared as totally innocent, this still does irrevocable damage to his reputation and credibility. In recusing himself temporarily, he has allowed his opponents to use underhanded tactics to create the appearance of guilt. If you enjoyed this story, please hit the little red heart ❤️ below to share it with others, and follow Today in Politics for more stories like this! I also encourage you to follow TIP on Twitter. ", "child": "66_166_1", "title": "The Devin Nunes Ethics Probe is Garbage", "parent": "", "sentences": [{"5b78": "The Devin Nunes Ethics Probe is Garbage"}, {"ca5e": "Leftwing groups like MoveOn.org employ underhanded tactics to wage a PR battle against a man who knows too much"}, {"8c73": "You may have heard last week that House Intelligence Committee Chairman Devin Nunes (R-CA) has temporarily recused himself from the committee’s Russia investigation due to his being investigated by the House Ethics Committee. It sounds like a damning indictment of Nunes that further serves to undermine all he’s said and done over the past few weeks."}, {"28b9": "But this so-called “Ethics violation” is nothing more than an abuse of a legitimate system by Nunes’ political enemies. It’s a political ploy to sully Nunes’ name and assail his credibility. He reported explosive, devastating truths about the Obama Administration, and so when you cannot refute what someone says, you refute the person himself. That’s the strategy his enemies have employed."}, {"4b44": "From Bloomberg View’s Eli Lake:"}, {"7aa0": "This brings us the charges brought to Office of Government Ethics that spurred the House Ethics Committee to launch its probe. The committee is investigating whether Nunes violated rules prohibiting the disclosure of classified information when he held press conferences to discuss the reports he had seen. What is the violation? It’s the fact that Nunes said publicly that he had seen summaries of raw intelligence reports that he said inappropriately contained details about the Trump transition and were not related to Russia. While the chairman never acknowledged that the sources of his information were NSA intercepts, any mention of any information collected under the Foreign Intelligence Surveillance Act is technically classified."}, {"3d37": "This sounds worse than it is. This complaint, brought by a handful of lawyers who have been harsh critics of Trump and by progressive activists like MoveOn.org, is a ruse, meant to distract from the bigger question of how the Obama White House was receiving raw intelligence reports on the activities of Trump and his advisers after the election."}, {"bcd1": "Now, just because the allegations come from partisan leftwing organizations does not make them inherently bogus, because, at least in my view, every organization in the political arena is partisan, i.e. there are no unbiased sources. Biased, partisan sources can and often do uncover the truth."}, {"346d": "But in this case, the organizations accusing Nunes of ethics violations clearly have no case against him, and they know it, meaning they’ve only leveled these charges to make Nunes look bad. As Lake says, this Ethics probe is a ruse meant to distract from Nunes’ actual revelations, the stuff that makes the Obama administration look bad. Because Nunes’ behavior was routine and not out of the ordinary:"}, {"bcb1": "The infraction, if it was one, was not serious. Nunes did not disclose the targets of the surveillance or any details about how the information was collected. There is rarely a day that goes by in Washington when someone in the media is not reporting on classified information. It’s a part of the ecosystem. In most cases these leaks are considered to be the cost of doing business and a way for the press and Congress to hold the national security state accountable."}, {"412c": "But the leftwing groups got what they wanted: they’ve managed to create the appearance of wrongdoing on Nunes’ part. “The Ethics Office wouldn’t be investigating Nunes if there was nothing to investigate!” “Nunes wouldn’t recuse himself if he wasn’t guilty!” Even if and when this bogus Ethics probe is dismissed, it will barely be a story. The damage to Nunes — his reputation and his credibility — are already done."}, {"fa17": "This is a cheap tactic that I’ve discussed in the past: smear someone with a baseless accusation for the sole reason of getting it into the headlines and associating “ethics violation investigation” with Devin Nunes’ name. Because most people don’t actually read the articles, seeing the headline is all that matters. Most people see the headline and move on."}, {"33dc": "This, like the garbage 9th Circuit Court rulings against Trump’s clearly constitutional immigration suspension Executive Order, is the continued politicization of supposedly non-partisan organizations to willfully mislead the public. The courts struck down Trump’s executive order? Wow, it must really be awful and illegal! The courts are honest and nonpartisan! Now that the Congressional Ethics Office is investigating Nunes, it appears yet another apolitical institution is pushing back against the Republicans and their constant scheming, even though in reality it’s dishonest partisan hacks abusing the Ethics Committee to smear their political enemies."}, {"f0d3": "Perception is reality. Politics, as with most any highly-visible, high-stakes business in this country, is a PR battle. Both business in a market economy and politics in a democracy are won and lost in the court of public opinion. Even if (and when) Nunes is cleared as totally innocent, this still does irrevocable damage to his reputation and credibility."}, {"144c": "In recusing himself temporarily, he has allowed his opponents to use underhanded tactics to create the appearance of guilt."}, {"ffa9": "If you enjoyed this story, please hit the little red heart ❤️ below to share it with others, and follow Today in Politics for more stories like this!"}, {"3cbf": "I also encourage you to follow TIP on Twitter."}], "name": "66"}