{"name": "663", "parent": "", "content": "The Story Of A Boy 1st in a series of many It’s one of those memories that only later does one realize the significance of its exacting accuracy. On a cooler than seasonal, mid November Friday morning in 2006, I zip my fleece to just under my chin and turn away from the wind. Two months and a week into the first year of my MFA, it’s day five of our second workshop. Fiction was our first, but this time it’s the art and craft of memoir. I’m agitated, and I don’t understand why. After all, my major is creative nonfiction, of which memoir is a sub genre. This should be my top game. But it’s not. Today, at the end of the first week I’m unsure, mildly confused, and sensing the beginnings of what will prove to be my longest, most crippling writing block to date. Those would be my reasons for standing outside her office at 170 St. George Street on a busy and sidewalk heavy morning. By the time she appears, Starbucks in hand, I’ve been there for twenty minutes, and I’m guessing my frustration and general angst was more visible than intended. Her appraisal is swift, and the pause before speaking only slightly longer than comfortable. “Allan? To what do I owe the privilege of an escorted walk to class? I am familiar with the way, you know.” The phrasing is playful rather than annoyed, her arched brows indicating faux surprise. I pause, stammer something moderately coherent, then stop. Rephrase in my head. Then, starting again, I ask her the question that has been nagging at me since Monday, a life's worth of blank pages to fill hanging in the balance. “How will I know when it’s time?” My question moves on the cold air between us, the grey mist of my words, briefly visible. Immediately I fear that the enormity of what it is I’m asking has been missed in a hasty, one dimensional search for semantics. From a woman who the last Globe & Mail review famously described as possessing an ability to freeze fire with elegant erudition and a stroke of hair. For a woman who inhabits life on the other side of retirement age, her petite frame swathed in oversized sheep skin is surprisingly commanding. The mane of faithfully unruly salt and pepper curls, bouncing in the wind. “How will you know?’ she parrots, as if considering the question and my words for the first time. Her eyes search, find, then hold my gaze, before the Giller Prize winning author offers her answer. “Easy. When it’s time, you will know. I realize that’s not the answer you are hoping for, but trust me when I say it. You will know.” The silence that follows is no doubt shorter than it feels, but none the less agonizing in the moment. “Now, let’s move it, you don’t want to make your teacher late, do you?” I smile and nod, thankful for her gracious generosity, but underwhelmed by the sparse offering. “Why that would be the last thing I’d want to do”, I say, continuing with the little game of contrived formality. “Good answer!” Laughing, we walk the three short blocks to the lecture hall together. To the best of my recollection, we were nowhere close to late. Today is April 7 / 2017. It has been ten years, a few months, and countless written works since the conversation I describe above. During that time there have been more than a few occasions where I was convinced “I knew” that it was “the time.” Well, I didn’t, and it wasn’t. Walking the dogs a few hours ago, spring rain pelting down, the boys doing everything but their business, I felt an odd twang of urgency. It was a few minutes until it settled, and when it did it was like slow flowing syrup drizzling onto fluffy pancakes. I knew. It was, and is time. The Legend, as we affectionately called her, had been right. I understand and am in no way unclear that now, here in the present of 2017, at the age of 49, it’s time to tell my story. I realize that her request for trust, as well as my offer of it, had not been in vain. What exactly will follow over the next several days, weeks, and months, I’m not quite sure. And while I know a few things it will be, like non linear in form for required context, and third person for a healthy, insightful distance, the rest I don’t know. Except that right now, I know I need some strong coffee; I think it’s going to be one hell of a long night. This has been the first entry in a series of stories, ones that with lots of effort and more than a little luck will eventually become a completed memoir. To read new stories, follow the tag Story Of A Boy. More to come soon. Chapter 1 A Bird Without A Windowdoesn’t alter cracks in the glasscrossingenres.com Chapter 2 A Series Tribute To My Fatherusing the series function to remember my fathermedium.com In 2006 Allan Rae left a career as a flight paramedic to obtain his MFA in creative nonfiction. Today he is a qualitative public health researcher exploring intersections of HIV, PTSD, and stigma using a narrative focused model of inquiry. The editorial lead for creative nonfiction at daCunha, and the creator and editorial director of Crossin(G)enres, he admits to a mild Starbucks addiction, and is an avid collector of stray dogs. ", "title": "The Story Of A Boy", "sentences": [{"7c54": "The Story Of A Boy"}, {"41df": "1st in a series of many"}, {"f635": "It’s one of those memories that only later does one realize the significance of its exacting accuracy."}, {"7069": "On a cooler than seasonal, mid November Friday morning in 2006, I zip my fleece to just under my chin and turn away from the wind. Two months and a week into the first year of my MFA, it’s day five of our second workshop. Fiction was our first, but this time it’s the art and craft of memoir. I’m agitated, and I don’t understand why. After all, my major is creative nonfiction, of which memoir is a sub genre. This should be my top game. But it’s not. Today, at the end of the first week I’m unsure, mildly confused, and sensing the beginnings of what will prove to be my longest, most crippling writing block to date."}, {"cf18": "Those would be my reasons for standing outside her office at 170 St. George Street on a busy and sidewalk heavy morning. By the time she appears, Starbucks in hand, I’ve been there for twenty minutes, and I’m guessing my frustration and general angst was more visible than intended. Her appraisal is swift, and the pause before speaking only slightly longer than comfortable."}, {"f7d2": "“Allan? To what do I owe the privilege of an escorted walk to class? I am familiar with the way, you know.”"}, {"1e2c": "The phrasing is playful rather than annoyed, her arched brows indicating faux surprise."}, {"b35d": "I pause, stammer something moderately coherent, then stop. Rephrase in my head. Then, starting again, I ask her the question that has been nagging at me since Monday, a life's worth of blank pages to fill hanging in the balance."}, {"6f42": "“How will I know when it’s time?” My question moves on the cold air between us, the grey mist of my words, briefly visible. Immediately I fear that the enormity of what it is I’m asking has been missed in a hasty, one dimensional search for semantics. From a woman who the last Globe & Mail review famously described as possessing an ability to freeze fire with elegant erudition and a stroke of hair."}, {"b6f4": "For a woman who inhabits life on the other side of retirement age, her petite frame swathed in oversized sheep skin is surprisingly commanding. The mane of faithfully unruly salt and pepper curls, bouncing in the wind."}, {"c4d3": "“How will you know?’ she parrots, as if considering the question and my words for the first time. Her eyes search, find, then hold my gaze, before the Giller Prize winning author offers her answer."}, {"693b": "“Easy. When it’s time, you will know. I realize that’s not the answer you are hoping for, but trust me when I say it. You will know.”"}, {"ca54": "The silence that follows is no doubt shorter than it feels, but none the less agonizing in the moment."}, {"b8c4": "“Now, let’s move it, you don’t want to make your teacher late, do you?”"}, {"d638": "I smile and nod, thankful for her gracious generosity, but underwhelmed by the sparse offering."}, {"3fe2": "“Why that would be the last thing I’d want to do”, I say, continuing with the little game of contrived formality."}, {"8973": "“Good answer!”"}, {"621d": "Laughing, we walk the three short blocks to the lecture hall together. To the best of my recollection, we were nowhere close to late."}, {"4cef": "Today is April 7 / 2017. It has been ten years, a few months, and countless written works since the conversation I describe above. During that time there have been more than a few occasions where I was convinced “I knew” that it was “the time.” Well, I didn’t, and it wasn’t."}, {"c974": "Walking the dogs a few hours ago, spring rain pelting down, the boys doing everything but their business, I felt an odd twang of urgency. It was a few minutes until it settled, and when it did it was like slow flowing syrup drizzling onto fluffy pancakes. I knew. It was, and is time. The Legend, as we affectionately called her, had been right. I understand and am in no way unclear that now, here in the present of 2017, at the age of 49, it’s time to tell my story. I realize that her request for trust, as well as my offer of it, had not been in vain."}, {"f24a": "What exactly will follow over the next several days, weeks, and months, I’m not quite sure. And while I know a few things it will be, like non linear in form for required context, and third person for a healthy, insightful distance, the rest I don’t know. Except that right now, I know I need some strong coffee; I think it’s going to be one hell of a long night."}, {"12ef": "This has been the first entry in a series of stories, ones that with lots of effort and more than a little luck will eventually become a completed memoir. To read new stories, follow the tag Story Of A Boy. More to come soon."}, {"1efe": "Chapter 1"}, {"b236": "A Bird Without A Windowdoesn’t alter cracks in the glasscrossingenres.com"}, {"bf3c": "Chapter 2"}, {"00d2": "A Series Tribute To My Fatherusing the series function to remember my fathermedium.com"}, {"682e": "In 2006 Allan Rae left a career as a flight paramedic to obtain his MFA in creative nonfiction. Today he is a qualitative public health researcher exploring intersections of HIV, PTSD, and stigma using a narrative focused model of inquiry. The editorial lead for creative nonfiction at daCunha, and the creator and editorial director of Crossin(G)enres, he admits to a mild Starbucks addiction, and is an avid collector of stray dogs."}], "child": "663_1\t663_2\t663_3\t663_4\t663_5\t663_6\t663_7\t663_8\t663_9663_1\t663_2\t663_3\t663_4\t663_5\t663_6\t663_7\t663_8\t663_9663_1\t663_2\t663_3\t663_4\t663_5\t663_6\t663_7\t663_8\t663_9663_1\t663_2\t663_3\t663_4\t663_5\t663_6\t663_7\t663_8\t663_9"}