{"name": "664", "parent": "", "content": "Maria Theresa Ferreira 86 anos, professora aposentada Aos três anos começaram os meus ataques epiléticos. Ninguém tinha isso na família, só eu, mas Deus é tão bom que isso nunca me impediu de estudar, de sair, de dançar. Com 43 anos os ataques pararam e eu nunca entendi o motivo. Por causa deles, um médico especialista em São Paulo disse que ninguém poderia ‘forçar a minha cabecinha’ nem me contrariar, então minha mãe não me pôs no colégio. Mas aí, com sete anos, eu via todas as minhas amiguinhas lendo livrinhos de história e eu não sabia ler, por isso eu quis ir pra escola. Minha mãe me matriculou no dia seguinte — não podia me contrariar, né? [risos]. Eu fiz todos os cursos: primário, ginásio, escola e faculdade. Tudo que eu quis estudar, estudei. Fiz o ginásio no Colégio São José de Santos, na época da Segunda Guerra. O que eu posso dizer desse tempo… que eu era a bacana do colégio? Eu era. Era a melhor aluna de português [risos]. A professora de português era famosa, a dona Zumira Campos, e ela não dava nota 10 para ninguém! Ela dizia que 10 era para Deus, nove para o professor e oito para o aluno — se ele conseguisse tirar oito com ela né, porque ninguém conseguia. Aí um dia… parece piada, mas não é. Naquele dia, a dona Zumira estava muito alegre, muito simpática — e ela nunca era assim — e chamou minha colega Elizete para ler na frente da sala. Então ela levantou e leu uns textos. Aí, a Elizete leu algo sobre ‘verde’, não lembro direto o quê, e a dona Zumira: - Oh filhinha, diga um adjetivo derivado de verde. Todo mundo da classe parou, ninguém sabia, aí começaram a me cutucar, porque eu sempre sabia as respostas. Então eu disse: verdejante. E foram passando até chegar lá na frente na Elizete. Óbvio que a professora estava ouvindo tudo, mas ela ficou quietinha, não falou nada. Esperou a Elizete falar o verdejante, aí fez outra pergunta: - Agora, me diga um substantivo derivado de verde. Todo mundo ficou doido, mas eu me lembrei de ‘verdura’, então foram passando de novo para a Elizete. Aí a menina pergunta ‘verdura?’ e todo mundo ‘é, verdura’. E a professora escutando. E a Elizete tremendo, diz: alface [risos]! Não parece piada? A sala toda explodiu de risada e a dona Zumira ficou muito brava. Ela foi até a lousa e escreveu ‘redação sobre a gota d’água’, pediu frente e verso da folha de lauda que a gente usava naquela época para escrever redação. Todo mundo ficou em silêncio pensando no que escrever sobre uma gota de água. Para mim a gota nada mais é do que uma molécula de H2O. Então escrevi isso, mas não podia escrever só isso, né? Eu tinha 14 ou 15 anos, não lembro bem, mas lembro da redação como se fosse ontem. Era assim: ‘Milhares de gotas de água formam o copo de água que mata a sede do viajante, milhões e milhões de copos de água formam nossos rios caudalosos que fertilizam nossas terras e se jogam aos mares, que formam os oceanos pelos quais vieram os nossos descobridores”. E continuei nessa toada, mas eu não sabia como terminar. Aí me veio: “nada mais do que uma simples gota d’água foi a lágrima derramada por Maria ao ver seu filho crucificado’. Aquilo foi um espetáculo. E eu não errava vírgula, acento, nada. A dona Zumira leu e entregou para a madre superiora do colégio e ela veio cumprimentar a classe toda. Todo mundo da cidade ficou sabendo que o Colégio São José tinha tido um 10 com a Zumira Campos. Quando eu comecei a lecionar, mulher só usava salto alto e saia, calça comprida era só para piqueniques e andar a cavalo. Eu comecei minha carreira como professora substituta na fábrica Fabril, em Cubatão. Tinha muito borrachudo lá, mas a gente não podia usar calça; a nossa perna ficava toda picada de mosquito. Então, para ficar elegante, a gente colocava aquelas meias grossas de velhinha por baixo da saia com o salto, porque nem sapato baixo a gente podia usar. Naquela época não tinha condução para Cubatão, o pessoal da Fabril mandava buscar as professoras em Santos. A gente tomava o ônibus deles em frente à prefeitura e ia para lá. Mas na hora de sair não tinha ônibus para voltar para Santos. Então ficava eu e minha tia pedindo carona na estrada e ninguém parava, deviam pensar ‘o que essas vagabundas estão fazendo aí? onde já se viu moça direita pedindo carona a essa hora?’, e só os caminhões paravam. Eu lembro um dia que parou um caminhão de açougue, cheio de osso, e o moço foi lá para trás, no meio dos ossos, para eu e minha tia irmos ao lado do motorista na boleia. O começo foi assim, lecionei em tudo que é lado: morro do Pacheco, morro do São Bento, morro da Nova Cintra… como eu era professora substituta, onde tinha vaga, eu ia. Até que passei no concurso e vim para o colégio Dino Bueno, aqui pertinho de casa e há mais de 20 anos me aposentei lá. Eu nunca pensei em morar em Pindamonhangaba [cidade do interior de São Paulo, na serra da Mantiqueira], mas fui para lá por causa do meu filho, quando ele foi fazer faculdade em Taubaté, ali do lado. Eu sempre o levava para passar as férias lá, na casa da minha sogra, então ele cresceu com a molecadinha da vizinhança, conhecia todo mundo. Mas eu não conhecia quase ninguém, até que eu decidi fazer faculdade. Eu entrei com 47 anos e saí com 50. Os coleguinhas eram todos recém-formados no colegial, só tinha eu e mais duas velhotas [risos]. Quando meu filho foi me levar para fazer o vestibular, ele falou assim ‘mãe, só numa época dessa acontecem essas coisas: um filho levando sua mãe para fazer vestibular’. E eram tempos modernos, né? Eu nunca pensei que me formaria com o meu filho. Depois disso, ensinei na roça e em fazendas. Lá na Serra da Mantiqueira. Pegava o trem cedinho, passava o dia lá e à noite ia para a faculdade. Eu dei aula durante 38 anos, no total. Durante todos eles, dei aula para o primário — era assim que se chamava antigamente. E por oito anos também dei aula para o colegial, uma matéria que nem existe mais: música e educação artística. Eu comecei a lecionar com 25 anos e terminei com 63, já faz 23 anos que estou aposentada e é uma chatice. No começo foi pior ainda, estava acostumada com todo mundo me rodeando e de repente estava parada, foi difícil. Às vezes encontro um aluno meu — meus alunos têm de 30 a 60 anos -, que vem falar comigo ‘oh professora’, mas eu não reconheço ninguém, a maioria tinha sete anos quando eu lecionava. Hoje mesmo fui ao banco e o caixa foi meu aluno, mas eu não sabia, e ele disse ‘oh professora, a senhora não se lembra de mim?’. E eu penso: de jeito nenhum [risos]. Mas ele aprendeu a ler comigo, então eles recordam. Eu gosto que eles se lembrem de mim. Eu sou cega da vista esquerda, tenho glaucoma [pressão alta nos olhos]. Eu nem sabia que olho tinha pressão alta. Eu não tenho pressão alta no corpo, mas tenho nas vistas e aí estouraram as veias do meu nervo óptico e fiquei cega. Mês passado estava vendo tudo atrás de uma névoa e queria aumentar o grau dos óculos para enxergar melhor, mas a médica disse que não adiantava aumentar a lente, eu estava enxergando mal porque o glaucoma tinha piorado. Disse que era só eu esperar ficar cega. Fiquei desesperada, a única coisa que não quero é perder a vista, as outras doenças não me importam. Mas aí eu fui no meu culto de seicho-no-ie e teve a oração da cura divina e eu fiz pensando em meus olhos e do nada, acabou a névoa no meu olho. As velhinhas de antigamente faziam crochê, mas eu não sei. As de agora ficam no computador, os netinhos ensinam tudo. Eu gosto de jogar paciência e fazer meus jogos de Cripto [jogo de adivinhação de palavras], porque me cansei de palavra cruzada, é muito fácil. E eu vivo bem, graças a Deus, não fico preocupada com nada, na verdade nunca fiquei… Eu tinha aqueles ataques violentos, caía no chão, revirando os olhos, espumando pela boca, levantava e me doía o corpo inteirinho, parecia que tinha levado a maior surra do mundo, porque tremia o corpo todo, né? E você acha que eu ficava pensando “quando eu vou ter um ataque de novo?”. Eu não, eu queria curtir a vida. Eu não queria casar de jeito nenhum, mas no meu tempo a gente tinha que casar. Eu e meu ex-marido tínhamos a mesma idade, e quando ele fez 22 anos e entrou na Petrobrás, ele quis casar. Mas eu não queria, então fui fazer a escola normal. Ele esperou mais três anos para eu terminar os estudos, então quando acabei, com 25 anos, tive que casar. Só que aí eu era muito magra e o médico me deu um regime de engorda porque se eu engravidasse não ia conseguir manter a gravidez [risos]. Depois disso, eu me casei. Eu tinha 37 anos e meu filhinho 10 quando nos separamos. Os homens ficavam todos em cima de mim, e eu ‘sai pra lá’; ficavam enchendo minha paciência. Mas deu tudo certo, tenho uma vida feliz, gosto de piada, de coxinha de frango e de chocolate e já avisei para o meu filho que quando eu não quiser nada disso é porque estou muito mal [risos]. Eu tive três filhos. O mais velho nasceu antes do tempo, não estava com o coração dividido ainda, então ele morreu com sete meses. O segundo é o meu filho Luciano. E o terceiro e último, loirinho, lindinho, nasceu com uma mancha vermelha na cabeça. Dentro de mim ele não se machucou, foram pegar ele com o fórceps e machucaram. Aí eu estava vendo ele no berçário com aquela mancha e um homem que estava atrás de mim — não sei se ele era enfermeiro, se era médico — disse ‘ah dona, se ele escapar, poderá ficar cego’. E ele não escapou. Morreu alguns dias depois. Isso foi em 1960. Aí eu fui aprender braile para poder dar aula para cegos e lecionei para cegos no Dino Bueno mesmo. A sala de cegos foi minha por dois anos. Um dos meus alunos cegos, que tinha 11 anos, não sabia fazer nada sozinho. A mãe fazia tudo para ele. Um dia, eu ensinei ele a beber água do filtro. Dia seguinte, a mãe dele foi na escola, fazendo um espetáculo: - Professora, a senhora não sabe o que aconteceu! Estávamos na sala assistindo televisão, meu filho levantou, foi para cozinha e nós fomos ver o que ele foi fazer. Quando chegamos lá, ele estava tomando água do filtro sozinho! - O que tem isso? - Como o que tem isso? Ele foi sozinho! Quer dizer, se o moleque tinha sede, não podia beber água sozinho, porque não sabia. Que absurdo. E eu falei para a mãe que ele tinha que aprender. As moças do Lar das Moças Cegas [um centro de reabilitação para deficientes visuais] faziam tudo sozinhas, aprendiam de tudo, até cozinhar. Eu aprendi a ler braile lá e aprendi muito com elas. Elas sabiam tudo e esse menino nada! Quando meus pais se separaram, eu tinha 10 anos. Foi um pouco difícil, porque naquela época a separação era um escândalo. Filhos de pais separados não prestavam, muito menos a mãe desses filhos — era sempre a mãe que não prestava. Por causa disso, eu não era companhia para mocinha nenhuma. Mas com o tempo melhorou e eu tive sorte, as mães das minhas amigas passaram a me tratar bem. Apesar disso, eu chorava toda noite até os 18 anos por causa da separação. Aí quando eu fiz 18, pensei: ‘por que eu estou chorando? Está todo mundo feliz!’. Minha mãe se casou de novo — não podia casar, mas moravam juntos, né — com o pintor Gentil Garcez. Ele era muito carinhoso comigo, sempre me tratou bem. Ele era considerado um dos melhores marinhistas da América do Sul e a gente sempre ia à Praia Grande [cidade no litoral de São Paulo] para ele tirar fotos para pintar depois. Naquela época não tinha nada lá, só a Cidade Ocean [atualmente um dos principais bairros de Praia Grande] com umas casinhas e um barzinho, hoje é uma cidade enorme! Eu também tinha muito contato com o meu pai. Ele sempre me levava nos bailes, porque naquele tempo eu não podia ir sozinha. Eu ia vestida de longo, traje a rigor… Quando tocava bolero, meu pai dançava comigo, ele era doido por bolero; agora, nos outros ritmos, ele sentava na mesa e ficava me esperando dançar. Eu sempre dançava com o meu amigo Paulinho — ele era dentista, nem sei se já morreu, se não deve ter mais de 80 anos — e todo mundo achava que ele era meu namorado. Eu também cuidei de muita gente da minha família. O Alzheimer da minha mãe veio de repente. Todo sábado eu ia até a casa dela para fazer uma limpeza, ver os cachorros, cuidar dos gatinhos; toda semana surgia um gato novo no sobrado da minha mãe. Meu padrasto estava no andar de cima pintando e eu fui me despedir da minha mãe no andar de baixo, dei um abraço nela e ela caiu para trás. Gritei e vieram ajudar. Se eu tivesse saído antes, ela teria caído, batido a cabeça e vai saber o que iria acontecer. Desde então ela não falou, não comeu e não andou mais. Foi impressionante. Ela não gemia, não fazia nada, era como uma boneca de pano. Ela me via e abria a boquinha quando queria comer alguma coisa, então eu fazia sopinha, já que ela não sabia mais mastigar. Foram nove meses desse jeito. Ainda assim, meu padrasto morreu antes. Um dia eu estava dando comida para ele e ele começou a cuspir. Fiquei preocupada porque ele nem estava ruim da cabeça, mas ele não sabia também porque estava cuspindo, então fomos ao hospital. Dois dias depois ele faleceu. Você vê, eu era a netinha coitadinha, a priminha coitadinha, a sobrinha coitadinha e a coitadinha aqui foi a única que se formou e ainda cuidou de todo mundo da família. Meu tio Rômulo também morou comigo até morrer. Meu sobrinho Ari criei até os 18 anos. Também cuidei do meu padrasto e da minha mãe”. “Chamo Maria Theresa por causa da santa Terezinha, padroeira dos missionários” “Agora que eu não posso mais pegar ônibus sozinha nem sair por aí, tenho uma acompanhante alguns dias da semana. É bom, mas também é ruim, gosto de ser livre” “Minha mãe gostava mais de pintar gente e natureza morta. Sempre tinha muitas flores nos quadros dela. Esse autorretrato dela é um dos meus preferidos” “Quando eu fiz nove anos, surgiu uma certeza dentro de mim de que eu morreria aos 54 anos. Não sei explicar. Mas eu estava errada, né? Tenho 86 firme e forte, graças a Deus” ", "title": "Maria Theresa Ferreira", "sentences": [{"b84b": "Maria Theresa Ferreira"}, {"025c": "86 anos, professora aposentada"}, {"26ad": "Aos três anos começaram os meus ataques epiléticos. Ninguém tinha isso na família, só eu, mas Deus é tão bom que isso nunca me impediu de estudar, de sair, de dançar. Com 43 anos os ataques pararam e eu nunca entendi o motivo. Por causa deles, um médico especialista em São Paulo disse que ninguém poderia ‘forçar a minha cabecinha’ nem me contrariar, então minha mãe não me pôs no colégio. Mas aí, com sete anos, eu via todas as minhas amiguinhas lendo livrinhos de história e eu não sabia ler, por isso eu quis ir pra escola. Minha mãe me matriculou no dia seguinte — não podia me contrariar, né? [risos]. Eu fiz todos os cursos: primário, ginásio, escola e faculdade. Tudo que eu quis estudar, estudei."}, {"c0e0": "Fiz o ginásio no Colégio São José de Santos, na época da Segunda Guerra. O que eu posso dizer desse tempo… que eu era a bacana do colégio? Eu era. Era a melhor aluna de português [risos]. A professora de português era famosa, a dona Zumira Campos, e ela não dava nota 10 para ninguém! Ela dizia que 10 era para Deus, nove para o professor e oito para o aluno — se ele conseguisse tirar oito com ela né, porque ninguém conseguia."}, {"9afc": "Aí um dia… parece piada, mas não é. Naquele dia, a dona Zumira estava muito alegre, muito simpática — e ela nunca era assim — e chamou minha colega Elizete para ler na frente da sala. Então ela levantou e leu uns textos. Aí, a Elizete leu algo sobre ‘verde’, não lembro direto o quê, e a dona Zumira:"}, {"6260": "- Oh filhinha, diga um adjetivo derivado de verde."}, {"402b": "Todo mundo da classe parou, ninguém sabia, aí começaram a me cutucar, porque eu sempre sabia as respostas. Então eu disse: verdejante. E foram passando até chegar lá na frente na Elizete. Óbvio que a professora estava ouvindo tudo, mas ela ficou quietinha, não falou nada. Esperou a Elizete falar o verdejante, aí fez outra pergunta:"}, {"57b0": "- Agora, me diga um substantivo derivado de verde."}, {"a7cf": "Todo mundo ficou doido, mas eu me lembrei de ‘verdura’, então foram passando de novo para a Elizete. Aí a menina pergunta ‘verdura?’ e todo mundo ‘é, verdura’. E a professora escutando. E a Elizete tremendo, diz: alface [risos]! Não parece piada?"}, {"f926": "A sala toda explodiu de risada e a dona Zumira ficou muito brava. Ela foi até a lousa e escreveu ‘redação sobre a gota d’água’, pediu frente e verso da folha de lauda que a gente usava naquela época para escrever redação. Todo mundo ficou em silêncio pensando no que escrever sobre uma gota de água. Para mim a gota nada mais é do que uma molécula de H2O. Então escrevi isso, mas não podia escrever só isso, né? Eu tinha 14 ou 15 anos, não lembro bem, mas lembro da redação como se fosse ontem. Era assim:"}, {"5bb0": "‘Milhares de gotas de água formam o copo de água que mata a sede do viajante, milhões e milhões de copos de água formam nossos rios caudalosos que fertilizam nossas terras e se jogam aos mares, que formam os oceanos pelos quais vieram os nossos descobridores”. E continuei nessa toada, mas eu não sabia como terminar. Aí me veio: “nada mais do que uma simples gota d’água foi a lágrima derramada por Maria ao ver seu filho crucificado’."}, {"65a1": "Aquilo foi um espetáculo. E eu não errava vírgula, acento, nada. A dona Zumira leu e entregou para a madre superiora do colégio e ela veio cumprimentar a classe toda. Todo mundo da cidade ficou sabendo que o Colégio São José tinha tido um 10 com a Zumira Campos."}, {"0025": "Quando eu comecei a lecionar, mulher só usava salto alto e saia, calça comprida era só para piqueniques e andar a cavalo. Eu comecei minha carreira como professora substituta na fábrica Fabril, em Cubatão. Tinha muito borrachudo lá, mas a gente não podia usar calça; a nossa perna ficava toda picada de mosquito. Então, para ficar elegante, a gente colocava aquelas meias grossas de velhinha por baixo da saia com o salto, porque nem sapato baixo a gente podia usar."}, {"7ab0": "Naquela época não tinha condução para Cubatão, o pessoal da Fabril mandava buscar as professoras em Santos. A gente tomava o ônibus deles em frente à prefeitura e ia para lá. Mas na hora de sair não tinha ônibus para voltar para Santos. Então ficava eu e minha tia pedindo carona na estrada e ninguém parava, deviam pensar ‘o que essas vagabundas estão fazendo aí? onde já se viu moça direita pedindo carona a essa hora?’, e só os caminhões paravam. Eu lembro um dia que parou um caminhão de açougue, cheio de osso, e o moço foi lá para trás, no meio dos ossos, para eu e minha tia irmos ao lado do motorista na boleia."}, {"4656": "O começo foi assim, lecionei em tudo que é lado: morro do Pacheco, morro do São Bento, morro da Nova Cintra… como eu era professora substituta, onde tinha vaga, eu ia. Até que passei no concurso e vim para o colégio Dino Bueno, aqui pertinho de casa e há mais de 20 anos me aposentei lá."}, {"2ede": "Eu nunca pensei em morar em Pindamonhangaba [cidade do interior de São Paulo, na serra da Mantiqueira], mas fui para lá por causa do meu filho, quando ele foi fazer faculdade em Taubaté, ali do lado. Eu sempre o levava para passar as férias lá, na casa da minha sogra, então ele cresceu com a molecadinha da vizinhança, conhecia todo mundo. Mas eu não conhecia quase ninguém, até que eu decidi fazer faculdade. Eu entrei com 47 anos e saí com 50. Os coleguinhas eram todos recém-formados no colegial, só tinha eu e mais duas velhotas [risos]."}, {"bed2": "Quando meu filho foi me levar para fazer o vestibular, ele falou assim ‘mãe, só numa época dessa acontecem essas coisas: um filho levando sua mãe para fazer vestibular’. E eram tempos modernos, né? Eu nunca pensei que me formaria com o meu filho."}, {"4b61": "Depois disso, ensinei na roça e em fazendas. Lá na Serra da Mantiqueira. Pegava o trem cedinho, passava o dia lá e à noite ia para a faculdade."}, {"f6ea": "Eu dei aula durante 38 anos, no total. Durante todos eles, dei aula para o primário — era assim que se chamava antigamente. E por oito anos também dei aula para o colegial, uma matéria que nem existe mais: música e educação artística. Eu comecei a lecionar com 25 anos e terminei com 63, já faz 23 anos que estou aposentada e é uma chatice. No começo foi pior ainda, estava acostumada com todo mundo me rodeando e de repente estava parada, foi difícil."}, {"e29b": "Às vezes encontro um aluno meu — meus alunos têm de 30 a 60 anos -, que vem falar comigo ‘oh professora’, mas eu não reconheço ninguém, a maioria tinha sete anos quando eu lecionava. Hoje mesmo fui ao banco e o caixa foi meu aluno, mas eu não sabia, e ele disse ‘oh professora, a senhora não se lembra de mim?’. E eu penso: de jeito nenhum [risos]. Mas ele aprendeu a ler comigo, então eles recordam. Eu gosto que eles se lembrem de mim."}, {"3bf5": "Eu sou cega da vista esquerda, tenho glaucoma [pressão alta nos olhos]. Eu nem sabia que olho tinha pressão alta. Eu não tenho pressão alta no corpo, mas tenho nas vistas e aí estouraram as veias do meu nervo óptico e fiquei cega. Mês passado estava vendo tudo atrás de uma névoa e queria aumentar o grau dos óculos para enxergar melhor, mas a médica disse que não adiantava aumentar a lente, eu estava enxergando mal porque o glaucoma tinha piorado. Disse que era só eu esperar ficar cega. Fiquei desesperada, a única coisa que não quero é perder a vista, as outras doenças não me importam. Mas aí eu fui no meu culto de seicho-no-ie e teve a oração da cura divina e eu fiz pensando em meus olhos e do nada, acabou a névoa no meu olho."}, {"7a03": "As velhinhas de antigamente faziam crochê, mas eu não sei. As de agora ficam no computador, os netinhos ensinam tudo. Eu gosto de jogar paciência e fazer meus jogos de Cripto [jogo de adivinhação de palavras], porque me cansei de palavra cruzada, é muito fácil. E eu vivo bem, graças a Deus, não fico preocupada com nada, na verdade nunca fiquei…"}, {"7413": "Eu tinha aqueles ataques violentos, caía no chão, revirando os olhos, espumando pela boca, levantava e me doía o corpo inteirinho, parecia que tinha levado a maior surra do mundo, porque tremia o corpo todo, né? E você acha que eu ficava pensando “quando eu vou ter um ataque de novo?”. Eu não, eu queria curtir a vida."}, {"0f40": "Eu não queria casar de jeito nenhum, mas no meu tempo a gente tinha que casar. Eu e meu ex-marido tínhamos a mesma idade, e quando ele fez 22 anos e entrou na Petrobrás, ele quis casar. Mas eu não queria, então fui fazer a escola normal. Ele esperou mais três anos para eu terminar os estudos, então quando acabei, com 25 anos, tive que casar. Só que aí eu era muito magra e o médico me deu um regime de engorda porque se eu engravidasse não ia conseguir manter a gravidez [risos]. Depois disso, eu me casei. Eu tinha 37 anos e meu filhinho 10 quando nos separamos. Os homens ficavam todos em cima de mim, e eu ‘sai pra lá’; ficavam enchendo minha paciência. Mas deu tudo certo, tenho uma vida feliz, gosto de piada, de coxinha de frango e de chocolate e já avisei para o meu filho que quando eu não quiser nada disso é porque estou muito mal [risos]."}, {"9c90": "Eu tive três filhos. O mais velho nasceu antes do tempo, não estava com o coração dividido ainda, então ele morreu com sete meses. O segundo é o meu filho Luciano. E o terceiro e último, loirinho, lindinho, nasceu com uma mancha vermelha na cabeça. Dentro de mim ele não se machucou, foram pegar ele com o fórceps e machucaram. Aí eu estava vendo ele no berçário com aquela mancha e um homem que estava atrás de mim — não sei se ele era enfermeiro, se era médico — disse ‘ah dona, se ele escapar, poderá ficar cego’. E ele não escapou. Morreu alguns dias depois. Isso foi em 1960. Aí eu fui aprender braile para poder dar aula para cegos e lecionei para cegos no Dino Bueno mesmo. A sala de cegos foi minha por dois anos."}, {"7af3": "Um dos meus alunos cegos, que tinha 11 anos, não sabia fazer nada sozinho. A mãe fazia tudo para ele. Um dia, eu ensinei ele a beber água do filtro. Dia seguinte, a mãe dele foi na escola, fazendo um espetáculo:"}, {"c711": "- Professora, a senhora não sabe o que aconteceu! Estávamos na sala assistindo televisão, meu filho levantou, foi para cozinha e nós fomos ver o que ele foi fazer. Quando chegamos lá, ele estava tomando água do filtro sozinho!"}, {"5196": "- O que tem isso?"}, {"f46b": "- Como o que tem isso? Ele foi sozinho!"}, {"2228": "Quer dizer, se o moleque tinha sede, não podia beber água sozinho, porque não sabia. Que absurdo. E eu falei para a mãe que ele tinha que aprender. As moças do Lar das Moças Cegas [um centro de reabilitação para deficientes visuais] faziam tudo sozinhas, aprendiam de tudo, até cozinhar. Eu aprendi a ler braile lá e aprendi muito com elas. Elas sabiam tudo e esse menino nada!"}, {"b17e": "Quando meus pais se separaram, eu tinha 10 anos. Foi um pouco difícil, porque naquela época a separação era um escândalo. Filhos de pais separados não prestavam, muito menos a mãe desses filhos — era sempre a mãe que não prestava. Por causa disso, eu não era companhia para mocinha nenhuma. Mas com o tempo melhorou e eu tive sorte, as mães das minhas amigas passaram a me tratar bem. Apesar disso, eu chorava toda noite até os 18 anos por causa da separação. Aí quando eu fiz 18, pensei: ‘por que eu estou chorando? Está todo mundo feliz!’."}, {"0282": "Minha mãe se casou de novo — não podia casar, mas moravam juntos, né — com o pintor Gentil Garcez. Ele era muito carinhoso comigo, sempre me tratou bem. Ele era considerado um dos melhores marinhistas da América do Sul e a gente sempre ia à Praia Grande [cidade no litoral de São Paulo] para ele tirar fotos para pintar depois. Naquela época não tinha nada lá, só a Cidade Ocean [atualmente um dos principais bairros de Praia Grande] com umas casinhas e um barzinho, hoje é uma cidade enorme!"}, {"412f": "Eu também tinha muito contato com o meu pai. Ele sempre me levava nos bailes, porque naquele tempo eu não podia ir sozinha. Eu ia vestida de longo, traje a rigor… Quando tocava bolero, meu pai dançava comigo, ele era doido por bolero; agora, nos outros ritmos, ele sentava na mesa e ficava me esperando dançar. Eu sempre dançava com o meu amigo Paulinho — ele era dentista, nem sei se já morreu, se não deve ter mais de 80 anos — e todo mundo achava que ele era meu namorado."}, {"6b56": "Eu também cuidei de muita gente da minha família. O Alzheimer da minha mãe veio de repente. Todo sábado eu ia até a casa dela para fazer uma limpeza, ver os cachorros, cuidar dos gatinhos; toda semana surgia um gato novo no sobrado da minha mãe. Meu padrasto estava no andar de cima pintando e eu fui me despedir da minha mãe no andar de baixo, dei um abraço nela e ela caiu para trás. Gritei e vieram ajudar. Se eu tivesse saído antes, ela teria caído, batido a cabeça e vai saber o que iria acontecer. Desde então ela não falou, não comeu e não andou mais. Foi impressionante. Ela não gemia, não fazia nada, era como uma boneca de pano. Ela me via e abria a boquinha quando queria comer alguma coisa, então eu fazia sopinha, já que ela não sabia mais mastigar. Foram nove meses desse jeito. Ainda assim, meu padrasto morreu antes. Um dia eu estava dando comida para ele e ele começou a cuspir. Fiquei preocupada porque ele nem estava ruim da cabeça, mas ele não sabia também porque estava cuspindo, então fomos ao hospital. Dois dias depois ele faleceu."}, {"50f1": "Você vê, eu era a netinha coitadinha, a priminha coitadinha, a sobrinha coitadinha e a coitadinha aqui foi a única que se formou e ainda cuidou de todo mundo da família. Meu tio Rômulo também morou comigo até morrer. Meu sobrinho Ari criei até os 18 anos. Também cuidei do meu padrasto e da minha mãe”."}, {"9b1c": "“Chamo Maria Theresa por causa da santa Terezinha, padroeira dos missionários”"}, {"2d04": "“Agora que eu não posso mais pegar ônibus sozinha nem sair por aí, tenho uma acompanhante alguns dias da semana. É bom, mas também é ruim, gosto de ser livre”"}, {"e51e": "“Minha mãe gostava mais de pintar gente e natureza morta. Sempre tinha muitas flores nos quadros dela. Esse autorretrato dela é um dos meus preferidos”"}, {"41c8": "“Quando eu fiz nove anos, surgiu uma certeza dentro de mim de que eu morreria aos 54 anos. Não sei explicar. Mas eu estava errada, né? Tenho 86 firme e forte, graças a Deus”"}], "child": "664_1"}