{"name": "665", "parent": "", "content": "Who is Gerard McLean, Part Deux If you have not yet read the first part — while I appreciate your enthusiasm — this would probably make more sense if you started at the beginning. But do what you want; I’m not the boss of you. I grow impatient againAfter a couple years of care-free working, i.e., no management responsibilities, I grew anxious again for a formal leadership role. I had become the lead trainer in the Metro and had the highest trainee retention rate, all while staying at either #1 or #2 in production, but I felt I wanted more. Recognizing that perhaps I would make a good Metro/Area Manager, YLCE (now Huffy Service First) decided to split the Minneapolis Metro into two parts and give me the smaller of the two while the current metro manager would retain the other. My area extended to the MN/IA border, all of St. Paul and most of Western Wisconsin. I spent two years exceeding sales plans, reducing turnover, and generally making my bosses in Dayton, Ohio happy. So, they thought that I might want to take a promotion as an Operations Training Manager at the corporate offices. It wasn’t something they made easy to refuse as they had already replaced me before I said yes, so I moved to Dayton in June of 1991. My daughter had been born three months prior. The job involved flying around the country putting on Train the Trainer workshops and various other duties that worked efficiency into all the systems that started out at the technician level and worked its way through the rest of the organization; from work orders to processing to inventory of repair parts. It was quite interesting, but as was my nature, I found myself being promoted later that year when my boss got promoted. The training department was expanded to include video production, all field employee communications, field IT systems, management training programs, field leadership conferences. I had four managers and dozens of people reporting to me, was flying around the country at the speed of heat and sitting in on high-level client meetings with some pretty major brands. I was sitting on a small empire. And then things started to fall apart at the top. The president of our division was moved into the home corporate offices, my VP was passed over for promotion for the second time and left, several short-term thinkers were promoted and the VP spot was eventually filled by someone who created problems just to be able to solve them. I left to join SPAR Marketing as a VP over human resources and internal operations. A few short years later, Huffy collapsed and the service divisions were sold off in pieces. SPAR was in Minneapolis so the plan was for me to relocate. A few family emergencies came up during my time at SPAR which caused me to rethink relocating and two years after “moving,” I moved back down to Dayton. Since I could not make cars and did not have a security clearance, my employment options were rather limited. I had some graphic design and media skills, so I started up Rivershark Inc. We were a graphic design company for about ten days before we switched to being an Internet company, building out websites and e-strategy solutions. I have to interrupt my story here to tell you how I came up with the name Rivershark. I actually didn’t; my son did. Remember when I told you we spent Saturdays walking down by the Mississippi River? I’m a rambler if you let me and so I was always talking with him. He would point to things in the river and want to know what they were. When I knew, I would tell him — that is a tugboat, a barge, a floating log, a cadaver — but when I didn’t, it became a rivershark. And then it was his job to tell me where that rivershark came from, where he was going and what he was going to do on his trip down the river. I would fill in details about the river like the fact that Mark Twain was in St. Louis and he piloted steam boats. He would include these little tidbits in his stories until they become these intricate narratives of one shark’s journey down the river. So I was struggling with naming my new media company. “What about Rivershark?” my son says. I added a fin in the “h” and we had a company. He now wants 50% of it and we’re still negotiating. So the lesson here is: If you ever think your kids are not listening to your crazy ramblings, you are wrong. They hear everything. This story is being told here is small bits for manufactured drama. I am not yet done writing this very long post, but there is more to read here if you just can’t wait…. ", "title": "Who is Gerard McLean, Part Deux", "sentences": [{"f8e7": "Who is Gerard McLean, Part Deux"}, {"1645": "If you have not yet read the first part — while I appreciate your enthusiasm — this would probably make more sense if you started at the beginning. But do what you want; I’m not the boss of you."}, {"adab": "I grow impatient againAfter a couple years of care-free working, i.e., no management responsibilities, I grew anxious again for a formal leadership role. I had become the lead trainer in the Metro and had the highest trainee retention rate, all while staying at either #1 or #2 in production, but I felt I wanted more. Recognizing that perhaps I would make a good Metro/Area Manager, YLCE (now Huffy Service First) decided to split the Minneapolis Metro into two parts and give me the smaller of the two while the current metro manager would retain the other. My area extended to the MN/IA border, all of St. Paul and most of Western Wisconsin."}, {"b06a": "I spent two years exceeding sales plans, reducing turnover, and generally making my bosses in Dayton, Ohio happy. So, they thought that I might want to take a promotion as an Operations Training Manager at the corporate offices. It wasn’t something they made easy to refuse as they had already replaced me before I said yes, so I moved to Dayton in June of 1991. My daughter had been born three months prior."}, {"c2ab": "The job involved flying around the country putting on Train the Trainer workshops and various other duties that worked efficiency into all the systems that started out at the technician level and worked its way through the rest of the organization; from work orders to processing to inventory of repair parts. It was quite interesting, but as was my nature, I found myself being promoted later that year when my boss got promoted. The training department was expanded to include video production, all field employee communications, field IT systems, management training programs, field leadership conferences. I had four managers and dozens of people reporting to me, was flying around the country at the speed of heat and sitting in on high-level client meetings with some pretty major brands. I was sitting on a small empire."}, {"02fc": "And then things started to fall apart at the top. The president of our division was moved into the home corporate offices, my VP was passed over for promotion for the second time and left, several short-term thinkers were promoted and the VP spot was eventually filled by someone who created problems just to be able to solve them. I left to join SPAR Marketing as a VP over human resources and internal operations. A few short years later, Huffy collapsed and the service divisions were sold off in pieces."}, {"10c2": "SPAR was in Minneapolis so the plan was for me to relocate. A few family emergencies came up during my time at SPAR which caused me to rethink relocating and two years after “moving,” I moved back down to Dayton. Since I could not make cars and did not have a security clearance, my employment options were rather limited. I had some graphic design and media skills, so I started up Rivershark Inc. We were a graphic design company for about ten days before we switched to being an Internet company, building out websites and e-strategy solutions."}, {"652a": "I have to interrupt my story here to tell you how I came up with the name Rivershark. I actually didn’t; my son did. Remember when I told you we spent Saturdays walking down by the Mississippi River? I’m a rambler if you let me and so I was always talking with him. He would point to things in the river and want to know what they were. When I knew, I would tell him — that is a tugboat, a barge, a floating log, a cadaver — but when I didn’t, it became a rivershark. And then it was his job to tell me where that rivershark came from, where he was going and what he was going to do on his trip down the river. I would fill in details about the river like the fact that Mark Twain was in St. Louis and he piloted steam boats. He would include these little tidbits in his stories until they become these intricate narratives of one shark’s journey down the river."}, {"1f16": "So I was struggling with naming my new media company. “What about Rivershark?” my son says. I added a fin in the “h” and we had a company. He now wants 50% of it and we’re still negotiating."}, {"2e51": "So the lesson here is: If you ever think your kids are not listening to your crazy ramblings, you are wrong. They hear everything."}, {"a26d": "This story is being told here is small bits for manufactured drama. I am not yet done writing this very long post, but there is more to read here if you just can’t wait…."}], "child": "665_1"}