{"name": "674", "parent": "", "content": "On the de-unification of my identity I’m undoubtedly one of hundreds of thousands — millions maybe — of “British” people whom today are struggling with the outcome of the EU Referendum. While the marginal majority celebrate the success of the Farage-Johnson-Gove cult, many of my generation hang our heads not just in utter dismay, but in shame, frustration and — above all else — a sense of betrayal. So, I didn’t get my own way. Yah boo sucks. We didn’t win the vote to remain in the European Union. Get over it. Democracy won. But this isn’t about winning or losing a vote. This isn’t even about the political constructs that guide and shape my life. This is much deeper — this is about the very fabric of my being. This is about my identity. I didn’t lose a vote, I lost my “self”. I was born in 1980 to a working class family, living to the North of London in Harlow, a post-war Essex new town. I was born seven years and 24 days after the UK joined the EEC. I attended a state comprehensive school and the local further education college. I was the first person in my immediate family to go to university, right here in the UK. Now, a home owner with a postgraduate degree, two businesses and a fridge stuffed with avocado and quinoa, my life may be more aligned to the middle class, but I live in one of the more deprived and isolated parts of the country in the North East of England — isolated geographically and culturally from a London-centric political system. My business gives me the opportunity to work and to travel all around the world, but the United Kingdom — or England more precisely — remains my home. I didn’t grow up in Little England. I grew up only ever knowing myself to be European (or, as I saw someone else call us this morning, “British European”). I was born as a citizen of the European Union. For years, especially as I’ve worked more and more in North America and Asia, I’ve held such pride and esteem in being British-European. This isn’t about having a “cool” accent, or being surrounded by really old buildings, and this has absolutely nothing to do with distant colonialism. This is about personal pride in having an identity that’s associated with intellectual endeavour, a value system based on freedom and equality for all, and the united ability for a system of cultures and behaviours so wildly diverse to actually work together in harmony and to the benefit of all (yes, I really believe that). The EU — through all its bureaucracy and quirks — sits as a beacon to the rest of the world, demonstrating that when we unite in our differences we are stronger, more peaceful, and more prosperous for it. And this reaches the heart of my values — and therefore the heart of my identity — inextricably bound to the political system that I have always known. Inextricably bound to trans-national union, collaboration and co-operation. As someone who works in and with universities around the world, I too am wedded to the pursuit of intellectualism and expertise, to fact-based and rational decisions informed by research and evidence. This is a core value shared throughout the EU and hugely supported by funding, infrastructure and freedoms offered to us through that Union. And the result of this vote is not just an act of separation and nationalism, but above all else an act of anti-intellectualism. The anti-expert sentiment expressed by Gove and his sheep is not just worrying, it’s outright dangerous. So, for me I don’t just feel like I’m seeing my political situation change, and I’m not just a stroppy leftie thirty-something with a nice comfortable life annoyed that I didn’t get my own way. Instead, I feel like the basis upon which my personal value system is founded, and to which it is so strongly wedded, is being torn away from me. It’s the conflict being fought out as one part of my identity rejects the other, as my Britishness is wrenched from my European Unionism. Where do we even begin to go with that? And then there are the voices of conciliation: “Let’s accept what’s happened and remember to just unite and love each other, and just get on with it.” When our fellow Brits elected a Tory government last year, I could just about bring myself to adopt an conciliatory approach. But this is different. In an act that at its very core is one of separation, for me there is only paradox in following this with a call for unity and union. And when my very identity is being separated in two, how do I find that unity and union even within myself, let alone find unity with those whose cross-in-a-box demanded separation? So, you’re still British-European, Tracy, but you will no longer be united in Europe and in yourself. Europe hasn’t gone, but union has for my generation and for our future, unless we make a significant change now. The union of cultures, the union of economies, the union of intellectual advancement, the union of diversity, the union of nations, the union of peace, the union of regions, the union of my identity, all broken apart by a penciled cross fuelled by anti-intellectualism, fear and — for some — hate. ", "title": "On the de-unification of my identity", "sentences": [{"aeb7": "On the de-unification of my identity"}, {"547e": "I’m undoubtedly one of hundreds of thousands — millions maybe — of “British” people whom today are struggling with the outcome of the EU Referendum. While the marginal majority celebrate the success of the Farage-Johnson-Gove cult, many of my generation hang our heads not just in utter dismay, but in shame, frustration and — above all else — a sense of betrayal."}, {"2458": "So, I didn’t get my own way. Yah boo sucks. We didn’t win the vote to remain in the European Union. Get over it. Democracy won."}, {"b6b9": "But this isn’t about winning or losing a vote. This isn’t even about the political constructs that guide and shape my life. This is much deeper — this is about the very fabric of my being. This is about my identity. I didn’t lose a vote, I lost my “self”."}, {"6476": "I was born in 1980 to a working class family, living to the North of London in Harlow, a post-war Essex new town. I was born seven years and 24 days after the UK joined the EEC. I attended a state comprehensive school and the local further education college. I was the first person in my immediate family to go to university, right here in the UK. Now, a home owner with a postgraduate degree, two businesses and a fridge stuffed with avocado and quinoa, my life may be more aligned to the middle class, but I live in one of the more deprived and isolated parts of the country in the North East of England — isolated geographically and culturally from a London-centric political system. My business gives me the opportunity to work and to travel all around the world, but the United Kingdom — or England more precisely — remains my home."}, {"c5ce": "I didn’t grow up in Little England. I grew up only ever knowing myself to be European (or, as I saw someone else call us this morning, “British European”). I was born as a citizen of the European Union."}, {"1308": "For years, especially as I’ve worked more and more in North America and Asia, I’ve held such pride and esteem in being British-European. This isn’t about having a “cool” accent, or being surrounded by really old buildings, and this has absolutely nothing to do with distant colonialism. This is about personal pride in having an identity that’s associated with intellectual endeavour, a value system based on freedom and equality for all, and the united ability for a system of cultures and behaviours so wildly diverse to actually work together in harmony and to the benefit of all (yes, I really believe that). The EU — through all its bureaucracy and quirks — sits as a beacon to the rest of the world, demonstrating that when we unite in our differences we are stronger, more peaceful, and more prosperous for it. And this reaches the heart of my values — and therefore the heart of my identity — inextricably bound to the political system that I have always known. Inextricably bound to trans-national union, collaboration and co-operation."}, {"383a": "As someone who works in and with universities around the world, I too am wedded to the pursuit of intellectualism and expertise, to fact-based and rational decisions informed by research and evidence. This is a core value shared throughout the EU and hugely supported by funding, infrastructure and freedoms offered to us through that Union. And the result of this vote is not just an act of separation and nationalism, but above all else an act of anti-intellectualism. The anti-expert sentiment expressed by Gove and his sheep is not just worrying, it’s outright dangerous."}, {"f435": "So, for me I don’t just feel like I’m seeing my political situation change, and I’m not just a stroppy leftie thirty-something with a nice comfortable life annoyed that I didn’t get my own way. Instead, I feel like the basis upon which my personal value system is founded, and to which it is so strongly wedded, is being torn away from me. It’s the conflict being fought out as one part of my identity rejects the other, as my Britishness is wrenched from my European Unionism. Where do we even begin to go with that?"}, {"a2e6": "And then there are the voices of conciliation: “Let’s accept what’s happened and remember to just unite and love each other, and just get on with it.” When our fellow Brits elected a Tory government last year, I could just about bring myself to adopt an conciliatory approach. But this is different. In an act that at its very core is one of separation, for me there is only paradox in following this with a call for unity and union. And when my very identity is being separated in two, how do I find that unity and union even within myself, let alone find unity with those whose cross-in-a-box demanded separation?"}, {"db17": "So, you’re still British-European, Tracy, but you will no longer be united in Europe and in yourself. Europe hasn’t gone, but union has for my generation and for our future, unless we make a significant change now. The union of cultures, the union of economies, the union of intellectual advancement, the union of diversity, the union of nations, the union of peace, the union of regions, the union of my identity, all broken apart by a penciled cross fuelled by anti-intellectualism, fear and — for some — hate."}], "child": "674_1\t674_2\t674_3\t674_4\t674_5\t674_6"}