{"sentences": [{"2b82": "The 10 GitHub repos new developers mention the most"}, {"4a86": "The freeCodeCamp community generates gigabytes of data each week. One of the most active parts of the community is the chat room system. Thousands of people hang out there, chat about technology, and help each other improve their code skills."}, {"3d7a": "I frequently ask questions of the data. This week, I was curious which GitHub repositories people found to be the most relevant to their studies. So I analyzed the multi-gigabyte chat history from freeCodeCamp’s main chatroom."}, {"e319": "Out of the thousands of GitHub repositories mentioned, here are the 10 most-commonly mentioned ones:"}, {"e64a": "freeCodeCamp/freeCodeCamp"}, {"93ab": "You probably saw this one coming. But this isn’t just because of where I got the data from. The freeCodeCamp community’s learning platform itself is quite popular, with nearly 250k stars, more than 10k forks, and hundreds of new issues and pull requests each week."}, {"286e": "Thus, people mention it in the chatroom quite a bit."}, {"32f8": "getify/You-Dont-Know-JS"}, {"d62e": "Kyle Simpson’s You Don’t Know JavaScript is without a doubt the unofficial reference book for the freeCodeCamp community. Kyle is also currently working on another similar project as YDKJS, “Functional Light JS”, which is gradually getting mentioned more and more."}, {"0303": "vhf/free-programming-books"}, {"b3ff": "A frequently updated list of free resources. This repository is a well organized compilation of material collected from many parts of the world. It includes books, podcasts, websites, developer tools… you name it. Definitively a “must” for people who are learning to code."}, {"5b42": "twbs/bootstrap"}, {"7dfc": "The Github account of Bootstrap, the well-known responsive web design framework. The repository provides mostly technical information, but also has additional links to other useful sites. If you’re looking for more detailed documentation about the framework, you should also visit getbootstrap.com."}, {"ea62": "jwasham/coding-interview-university"}, {"afa3": "Googley as Heck created this repository to document his 8-month process of preparing for the Google interview. It includes a detailed list of the things you should know to pass Google’s infamous whiteboard tests, and links to references that clearly explain various computer science concepts. (By the way, after all this preparation he took a job at Amazon instead.)"}, {"d9a6": "ericelliott/essential-javascript-links"}, {"411b": "Eric Elliott’s JavaScript Links repository was for a long time the most popular resource list within the freeCodeCamp community. (It was recently dethroned by vhf/free-programming-books.)"}, {"a6dc": "d3/d3"}, {"7e64": "If you want to learn d3.js, this official GitHub repository is one of the best places to start. The two areas of this repo that the freeCodeCamp mentions the most are actually inside its wiki:"}, {"3299": "These contain excellent information, as well as list of references you can use to learn d3.js on your own."}, {"1b93": "vinta/awesome-python"}, {"c6da": "Billed as a “curated list of awesome Python frameworks, libraries, software and resources”, this is a great place to start if you want to get better at Python."}, {"9a0a": "oneuijs/You-Dont-Need-jQuery"}, {"e7da": "This is a well-known repository that focus on solving typical programming problems with the use of vanilla JavaScript. This repository’s rise has been closely tied with the rise of React."}, {"9020": "toddmotto/public-apis"}, {"3588": "A nice and frequently updated collection public APIs. The APIs are even broken down into categories, which makes exploring them much easier."}, {"51de": "In case you’re wondering, all the data was obtained from freeCodeCamp’s main Gitter chatroom between June 2016 and March 2017. I ran a Python script to evaluate the data, then rated the observed GitHub links based on the number of mentions as well as how recent the mentions. I made the final selection was based on relevance."}, {"9d55": "Again, this list just scratches the surface. freeCodeCamp’s community references hundreds of repositories every day."}, {"7158": "Thanks for reading, and happy coding!"}], "content": "The 10 GitHub repos new developers mention the most The freeCodeCamp community generates gigabytes of data each week. One of the most active parts of the community is the chat room system. Thousands of people hang out there, chat about technology, and help each other improve their code skills. I frequently ask questions of the data. This week, I was curious which GitHub repositories people found to be the most relevant to their studies. So I analyzed the multi-gigabyte chat history from freeCodeCamp’s main chatroom. Out of the thousands of GitHub repositories mentioned, here are the 10 most-commonly mentioned ones: freeCodeCamp/freeCodeCamp You probably saw this one coming. But this isn’t just because of where I got the data from. The freeCodeCamp community’s learning platform itself is quite popular, with nearly 250k stars, more than 10k forks, and hundreds of new issues and pull requests each week. Thus, people mention it in the chatroom quite a bit. getify/You-Dont-Know-JS Kyle Simpson’s You Don’t Know JavaScript is without a doubt the unofficial reference book for the freeCodeCamp community. Kyle is also currently working on another similar project as YDKJS, “Functional Light JS”, which is gradually getting mentioned more and more. vhf/free-programming-books A frequently updated list of free resources. This repository is a well organized compilation of material collected from many parts of the world. It includes books, podcasts, websites, developer tools… you name it. Definitively a “must” for people who are learning to code. twbs/bootstrap The Github account of Bootstrap, the well-known responsive web design framework. The repository provides mostly technical information, but also has additional links to other useful sites. If you’re looking for more detailed documentation about the framework, you should also visit getbootstrap.com. jwasham/coding-interview-university Googley as Heck created this repository to document his 8-month process of preparing for the Google interview. It includes a detailed list of the things you should know to pass Google’s infamous whiteboard tests, and links to references that clearly explain various computer science concepts. (By the way, after all this preparation he took a job at Amazon instead.) ericelliott/essential-javascript-links Eric Elliott’s JavaScript Links repository was for a long time the most popular resource list within the freeCodeCamp community. (It was recently dethroned by vhf/free-programming-books.) d3/d3 If you want to learn d3.js, this official GitHub repository is one of the best places to start. The two areas of this repo that the freeCodeCamp mentions the most are actually inside its wiki: These contain excellent information, as well as list of references you can use to learn d3.js on your own. vinta/awesome-python Billed as a “curated list of awesome Python frameworks, libraries, software and resources”, this is a great place to start if you want to get better at Python. oneuijs/You-Dont-Need-jQuery This is a well-known repository that focus on solving typical programming problems with the use of vanilla JavaScript. This repository’s rise has been closely tied with the rise of React. toddmotto/public-apis A nice and frequently updated collection public APIs. The APIs are even broken down into categories, which makes exploring them much easier. In case you’re wondering, all the data was obtained from freeCodeCamp’s main Gitter chatroom between June 2016 and March 2017. I ran a Python script to evaluate the data, then rated the observed GitHub links based on the number of mentions as well as how recent the mentions. I made the final selection was based on relevance. Again, this list just scratches the surface. freeCodeCamp’s community references hundreds of repositories every day. Thanks for reading, and happy coding! ", "parent": "", "title": "The 10 GitHub repos new developers mention the most", "child": "68_1\t68_2\t68_3\t68_4\t68_5\t68_6\t68_7\t68_8", "name": "68"}