{"name": "681", "parent": "", "content": "Why should you create at all? When everyone is doing the same thing, does doing even matter? I am writing this because, there was a time in my life when I questioned the entire purpose behind creation. Sometimes, I still do. And, it’s because I find myself inundated by immense information and content every single day from the numerous channels online. The creative efforts of other individuals from all across the globe are now accessible through a single click. Everyone seems to be upto something. For every creative idea that exists, there is at least one more person working on it at some place in this world. Be it a work of art, a song, an article, or a business venture. It seems like nothing is unprecedented or original anymore. It’s a fact then, that there are probably hundreds of articles already written about the writing ideas that you have in your mind right now, there are a dozen of art pieces made on theme of art that you have in mind and the same is true with everything else. In such a scenario, it becomes almost impossible to believe that your creative efforts can ever count to something significant. I wonder, how would you then even convince yourself to take action? Why would you care about learning a new form of art? Why would you care to create another painting/sketch which would seem just like a hundred of similar art pieces in the world? I have thought about this too often. In time though, the answers to these questions started to come to me. For instance, I realised that the form of art that you are attracted to is often a reflection of an imbalance within you. Taking my own example, I admit that I am an extremely impatient and anxious person. I can not even hold a thought still in my head at times. I am so much pro-action that I suffer from a serious lack of planning and organisation. I just can not stop and give things a rest. Then, about a year back I started feeling this strong urge to learn calligraphy. I would follow calligraphy pages on Instagram and see the beautiful slow movements of the pen nibs and the way ink flowed from it casting the most elegant strokes on paper. I fell in love with it. And, I decided to pursue calligraphy as a form of art. But when I started to learn, I realised that it was a real test of patience for someone like me. The ink would bead and create nasty impressions if I was too fast with my down-strokes. It was something that demanded of me to slow down my usual pace and give up for a while the habit of rushing through things. I learnt to tune my strokes to slow music playing in the background and now, the times when I am able to complete a single practice sheet beautifully, I feel the most peaceful feeling within me. It’s a form of creative expression that balances me. “Something is always born of excess: great art was born of great terrors, great loneliness, great inhibitions, instabilities and it always balances them.” — Anaïs Nin One of my recent calligraphy practice worksheets Some of my friends who are great poets, writers and artists create the most amazing works when they are in a state of imbalance created by restlessness, anxiety, depression or any other intense emotion that feeds within them, the desire to create. And I think, creation is the most beautiful way to channel that energy. So that was one of the answers that I gave to myself. “You must create because it’s important to you. There is an energy within you which deserves a creative outlet. There is an imbalance in you which can be brought to balance through your creations. So it doesn’t matter what becomes of your creations. What matters is that it’s out there. What matters is that you create.” But sometimes, that wasn’t enough. There was a fear of judgment too. I knew that a lot of people were capable of looking down or passing a judgement. After all, creative expression is often an intimate process and it might reveal parts of your life and personality that you are not willing to share with the world. One might then suggest, to not share them at all. To create something and then keep it to yourself. And while that seemed like a fair advice which would work for some, for me, it kind of defeated the entire motive of creation. From my own experience, I could recall feeling extremely moved by some of the greatest writings I have come across so far. I have felt extremely inspired by the calligraphers who made sure they posted their works online regularly for the world to see. I have felt thoroughly touched by some of the poetry I have read. I always remember the great works of art that move me. More importantly, I have felt inspired by amateurs and professionals alike. For one showed the beginning, the other showed what constant efforts could lead to. So, for me the purpose of creation was only one. To connect and to move. Even if it was just one person that I could manage to touch through my creations. “If we can write or sing or create in some way, even when we are dealing with difficulties or pain, then it becomes something bigger than ourselves — and often beautiful.” ― Brenda Peterson Thinking about this, helped me overcome my fear of judgement. Over time, as I started to develop an even deeper realisation about the purpose of creativity, I concluded that my notions about every creation being similar to others were indeed wrong. Because, while the idea could possibly be the same, there were no two people who thought about it in the exact same way or expressed their thoughts through their art in the same exact manner. Just the way no two people were exactly alike, no two creations could be exactly alike. I also realised the importance of time in this context. At the time in which you exist on this planet, you are perceiving the world and its realities in a way that is unprecedented. The times are always and always changing. What is relevant today might not be relevant tomorrow. Something that you create or write might become an important memoir of the times you live in. And hence, it is the purpose of the artist to talk about what goes on in the world and in their heart, truly, passionately and ferociously. It’s the purpose of the artist to create. “The most we can do is write — intelligently, creatively and evocatively — about what it is like living in the world at this time.” — Oliver Sacks Whoever you are, whatever you experience, however you feel, your story matters and you matter. Your perception matters. And that, is the sole purpose of creation. 10 Thought Pills For The Anxious MindThings I do to cope up with my anxiety everydaythecoffeelicious.com If you enjoyed reading, please spread the word by hitting that little heart! I am Shreya Dalela, co-Founder at Speaking Walls, an art-inspired lifestyle brand and Marketing Manager at Dextra, a collaborative platformfor everyone creative. I believe in the power of creative expression and creative collaboration. Through my writings, I aim to inspire people who are on a similar journey. ", "title": "Why should you create at all?", "sentences": [{"1b1e": "Why should you create at all?"}, {"7a14": "When everyone is doing the same thing, does doing even matter?"}, {"72ce": "I am writing this because, there was a time in my life when I questioned the entire purpose behind creation. Sometimes, I still do."}, {"cc21": "And, it’s because I find myself inundated by immense information and content every single day from the numerous channels online. The creative efforts of other individuals from all across the globe are now accessible through a single click."}, {"bc7a": "Everyone seems to be upto something."}, {"920d": "For every creative idea that exists, there is at least one more person working on it at some place in this world. Be it a work of art, a song, an article, or a business venture. It seems like nothing is unprecedented or original anymore."}, {"23a9": "It’s a fact then, that there are probably hundreds of articles already written about the writing ideas that you have in your mind right now, there are a dozen of art pieces made on theme of art that you have in mind and the same is true with everything else."}, {"2089": "In such a scenario, it becomes almost impossible to believe that your creative efforts can ever count to something significant."}, {"acf9": "I wonder, how would you then even convince yourself to take action? Why would you care about learning a new form of art? Why would you care to create another painting/sketch which would seem just like a hundred of similar art pieces in the world?"}, {"8f8f": "I have thought about this too often."}, {"4c00": "In time though, the answers to these questions started to come to me."}, {"3024": "For instance, I realised that the form of art that you are attracted to is often a reflection of an imbalance within you."}, {"a17d": "Taking my own example, I admit that I am an extremely impatient and anxious person. I can not even hold a thought still in my head at times. I am so much pro-action that I suffer from a serious lack of planning and organisation. I just can not stop and give things a rest."}, {"2c6f": "Then, about a year back I started feeling this strong urge to learn calligraphy. I would follow calligraphy pages on Instagram and see the beautiful slow movements of the pen nibs and the way ink flowed from it casting the most elegant strokes on paper. I fell in love with it."}, {"2849": "And, I decided to pursue calligraphy as a form of art."}, {"120c": "But when I started to learn, I realised that it was a real test of patience for someone like me. The ink would bead and create nasty impressions if I was too fast with my down-strokes. It was something that demanded of me to slow down my usual pace and give up for a while the habit of rushing through things."}, {"8aaa": "I learnt to tune my strokes to slow music playing in the background and now, the times when I am able to complete a single practice sheet beautifully, I feel the most peaceful feeling within me."}, {"0b3e": "It’s a form of creative expression that balances me."}, {"f705": "“Something is always born of excess: great art was born of great terrors, great loneliness, great inhibitions, instabilities and it always balances them.” — Anaïs Nin"}, {"a07c": "One of my recent calligraphy practice worksheets"}, {"9034": "Some of my friends who are great poets, writers and artists create the most amazing works when they are in a state of imbalance created by restlessness, anxiety, depression or any other intense emotion that feeds within them, the desire to create."}, {"1c46": "And I think, creation is the most beautiful way to channel that energy."}, {"d622": "So that was one of the answers that I gave to myself."}, {"fab4": "“You must create because it’s important to you. There is an energy within you which deserves a creative outlet. There is an imbalance in you which can be brought to balance through your creations. So it doesn’t matter what becomes of your creations. What matters is that it’s out there. What matters is that you create.”"}, {"877d": "But sometimes, that wasn’t enough."}, {"6ebc": "There was a fear of judgment too."}, {"1a71": "I knew that a lot of people were capable of looking down or passing a judgement. After all, creative expression is often an intimate process and it might reveal parts of your life and personality that you are not willing to share with the world."}, {"635e": "One might then suggest, to not share them at all. To create something and then keep it to yourself."}, {"6113": "And while that seemed like a fair advice which would work for some, for me, it kind of defeated the entire motive of creation."}, {"5050": "From my own experience, I could recall feeling extremely moved by some of the greatest writings I have come across so far. I have felt extremely inspired by the calligraphers who made sure they posted their works online regularly for the world to see. I have felt thoroughly touched by some of the poetry I have read."}, {"bb32": "I always remember the great works of art that move me."}, {"0615": "More importantly, I have felt inspired by amateurs and professionals alike. For one showed the beginning, the other showed what constant efforts could lead to."}, {"a2ef": "So, for me the purpose of creation was only one. To connect and to move. Even if it was just one person that I could manage to touch through my creations."}, {"ebce": "“If we can write or sing or create in some way, even when we are dealing with difficulties or pain, then it becomes something bigger than ourselves — and often beautiful.” ― Brenda Peterson"}, {"c3bc": "Thinking about this, helped me overcome my fear of judgement."}, {"e6da": "Over time, as I started to develop an even deeper realisation about the purpose of creativity, I concluded that my notions about every creation being similar to others were indeed wrong."}, {"3643": "Because, while the idea could possibly be the same, there were no two people who thought about it in the exact same way or expressed their thoughts through their art in the same exact manner."}, {"ae99": "Just the way no two people were exactly alike, no two creations could be exactly alike."}, {"77c6": "I also realised the importance of time in this context."}, {"6679": "At the time in which you exist on this planet, you are perceiving the world and its realities in a way that is unprecedented. The times are always and always changing. What is relevant today might not be relevant tomorrow."}, {"75de": "Something that you create or write might become an important memoir of the times you live in."}, {"73e7": "And hence, it is the purpose of the artist to talk about what goes on in the world and in their heart, truly, passionately and ferociously."}, {"4607": "It’s the purpose of the artist to create."}, {"1dac": "“The most we can do is write — intelligently, creatively and evocatively — about what it is like living in the world at this time.” — Oliver Sacks"}, {"b8e1": "Whoever you are, whatever you experience, however you feel, your story matters and you matter. Your perception matters. And that, is the sole purpose of creation."}, {"f65a": "10 Thought Pills For The Anxious MindThings I do to cope up with my anxiety everydaythecoffeelicious.com"}, {"7245": "If you enjoyed reading, please spread the word by hitting that little heart!"}, {"9332": "I am Shreya Dalela, co-Founder at Speaking Walls, an art-inspired lifestyle brand and Marketing Manager at Dextra, a collaborative platformfor everyone creative. I believe in the power of creative expression and creative collaboration. Through my writings, I aim to inspire people who are on a similar journey."}], "child": "681_1\t681_2\t681_3\t681_4\t681_5\t681_6\t681_7\t681_8\t681_9\t681_10\t681_11\t681_12\t681_13\t681_14\t681_15681_1\t681_2\t681_3\t681_4\t681_5\t681_6\t681_7\t681_8\t681_9\t681_10\t681_11\t681_12\t681_13\t681_14\t681_15681_1\t681_2\t681_3\t681_4\t681_5\t681_6\t681_7\t681_8\t681_9\t681_10\t681_11\t681_12\t681_13\t681_14\t681_15"}