{"name": "682", "parent": "", "content": "Stuck in Unhappiness: How We Get There (And How to Get Out) There’s a story unhappy people tell themselves. This story — this myth — is a big reason why unhappy people stay unhappy. Let’s look at a story I tell myself sometimes, from Theodore Zeldin’s A Intimate History of Humanity: “…in the beginning everybody lived cosily in a family or tribe, people did not originally even know what loneliness was, never conceiving of themselves as separate individuals. Then suddenly, quite recently, togetherness crumbled. Now, not only is an epidemic of loneliness sweeping the world, hand in hand with prosperity, but the more successful you are, the more likely you are to suffer from it; and money cannot buy you out.” Pretty convincing, yea? Part of me still believes it. Zeldin warns against this self-storytelling. If we believe happiness is an impossibility — a long-dead artifact of ancient times — why search for it at all? Our belief defines our reality. Humans have always been unhappy at times. And, in each age, they have found a way to fight back. For another perspective on this matter, let’s dig into the personal notebooks of Samuel Butler, written over 100 years ago: “At least one half of the misery which meets us daily might be removed or, at any rate, greatly alleviated, if those who suffer by it would think it worth their while to be at any pains to get rid of it.” How We Get Stuck How to be happy, says Butler, is not something they teach in school: “One can bring no greater reproach against a man than to say that he does not set sufficient value upon pleasure, and there is no greater sign of a fool than the thinking that he can tell at once and easily what it is that pleases him. To know this is not easy, and how to extend our knowledge of it is the highest and the most neglected of all arts and branches of education.” In school, they taught us math. They taught us science. But, in my experience, nobody taught us how to live. It’s not my goal to argue whether happiness is worth chasing — that’s for you to decide. But if you do want to be happy, then it makes no sense to wait for it to come to you. There are reasons other than self-storytelling that make people unhappy. Butler shares one of them: “One reason why we find it so hard to know our own likings is because we are so little accustomed to try; we have our likings found for us in respect of by far the greater number of the matters that concern us; thus we have grown all our limbs on the strength of the likings of our ancestors and adopt these without question.” I’ve seen it happen. When people make effort to change themselves, they do. In the past, I would look down on those who didn’t change, calling them “lazy” or “stupid.” Lately, I realize it’s not the case. People aren’t lazy, they’re just stuck, stuck in a whirlwind of habit and false belief. Without outside help, sometimes they’ll never get out. Some things that might cause this: You, the reader, are lucky. If you’re here reading this, it means you have the power, the agency, to direct change in your life. But how do we direct change? Butler has some ideas on that too… Getting to Happiness In his notebooks, Butler goes on to explain how to take control: “To those, however, who are desirous of knowing what gives them pleasure but do not quite know how to set about it I have no better advice to give than that they must take the same pains about acquiring this difficult art as about any other, and must acquire it in the same way — that is by attending to one thing at a time and not being in too great a hurry.” Sorry folks, no magic powder here. You can’t buy happiness for three easy payments of $99.99. With that said, the process is simple (it’s the doing that’s hard). Learning how to be happy is not much different from, say, learning how to juggle. Challenge Assumptions First, Butler says to doubt your beliefs: “Above all things it is necessary here, as in all other branches of study, not to think we know a thing before we do know it — to make sure of our ground and be quite certain that we really do like a thing before we say we do. When you cannot decide whether you like a thing or not, nothing is easier than to say so and to hang it up among the uncertainties.” Or, put simply: Make sure you really like something before you say you do. Don’t be afraid to say “I don’t know.” Get in the habit of looking at what you (and the people around you) believe to be true. Ask: “Does this really make me happy? How do I know?” Test Drive Sometimes, no amount of armchair philosophy will get you to the right answer. In times like that, Butler recommends a test drive: “Or when you know you do not know and are in such doubt as to see no chance of deciding, then you may take one side or the other provisionally and throw yourself into it. This will sometimes make you uncomfortable, and you will feel you have taken the wrong side and thus learn that the other was the right one. Sometimes you will feel you have done right. Any way ere long you will know more about it.” Or, put simply: Can’t decide? Pick something and try it. If it went well, maybe it’s good. If it didn’t, maybe it’s bad. Keep going until you’re sure. I thought AcroYoga was the silliest thing ever, a perversion of an ancient art. But when I tried it, it was really fun. I made up reasons not to like it, and none of them were true. Never marry someone a week after meeting them. The more serious the decision, the more you should in invest in getting it right. The Great Experiment If you think about it, what Butler is telling us is something we all knew already. He’s telling us to: Sounds familiar? We learned it science class all those years ago. It’s the scientific method. So here’s the big takeaway for me. The how-to of life is not a science. But this does NOT mean we shouldn’t apply methods of science to our lives. And, of course, no easy answers does not mean there are no answers at all. Maybe that stuff they taught us in school wasn’t so useless after all. Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here. Originally published at marketmeditations.com. ", "title": "Stuck in Unhappiness: How We Get There (And How to Get Out)", "sentences": [{"9159": "Stuck in Unhappiness: How We Get There (And How to Get Out)"}, {"a981": "There’s a story unhappy people tell themselves."}, {"e3a9": "This story — this myth — is a big reason why unhappy people stay unhappy."}, {"e7c3": "Let’s look at a story I tell myself sometimes, from Theodore Zeldin’s A Intimate History of Humanity:"}, {"6a5a": "“…in the beginning everybody lived cosily in a family or tribe, people did not originally even know what loneliness was, never conceiving of themselves as separate individuals. Then suddenly, quite recently, togetherness crumbled. Now, not only is an epidemic of loneliness sweeping the world, hand in hand with prosperity, but the more successful you are, the more likely you are to suffer from it; and money cannot buy you out.”"}, {"959b": "Pretty convincing, yea? Part of me still believes it."}, {"c9cb": "Zeldin warns against this self-storytelling. If we believe happiness is an impossibility — a long-dead artifact of ancient times — why search for it at all?"}, {"1d98": "Our belief defines our reality."}, {"1e42": "Humans have always been unhappy at times. And, in each age, they have found a way to fight back."}, {"5ddf": "For another perspective on this matter, let’s dig into the personal notebooks of Samuel Butler, written over 100 years ago:"}, {"1786": "“At least one half of the misery which meets us daily might be removed or, at any rate, greatly alleviated, if those who suffer by it would think it worth their while to be at any pains to get rid of it.”"}, {"7874": "How We Get Stuck"}, {"d7a5": "How to be happy, says Butler, is not something they teach in school:"}, {"d2ee": "“One can bring no greater reproach against a man than to say that he does not set sufficient value upon pleasure, and there is no greater sign of a fool than the thinking that he can tell at once and easily what it is that pleases him. To know this is not easy, and how to extend our knowledge of it is the highest and the most neglected of all arts and branches of education.”"}, {"9ed8": "In school, they taught us math. They taught us science. But, in my experience, nobody taught us how to live."}, {"925a": "It’s not my goal to argue whether happiness is worth chasing — that’s for you to decide. But if you do want to be happy, then it makes no sense to wait for it to come to you."}, {"05c6": "There are reasons other than self-storytelling that make people unhappy. Butler shares one of them:"}, {"d732": "“One reason why we find it so hard to know our own likings is because we are so little accustomed to try; we have our likings found for us in respect of by far the greater number of the matters that concern us; thus we have grown all our limbs on the strength of the likings of our ancestors and adopt these without question.”"}, {"77bc": "I’ve seen it happen. When people make effort to change themselves, they do. In the past, I would look down on those who didn’t change, calling them “lazy” or “stupid.”"}, {"7e61": "Lately, I realize it’s not the case."}, {"18d8": "People aren’t lazy, they’re just stuck, stuck in a whirlwind of habit and false belief. Without outside help, sometimes they’ll never get out."}, {"a96a": "Some things that might cause this:"}, {"1457": "You, the reader, are lucky. If you’re here reading this, it means you have the power, the agency, to direct change in your life."}, {"10cc": "But how do we direct change?"}, {"57e3": "Butler has some ideas on that too…"}, {"6fb4": "Getting to Happiness"}, {"73bd": "In his notebooks, Butler goes on to explain how to take control:"}, {"b626": "“To those, however, who are desirous of knowing what gives them pleasure but do not quite know how to set about it I have no better advice to give than that they must take the same pains about acquiring this difficult art as about any other, and must acquire it in the same way — that is by attending to one thing at a time and not being in too great a hurry.”"}, {"39f7": "Sorry folks, no magic powder here. You can’t buy happiness for three easy payments of $99.99."}, {"3414": "With that said, the process is simple (it’s the doing that’s hard). Learning how to be happy is not much different from, say, learning how to juggle."}, {"822c": "Challenge Assumptions"}, {"739c": "First, Butler says to doubt your beliefs:"}, {"1fae": "“Above all things it is necessary here, as in all other branches of study, not to think we know a thing before we do know it — to make sure of our ground and be quite certain that we really do like a thing before we say we do. When you cannot decide whether you like a thing or not, nothing is easier than to say so and to hang it up among the uncertainties.”"}, {"dc4c": "Or, put simply:"}, {"91b1": "Make sure you really like something before you say you do. Don’t be afraid to say “I don’t know.”"}, {"b134": "Get in the habit of looking at what you (and the people around you) believe to be true. Ask: “Does this really make me happy? How do I know?”"}, {"ac48": "Test Drive"}, {"df2a": "Sometimes, no amount of armchair philosophy will get you to the right answer."}, {"28c0": "In times like that, Butler recommends a test drive:"}, {"9427": "“Or when you know you do not know and are in such doubt as to see no chance of deciding, then you may take one side or the other provisionally and throw yourself into it. This will sometimes make you uncomfortable, and you will feel you have taken the wrong side and thus learn that the other was the right one. Sometimes you will feel you have done right. Any way ere long you will know more about it.”"}, {"282d": "Or, put simply:"}, {"5827": "Can’t decide? Pick something and try it. If it went well, maybe it’s good. If it didn’t, maybe it’s bad. Keep going until you’re sure."}, {"0046": "I thought AcroYoga was the silliest thing ever, a perversion of an ancient art. But when I tried it, it was really fun. I made up reasons not to like it, and none of them were true."}, {"84a1": "Never marry someone a week after meeting them. The more serious the decision, the more you should in invest in getting it right."}, {"a596": "The Great Experiment"}, {"af55": "If you think about it, what Butler is telling us is something we all knew already."}, {"130f": "He’s telling us to:"}, {"fc5b": "Sounds familiar? We learned it science class all those years ago. It’s the scientific method."}, {"1ae1": "So here’s the big takeaway for me."}, {"5d91": "The how-to of life is not a science. But this does NOT mean we shouldn’t apply methods of science to our lives. And, of course, no easy answers does not mean there are no answers at all."}, {"c09b": "Maybe that stuff they taught us in school wasn’t so useless after all."}, {"7f5e": "Want more? Join over 15,000 readers getting The Open Circle, a weekly dose of my best ideas. I’ll also send you 200+ pages from my private notebooks and 24 of my favorite books. Get it here."}, {"5d54": "Originally published at marketmeditations.com."}], "child": "682_1\t682_2\t682_3\t682_4\t682_5\t682_6\t682_7\t682_8\t682_9682_1\t682_2\t682_3\t682_4\t682_5\t682_6\t682_7\t682_8\t682_9682_1\t682_2\t682_3\t682_4\t682_5\t682_6\t682_7\t682_8\t682_9"}