{"name": "684", "parent": "", "content": "Is it worth the trouble? In 1942 Albert Camus wrote a book called “The Myth of Sisyphus”. It is about the one truly important philosophical problem: Given the circumstances of our existence, shouldn’t we just kill ourselves? This is his answer: At first Camus describes those moments in our lives when our ideas about the world suddenly don’t work anymore, when every daily routine — going to work and back — and all our efforts seem pointless and misdirected. When one suddenly feels foreign and divorced from this world. In these frightening moments of clarity we feel the absurdity of life. Reason + Unreasonable World = Absurd Life This absurd sensitivity is the result of a conflict. On the one hand we make reasonable plans for our lives, and on the other hand we are confronted with an unpredictable world which does not comply with our ideas. So what is absurd? Being reasonable in an unreasonable world. This is the basic conflict we are confronted with. The tension between our reasonable ideas about the world, which collide with what we actually experience over time. And there is the biggest problem of all: We can boldly declare our ideas about the world as “eternal”, and at the same time we know that our life time is finite. We are all going to die. Yes, you too. So if reason and an unreasonable world are the key components, then — argues Camus — we could “cheat” and avoid the problem of the absurd by simply eliminating one of the two. Denying the unreasonable world One way is to ignore the senselessness of our existence. Contrary to obvious evidence we could pretend that things are stable and live our lives according to distant goals (retirement, the big breakthrough, an afterlife, the progress of mankind, etc.). Camus says, if we do so, we can’t act freely, since our actions are tied to those eternal plans — which more often than not are doomed to shatter in the cliffs of the unreasonable world. At this point clinging to our reasonable models would not be reasonable anymore. We would be forced to live in denial, we would have to believe. Abandoning reason A second strategy to avoid the absurd is to let go of reasoning. Camus mentions different variations of this strategy. He hints at philosophers who either declare reasoning as a useless tool (Schestow, Jaspers) or say that this world follows a godly reasoning which humans simply can’t understand (Kierkegaard). Both ways to avoid the absurd are unacceptable to Camus. He calls any strategy to ignore the problem of absurdity “philosophical suicide”. Rebellion, Freedom, and Passion So if “philosophical suicide” is not an option, how about real suicide? Camus can’t justify suicide philosophically. Suicide would be an extreme gesture of acceptance — we would accept the contradiction between our human reason and the unreasonable world. And killing yourself to uphold reason is not really reasonable. Instead, he suggests we should do three things: 1. Permanent revolution: We should constantly revolt against the circumstances of our existence and thus keep the absurd alive. We should never accept defeat, not even death, even though we know it can’t be avoided in the long run. Permanent rebellion is the only way to be present in the world. 2. Reject eternal freedom: Instead of enslaving ourselves to eternal models we should hold on to reason, but be aware of its limitations and apply it flexibly to the situation at hand — or put simply: we should find freedom here and now, not in eternity. 3. Passion: Most importantly we should always have a passion for life, love everything in it and try not to live as good as possible but as much as possible. An absurd human knows about his mortality and yet doesn’t accept it, knows about the limitation of his reasoning, yet still holds it dear, feels the pleasure and pain of his experiences and yet tries to take in as many as possible. Absurd Art — Creation without tomorrow Albert Camus dedicates the third part to the artist who is fully aware of the absurd. Such an artist would never try to explain or solidify eternal ideas or carefully try to build a legacy that shall stand the test of time. Doing so would deny the unreasonable character of the world. Instead he favours the absurd artist who lives and creates in the moment, is not attached to just one idea but a Don Juan of ideas, who is ready to abandon any artwork just to move on to his next creative one-night stand. Seen from outside, those painful efforts for the perishable seem to be pointless — and that is the whole point! Artistic expression begins where reason ends. Why Sisyphus is a happy man We all know the ancient greek story of Sisyphus who revolted against the gods and was punished as a consequence. He was sentenced to push a boulder up a hill, just to see it roll down again, and keep doing so forever and ever and ever. Camus concludes his book with a surprising, bold statement: “One must imagine Sisyphus happy.“ He says, Sisyphus is the perfect model for us, since he has no illusions about his pointless situation and yet revolts against the circumstances. With every descent of the rock he makes a conscious decision to give it another go. He keeps pushing that rock and recognises that this is what his existence is all about: to be truly alive, to keep pushing. Please click the little heart, share with others, and subscribe to my mailing list: Other stories by Ralph: ", "title": "Is it worth the trouble?", "sentences": [{"ef97": "Is it worth the trouble?"}, {"434b": "In 1942 Albert Camus wrote a book called “The Myth of Sisyphus”. It is about the one truly important philosophical problem: Given the circumstances of our existence, shouldn’t we just kill ourselves? This is his answer:"}, {"3570": "At first Camus describes those moments in our lives when our ideas about the world suddenly don’t work anymore, when every daily routine — going to work and back — and all our efforts seem pointless and misdirected. When one suddenly feels foreign and divorced from this world."}, {"8935": "In these frightening moments of clarity we feel the absurdity of life."}, {"5a85": "Reason + Unreasonable World = Absurd Life"}, {"8425": "This absurd sensitivity is the result of a conflict. On the one hand we make reasonable plans for our lives, and on the other hand we are confronted with an unpredictable world which does not comply with our ideas."}, {"41cc": "So what is absurd? Being reasonable in an unreasonable world."}, {"1f6d": "This is the basic conflict we are confronted with. The tension between our reasonable ideas about the world, which collide with what we actually experience over time."}, {"0535": "And there is the biggest problem of all: We can boldly declare our ideas about the world as “eternal”, and at the same time we know that our life time is finite. We are all going to die. Yes, you too."}, {"e1b3": "So if reason and an unreasonable world are the key components, then — argues Camus — we could “cheat” and avoid the problem of the absurd by simply eliminating one of the two."}, {"edbf": "Denying the unreasonable world"}, {"63e4": "One way is to ignore the senselessness of our existence. Contrary to obvious evidence we could pretend that things are stable and live our lives according to distant goals (retirement, the big breakthrough, an afterlife, the progress of mankind, etc.). Camus says, if we do so, we can’t act freely, since our actions are tied to those eternal plans — which more often than not are doomed to shatter in the cliffs of the unreasonable world."}, {"7c7d": "At this point clinging to our reasonable models would not be reasonable anymore. We would be forced to live in denial, we would have to believe."}, {"e18a": "Abandoning reason"}, {"8db6": "A second strategy to avoid the absurd is to let go of reasoning. Camus mentions different variations of this strategy. He hints at philosophers who either declare reasoning as a useless tool (Schestow, Jaspers) or say that this world follows a godly reasoning which humans simply can’t understand (Kierkegaard)."}, {"0c0e": "Both ways to avoid the absurd are unacceptable to Camus. He calls any strategy to ignore the problem of absurdity “philosophical suicide”."}, {"1c1f": "Rebellion, Freedom, and Passion"}, {"adf1": "So if “philosophical suicide” is not an option, how about real suicide? Camus can’t justify suicide philosophically. Suicide would be an extreme gesture of acceptance — we would accept the contradiction between our human reason and the unreasonable world. And killing yourself to uphold reason is not really reasonable."}, {"7381": "Instead, he suggests we should do three things:"}, {"e588": "1. Permanent revolution: We should constantly revolt against the circumstances of our existence and thus keep the absurd alive. We should never accept defeat, not even death, even though we know it can’t be avoided in the long run. Permanent rebellion is the only way to be present in the world."}, {"47c4": "2. Reject eternal freedom: Instead of enslaving ourselves to eternal models we should hold on to reason, but be aware of its limitations and apply it flexibly to the situation at hand — or put simply: we should find freedom here and now, not in eternity."}, {"d791": "3. Passion: Most importantly we should always have a passion for life, love everything in it and try not to live as good as possible but as much as possible."}, {"e147": "An absurd human knows about his mortality and yet doesn’t accept it, knows about the limitation of his reasoning, yet still holds it dear, feels the pleasure and pain of his experiences and yet tries to take in as many as possible."}, {"27e3": "Absurd Art — Creation without tomorrow"}, {"0bf1": "Albert Camus dedicates the third part to the artist who is fully aware of the absurd. Such an artist would never try to explain or solidify eternal ideas or carefully try to build a legacy that shall stand the test of time. Doing so would deny the unreasonable character of the world."}, {"60af": "Instead he favours the absurd artist who lives and creates in the moment, is not attached to just one idea but a Don Juan of ideas, who is ready to abandon any artwork just to move on to his next creative one-night stand. Seen from outside, those painful efforts for the perishable seem to be pointless — and that is the whole point! Artistic expression begins where reason ends."}, {"3995": "Why Sisyphus is a happy man"}, {"5bee": "We all know the ancient greek story of Sisyphus who revolted against the gods and was punished as a consequence. He was sentenced to push a boulder up a hill, just to see it roll down again, and keep doing so forever and ever and ever. Camus concludes his book with a surprising, bold statement:"}, {"8253": "“One must imagine Sisyphus happy.“"}, {"3dfd": "He says, Sisyphus is the perfect model for us, since he has no illusions about his pointless situation and yet revolts against the circumstances. With every descent of the rock he makes a conscious decision to give it another go. He keeps pushing that rock and recognises that this is what his existence is all about: to be truly alive, to keep pushing."}, {"fa43": "Please click the little heart, share with others, and subscribe to my mailing list:"}, {"79fd": "Other stories by Ralph:"}], "child": "684_1\t684_2\t684_3\t684_4\t684_5\t684_6\t684_7\t684_8\t684_9\t684_10\t684_11\t684_12\t684_13\t684_14\t684_15\t684_16\t684_17\t684_18\t684_19\t684_20\t684_21\t684_22\t684_23\t684_24"}