{"name": "686", "parent": "", "content": "The Culture of a High Performing Organization and How to Hire For It Art by Emily May Rose Your people’s ‘why’ must be wonder Wonder, defined as ‘desire or curiosity to know something’ — is the end-all and be-all trait to hire for — if you want to create an intrinsic culture of learning, quick and adaptive knowledge acquisition — and benevolent knowledge sharing. Intuitive teamwork leads to high performance — which results in employees less likely leaving your organization. People who derive fulfillment through wonder are driven by internal growth compared to their externally growth motivated peers. In today’s high tech powered environment, that’s innovating at super high rates, with artificial intelligence replacing human intelligence in higher and higher skill jobs — accelerated learning is the most important skill to cultivate for a high performing organization. Fast invention and testing is of utmost importance and fast knowledge sharing is a must to stay competitive. How ‘Why’ Relates to Your People and Organization A persons ‘why’ or ‘why statement’ is the meaning they assign to their existence — and if someone’s ‘why’ is wonder, they are higher level thinkers and consider themselves a smaller part of a bigger, more important purpose. They’re often considered people of “faith” — no matter what that faith may be. I think the by-product of faith in anything becomes wonder. This frame of reference creates ‘bigger picture’ thinking, which creates an excitement to live while being selfless — a powerful combination which creates enthusiastic action. People with wonder absorb knowledge and benevolently share that knowledge. They’re less likely to be competitive with internal peers and have an organizational sense of “I win if they win, and if they win, I win”. They’re likely to believe that ‘life is great’ and can be enthusiastic about anything — and don’t believe enthusiasm is a result based on the external task being worked on — which many people struggle to understand and thus put their personal interests before the organizations. People with ‘innocent wonderment’ are enthusiastic all the time. Hiring Wonder will create a culture that values introspective growth and a positive attitude toward daily tasks — which creates harmony for the organization. People who ‘wonder’ naturally learn voraciously and most importantly, share that knowledge which uplifts the people around them and set’s an example for others to improve and do the same. In studying 24,000 people at dozens of companies, Dr. David Logan, author of Tribal Leadership, the framework Zappos built it’s world re-known culture on, and legendary basketball coach Phil Jackson — who lead world class athletes to eleven championships with — concluded that top performing organizations are made up of people who’s behavior and relationship toward their peers is driven by a collective selflessness and love for living that creates a healthy and sustainable organizational culture — with ‘innocent wonderment’ being the top behavior trait. If someone has a high score in ‘wonder’, they’ve achieved a level of inner self-actualization and satisfaction that creates a sense of contentment that mitigates the risk of them leaving the organization. This doesn’t mean they’ve achieved their external potential yet, but have high self-esteem and know they’ll reach their peak in due time. “My philosophy is that you don’t motivate players with speeches, you have motivated players that you draft.” — Phil Jackson Jackson recruited for innocent wonderment and his leadership philosophy was based on Dr. Logan’s Culture Map. In his book, “11 Rings, The Soul of Success, he writes: “in the 2008–2009 season, the Lakers needed to shift from a Stage 3 team to a Stage 4 in order to win.” Stage four is a high bar to maintain, and the general state of a high performing organization — and is reached when striving for stage five. The risk wonder mitigates for is ‘contentment and satisfaction’ in one’s vocation, lot in life, and place in the world — which often makes millennials discontent in their jobs. Therefore, people with wonder are more likely to remain content and satisfied for longer periods of time. New hires entering the work force and leaving jobs on average after eighteen months and people with wonder are less likely to ‘hop around’ for external advancement. These are people who could stock shelves at Zappos for two years and make a good time of it — people who don’t even realize they’ve advanced to manager and VP, because — in their mind stocking shelves and being VP are the same subjective experience — just different day to day tasks. Your people are your most important assets and determine how your organization operates each day. It can be a happy and healthy force for sustainable growth and innovation — where people’s knowledge and sharing benevolently drive it forward as a cohesive team. Transparency, internal coaching of peers and fluid communication make these things align and hiring for wonder is the best way to make that happen. The writer is co-founder of Traena, a learning and development platform that cultivates a culture of accelerated learning at organizations. Follow him on Medium Aram Rasa Taghavi ", "title": "The Culture of a High Performing Organization and How to Hire For It", "sentences": [{"068e": "The Culture of a High Performing Organization and How to Hire For It"}, {"5407": "Art by Emily May Rose"}, {"ebba": "Your people’s ‘why’ must be wonder"}, {"1355": "Wonder, defined as ‘desire or curiosity to know something’ — is the end-all and be-all trait to hire for — if you want to create an intrinsic culture of learning, quick and adaptive knowledge acquisition — and benevolent knowledge sharing."}, {"e54a": "Intuitive teamwork leads to high performance — which results in employees less likely leaving your organization."}, {"bcae": "People who derive fulfillment through wonder are driven by internal growth compared to their externally growth motivated peers."}, {"e1aa": "In today’s high tech powered environment, that’s innovating at super high rates, with artificial intelligence replacing human intelligence in higher and higher skill jobs — accelerated learning is the most important skill to cultivate for a high performing organization."}, {"6ad2": "Fast invention and testing is of utmost importance and fast knowledge sharing is a must to stay competitive."}, {"4c79": "How ‘Why’ Relates to Your People and Organization"}, {"28b7": "A persons ‘why’ or ‘why statement’ is the meaning they assign to their existence — and if someone’s ‘why’ is wonder, they are higher level thinkers and consider themselves a smaller part of a bigger, more important purpose. They’re often considered people of “faith” — no matter what that faith may be. I think the by-product of faith in anything becomes wonder."}, {"6e52": "This frame of reference creates ‘bigger picture’ thinking, which creates an excitement to live while being selfless — a powerful combination which creates enthusiastic action."}, {"9d09": "People with wonder absorb knowledge and benevolently share that knowledge."}, {"ab58": "They’re less likely to be competitive with internal peers and have an organizational sense of “I win if they win, and if they win, I win”."}, {"a10d": "They’re likely to believe that ‘life is great’ and can be enthusiastic about anything — and don’t believe enthusiasm is a result based on the external task being worked on — which many people struggle to understand and thus put their personal interests before the organizations."}, {"bc3c": "People with ‘innocent wonderment’ are enthusiastic all the time."}, {"1c5f": "Hiring"}, {"9aff": "Wonder will create a culture that values introspective growth and a positive attitude toward daily tasks — which creates harmony for the organization."}, {"5afd": "People who ‘wonder’ naturally learn voraciously and most importantly, share that knowledge which uplifts the people around them and set’s an example for others to improve and do the same."}, {"ed17": "In studying 24,000 people at dozens of companies, Dr. David Logan, author of Tribal Leadership, the framework Zappos built it’s world re-known culture on, and legendary basketball coach Phil Jackson — who lead world class athletes to eleven championships with — concluded that top performing organizations are made up of people who’s behavior and relationship toward their peers is driven by a collective selflessness and love for living that creates a healthy and sustainable organizational culture — with ‘innocent wonderment’ being the top behavior trait."}, {"7621": "If someone has a high score in ‘wonder’, they’ve achieved a level of inner self-actualization and satisfaction that creates a sense of contentment that mitigates the risk of them leaving the organization. This doesn’t mean they’ve achieved their external potential yet, but have high self-esteem and know they’ll reach their peak in due time."}, {"edc5": "“My philosophy is that you don’t motivate players with speeches, you have motivated players that you draft.” — Phil Jackson"}, {"ebc4": "Jackson recruited for innocent wonderment and his leadership philosophy was based on Dr. Logan’s Culture Map."}, {"df76": "In his book, “11 Rings, The Soul of Success, he writes: “in the 2008–2009 season, the Lakers needed to shift from a Stage 3 team to a Stage 4 in order to win.”"}, {"599b": "Stage four is a high bar to maintain, and the general state of a high performing organization — and is reached when striving for stage five."}, {"771b": "The risk wonder mitigates for is ‘contentment and satisfaction’ in one’s vocation, lot in life, and place in the world — which often makes millennials discontent in their jobs."}, {"c767": "Therefore, people with wonder are more likely to remain content and satisfied for longer periods of time."}, {"06cc": "New hires entering the work force and leaving jobs on average after eighteen months and people with wonder are less likely to ‘hop around’ for external advancement."}, {"df0a": "These are people who could stock shelves at Zappos for two years and make a good time of it — people who don’t even realize they’ve advanced to manager and VP, because — in their mind stocking shelves and being VP are the same subjective experience — just different day to day tasks."}, {"f31e": "Your people are your most important assets and determine how your organization operates each day. It can be a happy and healthy force for sustainable growth and innovation — where people’s knowledge and sharing benevolently drive it forward as a cohesive team. Transparency, internal coaching of peers and fluid communication make these things align and hiring for wonder is the best way to make that happen."}, {"53eb": "The writer is co-founder of Traena, a learning and development platform that cultivates a culture of accelerated learning at organizations. Follow him on Medium Aram Rasa Taghavi"}], "child": "686_1\t686_2\t686_3\t686_4\t686_5\t686_6\t686_7"}