{"name": "688", "parent": "", "content": "Part 2: Overcome the 5 Dysfunctions of a Team The first part of the story outlined the 5 Dysfunctions of a Team as described in Patrick Lencioni’s book. As much information as it contains, teamwork ultimately comes down to practicing a small set of principles (not a sophisticated theory) over a long period of time with uncommon levels of discipline and persistence. Therefore the model to achieve genuine teamwork by overcoming the 5 dysfunction pitfalls is worth refreshing periodically for the leaders and anyone interested in the real power of teamwork. 1. Absence of vulnerability-based trust Building vulnerability-based trust cannot be achieved over night, it requires: Suggested team exercises: Share personal histories; identify the single most important contribution each member makes to the team, as well as one area to improve or eliminate for the team; personality profile; and 360-Degree feedback — the key of which is to divorce it entirely from compensation and formal performance eval. The leaders need to demonstrate genuine vulnerability first, and create an environment that does not punish admissions of weakness or failure. 2. Fear of conflict The only purpose of productive conflict is to produce the best solution in the shortest period of time. The great teams discuss and resolve issues more quickly and completely than others, and they emerge from heated debates with no residual feelings or collateral damage, but with an eagerness and readiness to take on the next important issue. It’s important to distinguish productive ideological conflict from destructive fighting and interpersonal politics. However they can have many of the same external qualities — passion, emotion, and frustration — so much so an outside observer might easily mistake it for unproductive discord. Teams that fear conflict ignore controversial topics that are critical to the team success, fail to tap into all the opinions and perspective of team members, and waste time and energy with posturing and interpersonal risk management. Teams that engage in conflict put critical topics on the table for discussion, solve real problems quickly with minimal politics, and have lively and interesting meetings. Suggestions: First acknowledge that conflict is productive, and that many teams have a tendency to avoid it. Assign a team member to be “miner of conflict” — who extracts buried disagreements and sheds the light of day on them — during a meeting. Interrupt and remind one another in real time to not retreat from healthy debate when they start to feel uncomfortable. It is key that leaders demonstrate restraint when team members engage in conflict, and allow resolution to occur naturally. The desire to protect members from harm is the most difficult challenge for leaders, which leads to premature interruption of disagreements and prevents members from developing conflict management skills, similar to mistakes of overprotecting parents. Lead by personally modeling appropriate conflict behavior. 3. Lack of commitment Commitment is a function of 2 things: clarity and buy-in. Great teams move forward with complete buy-in including members who voted against the decision, and they leave meetings confident that no one is quietly harboring doubts whether to support the actions agreed on. The 2 greatest causes of lack of commitment are the desire for consensus and the need for certainty: Like a vortex, small disparities between executives high up in an organization become major discrepancies by the time they reach employees below. Suggestions: At the end of a meeting, the team spends a few minutes to review key decisions made during the meeting and what needs to be communicated outside of the meeting about those decisions. (Often members learn that they are not all on the same page and need more clarification before putting them into action.) Use of clear deadline for when decisions will be made — ambiguity is the worst enemy of commitment, and timing is one of the most critical factors that must be made clear. Committing to deadlines for intermediate milestones is just as important as final deadlines, because it ensures the misalignment among team members is identified and addressed before the costs are too great. Brief discussion on contingency and worst-case scenario allows overcoming their fears. The leader must be comfortable with the prospect of making a decision that turns out to be wrong, and must be constantly pushing the group for closure around issues. 4. Avoidance of accountability Accountability refers specifically to the willingness of team members to call their peers on performance or behaviors that might hurt the team. Ironically, people hesitate to hold one another accountable because they fear jeopardizing a valuable personal relationship, and this only causes the relationship to deteriorate as team members begin to resent one another for not living up to expectations and for allowing standards of the group to erode. The biggest motivation for people to improve their performance is peer pressure, the fear of letting down respected teammates. Teams that avoid accountability encourage mediocrity, miss deadlines and key deliverables, create resentment among team members who have different standards of performance, and place an undue burden on the team leader as the sole source of discipline. Suggestions: Publication of team goals, who needs to deliver what, and how everyone must behave in order to succeed. Regular progress review. By shifting rewards away from individual performance to team achievement, a team is unlikely to stand by quietly and fail when a peer is not pulling his weight. The leaders need to create a culture of accountability on the team by encouraging and allowing the team to serve as the first and primary accountability mechanism. The leader must be willing to serve as the ultimate arbiter of discipline when the team itself fails, but this should be a rare occurrence. 5. Inattention to results This dysfunction is when a team, in stead of focusing on achieving goals and results of the team, focus on other things — most commonly team status or individual status. Many teams simply do not live and breathe in order to achieve meaningful objectives, but rather merely to exist or survive. Unfortunately for these groups, no amount of trust, conflict, commitment, or accountability can compensate for a lack of desire to win. Teams that are not focused on results, rarely defeat competitors, lose achievement-oriented employees, encourage members to focus on their own career and individual goals, and are easily distracted. Suggestions: Make results clear, and reward only those behaviors and actions that contribute to those results. The leader must set the tone for a focus on results. If the team members sense that the leader values anything other than results, they will take that as permission to do the same. A note about Kathryn’s style Kathryn is the new CEO in Lencioni’s book who turned a dysfunctional executive team into a cohesive one. A few things worth noting for her style besides the methods she demonstrated in the story: It wasn’t that she couldn’t handle the weekly one-on-ones, but it was increasingly difficult to have fluid and substantive discussions during staff meetings with nine people sitting around the table, even with the new collective attitude of the members of the team. Teams succeed by acknowledging the imperfections of their humanity and overcoming their natural tendencies that make genuine teamwork elusive. ", "title": "Part 2: Overcome the 5 Dysfunctions of a Team", "sentences": [{"c557": "Part 2: Overcome the 5 Dysfunctions of a Team"}, {"9b78": "The first part of the story outlined the 5 Dysfunctions of a Team as described in Patrick Lencioni’s book. As much information as it contains, teamwork ultimately comes down to practicing a small set of principles (not a sophisticated theory) over a long period of time with uncommon levels of discipline and persistence."}, {"9de2": "Therefore the model to achieve genuine teamwork by overcoming the 5 dysfunction pitfalls is worth refreshing periodically for the leaders and anyone interested in the real power of teamwork."}, {"bbc8": "1. Absence of vulnerability-based trust"}, {"6bc5": "Building vulnerability-based trust cannot be achieved over night, it requires:"}, {"055d": "Suggested team exercises: Share personal histories; identify the single most important contribution each member makes to the team, as well as one area to improve or eliminate for the team; personality profile; and 360-Degree feedback — the key of which is to divorce it entirely from compensation and formal performance eval."}, {"c5d1": "The leaders need to demonstrate genuine vulnerability first, and create an environment that does not punish admissions of weakness or failure."}, {"0178": "2. Fear of conflict"}, {"994c": "The only purpose of productive conflict is to produce the best solution in the shortest period of time. The great teams discuss and resolve issues more quickly and completely than others, and they emerge from heated debates with no residual feelings or collateral damage, but with an eagerness and readiness to take on the next important issue."}, {"f037": "It’s important to distinguish productive ideological conflict from destructive fighting and interpersonal politics. However they can have many of the same external qualities — passion, emotion, and frustration — so much so an outside observer might easily mistake it for unproductive discord."}, {"3aed": "Teams that fear conflict ignore controversial topics that are critical to the team success, fail to tap into all the opinions and perspective of team members, and waste time and energy with posturing and interpersonal risk management."}, {"22fd": "Teams that engage in conflict put critical topics on the table for discussion, solve real problems quickly with minimal politics, and have lively and interesting meetings."}, {"e6cc": "Suggestions: First acknowledge that conflict is productive, and that many teams have a tendency to avoid it. Assign a team member to be “miner of conflict” — who extracts buried disagreements and sheds the light of day on them — during a meeting. Interrupt and remind one another in real time to not retreat from healthy debate when they start to feel uncomfortable."}, {"9059": "It is key that leaders demonstrate restraint when team members engage in conflict, and allow resolution to occur naturally. The desire to protect members from harm is the most difficult challenge for leaders, which leads to premature interruption of disagreements and prevents members from developing conflict management skills, similar to mistakes of overprotecting parents. Lead by personally modeling appropriate conflict behavior."}, {"e752": "3. Lack of commitment"}, {"4765": "Commitment is a function of 2 things: clarity and buy-in. Great teams move forward with complete buy-in including members who voted against the decision, and they leave meetings confident that no one is quietly harboring doubts whether to support the actions agreed on."}, {"2b61": "The 2 greatest causes of lack of commitment are the desire for consensus and the need for certainty:"}, {"31ff": "Like a vortex, small disparities between executives high up in an organization become major discrepancies by the time they reach employees below."}, {"e58f": "Suggestions:"}, {"9b8c": "At the end of a meeting, the team spends a few minutes to review key decisions made during the meeting and what needs to be communicated outside of the meeting about those decisions. (Often members learn that they are not all on the same page and need more clarification before putting them into action.)"}, {"6691": "Use of clear deadline for when decisions will be made — ambiguity is the worst enemy of commitment, and timing is one of the most critical factors that must be made clear. Committing to deadlines for intermediate milestones is just as important as final deadlines, because it ensures the misalignment among team members is identified and addressed before the costs are too great."}, {"0d94": "Brief discussion on contingency and worst-case scenario allows overcoming their fears."}, {"00df": "The leader must be comfortable with the prospect of making a decision that turns out to be wrong, and must be constantly pushing the group for closure around issues."}, {"3d4d": "4. Avoidance of accountability"}, {"6a78": "Accountability refers specifically to the willingness of team members to call their peers on performance or behaviors that might hurt the team."}, {"c50b": "Ironically, people hesitate to hold one another accountable because they fear jeopardizing a valuable personal relationship, and this only causes the relationship to deteriorate as team members begin to resent one another for not living up to expectations and for allowing standards of the group to erode."}, {"7f98": "The biggest motivation for people to improve their performance is peer pressure, the fear of letting down respected teammates."}, {"2702": "Teams that avoid accountability encourage mediocrity, miss deadlines and key deliverables, create resentment among team members who have different standards of performance, and place an undue burden on the team leader as the sole source of discipline."}, {"2625": "Suggestions:"}, {"a06c": "Publication of team goals, who needs to deliver what, and how everyone must behave in order to succeed."}, {"f163": "Regular progress review."}, {"c0cf": "By shifting rewards away from individual performance to team achievement, a team is unlikely to stand by quietly and fail when a peer is not pulling his weight."}, {"d5e8": "The leaders need to create a culture of accountability on the team by encouraging and allowing the team to serve as the first and primary accountability mechanism. The leader must be willing to serve as the ultimate arbiter of discipline when the team itself fails, but this should be a rare occurrence."}, {"e193": "5. Inattention to results"}, {"9317": "This dysfunction is when a team, in stead of focusing on achieving goals and results of the team, focus on other things — most commonly team status or individual status."}, {"b0df": "Many teams simply do not live and breathe in order to achieve meaningful objectives, but rather merely to exist or survive. Unfortunately for these groups, no amount of trust, conflict, commitment, or accountability can compensate for a lack of desire to win."}, {"2fdb": "Teams that are not focused on results, rarely defeat competitors, lose achievement-oriented employees, encourage members to focus on their own career and individual goals, and are easily distracted."}, {"a293": "Suggestions: Make results clear, and reward only those behaviors and actions that contribute to those results."}, {"b3be": "The leader must set the tone for a focus on results. If the team members sense that the leader values anything other than results, they will take that as permission to do the same."}, {"5286": "A note about Kathryn’s style"}, {"b12e": "Kathryn is the new CEO in Lencioni’s book who turned a dysfunctional executive team into a cohesive one. A few things worth noting for her style besides the methods she demonstrated in the story:"}, {"e8d0": "It wasn’t that she couldn’t handle the weekly one-on-ones, but it was increasingly difficult to have fluid and substantive discussions during staff meetings with nine people sitting around the table, even with the new collective attitude of the members of the team."}, {"f6c3": "Teams succeed by acknowledging the imperfections of their humanity and overcoming their natural tendencies that make genuine teamwork elusive."}], "child": "688_1\t688_2\t688_3\t688_4"}