{"name": "689", "parent": "", "content": "Three Principles For Living Your Tiny Beautiful Life Against Messiness You want me to tell you: life is messy, people are complicated, and so on. I wish I could. It would be easier to recite these pop psych nuggets. They lead us to believe that there are no answers to the great questions of life – and evading the question’s easy, right? And yet if death taught me anything it is that the answers are simple, and life is too. The messiness school of life is true in only one regard: mind. It’s not life that’s messy, it’s mind. Your mind, my mind, all mind. Mind: concept, belief, label. None of these are true, though, are they? The name of my lover is not my lover. The concept of a chair is not the chair. Mind is messy. Isn’t it? Isn’t your mind always chattering, shouting, whispering? Always…going? It is always trying to get your attention. But then who is you? In that one sentence alone we have proven you are not your mind. So who are you? You are the witness, the observer, the silent ocean to which all the rivers of days pour. You are the listener. But there is more than mind’s wounded cries to hear. Now. Why is mind always after your attention? Because it needs attention. Mind is a child. If it is not heard, it grows anxious, afraid, desperate. It’s most needy illusion is that it exists. But like the idea of the chair versus the chair, mind has no independent existence at all. This is what is meant by “emptiness”. So: mind is messy. It is always shouting. It will fool you, so desperate is it for your attention, you, the silent ocean. It will ask: “what if they don’t really love me? What if I am not good enough?”. And so then you will go out and do foolish things, acts of self sabotage. Worse, captive to mind, you will spend your life angry, afraid, and confuse genuine happiness with the relief of mental chatter. Life is simple. Here is life, in three simple principles. You are the silent ocean. Happiness is witnessing acts of love. Meaning is performing acts of love. Both together lead to contentment, peace, truth, a sense of beauty and nobility and mattering. Why? Because now one’s life is true. It is not being controlled by the little illusion of mind. Mind alone will never let us perform or witness tiny acts of love, will it? It will grow jealous, afraid, worried, envious, ashamed. It will stop us in our tracks, because it is not the observer. Only the observer can love. Nothing in this little is messy. You are as clean and simple and pure as tears, as rain. You are the love you are here to witness, to enact, to become. Why else would your fulfillment come from living that way? Umair April 2017 ", "title": "Three Principles For Living Your Tiny Beautiful Life", "sentences": [{"6719": "Three Principles For Living Your Tiny Beautiful Life"}, {"f3ae": "Against Messiness"}, {"57ef": "You want me to tell you: life is messy, people are complicated, and so on."}, {"abed": "I wish I could. It would be easier to recite these pop psych nuggets. They lead us to believe that there are no answers to the great questions of life – and evading the question’s easy, right?"}, {"e17c": "And yet if death taught me anything it is that the answers are simple, and life is too."}, {"944d": "The messiness school of life is true in only one regard: mind. It’s not life that’s messy, it’s mind. Your mind, my mind, all mind. Mind: concept, belief, label. None of these are true, though, are they? The name of my lover is not my lover. The concept of a chair is not the chair."}, {"43cb": "Mind is messy. Isn’t it? Isn’t your mind always chattering, shouting, whispering? Always…going? It is always trying to get your attention."}, {"f006": "But then who is you? In that one sentence alone we have proven you are not your mind. So who are you?"}, {"b65f": "You are the witness, the observer, the silent ocean to which all the rivers of days pour. You are the listener. But there is more than mind’s wounded cries to hear."}, {"9193": "Now. Why is mind always after your attention? Because it needs attention. Mind is a child. If it is not heard, it grows anxious, afraid, desperate. It’s most needy illusion is that it exists. But like the idea of the chair versus the chair, mind has no independent existence at all. This is what is meant by “emptiness”."}, {"dddd": "So: mind is messy. It is always shouting. It will fool you, so desperate is it for your attention, you, the silent ocean. It will ask: “what if they don’t really love me? What if I am not good enough?”. And so then you will go out and do foolish things, acts of self sabotage. Worse, captive to mind, you will spend your life angry, afraid, and confuse genuine happiness with the relief of mental chatter."}, {"23dd": "Life is simple. Here is life, in three simple principles."}, {"23d4": "You are the silent ocean."}, {"b179": "Happiness is witnessing acts of love."}, {"1bb8": "Meaning is performing acts of love."}, {"b2b8": "Both together lead to contentment, peace, truth, a sense of beauty and nobility and mattering."}, {"8c1a": "Why? Because now one’s life is true. It is not being controlled by the little illusion of mind."}, {"1f5c": "Mind alone will never let us perform or witness tiny acts of love, will it? It will grow jealous, afraid, worried, envious, ashamed. It will stop us in our tracks, because it is not the observer. Only the observer can love."}, {"5576": "Nothing in this little is messy. You are as clean and simple and pure as tears, as rain."}, {"a58f": "You are the love you are here to witness, to enact, to become. Why else would your fulfillment come from living that way?"}, {"490c": "Umair"}, {"b9e5": "April 2017"}], "child": "689_1"}