{"name": "69", "parent": "", "content": "Breaking News Phil Jackson’s Interference Has No Bounds The Knicks’ president infiltrates the digital airwaves to blast Carmelo while doing nothing to prove legitimacy of his reign Photo: Anthony J. Causi Folks, it goes without saying, but this has not been a banner year for the Knicks. I know, I know, you’re shocked to find this out, and I’m sorry I had to break this to you. In the second latest installment of “What the Actual Fuck is Wrong With This Franchise?”, Bleacher Report’s Kevin Ding authored this piece on Carmelo Anthony’s tenure thus far with Phil Jackson: Which was almost immediately followed with this little ditty from Steely Phil: In what appears to be the latest hit piece on Carmelo, Ding makes Phil out to be a savior, of sorts. A brilliant basketball mind who, due to the selfish reasons of Carmelo, just hasn’t been able to make a winner out of Carmelo, and the Knicks as a whole. Mind you, Carmelo was holding his own as a winner. A winner to a lesser degree, perhaps, but still winning games nonetheless. Let’s take a gander at the facts: This isn’t to say Carmelo is destined for a title, or that he’s easy to build around. He’s not. However, he was still winning before Phil came to, you know, return the franchise to respectability. In his first year, Phil assembled a D-League roster around a hobbled Carmelo. In his second year, after hitting the jackpot with Kristaps Porzingis, he made a series of savvy moves to start the Knicks in the right direction. Cap flexibility was in great shape, and the roster was filled with young guys or short deals for veteran players. Then, in a move of utter brilliance, Jackson traded two of those assets (Robin Lopez and Jerian Grant) for Derrick Rose, who was fresh off of four turbulent years while trying to recover from a litany of injuries. Phil followed this up with signing the corpse that has now become known as Joakim Noah, in some sort of last-ditch effort to “win now” around Carmelo. Annnnndd it flopped. Quite miserably, might I add. Now: MSG Security, Charles Oakley Get Into It At The Knicks-Clippers GameReportedly Oakley had choice words for owner James Dolan before a shoving match occurred with Garden securitytheknickswall.com So, here we are. With the trade deadline looming large, Phil Jackson, the actual president of an actual NBA franchise, is publicly throwing shots at his franchise star that he is actively trying to shop. It’s brutal, it’s asinine, and it’s incompetence at its finest. In what selfish world must one live in, to honestly believe that taking a shot at the exact player you’re trying to move, is the best option? The GM of a franchise is supposed to make moves in the best interest of the team, but Jackson seems far too preoccupied with poking out his chest with a false sense of bravado, with proving he still has some sort of intellectual advantage over the league, while displaying the exact opposite. To paraphrase CW’s Arrow, Phil Jackson has failed this city, and franchise. Now, truth be told, I wanted the Knicks to trade Carmelo. I’ve always enjoyed his tenure here, as a whole, but it was in the franchise’s best interest to move him for some assets, namely some young players and/or some draft picks. However, at this juncture, I want Carmelo to stay. Stick it to Phil. Decline every trade attempt he makes. Enough is enough, to be quite honest. This team owns their own picks going forward, and this team is already a lottery team as it is. So, they’ll continue to be bad. They’ll land in the lottery somewhere, and hopefully Derrick Rose walks and doesn’t re-sign here. We’ll get a high pick, and we’ll have a ton of cap space going forward. So what if we hold onto Carmelo for another year or two? What’s the worst that’ll happen? We keep tanking while owning our own picks? That’s a better hell than the one fans have occupied as of Jackson’s tenure. At some point, you have to consider the morality of the present situation, and that’s the point I’ve reached. There’s only room for one of ‘Melo or Phil in the New York, and here’s to hoping ‘Melo outlasts, and sticks it to Phil. #StayMe70, and #FREEOAKLEY. — Kyle Maggio, senior writer Follow The Knicks Wall on Facebook and Twitter and listen to Kyle and Anthony on the TKW Podcast on SoundCloud. ", "title": "Phil Jackson’s Interference Has No Bounds", "sentences": [{"4561": "Breaking News"}, {"e0d6": "Phil Jackson’s Interference Has No Bounds"}, {"200d": "The Knicks’ president infiltrates the digital airwaves to blast Carmelo while doing nothing to prove legitimacy of his reign"}, {"a8da": "Photo: Anthony J. Causi"}, {"6d95": "Folks, it goes without saying, but this has not been a banner year for the Knicks. I know, I know, you’re shocked to find this out, and I’m sorry I had to break this to you."}, {"62e3": "In the second latest installment of “What the Actual Fuck is Wrong With This Franchise?”, Bleacher Report’s Kevin Ding authored this piece on Carmelo Anthony’s tenure thus far with Phil Jackson:"}, {"a475": "Which was almost immediately followed with this little ditty from Steely Phil:"}, {"e0c0": "In what appears to be the latest hit piece on Carmelo, Ding makes Phil out to be a savior, of sorts. A brilliant basketball mind who, due to the selfish reasons of Carmelo, just hasn’t been able to make a winner out of Carmelo, and the Knicks as a whole. Mind you, Carmelo was holding his own as a winner. A winner to a lesser degree, perhaps, but still winning games nonetheless. Let’s take a gander at the facts:"}, {"de2c": "This isn’t to say Carmelo is destined for a title, or that he’s easy to build around. He’s not. However, he was still winning before Phil came to, you know, return the franchise to respectability."}, {"c194": "In his first year, Phil assembled a D-League roster around a hobbled Carmelo. In his second year, after hitting the jackpot with Kristaps Porzingis, he made a series of savvy moves to start the Knicks in the right direction. Cap flexibility was in great shape, and the roster was filled with young guys or short deals for veteran players."}, {"4542": "Then, in a move of utter brilliance, Jackson traded two of those assets (Robin Lopez and Jerian Grant) for Derrick Rose, who was fresh off of four turbulent years while trying to recover from a litany of injuries. Phil followed this up with signing the corpse that has now become known as Joakim Noah, in some sort of last-ditch effort to “win now” around Carmelo. Annnnndd it flopped. Quite miserably, might I add."}, {"6c91": "Now: MSG Security, Charles Oakley Get Into It At The Knicks-Clippers GameReportedly Oakley had choice words for owner James Dolan before a shoving match occurred with Garden securitytheknickswall.com"}, {"fff3": "So, here we are. With the trade deadline looming large, Phil Jackson, the actual president of an actual NBA franchise, is publicly throwing shots at his franchise star that he is actively trying to shop. It’s brutal, it’s asinine, and it’s incompetence at its finest. In what selfish world must one live in, to honestly believe that taking a shot at the exact player you’re trying to move, is the best option? The GM of a franchise is supposed to make moves in the best interest of the team, but Jackson seems far too preoccupied with poking out his chest with a false sense of bravado, with proving he still has some sort of intellectual advantage over the league, while displaying the exact opposite. To paraphrase CW’s Arrow, Phil Jackson has failed this city, and franchise."}, {"4253": "Now, truth be told, I wanted the Knicks to trade Carmelo. I’ve always enjoyed his tenure here, as a whole, but it was in the franchise’s best interest to move him for some assets, namely some young players and/or some draft picks. However, at this juncture, I want Carmelo to stay. Stick it to Phil. Decline every trade attempt he makes. Enough is enough, to be quite honest. This team owns their own picks going forward, and this team is already a lottery team as it is. So, they’ll continue to be bad. They’ll land in the lottery somewhere, and hopefully Derrick Rose walks and doesn’t re-sign here. We’ll get a high pick, and we’ll have a ton of cap space going forward. So what if we hold onto Carmelo for another year or two? What’s the worst that’ll happen? We keep tanking while owning our own picks? That’s a better hell than the one fans have occupied as of Jackson’s tenure."}, {"59f9": "At some point, you have to consider the morality of the present situation, and that’s the point I’ve reached. There’s only room for one of ‘Melo or Phil in the New York, and here’s to hoping ‘Melo outlasts, and sticks it to Phil."}, {"7257": "#StayMe70, and #FREEOAKLEY."}, {"6134": "— Kyle Maggio, senior writer"}, {"3afd": "Follow The Knicks Wall on Facebook and Twitter and listen to Kyle and Anthony on the TKW Podcast on SoundCloud."}], "child": "69_1"}