{"name": "691", "parent": "", "content": "“I Hate Kanban…” Wandering the conference halls I overhear… Yeah. Kanban sucks. I hate it! Didn’t change anything … Forget for a moment that you can model anything with Kanban (it is “way” agnostic)… I’ve been fascinated by something lately. When given the path to visualize work and make working agreements explicit, so many many organizations balk. Why? Why would we opt against continuous improvement? Why, if given an option, would we adopt the most complicated and heavy processes (and hire droves of project managers), but hesitate to make work visual? By visualizing work on a Kanban board (for example), you are able to visualize … The trepidation make sense. Shining the mirror back on an organization is painful. It very quickly exposes all sorts of human issues. It is these human issues that typically block change. You end up returning to the same “problems” over and over. There are never enough resources. There is always a jockeying for resources. There will always be tension between local and global optimization. We are human: we over-promise and are eager to please, and fall victim to all sorts of cognitive biases. So at the core you have two mindsets at either end of the spectrum: … and then a bunch of variations across that spectrum. What you find very quickly is that controlled change is often a battle of mindsets. It becomes a fight for who will own and take credit for the change. A Kanban board is a blank slate. It is a simple tool … that can be used to model anything. But it is also a trigger: Well, you know we’re overworked. Everyone can see that. We’ve complained about it, but have been told we just need to deal. What will making it visible do for us? I’d prefer not to put that ops work on the board. Because then it will be micro-managed, and we will need to explain everything David is not pulling his weight. But I don’t want to be the person to call that out. Plus, management has lost hope in us anyway. They are working around us with that top-secret project. We will never get resources if we make a fuss. So I’ve been asking myself lately: how can we create environments that are safe enough to make continuous improvement possible? How can we make a simple visualization of work less threatening. Thoughts? Please reply in the comments ", "title": "“I Hate Kanban…”", "sentences": [{"6d95": "“I Hate Kanban…”"}, {"cb45": "Wandering the conference halls I overhear…"}, {"260c": "Yeah. Kanban sucks. I hate it! Didn’t change anything …"}, {"39c5": "Forget for a moment that you can model anything with Kanban (it is “way” agnostic)…"}, {"4635": "I’ve been fascinated by something lately. When given the path to visualize work and make working agreements explicit, so many many organizations balk. Why? Why would we opt against continuous improvement? Why, if given an option, would we adopt the most complicated and heavy processes (and hire droves of project managers), but hesitate to make work visual?"}, {"baa4": "By visualizing work on a Kanban board (for example), you are able to visualize …"}, {"05c0": "The trepidation make sense."}, {"a1c3": "Shining the mirror back on an organization is painful. It very quickly exposes all sorts of human issues. It is these human issues that typically block change."}, {"80bf": "You end up returning to the same “problems” over and over. There are never enough resources. There is always a jockeying for resources. There will always be tension between local and global optimization. We are human: we over-promise and are eager to please, and fall victim to all sorts of cognitive biases. So at the core you have two mindsets at either end of the spectrum:"}, {"7b53": "… and then a bunch of variations across that spectrum. What you find very quickly is that controlled change is often a battle of mindsets. It becomes a fight for who will own and take credit for the change. A Kanban board is a blank slate. It is a simple tool … that can be used to model anything. But it is also a trigger:"}, {"7793": "Well, you know we’re overworked. Everyone can see that. We’ve complained about it, but have been told we just need to deal. What will making it visible do for us?"}, {"a4f9": "I’d prefer not to put that ops work on the board. Because then it will be micro-managed, and we will need to explain everything"}, {"8450": "David is not pulling his weight. But I don’t want to be the person to call that out. Plus, management has lost hope in us anyway. They are working around us with that top-secret project."}, {"6255": "We will never get resources if we make a fuss."}, {"1da6": "So I’ve been asking myself lately: how can we create environments that are safe enough to make continuous improvement possible? How can we make a simple visualization of work less threatening. Thoughts? Please reply in the comments"}], "child": "691_1\t691_2\t691_3\t691_4\t691_5\t691_6\t691_7\t691_8\t691_9\t691_10\t691_11\t691_12\t691_13\t691_14\t691_15\t691_16\t691_17\t691_18\t691_19\t691_20\t691_21\t691_22\t691_23\t691_24\t691_25"}