{"name": "692", "parent": "", "content": "How to Land Your Junior Summer Product Design Internship To start off, internship hunting is not easy. Being a good designer does not mean you will get an internship easily. As many put it, you have to be there at the right place and the right time. But after almost 30 rounds of interviews with 18 companies for my internship hunting, I realize there are lessons I learned that can help others to increase the chance to get an offer. Start Early and Apply to More One common mistake I see people make is to postpone putting together a portfolio. Your portfolio is a product design project on its own. Waiting to hear back usually takes at least a month. You will have enough time to iterate on your portfolio so do not wait on launching your “perfect” portfolio. Instead, put something together early and get feedback and iterate on it. I find online application to be the most effective way to get an interview. The reason is simple. Most career fairs on campus do not get you access to the design recruiter. The chance to get your info passed along is probably lower than the chance the design recruiter sees your resume from the pool. Personal connections do help but not as much as you think. At the end of the day, designers are judged heavily by their portfolios. If your work simply does not reach the bar, your connection cannot help you. On top of that, most companies have a particular type of designers they hire (which is sad). For example, Google prefers designers who have a long structured process in their designs while Facebook prefers designers who have stronger visual skills. If you are not the designer the company is looking for, you also get cut. The Phone Screen The first round of the interview is usually a phone screen. Some companies will let the a designer to directly talk to you. In that case, you are in luck. Normally a recruiter will conduct the screening. Tell me about yourself. The most common question you get in any interview. The best way to answer this question is to talk in two sections. As a junior designer, your ability to execute design is the most important thing and your experiences prove that. So talk about your experiences first but do expand beyond what is said in your resume. Then tell them something unique about yourself. It can be how you get into design. It can be an extracurricular you are doing. It can be a hobby of yours. Pay attention to how the interviewer react to it. If they keep silent, cut this part shorter. If they seem interested, you can talk more. This part is just an add-on to leave a good impression so no need to finish all your script you have in your head. I also list some common questions I get from a phone screen below. If you have an answer to each question below, you are well prepared! When it is your turn to ask questions, a general tip will be try to ask something about the interviewer. Feel free to stalk him or her on social media to see if there is anything interesting you find and ask. The phone interview sometimes includes a walkthrough of one project. A trick I learned is to send a separate deck of a project in your portfolio to the interviewer before the call. You will then know for sure whether they will ask you to walk through a project. In addition, your presentation will be more clear because the recruiter will not get lost in all the scrolling up and down on your site. The Portfolio Review I will highly recommend you to do mock interviews for this round with a few friends. Prepare for 3 projects to talk about but most companies will probably ask you to go through only 1 project. Product design includes user research, interaction design, visual design and maybe motion design. You want to make sure the project(s) you show covers all of that. So you want to talk about your research and your iterations in both interaction design and visual design. If you worked with engineering team to ship the design, mention it and talk about what compromises you have made. Most companies are looking for a designer who does not just design in la la land. They want to see the candidate understands the full process of the designing and the struggles working with other stakeholders. Overall, there are 3 big tips: The Design Exercise Design exercises can be divided into mostly two types: one as take-home exercise and one as live. Interestingly, I have never gone on site to any of the companies I interviewed. So I apologize if I cannot give you more insights about that. Take-home design exercise If the company recommends to spend 3–4 hours on the exercise, spending 6–8 hours and sometimes more is quite typical. Usually a company is flexible with the format of your deliverable for the design exercise. I will recommend using a draft Medium post if you might get cut without presenting your solution. If a call to discuss your design exercise is guaranteed, you have more flexibility. I use a PDF with a inVision link. The prompt is often vague and it is your job to break it down so you can start designing. Therefore, defining your problem statements is the most important part of this whole process. Do what it takes to help you get there. You might have to conduct some user interviews, or do a competitive analysis, draw an experience map etc. The process is usually different for each exercise but once you have the problem statements, you can jump into idea generation without losing focus. You want to make sure you dedicate a certain amount of time just sketching a lot of ideas. The problem statements usually help you generate ideas. There are of course other ways to help facilitate that such as mind mapping, storyboarding or attribute listing. Then you need to compare different options and focus on one direction to further explore. The way I tackle it is to filter out the high level ideas from my sketches. Then I will compare the benefits and tradeoffs of each idea and make a decision from there. This is the another important moment of the process. The interviewer wants to know why you pick idea A over idea B. Depending on the requirements, you might or might not flesh out a screen or two to high fidelity just to showcase your visual skill. Similar to how you present in a portfolio review, you want to talk about the “why”s throughout your process and connect the dots in the end. And if you care about the offer from this company, make sure you practice presenting your design solution to a friend. Live design exercise Live design exercise is a lot harder than take-home design exercises because you are forced to complete the task in a certain amount of time. The advantage is that you get to ask questions. The process is similar to the take-home ones except that you are mostly working on whiteboard or paper. I guess the biggest warning I can give to people is do not assume visual does not matter because it is just a sketch. I actually get rejected from a company because I overcomplicate hierarchy and visual design in a sketch. In the End Again, internship hunting is not easy. It is physically, emotionally and mentally exhausting. But the good news is, it is also a humbling, introspective, and eventually rewarding experience. You will not only learn about the interviewing skills, but also about yourself as a designer and as a person along the way. Do not let rejections discourage you! I deeply believe everything happens for a reason and we just need to take the lesson. Thank all the people who have pushed you forward including the ones who rejected you. In the end, do not compare your offer to someone else’s. Internships and your first job after college is just the start of your career. Big brands are of course nice but they only get you so far in the end. An internship can make you grow as a designer is what you should truly look for! ", "title": "How to Land Your Junior Summer Product Design Internship", "sentences": [{"90c5": "How to Land Your Junior Summer Product Design Internship"}, {"9eff": "To start off, internship hunting is not easy. Being a good designer does not mean you will get an internship easily. As many put it, you have to be there at the right place and the right time."}, {"8362": "But after almost 30 rounds of interviews with 18 companies for my internship hunting, I realize there are lessons I learned that can help others to increase the chance to get an offer."}, {"0850": "Start Early and Apply to More"}, {"6748": "One common mistake I see people make is to postpone putting together a portfolio. Your portfolio is a product design project on its own. Waiting to hear back usually takes at least a month. You will have enough time to iterate on your portfolio so do not wait on launching your “perfect” portfolio. Instead, put something together early and get feedback and iterate on it."}, {"5ea9": "I find online application to be the most effective way to get an interview. The reason is simple. Most career fairs on campus do not get you access to the design recruiter. The chance to get your info passed along is probably lower than the chance the design recruiter sees your resume from the pool."}, {"7b69": "Personal connections do help but not as much as you think. At the end of the day, designers are judged heavily by their portfolios. If your work simply does not reach the bar, your connection cannot help you. On top of that, most companies have a particular type of designers they hire (which is sad). For example, Google prefers designers who have a long structured process in their designs while Facebook prefers designers who have stronger visual skills. If you are not the designer the company is looking for, you also get cut."}, {"5aa7": "The Phone Screen"}, {"b456": "The first round of the interview is usually a phone screen. Some companies will let the a designer to directly talk to you. In that case, you are in luck. Normally a recruiter will conduct the screening."}, {"cfe4": "Tell me about yourself. The most common question you get in any interview. The best way to answer this question is to talk in two sections."}, {"1c40": "As a junior designer, your ability to execute design is the most important thing and your experiences prove that. So talk about your experiences first but do expand beyond what is said in your resume."}, {"711e": "Then tell them something unique about yourself. It can be how you get into design. It can be an extracurricular you are doing. It can be a hobby of yours. Pay attention to how the interviewer react to it. If they keep silent, cut this part shorter. If they seem interested, you can talk more. This part is just an add-on to leave a good impression so no need to finish all your script you have in your head."}, {"aa9a": "I also list some common questions I get from a phone screen below. If you have an answer to each question below, you are well prepared!"}, {"beda": "When it is your turn to ask questions, a general tip will be try to ask something about the interviewer. Feel free to stalk him or her on social media to see if there is anything interesting you find and ask."}, {"466b": "The phone interview sometimes includes a walkthrough of one project. A trick I learned is to send a separate deck of a project in your portfolio to the interviewer before the call. You will then know for sure whether they will ask you to walk through a project. In addition, your presentation will be more clear because the recruiter will not get lost in all the scrolling up and down on your site."}, {"c907": "The Portfolio Review"}, {"407f": "I will highly recommend you to do mock interviews for this round with a few friends. Prepare for 3 projects to talk about but most companies will probably ask you to go through only 1 project."}, {"5ad6": "Product design includes user research, interaction design, visual design and maybe motion design. You want to make sure the project(s) you show covers all of that. So you want to talk about your research and your iterations in both interaction design and visual design."}, {"0114": "If you worked with engineering team to ship the design, mention it and talk about what compromises you have made. Most companies are looking for a designer who does not just design in la la land. They want to see the candidate understands the full process of the designing and the struggles working with other stakeholders."}, {"3263": "Overall, there are 3 big tips:"}, {"9b77": "The Design Exercise"}, {"a9a8": "Design exercises can be divided into mostly two types: one as take-home exercise and one as live. Interestingly, I have never gone on site to any of the companies I interviewed. So I apologize if I cannot give you more insights about that."}, {"96bf": "Take-home design exercise"}, {"df9f": "If the company recommends to spend 3–4 hours on the exercise, spending 6–8 hours and sometimes more is quite typical. Usually a company is flexible with the format of your deliverable for the design exercise. I will recommend using a draft Medium post if you might get cut without presenting your solution. If a call to discuss your design exercise is guaranteed, you have more flexibility. I use a PDF with a inVision link."}, {"fdf0": "The prompt is often vague and it is your job to break it down so you can start designing. Therefore, defining your problem statements is the most important part of this whole process. Do what it takes to help you get there. You might have to conduct some user interviews, or do a competitive analysis, draw an experience map etc. The process is usually different for each exercise but once you have the problem statements, you can jump into idea generation without losing focus."}, {"507e": "You want to make sure you dedicate a certain amount of time just sketching a lot of ideas. The problem statements usually help you generate ideas. There are of course other ways to help facilitate that such as mind mapping, storyboarding or attribute listing."}, {"f0f1": "Then you need to compare different options and focus on one direction to further explore. The way I tackle it is to filter out the high level ideas from my sketches. Then I will compare the benefits and tradeoffs of each idea and make a decision from there. This is the another important moment of the process. The interviewer wants to know why you pick idea A over idea B."}, {"c50e": "Depending on the requirements, you might or might not flesh out a screen or two to high fidelity just to showcase your visual skill."}, {"5638": "Similar to how you present in a portfolio review, you want to talk about the “why”s throughout your process and connect the dots in the end. And if you care about the offer from this company, make sure you practice presenting your design solution to a friend."}, {"6835": "Live design exercise"}, {"f7b6": "Live design exercise is a lot harder than take-home design exercises because you are forced to complete the task in a certain amount of time. The advantage is that you get to ask questions."}, {"a16a": "The process is similar to the take-home ones except that you are mostly working on whiteboard or paper. I guess the biggest warning I can give to people is do not assume visual does not matter because it is just a sketch. I actually get rejected from a company because I overcomplicate hierarchy and visual design in a sketch."}, {"f37c": "In the End"}, {"3576": "Again, internship hunting is not easy. It is physically, emotionally and mentally exhausting. But the good news is, it is also a humbling, introspective, and eventually rewarding experience. You will not only learn about the interviewing skills, but also about yourself as a designer and as a person along the way."}, {"2a6e": "Do not let rejections discourage you! I deeply believe everything happens for a reason and we just need to take the lesson. Thank all the people who have pushed you forward including the ones who rejected you."}, {"5ee2": "In the end, do not compare your offer to someone else’s. Internships and your first job after college is just the start of your career. Big brands are of course nice but they only get you so far in the end. An internship can make you grow as a designer is what you should truly look for!"}], "child": "692_1\t692_2692_1\t692_2692_1\t692_2692_1\t692_2692_1\t692_2692_1\t692_2"}