{"name": "696", "parent": "", "content": "Don’t you dare discourage developers from UX Hi, I’m Dillon. My friend Ryan and I run RankScience. We sell SEO software, and we’re hiring for a special role: a UX Developer. I saw this nugget on LinkedIn recently, from a recruiter dismissing the UX Developer role: “UX DEVELOPER IS NOT A THING” — A recruiter, 2017 Uh, what? If you’ll allow me a minute of your time to elaborate on a handful of points: 1. Nobody on our team is absolved from thinking about our customers. All of us are thinking about psychology, research, strategy, subjectivity, usability, business goals, and design. ALL OF US. Because we all love our customers, and we want to deliver immense value and delightful experiences to them. Well-executed UX is a team effort. No developers on our team would ever dismiss UX concerns because “oh I’m just a developer, I’m not supposed to think about UX.” 2. We can and will create new roles to stay competitive. Admittedly, the UX Developer role emerged very recently. But why the derisiveness towards filling this seemingly uncommon role? Here are some other roles which were very uncommon 5 years ago, especially compared to today: The business landscape changes constantly, and our hiring demands change constantly to keep up. We create new titles to reflect the new times. All the above roles, including the UX Developer, have emerged because they help us stay competitive. Don’t you dare discourage developers from UX. If you don’t care about your customers, then go ahead and dismiss UX developers. If you don’t want to be competitive in today’s software landscape, then go ahead and dismiss UX developers. Some developer arguments are about user cycles, functionality across different devices, reliability and security, aesthetics, and performance. Other developer arguments are about git merge vs. git rebase or unit tests. While the latter surely has occasional merit, I’m always more interested in the former. ", "title": "Don’t you dare discourage developers from UX", "sentences": [{"9a73": "Don’t you dare discourage developers from UX"}, {"8c5c": "Hi, I’m Dillon. My friend Ryan and I run RankScience. We sell SEO software, and we’re hiring for a special role: a UX Developer."}, {"7b03": "I saw this nugget on LinkedIn recently, from a recruiter dismissing the UX Developer role:"}, {"12dc": "“UX DEVELOPER IS NOT A THING” — A recruiter, 2017"}, {"7dc4": "Uh, what? If you’ll allow me a minute of your time to elaborate on a handful of points:"}, {"6673": "1. Nobody on our team is absolved from thinking about our customers."}, {"ecdf": "All of us are thinking about psychology, research, strategy, subjectivity, usability, business goals, and design. ALL OF US. Because we all love our customers, and we want to deliver immense value and delightful experiences to them."}, {"5807": "Well-executed UX is a team effort. No developers on our team would ever dismiss UX concerns because “oh I’m just a developer, I’m not supposed to think about UX.”"}, {"b542": "2. We can and will create new roles to stay competitive."}, {"b495": "Admittedly, the UX Developer role emerged very recently. But why the derisiveness towards filling this seemingly uncommon role? Here are some other roles which were very uncommon 5 years ago, especially compared to today:"}, {"21f9": "The business landscape changes constantly, and our hiring demands change constantly to keep up. We create new titles to reflect the new times. All the above roles, including the UX Developer, have emerged because they help us stay competitive."}, {"a5f6": "Don’t you dare discourage developers from UX."}, {"7567": "If you don’t care about your customers, then go ahead and dismiss UX developers. If you don’t want to be competitive in today’s software landscape, then go ahead and dismiss UX developers."}, {"de9c": "Some developer arguments are about user cycles, functionality across different devices, reliability and security, aesthetics, and performance. Other developer arguments are about git merge vs. git rebase or unit tests. While the latter surely has occasional merit, I’m always more interested in the former."}], "child": "696_1\t696_2\t696_3\t696_4"}